{
    "id": "b43155ea-a6cf-4db5-9d2b-d7c6efb34c06",
    "created_at": "2023-01-12T15:02:50.715093Z",
    "updated_at": "2025-03-27T02:16:59.310443Z",
    "deleted_at": null,
    "sha1_hash": "dca167503b4afcbabf10241fd20ae5f33a327c15",
    "title": "2021-02-03 - A Spyware Vendor Seemingly Made a Fake WhatsApp to Hack Targets",
    "authors": "",
    "file_creation_date": "2022-05-28T00:46:33Z",
    "file_modification_date": "2022-05-28T00:46:33Z",
    "file_size": 681804,
    "plain_text": "# A Spyware Vendor Seemingly Made a Fake WhatsApp to Hack Targets\n\n**[vice.com/en/article/akdqwa/a-spyware-vendor-seemingly-made-a-fake-whatsapp-to-hack-targets](https://www.vice.com/en/article/akdqwa/a-spyware-vendor-seemingly-made-a-fake-whatsapp-to-hack-targets)**\n\nHacking. Disinformation. Surveillance. CYBER is Motherboard's podcast and reporting on\nthe dark underbelly of the internet.\n\n[See More →](https://www.vice.com/en/topic/cyber)\nHackers tried to trick iPhone users into installing a fake version of WhatsApp in a potential\nattempt to gather information about them. Technical analyses by both researchers from\ndigital rights watchdog Citizen Lab and Motherboard suggest that this fake version of\nWhatsApp is linked to a specific Italian surveillance company.\n\n\n-----\n\nThe news highlights a sometimes overlooked attack on iPhones: tricking users into installing\nconfiguration files or so-called Mobile Device Management (MDM) profiles, which can then\npotentially push malware onto a target device. As the price of exploits for breaking into\n[iPhones has steadily climbed, other government malware vendors have moved to leveraging](https://www.vice.com/en/article/mby7kq/malware-to-spy-hack-iphones)\nMDM profiles to hack phones.\n\n“I think it is targeted, I don’t think they were trying to spread this around,” Bill Marczak, a\nresearcher from Citizen Lab, part of the Munk School of Global Affairs at the University of\nToronto, told Motherboard.\n\n[Last Tuesday, the security company ZecOps said in a tweet that it had detected attacks](https://twitter.com/ZecOps/status/1354180089244598273)\nagainst WhatsApp users. The company published a specific domain—config5-dati[.]com—\nand an IP address it said were related to the attacks. Then Marczak and fellow Citizen Lab\nresearcher Bahr Abdul Razzak looked into the domain and found others linked to it, including\none that hosted a site that purported to be a page to download WhatsApp. In reality, the site\nattempted to trick visitors into installing what was actually a special configuration file for\niPhones designed to potentially gather information about the victims and send it back to the\nattacker, according to the Citizen Lab researchers.\n\nUsing data from cybersecurity vendors DomainTools and RiskIQ, Motherboard independently\ndiscovered multiple clusters of domains linked to the one publicly shared. The config5dati[.]com domain shared an encryption certificate with other similarly named domains,\nrevealing others such as config4-dati[.]com, config3-dati[.]com, and config6-dati[.]com.\nCitizen Lab searched for other numerical variations of that domain, including config1dati[.]com; Google had preserved a cache of the WhatsApp phishing page on that domain.\n\nA screenshot of the phishing page found by Citizen Lab. (Image: Citizen Lab)\n\n\"To keep in touch with your friends press the 'download' button and follow the instructions on\nthe page,\" the phishing site reads in Italian. The page then instructs visitors how to install a\nconfiguration file via the iPhone's system settings menu. This is not how users install a\nlegitimate version of WhatsApp: usually iPhone users download it from the Apple App Store.\n\nMarczak said this file sends information to the config1-dati server, including the UDID, or\nUnique Device Identifier assigned to each iOS device by Apple; and the IMEI or International\nMobile Equipment Identity, another unique code that identifies cellphones.\n\n\"[The MDM file is] the first bit of the installation process for what is ultimately likely to be a\nfake WhatsApp app containing spyware,\" Marczak said.\n\nCitizen Lab researchers said they could not gather data on the next stage of the attack,\nmeaning it is unclear exactly what other data the hackers would have been able to exfiltrate\nfrom a target device.\n\n\n-----\n\nThe phishing page is designed to look like an official WhatsApp site, with WhatsApp\nbranding and professional graphics laying out the installation process step-by-step. The\nphishing page is not currently online. Citizen Lab shared a copy of the configuration file with\nMotherboard; when opened, the file says it is from \"WhatsApp Inc.\" for \"WhatsApp\nMessenger.\"\n\nWhen presented with a summary of the findings, a WhatsApp spokesperson told\nMotherboard \"We do not ask for these user privileges and people should be very suspicious\nof any app trying to do so.\"\n\n\"To help keep chats safe, we recommend that people download WhatsApp from the app\nstore for their phone's platform. In addition, we may temporarily ban people using modified\nWhatsApp clients we detect to help encourage people to download WhatsApp from an\nauthoritative source,\" the spokesperson added.\n\n\"We strongly oppose abuse from spyware companies, regardless of their clientele. Modifying\nWhatsApp to harm others violates our terms of service. We have and will continue to take\naction against such abuse, including in court,\" the WhatsApp spokesperson said. Facebook\nand WhatsApp are currently suing another spyware vendor, NSO Group, for allegedly\nabusing WhatsApp's infrastructure to deliver NSO's malware to targets.\n\nMotherboard was unable to determine who the fake WhatsApp page was targeting.\n\nApple did not provide a statement.\n\n**_Do you have information about similar attacks? We’d love to hear from you. You_**\n**_can contact Lorenzo Franceschi-Bicchierai securely on Signal at_** **+1 917 257**\n**1382, Wire/Wickr @lorenzofb, or email** **lorenzofb@vice.com. You can contact**\n**_Joseph Cox on Signal on_** **+44 20 8133 5190, Wickr on josephcox, or**\n**_email_** [joseph.cox@vice.com](http://10.10.0.46/mailto:joseph.cox@vice.com)\n\nAfter researching the set of domains, Motherboard found a cluster of other domains that at\none point shared an IP address with the config5-dati[.]com domain, and from there a third set\nthat shared an IP address and followed similar naming conventions. One of these,\ncheck3[.]it, was registered to \"cy4gate srl\", a company with a Rome, Italy address, according\nto WHOIS records. Most of the domains analyzed were registered in Rome according to the\nWHOIS records.\n\nCy4Gate describes itself as a \"Cyber Electronic Warfare & Intelligence\" company on its\nTwitter account. The company develops several products, including Epeius, its solution for\n\"lawful intercept,\" an industry term for hacking and surveillance as a service. In 2017,\nCy4gate appeared before an Italian Senate committee to pitch its surveillance products,\naccording to a document published online. Last year, it made headlines for developing a\n\n\n-----\n\n[product to track COVID-19 infections, which was part of a series of COVID-tracking solutions](https://www.vice.com/en/article/epg9jm/nso-covid-19-surveillance-tech-software-tracking-infected-privacy-experts-worried)\nconsidered at the time by the Italian government, which eventually gave the bid to another\ncompany. Cy4gate is part of the Italian defense contractor Elettronica.\n\nCy4Gate has recently done business with high profile companies such as Fiat Chrysler as\nwell as the United Arab Emirates, according to marketing material Motherboard found online.\n[An Italian media report says Cy4Gate has also sold a product to the U.S. military, although it](https://www.teleborsa.it/News/2021/01/25/cy4gate-fornira-sistemi-avanzati-a-due-enti-militari-in-usa-e-golfo-141.html)\nspecifies it was not the company's Epeius product. Cy4Gate also offers cybersecurity\nproducts.\n\nA screenshot of the login portal found by Citizen Lab. (Image: Citizen Lab)\n\nCitizen Lab also found that an encryption certificate for an IP address associated with the\nconfig1-dati[.]com domain, which displayed the WhatsApp phishing page, mentioned\n\"epeius,\" Cy4Gate's lawful intercept product. Motherboard found mentions of Epeius in\ncertificates connected to IP addresses pointing to more of the config domains too.\n\nThe Citizen Lab researchers also found that the config1-dati[.]com domain at some point\nreturned a login page with a Cy4gate logo and the name Epeius, and shared a screenshot of\nthe portal with Motherboard. The branding matches that of a Epeius logo Motherboard found\nin Cy4Gate marketing material online.\n\nA screenshot of the Epeius marketing material found by Motherboard. (Image: Motherboard)\n\n\"EPEIUS has been designed to address the LEAs (Law Enforcement Agencies)\nrequirements to move from the 'cloud' of IP data flow to a targeted active interception\napproach directly on the target's endpoint like a Mobile phone, a Tablet or a personal\ncomputer,\" [the brochure Motherboard found reads. The marketing material adds that](https://beta.documentcloud.org/documents/20468414-cy4gate-company-profile)\n\"EPEIUS implements a number of innovative techniques to 'infect' a device,\" and that the\nproduct is designed to be configurable depending on the client's mission requirements.\n\n\"Example: if our task is the acquisition of target geolocalization and emails, EPEIUS will\nexecute the pre-established modules,\" the brochure adds. The material adds that EPEIUS is\ndesigned to siphon data before it is encrypted and that data collection \"is implemented\nthrough anonymous and untraceable connections.\" Cy4Gate took the Epeius product to\nmarket in 2019, according to the brochure.\n\nWhen Motherboard shared the domain data with Cy4gate, a company spokesperson said in\nan email that the config domains identified by Citizen Lab researchers and Motherboard are\nnot attributable to the company. The Cy4Gate spokesperson did confirm to Motherboard that\nthe check3[.]it domain belonged to the company.\n\n\"I think it's pretty clearly their product,\" Marczak said.\n\n**_Subscribe to our cybersecurity podcast CYBER,_** **_[here.](https://podcasts.apple.com/us/podcast/cyber/id1441708044)_**\n\n\n-----\n\n## ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX.\n\nBy signing up, you agree to the [Terms of Use and](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/terms-of-use.html) [Privacy Policy & to receive electronic](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/privacy-policy.html)\ncommunications from Vice Media Group, which may include marketing promotions,\nadvertisements and sponsored content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-03 - A Spyware Vendor Seemingly Made a Fake WhatsApp to Hack Targets.pdf"
    ],
    "report_names": [
        "2021-02-03 - A Spyware Vendor Seemingly Made a Fake WhatsApp to Hack Targets.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535770,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653698793,
    "ts_modification_date": 1653698793,
    "files": {
        "pdf": "https://archive.orkl.eu/dca167503b4afcbabf10241fd20ae5f33a327c15.pdf",
        "text": "https://archive.orkl.eu/dca167503b4afcbabf10241fd20ae5f33a327c15.txt",
        "img": "https://archive.orkl.eu/dca167503b4afcbabf10241fd20ae5f33a327c15.jpg"
    }
}