{
    "id": "b43a071c-72df-40c9-b99a-8db6a723c7b2",
    "created_at": "2023-01-12T15:02:17.200078Z",
    "updated_at": "2025-03-27T02:10:49.398839Z",
    "deleted_at": null,
    "sha1_hash": "b45e7c90728c30041e2aa7e3af959a6ee012adf7",
    "title": "2020-05-13 - Access-as-a-Service – Remote Access Markets in the Cybercrime Underground",
    "authors": "",
    "file_creation_date": "2022-05-28T05:03:23Z",
    "file_modification_date": "2022-05-28T05:03:23Z",
    "file_size": 2440066,
    "plain_text": "# Access-as-a-Service – Remote Access Markets in the Cybercrime Underground\n\n**[ke-la.com/access-as-a-service-remote-access-markets-in-the-cybercrime-underground/](https://ke-la.com/access-as-a-service-remote-access-markets-in-the-cybercrime-underground/)**\n\nMay 13, 2020\n\n## Bottom Line Up Front\n\n**Remote Access Markets are automated stores that allow attackers to exchange access**\ncredentials to compromised websites and services. As such, they represent an endless\n**stream of opportunities for attackers; buying access to an organization as a service**\nlowers the skill bar for further exploitation and exposes organizations to a plethora wave of\nonline threats – from ransomware to card skimming.\n\nThis blog will review one prominent Remote Access Market out of the several tracked and\nmonitored by KELA – MagBo. This store is unique in a few different aspects, but mostly in\nvolume of goods: over two years of operations, it featured access to nearly 150,000\n**compromised websites – including financial institutions, government organizations**\n**and critical infrastructure around the world – mostly via selling access to web shell**\nmalware deployed on their servers. KELA advocated that gaining visibility into MagBo, as\nwell as other Remote Access Markets, is a crucial intelligence feed for defenders.\n\n## Background\n\nLike any other industry, the cybercrime sector is also exploring innovative business models,\nadopting technological tools to improve monetization opportunities. In an effort to transform\ncybercrime into a more scalable, lucrative business with a higher ROI, actors focus on\nseveral revenue-generating schemes.\n\nReviewing the current market, we can see two major trends:\n\n**[1. Servitization – actors are gradually adopting a Something-as-a-Service model, instead of](https://www.darkreading.com/vulnerabilities---threats/will-this-be-the-year-of-the-branded-cybercriminal/a/d-id/1336707)**\nstruggling to profit from tutorials, software or digital goods. This is noticeable in the\nprominence of Malware-as-a-Service (especially among ransomware providers), as well as\nother aspects of the cybercrime ecosystem.\n\n**2. Sales Automation – a few years ago, the best way to monetize a product or a service**\nwas posting in a forum and waiting for buyers. Nowadays, cybercriminals are leaning heavily\ninto Autoshops: automated click-to-buy markets that allow a buyer to purchase goods or\nservices without relying on cumbersome human intervention, boosting sales volumes and\nmaking business more scalable.\n\n\n-----\n\nThese have always been popular practices when it comes to the obvious deliverables of\n[cybercrime: Account shops like Slilpp have been peddling millions of brute-forced accounts](https://krebsonsecurity.com/2017/04/how-cybercrooks-put-the-beatdown-on-my-beats/)\n[for years; and up until a couple of months ago, Deer.io was a major player enabling threat](https://krebsonsecurity.com/2020/03/fbi-arrests-alleged-owner-of-deer-io-a-top-broker-of-stolen-accounts/)\nactors to quickly and easily set up dedicated autoshops. Lately, however, more and more\nactors and groups have been investing in autoshops selling more advanced goods; one\n[example is the Genesis Store and the MaaS business model it features, allowing easy](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)\nmonetization of botnet infections.\n\n## Remote Access Markets\n\nA prime example of the more sophisticated actors in the autoshop field are what KELA refers\nto as Remote Access Markets – stores offering access to compromised servers and\n**websites. The** [xDedic RDP store, an infamous market that operated until authorities shut it](https://www.kaspersky.com/blog/xdedic-ii/15147/)\ndown in 2019, was a one-stop-shop for breached servers accessible via Remote Desktop\nConnection protocol, where attackers could buy credentials and immediately gain access to\ncompromised servers. The concept of easily buying remote access can be very appealing to\na wide variety of attackers: from ransomware operators trying to gain foothold within a\n**corporate network to APT actors looking for silent entry point to a target organization,**\nthese markets provide excellent opportunities.\n\nRemote Access, however, can be obtained in various ways – not just over RDP. Threat\nactors are able to abuse content management systems, SSH, etc. to gain access to a\nnetwork asset for multiple use cases – anything from manipulating the content of a website\nhosted on the server to using it as infrastructure for further operations within the corporate\nnetwork.\n\n\n-----\n\nSeveral cybercrime shops and vendors sell different Remote Access products – with a\nvarying level of product quality. Some threat actors offer Remote Access credentials; others\noperate RDP-dedicated autoshops while some use forums to post transactions of web shell\nbatches.\n\nJust last month, a new player, named Odin Shop, launched a store selling several Remote\nAccess items (dubbed “hosting” or “hosts”) among other wares, such as consumer account\nand email lists. The shop has three sections dedicated to remote access – RDP servers,\nwebsite administration panels and web shells – each catering to a different attacker use\ncase.\n\n_Promoting the Odin Shop on Russian hacking forum (left); and a preview of the shop (right)_\n\n\n-----\n\nA new actor, Odin’s reputation and credibility have yet to be determined by cybercrime\ncommunities; it’s possible that trying to be a one-stop-shop, instead of specializing only in\nremote access, would compromise its product quality.\n\nOn the other end of the spectrum lie several stores that specialize only in remote access,\nwith most of them tailoring to one specific access niche. Within these niches operate shops\nthat specialize in RDP access, SSH credentials and more. This blog will focus on one store\nof interest out of the several Remote Access Market monitored by KELA – MagBo, a highly**vetted and reputable autoshop specializing in web shells.**\n\n## It's All About the Access\n\nMagBo is an invite-only automated market for diverse products specializing in Remote\nAccess credentials, and specifically in web shells.\n\n_MagBo’s launch post on a Russian forum_\n\nOfficially launched in early 2018, MagBo has been not only evolving but also growing in\n[volume and variety. Initial reports cited it sells “over 3,000 breached websites”; by late April](https://www.zdnet.com/article/access-to-over-3000-backdoored-sites-sold-on-russian-hacking-forum/)\n**2020, it had over 28,000 servers totaling around $700,000 worth of goods. During our**\nresearch, we were able to track 43,000 unique hostnames posted on MagBo for which we\nhave full details; based on historical data, KELA is able to assess that over time MagBo has\n**offered almost 150,000 distinct compromised websites for sale. These websites include**\nanything from government offices and ministries sold for USD 10,000 a piece to smallbusiness websites offered for a few cents.\n\n[These extensive numbers of compromised servers are mostly accessed via web shells – but](https://www.nsa.gov/News-Features/News-Stories/Article-View/Article/2159419/detect-prevent-cyber-attackers-from-exploiting-web-servers-via-web-shell-malware/)\nnot exclusively. True to its promise to support a wide variety of cybercriminal use cases,\nMagBo offers access via different means. Around 90% of the listings are web shells, while\n\n\n-----\n\n7% and 2% offer Remote Access via compromised CMS and FTP credentials, respectively;\nthe remaining 1% is comprised of a plethora of other access methods – from SSH to hosting\nadmin panels.\n\n_Breakdown of remote access vectors offered on MagBo (May 2020; n = 43,000)_\n\nAccording to KELA’s analysis, between 200 and 400 new compromised servers are\n**added to the market on an average day – making it a fairly active market; the number of**\n**daily transactions is around 200, suggesting the market enjoys steady growth. One reason**\nfor this might be the operation model – MagBo is a decentralized platform serving multiple\nthreat actors who can upload their wares. KELA’s data shows 190 different threat actors\n**currently have** **active listings on the market.**\n\n\n-----\n\nWhile the number of Remote Access items offered on MagBo definitely helps it stand out, it\nis only one of the Killer Features that attract cybercrime actors.\n\n## Killer Feature #1: Transparency of Goods\n\nAs cybercriminals become more sophisticated and develop more niche requirements,\nbusinesses catering to them must keep up. Compared to other sellers of Remote Access –\nspecifically via web shells – MagBo has a distinct advantage: it provides much more\n**information that helps potential buyers evaluate the quality of product.**\n\nFollowing are examples of two web shell vendors associated with Russian cybercrime\ncommunities – one selling access via forum posts, the other operating an autoshop. Neither\nprovides buyers with useful information, like the full DNS of the compromised server, exact\npermissions or other metadata:\n\n\n-----\n\n_Web Shell vendors offering goods missing essential details_\n\n**MagBo, on the other hand, focuses on providing rich server details – from the actual**\nhostname down to the specific permissions an attacker could leverage. Below is a MagBo\nlisting (identifying details redacted by KELA), showing the level of granularity the market\nprovides:\n\n\n-----\n\n_Example of a MagBo listing with a detailed view of a compromised server_\n\nThis detailed list serves not only malicious actors; it also allows defenders to understand the\ntype of operations an attacker might execute on a compromised server. The listing above\nindicates, for example, the “function mail is work” – meaning, an attacker can use it to send\nphishing or spam emails; it also indicates that a malicious actor with access to the shell could\nembed code in the page, serving malicious content or sniffing traffic for credit card skimming\nas part of a [Magecart attack.](https://www.riskiq.com/what-is-magecart/)\n\n\n-----\n\n_MagBo offerings by specific permissions and features_\n\nBased on forum posts made by the market’s admin, maintaining this level of transparency is\na crucial function of MagBo; in a message from January 2018, the admins mentioned an\noption to hide exact DNS names but advised against it:\n\n_MagBo admins advising users against applying the option to hide the full DNS of a compromised server_\n\n## Killer Feature #2: MagBo Backdoor\n\nOnce an actor acquires remote access credentials to a compromised website, they can start\nworking on the actual use case that would serve their purposts; this includes accessing the\nserver and performing actions that would further exploit it. MagBo does more than just\nproviding clients with login credentials – it supplies a backend platform that can be used to\ncarry out the actual attack.\n\n\n-----\n\n**MagBo Backdoor (MBD) is a second stage web shell that interacts with the MagBo**\n**website. An attacker can install it on a compromised server to make the web shell more**\ncompatible with MagBo’s business model. Once running, MBD can be used to perform\n**actions on the server from the MagBo UI: loading malware, running arbitrary code via**\nPHP and more.\n\n\n-----\n\n_The MBD UI featuring the file system of a compromised server (top); and a brief overview of MBD on_\n_MagBo’s FAQ (bottom)_\n\nMBD suggests MagBo aims to be a platform – a one-stop-shop for web shell access\n**and management AND a technology provider. In that sense, it carries on xDedic’s legacy**\n[of helping clients optimize and maintain access to the servers sold on the market.](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07191218/xDedic_marketplace_ENG.pdf)\n\nHowever, actors are slow to adopt MBD; based on data obtained by KELA, only around\n6,000 web shells on the market utilized MBD in May 2020.\n\n\n-----\n\n_Breakdown of web shell types offered on MagBo_\n\n## Remote Access Markets & the Enterprise Defender\n\nCovering the basics of cybercrime threat intelligence – paste sites, traditional markets and\nforums – is crucial for any cybersecurity intelligence practitioner. However, we continue to\n[advocate that tracking automated shops ensures defenders have a unique edge by](https://ke-la.com/one-attackers-trash-is-another-attackers-treasure/)\n**monitoring actual** **corporate assets. The most basic use case here is obvious: if a**\n**cybercrime market sells access credentials to any of your corporate network devices,**\nyou’d probably want to be aware of that ASAP. In monitoring Remote Access Markets, KELA\nhas found multiple instances in which our clients’ assets – from esoteric domains used by\nsubsidiaries up to major servers who are part of production environments – has been posted\nfor sale on a market. Our real-time monitoring and analyst-assisted escalation are\n**crucial to remediate the threat in real time and prevent attackers from further leveraging**\nthe access.\n\nThere is, however, much more that can be done with data obtained from Remote Access\nMarkets. One example can be monitoring your vendors and supply chain, not only your own\nassets, to gain a better understanding of your threat landscape and third-party attacks\nsurface. Another is consuming a list of compromised network assets as high fidelity\n**indicators of compromise; obtaining real-time access to these data streams provides a**\nsupplementary IOCs feed featuring compromised domains. By consuming it directly from the\nsource, you avoid waiting until after the fact, when a domain has been found to be malicious.\n\n\n-----\n\nWhatever a defender chooses to do with Remote Access Markets data – and these\nexamples are just the tip of the iceberg – KELA believes that retaining these feeds is\ninvaluable.\n\nMoreover, MagBo’s apparent success and ongoing investment in technology suggests it’s\nhere to stay – and others are quickly joining: xDedic’s takedown prompted the rise of other\nRDP markets that fill the vacuum while vendors specializing in monetizing SSH credentials\nare gaining traction. The trends of Servitization – providing Access-as-a-Service to be\nleveraged by actors – and automation are on the rise; it’s safe to assume more cybercrime\nenterprises will enter these markets and expand operations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-13 - Access-as-a-Service – Remote Access Markets in the Cybercrime Underground.pdf"
    ],
    "report_names": [
        "2020-05-13 - Access-as-a-Service – Remote Access Markets in the Cybercrime Underground.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535737,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653714203,
    "ts_modification_date": 1653714203,
    "files": {
        "pdf": "https://archive.orkl.eu/b45e7c90728c30041e2aa7e3af959a6ee012adf7.pdf",
        "text": "https://archive.orkl.eu/b45e7c90728c30041e2aa7e3af959a6ee012adf7.txt",
        "img": "https://archive.orkl.eu/b45e7c90728c30041e2aa7e3af959a6ee012adf7.jpg"
    }
}