{
    "id": "b44857ff-5f38-4ead-a6c1-cf7b94c17ce4",
    "created_at": "2023-01-12T15:06:48.259305Z",
    "updated_at": "2025-03-27T02:09:18.400391Z",
    "deleted_at": null,
    "sha1_hash": "85ef080f106457f0fbf3e368d0fa205185d4ed46",
    "title": "2022-03-18 - Analysis of Leaked Conti Intrusion Procedures by eSentire’s Threat Response Unit (TRU)",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:24Z",
    "file_modification_date": "2022-05-29T00:53:24Z",
    "file_size": 2750077,
    "plain_text": "# Analysis of Leaked Conti Intrusion Procedures by eSentire’s Threat Response Unit (TRU)\n\n**[esentire.com/blog/analysis-of-leaked-conti-intrusion-procedures-by-esentires-threat-response-unit-tru](https://www.esentire.com/blog/analysis-of-leaked-conti-intrusion-procedures-by-esentires-threat-response-unit-tru)**\n\nAs defenders, often our only insight into an adversary’s tradecraft is gleaned through an\nanalysis of intrusion artifacts following an incident. The recent leak of Conti and Trickbot\nmaterials offers a glimpse into how the group infiltrated and took control of networks in\nextortion attacks. While the leaked manual and forum are from early to mid-2021, they offer a\nsnapshot of how the group trained and conducted their intrusions. The Conti team likely\nmaintains similar, up-to-date manuals, and knowledge base articles.\n\n## Key Takeaways:\n\nThere is a heavy reliance on Offensive Security Tooling (OST) such as Cobalt Strike,\nMimikatz, Powerview, and known attack techniques throughout the intrusion phases.\nDual-use tools such as 7zip, AnyDesk, Rclone, and living-off-the-land Windows utilities\nhave been used to reduce exposure.\nTooling is augmented with using scripts to facilitate deployment and use. For example,\nCobalt Strike is augmented with using known resources like C2Concealer and scripts\ncompiled from public research.\n\n\n-----\n\n_Figure 1 Forum post recommending various penetration testing utilities._\n\n## Background\n\n[On February 27, 2022, a Twitter account named “ContiLeaks” began posting chat logs](https://twitter.com/ContiLeaks)\nshowing private communications between Conti members. These logs spanned between\nJanuary 2021 and February 2022 and contained thousands of messages between alleged\nConti members. Following this, the ContiLeaks account published additional chat logs from\nJune 2020 to November 2020, an extract of a trickconti-forum, Rocketchat logs, and Trickbot\nand Conti software components among other materials.\n\n[Our Threat Response Unit (TRU), Journalists and](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-i-evasion/) [researchers have dug through the chat](https://www.breachquest.com/conti-leaks-insight-into-a-ransomware-unicorn/)\nlogs and identified key players and organizational structure. The group operates like a\nstructured organization, with team leaders and departments responsible for hiring talent,\nresearch & development, training, and conducting “penetration tests”.\n\nBesides the chat logs, our attention was drawn to intrusion procedures in the form of\nmanuals and knowledge base articles. Like a legitimate organization, Conti maintains\nreference material for ensuring work is done consistently and up to standards.\n\n_Figure 2 Excerpt from leaked Rocketchat logs making a case for a centralized knowledge_\n_base._\n\nTwo sources for intrusion procedures have been identified thus far:\n\n**\"manual_teams_c\"**\n\nTaken from leaked Rocketchat logs from May 2021, helpfully extracted and published\nby [Émilio Gonzalez.](https://github.com/Res260/conti_202202_leak_procedures)\n\n\n-----\n\nAnalysis of the files extracted from the Rocketchat logs showed overlap with the leaked\nConti Playbook from August 2021\n\n**“trickconti-forum”**\n\nPosted by Twitter user ContiLeak on March 1st, 2022 without context.\nForum containing 51 text files of how-to guides for attack procedures and intrusion\nmethods, organized into kill chain phases.\nUser “Rozetka”, who is identified as a team lead in the leaked Rocketchat logs, is\nmentioned heavily throughout the forum posts.\nMost posts were dated February-March 2021.\n\n_Figure 3 August 2020 Rocketchat discussion about team composition and responsibilities._\n\nAdditionally, the forum is mentioned several times in leaked Rocketchat logs.\n\n\n-----\n\n_Figure 4 Rocketchat discussion for_\n\n_\"trickconti\" forum._\n\n## Breakdown by Intrusion Phase\n\n### Reconnaissance\n\nDuring Reconnaissance, threat actors rely on the passive collection of information related to\ntheir target’s internal environment using public domain and reputational databases. This is\n[achieved using open-source tooling such as Sub-Drill and penst-tools[.]com.](https://github.com/Fadavvi/Sub-Drill)\n\n[For active scanning, the Aquatone tool is used to visually inspect websites and servers for](https://github.com/michenriksen/aquatone)\nattack opportunities.\n\n### Initial Access\n\nTo gain initial access, the Conti group leverages techniques that include remote access\nservices and compromised endpoints. The trickconti forum mentions various remote access\nservices from Citrix, SonicWall, FortiGate and Pulse Secure.\n\nTo circumvent multi-factor authentication on VPNs, operators will attempt to intercept MFA\ncodes from compromised email accounts or hijack browser sessions using tokens stolen\nfrom compromised endpoints.\n\n\n-----\n\n_Figure 5 Post from February 2021 discussing browser session hijacking._\n\n### Discovery\n\nOnce operators land on a compromised machine or access the network through VPN, their\nfirst step is to gain situational awareness using tools such as AdFind or Windows command\nline utilities such as net or nltest. AdFind is referenced heavily throughout leaked procedure\ndocumentation and would appear to be the preferred tool as of early 2021. As is a theme\nwith other techniques, the tool is augmented through scripts to expedite data collection.\n\n_Figure 6 Sample output from AdFind tool._\n\nCollected information includes active directory users, computers, Organizational Units (OUs),\ndomain trusts and subnets. The data is written to text files and used in downstream attacks\nor information gathering.\n\nThe Invoke-ShareFinder module from PowerView is also mentioned as a means to\nenumerate network shares.\n\n### Credential Access and Privilege Escalation\n\nThe next step is to steal credentials and escalate their privileges to gain higher-level\npermissions into the system or network. Multiple known techniques are mentioned to fulfill\nthis objective:\n\n[Kerberoasting](https://attack.mitre.org/techniques/T1558/003/)\n\n\n-----\n\n[AS-REP Roasting](https://attack.mitre.org/techniques/T1558/004/)\n[DCSYNC](https://attack.mitre.org/techniques/T1003/006/)\n[Group Policy Preferences](https://attack.mitre.org/techniques/T1552/006/)\n[Password Spray via SMB Bruteforce tool](https://www.shellntel.com/blog/2016/7/7/smart-smb-brute-forcing)\n[PowerUpSQL](https://github.com/NetSPI/PowerUpSQL)\nNetlogon (CVE-2020-1472)\n\nKerberoast and AS-REP roast attacks are a known techniques for abusing weaknesses in\nKerberos tickets to extract hashes for offline cracking. The Kerberos attacks are executed\n[using either the Rubeus tool or](https://github.com/GhostPack/Rubeus) [Invoke-Kerberoast PowerShell module. Kerberoasting is](https://powersploit.readthedocs.io/en/latest/Recon/Invoke-Kerberoast/)\nmentioned several times in the procedure documents and is an early intrusion step\nconducted through a VPN session using a compromised account or through a compromised\nworkstation using Cobalt Strike. Cracked keys can then facilitate privilege escalation\nactivities.\n\n_Figure 7 Instructions for executing a Kerberoast and AS-REP Roast attack using the Rubeus_\n_tool._\n\n### Persistence & Command and Control\n\nOnce the threat actors have successfully escalated their privileges, the next priority is to\nmaintain their foothold into the environment and controlling compromised systems to look\nnormal and avoid detection. The trickconti forum contains instructions for establishing\npersistence through a mix of backdoor malware, webshells and remote access software. The\nmost common tools mentioned in the guide include:\n\n**[Anchor Backdoor: A sophisticated backdoor believed to be developed by the Trickbot](https://services.global.ntt/en-us/insights/blog/trickbot-variant-communicating-over-dns)**\nauthors that uses the DNS protocol for communication and is delivered through\nTrickbot installations. Anchor is believed to be developed by the Trickbot authors.\n**[Ngrok: A utility commonly abused to tunnel traffic between internal hosts and](https://attack.mitre.org/software/S0508/)**\nattackers. The guide provides instructions for registering an account on\n[http://ngrok.com and a script to automate deployment. The script (Install_ngrok.ps1)](http://ngrok.com/)\nautomates downloading both Ngrok and Non-Sucking Service Manager (NSSM) to the\ntarget machine, installs Ngrok as a service and configures it to listen on port 3389\n(RDP). The utility is subsequently used to tunnel remote desktop traffic to the host from\noutside the network/firewall boundary.\n\n\n-----\n\n**TOR Backdoor: This is used in a similar fashion to Ngrok. Using a PowerShell script**\n[(BackdoorNew), a TOR (The Onion Router) client and OpenSSH are downloaded to](https://www.virustotal.com/gui/file/ee97ab55c7f1f2954cf366f9880b5a5f93012272a4b1a904d182bc10c69dc940/content)\nthe system and installed as services using NSSM. This configuration is presumably\nused to create an outbound connection over TOR from which the operator can tunnel\ninto the host.\n**Exchange Webshell: The trickconti forum contains a detailed guide on deploying**\nExchange webshells for persistence. Their steps to plant a webshell in Exchange are\nas follows:\n\n1. Connect to the Exchange server.\n2. Identify public facing directories such as C$\\Program Files\\Microsoft\\Exchange\n\n_Server\\V14\\ClientAccess\\owa\\auth and test access from the outside._\n3. Modify the webshell’s timestamp to match surrounding files.\n4. Retest the webshell connection from the outside.\nThe guide was posted February 5, 2021 and predates the disclosure of ProxyLogon\nExchange vulnerabilities in March 2021. It does not indicate Exchange exploits were\nused and instead relied on stolen credentials to connect to Exchange servers and\ndeploy webshells. It’s likely this guide was updated at a later point to incorporate the\n[ProxyLogon exploit. A copy of the webshell can be found here.](https://www.virustotal.com/gui/file/0c2c22d67f7e3cc26046e946cf3d48a94ce6936a9ac92d4e8ef1285011b15924?nocache=1)\n**Remote Access Software (AnyDesk): AnyDesk Remote access software is among a**\n[known list of remote access software abused by Conti operators to remotely access](https://michaelkoczwara.medium.com/conti-ransomware-group-cobalt-strike-c2-analysis-rdp-persistence-cc535d35eaba)\ncompromised systems. The trickconti forum contains instructions for deploying\nAnyDesk to systems using a script:\n\n_Figure 8 Snippet of AnyDesk installation script._\n**IIS Patch Backdoor: This is mentioned, but not elaborated on.**\n\n### Targeting Administrators\n\n\n-----\n\nThis is a critical step, as not only do administrator accounts provide access to more sensitive\nsystems, but their workstations also contain a wealth of information about the organization’s\nIT infrastructure. This guide appears identical to what was included in the leaked Conti\nplaybook in August 2021.\n\nThe trickconti forum contains a page aptly called “Hunt Administrator” which describes in\ndetail how to identify and rank administrative network users.\n\n_Figure 9 Snippet of forum post titled \"Hunt Administrator\"_\n\nInformation about administrators is obtained using output from the AdFind tool (executed as\npart of initial network discovery) or using Windows utilities through a Cobalt Strike session.\nExample commands include:\n\nnet group “domain admins” /domain\nnet user potential_admin /domain\n\nThis data is then manually inspected and validated. Operators are instructed to look for\nindicators such as group membership, department or job title. Results are validated by\nchecking the account status/last logon time and LinkedIn if needed.\n\n_Figure 10 Guidance on validating active administrator accounts._\n\n\n-----\n\n_Figure 11 Sample_\n\n_output from net command included in the post for demonstration purposes._\n\n[Once administrator accounts are identified, PowerSploit’s Find-DomainUserLocation is used](https://powersploit.readthedocs.io/en/latest/Recon/Find-DomainUserLocation/)\nto identify systems where the account is logged in. The guide instructs operators to remotely\nextract files from admin workstations using impersonation tokens and either the net Windows\nutility or Cobalt Strike’s file browser. It clearly warns the operator against deploying a Cobalt\nStrike beacon directly to the system to avoid raising alarms.\n\nStandard user directories such as OneDrive or Documents are reviewed for files of interest\nsuch as password lists. Application folders (AppData\\Local and AppData\\Roaming) are\nchecked for custom configurations. Browser history and login data from Chrome, Edge and\nFirefox are extracted for useful information such as the location of backup and virtualization\nservers. Local Outlook data files are extracted for further analysis.\n\n### Exfiltration\n\nThe next step is to exfiltrate the data from the organization’s network by packaging it using\ncompression and encryption to avoid detection. In addition to using the TOR backdoor tool,\nthe guide mentioned two other tools:\n\n\n-----\n\n**FileZilla: Used by deploying a portable version to compromised hosts and exfiltrating**\ndata over SFTP (port 22). Additionally, FileZilla can be used to connect to the\ncompromised host through an established TOR tunnel.\n**Rclone: A command line utility for backing up data to cloud services. Unfortunately, the**\ntool has been co-opted by ransomware groups such as Conti for exfiltrating data to\nservices such as Mega[.]nz. The trickconti forum contains a procedure document for\nconfiguring the utility and using it to exfiltrate data from compromised systems. These\ninstructions mirror closely what was revealed in the Conti Playbook leak from 2021.\n\n_Figure 12 Rclone instructions._\n\n### Inhibit Recovery\n\nDestroying or encrypting backups is typically a late-stage action performed prior-to or during\nthe encryption stage. Doing so inhibits recovery options for the victim organization, giving\nConti the upper hand in negotiations. Backups can also be targeted for data theft. The\ntrickconti forum mentions various backup solutions including:\n\nSynology Active Backup for Business\nStorageCraft ShadowProtect SPX\nVeeam\n\nIn general, operators are instructed to identify backup software from browsing history,\nrunning processes, authentication logs, etc. Stolen credentials lists, such as hashes taken\nfrom NTDS, and account lists are checked for possible backup service accounts containing\ncommon string identifiers for a given backup solution. Once obtained, credentials for backup\naccounts are used to access and modify backups to inhibit recovery. For more information,\nsee [https://www.advintel.io/post/backup-removal-solutions-from-conti-ransomware-with-love.](https://www.advintel.io/post/backup-removal-solutions-from-conti-ransomware-with-love)\n\n_Figure_\n\n_13 Guidance on picking out account tied to backup services_\n\n\n-----\n\nThe forum also contained a post on recovering passwords from Veeam backup servers.\n\n_Figure 14 Veeam password recovery steps._\n\n[This is a known technique documented as early as 2019 in Veeam’s forums and explained in](https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html)\ndetail [here. It’s likely this step is taken to obtain credentials not tied to active directory, such](https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/)\n[as other backups or infrastructure. A 2020 post on Veeam’s forums by a victim of](https://forums.veeam.com/veeam-backup-replication-f2/saved-passwords-in-veeam-vulnerable-t64964.html)\nransomware describes a similar scenario where non-AD credentials stored in Veeam were\nused to access secondary backup storage devices. Advice is given to operators to disable\nnotifications on backup servers to avoid detection:\n\n_Figure 15 Disabling notifications on backup servers._\n\nFinally, the trickconti forum contains instructions for targeting virtualized infrastructure from\nVMware and Microsoft. Once administrative access is achieved to virtualization platforms,\nsnapshots and backups are destroyed and servers are locked.\n\nIn a May 2021 post, a user describes the process for accessing vSphere and identifying\nbackups for virtual machines by examining the license level and authentication logs from\nbackup services:\n\n\n-----\n\n_Figure 16 vSphere instructions._\n\nFigure 17 Additional guidance on encrypting backups tied to virtual machines.\n\n_Figure 18 Hyper-V Instructions._\n\n## How eSentire is Responding\n\n\n-----\n\nOur Threat Response Unit combines intelligence gleaned from research, security incidents,\nand the external threat landscape to create actionable outcomes for our customers. We are\ntaking a holistic response approach to combat modern ransomware by deploying\ncountermeasures across the ransomware attack cycle using:\n\nKnown-precursor malware\nLiving-off-the-Land techniques\nDiscovery techniques and domain reconnaissance (listing admins, domain trusts, etc.)\nOffensive security tools such as Cobalt Strike\nCredential access techniques (kerberoasting, ZeroLogon, Mimikatz)\nLate-stage TTPs (Credential extraction from DCs, PsExec/WMIC/BITS Admin code\ndeployment)\nFinal stages (Volume Shadow Copy deletion, ransomware artifacts, archiving tools,\ndata staging)\n\nOur detection content is backed by investigation runbooks, ensuring our SOC cyber analysts\nrespond rapidly to any intrusion attempt tied to known ransomware tactics, techniques, and\nprocedures. In addition, our Threat Response Unit closely monitors the ransomware threat\nlandscape and addresses capability gaps and conducts retroactive threat hunts to assess\ncustomer impact.\n\n## Recommendations from eSentire’s Threat Response Unit (TRU)\n\nWhile the TTPs used by adversaries grow in sophistication, they lead to a limited set of\nchoke points at which critical business decisions must be made. Intercepting the various\nattack paths utilized by the modern threat actor requires actively monitoring the threat\nlandscape, developing, and deploying endpoint detection, and the ability to investigate logs &\nnetwork data during active intrusions.\n\nWe recommend implementing the following controls, mapped to specific tactics leveraged by\nthreat actors, to help secure your organization against the most impactful techniques\nmentioned in the leaked Conti documents:\n\n**Initial Access**\n\nRequire multi-factor authentication (MFA) on all remote access, including VPN.\nMonitor remote access logs for unusual activity.\nProtect endpoints against compromise using AV and/or an Endpoint Detection\nResponse (EDR) product.\nMonitor for discovery tools and commands on protected endpoints.\nPatch known vulnerabilities in software and operating systems.\n\n**Credential Access & Privilege Escalation**\n\n\n-----\n\nProtect against Kerberos attacks by:\n\nUsing AES Kerberos encryption over RC4 and use complex, lengthy passwords\non service accounts.\nLimiting service accounts to minimal required privileges and privileged groups\nsuch as Domain Administrators.\nMonitor for privileged account creation.\n\n**Compromise Administrators**\n\nProtect administrator workstations from compromise using anti-malware and endpoint\ndetection and response products.\nAvoid storing cleartext credentials in files.\nUse strong passwords for password managers and avoid saving them directly on the\nsystem.\nEnforce “least privilege” to limit access to the minimum required for the employee’s\nspecific job function.\n\n**Exfiltrate Data**\n\nEnsure EDR agents are deployed to key targets of ransomware actors including file\nshares, email servers and domain controllers.\nMonitor for data staging and exfiltration utilities such as 7zip, Rclone and FileZilla\nMonitor for software used to proxy or tunnel network traffic, including TOR clients (The\nOnion Router), NGROK and SSH clients (where not expected).\n\n**Inhibit Recovery**\n\nImplement regular backups and store them offline.\nHarden administrative interfaces to backup services.\n\nIf you’re not currently engaged with a Managed Detection and Response provider, we highly\nrecommend you partner with us for security services in order to disrupt threats before they\nimpact your business.\n\n[Want to learn more? Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n### Skip To:\n\nKey Takeaways:\nBackground\nBreakdown by Intrusion Phase\nHow eSentire is Responding\nRecommendations from eSentire’s Threat Response Unit (TRU)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-18 - Analysis of Leaked Conti Intrusion Procedures by eSentire’s Threat Response Unit (TRU).pdf"
    ],
    "report_names": [
        "2022-03-18 - Analysis of Leaked Conti Intrusion Procedures by eSentire’s Threat Response Unit (TRU).pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536008,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653785604,
    "ts_modification_date": 1653785604,
    "files": {
        "pdf": "https://archive.orkl.eu/85ef080f106457f0fbf3e368d0fa205185d4ed46.pdf",
        "text": "https://archive.orkl.eu/85ef080f106457f0fbf3e368d0fa205185d4ed46.txt",
        "img": "https://archive.orkl.eu/85ef080f106457f0fbf3e368d0fa205185d4ed46.jpg"
    }
}