{
    "id": "b44dc8ed-45de-4886-9fba-1cecacd17a85",
    "created_at": "2023-01-12T15:06:22.967454Z",
    "updated_at": "2025-03-27T02:08:46.533231Z",
    "deleted_at": null,
    "sha1_hash": "e04f0fd55e637acbdabc9eccd307ef05d52219fb",
    "title": "2020-06-17 - Die erste Cyberwaffe und ihre Folgen",
    "authors": "",
    "file_creation_date": "2022-05-27T21:30:12Z",
    "file_modification_date": "2022-05-27T21:30:12Z",
    "file_size": 288397,
    "plain_text": "# Die erste Cyberwaffe und ihre Folgen\n\n**[spiegel.de/netzwelt/web/die-erste-cyberwaffe-und-ihre-folgen-a-a0ed08c9-5080-4ac2-8518-ed69347dc147](https://www.spiegel.de/netzwelt/web/die-erste-cyberwaffe-und-ihre-folgen-a-a0ed08c9-5080-4ac2-8518-ed69347dc147)**\n\n2008: Der damalige iranische Präsident Mahmoud Ahmadinejad besichtigt die\nUrananreicherungsanlage Natanz\n\nFoto: HO/ AFP\nAm 17. Juni 2010 schrieb Sergey Ulasen in holprigem Englisch ein Stück\nComputergeschichte. \"Current malware should be added to very dangerous category\", heißt\n[es in seinem kaum 20 Zeilen langen Eintrag auf der Website von VirusBlokAda, der kleinen](http://anti-virus.by/en/tempo.shtml)\nweißrussischen Antivirus-Firma, für die er damals arbeitete.\n\nUlasen beschreibt darin eine bis dahin unbekannte Schadsoftware, die sich über USB-Sticks\nverbreitet und einen neuartigen Trick beherrscht, um sich unbemerkt auf Windows-Systemen\nzu installieren. \"Es hat ungefähr eine Woche gedauert, bis wir ihn identifiziert hatten\", sagt er\nheute.\n\n\n-----\n\nSergey Ulasen\n\nFoto: Kaspersky Lab\nWas Ulasen damals nicht wusste: Er hatte gerade die erste echte Cyberwaffe der\nGeschichte in die Öffentlichkeit gezerrt - ein Meisterwerk, das noch viele weitere\nÜberraschungen in sich trug. Es sollte Monate dauern, bis das wahre Potenzial der\nSchadsoftware ansatzweise klar wurde. Bekannt wurde sie unter dem Namen Stuxnet.\n\n\"Überrascht\" sei er damals gewesen, sagt er, und \"wahrscheinlich verängstigt\". Denn ihm\nwar zumindest eines sehr schnell klar: Dieser Installationstrick, den er durchschaut hatte,\nwürde garantiert auf jedem Windows-PC der Welt funktionieren. Denn Microsoft selbst hatte\nkeine Ahnung von der Schwachstelle in seinem Betriebssystem. Zero-Day-Exploit wird so\netwas genannt.Hunderte Millionen Computer wären dagegen machtlos gewesen.\n\nEin Exploit ist eine Schadsoftware, die eine Sicherheitslücke ausnutzt. Ist diese\nSicherheitslücke dem betroffenen Hersteller nicht bekannt, spricht man von einem Zero-DayExploit: Der Hersteller hat null Tage Zeit, eine Abwehrmaßnahme zu entwickeln, bevor ein\nAngriff Erfolg hat.\n\nDie Schwachstelle selbst wird dementsprechend als Zero-Day bezeichnet. Alternative\nSchreibweise: 0day.\n\nDas Wissen um solche Schwachstellen, insbesondere aber fertige Exploits, wird gehandelt.\nHersteller bieten Sicherheitsforschern im Rahmen sogenannter Bug-Bounty-Programme\nGeld für neu gefundene Lücken an, damit sie ihre Produkte updaten können, bevor es einen\n\n\n-----\n\nAngriff gibt. Geheimdienste und Strafverfolger kaufen oder entwickeln ebenfalls Exploits, um\nVerdächtige überwachen zu können. Und auch Kriminelle kaufen und verkaufen Exploits, um\nmit ihrer Hilfe zum Beispiel Erpressungstrojaner (Ransomware) zu verteilen.\n\nDenn nicht immer ist ein Zero-Day-Exploit gleichbedeutend mit der Fähigkeit, ein Gerät\nkomplett fremdsteuern zu können. Verschiedene Sicherheitsmaßnahmen zumeist auf\nBetriebssystemebene, die wie Trennwände funktionieren, verhindern das. Mitunter sind also\nganze Ketten von Exploits nötig, um ein Opfer wirklich zu hacken und etwa ihre Daten\nabzugreifen oder weitere Schadsoftware nachladen und installieren zu können. Die\nberühmte Malware Stuxnet zum Beispiel beinhaltete gleich vier Zero-Day-Exploits.\n\nDie Preise variieren je nach Aufwand, Ziel (Browser, Betriebssysteme, Schnittstellen,\nAnwendungen etc.) und Wirkung stark. Manche werden für einige Hundert oder Tausend\n[Dollar gehandelt, andere sind Händlern wie Zerodium zufolge bis zu 2,5 Millionen Dollar](https://zerodium.com/program.html)\nwert.\n\nStuxnet, stellte sich später heraus, beinhaltete gleich vier Zero-Day-Exploits. Aber die\nSchadsoftware sollte nicht möglichst viele Rechner befallen, sondern ganz bestimmte: die in\nder iranischen Urananreicherungsanlage bei Natanz. Dort sollte sie still und heimlich die\nZentrifugen sabotieren und so das iranische Atomprogramm behindern.\n\n[\"Operation Olympic Games\" war der Codename für das gemeinsame Unterfangen der USA](https://www.nytimes.com/2012/06/01/world/middleeast/obama-ordered-wave-of-cyberattacks-against-iran.html?pagewanted=all&_r=0)\nund Israels, das nie offiziell bestätigt wurde. Doch die Enttarnung des Sabotage-Programms\nbeendete die Operation - und wird gleichzeitig als Beginn der Cyberkrieg-Ära verstanden.\n\n\"Das vielleicht wichtigste Ereignis des ganzen Jahrzehnts\"\n\nCostin Raiu, Kaspersky\n\nCostin Raiu, Leiter des Bereichs Forschung und Entwicklung bei Kaspersky Lab, wo auch\nUlasen heute arbeitet, nennt dessen Fund \"das vielleicht wichtigste Ereignis des ganzen\nJahrzehnts\". Es habe \"so ziemlich alles in der IT-Sicherheitsindustrie verändert\", sagt er im\nGespräch mit dem SPIEGEL: \"Die Art, wie wir über Bedrohungen nachdenken, die Art, wie\nwir gegen Cyberattacken kämpfen, was möglich ist und was in den kommenden Jahren\npassieren wird.\"\n\nAuch für Ralph Langer war Stuxnet \"der große Knalleffekt\", wie er im Gespräch sagt. Der\nBeweis, dass etwas, wovor Sicherheitsexperten lange gewarnt hatten, \"keine Fiktion ist\".\nLangners Firma gehört zu den wenigen, die sich auf die Cybersicherheit von großen\nProduktionsanlagen und kritischen Infrastrukturen spezialisiert haben.\n\n[Zusammen mit zwei Kollegen hatte Langner 2010 die Payload von Stuxnet entschlüsselt,](https://www.langner.com/wp-content/uploads/2017/08/Stuxnet-und-die-Folgen.pdf)\njene Teile des Codes, die jenseits von Windows-PCs wirksam wurden - nämlich in den von\nSiemens entwickelten Industriesteuerungsanlagen (Industrial Control Systems, kurz ICS) in\nNatanz.\n\n\n-----\n\nDas Geniale an Stuxnet war, dass es sich um eine Cyberwaffe handelte, die völlig autonom\narbeitet\", sagt Langner. \"So etwas hatten wir vorher noch nie gesehen. Insbesondere in der\nfrühen Version gab es keine Möglichkeit, sie fernzusteuern. Und obwohl wir uns schon\ndamals Tag und Nacht mit diesen Dingen beschäftigt und uns mögliche Angriffsszenarien\nausgedacht hatten, gegen die wir unsere Kunden beschützen wollten, wären wir nie im\nLeben auf die abgefahrenen Dinge gekommen, die wir dann im Stuxnet-Code gesehen\nhaben.\"\n\n\"Damals hat man von einem Weckruf gesprochen\"\n\nRalph Langner\n\nZum Beispiel sei die Software in der Lage gewesen, zunächst normale Sensorwerte in der\nbefallenen Industriesteuerungsanlage aufzuzeichnen und sie anschließend immer wieder\nabzuspielen. Dadurch sah für die interne Logik der Anlage alles normal aus, und Stuxnet\nkonnte die automatisierten Sicherheitsvorrichtungen – die sogenannten Safety-Steuerungen\n– umgehen. \"Die aber braucht man überall dort, wo einem Dinge richtig um die Ohren fliegen\nkönnen\", sagt Langer, \"wo es Explosionen geben oder wo toxische Substanzen freigesetzt\nwerden könnten. Ein menschlicher Bediener wäre nicht in der Lage, schnell genug zu\nreagieren.\"\n\nStuxnet ist ein Computerwurm, der vermutlich 2007 erstmals eingesetzt und 2010 entdeckt\nwurde. Die sich selbst verbreitende Schadsoftware (Malware) wurde eingesetzt, um\nunbemerkt das damalige iranische Atomprogramm zu behindern, insbesondere die\nUrananreicherungsanlage bei Natanz. Dort beschädigte Stuxnet letztlich Zentrifugen. Es gab\njedoch mehrere Versionen von Stuxnet, die sich in ihren Eigenschaften und Fähigkeiten\nunterschieden. Entdeckt wurde zuerst eine neuere, aggressivere Variante, die sich weiter\nausgebreitet hatte als beabsichtigt.\n\nStuxnet gilt als erste bekannt gewordene Malware, die physische Schäden anrichtete. Sie\nwar zudem komplexer als alles, was IT-Sicherheitsforscher bis dahin je gesehen hatten.\nNach der Entdeckung dauerte es Monate, bis sie annähernd verstanden hatten, was Stuxnet\nkonnte. Auf welchen Systemen Stuxnet aktiv wurde und auf welchen nicht, wie sie sich die\nMalware versteckte und selbst löschte, wie sie den Sprung von einem Windows-Computer in\neine Steuerungsanlage für Zentrifugen schaffte, mit der sich nur wenige Spezialisten\nauskennen, und wie sie dort ihre Spuren verschleierte, all das verblüffte die Experten damals\nzutiefst.\n\nOffiziell bestätigt wurde es nie, aber es gilt als wahrscheinlich, dass die USA und Israel für\ndie Entwicklung von Stuxnet verantwortlich waren. Der US-Journalist David E. Sanger von\nder \"New York Times\" schrieb, das Programm sei von US-Präsident George-W. Bush\nautorisiert und in der Amtszeit seines Nachfolgers Barack Obama weiterentwickelt worden.\n\n\n-----\n\nKim Zetter, die Autorin des Standardwerks zu Stuxnet, Countdown to Zero-Day, hält den\nEinsatz von Stuxnet für mäßig erfolgreich. Der Fortschritt von Irans Atomprogramm sei damit\nnur geringfügig verlangsamt worden.\n\nDoch auf den vermeintlichen großen Knall folgte Stille. \"Damals hat man von einem Weckruf\ngesprochen\", sagt Langner, \"komischerweise ist man aber sehr schnell wieder in den\nTiefschlaf übergegangen. Ich kann das eigentlich auch keinem Unternehmen und keinem\nPolitiker verdenken. Denn in den vergangenen zehn Jahren ist in dem Bereich so gut wie\nnichts passiert.\" Nachgewiesene Cyberangriffe auf Industrieanlagen habe es nur \"ungefähr\neine Handvoll\" gegeben. \"Aber die Risiken sind nicht verschwunden, sondern werden immer\ngrößer, weil immer mehr digitalisiert wird.\"\n\nRalph Langner\n\nFoto: Christian Science Monitor/ Getty\nIndustriesteuerungsanlagen seien immer noch so schlecht geschützt wie damals, \"das ist\nFakt\". Langner weiß, wie es in dieser Hinsicht in entsprechenden Unternehmen aussieht und\nfür wie viele Sicherheitslücken sie anfällig wären: \"Das sind Zahlen, da schlackern Sie mit\nden Ohren.\"\n\nEr will den Herstellern der Steuerungsanlagen aber \"keinen Vorwurf machen\". Deren\nKunden, also die Betreiber von Industrieanlagen, hätten schlicht \"keine Bereitschaft gezeigt,\nfür zusätzliche Cybersicherheit tiefer in die Tasche zu greifen\". Das liege an der Komplexität\nund dem Ausmaß des Problems: \"Stellen Sie sich einen großen Automobilhersteller vor. Bei\ndem geht es ja nicht um drei Industriesteuerungen, sondern vielleicht um 30.000. Wenn Sie\nda zum Beispiel Mehrkosten von 1000 Euro pro Stück ansetzen, kommt einiges zusammen.\"\nAußerdem kämen höhere Wartungskosten dazu, und die Netzwerktechnik rund um die\nSteuerungsanlagen sei ebenfalls inhärent unsicher.\n\n\n-----\n\nErschwerend komme hinzu, dass in der Industrie häufig noch PCs mit veralteten WindowsVersionen wie XP oder Windows 7 eingesetzt würden, für die es keine Sicherheitspatches\nmehr gibt. Und selbst wenn es sie gibt, würden sie manchmal ignoriert, sagt Langner, weil so\nein Update mitunter dafür sorge, dass eine Industrieanwendung nicht mehr läuft. Auch\nkönnten die Anlagen nicht mal eben neu gestartet werden wie ein Desktop-PC, denn sie\nmüssten 24 Stunden am Tag laufen.\n\nAber ausgehend von \"einer statistisch orientierten Risikobetrachtung\", sagt Langner, sei die\nGefahr eben gering, da steckten Unternehmen ihr Geld vielleicht lieber in verbesserten\nBrandschutz oder in den Umweltschutz. Er wolle auch keine Angst schüren. Wichtig sei,\ndass Cybersicherheit nicht als Projekt innerhalb einiger Monate erledigt und abgehakt\nwerden könne, sondern langfristig und top-down, ausgehend von der Chefetage,\nangegangen werden müsse.\n\n## \"Ich hatte große Angst\", sagt ein IT-Experte\n\nAngebote gibt es reichlich, auch wenn die meisten auf die klassische IT von Unternehmen\nausgelegt sind, nicht auf die OT, die Operations Technology. Die Branche ist mittlerweile so\ngroß, dass es jährlich aktualisierte Listen der Top-500-Cybersicherheitsfirmen gibt. Große\nAnbieter wie Kaspersky haben nach Stuxnet spezialisierte Teams aufgebaut, die sich\nausschließlich um die Analyse besonders ausgeklügelter Angriffe kümmern. Ihre Gegner\nsind mitunter Geheimdienste oder andere staatlich unterstützte Organisationen – was zu\nvormals undenkbaren Kollisionen führt.\n\nMitte 2012 zum Beispiel entdeckten Costin Raiu und sein Team die Spionagesoftware Flame\n[auf Rechnern von iranischen Kunden – und darin eine Verwandtschaft zu Stuxnet, die auf](https://securelist.com/back-to-stuxnet-the-missing-link/33174/)\neine Zusammenarbeit der Entwickler hindeutete. \"Wir sahen damals Anzeichen dafür, dass\nunsere Arbeit bestimmten Leuten nicht gefiel\", sagt er. \"Während einer Konferenz in\nMünchen verfolgten uns Menschen von der Hotellobby bis zu unseren Zimmern und taten\ndabei so, als würden sie telefonieren. Es gab mehrere solche Vorfälle. Vielleicht wollte man\nuns nur Angst einjagen, aber das hat funktioniert: Ich hatte große Angst.\"\n\nFür eine Weile habe das Team dann aufgehört, diese Art Forschung zu betreiben und\nentsprechende Erkenntnisse zu verkünden. \"Wir befürchteten physische Vergeltung gegen\nuns und unsere Familien\", sagt der IT-Experte. Solche Ängste gab es in der Branche noch\nnicht, als Hacker entweder profitgetriebene Kriminelle oder ideologisch motivierte Aktivisten\nwaren.\n\nBis heute sind nicht alle Rätsel rund um Stuxnet gelöst. Noch immer suchen manche nach\nAntworten. So hat Kim Zetter, die Autorin des Standardwerks zu Stuxnet, \"Countdown to\nZero-Day\", erst im vergangenen September erfahren, dass es der niederländische\nGeheimdienst war, der einen Mann in die Urananreicherungsanlage Natanz einschleusen\nkonnte, um die erste Version von Stuxnet auf einem präparierten USB-Stick ins Innere zu\n\n\n-----\n\nbringen. Was aus ihm wurde, ist öffentlich nicht bekannt. Costin Raiu sagt: Stuxnet wird sich\nbald wie Paläontologie anfühlen. Aber so wie manche Menschen gern Dinosaurier\nerforschen, untersuchen andere eben Cyberdinosaurier.\"\n\nFrüher oder später wird es weitere Stuxnets geben, spätestens im Kriegsfall, da ist sich\nRalph Langner sicher. Zu Friedenszeiten könnten es mittlerweile aber auch Kriminelle\nschaffen, Schadcode für ICS zu entwickeln, glaubt er. Und es gebe dabei einen wichtigen\nUnterschied zu regierungsgestützten Angriffen, wie es Stuxnet war: \"Bei einem politisch oder\nmilitärisch motivierten Cyberangriff möchten Sie beim ersten Schuss treffen, sonst verpufft\ner. Kriminelle hingegen können es sich leisten, zu experimentieren. Es kann ihnen egal sein,\nob ihr Schadcode entdeckt und analysiert wird. Die Betreiber von Industrieanlagen können\nsich nicht von heute auf morgen schützen.\"\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-17 - Die erste Cyberwaffe und ihre Folgen.pdf"
    ],
    "report_names": [
        "2020-06-17 - Die erste Cyberwaffe und ihre Folgen.pdf"
    ],
    "threat_actors": [
        {
            "id": "d7c5a1bf-85c9-4d2f-bdbd-1455f5f2ae65",
            "created_at": "2022-10-25T16:07:23.978074Z",
            "updated_at": "2025-03-27T02:02:10.059972Z",
            "deleted_at": null,
            "main_name": "Operation Olympic Games",
            "aliases": [
                "GOSSIPGIRL"
            ],
            "source_name": "ETDA:Operation Olympic Games",
            "tools": [
                "Stuxnet",
                "W32.Stuxnet"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535982,
    "ts_updated_at": 1743041326,
    "ts_creation_date": 1653687012,
    "ts_modification_date": 1653687012,
    "files": {
        "pdf": "https://archive.orkl.eu/e04f0fd55e637acbdabc9eccd307ef05d52219fb.pdf",
        "text": "https://archive.orkl.eu/e04f0fd55e637acbdabc9eccd307ef05d52219fb.txt",
        "img": "https://archive.orkl.eu/e04f0fd55e637acbdabc9eccd307ef05d52219fb.jpg"
    }
}