{
    "id": "b46c3b60-1f82-4e3a-8a66-9124c27132b6",
    "created_at": "2023-01-12T15:04:01.992638Z",
    "updated_at": "2025-03-27T02:16:26.311464Z",
    "deleted_at": null,
    "sha1_hash": "7ca5ee6391cfcb7616d2968dbbaa1f41e5c5ca49",
    "title": "2022-06-01 - SMSFactory Android Trojan producing high costs for victims",
    "authors": "",
    "file_creation_date": "2022-06-09T10:28:11Z",
    "file_modification_date": "2022-06-09T10:28:11Z",
    "file_size": 1174228,
    "plain_text": "# SMSFactory Android Trojan producing high costs for victims\n\n**blog.avast.com/smsfactory-android-trojan**\n\n[Jakub Vávra 1 Jun 2022](https://blog.avast.com/author/jakub-v%C3%A1vra)\n\nAvast protected more than 165,000 people across the globe from this threat within a year.\n\nAvast has been tracking a wide-spread malware campaign consisting of TrojanSMS\nmalware, which we are calling SMSFactory. SMSFactory sneakily siphons money from\nvictims around the world, including Russia, Brazil, Argentina, Turkey, Ukraine, US, France\nand Spain, among others, by sending premium SMS and making calls to premium-rate\nphone numbers. These numbers appear to be part of a conversion scheme, where the SMS\nincludes an account number, identifying who should receive the money for the messages\nsent. Undetected, it can rack up a high phone bill, up to $7 per week or $336 per year,\nleaving an unpleasant surprise for victims. One version we found is also capable of\nextracting victims' contact lists, likely to spread the malware further.\n\nWe have dubbed the malware SMSFactory due to its functions, as well as class names in its\ncode, one of which is called SMSFactory.\n\n[According to my research, the malware is spreading through malvertising, push notifications,](https://www.avast.com/c-what-is-malvertising-how-to-stop-it)\nand alerts displayed on sites offering game hacks, adult content, or free video streaming\nsites, serving the malware disguised as an app in which users can access gaming, videos, or\n\n\n-----\n\nadult content. Once installed, the malware hides itself, making it nearly impossible for victims\nto detect what is causing the charges on their phone bills.\n\nA series of websites have been set up with the purpose of spreading and remote control of\nthe malware. Avast has protected more than 165,000 Avast users from SMSFactory in the\npast year (May 2021-May 2022), with the highest number of users protected in Russia,\nBrazil, Argentina, Turkey and Ukraine.\n\n## Silently sending $ignals\n\nThe bad actors behind SMSFactory rely on malvertising to drive their campaign. Malvertising\nrefers to the misuse of adverts to redirect users to sites with malware payloads, and can\noften appear on websites providing free streaming of films and TV shows, adult content, or\ntorrent aggregators, but may occasionally appear on mainstream sites as well.\n\nThe redirect in this case leads to a website such as the one in the screenshot below. The\nuser is prompted to download a file that is made to resemble the site the user was redirected\nfrom. This can, for example, be a game hack app, an adult content app, a free video\nstreaming app or similar.\n\n\n-----\n\n_Redirect landing page with dynamic name visible in the top right corner_\n\n_Examples of different names for the same SMSFactory app_\n\n\n-----\n\nOnce the user clicks on Download, the malicious app is downloaded. As it comes from a\nthird party source, the website prompts the user to ignore Android’s inbuilt Play Protect\nwarning and go ahead with the installation.\n\n_Screenshots showing how SMSFactory prompts the user to disable/ignore Play Protect in_\n_order to install the malware_\n\nOnce installed, the user is met with a welcome screen. Clicking accept will activate the app’s\nmalicious behavior. The app then presents the user with a basic menu of videos, adult\ncontent and games that don’t work or aren’t available most of the time.\n\n\n-----\n\n_Example of an SMSFactory app upon installation_\n\n## Ready or not, here come the charges!\n\nSMSFactory uses several tricks to stay on the victim’s device and remain undetected. It has\na blank icon and it is able to hide its presence from the user by removing its app icon from\nthe home screen. Additionally, it comes with no application name, making it more difficult for\nthe user to discover the offending application and remove it. It is evident the malware relies\non the user forgetting the app on their phone.\n\n\n-----\n\n_A blank icon and lack of app name are used to disguise the apps_\n\nOnce hidden, the malware communicates with a pre-set domain. It sends a unique ID\nallocated to the device, its location, phone number, operator information, and model of the\nphone. If the actors behind this campaign deem the victim’s device usable, the domain sends\nback instructions to the device. This will either be a list of phone numbers to which the\nmalware will send premium SMS or a specific number which the application will attempt to\ncall.\n\nBoth will result in excessive charges for the victim. The exact amount depends on the\ncommand sent by the actors behind SMSFactory — in our testing, we’ve seen a daily $1\ncharge through ten SMS messages sent, which can rack up to $28 per month. Assuming the\n\n\n-----\n\nvictims don t notice or forget the app is installed, this could result in an extortionate phone\nbill.\n\n_A portion of the permissions used by SMSFactory: SMS/MMS permissions as well as_\n_CALL_PHONE are used to siphon money away from victims by sending messages and_\n_making calls to premium rate numbers_\n\nDue to the nature of the malware, the user may be unaware of the financial damage until\nthey receive their phone bill. SMSFactory could accrue significant charges in the meantime\nand it may be difficult for the user to identify the culprit due to the app hiding itself.\n\n## Different Factory versions\n\nSMSFactory also appears to have several different versions with added features, which have\nappeared alongside this recent campaign. One such variation may create a new admin\naccount on the Android device, making it potentially difficult to remove. Another variant\ncopies the contact list of the victim and extracts it, likely to be used for further spread of the\nmalware. Some versions redirect users to sites in order to get them to install another\nSMSFactory app onto their device.\n\n\n-----\n\n_Only a few SMSFactory samples contain a short ‘Conditions’ page_\n\nThere are visual differences between these versions of SMSFactory as well. Older versions\nthat posed as game hacks had an icon, while the newer versions removed the icon and app\nname altogether. The terms and conditions in the screenshot above, mentioning the\nbackground premium SMS/calls, are only present in one version of the malware I found,\nother versions don’t include this information at all.\n\n## What makes SMSFactory unique\n\n[In contrast to recent TrojanSMS campaigns such as UltimaSMS or Grifthorse, the vector for](https://blog.avast.com/premium-sms-scam-apps-on-play-store-avast?_ga=2.141934834.1544338798.1654072429-419931177.1654072429)\nspreading SMSFactory varies significantly. Its stealth features such as lack of app icon and\nname wouldn’t be allowed on the Google Play Store, hence the bad actors have resorted to\na reasonably intricate network of sites for delivery and subsequent communication with the\nmalware.\n\nAnother departure is the intro screen that doesn’t require the entry of a phone number to\ninitiate the malware’s functions, contrary to previous premium SMS malware. Where previous\nTrojanSMS campaigns subscribe the victim to premium services, SMSFactory simply sends\na series of SMS to premium numbers to extract money\n\n\n-----\n\n## Affected users\n\nDespite its lack of presence on the Play Store, according to our data, we have protected over\n165,000 Avast users from the malware in the last year alone. As evidenced by the high\nnumber of impacted users coupled with new versions recently surfacing, it is fair to say that\nSMSFactory is an active malware and likely to continue its spread.\n\n_Map showing number of Avast users protected from SMSFactory in the last year_\n\n_(May 2021 - May 2022)_\n\nAs can be seen in the map above, the regions in which we protected the most Avast users\nfrom SMSFactory within the last year are located in Russia, Brazil, Argentina, Turkey, and\nUkraine. It appears that SMSFactory isn’t targeting a specific region or country, its aim is to\nspread to as many devices as possible.\n\n## Tips on how to avoid mobile malware like SMSFactory\n\n**Stick to official app stores. SMSFactory highlights the importance of using verified**\napp stores to install applications. Third party stores or unknown sources may contain\nmalware and aren’t blocked by an authority, such as Google.\n\n**Install an** **[antivirus on your mobile device. This is especially important if you want to](https://www.avast.com/free-antivirus-download)**\ninstall apps from unofficial sources. You can also be protected from malicious websites\nthis way. Antivirus acts as a safety net, protecting even the most careful users.\n\n\n-----\n\n**Remain vigilant. It s important to remain cautious when downloading new apps,**\nespecially apps advertised in short and catchy videos, or through push notifications in\nthe browser.\n\n**Disable or limit premium SMS with your carrier. While there are legitimate uses for**\npremium SMS, recent SMS malware campaigns highlight the importance of control\nover potential charges on a user’s phone contract. Disabling premium SMS features or\nat least setting a limit significantly negates the potential impact of TrojanSMS\ncampaigns. This step is especially important on children’s phones.\n\n[Want to know more? Explore the list of SMSFactory IOCs.](https://github.com/avast/ioc/tree/master/SMSFactory)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-01 - SMSFactory Android Trojan producing high costs for victims.pdf"
    ],
    "report_names": [
        "2022-06-01 - SMSFactory Android Trojan producing high costs for victims.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535841,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1654770491,
    "ts_modification_date": 1654770491,
    "files": {
        "pdf": "https://archive.orkl.eu/7ca5ee6391cfcb7616d2968dbbaa1f41e5c5ca49.pdf",
        "text": "https://archive.orkl.eu/7ca5ee6391cfcb7616d2968dbbaa1f41e5c5ca49.txt",
        "img": "https://archive.orkl.eu/7ca5ee6391cfcb7616d2968dbbaa1f41e5c5ca49.jpg"
    }
}