{
    "id": "b47b0168-00db-41f3-a634-76e792ba6152",
    "created_at": "2023-01-12T14:58:57.660404Z",
    "updated_at": "2025-03-27T02:06:06.042013Z",
    "deleted_at": null,
    "sha1_hash": "08d317e01366a13db79ad7b94fc35230da54d18f",
    "title": "2019-08-23 - Ransomware Attacks Are Testing Resolve of Cities Across America",
    "authors": "",
    "file_creation_date": "2022-05-28T00:39:22Z",
    "file_modification_date": "2022-05-28T00:39:22Z",
    "file_size": 178305,
    "plain_text": "# Ransomware Attacks Are Testing Resolve of Cities Across America\n\n**[nytimes.com/2019/08/22/us/ransomware-attacks-hacking.html](https://www.nytimes.com/2019/08/22/us/ransomware-attacks-hacking.html)**\n\nManny Fernandez, David E. Sanger, Marina Trahan Martinez August 22, 2019\n\nContinue reading the main story\nHOUSTON — At the public library in Wilmer, Tex., books were checked out not with the\nbeeps of bar code readers but with the scratches of pen on notebook paper. Out on the\nstreet, police officers were literally writing tickets — by hand. When the entire computer\nnetwork that keeps the small town’s bureaucracy afloat was recently hacked, Wilmer was\nthrown into the digital Dark Ages.\n\n“It’s weird,” said Jennifer Dominguez, a library assistant. “We’ve gone old school.”\n\n[This has been the summer of crippling ransomware attacks. Wilmer — a town of almost](https://www.nytimes.com/2021/04/27/us/dc-police-hack.html)\n5,000 people just south of Dallas — is one of 22 cities across Texas that are simultaneously\n[being held hostage for millions of dollars after a sophisticated hacker, perhaps a group of](https://www.nytimes.com/2019/08/20/us/texas-ransomware.html)\nthem, infiltrated their computer systems and encrypted their data. The attack instigated a\nstatewide disaster-style response that includes the National Guard and a widening F.B.I.\ninquiry.\n\nMore than 40 municipalities have been the victims of cyberattacks this year, from major cities\nsuch as Baltimore, Albany and Laredo, Tex., to smaller towns including Lake City, Fla. Lake\nCity is one of the few cities to have [paid a ransom demand — about $460,000 in Bitcoin, a](https://www.nytimes.com/2019/07/07/us/florida-ransom-hack.html)\ncryptocurrency — because it thought reconstructing its systems would be even more costly.\n\n\n-----\n\nIn most ransomware cases, the identities and whereabouts of culprits are cloaked by clever\ndigital diversions. Intelligence officials, using data collected by the National Security Agency\nand others in an effort to identify the sources of the hacking, say many have come from\nEastern Europe, Iran and, in some cases, the United States. The majority have targeted\nsmall-town America, figuring that sleepy, cash-strapped local governments are the least likely\nto have updated their cyberdefenses or backed up their data.\n\nBeyond the disruptions at local city halls and public libraries, the attacks have serious\nconsequences, with recovery costing millions of dollars. And even when the information is\nagain accessible and the networks restored, there is a loss of confidence in the integrity of\nsystems that handle basic services like water, power, emergency communications and vote\ncounting.\n\n“The business model for the ransomware operators for the past several years has proved to\nbe successful,” said Chris Krebs, the director of the Department of Homeland Security’s\nCybersecurity and Infrastructure Security Agency, which has the primary responsibility for\naiding American victims of cyberattacks.\n\n“Years of fine-tuning these attacks have emboldened the actors, and you have seen people\npay out — and they are going to continue to pay out,” he said, despite warnings from the\nF.B.I. that meeting ransom demands only encourages more attacks.\n\nIn Georgia alone in recent months, the tally of victims has been stunning: the city of Atlanta.\nThe state’s Department of Public Safety. State and local court systems. A major hospital. A\ncounty government. A police department for a city of 30,000 people.\n\nThe Department of Public Safety was hit particularly hard and continues to feel the effects of\nan attack discovered on July 26. The computer network remains down. Every device,\nincluding laptops and tablets, is being examined and reconfigured. Much of the email system\ncannot be entered. State troopers are unable to use computer systems in their patrol cars;\nlike their colleagues in Wilmer, they are writing out tickets.\n\n_[[When Ransomware Cripples a City, Who’s to Blame? This I.T. Chief Is Fighting Back]](https://www.nytimes.com/2019/08/22/us/florida-ransomware-hacking-it.html)_\n\nAn F.B.I. warning sent to key players in the American cyberindustry on Monday left unclear\nwho was responsible for the malware afflicting Texas, a strain first seen in April and named\nSodinokibi. On Wednesday, the Department of Homeland Security issued a warning about a\n“Ransomware Outbreak,” cautioning cities and towns to “back up your data, system images\nand configurations” and keep them offline. It urged them to update their software —\nsomething Baltimore had failed to do.\n\nRansomware is hardly new, but it is in fashion.\n\n\n-----\n\nA decade ago the most prevalent type of cybercrime was intellectual property theft — the\nstealing of industrial designs or military secrets. The American-Israeli attacks on Iran’s\nnuclear centrifuges brought a different kind of attack to the fore: destruction of infrastructure,\nwhich has taken many forms in recent years. But ransomware is different because it does not\ndestroy data or equipment. It simply locks it up, making it inaccessible without a complex\nnumeric key that is provided only to those who pay the ransom.\n\nImage\nTwo Iranian hackers were charged in November in connection with a ransomware attack that\ntargeted hospitals and cities including Atlanta.Credit...Jose Luis Magana/Associated Press\nTwo years ago such attacks were still relatively rare. But now they are far more targeted, and\nas companies and towns have shown an increased willingness to pay ransoms, criminals\nhave turned to new and more powerful forms of encryption and more ingenious ways of\ninjecting the code into computer networks. Only this summer did the United States begin to\nsee multiple simultaneous attacks, often directed at government websites that are illdefended.\n\nIn the 22 Texas attacks, according to several experts who have been called in, the pathway\nappeared to be through a once-trusted communications channel often used by law\nenforcement agencies, and managed by a private systems-management firm. Getting inside\na channel shared by so many Texas localities meant the hackers had to target only one\nsystem, which ushered them into municipal networks across the state. Once inside, it was\nfairly easy to deploy software that encrypts a town’s data.\n\nFearing the worst, cities like Lake City, Fla., have bought cyberinsurance, and an insurer paid\nmost of its ransom this summer. But some experts think that is only worsening the problem.\nKimberly Goody, a manager of financial crimes analysis for FireEye, a major cybersecurity\nfirm, said she expected in the future to “see some evidence that there is specific targeting of\norganizations that have insurance.” FireEye has responded to twice as many ransomware\nattacks this year compared with 2018, she said.\n\nAccording to government and private experts, the ransomware business is now proving so\nlucrative that the hackers are pouring some of their profits back into their own research and\ndevelopment, making their attacks more precise, and more wily.\n\n“We are seeing more ransomware attacks because they work,” said Eli Sugarman, who\ndirects the Hewlett Foundation’s cybersecurity program. “Cities are struggling to secure their\ncomplex and oftentimes outdated systems, and when attacked some choose to pay.” And, he\nnoted, there is “notoriety that comes from each successful attack.”\n\nWhen companies are hit with ransomware attacks they often cover it up. But cities cannot —\nas Atlanta learned in March 2018, in one of the most serious cyberattacks against an\nAmerican municipality. Attackers demanded roughly $51,000 in Bitcoin but, according to The\n[Atlanta Journal-Constitution, the city refused to pay the ransom. A document leaked to local](https://www.ajc.com/news/confidential-report-atlanta-cyber-attack-could-hit-million/GAljmndAF3EQdVWlMcXS0K/)\n\n\n-----\n\nnews outlets showed that responding to the attack could cost the city $17 million. At the time,\nMayor Keisha Lance Bottoms called the attack “a hostage situation,” and threat researchers\nworking on the response blamed a hacking crew called SamSam.\n\nTwo Iranians, Faramarz Shahi Savandi and Mohammad Mehdi Shah Mansouri, were\n[indicted on a charge in that attack last year, and there has been no major recurrence of](https://www.justice.gov/opa/pr/two-iranian-men-indicted-deploying-ransomware-extort-hospitals-municipalities-and-public)\nSamSam attacks since. But new, more targeted malware has appeared.\n\n[The hackers who disabled Baltimore city computers in May demanded about $76,000 in](https://www.nytimes.com/2019/05/22/us/baltimore-ransomware.html)\nBitcoin to release the city’s files and allow employees to regain access to their computers.\nThe mayor, Bernard Young, said the city would not pay the ransom, in part because there\nwas no guarantee the files would be unlocked.\n\nIn the nearly four months since, the city has brought systems back online one by one,\nspending more than $5.3 million on computers and contractors brought on to help recover\nfrom the attack. An [early estimate put the combination of lost revenue and city expenditures](https://www.baltimoresun.com/maryland/baltimore-city/bs-md-ci-ransomware-email-20190529-story.html)\nat more than $18 million.\n\nLester Davis, a spokesman for the mayor, said some lost revenue had been recouped and\nthat it was impossible to quantify how much money the city lost by lack of productivity and\nmissing payments. Baltimore issued water bills in recent weeks for the first time since the\n[hacking, meaning many residents are facing payments three times as much as normal.](https://www.baltimoresun.com/politics/bs-md-ci-water-bills-ransomware-20190805-55aw3ugpnja3rmskbs76t4256a-story.html)\n\nFive states — California, Connecticut, Michigan, Texas and Wyoming — appear to have laws\nthat refer specifically to “ransomware” or computer extortion, although other states have laws\nthat prohibit extortion and computer crimes such as malware or computer trespass,\naccording to the National Conference of State Legislatures.\n\nBecause most of the ransomware laws have been in place for only a few years, prosecutors,\ncourt officials and lawmakers say prosecutions have been nearly nonexistent.\n\nImage\nMunicipal records in a vault in Lake City, Fla., which paid a ransom of about $460,000\nbecause reconstructing its systems might have been more expensive.Credit...Eve Edelheit\nfor The New York Times\nSteve Stafstrom, House Chairman of the Connecticut General Assembly’s Judiciary\nCommittee, said the state had enacted its ransomware law in 2017.\n\nWhile no one in the state has been charged with the crime, Mr. Stafstrom said the law gave\nprosecutors the ability to pursue either traditional extortion charges or those specifically\nrelated to ransomware. Those convicted would face up to three years in prison.\n\nThe coordinated attack in Texas began on Friday morning. State officials said a “single threat\nactor,” which could be a group, was behind the cyberattack, but they declined to elaborate or\ndiscuss details about how the virus spread, referring questions to the F.B.I. office in Dallas,\n\n\n-----\n\nwhich also declined to release details of its investigation.\n\nFour of the 22 towns have a total of about 31,000 residents. Such small city governments,\nwhich often use motley collections of vintage software and lack the budget and sophistication\nfor strong cyberdefense, have become a favorite target for ransomware attacks.\n\nLast year, hackers based in Ukraine hit Allentown, Pa., a city of 121,000 residents, with a\nmalware package that shut down the city government’s computers for weeks. No explicit\nransom demand was made, but the attack played out like many that target cities, said\nMatthew Leibert, Allentown’s longtime chief information officer.\n\nWhen an Allentown city employee took a laptop with him while traveling, it missed software\nupdates that might have blocked the malware. The employee unwittingly clicked on a\nphishing email, and when he returned to the office, the malware spread rapidly.\n\nThe attack cost about $1 million to clean up, Mr. Leibert said. Improved defenses are costing\nAllentown about $420,000 a year, squeezing the city’s budget. He said one frustration was\nthe scattershot targeting that happened to hit Allentown. “There are warehouses of kids\noverseas firing off phishing emails,” Mr. Leibert said.\n\nAlthough some of the Texas towns’ computer systems are now back online, others are being\nrestored by teams of state and federal cybersecurity experts and investigators, including\nthose with the National Guard in Texas. In Wilmer, a team of National Guard specialists\narrived Friday, dressed in T-shirts in the August heat and using the police station as its\nheadquarters. They continue to work restoring the network and recovering data.\n\nIn Kaufman, located more than 30 miles southeast of Dallas, city employees were forced to\nconduct business manually instead of through computers. City staff members used their\ncellphones because the phone system was disabled.\n\nMike Slye, Kaufman’s city manager, said he was not permitted to discuss details of the\nattack, including how it was discovered.\n\nSuch a response is typical in the aftermath of small-town cyberattacks. Some local leaders\nare embarrassed, while others fear that by discussing the attack, they will invite future ones\nor will expose a weakness in their cyberdefenses.\n\nOfficials in Wilmer hoped to have the city’s systems fully operational in two to three weeks.\nThe mayor, Emmanuel Wealthy-Williams, issued a statement as well.\n\nIt was neatly handwritten, on notebook paper.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-08-23 - Ransomware Attacks Are Testing Resolve of Cities Across America.pdf"
    ],
    "report_names": [
        "2019-08-23 - Ransomware Attacks Are Testing Resolve of Cities Across America.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535537,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653698362,
    "ts_modification_date": 1653698362,
    "files": {
        "pdf": "https://archive.orkl.eu/08d317e01366a13db79ad7b94fc35230da54d18f.pdf",
        "text": "https://archive.orkl.eu/08d317e01366a13db79ad7b94fc35230da54d18f.txt",
        "img": "https://archive.orkl.eu/08d317e01366a13db79ad7b94fc35230da54d18f.jpg"
    }
}