{
    "id": "b48fb22a-7af1-4700-823c-8e564dba967a",
    "created_at": "2023-01-12T15:08:27.348081Z",
    "updated_at": "2025-03-27T02:17:23.315452Z",
    "deleted_at": null,
    "sha1_hash": "1a3e9ff8ef70ccb5f9337375840163de211a5468",
    "title": "2020-06-16 - ELF Malware Analysis 101- Linux Threats No Longer an Afterthought",
    "authors": "",
    "file_creation_date": "2022-05-28T15:51:19Z",
    "file_modification_date": "2022-05-28T15:51:19Z",
    "file_size": 363319,
    "plain_text": "# ELF Malware Analysis 101: Linux Threats No Longer an Afterthought\n\n**[intezer.com/blog/linux/elf-malware-analysis-101-linux-threats-no-longer-an-afterthought](https://intezer.com/blog/linux/elf-malware-analysis-101-linux-threats-no-longer-an-afterthought)**\n\nJune 16, 2020\n\nWritten by Avigayil Mechtinger - 16 June 2020\n\n## Get Free Account\n\nJoin Now\n\n**Introduction**\n\nLinux has a large presence in the operating systems market because it’s open-sourced,\nfree, and software development oriented—meaning its rich ecosystem provides developers\neasy access to many different artifacts. Linux is the predominant operating system for Web\nservers, [IoT,](https://myupdatesystems.com/iot-operating-system-linux-takes-lead-in-iot-market-keeping-80-market-share/) [supercomputers, and the public cloud workload. Although Linux holds only two](https://itsfoss.com/linux-runs-top-supercomputers/)\npercent of the desktop market share in comparison to the 88 percent share held by\nWindows, Linux desktop security should not be neglected, evidenced by our discovery of\n[EvilGnome in July 2019.](https://www.intezer.com/blog/linux/evilgnome-rare-malware-spying-on-linux-desktop-users/)\n\n\n-----\n\nLinux is practically everywhere but low Linux threat detection is pervasive across the\nantivirus industry, encouraging attackers to target this operating system aggressively in\nrecent years. Researchers have disclosed highly sophisticated ELF malware, proving\nattackers are increasingly adding Linux malware to their arsenal. Currently, there aren’t\nenough companies hunting for and publishing IOCs and other information about the latest\nLinux threats. There are many undiscovered threats on this operating system and we\nexpect more threats will be exposed over time as Linux continues to gain in popularity. It’s\ncrucial that security researchers have the ability to analyze and understand Linux malware\nas part of their evolving skillset.\n\nWe initiated this training to make practical ELF malware analysis more accessible. This\nmulti-part series will provide you with practical knowledge and tools for effective ELF\nmalware analysis. You will gain a better understanding of the ELF format and learn how to\nanalyze ELF files using static and dynamic methods. Also, we will present useful analysis\n[tools and practice malware analysis hands on. After this series you will be able to analyze](https://www.intezer.com/intezer-analyze/)\nan ELF file, determine if it’s malicious, and classify the threat.\n\nBefore diving into technical ELF analysis practices, this post will serve as an introduction to\nthe ELF malware world. We will review the ELF threat landscape, explain how a Linux\nmachine is initially infected with malware, and elaborate why it’s important for you as a\nsecurity researcher or malware analyst to gain ELF analysis skills.\n\n**The Linux Threat Landscape**\nThe Linux threat landscape is heavily concentrated with DDoS botnets and crypto-miners.\nIt’s much more complex than that, however, home to more sophisticated threats developed\nby APTs and other cybercrime groups. In 2019, our researchers documented over 20\ninstances of previously undiscovered Linux threats. Those threats included large scale\ncrypto-mining campaigns, botnets, ransomware, and nation-state sponsored attacks.\n\nThe following Linux threats are just some of the examples that have been documented by\nthe research community:\n\n[QNAPCrypt – Ransomware campaign targeting Linux file storage servers. This](https://www.intezer.com/blog/linux/seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/)\n[campaign was later attributed by our researchers to FullofDeep, a Russian cybercrime](https://www.intezer.com/blog/ransomware/russian-cybercrime-group-fullofdeep-behind-qnapcrypt-ransomware-campaigns/)\ngroup.\n[Cloud Snooper – RAT found on Linux servers by researchers at Sophos. The threat](https://www.sophos.com/en-us/medialibrary/PDFs/technical-papers/sophoslabs-cloud-snooper-report.pdf)\nwas identified on Amazon Web Services EC2 instances and applied by using different\ntools to bypass security measures. Researchers believe the attack was conducted by\nan APT due to its toolset and complexity.\n[Winnti – Backdoor tied to the Winnti Umbrella group was discovered on the systems](https://medium.com/chronicle-blog/winnti-more-than-just-windows-and-gates-e4f03436031a)\nof a German pharmaceutical company named Bayer. Winnti group is a cluster of\nChinese government-sponsored activities which contain shared goals and resources\nincluding attacking tools. An in-depth research on this malware was conducted by\n[Chronicle. It’s the first Winnti Linux variant exposed in the wild.](https://medium.com/chronicle-blog/winnti-more-than-just-windows-and-gates-e4f03436031a)\n\n\n-----\n\n[HiddenWasp – RAT targeting Linux servers. It s composed of a rootkit, a trojan, and](https://www.intezer.com/blog/linux/hiddenwasp-malware-targeting-linux-systems/)\nan initial deployment script. At the time of discovery by our researchers, the malware\nwas undetected despite using code from various open-source projects such as Mirai\nand the Azazel rootkit. There is evidence that HiddenWasp is related to a Chinese\nAPT.\n[EvilGnome – Linux desktop backdoor implant with connections to Russia’s](https://www.intezer.com/blog/linux/evilgnome-rare-malware-spying-on-linux-desktop-users/)\nGamaredon Group. The malware has many functionalities including file stealing, the\nability to capture desktop screenshots, audio recording, and module expansion.\n[Dacls – RAT tied to Lazarus APT group reported by 360 Netlab. Researchers found](https://blog.netlab.360.com/dacls-the-dual-platform-rat/)\nboth ELF and PE versions of this malware. This is Lazarus’s first exposed Linux\nmalware.\n\n[#Dacls](https://twitter.com/hashtag/Dacls?src=hash&ref_src=twsrc%5Etfw) [#RAT, the first](https://twitter.com/hashtag/RAT?src=hash&ref_src=twsrc%5Etfw) [#Lazarus](https://twitter.com/hashtag/Lazarus?src=hash&ref_src=twsrc%5Etfw) [#malware that targets](https://twitter.com/hashtag/malware?src=hash&ref_src=twsrc%5Etfw) [#Linux](https://twitter.com/hashtag/Linux?src=hash&ref_src=twsrc%5Etfw)\n[deviceshttps://t.co/1Pz7DcxOlU#securityaffairs](https://t.co/1Pz7DcxOlU) [#hacking …](https://twitter.com/hashtag/hacking?src=hash&ref_src=twsrc%5Etfw)\n\n[— Security Affairs (@securityaffairs) December 18, 2019](https://twitter.com/securityaffairs/status/1207391694485897218?ref_src=twsrc%5Etfw)\n\nManusCrypt – RAT tied to Lazarus group. This malware was reported mainly targeting\nWindows. Just recently a Linux version of this malware was found, similar to the\n[ManusCrypt variant F PE malware reported by the US CERT in May 2020.](https://www.us-cert.gov/ncas/analysis-reports/ar20-133a)\n\n[1/3]\n[🆕 Linux version of #Lazarus's](https://twitter.com/hashtag/Lazarus?src=hash&ref_src=twsrc%5Etfw) [#ManusCrypt variant F. Its PE version was](https://twitter.com/hashtag/ManusCrypt?src=hash&ref_src=twsrc%5Etfw)\nreported by the [@USCERT_gov in May 2020https://t.co/Bejr1XJ4Ms](https://twitter.com/USCERT_gov?ref_src=twsrc%5Etfw)\n\n->> [pic.twitter.com/osVtPZDreW](https://t.co/osVtPZDreW)\n\n— Intezer (@IntezerLabs) [June 16, 2020](https://twitter.com/IntezerLabs/status/1272915284148531200?ref_src=twsrc%5Etfw)\n\n[MESSAGETAP – Infostealer discovered by FireEye on a telecommunications](https://www.fireeye.com/blog/threat-research/2019/10/messagetap-who-is-reading-your-text-messages.html)\ncompany’s Linux servers. These servers operate as a Short Message Service Center\n(SMSC), which routed SMS messages to recipients. The malware was designed to\nsteal SMS traffic and it was also tied to the Winnti group.\n\nLinux threats are not just established on the risk of a malware taking advantage of a victim’s\ncomputing resources. They also consist of harmful and intrusive malware that can cause\ndamage to a victim’s private domains.\n\n**How does ELF Malware Infect Systems?**\nUnlike desktops, where phishing is a common method of infection, attackers looking to\ninfiltrate servers and IoT platforms can’t rely on end users to install malware on their behalf.\nThere’s no user interaction with browsers and email accounts, which makes phishing\nattacks practically irrelevant in these environments. This means a malware’s entry point to\nthe system has to be much more targeted. Here are the main attack vectors used to infect\nnon-desktop Linux machines:\n\n\n-----\n\n1. Vulnerability exploit: attackers will search for exploitable and unpatched publicly\n\nfaced components in order to access systems. As an example, the attacker behind\nthe [NOTROBIN backdoor exploited CVE-2019-19781, a vulnerability in Citrix](https://www.fireeye.com/blog/threat-research/2020/01/vigilante-deploying-mitigation-for-citrix-netscaler-vulnerability-while-maintaining-backdoor.html)\n[NetScaler, to spread the malware. The Asnarok trojan infection was initiated after the](https://news.sophos.com/en-us/2020/04/26/asnarok/)\nattacker discovered and exploited a zero-day (SQL injection remote code execution)\nin Sophos XG firewalls. Misconfigured services can also serve as an entry point for\nattackers. [Kinsing malware was spread after the attacker took advantage of](https://blog.aquasec.com/threat-alert-kinsing-malware-container-vulnerability)\nmisconfigured open Docker Daemon API ports.\n\nAttackers have been targeting the Sophos XG Firewall – using a zero-day\n[#exploit to drop the Asnarok #malware on vulnerable](https://twitter.com/hashtag/exploit?src=hash&ref_src=twsrc%5Etfw)\n[appliances.https://t.co/Aa0ml2fnZo](https://t.co/Aa0ml2fnZo)\n\n[— Threatpost (@threatpost) April 27, 2020](https://twitter.com/threatpost/status/1254807558205911040?ref_src=twsrc%5Etfw)\n\n2. Use of valid credentials: default software credentials or compromised credentials.\n\nThere are different methods in which attackers can steal passwords, including\npassword spraying, credential stuffing, and local discovery. Researchers believe the\nCloud Snooper infection was initiated by an attacker accessing the servers through\nSSH, which is protected with password authentication.\n3. Trusted relationships abuse: attackers can leverage entry to third party\n\norganizations that have direct access to the victim’s systems. These organizations\nmay have limited access to the victim’s infrastructure in which they maintain but can\nexist in the same network. For example, an attacker can breach an IT services\ncontractor to then target its clients after gaining valid credentials to these\norganizations.\n\n**Linux Malware is Off the Radar**\nIt’s not only new and sophisticated Linux malware which remain fully undetected by security\nvendors, but also common ones. Mirai is a prime example. Mirai is a DDoS botnet whose\nsource code was released to the wild and many botnets variants are now based on this\ncode. All that was required for an attacker to bypass detection using this particular Mirai\nsample was to make a few signature changes by obfuscating the file’s strings.\n\n\n-----\n\nThis sample was uploaded to VirusTotal in March and had zero detections. Since then,\n[we’ve published a blog post which discusses the effectiveness of code reuse analysis vs.](https://www.intezer.com/blog/linux/evasion-techniques-dissected-mirai-case-study/)\nsignature-based detection for detecting this malware and other Linux threats. To this day,\n[the file’s VirusTotal report lists only one detection.](https://www.virustotal.com/gui/file/1fc49503c92bce012cc9210a0490fb3657ff9177d342ce61a86dbabd530b7a15/detection)\n\nWhen it comes to investigating ELF malware, the current antivirus solutions are not reliable.\nThat’s one of the reasons why it’s important to add analyzing ELF files to your skillset.\n\nIf you want to learn more about why traditional solutions do not detect ELF properly, check\nout [this webinar profiling the Linux threat landscape.](https://www.youtube.com/watch?v=c2IChPlYgHE)\n\n**The Challenge with ELF File Analysis**\nSo you have a suspicious ELF file that you want to analyze? Where do you start?\n\nThe internet is full of information about PE file analysis and there are also various easy-touse tools and tutorials. However, when searching for information about ELF analysis, one\ncan easily get lost. The shortage of relevant and unified information about analysis\nmethodology, verdict determination, and malware evasion techniques, together with the lack\nof up-to-date open source tools can be frustrating.\n\nWe can list at least six publicly available sandboxes which support Windows PE files.\nHowever, currently there is no online sandbox solution available for executing ELF. The few\n[Linux sandboxes out there—Limon,](https://github.com/monnappa22/Limon) [detux, and](https://github.com/detuxsandbox/detux) [LiSa—require creating a sandbox instance](https://github.com/danieluhricek/LiSa)\nand aren’t actively maintained. In this series we will present you with relevant ELF analysis\n[tools for performing both static and dynamic analysis.](https://www.intezer.com/blog/linux/elf-malware-analysis-101-initial-analysis/)\n\n**Conclusion**\nLinux is used broadly and the threat is both real and emerging. Winnti and Lazarus are just\na few examples of APT groups that have recently been documented using ELF in their\nmalware toolset. Due to the lack of ELF malware visibility, poor detection from security\nvendors, and the shortage of relevant publicly available resources about ELF malware, we\nbelieve there are many unexposed Linux threats still waiting to be discovered.\n\nOur main goal in initiating this series is to unify a knowledge base and relevant tools for\nresearchers to use when analyzing ELF malware.\n\n**Coming Up**\nIn the next article we will review the ELF format, its static artifacts, and explain how to\npractically leverage them in your malware analysis together with useful tools.\n\nHere’s what you’ll need for the next blog:\n\n1. Make sure you have a Linux virtual machine.\n2. We encourage you to read our ELF format blog series:\n\n\n-----\n\n[Part 1 – Sections and Segments](https://www.intezer.com/blog/research/executable-linkable-format-101-part1-sections-segments/)\n[Part 2 – Symbols](https://www.intezer.com/blog/elf/executable-linkable-format-101-part-2-symbols/)\n[Part 3 – Relocations](https://www.intezer.com/blog/elf/executable-and-linkable-format-101-part-3-relocations/)\n[Part 4 – Dynamic Linking](https://www.intezer.com/blog/elf/executable-linkable-format-101-part-4-dynamic-linking/)\n\n[If you want to learn more about Linux DDoS threats, refer to this blog post exploring the](https://www.intezer.com/blog/ddos/exploring-the-chinese-ddos-threat-landscape/)\nChinese DDoS threat landscape.\n\n**Avigayil Mechtinger**\nAvigayil is a product manager at Intezer, leading Intezer Analyze product lifecycle. Prior to\nthis role, Avigayil was part of Intezer's research team and specialized in malware analysis\nand threat hunting. During her time at Intezer, she has uncovered and documented different\nmalware targeting both Linux and Windows platforms.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-16 - ELF Malware Analysis 101- Linux Threats No Longer an Afterthought.pdf"
    ],
    "report_names": [
        "2020-06-16 - ELF Malware Analysis 101- Linux Threats No Longer an Afterthought.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e16a6567-2b9a-4419-960b-1e03fccc8812",
            "created_at": "2023-01-06T13:46:39.128684Z",
            "updated_at": "2025-03-27T02:00:03.003292Z",
            "deleted_at": null,
            "main_name": "NOTROBIN",
            "aliases": [],
            "source_name": "MISPGALAXY:NOTROBIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "685da616-97dd-4c1d-ae05-b84508d2d69c",
            "created_at": "2024-11-03T02:00:03.632184Z",
            "updated_at": "2025-03-27T02:00:03.43976Z",
            "deleted_at": null,
            "main_name": "Asnarök",
            "aliases": [
                "Personal Panda"
            ],
            "source_name": "MISPGALAXY:Asnarök",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a6c351ea-01f1-4c9b-af75-cfbb3b269ed3",
            "created_at": "2023-01-06T13:46:39.390649Z",
            "updated_at": "2025-03-27T02:00:03.072899Z",
            "deleted_at": null,
            "main_name": "Kinsing",
            "aliases": [
                "Money Libra"
            ],
            "source_name": "MISPGALAXY:Kinsing",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536107,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653753079,
    "ts_modification_date": 1653753079,
    "files": {
        "pdf": "https://archive.orkl.eu/1a3e9ff8ef70ccb5f9337375840163de211a5468.pdf",
        "text": "https://archive.orkl.eu/1a3e9ff8ef70ccb5f9337375840163de211a5468.txt",
        "img": "https://archive.orkl.eu/1a3e9ff8ef70ccb5f9337375840163de211a5468.jpg"
    }
}