{
    "id": "b4a9ba02-40c9-43a4-bb49-811d4d1f8298",
    "created_at": "2023-01-12T15:01:05.107223Z",
    "updated_at": "2025-03-27T02:06:12.942794Z",
    "deleted_at": null,
    "sha1_hash": "eead3c7b53054d500a6eb19fb63b6b619a35a261",
    "title": "2021-07-09 - Watering hole threat analysis in the public sector of Kazakhstan",
    "authors": "",
    "file_creation_date": "2022-05-28T23:13:17Z",
    "file_modification_date": "2022-05-28T23:13:17Z",
    "file_size": 4610993,
    "plain_text": "# Watering hole” threat analysis in the government sector of Kazakhstan\n\n**tntsecure.kz/en/article_7.html**\n\nWhile studying the threat landscape of Kazakhstan as a part of the Threat Intelligence phase,\nT&T Security experts discovered the so-called Razy malware family. The investigated samples\nof the Razy family apparently were used to infect users in the form of a Trojan downloader\nmasquerading as a regular office document (Word, Excel and Adobe PDF). Attackers usually\nspread Razy using a “Watering hole” attack.\n\nThe “Watering hole” is an attack where attackers locate malware on a legitimate, possibly\npreviously hacked, site visited by a potential victim.\n\nThus the attacker achieves the trustworthiness effect since the link to the malicious file will\nlikely be on a victim’s list of trusted sites.\n\nTwo of the analysed cases caught our sharp attention, in which the attackers spread the\nmalware using the watering hole attack on the e-government portal (egov.kz).\nMalicious links:\n\nhxxps://legalacts.egov.kz/application/downloadnpa?id=5322314\nhxxps://budget.egov.kz/budgetfile/file?fileId=1520392\n\nAt the same time, the second malicious Razy sample (at budget.egov.kz) was still available for\ndownload on the site at the time of detection.\n\nThe files are the same malicious Razy Trojan downloader. We assume that cybercriminals\npublished the malicious software under the pretence of office documents by gaining access to\nuploading files to the legalacts.egov.kz and budget.egov.kz. The first document is a resolution\nof the district administration. The second, created in 2021, is a financial summary of the\nadministration's budget. That implies the attacker posted the Razy malware in 2021,\naccordingly.\n\nWe assume that these attacks targeted specific companies that may be using these\ndocuments. And most likely, the attackers did not aim for the mass attack on the citizens of\nKazakhstan, and the public exposure of the samples themselves is most likely a side effect.\nThe rest of the Razy samples are also documents of different kinds, e.g. the resolution of the\ndistrict administration. That means cybercriminals look for the documents suitable for the\nvictim and embed them into the final malicious file.\n\nOne should note, by the time of publication, the malware control server (C&C server) has\nalready been disabled, and that is currently, these samples cannot load any additional\nmalicious functionality.\n\n\n-----\n\nTogether with the accountable employees of Zerde National Information & Communication\nHolding JSC, the T&T Security team worked to detect the Razy related incidents and block the\ncaused spreading of malicious content.\n\ntLab successfully detects and blocks this threat, which can be seen in the video below. tLab\nworks on the principle of zero trust based on deep behavioral analysis, and high throughput\nallows you to analyze tens of thousands of files per day without filters and whitelisting, then\nour solution effectively blocks such threats even using an attack at the watering hole. Since\ntLab is used as part of the Cyber  Shield of the Republic of Kazakhstan, we can say that the\nstate is ready to repel such threats.\n\n## Samples technical analysis\n\nRazy, first spotted in 2015, has been used for attacks to these days. Below is a diagram of\nhow Razy works. One can see that when a user launches a sample, a malicious payload gets\nactivated, and an actual legitimate document embedded in malware pops up.\n\nT&T Security monitored the monthly amounts of Razy malware samples found on Virustotal\nand discovered a sharp increase in May 2021. Most of the detected malware samples to target\nKazakhstan belong to the same period. That is, the embedded documents come from the\nKazakh institutions.\n\n\n-----\n\nRazy stats from alienvault.com\n\n(2015 - 2019)\n\nRazy stats from alienvault.com\n\n(2020)\n\n\n-----\n\nRazy stats from alienvault.com\n\n(2021)\n\nWe researched the following files.\n\n2 6>10 @CA.exe\n\nSHA256: 20f7a8258f83862ae6638a6bd1ad0bc83d40928a89eb40c720934db9b65f4bec\n\nэльвира отчет.exe\n\nSHA256:\nb06e65a0009ae771566db075c0f5850799977b4a982d7d6a63565a184be60796\n\nОтчёт по практике.exe\n\nSHA256: 219c44420a95370a22ef806244033c2a21e94b7500fc780fc8e4f25183f745bc\n\n24160712_ExSteppeEagle_INTSUM_S2_160X_E_O.exe\n\nSHA256:\n2F6C1C2C4043CA6D19ADDD60FA85A5AD6D347075E73AE1E1DCB76D5CC5224573\n\neastmere vil.exe\n\nSHA256:\n7615E69D6FA11FC851C4CD10DDEE3820ACFC6170578C61AE74B6D4FD8EA71E10\n\nOWNSITREP 241700AJUL16 G3.exe\n\nSHA256:\n8FA473C03850B22C2C6AADCFE69268BE4E4C7A33881581FEA83789755AF8F22A\n\n\n-----\n\n61c98d12-06b1-4f5d-9c12-ace5630dcc07\n\nSHA256:\n3ED1B88C9AE34BA4FFBF8AED737F2DC9A0AEDEEDF8D2A4A69555518845E16264\n\nThe identical PDB file paths and the timestamps found in all six samples indicate they were all\ncreated by a single “MultiLauncher” tool.\n\nPE file characteristics:\n\nMost of the samples contain a document displayed to the user in resource number 200.\n\n\n-----\n\nThe samples contain icon sets for all types of documents. The final file uses one of the types.\nThat leaves us with a conclusion the creators were using one tool and were choosing the\nrequired document type in the final build.\n\nThere are Razy builds that do not contain malicious documents:\n\n1f35ce5d620f4eddbfbff5fd1b6142b002bb6a537b864d7745d96ddfd8424bd6\n3a050db9c571eafd5b1dccb412991434bd0a0fc52c4771274018420a08af4c00\n\nThat explains that the attacker always looks for the “right” documents before embedding them\ninto the final file.\n\nThe resource can be a PDF file also.\n\n\n-----\n\nUsually, Razy is an EXE file with an office document icon.\n\n\n-----\n\nThe actual file extension\n\nMost of the time, the attackers set up an office document icon for an executable file to mislead\nthe user. When the user launches a file, he sees an opened office document, and a malicious\nEXE file will perform other operations.\n\nSHA256:219c44420a95370a22ef806244033c2a21e94b7500fc780fc8e4f25183f745bc\n\n\n-----\n\nSHA256:b06e65a0009ae771566db075c0f5850799977b4a982d7d6a63565a184be60796\n\nSHA256:20f7a8258f83862ae6638a6bd1ad0bc83d40928a89eb40c720934db9b65f4bec\n\n\n-----\n\nSHA256:2F6C1C2C4043CA6D19ADDD60FA85A5AD6D347075E73AE1E1DCB76D5CC5224573\n\n\n-----\n\nSHA256:8FA473C03850B22C2C6AADCFE69268BE4E4C7A33881581FEA83789755AF8F22A\n\n\n-----\n\nSHA256:3ED1B88C9AE34BA4FFBF8AED737F2DC9A0AEDEEDF8D2A4A69555518845E16264\n\nAll objects have the same functionality but different office documents. Since all of the samples\nare just variants of the same family, consider one of them.\n\n20f7a8258f83862ae6638a6bd1ad0bc83d40928a89eb40c720934db9b65f4bec\n\nThis object is an EXE file with an icon of a Word document. At a closer look, one can\nconclude, it is a dropper for office documents.\n\n\n-----\n\nSummary of the object in the tLab system:\n\nLaunching the EXE file will result in a regular office document hiddenly located in the current\nfolder.\n\nCreated hidden office document\n\nThe malicious file contains office document in its resources (DATA - 200):\n\n\n-----\n\nThe first bytes of the file in the resources determine the type of the embedded document. In\nthis case, the “4B 03 04 14 00 06 00 08 00” signature corresponds with the Microsoft Office\nOpen XML Format.\n\nWhen launched, the Razy malware detects the type of displayed document given the\ninformation from the resource number 300 (0x12C):\n\n\n-----\n\nThe resource containing real extension of the file\n\nNext, the reading of the original office document from the resource number 200 (0x0C8)\nbegins, using the FindResource, LoadResource, LockResource, SizeOfResource functions:\n\n\n-----\n\nFunctions for working with resources\n\n\n-----\n\nCode for working with resources under the DATA identifier\n\nIn the tLab sandbox, when uploading a file, one can see a potential threat indicator:\n\nThe result of static analysis on the tLab system\n\nA malicious file opens a created document in Word using the ShellExecuteW function:\n\n\n-----\n\nThe ShellExecute function opens the passed file in a program associated with specific\nextensions. For example, if the file has the DOCX extension, it will be opened by the program\nregistered to open such files (in our case, Microsoft Word).\n\nThe T&T Security sandbox also builds a graph of the dynamic behaviour of an object:\n\nA detailed report on the tLab system\n\nThe Word document does not contain any macros and is not malicious, according to the initial\nanalysis. Presumably, the purpose of opening an office document is to conceal malicious\nactivity.\n\nAt the same time, the malicious file creates a copy of itself in the APPDATA \\ RAC folder under\nthe name mls.exe:\n\n\n-----\n\nDetection in tLab system\n\nOne can also observe this activity through the system call logs\n\nNext, mls.exe sets itself to startup in the registry with the -s parameter:\n\n\n-----\n\nAutoload indication on the tLab system\n\nThe file is present in the AutoStartup section of the T&T Security forensics tool\n\nMalicious file at autorun in T&T Security forensics tool\n\nAfter rebooting, mls.exe will run with the -s option\n\nThe condition for the file restart\n\nAfter starting with the -s parameter, it calls the addresses hxxp: //wxanalytics.ru/net.exe.config\nand hxxp: //wxanalytics.ru/net.exe\n\n\n-----\n\nPCAP file content view on the tLab system\n\nThe file can run with the -cs and -cc options. In this case, it takes the location path for the\noriginal malicious file.\n\nHandling the -cs parameter\n\nHandling the -cc parameter\n\n\n-----\n\nFile moving code\n\nBy looking at the list of malicious files that have accessed the same addresses, we will see\nthey have different names.\n\nList of malicious files accessing vwanalytics.ru\n\nAttackers often name malicious files based on the area of interest of potential victims.\n\nSeveral samples of malicious files on this list were uploaded documents to legalacts.egov.kz\nand budget.egov.kz. As previously noted, this type of attack is called a watering hole attack.\n\nMalicious links:\n\n\n-----\n\nhxxps://budget.egov.kz/budgetfile/file?fileId=1520392\nhxxps://legalacts.egov.kz/application/downloadnpa?id=532231\n\nThe files are the same old malicious Razy downloader Trojan. We assume that cybercriminals\npublished malicious software under the guise of DOCX by gaining access to uploading files to\nthe legalacts.egov.kz site. As of May 11, 2021, only a few well-known anti-viruses identified the\nobject, while none of them could detect the link to the object itself as malicious.\n\n## Conclusion\n\nThese days even an ordinary user can unravel such techniques as hiding files and faking the\nicons.\n\nThe malicious Trojan downloader itself is not packed in any way to stay undetected by the\nantivirus signature. The file creation date indicates the use of old-style malware. The hash\nsums of the studied samples (without resources) coincide with so many other files seen in\nsimilar attacks.\n\nAll this suggests that the attackers, in this case, used quite an old malware, changing only the\noffice document displayed to the user, which indicates the low qualifications of the attacker.\nRegardless, the Razy Trojan still poses a live threat and uses actual white papers.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-09 - Watering hole threat analysis in the public sector of Kazakhstan.pdf"
    ],
    "report_names": [
        "2021-07-09 - Watering hole threat analysis in the public sector of Kazakhstan.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535665,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653779597,
    "ts_modification_date": 1653779597,
    "files": {
        "pdf": "https://archive.orkl.eu/eead3c7b53054d500a6eb19fb63b6b619a35a261.pdf",
        "text": "https://archive.orkl.eu/eead3c7b53054d500a6eb19fb63b6b619a35a261.txt",
        "img": "https://archive.orkl.eu/eead3c7b53054d500a6eb19fb63b6b619a35a261.jpg"
    }
}