{
    "id": "b4b54924-b1ba-4b27-a015-5f2e7e2b1675",
    "created_at": "2023-01-12T15:04:24.926986Z",
    "updated_at": "2025-03-27T02:16:35.023626Z",
    "deleted_at": null,
    "sha1_hash": "606be651252b42aca84154d4a30f9fa15f21174d",
    "title": "2022-05-03 - SOLARDEFLECTION C2 Infrastructure Used by NOBELIUM in Company Brand Misuse",
    "authors": "",
    "file_creation_date": "2022-05-28T02:10:15Z",
    "file_modification_date": "2022-05-28T02:10:15Z",
    "file_size": 458007,
    "plain_text": "# SOLARDEFLECTION C2 Infrastructure Used by NOBELIUM in Company Brand Misuse\n\n**[recordedfuture.com/solardeflection-c2-infrastructure-used-by-nobelium-in-company-brand-misuse/](https://www.recordedfuture.com/solardeflection-c2-infrastructure-used-by-nobelium-in-company-brand-misuse/)**\n\n\nBlog\n\n\nPosted: 3rd May 2022\n\nBy: INSIKT GROUP\n\n**_Editor’s Note: The following post is an excerpt of a full report. To read the_**\n_[entire analysis, click here to download the report as a PDF.](https://go.recordedfuture.com/hubfs/reports/cta-2022-0503.pdf)_\n\n_This report profiles the unique infrastructure used by Russian state-sponsored_\n_threat activity group NOBELIUM. The activity was identified through a_\n_combination of large-scale automated network traffic analytics and analysis_\n_derived from open source reporting. Data sources include the Recorded Future_\n_Platform, SecurityTrails, DomainTools, PolySwarm, Farsight, Shodan, Censys,_\n_Team Cymru’s Pure Signal™ and other common open-source tools and_\n_techniques. The report will be of most interest to individuals engaged in_\n_strategic and operational intelligence relating to the activities of the Russian_\n_government in cyberspace and network defenders. Some technical details from_\n_our original research have not been included in this report version in order to_\n_protect tracking techniques and ongoing research into NOBELIUM activity._\n\n**Executive Summary**\n\n\n-----\n\nRecorded Future s Insikt Group continues to monitor Russian state-sponsored\ncyber espionage operations targeting government and private sector\norganizations across multiple geographic regions. From mid-2021 onwards,\nRecorded Future’s midpoint collection revealed a steady rise in the use of\nNOBELIUM infrastructure tracked by Insikt Group as SOLARDEFLECTION,\nwhich encompasses command and control (C2) infrastructure. In this report,\nwe highlight trends observed by Insikt Group while monitoring\nSOLARDEFLECTION infrastructure and the recurring use of typosquat\ndomains by its operators.\n\nA key factor we have observed from NOBELIUM operators involved in threat\nactivity is a reliance on domains that emulate other brands (some legitimate\nand some that are likely fictitious businesses). Domain registrations and\ntyposquats can enable spearphishing campaigns or redirects that pose a threat\nto victim networks and brands.\n\nUsing a combination of proactive adversary infrastructure detections, domain\nanalysis techniques, and Recorded Future Network Traffic Analysis, we have\ndetermined that NOBELIUM’s use of SOLARDEFLECTION infrastructure\noverlaps with other common infrastructure tactics, techniques, and procedures\n(TTPs) previously attributed to the group by multiple organizations including\nMicrosoft, Fortinet, Sekoia, and Volexity. Previous open source reporting also\nhighlighted NOBELIUM’s use of cracked versions of the Cobalt Strike\npenetration testing tool.\n\n**Key Judgments**\n\nInsikt Group is confident that the identified SOLARDEFLECTION\ninfrastructure can be attributed to the threat activity group publicly\nreported as NOBELIUM; this confidence is based on the use of\noverlapping network infrastructure previously attributed to NOBELIUM in\npublic reporting, as well as unique variations of Cobalt Strike traditionally\nused by the group.\nBroader themes in SOLARDEFLECTION C2 typosquats have included\nthe misuse of brands across multiple industry verticals, particularly in the\nnews and media industries.\nCobalt Strike servers related to SOLARDEFLECTION monitoring that\nwere also previously linked to NOBELIUM activity used modified server\nconfigurations, likely in an attempt to remain undetected from researchers\nactively scanning for standard Cobalt Strike server features.\nNOBELIUM has made extensive use of typosquat domains in SSL\ncertificates and will likely continue to use deceptive techniques, including\ntyposquat redirection, when using Cobalt Strike tooling.\n\n\n-----\n\n**Background**\n\nAnalysis of recent and historical domains attributed to NOBELIUM broadly\ndemonstrates the group’s familiarity with, and tendency to emulate, a variety of\nmedia, news and technology providers. The group has abused dynamic DNS\nresolution to construct and resolve to randomly generated subdomains for its\nC2s or root domains to mislead victims. The key aspect to these attacks is the\nuse of either email addresses or URLs that look similar to the domain of a\nlegitimate organization. Potentially harmful domain registrations and typosquats\ncan enable spearphishing campaigns or redirects that pose an elevated risk to\na company's brand or employees. A successful spearphish is dependent on\nfactors such as the quality of the message, the credibility of the sender\naddress, and, in the case of a redirecting URL, the credibility of the domain\n[name. Insikt Group has previously observed other Russian nexus groups using](https://www.recordedfuture.com/us-election-russia-threats/)\ntyposquatting in support of operations, such as those aimed at the 2020\npresidential elections, to increase confidence in the validity of the fraudulent\nlogin portal used to harvest victim credentials. This tactic has also been\n[reported recently in open sources in connection with intrusions targeting](https://blog.talosintelligence.com/2021/02/gamaredonactivities.html)\nentities in Ukraine, likely in support of Russia’s invasion of the country.\n\nInsikt Group assesses that NOBELIUM is a threat activity group operating in\nline with the objectives of Russia’s Foreign Intelligence Service (SVR). The\nSVR is tasked with providing the president of the Russian Federation, the\nFederal Assembly, and the government with the intelligence they need to make\ndecisions in the areas of politics, the economy, military strategy, scientifictechnical strategy, and the environment. Russia’s SVR defines itself as\n[separate by allowing the Russian Main Intelligence Directorate (GRU) to focus](https://web.archive.org/web/20010331062154/http://www.newsmax.com/archives/articles/2001/3/22/141340.shtml)\n[on military intelligence operations, while the SVR focuses on political](https://meduza.io/en/feature/2018/11/06/what-is-the-gru-who-gets-recruited-to-be-a-spy-why-are-they-exposed-so-often)\nintelligence; this is, however, a very high-level view of these operations. The\nSVR conducts its affairs by collecting information via public and private means,\nwith the intended goal of gathering strategic information from organizations and\nindividuals who in turn influence strategic policy and decision-makers in\ntargeted countries.\n\n[In 2021, Volexity published research outlining a suspected APT29 phishing](https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/)\noperation that targeted non-governmental organizations (NGOs), research\ninstitutions, governments, and international bodies using election fraud-themed\nlures purporting to be sent from the United States Agency for International\nDevelopment (USAID), a government agency. The same day, Microsoft also\n[published research on wider TTPs used in the same campaign and attributed](https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/)\n[the activity to NOBELIUM, the group behind the SolarWinds intrusions. This](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)\n[campaign targeted sensitive diplomatic and government entities as early as](https://www.microsoft.com/security/blog/2021/05/28/breaking-down-nobeliums-latest-early-stage-toolset/)\nFebruary 2021. They believe the threat actor used this information to launch\n\n\n-----\n\nother highly targeted attacks as part of their broader campaign. Additional\nresearch confirmed that a cluster of infrastructure monitored by Insikt Group\nunder the designation SOLARDEFLECTION since 2021 overlaps with this\nprevious reporting. Ongoing detections within the Recorded Future Command\nand Control security feed assisted in confirming the registration of new\ntyposquat domains tied to NOBELIUM operations. More notably, we have\nconfirmed that several newly identified typosquats continue to adopt the\nnaming conventions or themes that were originally flagged as likely being\n[associated with NOBELIUM reporting as early as 2020.](https://www.sekoia.io/en/nobeliums-envyscout-infection-chain-goes-in-the-registry-targeting-embassies/)\n\n_Figure 1: SOLARDEFLECTION Domain Registration reference in the Recorded_\n_Future Platform (Source: Recorded Future)_\n\nThe Recorded Future Platform automatically detects typosquatted domains;\neach newly created domain entity is evaluated for typosquatting-style similarity\nto other domains observed by Recorded Future. An example of this is the\nSOLARDEFLECTION typosquat displayed in Figure 1, which based on the\ndomain’s spelling was very likely an attempt by NOBELIUM operators to\nemulate the T-Mobile brand. A review of the frequency in which\nSOLARDEFLECTION domains were registered over the past two years\nconfirmed NOBELIUM’s tendency to register domains in cycles, occasionally\ntaking short hiatuses which at times likely coincided with new open source\nreporting attributing several domains to NOBELIUM activity (as depicted within\nthe Recorded Future timeline below).\n\n_Figure 2: SOLARDEFLECTION Typosquat Registration Timeline (Source:_\n_Recorded Future Data)_\n\n\n-----\n\nInsikt Group proactively detects SOLARDEFLECTION infrastructure through an\nin-depth understanding of the infrastructure TTPs that the group employs\n(detailed further below within the Infrastructure TTPs section). Additionally, the\nCommand and Control data set enables us to enrich and identify any\nSOLARDEFLECTION IPs that we have categorized as “positive C2”. We then\nanalyze network communications to investigate how the C2 is interacting with\ninfected machines or how it is being administered by the adversary.\nSOLARDEFLECTION C2s can be reviewed from within the Recorded Future\nPlatform’s Command and Control data set.\n\n**_Editor’s Note: The following post is an excerpt of a full report. To read the_**\n_[entire analysis, click here to download the report as a PDF.](https://go.recordedfuture.com/hubfs/reports/cta-2022-0503.pdf)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-03 - SOLARDEFLECTION C2 Infrastructure Used by NOBELIUM in Company Brand Misuse.pdf"
    ],
    "report_names": [
        "2022-05-03 - SOLARDEFLECTION C2 Infrastructure Used by NOBELIUM in Company Brand Misuse.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535864,
    "ts_updated_at": 1743041795,
    "ts_creation_date": 1653703815,
    "ts_modification_date": 1653703815,
    "files": {
        "pdf": "https://archive.orkl.eu/606be651252b42aca84154d4a30f9fa15f21174d.pdf",
        "text": "https://archive.orkl.eu/606be651252b42aca84154d4a30f9fa15f21174d.txt",
        "img": "https://archive.orkl.eu/606be651252b42aca84154d4a30f9fa15f21174d.jpg"
    }
}