{
    "id": "b5569ee0-860e-457e-abd1-3b21b7d8c8f9",
    "created_at": "2023-01-12T15:10:44.408779Z",
    "updated_at": "2025-03-27T02:16:14.00079Z",
    "deleted_at": null,
    "sha1_hash": "cc7b0258f8b43afe184a2279e5c1497c9eea81a4",
    "title": "2017-11-14 - Muddying the Water- Targeted Attacks in the Middle East",
    "authors": "",
    "file_creation_date": "2022-05-28T05:07:40Z",
    "file_modification_date": "2022-05-28T05:07:40Z",
    "file_size": 424829,
    "plain_text": "# Muddying the Water: Targeted Attacks in the Middle East\n\n**[unit42.paloaltonetworks.com/unit42-muddying-the-water-targeted-attacks-in-the-middle-east/](https://unit42.paloaltonetworks.com/unit42-muddying-the-water-targeted-attacks-in-the-middle-east/)**\n\nTom Lancaster November 14, 2017\n\nBy [Tom Lancaster](https://unit42.paloaltonetworks.com/author/tom-lancaster/)\n\nNovember 14, 2017 at 1:00 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [FIN7,](https://unit42.paloaltonetworks.com/tag/fin7/) [Lazagne,](https://unit42.paloaltonetworks.com/tag/lazagne/) [Meterpreter,](https://unit42.paloaltonetworks.com/tag/meterpreter/) [Mimikatz,](https://unit42.paloaltonetworks.com/tag/mimikatz/) [MuddyWater](https://unit42.paloaltonetworks.com/tag/muddywater/)\n\nSummary\n\nThis blog discusses targeted attacks against the Middle East taking place between February and\nOctober 2017 by a group Unit 42 is naming \"MuddyWater\". This blog links this recent activity with\nprevious isolated public reporting on similar attacks we believe are related. We refer to these attacks as\nMuddyWater due to the confusion in attributing these attacks. Although the activity was previously\nlinked by others to the FIN7 threat actor group, our research suggests the activity is in fact espionage\nrelated and unlikely to be FIN7 related.\n\nThe MuddyWater attacks are primarily against Middle Eastern nations. However, we have also\nobserved attacks against surrounding nations and beyond, including targets in India and the USA.\nMuddyWater attacks are characterized by the use of a slowly evolving PowerShell-based first stage\nbackdoor we call “POWERSTATS”. Despite broad scrutiny and reports on MuddyWater attacks, the\nactivity continues with only incremental changes to the tools and techniques.\n\nIntroduction & Overview\n\nThe Palo Alto Networks Unit 42 research team recently came across a series of malicious files which\nwere almost identical to those targeting the Saudi Arabian government previously discussed by\n[MalwareBytes. Which in turn, closely resembles a previous article by Morphisec. These attacks have](http://blog.morphisec.com/fileless-attack-framework-discovery)\n\n\n-----\n\n[also been tracked by several other researchers on Twitter and elsewhere.](https://sec0wn.blogspot.sg/2017/10/continued-activity-targeting-middle-east.html)\nThe activity has been consistent throughout 2017 and, based on our analysis, targets or is suspected\nto target, entities in the following countries:\n\nSaudi Arabia\nIraq\nIsrael\nUnited Arab Emirates\nGeorgia\nIndia\nPakistan\nTurkey\nUSA\n\nThe malicious documents were adjusted according to the target regions, often using the logos of\nbranches of local government, prompting the users to bypass security controls and enable macros. An\noverview of the technical changes seen in the past year is given in the graphic below, note that raw\nIOCs present in this graphic can be found as text in the Appendix at the end of this article.\n\n\n-----\n\n-----\n\n_Figure 1. An overview of the delivery of POWERSTATS, C2 URLs used, and other changes in the_\n_malware_\n\nMuddyWater in the Middle East\n\nThe attackers behind MuddyWater have been active throughout 2017, with targets across the Middle\nEast and surrounding areas, examples of the decoy documents observed is given in Table 1.\n\nOf course, being named in a decoy document doesn’t mean any of these organizations have been\nattacked themselves or are involved in the attacks: the MuddyWater actors are abusing the trust these\norganizations’ names and/or logos command for their malicious purposes.\n\n**Month** **File Name or Decoy Document Theme** **Suspected Target Region**\n\n\n**Nov 2017** The NSA\n\nTelenor.doc\n\n**Oct 2017** Circulars.doc\n\ndollar.doc\n\nPakistan Federal Investigation Agency\n\nCV of Middle Eastern Civil Servant\n\n**Sep 2017** Iraq National Intelligence Service\n\nKaspersky Security solution 2017.doc\n\n**Aug 2017** Arab Emirate ﺳﺮی.docm\n\nIraq Commission of Integrity\n\n**Jul 2017** Requirements of the Sago.doc\n\nCommIT-Document.doc\n\nConfidential letters.doc\n\n**Jun 2017** Iraq Kurdistan Regional Government\n\nRFP_VOIP.doc\n\n**May 2017** RFP.doc\n\nRequirement.doc\n\nIraq Kurdistan Regional Government\n\n\nUnknown\n\nPakistan\n\nTurkey\n\nPakistan\n\nIraq\n\nArab Emirates\n\nSaudi Arabia\n\nArab Emirates\n\nPakistan\n\nIraq\n\nGeorgia\n\nIraq\n\n\n**Mar 2017** court.doc Georgia\n\n**Feb 2017** CERT-Audit-20172802-GEO.xls Georgia\n\n_Table 1 – Examples of the lure documents observed in the MuddyWater attacks._\n\n\n-----\n\nAll of these documents we observed and outlined above are related via:\n\nShared C2 infrastructure.\nUse of the non-public PowerShell backdoor previously described by Morphisec and\nMalwareBytes (which we refer to as POWERSTATS).\nShared attributes of the malicious documents used in attacks.\nShared attributes as to how the documents were delivered.\n\nBased on these connections we can be confident that all the files and infrastructure we give in our\nappendices are related, since more than one of these can be used to link each of the samples\ndiscussed in each case.\n\nI download my tools from GitHub, and so do my victims.\nThe tools used by the MuddyWater attackers have been well documented by the previously cited\nresearch and a common theme of previous reporting was the open source nature of much of the toolset\nused by MuddyWater: Meterpreter, Mimikatz, Lazagne, Invoke-Obfuscation etc.. In some of their recent\nattack documents, the attackers also used GitHub as a hosting site for their custom backdoor,\nPOWERSTATS. Specifically, the following GitHub repositories appear to be controlled by the\nMuddyWater threat actor(s):\n\n[unknown SHA256]\n\nDownloads payload from:\nhxxps://raw.githubusercontent[.]com/F0R3X/BrowserFontArabic/master/ArabicBrowserFont.exe\n\n[unknown SHA256]\n\nDownloads payload from:\nhxxps://raw.githubusercontent[.]com/F0R3X/BrowserFontArabic/master/FontArabic.exe\n\n9b5e36bb7518a9e333c31d09b589102f89e3425571dd434820ab3c437dc4e0d9 (and several\nothers)\n\nDownloads payload from:\nhxxps://raw.githubusercontent[.]com/ReactDeveloper2017/react/master/src/test/test.js\n\nInterestingly, both profiles were populated with forked repositories to give them an air of legitimacy as\n[shown in figure 2. The POWERSTATS malware was compiled as an exe using PS2EXE. However, this](https://github.com/vergl4s/pentesting-dump/blob/master/net/Windows/PS2EXE-v0.5.0.0/ps2exe.ps1)\nwas a minor anomaly, as it was only seen in this case: raw scripts being used in all other cases.\n\n\n-----\n\n_Figure 2 – The GitHub profile for F0R3X containing both legitimate forked code and the binaries_\n_created by the attacker. Note that the username could be a small joke on the attackers’ part regarding_\n_the attribution to FIN7._\n\nPwn one to pwn them all\n\nIn some of the instances we observed what appeared to be compromised accounts at third party\norganizations sending the malware. In one case, the attackers sent a malicious document which was\nnearly identical to a legitimate attachment which we observed later being sent to the same recipient.\nThis indicates that the attackers stole and modified a legitimate document from the compromised user\naccount, crafted a malicious decoy Word macro document using this stolen document and sent it to the\ntarget recipient who might be expecting the email from the original account user before the real sender\nhad time to send it.\n\nThis targeting of third party organizations to attack further targets is a risky move on the attackers’ part,\nas it potentially reveals their activity within the compromised third party organizations to the new target\n(those receiving the malicious documents\n\nMaking sense of MuddyWater\n\nWhen we looked at the cluster of activity which consisted of what appeared to be espionage-focused\nattacks in the Middle East, we were somewhat confused as the previous public reporting had attributed\nthese attacks to FIN7. FIN7 is a threat actor group that is financially motivated with targets in the\nrestaurant, services and financial sectors. Following the trail of existing public reporting, the tie to FIN7\nis essentially made based on a download observed from a MuddyWater C2, of a non-public tool\n“DNSMessenger”.\n\n[For example, Morphisec wrote:](http://blog.morphisec.com/fileless-attack-framework-discovery)\n\n“Later in our investigation, the same command server also delivered a variant of the DNS messenger\nsimilar to that [described by Talos. The domain names differed but the script adheres to the same logic](http://blog.talosintelligence.com/2017/03/dnsmessenger.html)\n(including the logic function).”\n\n\n-----\n\nThe DNSMessenger malware is an obfuscated and customized version of the popular\n[DNS_TXT_PWNAGE.ps1 script available on GitHub and is also referred to by FireEye as](https://github.com/samratashok/nishang/blob/master/Backdoors/DNS_TXT_Pwnage.ps1)\nPOWERSOURCE. The use of the DNSMessenger tool appears primarily linked to FIN7, with no other\nsamples being attributable to MuddyWater.\nThis led us to query the relationship between the newer attacks we were looking at and the alleged\nFIN7 link. As part of this research, we came up with the following hypotheses along with their\nlikelihoods, and a rationale for each one.\n**1) The FIN7 threat actor is also involved in espionage in the Middle East - Unlikely**\nWhilst this may seem an attractive hypothesis to some, there are aspects on the technical side that\nsimply don’t add up. Primarily, there are significant disparities between FIN7 and MuddyWater,\nspecifically in terms of:\n\nMalware unique to FIN7, or commonly used by them has not yet been seen in any MuddyWater\ninvestigations (except for the single observation of the DNSMessenger sample)\nOther non-public malware and tools used by MuddyWater have not been observed in our FIN7\ninvestigations.\nFrom an infrastructure point of view there is no overlap between the two sets of activity, the only\noverlap is the use of the unique tool “DNSMessenger”\n\nWhen these points are considered together in conjunction with the significant difference in targeting\nthey make a strong case for classifying this activity as distinct from FIN7 activity.\n**2) The DNSMessenger malware is a shared tool, used by FIN7, MuddyWater and perhaps other**\n**groups - Unlikely**\nWe have attempted to find examples of code available in public data sources that would generate the\nvariation of the DNSMessenger malware and had little luck in doing so. Even though the code for\nDNSMessenger is publicly available following research into attackers published by 3 parties,rd\nattackers would have to write the corresponding server side to use it, and as such they may well\nchoose to use the public DNS_TXT_Pwnage.ps1 script instead.\nDespite this, based on the chain of analysis above we cannot discount the notion that DNSMessenger\nis shared by multiple attackers, including FIN7 and MuddyWater.\n**3) There was a mistake in the original Morphisec analysis which linked these attacks to FIN7 -**\n**Possible**\nLittle detail is given on the nature of how the connection between DNSMessenger and MuddyWater\nwas discovered it isn’t possible for us to verify this link.\n**4) The attackers realized they were under investigation and planted a false flag - Possible**\nThe attackers realized they were under investigation and planted a false flag on their C2 server,\nuploading a copy of the FIN7 DNSMessenger code which had been previously mentioned (and was\nsince publicly available) by FireEye and delivering it to researchers to trick them into mis-attributing the\ncampaign.\nIndeed, the sample shared by Morphisec on PasteBin is identical to the one dropped by the sample\ndiscussed in the FireEye FIN7 SEC campaign blog except for the final line.\n\nFinal thoughts\nWhilst we could conclude with confidence that the attacks discussed in this article are not FIN7 related,\nwe were not able to answer many of our questions about the MuddyWater attacks. We are currently\nunable to make a firm conclusion about the origin of the attackers, or the specific types of information\nthey seek out once on a network. In any case we will continue to track their activities to provide\n\n\n-----\n\nprotections for our customers.\nWe hope the analysis presented shows the importance of drawing your own conclusions based on the\ndata available to you, not just taking the conclusions given in the public domain at face value. This is\nespecially true when actors who rely on slightly modified (and publicly available) open source tools are\nin play. Copycat threat actors can easily mimic attackers who use open source tools which can confuse\nattribution efforts meaning more than one aspect of the attacks observed must be considered when\nclustering.\nOn top of this, whilst the vast majority of threat analysis in the public domain is repeatable and correct,\nin some cases it can be difficult to verify the analysis available. When it is hard to reproduce the\nanalysis the confidence in any conclusions drawn must be lower than it would otherwise be, since you\ncannot know for sure that what is stated is true.\nPalo Alto Networks customers are protected from this threat in the following ways:\n\nWildFire and Traps detect all the malware supported in this report as malicious.\nTraps customers can deploy Heuristic methods to detect attacks that use these techniques.\nC2 domains used by the attackers are blocked via Threat Prevention.\n\nAutoFocus customers can monitor ongoing activity from the threats discussed in this report by looking\nat the following tags:\n\nAppendix A – C2 Addresses\n\n148.251.204[.]131\n144.76.109[.]88\n138.201.75[.]227\n\n**Compromised Legitimate Sites**\n106[.]187[.]38[.]21\narbiogaz[.]com\nazmwn[.]suliparwarda[.]com\nbangortalk[.]org[.]uk\nbest2[.]thebestconference[.]org\ncamco[.]com[.]pk\ncbpexbrasilia[.]com[.]br\ncgss[.]com[.]pk\ndiplomat[.]com[.]sa\nferibschat[.]eu\nghanaconsulate[.]com[.]pk\nmagical-energy[.]com\nmainandstrand[.]com\nriyadhfoods[.]com\nschool[.]suliparwarda[.]com\nsuliparwarda[.]com\ntmclub[.]eu\nwatyanagr[.]nfe[.]go[.]th\nwhiver[.]in\nwww[.]4seasonrentacar[.]com\n\n\n-----\n\nwww[.]akhtaredanesh[.]com\nwww[.]arcadecreative[.]com\nwww[.]armaholic[.]com\nwww[.]asan-max[.]com\nwww[.]autotrans[.]hr\nwww[.]dafc[.]co[.]uk\nwww[.]eapa[.]org\nwww[.]elev8tor[.]com\nwww[.]jdarchs[.]com\nwww[.]kunkrooann[.]com\nwww[.]mackellarscreenworks[.]com\nwww[.]mitegen[.]com\nwww[.]nigelwhitfield[.]com\nwww[.]pomegranates[.]org\nwww[.]ridefox[.]com\nwww[.]shapingtomorrowsworld[.]org\nwww[.]vanessajackson[.]co[.]uk\nwww[.]yaran[.]co\nwww[.]ztm[.]waw[.]pl\ncoa[.]inducks[.]org\nmhtevents[.]com\nskepticalscience[.]com\nwallpapercase[.]com\nwww[.]spearhead-training[.]com\n\n**Appendix B – Related files**\n\n**sha256** **Overall**\n**Description**\n\nd2a0eec18d755d456a34865ff2ffc14e3969ea77f7235ef5dfc3928972d7960f Loader script from\n144.76.109[.]88\n\n1421a5cd0566f4a69e7ca9cdefa380507144d7ed59cd22e53bfd25263c201a6f MuddyWater\nMacro\n\n4e3c7defd6f3061b0303e687a4b5b3cc2a4ae84cdc48706c65a7b1e53402efc0 MuddyWater\nMacro\n\n8b96804d861ea690fcb61224ec27b84476cf3117222cca05e6eba955d9395deb Lazagne\n\n16985600c959f6267476da614243a585b1b222213ec938351ef6a26560c992db PS2EXE\nPowerStats\n(GitHub)\n\ncf87a2ac51503d645e827913dd69f3d80b66a58195e5a0044af23ea6ba46b823 PS2EXE\nPowerStats\n(GitHub)\n\n\n-----\n\n3030d80cfe1ee6986657a2d9b76b626ea05e2c289dee05bd7b9553b10d14e4a1 Decoded\nPowerStats\npayload\n\n99077dcb37395603db0f99823a190f50313dc4e9819462c7da29c4bc983f42fd Lazagne Runner\nScript\n\n1b60b7f9b0faf25288f1057b154413921a6cb373dcee43e831b9263c5b3077ce MuddyWater\nMacro\n\n2c8d18f03b6624fa38cae0141b91932ba9dc1221ec5cf7f841a2f7e31685e6a1 MuddyWater\nMacro\n\n367021beedb3ad415c69c9a0e657dc3ed82b1b24a41a71537d889f5e2b7ca433 MuddyWater\nMacro\n\n58282917a024ac252966650361ac4cbbbed48a0df7cab7b9a6329d4a04551c0d MuddyWater\nMacro\n\n58898648a68f0639c06bedc8242ca48bc6ec56f11ed40d00aa5fdda4e5553482 MuddyWater\nMacro\n\n81523e0199ae1dc9e87d2b952642785bfbda6326f22e4c0794a19afdf001a9a3 MuddyWater\nMacro\n\n90b66b3fef77962fbfda364a4f8799bfcc9ab73772026d7a8922a7cf5556a024 MuddyWater\nMacro\n\n96101de2386e35bc5e38d32524a02c6c5ca7cc6624e656a629b2e0f1693a76fd MuddyWater\nMacro\n\n964aaf5d9b1c749df0a2df1f1b4193e5a643893f251e2d74b47663f895da9b13 MuddyWater\nMacro\n\n97f9a83bc6bb1b3f5cb7ac9401f95265597bff796bb4901631d6fa2c79a48bdc MuddyWater\nMacro\n\na3c1fd46177a078c4b95c744a24103df7d0a58cee1a3be92bc4cdd7dec1b1aa5 MuddyWater\nMacro\n\nfcfbdffbcad731e0a5aad349215c87ed919865d66c287a6723fd8e2f896c5834 MuddyWater\nMacro\n\n2bb1637c80f0a7df7260a8583beb033f4afbdd5c321ff5642bc8e1868194e009 MuddyWater\nMacro\n\n58aec38e98aba66f9f01ca53442d160a2da7b137efbc940672982a4d8415a186 MuddyWater\nMacro\n\n605fefc7829cfa41710e0b844084eab1f180fe513adc1d8f0f82501a154db0f4 MuddyWater\nMacro\n\ne8a832b04dbdc413b71076754c3a0bf07cb7b9b61927248c482ddca32e1dab89 MuddyWater\nMacro\n\n5d049bd7f478ea5d978b3c78f7f0afdf294a94f526fc20ffd6e33022d40d15ae MuddyWater\nMacro\n\n\n-----\n\n12a7898fe5c75e0b57519f1e7019b5d09f5c5cbe49c48ab91daf6fcc09ee8a30 MuddyWater\nMacro\n\n2602e817a67949860733b3548b37792616d52ffd305405ccab0409bcfedc5d63 MuddyWater\nMacro\n\n42a4d9527063f73004b049a093a34a4fc3b6ea9505cb9b50b895486cb2dca94b MuddyWater\nMacro\n\n5ed5fc6c6918ff6fa4eab7742c03d59155ca87e0fe12bac339f18928e2924a96 MuddyWater\nMacro\n\na2ad6bfc47c4f69a2170cc1a9fd620a68b1ebb474b7bdf601066e780e592222f MuddyWater\nMacro\n\nc23ece07fc5432ca200f3de3e4c4b68430c6a22199d7fab11916a8c404fb63dc MuddyWater\nMacro\n\ncb96cd26f36a3b1aacabfc79bbb5c1e0c9850b1c75c30aa498ad2d4131b02b98 MuddyWater\nMacro\n\ned2f9c9d5554d5248a7ad9ad1017af5f1bbadbd2275689a8b019a04c516eeec2 MuddyWater\nMacro\n\nfe16543109f640ddbf3725e4d9f593de9f13ee9ae96c5e41e9cdccb7ab35b661 MuddyWater\nMacro\n\n886e3a2f74bf8f46b23c78a6bad80c74fe33579f6fe866bc5075b034c4d5d432 MuddyWater\nMacro\n\n8ec108b8f66567a8d84975728b2d5e6a2786c2ca368310cca55acad02bb00fa6 MuddyWater\nMacro\n\n96d80ae577e9b899772a940b4941da39cf7399b5c852048f0d06926eb6c9868a MuddyWater\nMacro\n\nbb1a5fb87d34c63ade0ed8a8b95412ba3795fd648a97836cb5117aff8ea08423 MuddyWater\nMacro\n\nd65e2086aeab56a36896a56589e47773e9252747338c6b59c458155287363f28 MuddyWater\nMacro\n\n588cd0fe3ae6fbd2fa4cf8de8db8ae2069ea62c9eaa6854caedf45045780661f MuddyWater\nMacro\n\n917a6c816684f22934e2998f43633179e14dcc2e609c6931dd2fc36098c48028 MuddyWater\nMacro\n\ndb7bdd6c3ff7a27bd4aa9acc17dc35c38b527fb736a17d0927a0b3d7e94acb42 MuddyWater\nMacro\n\nde6ce9b75f4523a5b235f90fa00027be5920c97a972ad6cb2311953446c81e1d MuddyWater\nMacro\n\na6673c6d52dd5361afd96f8143b88810812daa97004f69661da625aaaba9363b MuddyWater\nMacro\n\n\n-----\n\n40a6b4c6746e37d0c5ecb801e7656c9941f4839f94d8f4cd61eaf2b812feaabe MuddyWater\nMacro\n\n**Appendix C – Proxy URLs found from POWERSTATS samples from October 2017 onwards**\nhxxp://106[.]187[.]38[.]21/short_qr/work[.]php?c=\nhxxp://arbiogaz[.]com/upload/work[.]php?c=\nhxxp://azmwn[.]suliparwarda[.]com/wp-content/plugins/wpdatatables/panda[.]php?c=\nhxxp://azmwn[.]suliparwarda[.]com/wp-content/themes/twentyfifteen/logs[.]php?c=\nhxxp://bangortalk[.]org[.]uk/speakers[.]php?c=\nhxxp://best2[.]thebestconference[.]org/ccb/browse_cat[.]php?c=\nhxxp://camco[.]com[.]pk/Controls/data[.]aspx?c=\nhxxp://cbpexbrasilia[.]com[.]br/wp-content/plugins/wordpress-seo/power[.]php?c=\nhxxp://cbpexbrasilia[.]com[.]br/wp-includes/widgets/work[.]php?c=\nhxxp://cgss[.]com[.]pk/data[.]aspx?c=\nhxxp://diplomat[.]com[.]sa/wp-content/plugins/wordpress-importer/cache[.]php?c=\nhxxp://feribschat[.]eu/logs[.]php?c=\nhxxp://ghanaconsulate[.]com[.]pk/data[.]aspx?c=\nhxxp://magical-energy[.]com/css[.]aspx?c=\nhxxp://magical-energy[.]com/css/css[.]aspx?c=\nhxxp://mainandstrand[.]com/work[.]php?c=\nhxxp://riyadhfoods[.]com/css/edu[.]aspx?c=\nhxxp://riyadhfoods[.]com/jquery-ui/js/jquery[.]aspx?c=\nhxxp://school[.]suliparwarda[.]com/components/com_akeeba/work[.]php?c=\nhxxp://school[.]suliparwarda[.]com/plugins/editors/codemirror/work[.]php?c=\nhxxp://suliparwarda[.]com/includes/panda[.]php?c=\nhxxp://suliparwarda[.]com/layouts/joomla/logs[.]php?c=\nhxxp://suliparwarda[.]com/wp-content/plugins/entry-views/work[.]php?c=\nhxxp://suliparwarda[.]com/wp-content/themes/twentyfifteen/work[.]php?c=\nhxxp://tmclub[.]eu/clubdata[.]php?c=\nhxxp://watyanagr[.]nfe[.]go[.]th/e-office/lib/work[.]php?c=\nhxxp://watyanagr[.]nfe[.]go[.]th/watyanagr/power[.]php?c=\nhxxp://whiver[.]in/power[.]php?c=\nhxxp://www[.]4seasonrentacar[.]com/viewsure/data[.]aspx?c=\nhxxp://www[.]akhtaredanesh[.]com/d/file/sym/work[.]php?c=\nhxxp://www[.]akhtaredanesh[.]com/d/oschool/power[.]php?c=\nhxxp://www[.]arcadecreative[.]com/work[.]php?c=\nhxxp://www[.]armaholic[.]com/list[.]php?c=\nhxxp://www[.]asan-max[.]com/files/articles/css[.]aspx?c=\nhxxp://www[.]asan-max[.]com/files/articles/large/css[.]aspx?c=\nhxxp://www[.]autotrans[.]hr/index[.]php?c=\nhxxp://www[.]dafc[.]co[.]uk/news[.]php?c=\nhxxp://www[.]eapa[.]org/asphalt[.]php?c=\nhxxp://www[.]elev8tor[.]com/show-work[.]php?c=\nhxxp://www[.]jdarchs[.]com/work[.]php?c=\nhxxp://www[.]kunkrooann[.]com/inc/work[.]php?c=\nhxxp://www[.]mackellarscreenworks[.]com/work[.]php?c=\n\n\n-----\n\nhxxp://www[.]mitegen[.]com/mic_catalog[.]php?c=\nhxxp://www[.]nigelwhitfield[.]com/v2/work[.]php?c=\nhxxp://www[.]pomegranates[.]org/index[.]php?c=\nhxxp://www[.]ridefox[.]com/content[.]php?c=\nhxxp://www[.]shapingtomorrowsworld[.]org/category[.]php?c=\nhxxp://www[.]vanessajackson[.]co[.]uk/work[.]php?c=\nhxxp://www[.]yaran[.]co//wp-content/plugins/so-masonry/logs[.]php?c=\nhxxp://www[.]yaran[.]co/wp-includes/widgets/logs[.]php?c=\nhxxp://www[.]ztm[.]waw[.]pl/pop[.]php?c=\nhxxps://coa[.]inducks[.]org/publication[.]php?c=\nhxxps://mhtevents[.]com/account[.]php?c=\nhxxps://skepticalscience[.]com/graphics[.]php?c=\nhxxps://wallpapercase[.]com/wp-content/themes/twentyfifteen/logs[.]php?c=\nhxxps://wallpapercase[.]com/wp-includes/customize/logs[.]php?c=\nhxxps://www[.]spearhead-training[.]com//html/power[.]php?c=\nhxxps://www[.]spearhead-training[.]com/work[.]php?c=\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-14 - Muddying the Water- Targeted Attacks in the Middle East.pdf"
    ],
    "report_names": [
        "2017-11-14 - Muddying the Water- Targeted Attacks in the Middle East.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536244,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1653714460,
    "ts_modification_date": 1653714460,
    "files": {
        "pdf": "https://archive.orkl.eu/cc7b0258f8b43afe184a2279e5c1497c9eea81a4.pdf",
        "text": "https://archive.orkl.eu/cc7b0258f8b43afe184a2279e5c1497c9eea81a4.txt",
        "img": "https://archive.orkl.eu/cc7b0258f8b43afe184a2279e5c1497c9eea81a4.jpg"
    }
}