{
    "id": "b55b2f94-f12e-496e-9dd1-e11e8b86d16a",
    "created_at": "2022-10-25T16:48:24.742692Z",
    "updated_at": "2025-03-27T02:09:29.325358Z",
    "deleted_at": null,
    "sha1_hash": "592860ae544200835fbe47e24e2f8120260064f6",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-07-09T11:11:04Z",
    "file_modification_date": "2021-07-09T11:11:04Z",
    "file_size": 3676895,
    "plain_text": "# Tracking Cobalt Strike: A Trend Micro Vision One Investigation\n\n**[trendmicro.com/en_us/research/21/g/tracking_cobalt_strike_a_vision_one_investigation.html](https://www.trendmicro.com/en_us/research/21/g/tracking_cobalt_strike_a_vision_one_investigation.html)**\n\n\nJuly 5, 2021\n\n\n-----\n\n-----\n\nFigure 1. The mapped-out activity of Cobalt Strike in the affected environment\n\nIn late May, Trend Micro Managed XDR alerted a customer to a noteworthy Vision One alert on one of their endpoints. What followed\nwas a deeper investigation that involved searching for other similarly infected endpoints and the confirmation of a Cobalt Strike\ndetection.\n\nThis blog will cover the tactics and steps we took during this investigation. The alert from one endpoint led to the collection of further\nevidence and clues that pointed to other infected endpoints, eventually revealing the root of the attack.\n\n[Cobalt Strike is a well-known beacon or post-exploitation tool that has been linked to ransomware families like Ryuk, DoppelPaymer,](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/the-state-of-ransomware-2020-s-catch-22)\n[and Povlsomware. The Cobalt Strike variant used here follows its typical characteristics. However, this report focuses on the process of](https://www.trendmicro.com/en_us/research/21/c/povlsomware-ransomware-features-cobalt-strike-compatibility.html)\nuncovering its tracks in order to fully contain and remove the malware.\n\nAn overview of the investigation\n\nWe first uncovered several detections related to Cobalt Strike, accompanied by a machine learning detection later verified as IcedID. In\n[such cases, the initial detections usually point to something big: the distribution of ransomware. In fact, we published a report on a](https://www.trendmicro.com/en_us/research/21/c/vision-one-tracking-conti-ransomware.html)\nsimilar case wherein we used Cobalt Strike to track a Conti ransomware campaign.\n\n\n-----\n\nBefore we delve into the details we want to detail the process we followed in this investigation. It involved several interconnected steps\nthat occurred simultaneously and repeatedly throughout the process. These steps are mainly:\n\nCreating an indicators of compromise (IOCs) list and observe for tactics, techniques, and procedures (TTPs) to check in the\nenvironment, which will be improved in the next items\nChecking the context of the generated alerts\nExamining the execution profile of the files related to the detection\nCollecting additional logs from the endpoint to correlate events\nChecking detections that occurred around the time range of the alerts\n\nThese steps allowed us to retrace the actions taken by the variant from a single endpoint and revealing the full extent and its origins.\nFigure 1 maps out the Cobalt Strike activity that we tracked; it also indicates where we started, at Endpoint-1.\n\nIt is important to note that we already provided the affected customer our initial response very early into the investigation, allowing\nthem to start taking steps to contain the threat as we worked to fully reveal its extent.\n\nInitial detections, IOCs, and observed TTPs\n\nAs we had mentioned earlier, our investigation started when we noticed suspicious activity in one endpoint. For the purpose of this\ndiscussion we shall label this endpoint as Endpoint-1, since this is where we encountered the first hints of an attack. We began our\ninvestigation from this endpoint to uncover the real entry point.\n\n**Endpoint-1**\n\nChecking the alerts of Endpoint-1 revealed several important findings that sparked the investigation:\n\nAdFind.exe was downloaded in the Users\\Public directory\nA Cobalt Strike detection occurred, as seen in Figure 1\nMobsync.exe executed information gathering commands\n\n\n-----\n\nFigure 2. Vision One’s interface showing the early indicators of Cobalt Strike\n\nFirst let us narrow our focus on the suspicious process, mobsync.exe. Vision One’s Progressive RCA allowed us to pinpoint a possible\ninfection vector that lead to its execution. The process chain for Endpoint-1 started with a user executing a file named excel.exe, which\nthen created a rundll32.exe. The rundll32.exe loaded a file named iroto.tio, leading to the execution of the aforementioned mobsync.exe,\nwhich is a legitimate MS tool hijacked via process hollowing.\n\n\n-----\n\nFigure 3. The file excel.exe shown as the source of the malware as shown in Vision One\n\nProgressive RCA gave us the choice to expand the nodes to find additional indicators that might be useful to the investigation. In this\ncase, we were interested in excel.exe, or the source; and mobsync.exe,which seemed like the final payload at that point.\n\n\n-----\n\nFigure 4. The file excel.exe accessing two URLs taken from Vision One\n\nLet us first turn our attention to the excel.exe, which we saw accessing two suspicious URLs dharamdiwan[.]com and\nlenoirramosjr[.]com before proceeding to drop iroto.tio (not shown in the Figure 3) and loading the dropped file via rundll32.exe.\n\nVision One’s Observed Attack Techniques (OAT) also showed the techniques used via excel.exe and its child processes, one of which is\n“MS Office Application Command Execution Via DDE.” Digging deeper in the Vision One console, we identified analysis-57909253.xlsx\nas the malicious XLS file that utilized DDE.\n\n\n-----\n\nFigure 5. Events related to mobsync.exe\n\nGoing back to mobsync.exe revealed several other events, as shown in Figure 5. We summarize the activities done by this injected tool.\n\nIt attempts a connection to the following IP addresses:\n\n222[.]153[.]124[.]130\n109[.]106[.]69[.]138\n\n\n-----\n\n75[.]118[.]1[.]141\n92[.]59[.]35[.]196\n104[.]98[.]42[.]5\n204[.]16[.]247[.]35 (madesecuritybusiness[.]com)\n\nIt also executed discovery/internal reconnaissance commands and spawned additional mobsync.exe processes, as shown in Table 1.\n\n|Date and Time (UTC)|Process|\n|---|---|\n|5/26/2021 0:41|whoami /all|\n|5/26/2021 0:41|cmd /c set|\n|5/26/2021 0:41|arp -a|\n|5/26/2021 0:41|ipconfig /all|\n|5/26/2021 0:41|net view /all|\n|5/26/2021 0:42|nslookup -querytype=ALL -timeout=10 _ldap._tcp.dc._msdcs.[WORKGROUP]|\n\n\n-----\n\n|5/26/2021 0:42|net share|\n|---|---|\n|5/26/2021 0:42|route print|\n|5/26/2021 0:42|netstat -nao|\n|5/26/2021 0:42|net localgroup|\n|5/26/2021 1:50|C:\\WINDOWS\\SysWOW64\\mobsync.exe|\n|5/26/2021 1:50|C:\\WINDOWS\\system32\\ping.exe -t 127.0.0.1|\n|5/26/2021 1:58|C:\\WINDOWS\\SysWOW64\\mobsync.exe|\n|5/26/2021 1:58|esentutl.exe /r V01 /l”C:\\Users\\[Endpoint-1-User]\\AppData\\Local\\Microsoft\\Windows\\WebCache” /s”C:\\Users\\ [ENDPOINT-1-USER]\\AppData\\Local\\Microsoft\\Windows\\WebCache” /d”C:\\Users\\[ENDPOINT-1- USER]\\AppData\\Local\\Microsoft\\Windows\\WebCache”|\n|5/26/2021 5:33|C:\\WINDOWS\\SysWOW64\\mobsync.exe|\n\n\n-----\n\n|5/26/2021 5:33|C:\\WINDOWS\\system32\\cmd.exe /C ping [ENDPOINT-4]|\n|---|---|\n\n\nTable 1. A list of the commands executed by mobsync.exe\n\nWe also identified Bloodhound and ADfind.exe hacking tools deployed in Endpoint-1. These tools can be used to extract information\nfrom the Active Directory.\n\nDate and Time Process\n(UTC)\n\n5/26/2021 5:00 C:\\WINDOWS\\system32\\cmd.exe /C del 20210526145501_BloodHound.zip\nYmNhMTJiMzAtYTgxZi00ZWRmLWE2ZjctZTc3MDFiZGM2ODBj.bin\n\n5/26/2021 5:04 C:\\WINDOWS\\system32\\cmd.exe /C AdFind.exe -f objectcategory=computer -csv name cn OperatingSystem\ndNSHostName > [REDACTED].csv\n\nTable 2. Bloodhound and ADfind.exe in the logs of Endpoint-1\n\nWith Vision One and the Trend Micro Investigation Toolkit (TMIK), we were able to identify potential Pass-the-Hash (PtH) attacks that\nextracts the password hash from the memory and then simply passes it through for authentication. If there are recent logins of high\nprivilege accounts in the machine, then the password hash of these logins can be extracted by attackers to perform lateral movement to\nother networked systems. The event logs also showed a related entry for the PtH technique stating, “Found 4624 event logs with seclogo\nas process for ENDPOINT-1-USER.”\n\n|Date and Time (UTC)|Process|\n|---|---|\n|5/26/2021 5:00|C:\\WINDOWS\\system32\\cmd.exe /C del 20210526145501_BloodHound.zip YmNhMTJiMzAtYTgxZi00ZWRmLWE2ZjctZTc3MDFiZGM2ODBj.bin|\n|5/26/2021 5:04|C:\\WINDOWS\\system32\\cmd.exe /C AdFind.exe -f objectcategory=computer -csv name cn OperatingSystem dNSHostName > [REDACTED].csv|\n\n\n-----\n\nFigure 6. Detection of the Pass-the-Hash technique\n\nAside from Endpoint-1, we also found several other endpoints where we identified Cobalt Strike detections. We specify another two here\nas they already contain the evidence, such as a list of IOCs and observed TTPs, that we needed to pinpoint “Patient Zero,” or the first\nmachine to be infected by the malware.\n\n**Endpoint-2**\n\nWe will label another endpoint as Endpoint-2. Endpoint-2 is a machine that Vision One also alerted to have shown Cobalt Strike\ndetection.\n\n\n-----\n\n-----\n\nFigure 7. Detection for Cobalt Strike in Endpoint-2\n\nVision One’s Execution Profile for the file shows ntoskrnl.exe executing 49c4b8e.exe. This sequence of processes in the execution profile\nimplies that the file was transferred via SMB, evidence of lateral movement which was stopped due to the detection.\n\nHunting IOCs and TTPs\n\nWith all the findings from Endpoint-1 and Endpoint-2, we were able to observe for TTPs and create an IOC list that we can search across\nall the machines reporting to Vision One. This search was based on the following indicators:\n\nFilename and hashes of the detected files\nSuspicious behavior, such as excel.exe spawning rundll32.exe or mobsync.exe spawning cmd.exe\nPossible command and control (C&C) connections\nCompromised accounts used for lateral movement and are transferred files via SMB\nDetections that occurred around the time the alert occurred (commonly used time range is Last 7 days)\n\nSearching the IOCs in the Vision One search app revealed several other machines related to this case, as shown in Figure 1. An example\nof such a machine is one that we labeled Endpoint-3.\n\nSimilar to Endpoint-1, there were malware detections in the machine, where it blocked the execution of excel.exe that spawned\nrundll32.exe. There was also a machine learning detection related to the file iroto.tio. Finally, inspecting Workbench alerts showed an\nentry for Cobalt Strike.\n\n\n-----\n\n-----\n\nFigure 8. Detection of Cobalt Strike in Endpoint-3\n\nInvestigating Endpoint-3’s execution profile showed that the excel.exe process connected to the same suspicious domains that we\nmentioned earlier. It also created the file iroto.tio.\n\n\n-----\n\nFigure 9. Enpoint-3’s execution profile showing excel.exe’s activities\n\n\n-----\n\nWith a list of IOCs and TTPs we were able to look for other infected machines or endpoints and were also then capable of narrowing\ndown Patient Zero.\n\nLocating Patient Zero\n\nSince we know for sure that the threat started with an execution of excel.exe and the .xls file it opened, it is logical to assume that the\nattack started from an email attachment, which was the case here. The Vision One, Managed XDR team was able to eventually track\ndown the entry point of this attack: a socially engineered spear phishing email sent to an internal user.\n\n\n-----\n\n-----\n\nFigure 10. Socially engineered spear phishing email\n\nThe threat actor made the email seem as if they were replying to an email the targeted user had sent them, thus making it appear as if\nthey already had an existing conversation thread. They also used a forged sender email address so that the targeted user would think\nthat the email came from a legitimate sender. The email contained a link to download a malicious archive file with the name of the\ntargeted user.\n\nFigure 11. Vision One results showing the malicious email being forwarded to another user or machine\n\n\n-----\n\nFigure 12. The message of the forwarded malicious email\n\nThrough Vision One, we were able see that a few minutes after receiving the email, the targeted user forwarded the malicious email to\nanother internal user. These results from Vision One (Figure 11) matched with the email that Managed XDR had acquired (Figure 12),\nthus proving that the machine was Patient Zero and rounding out our investigation.\n\nResponding to the threat\n\nThe overall goal of the investigation was to get a full scope of the Cobalt Strike infection. This involved identifying the IOCs we can use to\nsearch for all the machines that were infected, as well as stopping the spread at the root.\n\n\n-----\n\nAll throughout the process we had been reporting to the affected customer, especially after the discovery of each of the affected\nendpoints. This is to quickly contain the spread of the malware variant. The response to this threat included the following, in no\nparticular order:\n\nIsolation of affected endpoints as the investigation was being conducted\nDisabling/resetting the passwords of the user accounts that were used for lateral movement\nCollecting related artifacts to the threat and doing further analysis, which were also submitted for detection to improve coverage\nBlocking of domain/IP addresses related to the C&C of the threat\nFurther monitoring of the environment to ensure that there’s no suspicious activity going on\n\nMany of these steps were done simultaneous to the investigation, so as not to risk possible consequences and prevent the spread of the\nmalware to other machines.\n\nConclusion and recommendations\n\nThe result of the investigation demonstrated the importance of a multi-layered security approach in protecting the environment. This is\ncrucial so that in case one layer of protection fails another is present to keep the environment safe or at least limit the impact of an\nattack.\n\nPrioritizing detections and combining different techniques can help in catching the threat and initiating a quick response. As this case\nreflects, preliminary security events should be taken seriously as they usually are the precursor to something bigger, such as breaches\nand ransomware attacks.\n\n[The investigation also highlights the incident response process for handling breaches and malicious activities. It emphasizes how threat](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/managed-detection-and-response/cyberattacks-from-the-frontlines-incident-response-playbook-for-beginners)\nresponse does not end upon the detection of a threat; an investigation is key to understanding a threat and preventing them from\noccurring again. Using acquired knowledge from previous attacks and boosting user awareness of common threats can improve the\noverall security posture of any environment.\n\nMITRE mapping\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.07.05.cobalt_strike_tracking/Tracking%20Cobalt%20Strike_%20A%20Trend%20Micro%20Vision%20One%20Investigation.pdf"
    ],
    "report_names": [
        "Tracking Cobalt Strike_ A Trend Micro Vision One Investigation"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1625829064,
    "ts_modification_date": 1625829064,
    "files": {
        "pdf": "https://archive.orkl.eu/592860ae544200835fbe47e24e2f8120260064f6.pdf",
        "text": "https://archive.orkl.eu/592860ae544200835fbe47e24e2f8120260064f6.txt",
        "img": "https://archive.orkl.eu/592860ae544200835fbe47e24e2f8120260064f6.jpg"
    }
}