{
    "id": "b5656740-558b-442a-b8e9-e2f5af08cb83",
    "created_at": "2023-01-12T15:03:48.144847Z",
    "updated_at": "2025-03-27T02:12:54.741915Z",
    "deleted_at": null,
    "sha1_hash": "f5a1d7d2a4256d40f9c047b08af68b9950b35448",
    "title": "2022-05-09 - Dirty Deeds Done Dirt Cheap- Russian RAT Offers Backdoor Bargains",
    "authors": "",
    "file_creation_date": "2022-05-28T23:25:22Z",
    "file_modification_date": "2022-05-28T23:25:22Z",
    "file_size": 6290544,
    "plain_text": "# Dirty Deeds Done Dirt Cheap: Russian RAT Offers Backdoor Bargains\n\n**[blogs.blackberry.com/en/2022/05/dirty-deeds-done-dirt-cheap-russian-rat-offers-backdoor-bargains](https://blogs.blackberry.com/en/2022/05/dirty-deeds-done-dirt-cheap-russian-rat-offers-backdoor-bargains)**\n\nThe BlackBerry Research & Intelligence Team\n\n[1. BlackBerry ThreatVector Blog](https://blogs.blackberry.com/en.html)\n2. Dirty Deeds Done Dirt Cheap: Russian RAT Offers Backdoor Bargains\n\nIn the murky underworld of Russian crimeware, DCRat seems to be a bit of a dark horse. Unlike the well-funded, massive Russian threat\ngroups crafting custom malware to attack universities, hospitals, small businesses and more, this remote access Trojan (RAT) appears to be\nthe work of a lone actor, offering a surprisingly effective homemade tool for opening backdoors on a budget. In fact, this threat actor’s\ncommercial RAT sells at a fraction of the standard price such tools command on Russian underground forums.\n\nDCRat (also known as DarkCrystal RAT) is a commercial Russian backdoor that was first released in 2018, before being redesigned and\nrelaunched a year later. Notably, this threat appears to have been developed and maintained by a single person going by the pseudonyms of\n“boldenis44,” “crystalcoder,” and Кодер (“Coder”).\n\nSold predominantly on Russian underground forums, DCRat is one of the cheapest commercial RATs we’ve ever come across. The price for\nthis backdoor starts at 500 RUB (less than 5 GBP/US$6) for a two-month subscription, and occasionally dips even lower during special\npromotions. No wonder it’s so popular with professional threat actors as well as script kiddies.\n\nThis price range is a curious feature, as it makes it seem like the author is not particularly profit-driven. It could be that they’re simply casting\na wide net, trying to get a little money from a lot of maliciously minded people. It could also be that they have an alternative source of funding,\nor perhaps this is a passion project rather than their main source of income.\n\n### Peering Deeper into the Dark Crystal\n\nDCRat’s modular architecture and bespoke plugin framework make it a very flexible option, helpful for a range of nefarious uses. This\nincludes surveillance, reconnaissance, information theft, DDoS attacks, as well as dynamic code execution in a variety of different languages.\n\nThe DCRat product itself consists of three components:\n\nA stealer/client executable\nA single PHP page, serving as the command-and-control (C2) endpoint/interface\n\nAn administrator tool\n\n[The administrator tool is a standalone executable written in the JPHP programming language, an obscure implementation of PHP that runs](https://en.wikipedia.org/wiki/PHP)\n[on a Java virtual machine. As with the examples discussed in our previous whitepaper discussing exotic programming languages used by](https://blogs.blackberry.com/en/2021/07/old-dogs-new-tricks-attackers-adopt-exotic-programming-languages)\nmalware writers, JPHP offers some potential benefits for making mischief.\n\n\n-----\n\ns a p og a g a guage, J s ta get aud e ce s p a y e t y e e de e ope s o a e c oss p at o des top ga es e ease\nof use, as well as the portability of its code, suits this purpose well. The malware author may have chosen this format because it’s not\nparticularly well-known, or they might have lacked programming skills in other, more mainstream languages.\n\nAccording to the [JPHP documentation, this implementation “compiles PHP sources to Java Virtual Machine (JVM) bytecode, which can then](https://github.com/jphp-group/docs/blob/master/index.rst)\nexecute on the JVM.” The JPHP project also provides a dedicated, Russian-language integrated development environment (IDE) called\nDevelNext. This IDE was used to develop the DCRat administrator tool, as well as some of the early versions of the DCRat client.\n\nLocation data available in public GitHub profiles indicates the core contribution team behind JPHP are overwhelmingly based in the\nCommonwealth of Independent States (CIS), an intergovernmental organization made up of twelve post-Soviet countries. The DCRat\nauthor’s decision to use JPHP may have stemmed from either an assumed level of trustworthiness, or simply from a belief that obtaining\nsupport for issues or enhancements related to the JPHP framework would have been easier to establish due to their shared familiarity with\nthe Russian language.\n\n### Examining the DCRat Build\n\nThe DCRat client binary – meant for delivering to victim’s machines – is written in .NET. Earlier versions were written in JPHP, like the\nadministrator tool. This was likely done to streamline and optimize the client component. JPHP is rather slow, as it runs on the JVM. And the\ndistributed malware is much smaller, since it doesn’t have to include all the JPHP libraries.\n\nDCRat is built around a modular architecture that incorporates a plugin framework. Affiliates can generate their own client plugins, which can\nbe downloaded and used by subscribers. (We’ve included a list of the current plugins in the “Plugins” section, later on in this blog.)\n\nThe RAT currently seems to be under active development. The administrator tool and the backdoor/client are regularly updated with bug fixes\nand new features; the same applies to officially released plugins.\n\n[During recent months, we’ve often seen DCRat clients being deployed with the use of Cobalt Strike beacons through the Prometheus TDS](https://blogs.blackberry.com/en/2021/11/all-your-beacon-are-belong-to-us-new-blackberry-book-cracks-code-of-cobalt-strike-threat-actors)\n(traffic direction system). Prometheus is a subscription-based malware service that has been used in many high-profile attacks, including\ncampaigns against U.S. government institutions in 2021.\n\n[A detailed analysis of the DCRat client was published by Mandiant in May 2020. Just days after this report was released, the malware author](https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor)\nshifted distribution of the RAT to a new domain. It’s clear that cybercriminals are becoming more aware of publicity from media and the\nsecurity community, and they’re getting used to making swift changes in response to this unwanted exposure.\n\nIt’s worth noting that there is a second open-source RAT that also goes by the name DcRAT, which can be found in GitHub repository of user\n“qwqdanchun.” This is most likely a completely unrelated project. While it doesn’t bear many code similarities to DCRat, it may have been an\ninspiration for – or inspired by – the threat.\n\n### DCRat Offering\n\nThe DCRat bundle, its plugins, plugin development framework, and additional tools are currently hosted on crystalfiles[.]ru. These\ncomponents have been moved there from their previous location at dcrat[.]ru. The crystalfiles website features a simple interface, as seen in\nFigure 1 below, and it serves only as the download point for the RAT. It has no additional information or resources for potential or existing\nclients.\n\n_Figure 1 – Download links for DCRat components at crystalfiles[.]ru_\n\n\n-----\n\nC at a et g a d sa es ope at o s a e do e t oug t e popu a uss a ac g o u o [ ]gu u, s o gu e, c a so\nhandles some of the DCRat pre-sales queries. DCRat support topics are made available here to the wider public, while the main DCRat\noffering thread is restricted to registered users only.\n\n_Figure 2 – lolz[.]guru forum – discussions about DCRat_\n\nIt’s possible that the RAT is also sold on other restricted-access forums or on the dark web. The DCRat archives have been spotted on other\nURLs, and they’ve been shared through Discord instant messaging. The most common file name for distribution, across different versions of\nthe RAT, seems to be “1ac770ea1c2b508fb3f74de6e65bc9c4.zip.”\n\nAll news and updates for DCRat are announced through a dedicated Telegram channel, as seen in Figures 3 and 4 below. At the time of\nwriting, the channel had almost 3k subscribers.\n\n\n-----\n\n_Figure 3 – DCRat Telegram page providing news and updates_\n\nBesides the DarkCrystalRAT Telegram account, there are also two Telegram bots: one for processing sales requests (“DCRatSeller_bot”),\nand one for technical support (“CrystalSupport_bot”).\n\nThe latest prices for DCRat licenses (excluding any temporary discounts) are:\n\n500 RUB / US$5 for two-month license\n2200 RUB / US$21 for a year\n4200 RUB / US$40 for a lifetime license\n\n\n-----\n\n_Figure 4 – DCRat Telegram announcing discounts and price specials_\n\n### The Author\n\nWhile the DCRat developer posts as Кодер (\"Coder\") on the lolz[.]guru forum (as shown in Figure 5), their Telegram handle is “@boldenis”\nand their GitHub username is “boldenis44” (based on a resource link buried in the DCRat source code shown in Figure 6). They must have\nused the latter name on lolz[.]guru at some point, as some users still refer to them as such. They list their email address as\ncrystalcoder[at]exploit[.]im. The date of birth and address listed on their profile shown in Figure 5 below are most likely fake.\n\nThe lolz[.]guru forum profile indicates the developer is Russian and works alone.\n\n\n-----\n\n_Figure 5 – DCRat author's bio on underground forums_\n\n_Figure 6 – GitHub page under the same account name as DCRat author_\n\n“Boldenis44” also has accounts on game-hacking forum blast[.]hk, the Russian Minecraft server gamai[.]ru, as well as on the Russian dark\nmarketplace DarkNet[.]ug, shown in Figure 7.\n\n\n-----\n\n_Figure 7 – Search results for \"boldenis44,\" author of DCRat_\n\nThere is also a “Darkcrystal Rat” profile on VKontakte, a Russian social network at vk[.]com (dcrat_1994), but it’s unclear if it belongs to the\nsame person as boldenis44 / Coder. This profile page is shown below in Figure 8.\n\n\n-----\n\n_Figure 8 – VKontakte profile page for Darkcrystal Rat_\n\nThe description in Russian translates roughly to “I steal data, I work on ru, uk and what?” It’s not entirely clear what this means, though it’s\nlikely they’re bragging about stealing data from Russia, the UK, and possibly other countries.\n\n[The photo in this profile comes from a 2014 German hacker movie called “Who Am I: No System is Safe.” This photo has recently been](https://www.imdb.com/title/tt3042408/)\nchanged – the cached version of this website shows an image (see Figure 9) that is a relatively popular depiction of a hacker, and the\nRussian sentence that somewhat cryptically translates to: “I drive SS into Dark.”\n\n\n-----\n\n_Figure 9 – Google Cache view of an earlier version of the Darkcrystal Rat profile_\n\nAnother malware writer, claiming to be the author of a [notorious RAT called njRAT, recently changed their profile photo to the same frame](https://blogs.blackberry.com/en/2021/08/threat-thursday-dont-let-njrat-take-your-cheddar)\nfrom \"Who Am I,” as shown in Figure 10.\n\n\n-----\n\n_Figure 10 – Facebook page of njRAT author, featuring the same avatar as Darkcrystal Rat profile_\n\nThis is most likely a coincidence, as the njRAT profile is written by someone who speaks Arabic, not Russian.\n\nThere was another profile on the VKontakte site that has been spotted mentioning the crystalfiles[.]ru URL, as shown in Figure 11, which was\nfor Rodion Balkanov (Родион Балканов): https[:]//vk[.]com/bagyuvix. However, this account has since been removed and is no longer\navailable.\n\n\n-----\n\n_Figure 11 – Google view of VKontakte page mentioning DCRat distribution URL_\n\n### The Timeline\n\nAlthough the DCRat project appears to have started several months in advance, a larger scale marketing campaign took place in September\n2019, when the Telegram channel was created and the dcrat[.]ru domain registered. Shortly after this, the RAT got significantly redesigned to\nsupport plugins in a bespoke format.\n\nThe next major release came in May 2020 (version 3.0), followed by version 4.0 in March 2021. In between major releases, the RAT got\nsmaller updates and bug fixes on a very regular basis, hinting that the author was highly engaged with his creation during this timeframe, as\nshown below.\n\n**July 31, 2018 – Кодер (\"Coder\") profile created on lolz[.]guru forum**\n**Sept. 1, 2019 – Telegram channel called DarkCrystalRat created**\n**Sept. 2, 2019 – dcrat[.]ru registered (see Figure 12)**\n\n\n-----\n\n_Figure 12 – dcrat[.]ru domain whois information_\n\n**Sept. 4, 2019 – Introduction of a bespoke plugin format: DCLIB**\n**Nov. 19, 2019 – Redesign of the administrator tool**\n**May 12, 2020 – Mandiant publishes analysis of DCRat client**\n**May 27, 2020 – crystalfiles[.]ru registered; distribution shifts to the new domain**\n\n\n-----\n\n_Figure 13 – crystalfiles domain whois information_\n\n**May 30, 2020 – Version 3.0 released**\n**Oct. 2020 – Release of DCRat Studio, a bespoke platform that allows third-party developers to design plugins**\n**March 18, 2021 – Version 4.0 released**\n**Dec. 31, 2021 – Limited-time 50% discount on all types of licenses, as a New Year’s Eve deal**\n**March 6, 2022 – Due to devaluation of ruble, pricing changed from rubles to dollars at an exchange rate of US$1 = 100 RUB**\n**March 28, 2022 – Limited-time price discount for two-month, one-year, and lifetime licenses to $5, $19, and $39, respectively.**\n\nNew plugins and minor updates are announced almost every day.\n\n### The RAT Administrator Tool\n\n\n-----\n\ne a a e aut o c ose to de e op t e s ad st at o too J us g a c e uss a ca ed e e e t e e e t\ncompiles the PHP program into a Java bytecode, which can then be executed on the JVM.\n\nAccording to its GitHub page, the IDE is still in the beta stage, and it’s only available in the Russian language at this point. In the past, we’ve\nseen very few malware samples written in JPHP, because the executables it produces are both exceptionally large and slow to run.\n\nOne example of malware using this IDE is a rudimentary backdoor called IceRAT, discovered in early 2020. This malware targeted Russian[speaking victims by installing crypto-mining software on their endpoints. An older example is one that was written for OSX as part of a](https://www.gdatasoftware.com/blog/icerat-evades-antivirus-by-using-jphp)\n[campaign targeting Jaxx cryptocurrency wallets, which was discovered in 2018.](https://www.darkreading.com/risk/malware-campaign-targeting-jaxx-wallet-holders-shut-down)\n\n### Contents of the Archive\n\nThe administrator tool comes as a ZIP archive with the following structure:\n\n**File name** **Description**\n\nDCRat.exe Admin launcher (created using Launch4j wrapper)\n\ndcrat_updservice.exe Admin updater tool\n\nupdatelauncher.bat Script that executes dcrat_updservice.exe\n\nNotify.wav Audio file with notification sound (2.5 sec)\n\ndata/ Location of helper utilities\n\ndesign/ Contains DeleteAll_legacy.json file\n\nlib/ Location of all the Java modules of the builder\n\nplugins/ Used to store downloaded plugins; by default, contains only a test plugin\n\nprofiles/ Empty directory used to store user’s saved profiles\n\nThe lib directory is home to the main builder module, together with several legit JPHP modules that the builder depends on.\n\n**SHA256 hash** **Description**\n\n9967ea3c3d1aee8db5a723f714fba38d2fc26d8553435ab0e1d4e123cd211830 JSON module\n\n6014d44d8f7da00f03db051b3dcea9a03ec3837977118c69a4512ef558a6df2a Main builder module\n\ncf4068ebb5ecd47adec92afba943aea4eb2fee40871330d064b69770cccb9e23 GUI module\n\n5b37e8ff2850a4cbb02f9f02391e9f07285b4e0667f7e4b2d4515b78e699735a JPHP core module\n\n4aef566bbf3f0b56769a0c45275ebbf7894e9ddb54430c9db2874124b7cea288 zend module\n\nd637e3326f87a173abd5f51ac98906a3237b9e511d07d31d6aafcf43f33dac17 jfoenix module\n\nc25d7a7b8f0715729bccb817e345f0fdd668dd4799c8dab1a4db3d6a37e7e3e4 javafx module\n\n2d43eb5ea9e133d2ee2405cc14f5ee08951b8361302fdd93494a3a997b508d32 Google gson module\n\n15f36830124fc7389e312cf228b952024a8ce8601bf5c4df806bc395d47db669 PHP module\n\n\n-----\n\n9c287472408857301594f8f7bda108457f6fdae6e25c87ec88dbf3012e5a98b6 JPHP PHP runtime module\n\n434e57fffc7df0b725c1d95cabafdcdb83858ccb3e5e728a74d3cf33a0ca9c79 XML module\n\n0f26584763ef1c5ec07d1f310f0b6504bc17732f04e37f4eb101338803be0dc4 JPHP SDK module\n\n4bec0794a0d69debe2f955bf495ea7c0858ad84cb0d2d549cacb82e70c060cba javafx module\n\n03ead999502aefbf1380bd2e9c4a407acb7a92a7b2fe61f6995aba3fca85efd4 objectweb asm module\n\nBuilder’s entry point is specified in <main_module>.jar/.system/application.conf and points to dct/forms/MainForm.phb.\n\n# MAIN CONFIGURATION\n\napp.name = DCRat2.0\n\napp.uuid = fabb4b64-bb3a-4418-a495-a0e669188d81\n\napp.version = 1\n\n# APP\n\napp.namespace = dct\n\napp.mainForm = MainForm\n\napp.showMainForm = 1\n\napp.fx.splash.autoHide = 0\n\nThe data directory contains a bespoke compiler for producing the client executable, a bespoke EXE obfuscation tool, a commercial .NET\nprotection tool called .NET Reactor, and compression utilities WinRAR and UPX.\n\n**SHA256** **File name** **Description**\n\nd0680ac62e94f953df031533acd0acb718ad8494f938d84198c655507709e5df 7zxa.dll Legit 7zip DLL\n\n914cca033fc8ca52830a21b5dca55263cee1e74ab5571702906ee9c25aedafd7 DCRAC.exe DCRat EXE\nobfuscator\n\n\n812cd4b5e80bc4e83a2e01a6f3fb24346ecf57dcaf8ff6fc3e55a2a6b953da23 DCRCC.exe,\nDarkCrystalRATCSharpCompiler.exe\n\n\nDCRat compiler\n\n\nb11ad1adfa96eacf5f18cf87785884947a6d35a1baebf4f20f16402b04d5109f Default.SFX Part of WinRAR\n\na0b6bb521e52a99abf5ac1017302da014d37296619078d42d9edf5d86d137f63 NCC2.dll Part of .NET\nReactor\n\n38274608d5a4b53ec22f8099f798ba46ce0ed41db65a33dfb3853f0dbf849f6f NCC3.dll Part of .NET\nReactor\n\nc41cd461470ff3c936e225cea37e5190cb06e3cd70a3d76ca8e5d3aceead5493 NCCheck.dll Part of .NET\nReactor\n\n770d7b5e40ed9b0aff5d0e3fc2ccf9ba10d4925d3441f38b71a35bd26e6e8d98 Rar.exe Part of WinRAR,\nsigned\n\n35a21f1aebf8ea0ab9be1814131fec1fa079d91b701e505054b69eccbdfd0732 RarExt.dll Part of WinRAR,\nsigned\n\ndb28575f61b1adc88a28ae51ce3b00226e4974ca60894896e414ea408c6ff9fe RarExt64.dll Part of WinRAR,\nsigned\n\n\n-----\n\nca08ed8423afda4b41757a1f3adf4f855732dc0628fe2ea5d8a96b13f56b9f84 WinCon.SFX Part of WinRAR,\nsigned\n\n2293fe261d5c6f5f2a33004b11f068037677b7aa5a6f792031e31555f31f0d69 Zip.SFX Part of WinRAR\n\n83445595d38a8e33513b33dfc201983af4746e5327c9bed470a6282d91d539b6 dnlib.dll DNLib - .NET\nassembly\nreader/writer\nlibrary\n\ne817802f166662a7df0b144571354d74b10e34d120f91ae9d84ca3ba925241c6 dotNET_Reactor.Console.exe Part of .NET\nReactor\n\n78684aea83b1a5c402a87ba0ce2e7ad5b0338462cc804e97369203ce53d29834 dotNET_Reactor.exe Part of .NET\nReactor\n\n5981e508e89c65c445fca892e91b8ec39b1d8563804d0999d963d640aa592444 enc.vbe Script used to\nencode VBS\nscripts\n\nd634cde09d1aa1320a1d4c589d35d306f8350129faf225b2bca394128c2c4442 upx.exe UPX 3.96\nWindows 32-bit\n\n1317d70682bd11e5d320af850d6ecbb5a70c200d626ec7bf69c47566894db515 wRar.exe Part of WinRAR,\nsigned\n\n### PHB file format\n\nInstead of Java class files, the JPHP JAR archives are composed mainly of PHB files.\n\nPHB is a custom file format used exclusively by JPHP. PHB files are simply archives that contain uncompressed, unencrypted Java class files\nand a PHB header. Each Java class file is preceded by a class file header, containing information such as module name, method names,\nPHP file path, and the class file length.\n\nClass files can be extracted with the following Python script, then decompiled using tools such as JAD or jd-gui.\n\nimport os\n\nimport sys\n\nimport struct\n\nin_file = sys.argv[1]\n\nout_dir = os.path.splitext(in_file)[0] + \"_extracted\"\n\nin_size = os.path.getsize(in_file)\n\nos.mkdir(out_dir)\n\nwith open(in_file, 'rb') as f:\n\nbuf = f.read()\n\nmagic = b'\\xCA\\xFE\\xBA\\xBE'\n\noffsets = [i for i in range(len(buf)) if buf.startswith(magic, i)]\n\ncount = 0\n\nfor of in offsets:\n\nfile_name = os.path.splitext(in_file)[0] + \"_\" + str(count) + \".class\"\n\nf.seek(of - 4)\n\nclass_len = struct.unpack('>i', f.read(4))[0]\n\nfile_data = f.read(class_len)\n\nwith open(os.path.join(out_dir, file_name), \"wb\") as f2:\n\nf2.write(file_data)\n\ncount += 1\n\n### PHB file structure (example):\n\n\n-----\n\n1C 9A 4A 92     PHB signature\n\n01 33 53 D3\n\n00 00 00 00\n\n00 00 00 33\n\n00 33           len of the following string\n\n44 3A 5C 49     string \"D:\\IdeaProjects\\DCRat2.0\\src\\dct\\forms\\MainForm.php\"\n\n[...]\n\n00 00 00 2D\n\n00 2D          len\n\n24 70 68 70     \"$php_module_mba8a6a7b4b0144048b64e6456cd9fb81\"\n\n[...]\n\n00 01\n\nFF FF FF FF\n\nFF FF FF FF\n\n00 07          len\n\n55 6E 6B 6E     \"Unknown\"\n\n[...]\n\n00 00 00 00\n\n00 00 03 4F     number of class files\n\n00 00 00 36     start of class file header #1\n\n00 36          len\n\n24 70 68 70     \"$php_module_mba8a6a7b4b0144048b64e6456cd9fb81_closure0\"\n\n[...]\n\n00 00 00 00\n\n00 00 00 00\n\nFF FF FF FF\n\n00 00\n\nFF FF FF FF\n\nFF FF FF FF\n\n00 01\n\n00 00 00 00\n\n00 00 00 08\n\n00 08          len\n\n5F 5F 69 6E     \"__invoke\"\n\n76 6F 6B 65\n\n00 00 00 08\n\n00 08          len\n\n5F 5F 69 6E     \"__invoke\"\n\n76 6F 6B 65\n\n01 00 00 00\n\n39 00 00 00\n\n18\n\n00 33           len\n\n44 3A 5C 49     \"D:\\IdeaProjects\\DCRat2.0\\src\\dct\\forms\\MainForm.php\"\n\n[...]\n\n00 00 0A 98     len of class file #1\n\nCA FE BA BE     start of class file #1\n\n[...]\n\n00 00 00 36     start of class file header #2\n\n00 36          len\n\n24 70 68 70     \"$php_module_mba8a6a7b4b0144048b64e6456cd9fb81_closure1\"\n\n[...]\n\n00 00 00 00\n\n00 00 00 00\n\nFF FF FF FF\n\n00 00 FF FF\n\nFF FF FF FF\n\nFF FF 00 01\n\n00 00 00 00\n\n00 00 00 08\n\n00 08          len\n\n5F 5F 69 6E     \"__invoke\"\n\n76 6F 6B 65\n\n00 00 00 08\n\n00 08          len\n\n5F 5F 69 6E     \"__invoke\"\n\n76 6F 6B 65\n\n01 00 00 00\n\n40 00 00 00\n\n18\n\n00 33           len\n\n44 3A 5C 49     \"D:\\IdeaProjects\\DCRat2.0\\src\\dct\\forms\\MainForm.php\"\n\n[...]\n\n00 00 0A 9B     len of class file #2\n\nCA FE BA BE    start of class file #2\n\n[...]\n\n\n-----\n\n### Licensing\n\nThe DCRat administrator tool, shown below in Figure 14, prevents unauthorized use through a series of online license checks. Once these\nchecks succeed, the administrator interface becomes available.\n\n_Figure 14 - Administrator tool license checks preventing unauthorized use_\n\nThe checks consist of HTTPS queries to the hardcoded domain dcrat[.]ru.\n\n### Peer Validation\n\nThe first validation check transmits a random 64-character value, hashed and Base64-encoded prior to transmission. The response from the\nC2 server must contain the same value, and it must be similarly hashed and encoded to be considered valid. This exchange provides\nrudimentary peer validation, ensuring the administrator tool is communicating with a genuine DCRat license server.\n\n### Subscriber Validation\n\nA second HTTPS request authenticates the computer on which the administrator tool is running, as shown in Figure 15. A handful of host\nproperties are collected to generate a unique fingerprint. This is transmitted to dcrat[.]ru and will (presumably) match against a valid\nsubscriber entry.\n\n_Figure 15 – License validation HTTPS queries to dcrat[.]ru domain_\n\n### Kill Switch\n\nThe administrator tool also performs an unusual final HTTPS check to a public resource hosted on GitHub, under the personal space of\n“boldenis44.” The query and response functions have a global “kill switch,” as shown in Figure 16. At the DCRat author’s discretion, flipping\nthis switch would render all instances of the DCRat administrator tool unusable, irrespective of subscriber license validity (so much for that\n“lifetime license”!).\n\n\n-----\n\n_Figure 16 – GitHub-hosted master kill switch; still active_\n\nThis kill switch feature was found in separate administrator tool builds dated mid-2021 and early 2022.\n\n### Administrator Functions\n\nThe administrator tool allows a subscriber to take the following actions:\n\nLogin to an active C2 server\nIssue Tasks to registered client installations\nGenerate builds of the Loader and/or Client\nView and query installation statistics\nSubmit bug reports to the DCRat author\n\nLogin needs to be performed to an active C2 server hosting the backend PHP, as shown in Figure 17.\n\n\n-----\n\n_Figure 17 – License checks complete; now authentication to hosted C2_\n\nLogin parameters follow an obscure syntax:\n\nhttp://<server>/@<reversed_base64_PHP_pagename_minus_php_suffix>\npassword\n\n### Fake News?\n\nFor reasons that are not entirely clear, the DCRat author implemented a function that displays a randomly generated number of “Servers\nworking” and “Users online” that are meant to appear as statistics in the background of the administrator tool. It could be that they are trying\nto make their tool appear more popular, or that they just didn’t know how to implement an accurate counter and have employed a pseudocounter in the meantime as a placeholder.\n\n### Admin Functions\n\nFollowing authentication, the administrator tool begins polling the C2 for details of connected and infected hosts.\n\nFunctions are grouped using tabs, as shown in Figure 18:\n\n_Figure 18 – Administrator tool major functions tab_\n\n### Users\n\nThis tab lists the active/registered installations of DCRat client running on infected hosts. The list is updated using a periodic poll to the C2.\n\n### Builder\n\nThis tab is where the threat actor can configure (and generate) builds of the DCRat client executable. In the analyzed version of the\nadministrator tool, the “core” of the client is downloaded from the dcrat[.]ru domain as a Base64 string, becoming input for “DCRCC.exe.”\n\n\n-----\n\n_Figure 19 – Administrator tool configuration page for client runtime settings_\n\nThese are the available parameters for configuration:\n\n**Network:**\n\nSpecifies a list of primary and secondary C2 hosts (transport protocols are limited to HTTP/S).\n\n**Protect: (shown in Figure 19)**\n\nOptional obfuscation of generated client binaries using .NET Reactor\n\nMutex name to use during execution – by default it’s a random 20-character alphanumeric string preceded by DCR_MUTEX prefix\n\nDCR_MUTEX-<20_ALPHANUM_RAND>\n\nDisable Windows Task Manager via Registry entry (see IoC)\n\nSpecify (spoof) PE creation time stamp\n\nLaunch delay in seconds\n\n**Plugins:**\n\nConfigure and enable DCRat plugins\n\n**Installation:**\n\nPath for unpacking modules when DCRat client runs\n\nPersistence mechanism to use\n\nFirst start command script to use\n\nTag value to appear on hosts running DCRat build (i.e., campaign ID)\n\nAuto functions – functions to start automatically after launch:\n\nStealer\n\nKeylogger\n\nUninstall (auto-delete)\n\nForce Admin – try to force admin rights on launch\n\nBuild Cache Storage\n\n**Build:**\n\nOptional UPX compression of the build\n\nFile extension to use\n\nPE file icon\n\n\n-----\n\n### oade\n\nConfigure and build a DCRat loader binary. Support is provided for a range of stackable “Actions” combining to determine runtime behavior:\n\nDownload file\nExecute file\n\nHTTP request\n\nCMD Script\n\nWait\n\nMessage Box\n\n### Tools\n\nProvides file upload and Netscape to JSON cookie converter.\n\n### Settings\n\nConfigure Builder settings:\n\nChange GUI background image\nAutomatically poll C2 for connected (infected) hosts/installs\n\nShow notifications\n\n### Statistics\n\nCanned reports to query DCRat client installations (country, Windows version, etc.)\n\n### USER-ID\n\nWe cannot confirm at present what this function is for. It’s possible that this is a direct remote control/terminal client to an infected host.\n\n### Bug Report\n\nSubmit bug report to DCRat maintainer(s).\n\n### Tasks\n\nConfigure Tasks to be executed on one or more DCRat clients. Tasks can be Saved (exported) or Loaded (imported) from text file. Tasks are\nstored as a reversed Base64 string.\n\n### Global Functions\n\nConfigure Tasks to be performed on all registered DCRat clients.\n\n### DCRat Client\n\nIn this section we review the features of the DCRat client (stealer) and the DCRat Loader. Runtime behavior for both is configured using the\nDCRat administrator tool.\n\n### Client Loader\n\nThe administrator tool provides a function to generate a DCRat “Loader” executable. In the version we analyzed, generation of a loader in\nDLL format was not supported. It’s conceivable the author could add this support in newer builds.\n\nThe behavior of the Loader when executed is configured via one or more canned “Actions,” as shown in Figure 20. A typical build might be a\ncombination of “Download File,” “Wait” and “Execute File,” which would silently pull down a file and then run it after waiting long enough to\navoid arousing suspicion.\n\n\n-----\n\n_Figure 20 – Runtime tasks for DCRat loader, configured using the Aadministrator tool_\n\nThe source code for the Loader is embedded within the administrator tool as a series of Base64 strings that decode to reveal C# source\ncode. Code for the executable is selected based on the Actions chosen by the user. The bundled “DCRCC.exe” generates the executable.\n\nIf selected, the generated executable will be protected using DotNET Reactor:\n\n“-control_flow_obfuscation 1 -flow_level 9 -resourceencryption 1 -stringencryption 1 -suppressildasm 0 -all_params 1 -obfuscate_public_types\n1 -exception_handling 0”\n\n### Persistence\n\nPersistence for DCRat is limited to common Windows \"autorun” locations:\n\n1. Registry, using HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n2. Registry, using HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\n3. Registry, using HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon (REG_SZ: “Shell”)\n4. Scheduled Task /ONLOGON\n5. Scheduled Task /sc minute RandomMinMax(5,15)\n\nThe client executable copies itself to the System drive root (e.g., C:\\) using the name of a randomly chosen running process, excluding\n“svchost.exe.”\n\n### Config\n\nDCRat’s config is embedded in the client binary as a Base64-encoded string resource. It has a JSON format and contains C2 URLs, a tag, a\nmutex name and a few execution options, as well as plugin-specific configuration options for included plugins.\n\n**Name** **Type** **Description**\n\n**H1** string Primary C2 URL\n\n**H2** string Secondary C2 URL\n\n**TAG** string A tag specified at build time (e.g., victim ID, campaign ID, etc.)\n\n**MUTEX** string Mutex name; by default it's a random alpha-numeric value preceded by \"DCR_MUTEX-\" prefix, but\nit can be set to any string\n\n**DBG** bool Debugging on/off\n\n\n-----\n\n**BCS** int Build cache storage size\n\n**AUR** int _Exact use unknown; controls file rename/persistence behaviour_\n\n**AS** bool Auto-stealer on/off\n\n**AK** bool Auto-keylogger on/off\n\nbool Auto-uninstall\non/off\n\n**PLUGINCONFIGS** object Plugin-specific configuration options\n\nBelow is an example config found in a sample distributed through the Prometheus TDS:\n\n{\n\"H1\": \"http[:]//co44089.tmweb[.]ru\n/9rsk8lug9peq4f23cjhyo3fz2q7j81vhnvil6c6tjdc7adzbia1ki04d9p65b5wfe4ronb0rtm/4vsyc5bajheyp1gt5i63igklh15828uwuwsek0x0p9frsqy1l2boc3\n\"H2\": \"http[:]//co44089.tmweb[.]ru\n/9rsk8lug9peq4f23cjhyo3fz2q7j81vhnvil6c6tjdc7adzbia1ki04d9p65b5wfe4ronb0rtm/4vsyc5bajheyp1gt5i63igklh15828uwuwsek0x0p9frsqy1l2boc3\n\"TAG\": \"GFN\",\n\n\"MUTEX\": \"DCR_MUTEX-bQ2or3bMKAwvUmZaLKHY\",\n\n\"DBG\": false,\n\n\"BCS\": 0,\n\n\"AUR\": 1,\n\n\"AS\": true,\n\n\"AK\": true,\n\n\"AD\": false,\n\n\"PLUGINCONFIGS\": {\n\n\"MessageOnStartConfig\": {\n\n\"caption\": \"GFN hacker\",\n\n\"text\": \"Wait 10 minutes\",\n\n\"icon\": \"Information\",\n\n\"buttons\": \"OK\",\n\n\"uniq\": \"chpf05oqbupjilp1ccxqb65xf\"\n\n},\n\"XMRigMinerCFG\": {\n\n\"SavePuth\": \"C:/WindowsDefender/RunShell.exe\",\n\n\"Gate\": \"xmr.pool.minergate.com:45700\",\n\n\"UserName\": \"Fuzzii2739@gmail.com\",\n\n\"Password\": \"x\",\n\n\"DopArguments\": \"--donate-level=1 --pause-on-battery\",\n\n\"CPUPriority\": \"0\",\n\n\"cpumaxthreadshintn\": \"25\",\n\n\"mode\": \"light\"\n\n}\n\n}\n\n}\n\n### Host Fingerprint\n\nAs part of initial registration, the DCRat client reports a range of host attributes to its C2. This information is determined using a combination\nof WMI, .NET-provided instrumentation classes, and Windows registry queries:\n\nHost computer name\nHost username\nWindows product/version\nTag value (embedded; campaign id)\n\nIs Administrator\n\nVideo card name(s)\nCPU Product/Vendor\nLocal, network, removable drive labels\n\nHas microphone\n\nInstalled webcam(s)\nActive Window text\n\n\n-----\n\nCou t y, C ty, at/ o g (geo p)\nAntivirus product(s) installed\nFirewall product(s) installed\nBIOS manufacturer\nMotherboard manufacturer\nCPU Vendor\nPhysical memory\nNetwork interfaces (IP, WiFi/Ethernet)\n.Net version installed\n\n_Figure 21 – DCRat stealer WMI query to identify webcam devices as part of host fingerprinting_\n\nAll HTTPS transactions use a random User Agent, picked from an embedded array of 12:\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45 Safari/537.36\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:94.0) Gecko/20100101 Firefox/94.0\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:95.0) Gecko/20100101 Firefox/95.0\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4638.69 Safari/537.36\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.93 Safari/537.36\",\n\n\"Mozilla/5.0 (Windows NT 10.0; rv:91.0) Gecko/20100101 Firefox/91.0\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.55\nSafari/537.36 Edg/96.0.1054.34\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4638.69\nSafari/537.36 Edg/95.0.1020.53\",\n\n\"Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45 Safari/537.36\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4638.69 Safari/537.36\nOPR/81.0.4196.60\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45\nSafari/537.36 Edg/96.0.1054.29\",\n\n\"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:91.0) Gecko/20100101 Firefox/91.0\"\n\n### Stealer Functionality\n\nThe Stealer functions of DCRat are pre-configured using the administrator tool “Builder.” Stealer “Tasks” define the sequence of operations\ncarried out during theft of stored information:\n\nDCRat can steal from the following sources (including those pictured in Figure 22):\n\nBrowser cookies\nBrowser stored passwords\nBrowser stored form content\n\nBrowser history\n\nStored credit cards (via Windows DPAPI & Chrome SQLite Database)\nTelegram\n\nSteam account\n\nDiscord tokens\n\nFileZilla credentials\n\nScreenshots\n\nKeylogger\n\nClipboard contents\n\nSysinfo\n\n\n-----\n\n_Figure 22 – Categories of information stolen by DCRat client_\n\nThe Stealer component is also capable of running bespoke plugins, making it extensible to accommodate information malware authors find\non specific targets.\n\n### Denial of Service\n\nThe DCRat Stealer contains primitive, multi-threaded code to perform different forms of DOS attacks – including HTTP(S) POST, UDP and\nTCP – to a specific host and endpoint combination.\n\n### Delay Tactics\n\nCommon to many malware families, DCRat employs the use of Windows command line tools to perform execution delays. Associated with\nthe execution of DCRat client are invocations of the Windows command line tool for time service configuration, w32tm. When configured with\nsuitable command line arguments, as shown in Figure 23, it can act as a delay mechanism. In the case of DCRat, arguments are passed that\nact as 10 second delays. Coincident instances of w32tm in endpoint XDR could be a possible, albeit somewhat weak, signal of DCRat client\nexecution:\n\n_Figure 23 – Delay commands used when self-terminating_\n\n### Plugins\n\nPlugins can be designed by third-party developers with the use of a dedicated IDE called DCRat Studio. Official plugins are available to\ndownload from crystalfiles[.]ru (as shown in Figure 24) and their functionality includes data exfiltration/credential stealing, system\nmanipulation, and cryptocurrency mining.\n\n\n-----\n\n_Figure 24 – Plugins available to subscribers for download_\n\nTo harness the power of crowd-sourced development and to encourage an ecosystem of plugins that target different information stores,\nDCRat subscribers have access to a list of supported third-party plugins. The precise inner workings of each plugin are unknown, but the\nname of each does provide an indicator of function:\n\nAutoKeylogger (deprecated)\n\n\n-----\n\nt ( e ged t t a ys s)\nMiscInfoGrabber\nWebBrowserPassView\nRunOnce\nDesktopGrabber\nStartupPlus\nAntiKiller\nAntiSNG\nBlockInput\nMessageOnStart\nClipboardLogger\nRegEditor\nFileSearcher\nFileGrabber\nTitleKiller (deprecated)\nProcessKiller\nCryptoStealer\nTelegramNotifier\nAntiAnalysis\nClipper\nCountryBlackList\nVPNGrabber\nForceAdmin\nSystemRestorePointsCleaner\nUserPingCounter\nActiveWindowNotifier\nFakeSteamWindows\nDiscord notifications (third party)\nIgnorTags (third party)\nKryptex Miner (third party)\nXMRig (third party)\n\n### Conclusions\n\nThe biggest, flashiest threat groups might get their name in lights, but they aren’t necessarily the cybercriminals that keep security\npractitioners up at night. The scary, cutting-edge threats that come out of those advanced and well-funded threat groups do occasionally\ncause headaches for those of us who aren't guarding state secrets or ridiculous amounts of money. But miscreants with too much time on\ntheir hands can often cause just as much hassle.\n\nGenerally speaking, you get what you pay for, even in malware. If you pay a pittance for something, you would be wise to expect it to be less\nfunctional or poorly supported. But DCRat seems to break that rule in a way that’s deeply perplexing.\n\nThis RAT’s code is being improved and maintained daily. If the threat is being developed and sustained by just one person, it appears that it’s\na project they are working on full-time.\n\nThere are certainly programming choices in this threat that point to this being a novice malware author who hasn’t yet figured out an\nappropriate pricing structure. Choosing to program the threat in JPHP and adding a bizarrely non-functional infection counter certainly point in\nthis direction. It could be that this threat is from an author trying to gain notoriety, doing the best with the knowledge they have to make\nsomething popular as quickly as possible.\n\nWhile the author’s apparent inexperience might make this malicious tool seem less appealing, some could view it as an opportunity. More\nexperienced threat actors might see this inexperience as a selling point, as the author seems to be putting in a lot of time and effort to please\ntheir customers.\n\n\n-----\n\n### Indicators of Compromise (IOCs)\n\n**DCRat Stealer; Delay Command; Process/.BAT invocation:**\n\n“w32tm /stripchart /computer:localhost /period:5 /dataonly /samples:2”\n\n**DCRat Stealer; Self Preservation; Windows Registry changes:**\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\n\nREG_DWORD: “DisableTaskMgr”:1\n\n**DCRat Stealer; Persistence; Windows Registry:**\n\nHKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\n\nREG_SZ: “Shell”: “explorer.exe, %STEALER_EXE_PATH%”\n\nHKCU|HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run: <STEALER_EXE_PATH>\n\n**DCRat Stealer; Persistence; Windows Scheduled Tasks:**\n\nschtasks.exe /create /tn <STEALER_EXE_NO_EXTENSION> /sc ONLOGON /tr <STEALER_EXE_PATH> /rl HIGHEST /f\n\nschtasks.exe /create /tn <STEALER_EXE_NO_EXTENSION> /sc minute /mo <RND_MIN5_MAX15> /tr <STEALER_EXE_PATH> /f\n\n**DCRat Stealer; Host Fingerprint; WMI Queries:**\n\nSELECT * FROM AntivirusProduct: displayName\n\nSELECT * FROM FirewallProduct: displayName\n\nSELECT * FROM Win32_BIOS: Manufacturer\n\nSELECT * FROM Win32_BaseBoard: Manufacturer, SerialNumber\n\nSELECT * FROM Win32_Processor: Name\n\nSELECT * FROM Win32_ComputerSystem: TotalPhysicalMemory\n\nSELECT * FROM Win32_VideoController: Name, AdapterRAM\n\nSELECT * FROM Win32_PnPEntity WHERE (PNPClass = ‘Image’ OR PNPClass = ‘Camera’)\n\n**DCRat Stealer; Host Fingerprint; Windows Registry:**\n\nREAD: HLKM\\SOFTWARE\\Microsoft\\NET Framework Setup\\NDP\\v4\\Full\\Release\n\nREAD: HKLM\\SYSTEM\\ControlSet001\\Control\\Class\\ {4d36e968-e325-11ce-bfc1-08002be10318}\\<SUBKEY_1..SUBKEY_N>\\\n{AdapterString,DriverDesc,qwMemorySize}\n\n**DCRat Stealer; Runtime; Mutex (Default format, if not overridden):**\n\nDCR_MUTEX-<20_ALPHANUM_ULCASE_RAND>\n\n**DCRat Builder/Admin Tool; C2 Network Traffic:**\n\nDNS + HTTPS: dcrat[.]ru, crystalfiles[.]ru\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats, providing intelligence analysis for the benefit of\ndefenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-09 - Dirty Deeds Done Dirt Cheap- Russian RAT Offers Backdoor Bargains.pdf"
    ],
    "report_names": [
        "2022-05-09 - Dirty Deeds Done Dirt Cheap- Russian RAT Offers Backdoor Bargains.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535828,
    "ts_updated_at": 1743041574,
    "ts_creation_date": 1653780322,
    "ts_modification_date": 1653780322,
    "files": {
        "pdf": "https://archive.orkl.eu/f5a1d7d2a4256d40f9c047b08af68b9950b35448.pdf",
        "text": "https://archive.orkl.eu/f5a1d7d2a4256d40f9c047b08af68b9950b35448.txt",
        "img": "https://archive.orkl.eu/f5a1d7d2a4256d40f9c047b08af68b9950b35448.jpg"
    }
}