{
    "id": "b56adb90-7104-43bb-82a3-5db7ece47e3e",
    "created_at": "2023-06-05T02:06:40.897849Z",
    "updated_at": "2025-03-27T02:10:20.845093Z",
    "deleted_at": null,
    "sha1_hash": "6dbf4abe919c80809bf7140e89a24d678382ab94",
    "title": "2022-12-06 - AndroxGh0st – the python malware exploiting your AWS keys",
    "authors": "",
    "file_creation_date": "2023-06-04T12:27:27Z",
    "file_modification_date": "2023-06-04T12:27:27Z",
    "file_size": 2144654,
    "plain_text": "# AndroxGh0st – the python malware exploiting your AWS keys\n\n**lacework.com/blog/androxghost-the-python-malware-exploiting-your-aws-keys/**\n\nDecember 6, 2022\n\n[Hackers may hijack AWS infrastructure for a number of reasons. However, the most common motives are to facilitate illicit cryptomining or](https://www.lacework.com/blog/time-series-model-brings-another-dimension-of-analysis-uncovering-cryptomining-threats/)\nspamming. While cryptomining is more profitable on infrastructure owned by somebody else, the same can also be said for SMTP abuse and\nspam.\n\n\n-----\n\nO e t e past yea, ea y a t d o co p o sed ey c de ts obse ed by ace o a e be e ed to be o t e pu poses o spa g o\nmalicious email campaigns. And the majority of this activity has been linked to the same python malware dubbed AndroxGh0st with at least\none incident tied to an actor known as Xcatze.\n\nFigure 1. AndroxGh0st options\n\nAndroxGh0st is a “SMTP cracker” which is primarily intended to scan for and parse Laravel application secrets from exposed .env files. Note:\n[Laravel is an open source PHP framework and the Laravel .env file is often targeted for its various configuration data including AWS, SendGrid](https://www.zdnet.com/article/botnets-have-been-silently-mass-scanning-the-internet-for-unsecured-env-files/)\nand Twilio. AndroxGh0st has multiple features to enable SMTP abuse including scanning, exploitation of exposed creds and APIs, and even\ndeployment of webshells. For AWS specifically, the malware scans for and parses AWS keys but also has the ability to generate keys for brute\nforce attacks. However, the brute force capability is likely a novelty and is a statistically unlikely attack vector.\n\nLacework Labs recently identified several variants of this malware in the wild. One specimen was hard coded with the username ses_xcatze\n[which was a user created during one incident. Other versions of AndroxGhost were found on Github and have alternate names and references](https://github.com/search?q=%22androxgh0st%22&type=code)\nto different handles. To avoid confusion in this blog, all related malware will be referred to as AndroxGh0st. Regardless, it can be difficult to\nattribute source code as it may easily be modified and adapted by multiple entities.\n\nFigure 2. AWS key generator/brute force\n\nDepending on the usage, AndroxGh0st can perform one of two primary functions against acquired credentials. The most commonly observed\nof these is to check the email sending limit for the account to assess if it can be leveraged for spamming. This is performed with a call to\nGetSendQuota. AndroxGh0st does not perform any further recon following this API call. This is important to note because much of the activity\nobserved by Lacework simply involves this API only so the absence of other API calls is a strong indicator of a functionally similar malware.\nAlso, in calling the GetSendQuota API, no distinction is made between valid or invalid credentials regardless of whether the API call fails. For\nexample, an AccessDenied response to the GetSendQuota request actually validates the credentials because invalid credentials result in a\ntoken error and are not logged to CloudTrail.\n\nThe other primary function is to escalate to the AWS management console. This is performed with the following automated tasks:\n\n1. CreateUser- attempts to create user with compromised credentials - username is hardcoded in malware\n\n2. CreateLoginProfile- creates a login profile for the new user to access the management console. Password is also hard coded in\n```\n   python program\n\n```\n3. AttachUserPolicy- attempts to assign admin privileges to new user\n```\n   a. arn:aws:iam::aws:policy/AdministratorAccess\n\n```\n\n-----\n\np e ous steps a e success u, t e a a e tes og data to a co gu at o e o ate use\n\n5. DeleteAccessKey- deletes original compromised key if management console access is achieved\n\nFigure 3. AndroxGh0st high level functionality\n\n\n-----\n\nFigure 4 – .env parsing functions\n\n**In the Wild (ITW)**\n\nInteresting trends emerged in source traffic involving these tactics. Lacework Labs found that approximately 68% of observed AWS activity\ninvolving SMTP abuse originated from Windows systems. Python also accounted for the vast majority of attacks with 87% of user agents\nspecifying a python version. This is in contrast to incidents where cryptojacking is the suspected motive. Based on ITW activity observed by\nLacework, AWS attacks for the purposes of cryptojacking involve only 20% Windows systems and 50% python applications. The following are\nexamples of observed user agents from the majority of AWS API requests.\n```\nBoto3/1.24.13 Python/3.10.5 Windows/10 Botocore/1.27.1\n\nBoto3/1.24.40 Python/3.10.5 Windows/2012ServerR2 Botocore/1.27.40\n\nBoto3/1.24.8 Python/3.10.5 Windows/10 exec-env/EC2 Botocore/1.27.8\n\nBoto3/1.24.80 Python/3.7.0 Windows/10 Botocore/1.27.80\n\n\n```\nScanning of Laravel .env configs, which is the primary credential acquisition method for AndroxGh0st, comprises a large chunk of incoming\ntraffic observed by Lacework. From a week’s worth of web logs, we found that nearly 40% of all detections were the result of Laravel .env\nrecon. This scanning even dwarfed other common traffic. For example, over the same period of time there were 50 times more .env requests\nthan there were for [OAST (out-of-band application security testing) which is another common traffic source.](https://www.lacework.com/blog/the-oast-with-the-most/)\n\nEven more interesting was the vast majority of .env scanning (83%) used a single user agent, which was also a hardcoded user agent used for\nscanning by AndroxGh0st variants.\n\n\n-----\n\nAnother user agent leveraged by a different AndroxGh0st variant was observed in 3% of scans. In both cases, more than 95% of the traffic\nseen with these user-agents involved .env scanning. This means the user-agents are not coincidentally associated with the activity and are\nalmost exclusive to the .env scans and the python malware.\n\nFigure 5 – hardcoded UA in .env scanning function & androxgh0st POST\n\nAn additional indicator of scanning activity consists of POST data containing the string androxgh0st. If the malware is unable to fetch an .env\nfile with a GET request, then it will also attempt to do so with a POST request, using the androxgh0st as the POST data placeholder (also\nshown in Figure 5). As such this artifact makes a good network indicator for identification of activity originating from AndroxGh0st variants.\n\n**Xcatze**\n\nAs mentioned earlier, there were indications of AndroxGh0st activity performed by an actor known as Xcatze. For this activity, Lacework\nidentified additional Windows malware by pivoting off of one of the Xcatze attack IPs- 107.182.128.11. VirusTotal reported two Windows\nmalware binaries communicating with this host. Both of these files have detections for the RedLine stealer malware however these were later\nconfirmed as variants of hack tools created by Xcatze. Xcatze tools are available on the actor’s website and are functionally similar to\nAndroxGh0st. Despite this, it is unclear if the python malware can also be attributed to Xcatze. However, the prevalence of Windows based\nhack tools, especially for the purposes of information stealing and SMTP abuse, may contribute to the high volume of observed attacks\noriginating from Windows systems.\n\n**How can I detect AndroxGh0st?**\n\nAndroxGh0st is an attacker tool and will likely be customized so there may be limited success with hash based detections. Hashes for\ndeployed webshell payloads have been listed below. AndroxGhost .env scans may be detected by looking for the scanning user-agents in\ncombination with GETs for /.env or the artifact androxgh0st in POST data.\n\nFor CloudTrail identification of AndroxGhost and functionally similar malware then look for anomalous calls using the following APIs:\n\nGetSendQuota\nCreateUser\nCreateLoginProfile\nAttachUserPolicy\nDeleteAccessKey\n\nDetection of compromised credentials can be difficult as there is often no one specific artifact that indicates a compromised key, with the\nexception of threat intelligence. However, threat intel is not always accurate or timely. This necessitates a different approach similar to anomaly\ndetection. For example, the usage of APIs described in this blog may or may not be anomalous for a given environment. In consideration of\nother factors such as the novelty of an API, source IP, or user agent – we can provide higher severity alerts.\n\n\n-----\n\nFigure 6 – Lacework alert – Anomalous usage of GetSendQuota\n\n[To see more content like this, follow Lacework Labs on LinkedIn,](https://www.linkedin.com/showcase/lacework-labs) [Twitter, and](https://www.twitter.com/LaceworkLabs) [Youtube and stay up to date on our latest research. Indicators for](https://www.youtube.com/channel/UCiNTyM12-6o5C6d8zqr4DMA)\n[this blog are also available on Github.](https://github.com/lacework/lacework-labs/blob/master/blog/androxgh0st_IOCs.csv)\n\n[IOC’s:](https://github.com/lacework/lacework-labs/blob/master/blog/androxgh0st_IOCs.csv)\n\n**Indicator** **Description**\n\n70f35dfd9650437229453570f53969fb1644b1d07f282645c27a3877752a68bd AndroxGh0st python variant – hardcoded with Xcatze username\nemail\n\nf6f240dc2d32bfd83b49025382dc0a1cf86dba587018de4cd96df16197f05d88 AndroxGh0st python variant\n\n3b04f3ae4796d77e5a458fe702612228b773bbdefbb64f20d52c574790b5c81a AndroxGh0st python variant\n\n107.182.128.11 Xcatze attack IP\n\n319e572856a098f7beb8a07a4955e2ba823e24e31b84dfdd714bfcd5acf47a28 Windows malware – Xcatze hacktool\n\n45e051313272899973f16f5e79bf9ebe0a7f303b9dbeca13af9d65b97c59beae Windows malware – Xcatze hacktool\n\nandroxgh0st Network artifact – seen in POST requests\n\n94f98c908743b75f578002abe6eae36c36673924f66a5a594b1928e7cc757260 Primary webshell payload – downloaded from\nhttps://pastebin.com/raw/ZKfXSuBX\n\n61b44259ef97fd64d081f1b95f8cd140c52c73e95dadf62980c4dff78b146e5f Alternate webshell payload, download from\nhttps://raw.githubusercontent.com/rintod/toolol/master/payload.ph\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-06 - AndroxGh0st – the python malware exploiting your AWS keys.pdf"
    ],
    "report_names": [
        "2022-12-06 - AndroxGh0st – the python malware exploiting your AWS keys.pdf"
    ],
    "threat_actors": [
        {
            "id": "7586aed3-222e-4332-aee6-ffcb28e74f01",
            "created_at": "2023-11-08T02:00:07.169945Z",
            "updated_at": "2025-03-27T02:00:03.206498Z",
            "deleted_at": null,
            "main_name": "Xcatze",
            "aliases": [],
            "source_name": "MISPGALAXY:Xcatze",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1685930800,
    "ts_updated_at": 1743041420,
    "ts_creation_date": 1685881647,
    "ts_modification_date": 1685881647,
    "files": {
        "pdf": "https://archive.orkl.eu/6dbf4abe919c80809bf7140e89a24d678382ab94.pdf",
        "text": "https://archive.orkl.eu/6dbf4abe919c80809bf7140e89a24d678382ab94.txt",
        "img": "https://archive.orkl.eu/6dbf4abe919c80809bf7140e89a24d678382ab94.jpg"
    }
}