{
    "id": "b570c043-2777-4555-adf6-801cdc12d376",
    "created_at": "2023-06-05T02:06:50.217168Z",
    "updated_at": "2025-03-27T02:16:25.856412Z",
    "deleted_at": null,
    "sha1_hash": "d314eb2ab8b3113be2d0524164771470415dc48b",
    "title": "2023-04-27 - Lookout Discovers Android Spyware Tied to Iranian Police Targeting Minorities- BouldSpy",
    "authors": "",
    "file_creation_date": "2023-06-04T13:52:09Z",
    "file_modification_date": "2023-06-04T13:52:09Z",
    "file_size": 2571218,
    "plain_text": "# BouldSpy: Android Spyware Tied to Iranian Police Targets Minorities\n\n**lookout.com/blog/iranian-spyware-bouldspy**\n\nLookout\n\n[Researchers at the Lookout Threat Lab have discovered a new Android surveillance tool](https://www.lookout.com/resources/threat-lab)\nwhich we attribute with moderate confidence to the Law Enforcement Command of the\nIslamic Republic of Iran (FARAJA). Named BouldSpy for the “BoulderApplication” class\nwhich configures the tool’s command and control (C2), we have been tracking the spyware\nsince March 2020. Starting in 2023, the malware has drawn the attention of security\n[researchers on Twitter and by](https://twitter.com/0x6rsk/status/1647289419001475072) [others in the threat intelligence community characterizing it as](https://blog.cyble.com/2023/04/20/daam-android-botnet-being-distributed-through-trojanized-applications/)\nan Android botnet and ransomware. While BouldSpy includes ransomware code, Lookout\nresearchers assess that it is unused and nonfunctional, but could indicate ongoing\ndevelopment or an attempt at misdirection on the part of the actor.\n\nBased on our analysis of exfiltrated data from C2 servers for the spyware, BouldSpy has\nvictimized more than 300 people, including minority groups such as Iranian Kurds, Baluchis,\nAzeris, and possibly Armenian Christian groups. The evidence we have gathered implies that\nthe spyware may also have been used in efforts to counter and monitor illegal trafficking\nactivity related to arms, drugs, and alcohol.\n\nWe believe FARAJA uses physical access to devices, likely obtained during detention, to\ninstall BouldSpy to further monitor the target on release. In our research, we obtained and\nreviewed a large quantity of exfiltrated data that included photos and device\n\n\n-----\n\ncommunications, such as screenshots of conversations, recordings of video calls, as well as\nSMS logs. Our analysis also revealed photos of drugs, firearms, and official FARAJA\ndocuments that indicate potential law enforcement use of the malware. However, much of\nthe victim data points to its broader usage, which indicates targeted surveillance efforts\ntowards minorities within Iran. Notably, much of the malware’s activities occurred during the\n[height of the Mahsa Amini protests in late 2022.](https://www.reuters.com/world/middle-east/events-iran-since-mahsa-aminis-arrest-death-custody-2022-10-05/)\n\n_Recovered exfiltration data from BouldSpy’s C2 server indicates that initial infection for some_\n_victims takes place in close proximity to Iranian police stations or border patrol checkpoints,_\n_where detention and physical access to mobile devices could be obtained._\nWe believe BouldSpy to be a new malware family based on the relatively small number of\nsamples that we’ve obtained, as well as the lack of maturity around its operational security,\nsuch as unencrypted C2 traffic, hardcoded plaintext C2 infrastructure details, a lack of string\nobfuscation, and failure to conceal or remove intrusion artifacts. Until now, to the best of our\nknowledge the apps that we discovered and described in this article were never distributed\nthrough Google Play.\n\nBouldSpy represents yet another surveillance tool taking advantage of the personal nature of\nmobile devices. The spyware is especially concerning given Iran's human rights track record.\n[Lookout Mobile Endpoint Security and](https://www.lookout.com/products/endpoint-security/mobile-endpoint-security) [Lookout Life customers are protected from this threat.](https://www.lookout.com/products/life)\n\n## Deployment and capabilities\n\nThe first locations exfiltrated from the victims are, with few exceptions, concentrated near\nIranian provincial police stations, Iranian Cyber Police stations, Law Enforcement Command\nfacilities, and border control posts. Based on this, we theorize that a victim’s device is\nconfiscated once detained or arrested, and then subsequently physically infected with\nBouldSpy.\n\n\n-----\n\n_Recovered exfiltration data hints that victims came into contact with Iranian law enforcement._\nThe FARAJA actor provides user friendly features on its C2 panel to perform device\nmanagement of victims and build new custom BouldSpy malware applications, with the\nmalware operator able to choose between a default package name of\n“com.android.callservice” (posing as an Android system service related to handling phone\ncalls), or can trojanize various legitimate applications by inserting the\n“com.android.callservice” package. By setting up operations in this way, Iranian police\nofficers or other personnel that have low technical skills can easily generate new malware\nsamples, which makes it easier to ramp up deployment operations with minimal training.\n\n[Some of the apps BouldSpy impersonates include CPU-Z, a mobile CPU benchmarking tool,](https://www.cpuid.com/softwares/cpu-z-android.html)\n[Currency Converter Pro,](https://play.google.com/store/apps/details?id=com.devnied.currency.pro&gl=US) [a Persian-language interest calculator, and an app named Fake](https://cafebazaar.ir/app/ir.andromedads.interestcalculator)\nCall which is a prank app that generates fake phone calls or text messages. In April 2023,\n[we also acquired a sample that trojanized Psiphon, a popular VPN app that has over 50](https://play.google.com/store/apps/details?id=com.psiphon3)\nmillion downloads.\n\nGiven the likelihood of physical installation as the initial vector for BouldSpy, it’s possible that\nBouldSpy victims had legitimate versions of these apps installed when their devices were\nconfiscated, and that those apps were trojanized in order to avoid detection by the victim.\n\n_App icons associated with BouldSpy variants, from left to right: CPU-Z, Interest Calculator,_\n_Currency Converter Pro, Fake Call, Call Service, Psiphon_\n\n### Notable surveillance capabilities\n\n\n-----\n\nGetting all account usernames available on the device and their associated types (such\nas Google, Telegram, WhatsApp and others)\nList of installed apps\nBrowser history and bookmarks\nLive call recordings\nCall logs\nTake photos from the device cameras\nContact lists\nDevice information (IP address, SIM card information, Wi-Fi information, Android\nversion, and device identifiers)\nList of all files and folders on the device\nClipboard content\nKeylogs\nLocation from GPS, network, or cell provider\nSMS messages (sent, received and drafts)\nRecord audio from the microphone\nTake screenshots\n\nA notable capability of BouldSpy is that it can record voice calls over multiple Voice over IP\n(VoIP) apps as well as the standard Android phone app. These include:\n\nWhatsApp\nBlackberry BBM\nTurkcell\nBOTIM\nKakao\nLINE\nmail.ru VoIP calls\nTelegram VoIP\nMicrosoft Office 365 VoIP functionality\nSkype\nSlack VoIP\nTango\nTextNow\nViber\nVonage\nWeChat\n\n## Technical analysis\n\n### Persistent background activities\n\n\n-----\n\nMost of BouldSpy s surveillance actions happen in the background by abusing Android\naccessibility services. It also relies heavily on establishing a CPU wake lock and disabled\nbattery management features to prevent the device from shutting down the spyware’s\nactivities. As a result, victims could expect their device battery to drain much faster than\nnormal. Once installed, the spyware will seek to establish a network connection to its C2\nserver and exfiltrate any cached data from the victim’s device to the server.\n\nThese actions occur when the user opens the app, or when the device is booted or rebooted.\nTo make sure it can take actions frequently and consistently, BouldSpy uses a background\nservice to handle most of the surveillance functionality. As illustrated in the below figure, the\nservice restarts itself when its parent activity is stopped by either the user or the Android\nsystem.\n\nWhen the activity is stopped with an “onDestroy()” call, a new Intent is created which restarts\n“MainService.” MainService handles most of BouldSpy’s surveillance functionality.\n\n### Insecure C2 communication\n\nWe found that BouldSpy has the ability to encrypt files for exfiltration, but uses unencrypted\nweb traffic between victim devices and the C2. This insecure implementation by the threat\nactor makes network analysis and detection easier by exposing the whole C2 communication\nin clear text.\n\n\n-----\n\n_This is a screenshot of plaintext C2 traffic we observed. It’s a POST request to C2 server_\n_192.99.251[.]51 containing plaintext commands and associated job IDs, status, exfil (in the_\n_“data[]” field), whether the job was successful, and the app module (such as “Messages” or_\n_“LocationManager”) executing the data collection._\n\n### Ability to run additional code\n\nBouldSpy also has the ability to run arbitrary code, and download and run additional custom\ncode from the C2, or run code within other apps as needed. This gives the malware\nadditional options, such as the ability to improve its collection capabilities, introduce\nfunctionalities, or set up persistence in other apps.\n\n### SMS commands\n\nAside from the normal C2 via a web server, BouldSpy can also receive commands via SMS\nfrom a control phone, which is a fairly unique feature. This enables the spyware to surveil\nvictims even in poorly-developed regions that lack internet availability, but are still reachable\nover standard cell networks.\n\n\n-----\n\nSMS commands follow a format starting with asterisk ( ) and ending with the hashtag/pound\nsign (#) with arbitrary text between them. The commands usually start with a three-digit\nnumber and are split into separate parameters which are separated by asterisks. The known\ncommands are listed in the table below.\n\n**Command** **Function** **Parameters**\n\n\n760 Takes\nphotos\nfrom device\ncameras\n\n770 Records\nfrom the\nmicrophone\n\n780 Gets the\ndevice\nlocation\n\n790 Enables or\ndisables\nWi-Fi\n\n140 Change C2\naddress\n\n\nUses four parameters. These are the number of shots to take,\nthe duration (unused), the wait time between shots, and\nwhether to use the front or back camera. For example, the\ncommand *760*3*6*30*1# would take three photos from the\nfront camera and wait 30 seconds between shots.\n\nUses three parameters which are the number, duration, and\nwait time between recordings. For example, *770*2*30*40#\ntakes two 30-second recordings with a 40-second delay\nbetween recordings.\n\nUses no parameters, but has unused placeholders. A known\nexample is *780*1*1#.\n\nUses just one parameter to enable or disable the device Wi-Fi.\nAn example is *790*2# which enables Wi-Fi. *790*1# disables\nWi-Fi.\n\nThis uses one long parameter consisting of seven parts. An\nexample command setting the new C2 to 192.99.251[.]51:3000\nlooks like this: *140*119209925105130001#\n\n\nBouldSpy samples ship with ransomware code borrowed from an open source Android\n[ransomware project named CryDroid. However, Lookout researchers assess this code as](https://github.com/benniraj25/crydroid/)\nunused and nonfunctional. This code might be a sign of an ongoing development or a false\nflag artifact to misdirect analysts.\n\n## Command and Control Infrastructure\n\nLookout found BouldSpy C2 servers at IP addresses 192.99.251[.]51, 192.99.251[.]50,\n192.99.251[.]49, 192.99.251[.]54, 84.234.96[.]117, and 149.56.92[.]127. Of these, only\n192.99.251[.]51 and 84.234.96[.]117 are currently active. A common feature of these is the\nuse of port 3000 to access the C2’s administration panel, which requires authentication.\nFrom analyzing these servers, we were able to uncover the following victim information:\n\n66,000 call logs\n15,000 installed apps\n100,000 contacts\n3,700 user accounts\n\n\n-----\n\n3,000 downloaded files\n9,000 keylogs\n900 locations\n400,000 text messages\n2,500 photos\n\nWe believe that there are likely more victims and associated data collected because\nexfiltration data on C2 servers are often cleared.\n\n## Indicators of Compromise (IOCs)\n\n BouldSpy Sample SHA1s:\n\n5168610b73f50661b998e95a74be25bfe749b6ef\n\naf999714aec75a64529c59f1e8de4c669adfa97a\n\n965d118cb80ccdbc6e95e530a314cb4b85ae1b42\n\nf3b135555ae731b5499502f3b69724944ab367d5\n\n02ac97b090a6b2a1b14bad839deec7d966f5642c\n\nda3c0cfd432b53a602ce7dc5165848b88411d9c9\n\n75a6c724f43168346b177a60c81ca179a436246f\n\n08fd24e4514793b29b7bd2c29f9e5c15ffc9bada\n\n73c93be188f88755ed690266063223e141fdb9ff\n\n7537ac1658100efaf6558eed4a3f732208b393ab\n\n7208dc915a800fe5c5eaf599084147a8afeba991\n\n8afc495b6632ce9ef812a971f71ae82d39d7e7e9\n\n43f5506b960914ab76ffaf531cdd51dd86df22f2\n\ndd66dcb8db678d10f9589a12745ec2e575e4f5eb\n\n69894818ba1dc8bfffe9fb384abf77d991379aaa\n\ndb650b0eaffa21b63ce84d31b2bd09720da9491e\n\n67a3def7ad736df94c8c50947f785c0926142b69\n\n\n-----\n\n63ff362f58c7b6dec8ea365a5dbc6a88ec09dacf\n\nbc826967c90acc08f1f70aa018f5d13f31521b92\n\n02c4969c45fd7ac913770f9db075eadf9785d3a7\n\n5446e0cf2de0a888571ef1d521b9ada7b34ef33e\n\n43a92743c8264a8d06724ab80139c0d31e8292ee\n\n## Command and Control:\n\n149.56.92[.]127\n\n192.99.251[.]49\n\n192.99.251[.]50\n\n192.99.251[.]51\n\n192.99.251[.]54\n\n84.234.96[.]117\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-27 - Lookout Discovers Android Spyware Tied to Iranian Police Targeting Minorities- BouldSpy.pdf"
    ],
    "report_names": [
        "2023-04-27 - Lookout Discovers Android Spyware Tied to Iranian Police Targeting Minorities- BouldSpy.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1685930810,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1685886729,
    "ts_modification_date": 1685886729,
    "files": {
        "pdf": "https://archive.orkl.eu/d314eb2ab8b3113be2d0524164771470415dc48b.pdf",
        "text": "https://archive.orkl.eu/d314eb2ab8b3113be2d0524164771470415dc48b.txt",
        "img": "https://archive.orkl.eu/d314eb2ab8b3113be2d0524164771470415dc48b.jpg"
    }
}