{
    "id": "b5b013d1-5225-494c-84cd-4b2211681349",
    "created_at": "2023-01-12T15:05:18.99746Z",
    "updated_at": "2025-03-27T02:05:59.212024Z",
    "deleted_at": null,
    "sha1_hash": "b5642c9d95e5c1dda370e03df3a4a784b524aeee",
    "title": "2020-07-08 - Irans domestic espionage Lessons from recent data leaks",
    "authors": "",
    "file_creation_date": "2022-05-25T12:10:55Z",
    "file_modification_date": "2022-05-25T12:10:55Z",
    "file_size": 945417,
    "plain_text": "# Iran’s domestic espionage: Lessons from recent data leaks\n\n**intel471.com/blog/irans-domestic-espionage**\n\nBy the Intel 471 Global Research Team.\n\nIn the last decade, Iran has undergone a quiet revolution. Since the“Green Movement”\nuprising in 2009, more Iranians have dared to openly oppose their regime. The reasons\ninclude accusations of elections tampering, global sanctions, increased inflation, heavy\ninvestment of state funds in the nuclear and arming programs, and ambitious regional\npolicies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic\nsituation of the average Iranian.\n\nThere was a lot of talk in the past about Iran’s espionage measures and offensive cyber\nactivities targeting other countries. However, growing domestic unrest prompted the Iranian\nregime to invest more resources in developing espionage capabilities aimed against its own\ncitizens. Additionally, the regime carried out tough measures against civil uprisings such as\ncutting off the internet in the country for long periods of time and killing hundreds of\nprotestors.\n\nDuring the past year, a number of online activists have leaked what they claim to be inside\ninformation about the regime’s surveillance methods, in an attempt to expose the unethical\ntactics used by Iranian security forces. Among the top whistleblowers are operators of the\nLab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist\nnamed Masoud Molavi. Molavi, assassinated by Iranian agents in November 2019, was a\nformer cybersecurity official behind the Black Box Telegram channel that was responsible for\nmany notable leaks of Iranian government information.\n\nThe series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is\nspying on its own people. According to the leaked information, the Islamic Revolutionary\nGuard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed\nnumerous tools, malicious software, surveillance systems and data analysis platforms, in\norder to control citizens in Iran and abroad. Much of this activity allegedly was conducted in\nthe Rana Intelligent Computing Institute, an organization working under the Iranian MOIS,\ninvolved in internal espionage by developing unique tools and gaining access to a variety of\nforeign countries’ infrastructure.\n\n## Tools and Techniques used for Domestic Espionage\n\nAccording to the information shared by these whistleblowers, Iran is heavily investing in the\ndevelopment of customized tools and malicious software for domestic espionage. For\nexample, the Iranian regime developed a surveillance system dubbed Abi, which allegedly\n\n\n-----\n\nwas used to spy on political activists, human rights lawyers, regime opponents and protesters\nby intercepting Bluetooth communications. According to an Iranian blog called\nArezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been\ninstalled on pickup trucks posted in strategic locations in Iran such as university campuses or\nprotest centers.\n\nA screenshot from the Abi system monitoring of Sharif University\n\nThe Iranian regime also developed customized malware used for stealing information from\ncitizens. One example found in those leaks was called WinspySuite, a remote access and\ninformation stealing malware that reportedly was used specifically to spy on suspects\narrested by the regime. Internally referred to as Peyvand, the malware allegedly was loaded\nonto a target’s computer via a USB flash drive during interrogations or sent via a malicious\nlink to a victim’s email address. The regime also developed a remote access tool for Android\nand iPhone mobile devices as part of a project dubbed Project 220. The malware purportedly\nwas able to steal sensitive data from a victim’s device, including call data, text messages,\ncontacts and locations.\n\n\n-----\n\nA screenshot from the Winspy Suite control panel\n\nAnother malware project dubbed Project 420 aka Dolphin developed, deployed and\ncontrolled an undisclosed mobile malware capable of collecting and analyzing information\nabout the activities of individuals and groups on social media networks including Facebook,\nTwitter, and Instagram, and on messaging applications such as Telegram.\n\nAccording to leaked information, the regime not only developed tools for stealing sensitive\ndata from its citizens, but also created designated platforms for the collection and analysis of\nthe data. A system dubbed Payamak was developed to store and analyze text messages from\ntargeted subjects. A software called Seraj was used as an analytical search engine for data on\nsuspects, employees, intelligence operations and arrests related to the MOIS. Another system\nmentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish\npeople in Iran and abroad.\n\n\n-----\n\nAdditionally, the IRGC and MOIS gained unauthorized access to legitimate services or\nwebsites to spy on Iranian citizens. For example, the MOIS would compromise Iran’s\nNational Library computer network seeking to obtain personal information about users,\nmainly students and political prisoners, and their topics of interest. The MOIS allegedly also\nabused this access to send phishing emails with malicious attachments from the library’s\nofficial email account.\n\n## Tracking Iranians Abroad\n\nIn addition to all of the above, the Iranian government is making great efforts to monitor\ncitizens going abroad by surveying and analyzing location data obtained from Iranian cellular\noperators with a system called Pouya, and by compromising the infrastructure of foreign\ncompanies.\n\nA screenshot from the Pouya system\n\nIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan”\n(translated in Persian as ‘the hidden facts’) to expose Iranian regime espionage-related\nactivity. The site contains a large section about espionage enterprises outside Iran that was\nconducted to monitor the movement of Iranians traveling abroad. According to this\ninformation, the regime gained access to computer systems of numerous airline companies in\nBahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia,\nThailand and the United Arab Emirates (UAE) for data collection on flights of Iranian\ncitizens. In another case, leaked documents showed the government worked on a project that\naimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a\npopular holiday destination for Iranians.\n\n\n-----\n\nWhile they can be considered revealing, It should be noted that these leaks provide a very\nnarrow window into the full extent of the Iranian regime’s priorities. However, the\ninformation disclosed provides evidence that as time goes by, motivation to expose these\nactivities likely will remain high.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-08 - Irans domestic espionage Lessons from recent data leaks.pdf"
    ],
    "report_names": [
        "2020-07-08 - Irans domestic espionage Lessons from recent data leaks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535918,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653480655,
    "ts_modification_date": 1653480655,
    "files": {
        "pdf": "https://archive.orkl.eu/b5642c9d95e5c1dda370e03df3a4a784b524aeee.pdf",
        "text": "https://archive.orkl.eu/b5642c9d95e5c1dda370e03df3a4a784b524aeee.txt",
        "img": "https://archive.orkl.eu/b5642c9d95e5c1dda370e03df3a4a784b524aeee.jpg"
    }
}