{
    "id": "b5d2aa05-44d0-487e-b061-b3dcc7cd1925",
    "created_at": "2023-01-12T15:03:17.658942Z",
    "updated_at": "2025-03-27T02:10:07.387873Z",
    "deleted_at": null,
    "sha1_hash": "675ef32752098e5061d4f91c2bf1ddbea7406e3a",
    "title": "2021-12-28 - The hacker-for-hire industry is now too big to fail",
    "authors": "",
    "file_creation_date": "2022-05-28T17:07:21Z",
    "file_modification_date": "2022-05-28T17:07:21Z",
    "file_size": 1480798,
    "plain_text": "# The hacker-for-hire industry is now too big to fail\n\n**[technologyreview.com/2021/12/28/1043029/the-hacker-for-hire-industry-is-now-too-big-to-fail/](https://www.technologyreview.com/2021/12/28/1043029/the-hacker-for-hire-industry-is-now-too-big-to-fail/)**\n\nPatrick Howell O'Neill\n\nA shock has reverberated inside Israel in the last few months. NSO Group, the billion-dollar\nIsraeli company that has sold hacking tools to governments around the world for more than a\ndecade, has drawn intense scrutiny after a series of public scandals. The company is in\ncrisis. Its future is in doubt.\n\nBut while NSO Group’s future is uncertain, governments are more likely than ever to buy\ncyber capabilities from the industry NSO helped define. Business is booming for “hackers for\nhire” firms. In the last decade, the industry has grown from a novelty into a key instrument of\npower for nations around the world. Even the potential failure of a major firm like NSO Group\nisn’t likely to slow the growth.\n\nJust this month, Facebook reported that seven hacker-for-hire firms from around the world\n[had targeted around 50,000 people on the company’s platforms. The report spotlighted four](https://www.technologyreview.com/2021/12/16/1042652/facebook-says-50000-users-were-targeted-by-cyber-mercenary-firms-in-2021/)\nmore Israeli companies alongside operations from China, India, and North Macedonia. The\nfact that the investigation didn’t even mention NSO Group shows that the industry and its\ntargeting are far more vast than what the public can typically see.\n\nNSO Group has been besieged by criticism and charges of abuse for years. In 2016, the\n[United Arab Emirates was caught targeting human rights activist Ahmed Mansoor using NSO](https://citizenlab.ca/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/)\nGroup’s Pegasus, a tool that leverages software flaws to hack iPhones and turn control over\n\n\n-----\n\nto NSO Group s customers. In that case, the UAE government was seen as the culprit, and\n[NSO walked away unscathed (Mansoor is still in prison on charges of criticizing the country’s](https://www.hrw.org/report/2021/01/27/persecution-ahmed-mansoor/how-united-arab-emirates-silenced-its-most-famous-human)\nregime).\n\nThe pattern repeated for years–over and over again, governments would be accused of\nusing NSO hacking tools against dissidents but the company denied wrongdoing and\nescaped punishment. Then, in mid-2021, new reports emerged of alleged abuse against\n[Western governments. The company was sanctioned by the US in November, and in](https://www.washingtonpost.com/technology/2021/11/03/pegasus-nso-entity-list-spyware/)\n[December Reuters reported that US State Department officials had been hacked using](https://www.reuters.com/technology/exclusive-us-state-department-phones-hacked-with-israeli-company-spyware-sources-2021-12-03/)\nPegasus.\n\nNow NSO Group faces expensive public lawsuits from Facebook and Apple. It has to deal\nwith debt, low morale, and fundamental threats to its future. Suddenly, the poster child for\nspyware is [confronting an existential crisis.](https://www.technologyreview.com/2021/11/23/1040509/france-macron-nso-in-crisis-sanctions/)\n\nAll of this is familiar territory. The secretive hacker-for-hire industry first splashed across\n[international newspaper headlines in 2014, when the Italian firm Hacking Team was charged](https://www.washingtonpost.com/business/technology/foreign-regimes-use-spyware-against-journalists-even-in-us/2014/02/12/9501a20e-9043-11e3-84e1-27626c5ef5fb_story.html)\n[with selling its “untraceable” spyware to dozens of countries without regard for human rights](https://theintercept.com/2015/07/07/leaked-documents-confirm-hacking-team-sells-spyware-repressive-countries/)\nor privacy violations.\n\nHacking Team opened the world’s eyes to a global industry that bought and sold powerful\ntools to break into computers anywhere. The resulting storm of scandals seemed to\n[eventually kill it. The company lost business and the ability to legally sell its tools](https://www.technologyreview.com/2019/11/29/131803/the-fall-and-rise-of-a-spyware-empire/)\ninternationally. Hacking Team was sold and, in the public’s mind, left for dead. Eventually,\n[however, it rebranded and started selling the same products. Only this time, it was a smaller](https://www.technologyreview.com/2019/11/29/131803/the-fall-and-rise-of-a-spyware-empire/)\nfish in a much bigger pond.\n\n“The demise of Hacking Team did not lead to fundamental change in the industry at all,” says\nJames Shires, assistant professor at the Institute of Security and Global Affairs at Leiden\nUniversity. “The same dynamic and demand still exists.”\n\nThe industry’s earliest customers were a small set of countries eager to project power around\nthe world through the internet. The situation is far more complex today. Many more countries\nnow pay for the instant capability to hack adversaries both internationally and within their\nown borders. Billions of dollars are at play, but there’s very little transparency and even less\naccountability.\n\nWhile public scrutiny of firms that provide hackers for hire has grown, the global demand for\noffensive cyber capabilities has escalated too. In the 21st century, a government’s highestvalue targets are online more than ever—and hacking is usually the most effective way to get\nto them.\n\nThe result is a growing crowd of countries willing to spend large sums to develop\nsophisticated hacking operations.\n\n\n-----\n\nFor governments, investing in cyber is a relatively cheap and potent way to compete with\nrival nations—and develop powerful tools of domestic control.\n\n“Especially in the last five years, you have more countries developing cyber capabilities,”\nsays Saher Naumaan, a principal threat intelligence analyst at BAE Systems.\n\nAnd more of those countries are looking outside for help. “If you don’t have a way to harness\nthe skills or talent of the people in your country but you have the resources to outsource, why\nwouldn’t you go commercial?” she says. “That’s an option in a lot of different industries. In\nthat way, cyber is not that different. You’re paying for something you’re not going to build\nyourself.”\n\nFor example, oil-rich countries on the Persian Gulf have historically lacked the considerable\ntechnical capability needed to develop domestic hacking power. So they spend on a shortcut.\n“They don’t want to be left behind,” Naumaan says.\n\nMilitary contracting giants across the world now develop and sell these capabilities. These\ntools have been used to commit egregious abuses of power. They’re also increasingly used\nin legitimate criminal investigations and counterterrorism and are key to espionage and\nmilitary operations.\n\nThe demand for what private hacking companies are selling isn’t going away. “The industry is\nboth bigger and more visible today than it was a decade ago,” says Winnona DeSombre, a\nsecurity researcher and fellow at the Atlantic Council. “The demand is rising because the\nworld is becoming more technologically connected.”\n\n[DeSombre recently mapped the famously opaque industry by charting hundreds of](https://www.technologyreview.com/2021/11/08/1039395/grim-outlook-cyber-boom-atlantic-council-report/)\ncompanies selling digital surveillance tools around the world. She argues that much of the\nindustry’s growth is hidden from public view, including Western companies’ sales of cyber\nweapons and surveillance technology to geopolitical adversaries.\n\n“The biggest issue comes when this space is primarily self-regulated,” she explained. Selfregulation “can result in widespread human rights abuses” or even friendly fire, when hacking\ntools are sold to foreign governments that turn around and use the same capabilities against\nthe country of origin.\n\nAlerted to the industry’s increasing impact, authorities around the world now aim to shape its\nfuture with sanctions, indictments, and new regulations on exports. Even so, the demand for\nthe tools grows.\n\nUltimately, the most meaningful change may come when there’s an impact on companies’\n[revenue. Recent reports show that NSO Group is saddled with debt and](https://www.calcalist.co.il/calcalistech/article/r1pz9m5uk) [struggling to court](https://www.bloomberg.com/news/articles/2021-11-12/spyware-firm-nso-group-drops-deeper-into-distress-after-ceo-exit)\nWall Street investment.\n\n\n-----\n\nThis is a commercial industry, after all, Shires says. If venture capital firms and big\ncorporate investors see this as a risky bet, they’ll choose to pull out. More than anything else,\nthat can change the industry radically.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-28 - The hacker-for-hire industry is now too big to fail.pdf"
    ],
    "report_names": [
        "2021-12-28 - The hacker-for-hire industry is now too big to fail.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535797,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1653757641,
    "ts_modification_date": 1653757641,
    "files": {
        "pdf": "https://archive.orkl.eu/675ef32752098e5061d4f91c2bf1ddbea7406e3a.pdf",
        "text": "https://archive.orkl.eu/675ef32752098e5061d4f91c2bf1ddbea7406e3a.txt",
        "img": "https://archive.orkl.eu/675ef32752098e5061d4f91c2bf1ddbea7406e3a.jpg"
    }
}