{
    "id": "b600e2b0-87ce-45d3-b6cc-0f5e88370a61",
    "created_at": "2023-03-03T02:06:26.664658Z",
    "updated_at": "2025-03-27T02:16:25.619242Z",
    "deleted_at": null,
    "sha1_hash": "ec9315e74c5842c4dd6d38827368a192500bccc8",
    "title": "2023-02-08 - Dota 2 Under Attack- How a V8 Bug Was Exploited in the Game",
    "authors": "",
    "file_creation_date": "2023-03-01T09:15:10Z",
    "file_modification_date": "2023-03-01T09:15:10Z",
    "file_size": 858032,
    "plain_text": "# Dota 2 Under Attack: How a V8 Bug Was Exploited in the Game\n\n**[decoded.avast.io/janvojtesek/dota-2-under-attack-how-a-v8-bug-was-exploited-in-the-game/](https://decoded.avast.io/janvojtesek/dota-2-under-attack-how-a-v8-bug-was-exploited-in-the-game/)**\n\nFebruary 8, 2023\n\nby [Jan VojtěšekFebruary 8, 202315 min read](https://decoded.avast.io/author/janvojtesek/)\n\n[When we think about V8 exploits, the first things that come to mind are probably related to sophisticated](https://v8.dev/)\nbrowser zero-day exploit chains. While the browser may be the most interesting target for V8 exploits, we\nshouldn’t forget that this open-source JavaScript engine is also embedded into countless projects other than\nthe browser. And where a JavaScript engine is used across a security boundary to execute potentially\nuntrusted code, security issues may arise.\n\n[One such issue affected the massively popular Dota 2 video game. Dota used an outdated build of v8.dll](https://www.dota2.com/home)\nthat was compiled in December 2018. It’s no surprise that this build was vulnerable to a range of CVEs,\n[many of them even being known exploited vulnerabilities with public proof-of-concept (PoC) exploits. We](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\n[discovered that one of these vulnerabilities, CVE-2021-38003, was exploited in the wild in four custom game](https://bugs.chromium.org/p/chromium/issues/detail?id=1263462)\nmodes published within the game. Since V8 was not sandboxed in Dota, the exploit on its own allowed for\nremote code execution against other Dota players.\n\n[We disclosed our findings to the developer of Dota 2, Valve. In response, Valve pushed an update for Dota](https://www.valvesoftware.com/en/)\non January 12, upgrading the old and vulnerable version of V8. This update took effect immediately, since\nDota has to be up to date for players to participate in online games. Valve also took additional action, by\ntaking down the offending custom game modes, notifying the affected players, and introducing new\nmitigations to reduce the game’s attack surface.\n\nDota [changelog for the January 12 update.](https://www.dota2.com/news/updates)\n\n## Background\n\n\n-----\n\nDota 2 is a MOBA game that was initially released on July 9, 2013. Despite being almost 10 years old (or\nperhaps 20 if counting the original Dota 1), it is still attracting a large player base of around 15 million active\nmonthly players. Like other popular games, Dota is a complex piece of software under the hood, assembled\nfrom multiple separate components. One component that will be of particular interest to us is the Panorama\nframework. This is a framework designed by Valve itself to enable user interface development using the\nwell-known web triad of HTML, CSS, and JavaScript. The JavaScript part here was problematic because it\ngot executed by the vulnerable version of V8. Thus, malicious JavaScript could exploit a V8 vulnerability and\ngain control over the victim’s machine. This wouldn’t be such an issue for the unmodified game, because by\ndefault, only legitimate Valve-authored scripts should get executed. However, Dota is very open to\ncustomization by the player community, which opens the doors for threat actors to attempt to sneak\nmalicious pieces of JavaScript to their unsuspecting victims.\n\nCustomization of Dota can take many forms: There are custom wearable in-game items, announcer packs,\nloading screens, chat emoticons, and more. Crucially, there are also custom community-developed game\nmodes. These are essentially brand-new games that leverage Dota’s powerful game engine to allow anyone\nwith a bit of programming experience to implement their ideas for a game. Custom game modes play an\nimportant role in Dota, and Valve is well aware of the benefits of letting players express their creativity by\ndeveloping custom game modes. After all, Dota itself started out as a game mode for Warcraft III: The\n_Frozen Throne. This might be why game modes can be installed with a single click from within the game. As_\na result, there are thousands of game modes available, some of which are extremely popular. For instance,\n[DOTA AUTO CHESS was played by over 10 million players.](https://steamcommunity.com/sharedfiles/filedetails/?id=1613886175)\n\n[Before a game mode can be played by regular players, it must be published on the Steam store. The](https://store.steampowered.com/)\npublishing process includes a verification performed by Valve. While this could potentially weed out some\nmalicious game modes, no verification process is perfect. As we’ll show later, at least four malicious game\nmodes managed to slip through. We believe the verification process exists mostly for moderation reasons to\nprevent inappropriate content from getting published. There are many ways to hide a backdoor within a\ngame mode, and it would be very time-consuming to attempt to detect them all during verification.\n\nThe main game logic of custom game modes is coded in Lua. This is executed on the game server, which\ncan either be the host player’s machine or a dedicated server owned by Valve. For client-side scripting,\nthere is JavaScript from the Panorama framework. This is mainly used to control user interface elements,\nsuch as scoreboards or quest status bars. JavaScript is executed by the V8 engine, and there’s full support\nfor many advanced features, including WebAssembly execution. In addition, there’s also a [Dota-specific API](https://developer.valvesoftware.com/wiki/Dota_2_Workshop_Tools/Panorama/Javascript/API)\nthat exposes additional functionality. Particularly interesting was the $.AsyncWebRequest function, which, in\ncombination with eval, could have been used to backdoor a game mode so that it could execute arbitrary\nadditional JavaScript code downloaded from the internet. Perhaps it was this concern that caused the\n```\n$.AsyncWebRequest function to be deprecated and eventually removed altogether. However, there are ways\n\n```\naround this. For instance, the web request can be made by the server-side Lua code, with the response\npassed to the client-side JavaScript using game event messaging APIs.\n\n## Just Testing\n\nWe discovered four malicious custom game modes published on the Steam store, all developed by the\nsame author. The first game mode (id 1556548695) is particularly interesting, as it appears that it is where\nthe attacker only tested the exploit, judging from the lack of an actual payload attached to it. Interestingly\nenough, the attacker also used this game mode to test various other techniques, leaving in commented-out\ncode or unused functions. This offered us a great opportunity to understand the attacker’s thought process.\n\n\n-----\n\nThe\n\nSteam page of the custom game mode where the attacker tested the exploit.\nAs can be seen in the above screenshot, the attacker was very transparent about the nature of this game\nmode, naming it test addon plz ignore and even going as far as using the description to urge other\nplayers not to download this game mode. While this might seem like an expression of good faith, we’ll show\nshortly that in the other three malicious game modes, the same attacker took the exact opposite approach\nand tried to make the malicious code as stealthy as possible.\n\nThe JavaScript exploit in this custom game mode can be found inside overthrow_scoreboard.vjs_c. This\nused to be a legitimate JavaScript file implementing scoreboard functionality, but the attacker replaced its\n[content with an exploit for CVE-2021-38003. This vulnerability was originally discovered as a zero-day by](https://chromereleases.googleblog.com/2021/10/stable-channel-update-for-desktop_28.html)\nGoogle researchers Clément Lecigne and Samuel Groß, when it was used in the wild in an exploit chain\nagainst a fully-patched Samsung phone.\n\n[There are now public PoCs and](https://github.com/star-sg/CVE/blob/master/CVE-2021-38003/pwn.js) [write-ups for this CVE. However, these weren’t available in March 2022,](https://starlabs.sg/blog/2022/12-the-hole-new-world-how-a-small-leak-will-sink-a-great-browser-cve-2021-38003/)\nwhen the attacker last updated the game mode. This means they had to develop a large portion of the\nexploit themselves (even if there was a public PoC at that time, the attacker would still need to possess\nsome technical skills to backport it to the outdated V8 build that Dota was using). Even so, the core of the\n\n\n-----\n\n[exploit was provided in the Chromium bug tracker entry for the CVE. There is a snippet of code that can](https://bugs.chromium.org/p/chromium/issues/detail?id=1263462)\n[trigger the vulnerability to leak the purportedly inaccessible TheHole object and then use this leaked object](https://medium.com/numen-cyber-labs/from-leaking-thehole-to-chrome-renderer-rce-183dcb6f3078)\nto corrupt the size of a map. The attacker took this snippet and pasted it into their exploit, building up the\nrest of the exploit on top of this corrupted map.\n\nThe core of the exploit that triggers CVE\n2021-38003 to leak TheHole object. Note the yay! at the end — that’s simply an expression of joy and it’s in\nno way necessary for the exploit to work.\nInterestingly, the exploit contains a large amount of commented-out code and debug prints. This further\nsuggests that the attacker had to put a lot of effort into weaponizing the vulnerability. The attackerdeveloped part of the exploit starts by using the corrupted map to corrupt the length of an array, achieving a\nrelative read/write primitive. Then, it corrupts an ArrayBuffer backing store pointer in order to gain an\narbitrary read/write primitive. There is no addrof function, as addresses are leaked by placing the target\nobject at a known offset from the corrupted array and then using the relative read primitive. Finally, with the\n[arbitrary read/write in place, the exploit uses a well-known WebAssembly trick to execute custom shellcode.](https://faraz.faith/2019-12-13-starctf-oob-v8-indepth/#:~:text=Use%20WebAssembly%20to%20create%20an%20RWX%20page)\nWe have tested the whole exploit locally against Dota and can confirm that it worked.\n\n\n-----\n\nA JavaScript snippet taken from the exploit. Note the debug prints, comments, and commented-out code.\nApart from this JavaScript exploit, the custom game mode also contains another interesting file, which is\nominously named evil.lua. This is where the attacker tested the capabilities of the server-side Lua\nexecution. See the Lua snippet below where the attacker tested the following in particular:\n\nLogging\nDynamic compilation of additional Lua code (loadstring)\nDetermining the exact version of the Lua interpreter\nExecuting arbitrary system commands (whoami)\nCoroutine creation\nNetwork connectivity (HTTP GET requests)\n\n\n-----\n\nA Lua snippet taken from evil.lua.\nUnfortunately, we do not have access to the full update history of this particular game mode. Therefore, it’s\npossible that some interesting code from previous versions is no longer present in the version that we\nanalyzed. We can at least see from the changelog that there were nine updates to this game mode, all of\nthem happening either in November 2018 or March 2022. Since the exploited JavaScript vulnerability was\nonly discovered in 2021, we assume that the game mode initially started out as a legitimate game and that\nthe malicious functionality was only added in the March 2022 updates.\n\n## The Backdoor\n\nAfter discovering this first malicious game mode, we were of course wondering whether there are more such\nexploits out there. Since the attacker did not bother reporting the vulnerability to Valve, we found it likely that\nthey would have malicious intentions and attempt to exploit it at a larger scale. As a result, we developed a\nscript that downloaded all the JavaScript files from all the custom game modes published on the Steam\nstore. This yielded us gigabytes of JavaScript that we could query for suspicious code patterns.\n\n\n-----\n\nIt didn t take long to discover three more malicious game modes, all by the same author (who also\nhappened to be the author of the previously analyzed test addon plz ignore game mode). These game\nmodes were named Overdog no annoying heroes (id 2776998052), Custom Hero Brawl (id 2780728794),\nand Overthrow RTZ Edition X10 XP (id 2780559339). Interestingly, the same author also published a fifth\ngame mode named Brawl in Petah Tiqwa (id 1590547173), which did not include any malicious code (to\nour great surprise).\n\nThe\n\nSteam page of one of the backdoored custom game modes.\nThe malicious code in these new three game modes is much more subtle. There is no file named evil.lua\nnor any JavaScript exploit directly visible in the source code. Instead, there’s just a simple backdoor\nconsisting of only about twenty lines of code. This backdoor can execute arbitrary JavaScript downloaded\nvia HTTP, giving the attacker not only the ability to hide the exploit code, but also the ability to update it at\ntheir discretion without having to update the entire custom game mode (and going through the risky game\nmode verification process).\n\nThe backdoor starts with the JavaScript code sending a custom ClientReady event to the server. This is to\nsignal to the server that there is a new victim game client, waiting to receive the JavaScript payload. The\nLua code on the server registered a listener for the ClientReady event. When it receives this event, it\nmakes an HTTP GET request to its C&C server to fetch the JavaScript payload. This payload is expected in\nthe response body, and it’s forwarded to the client-side JavaScript in a custom event named test.\n\n\n-----\n\nThe Lua part of the backdoor, which is executed on the game server.\nWhen the client-side JavaScript receives this test event, it unwraps the payload, dynamically creates a new\nfunction out of it, and immediately executes it. On a high level, this is clearly just a simple downloader\ncapable of executing arbitrary JavaScript downloaded from the C&C server. The cooperation of client-side\nJavaScript and server-side Lua code was only necessary because JavaScript was no longer allowed to\ndirectly access the internet.\n\nThe JavaScript part of the\n\nbackdoor, which is executed on the game clients.\nAt the time that we discovered this backdoor, the C&C server was no longer responding. Even so, we can\nconfidently assume that this backdoor was intended to download the JavaScript exploit for CVE-202138003. This is because all three backdoored game modes were updated by the same author within 10 days\nafter said author introduced the JavaScript exploit into their first malicious game mode. However, we remain\n[unsure about whether there was any malicious shellcode attached to the exploit. After all, the use of ngrok](https://ngrok.com/)\nfor C&C is slightly unconventional and could suggest that the attacker only tested the backdoor functionality.\nOne way or another, we can say that this attack was not very large in scale. According to Valve, under 200\nplayers were affected.\n\n## Parting Thoughts\n\nAfter discovering the four malicious game modes, we tried to hunt for more — unfortunately, our trail went\ncold. Therefore, it’s not clear what the attacker’s ultimate intentions were. However, we believe that they\nwere not exactly pure research intentions, for two main reasons. First, the attacker did not report the\nvulnerability to Valve (which would generally be considered a nice thing to do). Second, the attacker tried to\n\n\n-----\n\nhide the exploit in a stealthy backdoor. Regardless, it s also possible that the attacker didn t have purely\nmalicious intentions either, since such an attacker could arguably abuse this vulnerability with a much larger\nimpact.\n\nFor example, a malicious attacker could attempt to take over a popular custom game mode. Many game\nmodes are neglected by their original developers, so the attacker could try something as simple as\npromising to fix bugs and continue development for free. After some number of legitimate updates, the\nattacker could try to sneak in the JavaScript backdoor. Since game modes are updated automatically in the\nbackground, the unsuspecting victim players would not have a lot of opportunities to defend themselves.\n\nAlternatively, the attacker could search for other ways to exploit the vulnerability without involving any\ncustom game modes. For instance, the attacker could try to look for a separate XSS vulnerability to chain\nwith the V8 exploit. Such an XSS vulnerability could allow the attacker to execute arbitrary JavaScript within\nthe remote victim’s Panorama instance. The V8 exploit could then be used to break out of the Panorama\nframework. Note that Panorama is also heavily used in the game’s main menu, so depending on the nature\nof the XSS vulnerability, this could have a blast radius as big as the 15 million monthly players.\n\nBefore we sign off, we would like to thank Valve for quickly addressing our reports. We hope that they will\ncontinue updating V8 in the future and reduce the patch gap as much as possible. Valve also shared with us\nsome plans about additional mitigations, and we will be most excited to see those implemented in practice.\nDue to the potential impact, we would also recommend very careful vetting of future updates for popular\ncustom games.\n\nWe can also appreciate that Valve made the decision to publish custom game modes on Steam even\nthough it might put more responsibility on their shoulders. Ultimately, this is a net positive for the overall\nplayers’ security, due to the fact that Valve can moderate the published game modes and take down\nmalicious ones. Many other games don’t have such integrated support for custom games, so players resort\nto downloading mods from random third-party sites, which are often known to bundle malware.\n\n### Indicators of Compromise (IoCs)\n\nSHA-256 Name\n```\n cca585b896017bd87038fd34a7f50a1e0f64b6d6767bcde66ea3f98d6dd4bfd0 overthrow_scoreboard.vjs_c\n 4fad709e74345c39a85ce5a2c7f3b71d755240d27dd46688fa3993298056cf39 evil.lua\n 3c00f15d233a3dd851d68ecb8c7de38b1abf59787643a2159c9d6a7454f9c3b7 overthrow_scoreboard.vjs_c\n 880a0722a5f47d950170c5f66550e1cdef60e4e84c0ce1014e2d6d7ad1b15c14 addon_game_mode.lua\n 85635bd92cc59354f48f8c39c6db7a5f93cabfb543e0bcc3ec9e600f228f2569 overthrow_scoreboard.vjs_c\n 44c79f185576e1ec7d0d7909eb7d4815cbf8348f37f62c0debd0d5056fb1100b addon_game_mode.lua\n 4d3c6986b924108911709b95cb4c379720c323e6f7b3a069b866b76e0e3ec6b5 overthrow_scoreboard.vjs_c\n 4bb1d6dcb1e12c3e5997b8dc7fa3db45d44bade39cfcceab56f90134ca2d09f3 addon_game_mode.lua\n\n```\n[Tagged asbackdoor,](https://decoded.avast.io/tag/backdoor/) [CVE-2021-38003,](https://decoded.avast.io/tag/cve-2021-38003/) [Dota 2,](https://decoded.avast.io/tag/dota-2/) [exploit,](https://decoded.avast.io/tag/exploit/) [gaming,](https://decoded.avast.io/tag/gaming/) [vulnerability](https://decoded.avast.io/tag/vulnerability/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-08 - Dota 2 Under Attack- How a V8 Bug Was Exploited in the Game.pdf"
    ],
    "report_names": [
        "2023-02-08 - Dota 2 Under Attack- How a V8 Bug Was Exploited in the Game.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1677809186,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1677662110,
    "ts_modification_date": 1677662110,
    "files": {
        "pdf": "https://archive.orkl.eu/ec9315e74c5842c4dd6d38827368a192500bccc8.pdf",
        "text": "https://archive.orkl.eu/ec9315e74c5842c4dd6d38827368a192500bccc8.txt",
        "img": "https://archive.orkl.eu/ec9315e74c5842c4dd6d38827368a192500bccc8.jpg"
    }
}