{
    "id": "b672c146-e693-489c-8689-8f49d3828dbc",
    "created_at": "2023-01-12T14:58:48.837894Z",
    "updated_at": "2025-03-27T02:16:26.445429Z",
    "deleted_at": null,
    "sha1_hash": "04938f33920bffbdb594f6e79c72dc555a72ed76",
    "title": "2022-07-09 - Analyzing a Brute Ratel Badger",
    "authors": "",
    "file_creation_date": "2022-10-23T13:00:18Z",
    "file_modification_date": "2022-10-23T13:00:18Z",
    "file_size": 2444120,
    "plain_text": "# Analyzing a Brute Ratel Badger\n\n**blog.spookysec.net/analyzing-brc4-badgers/**\n\n09 Jul 2022\n\nNow a days [Brute Ratel (sometimes called the “Angry Monkey C2”) seems to be a hot topic](https://bruteratel.com/)\nwithin the information security community. There’s been lots of drama surrounding the author\n[(ParanoidNinja), rumors of the C2 being backdoored, and even some blog posts from well](https://twitter.com/NinjaParanoid)\nknown and respected individuals within the security community indicating that the C2\nframework is potentially being used by APT29 (aka the Russian State Sponsored groups).\n\nSo, with all these controversies, where do we go from here? Well, validating the claim that\nthe C2 Framework is backdoored can be quite difficult to prove as that would involve me\nspending several thousand dollars to acquire the framework itself… So, that’s not exaclty\nfeasable. I can however get the next best thing. A Brute Ratel Beacon, or Agent (or as they\nlike to call it, a “Badger”).\n\n## Acquiring a Badger for Analysis\n\nHow can we do this exactly? Fortunately, I have a VirusTotal Enterprise license! This means\nwe can pull down (download) a publicly tagged “Brute Ratel” sample from the community. To\ndo so, we’re going to use a search for something like `Comment:\"Brute Ratel\" and see if`\nwe get any hits…\n\n\n-----\n\n[Suprise Suprise, we got six hits! Let’s go with the most obvious one, badger_x64.exe](https://www.virustotal.com/gui/file/3ad53495851bafc48caf6d2227a434ca2e0bef9ab3bd40abfe4ea8f318d37bbe)\n(SHA256 Sum:\n3ad53495851bafc48caf6d2227a434ca2e0bef9ab3bd40abfe4ea8f318d37bbe).\n\n## Lab Setup\n\nFor this lab, we will be using REMWorkstation + REMnux. Here’s a diagram that breaks\ndown the lab setup:\n\n\n-----\n\nREMWorkstation has the IP Address of 192.168.128.12\nREMNux has the IP Address of 192.168.128.10\nDefault Gateway has the IP Address of 192.168.128.2\nREMNUx can route to 192.168.128.2, but the route is not configured.\nIf REMNux is configured to route to the Default Gateway, outbound traffic to the internet\n**is allowed**\n\nIn addition:\n\nREMNux will have an iptables rule that will accept all and any traffic going into it.\nREMNux will be running FakeDNS and iNetSim\nREMNux will be running WireShark\nREMWorkstation will be running Fiddler\n\nAnd thats our lab!\n\n## Dynamic Analysis - Malware Detonation\n\nNow that we have our sample acquired, and you’re familiar with my lab setup, let’s double\nclick some EXEs!\n\n\n-----\n\nSo, right off the bat, we can see some beacons to 156.65.186.50 over HTTPS. Looking at\nthese requests in Fiddler, we can see that the sample is using the user agent: `Mozilla/5.0`\n```\n(Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/90.0.4430.93 Safari/537.36 with no extra headers.\n\n```\nThis is suprisingly bare. Let’s pivot over to iNetSim and see whats going on over there.\n\n\n-----\n\nOn that side, we can see a little bit more. The file that the Badger requested is `/admin,`\nand there is also some POST data that we missed!\n\nLet’s see if we can find that in Fiddler… Unfortunately, I could not find the request in Fiddler,\nI’ll have to revert and redetonate the sample in a bit…\n\nEdit: Fiddler actually caused some issues w/ cutting the POST data off to inetsim :(.\n\n### Procmon/ProcDot Analysis\n\nFor now - Let’s move over to ProcMon and ProcDot and see what the badger is looking for.\n\nStarting out, this is an absolutely massive graph. Let’s start from the top and work our way\ndown.\n\nAt the top:\n\n\n-----\n\nIt appears that the badger is first checking to see if there are any registry keys correlated to a\nproxy on the system. Since no proxies are in place, BRC4 likely foudn nothing.\n\nOn the far right, we can see a couple of cached web page responses saved to disk. If you’d\nlike to read that data - all it contains is the iNetSim HTTP Response.\n\nMoving on down the graph, we can see another read attempt on another registry key relating\nto proxies:\n\nOne interesting thing I’d like to point out is the Badger is leveraging a bunch of\nThreadCreates and ThreadOpens to potentially confuse AV or EDR.\n\nZooming out, all the black diamons are all new threads and Thread ID Numbers.\n\n\n-----\n\nScrolling down a bit more, this pattern continues. More Threads being created to read\nregistry keys relating to proxies:\n\n### Back to iNetSim\n\nNow that we know a bit more about what the program is trying to do, let’s go back to iNetSim\nand read the POST data from the Web Server.\n\n\n-----\n\nAll of the POST data is stored in `/var/lib/inetsim/postdata/` . I hope that helps\nsomeone in the future… :)\n\nLet’s bring the input into CyberChef and decode the Base64.\n\n### Searching for Encryption in APIMonitor\n\nInteresting! The POST Data is encrypted. I think I know a trick or two that could help us\ndecode this. To do so, we’ll need to hop into API Monitor and hook into the process and\nobserve the API Calls the badger is performing. We’re looking for a call to Microsoft’s\nCryptographic API or a call to the HTTP APIs as we know some cryptographic function\nperforms before the POST data is sent…\n\n\n-----\n\nBy searching for a common Windows API (RtlUTF8ToUnicodeN), we can quickly find where\nsome data conversion is taking place to give us a good starting point of reference.\n\nLooking at the CallStack, we see some lovely Windows API calls that look very close to what\nwe need. Since some sort of technique is being used to dynamically resolved the APIs\nneeded is being used, let’s back off of APIMonitor and move over to a Debugger.\n\n### Pivoting to x64Dbg\n\nI have setup x64Dbg to use counter-antidebugging techniques using ScyllaHide, so if there\nare any techniques implemented, we won’t have to worry about them.\n\nAfter letting the program run for a while, I set a breakpoint on a couple of the common HTTP\nAPIs. We got a hit on InternetOpenW; in my suprise, in the stack window, here we are. We\nhave the unencrypted data starting at us!\n\nIt appears to be some JSON that looks like so:\n\n\n-----\n\n```\n desktop 2c3Iqh0,\n\n     \"wver\":\"x64/10.0\",\n\n     \"arch:\"x64\",\n\n     \"bld\":\"16322\",\n\n     \"p_name\":\"<base64 blob>\",\n     \"uid\":\"REM\",\n\n     \"pid\":\"\"\n\n}\n\n```\nThe Base64 glob is still relatively interesting to me, p_name, could this mean\nprogram_name? Let’s decode it!\n\nIt appears so! I set a BreakPoint earlier in the stack and let the execution flow to see if I\ncould extract any more information from the Badger, doing so did yeild some extra results!\n\nWe have an auth token now and a more complete JSON blob.\n\n\n-----\n\n```\n{\n\n\"cds\": {\n\n     \"auth\":\"2K4TBS7L9GK2C205\"\n\n     },\n\n\"mtdt\": {\n\n     \"h_name\":\"DESKTOP-2C3IQH0\",\n\n     \"wver\":\"x64/10.0\",\n\n     \"arch\":\"x64\",\n\n     \"bld\":\"16322\",\n\n     \"p_name\":\"<base64 blob>\",\n\n     \"uid\":\"REM\",\n\n     \"pid\":\"\"\n\n     }\n\n}\n\n```\nUnfortunately, our analysis stops here as we don’t have a live C2 server to observe\ninteractions with. Though, we could explore how the badger interacts with the C2 server if we\ncarefully observe how the badger parses the response from the C2 server. There is\ndefinately some hardcoded commands that we would be able to use to manipulate the\nbadger itself with iNetSim.\n\nI would have liked to have caught the Windows API that actually encodes/encrypts this data,\nso I could write a small decoder for the information if you have the badger; but it appears that\nwasn’t meant for tonight :(\n\n## Basic Static Analysis\n\nSo, this section is going to be much shorter than the last, as I’ve already found the\ninteresting C2 related data; Now, we’re going to play an interesting game of “How good is\nBrute Ratel’s Obfuscation Techniques”! The answer isn’t very good.\n\nTo start, we’re going to chuck the EXE into Cyberchef and look at some of the clear text\nASCII values.\n\n\n-----\n\n### HTTP Request Information\n\nSo, right off the bat, it’s not looking so good. We can see a lot of interesting strings; we can\nsee a lot of the HTTP POST information broken up into various strings. For example:\n\n/logi\nAppleWeb\nKit/537\n65.186.5\n159\n443\n\nSome of these strings are incredibly meaningful! For example, putting together the bits\n159.65.186.50 gives away our command and control server, and 443 gives away the port!\nHow interesting…\n\n### Windows APIs\n\nLooking a little bit lower, we can see some of the Windows APIs the program uses as well.\nThey appear to be jumbled up, but still readable to the human eye.\n\n\n-----\n\nVirtualProtect\nGetLastError\nGetModuleHandleW\nGetProcAddress\n\nThe more you keep looking, the more you see the pattern.\n\n### HTTP POST Data\n\nInterestingly enough, you can actually find a lot of the HTTP POST Data that we had to work\noh so hard to reverse engineer to find…\n\narch\nbld\nfname\nh_name\n\nContinuing our search, we may be able to learn more about the badgers capabilities. Looking\nat the screenshot above, towards the bottom, we can make out “Download Failed”. Perhaps\nthis badger has the ability to upload files to the server? Let’s keep digging.\n\n\n-----\n\n### Badgers like LDAP!\n\nIt looks like the badger uploads PNG/image files to the C2 server. It also makes some\nqueries to LDAP as well and will communicate with the Global Catalog. If it can’t, it’ll spit out\nsome binding errors.\n\n\n-----\n\nSearching lower down the list, we can see some of the information it collects, like Password\nExpiration, if the password never expires, and if there is a bad password supplied.\n\n### The Badger is Self Aware?\n\nContinuing our string-hunt, here’s one of the most interesting sets of strings… Badger itself is\nembedded as a string in the binary :facepalm:\n\nI’ve already loaded up the binary into Ghidra and there’s a whole lot of nothing. It seems to\nbe a bit beyond my skill level to reverse engineer in a classic sense, so I’ll have to do some\nmore research on my own time to figure out if I can post a followup showing off the actual\nbinary internals.\n\n## Misc Findings\n\nHere are some interesting things I found that I wanted to include in the post, but couldn’t\neasily write into the flow of the post. I still think this is worth mentioning.\n\n### PUNYCode! The thing I forgot existed?\n\nHere is an interesting String Compare after executing a HTTP Request; it asppears that this\nbadger is checking to see if some of the response headers contain `xn-- . This may be a`\nsign that a threat actor is spoofing a common domain like `Google.com to` `http://xn--`\n```\nggle-0nda.xn--om-ubc/, which displays just like the normal domain does! Browser\n\n```\n\n-----\n\nsettings can be configured to always display xn–, though some by default will render the link\n[as normal. Thanks to @ShitSecure for pointing this out <3](https://twitter.com/ShitSecure/status/1546047868095631362)\n\n### Traffic Generation to windowsupdate.com\n\nAnother interesting aspect of this badger is that it periodically reaches out to\n```\nctldl.windowsupdate.com . I originally thought this was Windows being Windows, but it\n\n```\nturns out that this is hardcoded within the binary. This is likely a cloaking mechanism to throw\noff AV/EDR/Sandboxes.\n\nI hope you all enjoyed :)\n~Ronnie\n\n### Comments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-09 - Analyzing a Brute Ratel Badger.pdf"
    ],
    "report_names": [
        "2022-07-09 - Analyzing a Brute Ratel Badger.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535528,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1666530018,
    "ts_modification_date": 1666530018,
    "files": {
        "pdf": "https://archive.orkl.eu/04938f33920bffbdb594f6e79c72dc555a72ed76.pdf",
        "text": "https://archive.orkl.eu/04938f33920bffbdb594f6e79c72dc555a72ed76.txt",
        "img": "https://archive.orkl.eu/04938f33920bffbdb594f6e79c72dc555a72ed76.jpg"
    }
}