{
    "id": "b68aa5be-6c88-4b8c-9b7d-73ce64af9b61",
    "created_at": "2023-06-05T02:06:53.468719Z",
    "updated_at": "2025-03-27T02:06:00.059953Z",
    "deleted_at": null,
    "sha1_hash": "72bbb19a2b07a85cf838025141de10d5494c6d4c",
    "title": "2022-03-10 - Threat Thursday- CryptBot Infostealer Masquerades as Cracked Software",
    "authors": "",
    "file_creation_date": "2023-06-04T12:24:42Z",
    "file_modification_date": "2023-06-04T12:24:42Z",
    "file_size": 2876530,
    "plain_text": "# Threat Thursday: CryptBot Infostealer Masquerades as Cracked Software\n\n**[blogs.blackberry.com/en/2022/03/threat-thursday-cryptbot-infostealer](https://blogs.blackberry.com/en/2022/03/threat-thursday-cryptbot-infostealer)**\n\nThe BlackBerry Research & Intelligence Team\n\n1. [BlackBerry Blog](https://blogs.blackberry.com/en.html)\n2. Threat Thursday: CryptBot Infostealer Masquerades as Cracked Software\n\nCryptBot is back. A new and improved version of the malicious infostealer has been\nunleashed via compromised pirate sites, which appear to offer “cracked” versions of popular\nsoftware and video games.\n\n[Making news most recently for an outbreak in early 2022, the malware first appeared in the](https://www.bleepingcomputer.com/news/security/revamped-cryptbot-malware-spread-by-pirated-software-sites/)\nwild in 2019, and it is now actively changing its attack and distribution methods. Most\nnotably, recent versions have been significantly streamlined to include only infostealing\nfunctionality, contained in a much smaller package than before.\n\nCryptBot targets sensitive user data such as browser login information, cryptocurrency\nwallets, stored credit card information, passwords and more. The gathered information is\nsent back to a command-and-control (C2) address, to be used by the attacker for financial\ngain.\n\n\n-----\n\n### Operating System\n\n Risk & Impact\n\n Compromised and Cracked Websites\n\nCryptBot has recently been hosted and distributed via compromised webpages that appear\nto offer cracked versions of popular video games and other software. Threat actors\ncommonly bundle their Trojanized executables this way to lure their victims into\nunknowingly downloading and executing malicious code.\n\nCracked software typically refers to commercial software packages that have been modified\nto give people free access to functionality and features. Users seeking this pirated software\ntend to be less risk-conscious, making them particularly attractive targets for malware.\nThreat actors often use search engine optimization (SEO) techniques to help push these\ncompromised websites to victims.\n\n### Technical Analysis\n\nThe attack chain for CryptBot begins when the victim visits a compromised webpage and is\nlured into downloading an SFX file, such as the one pictured in Figure 1, which is\nmasquerading as the latest version of Adobe Photoshop.\n\n\n-----\n\n_Figure 1 - Example of malicious webpage offering cracked software_\n\nOnce the victim downloads what they assume is cracked software, an SFX file called\n\"7ZSfxMod_x86.exe” is dropped to their machine, as shown in Figure 2.\n\n\n-----\n\n_Figure 2 - Malicious SFX file retrieved from compromised webpage_\n\nOnce the archive file is launched, a folder with the naming scheme “7ZipSfx.000” is placed\ninto the victim’s %Temp% directory, as seen in Figure 3. The numbers used in the naming\nscheme for this folder vary based on the number of times the malware has been launched.\nFor example, executing the archive file a second time will result in an additional folder\ncalled “7ZipSfx.001” being placed in the same directory, with the same files included.\n\n_Figure 3 - Folder placed into user’s Temp directory post execution_\n\nThis folder contains four files that are used to carry out the next stage of the attack:\n\n“aeFdOLFszTz.dll” – A legitimate copy of Microsoft® Windows® “ntdll.dll”\n“Avevano gif” – A BAT script\n\n\n-----\n\nCarne.gif – An obfuscated AutoIT script\n“Raccontero.exe” – An AutoIT v3 executable compiler\n\nAs seen in Figure 3, two of these files are displayed as .GIF files. However, these files are\nin fact malicious scripts using the .GIF extension to masquerade as image files. The file\nextensions used vary, depending on the version of CryptBot downloaded by the victim.\nDifferent variants analyzed have also been observed using .MP3 and .WMV extensions.\n\nA copy of “AutoITv3.exe” is also dropped to the folder as “Raccontero.exe.” This tool is an\ninterpreter that is part of AutoIT, which is a freeware programming language for Windowsbased devices. This tool is intended for use in automating services via scripts; however, it\nhas frequently been abused by many different malware families.\n\nThe structure and contents of the BAT script, such as obfuscated variables, can be seen in\nFigure 4 below. The script performs a scan against a task list referencing two antivirus (AV)\nproducts, “BullGuardCore” and “Panda Cloud Antivirus.” If the AV products are present, the\nmalware will perform a “sleep” function to delay execution and aid in bypassing detection.\n\n_Figure 4 - Malicious BAT Script \"Avevano.gif\"_\n\nAs part of the initial malware execution chain, the BAT script is used to decrypt the heavily\nobfuscated AutoIT script, \"Carne.gif,” as seen in Figure 5. The BAT also copies the AutoIT\nscript to the virtual memory area to run it.\n\n\n-----\n\n_Figure 5 - Obfuscated AutoIT script \"Carne.gif”_\n\nThe AutoIT executable compiler “Raccontero.exe” is used to run \"Carne.gif.\" The filename\nof the script is supplied as an argument, as shown in Figure 6.\n\n_Figure 6 - Launched AutoIT Process \"Raccontero.exe.pif”_\n\nThis spawns the AutoIT process “Raccontero.exe.pif,” which loads the malicious CryptBot\nbinary into memory.\n\n### Capabilities\n\nOnce the malicious payload is executed, CryptBot can begin fulfilling its main function of\nharvesting and exfiltrating sensitive information from the victim’s machine. It begins by\nsearching the machine for various user and system information to steal. Gathered data is\nstored in a directory within the user’s %Temp% folder. The information is saved in this\ndirectory until it is sent to the C2 server, then it is deleted.\n\nThe data that CryptBot searches for includes the following:\n\nCryptocurrency wallet details\nLogin credentials\n\n\n-----\n\nForm data saved to the browser\nCookies\nBrowser history\nCredit card details\nFiles containing sensitive data\nOS and hardware information\nA list of installed programs\n\nFigure 7 below shows a list of cryptocurrency directories and wallets that CryptBot scans\nfor.\n\n_Figure 7 - List of Cryptocurrency directories scanned for by CryptBot_\n\n\n-----\n\nThe victim s data is stored in a zipped TXT file within the %Temp% directory. The malware\nthen reaches out to the C2 server, which in the case of this sample, is located at\n\"rygvpi61[.]top/index.php.” The stolen data is exfiltrated back to the attacker and the folder\ncontaining the sent information is wiped from the victim’s machine.\n\nCryptBot contains a second hardcoded C2 that can be used for downloading additional\nmalware. This address can be seen in Figure 8 below, along with several of the directories\nthat are targeted for data exfiltration, including cookies, login data, web profiles and browser\nform history.\n\n_Figure 8 - C2 addresses and a selection of targeted directories_\n\n### Latest Variant\n\nThe very latest version of CryptBot was first spotted in the wild in early 2022, with a few\nnotable differences from previous variations.\n\nOverall, it appears that the threat actor has decided to trim the file, so it only includes the\ncore functionality necessary for successful data exfiltration. One of the features removed is\nthe anti-sandbox capabilities used in previous versions.\n\n\n-----\n\nThe latest version of CryptBot also does not steal screenshots of the victim s desktop, nor\ndoes it perform self-deletion of the malicious files used. The current version deletes only\ngathered data after successfully performing data exfiltration, rather than its own files.\n\nThe obfuscation methods used in this version also differ from older variants of CryptBot.\nThe malicious BAT script now in use contains a higher level of obfuscation, using encrypted\nvariables to help impede analysis by threat researchers.\n\nPrevious versions of this infostealer contained two C2 addresses that were used for data\nexfiltration and one address used to retrieve additional malware, whereas the version\nanalyzed here has been limited to one dedicated address for exfiltration and one for\nadditional downloads.\n\nThe latest version of CryptBot has also been modified to target all versions of Google\nChrome™, including the newest version, Chrome™ v96.\n\n### Conclusion\n\nCryptBot has thus far only been observed targeting Windows devices. This is likely because\nthe malware’s infection vector uses pirated websites offering cracked software, which is not\nas common on other operating systems such as Mac OS X and Linux®. These other\noperating systems make a less lucrative target for threat actors who use this particular\ndistribution method.\n\nSo why did the malware’s author decide to cut some features from the latest version of\nCryptBot? This decision could have been made in attempt to simplify the attack overall, and\nto ensure that focus is solely placed on the vital functionalities. As a result of this paring\ndown, the size of the malicious archive files being downloaded from the compromised\npages are roughly half the size. This could benefit the attackers by allowing more frequent\nand quicker infection processes.\n\nThe best mitigation tactic against CryptBot is for users to be extra vigilant when visiting\nwebsites to download new software, and only trusting download links from legitimate\nvendors rather than third-party or pirate websites.\n\n### YARA Rule\n\nThe following YARA rule was authored by the BlackBerry Research & Intelligence Team to\ncatch the threat described in this document:\n\n\n-----\n\nimport \"pe\"\n\nrule CryptBot {\n\nmeta:\ndescription = \"Detects 2022 CryptBot Through Imphash\"\n\nauthor = \"BlackBerry Threat Research Team\"\n\ndate = \"2022-02-26\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0\n(https://www.apache.org/licenses/LICENSE-2.0) and open to any user or organization, as\nlong as you use it under this license and ensure originator credit in any derivative to The\nBlackBerry Research & Intelligence Team\"\n\nstrings:\n\n$s1 = \"7z SFX\"\n\ncondition:\n\n(\n\n//PE File\n\nuint16(0) == 0x5a4d and\n\n//Imphash\n\npe.imphash() == \"e55dbecdaf2c7cc43f3d577e70c6c583\" or\n\npe.imphash() == \"27fc501de77f5768cac058a2a9512c3a\" or\n\npe.imphash() == \"fda990324138bdc940f9020ce3e8d5fc\" or\n\npe.imphash() == \"997edafa1e226ba6317ec804803f9a57\" or\n\npe.imphash() == \"4b3cfc81e94566bb0e35b6156e51fbd5\" and\n\n//All Strings\n\nall of ($s*) )\n\n}\n\n### Indicators of Compromise (IoCs)\n\n**Hash**\n\n53d8d466679a01953aab35947655a8c1a2ff3c19ac188e9f40e3135553cf7556\n\n**Filenames**\n\n7ZipSfx.000 – Initial folder dropped into Temp directory\naeFdOLFszTz.dll – A legitimate copy of Microsoft Windows “ntdll.dll\"\nAvevano.gif – BAT Script\nCarne.gif – Obfuscated AutoIT Script\nRaccontero.exe – AutoIT Executable Compiler\n\n**C2**\n\nrygvpi61[.]top/index[.]php – Exfiltration address\n\ngewuib08[.]top/download.php?file=scrods[.]exe – Download address\n\n\n-----\n\n### BlackBerry Assistance\n\nIf you’re battling this malware or a similar threat, you’ve come to the right place, regardless\nof your existing BlackBerry relationship.\n\n[The BlackBerry Incident Response team is made up of world-class consultants dedicated to](https://www.blackberry.com/us/en/services/incident-response)\nhandling response and containment services for a wide range of incidents, including\nransomware and Advanced Persistent Threat (APT) cases.\n\nWe have a global consulting team standing by to assist you providing around-the-clock\nsupport, where required, as well as local assistance. Please contact us\nhere: https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incidentresponse-containment\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats,\nproviding intelligence analysis for the benefit of defenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-10 - Threat Thursday- CryptBot Infostealer Masquerades as Cracked Software.pdf"
    ],
    "report_names": [
        "2022-03-10 - Threat Thursday- CryptBot Infostealer Masquerades as Cracked Software.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930813,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1685881482,
    "ts_modification_date": 1685881482,
    "files": {
        "pdf": "https://archive.orkl.eu/72bbb19a2b07a85cf838025141de10d5494c6d4c.pdf",
        "text": "https://archive.orkl.eu/72bbb19a2b07a85cf838025141de10d5494c6d4c.txt",
        "img": "https://archive.orkl.eu/72bbb19a2b07a85cf838025141de10d5494c6d4c.jpg"
    }
}