{
    "id": "b68e385b-77ab-440e-b514-cc177a9fe8e7",
    "created_at": "2023-01-12T15:03:08.67619Z",
    "updated_at": "2025-03-27T02:16:26.521878Z",
    "deleted_at": null,
    "sha1_hash": "a7e3d7d6214b5560df9c80bad54031f8a5d87390",
    "title": "2016-10-27 - In-Dev Ransomware forces you do to Survey before unlocking Computer",
    "authors": "",
    "file_creation_date": "2014-05-08T09:07:37Z",
    "file_modification_date": "2014-05-08T09:07:37Z",
    "file_size": 2181704,
    "plain_text": "**2013 Internet Crime Report** 1\n\n\n-----\n\nExecutive Summary ....................................................................................................................................................3\n\nThe IC3 ........................................................................................................................................................................5\n\n2013 Complainant Demographics ..............................................................................................................................6\n\nInternet Scams Reported to the IC3 ...........................................................................................................................8\n\nIC3 Case Highlights .................................................................................................................................................. 14\n\nConclusion ............................................................................................................................................................... 16\n\nAppendix I: Online Crime Prevention ...................................................................................................................... 17\n\nAppendix II: 2013 IC3 Warnings/Press Releases ..................................................................................................... 20\n\nAppendix III: 2013 IC3 Subject Country Statistics .................................................................................................... 21\n\nAppendix IV: 2013 IC3 Subject State Statistics ........................................................................................................ 23\n\nAppendix V: 2013 IC3 Victim Country Statistics ...................................................................................................... 25\n\nAppendix VI: 2013 IC3 Victim State Statistics .......................................................................................................... 28\n\n##### Mission: To receive, develop and refer criminal complaints regarding the rapidly expanding arena of\n\n cybercrime. The Internet Crime Complaint Center (IC3) gives the victims of cybercrime a convenient and\n\n easy-to-use reporting mechanism that alerts authorities to suspected criminal violations. For law\n\n enforcement and regulatory agencies at the federal, state, local, tribal and international levels, the IC3\n\n provides a central referral mechanism for complaints involving Internet-related crimes.\n\n**2013 Internet Crime Report** 2\n\n\n-----\n\n## 2013 Internet Crime Report\n\n#### Executive Summary\n\nNow in its 14th year of operation, the Internet Crime Complaint Center (IC3) has firmly established its role as a\nvaluable resource for both victims of Internet crime and law enforcement agencies investigating and prosecuting\nthese crimes. For the victims, the IC3 provides a convenient and easy-to-use reporting mechanism that alerts\nauthorities to suspected criminal violations. For law enforcement agencies, the IC3 serves as a conduit to receive\nInternet-related complaints, to conduct research related to them and to develop analytical reports for state, local,\nfederal, tribal or international law enforcement and regulatory agencies. These agencies then develop\ninvestigations based on the forwarded information as appropriate. In 2013, the IC3 received 262,813 consumer\ncomplaints with an adjusted dollar loss of $781,841,611[1], which is a 48.8 percent increase in reported losses since\n2012 ($581,441,110). The IC3 continues its efforts to inform the general public about online scams by publishing\npublic service announcements and providing tips for Internet consumers.\n\nThe IC3’s success attracts international interest. Canada, the United Kingdom and Germany use the IC3 as a\nmodel for similar cybercrime centers. In furtherance of its continuing support of foreign law enforcement, the IC3\nprepared dozens of country-specific statistical reports and disseminated hundreds of complaint referrals to FBI\nlegal attaché offices throughout the world. In 2014, the IC3 continues to pursue its mission to serve both the\nonline public and law enforcement and regulatory agencies throughout the entire global community.\n\n\n350,000\n\n300,000\n\n250,000\n\n200,000\n\n150,000\n\n100,000\n\n50,000\n\n0\n\n|Col1|336,655 314,246 IC3 Complaints by Year|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Col12|Col13|Col14|Col15|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n||314,246 303,809 289,874||||||||||||||\n||275,284 262,813 231,493||||||||||||||\n||207,492 207,492 206,884||||||||||||||\n||||||||||||||||\n||124,449||||||||||||||\n||75,064 50,412||||||||||||||\n||16,838||||||||||||||\n||||||||||||||||\n\n\n**Thousands**\n\n\n262,813\n\n231,493\n\n207,492 207,492 206,884\n\n124,449\n\n75,064\n\n50,412\n\n16,838\n\n2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013\n\n**IC3 Complaints by Year**\n\n\n1 Method of evaluating loss amounts: FBI IC3 Unit staff reviewed for validity all complaints that reported a loss of more than\n$100,000. Analysts also converted losses reported in foreign currencies to U.S. dollars. The final amounts of all reported\nlosses above $100,000 for which the complaint information did not support the loss amount were excluded from the statistics.\n\n**2013 Internet Crime Report** 3\n\n\n-----\n\n#### Project Partners\n\nAs a threat-based and intelligence-driven national security organization, the\nmission of the Federal Bureau of Investigation (FBI) is to protect and defend\nthe United States against terrorist and foreign intelligence threats, to uphold and\nenforce the criminal laws of the United States and to provide leadership and\ncriminal justice services to federal, state, municipal and international agencies\nand partners.\n\nThe mission of the National White Collar Crime Center (NW3C) is to provide\ntraining, investigative support and research to agencies and entities involved\nin the prevention, investigation and prosecution of economic and high-tech\ncrime. While the NW3C has no investigative authority itself, its job is to help\nlaw enforcement agencies better understand and utilize tools to combat\neconomic and high-tech crime. The NW3C has other sections within its\norganization, including Training (in Computer Crime, Financial Crime and\nIntelligence Analysis), Research and Investigative Support Services. The\nNW3C is funded by an annual Congressional appropriation through the\nBureau of Justice Assistance.\n\n\n-----\n\nThe IC3 is a valuable resource for both victims of Internet crime and the law enforcement agencies identifying,\ninvestigating and prosecuting these crimes. For the victims, the IC3 provides a convenient and easy-to-use\nreporting mechanism that alerts authorities to suspected criminal violations. For law enforcement agencies, the\nIC3 serves as a conduit to receive Internet-related complaints, to conduct research related to them and to develop\nanalytical reports based on them for state, local, federal, tribal or international law enforcement and regulatory\nagencies. These agencies then develop investigations based on the forwarded information, as appropriate.\n\n\n# 262,813\n\n#### Complaints Reported\n to the IC3 in 2013\n\n\n#### How it Works\n\nVictims file complaints with the IC3, which go into an extensive database. The IC3’s analysts review individual\ncomplaint data, identifying and grouping complaints with similar information. These complaints are collated and\nreferred to state, local, federal, tribal and international law enforcement for potential investigation. Analysts also\ncollect relevant case information from both open and closed\nsources. The IC3 analysts use automated matching systems to\nidentify links and commonalities between numerous complaints\nand combine the respective complaints into referral groups for law\nenforcement. Of the 262,813 complaints received in 2013, 45.5\npercent (119,457) reported financial loss.\n\nThe IC3 offers remote access capability, making data available to\nlaw enforcement anywhere. This Web-based access provides users\nthe ability to aggregate victims and losses to substantiate criminal\nactivity within the agency’s area of jurisdiction and to enhance\ndevelopment of cases. Although the IC3 may not immediately\nbuild all complaints into referrals, all complaints are helpful in\nidentifying trends and building statistical reports. These trends are\n[posted on the IC3’s website (www.ic3.gov) as public service](http://www.ic3.gov/)\nannouncements in a continuing effort to educate the general public on constantly evolving cyber scams and crime.\nThe IC3 encourages victims of Internet crime to report all incidents to the IC3 – whether or not an actual dollar\nloss is involved – due to the broad dissemination and varied uses of the data gathered from the complaints.\n\n\n-----\n\nThe following graphs represent the complaint counts according to gender, age, and the associated losses along\nwith maps showing the relative state and country ranking of complaints received by the IC3 during 2013.\nPrevious years’ trending has shown equalization between the genders in the number of IC3 complaints with 2013\ncount numbers closely associated with the same trend. These numbers reflect a trend in recent years in which the\nnumber of male and female complainants is equalizing. In 2013, there was a minimal increase in complaints\nreported to the IC3 by men compared to complaints reported by women in 2012.\n\n##### Gender Count Percentage Male 137,096 52.27% Female 125,717 47.73%\n\n Age Count Percentage Under 20 8,796 3.4% 20 – 29 48,032 18.3% 30 – 39 54,780 20.8% 40 – 49 55,838 21.2% 50 – 59 55,459 21.1% Over 60 39,908 15.2%\n\n**Overall Age Gender 2013 Statistics**\n\n##### Total\n Female Total Combined\n Age Range Male Count Male Loss Count Female Loss Complaints Losses\n Under 20 5,194 $103,298,649 3,602 $2,364,515 8,796 $105,663,164 20 – 29 24,549 $42,144,452 23,483 $23,619,502 48,032 $65,763,954 30 – 39 28,391 $71,022,425 26,389 $41,784,048 54,780 $112,806,473 40 – 49 26,668 $89,559,205 29,170 $70,355,407 55,838 $159,914,612 50 – 59 29,220 $93,705,383 26,239 $83,858,340 55,459 $177,563,723 Over 60 23,074 $87,244,816 16,834 $72,884,870 39,908 $160,129,686 Totals 137,096 $486,974,929 125,717 $294,866,681 262,813 $781,841,611\n\nThe maps on the following page demonstrate the top five countries and the top 10 states ranked by the number of\nvictim complaints reported to the IC3 during 2013.\n\n|Gender|Count|Percentage|\n|---|---|---|\n|Male|137,096|52.27%|\n|Female|125,717|47.73%|\n\n|Age|Count|Percentage|\n|---|---|---|\n|Under 20|8,796|3.4%|\n|20 – 29|48,032|18.3%|\n|30 – 39|54,780|20.8%|\n|40 – 49|55,838|21.2%|\n|50 – 59|55,459|21.1%|\n|Over 60|39,908|15.2%|\n\n|Age Range|Male Count|Male Loss|Female Count|Female Loss|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|5,194|$103,298,649|3,602|$2,364,515|8,796|$105,663,164|\n|20 – 29|24,549|$42,144,452|23,483|$23,619,502|48,032|$65,763,954|\n|30 – 39|28,391|$71,022,425|26,389|$41,784,048|54,780|$112,806,473|\n|40 – 49|26,668|$89,559,205|29,170|$70,355,407|55,838|$159,914,612|\n|50 – 59|29,220|$93,705,383|26,239|$83,858,340|55,459|$177,563,723|\n|Over 60|23,074|$87,244,816|16,834|$72,884,870|39,908|$160,129,686|\n|Totals|137,096|$486,974,929|125,717|$294,866,681|262,813|$781,841,611|\n\n\n-----\n\n**Top Ten States Ranked by the Total Number of Complaints Received by IC3 in 2013**\n\n\n-----\n\nThe IC3 continues to receive a wide variety of complaints on a multitude of crime schemes. The true volume and\nscope of cyber crime is unknown. What is known is that criminals continue to use a variety of scams to defraud\nInternet users. These schemes range from simple frauds to complex hacking and malicious software or malware\nscams. Some recurring and common crime schemes include:\n\n##### Auto-Auction Fraud – The IC3 has received a significant number of complaints regarding Internet auction fraud\ninvolving the sale of automobiles. Many of these listings are for vehicles located outside the United States. In\nmost cases the criminal attempts to sell vehicles they do not own. Criminals create attractive deals by advertising\nvehicles at prices below book value. Often criminals claims they must sell the vehicle because they are moving or\nbeing relocated for work. Due to the pending move, the criminals often refuse to meet with potential buyers or\nallow vehicle inspections and ultimately try to rush the sale. In an attempt to make the deal appear legitimate, the\ncriminal often instructs victims to send full or partial payments to third-party agents via wire transfers and to fax\ntheir payment receipt to the seller as proof of payment. Once payment is made, the criminal pockets the money\nand the victim never receives the vehicle.\n\n**Vehicle Scam Gender/Age Demographics 2013**\n\n##### Total\n Male Female Total Combined\n Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 281 $522,024 260 $461,060 541 $983,084 20 – 29 1,503 $3,770,671 1,189 $2,276,657 2,692 $6,047,328 30 – 39 1,812 $7,007,766 1,139 $3,440,037 2,951 $10,447,803 40 – 49 1,988 $8,338,286 1,141 $4,386,862 3,129 $12,725,148 50 – 59 2,146 $9,178,111 1,000 $3,316,403 3,146 $12,494,513 Over 60 1,312 $7,165,709 398 $1,717,925 1,710 $8,883,634 Totals 9,042 $35,982,566 5,127 $15,598,944 14,169 $51,581,511\n\nRomance Scams – The IC3 continues to receive complaints of romance scams in which scammers target\n##### individuals searching for companionship or romance online. Victims believe they are “dating” a good and honest person without ever physically meeting them. The online contact is often a criminal sitting in a\ncyber café with a well-rehearsed script used to repeatedly and successfully scam others. Perpetrators of these\nscams search chat rooms, dating sites, and social networking sites looking for potential targets. Although all\ndemographics are at risk, the group targeted the most appears to be people aged 40 years and older, divorced,\nwidowed, disabled, and often elderly.\n\nRomance scammers use poetry, flowers, and other gifts to draw in their victims. They continuously declare their\n“undying love” for victims. These criminals also use stories of severe life circumstances, tragedies, family deaths,\ninjuries to themselves, or other hardships to keep their victims concerned and involved in their schemes.\nScammers also ask victims to send money to help overcome alleged hardships.\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|281|$522,024|260|$461,060|541|$983,084|\n|20 – 29|1,503|$3,770,671|1,189|$2,276,657|2,692|$6,047,328|\n|30 – 39|1,812|$7,007,766|1,139|$3,440,037|2,951|$10,447,803|\n|40 – 49|1,988|$8,338,286|1,141|$4,386,862|3,129|$12,725,148|\n|50 – 59|2,146|$9,178,111|1,000|$3,316,403|3,146|$12,494,513|\n|Over 60|1,312|$7,165,709|398|$1,717,925|1,710|$8,883,634|\n|Totals|9,042|$35,982,566|5,127|$15,598,944|14,169|$51,581,511|\n\n\n-----\n\n##### Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 24 $5,530 18 $4,335 42 $9,865 20 – 29 247 $461,821 194 $568,389 441 $1,030,210 30 – 39 375 $1,833,507 578 $3,668,135 953 $5,501,642 40 – 49 433 $5,614,225 1,454 $14,240,923 1,887 $19,855,148 50 – 59 479 $5,059,941 1,598 $26,036,044 2,077 $31,095,984 Over 60 240 $3,231,036 772 $21,072,285 1,012 $24,303,320 Totals 1,798 $16,206,058 4,614 $65,590,111 6,412 $81,796,169\n\nFBI Scams – Perpetrators attempt to intimidate victims in emails by purporting to be high ranking government\nofficials. Many scams exploit the FBI name or the names of FBI executives such as the current FBI Director,\nJames Comey, and FBI former Director Robert Mueller, both of which had terms as the FBI’s Director during\n2013. There were 4,391 complaints reported to the IC3 in 2013 that referenced both FBI Directors. The FBI\nspecific schemes typically remain the same as scammers just update their scam verbiage to reflect the current FBI\nDirector’s name. FBI impersonation schemes pose a viable threat to national security by undermining public trust\nthat directly impacts law enforcement’s ability to do its job. Government agencies do not send unsolicited e-mails\nof this nature. While FBI, Department of Justice and other United States government executives are briefed on\nnumerous investigations, they do not personally contact consumers regarding such matters. United States\ngovernment agencies use the legal process to contact individuals. These agencies do not send threatening letters or\ne-mails to consumers demanding payments for Internet crimes. The total FBI related scams reported to the IC3\nduring 2013 is represented in the chart below.\n\n**FBI Scams Age Gender 2013 Statistics**\n\n##### Total\n Male Female Total Combined\n Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 94 $22,311 34 $4,245 128 $26,556 20 – 29 524 $72,576 377 $61,842 901 $134,418 30 – 39 681 $348,461 677 $131,169 1,358 $479,630 40 – 49 996 $387,747 983 $368,372 1,979 $756,119 50 – 59 1,408 $1,369,661 1,185 $1,145,591 2,593 $2,515,252 Over 60 1,451 $972,837 759 $1,464,070 2,210 $2,436,907 Totals 5,154 $3,173,593 4,015 $3,175,288 9,169 $6,348,881\n\nHit Man Scam – The IC3 continues to receive reports about a hit man/extortion e-mail scheme. The scheme has\nbeen around for several years but the content used in the e-mailed messages changes. The ultimate goal is for the\nperpetrators to defraud people through disturbing e-mails. The scam originated as a person sending an e-mail\nportraying himself as a hit man hired to kill the victim. The e-mail instructs the recipient to pay a fee to remain\nsafe and avoid having the hit carried out. Although the e-mail content is disturbing, the IC3 has not received any\nreports of the loss of life.\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|24|$5,530|18|$4,335|42|$9,865|\n|20 – 29|247|$461,821|194|$568,389|441|$1,030,210|\n|30 – 39|375|$1,833,507|578|$3,668,135|953|$5,501,642|\n|40 – 49|433|$5,614,225|1,454|$14,240,923|1,887|$19,855,148|\n|50 – 59|479|$5,059,941|1,598|$26,036,044|2,077|$31,095,984|\n|Over 60|240|$3,231,036|772|$21,072,285|1,012|$24,303,320|\n|Totals|1,798|$16,206,058|4,614|$65,590,111|6,412|$81,796,169|\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|94|$22,311|34|$4,245|128|$26,556|\n|20 – 29|524|$72,576|377|$61,842|901|$134,418|\n|30 – 39|681|$348,461|677|$131,169|1,358|$479,630|\n|40 – 49|996|$387,747|983|$368,372|1,979|$756,119|\n|50 – 59|1,408|$1,369,661|1,185|$1,145,591|2,593|$2,515,252|\n|Over 60|1,451|$972,837|759|$1,464,070|2,210|$2,436,907|\n|Totals|5,154|$3,173,593|4,015|$3,175,288|9,169|$6,348,881|\n\n\n-----\n\n##### Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 9 $1,092 6 $15 15 $1,107 20 – 29 25 $2,529 28 $2,272 53 $4,801 30 – 39 52 $135,841 110 $34,893 162 $170,734 40 – 49 70 $134,770 101 $664,623 171 $799,393 50 – 59 93 $34,284 105 $865,258 198 $899,542 Over 60 121 $5,805 52 $59,826 173 $65,631 Totals 370 $314,321 402 $1,626,887 772 $1,941,208\n\nRansomware/Scareware Scams – The IC3 has received multiple complaints surrounding ransomware /scareware\nschemes. These schemes are used to target and extort funds from victims by intimidating them. These scams\nbegan years ago with false claims in which the perpetrators pretended to be federal government officials who\nwere watching or monitoring the victims’ Internet usage. Schemes continue to change and some of the most\nreported schemes involve those discussed below.\n\n  - Cryptolocker Ransomware – The IC3 became aware of the CryptoLocker scheme in October 2013. It\nspreads via e-mail and propagates rapidly. The virus encrypts various file types and then a pop-up\nwindow appears on victims’ computer that states their data has been encrypted. The only way to get it\nback is to send a specified monetary payment to the perpetrator. This ransomware provides the victim\nwith a timeline to pay via a displayed countdown clock. If victims do not pay on time, they lose the\nability to pay and risk having their data permanently encrypted and rendered unusable. Perpetrators are\ndemanding a $300 to $700 payment sent to the perpetrator using various methods.\n\n  - Child Pornography Scareware – This scareware is transmitted when computer users visit an infected\nwebsite. The victim’s computer locks up and displays a warning that the user has violated U.S. federal\nlaw. Child pornography is either embedded in a banner image that appears on the victims’ screen or\nrevealed via an automatic browser redirecting them to a child pornography website. The scareware is used\nas an extortion technique by threatening prosecution for visiting or viewing these images. The victim is\nalso informed that they have been recorded using audio, video and other devices. The only way to unlock\nthe computer is to pay the fine, usually between $300 and $5,000.\n\n  - Citadel Ransomware – The Citadel ransomware, named Reveton, displays a warning on the victims’\ncomputer purportedly from a law enforcement agency claiming that their computer had been used for\nillegal activities, such as downloading copyrighted software or child pornography. To increase the\nillusion they are being watched by law enforcement, the screen also displays the victim’s IP address and\nsome victims even report activity from their webcam. Victims are instructed to pay a fine to the U.S.\nDepartment of Justice to unlock their computer. Many were told to pay the fines via prepaid cash\nservices such as Ucash or Paysafecard. In addition to installing the ransomware, the Citadel malware\ncontinues to operate on the compromised computer to collect sensitive data that could potentially be\nused to commit a variety of financial frauds.\n\n  - Fake or Rogue Anti-Virus Software – In this scheme victims are scared into purchasing anti-virus\nsoftware that would allegedly remove viruses from their computers. A pop-up box appears that informs\nusers that their computers are full of viruses and need to be cleaned. The pop-up message has a button\nvictims can click to purchase anti-virus software that supposedly can immediately get rid of these viruses.\nIf the victims click the pop-up to purchase the anti-virus software, they are infected with malware. In\nsome instances, victims have been infected regardless of clicking on the pop-up box.\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|9|$1,092|6|$15|15|$1,107|\n|20 – 29|25|$2,529|28|$2,272|53|$4,801|\n|30 – 39|52|$135,841|110|$34,893|162|$170,734|\n|40 – 49|70|$134,770|101|$664,623|171|$799,393|\n|50 – 59|93|$34,284|105|$865,258|198|$899,542|\n|Over 60|121|$5,805|52|$59,826|173|$65,631|\n|Totals|370|$314,321|402|$1,626,887|772|$1,941,208|\n\n\n-----\n\n##### Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 29 $1,005 14 $5 43 $1,010 20 – 29 95 $17,546 55 $1,980 150 $19,526 30 – 39 91 $160,580 71 $15,930 162 $176,510 40 – 49 116 $116,998 108 $2,648 224 $119,646 50 – 59 122 $211,234 87 $2,255 209 $213,489 Over 60 143 $7,969 60 $1,412 203 $9,381 Totals 596 $515,332 395 $24,230 991 $539,562\n\nReal-Estate Rental Scams – Perpetrators search websites that list homes for sale and take information from\nlegitimate ads and post it with their own e-mail addresses on online advertising sites. The houses are usually listed\nwith below-market rental rates to immediately attract potential victims. Those interested contact the perpetrator\nvia e-mail. The perpetrator usually tells some story about having to leave the area quickly due to employment or\nvolunteer work. Many claim they left the United States for missionary or contract work in Africa. Victims are\nusually instructed to send money overseas—enough to cover the first and last month’s rent—via a wire transfer\nservice. In some cases the perpetrators require potential renters to fill out credit applications so they can obtain\npersonal information, e.g., credit history, employment history, Social Security number and any number of other\ncrimes.\n\n**Real Estate Scam Age Gender 2013 Statistics**\n\n##### Total\n Male Female Total Combined\n Age Range Complaints Losses Complaints Losses Complaints Losses\n Under 20 45 $33,021 108 $66,398 153 $99,419 20 – 29 874 $642,457 1,485 $990,078 2,359 $1,632,534 30 – 39 940 $1,031,101 1,445 $981,793 2,385 $2,012,894 40 – 49 812 $893,720 1,326 $2,161,027 2,138 $3,054,747 50 – 59 815 $1,895,945 1,214 $2,399,689 2,029 $4,295,635 Over 60 662 $3,402,049 658 $4,077,148 1,320 $7,479,197 Totals 4,148 $7,898,293 6,236 $10,676,133 10,384 $18,574,426\n\nGrandparent Telephone Scams – Perpetrators target elderly individuals by claiming to be a grandson,\ngranddaughter, or other relative in desperate need of legal or financial assistance. Most schemes involve claims of\nbeing arrested or in some type of accident. The callers create a sense of urgency and make desperate pleas for\nmoney. The caller begs the grandparents not to tell the parents while often crying to help prevent the potential\nvictims from discovering the scam. Once potential victims appear to believe the caller, they are provided\ninstructions to wire money to an individual, often referred to as a bail bondsman, for their grandchild to be\nreleased by law enforcement. Investigations have determined potential victims were identified via mass-produced\nlead lists that target specific demographics. Perpetrators were identified using telephone numbers generated by\nfree apps to make the phone calls. This seems to be an added attempt to convince the grandparents the call is\nlegitimate (by displaying a recognizable number on the caller ID) and an attempt to mask the real telephone\nnumber they are using to make it harder for law enforcement to investigate.\n\nTimeshare Marketing Scams – Timeshare owners across the country are being scammed out of millions of dollars\nby unscrupulous companies that promise to sell or rent their properties. In the typical scam, timeshare owners\nreceive unexpected telephone calls or e-mails from criminals posing as sales representatives for timeshare resale\ncompanies. The representatives promise quick sales, often within 60 to 90 days. The sales representatives\nfrequently use high-pressure sales tactics to add a sense of urgency to the deal. Some victims have reported that\nsales representatives pressured them by claiming they already had a buyer waiting, either on another line or even\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|29|$1,005|14|$5|43|$1,010|\n|20 – 29|95|$17,546|55|$1,980|150|$19,526|\n|30 – 39|91|$160,580|71|$15,930|162|$176,510|\n|40 – 49|116|$116,998|108|$2,648|224|$119,646|\n|50 – 59|122|$211,234|87|$2,255|209|$213,489|\n|Over 60|143|$7,969|60|$1,412|203|$9,381|\n|Totals|596|$515,332|395|$24,230|991|$539,562|\n\n|Age Range|Male Complaints|Losses|Female Complaints|Losses|Total Complaints|Total Combined Losses|\n|---|---|---|---|---|---|---|\n|Under 20|45|$33,021|108|$66,398|153|$99,419|\n|20 – 29|874|$642,457|1,485|$990,078|2,359|$1,632,534|\n|30 – 39|940|$1,031,101|1,445|$981,793|2,385|$2,012,894|\n|40 – 49|812|$893,720|1,326|$2,161,027|2,138|$3,054,747|\n|50 – 59|815|$1,895,945|1,214|$2,399,689|2,029|$4,295,635|\n|Over 60|662|$3,402,049|658|$4,077,148|1,320|$7,479,197|\n|Totals|4,148|$7,898,293|6,236|$10,676,133|10,384|$18,574,426|\n\n\n-----\n\nfrom hundreds to thousands of dollars. Once the fee is paid, timeshare owners report that the company becomes\nevasive as calls go unanswered, numbers are disconnected and websites are inaccessible. In some cases, timeshare\nowners who have been defrauded by a timeshare sales scheme have been subsequently contacted by an\nunscrupulous timeshare fraud recovery company as well. The representative from the recovery company promises\nassistance in recovering money lost in the sales scam. Some recovery companies require up-front fees as well for\nservices rendered. The IC3 has identified some instances in which people involved with the recovery company\nalso have a connection to the resale company, raising the possibility that timeshare owners are being scammed\ntwice by the same perpetrators.\n\nWork-at-Home (Employment) Scams – Work-at-home scams continue to be very successful as more and more\npeople turn to the Internet to look for jobs. Poor economic conditions lead people in financial hardships to accept\nany job they are offered. Although many work-at-home victims are unwitting in their participation in these scams,\nothers are witting participants. Regardless, these individuals can face criminal charges and, potentially,\nprosecutions. Victims of work-at-home scams are often recruited by organized cyber criminals through\nnewspaper ads, online employment services, unsolicited e-mails or “spam,” and social networking websites.\nVictims of work-at-home schemes become “mules” for cyber criminals who use their financial accounts to steal\nand launder money.\n\nSoftware Company Telephone Scams – Victims of these telephone scams began receiving calls from individuals\nallegedly claiming to be from legitimate, well-known software companies. The victims are advised that malware\ndetected on their computer poses an impending threat. The fraudsters tried to instill a feeling of urgency so\nvictims would take immediate action and log in to their computers. Once the victims did so, the fraudsters\ndirected them to the utility area of the computers, where they appeared to demonstrate how the computers were\ninfected. The fraudsters offered to rid the computers of the malware for fees ranging from $49 to $450. When the\nvictims agreed to pay the fees, they were directed to a website where they entered a code or downloaded a\nsoftware program that allowed the fraudsters remote access to their computers.\n\nPayday Loan Scams – In the payday loan scam or loan intimidation scam, the perpetrator relentlessly attempts to\ncontact victims via their home, cell and work phone numbers. Victims are told they are delinquent on a payday\nloan and must repay the loan to avoid legal consequences. The caller fraudulently impersonates being a\nrepresentative of the FBI, Federal Legislative Department, law firms, or other legitimate-sounding agencies. They\nclaim to be collecting debts for companies such as United Cash Advance, U.S. Cash Advance, U.S. Cash Net, and\nother Internet check-cashing services. They refuse to provide the victim with any details of the alleged payday\nloans and often become abusive when questioned. The callers threaten victims with legal actions, arrests and, in\nsome cases, physical violence if they refuse to pay. In many cases, the callers even resort to harassment of\nvictims’ relatives, friends, and employers. What makes these schemes so successful is the perpetrator’s use of\naccurate information about the victims, including Social Security numbers, dates of birth, addresses, employer\ninformation, bank account numbers, names and sometimes even telephone numbers of relatives and friends. How\nthe fraudsters obtain the personal information is unclear, but victims often relay that they had completed online\napplications for other loans or credit cards before the calls began.\n\nLoan Modification Scams – A loan modification scam often starts when a bogus loan company contacts a\ndistressed homeowner via phone, e-mail or mailing, and offers them a loan modification plan. In some cases the\nvictim may have initiated the contact by reaching out to these companies after seeing an advertisement. The loan\nmodification typically includes a lower interest rate, an extension in the length of the loan term, a change in the\ntype of loan or any combination of the three.\n\nAs a part of this scam, the company instructs the homeowner to cease all communication with lenders and stop\nmaking mortgage payments until the loan modification process is complete. The homeowner is required to send\nmoney to cover “processing fees” and “closing costs” for the new loan to be processed and approved. After the\nhomeowner sends the money, the loan modification company stops its communications with victims, leaving the\nhomeowner behind on actual mortgage payments and unable to recover funds sent to the bogus company.\n\nSextortion Scams – Perpetrators of these scams often initiate conversation via social media websites and/or online\ndating websites. Once a rapport has been established, victims are asked to engage in video chats in which they are\n\n\n-----\n\ncontacts unless funds, ranging in the amounts of $50 to $300, are wired to various destinations.\n\nGun Sale Scams – Fraudsters begin this scam by enticing victims into purchasing firearms by advertising them\nbelow market value. They post advertisements using photos and bogus descriptions lifted from legitimate firearm\nads. Most complaints reported to the IC3 involved the sale of rifles or long guns. The perpetrators normally ask\nthe victim to e-mail or fax them a copy of a photo ID to make the sale appear more legitimate. The scammers\nseem to know gun transfer procedures because they obtain federal firearm license transfer information from the\nvictim and pretend to set up the transfer. The victim purchases the gun but never receives it. Victims have lost\nhundreds to thousands of dollars with this scam to date.\n\nFraudulent Tech Support Call Scams – Perpetrators of these scams contact victims via phone and impersonate\ntech support employees from various legitimate companies (e.g., Dell, Microsoft, Western Union, etc.). In some\ncases the company name is displayed on the victims’ caller ID. The callers usually instruct the victims to get\nonline to visit specified web sites the scammers controls. Many ask victims to download files or run various\napplications that either provide the caller with remote access to the victims’ computer or infect it with malware. If\nremote access is established, the victims are instructed to open and log-in to various accounts to allow the caller to\nupdate the system. The victims are then told to turn off their monitors to avoid interference with the update. The\nvictims later discover that the subjects have made wire transfers out of their accounts.\n\nPhoto and Mug Shot Scam – Scammers post photos or mug shots of individuals to extort money. Some victims\nhave reported they were juveniles at the time of the arrest and the information should be sealed, while others\ncomplain the information is fakery or completely made up. Regardless, the photos and information are posted to\nsites such as www.bustedmugshots.com, www.mugshots.com, www.justmugshots.com, or\nwww.unpublishmugshots.com. Complainants who request to have their mug shot removed must provide a copy of\ntheir driver’s license, court record and other personal identifying information. This provides the perpetrator with\ninformation they can use for a variety of other crimes. Other complainants have paid removal fees but\nunfortunately never had their mug shots deleted. If they were removed, the mug shots appeared on similar\nwebsites.\n\nCollege and University Scams – The IC3 has identified two scams involving college or universities. In the first\nscam the perpetrators register domains similar to domains owned by well-known colleges and universities. Once\nsimilar domains are registered, they establish an e-mail address that appears to be from the purchasing department\nof a legitimate institution. Using logos and information obtained from the home page of the legitimate school, the\nfraudsters create fake purchase orders or requests for quotations and place orders with various merchants for items\nsuch as routers, toner, or hard drives. The merchandise is shipped to various locations so that other scam\nparticipants can re-package and re-ship items to overseas locations, usually Nigeria. The second scam involves\nspear-phishing e-mails that are sent to university employees to dupe them into giving up their log-in credentials to\nthe schools’ websites. Once the fraudsters access the website, they can click on an online airline ticket booking\ntool to purchase airline tickets with compromised credit cards or use credit cards already set up for that account.\nItinerary receipts are e-mailed to Yahoo!/Google/Hotmail accounts rather than the accounts with “.edu”\nextensions.\n\nSIM Card Swap Scam – Subscriber Identification Module (SIM) swap fraud occurs when an individual\ncompromises or steals the SIM card from a cell phone. This card can provide perpetrators with personal\nidentification, cell phone information (number, provider, etc.), and the ability to contact the carrier to request a\nnew SIM card. When the perpetrator receives and activates the new SIM card, the victim’s card is deactivated.\nVictims may notice their phone will no longer transmit messages or calls. All alerts, payment confirmations, and\nother various messages are then transmitted to the fraudster. SIM swapping is sometimes the second phase of the\nscam. Initially, the perpetrator will send phishing emails to obtain credit card or bank account information. If the\nperpetrator receives enough information, he/she can wipe out bank accounts, run up credit cards, and even open\nnew accounts or create fraudulent identification documents.\n\nThe scams above are just some of the Internet fraud schemes the IC3 received in 2013. This is by no means a\ncomprehensive list of Internet crimes, but it provides information on some of the most common schemes\ncriminals are using to defraud the public. A detailed list of common schemes is available at\n\n\n-----\n\nhttp://www.ic3.gov/media/default.aspx.\n\n#### IC3 Case Highlights\n\n**Grand Theft: Polk County Florida Sheriff’s Office**\n\nThe IC3 provided complaints to the Polk County Sheriff’s Office in December 2009. The monetary losses totaled\n$15,114. In January 2010, the Polk County Sheriff’s Office advised the IC3 that its agency initiated an\ninvestigation against Jack Loftin. The complainants advised they purchased concert tickets from the subject, but\nnever received them or a refund of their monies. Most of the victims established initial contact with the subject\nthrough an eBay auction website. Many of the victims utilized PayPal as the medium for payment. An affidavit\nreleased by the Office of the State Attorney, 10[th] Judicial Circuit stated the subject tricked people into thinking he\nhad VIP tickets for performers like Jimmy Buffet, Miley Cyrus or Aerosmith. The subject was charged with\npocketing $92,000 from victims across the country and not providing tickets or refunds. Loftin pleaded guilty to\n24 counts of grand theft in November 2012 and was sentenced to 16 months imprisonment and ordered to pay\n$87,000 in restitution on Jan. 18, 2013. He was also sentenced to 13 years probation during which time all\nrestitution to victims must be paid.\n\n##### “Your agency provided crucial information that was utilized to locate the\n\n victims exploited by Jack Loftin. Because of your assistance, our office was\n\n able to have a successful prosecution which resulted in a state prison\n\n sentence and an order of restitution to the victims in this case.”\n\n**Wire Fraud: United States Secret Service (USSS)**\n\nThe IC3 has been working with USSS in Springfield, Ill., since March 2008 regarding a subject in a wire fraud\ninvestigation. The subject, Chris Sours, advertised Internet-based businesses for sale, collected large sums of\nmoney but did not provide legitimate websites to his customers. According to the USSS, victims have sent\namounts ranging from $2,000 to $45,000. The IC3 found related complaints from October 2005 to February 2012.\nTotal dollar loss from these complaints was $257,966. On November 13, 2012, Chris Sours was arrested, pled\nguilty, and was indicted. On April 13, 2013, Chris Sours was sentenced to 60 months incarceration and ordered to\npay $343,233 in restitution in the Central District of Illinois, Rock Island, Illinois.\n\n**High Yield Investment Fraud: FBI, Southern District of Florida**\n\nThe IC3 provided multiple complaints with a monetary loss of $390,889 to various FBI field offices in July 2007.\nThe complainants reported that Kerry Deevy and his co-conspirators fraudulently induced purchasers to buy into\nfake business opportunities. Kerry Deevy and his co-conspirators purported to sell vending machines and greeting\ncard businesses, including assistance in establishing, maintaining and operating such businesses. The companies\n\n\n-----\n\ncompanies were located in the United States, including registering the corporations and renting office space to\nmake the scheme more authentic. In reality, the subject was operating from Costa Rica.\n\nOn April 11, 2013, the subject pleaded guilty in the U.S. District Court for the Southern District of Florida to 13\ncounts of an indictment, charging him with conspiracy to commit mail and wire fraud, mail fraud, and wire fraud.\nThe subject was charged in connection with the operation of a series of fraudulent business opportunities after\nbeing indicted in November 2012 by a federal grand jury. Following his arrest, the subject was extradited to the\nUnited States for prosecution. The subject was sentenced to 60 months in prison and five years’ supervised\nrelease on Aug. 13, 2013 and ordered to pay $4,541,914 in restitution.\n\n**Nigerian Romance Scam: Colorado Attorney General’s Office**\n\nBetween March 2010 and October 2011, the IC3 received complaints from individuals who reported they were\ndefrauded via the Internet by Karen and Tracy Vasseur, a mother-daughter pair. The victims established\nrelationships with the subjects through online dating services and social networks. Often the subjects purported to\nbe overseas for military service. After trust had been built, the subjects began asking for funds to aid in\npurchasing better cellular phones and technology. Funds were also supposedly being used for leave or military\ntime-off travel. Although funds were sent via MoneyGram and direct bank wires, the relationships were not\nmaintained as promised. Victims reported a combined monetary loss of $34,670.\n\nThe Colorado Attorney General’s Office opened a case in February 2012. Subsequent searches of the IC3\ncomplaint database revealed an additional 126 complaints for a combined monetary loss of $130,673. It is\nbelieved that Karen and Tracy Vasseur collected funds, kept a percentage, and then wired the remainder to\nunknown Nigerian bosses. On Aug. 28, 2013, the subjects were sentenced for convictions stemming from a\n“Nigerian Romance Scam.”\n\n**Counterfeit Check Scheme: Federal Law Enforcement**\n\nThe IC3 received several hundred complaints related to a scheme in which law firms were the targets of a\ncounterfeit check scheme. The victims of the scam received e-mails that requested the law firms’ assistance for\ndebt collection. The victims received checks from the alleged debtor and were given instructions to wire the\ncollected funds minus attorney fees. In most cases, the funds were wired to banks in Korea, China, Ireland and\nCanada. In all cases, the checks were returned as counterfeit. The IC3 first provided information to various field\noffices and the U.S. Postal Inspection Service (USPIS) regarding this scheme in October 2008. The IC3 supported\nmany field offices with research and complaints as the scheme evolved.\n\nIn 2009, the IC3 obtained information that identified a major West African scammer in the Ontario area that has\nbeen connected to the collection scam affecting law firms in the U.S. and Canada. As the IC3 obtained more\nintelligence and conducted additional research, a nexus was established with FBI Birmingham, the USPIS, and\nthe U.S. Secret Service case against Emmanuel Ekhator, a Nigerian national. The IC3 supported Birmingham with\ncomplaints, research, and produced public service announcements related to the subject’s fraudulent activity. In\n2010, the U.S. District Court for the Middle District of Pennsylvania charged the subject for his crime and in\nAugust 2011, he was extradited from Nigeria to the United States. The subject was ultimately sentenced in 2013\nto 100 months in federal prison and a three-year term of supervised release for his role in a multi-national scheme\nthat deceived victims of more than $70 million and ordered to pay $11,092,028 in restitution and serve a threeyear term of supervised release following incarceration.\n\n#### New Initiatives\n\nIn 2013, the FBI launched Operation Wellspring, an initiative by which the FBI, through the IC3, provides casespecific tactical intelligence and expert analysis to state and local law enforcement agencies engaged in\ninvestigating Internet crime. Through Operation Wellspring, the IC3 sends targeted intelligence and fraud\npackages to participating state, local and tribal law enforcement who successfully leverage FBI resources in\ndeveloping successful cases. Meanwhile, the participating law enforcement agencies reciprocate by providing the\nIC3 with a continual flow of information and updates which, ultimately, will help other federal, state, and even\n\n\n-----\n\nperpetrators of Internet crime.\n\nBased on this initiative, as of April 2014, the IC3 had referred out dozens of case referrals representing more than\n900 victim complaints with total reported losses over $3.5 million. The FBI and Utah’s Cyber Task Force\nsuccessfully prosecuted two of these cases. The first case involved Darrell Cooper, who pled guilty to felony\ntheft, for stealing hundreds of DVDs from a grocery store rental kiosk and another case involving Shane Call,\nwho pled guilty to communications fraud for his involvement in selling counterfeit jerseys online.\n\n#### Protecting the Public\n\nThe IC3 understands the importance of informing the public about the dangers of cybercrime. The IC3’s public\nservice announcements (PSAs) and scam alerts are posted online and distributed to law enforcement and various\nmedia outlets. The PSAs keep consumers informed on the latest cyber trends and keep industry partners up-todate about Internet fraud. The scam alerts are based upon information from law enforcement and complaints\nsubmitted to the IC3. These reports detail recent cybercrime trends and new twists to previously existing cyber\nscams.\n\n[The IC3 maintains the website www.lookstoogoodtobetrue.com, an educational site developed by a joint federal](http://www.lookstoogoodtobetrue.com/)\nlaw enforcement and industry task force. This site gives consumers an opportunity to submit and review\ntestimonials. Testimonials include stories in which consumers were defrauded by a scam, or they did not fall\nvictim to a scam, and how they avoided becoming a victim. The PSAs, scam alerts and forms are all found on the\nIC3’s website, www.ic3.gov.\n\n#### Conclusion\n\nThis report details the IC3’s efforts to prevent and reduce the prevalence and impact of the crimes highlighted.\nThroughout 2013, the IC3 has supported law enforcement officers in their investigations of Internet-related\ncrimes. In 2013, the IC3 processed 262,813 complaints, representing more than $781 million in losses. In\naccordance with its mission, the IC3 referred complaints to state, local, federal, tribal and international law\nenforcement agencies and interacted with these agencies’ personnel to support ongoing investigative initiatives\nand to develop new ones as the cyber-crime landscape evolves. The IC3’s support led to numerous investigations\nthat resulted in arrests, seizures, convictions and restitution, among other actions. The IC3 also produced monthly\ntrend analysis reports, public service announcements, scam alerts, and other publications to alert law enforcement\nand the general public about the pervasiveness of online crime. The IC3 continually reviews its services and\nanalytical tools to incorporate the latest advances in technology and ensure law enforcement needs are met.\n\n\n-----\n\n#### Online Crime Prevention\n\nEvery day the IC3 receives complaints from victims who clicked links in an e-mail or paid up-front fees for a\nproduct or service only to be conned out of their hard-earned money. Based on the type of scam, there are a\nnumber of things a consumer can do to avoid becoming a victim (information from\nwww.ic3.gov/preventiontips.aspx).\n\n##### Auction Fraud\n\n • Before you bid, contact the seller with any questions you have. Review the seller’s feedback.\n\n- Be cautious when dealing with individuals outside of your country.\n\n- Ensure you understand refund, return and warranty policies.\n\n- Determine the shipping charges before you buy.\n\n- Be wary if the seller only accepts wire transfers or cash.\n\n- Consider insuring your item.\n\n- Be wary of businesses that operate from P.O. boxes or mail drops (which are receptacles or\nslots for mail collection) as this may indicate a less than legitimate purpose.\n\n##### Employment/Business Opportunities \n\n- Be wary of inflated claims of product effectiveness.\n\n##### • Be cautious of exaggerated claims of possible earnings or profits.\n\n- Beware when money is required up front for instructions or products.\n\n- Be wary when the job posting claims “no experience necessary.”\n\n- Do not give your Social Security number when first interacting with your prospective\nemployer.\n\n- Be wary when replying to unsolicited emails for work-at-home employment.\n\n##### Identity Theft\n\n- Ensure websites are secure before submitting a credit card number.\n\n- Never throw away credit card or bank statements in usable form. Shred them to protect your\nidentity.\n\n- Be aware of missed bills, which could indicate the account has been taken over.\n\n- Be cautious of scams requiring personal information.\n\n- Never give a credit card number over the phone unless you initiate the call.\n\n- Monitor credit statements monthly for any fraudulent activity. Review a copy of your credit\nreport at least once a year.\n\nR t th i d t ti t b k dit d i ibl\n\n\n-----\n\n- If purchasing merchandise, ensure it is from a reputable source. Do research to ensure th e\nlegitimacy of the individual or company.\n\n- Beware of providing credit card information through unsolicited emails.\n\n- Promptly reconcile credit card statements to avoid unauthorized charges.\n\n##### Debt Elimination\n\n- Know whom you are doing business with: Do your research. Contact the state Attorney\nGeneral’s Office or the state corporation commission to see if there are any consumer\ncomplaints on file against the business you are interested in.\n\n- Be cautious when dealing with individuals outside of your own country.\n\n- Ensure you understand all terms and conditions of any agreement before you sign it.\n\n##### Investment Fraud, Ponzi and Pyramid Schemes\n\n- If the opportunity appears too good to be true, it probably is.\n\n- Beware of promises to make fast profits.\n\n- Be wary of investments that offer high returns at little or no risk.\n\n- Be cautious when you are required to bring in subsequent investors.\n\n- Do not invest in anything unless you understand the deal.\n\n- Verify the terms of any investment that you intend to make through independent means.\nBeware of references given by the promoter.\n\n- Do not assume a company is legitimate based on the appearance of its website.\n\n- Be leery when responding to investment offers received through unsolicited e-mail.\n\n##### Lotteries\n\n- Be wary if you do not remember entering a lottery or contest.\n\n- Be wary if you receive a telephone call stating you are the winner in a lottery.\n\n- Be wary of lotteries that charge a fee before delivery of your prize.\n\n- Be wary of demands to send additional money to be eligible for future winnings.\n\n- It is a violation of federal law to play a foreign lottery via mail or phone.\n\n**2013 Internet Crime Report** 18\n\n\n-----\n\n- Avoid filling out forms in e-mail messages that ask for personal information.\n\n- Always compare the link in the e-mail to the link to which you are actually directed.\n\n- Research what a company’s official website is instead of “clicking a link” from an unsolicited email.\n\n- Contact the actual business that supposedly sent the e-mail to verify if the e-mail is genuine.\nDo so via your own research or by using the phone number on the back of the card if the message\npurports to be from a bank or credit card provider or the statements you receive.\n\n##### Spam\n\n- Do not open spam. Delete it unread.\n\n- Never respond to spam as this will confirm to the sender that it is a “live” e-mail address.\n\n- Have a primary and secondary e-mail address: one for people you know and one for all other\npurposes.\n\n- Avoid giving out your e-mail address unless you know how it will be used.\n\n- Never purchase anything advertised through unsolicited e-mail.\n\n##### Reshipping\n\n- Be wary if you are asked to ship packages to an “overseas home office.”\n\n- Be cautious if the individual states that his country will not allow direct business shipments\nfrom the United States.\n\n- Be wary if the ship-to address is yours but the name on the package is not.\n\n- Do not accept packages you did not order.\n\n- If you receive packages you did not order, either refuse delivery or contact the company that\nsent the package.\n\n- Be suspicious of any unsolicited e-mail requesting personal information.\n\n**2013 Internet Crime Report** 19\n\n\n-----\n\n#### pp 2013 IC3 Warnings/Press Releases \n\n1. Holiday Shopping Tips (November 26, 2013)\n\n2. IC3 Scam Alerts (November 25, 2013)\n\n3. DOJ Awareness of Disaster Fraud Hotline Following Typhoon Haiyan (November 14, 2013)\n\n4. CryptoLocker Ransomware Encrypts User’s Files (October 28, 2013)\n\n5. Spam E-Mails Continuing to Capitalize on FBI Officials’ Names (September 25, 2013)\n\n6. Beta Bot malware blocks users anti-virus programs (September 18, 2013)\n\n7. Spear-Phishing E-mail with Missing Children Theme (August 22, 2013)\n\n8. IC3 Scam Alerts (August 13, 2013) (August 13, 2013)\n\n9. Spam: Delivering Malware and Advertising Dangerous Counterfeit Goods (August 07, 2013)\n\n10. Consumer Alert: Pirated Software May Contain Malware (August 07, 2013)\n\n11. Citadel Malware Continues to Deliver Reveton Ransomware in Attempts to Extort Money (July 29, 2013)\n\n12. IC3 Scam Alerts (July 18, 2013) (July 18, 2013)\n\n13. Ransomware Purporting To Be From The FBI Is Targeting OS X Mac Users (July 18, 2013)\n\n14. [Cyber Criminals Continue to Use Spear-Phishing Attacks to Compromise Computer Networks (June 25,](http://www.ic3.gov/media/2013/130625.aspx)\n\n2013)\n\n15. IC3 Scam Alerts (June 19, 2013) (July 19, 2013)\n\n16. Cyber Criminals Using Photo-Sharing Programs to Compromise Computers (May 30, 2013)\n\n17. IC3 2012 Internet Crime Report Released (May 14, 2013)\n\n18. Phishing Attacks On Telecommunication Customers (May 08, 2013)\n\n19. IC3 Scam Alerts (May 2, 2013) (May 02, 2013)\n\n20. Boston Marathon Fraud (April 25, 2013)\n\n21. [IC3 Scam Alerts (January 7, 2013) (January 07, 2013)](http://www.ic3.gov/media/2013/130107.aspx)\n\n**2013 Internet Crime Report** 20\n\n\n-----\n\n#### pp 2013 IC3 Subject Country Statistics\n\n**Subject Countries by Complaint Count 2013**\n\n##### Percentage Percentage\n Complaint of Complaint of\n Rank Country Count Complaints Rank Country Count Complaints\n 1 United States 83,799 31.89% 26 Japan 242 0.09% 2 United 4,511 1.72% 27 United Arab 239 0.09% Kingdom Emirates\n 3 Nigeria 3,598 1.37% 28 Indonesia 229 0.09% 4 China 2,601 0.99% 29 Sweden 168 0.06% 5 Canada 1,782 0.68% 30 Switzerland 167 0.06% 6 India 1,529 0.58% 31 Turkey 154 0.06% 7 Ghana 782 0.30% 32 Pakistan 152 0.06% 8 Philippines 714 0.27% 33 Singapore 140 0.05% 9 Germany 603 0.23% 34 Belgium 131 0.05% 10 Afghanistan 578 0.22% 35 Romania 130 0.05% 11 South Africa 534 0.20% 36 Thailand 128 0.05% 12 Russian 533 0.20% 37 Panama 125 0.05% Federation\n 13 Malaysia 524 0.20% 38 Morocco 120 0.05% 14 Macedonia, 508 0.19% 39 Poland 118 0.04% The Former Yugoslav Republic of\n 15 Australia 500 0.19% 40 Brazil 102 0.04% 16 France 486 0.18% 41 Puerto Rico 101 0.04% 17 Benin 409 0.16% 42 Cyprus 94 0.04% 18 Cameroon 387 0.15% 43 Ireland 93 0.04% 19 Spain 386 0.15% 44 Egypt 89 0.03% 20 Mexico 361 0.14% 45 Israel 86 0.03% 21 Hong Kong 344 0.13% 46 Bulgaria 79 0.03% 22 Italy 273 0.10% 47 Vietnam 78 0.03% 22 Netherlands 273 0.10% 48 Greece 77 0.03% 22 Ukraine 273 0.10% 49 Portugal 76 0.03% 25 Jamaica 260 0.10% 50 Senegal 75 0.03%\n**_Note: This represents a ranking of the top 50 countries that reported to the IC3 in 2013 and is based upon the total number of complaints_**\n_received with subject information included in the complaint. The term “subject” is the individual or business that a complainant believes_\n_victimized them and this chart demonstrates the location of where the subject is allegedly located based upon details submitted in the_\n_actual IC3 complaint. The total includes complaints that list dollar loss amounts and complaints that do not list dollar loss amounts._\n_Figures were rounded to the nearest hundredth and do not total 100 percent._\n\n|Rank|Country|Complaint Count|Percentage of Complaints|Rank|Country|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|United States|83,799|31.89%|26|Japan|242|0.09%|\n|2|United Kingdom|4,511|1.72%|27|United Arab Emirates|239|0.09%|\n|3|Nigeria|3,598|1.37%|28|Indonesia|229|0.09%|\n|4|China|2,601|0.99%|29|Sweden|168|0.06%|\n|5|Canada|1,782|0.68%|30|Switzerland|167|0.06%|\n|6|India|1,529|0.58%|31|Turkey|154|0.06%|\n|7|Ghana|782|0.30%|32|Pakistan|152|0.06%|\n|8|Philippines|714|0.27%|33|Singapore|140|0.05%|\n|9|Germany|603|0.23%|34|Belgium|131|0.05%|\n|10|Afghanistan|578|0.22%|35|Romania|130|0.05%|\n|11|South Africa|534|0.20%|36|Thailand|128|0.05%|\n|12|Russian Federation|533|0.20%|37|Panama|125|0.05%|\n|13|Malaysia|524|0.20%|38|Morocco|120|0.05%|\n|14|Macedonia, The Former Yugoslav Republic of|508|0.19%|39|Poland|118|0.04%|\n|15|Australia|500|0.19%|40|Brazil|102|0.04%|\n|16|France|486|0.18%|41|Puerto Rico|101|0.04%|\n|17|Benin|409|0.16%|42|Cyprus|94|0.04%|\n|18|Cameroon|387|0.15%|43|Ireland|93|0.04%|\n|19|Spain|386|0.15%|44|Egypt|89|0.03%|\n|20|Mexico|361|0.14%|45|Israel|86|0.03%|\n|21|Hong Kong|344|0.13%|46|Bulgaria|79|0.03%|\n|22|Italy|273|0.10%|47|Vietnam|78|0.03%|\n|22|Netherlands|273|0.10%|48|Greece|77|0.03%|\n|22|Ukraine|273|0.10%|49|Portugal|76|0.03%|\n|25|Jamaica|260|0.10%|50|Senegal|75|0.03%|\n\n\n-----\n\n|Rank|Country|Complaint Count|Percentage of Complaints|Rank|Country|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|United States|49,128|41.13%|26|Japan|91|0.08%|\n|2|United Kingdom|2,464|2.06%|27|Thailand|84|0.07%|\n|3|China|2,237|1.87%|28|Pakistan|78|0.07%|\n|4|Nigeria|1,984|1.66%|28|Romania|78|0.07%|\n|5|Canada|1,006|0.84%|28|Singapore|78|0.07%|\n|6|India|919|0.77%|31|Turkey|74|0.06%|\n|7|Ghana|559|0.47%|32|Switzerland|68|0.06%|\n|8|Philippines|392|0.33%|33|Netherlands|61|0.05%|\n|9|Malaysia|312|0.26%|34|Puerto Rico|57|0.05%|\n|10|Cameroon|310|0.26%|35|Morocco|55|0.05%|\n|11|South Africa|281|0.24%|36|Poland|54|0.05%|\n|12|Hong Kong|278|0.23%|37|Cyprus|51|0.04%|\n|13|Afghanistan|267|0.22%|37|Egypt|51|0.04%|\n|14|Russian Federation|258|0.22%|39|Dominican Republic|50|0.04%|\n|15|Australia|251|0.21%|40|Panama|49|0.04%|\n|16|Spain|223|0.19%|40|Sweden|49|0.04%|\n|17|Mexico|207|0.17%|42|Ireland|48|0.04%|\n|18|Indonesia|186|0.16%|43|Brazil|46|0.04%|\n|19|Germany|181|0.15%|44|Portugal|45|0.04%|\n|20|France|164|0.14%|45|Greece|44|0.04%|\n|21|Jamaica|160|0.13%|45|Israel|44|0.04%|\n|21|Italy|160|0.13%|47|Vietnam|43|0.04%|\n|23|Benin|148|0.12%|48|Belgium|40|0.03%|\n|24|Ukraine|125|0.10%|49|Korea, Republic of|33|0.03%|\n|25|United Arab Emirates|92|0.08%|50|New Zealand|33|0.03%|\n\n\n**_Note:_** _This represents a ranking of the top 50 countries that reported to the IC3 in 2013 based upon the total number of complaints_\n_received that reported subject information in the complaint and also reported a monetary loss. The term “subject” is the individual or_\n_business that a complainant believes victimized them and this chart demonstrates the location of where the subject is allegedly located_\n_based upon details submitted in the actual IC3 complaint. Figures were rounded to the nearest hundredth percent and do not total 100_\n_percent._\n\n\n-----\n\n#### 2013 IC3 Subject State Statistics\n\n**Subject States by Complaint Count 2013**\n\n##### Percentage Percentage\n Complaint of Complaint of\n Rank State Count Complaints Rank State Count Complaints\n 1 California 12,505 14.92% 27 Minnesota 816 0.97% 2 Florida 7,447 8.89% 28 Wisconsin 788 0.94% 3 New York 7,189 8.58% 29 Louisiana 766 0.91% 4 Texas 6,762 8.07% 30 Kentucky 683 0.82% 5 Illinois 2,911 3.47% 31 Nebraska 662 0.79% 6 Georgia 2,800 3.34% 32 Connecticut 635 0.76% 7 Pennsylvania 2,463 2.94% 33 Oklahoma 625 0.75% 8 Washington 2,348 2.80% 34 Kansas 507 0.61% 9 District of 2,142 2.56% 35 Delaware 505 0.60% Columbia\n 10 New Jersey 2,037 2.43% 36 Arkansas 442 0.53% 11 Ohio 2,014 2.40% 37 Montana 340 0.41% 12 North Carolina 1,782 2.13% 38 Mississippi 333 0.40% 13 Arizona 1,764 2.11% 39 North 331 0.39% Dakota\n 14 Virginia 1,680 2.00% 40 Iowa 330 0.39% 15 Michigan 1,631 1.95% 41 New Mexico 300 0.36% 16 Nevada 1,538 1.84% 42 Maine 268 0.32% 17 Maryland 1,310 1.56% 43 West 262 0.31% Virginia\n 18 Colorado 1,195 1.43% 44 New 230 0.27% Hampshire\n 19 Massachusetts 1,181 1.41% 45 Idaho 223 0.27% 20 Indiana 1,117 1.33% 46 Alaska 221 0.26% 21 Tennessee 1,039 1.24% 47 Hawaii 216 0.26% 22 Missouri 1,021 1.22% 48 Rhode 199 0.24% Island\n 23 Alabama 979 1.17% 49 Wyoming 147 0.18% 24 Oregon 876 1.05% 50 South 145 0.17% Dakota\n 25 South Carolina 870 1.04% 51 Vermont 110 0.13% 26 Utah 846 1.01%\n**_Note: This represents a ranking of each state and the District of Columbia and is based upon the total number of complaints reported to_**\n_the IC3 in 2013 that reported subject information in the complaint. The term “subject” is the individual or business that a complainant_\n_believes victimized them and this chart demonstrates the location of where the subject is allegedly located based upon details submitted_\n_in the actual IC3 complaint. The totals include complaints that list dollar loss amounts and complaints that do not list dollar loss amounts._\n_Also, 5.09 percent (4,268) of the complainants did not provide location information. Figures were rounded to the nearest hundredth and_\n_do not total 100 percent._\n\n|Rank|State|Complaint Count|Percentage of Complaints|Rank|State|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|California|12,505|14.92%|27|Minnesota|816|0.97%|\n|2|Florida|7,447|8.89%|28|Wisconsin|788|0.94%|\n|3|New York|7,189|8.58%|29|Louisiana|766|0.91%|\n|4|Texas|6,762|8.07%|30|Kentucky|683|0.82%|\n|5|Illinois|2,911|3.47%|31|Nebraska|662|0.79%|\n|6|Georgia|2,800|3.34%|32|Connecticut|635|0.76%|\n|7|Pennsylvania|2,463|2.94%|33|Oklahoma|625|0.75%|\n|8|Washington|2,348|2.80%|34|Kansas|507|0.61%|\n|9|District of Columbia|2,142|2.56%|35|Delaware|505|0.60%|\n|10|New Jersey|2,037|2.43%|36|Arkansas|442|0.53%|\n|11|Ohio|2,014|2.40%|37|Montana|340|0.41%|\n|12|North Carolina|1,782|2.13%|38|Mississippi|333|0.40%|\n|13|Arizona|1,764|2.11%|39|North Dakota|331|0.39%|\n|14|Virginia|1,680|2.00%|40|Iowa|330|0.39%|\n|15|Michigan|1,631|1.95%|41|New Mexico|300|0.36%|\n|16|Nevada|1,538|1.84%|42|Maine|268|0.32%|\n|17|Maryland|1,310|1.56%|43|West Virginia|262|0.31%|\n|18|Colorado|1,195|1.43%|44|New Hampshire|230|0.27%|\n|19|Massachusetts|1,181|1.41%|45|Idaho|223|0.27%|\n|20|Indiana|1,117|1.33%|46|Alaska|221|0.26%|\n|21|Tennessee|1,039|1.24%|47|Hawaii|216|0.26%|\n|22|Missouri|1,021|1.22%|48|Rhode Island|199|0.24%|\n|23|Alabama|979|1.17%|49|Wyoming|147|0.18%|\n|24|Oregon|876|1.05%|50|South Dakota|145|0.17%|\n|25|South Carolina|870|1.04%|51|Vermont|110|0.13%|\n|26|Utah|846|1.01%|||||\n\n\n-----\n\n##### 25 Utah 540 1.10% 51 Vermont 74 0.15% 25 Oregon 540 1.10%\n**_Note:_** _This is the total number of complaints from each state and the District of Columbia that reported subject information in the_\n_complaint and also reported a monetary loss. The term “subject” is the individual or business that a complainant believes victimized them_\n_and this chart demonstrates the location of where the subject is allegedly located based upon details submitted in the actual IC3_\n_complaint. Also, 3.87 percent (1,902) of the complainants did not provide location information. Figures were rounded to the nearest_\n_hundredth and do not total 100 percent._\n\n|Rank|State|Complaint Count|Percentage of Complaints|Rank|State|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|California|7,487|15.24%|27|Louisiana|507|1.03%|\n|2|Florida|4,809|9.79%|28|Wisconsin|456|0.93%|\n|3|New York|4,377|8.91%|29|Connecticut|387|0.79%|\n|4|Texas|4,051|8.25%|30|Kentucky|386|0.79%|\n|5|Illinois|1,867|3.80%|31|Nebraska|385|0.78%|\n|6|Georgia|1,554|3.16%|32|Oklahoma|378|0.77%|\n|7|Pennsylvania|1,445|2.94%|33|District of Columbia|320|0.65%|\n|8|Ohio|1,303|2.65%|34|Delaware|307|0.62%|\n|9|New Jersey|1,247|2.54%|35|Kansas|299|0.61%|\n|10|Washington|1,215|2.47%|36|Arkansas|282|0.57%|\n|11|North Carolina|1,073|2.18%|37|Montana|220|0.45%|\n|12|Arizona|1,072|2.18%|38|North Dakota|215|0.44%|\n|13|Nevada|999|2.03%|39|Mississippi|200|0.41%|\n|14|Michigan|983|2.00%|40|Iowa|197|0.40%|\n|15|Virginia|927|1.89%|41|Maine|169|0.34%|\n|16|Maryland|789|1.61%|42|New Mexico|153|0.31%|\n|17|Colorado|700|1.42%|43|New Hampshire|153|0.31%|\n|18|Indiana|698|1.42%|44|West Virginia|148|0.30%|\n|19|Massachusetts|680|1.38%|45|Rhode Island|138|0.28%|\n|20|Tennessee|626|1.27%|46|Idaho|137|0.28%|\n|21|Missouri|610|1.24%|46|Hawaii|137|0.28%|\n|22|Alabama|584|1.19%|48|Alaska|120|0.24%|\n|23|South Carolina|558|1.14%|49|Wyoming|92|0.19%|\n|24|Minnesota|543|1.11%|50|South Dakota|89|0.18%|\n|25|Utah|540|1.10%|51|Vermont|74|0.15%|\n|25|Oregon|540|1.10%|||||\n\n\n-----\n\n#### 2013 IC3 Victim Country Statistics\n\n**Victim Countries by Complaint Count 2013**\n\n##### Percentage Percentage\n Complaint of Complaint of\n Rank Country Count Complaints Rank Country Count Complaints\n 1 United States 238,189 90.63% 25 Malaysia 207 0.08% 2 Canada 3,621 1.38% 27 United Arab 201 0.08% Emirates\n 3 United 2,225 0.85% 28 Colombia 179 0.07% Kingdom\n 4 India 1,867 0.71% 29 Argentina 167 0.06% 5 Australia 1,810 0.69% 29 Belgium 167 0.06% 6 Macedonia, 1,670 0.64% 31 Romania 164 0.06% The Former Yugoslav Republic of\n 7 Mexico 711 0.27% 32 Portugal 163 0.06% 8 Puerto Rico 550 0.21% 33 Saudi Arabia 161 0.06% 9 Brazil 505 0.19% 34 Ireland 156 0.06% 10 South Africa 502 0.19% 34 Afghanistan 156 0.06% 11 France 463 0.18% 34 Hong Kong 156 0.06% 12 Germany 438 0.17% 37 Greece 154 0.06% 13 Philippines 434 0.17% 38 Indonesia 147 0.06% 14 Pakistan 391 0.15% 39 Switzerland 140 0.05% 15 Netherlands 348 0.13% 40 Denmark 136 0.05% 16 Russian 306 0.12% 41 Norway 134 0.05% Federation\n 17 Spain 293 0.11% 42 Turkey 129 0.05% 18 Sweden 258 0.10% 43 Ukraine 123 0.05% 19 New Zealand 252 0.10% 44 Bulgaria 122 0.05% 20 Italy 244 0.09% 45 Egypt 121 0.05% 21 China 236 0.09% 46 Thailand 113 0.04% 22 Israel 230 0.09% 47 Poland 103 0.04% 23 Nigeria 219 0.08% 47 Venezuela 103 0.04% 24 Singapore 208 0.08% 49 Chile 90 0.03% 25 Japan 207 0.08% 50 Hungary 88 0.03%\n**_Note: This represents a ranking of the top 50 countries that reported complaints to the IC3 and is based upon the total number of victim_**\n_originated complaints received by IC3 in 2013 and their countries of residence. As demonstrated by the chart, the majority of victims_\n_reside in the United States. Figures were rounded to the nearest hundredth and do not total 100 percent._\n\n|Rank|Country|Complaint Count|Percentage of Complaints|Rank|Country|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|United States|238,189|90.63%|25|Malaysia|207|0.08%|\n|2|Canada|3,621|1.38%|27|United Arab Emirates|201|0.08%|\n|3|United Kingdom|2,225|0.85%|28|Colombia|179|0.07%|\n|4|India|1,867|0.71%|29|Argentina|167|0.06%|\n|5|Australia|1,810|0.69%|29|Belgium|167|0.06%|\n|6|Macedonia, The Former Yugoslav Republic of|1,670|0.64%|31|Romania|164|0.06%|\n|7|Mexico|711|0.27%|32|Portugal|163|0.06%|\n|8|Puerto Rico|550|0.21%|33|Saudi Arabia|161|0.06%|\n|9|Brazil|505|0.19%|34|Ireland|156|0.06%|\n|10|South Africa|502|0.19%|34|Afghanistan|156|0.06%|\n|11|France|463|0.18%|34|Hong Kong|156|0.06%|\n|12|Germany|438|0.17%|37|Greece|154|0.06%|\n|13|Philippines|434|0.17%|38|Indonesia|147|0.06%|\n|14|Pakistan|391|0.15%|39|Switzerland|140|0.05%|\n|15|Netherlands|348|0.13%|40|Denmark|136|0.05%|\n|16|Russian Federation|306|0.12%|41|Norway|134|0.05%|\n|17|Spain|293|0.11%|42|Turkey|129|0.05%|\n|18|Sweden|258|0.10%|43|Ukraine|123|0.05%|\n|19|New Zealand|252|0.10%|44|Bulgaria|122|0.05%|\n|20|Italy|244|0.09%|45|Egypt|121|0.05%|\n|21|China|236|0.09%|46|Thailand|113|0.04%|\n|22|Israel|230|0.09%|47|Poland|103|0.04%|\n|23|Nigeria|219|0.08%|47|Venezuela|103|0.04%|\n|24|Singapore|208|0.08%|49|Chile|90|0.03%|\n|25|Japan|207|0.08%|50|Hungary|88|0.03%|\n\n\n-----\n\n|Rank|Country|Complaint Count|Percentage of Complaints|Rank|Country|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|United States|106,079|88.80%|26|Hong Kong|122|0.10%|\n|2|Canada|2,207|1.85%|27|Greece|115|0.10%|\n|3|Australia|1,221|1.02%|28|Saudi Arabia|108|0.09%|\n|4|India|1,125|0.94%|29|Indonesia|105|0.09%|\n|5|United Kingdom|986|0.83%|30|Portugal|101|0.08%|\n|6|Mexico|309|0.26%|31|Ireland|96|0.08%|\n|7|Pakistan|294|0.25%|32|Japan|93|0.08%|\n|8|South Africa|286|0.24%|33|Argentina|88|0.07%|\n|9|Puerto Rico|271|0.23%|34|Romania|86|0.07%|\n|10|Brazil|257|0.22%|35|Ukraine|84|0.07%|\n|11|Philippines|249|0.21%|36|Colombia|83|0.07%|\n|12|Russian Federation|223|0.19%|37|Turkey|82|0.07%|\n|13|Germany|204|0.17%|38|Thailand|79|0.07%|\n|14|China|191|0.16%|39|Egypt|76|0.06%|\n|15|France|166|0.14%|40|Bulgaria|73|0.06%|\n|16|Nigeria|161|0.13%|40|Switzerland|73|0.06%|\n|17|Netherlands|157|0.13%|42|Afghanistan|70|0.06%|\n|18|Israel|155|0.13%|42|Denmark|70|0.06%|\n|19|Italy|149|0.12%|42|Poland|70|0.06%|\n|20|Singapore|147|0.12%|45|Norway|69|0.06%|\n|21|Spain|145|0.12%|46|Belgium|68|0.06%|\n|22|New Zealand|142|0.12%|47|Venezuela|66|0.06%|\n|23|Sweden|141|0.12%|48|Chile|59|0.05%|\n|24|United Arab Emirates|136|0.11%|49|Korea, Republic of|58|0.05%|\n|25|Malaysia|132|0.11%|50|Trinidad and Tobago|55|0.05%|\n\n\n**_Note: This represents a ranking of the top 50 countries that reported to the IC3 in 2013 and is based upon the number of victim originated_**\n_complaints that also included a dollar loss amount within the complaint. Figures were rounded to the nearest hundredth and do not total_\n_100 percent._\n\n\n-----\n\n##### 24 Puerto Rico $1,052,505 0.13% 49 Ghana $458,479 0.06% 25 Lebanon $1,035,760 0.13% 50 Afghanistan $453,874 0.06%\n**_Note: This represents a ranking of the top 50 countries that reported complaints to the IC3 in 2013 and is based upon the reported total_**\n_dollar losses victims reported in their complaints. Figures were rounded to the nearest hundredth and do not total 100._\n\n|Rank|Country|Complaint Total Loss|Percentage of Complaints|Rank|Country|Complaint Total Loss|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|United States|$574,276,422|73.45%|26|Indonesia|$1,011,606|0.13%|\n|2|Pakistan|$100,921,345|12.91%|27|Taiwan, Province of China|$958,833|0.12%|\n|3|Canada|$14,414,723|1.84%|28|Nigeria|$900,164|0.12%|\n|4|United Kingdom|$13,005,869|1.66%|29|France|$898,228|0.11%|\n|5|Australia|$8,940,931|1.14%|30|Finland|$856,030|0.11%|\n|6|India|$4,399,440|0.56%|31|Malaysia|$754,561|0.10%|\n|7|Singapore|$3,679,687|0.47%|32|Thailand|$737,190|0.09%|\n|8|Bangladesh|$3,113,128|0.40%|33|Belgium|$736,042|0.09%|\n|9|Sweden|$2,775,697|0.36%|34|Korea, Republic of|$717,675|0.09%|\n|10|China|$2,697,852|0.35%|35|Norway|$655,262|0.08%|\n|11|South Africa|$2,295,347|0.29%|36|New Zealand|$643,357|0.08%|\n|12|Italy|$2,178,850|0.28%|37|Portugal|$637,159|0.08%|\n|13|Brazil|$2,122,253|0.27%|38|Saudi Arabia|$617,171|0.08%|\n|14|Germany|$2,060,673|0.26%|39|Poland|$610,691|0.08%|\n|15|Mexico|$2,021,526|0.26%|40|Switzerland|$598,970|0.08%|\n|16|Philippines|$1,817,830|0.23%|41|Greece|$592,648|0.08%|\n|17|Kyrgyz Republic|$1,796,751|0.23%|42|Bahrain|$582,661|0.07%|\n|18|Russian Federation|$1,749,575|0.22%|43|Denmark|$563,521|0.07%|\n|19|Spain|$1,721,446|0.22%|44|Kuwait|$547,532|0.07%|\n|20|Hong Kong|$1,577,618|0.20%|45|Trinidad and Tobago|$513,160|0.07%|\n|21|Netherlands|$1,316,352|0.17%|46|Turkey|$511,340|0.07%|\n|22|Japan|$1,180,511|0.15%|47|Venezuela|$497,926|0.06%|\n|23|United Arab Emirates|$1,081,393|0.14%|48|Israel|$483,414|0.06%|\n|24|Puerto Rico|$1,052,505|0.13%|49|Ghana|$458,479|0.06%|\n|25|Lebanon|$1,035,760|0.13%|50|Afghanistan|$453,874|0.06%|\n\n\n-----\n\n#### 2013 IC3 Victim State Statistics\n\n**Victim States by Average Loss 2013**\n\n##### Rank State Average Loss Rank State Average Loss 1 Maine $5,877 27 Vermont $2,177 2 California $3,639 28 Oregon $2,164 3 Texas $3,521 29 South Dakota $2,110 4 North Dakota $3,478 30 New Mexico $2,057 5 Utah $3,347 31 Alabama $1,964 6 Delaware $3,188 32 Michigan $1,948 7 Georgia $3,039 33 Wisconsin $1,914 8 New York $3,015 34 Ohio $1,888 9 Virginia $3,004 35 New Hampshire $1,833 10 Nevada $2,909 36 Pennsylvania $1,819 11 Oklahoma $2,793 37 Maryland $1,808 12 Nebraska $2,786 38 Tennessee $1,787 13 Rhode Island $2,757 39 Connecticut $1,779 14 Florida $2,750 40 New Jersey $1,753 15 Idaho $2,697 41 Missouri $1,744 16 Massachusetts $2,588 42 North Carolina $1,742 17 Minnesota $2,476 43 Kentucky $1,727 18 Hawaii $2,433 44 South Carolina $1,687 19 Arizona $2,358 45 Arkansas $1,660 20 Washington $2,353 46 Wyoming $1,655 21 Mississippi $2,347 46 Kansas $1,587 22 Iowa $2,324 48 District of Columbia $1,308 23 Colorado $2,300 49 West Virginia $1,272 24 Illinois $2,265 50 Montana $1,236 25 Indiana $2,204 51 Alaska $426 26 Louisiana $2,191\n**_Note:_** _This represents a ranking of each state and the District of Columbia based upon the average dollar loss per victim originated_\n_complaint reported to the IC3 in 2013. Of the complaints, average losses of $1,098 were reported by complainants who did not report a_\n_location._\n\n|Rank|State|Average Loss|Rank|State|Average Loss|\n|---|---|---|---|---|---|\n|1|Maine|$5,877|27|Vermont|$2,177|\n|2|California|$3,639|28|Oregon|$2,164|\n|3|Texas|$3,521|29|South Dakota|$2,110|\n|4|North Dakota|$3,478|30|New Mexico|$2,057|\n|5|Utah|$3,347|31|Alabama|$1,964|\n|6|Delaware|$3,188|32|Michigan|$1,948|\n|7|Georgia|$3,039|33|Wisconsin|$1,914|\n|8|New York|$3,015|34|Ohio|$1,888|\n|9|Virginia|$3,004|35|New Hampshire|$1,833|\n|10|Nevada|$2,909|36|Pennsylvania|$1,819|\n|11|Oklahoma|$2,793|37|Maryland|$1,808|\n|12|Nebraska|$2,786|38|Tennessee|$1,787|\n|13|Rhode Island|$2,757|39|Connecticut|$1,779|\n|14|Florida|$2,750|40|New Jersey|$1,753|\n|15|Idaho|$2,697|41|Missouri|$1,744|\n|16|Massachusetts|$2,588|42|North Carolina|$1,742|\n|17|Minnesota|$2,476|43|Kentucky|$1,727|\n|18|Hawaii|$2,433|44|South Carolina|$1,687|\n|19|Arizona|$2,358|45|Arkansas|$1,660|\n|20|Washington|$2,353|46|Wyoming|$1,655|\n|21|Mississippi|$2,347|46|Kansas|$1,587|\n|22|Iowa|$2,324|48|District of Columbia|$1,308|\n|23|Colorado|$2,300|49|West Virginia|$1,272|\n|24|Illinois|$2,265|50|Montana|$1,236|\n|25|Indiana|$2,204|51|Alaska|$426|\n|26|Louisiana|$2,191||||\n\n\n-----\n\n##### 26 Minnesota 2,719 1.14%\n**_Note:_** _This represents a ranking of states and the District of Columbia and is based upon the number of victim originated complaints_\n_reported to the IC3 in 2013 and their states of residence. Also, 10.09 percent (24,028) of the complaints did not provide location_\n_information. Figures were rounded to the nearest hundredth and do not total 100 percent. The top 10 states from this chart are also_\n_illustrated in the map on page seven._\n\n|Rank|State|Complaint Count|Percentage of Complaints|Rank|State|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|California|28,888|12.13%|27|Alaska|2,662|1.12%|\n|2|Florida|17,739|7.45%|28|Kentucky|2,385|1.00%|\n|3|Texas|16,056|6.74%|29|Connecticut|2,197|0.92%|\n|4|New York|12,612|5.29%|30|Louisiana|2,112|0.89%|\n|5|Pennsylvania|7,914|3.32%|31|Oklahoma|1,862|0.78%|\n|6|New Jersey|7,647|3.21%|32|Utah|1,775|0.75%|\n|7|Illinois|7,024|2.95%|33|Kansas|1,621|0.68%|\n|8|Virginia|6,764|2.84%|34|Arkansas|1,583|0.66%|\n|9|Ohio|6,541|2.75%|35|Iowa|1,580|0.66%|\n|10|Georgia|6,151|2.58%|36|New Mexico|1,404|0.59%|\n|11|Washington|6,009|2.52%|37|Mississippi|1,314|0.55%|\n|12|North Carolina|5,981|2.51%|38|West Virginia|1,244|0.52%|\n|13|Michigan|5,493|2.31%|39|Idaho|1,019|0.43%|\n|14|Arizona|5,310|2.23%|40|Hawaii|993|0.42%|\n|15|Maryland|5,268|2.21%|41|New Hampshire|918|0.39%|\n|16|Colorado|4,613|1.94%|42|Nebraska|845|0.35%|\n|17|Massachusetts|4,085|1.72%|43|Montana|730|0.31%|\n|18|Tennessee|3,969|1.67%|44|Maine|704|0.30%|\n|19|Indiana|3,695|1.55%|45|District of Columbia|702|0.29%|\n|20|Nevada|3,497|1.47%|46|Delaware|684|0.29%|\n|21|Missouri|3,352|1.41%|47|Rhode Island|588|0.25%|\n|22|Wisconsin|3,335|1.40%|48|Wyoming|454|0.19%|\n|23|Alabama|3,105|1.30%|49|North Dakota|416|0.17%|\n|24|Oregon|2,956|1.24%|50|Vermont|414|0.17%|\n|25|South Carolina|2,868|1.20%|51|South Dakota|364|0.15%|\n|26|Minnesota|2,719|1.14%|||||\n\n\n-----\n\n##### 26 Minnesota 1,179 1.11%\n**_Note: This represents a ranking of states and the District of Columbia and is based upon the number of victim originated complaints that_**\n_reported a dollar loss figure within the complaint. Also, 9.33 percent (9,897) of the complaints did not provide location information._\n_Figures were rounded to the nearest hundredth and do not total 100 percent._\n\n|Rank|State|Complaint Count|Percentage of Complaints|Rank|State|Complaint Count|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|California|13,535|12.76%|27|Kentucky|1,084|1.02%|\n|2|Florida|8,269|7.80%|28|Louisiana|1,022|0.96%|\n|3|Texas|7,545|7.11%|29|Connecticut|1,015|0.96%|\n|4|New York|6,281|5.92%|30|Oklahoma|862|0.81%|\n|5|Pennsylvania|3,538|3.34%|31|Utah|777|0.73%|\n|6|Illinois|3,279|3.09%|32|Arkansas|719|0.68%|\n|7|Virginia|3,140|2.96%|33|Iowa|717|0.68%|\n|8|Ohio|2,786|2.63%|34|Kansas|692|0.65%|\n|9|Washington|2,751|2.59%|35|Mississippi|640|0.60%|\n|10|Georgia|2,705|2.55%|36|New Mexico|601|0.57%|\n|11|Maryland|2,682|2.53%|37|West Virginia|537|0.51%|\n|12|North Carolina|2,659|2.51%|38|Hawaii|417|0.39%|\n|13|New Jersey|2,639|2.49%|39|Idaho|402|0.38%|\n|14|Michigan|2,396|2.26%|40|Nebraska|397|0.37%|\n|15|Arizona|2,250|2.12%|41|New Hampshire|362|0.34%|\n|16|Colorado|1,932|1.82%|42|Alaska|347|0.33%|\n|17|Massachusetts|1,792|1.69%|43|Delaware|311|0.29%|\n|18|Tennessee|1,790|1.69%|44|Maine|291|0.27%|\n|19|Alabama|1,686|1.59%|45|Montana|290|0.27%|\n|20|Indiana|1,638|1.54%|46|District of Columbia|281|0.26%|\n|21|Nevada|1,547|1.46%|47|Rhode Island|274|0.26%|\n|22|Missouri|1,514|1.43%|48|North Dakota|192|0.18%|\n|23|Wisconsin|1,477|1.39%|49|Vermont|177|0.17%|\n|24|South Carolina|1,238|1.17%|50|Wyoming|172|0.16%|\n|25|Oregon|1,193|1.12%|51|South Dakota|162|0.15%|\n|26|Minnesota|1,179|1.11%|||||\n\n\n-----\n\n##### 25 Utah $5,941,062 1.03% 51 Wyoming $751,337 0.13% 26 Missouri $5,845,699 1.02%\n**_Note: This is the total dollar losses for complaints from each state and the District of Columbia. Also, 4.59 percent or ($26,383,019.60 in_**\n_losses) of the complainants did not provide location information. Figures were rounded to the nearest hundredth and do not total 100_\n_percent._\n\n|Rank|State|Complaint Total Loss|Percentage of Complaints|Rank|State|Complaint Total Loss|Percentage of Complaints|\n|---|---|---|---|---|---|---|---|\n|1|California|$105,118,346|18.30%|27|Oklahoma|$5,199,764|0.91%|\n|2|Texas|$56,534,880|9.84%|28|South Carolina|$4,839,453|0.84%|\n|3|Florida|$48,778,217|8.49%|29|Louisiana|$4,627,893|0.81%|\n|4|New York|$38,027,647|6.62%|30|Maine|$4,137,228|0.72%|\n|5|Virginia|$20,319,530|3.54%|31|Kentucky|$4,117,820|0.72%|\n|6|Georgia|$18,693,316|3.26%|32|Connecticut|$3,909,247|0.68%|\n|7|Illinois|$15,907,173|2.77%|33|Iowa|$3,671,707|0.64%|\n|8|Pennsylvania|$14,398,601|2.51%|34|Mississippi|$3,084,199|0.54%|\n|9|Washington|$14,138,154|2.46%|35|New Mexico|$2,888,398|0.50%|\n|10|New Jersey|$13,402,721|2.33%|36|Idaho|$2,748,012|0.48%|\n|11|Arizona|$12,518,439|2.18%|37|Arkansas|$2,628,423|0.46%|\n|12|Ohio|$12,351,755|2.15%|38|Kansas|$2,572,215|0.45%|\n|13|Michigan|$10,697,615|1.86%|39|Hawaii|$2,415,892|0.42%|\n|14|Colorado|$10,611,521|1.85%|40|Nebraska|$2,353,819|0.41%|\n|15|Massachusetts|$10,570,678|1.84%|41|Delaware|$2,180,846|0.38%|\n|16|North Carolina|$10,416,194|1.81%|42|New Hampshire|$1,683,034|0.29%|\n|17|Nevada|$10,171,633|1.77%|43|Rhode Island|$1,620,972|0.28%|\n|18|Maryland|$9,522,259|1.66%|44|West Virginia|$1,582,525|0.28%|\n|19|Indiana|$8,142,650|1.42%|45|North Dakota|$1,446,979|0.25%|\n|20|Tennessee|$7,091,950|1.23%|46|Alaska|$1,134,677|0.20%|\n|21|Minnesota|$6,731,363|1.11%|47|District of Columbia|$918,293|0.16%|\n|22|Oregon|$6,398,079|1.11%|48|Montana|$901,950|0.16%|\n|23|Wisconsin|$6,382,394|1.11%|49|Vermont|$901,275|0.16%|\n|24|Alabama|$6,097,466|1.06%|50|South Dakota|$768,105|0.13%|\n|25|Utah|$5,941,062|1.03%|51|Wyoming|$751,337|0.13%|\n|26|Missouri|$5,845,699|1.02%|||||\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/IC3 - Internet Crime Report - 2013.pdf"
    ],
    "report_names": [
        "IC3 - Internet Crime Report - 2013.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535788,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1399540057,
    "ts_modification_date": 1399540057,
    "files": {
        "pdf": "https://archive.orkl.eu/a7e3d7d6214b5560df9c80bad54031f8a5d87390.pdf",
        "text": "https://archive.orkl.eu/a7e3d7d6214b5560df9c80bad54031f8a5d87390.txt",
        "img": "https://archive.orkl.eu/a7e3d7d6214b5560df9c80bad54031f8a5d87390.jpg"
    }
}