{
    "id": "b6956798-ff9a-4b9a-89a0-8a9ff9da1023",
    "created_at": "2023-01-12T15:08:04.754811Z",
    "updated_at": "2025-03-27T02:15:55.511236Z",
    "deleted_at": null,
    "sha1_hash": "88d57d5316c5c4ae101e5246a67ff5ec03cd7c2c",
    "title": "2020-04-16 - Taiwan High-Tech Ecosystem Targeted by Foreign APT Group- Digital Skeleton Key Bypasses Security Measures",
    "authors": "",
    "file_creation_date": "2022-05-27T22:58:49Z",
    "file_modification_date": "2022-05-27T22:58:49Z",
    "file_size": 3050863,
    "plain_text": "# Taiwan High-Tech Ecosystem Targeted by Foreign APT Group:\n\n**[medium.com/cycraft/taiwan-high-tech-ecosystem-targeted-by-foreign-apt-group-5473d2ad8730](https://medium.com/cycraft/taiwan-high-tech-ecosystem-targeted-by-foreign-apt-group-5473d2ad8730)**\n\nCyCraft Technology Corp May 6, 2022\n\n[CyCraft Technology Corp](https://medium.com/@cycrafttechnology?source=post_page-----5473d2ad8730--------------------------------)\n\nApr 16, 2020\n\n\n13 min read\n\n## Digital Skeleton Key Bypasses Security Measures\n\n2019 was an excellent year for the Taiwan superconductor industry; however, beneath this\neconomic upturn, a digital chimera was slowly eating at it from within. Throughout 2019,\nmultiple companies in the Taiwan high-tech ecosystem were victims of an advanced\npersistent threat (APT) attack.\n\n“Taiwan is set to become the largest and fastest-growing semiconductor equipment\nmaker in the world by increasing by 21.1 percent to reach US$12.31 billion.”\n\n[-Taiwan News, July 2019](https://www.taiwannews.com.tw/en/news/3742971)\n\n\n-----\n\nAPTs are professional cyber espionage actors that typically receive direction and support\nfrom nation-states and often target organizations (orgs) with high-value information, such as\nnational defense, financial, energy, or manufacturing.\n\nDue to these APT attacks having similar behavior profiles (similar adversarial techniques,\ntactics, and procedures or TTP) with each other and previously documented cyberattacks,\nwe assess with high confidence these new attacks were conducted by the same foreign\nthreat actor.\n\nDuring our investigation, we dubbed this threat actor Chimera. “Chimera” stands for the\nsynthesis of hacker tools that we’ve seen the group use, such as the skeleton key malware\n[that contained code extracted from both Dumpert and](https://github.com/outflanknl/Dumpert) [Mimikatz — hence Chimera.](https://attack.mitre.org/software/S0002/)\n\nTheir operation — the entirety of the new attacks utilizing the Skeleton Key attack (described\nbelow) from late 2018 to late 2019, we have dubbed Operation Skeleton Key.\n\nThe main objective of these attacks was the exfiltration of intellectual property, such as\ndocuments on integrated circuits (IC), software development kits (SDKs), IC designs, source\ncode, etc.\n\nThe motive behind these attacks likely stems from competitors (or possibly even nationstates due to the advanced nature of the attacks) seeking to gain a competitive advantage.\n\n## Highlighted Findings\n\nIn our above report, we go over our comprehensive analysis of the techniques, tactics,\nprocedures, and customized malware employed by Chimera. Here are some highlighted\nfindings from our research.\n\n1. — This malware contained code extracted from both Dumpert and Mimikatz and was\n\nused as an account manipulation tool. The malware altered the (NTLM) authentication\nprogram and implanted a skeleton key to allow the attackers to log in without the need\nof a valid credential. Once the code in memory was altered, the attackers could still\ngain access to compromised machines even after resetting passwords. The attackers\nthen used the skeleton key to freely to other machines in the same domain. There was\nno difference when compared to legit login activity, nor was legit user login activity\nhindered. These factors helped mask the attacker’s persistent malicious activities.\n2. — The attackers utilized as their main (RAT). The mutated backdoor replaced and then\n\nmasqueraded as a Google Chrome Update to confuse users. In order to further mask\nthe malicious activity and make attribution difficult for defenders, the attackers placed\nmost of the command-and-control (C2) servers in the Google Cloud Platform.\n3. — used an old and patched version of RAR modified for data exfiltration.\n\n## The Skeleton Key: A Brief History\n\n\n-----\n\nIn 2014, Dell Secureworks Counter Threat Unit observed the earliest use of a digital skeleton\nkey. Their observed skeleton key was able to bypass authentication on Active Directory (AD)\nsystems implementing single-factor verification, giving them unfettered access to remote\naccess services.\n\nHowever, Chimera also added extracted key code snippets from Mimikatz and Dumpert to\ntheir skeleton key. The Chimera skeleton key sought to bypass API monitoring, which is\nwidely used in anti-virus and EDR products, by directly invoking syscalls and implementing\nhigh-level API logic.\n\n## The Investigations\n\nWe thoroughly analyzed more than 30,000 endpoints belonging to multiple companies along\nthe Taiwan high-tech ecosystem supply chain, during our investigation into Operation\n_Skeleton Key. Two representative cases are chosen here for more in-depth sharing._\n\nWe summarized our year-long findings into two kinds of cases, we call them Case A and\nCase B, representing two different approaches: discovering Operation Skeleton Key during\nregular security operations vs. discovering the aftermath of Chimera’s attacks during incident\nresponse (IR).\n\n## CyCraft MDR Services\n\n**Step 1: We deploy our MDR+NGAV scanner to your endpoints.**\n\n**Step 2: We continuously receive the scanner data**\n\n**Step 3: Our AI and security experts analyze it and generate alerts & reports, including**\ncomplete site-wide UEBA, threat analysis, MITRE ATT&CK® classification, storylines\nof all malicious behavior and remediation options.\n\nAt the time of detection, CyCraft had already been providing Case A orgs with our MDR\npackages.\n\n\n-----\n\nWhile our active detection package consists of our 24/7 MDR service, our passive detection\npackage (which the representative Case A org here had opted for at the time) includes\nintervaled (in this case, daily) detection reports across all endpoints and network; endpoints\nare scanned for known malicious behavior and suspicious behavior that could suggest an\nattack, which is what happened here.\n\nWe have picked this representative sample from Case A as we could see more details of the\ntactics, techniques, and procedures used in Operation Skeleton Key. Case A customers who\nused our more active MDR package did not experience the depth of penetration that this\nrepresentative sample did.\n\nBy contrast, orgs in Case B approached CyCraft for our IR services after they detected the\nabnormal activity on their system.\n\nCyber situation graphs and storylines have been provided; however, note that all server and\nuser names are de-identified and replaced with aliases.\n\n## A Representative Sample From Case A Organizations\n\nIn the first hours of the attack, Chimera had not attacked or compromised a vital server. It\nwas decided to allow the threat actor to temporarily persist in order to gain more intelligence\ninto their new malware, behavior, and motivations.\n\n\n-----\n\nUpon the initial detection of suspicious activity of endpoint NB-CLAIR, in this representative\nsample of Case A, their security operations center (SOC) was immediately notified of the\nsuspicious behavior and the potential danger to their system. Had the Case A org been\nsubscribed to our 24/7 MDR service, we could have easily stopped the attack at NB-CLAIR.\n\n_Chimera’s_ [initial access came from a valid ID from a virtual private network (VPN).](https://attack.mitre.org/tactics/TA0001/)\n\nMany enterprises often neglect this attack vector, by default trusting VPN connections and\nwelcoming them into their intranet; and Chimera is one of the most skilled threat actors that\n[we have seen at abusing VPN policies. A remote desktop protocol (RDP) was used to gain](https://attack.mitre.org/techniques/T1076/)\naccess to NB-CLAIR, where the first Cobalt Strike backdoor was placed.\n\nCobalt Strike was used as Chimera’s main RAT tool. In an attempt to avoid detection, the\nRAT replaced the original Google Update binary and functioned as a mutated Cobalt Strike\nbeacon to inject payloads into other processes.\n\nThis behavior, as you can imagine, was extremely suspicious. At the time of detection, no\n[information could be found on this particular malware on VirusTotal (VT);our AI immediately](https://www.virustotal.com/gui/home/upload)\nbegan closely tracking the attack.\n\nA cyber situation graph from a Case A sample, generated by our AI\nSix minutes after RDP was used to gain access to NB-CLAIR, Cobalt Strike was then\n[remotely copied to Server-LAUREN via the schtasks utility. At this point, had our continuous](https://attack.mitre.org/software/S0111/)\nMDR services (active detection) been employed, agents (installed on both the NB-CLAIR\nendpoint and Server-LAUREN) would have detected the lateral movement and have been\nable to halt the attack.\n\n\n-----\n\nThe malware, GoogleUpdate.exe, in an attempt to make tracking difficult, connected to C2\nservers located in the Google Cloud Platform; however, this was detected by our continuous\ndigital forensics platform. The Case A org’s SOC was again immediately notified.\n\nAt this time, only 18 minutes had passed since Chimera’s initial access. Once connected to\nthe C2 servers, RecordedTV.ms was dropped onto Server-LAUREN to archive data for\nexfiltration. Even without the .exe file extension, data exfiltration could still have been\nexecuted.\n\nRecordedTV.ms was later discovered to be a modified version of RAR; however, it had a\none-byte discrepancy from the original version (specifically rar.exe v3.6). Our platform was\nnot only able to detect the injected file but was also able to detect this one-byte discrepancy\nand flag it.\n\nLeft: Original rar.exe, Right: RecordedTV.ms with the patched byte\nIdentical binaries were found in several machines, but under different names, e.g.,\nRecordedTV.ms, uncheck.dmp, jucheck.exe. This too was detected by our AI-driven\nforensics, and Case A SOCs were again notified of the suspicious behavior.\n\nSeveral “net user” commands were also executed from Server-LAUREN for recon purposes,\nand the results were saved to the RecordedTV_lib.log. Server-LAUREN also used wmic to\nremotely execute various commands in another endpoint to check if there was an Internet\nconnection, which we flag as discovery events under the MITRE ATT&CK® framework.\n\n\n-----\n\nServer-LAUREN also stored the Windows Registry and ntds.dit of other hosts. The active\ndirectory (AD) database, ntsa.dit, contained information about domain hosts and users, such\nas IDs, names, and password hashes.\n\nThe registry contained the key for the encrypted ntds.dit AD database. Chimera needed to\narchive both in order to remotely decrypt the file and, most likely, [bruteforce the password](https://attack.mitre.org/techniques/T1110/)\nhash.\n\nOnce the active directory (AD) server had been compromised, the SkeletonKeyInjector\nmalware, d3dll.dll, was used to implant a skeleton key so the attacker could freely perform\n[lateral movement (LM) to other machines in the same domain.](https://attack.mitre.org/tactics/TA0008/)\n\nThankfully, this incident was taken care of before the SkeletonKeyInjector was allowed to run\namuck; Case B orgs were not so fortunate.\n\nAs with all our customers, Case A orgs received a fully actionable report with\ncontextual information. Their complete site analysis included the full context behind the\nhigh-severity alerts that were previously sent and provided actionable intelligence\ncovering their endpoints, processes, files, identity and access management (IAM), and\nnetwork\n\n\n-----\n\nWith automated forensic investigations, we were able to replace guesswork with actionable\nsteps to halt the attack and recover the systems involved.\n\nThe Case A org’s actionable report informed them which processes to stop, which files to\ndelete, which malware to remove, which user accounts were infected and needed resetting,\nand which URLs, IP addresses, and domains to block.\n\nThe representative org used for parts of Case A who used our passive detection has since\nupgraded to our active detection services and now enjoys the benefits and confidence\nprovided by our MDR service.\n\n## SkeletonKeyInjector\n\nThis particular malware was an account manipulation tool that altered the NTLM\nauthentication program and implanted a skeleton key that allowed Chimera to log in without\nvalid credentials to other machines.\n\nAfter the code in memory was altered, Chimera would be able to gain access to any system\nin the domain. As AD machines are rarely rebooted, Chimera could potentially control\nmachines for a very long time without detection.\n\nThis is one of many reasons why CyCraft performs memory forensics on all computers,\nincluding domain controllers.\n\n\n-----\n\nDuring our investigation of Operation Skeleton Key, we discovered some semiconductor\nvendors were employing a white-list enforcement approach. Although this is a feasible\napproach, as the AD cannot execute any software outside the white-list, our investigation\nshowed that Chimera was still able to use Living off the Land Binaries (LOL) bins to launch\nattacks.\n\n## Case B\n\n\n-----\n\nA sample Case B attack storyline, from 19:53 on Nov. 7, 2018 to 10:56 on Dec. 27, 2019\nIn November of 2019, while a representative Case B org was upgrading their network\ninfrastructure, several abnormal activities were discovered. CyCraft was tasked by the org to\nconduct an investigation via our IR services, as in this scenario, CyCraft solution was not\npart of their daily SecOps.\n\n## CyCraft IR Services\n\n**Step 1: We deploy our IR forensic scanner to your endpoints.**\n\n**Step 2: We receive the scanner data; our AI and security experts analyze it.**\n\n**Step 3: In under 24 hours after our scanner runs, we walk you through your**\neradication plan, including complete site-wide hacker tools and behavior analysis.\n\n**Step 4: Together, we rescan and confirm eradication.**\n\nAfter running our scanner on Case B orgs’ endpoints, we immediately discovered that the\nbehavior profile of the cyberattack resembled Operation Skeleton Key.\n\nBoth of the sophisticated attacks targeting Case A and Case B orgs utilized the\nSkeletonKeyInjector, the Cobalt Strike RAT masquerading as a Google Update, and had a\nsimilar behavior profile (similar usage of TTP) with the other cases we investigated. These\nfactors led us to attribute all of these attacks to the same threat actor and operation.\n\nHowever, unlike in Case A orgs, it was apparent that these types of intrusions had persisted\nfor a substantial time, in some samples, well over a year. There were other differences, as\nwell.\n\nUnlike Case A, Chimera widely used encoded PowerShell scripts (seen below). In order to\navoid the file-based detection mechanisms, the payload was injected directly into the system\nmemory.\n\nThe injected malware, our old friend the Cobalt Strike backdoor, was discovered in multiple\nendpoints, which unsurprisingly included two domain controllers. Most infected hosts had the\nCobalt Strike malware implanted in their svchost.exe. The Cobalt Strike backdoor was used\nfor process migration to other system processes.\n\n\n-----\n\nSimilar to Case A, legal cloud services were widely used by Chimera to house their C2\nservers in an attempt to avoid threat attribution. Once again, RAR programs with seemingly\ninnocuous file names (RecoredTV.ms, jucheck.exe, vmware.log) were used to archive data\nfor exfiltration.\n\n_Chimera was successful in archiving the passwords and using a DLL file (d3d11.dll) to_\ndeploy the skeleton key malware. With the Skeleton Key deployed, each machine on the\ndomain could then be freely accessed by Chimera.\n\nThe ultimate motivation of Chimera was the acquisition of intellectual property, i.e., IC\ndocuments, SDKs, source code, etc.\n\nAfter collaborating with Case B orgs on the execution of our eradication plan, all of the\nmalware and system damage caused by Chimera was remediated in record time.\n\nTo ensure the security of the system during the execution of the eradication plan and the\nsystem hardening that followed, CyCraft offered Case B orgs (as we do with all customers of\nour IR services) three months of free MDR services.\n\nAfter the initial three months of MDR services, Case B orgs decided to continue enjoying the\nconfidence our MDR services provide.\n\n## MITRE ATT&CK Techniques\n\n\n-----\n\nChimera using\n[This is a summary of adversarial techniques, as based on the MITRE ATT&CK Framework,](https://attack.mitre.org/matrices/enterprise/)\nemployed in Operation Skeleton Key (OSK).\n\n\n-----\n\n-----\n\n## UPDATE: Chimera Observed in EU?\n\nOn 12 January 2020, Fox-IT & NCC Group published their detailed report, “Abusing Cloud\nServices to Fly Under the Radar”. The threat actor tracked in their report shared many\n[similarities to the China-linked threat actor Chimera, whom CyCraft attributed to a year-long](https://medium.com/cycraft/taiwan-high-tech-ecosystem-targeted-by-foreign-apt-group-5473d2ad8730)\ncyberattack targeting the Taiwan semiconductor industry just last year.\n\nMuch like Chimera, the threat actor mentioned in the Fox-IT & NCC Group report (referred to\nin this article as CUTR, Chimera Under the Radar) targeted intellectual property (IP) from the\nsemiconductor industry; however, the report goes into further detail explaining how their\nthreat actor’s targets were more diverse, including targeting sensitive data from the EU\naviation industry.\n\nFollow the link below to the following article where we analyze and compare their research to\nours.\n\nhttps://cycrafttechnology.medium.com/threat-attribution-chimera-under-the-radar7c4cce390efd\n\n## Know for sure. Know with CyCraft.\n\nWe power SOCs around the world with our proprietary and award-winning AI-driven MDR\n(managed detection and response), SOC (security operations center) operations software, TI\n(threat intelligence), Enterprise Health Check, automated forensics, and IR (incident\nresponse), and Secure From Home services.\n\n[Learn why our global customers have joined our rapidly growing CyCraft Community and](https://medium.com/@cycraft_corp/cycraft-technology-taiwanese-cybersecurity-firm-seized-domestic-market-in-two-years-rapidly-f7e3a2972578)\nhave stayed.\n\n## Follow Us\n\n\n-----\n\nWhen you join CyCraft, you will be in good company. CyCraft secures government agencies,\nFortune Global 500 firms, top banks and financial institutions, critical infrastructure, airlines,\ntelecommunications, hi-tech firms, and SMEs.\n\n## Cybersecurity Industry Recognition\n\nJoined MITRE ATT&CK Evaluations round two against APT29\nMember of FIRSTthe premier Incident Response organization\nWinner of multiple Gold Cybersecurity Excellence Awards, including MDR, Forensics,\nIncident Response, and Artificial Intelligence as well as a Best Cybersecurity Company\nGold Award\n\n## Additional Resources and Use Cases\n\n, and CyCraft Global Project Manager, Chad Duffy, speak on the latest MITRE ATT&CK\nEvaluations. Read their thoughts on our results and the philosophy powering CyCraft.\nHas your organization recently shifted to a Work From Home environment? Learn how\nto receive three free months of .\ndrops your mean dwell time down from 197 days to under 1 day without false positives\nor false negatives. Know with confidence if hackers have penetrated your enterprise.\nCyCraft discussed directly with semiconductor manufacturers on updating global\ncybersecurity standards and the unique security challenges an ICS faces.\nCase Study: CyCraft .\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-16 - Taiwan High-Tech Ecosystem Targeted by Foreign APT Group- Digital Skeleton Key Bypasses Security Measures.pdf"
    ],
    "report_names": [
        "2020-04-16 - Taiwan High-Tech Ecosystem Targeted by Foreign APT Group- Digital Skeleton Key Bypasses Security Measures.pdf"
    ],
    "threat_actors": [
        {
            "id": "873a6c6f-a4d1-49b3-8142-4a147d4288ef",
            "created_at": "2022-10-25T16:07:23.455744Z",
            "updated_at": "2025-03-27T02:02:09.811933Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Operation Skeleton Key"
            ],
            "source_name": "ETDA:Chimera",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "SkeletonKeyInjector",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f88b16bc-df4b-48e7-ae35-f4117240ff24",
            "created_at": "2022-10-25T15:50:23.556699Z",
            "updated_at": "2025-03-27T02:00:55.499173Z",
            "deleted_at": null,
            "main_name": "Chimera",
            "aliases": [
                "Chimera"
            ],
            "source_name": "MITRE:Chimera",
            "tools": [
                "PsExec",
                "esentutl",
                "Mimikatz",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536084,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1653692329,
    "ts_modification_date": 1653692329,
    "files": {
        "pdf": "https://archive.orkl.eu/88d57d5316c5c4ae101e5246a67ff5ec03cd7c2c.pdf",
        "text": "https://archive.orkl.eu/88d57d5316c5c4ae101e5246a67ff5ec03cd7c2c.txt",
        "img": "https://archive.orkl.eu/88d57d5316c5c4ae101e5246a67ff5ec03cd7c2c.jpg"
    }
}