{
    "id": "b6b5ff80-e0a0-47c2-87d1-7aed417eae4a",
    "created_at": "2023-01-12T15:01:08.459301Z",
    "updated_at": "2025-03-27T02:15:06.244212Z",
    "deleted_at": null,
    "sha1_hash": "5d424f5eb16a353613dcee428c43e803806bdea1",
    "title": "2015-08-31 - Shifu- ‘Masterful’ New Banking Trojan Is Attacking 14 Japanese Banks",
    "authors": "",
    "file_creation_date": "2022-05-28T03:51:52Z",
    "file_modification_date": "2022-05-28T03:51:52Z",
    "file_size": 1191606,
    "plain_text": "# 'Masterful' New Banking Trojan Is Attacking 14 Japanese Banks\n\n**[securityintelligence.com/shifu-masterful-new-banking-trojan-is-attacking-14-japanese-banks/](https://securityintelligence.com/shifu-masterful-new-banking-trojan-is-attacking-14-japanese-banks/)**\n\nAugust 31, 2015\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nShifu: ‘Masterful’ New Banking Trojan Is Attacking 14 Japanese Banks\n\n\n-----\n\n[Advanced Threats August 31, 2015](https://securityintelligence.com/category/x-force/threats/)\nBy [Limor Kessem co-authored by Ilya Kolmanovich,](https://securityintelligence.com/author/limor-kessem/) [Denis Laskov 7 min read](https://securityintelligence.com/author/denis-laskov/)\nA brand-new advanced banking Trojan discovered in the wild has been named “Shifu” by\nIBM Security X-Force, after the Japanese word for thief. The malware appears to have been\n[active since as early as April 2015; it was unearthed by IBM Security antifraud platforms](https://www.ibm.com/security/fraud-protection)\nthrough continuous protection of customer endpoints all over the world.\n\nShifu currently targets 14 Japanese banks and select electronic banking platforms used\nacross Europe; however, at this time, only Japan is seeing active attacks.\n\nDue to the capabilities Shifu presents, it is considered a highly sophisticated banking Trojan.\nOur analysis reveals that some of this malware’s features and modules were borrowed from\n[other banking Trojans’ leaked source codes, including Shiz, Gozi, Zeus and Dridex, making it](https://securityintelligence.com/gozi-goes-to-bulgaria-is-cybercrime-heading-to-less-chartered-territory/)\na power-patchwork of sorts.\n\n## Cybercrime’s New Familiar Face\n\n\n-----\n\nThe Shifu Trojan may be a new beast, but its inner workings are not entirely unfamiliar. The\nmalware relies on a few tried-and-true Trojan mechanisms from other infamous crimeware\ncodes. It appears that Shifu’s internal makeup was composed by savvy developers who are\nquite familiar with other banking malware, dressing Shifu with select features from the more\nnefarious of the bunch.\n\nSome examples of those similarities are:\n\n**Domain Generation Algorithm (DGA): Shifu uses the** [Shiz Trojan’s DGA. The](https://www.theregister.co.uk/2013/11/06/sap_rat_malfeasance/)\nexposed algorithm itself is easy to find online, and the developers behind Shifu have\nelected to use it for the generation of random domain names for covert botnet\ncommunications.\n\n**Theft From Bank Apps: Theft of passwords, authentication token files, user certificate**\nkeys and sensitive data from Java applets is one of Shifu’s principal mechanisms. This\n[type of modus operandi is familiar from Corcow’s and Shiz’s codes. Both Trojans used](http://www.net-security.org/malware_news.php?id=2705)\nthese mechanisms to target the banking applications of Russia- and Ukraine-based\nbanks. Shifu, too, targets Russian banks as part of its target list in addition to Japanese\nbanks.\n\n**Anti-Sec: Shifu’s string obfuscation and anti-research techniques were taken from**\n[Zeus VM (in its Chtonik/Maple variation), including anti-VM and the disabling of security](https://securityintelligence.com/tag/zeus/)\ntools and sandboxes.\n\n**[Stealth: Part of Shifu’s stealth techniques are unique to the Gozi/ISFB Trojan, and](https://www.secureworks.com/cyber-threat-intelligence/threats/gozi/)**\nShifu uses Gozi’s exact same command execution scheme to hide itself in the\nWindows file system.\n\n**Config: The Shifu Trojan is operated with a configuration file written in XML format —**\nnot a common format for Trojans, and similar to the Dridex Trojan’s configuration\n[(Dridex is a Bugat offspring).](https://exchange.xforce.ibmcloud.com/malware/family/dridex)\n\n**Wipe System Restore: Shifu wipes the local System Restore point on infected**\n[machines in a similar way to the Conficker worm, which was popular in 2009.](https://isc.sans.org/diary/Some+tricks+from+Conficker's+bag/5830)\n\nOn the less technical side, Shifu communicates via secure connection that uses a self[signed certificate, just like the one used by the Dyre Trojan.](https://securityintelligence.com/dyre-wolf/)\n\nShifu comes with basic built-in capabilities, which are supplemented by additional modules\nonce it contacts its command-and-control (C&C) server.\n\nThe initial package comes with features like:\n\nAnti-research, anti-VM and anti-sandbox tools;\nBrowser hooking and webinject parser;\n\n\n-----\n\nKeylogger;\nScreenshot grabber;\nCertificate grabber;\nEndpoint classification, monitoring applications of interest;\nRemote-access tool (RAT) and bot-control modules.\n\n## Out to Get It All\n\nFor a banking Trojan to be defined as advanced, it would typically need to possess a variety\nof real-time theft mechanisms and more than one way to control infected endpoints, including\nuser-grade takeover via RDP/VNC. Shifu appears to come with quite a few bells and whistles\nin that regard.\n\nThis Trojan steals a large variety of information that victims use for authentication purposes,\ncovering different sorts of authentication. For example, it keylogs passwords, grabs\ncredentials that users key into HTTP form data, steals private certificates and scrapes\nexternal authentication tokens used by some banking applications. These elements enable\nShifu’s operators to use confidential user credentials and take over bank accounts held with\na large variety of financial service providers.\n\nShifu scans, parses and exfiltrates data from smartcards if they are attached to a smartcard\nreader on the endpoint, and searches cryptocurrency wallets to steal from the infected victim.\n\n## Are You a Point of Sale?\n\nBeyond their interest in defrauding bank accounts, Shifu’s operators target payment card\ndata. The malware scans infected endpoints for strings that may indicate it has landed on a\npoint-of-sale (POS) endpoint, and if that sort of string is found on the machine, Shifu deploys\na RAM-scraping plugin to collect payment card data. RAM scraping is the top method for\nsiphoning credit and debit cards’ track 1 and track 2 data, used in major breaches like the\nTarget breach.\n\n## Electronic Banking Platforms Join the Hit List\n\nWhile webinjections are a common Trojan capability, very few Trojans target banking\nplatforms. Such an attack type is known from older malware like Shiz that targeted banking\nplatforms used by Russian banks. Shifu has a similar aim on Java applet-based platforms,\nwhere it hooks the Java processes and scans for .tok files. What Shifu is after in this case\nare tokens used as short-term authorizations for external authentication schemes.\n\nMoreover, Shifu looks for digital signature credentials issued by certification authorities to\nbusiness banking users, particularly in Italy. By resetting the PIN on the certificate, Shifu’s\noperators can impersonate the victim in fraudulent banking operations that authenticate\nusers based on their valid digital signature.\n\n\n-----\n\nTargeting banking applications rather than specific websites provides the benefit of making\nattacks more generic in the sense that they will fit more targets. If the malware’s developer\nfinds a way to compromise an application/platform in one case, it will likely work the same on\nother banks using that platform.\n\n## Local Deobfuscation Server Hides Injection C&C\n\nReminiscent of another advanced banking malware — like Dyre — Shifu conceals its\nwebinjections and does not show them in the configuration file. Instead, it fetches them in\nreal time from a remote server. But this is where its resemblance to other Trojans end. To call\non the correct injection at the right time, Shifu’s developers have created an interesting\nround-robin resolution to a local PHP server opened on the infected machine.\n\nWhen a new endpoint is infected by Shifu, the malware downloads and deploys an archived\nfile folder on that PC that turns it into a LocalHTTPServer. This local Apache server is then\nused for decrypting webinjections, hosting and receiving injected JavaScript from a remote\nShifu server.\n\nTo implement this real-time fetching, Shifu accesses a remote webinjects server, the address\nof which it strives to keep concealed. The server’s name as it appears in the configuration is\nnot decipherable and seems bogus at first glance. In reality, the request is obfuscated, and\ninstead of going to the Web browser as is, Shifu’s requests first go to the local PHP server\nfor deobfuscation. The local server has HEXtoString function instructions to interpret the\nrequest, fix it and then send the real one off to the browser in its proper form.\n\nShifu’s injections are selective and change according to the targeted entity. In some cases, it\nreplaces the bank’s entire page with a fake replica designed to harvest the data Shifu’s\noperators are after. In other cases, the Trojan displays social engineering content on the\npage using JavaScript injections to ask victims for additional authentication elements it will\nneed for a subsequent fraudulent transaction, such as PII or one-time passwords.\n\n## Intruders: Back Off!\n\nShifu’s operators appear to have no intention of sharing the spoils with anyone outside their\ngang. Once Shifu has landed on a newly infected machine, it activates an antivirus-type\nfeature designed to keep all other malware out of the game by stopping the installation of\nsuspicious files.\n\nShifu monitors the processes of a list of applications that interact with the Internet on a\n[regular basis, it hooks the URLDownloadtoFile function and keeps close watch on the](https://msdn.microsoft.com/en-us/library/ms775123%28v=vs.85%29.aspx)\nincoming files the endpoint receives. Files that may harbor malware will be stopped if they:\n\nCome from unsecured connections (HTTP);\nAre executables;\n\n\n-----\n\nAre unsigned.\n\nAs soon as a file of that sort is downloaded by the Web browser, Shifu copies it to the local\ndisk and names it “infected.exx.” It then exfiltrates it to its master’s C&C server. Shifu also\nspoofs a reply to the operating system trying to run the downloaded file with an “Out of\nMemory” message.\n\nThis feature serves to keep Shifu exclusive on the machines it infects. Moreover, sending\nmalware files to its operator on a regular basis allows Shifu to keep tabs on the competition\nand find out when other cybercriminals are attacking in the same geographical turfs.\n\nThis is the first time we are seeing malware build “rules” for suspicious files in order to make\nsure that the endpoint it’s on remains in its exclusive control from the moment of infection. If\nthe endpoint is already infected with other malware, Shifu does not find and delete other\nmalware; but by stopping new files from coming in, it can prevent malware from receiving\nversion and configuration updates, potentially cutting its ties with other botmasters.\n\n## Shifu’s Likely Origins\n\nSo who put the masterful Shifu together? Following analysis of Shifu’s scripts, our\nresearchers found comments written in Russian. Shifu’s developers could be either Russian\nspeakers or native to countries in the former Soviet Union. It is also possible that the actual\nauthors are obfuscating their true origin, throwing researchers off by implicating an allegedly\ncommon source of cybercrime.\n\nSome specific strings found during analysis of Shifu are not written in Cyrillic letters, but have\nmeanings in Russian. For example:\n\n**BUH: References the word “accounting” in Russian;**\n**KASSA: “Cashbox” in Russian;**\n**FINOTDEL: Corporate slang for the “accounting department”;**\n**ROSPIL: Russian government most prominent opposition party.**\n\nShifu’s servers are located in different countries, with domains hosted on IP addresses\nalongside a plethora of .ru domains that may or may not be linked to the same gang.\n\n## More to Come\n\nShifu is a complex and interesting new malware. At this time, the malware is actively\nattacking banks in Japan, but it has the potential — and a target list in place — to spread. Its\nmain fraud methods are based on credential grabbing, webinjections and certificate theft.\nHaving been built with code base from other crimeware families, Shifu is also protecting its\ninfected turf against other malware, shutting out the competition from its spoils.\n\n\n-----\n\nIBM Security X-Force has issued a complete report on Shifu and will release it in the coming\nweek. Stay tuned for additional information both here on Security Intelligence and on IBM XForce Exchange.\n\n[Shifu sample MD5 b9bc3f1b2aace824482c10ffa422f78b is presently detected as a generic](https://exchange.xforce.ibmcloud.com/malware/b9bc3f1b2aace824482c10ffa422f78b)\nmalware by 19 of 56 (34 percent) antivirus engines, according to VirusTotal and IBM X-Force\nExchange as of Aug. 27, 2015.\n\n[Read the white paper: Accelerating growth and digital adoption with seamless identity trust](https://www.ibm.com/account/reg/us-en/signup?formid=urx-33205)\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-08-31 - Shifu- ‘Masterful’ New Banking Trojan Is Attacking 14 Japanese Banks.pdf"
    ],
    "report_names": [
        "2015-08-31 - Shifu- ‘Masterful’ New Banking Trojan Is Attacking 14 Japanese Banks.pdf"
    ],
    "threat_actors": [
        {
            "id": "5cd42f56-d307-4d28-ad4f-4ff6b7d850be",
            "created_at": "2022-10-25T15:50:23.714424Z",
            "updated_at": "2025-03-27T02:00:55.532049Z",
            "deleted_at": null,
            "main_name": "Sowbug",
            "aliases": [
                "Sowbug"
            ],
            "source_name": "MITRE:Sowbug",
            "tools": [
                "Starloader",
                "Felismus"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75a05738-8fc5-41d0-add3-354b12ecbb8a",
            "created_at": "2023-01-06T13:46:38.726914Z",
            "updated_at": "2025-03-27T02:00:02.902408Z",
            "deleted_at": null,
            "main_name": "Sowbug",
            "aliases": [
                "G0054"
            ],
            "source_name": "MISPGALAXY:Sowbug",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f5eae92e-f9b5-44a2-b47b-b7087a4de831",
            "created_at": "2022-10-25T16:07:24.215895Z",
            "updated_at": "2025-03-27T02:02:10.141949Z",
            "deleted_at": null,
            "main_name": "Sowbug",
            "aliases": [],
            "source_name": "ETDA:Sowbug",
            "tools": [
                "Felismus",
                "StarLoader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535668,
    "ts_updated_at": 1743041706,
    "ts_creation_date": 1653709912,
    "ts_modification_date": 1653709912,
    "files": {
        "pdf": "https://archive.orkl.eu/5d424f5eb16a353613dcee428c43e803806bdea1.pdf",
        "text": "https://archive.orkl.eu/5d424f5eb16a353613dcee428c43e803806bdea1.txt",
        "img": "https://archive.orkl.eu/5d424f5eb16a353613dcee428c43e803806bdea1.jpg"
    }
}