{
    "id": "b6b98bdc-2941-4b81-abf2-0c8a4ea648e5",
    "created_at": "2023-01-12T15:03:55.240722Z",
    "updated_at": "2025-03-27T02:16:34.729207Z",
    "deleted_at": null,
    "sha1_hash": "5a2b907b45036e9877df817d22620d012fa02dfb",
    "title": "2022-09-21 - The art and science behind Microsoft threat hunting- Part 2",
    "authors": "",
    "file_creation_date": "2022-10-02T12:21:58Z",
    "file_modification_date": "2022-10-02T12:21:58Z",
    "file_size": 322534,
    "plain_text": "# The art and science behind Microsoft threat hunting: Part 2\n\n**[microsoft.com/security/blog/2022/09/21/the-art-and-science-behind-microsoft-threat-hunting-part-2/](https://www.microsoft.com/security/blog/2022/09/21/the-art-and-science-behind-microsoft-threat-hunting-part-2/)**\n\nSeptember 21, 2022\n\nWe discussed Microsoft Detection and Response Team’s (DART) threat hunting principles in\npart 1 of The art and science behind Microsoft threat hunting blog series. In this follow-up\npost, we will talk about some general hunting strategies, frameworks, tools, and how\n[Microsoft incident responders work with threat intelligence.](https://www.microsoft.com/security/business/services/microsoft-security-services-incident-response)\n\n## General hunting strategies\n\nIn DART, we follow a set of threat hunting strategies when our analysts start their\ninvestigations. These strategies serve as catalysts for our analysts to conduct deeper\ninvestigations. For the purposes of this blog, we are listing these strategies under the\nassumption that a compromise has been confirmed in the customer’s environment.\n\n### Starting with IOCs (“known bads”)\n\nAn incident response investigation is more manageable when you start off with an initial\nindicator of compromise (IOC) trigger, or a “known bad,” to take you to any additional\nfindings. We typically begin with data reduction techniques to limit the data we’re looking at.\nOne example is data stacking, which helps us filter and sort out forensic artifacts by indicator\nacross the enterprise environment until we’ve determined that several machines across the\nsame environment have been confirmed with that same IOC trigger. We then enter the\nhunting flow and rinse and repeat this process.\n\n\n-----\n\n_Figure 1: The hunting cycle starts with hunting for indicators or “known bads,” ranging from_\n_the smallest unit of indicators to behavioral indicators that may define the actor._\n\nTypes of indicators can be classified into:\n\n**Atomic—The smallest unit. For example, IP addresses, domain names, email**\naddresses, and file names.\n**Computed—Match multiple atomic indicators. For example, hashes and regular**\nexpressions.\n**Behavioral—Patterns of adversary actions. For example, tactics, techniques, and**\nprocedures (TTPs) and demonstrated actor preferences (such as file paths,\nusernames, and tools).\n\n### Quick wins\n\nUnfortunately, not everything we start out with is interrelated with the trigger IOC. Another\nhunting strategy we employ is to look for quick wins; in other words, looking for indicators of\ntypical adversary behavior present in a customer environment. Some examples of quick wins\n\n\n-----\n\ninclude typical actor techniques, actor specific TTPs, known threats, and verified IOCs.\nIdentifying our quick wins is the most impactful to the customer, as it helps us formulate our\nattack narrative while guiding customers to keep the actor away from the environment.\n\n_Figure 2: Hunting order of operations._\n\n### Anomaly-based hunting\n\nIf you’re out of leads, another strategy to employ is pivoting to hunting for anomalies, which\ndraws on information derived from our “known bads” and quick wins. We discussed\n[anomalies in the first part of this series as part of understanding the customer data. Some](https://www.microsoft.com/security/blog/2022/09/08/part-1-the-art-and-science-of-threat-hunting/)\ntechniques:\n\n**Define baselines. Perform baseline comparisons for your dataset. Determine the**\nusual versus the unusual in an environment.\n**Summarize your data and occurrences and sort by indicator to find the outliers.**\n**Clean the output. We recommend formatting your data in favor of efficiency and**\naccuracy to make the outliers and anomalies stand out.\n\nPure anomaly-based hunting may be performed concurrently with other hunting strategies on\na customer engagement, depending on the data we’re presented. This method is incredibly\nnuanced and requires seasoned experts to verify whether data patterns may encompass\nnormal or “abnormal” behavior. This prevalence checking and data science approach is the\nmost time consuming but can bear some of the most interesting evidence in an investigation.\nCase in point, we can detect new advanced persistent threat (APT) actor groups and\ncampaigns with anomaly hunting, while they are rarely detected just by searching for the\n“known bads.“\n\n\n-----\n\n### Tying it all together: The attack narrative\n\nStringing together our patterns of anomalous activity, factual data from quick wins, and\nanalytical opinions must conclude with an attack narrative. In an incident response\n[investigation, the MITRE ATT&CK framework serves as a foundation for adversary tactics](https://attack.mitre.org/)\nand techniques based on real-world observations.\n\nThe MITRE framework helps us ensure that that we’re looking at our hypothesis in a\nstructured manner to enable us to tell a cohesive narrative to the customer that is rooted in\nour analysis. We aim to answer questions such as:\n\nHow did the attacker gain access?\nWhat did they do once inside?\nWhich accounts did they use?\nWhich systems did they access?\nHow and where did they persist?\nWas any data accessed or exfiltrated?\nAnd, most importantly, are they still in the environment?\n\nAdditionally, we want to answer questions surrounding threat actor intent to help tell a better\nstory and build better defenses. Some common attack patterns from the MITRE framework\nare listed in Table 1.\n\n**Tactic** **Techniques**\n\nInitial access Phishing files\n\nExecution PowerShell and service execution\n\nPersistence Services installations, webshells, scheduled tasks, registry run keys\n\n\nDefense\nevasion\n\nCredential\naccess\n\n\nMasquerading, obfuscation, Background Intelligent Transfer Service\n(BITS) jobs, signed executables\n\nBrute forcing, credential dumping\n\n\nDiscovery Network share enumeration\n\n\nLateral\nmovement\n\n\nOverpass the hash, WinRM\n\n\nCollection Data staging\n\n\nCommand and\ncontrol\n\n\nUn/commonly used ports\n\n\nExfiltration Data compression\n\n\n-----\n\n**Tactic** **Techniques**\n\nImpact Data encrypted for impact\n\n_Table 1: Common attack patterns from MITRE._\n\n## Threat hunting tools and methodology\n\nTo ensure maximum visibility of the attack chain, hunters use data sourced from proprietary\nincident response tooling for point-in-time deep scanning on endpoints, as well as bespoke\nforensic triage tools on devices of interest.\n\nFor point-in-time deep scanning, DART uses:\n\nProprietary incident response tooling for Windows and Linux.\nForensic triage tool on devices of interest.\n[Microsoft Azure Active Directory (Azure AD) security and configuration assessment.](https://azure.microsoft.com/services/active-directory/)\n\nFor continuous monitoring:\n\n[Microsoft Sentinel—Provides centralized source of event logging. Uses machine](https://azure.microsoft.com/services/microsoft-sentinel/)\nlearning and artificial intelligence.\n[Microsoft Defender for Endpoint—For behavioral, process-level detection. Uses](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)\nmachine learning and artificial intelligence to quickly respond to threats while working\nside-by-side with third-party antivirus vendors.\n[Microsoft Defender for Identity—For detection of common threats and analysis of](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-defender-for-identity)\nauthentication requests. It examines authentication requests to Azure AD from all\noperating systems and uses machine learning and artificial intelligence to quickly report\nmany types of threats, such as pass-the-hash, golden and silver ticket, skeleton key,\nand many more.\n[Microsoft Defender for Cloud Apps—Cloud Access Security Broker (CASB) that](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-defender-cloud-apps)\nsupports various deployment modes including log collection, API connectors, and\nreverse proxy. It provides rich visibility, control over data travel, and sophisticated\nanalytics to identify and combat cyberthreats across all your Microsoft and third-party\ncloud services.\n\n\n-----\n\nFigure 3 explains the products and services used to identify and monitor threats:\n\nDeep scan includes proprietary endpoint scanners such as ASEP, Fennec, LIFE, and\nFoX\nEnterprise data includes Active Directory Configuration and Antivirus logs.\nGlobal telemetry includes the Intelligent Security Graph, the largest sensor network in\nthe world.\n\nContinuous monitoring includes the following:\n\nMicrosoft Defender for Office 365, which monitors spoofing impersonation, and content\nanalysis.\nMicrosoft Defender for Cloud Apps, which monitors app discovery, access\nmanagement, and data loss prevention.\nMicrosoft Defender for Endpoint, which monitors exploitation, installation, and\ncommand and control channel.\nMicrosoft Defender for Identity, which monitors reconnaissance, lateral movement, and\ndomain dominance.\nMicrosoft 365 Defender, Microsoft Sentinel, and Microsoft Defender for Cloud, which\ninclude advanced hunting, alerting, and correlation across data sources.\n\nIn addition, we work with internal threat intelligence teams, like the Microsoft Threat\nIntelligence Center (MSTIC), to provide details from our hands-on experience with customer\nenvironments and going toe-to-toe with the threat actors. The information collected from\nthese experiences, in turn, provides a trail of evidence to help threat teams and services\nconduct enriched threat intelligence and security analytics to ensure the security of our\ncustomers.\n\n\n-----\n\n## Contributing to threat intelligence innovation through openness and transparency\n\nWe give organizations and customers the visibility and relevance of security events by\n[sharing our data from dynamic threat intelligence and our continued collaboration with the](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-defender-threat-intelligence)\nMSTIC team. This collaboration has proven successful in instances where Microsoft Security\nteams have actively tracked large-scale extortion campaigns targeted at multiple\norganizations, resulting in an industry-wide effort to understand and track the threat actor’s\ntactics and targets.\n\nThe [NOBELIUM incident in late 2021 was another instance of a large-scale cyberattack that](https://www.microsoft.com/security/blog/2021/11/10/the-hunt-for-nobelium-the-most-sophisticated-nation-state-attack-in-history/)\nlaunched a global hunting effort formed around MSTIC and Microsoft’s team of global\nsecurity experts. The threat actor targeted privileged accounts of service providers to move\nlaterally in cloud environments, leveraging trusted relationships to gain access to\ndownstream cloud service provider (CSP) customers. We engaged directly with affected\ncustomers to assist with incident response and drive detection and guidance around this\nactivity. Through a successful partnership and continuous feedback loop, we have been able\nto improve our ability to minimize impact and protect customers over time.\n\nThe work we delivered in protecting customers against NOBELIUM attacks would not have\nbeen possible if not for the continuous hunting process and feedback loop with threat\nintelligence. We’ve crafted a symbiotic relationship that empowers threat hunters at DART to\nbecome better incident responders by looking at additional vectors seen in threat intelligence\nplatforms.\n\nSeeing events from a threat intelligence perspective, applying the art and science of threat\nhunting, and partnering with the security industry at large are all but signs of our commitment\nto growth and helping organizations stay protected from cyberattacks.\n\n## Learn more\n\nTo read about the latest attack methods and cybersecurity best practices from our\ninvestigations and engagements, visit the Microsoft Detection and Response Team (DART)\nblog series. To learn more about our specialized incident response and recovery services\nbefore, during, and after a cybersecurity crisis, visit Microsoft Security Services for Incident\nResponse.\n\n[To learn more about Microsoft Security solutions, visit our website. Bookmark the](https://www.microsoft.com/security/business/solutions) Security\nblog to keep up with our expert coverage on security matters. Also, follow us\nat [@MSFTSecurity for the latest news and updates on cybersecurity.](https://twitter.com/@MSFTSecurity)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-21 - The art and science behind Microsoft threat hunting- Part 2.pdf"
    ],
    "report_names": [
        "2022-09-21 - The art and science behind Microsoft threat hunting- Part 2.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535835,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1664713318,
    "ts_modification_date": 1664713318,
    "files": {
        "pdf": "https://archive.orkl.eu/5a2b907b45036e9877df817d22620d012fa02dfb.pdf",
        "text": "https://archive.orkl.eu/5a2b907b45036e9877df817d22620d012fa02dfb.txt",
        "img": "https://archive.orkl.eu/5a2b907b45036e9877df817d22620d012fa02dfb.jpg"
    }
}