{
    "id": "b6db1d3a-c20d-43a6-8553-6196a81c1e71",
    "created_at": "2023-01-12T15:03:07.575332Z",
    "updated_at": "2025-03-27T02:06:04.060674Z",
    "deleted_at": null,
    "sha1_hash": "99babb3c6eae631f43427e43f4bf1eedd34f330c",
    "title": "2020-04-29 - Gazorp - Thieving from thieves",
    "authors": "",
    "file_creation_date": "2022-05-28T02:39:41Z",
    "file_modification_date": "2022-05-28T02:39:41Z",
    "file_size": 2400035,
    "plain_text": "# Gazorp - Thieving from thieves\n\n**fr3d.hk/blog/gazorp-thieving-from-thieves**\n\nApril 29, 2020 - Reading time: 15 minutes\n\nThis is a look into the short-lived piece of malware called Gazorp, and how its creators\nplaced a backdoor within its command & control panel. I'll be looking at the code and how the\nbackdoor was created and hidden.\n\n## Foreword\n\nI would like to begin by saying that I apologize for the lack of content recently. The planned\npost did not end up working out due to some unforeseen issues, but I believe that this post is\n[a worthy replacement. A lot of credit for this story goes to hexlax (twitter). He let me know of](https://twitter.com/hexlax)\nthis backdoor and shared his research into it, although the research presented in this post is\nmy own and was carried out in light of his discoveries.\n\n## Introduction\n\nGazorp was a piece of malware distributed around late 2018. This malware was shared\nthrough a free to use builder that was hosted on an onion site. On this site, anybody could\nbuild a ready to go copy of Gazorp and use the included C&C (C2) panel to receive the logs\nof their freshly built malware. When built, the site would prompt you to download a zip file\nwhich included your built malware. The panel, along with instructions on how to set up the\npanel were also included. The panel login looked like this.\n\n\n-----\n\nPanel Login\n\nAs word of a new free to use malware spread across forums, threat researchers were quick\nto discover that Gazorp was just AZORult v3.0 with a reskinned panel. For their part, the\ncreators of Gazorp claimed that they had redesigned the AZORult panel and fixed multiple\nvulnerabilities/flaws. Because Gazorp ended up just being AZORult, it was made clear the\ncreators had cracked an original build of the malware and were changing strings within the\nbuild to point it to a new C2. You may now be asking, why would anyone put in the effort of\nre-coding a C2 and then distributing it for free? Well, it was obviously too good to be true.\n\n## The Backdoor\n\nBecause hexlax had discovered the backdoor when the malware was still being used, he\nmanaged to snag seven separate builds of Gazorp. These were incredibly helpful in my\nresearch, as they allowed me to make comparisons of what was changing between builds. At\nfirst, I used a free service called Intezer to check if the builds were in fact AZORult.\n\n\n-----\n\nIntezer\n\nThere was no surprise that the malware had a 92% match with AZORult. Because I had\nseven builds, I began comparing them in HxD and found that there was nothing different\nbesides their targeted C2s. Due to this, I decided to move on and look at the panel which is\nthe more interesting of the two items. Using another file comparison tool I found out that a\nconstant within the PHP code was changing.\n\nChanging Constant\n\nThese changes were very weird, as they were in a class that was used to get the location of\na given IP. Usually these libraries are just included and do not differ from their original\nsource, but in this case the constant was changing every build. Another thing that was\nchanging was the gate name. This gate name was randomly generated, and is where the\nmalware is pointed to when you put in your domain into the web builder. I wanted to verify\nthat the builds were hitting this PHP file so I spun up my instance of Cuckoo sandbox and\nran one of the samples.\n\n\n-----\n\nCuckoo\n\nThe build sends a POST to the gate, along with some encrypted data that is unimportant,\nand is related to how AZORult functions. So now that I know my entry point, let's see how I\ncan find my way into the 'IP2Location' file that contains the changing constant. The gate\nlooks like so:\n\nGate\n\nWe can see that the gate receives the POST data and then decodes it with an XOR key, we\nwill discuss this key later. The results of that decryption are then compared with the string\n_reportdata, and if reportdata is within the decrypted input, then the decrypted data is sent into_\nthe parse_bot_report function. This function is unimportant for our intentions, and contains\ntwo lines which will bring us closer to the backdoor.\n\nparse_bot_report\n\nThe function tries to get the ip of the bot, and try to deduce the country from this. Let's take a\nquick peek into the \"get_bot_ip\" function:\n\n\n-----\n\nget_bot_ip\n\nWithin this function we see the first of the checks implemented to stop others from by\nmistake triggering the backdoor. The constant BOT_IP_HEADER is actually just set to\nanother string.\n\nbot_ip_header\n\nThe string HTTP_CLIENT_IP is a header that can be set within a web request to denote the\nclient's IP. So why does the code go to this extent to hide the possibility of a bot setting its\nown IP? Well, AZORult never uses this functionality, and because of this we can guess it's\nnot intended to be used by the built malware. The next function called from parse_bot_report\nis the get_isocode function where the IP in the header is used as a parameter. Let's take a\nlook at it:\n\nget_isocode\n\nSo this is the function that calls us into the PHP file containing the backdoor. It includes the\n_IP2Location file and then creates a new instance of the database included with the library._\nOnce that's done, the function calls us into the lookup function that has a parameter of which\nif you remember, is possible to be set through including the HTTP_CLIENT_IP header within\nour request. The lookup function is where the magic happens, so let's take a look at it and\nfollow where our parameter of is used.\n\nfields_h\n\n\n-----\n\nOur variable of IP is compared to a constant called IP_ROOT. This constant is set to\n\"0.0.0.0\" within the config. So this comparison is checking if the IP of the bot is equal to\n\"0.0.0.0\", but this IP would never be set by the malware. So this must be a check for a\nmanual request, which was setting its own IP through the get_bot_ip function. So where\ndoes the fields_h bool get used?\n\ncode_h\n\nWell, the variable is used to place us into this comparison. This time, another request header\nis checked against another constant, but this constant is different. If you remember from my\ninitial discovery of the backdoor, it was through a changing constant in each of the panels.\nWell IP_HASH is that changing constant, in the case of this build, it is set to a random string.\n\nIP_HASH\n\nIn the case of the panel, it was set to a seemingly random string, which was different in each\nof the seven different panels I had. It is important to note once again, these checks are\ncomparing request headers that are never used by AZORult, so they must be intended to be\nchecking a request that wasn't made by the malware. Again, a constant is set to true. In this\ncase, it is named code_h. Like we did with fields_h, following this variable we find the\nbackdoor.\n\nThe Backdoor\n\nThe first line within the backdoor is setting a variable to a constant that is defined in the\n_IP2Location file. The EXCEPTION_FUNCTION constant is set to create_function. If you look_\nat create_function then you find it is a method of creating a function by setting arguments as\nthe first parameter, and then code within the second parameter. In this case the code is\n\n\n-----\n\nparsed through the cookie countrycode. An @ symbol is then used on the created function to\nsuppress all errors. Once the function has been created, and the variable country_hair has\nbeen set to it, then the created function is called.\n\n## Exploitation\n\nNow that we covered how everything works let's recap, here are the steps needed to get to\nthe backdoor.\n\n1. XOR encrypt reportdata and POST it to the gate\n\n2. Set the Client-IP header in the POST request to '0.0.0.0' to get past the first check\n\n3. Set the HASH header to the string in the IP_HASH constant 'a01f2b04a7' to get past\n\nthe second check\n\n4. Set the countrycode cookie to a PHP payload of your choice\n\nBecause I wanted to accomplish this exploit with ease I created a Python script to trigger the\nbackdoor.\n\nPython Script\n\nAn important thing to note is that because Gazorp was using a cracked version of AZORult,\nand was only changing the gate URL, It was not changing the encryption used for its POST\nrequest. Hence, this script will work with all Gazorp panels. The PHP payload must be URL\nencoded as well, in order for it to work.\n\n## Epilogue\n\nGazorp was a short-lived piece of malware created for the sole purpose of backdooring its\nusers. The Gazorps onion site has been down for ages now, and AZORult has become a\nuseless piece of malware due to the ways browsers encrypt their store data. I have not been\nable to find any live instances of this malware, and hence have decided that it is a good time\n\n\n-----\n\nto show this backdoor. I d like to again say thank you to hexlax & a huge thanks to Steved3\n[(twitter) for editing! Lastly and most importantly thank you for reading this post. Until the next](https://twitter.com/SteveD3)\ntime, goodbye.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-29 - Gazorp - Thieving from thieves.pdf"
    ],
    "report_names": [
        "2020-04-29 - Gazorp - Thieving from thieves.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535787,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653705581,
    "ts_modification_date": 1653705581,
    "files": {
        "pdf": "https://archive.orkl.eu/99babb3c6eae631f43427e43f4bf1eedd34f330c.pdf",
        "text": "https://archive.orkl.eu/99babb3c6eae631f43427e43f4bf1eedd34f330c.txt",
        "img": "https://archive.orkl.eu/99babb3c6eae631f43427e43f4bf1eedd34f330c.jpg"
    }
}