{
    "id": "b6fc9e0e-6636-4517-91d6-e338c12f72ad",
    "created_at": "2022-10-25T16:48:20.875057Z",
    "updated_at": "2025-03-27T02:09:38.854058Z",
    "deleted_at": null,
    "sha1_hash": "e7fe796592d6377129bda857d1a121fc06d40c53",
    "title": "2016-11-15 - ScanPOS, new POS malware being distributed by Kronos",
    "authors": "",
    "file_creation_date": "2022-03-24T14:09:32Z",
    "file_modification_date": "2022-03-24T14:09:32Z",
    "file_size": 1148067,
    "plain_text": "### 24 March 2022  The following information is being provided by the FBI, with no guarantees or warranties, for potential\n\n_use at the sole discretion of recipients to protect against cyber threats. This data is provided to help_\n_cyber security professionals and system administrators guard against the persistent malicious actions_\n\n**PIN Number** _of cyber actors. This PIN was coordinated with industry partners, DOE, and DHS/CISA._\n\n_This PIN has been released TLP:WHITE_\n\n#### 20220324-001\n\n\n### Please contact the FBI with any questions related to this Private Industry\n Notification via your local FBI Cyber Squad.\n\n#### www.fbi.gov/contact-us/field-offices\n\n# TRITON Malware Remains Threat to Global Critical\n\n Infrastructure Industrial Control Systems (ICS)\n\n### Summary\n\nThe FBI is warning that the group responsible for the deployment of TRITON malware against a\nMiddle East–based petrochemical plant’s safety instrumented system in 2017, the Russian\nCentral Scientific Research Institute of Chemistry and Mechanics (TsNIIKhM), continues to\nconduct activity targeting the global energy sector. This warning follows the 24 March 2022\nunsealing of a US indictment of a Russian national and TsNIIkhM employee involved in that\nattack. TRITON was malware designed to cause physical safety systems to cease operating or to\noperate in an unsafe manner. Its potential impact could be similar to cyberattacks previously\nattributed to Russia that caused blackouts in Ukraine in 2015 and 2016.\n\nTRITON malware targeted the Schneider Electric Triconex safety instrumented system (SIS),\nwhich is used to initiate safe shutdown procedures in the event of an emergency. TRITON\nmalware affected Triconex Tricon safety controllers by modifying in-memory firmware to add\nadditional programming, potentially leading to damage of a facility, system downtime, and\neven loss of life should the SIS fail to initiate safe shutdown procedures. Schneider Electric\naddressed the vulnerability (with the Tricon model 3008 v10.0-10.4) when version 11.3 of\n\n\n-----\n\nthe Tricon controller was released in June 2018; however, older versions of the controller\nremain in use and are vulnerable to a similar attack. As a result, the FBI is alerting the ICS\ncommunity of continued activity by this group and requests that any indicators of potential\ncompromise be reported to the FBI.\n\n### Threat\n\nIn June and again in August 2017, TRITON malware (also known as TRISIS and HatMan) was\nused against a Middle East–based petrochemical facility’s safety controllers. The US\n[Government has publicly attributed TRITON malware to TsNIIKhM, a Russian government-](http://home.treasury.gov/news/press-releases/sm1162)\ncontrolled research institution that supports the Russian armed forces with advanced research,\nweapons, and cyber capabilities.\n\nTRITON malware was designed to target a specific SIS controller model, with a specific firmware\nversion, running a small range of specific versioned firmware, and used in critical infrastructure\nfacilities to initiate immediate shutdown procedures in the event of an emergency. For more\n[information on affected equipment and TRITON malware, see CISA ICS Advisory Schneider](https://www.cisa.gov/uscert/ics/advisories/ICSA-18-107-02)\n[Electric Triconex Tricon (Update B) and CISA Malware Analysis Report (MAR) HatMan - Safety](https://www.cisa.gov/uscert/ics/advisories/ICSA-18-107-02)\n[System Targeted Malware (Update B).](https://www.cisa.gov/uscert/ics/MAR-17-352-01-HatMan-Safety-System-Targeted-Malware-Update-B)\n\nIn the 2017 attack, the actor gained initial access and then moved laterally through the\ninformation technology (IT) and operational technology (OT) networks onto the safety system\nand installed TRITON malware. This provided the actor access to and control of Schneider\nElectric’s Triconex devices used in the facility’s ICS safety system. The facility automatically\nentered a safe state after several of the Triconex ICS safety controllers detected an anomaly,\ncaused by software bugs in the TRITON malware. The subsequent investigation of the shutdown\nrevealed the attacker’s presence and the malware itself. The facility’s automatic shutdown and\ndetection of malware prevented the cyberattack from reaching its full capabilities.\n\nTRITON malware’s design gave the attackers complete remote control of the SIS, providing\nthem the capability to cause significant physical damage and loss of life if the plant were to\nenter an unsafe state, according to investigations and analysis that followed the event. After\nthe August 2017 cyberattack, the actors again obtained unauthorized access to a file server to\ncollect information on how the facility responded to the incident.\n\nThe TRITON attack represented a notable shift in ICS targeting as the first attack designed to\nallow physical damage, environmental impact, and loss of life in the event of a plant’s running\nin an unsafe condition. Critical infrastructure asset owners and operators should be mindful of\nthe risks posed to SIS regardless of vendor, as these safety systems will likely continue to be\ntargeted by sophisticated cyber actors.\n\nRussian cyber actors have previously conspired to deploy malware and take other disruptive\nactions for the strategic benefit of Russia through unauthorized access to victim computers and\nICS. These cyberattacks used some of the world’s most destructive malware to date, including\n\n\n-----\n\nKillDisk and Industroyer, which each caused blackouts in Ukraine in 2015 and 2016,\nrespectively. Russian cyber actors have also deployed non-disruptive malware, such as Havex,\nwhich enables the actors to return to compromised and otherwise vulnerable ICS devices for\nfuture espionage purposes.\n\nFor additional information on the TRITON malware attack, see the FBI PIN titled Unattributed\n_Cyber Actors Exploiting Internet-connected ICS/SCADA Systems, PIN 20180614-001._\n\nFor more information on Russian state-sponsored malicious cyber activity, see\n[cisa.gov/uscert/Russia.](https://www.cisa.gov/uscert/russia)\n\n### Recommendations\n\nThe FBI encourages potentially affected critical infrastructure asset owners and operators to\nmaintain business continuity plans to minimize essential service interruptions, as well as\npreemptively evaluate potential continuity and capability gaps. Asset owners and operators\nshould regularly assess and monitor their SIS systems, personnel with access to these systems,\nand practice contingency plans.\n\nFurthermore, the FBI encourages those potentially affected to review Schneider Electric’s\nguidance set forth in its Security Notification for the EcoStruxure Triconex Tricon, revision 3.\nThrough the enhanced Tricon CX controller, version 11.4 and later versions, Schneider Electric\nhas enhanced security and mitigated the risk of the TRITON malware’s attack vector, reducing\nfurther the risks of these type of malware incidents; however, network defenders should\nremain vigilant.\n\nBased on the attack framework and malware used in the original TRITON incident, a similar\nattack could be designed against other SIS. Therefore, the following recommendations are\nrelevant to many SIS vendors and brands, along with their customers. The best practices listed\nbelow are applicable to most SIS products used in critical infrastructure facilities today.\n\n##### SIS Best Practices \n\n  - Use a unidirectional gateway for applications that need to receive data the SIS provides.\n\n  - Implement change management procedures for safety controller run-state key positions\n\nand regularly audit physical keys.\n\n  - Ensure the cybersecurity features in SIS products are always enabled by following the\n\nmanufacturers’ security recommendations.\n\n\n-----\n\n  - Safety systems should always be deployed on isolated networks.\n\n  - Physical controls should be in place so that no unauthorized person would have access\n\nto the safety controllers, peripheral safety equipment, or the safety network.\n\n  - All controllers should reside in locked cabinets and never be left accessible to\n\nunauthorized personnel.\n\n  - All engineering workstations should be secured and never be connected to any network\n\nother than the safety network.\n\n  - All methods of mobile data exchange with the isolated safety network such as CDs, USB,\n\ndrives, DVDs, etc. should be scanned before use in the SIS engineering workstations or\nany node connected to this network.\n\n  - Operator stations should be configured to display an alarm whenever the SIS safety\n\ncontroller key switch is in the “PROGRAM” mode.\n\n  - Check network appliances, webservers, and third party vendor logs for early stage\n\nreconnaissance activity against: job postings, pages listing employee social media\naccounts, websites for facility subdomains, employee email addresses, pages listing\nthird party vendors, and equipment specific to identified facilities.\n\nResources:\n\n  - CISA Joint CSA Understanding and Mitigating Russian State-Sponsored Cyber Threats to\n\nU.S. Critical Infrastructure\n\n  - [CISA ICS Advisory Schneider Electric Triconex Tricon (Update B)](https://www.cisa.gov/uscert/ics/advisories/ICSA-18-107-02)\n\n  - [CISA MAR HatMan - Safety System Targeted Malware (Update B)](https://www.cisa.gov/uscert/ics/MAR-17-352-01-HatMan-Safety-System-Targeted-Malware-Update-B)\n\n  - [NSA and CISA Joint Cybersecurity Advisory NSA and CISA Recommend Immediate](https://media.defense.gov/2020/Jul/23/2002462846/-1/-1/1/OT_ADVISORY-DUAL-OFFICIAL-20200722.PDF)\n\n[Actions to Reduce Exposure Across all Operational Technologies and Control Systems](https://media.defense.gov/2020/Jul/23/2002462846/-1/-1/1/OT_ADVISORY-DUAL-OFFICIAL-20200722.PDF)\n\n  - [CISA’s Fact Sheet Rising Ransomware Threats to Operational Technology Assets.](https://www.cisa.gov/publication/ransomware-threat-to-ot#:~:text=On%20June%209%2C%202021%2C%20CISA%20published%20Rising%20Ransomware,to%20operational%20technology%20%28OT%29%20assets%20and%20control%20systems.)\n\nAlthough tailored to ransomware, the Fact Sheet provides applicable guidance for\ncritical infrastructure entities to reduce cyber threats to their OT assets.\n\n\n-----\n\n### Reporting Notice\n\nThe FBI encourages recipients of this document to report information concerning suspicious or criminal\n\nactivity to their local FBI field office. Field office contacts can be identified at www.fbi.gov/contact-us/field\noffices. When available, each report submitted should include the date, time, location, type of activity,\n\nnumber of people, and type of equipment used for the activity, the name of the submitting company or\n\norganization, and a designated point of contact.\n\n### Administrative Note\n\nThis product is marked TLP:WHITE. Subject to standard copyright rules, the information in this\nproduct may be shared without restriction.\n\n\n## Your Feedback Regarding this Product is Critical\n\n### Please take a few minutes to send us your feedback. Your feedback submission may be anonymous. We read each submission carefully, and your feedback will be extremely valuable to the FBI. Feedback should be specific to your experience with our written products to enable the FBI to make quick and continuous improvements to these products. Feedback may be submitted online here: https://www.ic3.gov/PIFSurvey\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/Media/News/2022/220325.pdf",
        "https://papers.vx-underground.org/papers/ICS SCADA/Triton/TRITON Malware Remains Threat to Global Critical Infrastructure Industrial Control Systems (ICS) (20220324-001).pdf"
    ],
    "report_names": [
        "220325.pdf",
        "TRITON Malware Remains Threat to Global Critical Infrastructure Industrial Control Systems (ICS) (20220324-001).pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041378,
    "ts_creation_date": 1648130972,
    "ts_modification_date": 1648130972,
    "files": {
        "pdf": "https://archive.orkl.eu/e7fe796592d6377129bda857d1a121fc06d40c53.pdf",
        "text": "https://archive.orkl.eu/e7fe796592d6377129bda857d1a121fc06d40c53.txt",
        "img": "https://archive.orkl.eu/e7fe796592d6377129bda857d1a121fc06d40c53.jpg"
    }
}