{
    "id": "b70a72f0-9494-4062-ac4a-aeb4a48aea35",
    "created_at": "2023-01-12T15:05:27.468197Z",
    "updated_at": "2025-03-27T02:05:49.252518Z",
    "deleted_at": null,
    "sha1_hash": "504e26f57286ab091b3546b1b18fa337562bf2bd",
    "title": "2020-09-30 - Alert Number I-093020-PSA- Distributed Denial of Service Attacks Could Hinder Access to Voting Information, Would Not Prevent Voting",
    "authors": "",
    "file_creation_date": "2022-05-28T00:38:21Z",
    "file_modification_date": "2022-05-28T00:38:21Z",
    "file_size": 116336,
    "plain_text": "# Distributed Denial of Service Attacks Could Hinder Access to Voting Information, Would Not Prevent Voting\n\n**ic3.gov/media/2020/200930.aspx**\n\n## September 30, 2020 (2020-09-30T10:00:00-04:00)\n\nAlert Number\n\n## I-093020-PSA\n\nQuestions regarding this PSA should be directed to your local FBI Field Office.\n\nLocal Field Office Locations: [www.fbi.gov/contact-us/field-offices](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n\n_The FBI and CISA are issuing this PSA as a part of a series on threats to the 2020 election_\n_to enable the American public to be prepared, patient, and participating voters._\n\nThe Federal Bureau of Investigation (FBI) and Cybersecurity and Infrastructure Security\nAgency (CISA) are issuing this announcement to raise awareness that Distributed Denial of\nService (DDoS) attacks on election infrastructure can hinder access to voting information but\nwould not prevent voting.\n\nDDoSs are common cyber-attacks that can slow or render election-related public-facing\nwebsites inaccessible, which could hinder voters' ability to access voting information or\nvoting results. A DDoS attack occurs when attackers flood a public-facing, Internet\naccessible server with requests, rendering the targeted server slow or inaccessible. This\nprevents users from accessing online resources, such as web pages and online accounts,\nand may disrupt business activities for a period of time.\n\nThe public should be aware that if foreign actors or cyber criminals were able to successfully\nconduct DDoS attacks against election infrastructure, the underlying data and internal\nsystems would remain uncompromised, and anyone eligible to vote would still be able to cast\na ballot. In the past, cyber actors have falsely claimed DDoS attacks have compromised the\n\n\n-----\n\nintegrity of voting systems in an effort to mislead the public that their attack would prevent a\nvoter from casting a ballot or change votes already cast. The FBI and CISA have no\nreporting to suggest a DDoS attack has ever prevented a registered voter from casting a\nballot, or compromised the integrity of any ballots cast.\n\nThe FBI and CISA have worked closely with election officials across the country to identify\nalternative channels to disseminate information to voters, such as verified social media\naccounts, traditional media, and other backup resources. Election officials have multiple\nsafeguards and plans in place to limit the impact and recover from a DDoS incident with\nminimal disruption to the voting process.\n\nRecommendations\n\nSeek out information about how to vote and polling place information prior to Election\nDay.\nSeek out information from trustworthy sources, verify who produced the content, and\nconsider their intent.\nRely on state and local government election officials for information about registering to\nvote, polling locations, voting by mail, and final election results.\nDetermine where to vote before Election Day.\nVerify the web address of legitimate websites and manually type the address into your\nbrowser.\nDo a quick search for other reliable sources before sharing a controversial or\nemotionally charged article, post, tweet, or meme you read. Studies show that being\nwell informed requires getting information from many places. If it isn't from a credible\nsource or if you can't find a second reliable source, don't share it.\n\n**The FBI is responsible for investigating and prosecuting election crimes, malign**\n**foreign influence operations, and malicious cyber activity targeting election**\n**infrastructure and other U.S. democratic institutions. CISA helps critical infrastructure**\nowners and operators, including those in the election community, remain resilient against\nphysical and cyber threats. The FBI and CISA provide services and information to uphold the\nsecurity, integrity, and resiliency of the U.S. electoral processes.\n\nVictim Reporting and Additional Information\n\nThe FBI encourages the public to report information concerning suspicious or criminal\n[activity to their local field office (www.fbi.gov/contact-us/field-offices) or to the FBI's Internet](https://www.ic3.gov/Home/Egress?url=https://www.fbi.gov/contact-us/field-offices)\n[Crime Complaint Center (www.ic3.gov). For additional assistance, best practices, and](https://www.ic3.gov/)\ncommon terms, please visit the following websites:\n\nProtected Voices: www.fbi.gov/investigate/counterintelligence/foreigninfluence/protected-voices\nElection Crimes and Security: www.fbi.gov/scams-and-safety/common-scams-andcrimes/election-crimes-and-security\n[#Protect2020: www cisa gov/protect2020](https://www.ic3.gov/Home/Egress?url=https://www.cisa.gov/protect2020)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-30 - Alert Number I-093020-PSA- Distributed Denial of Service Attacks Could Hinder Access to Voting Information, Would Not Prevent Voting.pdf"
    ],
    "report_names": [
        "2020-09-30 - Alert Number I-093020-PSA- Distributed Denial of Service Attacks Could Hinder Access to Voting Information, Would Not Prevent Voting.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535927,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653698301,
    "ts_modification_date": 1653698301,
    "files": {
        "pdf": "https://archive.orkl.eu/504e26f57286ab091b3546b1b18fa337562bf2bd.pdf",
        "text": "https://archive.orkl.eu/504e26f57286ab091b3546b1b18fa337562bf2bd.txt",
        "img": "https://archive.orkl.eu/504e26f57286ab091b3546b1b18fa337562bf2bd.jpg"
    }
}