{
    "id": "b71174b4-ea70-4b1a-9077-113f0c2309ea",
    "created_at": "2023-01-12T15:07:15.362481Z",
    "updated_at": "2025-03-27T02:05:22.026365Z",
    "deleted_at": null,
    "sha1_hash": "c140607bdccb7499f048199c1decec0b2cf57259",
    "title": "2019-11-22 - Trickbot Updates Password Grabber Module",
    "authors": "",
    "file_creation_date": "2022-05-27T23:29:22Z",
    "file_modification_date": "2022-05-27T23:29:22Z",
    "file_size": 12550023,
    "plain_text": "# Trickbot Updates Password Grabber Module\n\n**[unit42.paloaltonetworks.com/trickbot-updates-password-grabber-module/](https://unit42.paloaltonetworks.com/trickbot-updates-password-grabber-module/)**\n\nBrad Duncan November 22, 2019\n\nBy [Brad Duncan](https://unit42.paloaltonetworks.com/author/bduncan/)\n\nNovember 22, 2019 at 12:25 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [password stealer,](https://unit42.paloaltonetworks.com/tag/password-stealer/) [Trickbot](https://unit42.paloaltonetworks.com/tag/trickbot/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/trickbot-updates-password-grabber-module/)\n\nFirst seen in 2016, Trickbot is malware that steals system information, login credentials, and\nother sensitive data from vulnerable Windows hosts. Trickbot is a modular malware, and one\nof its modules is a password grabber. In November 2019, we started seeing indicators of\nTrickbot's password grabber targeting data from OpenSSH and OpenVPN applications.\n\n## Trickbot Modules\n\nA Windows host infected with Trickbot downloads different modules to perform various\nfunctions. These modules are stored as encrypted binaries in a folder located under the\ninfected user’s AppData\\Roaming directory. The encrypted binaries are decoded as DLL\nfiles and run from system memory. Figure 1 shows encoded Trickbot modules generated by\n[a recent Trickbot infection on a 64-bit Windows 7 host from Friday November 8th, 2019.](https://www.malware-traffic-analysis.net/2019/11/08/index.html)\n\n\n-----\n\n_Figure 1. Modules from a Trickbot infection on November 8th, 2019._\n\n### Password Grabber Module\n\nAs seen in Figure 1, one of the modules is named pwgrab64. This is a password grabber\nused by Trickbot. This module retrieves login credentials stored in a victim's browser cache,\nand it also obtains login credentials from other applications installed on a victim’s host. The\npassword grabber and some other Trickbot modules send stolen data using unencrypted\nHTTP over TCP port 8082 to an IP address used by Trickbot. For example, Figure 2 shows\ninformation from a packet capture (pcap) of traffic generated by a host infected with Trickbot.\nIt highlights an example of login credentials stolen from an infected user’s Chrome browser\ncache. Note how the URL in the HTTP POST request ends with the number 81. This number\nis used in URLs generated by Trickbot's password grabber module.\n\n\n-----\n\n_Figure 2. Login credentials stolen from an infected user’s Chrome browser cache._\n\n### Updates to Password Grabber\n\nTraffic patterns from recent Trickbot infections had been fairly consistent until early\nNovember 2019, when we started seeing two new HTTP POST requests caused by the\npassword grabber. They are identified as:\n\nOpenSSH private keys\nOpenVPN passwords and configsls\n\nFor the OpenVPN line, configsls might be a misspelling of configs. Figure 3 and Figure 4\nshow examples of HTTP POST requests that contain these identifiers.\n\n\n-----\n\n_Figure 3. HTTP POST request caused by Trickbot's password grabber for OpenSSH private_\n_keys._\n\n_Figure 4. HTTP POST request caused by Trickbot's password grabber for OpenVPN_\n_passwords and configurations._\n\n\n-----\n\n### Are These Updates Broken?\n\nThese updates to Trickbot's password grabber module may not be fully functional. HTTP\nPOST requests caused by the password grabber for OpenSSH and OpenVPN occur whether\nor not the victim's host has OpenSSH or OpenVPN installed. And we have not seen this\ntraffic contain any actual data.\n\nWe generated Trickbot infections in lab environments for both Windows 7 and Windows 10\nhosts with configured OpenSSH and OpenVPN applications. However, we have not seen\nany working results. HTTP POST requests generated by the password grabber for OpenSSH\nand OpenVPN during these infections contained no data.\n\nHowever, Trickbot’s password grabber works will grab SSH passwords and private keys from\n[an SSH/Telnet client named PuTTY. Figure 5 and Figure 6 shows password grabber activity](https://www.chiark.greenend.org.uk/~sgtatham/putty/)\nfrom a Trickbot-infected host with PuTTY installed and configured to use a private key for an\nSSH connection to a cloud server.\n\n\n-----\n\n_Figure 5. HTTP POST request caused by Trickbot's password grabber for PuTTY_\n_passwords._\n\n\n-----\n\n_Figure 6. HTTP POST request caused by Trickbot's password grabber for private keys used_\n_by PuTTY._\n\n## Conclusion\n\nThis blog post documents recent changes in Trickbot traffic patterns that indicate updates to\nits password grabber module. These updates appear to target data from OpenSSH and\nOpenVPN applications, but this functionality does not appear to work. Regardless, Trickbot's\n\n\n-----\n\npassword grabber will grab sensitive data like private keys from SSH-related applications like\nPuTTY.\n\nThese updated traffic patterns demonstrate Trickbot continues to evolve. However, best\nsecurity practices like running fully-patched and up-to-date versions of Microsoft Windows\nwill hinder or stop Trickbot infections. Palo Alto Networks customers are further protected\n[from Trickbot by our threat prevention platform. AutoFocus users can track Trickbot activity](https://www.paloaltonetworks.com/cortex/autofocus)\nby using the [Trickbot tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.TrickBot)\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-22 - Trickbot Updates Password Grabber Module.pdf"
    ],
    "report_names": [
        "2019-11-22 - Trickbot Updates Password Grabber Module.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536035,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653694162,
    "ts_modification_date": 1653694162,
    "files": {
        "pdf": "https://archive.orkl.eu/c140607bdccb7499f048199c1decec0b2cf57259.pdf",
        "text": "https://archive.orkl.eu/c140607bdccb7499f048199c1decec0b2cf57259.txt",
        "img": "https://archive.orkl.eu/c140607bdccb7499f048199c1decec0b2cf57259.jpg"
    }
}