{
    "id": "b7152d6c-7ebc-4627-8229-5572418c3080",
    "created_at": "2023-01-12T15:09:17.703203Z",
    "updated_at": "2025-03-27T02:06:11.175583Z",
    "deleted_at": null,
    "sha1_hash": "c82f1b8cae40a9ceac33dd8fa1ec3c1069b75577",
    "title": "2017-01-17 - New GhostAdmin Malware Used for Data Theft and Exfiltration",
    "authors": "",
    "file_creation_date": "2022-05-27T22:38:41Z",
    "file_modification_date": "2022-05-27T22:38:41Z",
    "file_size": 715832,
    "plain_text": "# New GhostAdmin Malware Used for Data Theft and Exfiltration\n\n**[bleepingcomputer.com/news/security/new-ghostadmin-malware-used-for-data-theft-and-exfiltration/](https://www.bleepingcomputer.com/news/security/new-ghostadmin-malware-used-for-data-theft-and-exfiltration/)**\n\nCatalin Cimpanu\n\nBy\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nJanuary 17, 2017\n02:00 PM\n0\n\n[Security researcher MalwareHunterTeam discovered today a new malware family that can](https://twitter.com/malwrhunterteam)\ninfect computers and allow crooks to take control of these PCs using commands sent via an\nIRC channel.\n\nNamed GhostAdmin, this threat is part of the \"botnet malware\" category. According to\ncurrent information, the malware is already distributed and deployed in live attacks, being\nused to possibly target at least two companies and steal hundreds of GBs of information.\n\n## Crooks control GhostAdmin victims via IRC commands\n\nAccording to MalwareHunterTeam and other researchers that have looked at the malware's\nsource code, GhostAdmin seems to be a reworked version of CrimeScene, another botnet\nmalware family that was active around 3-4 years ago.\n\nUnder the hood, GhostAdmin is written in C# and is already at version 2.0. The malware\nworks by infecting computers, gaining boot persistence, and establishing a communications\nchannel with its command and control (C&C) server, which is an IRC channel.\n\n\n-----\n\nGhostAdmin s authors access to this IRC channel and issue commands that will be picked\nup by all connected bots (infected computers).\n\nThe malware can interact with the victim's filesystem, browse to specific URLs, download\nand execute new files, take screenshots, record audio, enable remote desktop connections,\nexfiltrate data, delete log files, interact with local databases, wipe browsing history and\nmore. A full list of available commands is available via the image below:\n\n**GhostAdmin IRC commands**\nThe malware's features revolve around the ability to collect data from infected computers\nand silently send it to a remote server.\n\nGhostAdmin operates based on a configuration file. Among the settings stored in this file,\nthere are FTP and email credentials.\n\nThe FTP credentials are for the server where all the stolen information is uploaded, such as\nscreenshots, audio recordings, keystrokes and more.\n\nOn the other hand, the email credentials are used to send an email to the GhostAdmin\nauthor every time a victim executes his malware, and also send error reports.\n\n\n-----\n\n**GhostAdmin source code: Function to send an email when infecting new host**\n\n**GhostAdmin source code: Function to send an email when malware execution**\n**generates an error**\n\n\n-----\n\nMalwareHunterTeam says that the GhostAdmin version he analyzed was compiled by a\nuser that used the nickname \"Jarad.\"\n\nLike almost all malware authors before him, Jarad managed to infect his own computer.\nUsing the FTP credentials found in the malware's configuration file, MalwareHunterTeam\nfound screenshots of GhostAdmin creator's desktop on the FTP server.\n\n**Desktop of GhostAdmin author**\nFurthermore, the researcher also found on the same server files that appeared to be stolen\nfrom GhostAdmin victims. The possible victims include a lottery company and an Internet\ncafe. Just from the Internet cafe, the crook has apparently collected 368GB of data alone.\n\n\n-----\n\n**368GB file downloaded from GhostAdmin FTP server**\nFrom the lottery company, the GhostAdmin botmaster appears to have stolen a database\nholding information such as names, dates of births, phone numbers, emails, addresses,\nemployer information, and more.\n\n**Database found on the GhostAdmin FTP server**\n\n\n-----\n\nAt the time of writing, according to MalwareHunterTeam, the botnet s IRC channel includes\nonly around ten bots, an approximate victims headcount.\n\nCompared to other botnet malware families such as Necurs or Andromeda, which have\nmillions of bots, GhostAdmin is just making its first victims. Despite the currently low\nnumbers, GhostAdmin can grow to those figures as well, if its author ever wanted to run a\nspam botnet like Necurs and Andromeda. In its current form, GhostAdmin and its botmaster\nseem to be focused on data theft and exfiltration.\n\nAt the time of writing, GhostAdmin detection rate on VirusTotal was only 6 out of 55 (sample\nhere).\n\n### Related Articles:\n\n[Microsoft detects massive surge in Linux XorDDoS malware activity](https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/)\n\n[Microsoft: Sysrv botnet targets Windows, Linux servers with new exploits](https://www.bleepingcomputer.com/news/security/microsoft-sysrv-botnet-targets-windows-linux-servers-with-new-exploits/)\n\n[New cryptomining malware builds an army of Windows, Linux bots](https://www.bleepingcomputer.com/news/security/new-cryptomining-malware-builds-an-army-of-windows-linux-bots/)\n\n[Emotet botnet switches to 64-bit modules, increases activity](https://www.bleepingcomputer.com/news/security/emotet-botnet-switches-to-64-bit-modules-increases-activity/)\n\n[New stealthy BotenaGo malware variant targets DVR devices](https://www.bleepingcomputer.com/news/security/new-stealthy-botenago-malware-variant-targets-dvr-devices/)\n\n[Botnet](https://www.bleepingcomputer.com/tag/botnet/)\n[GhostAdmin](https://www.bleepingcomputer.com/tag/ghostadmin/)\n[Malware](https://www.bleepingcomputer.com/tag/malware/)\n\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nCatalin Cimpanu is the Security News Editor for Bleeping Computer, where he covers topics\nsuch as malware, breaches, vulnerabilities, exploits, hacking news, the Dark Web, and a\nfew more. Catalin previously covered Web & Security news for Softpedia between May\n2015 and October 2016. The easiest way to reach Catalin is via his XMPP/Jabber address\nat campuscodi@xmpp.is. For other contact methods, please visit Catalin's author page.\n\n[Previous Article](https://www.bleepingcomputer.com/news/software/opera-presto-source-code-leaks-online/)\n[Next Article](https://www.bleepingcomputer.com/news/security/locky-ransomware-activity-goes-down-by-81-percent/)\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-17 - New GhostAdmin Malware Used for Data Theft and Exfiltration.pdf"
    ],
    "report_names": [
        "2017-01-17 - New GhostAdmin Malware Used for Data Theft and Exfiltration.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536157,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653691121,
    "ts_modification_date": 1653691121,
    "files": {
        "pdf": "https://archive.orkl.eu/c82f1b8cae40a9ceac33dd8fa1ec3c1069b75577.pdf",
        "text": "https://archive.orkl.eu/c82f1b8cae40a9ceac33dd8fa1ec3c1069b75577.txt",
        "img": "https://archive.orkl.eu/c82f1b8cae40a9ceac33dd8fa1ec3c1069b75577.jpg"
    }
}