{
    "id": "b732eb15-4951-420b-992e-89ca9f80b9c3",
    "created_at": "2023-01-12T15:05:21.664743Z",
    "updated_at": "2025-03-27T02:16:34.776186Z",
    "deleted_at": null,
    "sha1_hash": "1a0b498eb4613abee38171d6a4881190bbdc32cc",
    "title": "2020-12-14 - Dark Halo Leverages SolarWinds Compromise to Breach Organizations",
    "authors": "",
    "file_creation_date": "2022-05-27T22:15:50Z",
    "file_modification_date": "2022-05-27T22:15:50Z",
    "file_size": 848740,
    "plain_text": "# Dark Halo Leverages SolarWinds Compromise to Breach Organizations\n\n**[volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/](https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/)**\n\nDecember 14, 2020\n\nby Damien Cash, Matthew Meltzer, Sean Koessel, Steven Adair, Thomas Lancaster, Volexity\nThreat Research\n\nVolexity is releasing additional research and indicators associated with compromises\nimpacting customers of the SolarWinds Orion software platform. Volexity has also published\na guide for responding to the SolarWinds breach, and how to detect, prevent, and remediate\nthis supply chain attack.\n[On Sunday, December 13, 2020, FireEye released a blog detailing an alleged compromise to](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)\nthe company SolarWinds. This compromise involved a backdoor being distributed through an\nupdate to SolarWind's Orion software product. FireEye attributed this activity to an unknown\nthreat actor it tracks as UNC2452. Volexity has subsequently been able to tie these attacks\nto multiple incidents it worked in late 2019 and 2020 at a US-based think tank. Volexity tracks\nthis threat actor under the name Dark Halo.\n\nAt one particular think tank, Volexity worked three separate incidents involving Dark Halo. In\nthe initial incident, Volexity found multiple tools, backdoors, and malware implants that had\nallowed the attacker to remain undetected for several years. After being extricated from the\n\n\n-----\n\nnetwork, Dark Halo then returned a second time, exploiting a vulnerability in the\n[organization's Microsoft Exchange Control Panel. Near the end of this incident, Volexity](https://www.volexity.com/blog/2020/03/06/microsoft-exchange-control-panel-ecp-vulnerability-cve-2020-0688-exploited/)\nobserved the threat actor using a novel technique to bypass Duo multi-factor authentication\n(MFA) to access the mailbox of a user via the organization's Outlook Web App (OWA)\nservice. Finally, in a third incident, Dark Halo breached the organization by way of its\nSolarWinds Orion software in June and July 2020.\n\nThe primary goal of the Dark Halo threat actor was to obtain the e-mails of specific\nindividuals at the think tank. This included a handful of select executives, policy experts, and\nthe IT staff at the organization. Volexity notes its investigations are directly related to the\nFireEye report based on overlap between command-and-control (C2) domains and other\nrelated indicators such as a backdoored server running SolarWinds Orion.\n\n## Major Incidents\n\nVolexity has worked three major incidents involving the Dark Halo threat actor. In most\ncases, the actor aimed to live off the land, primarily focusing on weekly operations to extract\ne-mail messages from the organization. Dark Halo did use malware and red-teaming tools\nbut largely only for specific one-time tasks as a fallback mechanism when other avenues of\naccess were cut off. For the purposes of this write-up, Volexity will share novel and useful\ninformation from the second and third incidents. The second incident involved a\nsophisticated way to obtain unauthorized access to an account via OWA that had MFA\nprotection in place. The third incident involved a breach by way of the SolarWinds Orion\nplatform.\n\n### Bypassing Multi-Factor Authentication\n\nToward the end of the second incident that Volexity worked involving Dark Halo, the actor\nwas observed accessing the e-mail account of a user via OWA. This was unexpected for a\nfew reasons, not least of which was the targeted mailbox was protected by MFA. Logs from\nthe Exchange server showed that the attacker provided username and password\nauthentication like normal but were not challenged for a second factor through Duo. The logs\nfrom the Duo authentication server further showed that no attempts had been made to log\ninto the account in question. Volexity was able to confirm that session hijacking was not\ninvolved and, through a memory dump of the OWA server, could also confirm that the\nattacker had presented cookie tied to a Duo MFA session named duo-sid.\n\nVolexity's investigation into this incident determined the attacker had accessed the Duo\nintegration secret key (akey) from the OWA server. This key then allowed the attacker to\nderive a pre-computed value to be set in the duo-sid cookie. After successful password\nauthentication, the server evaluated the duo-sid cookie and determined it to be valid. This\nallowed the attacker with knowledge of a user account and password to then completely\nbypass the MFA set on the account. It should be noted this is not a vulnerability with the MFA\nprovider and underscores the need to ensure that all secrets associated with key\n\n\n-----\n\nintegrations, such as those with an MFA provider, should be changed following a breach.\nFurther, it is important that not only are passwords changed after a breach, but that\npasswords are not set to something similar to the previous password (e.g., Summer2020!\nversus Spring2020! or SillyGoo$e3 versus SillyGoo$e2).\n\n### SolarWinds\n\nIn the third incident, which took place in July 2020, Volexity identified suspicious\nadministrative commands and ActiveSync anomalies in the organization's Exchange\nenvironment. Further review of the organization's endpoint software and network traffic\nconfirmed a breach. The attacker had executed commands to export e-mail for specific users\nin the organization, and then exfiltrated the data via the organization's Outlook Web\nAnywhere (OWA) server.\n\nMany of the technical details regarding the malware used are covered in the FireEye\nnotification. However, in this blog, Volexity can share examples of command-line actions the\nattacker took after gaining access to the target network and provide insight into additional\ntools, infrastructure, and attacker objectives.\n\n**Reconnaissance**\n\nThe attacker was quite adept with Exchange and immediately listed various organization\nconfiguration settings via PowerShell. Below are a few of the operations that the attacker\nexecuted.\n\nGet a list of users on the Exchange server and their current role using GetManagementRoleAssignment:\n\nC:\\Windows\\system32\\cmd.exe /C powershell.exe -PSConsoleFile exshell.psc1 Command \"Get-ManagementRoleAssignment -GetEffectiveUsers | select\nName,Role,EffectiveUserName,AssignmentMethod,IsValid | ConvertTo-Csv NoTypeInformation | % {$_ -replace '`n','_'} | Out-File C:\\temp\\1.xml\"\n\nRetrieve information about the configured Virtual Directory using GetWebServicesVirtualDirectory:\n\nC:\\Windows\\system32\\cmd.exe /C powershell.exe -PSConsoleFile exshell.psc1 Command \"Get-WebServicesVirtualDirectory | Format-List\"\n\nThe attacker also made use of a file called sqlceip.exe, which upon first glance might appear\nas the legitimate version of SQL Server Telemetry Client provided by Microsoft. However,\nVolexity determined this tool was actually a version of AdFind from joeware.net. AdFind is a\ncommand-line tool used for querying and extracting data from Active Directory. During the\ncourse of its investigations, Volexity discovered the attacker using AdFind with the following\ncommand line:\n\n\n-----\n\nC:\\Windows\\system32\\cmd.exe /C sqlceip.exe -default -f (name= Organization\nManagement\") member -list | sqlceip.exe -f objectcategory=* > .\\SettingSync\\log2.txt\n\n**Lateral Movement**\n\nThe attacker used PowerShell to create new tasks on remote machines:\n\n$scheduler = New-Object -ComObject\n(\"Schedule.Service\");$scheduler.Connect($env:COMPUTERNAME);$folder =\n$scheduler.GetFolder(\"\\Microsoft\\Windows\\SoftwareProtectionPlatform\");$task =\n$folder.GetTask(\"EventCacheManager\");$definition =\n$task.Definition;$definition.Settings.ExecutionTimeLimit =\n\"PT0S\";$folder.RegisterTaskDefinition($task.Name,$definition,6,\"System\",$null,5);echo\n\"Done\"\n\nThey also attempted this on a number of machines using schtasks.exe directly. For example:\n\nC:\\Windows\\system32\\cmd.exe /C schtasks /create /F /tn\n\"\\Microsoft\\Windows\\SoftwareProtectionPlatform\\EventCacheManager\" /tr\n\"C:\\Windows\\SoftwareDistribution\\EventCacheManager.exe\" /sc ONSTART /ru system\n/S [machine_name]\n\n**Exfiltration**\n\nThe attacker exfiltrated e-mail data from targeted accounts using the NewMailboxExportRequest command followed by Get-MailboxExport-Request command. In this\ncase, the attacker was only interested in mail received this year.\n\nC:\\Windows\\system32\\cmd.exe /C powershell.exe -PSConsoleFile exshell.psc1 [Command \"New-MailboxExportRequest -Mailbox [email protected] -ContentFilter](https://www.volexity.com/cdn-cgi/l/email-protection)\n{(Received -ge '03/01/2020')} -FilePath '\\\\<MAILSERVER>\\c$\\temp\\b.pst'\"\n\nThe attacker created password-protected archives on the victims' OWA server so that they\ncould be exfiltrated via a simple HTTP request.\n\nC:\\Windows\\system32\\cmd.exe /C .\\7z.exe a -mx9 -r0 -p[33_char_password]\n\"C:\\Program Files\\Microsoft\\Exchange\nServer\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\Redir.png\" C:\\Temp\\b.pst\n\nAn example URL for the attacker to collect the exfiltrated data would be:\n\nhttps://owa.organization.here/owa/auth/Redir.png\n\nOn disk, this was located at the following path:\n\n\\Program Files\\Microsoft\\Exchange Server\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\\n\n\n-----\n\nVolexity also saw the attacker stage other exfiltration in another folder on the server located\nhere:\n\n\\Program Files\\Microsoft\\Exchange\nServer\\V15\\FrontEnd\\HttpProxy\\owa\\auth\\Current\\themes\\resources\\\n\nFinally, the attacker added their own devices as allowed IDs for active sync for a number of\n[mailboxes using Set-CASMailbox:](https://docs.microsoft.com/en-us/powershell/module/exchange/set-casmailbox?view=exchange-ps)\n\nC:\\Windows\\system32\\cmd.exe /C powershell.exe -PSConsoleFile exshell.psc1 Command \"Set-CASMailbox -Identity <UserID> -ActiveSyncAllowedDeviceIDs\n@{add='XXXXXXXXXXXXX'}\"\n\n**Attacker Cleanup**\n\nAfter successfully exporting mail they wished to steal, the attacker would remove the\n[evidence of the export request using Remove-MailboxExportRequest:](https://docs.microsoft.com/en-us/powershell/module/exchange/remove-mailboxexportrequest?view=exchange-ps)\n\nC:\\Windows\\system32\\cmd.exe /C powershell.exe -PSConsoleFile exshell.psc1 [Command \"Get-MailboxExportRequest -Mailbox [email protected] | Remove-](https://www.volexity.com/cdn-cgi/l/email-protection)\nMailboxExportRequest -Confirm:$False\"\n\n### Attacker Infrastructure\n\nDuring the July 2020 incident, Volexity observed at least two indicators that overlapped with\nindicators of compromise posted by FireEye. The organization's SolarWinds server\nconducted DGA-style DNS queries under the following subdomain:\n\nappsync-api.us-west-2.avsvmcloud[.]com\n\nThe vast majority of queries were met with SERVFAIL responses. In most other cases, the\nhostnames resolved to IPs that fell in the ranges 184.72.0.0/16, 20.141.48.0/24,\n8.18.144.0/24, and 8.18.145.0/24. However, the critical responses to the organization came\nby way of CNAME responses that occurred between June 30, 2020, and July 16, 2020.\nThese DNS resolutions returned a CNAME for the domain freescanonline[.]com. In late\nJuly, the attacker took advantage of their access and started moving laterally throughout the\norganization, which will be described a bit later. Most notably the attacker pushed malware to\nother systems that beaconed back to the following additional infrastructure:\n\nlcomputers[.]com\n\nwebcodez[.]com\n\nAt the time of the incident (July 2020), the attacker had accidentally configured their servers\nto be open to the Internet, accepting arbitrary requests on port 80. Since then, the attacker\nhas fixed this issue; however, at the time, Volexity was able to identify a number of C2\n\n\n-----\n\naddresses based on server profiling.\n\nSpecifically, at the time there were only a handful of servers that responded with the\nfollowing HTTP headers in the following order:\n\nTransfer-Encoding\nConnection\nServer\nX-Powered-By\nDate\n\nThe \"Server\" value also specified IIS10.0, but this header order does not match the order\nused by IIS 10.0.\n\nBased on this pattern Volexity was able to identify the following IP addresses in July 2020:\n\n13.57.184.217\n13.59.205.66\n18.217.225.111\n18.220.219.143\n3.16.81.254\n3.87.182.149\n34.219.234.134\n54.193.127.66\n54.215.192.52\n\nThese IPs hosted SSL certificates for the following domains:\n\ndeftsecurity[.]com\ndigitalcollege[.]org\nfreescanonline[.]com\nglobalnetworkissues[.]com\nkubecloud[.]com\nseobundlekit[.]com\nsolartrackingsystem[.]net\nthedoccloud[.]com\nvirtualwebdata[.]com\n\nNotably, some of these domains were set up prior to the earlier known compromise date\npublished by FireEye, such as solartrackingsystem[.]net, which was assigned its current\nnameserver in January 2020. Several of the domains also have very long registration\nhistories going back several years. Volexity believes that attacker obtained these domains\nthrough auctions or from registrants after they expired but before they were deleted. This\nallowed the attacker to use domains with a long history and avoid being detected based on\ndetections tied to a domain being newly registered\n\n\n-----\n\n## Conclusion\n\nAt the time of the investigation, Volexity deduced that the likely infection was the result of the\nSolarWinds box on the target network; however, it was not fully understood exactly how the\nbreach occurred (i.e., whether there was some unknown exploit in play, or other means of\naccess), therefore Volexity was not in a position to report the circumstances surrounding the\nbreach to SolarWinds. The machines involved in this incident had been rebooted several\ntimes prior to Volexity's involvement in incident response efforts, meaning that a great deal of\nevidence that would have been in volatile memory had been lost.\n\nVolexity believes that Dark Halo is a sophisticated threat actor based on the following\ncharacteristics of their attacks:\n\nGenerally, the attacker displayed a reasonable level of operational security throughout\nthe attack, taking steps to wipe logs for various services used and to remove evidence\nof their commands from infected systems.\nThe server profile used to identify the C2 domains was only visible for a snapshot in\ntime, where the attacker likely became aware that their C2 addresses could be\nidentified in this way, they went on to secure their C2 servers further.\nDespite an ongoing campaign lasting one year, very few files related to this attacker\nhave made their way to VirusTotal.\n\nDuring the investigation Volexity discovered no hints as to the attacker's origin or any links to\nany publicly known threat actor.\n\nTo protect against these attacks, Volexity recommends the following:\n\nLook for traffic to any of the related malicious domains identified in Appendix A.\nFollow the [advice from SolarWinds in their response to this incident.](https://www.solarwinds.com/securityadvisory)\nUse the [signatures provided by FireEye to identify related activity.](https://github.com/fireeye/sunburst_countermeasures/)\nEnsure that all secret keys associated with MFA or other sensitive integrations are\nreset following a breach.\nMake sure all credentials in an organization, including service accounts, are reset\nfollowing a breach and that default passwords or those similar to previous passwords\nare not used.\nIf you run an on-premise Exchange environment, consider adding alerting mechanisms\nto any EDR solutions for processes using the Exchange Management Shell PowerShell\ncmdlets listed in Appendix B. This may or may not be a valid detection approach\ndepending on how frequently this is used within your organization.\nMore generally, if the Exchange Management Shell is rarely used in a legitimate\nAdministrative context, it may be worth investigating any historical use of this shell.\n\n## Appendix A - IP and Domain IOCs\n\n\n-----\n\n13.57.184.217\n13.59.205.66\n18.217.225.111\n18.220.219.143\n196.203.11.89\n3.16.81.254\n3.87.182.149\n3.87.182.149\n34.219.234.134\n54.193.127.66\n54.215.192.52\navsvmcloud[.]com\ndeftsecurity[.]com\ndigitalcollege[.]org\nfreescanonline[.]com\nglobalnetworkissues[.]com\nkubecloud[.]com\nlcomputers[.]com\nseobundlekit[.]com\nsolartrackingsystem[.]net\nthedoccloud[.]com\nvirtualwebdata[.]com\nwebcodez[.]com\n\n## Appendix B - Exchange Management Shell Powershell cmdlets\n\n\n-----\n\nGet-AcceptedDomain\n\nGet-CASMailbox\n\nGet-Mailbox\n\nGet-ManagementRoleAssignment\n\nGet-OrganizationConfig\n\nGet-OwaVirtualDirectory\n\nGet-Process\n\nGet-WebServicesVirtualDirectory\n\nNew-MailboxExportRequest\n\nRemove-MailboxExportRequest\n\nSet-CASMailbox\n\n## Appendix C - DGA Domain Resolutions\n\n\n-----\n\n184.72.1.3\n184.72.101.22\n184.72.113.55\n184.72.145.34\n184.72.209.33\n184.72.21.54\n184.72.212.52\n184.72.224.3\n184.72.229.1\n184.72.240.3\n184.72.245.1\n184.72.48.22\n20.141.48.154\n8.18.144.11\n8.18.144.12\n8.18.144.130\n8.18.144.135\n8.18.144.136\n8.18.144.149\n8.18.144.156\n8.18.144.158\n8.18.144.165\n8.18.144.170\n8.18.144.180\n8.18.144.188\n8.18.144.20\n8.18.144.40\n8.18.144.44\n8.18.144.62\n8.18.144.9\n8.18.145.131\n8.18.145.134\n8.18.145.136\n8.18.145.139\n8.18.145.150\n8.18.145.157\n8.18.145.181\n8.18.145.21\n8.18.145.3\n8.18.145.33\n8.18.145.36\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-14 - Dark Halo Leverages SolarWinds Compromise to Breach Organizations.pdf"
    ],
    "report_names": [
        "2020-12-14 - Dark Halo Leverages SolarWinds Compromise to Breach Organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535921,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653689750,
    "ts_modification_date": 1653689750,
    "files": {
        "pdf": "https://archive.orkl.eu/1a0b498eb4613abee38171d6a4881190bbdc32cc.pdf",
        "text": "https://archive.orkl.eu/1a0b498eb4613abee38171d6a4881190bbdc32cc.txt",
        "img": "https://archive.orkl.eu/1a0b498eb4613abee38171d6a4881190bbdc32cc.jpg"
    }
}