{
    "id": "b735a4f1-7e5f-49a3-8b56-9ef1cd9b716c",
    "created_at": "2022-10-25T16:48:10.787684Z",
    "updated_at": "2025-03-27T02:17:23.281546Z",
    "deleted_at": null,
    "sha1_hash": "fda2269c57aa0ef18a92be81641da06ea6132652",
    "title": "Dissecting Operation Troy: Cyberespionage in South Korea White Paper",
    "authors": "",
    "file_creation_date": "2018-05-03T10:57:54Z",
    "file_modification_date": "2018-05-03T10:59:49Z",
    "file_size": 1183823,
    "plain_text": "# Dissecting Operation Troy: Cyberespionage in South Korea\n\n#### By Ryan Sherstobitoff and Itai Liba, McAfee[®] Labs  and James Walter, Office of the CTO\n\n\n-----\n\n### Table of Contents\n\n##### 3 Executive Summary 3 Attack Timeline 4 State Sponsorship or Cyberterrorism? 4 The adversaries 5 The Analysis 5 The Malware 6 The dropper Trojan 6 MBR wiper 6 The remote-access Trojan 7 Linking to the Attackers 8 Code Analysis 9 Revealing “Operation Troy” 9 Persistent espionage campaign in South  Korea: 2009–2013 10 Tools and tactics\n\n\n##### 17 Military Espionage Malware: 2009–2013 18 The encrypted network 20 Data exfiltration 21 The DLL relationship 24 Relationships to Http Dr0pper 24 Destroying the target 25 The campaigns 26 Conclusion 26 About the Authors 26 About McAfee Labs 27 About McAfee\n\n\n-----\n\n## Dissecting Operation Troy:  Cyberespionage in South Korea\n\n#### Executive Summary\n\n South Korea was hit by a major cyberattack on March 20, 2013, at 2:00 pm local time. This cyberattack caused a significant amount of damage to the affected organizations by wiping the hard drives of tens of thousands of computers.\n\n McAfee[®] Labs research provides further insight into the likely source of these attacks. Though not definitive, our analysis provides a much clearer picture. The research also indicates that there may have been two distinct groups, attacking different targets.\n\n Our analysis of this attack—known first as Dark Seoul and now as Operation Troy—has revealed that in addition to the data losses of the master boot record (MBR) wiping, the incident was more than cybervandalism. The attacks on South Korean targets were actually the conclusion of a covert espionage campaign.\n\n\n###### Attack Timeline\n\nOur analysis suggests the following order of these attacks.\nLater in this report we mention other elements that color\nour view of this event, but consistent throughout is our\nbelief that the attackers had access to the environments\nprior to launching the wiping component.\n\nMarch 20 attack against banks and news agencies in\nSouth Korea:\n\n1. The remote-access Trojan was compiled January 26,\n2013\n\n\n2. The component to wipe the master boot record (MBR)\n\nof numerous systems was compiled January 31.\n\n3. An initial victim within the organization was spear-phished\n\nwith the remote-access Trojan. This likely occurred before\nMarch 20 and possibly weeks prior to the attack.\n\n4. The dropper was compiled March 20, hours before\n\nthe attack occurred.\n\n5. The dropper was distributed to systems across the\nvictim organizations, and, within minutes of execution,\nthe MBRs were wiped. This occurred around 2:00 pm\n\n\nConnect With Us\n\n\n-----\n\n###### State Sponsorship or Cyberterrorism?\n\nWho conducted these attacks is still unclear, but our\nresearch gives some further insight into the likely source.\nThe clues left behind confirm that the two groups\nclaiming responsibility were a fabrication to throw\ninvestigators off the trail and to mask the true source.\n\n###### The adversaries\n\nThe two groups that appear to have been involved in the\nattacks have had no prior connection until now.\n\n- **NewRomanic Cyber Army Team: The samples**\nconnected to this group are more convincing. The\nmajority of the wipers (found in the wild and retrieved\nfrom infected systems through other sources) contain\nthe strings “principes” and “hastati,” which also appear\nin a message left on one of the targeted websites in\nthe form of a web pop-up. The wiper component also\noverwrote the MBR with one of these strings. The\nfollowing data points support this fact:\n\n−−The strings “principes”[1] and “hastati”[2] were found\n\nwithin the code of some of the wiper components.\nThe same strings were also found in the web popup message that was left on the Nocut News Korea\nwebsite. The strings are ancient Roman terms\nthat make reference to military units, hence a\n“cyberarmy.” The pop-up even states some of the\nspecific units that were part of hastati which were\ninvolved in this attack.\n\n−−The remote-access Trojan that was found had a\n\nbuild path that included the reference “Make Troy,”\na subdirectory of the folder “Work.” Troy[3] refers to an\n\n\nancient Roman region, again connecting the Roman\nreferences to this group, which consistently uses\nthis theme.\n\n- **The Whois Hacking Team: On March 20, the website of**\n\nthe network provider LG +U was defaced by this group.\nWas it a coincidence that a second group was involved?\nAll of the evidence indicates that they had a strong\ninvolvement, but there is no solid link to the group\nbecause it did not claim involvement in the attacks.\nHowever, we do have the circumstantial link of a wiper\ncomponent that in practice operated differently from\nthe wipers employed by the NewRomanic Cyber Army\nyet also appears to be essentially the same wiper. The\nWhois Hacking Team MBR wiper component includes\nthe same graphics (in a resource file in the binary) that\nappeared on the defaced LG +U website, although\nthe malware did not behave the same way. Within the\nmain executable file, however, we discovered a small\nportion of the code that matched the structure of that\nof the NewRomanic Cyber Army wipers we found, so\nthe Whois Team likely dropped the same wiper.\n\nState sponsored or not, these attacks were crippling\nnonetheless. The overall tactics were not that\nsophisticated in comparison to what we have seen\nbefore. The trend seems to be moving toward using the\nfollowing techniques against targets:\n\n- Stealing and holding data hostage and announcing the\ntheft—public news media have reported only that tens\nof thousands of computers had their MBRs wiped by\nthe malware. But there is more to this story. The main\ngroup behind the attack claims that a vast amount of\n\n\n-----\n\npersonal information has been stolen. This type of tactic\nis consistent with Anonymous operations and others\nthat fall within the hacktivist category, in which they\nannounce and leak portions of confidential information.\n\n- Wiping the MBR to render systems unusable, creating\nan instant slowdown to operations within the target\n\n###### The Analysis\n\nWhat were the motives behind these attacks, and why\ndid the attackers chose certain targets? The attacks\nmanaged to create a significant disruption of ATM\nnetworks while denying access to funds. This wasn’t the\nfirst time that this type of attack—in which destructive\nmalware wiped the systems belonging to a financial\ninstitution—has occurred in South Korea. In 2011,\nthe same financial institution was hit with destructive\nmalware that caused a Denial-of-Service.\n\nThe attackers left a calling card a day after the attacks\nin the form of a web pop-up message claiming that the\nNewRomanic Cyber Army Team was responsible and\nhad leaked private information from several banks and\nmedia companies.\n\nThey also referenced destroying the data on a large number\nof machines (the MBR wiping) and left a message in the web\npop-up identifying the group behind the attacks. The page\ntitle in Internet Explorer was “Hey, Everybody in Korea????”\n\n“Hi, Dear Friends, We are very happy to inform you the\nfollowing news. We, NewRomanic Cyber Army Team,\nverified our #OPFuckKorea2003. We have now a great\ndeal of personal information in our hands. Those\n\n\nincludes; 2.49M member table data, cms_info\nmore than 50M from . Much information from\n. We destroyed more than 0.18M of PCs. Many\nauth Hope you are lucky. 11th, 12th, 13th, 21st, 23rd and\n27th HASTATI Detachment. Part of PRINCIPES Elements.\np.s For more information, please visit www.dropbox.\ncom login with joseph.r.ulatoski@gmail.com::lqaz@\nWSX3edc$RFV. Please also visit pastebin.com.”\n\n###### The Malware\n\nA few types of malware were involved in these attacks.\nEach variant had a particular use. Some public reports\nmentioned only the use of the wiper component. However,\nthere were actually three components, all with a different\npurpose, that assisted the attackers in the campaign.\n\n**Component** **Purpose** **File Size** **Compile Date**\n\nDropper Trojan Installs the MBR 418 Kb March 20, 2013\nwiper\n\nMBR Wiper Wipes the MBR of 24 Kb January 31, 2013\nthe disk\n\nRemote-Access Provides backdoor 46 Kb January 26, 2013\nTrojan access to attackers\n\nTable 1. Elements of the attack on South Korean targets.\n\nThere were two subsequent aspects to this attack:\n\n- The destruction of PCs using the MBR wiper\n\ncomponent, which occurred March 20.\n\n- Remote access to the targets’ environments for a\n\nperiod prior to the attack. The duration of this access\nis unknown.\n\n\n-----\n\n###### The dropper Trojan\n\nThe dropper Trojan was primarily used to download the\nexecutable that destroyed the systems’ MBRs. We suspect\nthat the dropper Trojan was distributed at the time of\nthe attacks via a compromised patch-management server\nthat pretended to run a legitimate update.\n\nThe dropper Trojan was compiled March 20, the day of\nthe attack, and several hours prior to the destruction of\nthe systems. We suspect that the attackers had access\nto the target environment prior to March 20. It is unlikely\nthat a large volume of users (some 30,000+) were spearphished on March 20 alone.\n\nIt’s likely a much earlier compromise led to the attacks\nbeing staged internally. Thus, there was an initial victim\nwhose infected system allowed the attackers to gain\naccess to other systems that let them distribute the\nmalware broadly. The initial infection certainly could\nhave come from a spear-phishing attack. The backdoor\ncomponent was compiled in late January. The attackers\ncould have been inside the networks since February.\nThis timeline is plausible given that the attackers claim\nto have stolen a vast amount of information from these\nnetworks prior to wiping the MBRs.\n\nOur further analysis led us to discover additional\ncomponents that support our conclusion:\n\n- A remote-access Trojan was discovered to have\ncompromised some of the target environments,\nspecifically an internal server used to distribute\nupdates to thousands of PCs. This Trojan variant was\ncompiled on January 26 and was detected by the\n\n\nthreat as RDN/Generic PWS.y!io. This Trojan was built\nwith the Microsoft Visual C++ Version 2.9 compiler with\na file size of 47KB.\n\n###### MBR wiper\n\nWe have seen several wiper samples to date—all were\ncompiled on January 31. The wiper itself is relatively\nsmall (24 Kb) and is introduced into the environment via\na dropper Trojan that is 418 Kb and was compiled the\nday of the attacks.\n\nUpon executing the malware, the main dropper\n(9263e40d9823aecf9388b64de34eae54) creates the\nfile AgentBase.exe, the MBR wiper component. This file\nis placed in the infected user’s application data folder,\nexecutes, and immediately starts the countdown to wipe\nthe system and render it unbootable. This file was compiled\napproximately two months prior to the attack’s taking place.\n\nThe main dropper component was compiled the day of\nthe attack, March 20, at 4:07 am Seoul time. The dropper\ninstalled the wiper, which destroyed the MBRs at around\n2:00 pm Seoul time. Once the dropper executed,\nthe systems were wiped within minutes. Thus, these\ncomponents likely weren’t distributed until the time\nwhen the attackers wished to destroy these machines.\n\n###### The remote-access Trojan\n\nIt’s not widely known that the attackers used a remoteaccess Trojan to compromise an internal server. The\nattackers used this internal server to distribute the wiper\ncomponent to the thousands of PCs. The remote-access\nTrojan had a file size of 46 Kb and was compiled on\nJanuary 26 five days before the MBR wiper was compiled\n\n\n-----\n\nAs we concluded earlier, we have determined that\nthe attackers had access to the environment prior to\nwiping the systems. The remote-access Trojan was\nlikely delivered to an internal PC via a spear-phishing\ncampaign. From this system, the attackers accessed\nother internal resources. The Trojan was designed to\noperate within Internet Explorer—it launched a hidden\ninstance of Internet Explorer and injected itself into the\nrunning process.\n\nFigure 1. The process monitor shows the remote-access Trojan\nspawning an instance of Internet Explorer.\n\nThe Trojan immediately modified the properties in the\nregistry to allow for remote connections to the system.\n\n\n###### Linking to the Attackers\n\nLinking malware to its developers isn’t always an easy\ntask. Most attackers are careful enough to ensure they\ncan’t be traced. This is especially important in cases\nsuch as cyberespionage, in which the intent is to remain\ninvisible.\n\nIn our analysis we observed a number of unique\nattributes in the components involved in these attacks.\nThese markers allowed us to link specific samples to a\nspecific group.\n\nTwo groups have taken credit for these attacks, but we\ncan tell that the variants that wiped the systems link to\nthe NewRomanic Cyber Army Team.\n\nAlthough the Whois Hacking Team is more public due\nto its defacement of the network provider LG +U’s\nwebsite, we can link this group to only one sample of a\nwiper, which operates differently than the others. The\nWhois wiper is much larger, with a file size of 236 Kb\nand was compiled March 19, whereas the other wiper\ncomponents are a mere 24 Kb. The larger size suggests\nthe Whois wiper contains more functions. Thus, we\ncan definitively link NewRomanic to the samples used\nto wipe the MBRs of systems within the South Korean\nfinancial institution networks. NewRomanic will remain\nthe prime suspect involved in the attacks.\n\nConfirming the link between NewRomanic and known\nwiper samples, we found a number of wiper samples\ncontained either the string “hastati” or “principes” in the\ncalling cards left by the attacker.\n\n\n-----\n\n**Sample MD5** **Compilation** **Detection**\n**Date** **Name**\n\ndb4bbdc36a78a8807ad9b15a January 31, 2013 KillMBR-FBIA\n562515c4\n\n5fcd6e1dace6b0599429d9138 January 31, 2013 KillMBR-FBIA\n50f0364\n\nf0e045210e3258dad91d7b6b January 31, 2013 KillMBR-FBIA\n4d64e7f3\n\nTable 2. Wiper samples connected to the NewRomanic Cyber Army\nTeam.\n\nNot only did most of the wiper samples link to\nNewRomanic, but the remote-access Trojan can also\nbe linked to the group. The Trojan contained a build\npath that mentions Troy in the directory path, again\nconsistent with the ancient Roman references used by\nthis group.\n\nFigure 2. The remote-access Trojan names Troy. This reference links the\nattack to the NewRomanic Cyber Army Team.\n\n###### Code Analysis\n\nIt is highly unusual that two groups claim responsibility\nfor these attacks. No further information has been\nrevealed as to who they are or what their motivations\nare; this is another reason to suspect that these two\ngroups are the same and are actually fabricated. The\nsupporting evidence comes in the form of code analysis\ndetermining the degree of similarity between the\n\nl\n\n\nThe Whois Hacking Team sample was compiled on March\n19 at 1:57 pm local time and the NewRomanic dropper was\ncompiled on March 20 at 4:07 am local time. The attacks on\nSouth Korean banks and media and the defacement of LG\n+U occurred approximately 2:00 pm local time on March 20.\n\nMcAfee Labs investigated the differences between\nthe two samples at a code level to determine if there\nwere any similarities. In spite of the fact that the wiper\ncomponent originating from NewRomanic Cyber Army\nTeam was 24 Kb in size and the component from Whois\nwas 236KB, we did find similarities within the code.\nThe Whois sample is a dropper for a component that\nclosely resembles the one used by the NewRomanic\nCyber Army. We found a significant number of matching\nsubroutines and a large number of code segments with\nonly minor differences. These similarities lead us to\nconclude that the payload code is based upon the same\ninitial code and was embedded into different droppers.\n\n**Whois Sample** **NewRomanic** **# of Different**\n**Sample** **Functions**\n\n_alloca_probe _alloca_probe exact match\n\nsub_4078C0 loc_40291F 15\n\nsub_4030A0 loc_302f40 17\n\nloc_404f54 loc_403169 1\n\nloc_4033a1 loc_4084ee exact match\n\nloc_4065f4 loc_403694 exact match\n\nstart sub_401870 131\n\nsub_402D02 sub_407BC9 0\n\nsub_407c7a sub_402DB3 10\n\nsub_4083F5 sub_40327D 4\n\nsub_403770 sub_409980 exact match\n\n\n-----\n\nDark Seoul\n\n\n###### Revealing “Operation Troy”\n\n Persistent espionage campaign in South Korea: 2009–2013\n\nPublic reports covering what is known as the Dark\nSeoul incident, which occurred on March 20, 2013,\naddressed only the MBR wiper components. Many of\nthe details of this incident have been examined, and\nmost analysts conclude this was an isolated, though\nclearly coordinated, attack. However, McAfee Labs has\nfound that there was more to the incident than what\nwas widely reported. Our analysis has revealed a covert\nespionage campaign.\n\nTypically, this sort of advanced persistent threat (APT)\ncampaign has targeted a number of sectors in various\ncountries, but Operation Troy, as these attacks are now\ncalled, targets solely South Korea.\n\nFrom our analysis of unique attributes within the\nmalware samples, we have determined that the initial\ncode behind the “Troy” family of Trojans was created\nin 2010, as was another component that was dropped\nby the Trojan HTTP Troy. The malware used in these\nattacks were compiled to specifically target South Korea\nand used Korean-language resources in the binaries.\nThe malware connected to legitimate Korean domains\nthat were running a bulletin board and sent a specific\ncommand to a PHP page to establish an IRC channel and\nreceive commands.\n\n\nEspionage Campaign\n\nOperation Troy—Domestic Spying Period\n\n\nMarch 20,\n\n2009 2010 2011 2012 2013\n\n2013\n\nUS/South Chang HTTP Troy Http Dr0pper Concealment\nKorean EagleXP Mail Attack Tong Troy\nMilitary Attacks NSTAR MBR Wiper\n\n3Rat Client\n\nTDrop\n\nDDoS 10 Days of Rain Media/Broadcast\nAttacks Attacks\n\nSuspected Link\n\nFinancial Industry Solid Link\nAttacks\n\nHighly Probable Link\n\nFigure 3. The targeted attack Dark Seoul reached its culmination in\nMarch 2013, but its roots go back at least to 2009, when the Trojan’s\nsource code was first compiled. Subsequent variations of the malware\nhave also been involved in these threats.\n\nMcAfee Labs has determined that domestic espionage\nactivities occurred before the March 20 attacks, most\nlikely to gain intelligence regarding the targets to carry\nout further attacks (such as the March 20 incident) or\nto benefit the attackers in some other ways. This spying\noperation had remained hidden and only now has been\ndiscovered through diligent research and collaboration.\nWe also suspect the attackers had knowledge of the\nsecurity software running within the environment before\nthey wiped the systems, given that some of the variants\nused in the attack were made to look as if they were\nanti-malware update files from before March 20.\n\nThe attackers who conducted the operation remained\nhidden for a number of years prior to the March\n20 incident by using a variety of custom tools. Our\n\n\n-----\n\ninvestigation into Dark Seoul has found a long-term\ndomestic spying operation underway since at least\n2009. The operation, all based on the same code, has\nattempted to infiltrate specific South Korean targets. We\ncall this Operation Troy, based on the frequent use of\nthe word Troy in the compile path strings in the malware.\nThe prime suspect group in these attacks is the New\nRomanic Cyber Army Team, which makes frequent use of\nRoman and classical terms in their code. While analyzing\nmalware components from before the March 20\nincident, we found both similar and identical attributes\nof the files involved that enable us to link them to the\n3Rat remote administration tool client used on March\n20, as well as to samples dating to 2010. Furthermore,\nwe determined that, through prior access to the victims’\nnetworks, the attackers were able to upload the MBR\nwiper component and distribute it. It is also possible that\nthe campaign known as 10 Days of Rain is a byproduct of\nOperation Troy. Some of our analysis suggests that the\nmalware Concealment Troy was present in these attacks.\n\n###### Tools and tactics\n\n**NSTAR: 2010–2011**\n\nNSTAR appears to be the first production version of the\nTroy family. This Trojan is based upon malware created\nfor a military espionage campaign that first emerged in\n2009. NSTAR is the first to use components in the same\nway that later variants of the Troy family do. It included\na shared DLL (bs.dll) that was found in the 2010 and\n2011 variants. Later variants use a modified version,\nHTTPSecurityProvider.dll, which employs nearly the\nsame file-mapping function as used by bs.dll. Most of\n\nh l d f h k d\n\n\nThat’s fairly consistent throughout all versions. The\nDLL was compiled using Microsoft Visual C++ Version 6.\nThose iterations were found in 2010-2011.\n\nThe call graph generated for NSTAR’s bs.dll is identical\nwith that of HTTP Troy. They were compiled at least a\nyear apart from each other.\n\nFigure 4. Call graph for bs.dll from the NSTAR variant of the Troy Trojan.\n\n\n-----\n\nThe DLL was compiled March 3, 2011, and includes an OCX\ncomponent that was compiled in late 2010. The OCX used\na very different compile path, but bs.dll, the backdoor, is\nessentially the same as those seen in later versions.\n\nThe Work directory, with path shown below, is also used\nwith Troy variants Concealment Troy and 3Rat Client,\nwhich were both compiled in 2013.\n\nE:\\Work\\BackUp\\2011\\nstar_1103\\BackDoor\\BsDllup\\Release\\BsDll.pdb\n\nWe also found a file-mapping function in this variant\nsimilar to those in most of the newer versions. The\nunique string beginning with “FFFFFFF” is identical and\noccurs throughout the later variants.\n\nFigure 6. NSTAR’s file-mapping function.\n\nThe malware establishes an internet relay chat (IRC)\nchannel to receive real-time commands in the same\nmanner as the military espionage malware.\n\nFigure 7. NSTAR communicates with its control server via HTTP as its\nprimary channel.\n\n\n**Chang and EagleXP: 2010**\n\nAnother variant from 2010, EagleXP, is closely related to\nNSTAR and HTTP Troy based on reused components.\nEagleXP used this compile path:\n\nD:\\VMware\\eaglexp(Backup)\\eaglexp\\vmshare\\\nWork\\BsDll-up\\Release\\BsDll.pdb\n\nAgain we see the Work directory involved as in the other\npost-2010 malware used in this campaign. A variant\ncompiled on May 27, 2010, also contained a very similar\ncompile path. We were able to obtain some traffic from\nthe control server.\n\nD:\\\\Chang\\\\vmshare\\\\Work\\\\BsDll-up\\\\Release\\\\\nBsDll.pdb\n\nThe May 27 variant, called Chang, operated in the same\nmanner as other Troy variants and used the same bs.dll.\nA Korean manufacturing website hosted both the control\nserver and an IRC server.\n\nFigure 8. Outbound traffic from an infected system.\n\nFigure 9. The malware establishes a channel with the control server via IRC.\n\n\n-----\n\nBoth the Chang and EagleXP variants are based on the\nsame code that created NSTAR and later Troy variants.\nThese similarities confirm the attackers have operated\nfor more than three years against South Korean targets.\n\n**Inside the IRC botnet**\n\nTroy Botnet\n\nSujewha.com Traveler.foxlink.com\n\nToneharbor.com Nowq.net\n\nDong.a.jp Hanja.edu.com Qitaegyo.com Babcom-h1.bluethunder.co\n\nHTTP Lawbookcenter.co.kr\nTroy Solarshare.co.kr\n\nHttp\nDr0pper Delmundo.kr\nByonshop.com\n\nDochang.pe.kr Theumin.net\n\nTong Gcglobal.com\n\nNSTAR\n\nTDrop\n\nApsumo.co.kr\n\nConcealment\nTroy Mupa.co.kr\n\nFigure 10. The malware family and its control servers.\n\nDuring our investigation we dug into the attackers’\ncontrolling botnet, which was used until 2013. The\ninfrastructure relied upon on a network of hacked\nSouth Korean websites hosting IRC servers. The infected\nclients, in turn, communicated with the IRC servers using\nRSA encryption and used functions imported from the\nMicrosoft Cryptography API library.\n\n\nFigure 11. Some functions imported from the Microsoft Cryptography\nAPI.\n\nThe attackers hardcoded the control domains in bs.dll\nand distributed it in the final compiled Trojan code. Each\nvariant of each generation of Trojans contained different\nhardcoded strings pertaining to the control servers. This\nshows that the attackers first compromised the future\nIRC server sites and then compiled the component and\ndistributed it to infected targets.\n\nFigure 12. Hardcoded addresses in bs.dll.\n\n\n-----\n\nThe nickname for the bot can be determined by the\noutbound traffic and information written to the Windows\nregistry. One variant operating in June 2010 used\nthe nickname BS^000C2918AB11 with the password\nwodehaopeng. The malware joined the IRC channel\n#god and sent several private messages to what was\nlikely the control server to receive instructions.\n\nPRIVMSG X^111112352643[1] :\n\nA5TbaKuqCO641tirNl51rFLdNHeUhMbUiJ93sO5rip9X\n7AZG0Y8rlZVmItEEfDrmNL19OpJrv2khO5WbflTqxs7FV\ngzUNfdvtnjbObWeNN VPlFyXPQIEDj/4YnidGDAqp7\nm8lFpnC2Pyz2+6OOooEUMqG6rKImyFQLM/V7K69E=\n\n**Variant** **Bot IRC Nickname**\n\nHttp Dr0pper YN^000E0C3CB868\n\nHTTP Troy B9^E02E29C4\n\nTDrop TE02E29C\n\nNSTAR H^E02E29C4\n\nTong CO^000E0C2892FA\n\nEagleXP B3^000C2918AB11\n\nChang X^000C295C5DEC\n\nTable 4. IRC bot nicknames used by variants.\n\n**HTTP Troy: 2011**\n\nIn 2011 the attackers created the Trojan HTTP Troy,\nnamed from its compile path string. This was the first of\nthe Troy family of Trojans. To date, we have found only\none sample of HTTP Troy. Upon execution, the malware\nlaunches a crippled GUI that allows the victim to install\na screen saver displaying politically sensitive images.\nWe don’t know why the developers took the risk of\n\n\nmaking the Trojan visible. The screensaver component\n(chonanship.scr) is not malicious and was compiled on\nDecember 12, 2010. It contained images related to the\nsinking of the South Korean Navy ship Cheonan.[4] HTTP\nTroy was compiled on March 20, 2011 and contained\nthe compile path Z:\\source\\1\\HttpTroy\\BsDll-up\\\nRelease\\BsDll.pdb. As we can see, HTTP Troy uses the\nsame DLL as the NSTAR, Chang, and EagleXP variants\ndid in 2010. This path was contained in a dropped DLL\ncomponent that was used to establish a hidden IRC\nchannel to the attackers’ control server. The primary\ndropper file for this remote-access Trojan was disguised\nas AhnLab’s Smart Update Utility setup program. The\noriginal filename was SUpdate.exe.\n\nAfter executing, the remote-access Trojan makes a\nconnection to sujewha.com, the IRC control server.\n\nFigure 13. HTTP Troy communicates with its control server via IRC.\n\n**Http Dr0pper: 2012**\n\nWe found a second-generation Trojan based on HTTP\nTroy that included the compile path Z:\\1Mission\\Team_\nProject\\[2012.6~]\\HTTP Troy\\HttpDr0pper\\Win32\\\nRelease. This Trojan, Http Dr0pper, was compiled in\n2012 from the HTTP Troy directory, indicating that it is an\n\n\n-----\n\nAll of the variants from this point reuse a specific DLL,\nwhich in some instances is named HTTPSecurityProvider.\ndll and uses the Microsoft Cryptography API to secure\ncommunications. We can track the reuse of this DLL\nbased on the consistent file‑mapping function that\nappears throughout the variants.\n\nFigure 14. The malware Http Dr0pper using the same file-mapping\nfunction and DLL as other versions.\n\nWe can determine that another variant, Tong (based on\nthe directory in which it was compiled), also reuses this\nDLL and contains the same function.\n\nFigure 15. The malware Tong using the same file-mapping function and\nDLL as other versions.\n\nFurthermore, variants such as Concealment Troy that\nwere compiled in 2013 contain the same function once\ndecoded. Still, some of the base code is reused in the\nsupporting DLL for Concealment Troy.\n\nFigure 16. The malware Concealment Troy using the same function\n(encoded function shown).\n\nAfter execution, the Trojan makes a connection to the\ncontrol server using specific parameters that include the\nIRC nickname. This communication pattern is consistent\nwith other variants that reference Troy\n\n\nFigure 17. Communicating with the control server.\n\n**Tong: 2012**\n\nThe Tong variant contains the compile path E:\\Tong\\\nWork\\Op\\1Mission\\Team_Project\\[2012.6~]\\HTTP\nTrojan 2.0\\HttpDr0pper\\Win32\\Release. It also\ncommunicated using the same methods. This Trojan was\ncompiled on August 28, 2012.\n\nFigure 18. Tong communicating with its control server.\n\n**Compile Date** **Compile Path**\n\nJuly 4, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\HTTP Troy\\\nHttpDr0pper\\Win32\\Release\\3HttpDropper.pdb\n\nJuly 7, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\\nHTTP Troy\\HttpDr0pper\\Win32\\Release\\\nHttpSecurityProvider.pdb\n\nAugust 28, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\\nHTTP Troy\\HttpDr0pper\\Win32\\Release\\\nHttpSecurityProvider.pdb\n\nAugust 29, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\HTTP Troy\\\nHttpDr0pper\\Release\\HttpSecurityProvider.pdb\n\nTable 5. Components dropped by Tong.\n\n\n-----\n\n**TDrop: 2013**\n\nTDrop is the third generation of HTTP Troy. TDrop uses\none of two DLL files, payload32.dll and payload64.\ndll, and injects one, depending on operating system,\ninto svchost.exe. Previous versions used bs.dll, which\ncontained the code for communicating with the IRC\nbotnet. TDrop has some further functionality not\npresent in HTTP Troy that extends this Trojan’s ability to\noperate on 64-bit machines and to evade automated\nanalysis systems and emulation technologies.\n\nThe evasion routines check for the presence of\ndebuggers and tracers that attach to the parent\nprocess. This effectively causes the parent process\nto immediately terminate when under analysis by\nemulation or sandboxing systems that attempt to hook\nand monitor API calls coming from that process.\n\n\nFurthermore, TDrop uses a DLL to run under\nnonprivileged accounts on Windows 7. This variant\nwas compiled on January 15, 2013, and contained the\ncompile path D:\\Work\\Op\\Mission\\TeamProject\\\n\n[2012.11~12]\\TDrop\\Dropper32\\Release\\Dropper.\npdb. The main executable, which extracts the other\ncomponents, was compiled from the path Z:\\Work\\\nv3zip\\misc.c and Z:\\Work\\v3unzip.c. This is likely a\ncompression tool to extract the files to the desktop.\n\nJust as Http Dr0pper, TDrop uses the disguised dropper\ncomponent AhnlabUpdate.exe. The unique code is\nnearly identical to that used in Http Dr0pper with the\nexception of the last two characters.\n\nFigure 20. TDrop reusing code from Http Dr0pper.\n\nWhen the main Trojan file executes, it launches RunCmd.\nexe, which itself doesn’t appear to be malicious.\nRunCmd.exe then launches AhnlabUpdate.exe based\non the specified filename in the associated RunCmd.ini\nfile. These files are created in the directory 114719_507_\nAhnlabUpdateKit, which sits in a temp directory\ncreated on the desktop. It is obvious that the attackers\nwere aware of the security product that the target\nenvironment used and attempted to make the malware\nappear as legitimate as possible. AhnlabUpdate drops\nand runs an additional executable, which is the RAT\npayload that establishes a connection with the control\nserver.\n\n\n-----\n\nZ:\\\\Work\\\\Make Troy\\\\Concealment Troy\\\\\nExe_Concealment_Troy(Winlogon_Shell)\\\\\nSetKey_WinlogOn_Shell_Modify\\\\BD_Installer\\\\\nRelease\\\\BD_Installer.pdb\n\n**Component** **Compile Path** **Compile Date**\n**(all 2013)**\n\n\nJanuary 23\n\nFebruary 4\n\nFebruary 22\n\nFebruary 22\n\n\nFigure 21. TDrop disguises its presence by appearing to be a security\nproduct.\n\n**Concealment Troy: 2013**\n\nAnother third-generation Troy family Trojan is Concealment\nTroy. This version was compiled from the same directory\nas the 3Rat client found in the victims’ environments on\nMarch 20. Some components from Concealment Troy\nsuggest that the source code was originally written in\n2010 and was later compiled for use in this campaign.\nThe 64-bit component to install the backdoor on the\nvictims’ systems contains an interesting compile path\nand was first created on November 28, 2012.\n\nC:\\test\\BD_Installer_2010\\x64\\Release\\BD_\nInstaller_2010.pdb\n\nThe 32-bit version was compiled January 23, 2013, and\n\n\nMainDropper2 None February 22\n\nMainDropper3 None February 23\n\nTable 6. Compilation timeline for Concealment Troy.\n\nConcealment Troy does not employ real-time IRC control\nas earlier versions did. (Concealment Troy is a typical\nHTTP botnet.)\n\nFigure 22 Concealment Troy abandons the use of IRC for real-time\n\n\nBDInstaller1 Z:\\\\Work\\\\Make Troy\\\\\nConcealment Troy\\\\Exe_\nConcealment_Troy(Winlogon_\nShell)\\\\SetKey_WinlogOn_Shell_\nModify\\\\BD_Installer\\\\Release\\\\\nBD_Installer.pdb\n\nBackdoorEXE Z:\\\\Work\\\\Make Troy\\\\\nConcealment Troy\\\\Exe_\nConcealment_Troy(Winlogon_\nShell)\\\\Concealment_Troy(exe)\\\\\nRelease\\\\Concealment_Troy.pdb\n\nBackdoorDLL Z:\\\\Work\\\\Make Troy\\\\\nConcealment Troy\\\\Exe_\nConcealment_Troy(Winlogon_\nShell)\\\\Dll\\\\Concealment_Troy(Dll)\n\\\\Release\\\\Concealment_Troy.pdb\n\nBDInstaller2 Z:\\\\Work\\\\Make Troy\\\\\nConcealment Troy\\\\Exe_\nConcealment_Troy(Winlogon_\nShell)\\\\SetKey_WinlogOn_Shell_\nModify\\\\BD_Installer\\\\Release\\\\\nBD_Installer.pdb\n\n\n-----\n\n###### Military Espionage Malware: 2009–2013\n\nMcAfee Labs has uncovered a sophisticated military\nspying network targeting South Korea that has been in\noperation since 2009. Our analysis shows this network\nis connected to the Dark Seoul incident. Furthermore,\nwe have also determined that a single group has been\nbehind a series of threats targeting South Korea since\nOctober 2009. In this case, the adversary had designed\na sophisticated encrypted network designed to gather\nintelligence on military networks. We have confirmed\ncases of Trojans operating through these networks in\n2009, 2010, 2011, and 2013. This network was designed\nto camouflage all communications between the infected\nsystems and the control servers via the Microsoft\nCryptography API using RSA 128-bit encryption.\nEverything extracted from these military networks\nwould be transmitted over this encrypted network once\nthe malware identified interesting information. What\nmakes this case particularly interesting is the use of\nautomated reconnaissance tools to identify what specific\nmilitary information internal systems contained before\nthe attackers tried to grab any of the files.\n\nThe attacks would have occurred in four general stages:\n\n- Initial compromise via a “watering-hole attack,” which\n\nwould lead to the exploitation of the internal systems\n(in the 2009 case). (The attacker placed a zero-day\nexploit on a military social networking site.) Later cases\nwere likely spear phishing to more quickly get to the\nright targets.\n\n|August 21, 2010 October 21, 2009 Military Attacks Military Attacks|Col2|Col3|\n|---|---|---|\n||||\n\n\ntake.chu.jp seung.us sarangbang.us christkingchurch.us\n\nJanuary 13, 2013 February 28, 2011\nMilitary Attacks Military Attacks\n\ndjuna.cine21.com strider.pe.kr dochang.pe.kr kairoshairstory.com.au ejiweb.com dennisoneil.net daeilho.net\n\nFigure 23. Encrypted data exfiltration network.\n\n- Malware automatically performs reconnaissance on\n\ntarget systems looking for documents of interest.\nMalware can also scrape out passwords and registry\ninformation along with directory listing of interesting\nfiles.\n\n- The attacker can request directory contents from\n\ninfected systems based on the number of interesting\nfiles found. They can selectively grab specific files as\nneeded.\n\n- Stolen files are transmitted via HTTP-encrypted\n\nchannel to the attacker’s server.\n\n|January 13, 2013 Military Attacks|Col2|Col3|\n|---|---|---|\n||||\n\n|February 28, 2011 Military Attacks|Col2|\n|---|---|\n|||\n\n|ejiweb.com|dennisoneil.net|\n|---|---|\n\n\n-----\n\n###### The encrypted network\n\nThe attacker’s encrypted network uses Microsoft’s\nCryptography API library Version 1.0 to encrypt\ncommunication channels to the control servers over\nboth HTTP and IRC. The encryption uses a 128-bit RSA\nkey, shown as imported and used by the following code.\n\nFigure 24. Function to call the Microsoft Cryptography API library.\n\nFigure 25. RSA encryption key used to camouflage communications.\n\n\nThis network operates over both HTTP and uses IRC\nas secondary channel for real-time operations. The IRC\nnetwork is based on the open-source library libircclient[5],\nand everything sent over this IRC channel is encrypted\nvia the Microsoft Cryptography API.\n\nFigure 26. Establishing an IRC channel session.\n\nThe following commands are supported by IRC to control\ninfected systems in real time. This functionality enables\nthe attacker to send and receive files on demand and\nexecute remote commands. The messages sent between\nclient and servers are base64 encoded and then\nencrypted using the Cryptography API—thus, a message\nmust be decoded and decrypted to be visible. This highly\nsophisticated method provides for great flexibility over a\nsecure encrypted channel that is not SSL.\n\n- Get bot version and uptime\n\n- Get directory file listing, all drives or from specific path\n\n- Stop activities for a given period\n\n- Download file i\n\n\n-----\n\n- Execute shell command\n\n- Connect to IRC server\n\n- Change nick (IRC)\n\n- Join channel (IRC)\n\n- IRC disconnect\n\n- Remove bot from system\n\n\nThe HTTP portion is designed to get configuration data\nused in the IRC botnet and to send stolen documents\nback to the control server.\n\nFigure 28. HTTP Get command with parameters.\n\nFigure 29. HTTP Get command continued.\n\n\n-----\n\n###### Data exfiltration\n\nThe theft of classified information is the primary purpose\nof this network and would occur through drive scanning.\n\nDrive scanning locates classified information on target\nsystems and gives the attacker an overall idea of what\nthese military networks have. The malware searches\nthe root disk, counts the number of interesting files,\nand determines the level of that system’s importance\nto the attacker. The search criteria are primarily specific\nfile extensions and keywords in document titles. The\nkeywords are all military specific. Some refer to specific\nmilitary units and programs that operate in South Korea.\nThis function would determine only the number of\ninteresting files that are contained on any given system;\nanother function would extract the list of files that\nmatch these search criteria.\n\n\nFigure 30. HTTP Get command continued.\n\nThe encrypted network operates by scanning infected\nsystems and categorizing those systems that contain\ninteresting documents. The malware does not extract\nevery document that is found as a match through drive\nscanning—rather it assigns a unique signature to the\ninfected system according to what it contains. Less\ninteresting systems are less likely to have documents\nextracted from them. The directory contents are\nuploaded to the attacker’s server, which lets the attacker\ngrab documents at will and keeps the amount of\n\n\n-----\n\nIn addition to searching for English keywords, the\nfunction searches for Korean ASCII characters that\nrepresent a subset of military terms. Most keywords\nspecific to military operations in South Korea are in\nEnglish. There is also a set of abbreviations.\n\nFigure 32. Google translation of ASCII characters.\n\nThe files to be sent to the attacker’s server are zipped\nusing the open-source Zip Utils.[6] The component\nuses the password “dkwero38oerA^t@#.” We have\nconsistently found this password in the malware dating\nback to 2009. It is used primarily to archive items to be\nstolen from infected systems.\n\n\nFigure 33. The function to zip stolen documents.\n\n###### The DLL relationship\n\nIn all of these threats, we have seen the consistent use\nof bs.dll, a stripped-down version of ip6ld.dll, which\nwe have found in the military espionage cases. We can\nconnect not only similar functions within bs.dll from\n2011 to date with those of the military cases in 2009\nand 2010, but also the shared encryption key for zipping\nclassified information to be sent to the control server.\n\nThis ip6ld.dll is the same as another file, ~81923.dll. Both\noperate in the same manner. Bs.dll appears to be used\nprimarily for IRC botnet communications.\n\nThe component bs.dll has been seen in a number of\nTroy-era malware samples: Chang, EagleXP, NSTAR, Mail\nAttack, HTTP Troy, Tong, Http Dr0pper, and others. The\n\n\n-----\n\nin these attacks, shares a number of common functions\nwith bs.dll, including the zip encryption password. In\naddition, the IRC and encryption functions are the same\nin both files, indicating that they were built by the same\nindividual or group. The two functions are likely the\nsame source code in different versions. The primary\ndifference between them is bs.dll’s lack of searching for\nspecific extensions and terms that Ip6ld.dll and ~81923.\ndll contain. This suggests bs.dll requires a second\nmodule, and we have seen that with the Mail Attack\nvariant, compiled in February 2011, which contained\nboth bs.dll and payload.dll, with the latter containing the\nmilitary-specific search and extraction functions.\n\nFigure 34. The bs.dll function to scan all drives based on a specified\nextension.\n\nThe following function found in bs.dll lists the contents\nof specified directories and zips those contents into an\narchive file with a password. This function doesn’t have\n\n\nany criteria and is likely disabled in some cases, such as\nwith HTTP Troy, which downloads a payload module to\nsearch for data.\n\nFigure 35. A bs.dll function to list and send directory contents.\n\nFigure 36. A bs.dll function to send directory contents to remote server.\n\n\n-----\n\nPayload.dll appears to combine both drive searching and\ndirectory listing into a single function. A separate action\nputs the directory contents into a separate file and\nprepares it to be sent to the remote server.\n\nFigure 37. A payload.dll drive-search function.\n\n\nFigure 38. A function to zip contents.\n\n\n-----\n\n###### Relationships to Http Dr0pper\n\nWe have determined that some variants of Http Dr0pper\nwill execute payload32.dll, which is essentially the same\nDLL that is found in TDrop. This component contains\nmilitary keywords. One variant of Http Dr0pper made\nuse of payload32.dll, which was compiled on August\n23, 2012. The TDrop version was compiled on January\n13, 2013. This consistency confirms further that the\noperations against South Korea are primarily focused\non military intelligence gathering and have attempted to\nbreak in since 2009.\n\n###### Destroying the target\n\nThe espionage malware has the capability to destroy\nsystems in the same way that the March 20, 2013\nattacks disabled thousands of systems in South Korea.\nThis capability could be devastating if military networks\nwere to suddenly be wiped after an adversary had\ngathered intelligence. This was clearly the case with the\nMarch 20 Dark Seoul incident, in which we confirmed\nthat the 3Rat Trojan gained access prior to the MBRwiping event. There was at least one limitation, however:\nwe found the malware of February 2011 could wipe its\ntargets only if it detected that it was being debugged or\nanalyzed by a security product.\n\n\nFigure 39. The malware’s function to wipe the MBR.\n\n\n-----\n\n###### The campaigns\n\nThrough our research, we have discovered a number of\ndistinct subcampaigns as part of the overall Operation\nTroy, which has targeted military forces in South Korea\nto extract classified information. These operations were\ndesigned to occur in 2009 through 2013. Recently, we\nuncovered evidence to suggest that they continued just\nprior to Dark Seoul. We can link the actor(s) responsible\nfor Dark Seoul to these particular espionage campaigns\nthrough various technical means.\n\n- The Troy-era malware is based on the same source\ncode to create these specialized versions (components\nshared over the years).\n\n\n\n- The zip encryption password is found in almost all\n\ninstances, with the exception of Concealment Troy.\n\n- Consistent terms in the malware compile paths (for\n\nexample, Troy, Work, and more).\n\n- The same IRC botnet channel and encryption method\n\nare used throughout the variants.\n\n- Military keywords are consistently found through the\n\ncomponents spanning 2009–2013, confirming the\nintent of this adversary.\n\n- The same string-obfuscation techniques were used\n\nin the 2009–2010 campaigns and the 2012–2013\ncampaigns.\n\n|dkwero38oerA^t@#|Col2|Col3|Col4|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n||||||||\n\n\nMail Attack HTTP Troy NSTAR Chang EagleXP Http Dr0pper Tong TDrop\n\nFigure 40. Shared encryption password.\n\n|Chang|EagleXP|\n|---|---|\n\n\n-----\n\n###### Conclusion\n\nMcAfee Labs can connect the Dark Seoul and other\ngovernment attacks to a secret, long-term campaign that\nreveals the true intention of the Dark Seoul adversaries:\nattempting to spy on and disrupt South Korea’s military\nand government activities. The Troy-era malware is\nbased on the same source code used to create these\nspecialized variants and shares many commonalities,\nsuch as bs.dll and payload.dll, which are found\nconsistently throughout the families. The attackers have\nattempted since 2009 to install the capability to destroy\ntheir targets using an MBR wiper component, as seen\nin the Dark Seoul incident. From our analysis we have\nestablished that Operation Troy had a focus from the\nbeginning to gather intelligence on South Korean military\ntargets. We have also linked other high-profile public\ncampaigns conducted over the years against South\nKorea to Operation Troy, suggesting that a single group\nis responsible.\n\n###### About the Authors\n\nRyan Sherstobitoff is a threats researcher with McAfee\nLabs. Formerly, he was Chief Security Strategist at Panda\nSecurity, where he managed the US strategic response\nfor new and emerging threats. Sherstobitoff is widely\nrecognized as a security and cloud computing expert.\n\nItai Liba is a senior security researcher with McAfee\nLabs. He is a member of the botnet research team. Itai\nhas worked in mobile vulnerability research as well as\nlarge-scale reverse-engineering projects and display\ndriver development. He has more than 10 years of\nexperience in reverse engineering\n\n\nJames Walter is the director of Global Threat Intelligence\nOperations and manages the McAfee[®] Threat Intelligence\nService (MTIS) for the Office of the CTO. He focuses\non new threats research, as well as the cataloging\nand maintenance of vulnerabilities and associated\ncountermeasures. Walter has been with McAfee for more\nthan 14 years and leads a global team of threats analysts\nwho create Security Advisories, countermeasure/detector\nfeeds, McAfee[®] Global Threat Intelligence applications,\nand more. He is a frequent speaker at industry events\nand conferences, and cohosts “AudioParasitics—The\nOfficial Podcast of McAfee Labs.”\n\n###### About McAfee Labs\n\nMcAfee Labs is the global research team of McAfee.\nWith the only research organization devoted to all\nthreat vectors—malware, web, email, network, and\nvulnerabilities—McAfee Labs gathers intelligence from\nits millions of sensors and its cloud-based service\nMcAfee Global Threat Intelligence. The McAfee Labs\nteam of 500 multidisciplinary researchers in 30 countries\nfollows the complete range of threats in real time,\nidentifying application vulnerabilities, analyzing and\ncorrelating risks, and enabling instant remediation to\nprotect enterprises and the public.\n\n**[http://www.mcafee.com/labs](http://www.mcafee.com/labs)**\n\n[1. http://en.wikipedia.org/wiki/Principes](http://en.wikipedia.org/wiki/Principes)\n[2. http://en.wikipedia.org/wiki/Hastati](http://en.wikipedia.org/wiki/Hastati)\n[3. http://en.wikipedia.org/wiki/Troy](http://en.wikipedia.org/wiki/Troy)\n[4. http://en.wikipedia.org/wiki/ROKS_Cheonan_sinking](http://en.wikipedia.org/wiki/ROKS_Cheonan_sinking)\n[5. https://github.com/jonasschnelli/IRCClient](https://github.com/jonasschnelli/IRCClient)\n\n\n-----\n\n###### About McAfee\n\nMcAfee is the device-to-cloud cybersecurity company.\nInspired by the power of working together, McAfee\ncreates business and consumer solutions that make our\nworld a safer place. By building solutions that work with\nother companies’ products, McAfee helps businesses\norchestrate cyber environments that are truly integrated,\nwhere protection, detection, and correction of threats\nhappen simultaneously and collaboratively. By protecting\nconsumers across all their devices, McAfee secures their\ndigital lifestyle at home and away. By working with other\nsecurity players, McAfee is leading the effort to unite\nagainst cybercriminals for the benefit of all.\n\n**[www.mcafee.com.](http://www.mcafee.com)**\n\n2821 Mission College Blvd.\nSanta Clara, CA 95054\n888.847.8766\nwww mcafee com\n\n\nMcAfee and the McAfee logo are trademarks or registered trademarks of McAfee, LLC or its subsidiaries in the US and other countries.\nOther marks and brands may be claimed as the property of others. Copyright © 2018 McAfee, LLC. 3892_0418\nAPRIL 2018\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.mcafee.com/enterprise/en-us/assets/white-papers/wp-dissecting-operation-troy.pdf"
    ],
    "report_names": [
        "wp-dissecting-operation-troy.pdf"
    ],
    "threat_actors": [
        {
            "id": "a0d369c1-f0b7-4c70-a3a5-77aabbd17979",
            "created_at": "2022-10-25T15:50:23.311311Z",
            "updated_at": "2025-03-27T02:00:55.438117Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "MITRE:Strider",
            "tools": [
                "Remsec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99845f58-2c39-46f7-8369-bb621ebb7002",
            "created_at": "2022-10-25T16:07:24.238844Z",
            "updated_at": "2025-03-27T02:02:10.14785Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "ETDA:Strider",
            "tools": [
                "Backdoor.Remsec",
                "ProjectSauron",
                "Remsec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1525345074,
    "ts_modification_date": 1525345189,
    "files": {
        "pdf": "https://archive.orkl.eu/fda2269c57aa0ef18a92be81641da06ea6132652.pdf",
        "text": "https://archive.orkl.eu/fda2269c57aa0ef18a92be81641da06ea6132652.txt",
        "img": "https://archive.orkl.eu/fda2269c57aa0ef18a92be81641da06ea6132652.jpg"
    }
}