{
    "id": "b74104a1-c87c-4aa1-83e1-33466e5f5937",
    "created_at": "2023-06-05T02:07:03.238799Z",
    "updated_at": "2025-03-27T02:06:10.928762Z",
    "deleted_at": null,
    "sha1_hash": "6c73b3f6d0ac68758276cb28587c6c40fdcb5288",
    "title": "2022-07-21 - The 13 Deadly Sins of APT Incident Response — Part 1",
    "authors": "",
    "file_creation_date": "2023-06-04T12:59:17Z",
    "file_modification_date": "2023-06-04T12:59:17Z",
    "file_size": 1437283,
    "plain_text": "# The 13 Deadly Sins of APT Incident Response — Part 1\n\n**[blogs.blackberry.com/en/2022/07/the-13-deadly-sins-of-apt-incident-response-part-1](https://blogs.blackberry.com/en/2022/07/the-13-deadly-sins-of-apt-incident-response-part-1)**\n\nMark Stevens, Rocky De Wiest, The BlackBerry Incident Response Team\n\n### When you become aware of an attacker within your network, it can feel like the sky is falling.\n\n[Incident response (IR) puts your security team, operations team, and executive team under](https://www.blackberry.com/us/en/services/incident-response)\nextreme pressure, as the response process involves many elements of crisis management.\nThis is especially true when fighting an Advanced Persistent Threat (APT) because multiple\nattackers may be actively battling against you to complete their objective.\n\nThe biggest difference when dealing with an APT instead of just another malware is that\n_you are typically facing a group of humans that can react to your response. By definition, an_\nAPT can employ continuous and sophisticated techniques, implemented by highly skilled\nattackers. This makes it crucial to avoid what we call “the 13 deadly sins of APT incident\nresponse.” In this blog, we’ll discuss just the first four on our list of 13 fatal mistakes.\n\n## Real-World Incident Response Lessons\n\n\n-----\n\nWe created this list based on real incident response work conducted by the BlackBerry\nIncident Response team.\n\nMany in-house security teams have limited opportunities to learn from real-life incidents. It’s\noften the case that one big event causes those internal team members to seemingly “go\nfrom zero to 100MPH” overnight, in terms of their exposure to a major incident. When this\noccurs, organizations frequently reach out to us to help guide and augment their efforts.\n[With more than 100 years of combined IR experience, the BlackBerry IR team encounters](https://www.blackberry.com/us/en/solutions/endpoint-security/managed-xdr)\nmajor incidents on a regular and recurring basis, giving us a significant advantage in\ndealing with an extremely broad array of threats and threat actors. Because we act as an\nextension of the in-house team protecting each client organization, we are often in a\nposition to observe and coach less experienced teams and individuals. This provides\ninsights into frequent “opportunities for improvement,” many dealing specifically with APTs,\nwhich we have distilled into this list.\n\nAny IR training course will tell you what steps to follow, but not always the “why” and the\n“what could go wrong?” This article explores these deeper questions through specific, realworld challenges, and suggestions on how to resolve them. Lessons learned “the hard way”\nare valuable, but it’s often preferable to learn from other people’s mistakes, when possible,\nespecially when the stakes can be so high.\n\nThis blog is the first in a 3-part series that will cover important aspects of preparation, active\nresponse, and recovery and aftermath. In this first installment, we’ll focus on the first four\ndeadly sins, all of which relate to preparing for an APT incident.\n\n## Preparation\n\n[Whether you prefer NIST’s incident handling guidelines, or the SANS Institute's](https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-61r2.pdf) [PICERL](https://www.sans.org/reading-room/whitepapers/incident/paper/33901)\nmodel, both frameworks state that “lessons learned” is an important aspect of any incident\nresponse effort. But have we really learned our lessons after incidents?\n\nSecurity vendors—BlackBerry included—love to talk about how they discovered the latest\nmalware sample, but we rarely hear about opportunities for learning when things do not go\naccording to plan.\n\nAs full-time incident responders, we leverage our combined experience to plan and execute\nwhat we believe is the best strategy for any given situation. But these situations are\ndynamic, and no two incidents are ever quite the same. Sometimes we are called late to the\nparty, inheriting scenarios that are less than ideal, and while the vast majority of our clients\nfollow our advice, there are some that may have to take other factors into account, causing\nus to deal with a few curveballs.\n\n### Cyber Threat Actor Categories\n\n\n-----\n\nCurrently, we see various types of actors within the threat landscape, ranging from\ninexperienced “script kiddies” to professional ransomware crime syndicates, to well-funded\nand organized nation-state actors. None of these adversaries should be dismissed. As we\nsaw from the [recent leak of data from the](https://blogs.blackberry.com/en/2022/05/russia-linked-conti-group-creates-national-emergency-for-costa-rica) [Conti cybercrime group, successful ransomware](https://blogs.blackberry.com/en/2021/05/threat-thursday-conti-ransoms-over-400-organizations-worldwide)\nactors generate significant profits that they often re-invest in their operations to make them\nmore robust. For the purposes of our list of sins, we’ll focus on sophisticated threat actors\nconducting targeted, human-operated attacks, where defenders may face reactive\ncountermeasures in response to any actions they take.\n\n## The List: Deadly Sins of APT Incident Response\n\nAs we stated previously, the first four “sins” on our list of 13 are all about preparation. These\nare related to things that all companies should do before they have any indication of a\ncyberattack, so that when they do, they already have a plan ready to put into action, with\nthe necessary information at their fingertips. Building IR capabilities on-the-fly is timeconsuming, and stressful. You must do this beforehand because the most valuable\ncommodity during an incident is time! That’s why failure to adequately prepare in any of the\nfollowing areas is just plain sinful.\n\n## The First Deadly Sin of Incident Response: Lack of Visibility and Historical Logs\n\nWhile cyber awareness is resonating more with both SMBs and enterprises, cyber IR\npreparation unfortunately still ranks low on many organizations’ agendas. This is especially\nlikely if a company has yet to experience a significant incident.\n\nHowever, when that first major incident suddenly occurs, the first thing responding teams\ntypically reach for are logs that can provide crucial visibility to understand the extent of the\nthreat, and help them ascertain what may have already been compromised. So it is critical\nto enable proper logging—and centralized storage for those logs—when preparing for APT\nattacks. One reason is that these threat actors often “dwell” in a network for several years\nprior to eventual discovery. In fact, the longest dwell time our team has encountered is\nseven years. Imagine possibilities of what an adversary could do in your environment during\n364 weeks of unimpeded access.\n\nIn addition to siphoning away your data for an extended period of time, threat actors could\nalso modify your data to suit their needs. Adding an entry to a database, perhaps to provide\nunauthorized access to a secure facility, is just one example. The type and amount of\nmayhem a successful APT actor can commit is limited only by their imagination.\n\nMaintaining good logs isn’t glamorous, or even very interesting—until you find an APT in\nyour network. Security operation center (SOC) teams are often inundated with a neverending slew of alerts to be resolved, and can sometimes forget the importance of historical\n\n\n-----\n\nlogs. But these records are what allow an incident response team to perform forensic\nanalysis on not only present, but also past events.\n\nWhile storing seven years of detailed logs is not viable for most organizations, the span of\none to three years should be considered, depending on your organization’s requirements\nand retention policies.\n\nAs consultants, we quite often come into a customer environment and find that all system\nlogs are capped at two or three days, and are stored on the endpoints themselves. This\ncreates a significant problem in historical data and can raise questions about the integrity of\nthe log entries themselves. Threat actors can manipulate logs if they want, or just simply\ndelete them.\n\nOne of the frequently overlooked logs, which nearly every network device can create, is\n“NetFlow.” This log can assist during an incident, answering critical questions such as, “Was\ndata exfiltrated?” or, “Which systems are connecting to the APT’s command-and-control\n(C2) server?”\n\nOther logs that can be centralized and indexed include PowerShell, Windows Event,\nNetwork, and AV logs. Attention should also be given to what is logged. This is often\nconfigurable, and your choices can have a considerable impact on storage costs, among\nother factors. While any IR team would be grateful for every logging option under the sun to\nbe switched on, it may make more sense to have enhanced levels of logging only on more\n[critical devices. Cloud-based EDR/XDR and managed XDR solutions are available that](https://www.blackberry.com/us/en/solutions/endpoint-security/managed-xdr)\nautomatically move events to a secure, centralized source that can still be accessed reliably\nand analyzed, even if the source data is tampered with or destroyed.\n\n### Questions Asked During Incident Response\n\nDuring an incident, clients often ask questions such as “How and when did the attacker get\nin?” “What was stolen?” and, “Was any data altered?” While these questions often get\nprogressively more difficult to answer, it is significantly easier with evidence that has\nintegrity and is centrally located. Think of it this way, if the crime was a physical theft, the\ncase could often be solved by having CCTV footage of the incident, from start to finish.\nThink of cybercrimes in the same way: Your logs are key evidence of what happened and\nwhen. If there are no logs, you have a blind spot, and you can’t go back in time to fix that\nomission after the crime has occurred.\n\nWhen making choices about what to log, and how long to keep those records, ask yourself,\n“What is the most precious information in our environment, and where are those ‘crown\njewels’ stored?” These locations, and any related systems, should be covered by multiple\n“cameras.” In our case, this means supporting multiple logs, along with toolsets like SIEM\nand EDR, with rules and alarms configured. This approach also requires having a “security\nguard” on duty as all the alarms in the world will not help you if no one is there to hear and\n\n\n-----\n\nrespond to them; for us, this means having either a 24/7 SOC or a managed security\nservice on alert at all times. Unfortunately, our team has seen many easily manageable\nincidents cause severe damage to organizations, simply because no one was on guard to\ninvestigate the alarms.\n\n### How APTs Attempt to Hide from Network Defenders\n\nForensic investigations can often provide a good understanding of what happened during a\ncyberattack. However, the more a specific machine was used by the attackers, and the\nmore time that has passed since the activity took place, the slimmer the chances of\nrecovering valuable artifacts.\n\nMore advanced threat actors are often extremely careful about leaving evidence behind—\n[by deleting logs, time stomping evidence, or using other covert techniques. They leave](https://attack.mitre.org/techniques/T1070/006/#:~:text=Timestomping%20is%20a%20technique%20that,are%20in%20the%20same%20folder.)\nsmaller footprints behind to follow. They practice stealth to prolong their access for as long\nas possible. This is what allows them to spend years in an environment before being\ndiscovered.\n\nIn the unfortunate event that a particular threat actor has been lurking in your network for\nyears, having centralized logs for an extensive period can potentially answer your\ninvestigatory questions. When dealing with ransomware cases, and the now common\n[double extortion techniques where data exfiltration is commonplace, having certain forensic](https://blogs.blackberry.com/en/2021/08/threat-spotlight-lockbit-2-0-ransomware-takes-on-top-consulting-firm#:~:text=LockBit%20uses%20a,hxxp%5B%3A%5D//lockbitapt6vx57t3eeqjofwgcglmutr3a35nygvokja5uuccip4ykyd%5B.%5Donion.)\ndata (such as logs) moved and securely stored off of the endpoint can make all the\ndifference. This is because when devices are encrypted by attackers, logs and forensic\nartifacts are often encrypted in the process.\n\nWe have worked cases where the on-premises SIEM solution, which was used to store\nsystem logs remotely, was encrypted along with the rest of the servers. This means\nsecuring the SIEM solution itself is also part of the preparedness challenge.\n\nOrganizations can improve their defenses by ensuring standard security practices, such as\nhaving a disaster recovery plan worked out, segregating the SIEM solution to strictly allow\n[administrative access only from the security team with multi-factor authentication (MFA)](https://blogs.blackberry.com/en/2022/07/why-arent-smbs-taking-the-easiest-step-toward-zero-trust)\nenabled, and ideally, using a cloud-based Linux® solution.\n\n### Benchmarking Incident Response Preparedness\n\nMatt Swann’s [Incident Response Hierarchy of Needs is an excellent reference when trying](https://github.com/swannman/ircapabilities)\nto determine if you are indeed fully prepared for a major incident. The odds are best if you\ncan confidently answer the questions shown below. (Pro tip: Start at the bottom and work\nyour way up.)\n\n\n-----\n\n[The Incident Response Hierarchy of Needs.](https://github.com/swannman/ircapabilities)\n\nThe diagram is based on the well-known principles of Maslow’s hierarchy of needs,\nborrowed from the field of psychology. An organization should start at the base of the\npyramid to find out if their primary security needs are covered. Having an asset inventory or\na network diagram is the first step in prepping for APT-style attacks. In fact, eight of these\n10 questions should already be covered if you have properly implemented EDR and SIEM\nsystems (along with the appropriate staff and processes to operate and maintain them, of\ncourse).\n\n### Increasing Visibility to Detect APT Attack Vectors\n\nOne of the first goals of investigating an APT is to increase visibility. There are multiple\nreasons for beginning with an increase in visibility:\n\nUnless you catch it very quickly, whatever you, your security team, or an external third\nparty initially discover will probably just be the tip of the iceberg.\nFully scoping the incident requires visibility of, and the ability to hunt for, indicators of\ncompromise (IoCs) across the entire enterprise.\nSome APT groups rely on multiple “footholds,” or mechanisms to maintain access, to\npersist in a victim’s environment.\n\nIt’s important to identify secondary or tertiary backdoors deployed with stealthy\ninstallations. These are often left dormant and used to re-establish the threat actor’s\npresence at some point in the future, if the primary access point is lost.\n\n\n-----\n\n## The Second Deadly Sin of Incident Response: Not Having the Right People, Processes, and Technology\n\nMilitary troops are trained so that no matter how stressful the situation is, they will follow\nprocedure, which ensures that responses are appropriate, strategic, and consistent. The\nsame logic applies when responding to incidents; however, procedures and policies are\nquite often written after a company’s first major incident, when it is already too late. When\nsuch plans are in place before an incident occurs, we may find that they have never actually\nbeen tested. In too many cases, we see inexperienced but well-meaning staff often will\ntamper with an infected system and try to self-resolve the incident, before taking a\nforensically sound image. They may even format and rebuild the affected system in an effort\nto restore to “business as usual” as soon as possible, and in the process, destroy valuable\nevidence and information about the attack.\n\nWhile reimaging is often a best practice for resolving commodity malware affecting a single\nhost, when it comes to more serious incidents like APTs, that evidence is key to\nunderstanding the impact of the attack. You often don’t know what is critical until the\nincident is fully scoped and analyzed. If you track an attack back to what is likely to be the\ninitial entry point (also known as “patient zero”) only to find that it was reimaged by an\noverzealous IT security team, it can have serious repercussions on your ability to\nunderstand the attack, and how to prevent it from happening again.\n\nIn one example, a system admin with limited security experience attempted to resolve a\nprevious incident by reformatting the affected system, without first assessing the possible\nimpact of the attack. The system in question was a development server that was exposed to\nthe internet. Three months after the initial incident, the attacker came back using stolen\ndomain credentials obtained from that previous server. This breach resulted in the\norganization’s entire domain being ransomed, and a large amount of information being\nstolen.\n\nIn similar APT cases, this same technique has caused what we often call a game of\n“whack-a-mole,” where backdoors are found and “resolved” by re-imaging the machines,\nresulting in what companies often believe to be multiple repeat incidents. However, a\nthorough investigation often reveals that they were all part of one large incident where the\nattacker was never successfully removed.\n\nThe key to dealing with security incidents is catching them early, scoping them fully, and\nhaving a plan in place to resolve them quickly and appropriately. Implementing these best\npractices requires the ability to differentiate between rudimentary malware and more\ncomplicated human-operated attacks. Having an IR process in place for both types of\nattacks will help mitigate the damage.\n\n\n-----\n\nAnother challenge is that the experience necessary to identify, investigate and respond\nappropriately to an APT-based attack comes at a cost. It’s hard to keep current on the\nlaundry list of threats active and “in the wild” on any given day. Analysts gain their\nexperience through dealing with real-world incidents, and their skills can get stale when not\ndealing with incidents on a regular basis.\n\nThis increase in visibility, as well as the later remediation phases, often relies on the ability\nof organizations to deploy software, configuration changes, and scripts across their entire\nestate. Ensuring you have this capability ahead of time can make all the difference.\n\nEven if you purchase IR services, they will require you to install agents or run scripts across\nthe whole enterprise to start feeding the external IR team the data they need to perform\ntheir initial analysis. There is nothing more frustrating for a CISO, CIO, or security manager\nthan having to keep an external team of IR consultants waiting for data before they can start\nto investigate and understand what happened. The clock is ticking, response is delayed,\nand in the meantime, potential damage can spread.\n\n## The Third Deadly Sin of Incident Response: Analyst Burnout and Alert Fatigue\n\nAlert fatigue happens when analysts are exposed to a large number of alerts over an\nextended period of time, and it’s made worse when these alerts include frequent false\npositives or low-priority alarms. In these cases, analysts can become desensitized over\ntime. Whenever SOC members are not looking at only high-fidelity alerts, and not focusing\non continuous tuning, it can delay the identification of critical events when they do occur.\n\nFor example, on multiple occasions, BlackBerry IR consultants found that a target\norganization’s antivirus or EDR tools had triggered multiple, highly suspicious alerts for\nweeks before the incident became critical. However, no importance was given to these\nalerts because the files were quarantined, or activity was blocked.\n\nUnderstandably, it can become very tiresome if every single alert must be investigated. This\nis why [Florian Roth created a very helpful cheat sheet to judge how relevant each detection](https://twitter.com/cyb3rops)\nis. While this resource provides an excellent starting point for recognizing legitimate alerts,\nyou will also need to develop your own tuning and prioritization process, along with\nplaybooks appropriate for your organization.\n\nAgain, experience plays an important role. When put in front of an experienced threat\nhunter or IR consultant, many of the warnings would raise immediate concerns and trigger\nan investigation to look for the root cause. But a SOC analyst who has never experienced a\nmajor incident may not have the ability to identify these in a timely manner.\n\n\n-----\n\n## The Fourth Deadly Sin of Incident Response: Not Having an Incident Retainer\n\nAnother step organizations should take ahead of a data breach is purchasing an incident\nresponse retainer (IRR) with a trusted security advisor. When an incident occurs, you don’t\nwant to waste time scoping out which company is best placed to help resolve your incident,\nand then spend valuable time collecting quotes, or executing contracts and purchase orders\nto start the response and remediation process. With the current demand for incident\nresponse services, vendors might be fully occupied and give priority to their existing retainer\nclients. An added benefit of having a retainer is that it usually comes with a discounted price\ntag.\n\nA retainer can speed things up and provide access to world-class experts, intelligence, and\ntools, when and where you need them most. Retainers often include access to the vendor’s\nproducts for the duration of the incident. Even if some of the skillsets within a retainer are\navailable in-house, it’s advisable to have expert help available when you need it.\n\n### Assessing and Absolving Your Sins\n\nWhen we classify these sins as potentially “deadly,” it may not be sheer exaggeration,\nespecially for smaller and mid-size organizations. BlackBerry’s recent [2022 Threat Report](https://www.blackberry.com/us/en/forms/enterprise/report-bb-2022-threat-report-pi)\nstated that more than 70% of SMBs have faced cyberattacks, and of those attacked, many\ncannot recover from a serious attack and ultimately close their doors. An APT attack could\nbe existential for some organizations, while for others, it may be survivable but still\ncatastrophic. The main point is that there are measures you can take now to minimize your\nrisk and to not do so would indeed be a sin.\n\nWe hope this information helps you reflect on whether you or your organization may have\ncommitted any of the transgressions noted above, and we at BlackBerry are always\navailable to help you prepare and benchmark your incident response planning, for the longterm health and success of your organization.\n\nIn Part 2, we will share more “deadly sins,” based on incident response lessons learned\nwhen actually experiencing an APT attack.\n\n### About BlackBerry Incident Response Services\n\n[BlackBerry® provides incident response that can help you mitigate the impact of any](https://www.blackberry.com/us/en/services/incident-response)\nbreach, ensure your recovery follows best practices, and secure your IT environment for the\nfuture. Our cybersecurity experts provide answers to your questions so you can protect your\nIT environment during the current attack and defend against future cyberattacks.\n\n_For similar articles and news delivered straight to your inbox, subscribe to the BlackBerry_\n**_blog._**\n\n\n-----\n\n## About Mark Stevens\n\n**[Mark Stevens was Technical Director of Incident Response at BlackBerry.](https://www.linkedin.com/in/markdavidstevens/)**\n\n## About Rocky De Wiest\n\n**[Rocky De Wiest is a Principal Incident Response Consultant.](https://www.linkedin.com/in/rocky-de-wiest-ir-00b2a1b/)**\n\n## About The BlackBerry Incident Response Team\n\n**[The BlackBerry Incident Response team is made up of world-class consultants dedicated](https://www.blackberry.com/us/en/services/incident-response)**\nto handling response and containment services for a wide range of incidents, including\nransomware and Advanced Persistent Threat (APT) cases. If you’re battling malware or a\nrelated threat, you’ve come to the right place, regardless of your existing BlackBerry\nrelationship. We have a global consulting team standing by to assist you, providing around[the-clock support where required, as well as local assistance. Please contact us here.](https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incident-response-containment)\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-21 - The 13 Deadly Sins of APT Incident Response — Part 1.pdf"
    ],
    "report_names": [
        "2022-07-21 - The 13 Deadly Sins of APT Incident Response — Part 1.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930823,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1685883557,
    "ts_modification_date": 1685883557,
    "files": {
        "pdf": "https://archive.orkl.eu/6c73b3f6d0ac68758276cb28587c6c40fdcb5288.pdf",
        "text": "https://archive.orkl.eu/6c73b3f6d0ac68758276cb28587c6c40fdcb5288.txt",
        "img": "https://archive.orkl.eu/6c73b3f6d0ac68758276cb28587c6c40fdcb5288.jpg"
    }
}