{
    "id": "b75fa473-4f9c-463b-b366-91f3a8fe2142",
    "created_at": "2023-01-12T15:02:34.510587Z",
    "updated_at": "2025-03-27T02:08:40.655654Z",
    "deleted_at": null,
    "sha1_hash": "52a01cf7882544e3e799ad2bf748895ec97db6c9",
    "title": "2021-05-03 - Exploitation of data breaches for executive protection",
    "authors": "",
    "file_creation_date": "2022-05-28T17:38:30Z",
    "file_modification_date": "2022-05-28T17:38:30Z",
    "file_size": 364684,
    "plain_text": "# Exploitation of data breaches for executive protection\n\n**[xorl.wordpress.com/2021/05/03/exploitation-of-data-breaches-for-executive-protection/](https://xorl.wordpress.com/2021/05/03/exploitation-of-data-breaches-for-executive-protection/)**\n\nMay 3, 2021\n\n[leave a comment »](https://xorl.wordpress.com/2021/05/03/exploitation-of-data-breaches-for-executive-protection/#respond)\n\nPeople that know me or work with me are well aware of my efforts to expand the scope of\n[threat intelligence functions beyond the cyber domain. I have published](https://xorl.wordpress.com/2021/01/26/passive-collection-of-satellite-traffic-for-threat-intelligence/) [posts,](https://xorl.wordpress.com/2020/08/20/the-role-of-linguists-in-threat-intelligence-teams/) [presented](https://xorl.wordpress.com/2021/01/21/deepintel-2020/) use\ncases, and have done a lot practical application of that with various organizations in both the\nprivate and public sectors. And just to be clear, I’m not a lawyer so make sure you do your\ndue diligence, and as always, everything mentioned here is my personal views and are not\nrelated by any means with my employer.\n\nNow one topic I’d like to cover here is how can a threat intelligence capability exploit the\nincredible amount of breached data that are constantly appearing to improve Executive\nProtection (EP). I’ll pick two examples here:\n\nFacebook data breach (533 million accounts)\nDating & adult websites breaches (there are like a dozen in just Q1 2021)\n\n**Facebook use case**\n\nData breaches almost always provide some information that you didn’t have before. For\nexample, the Facebook one allows high confidence correlation of an email with a phone\nnumber and a Facebook account (at a minimum). Here are two ideas on how to exploit this\nfor actionable EP (also sometimes called protective) intelligence:\n\n\n-----\n\n1. Look if details of your executives or their family members are leaked. If so, recommend\n\nthem to change their phone numbers or be prepared to receive fake threats, phishing\nlinks, etc. If you implement proactive security controls on mobile phones (via some\nMDM solution), then you can even mark those as high risk accounts due to the\ndiscovered breached data.\n2. Use the breached data to enrich your analysis on individuals threatening your\n\nexecutives. For example, search if the phone number corresponds to a Facebook or\nemail account and vice versa. Once you have a lead, build a threat actor profile and\nshare it with the appropriate law enforcement agency along with the threat your\nexecutive received.\n\n**DATING & ADULT WEBSITES use case**\n\nI had a quick look in two data sets from recent data breaches of such websites (one popular\ndating website and an adult content one) and identified over 3000 registered users with\ncorporate email addresses, and even some from government email addresses. If I was a\ncriminal or a foreign intelligence service, that would be a treasure trove. I could use that for\nextortion, recruitment, or any other malevolent action. Now, as a threat intelligence function\nwe can also exploit this and here are a couple of ideas for that:\n\n1. If you identified such records, proactively notify the victims with a carefully crafted\n\nexplanation of how those data are likely to be used in the near future for sextortion\nscams, blackmail, or even recruitment pitches. Recommend them to change those\ncontact details to avoid this threat altogether recommend the use of fake personas for\nsuch websites in the future.\n2. If you identified a threat actor that was after your executives using any of those\n\nwebsites, then use it when building their psychological profile and exploit it as a lure to\ntrick them into providing you more details (whether this is through elicitation or\ntechnical means).\n\nI want to stress the fact that those two are just some examples. Each data breach provides\nanother piece to the puzzle a person’s online life, and given enough of them you can have an\nincredible amount of detail which could be utilized in dozens of threat intelligence areas.\nHere I focused on EP but the same data are priceless for:\n\nAttribution & de-anonymization\nThreat actor profiles\nThreat actor tracking\nMalware analysis enrichment\nThreat actors/groups correlation\nFraud investigations enrichment\netc.\n\nWritten by xorl\n\n\n-----\n\nMay 3, 2021 at 12:30\n\n[Posted in threat intelligence](https://xorl.wordpress.com/category/threat-intelligence/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-03 - Exploitation of data breaches for executive protection.pdf"
    ],
    "report_names": [
        "2021-05-03 - Exploitation of data breaches for executive protection.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535754,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653759510,
    "ts_modification_date": 1653759510,
    "files": {
        "pdf": "https://archive.orkl.eu/52a01cf7882544e3e799ad2bf748895ec97db6c9.pdf",
        "text": "https://archive.orkl.eu/52a01cf7882544e3e799ad2bf748895ec97db6c9.txt",
        "img": "https://archive.orkl.eu/52a01cf7882544e3e799ad2bf748895ec97db6c9.jpg"
    }
}