{
    "id": "b7971505-568b-4842-905a-39fabdb584f0",
    "created_at": "2023-01-12T14:59:42.121587Z",
    "updated_at": "2025-03-27T02:05:46.400015Z",
    "deleted_at": null,
    "sha1_hash": "7de535b03f8f542cddc65ed0b42ec3b6bafc1d39",
    "title": "2021-05-14 - DarkSide Ransomware Gang Quits After Servers, Bitcoin Stash Seized",
    "authors": "",
    "file_creation_date": "2022-05-28T04:11:05Z",
    "file_modification_date": "2022-05-28T04:11:05Z",
    "file_size": 101403,
    "plain_text": "# DarkSide Ransomware Gang Quits After Servers, Bitcoin Stash Seized\n\n**[krebsonsecurity.com/2021/05/darkside-ransomware-gang-quits-after-servers-bitcoin-stash-seized/](https://krebsonsecurity.com/2021/05/darkside-ransomware-gang-quits-after-servers-bitcoin-stash-seized/)**\n\n[The DarkSide ransomware affiliate program responsible for the six-day outage at Colonial](https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/)\n**Pipeline this week that led to fuel shortages and price spikes across the country is running**\nfor the hills. The crime gang announced it was closing up shop after its servers were seized\nand someone drained the cryptocurrency from an account the group uses to pay affiliates.\n\n“Servers were seized (country not named), money of advertisers and founders was\ntransferred to an unknown account,” reads a message from a cybercrime forum reposted to\nthe Russian OSINT Telegram channel.\n\n\n-----\n\n“A few hours ago, we lost access to the public part of our infrastructure,” the message\ncontinues, explaining the outage affected its victim shaming blog where stolen data is\npublished from victims who refuse to pay a ransom.\n\n“Hosting support, apart from information ‘at the request of law enforcement agencies,’ does\nnot provide any other information,” the DarkSide admin says. “Also, a few hours after the\nwithdrawal, funds from the payment server (ours and clients’) were withdrawn to an unknown\naddress.”\n\nDarkSide organizers also said they were releasing decryption tools for all of the companies\nthat have been ransomed but which haven’t yet paid.\n\n“After that, you will be free to communicate with them wherever you want in any way you\nwant ” the instructions read\n\n\n-----\n\nThe DarkSide message includes passages apparently penned by a leader of the REvil\nransomware-as-a-service platform. This is interesting because security experts have posited\nthat many of DarkSide’s core members are closely tied to the REvil gang.\n\nThe REvil representative said its program was introducing new restrictions on the kinds of\norganizations that affiliates could hold for ransom, and that henceforth it would be forbidden\nto attack those in the “social sector” (defined as healthcare and educational institutions) and\norganizations in the “gov-sector” (state) of any country. Affiliates also will be required to get\napproval before infecting victims.\n\nThe new restrictions came as some Russian cybercrime forums began distancing\nthemselves from ransomware operations altogether. On Thursday, the administrator of the\npopular Russian forum XSS announced the community would no longer allow discussion\nthreads about ransomware moneymaking programs.\n\n“There’s too much publicity,” the XSS administrator explained. “Ransomware has gathered a\ncritical mass of nonsense, bullshit, hype, and fuss around it. The word ‘ransomware’ has\nbeen put on a par with a number of unpleasant phenomena, such as geopolitical tensions,\nextortion, and government-backed hacks. This word has become dangerous and toxic.”\n\nIn [a blog post on the DarkSide closure, cyber intelligence firm Intel 471 said it believes all of](https://www.intel471.com/blog/darkside-ransomware-shut-down-revil-avaddon-cybercrime)\nthese actions can be tied directly to the reaction related to the high-profile ransomware\nattacks covered by the media this week.\n\n“However, a strong caveat should be applied to these developments: it’s likely that these\nransomware operators are trying to retreat from the spotlight more than suddenly discovering\nthe error of their ways,” Intel 471 wrote. “A number of the operators will most likely operate in\ntheir own closed-knit groups, resurfacing under new names and updated ransomware\nvariants. Additionally, the operators will have to find a new way to ‘wash’ the cryptocurrency\nthey earn from ransoms. Intel 471 has observed that BitMix, a popular cryptocurrency mixing\nservice used by Avaddon, DarkSide and REvil has allegedly ceased operations. Several\napparent customers of the service reported they were unable to access BitMix in the last\nweek.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-14 - DarkSide Ransomware Gang Quits After Servers, Bitcoin Stash Seized.pdf"
    ],
    "report_names": [
        "2021-05-14 - DarkSide Ransomware Gang Quits After Servers, Bitcoin Stash Seized.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535582,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653711065,
    "ts_modification_date": 1653711065,
    "files": {
        "pdf": "https://archive.orkl.eu/7de535b03f8f542cddc65ed0b42ec3b6bafc1d39.pdf",
        "text": "https://archive.orkl.eu/7de535b03f8f542cddc65ed0b42ec3b6bafc1d39.txt",
        "img": "https://archive.orkl.eu/7de535b03f8f542cddc65ed0b42ec3b6bafc1d39.jpg"
    }
}