{
    "id": "b7cb1238-b141-4927-aa0c-7dc58a157484",
    "created_at": "2023-01-12T15:00:26.360149Z",
    "updated_at": "2025-03-27T02:06:14.008055Z",
    "deleted_at": null,
    "sha1_hash": "05b6bdf11cc6ae43ea8250606b870b3be2f18b24",
    "title": "2021-04-28 - Spotting malicious Excel4 macros",
    "authors": "",
    "file_creation_date": "2022-05-29T10:37:58Z",
    "file_modification_date": "2022-05-29T10:37:58Z",
    "file_size": 1783878,
    "plain_text": "# Spotting malicious Excel4 macros\n\n**[blog.reversinglabs.com/blog/spotting-malicious-excel4-macros](https://blog.reversinglabs.com/blog/spotting-malicious-excel4-macros)**\n\n[Threat Research | April 28, 2021](https://blog.reversinglabs.com/blog/tag/threat-research)\n\nBlog Author\n[Karlo Zanki, Reverse Engineer at ReversingLabs. Read More...](https://blog.reversinglabs.com/blog/author/karlo-zanki)\n\n\n-----\n\n## Introduction\n\nExcel4 (XLM) macros are a legacy scripting language introduced in 1992. They are a\npredecessor to the more advanced VBA scripting language introduced the following year.\nBecause of the backward compatibility issues, modern Microsoft Office versions kept the\nsupport for this type of macros.\n\nThe reason why this old and rudimentary technology is interesting to malicious actors is\nbecause it still provides ways to access powerful functionalities such as interaction with the\noperating system. Additionally, security solutions have a lot of problems detecting threats\nthat use this almost forgotten technology and, since a lot of companies still have some\nprocedures depending on such XLM macro documents, blocking them completely isn’t an\noption.\n\nDue to recent spikes in malicious Excel 4.0 macro use, security research has become\n[focused on the detection of such threats. One of our previous blog posts goes to describe](https://blog.reversinglabs.com/blog/excel-4.0-macros)\nhow to recognize the presence of these macros in Excel documents by using YARA rules.\nSince that blog was published, we’ve made a lot of improvements to our Titanium Platform\nthat enable automated identification and extraction of Excel 4.0 macros. The latest static\nanalysis engine also defines 327 new human-readable static behavior indicators focused on\nthese macros. They help describe the intent behind the code of the analyzed document, and\nserve as a base for the improvements in our Explainable Machine Learning detection\ncapabilities. The goal of this blog is to showcase the benefits of these improvements with\nrespect to detecting the latest Excel malware macro threats.\n\n## Statistical data\n\n\n-----\n\nFor the purposes of this blog, we collected all Excel documents that appeared for the first\ntime in our TitaniumCloud since November 2020. These documents were then processed\nwith our static analysis engine which identified that almost 160,000 of them use Excel 4.0\n(XLM) macros.\n\nAmong these 160,000 Excel 4.0 documents, more than 90% were classified by\nTitaniumCloud as malicious or suspicious. Staggering numbers that show that, if you\nencounter a document that contains XLM macros, it is almost certain that its macro will be\nmalicious. It makes sense given that XLM macros are a legacy Office option at this point, and\nthere is just a small chance that new documents would use them instead of more “modern”\nVBA macros.\n\nClassification distribution of documents containing XLM macros\n\nWe also looked at the distribution of malicious documents over time to determine if malicious\nactivities spike during some certain dates. For this research, we only count unique samples\nto prevent mass malware mailing campaigns from tilting the scales too much. That gives us a\nmore realistic view of malicious actor activities during this period.\n\n\n-----\n\nTime distribution of documents containing XLM macros\n\nThe graph shows that there was a significant increase in the number of encountered\nmalicious samples at the end of November 2020. The largest peak on the graph is just\naround November 27th, and coincides with last year's Black Friday event. This is somewhat\nexpected, as such events are a good opportunity for malicious actors to lure their targets into\nopening malicious content.\n\nOne, perhaps unexpected, anomaly is that there was next to no activity around Christmas\nand New Year. Perhaps malicious actors took some time off during the holidays, as the\nvolume of malicious Excel 4.0 macros picked up in January, just in time for Valentine's day\n\n\n-----\n\nshopping spike. Malware, as most human activity, appears to be seasonal.\n\nMalware family distribution\n\nLooking at the malware families detected in the sample set shows that ZLoader and Quakbot\nare the dominant malware families in the Excel 4.0 malware ecosystem, as they comprise\nmore than half of our dataset. Next, we will cover how new Titanium Platform features can\nhelp you recognize these threats.\n\n## Quakbot sample\n\nSample with the c1977f91f6b30995432bc2f757934ba6bfab5438 SHA1 hash was analyzed\nusing Titanium Platform. The analysis report shows that we are dealing with a malicious\nsample from the Quakbot family.\n\n\n-----\n\nSample’s classification summary\n\nActors behind Quakbot often distribute their payloads in the form of an Excel document.\nThey try to mask these documents to look like they are encrypted using the DocuSign\nsoftware, and they try to convince their targets to enable macros in order to decrypt the\ncontent. Such messages can look quite convincing. This is the image that Titanium Platform\nextracted from the analyzed sample during static analysis.\n\n\n-----\n\nMessage used to lure targets into enabling macros\n\nThe Titanium Platform’s report shows that 5 embedded files with indicators have been\nextracted from this document. Even by just looking at this short summary, it is evident that\nthis document calls a procedure from another DLL, or a similar code resource, and that it\nexecutes another application. Such behaviour can often be quite dangerous, and should\nimmediately attract analyst attention.\n\nEmbedded files with indicators\n\nThe detailed list of the extracted files shows that 3 files with Excel 4.0 macros in them have\nbeen extracted from this sample. And, as our statistics show, there is a great chance that\nthese are used for malicious purposes. That warrants a deeper look.\n\nExtracted files\n\n\n-----\n\nThe metadata extracted from the document shows where to start looking. This document has\na cell defined as Auto_Open. This is a typical way for documents with Excel 4.0 macros to\nautomatically start their execution from a specific cell upon opening, and is similar to an entry\npoint in PE executables. So, the execution starts in the extracted file Files1, from cell A40.\n\nDocument metadata with Auto_Open cell\n\nWhen using Titanium Platform to check if some file is malicious, usually the first thing to\ncheck are indicators extracted during static analysis. Indicators represent a human-readable\nsummary of interesting capabilities discovered in the analyzed sample. In order to provide\nthreat analysts with explainable detection, each indicator includes a textual description and\npinpoints the part of the file that triggered it. In this case, looking at the indicators for the\nextracted file, Files1 suggests that it runs another macro using the RUN XLM macro function.\n\n\n-----\n\nFiles1 indicators\n\nExcel files are usually displayed like tables, and malware authors use that to visually hide\nsome content by placing it into cells outside the default screen view. These can only be\nfound with a lot of scrolling. Titanium Platform has a preview feature that, in the case of Excel\ndocuments, shows only the textual content of the file. It enables quick access to the\ninteresting bits of content.\n\nCell A40 was defined as the Auto_Open cell, but there is no macro content in that cell. This\nis because Excel 4.0 macros, when executed, automatically skip empty cells and proceed\nthe execution to the first following cell which has actual content. Which is in this case found\nat A51. That cell redirects to another, R59, inside the same sheet, which in turn references\nthe “Files3” sheet and redirects execution to it. Below these two cells is another one\ncontaining a suspicious looking URL. Performing this quick analysis already revealed\nbehaviour that can’t be expected from any legitimate document.\n\nPreview of the “Files1” extracted file contents\n\nSince the execution is now redirected to the \"Files3\" sheet, the next step is to look at its\nstatic behavior indicators. Besides executing other macros, this sheet also uses the CALL\nfunction, which is often used to call Windows APIs. Such powerful features are one of the\nreasons malicious actors like XLM macros. Indicators also show that the CONCATENATE\nfunction is used, which is often weaponized by some obfuscation techniques.\n\n\n-----\n\nFiles3 indicators\n\nLooking at the preview shows the raw content, revealing that the data inside this sheet is\nobfuscated. CALL functions parameters are concatenated from letters and cell values from a\ndifferent sheet named lbuyf, which serves as some kind of a dictionary.\n\nPreview of the “Files3” extracted file contents\n\nValues in the lbuyf sheet are calculated at runtime using basic mathematical functions to get\nASCII values of characters, and then concatenated into literals used from other XLM macro\nfunctions.\n\n\n-----\n\nPart of the lbuyf extracted file contents\n\nAfter deobfuscating the Files3 sheet, it becomes visible that it calls the CreateDirectoryA\nfunction from kernel32.dll, and then redirects execution to the Files2 sheet. Again, going\nback to its indicators, besides the already seen CALL and RUN functions, it also executes\nanother application using the EXEC macro.\n\nFiles2 indicators\n\nFile preview shows code sequences similar to the ones seen in the Files2 sheet.\nDeobfuscating the strings shows that, after calling the function URLDownloadToFileA from\n_URLMon library and downloading the file from the suspicious URL seen in the Files1 sheet, it_\nfinally executes that second stage payload. Not something uncommon for these malicious\nXLM documents.\n\n\n-----\n\nPreview of file contents extracted from Files2\n\nBut what to do when a larger file is encountered and when manual inspection is impractical?\nGoing back through the process, it is obvious that all these major steps in file behaviour are\nvisible by merely looking at the indicators and without going into detailed inspection. This is\n[where our Explainable Machine Learning comes to aid.](https://www.reversinglabs.com/products/explainable-machine-learning)\n\n## Explainable Machine Learning\n\nTitanium Platform’s machine learning classification is based entirely on human readable\nindicators. Created to identify which of these static behavior indicators contribute to the final\nthreat detection verdict. Furthermore, each of these indicators is also linked to a MITRE\nATT&CK framework category, thus helping SOC analysts understand the type of threat they\nare dealing with and its impact on the organization. As mentioned earlier, the latest Titanium\nPlatform update defined 327 new human-readable Excel 4.0 static behavior indicators. They\ndescribe various categories of behaviour. Including defense evasion, network\ncommunication, execution and file manipulation.\n\nThe capabilities of Titanium Platform’s machine learning classification will be demonstrated\non a real-world sample with the bbcd9e57ef75c56ea57ba6f3b83a7f82128dff8e SHA1 hash.\nNone of Titanium Platform’s cloud scanners classified this sample as malicious during the\nanalysis, but our new machine learning model did.\n\nML classification of the bbcd9e57ef75c56ea57ba6f3b83a7f82128dff8e sample\n\n\n-----\n\nAs visible from the above image, the classification was based on propagation from an\nextracted file with the 5fe7587cebbd400dbb8e05501987784d4ea3028e SHA1 hash. Looking\nat the list of the extracted files shows that this file, named Sheet6, contains Excel 4.0\nmacros. The Auto_Open cell in the container document also points to this file (Auto_Open:\nSheet6!A2).\n\nExtracted files\n\nEven though there aren’t many extracted indicators in this relatively small file, there were\nenough of them for the machine learning model to classify it as malicious. The file obviously\ncalls procedures from some library and delays the macro execution. These two indicators\ncombined should always attract threat analyst attention.\n\nIndicators extracted from the 5fe7587cebbd400dbb8e05501987784d4ea3028e sample\n\nStill, to fully understand the malicious functionality, file contents need to be previewed and\nmacro logic needs to be followed through documents. To achieve all of its capabilities,\n_Sheet6 references other sheets in the document._\n\n\n-----\n\nPreview of the\n\nSheet6 content\n\nFor example, Sheet3 contains the Base64-encoded payload. Sheet2 serves as a dictionary\nand contains obfuscated string literals used to construct the CALL functions. The following\nimage shows some of the obfuscated string literals, most of which can be recognized with\nlittle effort.\n\nPart of the Sheet2\n\ncontent\n\nThis dropper lives off the land by using the certutil binary to decode its Base64-encoded\npayload, and to convert it from HEX to binary representation. Finally, it executes the payload\nusing rundll32. The binary payload is a DLL file with the\n78c01aa4f88d35acfbc3d7142232cd1aa7682a6e SHA1 hash. It exports a function named D,\nwhich tries to download the next payload stage from the following location:\n_“hxxp://207[.]154.235[.]218/campo/z/z”. Unfortunately, this second layer payload can no_\nlonger be downloaded from this URL for a more detailed analysis.\n\n## Conclusion\n\nStatistics show that the malicious actors have adopted Excel 4.0 documents as a way of\ndistributing their malware. This method has been here for more than a year and the number\nof newly seen samples isn’t dropping. The share of malicious samples in the total number of\nExcel 4.0 documents exceeds 90%, and, since a lot of well known malware families like\nQuakbot, ZLoader and Trickbot have been seen using them, we can expect these numbers\nto keep growing as more malware families pivot to this initial stage vector. The biggest risk\n\n\n-----\n\nfor the targeted companies and individuals is the fact that security solutions still have a lot of\nproblems with detecting malicious Excel 4.0 documents, making most of these slip by\nconventional signature based detections and analyst written YARA rules.\n\nReversingLabs continuously improves its detection mechanisms to keep up to date with\nmalware trends. Latest improvements to Titanium Platform tackled the threats related to XLM\nmacros and provided a way to reliably identify and extract such content. With the upcoming\nadditions to our Explainable Machine Learning models based on the extracted Excel 4.0\nindicators, Titanium Platform is now fully capable to successfully detect such threats in a\nquick and scalable way with static analysis. This can help block malicious documents before\nthey enter your organizational network.\n\nAs a final thought regarding Excel 4.0 threats, even though backward compatibility is very\nimportant, some things should have a life expectancy and, from a security perspective, it\nwould probably be best if they were deprecated at some point in time. Cost of maintaining 30\nyear old macros should be weighed against the security risks using such outdated\ntechnology brings.\n\n## IOC list\n\nc1977f91f6b30995432bc2f757934ba6bfab5438\n\nbbcd9e57ef75c56ea57ba6f3b83a7f82128dff8e\n\n78c01aa4f88d35acfbc3d7142232cd1aa7682a6e\n\nRead other Related Blogs:\n\n[Excel 4.0 Macros](https://blog.reversinglabs.com/blog/excel-4.0-macros)\n\n### MORE BLOG ARTICLES\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-28 - Spotting malicious Excel4 macros.pdf"
    ],
    "report_names": [
        "2021-04-28 - Spotting malicious Excel4 macros.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535626,
    "ts_updated_at": 1743041174,
    "ts_creation_date": 1653820678,
    "ts_modification_date": 1653820678,
    "files": {
        "pdf": "https://archive.orkl.eu/05b6bdf11cc6ae43ea8250606b870b3be2f18b24.pdf",
        "text": "https://archive.orkl.eu/05b6bdf11cc6ae43ea8250606b870b3be2f18b24.txt",
        "img": "https://archive.orkl.eu/05b6bdf11cc6ae43ea8250606b870b3be2f18b24.jpg"
    }
}