{
    "id": "b7e33629-6ba9-417a-8560-603ddebaa7e8",
    "created_at": "2023-06-05T02:07:46.603611Z",
    "updated_at": "2025-03-27T02:13:16.565859Z",
    "deleted_at": null,
    "sha1_hash": "85c2dbe00aedc594f3106e2f5ac8c00882e96040",
    "title": "2022-10-24 - Chapter 1 — From Gozi to ISFB- The history of a mythical malware family.",
    "authors": "",
    "file_creation_date": "2023-06-04T12:24:01Z",
    "file_modification_date": "2023-06-04T12:24:01Z",
    "file_size": 855969,
    "plain_text": "# Chapter 1 — From Gozi to ISFB: The history of a mythical malware family.\n\n**[medium.com/csis-techblog/chapter-1-from-gozi-to-isfb-the-history-of-a-mythical-malware-family-82e592577fef](https://medium.com/csis-techblog/chapter-1-from-gozi-to-isfb-the-history-of-a-mythical-malware-family-82e592577fef)**\n\nBenoit ANCEL October 24, 2022\n\n-\n**Disclaimer:**\n\n\n-----\n\nThis article does not contain any IOCs or infrastructure details. Instead, the aim is to explain\nthe whole business dynamic of a long-lasting malware family. This work is based on almost\n10 years of research and intel gatherings and tries its best to stick to the truth and the facts\nobserved around ISFB. Hopefully, it will give some insight on how the top cyber crime groups\nhave been working over the years.\n\n## A 10 years journey\n\nFor the last 10 years, a certain malware family has caused lot of ink flow and left a lot of\npeople confused: ISFB. With this series of articles, I aim to illustrate the whole journey from\nthe early start, over the leak of Gozi 1, to the recent mutation of ISFB into LDR4. It is a very\nlong and intense journey to describe, so I will try my best to be as rigorous as possible to\nfinally document what ISFB has been doing since 2012.\n\nIn chapter 1, the first steps of our journey will describe where ISFB originates from. Its history\nhas caused extreme public confusion, so we will break down the different branches of ISFB\nstep-by-step and explain how we end up in the current situation of 2022.\n\nOnce the ISFB ecosystem is uncovered, I will focus on the business and the threat actors in\na 2nd chapter. With the technical analysis of the different ISFB branches being already\nextremely well documented, I will go through years of daily operation of the ISFB crew, from\nthe developer organisation to the affiliates and their connection. That will address some\nunanswered questions and show how the ISFB groups are tightly connected to high ranking\ngroups like Evil Corp.\n\n## What is ISFB?\n\nFirst of all, what is ISFB? ISFB is a malware family encapsulating a whole set of tools\nprimarily used to defraud online banking accounts; it is a banking trojan. ISFB is not the first\nof its kind, the features available are somewhat like the Zeus trojan, just way more\nadvanced.\n\nISFB evolved over the years, and we have seen features like:\n\n: the malware can collect local information about the victim computer, OS type, IP\naddress, computer name, list of Anti-Virus applications, check if the computer is\nattached to a Domain Controller etc.\nIt can load a 2nd stage attack as EXE or DLL or execute any command through\nCMD/Powershell.\n: ISFB can steal the clipboard and every keystroke from the infected PC. Furthermore,\nthe malware injects itself into the web browser and capture every HTTP POST request,\nwhich makes credential and stealing credit card easy.\n\n\n-----\n\nThe main feature of the module is injecting code into the web browser that will monitor\nwhich websites the victims are visiting. If a banking website is identified, ISFB injects a\nsmall snippet of JavaScript into the online banking website to steal the login\ncredentials. This is commonly known as web injection, a technique commonly used by\nbanking trojans. ISFB introduced an evolution to that attack with their Replacers. ISFB\ninjects the web browser and checks for opened websites, if it identifies a bank from its\nconfiguration file, instead of injecting JavaScript, ISFB redirects the victim into a cloned\nwebsite of the banking login, completely controlled by the ISFB operator while keeping\nthe legit URL in the address bar. That allows the attacker to have direct access to a\nvictim and for example bypass 2FA without having access to the victim’s smartphone.\nTo assist the web-injects/replacers, ISFB offers a VNC and reverse socks proxy\nmodule. Once the operator has obtained the online banking credentials, they need to\nlog into the account while bypassing the anti-fraud protection. To achieve this, they wait\nfor the victim to be online, and if the anti-fraud protection is only based on the IP, they\nuse a socks proxy. If the anti-fraud is based on browser fingerprint, IP, and behavior\n(like most modern banks), they would use VNC and login directly from the victim\ncomputer remotely.\nISFB can record the screen if a victim is visiting a specific website. The fraudsters can\nthen study how a victim is usually moving money with the online banking account.\nOnce they have gained enough knowledge about a target, they can reproduce the\nsame behaviour to move money without triggering any suspicious behaviour anti-fraud\nmechanisms during the transfer.\n: not all the ISFB forks have it, but the email stealer is an important component. The\nstealer is used to detect email software like Outlook and steal the credentials and the\ncontacts list. The operators are known to use that feature to maintain a constant feed of\nfresh login credentials for SMTP accounts, plus a list of valid emails to spam. Those\ncorporate contact lists often include clients and partners of a company, which in turn,\ngives the spammer high value spam targets.\nA module that makes exfiltration of specific files from the victims hard drive possible. It\nis commonly used to steal BTC wallets as an example.\n\nISFB was created to defraud online banking but operators often use it as an entry point for a\nsecond stage attack such as ransomware or extortion.\n\n## Ursnif, CRM, Gozi, ISFB… what is going on ?\n\nTo understand where ISFB has spawned from you have to go back to the CRM/Gozi\nmalware, the Kuzmin Gang, and Service76. I am not going to dig into the Gozi story;\n[however, you can find great documentation from phishlabs article or through the very](https://www.phishlabs.com/blog/the-unrelenting-evolution-of-vawtrak/)\n[interesting podcast Malicious life (part1 and](https://podcasts.apple.com/us/podcast/gozi-part-1-the-rise-of-malware-as-a-service/id1252417787?i=1000455576583) [part2).](https://podcasts.apple.com/jo/podcast/gozi-part-2/id1252417787?i=1000456897917)\n\nLong story short:\n\n\n-----\n\nGozi v1 (Also called CRM1) was born around 2005 by combining several other\nmalwares (Ursnif was one of them). The malware is part of an operation from the\nKuzmin Gang.\nIn 2010 The Kuzmin Gang evolved Gozi v1 (CRM1) into Gozi v2 (CRM2) that 2 years\nlater became “Gozi 2 Prinimalka”, also called Vawtrak.\nWhen the Kuzmin Gang moved from Gozi v1 to Gozi v2, the v1 source code was sold,\nand later in 2010 the source code was leaked.\n\nLet’s take 2010 as a starting point. The Kuzmin Gang launches the big update of Gozi v2\nand as usual in the cyber-crime industry, once they moved to the v2, they sold the source\ncode of the v1. During that transaction, the source code unfortunately leaked due to a non\nprotected download link. It doesn’t matter much for our story who originally bought the Gozi\nv1. The important part is that the Gozi v1 source code was sold, somebody snagged the\ncode, rewrote it, and started a new empire: ISFB.\n\nISFB was born in 2011/2012 as a highly modified version of the source code of Gozi v1.\nOver the years, the code has moved further and further away from the original Gozi v1, but\nthis is where our story begins.\n\nThe infosec industry created several conventions to name ISFB, leaving the developer of\nISFB quite irritated. During a discussion between a client asking for anti-reverse features and\nthe ISFB developer, the developer said: “If they still call all the branches Gozi, although from\nGozi there is only a request format with ID, group and server number […], we don’t need\nanti-reverse”. You may have heard of ISFB through the names Ursnif, Papras, Gozi or even\nsometime Rovnix, but, really, it is most of time ISFB. The signature names don’t matter much\nin the end as long as the threat is blocked, but to easier understand our story I will call them\nby their internal names.\n\n## ISFB is born\n\nAround 2011, a very skilled system developer is looking around for a new project. For some\nreason he is looking for a fresh start in the cyber-crime industry, he has solid development\nskills and luckily for him, the Gozi v1 source code had recently leaked. Let us call him\nISFB_Coder.\n\nISFB_Coder retrieved the code of Gozi v1, started editing it, and created a whole business\naround it.\n\nHe started by versioning the code as if the fork of Gozi v1 was “CRM2” or ISFB. Both those\nnames are officially still inside the source code today, and lots of references to CRM can be\nfound. Note that it is not the same CRM2 as Vawtrak!\n\n\n-----\n\nThis whole phase of rewriting the code of Gozi v1 took a serious amount of work. We had to\n[wait until 2013 to discover the first traces of ISFB in the wild. A fair amount of the gap](https://www.fortinet.com/blog/threat-research/dreambot-2017-vs-isfb-2013)\nbetween 2011 and 2013 was for sure due to the development and the testing of the malware,\nbut also due to a very probable private usage of ISFB_Coder’s for a few times.\n\n## ISFB Versioning: the nightmare\n\nOnce ISFB_Coder was ready to open his product up to partners and make way more money,\nhe took ISFB (CRM2) and split it into several branches over the years.\n\nISFB is not one unique product, it’s a range of products. Each major versions has its own\nfeatures. Some ISFB versions are exclusive to one group, other branches have been totally\nresold as a service like IAP or the public branch of Dreambot. The main thing that\nISFB_Coder tries to avoid is to share the source code of the bot. Sharing too much of the\nsource code inevitably leads to a public leak, as he previously experienced in 2015 when\none of his partners publicly leaked the source code of a branch of ISFB.\n\nWe suppose that ISFB versions started at version 2.00.000 up to now 3.x.xxx. Each major\nversions has its own features and each major versions has its own subbranches with custom\nfeatures.\n\nSome major branches as example:\n\nUsed to be the IAP/Dreambot early branch after 2.12.xxx, with the first integration of\nTor onion as available C2.\nThe bot uses content compression (gzip).\nUses a loader instead of a direct DLL.\nUsed to be an evolution of 2.16 mainly (but not only) used by IAP2 and the end of\nDreambot.\nOriginally meant as a loader for WastedLocker, the code ended up used by the IAP2.\ncomplete rewrite of the network protocol, this branch was — and still is — the most\nexclusive and prestigious one.\n\nEach major branch has subbranches, some private, some public, and despite having for\nexample the branch 2.17, some customers still prefer to stay with the 2.15 or 2.16. Not\neverybody moves to the latest versions.\n\nTo recap, ISFB_Coder is a development company, developing a product that he also makes\nuse of personally. The core of his product is ISFB, and he offers custom features for trusted\npartners across a wide range of ISFB versions.\n\nIn addition to this fact, we know ISFB is not the only product on ISFB_Coder’s shelves. As\nfor example, he sold a ransomware in 2019 (WastedLocker) and his coding style is noted\n[around other malware families like Caberp, but for our story, will stay with ISFB.](https://journal.cecyf.fr/ojs/index.php/cybin/article/view/15)\n\n\n-----\n\nIn the following graph you can see the major branches of ISFB. The graph does not cover\nother projects that spawned out of the ISFB leak in 2015 (Saigon, Goznym…) or the small\ngroups using the malware, but it covers the most active campaigns around ISFB_Coder.\n\nThe important thing is: You cannot do threat intel on ISFB by solely looking at the bot\nversions. Completely different group of actors use the same versions, at the same time, and\nif you want to understand the threat correctly, you must look deeper into the binaries and\nbeyond. Small details like for example the algorithm of the config encryption distinguish\ndifferent versions. Some used RC6 some Serpent for the same bot version.\n\nI have tried to recap the different versions for the major branches over the years:\n\nPlease bear in mind that we only cover the major branches. We have observed other actors\nusing the v3, for example in Switzerland or Japan, or even a Goziat v3. Those campaigns\nbeing relatively small, and that story being long and confusing, I have chosen to leave them\nout for now.\n\n## CRM2: v2.xx.xxx\n\nAs explained, ISFB_Coder started his ISFB business from a fork of Gozi 1, that was branded\nas CRM2. At that time, CRM2 was the main and only version of ISFB available. CRM2.5 and\nCRM3 were both much later.\n\nThe plan was to have a core (CRM2) and to adapt it on demand for different partners. He\nwanted both private (exclusive) versions and an open “as-a-service” version, kind of like\nZeus was back then.\n\nThe “as-a-service” version is the less advanced version and has been sold to so many\ndifferent people over the time that it has become very complex to map out.\n\n## IAP /Dreambot/IAP2\n\nExample of sample IAP:\nffcb650b28719d3bde1b032b14cfe7f5d7f2a73878d752737da0ba8a4f8bb70c\n\nISFB_Coder being a system developer, he is not building a panel for ISFB. He will sell you\nthe bot, documentation for the API and then you must create a panel by yourself.\n\nFor a malware-as-a-service, as they tried to do it, that is an obvious problem. In 2014, the\nclients want a bot with a panel included. That’s where IAP came alive.\n\nIAP, discovered in 2014, is the name of a panel project built to control ISFB bot’s version\n[CRM2. In September 2014, Yurii Khvyl wrote a blogpost exposing the installation manual of](https://web.archive.org/web/20150111141639/https://www.csis.dk/en/csis/news/4472)\nIAP:\n\n\n-----\n\nTo develop this panel, ISFB_Coder partnered with a web developer. That developer was in\nthe close circle of the ISFB core group, and he ended up developing several panels for ISFB.\nThe one for IAP as mentioned but also the one for the “Global Network” branch. The\ndeveloper was not really appreciated by the ISFB core groups, described by some of his\npartners as “a unique kind of failure”, and ended up being arrested in 2016 in Kiev for his\nwork on ISFB. His arrest involved a shady story implicating ISFB_Coder and the partner\nowning RM3 but to jump to the point: Betraying the ISFB group leads to jail time.\n\nIAP panel looked like this back then:\n\nThis version was very popular between 2014 and 2016 and has been seen in a lot of\ndifferent countries around the world. IAP was not the first ISFB version used in the wild, but it\nwas the first one to gain large attention.\n\nManaging IAP took a lot of energy, so ISFB_Coder delegated the responsibility to a 3rd party\nmanager to deal with the business and bug reports, but with the panel developer doing jail\ntime, the project took a hit, and the business was in danger.\n\nMeanwhile, another version of CRM2 had been detected in the wild. It was an exclusive\npartner version from 2013 that offered Tor onion C2s. This actor was looking to replace IAP\nand called it Dreambot.\n\nExample of sample:\n7e0bf604d3ab673a519feb5d5375f0f88cf46e7cd1d3aa301b1b9fb722e9cef7\n\nThe partner who owned Dreambot asked for a fork with small features on demand and then\nopened the previous version of Dreambot for public sale.\n\nIAP and Dreambot were so alike, that at some point, the IAP bots were able to join Dreambot\npanels without any problems, because the malware network communication was exactly the\nsame.\n\nDreambot is a good example of the capabilities of ISFB. The partner who owned Dreambot\nrequested CRM2 to support Tor. ISFB_Coder strongly disagreed, explaining that deploying\nthe Tor lib would make the AV detection rates explode compared to the clear web C2.\n\nThe Dreambot owner is targeting US and CA, he is used to receiving a huge amount of\nabuse reports on his C2 and he really needed that Tor option. The Dreambot owner had\ndecided, with the help of the ISFB API Documentation, to develop his own Tor lib for ISFB\nand he incorporated it into Dreambot. ISFB is made in such a way that developing your own\nmodule is quite easy and well supported by ISFB_Coder.\n\n[That double version of Dreambot (private/public) was already observed by Proofpoint in](https://www.proofpoint.com/uk/threat-insight/post/ursnif-variant-dreambot-adds-tor-functionality)\n2016:\n\n\n-----\n\nThe config shown in the screenshot is for Dreambot private edition.\n\nThe public demand for the Tor lib ended up being so high that the Dreambot owner decided\nto give the source of his Tor lib to ISFB_Coder for free, for integration into the official\nsources. Peer pressure made ISFB_Coder bend on that one. We observed another ISFB\npartner with his own branch switching to Tor for the C2s and announcing losing around 30%\nof his bots due to Tor detection in corporate environments.\n\nIAP being dead, it was easy for Dreambot to fill the gap as the “as a service” branch with a\nbetter UI for the command & control server.\n\nThe first version of the panel was developed in Perl, and it is highly suspected that the\ndeveloper of the IAP panel helped with the first Dreambot panel. This panel was first\n[disclosed by Maciej Kotowicz at Botconf 2017 in his talk ISFB, Still Live and Kicking](https://www.youtube.com/watch?v=Nm7d_k0_yOM)\n\nThe first version of the panel:\n\nIt evolved into a better version, still in Perl:\n\nEnding up as a completely re-branded panel in PHP:\n\n[We tried to give some insight into several of the Dreambot affiliates, but the turnover being](https://medium.com/csis-techblog/the-end-of-dreambot-a-loved-piece-of-gozi-24cc9bfc8122)\ntoo high, and the affiliates working with Dreambot end up being too far away from the core\ngroup to be interesting for this story. That doesn’t undermine the colossal damage done by\nthese affiliates over the years all over the world though, from banking fraud to ransomware\nattacks.\n\nThe story of Dreambot ends in 2020. The whole branch evolving from 2.12.xxx in 2014, to\nend-of-life in version 2.17.xxx. The IAP project came back to life in 2018 as IAP2 and later as\n2.5, and after a test phase, all of the affiliates moved to IAP2 letting Dreambot to die in\npeace.\n\n## IAP2: back for good\n\nExample of sample:\nb74327fb49965c60d3d066788c5e0ece297187944e4336d6fea79135455f62fb\n\nWhile Dreambot was busy dying, another version took the lead: IAP2. IAP2 started in the\nwild in 2 versions, 2.14.xxx or 2.17.xxx (Standalone DLL or DLL combined with a Loader)\nand has been extremely active in Poland, Germany, and Italy, but also USA or Canada. It is\n[still distributed by spam in Italy today.](https://twitter.com/JAMESWT_MHT/status/1572204432527429637)\n\nThe first version of the panel was actually 2 panels, one for the loader (called “Lodiri”), and\nanother for the worker (called “Newadminka” dealing with webinjects, VNC etc). The loader\nwas deployed by the affiliates themselves, making it extremely exposed and vulnerable. The\n\n\n-----\n\naffiliates being usually sloppy people that don t care much about the malware they use, they\noften end up deploying the panel in insecure way or simply leaving the source code in a\npanel.zip file.\n\nIf you monitored ISFB between 2018 and 2020 you will probably remember all the samples\nwith the static encryption key “10291029JSJUYNHG”. That was IAP2.\n\nIAP2 “Lodiri” panel:\n\nIAP2 “Newadminka“ panel:\n\nAs for IAP1/Dreambot, the management was delegated to a 3rd party.\n\nAfter 2 years of business, IAP2 evolved into IAP2.5 in 2020, using the base CRM2.5. This\ntime, we noticed clues leading us to believe the developer of this panel is actually the admin\nof the Dreambot private / RM2 (goziAT) branch. This is the essence of the ISFB business;\nISFB_Coder is the developer, but the whole empire consists of a strongly linked pool of\naffiliates helping each other, year after year.\n\nThe new panel of IAP2.5 in 2020 is very similar to the RM3 panel, and is based on the\nframework SmartAdmin. The early panel is called “Hyper”. Later on it obtained the same\nname as the first RM3 panel: “P-II”:\n\nIAP2 was still active all around the world. In 2020 they even tried to develop their business in\nColombia, but without much success.\n\nThis kind of work on new business areas is typical from the 2020 “crisis”. Banking Trojan\noperators started to realize that collecting good volume of bots that can stay alive on a\ncomputer for long time is hard and that deploying ransomware was more profitable.\n\nIAP2 is still today very active in the wild and we will likely be seeing it around for a while,\nprobably until the RM3 branch is delegated to the as-a-service branch.\n\n**RM2/GoziAT**\n\nExample of sample (Dreambot private):\nf815a76a46034e200a7be1ccc319174da6bebed8426df7adac6374b5abc94f47\n\nBack to 2013. A very early adopter of ISFB is a partner with his own exclusive variant ISFB\nvariant. Heavily involved in the whole ISFB project, this partner “Expro”, is a professional\ndeveloper and a quite talented botmaster. Expro started his adventure with ISFB_coder in\n2012/2013 with the ISFB variant we call Dreambot private.\n\nExpro leads a group of old-time carders whose focus is on attacking Canada and USA. Both\nare seen as dangerous countries that most of the other partners do not want touch.\n\n\n-----\n\nThis is an amusing thing observed among several Russians threat actors in the carding\nindustry. They seem to be very afraid of the FBI, saying that they have big resources and\nthey are determined. Those criminals are dependent on many different American services\nlike Apple, Microsoft or even Google and they are very aware that the US law enforcement\ncould have access to that data quite easily.\n\nCombined with the fact that the US has a massive amount of cyber security companies\nlooking for fresh IOCs everywhere, it makes the threat actors more comfortable operating in\nEurope or Australia like ISFB. This misunderstanding of international cooperation between\nlaw enforcement has created some kind of legend that if you don’t touch the US you will has\nless problems with their law enforcement.\n\nBesides targeting the US and CA, Expro distributed his malware in a very broad way,\ndistributing large volumes (of spam, exploit kit, bundle…) to low quality targets (people with\nvery outdated OS, gaming computers, all the anti-malware sandboxes of the industry)\ninstead of a low volume to high quality targets.\n\nThe tactic somehow works but it caused Expro a lot of problems. As mentioned before,\nattacking the US in a noisy way attracted abuse reports on his infrastructure from AV\ncompanies, and so, he realized the need for specific features like Tor.\n\nExpro is a close partner to ISFB_coder. He develops and sells several panels for ISFB like\nthe one for RM3 or LDR4 (not for free) and is sharing resources with the ISFB partners.\n\nThe RM3 group and Expro are also very close to each other. The way they cooperate has\nmade them work together on a daily basis since 2012. For a long time, Expro hosted his\ninfrastructure inside the RM3 infrastructure, and both groups exchanged their experiences\nwith ISFB. They test and report bugs together, give feedback about each others variants,\nunionize together to push new feature requests to ISFB_coder, they even help each other\nwith OPSEC and backend protection issues.\n\nYou can still observe this relationship disclosed by Mandiant in the article “From RM3 to\nLDR4: URSNIF Leaves Banking Fraud Behind” where Expro is the developer of the LDR4\npanel.\n\nThe relation between RM3 and Expro is very interesting to study. Both doing business on\ntheir own and supporting each other. In part 2, I will dig deeper into the details of their\nrelationship, given that RM3 has such a dense life, it deserves its own article.\n\n[In 2018 Expro moved from Dreambot to a new update. Checkpoint named it GoziAT, as](https://research.checkpoint.com/2020/gozi-the-malware-with-a-thousand-faces/)\nreference to the frequent usage of .at tld used as C2.\n\nExample of sample (GoziAt):\n21a03d9c845e446cb96eba7c93aa6403b8a9aaa744801e77468bf73c0507d028\n\n\n-----\n\nGoziAT is now the common name for Expro s branch, but if we should respect the internal\nnaming convention, the most probable name would simply be “RM2”.\n\nThe RM2 branch used to have a static CnC beacon format. The bot sends its requests to a\nURL path like\n\n“/images/[encoded data].[avi|bmp|gif|jpeg]”\n\nAs mentioned in Checkpoint’s great analysis, in 2020 GoziAt was using a custom path,\nchanging time to time for example to /wpapi/, /rpc/, /wpx/…\n\nThis is because GoziAt is distributed in such a wild way, it’s very quickly detected by the AV\nengines. Expro tried to add some dynamic to ISFB.\n\nCheckpoint is also raising a valid point where they noticed “These campaigns tend to hang\n_on to the same domains and IP addresses for a relatively long time, which may not be the_\n_best choice opsec-wise”. This is explained by the fact that Expro is putting all his efforts in_\nthe onion C2s and not the clear web domains. In several campaigns none of the clear web\ndomains were working and only the onions were up.\n\nWhile Expro distributes in a very noisy way, he concentrated a lot of his efforts into hiding his\nbackend behind a layer of proxies, making him able to survive for very long time.\n\nWith the CRM2.5 available in 2020, Expro jumped on that boat and shifted to his own\nbranch, being basically GoziAt2.5/RM2.5.\n\nExample of sample (GoziAt2.5):\n1c2fd2e6d4f1e0e2ee23f4b9ae0ea061cc1f4b41a28ec184ce7e70d5be263e8f\n\nExpro is continuing his journey; you can still catch samples from his botnet spamming\n[campaigns in the US.](https://tria.ge/220909-vty3zacebm)\n\n## Global Network / RM3\n\nLast but not least, we have the Global Network / RM3 branches. These branches are\nprobably the most interesting group actor.\n\nManaged by a tyrannic boss, RM3_boss, this group works with the best. If they need to send\n[spam, they hire “Sagrid” (TA543) or TA547. If they need to cash out money, they use](https://twitter.com/kafeine/status/1233407086324781058)\nQQAAZZ. If they need help, they call [Maksim Yakubets from Evil Corp. It’s a powerful group](https://www.fbi.gov/wanted/cyber/maksim-viktorovich-yakubets)\nwith a sub-affiliates system generating a large amount of money.\n\nThey work more or less with the same business model since day one. In 2012/2013\nRM3_boss agreed to join the ISFB_coder project and bought his own branch dubbed “Global\nNetwork”.\n\n\n-----\n\nRM3_boss uses his branch in 2 ways:\n\nFor his own fraud team. Always focusing on AU and NZ and nothing else.\nFor a very selective set of affiliates always under his control.\n\nIf you want to use Global Network or RM3 from RM3_boss, you must deal with the sysadmin\nof RM3_boss and his infrastructure. You will never get access to any source code or server,\nRM3_boss provides access to a stub and credentials for a panel without root access. The\nwhole business is based on trust, all affiliates must cash the money stolen out via the\nRM3_boss cash out network.\n\nBy forcing affiliates to launder the stolen money via RM3_boss, it allows him to bill his\naffiliates with a percentage of every fraud conducted via RM3. RM3_boss has full visibility on\nevery fraud, takes his cuts and gives the rest back to the affiliates. He doesn’t care how\nmany victims the affiliates infect; he only cares about the stolen money. I will get deeper in\nthese terms in the part 2, but the way RM3_boss manages his business partners is a very\ninteresting case.\n\nIn 2013 ISFB CRM2, dubbed Global Network, was found spreading in Australia and New\nZealand. The focus on this area is because RM3_boss was convinced for years that the AVs\nindustry has no interest in these countries, despite them being very profitable targets for\nbanking Trojans. The low media attention allowed him to stay hidden for a long time.\n\nThe Global Network panel was looking like:\n\nBy opening Global Network up to a short list of affiliates, the malware extended its\npropagation to places like PL, UAE, IT, DE, UK, CN, CH, and CA. The affiliates around UK\nand IT ended up cooperating with RM3_boss from early 2013 and are still today in 2022 with\nLDR4 in UK.\n\nRM3_boss is a tyrant and a control freak; and that turns out to be the strength of the Global\nNetwork branch. He makes certain that his malware campaigns never leak publicly, and if\nthat should happen anyway, RM3_boss would drop financial penalties on the responsible\nload seller. He spends time reading every news article mentioning any ISFB products, to\nmake sure that he and only he, is using this particular version and that ISFB_Coder is not\ncheating on their exclusive agreement. RM3_boss seems relatively well connected and he\nmade it clear with all his direct partners: if you try to betray him, he can send you to jail very\neasily.\n\nThe counter point to a work environment based on fear and threats, is that RM3_boss pays\nthe people respecting the rules a lot, and that is how he managed to keep skilled third party\npeople working for him.\n\n\n-----\n\nGlobal Network followed the life of ISFB until 2017 where the anti-virus detection rates of\nGlobal Network (and CRM2 in general) became too good and started affecting the profits. To\nresolve that issue, RM3_boss put an order out to ISFB_Coder on a new variant: RM3.\n\nHe asked for a rewrite of the ISFB code and specifically the bot network part. The\ndevelopment of RM3 lasted from 2017 to 2018, and once ready, the panel looked like:\n\nThe move from Global Network to RM3 took longer than RM3_boss expected. In 2017 the\nAV detection of Global Network became way too good, and the profits of the team were\ndropping quickly. In order to temporarily fix this problem until RM3 was ready, RM3_boss\ndecided to ask one of his partners for help; the member of Evil Corp: Maksim Yakubets.\n\nGlobal Network had become a pain to work with and RM3_boss decided to rent Dridex for a\nfew months until RM3 became ready. The next chapter will cover that transaction in more\ndetails, but between June 2017 and beginning of 2018 the RM3 group was observed using\n[Dridex botnet 2302.](https://myonlinesecurity.co.uk/fake-your-sage-subscription-invoice-delivers-dridex-banking-trojan/)\n\nIt is not the only time that RM3_boss had been involved with Evil Corp. We will dig into that\nchapter two but as already suspected by Fox-IT, ISFB_Coder ends up being the actual\n[developer of WastedLocker.](https://blog.fox-it.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/)\n\nAfter some time, RM3 also ended up being well detected by the AVs, and in 2020 the group\nstarted to seriously look for new opportunities. At this point the group was reselling bots for\nransomware operations like Conti, Dopplepaymer and even Darkside.\n\nAfter a catastrophic year 2021 in terms of business, RM3 was barely surviving in UK and\nonly used for loading CobaltStrike. Microsoft removing Internet Explorer (RM3 needs IE to\nwork) officially in 2022 killed every hope of future for the banking trojan.\n\nThe group re-emerged in 2022 with an evolution of an old loader in v2.5, a loader dubbed\n**LDR4.**\n\nExample of sample:\n2502a3f8c9a6a8681f9222e93b14e077bf879e3009571c646ee94275bc994d01\n\n[Described by Mandiant recently, LDR4 is the new loader used by the RM3 group. In](https://www.mandiant.com/resources/blog/rm3-ldr4-ursnif-banking-fraud)\ndevelopment since 2021, the loader is finally ready in 2022. So far it is the UK affiliate that is\nthe primary user but we expect them to expand in more countries any time soon.\n\nLDR4 panel (you can recognize SmartAdmin framework):\n\nFirst version of the panel in 2021\nUpdate 2022 of the panel\nAnd as mentioned by Fumiko, the username Expro is leaking from the gate domain:\n\n\n-----\n\nExpro is the developer of the panel (based on the RM3 panel). He deploys and manages the\nsources. You can even find the traditional file 123.txt usually used by RM3 since at least\n2018 to store the botnet name of the gate:\n\nThe LDR4 loader is composed of the usual loading features, plus VNC/Socks and keylogging\nmodules. Ready for a more advanced 2nd stage.\n\nThe group is an amazing mix of great skills and an old way of doing things. Carders from the\npast trying their best to keep up with technology, but like many fragile businesses, RM3 are\nhaving trouble with a come back after the Covid-19 crisis. LDR4 seems to be their last\nchance now.\n\n## Conclusion\n\nISFB is today facing the same crisis as every other banking Trojan. The level of security in\ncorporate environments is way higher now, and malware like ISFB is now well detected by all\nAVs. To commit bank fraud, you need to keep a victim infected sometimes for several days.\nWith Windows Defender on Windows 10, or Azure endpoints deployed in corporate\nenvironments, combined with an anti-spam gateway, it is very hard for crimeware tools to\nstay undetected long enough to commit bank fraud. Phishing is way more cheap and\nprofitable.\n\nTools like ISFB are today very outdated in terms of bypassing security measures, making the\ndistribution of the malware very hard. ISFB_Coder still codes his products like if it was 2007\nand always refuses to introduce solid anti detection measures in the core of ISFB. Using the\njustification that bypassing security measure is the job of the packer and not the bot. Those\noutdated views on the security products are now incompatible with an operation relying on\nbots to staying on a computer several days in a row.\n\nThe distribution of banking trojans has an extra step of complexity. The victims must have\naccess to online banking data, which really is only a fraction of online people. Back in 2016,\ninfecting 1000 victims a day with Global Network was a thing. In 2020, specially with COVID19, infecting 50 victims was a good day. If the malware distributor is doing good and\nmanages to target a corporate accounting department, the operator can only hope for around\n30% of his victims to actually have access to bank accounts. If you leave out people who\ncannot access money or cases where the security is too high, there is not much money is left\nto steal.\n\nISFB is facing the same reality as Trickbot, Zloader, Ramnit, Dridex etc. Most of them gave\nup on the banking fraud part and became just loaders for loading 2nd stage attacks (often\nransomware). With LDR4, ISFB_Coder tries to make his old partners stay in business with\n\n\n-----\n\nthe move towards ransomware. But it s 2022 already, and despite still being a big problem,\nthe party is over and there is objectively not much money left on the ransomware field\nanymore.\n\nIAP2, RM3, LDR4 are surviving so far, but if ISFB_Coder doesn’t have an advanced tool\nhidden in his pockets, everything points to the end of the reign of ISFB.\n\nI have tried through this first chapter to present the overall operation behind ISFB. The way\nthe versions have been distributed through affiliates is not something commonly seen.\nISFB_coder tries to evolve like a software development company and managed to earn his\nliving from his developments. With each ISFB branch being sold for between 50,000 and\n100,000 USD, without counting the support and the custom requests, jumping on the leak of\nGozi v1 was a really smart move from ISFB_Coder.\n\nThe next chapter (coming up soon), will go deeper into the whole banking trojan crisis via the\ngroup Global Network/RM3, showing how the business of RM3_boss have evolved and what\nkind of issues they have faced. Infrastructure, distributors (Spam, Adwords…), cryptors,\ncashout, and how the defrauded money is divided between the group members. I am looking\nforward to presenting the actors running the whole operation, where they come from and\ntheir actual role within the organisation. We will also look at the deeper relationship between\nExpro and RM3_boss and I will review the different affiliates that fall under the RM3_boss\numbrella since 2013.\n\nI hope the ISFB mess is a little bit clearer and easier to apprehend in a more structured way.\nAs much as it is not really important to publicly name a malware with its internal name, it is\nreally important to document the structure of the groups behind that malware. Defining the\nglobal structure of a threat is a mandatory step to help law enforcement to understand the\nsituation.\n\nIf you have any comments or leads around ISFB don’t hesitate to ping me, I will be more\nthan happy to exchange information.\n\nStay tuned for the next episode!\n\n## Acknowledgments\n\nI would like to extend my thanks to Maciek Kotowicz for opening the way into ISFB intel with\n[his inspiring work. Kafeine and Sammy for the huge work on campaigns classification and all](https://twitter.com/kafeine)\n[the support given. Fumiko and Sandor Nemes for the great reversing work, fr3dhk for his](https://twitter.com/fr3dhk)\npatience following IAP2. Fumiko again for all his support, his analysis, the tools he provided,\nand the amount of time spent on this case, and of course everybody who worked around\nISFB and who have allowed us to finally have a clear overview of the malware family.\n\n[Illustration: wombo.art](https://www.wombo.art/create)\n\n\n-----\n\n## Annexes\n\n Documentation:\n\n**IAP**\n\n**Dreambot**\n\n**IAP2**\n\n**Global Network:**\n\n**RM3**\n\nLDR4\n\n**Misc**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-24 - Chapter 1 — From Gozi to ISFB- The history of a mythical malware family..pdf"
    ],
    "report_names": [
        "2022-10-24 - Chapter 1 — From Gozi to ISFB- The history of a mythical malware family..pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "72bc3519-a265-4136-b85a-d5e331f085b1",
            "created_at": "2023-01-06T13:46:39.313045Z",
            "updated_at": "2025-03-27T02:00:03.048368Z",
            "deleted_at": null,
            "main_name": "TA547",
            "aliases": [],
            "source_name": "MISPGALAXY:TA547",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e5c3b8-54b4-4170-b200-7f1fd361b5a9",
            "created_at": "2022-10-25T16:07:24.557505Z",
            "updated_at": "2025-03-27T02:02:10.280375Z",
            "deleted_at": null,
            "main_name": "Scully Spider",
            "aliases": [
                "Scully Spider",
                "TA547"
            ],
            "source_name": "ETDA:Scully Spider",
            "tools": [
                "DanaBot",
                "Lumma Stealer",
                "LummaC2",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "Rhadamanthys",
                "Rhadamanthys Stealer",
                "Stealc"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1998ad13-b343-4409-9a37-b1930d156a28",
            "created_at": "2023-09-17T02:00:09.948891Z",
            "updated_at": "2025-03-27T02:00:03.137557Z",
            "deleted_at": null,
            "main_name": "Storm-0324",
            "aliases": [
                "DEV-0324",
                "Sagrid",
                "TA543"
            ],
            "source_name": "MISPGALAXY:Storm-0324",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1685930866,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1685881441,
    "ts_modification_date": 1685881441,
    "files": {
        "pdf": "https://archive.orkl.eu/85c2dbe00aedc594f3106e2f5ac8c00882e96040.pdf",
        "text": "https://archive.orkl.eu/85c2dbe00aedc594f3106e2f5ac8c00882e96040.txt",
        "img": "https://archive.orkl.eu/85c2dbe00aedc594f3106e2f5ac8c00882e96040.jpg"
    }
}