{
    "id": "b81eccd5-6a31-4078-b592-c2724defbe28",
    "created_at": "2023-01-12T15:04:51.526633Z",
    "updated_at": "2025-03-27T02:16:17.021805Z",
    "deleted_at": null,
    "sha1_hash": "6123399c13bcae4304a9b5d1513fc07a232c032f",
    "title": "2019-03-28 - Analysis of ShadowHammer ASUS Attack First Stage Payload",
    "authors": "",
    "file_creation_date": "2022-05-28T01:54:13Z",
    "file_modification_date": "2022-05-28T01:54:13Z",
    "file_size": 2510743,
    "plain_text": "# Analysis of ShadowHammer ASUS Attack First Stage Payload\n\n**[countercept.com/blog/analysis-shadowhammer-asus-attack-first-stage-payload/](https://countercept.com/blog/analysis-shadowhammer-asus-attack-first-stage-payload/)**\n\nMarch 28, 2019\n\n## Introduction\n\nOn March 25 2019, Kaspersky released this high-level advisoryth\n[(https://securelist.com/operation-shadowhammer/89992/) describing the attack against](https://securelist.com/operation-shadowhammer/89992/)\nASUS:\n\n“In January 2019, we discovered a sophisticated supply chain attack involving the ASUS\n**Live Update Utility. The attack took place between June and November 2018 and according**\nto our telemetry, it affected a large number of users.…\n\n**The goal of the attack was to surgically target an unknown pool of users, which were**\n**identified by their network adapters’ MAC addresses. To achieve this, the attackers had**\nhardcoded a list of MAC addresses in the trojanized samples and this list was used to\nidentify the actual intended targets of this massive operation”\n\nThe original advisory contains lots of more useful information, but technical details were\nlimited at this early stage. To learn more about the attack we decided to investigate the\npayloads further.\n\n## History of Activity\n\n\n-----\n\nThe Kaspersky post references a zip file that is a copy of the ASUS Live Update Utility.\nInside this zip file were three files, two MSIs, and a file called Setup.exe. By reviewing the\nhistory of these files on VirusTotal and examining the files themselves it was confirmed that\nshellcode had been inserted within the legitimate Setup.exe and the code modified to\nredirect execution.\n\nWe analyzed historic samples from VirusTotal to gain a better understanding of the attacker’s\nactions over time. Kaspersky reported that this attack ran from June to November 2018, this\nappeared to be true based on the samples submitted to VirusTotal. The first malicious\nsample can be seen on the 29 June 2018 and the most recent on 17 November 2018.th th\n\nA high-level analysis of these samples found that at least two different backdoor variants\nwere deployed. From June to September the attackers used an unencoded payload along\nwith a patched WinMain to redirect execution.\n\nFrom September onwards a stealthier backdoor was deployed, that included an obfuscated\nshellcode payload and decoder with execution via the function _crtExitProcess. All samples\nwere also found to use the same C2 channel involving asushotfix[ ]com which was first\n\n\n-----\n\nregistered on 5 May 2018 with an IP address 141.105.71[.]116 located in Russia.\n\nPivoting on this IP address the following additional domains were also found:\n\n**Domain** **First Seen**\n\nhost2[.]infoyoushouldknow[.]biz 2013-04-27\n\nnano2[.]baeflix[.]xyz 2016-03-24\n\nasushotfix[.]com 2018-05-22\n\nwww[.]asushotfix[.]com 2018-07-13\n\nhomeabcd[.]com 2018-09-05\n\nsimplexoj[.]com 2018-09-11\n\nIt is unclear what role these domains played however there is a strong possibility they were\nalso used in the ASUS attack or by the same threat group in other attacks.\n\nIn the next sections, we’ll take a deeper dive into the sample referenced by Kaspersky\nMD5:55a7aa5f0e52ba4d78c145811c830107 which included the obfuscated payload.\n\n## Loading the Shellcode\n\nAt a high level the Setup.exe binary appeared to be a legitimate file. It was signed, metainformation matched legitimate files and the majority of the code matched other legitimate\nsetup files. However, when comparing a legitimate Setup.exe with the malicious one we find\nthe code has been patched to divert execution from _crtCoreExitProcess to a new function.\n\nThis new function (which we renamed to drop_shellcode) contains the code to extract,\ndecode and execute the embedded payload. By placing the diversion at the end of the\nSetup.exe file right before the ExitProcess this will ensure the legitimate file runs as expected\nreducing the chance of discovery.\n\n\n-----\n\nInvestigating the shellcode dropping function, we find that it begins by allocating memory\nwithin the Setup.exe process with a VirtualAlloc call, then copies embedded shellcode into\nthe allocated memory:\n\nInterestingly this first step only copies the first 16 bytes of the payload into memory before\ndecoding them. These bytes actually contain the size of the payload which is then passed to\na second VirtualAlloc call. The main shellcode is then written, decoded and executed.\n\nThe decoding routine won’t be analyzed here, but similar code has been used by Winnti\npreviously.\n\n## Analyzing the Shellcode\n\nAccording to our analysis so far, the shellcode performs the following actions:\n\n1. Resolves library functions it needs to call later.\n\na. First kernel32’s base address is found by traversing structures in the PEB and matching\nthe module name by checking for the k, l and dot (.) characters.\n\nb. The modules PE table is parsed to find the export table.\n\nc. Functions hashed with a custom function and matched by iterating through each export.\n\nd. Functions in other modules are found in the same way, but with the help of\nLoadLibraryExW to get the base address; this function is one of the first things located in\nkernel32 at the start.\n\n2. MAC addresses are found from the machine by calling IPHLPAPI.GetAdaptersAddresses.\n\n3. The MAC addresses are hashed with MD5.\n\n4. The MD5 hashes are compared against a hardcoded list.\n\na. If no match is found, a mysterious IDX file is dropped to disk.\n\n\n-----\n\n5. If a MAC address matches, a second stage payload is downloaded from a URL using a\nproxy aware API call. This goes directly into RWX memory and is called.\n\nMore details of each of these steps follow below.\n\n### Function Resolution\n\nThe shellcode starts by locating some library functions that it wants to use. This is broadly a\ntwo-step process, first looking for LoadLibraryExW and GetProcAddress from kernel32.dll,\nbefore resolving further functions from a number of DLLs later, armed with the address of\nLoadLibraryExW to use on the second stage.\n\nFor the first step, the base address of kernel32.dll is required. To find this, the Thread\nInformation Block (TIB) is used to navigate structures and ultimately locate\nInInitializationOrderModuleList which contains a list of loaded modules in the process.\n\nThe structures queried to get here are:\n```\n TIB -> PEB -> Ldr -> InInitializationOrderModuleList\n\n```\nIn fact, InInitializationOrderModuleList is of type _LIST_ENTRY, which is a doubly-linked list,\nand its “Flink” (or forward link) is followed to traverse this list of modules. Each entry includes\na BaseDllName field, and this field is checked in each entry to see if it matches kernel32.dll.\n\nBut in the spirit of obfuscation, they do not directly check if the name is “kernel32.dll”.\nInstead, they check for the presence of the k, l, and dot (.) in the appropriate locations in the\nstring (checking each letter twice, once for lower case and again for upper case). And in fact,\nthey only check the first byte of each 2-byte Unicode character, which works in practice but is\ncertainly not the official way to compare Unicode characters.\n\nThis whole process can be seen in the commented code below:\n\n\n-----\n\nOnce kernel32.dll’s entry is found, its DllBase field can be read, giving the base address of\nthe module. This is used with a function in the shellcode that accepts a module base address\nand a custom hash value for a function name. This function parses the PE header from the\nmodule in memory to locate the exports table. It then iterates through each export and runs a\nsimple custom hash-like function on the name. When the matching hash value is found, the\n\n\n-----\n\ntarget function has been located in the export table, without needing to include the function\nname directly in the code. The address of the function is saved from the export table for later\nuse.\n\nThis export table searching is shown commented below, with the hash code in the grey\nblock:\n\n\n-----\n\nThe function resolution’s second step uses the same shellcode routine to look for hashed\nfunction names in the export table. But as it needs to call several other DLLs it uses\nLoadLibraryExW which it got in the first step to get the base address of the modules.\n\nBelow is where all the other hash values for function names are found in code, commented\nwith the module and function name they correspond to:\n\nThese function addresses are saved in a structure that the rest of the code often accesses\nvia a register base pointer. To help see what function is being called you can use the\nfollowing offsets:\n\nOffset Function\n\n0x4 kernel32.VirtualAlloc\n\n0x8 kernel32.GetModuleFileNameW\n\n0xC kernel32.WritePrivateProfileStringW\n\n0x10 kernel32.GetSystemTimeAsFileTime\n\n0x14 kernel32.FileTimeToSystemTime\n\n\n-----\n\n0x18 kernel32.VirtualFree\n\n0x1C ntdll.memcpy\n\n0x20 ntdll.memcmp\n\n0x24 ntdll.memset\n\n0x28 ntdll.swprintf\n\n0x2C ntdll.sprintf\n\n0x30 ntdll.strncat\n\n0x34 ntdll.MD5Init\n\n0x38 ntdll.MD5Update\n\n0x3C ntdll.MD5Final\n\n0x40 IPHLPAPI.GetAdaptersAddresses\n\n0x44 wininet.InternetOpenA\n\n0x48 wininet.InternetOpenUrlA\n\n0x4C wininet.InternetQueryDataAvailable\n\n0x50 wininet.InternetReadFile\n\n0x4 kernel32.VirtualFree\n\nKnowing these offsets and defining them makes the code a lot more readable. We go from\nthis:\n\nTo this:\n\nIn case anyone finds it useful, some Python code to help produce these hashes and find\nmatches against real function names is provided here (slightly abbreviated):\n\n\n-----\n\n```\nimport numpy\n# We expect, and require, that int_scalars overflow occurs, so ignore\nnumpy.warnings.filterwarnings('ignore')\nfind_hashes = [\n 0x431A42C9, 0x0C2CBC15A, ... function hashes ...\n]\nnames = [ ... list of exported functions in target DLLs ... ]\nhashes_2s_compliment = {}\nfor hash in find_hashes:\n twoscomp = hash\n if twoscomp >= 1<<31: twoscomp -= 1<<32\n hashes_2s_compliment[twoscomp] = hash\nmul_by = numpy.int32(0x21)\nfor name in names:\n name_hash = numpy.int32(0)\n for char in name:\n  name_hash = name_hash * mul_by\n  name_hash += numpy.int32(ord(char))\n if name_hash in hashes_2s_compliment:\n  print('{}: {}'.format(hex(hashes_2s_compliment[name_hash]), name))\n\n### MAC Addresses\n\n```\nArmed with these functions the shellcode continues its work, moving on to the MAC\nvalidation phase. Here we can see it getting the MD5 hash of MAC addresses on the\nmachine by calling a function within the shellcode we have called get_macs_and_md5. This\nis called twice. The first time gets the number of MAC addresses to help it allocate the right\namount of memory to store all the MD5 hashes. The second time it actually generates and\nstores the MD5 hashes.\n\n\n-----\n\nMAC addresses are obtained by calling GetAdaptersAddresses with AF_UNSPEC to get all\ninterfaces.\n\n\n-----\n\nAnd the actual MD5 calls:\n\n\n-----\n\nThese MD5 hashes are then checked against a set of hashes hardcoded into the shellcode\nlike in the example below:\n\nThis shows the branches taken depending on whether there was a MAC address match or\nnot, right at the end of the entry function in the shellcode:\n\n\n-----\n\n### Stage 2 Payload Download and Execute\n\nIf there is a MAC address match, the shellcode proceeds to download a second stage from\nthe internet. The URL used for this stage is found hardcoded as a set of constant values,\nwhich are little-endian, so the string fragments look backward when forced to display as\nASCII below:\n\nWhich gives the URL:\n```\nhttps://asushotfix[.]com/logo2[.]jpg\n\n```\nThe URL is opened with a proxy-aware function:\n\n\n-----\n\nData is downloaded from the URL directly into a memory region allocated read/write/execute,\nand finally the stage 2 code is called:\n\nAt the time of analysis, the second stage payload was no longer available from the callback\nURL. It is likely further information will become available over the coming weeks.\n\n## Detection of ShadowHammer\n\n\n-----\n\nThere are several indicators defensive teams can hunt for including the hashes of files,\ndropped files, and network-based IOCs.\n\n### SHA-256 (along with the month it was seen)\n\nbca9583263f92c55ba191140668d8299ef6b760a1e940bddb0a7580ce68fef82 June\n6aedfef62e7a8ab7b8ab3ff57708a55afa1a2a6765f86d581bc99c738a68fc74 July\nac0711afee5a157d084251f3443a40965fc63c57955e3a241df866cfc7315223 July\ne78e8d384312b887c01229a69b24cf201e94997d975312abf6486b3363405e9d Sep\n736bda643291c6d2785ebd0c7be1c31568e7fa2cfcabff3bd76e67039b71d0a8 Sep\n9bac5ef9afbfd4cd71634852a46555f0d0720b8c6f0b94e19b1778940edf58f6 Sep\n9a72f971944fcb7a143017bc5c6c2db913bbb59f923110198ebd5a78809ea5fc Oct\n357632ee16707502ddb74497748af0ec1dec841a5460162cb036cfbf3901ac6f Oct\n9842b08e0391f3fe11b3e73ca8fa97f0a20f90b09c83086ad0846d81c8819713 Nov\n\n### Dropped Files\n\nFor systems not matching the MAC address filter, an idx file is created two levels up relative\nto the Setup.exe current directory, for example:\n\nC:\\Program Files (x86)\\ASUS\\ASUS Live Update\\Temp\\6\\Setup.exe\nC:\\Program Files (x86)\\ASUS\\ASUS Live Update\\idx.ini\n\n### Network\n\nhost2[.]infoyoushouldknow[.]biz\nnano2[.]baeflix[.]xyz\nasushotfix[.]com\nwww[.]asushotfix[.]com\nhomeabcd[.]com\nsimplexoj[.]com\n141.105.71[.]116\nhxxps://asushotfix[.]com/logo[.]jpg\nhxxps://asushotfix[.]com/logo2[.]jpg\n\n### PDB Indicator\n\nJune sample – D:\\C++\\AsusShellCode\\Release\\AsusShellCode.pdb\n\n### Summary\n\nThe ShadowHammer attack is a great example of a supply chain attack where a threat actor\nabused a trusted update utility to distribute malware across the globe in a targeted way. As\nmentioned in the Kaspersky analysis the attack shares similarities with those performed by\n\n\n-----\n\nthe BARIUM group suggesting a continuation and even escalation in the scale and\nsophistication of their operations.\n\nFrom a defensive perspective, the significant time it took to uncover this attack demonstrates\nthat the actions taken in the first stage of the incident are stealthy and difficult to detect. But it\nis quite possible that noisier indicators will be discovered as more information about the\nsecond stage payload is released.\n\nTo provide support for real-time and retrospective detection, it is strongly recommended that\norganizations deploy endpoint monitoring and response with an EDR, agent as this can give\nthe visibility and control needed to combat such threats.\n\n### References\n\n[1] [https://securelist.com/operation-shadowhammer/89992/](https://securelist.com/operation-shadowhammer/89992/)\n\n[2] https://www.virustotal.com/#/file/9a72f971944fcb7a143017bc5c6c2db913bbb59f9231101\n98ebd5a78809ea5fc/detection\n\n[3] [https://www.vkremez.com/2019/03/lets-learn-dissecting-operation.html](https://www.vkremez.com/2019/03/lets-learn-dissecting-operation.html)\n\nCategories\n\n[Threats & Research](https://blog.f-secure.com/category/threats-research/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-28 - Analysis of ShadowHammer ASUS Attack First Stage Payload.pdf"
    ],
    "report_names": [
        "2019-03-28 - Analysis of ShadowHammer ASUS Attack First Stage Payload.pdf"
    ],
    "threat_actors": [
        {
            "id": "1c97ccfd-1888-492c-b7b9-bb52c4c3809b",
            "created_at": "2023-01-06T13:46:38.940529Z",
            "updated_at": "2025-03-27T02:00:02.957652Z",
            "deleted_at": null,
            "main_name": "Operation ShadowHammer",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation ShadowHammer",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "49822165-5541-423d-8808-1c0a9448d588",
            "created_at": "2022-10-25T16:07:23.384093Z",
            "updated_at": "2025-03-27T02:02:09.772829Z",
            "deleted_at": null,
            "main_name": "Barium",
            "aliases": [
                "Brass Typhoon",
                "Pigfish"
            ],
            "source_name": "ETDA:Barium",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Barlaiy",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "POISONPLUG",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535891,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1653702853,
    "ts_modification_date": 1653702853,
    "files": {
        "pdf": "https://archive.orkl.eu/6123399c13bcae4304a9b5d1513fc07a232c032f.pdf",
        "text": "https://archive.orkl.eu/6123399c13bcae4304a9b5d1513fc07a232c032f.txt",
        "img": "https://archive.orkl.eu/6123399c13bcae4304a9b5d1513fc07a232c032f.jpg"
    }
}