{
    "id": "b83b0ae2-52fc-41fd-b74e-bc26c60936b5",
    "created_at": "2023-01-12T15:04:14.618633Z",
    "updated_at": "2025-03-27T02:13:47.868576Z",
    "deleted_at": null,
    "sha1_hash": "1027a7ee65f0c501fe4394ad215cc600e2fc178f",
    "title": "2022-05-24 - Yashma Ransomware, Tracing the Chaos Family Tree",
    "authors": "",
    "file_creation_date": "2022-05-28T23:26:16Z",
    "file_modification_date": "2022-05-28T23:26:16Z",
    "file_size": 6995477,
    "plain_text": "# Yashma Ransomware, Tracing the Chaos Family Tree\n\n**[blogs.blackberry.com/en/2022/05/yashma-ransomware-tracing-the-chaos-family-tree](https://blogs.blackberry.com/en/2022/05/yashma-ransomware-tracing-the-chaos-family-tree)**\n\nThe BlackBerry Research & Intelligence Team\n\nIt’s not often that we get to observe the behind-the-scenes drama that can accompany the creation of new\nmalware, but when we do, it gives us a fascinating glimpse into how threat actors operate. One such glimpse,\nstemming from an online exchange between a ransomware perpetrator and a victim, gave us new insights into the\norigins of Chaos malware, revealing a twisted family tree that links it to both Onyx and Yashma ransomware\nvariants.\n\nThe clues surfaced during a discussion between a recent victim and the threat group behind Onyx ransomware,\ntaking place on the threat actor’s leak site. Someone claiming to be the creator of the Chaos ransomware builder’s\nkit joined the conversation, and revealed that Onyx was constructed from the author’s own Chaos v4.0\nRansomware Builder. The author went on to promote the most current version of the Chaos ransomware line, now\nrenamed “Yashma.”\n\nThe Chaos author’s apparent intent of “outing” Onyx as a copycat is particularly ironic, given the origins of Chaos;\nthat threat’s first incarnation sought to steal thunder from Ryuk ransomware by touting itself as a .NET version of\nRyuk, complete with Ryuk branding on its graphical user interface (GUI). But the response to this ham-handed\ntactic was so negative, it prompted the threat’s creator to drop the Ryuk pretense and quickly rebrand its new\ncreation as “Chaos.”\n\n\n-----\n\n_Figure 1: Screen capture of the chat on the Onxy ransomware leak site, showing comments by a person claiming_\n_to be the creator of Chaos malware_\n\n### Operating System\n\n Risk & Impact\n\n Technical Analysis\n\n\n-----\n\nThough Chaos ransomware builder has only been in the wild for a year, Yashma claims to be the sixth version\n(v6.0) of this malware. The BlackBerry Research & Intelligence team has observed a lateral progression\nthroughout each iteration, from its first – dubbed “Ryuk .NET Builder” (Chaos v1.0) – to its latest, “Yashma\nRansomware Builder” (Chaos v6.0).\n\nThe diagram in Figure 2 below provides a timeline of the malware builder’s development over the last twelve\nmonths, highlighting characteristics and advances the malware has made in this short time span.\n\n\n-----\n\n_Figure 2: Timeline of Chaos/ Yashma malware_\n\n### Chaos v1.0\n\nThe first version of Chaos ransomware was initially dubbed “Ryuk .Net Ransomware Builder v1.0.” This threat\nwas promoted on dark web forums as early as June 2021, claiming to be a .NET-compiled builder for the infamous\nransomware family Ryuk, as seen in Figure 3.\n\nThe file was a basic .NET console that allowed malware operators to generate a sample of the threat that would go\non to be known as Chaos ransomware. It also provided them with the ability to create a customized ransom note.\n\n_Figure 3: Ryuk .NET (Chaos) Ransomware Builder v1.0 panel_\n\nBy claiming to be Ryuk, the dark web promotion of this builder sparked much analysis and research activity by the\nwider cybersecurity and reverse-engineering communities. However, no concrete links were found with the real\nRyuk ransomware, or with the Wizard Spider group that created the infamous threat. It appears likely that the\nauthor was a “pretender to the throne,” attempting to cash in on the ransomware’s notoriety by piggybacking off the\nRyuk name.\n\nWhile this attempt to ride Ryuk’s coat tails did generate a lot of attention for the builder, it was resoundingly\nnegative. Users of many dark web forums called out the creator for this deceptive naming. Some of this negative\npublicity must have stuck with the author, as within a few weeks, the builder was rebranded as Chaos, and quickly\nfollowed by the release of Chaos V2.0 and Chaos V3.0.\n\nThe new malware generated by this initial “ransomware builder” was quite basic, and it lacked a lot of functionality\nexpected from a typical piece of ransomware. As a result, this threat unintentionally performed more like a\ndestructor or wiper.\n\nMalware generated within the builder could perform the following simple functions:\n\nRandomize the file-extension of affected files (default: [a-z A-Z 0-9]{4})\n\n\n-----\n\nCopy itself to a given process name (default: svchost.exe) in %AppData%\nCreate a .LNK file in the victim’s Startup folder\nAdd RegKey to the following location:\n\nSOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\Run\n**Key: Microsoft Store**\n**Value: %Current Path/Location%**\nAttempt to spread itself via any connected USB drive.\nPerform a sleep function/delay feature.\n\nThe malware would only target the victim’s C:\\ drive, looking for files located in the following folders:\n\nDesktop Links Saved Games\n\nContacts Documents Favorites\n\nDownloads Pictures Searches\n\nMusic One Drive Videos\n\nAlthough otherwise basic, Chaos-spawned malware had over a hundred targeted file-extensions that it would\nattempt to encrypt. Additionally, the malware had a list of files it would avoid targeting, including .DLL, .EXE, .LNK\nand .INI. These exclusions were likely there to prevent crashing the victim’s device by encrypting necessary\nsystem files.\n\nThis initial edition of Chaos overwrites the targeted file with a randomized Base64 string, rather than truly\nencrypting the file. Because the original contents of the files are lost during this process (seen in Figure 4),\nrecovery is not possible, thus making Chaos a wiper rather than true ransomware.\n\nThis is unlike the real Ryuk’s encryption process, which uses AES/RSA-256 encryption.\n\n\n-----\n\n_Figure 4: Chaos v1.0/Ryuk .NET Builder encryption routine_\n\nIn each folder affected by Chaos, the malware drops the ransom note as “read_it.txt.” This option is highly\ncustomizable within all iterations of the builder, giving malware operators the ability to include any text they want as\nthe ransom note. In all versions of Chaos Ransomware Builder, the default note stays relatively unchanged, and it\nincludes references to the Bitcoin wallet of the apparent creator of this threat.\n\n### Chaos v2.0 – v3.0\n\nAfter the rebrand of Chaos malware took place, the second version of the malware was more refined than its initial\niteration. This version included more advanced options, which one expects to see in more developed threats, as\nseen in Figure 5. It also (deceptively) continues to call itself ransomware, although the actual functionality\nremained that of a file-wiper.\n\n\n-----\n\n_Figure 5: Builders for Chaos v2.0 and Chaos v3.0_\n\nThe second iteration of Chaos had additional functionality, generating more advanced ransomware samples that\ncould perform the following activities:\n\nDelete shadow copies\nDelete backup catalogs\nDisable Windows recovery mode\n\n_Figure 6: Chaos v2.0 file recovery disruption_\n\nThough Chaos v2.0 added these abilities to disrupt file recovery systems, the threat was still built on top of Chaos\nv1.0/Ryuk .NET Builder. This left its core encryption functionality unchanged, using the same encryption routine, as\nshown in Figure 4.\n\nThis means the malware was effectively still a destructor rather than actual ransomware, and there could be no\nattempt on the operator’s part to provide file recovery for a victim, even if the ransom was paid. Ironically, the\nauthor of Chaos v2.0 even mentions this in the “About” section of the builder, as shown below in Figure 7. In fact,\nthe author points out the lack of functionality, citing the malware’s subsequent speed of operation as a selling point.\n(It is perhaps not surprising to note that the process of destroying files is twice as fast as it is to encrypt them.)\n\n\n-----\n\n_Figure 7: Chaos Builder v2.0 “About” section_\n\nLess than a month later, Chaos v3.0 was released, which finally had the ability to encrypt files. This meant the\nauthor could also create a decryptor to recover affected files.\n\nThough this behavior was now more in line with the actions of traditional ransomware, the Chaos v3.0 builder\ncould still only handle the encryption of files smaller than 1MB. This meant that it was still acting as a destructor for\nlarge files (such as photos or videos) on the unfortunate victim’s system.\n\nWhen a file is encrypted by this newer version of Chaos, it appends an “Encryption Key” to the beginning of every\nencrypted file, as shown in Figure 8. This key is generated when the ransomware is created.\n\n_Figure 8: File encrypted by Chaos v3_\n\nThe malware decryptor uses this key to revert the damage done by the malware, as seen in Figure 9. However,\nthis version of the malware will still overwrite files greater than 1MB in a similar fashion to its predecessors, leaving\nthem unrecoverable.\n\n\n-----\n\n_Figure 9: Chaos 3.0 decryptor in action_\n\nFiles that are smaller than 1MB are passed to the function “EncryptFile,” as shown in Figure 10, which successfully\nuses AES-256 to encrypt files.\n\n_Figure 10: Chaos v3.0 encryption routine_\n\n### Chaos 4.0 / Onyx\n\nWith the author still hellbent on refining their creation, Chaos v4.0 was soon released. Like previous editions of\nChaos Builder, malware produced by the “Chaos Ransomware Builder v4” shows improvements over Chaos 3.0\nsamples, specifically when it came to use of the AES/RSA encryption routine shown in Figure 10.\n\nThese advancements allowed the builder to create ransomware that could successfully handle encrypting slightly\nlarger files – up to 2.1MB in size. Unfortunately, larger files were still overwritten and destroyed.\n\n\n-----\n\nChaos 4.0 added the following functionality (shown in Figure 11):\n\nAbility to change the victim’s desktop wallpaper\nCustomizable file-extension lists\nBetter encryption compatibility\n\n_Figure 11: Chaos v4.0 panel_\n\nThough Chaos v4.0 had been in-the-wild for several months now, this variant of Chaos rose to notoriety in April\n2022 when it was weaponized by a threat group called Onyx.\n\nThis particular threat group would infiltrate a victim organization’s network, steal any valuable data it found, then\nwould unleash “Onyx ransomware,” their own branded creation based on Chaos Builder v4.0. To verify this, we’ve\nperformed tests on samples dubbed Onyx ransomware, and there was a 98% match to a test sample generated\nvia Chaos v4.0.\n\nThe Onyx group simply customized their ransom note and created a refined list of file extensions they wished to\ntarget. There is little other modification to differentiate it from any other samples built with Chaos v4.0.\n\n**Onyx Customized File-Extension**\n**List**\n\n.txt .jar .dat .contact .settings .doc .docx .xls\n\n.xlsx .ppt .pptx .odt .mka .mhtml .oqy .png\n\n.csv .py .sql .mdb .php .asp .aspx .html\n\n.htm .xml .psd .pdf .xla .cub .dae .indd\n\n.cs .mp3 .mp4 .dwg .zip .rar .mov .rtf\n\n.bmp .mkv .avi .apk .dib .dic .dif .divx\n\n.iso .7zip .ace .arj .bz2 .cab .gzip .lzh\n\n.tar .jpeg .xz .mpeg .torrent .mpg .core .pdb\n\n\n-----\n\n.ico .pas .db .wmv .swf .cer .bak .backup\n\n.accdb .bay .p7c .exif .vss .raw .m4a .wma\n\n.flv .sie .sum .ibank .wallet .css .js .rb\n\n.crt .xlsm .xlsb .7z .cpp .java .jpe .ini\n\n.blob .wps .docm .wav .3gp .webm .m4v .amv\n\n.m4p .svg .ods .bk .vdi .vmdk .onepkg .accde\n\n.jsp .json .gif .log .gz .config .vb .m1v\n\n.sln .pst .obj .xlam .djvu .inc .cvs .dbf\n\n.tbi .wpd .dot .dotx .xltx .pptm .potx .potm\n\n.pot .xlw .xps .xsd .xsf .xsl .kmz .accdr\n\n.stm .accdt .ppam .pps .ppsm .1cd .3ds .3fr\n\n.3g2 .accda .accdc .accdw .adp .ai .ai3 .ai4\n\n.ai5 .ai6 .ai7 .ai8 .arw .ascx .asm .asmx\n\n.avs .bin .cfm .dbx .dcm .dcr .pict .rgbe\n\n.dwt .f4v .exr .kwm .max .mda .mde .mdf\n\n.mdw .mht .mpv .msg .myi .nef .odc .geo\n\n.swift .odm .odp .oft .orf .pfx .p12 .pl\n\n.pls .safe .tab .vbs .xlk .xlm .xlt .xltm\n\n.svgz .slk .tar.gz .dmg .ps .psb .tif .rss\n\n.key .vob .epsp .dc3 .iff .onetoc2 .opt .p7b\n\n.pam .r3d .dsn .dmp .qbw .imr .nd .chw\n\n.spi .ep .tlg .qbb .msi .eml .thmx .obi\n\n\n-----\n\n.chm .pub .md5 .spf .spk .idx .scc .jdk\n\n.cnt .tum .dsm .reg .cfg .ldf .bat .dxf\n\n.SLDDRW .SLDPRT .SLDASM .mil .dlf .c4 .pdx .onepkg\n\n.url .jpg\n\nUnlike the default Chaos ransom note, which provided little in the way of instructions or guidance to affected\nvictims, the group behind Onyx implemented a leak site called “Onyx News,” hosted via an Onion page on the\nanonymous Tor network. Onyx used it to give victims more information on how to recover their data.\n\nThe ransom note for Onyx (seen below in Figure 12) gave the address, login and password credentials that\nenabled the victim to logon and engage in a discussion with the threat actors behind the ransomware attack. This\nconversation usually led to the malware operator demanding a fee of Bitcoin cryptocurrency to release the\ndecryptor key to the victim.\n\n_Figure 12: Onyx Ransom note_\n\nThe threat actors behind Onyx would post a list of victims of their attacks. The leak site included information about\ntheir victims, along with publicly viewable stolen data (as seen in Figure 13).\n\n\n-----\n\n_Figure 13: Onyx leak site_\n\nAs one might expect, Onyx suffered from many of the same flaws as other “ransomware” generated by Chaos\nv4.0. For example, it would only encrypt smaller files, while rendering larger files unrecoverable.\n\n### Chaos 5.0/Yashma\n\nChaos Ransomware Builder v5.0 was released in early 2022, once again built on the foundation of the previous\nversion, Chaos v4.0. Chaos 5.0 attempted to resolve the largest problem of previous iterations of the threat,\nnamely that it was unable to encrypt files larger than 2MB without irretrievably corrupting them.\n\n_Figure 14: Comparisons between Chaos v5.0 and Yashma_\n\nThis version of Chaos encrypts victim files with AES-256, and then appends a key to the end of each file to signify\nthey’ve been encrypted. This key is then used by the newly designed decryptor to decode the files, returning them\nto their original, unencrypted state.\n\n\n-----\n\nCustomization options from Chaos v4.0 are also unchanged, which gives the threat actor the following options:\n\nCreate a custom ransom note\nRun on startup\nDrop the malware as a different process\nSleep prior to execution\nSet desktop wallpaper\nEncrypt specific file-extensions\nDisrupt recovery systems\nPropagate the malware over network connections\nChoose a custom encryption file-extension\nDisable the Windows® task manager\n\nThough slower to complete its malicious tasks on the victim device than when it was simply destroying files, the\nmalware finally operates as expected, with files of all sizes being properly encrypted by the malware and retaining\nthe potential to be restored to their former unencrypted state.\n\n_Figure 15: Advances from Chaos 4.0 to Chaos 5.0 to Yashma samples_\n\nAfter the release of Chaos Ransomware Builder v5, its sixth iteration had yet another re-branding, this time being\nrenamed Yashma.\n\n\n-----\n\nThough few instances of Yashma had been found in the wild at the time of writing this blog, the malware operates\nnearly identically to its Chaos v5.0 counterpart. The “Yashma” version has just two advancements added to\ndifferentiate itself from previous iterations.\n\nIt now has functionality to prevent it from running based on the victim’s location, determined via the language set\non the victim device. This is a ploy often used by threat actors to avoid legal trouble in their country of origin.\n\nThe malware can now also stop various services on the victim device. Based on our analysis of Yashma samples\ntaken from the wild, these are the services we’ve seen the updated malware target:\n\nAntivirus (AV) solutions\nVault services\nBackup services\nStorage services\nRemote Desktop services\n\n**Service Name** **Product**\n\nBackupExecAgentBrowser Veritas Open Exchange\n\nBackupExecDiveciMediaService Veritas\n\nBackupExecJobEngine Veritas\n\nBackupExecManagementService Veritas\n\nvss Volume Shadow Copy\n\nsql Structured Query Language\n\nsvc$\n\nmemtas MailEnable\n\nsophos Sophos\n\nveeam Veeam Software\n\nbackup Generic match for any service with backup in the name\n\nGxVss Commvault\n\nGxBlr Commvault\n\nGxFWD Commvault\n\n\n-----\n\nGxCVD Commvault\n\nGxCIMgr Commvault\n\nDefWatch Norton AntiVirus\n\nccEvtMgr Norton AntiVirus\n\nSavRoam Symantec AntiVirus\n\nRTVscan Symantec Internet Security\n\nQBFCService QuickBooks\n\nIntuit.QuickBooks.FCS QuickBooks\n\nYooBackup Wooxo Yoo Backup\n\nYooIT Wooxo Yoo Backup\n\nzhudongfangyu 360 Safe Guard\n\nsophos Sophos\n\nstc_raw_agent StorageCraft Volume Snapshot\n\nVSNAPVSS StorageCraft Volume Snapshot\n\nQBCFMonitorService Intuit Quickbooks\n\nVeeamTransportSvc Veeam Software\n\nVeeamDeploymentService Veeam Software\n\nVeeamNFSSvc Veeam Software\n\nveeam Veeam Software\n\nPDVFSService Veritas\n\nBackupExecVSSProvider Veritas\n\nBackupExecAgentAccelerator Veritas\n\n\n-----\n\nBackupExecRPCService Veritas\n\nAcrSch2Svc Acronis\n\nAcronisAgent Acronis\n\nCASAD2DWebSvc ArcServe\n\nCAARCUpdateSvc ArcServe\n\nTeamViewer TeamView\n\n### Conclusion\n\nChaos (and subsequently Yashma) have seen rapid development and advances throughout the last year, with its\nmost recent iteration, “Yashma” (Chaos v6.0), found in-the-wild in mid-2022.\n\nChaos started as a relatively basic attempt at a .NET compiled ransomware that instead functioned as a filedestructor or wiper. Over time it has evolved to become a full-fledged ransomware, adding additional features and\nfunctionality with each iteration.\n\nWhat makes Chaos/Yashma dangerous going forward is its flexibility and its widespread availability. As the\nmalware is initially sold and distributed as a malware builder, any threat actor who purchases the malware can\nreplicate the actions of the threat group behind Onyx, developing their own ransomware strains and targeting\nchosen victims.\n\nThis makes tracking ransomware attacks attributed to Chaos quite difficult, as Indicators of Compromise (IOCs)\ncan change with each sample a malware builder produces. Additionally, even the most novice threat actors can\nfind links to releases and leaks of this threat on either dark web forums or third-party malware repositories, and\nthen use Chaos/Yashma to carry out future malicious activities.\n\n### Who is Affected?\n\nVariants of Chaos have been seen in-the-wild for a year now, and are likely used by multiple threat actors.\n\nOften, victims are being targeted using Onyx (based on Chaos v4.0), with the latest attacks affecting U.S.-based\nservices and industries including:\n\nEmergency Services\nMedical\nFinance\nBuilding\nAgriculture\n\n### Mitigation Tips\n\nIn order to avoid becoming a victim of Choas/Yashma:\n\nKeep updated backups in case of data destruction, file-loss or file-corruption.\nHave a ransomware business continuity plan ready to be put into action.\nAvoid and report suspicious links and files.\n\n### YARA Rule\n\n\n-----\n\nThe following YARA rule was authored by the BlackBerry Research & Intelligence Team to catch the threat\ndescribed in this document:\n\nimport \"pe\"\n\nrule Mal_Win32_ChaosRansomware_2022\n\n{\n\nmeta:\n\ndescription = \"Detects Ransomware Built by Chaos Ransomware Builder\"\n\nauthor = \"BlackBerry Threat Research\"\n\ndate = \"2022-05-10\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE2.0) and open to any user or organization, as long as you use it under this license and ensure originator credit in\nany derivative to The BlackBerry Research & Intelligence Team\"\n\nstrings:\n//Ransom References\n\n$x1 = \"Encrypt\" ascii wide\n\n$x2 = \"(?:[13]{1}[a-km-zA-HJ-NP-Z1-9]{26,33}|bc1[a-z0-9]{39,59})\" ascii wide\n\n$x3 = \"read\" ascii wide\n\n//Ransom Hex\n\n$r1 = { 20 76 69 72 75 73 }\n\n$r2 = { 72 00 61 00 6e 00 73 00 6f 00 6d 00 77 00 61 00 72 00 65 }\n\n//Shadow Copy Delete\n\n$z0 = \"deleteShadowCopies\" ascii wide\n\n$z1 = \"shadowcopy\" ascii wide\n\ncondition:\n\n//PE File\n\nuint16(0) == 0x5a4d and\n\n// Must be less than\n\nfilesize < 35KB and\n\n// Must have exact import hash\n\npe.imphash() == \"f34d5f2d4577ed6d9ceec516c1f5a744\" and\n\n//Number of sections\n\npe.number_of_sections == 3 and\n\n//These Strings\n\n((all of ($x*)) and (1 of ($r*)) and (1 of ($z*)))\n\n}\n\n____________________________________________________________________________________________\n\nimport \"pe\"\n\nrule Mal_Win32_Onyx_Strain_Chaos_Ransomware_2022\n\n{\n\nmeta:\n\ndescription = \"Detects Onyx Ransomware build off of Chaos Builder v4\"\n\nauthor = \"BlackBerry Threat Research\"\n\ndate = \"2022-05-10\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE2.0) and open to any user or organization, as long as you use it under this license and ensure originator credit in\nany derivative to The BlackBerry Research & Intelligence Team\"\n\n\n-----\n\nstrings:\n$s1 = \"(?:[13]{1}[a-km-zA-HJ-NP-Z1-9]{26,33}|bc1[a-z0-9]{39,59})\" wide\n$s2 = \"All of your files are currently encrypted by ONYX strain.\" wide\n$s3 = \"Inform your supervisors and stay calm!\" wide\n\ncondition:\n\n//PE File\nuint16(0) == 0x5a4d and\n\n//Directories\npe.data_directories[pe.IMAGE_DIRECTORY_ENTRY_COM_DESCRIPTOR].size != 0 and\n\n//All strings\nall of ($s*)\n\n}\n\n____________________________________________________________________________________________\n\nimport \"pe\"\n\nrule Mal_Win32_Chaos_Builder_Ransomware_2022\n{\nmeta:\ndescription = \"Detects Chaos Ransomware Builder\"\nauthor = \"BlackBerry Threat Research\"\ndate = \"2022-05-10\"\nlicense = \"This Yara rule is provided under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE2.0) and open to any user or organization, as long as you use it under this license and ensure originator credit in\nany derivative to The BlackBerry Research & Intelligence Team\"\n\nstrings:\n\n$s0 = \"1qw0ll8p9m8uezhqhyd\" ascii wide\n\n$s1 = \"Chaos Ransomware Builder\" ascii wide\n\n$s2 = \"payloadFutureName\" ascii wide\n\n$s3 = \"read_it.txt\" ascii wide\n\n$s4 = \"encryptedFileExtension\" ascii wide\n\n$x0 = \"1098576\" ascii wide\n\n$x1 = \"2197152\" ascii wide\n\ncondition:\n\n//PE File\n\nuint16(0) == 0x5a4d and\n\n//All strings\n\n((all of ($s*)) and (1 of ($x*)))\n\n}\n\n### Indicators of Compromise (IoCs)\n\n\n-----\n\n**Appended file extension:**\n\n.[a-z][A-Z]{4} (default)\n\n**Registry Addition:**\n\nRegKey Add:\nSOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\Run\n\n**Key: Microsoft Store**\n**Value: %Current Path/Location%**\n\n**Mutex:**\n\n**1qw0ll8p9m8uezhqhyd**\n\n**Files Dropped:**\n\n%AppData%\\Roaming\\svchost.exe\n\n**RYUK .NET Builder**\n\n**Name** **Example SHA256**\n\nBuilder v1 0d8b4a07e91e02335f600332644e8f0e504f75ab19899a58b2c85ecb0887c738\n\nRansomware v1 f41962f51583d08ed7ca796b125f2300e03035b8790590e8e2d036f53bd9be79\n\n**Chaos 2.0+**\n\n**Name** **Example SHA256**\n\nBuilder v2 325dfac6172cd279715ca8deb280eefe3544090f1583a2ddb5d43fc7fe3029ed\n\nRansomware v2 202e6f0501abaf85b5c53bafcd70e31aa20e65c140f13b15d45e60c00b0413c0\n\n**Chaos 3.0+**\n\n**Name** **Example SHA256**\n\nBuilder v3 a98bc2fcbe8b3c7ea9df3712599a958bae0b689ae29f33ee1848af7a038d518a\n\nRansomware v3 1d71add7ecfe9be642a84d080dfbc4b602a0f49239938a337c7c860eb7edf3fe\n\nDecryptor v3 31c783b0211bf4b72f10b6dac6f933b7aba570ff7a8c608fd8eb46311aec0091\n\n**Chaos 4.0+**\n\n**Name** **Example SHA256**\n\nBuilder v4 392a3adb44ab2640290f88f751d7608bc66a1c7df845fa1d0baa0aea78ac7a49\nf3432c74402aa36468d6641d5ccc15c1e0ceb083bc0f7e73d2b5dbfa0cfb9974\n\n\n-----\n\nRansomware v4 77f3cddd3cb245b2645b4885ebf2080f7c23f7101f4c3ce27239ea0326a8fcc5\n\nDecryptor v4 fac94a8e02f92d63cfdf1299db27e40410da46c9e86d8bb2cd4b1a0d68d5f7a2\n\n**Chaos 5.0+**\n\n**Name** **Example SHA256**\n\nBuilder v5 6562f92ba9d4784bf30e87681e538e0f7b8eff26811ace6be8970b0a8e3e3ca0\n\nRansomware v5 7a7f9b043b83184a537e09b76b811546d3032c776246d28ae0e4f6ca5f9f92b8\n\nDecryptor v5 8f236217c4e280b4950cedccbc6bbd03f31902525a7f9fe98b6de5bb50787cfb\n\n### References\n\n BlackBerry Assistance\n\nIf you’re battling this malware or a similar threat, you’ve come to the right place, regardless of your existing\nBlackBerry relationship.\n\n[The BlackBerry Incident Response team is made up of world-class consultants dedicated to handling response](https://www.blackberry.com/us/en/services/incident-response)\nand containment services for a wide range of incidents, including ransomware and Advanced Persistent Threat\n(APT) cases.\n\nWe have a global consulting team standing by to assist you, providing around-the-clock support where required, as\nwell as local assistance. Please contact us\nhere: [https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incident-response-containment](https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incident-response-containment)\n\n### Related Reading:\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats, providing intelligence\nanalysis for the benefit of defenders and the organizations they serve.\n\n\n-----\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-24 - Yashma Ransomware, Tracing the Chaos Family Tree.pdf"
    ],
    "report_names": [
        "2022-05-24 - Yashma Ransomware, Tracing the Chaos Family Tree.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535854,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1653780376,
    "ts_modification_date": 1653780376,
    "files": {
        "pdf": "https://archive.orkl.eu/1027a7ee65f0c501fe4394ad215cc600e2fc178f.pdf",
        "text": "https://archive.orkl.eu/1027a7ee65f0c501fe4394ad215cc600e2fc178f.txt",
        "img": "https://archive.orkl.eu/1027a7ee65f0c501fe4394ad215cc600e2fc178f.jpg"
    }
}