{
    "id": "b8512f89-4e21-49f2-88f7-19e6fb64f0ed",
    "created_at": "2023-01-12T15:02:31.673506Z",
    "updated_at": "2025-03-27T02:05:39.784631Z",
    "deleted_at": null,
    "sha1_hash": "eca0505328975e784a44b9b7a8a408bfcec1dc73",
    "title": "2015-02-27 - ScanBox Framework",
    "authors": "",
    "file_creation_date": "2022-05-28T15:47:12Z",
    "file_modification_date": "2022-05-28T15:47:12Z",
    "file_size": 698318,
    "plain_text": "# ScanBox Framework\n\n**resources.infosecinstitute.com/scanbox-framework/**\n\nHacking\nFebruary 27, 2015 by Ryan Mazerik\n\nScanBox is a framework in the form of a JavaScript file. The function of ScanBox is to collect\ninformation about the visitor’s system without infecting the system. And this information\nincludes things like the last page the user was on before visiting the compromised website,\nthe OS of the system and the language settings of the system, the screen width and height,\nthe web browsers used by the victim, the geographical location, security softwares used and\nprograms like Java, Acrobat Reader, MS Office and Adobe Flash versions used.\n\nScanBox also can log the keystrokes the victim is typing inside the website under the control\nof the attacker, which could include the passwords and other sensitive information of the\nusers. And all this information is then sent to a remote C&C server controlled by the\nattackers. ScanBox’s goal is to collect information that will later be misused to compromise\nspecific targets. The ScanBox framework has been deployed on several websites belonging\nto disparate companies and organizations in different countries. Attackers were able to\ncompromise the website and include code that loaded a malicious JavaScript file from a\nremote server.\n\n\n-----\n\nScanBox is particularly dangerous, as it doesn t require malware to be successfully deployed\nto disk in order to steal information. Instead the key logging functionality would do the same\nwork by simply requiring the JavaScript code to be executed by the web browser. The\nframework also facilitates surveillance, enabling attackers to exploit vulnerabilities in visitors’\nsystems by pushing & executing malware.\n\nScanBox is designed to be a modular and reusable JavaScript based exploit kit. It allows a\nlesser number of sophisticated attackers to first compromise a website using basic attacks\nsuch as SQL injection or WordPress bugs and set up a waterhole attack to infect hundreds\nto thousands of victims who visit that website.\n\nSome of the recent attacks which used ScanBox are the following:\n\n**Table 1: List Of Attacks**\n\n**Month Identified** **Country** **Sector/Type** **Scan Box domain**\n\n**August 2014** JP Industrial sector js.webmailgoogle.com\n\n**September 2014** CN Uyghur code.googlecaches.com\n\n**October 2014** US Think tank news.foundationssl.com\n\n**October 2014** KR Hospitality qoog1e.com\n\nBy analyzing the script used in these attacks, it has been found that the base codes are\npretty much the same and they differ in implementation. This shows that different attackers\nare using ScanBox as a tool for their attack. The framework was altered according to the\nvictims’ browsers and other factors in every case. Researchers say that the changes may be\nthe result of the upgrades in the framework. The common codebase in all the attacks leads\nto a conclusion that all the attackers share some resources in using this framework.\n\n**Working**\n\n**Step 1:**\n\nThe basic step of the ScanBox framework is to configure the C&C server. This server helps\nto collect and store the information obtained from the compromised website.\n\n\n-----\n\n**Figure 1: ScanBox framework for collecting data**\n\n**Step 2:**\n\nThe collected information is first encrypted before sending it to the C&C server to ensure\nsecurity.\n\n\n-----\n\n.\n\n**Figure 2: Function for data encryption**\n\n**Step 3:**\n\nAfter completion of the encryption process the following request is passed:\n\n**Figure 3: Request produced after encryption**\n\n**Step 4:**\n\n\n-----\n\nThe encrypted data finally reaches the C&C server and is decrypted to obtain the original\ndata. These pieces of information are the key for starting the attack.\n\n**Figure 4: Decrypted data**\n\n**Figure 5: Working of ScanBox framework**\n\n**Plugins**\n\nSeveral plugins are loaded accordingly in between to extract the required information. These\nare selectively added to avoid any kind of suspicious alerts when the page loads.\n\nThe following are some plugins used during the process:\n\n\n-----\n\n**Pluginid 1: List the software installed in the system and also to check if the system is**\nrunning any different versions of EMET (Enhanced Mitigation Experience Toolkit).\n\n**Figure 6: Pluginid 1 code**\n\n**Pluginid 2: Determines Adobe Flash versions**\n\n**Pluginid 5: Determines Microsoft Office versions**\n\n**Pluginid 6: Enumerates Adobe Reader versions**\n\n**Pluginid 8: Lists Java versions**\n\n**Pluginid 21: Plants a keylogger inside the compromised website. It records all the**\nkeystrokes the person is typing in the website. The logs may include account password\nand other details. The recorded logs are sent to the corresponding command and\ncontrol center. This information is later used to launch an attack against the particular\nuser.\n\nThe keylogger feature of ScanBox helps the attacker to collect the data without loading a\nmalware from the disc. Therefore any malware removal tool won’t be able to find this.\n\n\n-----\n\n**Figure 7: Keylogger plugin code**\n\nThe plugins required to load a page on different browsers are different. An attacker should be\nwell aware of the version and type of browser used by the victim. According to the\nrequirement, the plugins are loaded so that the desired result could be obtained. The\nfollowing is the list of plugins loaded per browser on code.googlecaches.com.\n\n**Table 2: Plugins loaded per browser on code.googlecaches.com**\n\n\n**Plugin**\n**ID**\n\n\n**Description** **Internet**\n**Explorer**\n\n\n**Chrome** **Firefox** **Safari**\n\n\n**1** Software reconnaissance Y N N N\n\n**2** Browser plugin N Y Y Y\n\n\n-----\n\n**3** Flash recon Y Y Y Y\n\n**4** SharePoint recon Y N N N\n\n**5** Adobe PDF reader recon Y N N N\n\n\n**6** Chrome security plugins\nrecon\n\n\nN N Y N\n\n\n**7** Java recon Y Y Y Y\n\n**8** Internal IP recon N Y N N\n\n**9** JavaScript keylogger Y Y Y Y\n\nIt has been found that Google Chrome is less vulnerable to such attacks than others on the\nlist due to their security update between the interval of 15 days, which makes it a bit difficult\nto carry out the attack. Also the Aviator Web browser set up by WhiteHat Security provides\nimpressive privacy and security settings by default.\n\n**Watering Hole Attack**\n\nThis is a type of attack is mainly targeted on businesses and organizations. Waterholing\nattacks drive the ScanBox framework. The attacker keeps an eye on the websites the victim\nvisits frequently and infects the websites with a malware. These type of attacks are hard to\ndetect. Once the targeted victim enters the infected website, the malware finds a way into the\nvictim’s network or system. The dropped malware may be in the form of a Remote Access\nTrojan (RAT), which allows the attacker to access delicate and personal information. The\nmain goal of the watering hole attack is not to serve maximum malware to the system, but to\nexploit the websites frequently visited by the targeted victim.\n\n\n-----\n\n**Figure 8: Watering hole working**\n\nA watering hole attack could be carried out with the help of ScanBox framework. In this\nmethod the JavaScript does its job and saves the attacker from using a malware. This type\nof attack using ScanBox has much more efficiency than using a malware and could not be\ndetected by any malware removal tool. You can see the list of watering hole attacks which\nused ScanBox in Table 1.\n\n**Precautions**\n\n**Regular Software Updating: Timely upgrade on the software reduces the vulnerability**\nof such attacks.\n**Vulnerability Shielding: It helps to scan suspicious traffic and any deviation from the**\nnormal protocols used.\n**Network Traffic Detection: Even though hackers find different ways to access the**\ninformation, the traffic generated by the final malware in communicating with the C&C\nserver remains consistent. Identifying these paths helps to take control of the effect of\nsuch attacks.\n\n\n-----\n\n**Threat Intelligence: A subscription of prominent threat intelligence providers will help**\nyou to track down all the command and control servers that it connects to. These C&C\nservers can be fed to proxy or perimeter devices to see any successful communication\nhas been established or not.\n**Least privilege: The concept of least privilege has to be implemented on all users who**\nlog on to the machine. Admin privilege has to be limited to certain users only.\n**Next generation firewall: Use of a next generation firewall can detect such type of**\nattacks easier, as they have an inbuilt sandbox.\n**SIEM: By using a SIEM solution, security administrators will be able to monitor all the**\ntraffic by capturing the logs. It will give a holistic view of what is happening on your\nnetwork with a few clicks on a single dashboard.\n\n**Conclusion**\n\nBy the detailed analysis of ScanBox framework, we can say that it could be very dangerous if\nthe user is not cautious. Thorough monitoring and analysis of computer and network should\nkeep such attacks bolted to an extent.\n\n**References**\n\nPosted: February 27, 2015\n\nAuthor\n\n**Ryan Mazerik**\n\n**VIEW PROFILE**\nRyan has over 10yrs of experience in information security specifically in penetration testing\nand vulnerability assessment. He used to train and mentor consultants of these offerings to\nexpand security delivery capabilities.He has strong passion in researching security\nvulnerabilities and taking sessions on information security concepts.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-27 - ScanBox Framework.pdf"
    ],
    "report_names": [
        "2015-02-27 - ScanBox Framework.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535751,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653752832,
    "ts_modification_date": 1653752832,
    "files": {
        "pdf": "https://archive.orkl.eu/eca0505328975e784a44b9b7a8a408bfcec1dc73.pdf",
        "text": "https://archive.orkl.eu/eca0505328975e784a44b9b7a8a408bfcec1dc73.txt",
        "img": "https://archive.orkl.eu/eca0505328975e784a44b9b7a8a408bfcec1dc73.jpg"
    }
}