{
    "id": "b85d99ad-c1b1-4ff1-a88f-9c11a9aa189f",
    "created_at": "2023-01-12T15:04:31.663957Z",
    "updated_at": "2025-03-27T02:05:21.74045Z",
    "deleted_at": null,
    "sha1_hash": "e6c62f977f0bfcbf67374a67ef778b1adf55d9ce",
    "title": "2020-12-14 - Unraveling Network Infrastructure Linked to the SolarWinds Hack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:39:46Z",
    "file_modification_date": "2022-05-28T19:39:46Z",
    "file_size": 358000,
    "plain_text": "# Unraveling Network Infrastructure Linked to the SolarWinds Hack\n\n**[domaintools.com/resources/blog/unraveling-network-infrastructure-linked-to-the-solarwinds-hack](https://www.domaintools.com/resources/blog/unraveling-network-infrastructure-linked-to-the-solarwinds-hack)**\n\n## Background\n\n[On 13 December 2020, multiple](https://www.reuters.com/article/us-usa-cyber-amazon-com-exclsuive/exclusive-u-s-treasury-breached-by-hackers-backed-by-foreign-government-sources-idUSKBN28N0PG) [media](https://www.washingtonpost.com/national-security/russian-government-spies-are-behind-a-broad-hacking-campaign-that-has-breached-us-agencies-and-a-top-cyber-firm/2020/12/13/d5a53b88-3d7d-11eb-9453-fc36ba051781_story.html) [reports emerged first identifying network intrusions](https://www.nytimes.com/2020/12/13/us/politics/russian-hackers-us-government-treasury-commerce.html)\nat several US government agencies. Subsequent reporting indicated these intrusions, along\nwith a previously-identified breach at information security giant FireEye, were linked to a\n[compromise at IT management and remote monitoring software provider SolarWinds.](https://krebsonsecurity.com/2020/12/u-s-treasury-commerce-depts-hacked-through-solarwinds-compromise/)\n\n[FireEye and](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html) [Microsoft followed up media reporting with in-depth technical reports on a](https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/)\n[complex supply chain attack focusing on SolarWinds’ Orion IT monitoring software. The](https://www.solarwinds.com/solutions/orion)\nattack focuses on a malicious Dynamic Linked Library (DLL) included in the legitimate Orion\ninstaller package, referred to as SUNBURST or Solorigate by FireEye and Microsoft,\nrespectively. Network defenders, threat researchers, and other interested parties are\nstrongly encouraged to review the linked reports from FireEye and Microsoft to understand\nthese campaigns in detail.\n\nHowever, as part of the overall intrusion via the compromise at SolarWinds, several\ninteresting network-based observations emerge. This includes both behaviors related to the\nCommand and Control (C2) activity of SUNBURST and the characteristics of the network\ninfrastructure used to facilitate the campaign.\n\n## Observed Command and Control Behavior\n\nSUNBURST uses a complex, multi-staged mechanism for identifying a controlling C2\nserver, and performing subsequent communication. This is summarized in the following\nchart.\n\n\n-----\n\nC2 behavior is first dependent on resolving a subdomain of the first-stage C2 domain:\n```\nAvsvmcloud[.]com\n\n```\nThe primary domain is interesting, as it first appears long before the Spring 2020 timeframe\nwhen SUNBURST is believed to have started (Spring 2020), in July 2018. A closer view of\nWhois history via DomainTools Iris shows a noticeable change in the domain in late 2019:\n\nInitially, the domain was registered via Namecheap with PrivacyGuardian anonymization,\nbut then shifted to completely different services (GoDaddy and Domains by Proxy) in\nDecember 2019. This change in registration information is reflected in hosting and related\ncharacteristics:\n\n\n-----\n\nThe two images above capture alterations in hosting and authoritative name server:\n\nThe domain shifted to GoDaddy parking infrastructure on 20 December 2019, roughly\nthe same time as the change in registration.\nThe domain remains on GoDaddy parking infrastructure until 27 February 2020, when\nit shifts to Microsoft cloud hosting (52.171.135[.]15, then 13.65.251[.]83)\nAt the same time hosting shifts to Microsoft, the domain changes authoritative name\nserver to self-hosting at Avsvmcloud[.]com.\n\nThe primary domain ceases to resolve to an IP address on 30 October 2020.\n\nWhile the primary domain ceases to resolve on 30 October 2020, subdomains remained\nactive through early December 2020 as shown in DomainTools Passive DNS (pDNS) data:\n\n\n-----\n\nWith the above, we have some initial observations related to this campaign:\n\n1. Primary C2 infrastructure was acquired and initially provisioned in December 2019\n\nusing an existing but likely expired domain that superficially resembles a domain for\ncloud hosting services.\n2. Hosting, name server, and other items necessary for operational use were established\n\non 27 February 2020.\n3. If Avsvmcloud[.]com is the only primary C2 domain, the SUNBURST campaign was\n\noperational no earlier than 27 February 2020, with a significant change in aspect on\n30 October 2020.\n\nYet, operations do not end here. Provided the subdomain of Avsvmcloud[.]com resolves to\na value not in an internally-stored blocklist of IP address ranges, C2 behavior looks for a\nreturned [Canonical Name (CNAME) record. This value is used for subsequent C2 activity,](https://support.google.com/a/answer/112037)\n[sent via HTTP but using the Orion Improvement Program format to “blend in” to network](https://support.solarwinds.com/SuccessCenter/s/article/Orion-Improvement-Program?language=en_US)\ncommunications. Observed domains linked to second-stage C2 include the following items:\n\n\n**Domain**\n\n\n**Create**\n**Date** **IP Address** **ISP** **Registrar**\n\n\ndatabasegalore[.]com 2019-1214\n\ndeftsecurity[.]com 2019-0211\n\nfreescanonline[.]com 2014-0814\n\n\n5.252.177.21 MivoCloud SRL NAMECHEAP\nINC\n\n\n54.193.127.66 Amazon.com Inc. NAMECHEAP\nINC\n\n\n13.59.205.66 Amazon\nTechnologies Inc.\n\n\nNAMESILO,\nLLC\n\n\n-----\n\n**Domain**\n\n\n**Create**\n**Date** **IP Address** **ISP** **Registrar**\n\n\nhighdatabase[.]com 2019-0307\n\nincomeupdate[.]com 2016-1002\n\npanhardware[.]com 2019-0530\n\nthedoccloud[.]com 2013-0707\n\nvirtualwebdata[.]com 2014-0322\n\nwebsitetheme[.]com 2006-0728\n\nzupertech[.]com 2016-0816\n\n\n139.99.115.204 OVH Singapore\nPte. Ltd\n\n\n51.89.125.18 OVH SAS NameSilo,\nLLC\n\n\nNAMESILO,\nLLC\n\n\n5.252.177.25 MivoCloud SRL NameCheap,\nInc.\n\n204.188.205.176 SharkTech NameSilo,\nLLC\n\n54.215.192.52 Amazon.com Inc. NameSilo,\nLLC\n\n\n18.217.225.111 Amazon\nTechnologies Inc.\n\n18.253.52.187 Amazon\nTechnologies Inc.\n\n\nNameSilo,\nLLC\n\n\nNAMESILO,\nLLC\n\n\n## Understanding Network Infrastructure\n\nBased on the dataset of eleven domains—one initial C2 item that works to resolve a second\nC2 domain for adversary use—we can derive several lessons about the responsible\nadversary and their infrastructure tendencies.\n\nFirst and foremost, the adversary relies overwhelmingly on cloud-based providers such as\nAmazon and Microsoft for hosting purposes, with smaller or less-reputable providers also\nused for the second-stage C2 domains. While not well reflected in the pattern of secondstage domains, pDNS information for subdomain resolutions on Avsvmcloud[.]com show an\noverwhelming use of major cloud providers in returned responses, captured in DomainTools\nIris output [here. This hosting tendency makes infrastructure pivoting difficult, but also](https://pastebin.com/T0SRGkWq)\npresents problems for defenders as such infrastructure can be shared by additional, nonmalicious entities or reallocated quickly to other parties which muddies forensic analysis.\n\n[Second, naming themes as one component of domain characteristics show a tendency](https://www.domaintools.com/resources/blog/analyzing-network-infrastructure-as-composite-objects?utm_campaign=unraveling-network-infrastructure-linked-to-the-solarwinds-hack&utm_source=Blog)\ntoward technology or IT service names. Although somewhat difficult to track and filter,\nidentifying naming themes in new, previously unobserved network traffic can serve as a way\nto flag suspicious infrastructure for follow-on investigation. Looking for “technology\nadjacent” domains newly resolving can serve as a tripwire for possible malicious activity.\n\n\n-----\n\nThird, the domains in question appear to represent a combination of likely adversary\ncreated (such as Databasegalore[.]com, which was created roughly the same time\nAvsvmcloud[.]com was provisioned), opportunistic re-registration of existing domains, and\npossible compromise of legitimate infrastructure. In the second case, Deftsecurity[.]com\nchanges registrar and privacy provider in February 2019 despite existing for several years\nprior indicating likely re-registration by the adversary. More concerning are cases such as\nFreescanonline[.]com, which appears to have been a legitimate site for Search Engine\nOptimization (SEO) analysis as late as August 2019:\n\nOf note, this domain was resolving to 108.179.242[.]236 until mid-February 2020, when it\nshifted to Amazon hosting inline with other network items observed in this campaign. This\nitem therefore is somewhat ambiguous, either representing adversary take-over (given how\nrecently it appears to have been used for legitimate purposes) or opportunistic reregistration on expiration.\n\nOverall, the attacker leveraged domains with some degree of “history” behind them to\nevade filters or algorithms that flag network infrastructure due to “newness”. By having\nseveral months of creation time before either taking control over or modifying hosting for\nuse in the SUNBURST campaign between December 2019 and March 2020 (based on\nanalysis of DomainTools data), the attacker could build a false sense of trust in the network\ninfrastructure used to potentially evade some security solutions and analysis.\n\n## Lessons for Defenders\n\nOverall, the SUNBURST campaign represents a highly complex, operationally savvy, and\n[technically patient campaign. As detailed by FireEye and](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html) [Microsoft, this extends to](https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/)\nsubsequent lateral movement operations within victim networks which relied\n\n\n-----\n\noverwhelmingly on capturing credentials within victim environments and mimicking user\nactivity to evade detection. We as network defenders are thus presented with an\nexceptionally difficult attack to detect, defeat, and recover from—or are we?\n\nAs documented in this posting, there are a number of network observables that are critical\nto attacker success for C2 purposes as part of SUNBURST operations. While certainly not\nwithout its own difficulties, Network Security Monitoring (NSM) and DNS analysis can\nidentify new, unusual, or outright suspicious network communication patterns.\n\nMonitoring is even more powerful when tracking external communications is combined with\ninternal system awareness to quickly disposition what hosts are communicating to outside\nentities. In the case of the SolarWinds Orion software, identifying traffic from this service or\nits hosting device to new, unusual domains—even if using communication patterns similar\nto Orion telemetry—can rapidly identify connections that are abnormal and worth further\nscrutiny.\n\nWhile much work would remain to properly disposition the event in question and discover\nsomething as complex and evasive as a malicious, signed update package, at least initial\ndetection that something is “wrong” can be readily achieved. Next steps would require\nfurther analysis, review of system behaviors and configurations, and subsequent\ninvestigation—but at a minimum defenders are now alert and aware that something is\namiss within the monitored environment.\n\n## Conclusion\n\nThe SUNBURST campaign represents a uniquely distressing intrusion event with\nimplications for multiple industries and network operators. The ubiquity of SolarWinds in\n[large networks, combined with the potentially long dwell time of intrusions facilitated by this](https://i.crn.com/sites/default/files/ckfinderimages/userfiles/images/crn/custom/whitepaper_cyber_dwell_time_en_0.pdf)\ncompromise, mean victims of this campaign need not only recover their SolarWinds\ninstance, but may need to perform widespread password resets, device recovery, and\nsimilar restoration activity to completely evict an intruder.\n\nWhile this is concerning and unfortunate for the present circumstances, future supply chain\nattacks—as this will not be the last such incident to impact network defenders and\noperators—can be met with and detected by aggressive NSM and communication visibility.\nSo long as even the most complex backdoor or implant requires communication to or\ninstructions from a controlling entity, defenders have opportunities to detect and disrupt\noperations. Through continuous monitoring of network traffic and an understanding of what\nhosts are communicating, defenders can leverage attacker weaknesses and dependencies\nto overcome these otherwise daunting challenges.\n\nRead our next blog in series on the SolarWinds Supply Chain Incident.\n\n[Read More](https://www.domaintools.com/resources/blog/continuous-eruption-further-analysis-of-the-solarwinds-supply-incident?utm_campaign=unraveling-network-infrastructure-linked-to-the-solarwinds-hack&utm_source=Blog)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-14 - Unraveling Network Infrastructure Linked to the SolarWinds Hack.pdf"
    ],
    "report_names": [
        "2020-12-14 - Unraveling Network Infrastructure Linked to the SolarWinds Hack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535871,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653766786,
    "ts_modification_date": 1653766786,
    "files": {
        "pdf": "https://archive.orkl.eu/e6c62f977f0bfcbf67374a67ef778b1adf55d9ce.pdf",
        "text": "https://archive.orkl.eu/e6c62f977f0bfcbf67374a67ef778b1adf55d9ce.txt",
        "img": "https://archive.orkl.eu/e6c62f977f0bfcbf67374a67ef778b1adf55d9ce.jpg"
    }
}