{
    "id": "b885f8b4-fda2-4273-8ae1-4f3b9ce59e9e",
    "created_at": "2022-10-25T16:48:12.549353Z",
    "updated_at": "2025-03-27T02:17:14.441111Z",
    "deleted_at": null,
    "sha1_hash": "03c57228e99df9e0536038c7fe3bf74f77fd4377",
    "title": "Operation Cloud Hopper & RedLeaves",
    "authors": "",
    "file_creation_date": "2020-06-01T07:22:54Z",
    "file_modification_date": "2020-06-01T07:22:54Z",
    "file_size": 1583883,
    "plain_text": "y,\n\n\n# XMRig-based CoinMiners\n\n\n**by Blue Mockingbird Threat Actor**\n\n\n-----\n\n### Contents\n\nOverview ............................................................................................................. 3\n\nIncident Detection ................................................................................................ 4\n\nForensic Investigation ........................................................................................... 5\n\nMalware Analysis .................................................................................................. 6\n\nDLLs Dropped by w3wp.exe - CVE-2019-18935 Exploitation.................................... 6\n\nSchtasks Backdoor ............................................................................................. 8\n\nXMRig-based CoinMiner ...................................................................................... 9\n\nCoinMiner Installation and Persistence ............................................................... 13\n\nDLL Installer ................................................................................................ 13\n\nWMI Event Subscription ................................................................................ 14\n\nCOR Profiler ................................................................................................. 14\n\nInstallation Script and Package ...................................................................... 15\n\nConclusion ......................................................................................................... 20\n\nReferences ......................................................................................................... 21\n\n\n-----\n\n## OVERVIEW\n\nSince the end of March LIFARS DFIR team has observed an increase in the number of\nincidents related to Monero cryptocurrency miners. Some of the companies affected by\nthis type of malware came to us, which prompted us to begin an investigation. Based on\nthe initial discussion with the clients, we determined a few machines from which to start\nour investigation. As we collected and analyzed more and more data about the current\nstate of the incident as well as the attacker’s abilities, we utilized approaches from\nforensic analysis, monitoring and threat hunting.\n\nReconstructing the attacker's steps and working backwards, we found Patient Zero –\nmachine, which was first compromised by attackers to gain access to the client network.\nLIFARS detected and analyzed the exploitation of CVE-2019-18935 vulnerability in Telerik\nWeb UI for ASP.NET, lateral movement and the compromise of hundreds of machines in\nthe internal network, remote backdoors and cryptocurrency miners with multiple\npersistence techniques used, including a not as common one based on COR Profilers.\n\nWe found the linking between the publicly available exploit for CVE-2019-18935 and the\ncustom malware used as an installer of CoinMiners. Later we were able to reconstruct the\nwhole installation and CoinMiner infection process, including the installation artifacts\nwhich had been deleted. Based on our investigation, we confirmed the origin of these\nattacks to the Blue Mockingbird group of attackers.\n\nIn this case study, we summarize findings and describe some of our methods and\ntechniques.\n\n\n-----\n\n## INCIDENT DETECTION \n\nIt started inconspicuously, with a high load of computers. At first glance, there seemed\nto be no abnormalities, just some updates being applied, but when the local IT staff\nverified these machines, they noticed something unusual – abnormally high CPU and\nmemory usage by svchost and regsvr processes.. Moreover, the svchost processes\ncorresponded with the “Problem Reports and Solutions Control Panel Support” service\n(wercplsupport). Things started to sound odd...\n\nFurther inspection showed association and presence of the file wercplsupporte.dll in\nSystem32 directory. Yes, this file tried to mask itself as legitimate wercplsupport.dll, with\nthe additional letter “e” concatenated to the end. It even contained the fake information\nabout its origin – Host Process for Windows Services by Microsoft Corporation, as we can\nsee on Figure 1.\n\nFigure 1. Meta information from wercplsupporte.dll\n\nForced AV checks with various AV engines reported the file as CoinMiner, or crypto mining\nvariant. In another step performed by LIFARS, we saw that the extracted strings contain\nmany occurrences of XMRig substrings (Figure 2), so we had to deal with the infection of\nXMRig-based CoinMiner. But the question is, what else did the attacker deploy in the\nclient network and how did they get access to it.\n\n\n-----\n\nFigure 2. XMRig in extracted strings of wercplsupporte.dll\n\n## FORENSIC INVESTIGATION \n\nWhile following the usual procedures like antimalware scans and IOC search, reviewing\nartifacts of execution and persistence, event logs, searching for connections, etc., we\nanalyzed the machine with the XMRig-based CoinMiner, and found a couple of malicious\nfiles.\n\nThere were multiple XMRig-based DLLs with the same hash, but different names. Most\nof them looked randomly generated, but there were also DLLs with the names dialogex.dll,\ncheckservices.dll and the previously mentioned wercplsupporte.dll inside the System32\nfolder. While these names look legitimate, they are not standard names of Windows DLLs\n(e.g. can be verified in NSRL database). Most of these DLLs used either scheduled tasks\nor services for their persistence.\n\nHowever, one of the random DLLs had a different hash value and it seems that it is a\ntype of installer; it creates a scheduled task and service for running wercplsupporte.dll\nand dialogex.dll.\n\nThese CoinMiner-related malicious files as well as the persistence will be covered later in\nthis case study.\n\nWe also found other malware; the batch file called x.bat with PowerShell downloader.\nInteresting fact was that it downloaded its payload from the local webserver instead of a\npublicly accessible malware distribution point. While the payload was masked as a\nJavaScript resource on the internal webserver, it seemed that it was actually a PowerShell\nbackdoor.\n\nThe above-mentioned finding led our investigation to the webserver, where we found\nmore evidence of attacker presence as well as another piece of the malware-puzzle.\nEspecially, there were a couple of DLLs in C:\\Windows\\Temp\\ directory with the filename\n\n\n-----\n\nconsisting of the Unix-like timestamp (seconds since Jan 01 1970 UTC) and a randomly\ngenerated number. These DLLs were dropped by w3wp.exe (IIS Worker Process). This\naroused suspicion in us that maybe some ASP.NET web app was vulnerable and exploited\nby the attackers.\n\n## MALWARE ANALYSIS \n\nLet's summarize our findings and results of analysis of malicious artifacts found during\nforensic investigation and monitoring.\n\n#### DLLS DROPPED BY W3WP.EXE - CVE-2019-18935 EXPLOITATION \nBeginning with the latest mentioned artifact, these “Unix-like timestamp” DLLs differed\nonly in very small portion of their content. To be more precise, they differed only in two\nembedded strings – the name of the original DLL file from compilation, especially in the\ntimestamp part of these filenames.\n\nFigure 3. DLLs dropped by w3wp.exe differs only in the original filenameof the DLL\n\nThe DLLs were mixed mode assembly, so they contained both the managed and\nunmanaged machine instructions and MSIL instructions. The .NET part of the DLL\ncontains only the Empty class (yes, really empty). On the other hand, in the native code\nof DLL main dispatcher it spawned a new thread and created a TCP socket connected to\nthe attacker Command & Control server on TCP port 443, but without any TLS encryption.\n\nWe already had the suspicion that this could be the payload delivered after exploitation\nof the ASP.NET vulnerability. Equipped with the knowledge of its purpose, C&C IP address\nand similarity in the original build DLL names, we leverage the Threat Intelligence and\nfound the tool, which produced the same DLLs.\n\nIt turns out that these DLLs had been part of the Remote code execution (RCE) exploit\nfor a .NET JSON deserialization vulnerability CVE-2019-18935 in Telerik UI for ASP.NET\nAJAX.\n\n[This RCE exploit can be found on https://github.com/noperator/CVE-2019-18935/.](https://github.com/noperator/CVE-2019-18935/)\n\nThere is a build_dll.bat script in the GitHub repository, which produces the same filenames\nas we saw as original build filenames in our samples – concatenated from the base name\n\n\n-----\n\nof the source code file, datetime and architecture. In the repository, the C source code\nof the native part of the DLL file is called rev_shell.c, which also matched our case.\n\nFigure 4. Build_dll.bat script which generated the original DLL filenames\n\nIn the Figure 4, there is also an empty.cs module, which contains the Empty class, as we\ncommented before.\n\nFigure 5. The Empty class used in CVE-2019-18935 RCE\n\nMoreover, this exploit uses the same format of remote payload names as we saw:\ntimestamp.random.dll, as it is clear from the “demo” run:\n\nFigure 6. Demonstration of CVE-2019-18935 exploit\n\nThus, it seems that we had the culprit – the exploitation of the CVE-2019-18935, and also\nhad identified Patient Zero. These findings were verified with the client and they\nconfirmed that they had deployed an obsolete version of Telerik Web UI for ASP.NET,\n\n\n-----\n\nwhich was vulnerable. Next step was to correlate the timestamps of the exploitation of\nthe CVE-2019-18935 with logs from network monitoring and proxy servers.\n\n#### SCHTASKS BACKDOOR \nThe x.bat batch file was found during the forensic investigation. As we described above,\nit contained a PowerShell downloader, which downloaded a string from a JavaScript\nresource from the webserver on the local network and executed it. Then, it called InvokeTaskback with the nccat method and the public IP address as the parameter. Because\nthe Invoke-Taskback is not a cmdlet or function of PowerShell by default, it had to come\nfrom the JavaScript resource. Thus, this resource was probably PowerShell code instead\nof JavaScript.\n\nThe IP address is worth attention, because it is the same used as the C&C IP address\nwith the CVE-2019-18935 exploit.\n\nFigure 7. x.bat with PowerShell downloader and nccat backdoor\n\nLet’s move on to the webserver with the JavaScript resource. In fact, it was indeed a\nPowerShell script, at last we had our truth. It created a scheduled task with the name\n“NetworkDialogs” in our case, which executed the following command:\n```\n regsvr32.exe /u /s /i:\"c:\\windows\\temp\\scripttempx.tks\" scrobj.dll\n\n```\nThe file scripttempx.tks contained either msf, cmd or nccat payload. In our case, the\nx.bat used this scheduled task for nccat backdoor.\n\nAgain, with Threat Intelligence powered with the knowledge gained revealed the most\nprobable origin of the scheduled task backdoor: the 4 year old Schtasks-Backdoor GitHub\nrepository available at [https://github.com/re4lity/Schtasks-Backdoor](https://github.com/re4lity/Schtasks-Backdoor) with Chinese\ncomments in Readme file.\n\n\n-----\n\nFigure 8. Readme of Schtasks-Backdoor GitHub repository\n\n#### XMRIG-BASED COINMINER \nRecall the detection phase and forensic investigation, we were aware of a couple of DLLs\nmasked as (or wannabe) Windows system DLLs such as wercplsupporte.dll, dialogex.dll,\nand checkservices.dll. Verified on the clean systems and also in known files databases\nsuch as NSRL, not only were their hashes present in the databases, but none of the\nfilenames were known. On the other hand, for most people these filenames look pretty\nlegitimate mixed with the many other Windows files in System32 directory.\n\nFigure 9. Module wercplsupporte.dll loaded in svchost.exe is unsigned and not found in NSRL\n\n\n-----\n\nThese unknown DLL files were accompanied with multiple DLLs with random names, but\nall of them (except one) had the same hash.\n\nWe proceeded with the brief analysis of the samples with the same hash, which caused\na lot of DNS resolutions of the domain names such as:\n\n  - xmr-us-east1.nanopool.org\n\n  - xmr-us-west1.nanopool.org\n\n  - xmr-eu1.nanopool.org\n\n  - pool.minexmr.com\n\n  - ...\n\nSo evidently the domain names are associated with the Monero mining pools. Of course,\nthey could be used as network IOCs for detection of other machines infected with this\nCoinMiner.\n\nAlso, a string search revealed the origin in XMRig CoinMiner, with exact versions and build\ndates. We saw various similar samples collected from our clients and from public\nrepositories, with build dates between February and April.\n\nFigure 10. Example of the build dates of XMRig-based samples\n\nAgain, XMRig is opensource tool available on GitHub, and version 5.3.0 was released in\nDecember 2019, while on Feb 13 2020 there was a version 5.5.3, thus the attackers didn’t\nuse the most recent version for their attacks. The second example in the Figure 10\ncontains XMg 10.5.0, however, while XMG could stand for Coin Magi, the XMg miner\n10.5.0 is unknown to search engines. Moreover, the second sample shares large portion\nof code with XMRig miner, so this could only be a custom name for this miner.\n\nWhen we look at the code reuse, there are parts shared with XMRig, but most importantly,\nthis malware sample is attributed to the Blue Mockingbird group, which is known due to\nthe same kinds of coin mining attacks as we had previously investigated.\n\n\n-----\n\nFigure 11. Code Reuse of the XMRig-based CoinMiner\n\nThere is another thing common for all of these XMRig-based CoinMiner DLLs. All of them\n(at least all of we were able to capture) had the exported symbol (function) called\n“fackaaxv”. At the very beginning of this exported function the samples created Mutex\ncalled “Samplexn07”, and if this mutex already exists, this function ends.\n\nFigure 12. Part of the disassembly function fackaaxv. It tries to create a mutex \"Samplexn07\"\nWe need to mention, this fackaaxv function is also called directly from the\nDllRegisterServer exported entry, which is used when this DLL is used as an argument\nfor regsvr32.exe.\n\n\n-----\n\nFigure 13. Call (jump) to the fackaaxv from DllRegisterServer() function\n\nThis means that even if this DLL is used with regsvr32.exe, the same mutex is created,\nand moreover, its exclusivity is guaranteed even if the fackaaxv entry from this DLL is\ncalled via rundll32.exe, for example.\n\nFigure 14. Example of running CoinMiner process with the Mutex “Samplexn07”\n\nThat’s malware analysis point of view. Enriched by forensic investigation, we already\nknew that these DLLs had been used in scheduled tasks and services, such as the\naforementioned “Problem Reports and Solutions Control Panel Support” service\n(wercplsupport). Moreover, there were a couple of scheduled tasks with random names,\nwhich executed the following commands associated with these CoinMiner DLLs:\n\n  - `cmd.exe /c regsvr32.exe /s c:\\windows\\System32\\%RANDOM1%.dll`\n\n  - `cmd.exe /c rundll32.exe c:\\windows\\System32\\%RANDOM2%.dll,fackaaxv`\n\n  - `cmd.exe /c sc config wercplsupport start=auto & sc start wercplsupport`\n\n  - `cmd.exe /c sc start wercplsupport & start regsvr32.exe /s`\n```\n    c:\\windows\\System32\\%RANDOM3%.dll\n\n```\n  - `regsvr32.exe /s c:\\windows\\System32\\wercplsupporte.dll`\n\n\n-----\n\nAll of these tasks were executed daily, on 08:10, 20:02, 20:15, 20:20 and 20:25. Most of\nthe tasks had random names, except the last one with the name \"Windows Problems\nCollection\".\n\nAnd that is not all, there was one more service with a random name on the system, which\nexecuted the following command:\n\n  - `cmd /c sc config wercplsupport start= auto & sc start wercplsupport &`\n```\n    copy c:\\windows\\System32\\%result3%.dll\n    c:\\windows\\System32\\wercplsupporte.dll /y & regsvr32.exe /s\n    c:\\windows\\System32\\%result3%.dll\n\n#### COINMINER INSTALLATION AND PERSISTENCE\n\n```\nDLL INSTALLER\nThe next step was to find what was responsible for the persistence described above. We\nhad one more DLL with a unique hash, so now it was time to analyze it and try to answer\nthe question of persistence.\n\nDespite its size of approximately 107kB, this DLL contained only a small portion of regular\nfunctions. Most of the code were known library functions. The biggest one of the regular\nfunctions was the DllMain function, which was really simple – it executed the cmd.exe\nwith the command for creation of the “Windows Problems Collection” scheduled task,\nconfiguring automatic start of the wercplsupport service, copying dialogex.dll to\nwercplsupporte.dll file and starting dialogex.dll via regsvr32.dll.\n\nFigure 15. Persistence in DLLMain function of the “unique” DLL file\n\nWe had now found what caused one part of the persistence mechanism for the\nCoinMiners, but there were others, unknown to us in this phase of incident response and\nanalysis. We then decided to start with cleaning the known malicious artifacts, while our\nmonitoring team was watching what happened as a result of the actions.\n\n\n-----\n\nWMI EVENT SUBSCRIPTION\nDuring the process, our monitoring team noticed hits on our watchlist with the known\nmalicious hashes and filepaths. We saw the execution attempts of following command:\n\n  - `cmd.exe /c sc config wercplsupport start= auto & sc start wercplsupport`\n```\n    & copy c:\\\\windows\\\\System32\\\\checkservices.dll\n    c:\\\\windows\\\\System32\\\\wercplsupporte.dll /y & start regsvr32.exe /s\n    c:\\\\windows\\\\System32\\\\checkservices.dll\n\n```\nBut this time, it seemed that it was caused by WMI. Further investigation revealed the\npersistence was attributed to WMI Event Subscription. The attackers registered the Event\nFilter with conditions related to the Local Time 20:10. They also registered the Consumer\nwhich executed the above command. And lastly, there was registered Filter to Consumer\nBinding present.\n\nWith that, one question was answered, but several new questions were raised. How did\nthey register the WMI persistence? What created the other scheduled tasks and services?\n\nDigging deeper into the WMI-related artifacts, we found a .mof file (Managed Object\nFormat) with the definition of WMI Event Subscription. This file was parsed by compiler\nmofcomp.exe and the defined classes and class instances were added to the WMI\nrepository.\n\nFigure 16. MOF file with the definitions for WMI Event Subscription\n\nCOR PROFILER\nWe continued with the cleaning of the client's network. We also noticed the presence of\nCLSID with the name in the pattern XXX-YYY-YYY-YYY-ZZZ, where the InProcServer32\nvalue contained the ZZZ.dll, where XXX, YYY and ZZZ stands for random numbers linked\nto the CoinMiner DLLs and scheduled tasks. So, another question was presented: how\nhad these CLSIDs been created?\n\n\n-----\n\nTo speed up the process of cleaning and because there were hundreds of infected\ncomputers, we created and deployed the PowerShell script for the automation of cleaning\nthe malicious artifacts.\n\nSuddenly, our monitoring team noticed something unusual... When we executed our\nscript, the PowerShell process spawned the cmd.exe process which then spawned the\nschtasks.exe and tried to create scheduled tasks with persistence of CoinMiner.\n\nOur first suspicion was about process injection – either injection of remote thread or DLL\nhijacking, or some of the other known and documented techniques.\n\nDuring the investigation of this behavior, we used the SysInternals Process Monitor tool\nand it captured the events of querying the Registry values related to the malicious CLSID,\nfollowed by loading library – the DLL file with the “unique” hash. The DLL file we already\nanalyzed and described as the installer.\n\nFigure 17. Loading the malicious DLL observed in Process Monitor\n\nBecause the question of why the PowerShell was interested in this particular CLSID was\nstill unanswered, we continued with the analysis of Process Monitor logs, when we could\nsay “Heureka” - we noticed the CLSID in the environment variable called COR_PROFILER.\nAlso, the variable COR_ENABLE_PROFILING had been set to the value 1. This means,\nevery managed process should be connected to a profiler, and the profiler is defined\neither via CLSID in COR_PROFILER (the path is determined from InProcServer32 value\nof the CLSID) or via its path in the COR_PROFILER_PATH environment variable.\n\nWe also found that these environment variables had been defined in Registry key\nHLKM\\\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Environment.\n\nThere were still many unknowns, but we proceeded one more step. We watched for\nchanges in the Registry related to the Environment and COR_PROFILER, we could then\nuse this information for a more targeted Threat Intelligence, etc.\n\nINSTALLATION SCRIPT AND PACKAGE\nSoon, we found the culprit of the aforementioned persistence artifacts: the batch file\ncalled rn.bat, which did the following:\n\n\n-----\n\nFigure 18. Excerpt from the installation batch file rn.bat\n\n- Stopped legitimate service wercplsupport,\n\n- Ping 127.11.11.11,\n\n- Replaced legitimate wercplsupport.dll with wercplsupporte.dll associated with the\n\nservice wercplsupport,\n\n- Configured wercplsupport service as autostart,\n\n- Generated six random values used later as filenames and tasknames,\n\n- Renamed and moved DLL Installer (referenced as comhij.dll) to %RANDOM%.dll\n\nin System32 directory,\n\n- 4-times copy CoinMiner (referenced as xg.dll) to %RANDOM%.dll in System32,\n\n- 3-times copy CoinMiner to System32 (as the dialogex.dll, checkservices.dll and\n\nwercplsupporte.dll),\n\n- Created 4 scheduled tasks with random names and commands described above\n\n(they utilized regsvr32.exe, rundll32.exe and sc),\n\n- Created aforementioned service with random name,\n\n- Set environment variables via “wmic ENVIRONMENT create ...” commands,\n\n- Registered CLSID as concatenation of generated random numbers,\n\n- Started hijacked wercplsupport service,\n\n- Compiled WMI Event Subscriber definition and added it to the WMI repository via\n\nmofcomp.exe,\n\n- Ran one of the created scheduled tasks,\n\n- Cleaned temporary artifacts – deleted itself as well as “installation” package in the\n\nform of ZIP file.\n\n\n-----\n\nTogether with the rn.bat, we found the batch file called set.bat as well. The purpose of\nthe set.bat was to extract the “installation” package either in the file set.zip or set.zip.tmp\nplaced in C:\\ProgramData directory and via let.exe program which executed the rn.bat\nfile. Then the set.bat deleted the extracted content of the package as well as itself.\n\nFigure 19. The extraction batch file set.bat\n\nWhile most of its content was pretty clear, the purpose of the let.exe program may not\nbe very obvious for people without experience in pentesting and ethical hacking.\n\nOn the other hand, when an experienced pentester saw the commandline arguments of\nthe let.exe, it resembled the commandline arguments of Juicy Potato, a Local Privilege\nEscalation tool, from a Windows Service Accounts to NT AUTHORITY\\SYSTEM (available\n[on GitHub at https://github.com/ohpe/juicy-potato).](https://github.com/ohpe/juicy-potato)\n\nFigure 20. Usage of Juicy Potato\n\nJust for reference, the given CLSID in set.bat is associated with the winmgmt, while the\nJuicy Potato exploit was used for running the rn.bat installation batch file with elevated\nprivileges of NT AUTHORITY\\SYSTEM.\n\nLast but not least, from Threat Intelligence research, we found another DLL file, with the\nname that started with the string “nwgold” and a file size of approximately 214 kB. Again,\nit was a mixed assembly file, as we saw before in CVE-2019-18935 exploit payload. Again,\nit used the same techniques – the empty .NET class, and in the DllMain dispatch function\nthere was a call to the function which created a new thread and executed a command\n\n\n-----\n\nvia cmd.exe, in a very similar manner. Thus, the payload of CVE-2019-18935 exploit and\nthis “nwgold” dll share non neglected portions of code, especially the parts for the\nexecution of the malicious activity. There are three possible explanations:\n\n  - Authors of CVE-2019-18935 exploit and “nwgold” DLL are same,\n\n  - Authors of “nwgold” DLL inspired themselves from the open source CVE-2019\n18935 exploit,\n\n  - The functionality of both DLLs is so simple and straightforward, that it is only a\n\ncoincidence.\n\nFigure 21. Function for CreateProcessA call and construction of executable path in new thread.\n\n“nwgold” on the left, CVE-2019-18935 payload on the right\n\n\n-----\n\nFigure 22. DllMain function.\n“nwgold” on the left, CVE-2019-18935 payload on the right\n\nFigure 23. MSIL part of both assemblies – Empty class.\n“nwgold” on the left, CVE-2019-18935 payload on the right\n\nFrom direct comparison of these DLLs it seemed that the main functionality and code\nconstructs are shared between them, with only a few differences in the used compiler\nand platform (x86 vs amd64). Despite the fact that these DLLs were very straightforward,\nit was very likely that attackers had inspired in the open source code of CVE-2019-18935\npayloads. Especially when we considered the fact that the attackers used mostly open\nsource tools from GitHub, with only small modifications.\n\nAnd the last unanswered question was the purpose of “nwgold” DLL. So, in the Thread\nfunction where cmd.exe was executed, it contained the slightly obfuscated construction\nof long string.. The content of set.bat batch file, as is depicted in Figure 24.\n\n\n-----\n\nFigure 24. Construction of set.bat’s content\n\n## CONCLUSION\n\nLIFARS DFIR team investigated and analyzed the tools, techniques and procedures used\nby Blue Mockingbird threat actor. Thankfully to the cooperation of our forensic analysts,\nmalware analysts, incident responders, threat intelligence researchers and monitoring\nteam we were able to reconstruct all the parts of the attack chain, as shown in Figure 25,\nincluding the parts which had been deleted even before incident response started.\n\nFigure 25. Diagram of the attack chain\n\n\n-----\n\n## REFERENCES \n\n- [https://github.com/noperator/CVE-2019-18935/](https://github.com/noperator/CVE-2019-18935/)\n\n- [https://github.com/re4lity/Schtasks-Backdoor](https://github.com/re4lity/Schtasks-Backdoor)\n\n- [https://github.com/xmrig/xmrig](https://github.com/xmrig/xmrig)\n\n- [https://analyze.intezer.com/#/analyses/f5972783-5d57-43ca-8bb3-dca08741936f](https://analyze.intezer.com/#/analyses/f5972783-5d57-43ca-8bb3-dca08741936f)\n\n- [https://github.com/ohpe/juicy-potato](https://github.com/ohpe/juicy-potato)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.06.01.Blue_Mockingbird_Group/Cryptocurrency-Miners-XMRig-Based-CoinMiner-by-Blue-Mockingbird-Group.pdf",
        "https://lifars.com/wp-content/uploads/2020/06/Cryptocurrency-Miners-XMRig-Based-CoinMiner-by-Blue-Mockingbird-Group.pdf"
    ],
    "report_names": [
        "Cryptocurrency-Miners-XMRig-Based-CoinMiner-by-Blue-Mockingbird-Group",
        "Cryptocurrency-Miners-XMRig-Based-CoinMiner-by-Blue-Mockingbird-Group.pdf"
    ],
    "threat_actors": [
        {
            "id": "e568e9d7-ae94-4ce5-9039-4fd17c731c1d",
            "created_at": "2022-10-25T15:50:23.491763Z",
            "updated_at": "2025-03-27T02:00:55.483586Z",
            "deleted_at": null,
            "main_name": "Blue Mockingbird",
            "aliases": [
                "Blue Mockingbird"
            ],
            "source_name": "MITRE:Blue Mockingbird",
            "tools": [
                "FRP",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1590996174,
    "ts_modification_date": 1590996174,
    "files": {
        "pdf": "https://archive.orkl.eu/03c57228e99df9e0536038c7fe3bf74f77fd4377.pdf",
        "text": "https://archive.orkl.eu/03c57228e99df9e0536038c7fe3bf74f77fd4377.txt",
        "img": "https://archive.orkl.eu/03c57228e99df9e0536038c7fe3bf74f77fd4377.jpg"
    }
}