{
    "id": "b8b3fb50-ab45-4f6d-acca-b41064c15618",
    "created_at": "2023-01-12T15:05:16.175628Z",
    "updated_at": "2025-03-27T02:06:04.763442Z",
    "deleted_at": null,
    "sha1_hash": "036583e04b154fcc8b46717e325f854196b61efe",
    "title": "2021-01-15 - How we’re helping to reshape the software supply chain ecosystem securely",
    "authors": "",
    "file_creation_date": "2022-05-29T01:10:17Z",
    "file_modification_date": "2022-05-29T01:10:17Z",
    "file_size": 188741,
    "plain_text": "# How we’re helping to reshape the software supply chain ecosystem securely\n\n**cloud.google.com/blog/products/identity-security/how-were-helping-reshape-software-supply-chain-ecosystem-**\nsecurely\n\nAs we start the new year, we see ongoing revelations about an attack involving SolarWinds\nand others, that in turn led to the compromise of numerous other organizations. Software\nsupply chain attacks like this pose a serious threat to governments, companies, non-profits,\nand individuals alike. At Google, we work around the clock to protect our users and\ncustomers. Based on what is known about the attack today, we are confident that no Google\nsystems were affected by the SolarWinds event. We make very limited use of the affected\nsoftware and services, and our approach to mitigating supply chain security risks meant that\nany incidental use was limited and contained. These controls were bolstered by\nsophisticated monitoring of our networks and systems.\n\nBeyond this specific attack, we remain focused on defending against all forms of supply\nchain risk and feel a deep responsibility to collaborate on solutions that benefit our\ncustomers and the common good of the industry. That’s why today we want to share some of\nthe security best practices we employ and investments we make in secure software\ndevelopment and supply chain risk management. These key elements of our security and\nrisk programs include our efforts to develop and deploy software safely at Google, design\nand build a trusted cloud environment to deliver defense-in-depth at scale, advocate for\nmodern security architectures, and advance industry-wide security initiatives.\n\n\n-----\n\nTo protect the software products and solutions we provide our cloud customers, we have to\nmitigate potential security risks, no matter how small, for our own employees and systems.\nTo do this, we have modernized the technology stack to provide a more defensible\nenvironment that we can protect at scale. For example, modern security architectures like\n[BeyondCorp allow our employees to work securely from anywhere, security keys have](https://cloud.google.com/beyondcorp)\n[effectively eliminated password phishing attacks against our employees, and Chrome OS](https://support.google.com/chromebook/answer/3438631?hl=en)\nwas built by design to be more resilient against malware. By building a strong foundation for\nour employees to work from, we are well-prepared to address key issues, such as software\nsupply chain security. Many of these topics are covered more extensively in our book\n_[Building Secure and Reliable Systems.](https://static.googleusercontent.com/media/sre.google/en//static/pdf/building_secure_and_reliable_systems.pdf)_\n\n## How we develop and deploy software and hardware safely at Google\n\nDeveloping software safely starts with providing secure infrastructure and requires the right\ntools and processes to help our developers avoid predictable security mistakes. For\nexample, we make use of secure development and continuous testing frameworks to detect\nand avoid common programming mistakes. Our embedded security-by-default approach also\nconsiders a wide variety of attack vectors on the development process itself, including supply\nchain risks.\n\nA few examples of how we tackle the challenge of developing software safely:\n\n**Trusted Cloud Computing: Google Cloud’s infrastructure is designed to deliver**\n[defense-in-depth at scale, which means that we don’t rely on any one thing to keep us](https://cloud.google.com/security/infrastructure/design)\nsecure, but instead build layers of checks and controls that includes proprietary\nGoogle-designed hardware, Google-controlled firmware, Google-curated OS images, a\n[Google-hardened hypervisor, as well as](https://cloud.google.com/blog/products/gcp/7-ways-we-harden-our-kvm-hypervisor-at-google-cloud-security-in-plaintext) [data center physical security and services. We](https://services.google.com/fh/files/misc/google_security_wp.pdf)\n[provide assurances in these security layers through roots of trust, such as Titan Chips](https://cloud.google.com/blog/products/gcp/titan-in-depth-security-in-plaintext)\n[for Google host machines and Shielded Virtual Machines. Controlling the hardware and](https://cloud.google.com/shielded-vm)\nsecurity stack allows us to maintain the underpinnings of our security posture in a way\nthat many other providers cannot. We believe that this level of control results in\nreduced exposure to supply chain risk for us and our customers. More on our\n[measures to mitigate hardware supply chain risk can be found in this blog post.](https://cloud.google.com/blog/products/identity-security/mitigating-risk-in-the-hardware-supply-chain)\n\n**[Binary Authorization: As we describe in our Binary Authorization whitepaper, we](https://cloud.google.com/security/binary-authorization-for-borg)**\nverify, for example, that software is built and signed in an approved isolated build\nenvironment from properly checked-in code that has been reviewed and tested. These\ncontrols are enforced during deployment by policy, depending on the sensitivity of the\ncode. Binaries are only permitted to run if they pass such control checks, and we\ncontinuously verify policy compliance for the lifetime of the job. This is a critical control\nused to limit the ability of a potentially malicious insider, or other threat actor using their\naccount, to insert malicious software into our production environment. Google Cloud\ncustomers can use the [Binary Authorization service to define and automatically enforce](https://cloud.google.com/binary-authorization)\nproduction deployment policy based on the provenance and integrity of their code.\n\n\n-----\n\n**Change Verification: Code and configuration changes submitted by our developers**\nare provably reviewed by at least one person other than the author. Sensitive\nadministrative actions typically require additional human approvals. We do this to\nprevent unexpected changes, whether they’re mistakes or malicious insertions.\n\n## Reshaping the ecosystem\n\nWe also believe the broader ecosystem will need to reshape its approach to layered defense\nto address supply chain attacks long-term. For example, software development teams should\nadopt tamper-evident practices paired with transparency techniques that allow for third-party\nvalidation and discoverability. We have published an architectural guide to adding tamper\nchecking to a package manager, and this is implemented for Golang. Developers can make\n[use of our open-source verifiable Trillian log, which powers the world’s largest, most used](https://transparency.dev/#trillian)\n[and respected production crypto ledger-based ecosystem, certificate transparency.](https://certificate.transparency.dev/)\n\nAnother area for consideration is limiting the effects of attacks by using modern computing\narchitectures that isolate potentially compromised software components. Examples of such\n[architectures are Android OS’s application sandbox, gVisor (an application sandbox for](https://source.android.com/security/app-sandbox)\ncontainers), and Google’s [BeyondProd where microservice containerization can limit the](https://cloud.google.com/security/beyondprod)\neffects of malicious software. Should any of the upstream supply-chain components in these\nenvironments become compromised, such isolation mechanisms can act as a final layer of\ndefense to deny attackers their goals.\n\n## Our industry commitment and responsibility \n\nThe software supply chain represents the links across organizations—an individual company\ncan only do so much on their own. We need to work together as an industry to change the\nway software components are built, distributed and tracked throughout their lifecycle.\n\n[One example of collaboration is the Open Source Security Foundation, which Google co-](https://openssf.org/)\nfounded last year to help the industry tackle issues like software supply chain security in\nopen source dependencies and promote security awareness and best practices. We also\nwork with industry partners to improve supply chain policies and reduce supply chain risk,\nand publish information for users and customers on how they can use our technology to\nmanage supply chain risk.\n\n## Pushing the software ecosystem forward\n\nAlthough the history of software supply chain attacks is well-documented, each new attack\nreveals new challenges. The seriousness of the SolarWinds event is deeply concerning but it\nalso highlights the opportunities for government, industry, and other stakeholders to\ncollaborate on best practices and build effective technology that can fundamentally improve\nthe software ecosystem. We will continue to work with a range of stakeholders to address\nthese issues and help lay the foundation for a more secure future.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-15 - How we’re helping to reshape the software supply chain ecosystem securely.pdf"
    ],
    "report_names": [
        "2021-01-15 - How we’re helping to reshape the software supply chain ecosystem securely.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535916,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653786617,
    "ts_modification_date": 1653786617,
    "files": {
        "pdf": "https://archive.orkl.eu/036583e04b154fcc8b46717e325f854196b61efe.pdf",
        "text": "https://archive.orkl.eu/036583e04b154fcc8b46717e325f854196b61efe.txt",
        "img": "https://archive.orkl.eu/036583e04b154fcc8b46717e325f854196b61efe.jpg"
    }
}