{
    "id": "b8fcd8ad-d1dd-49ff-a8ff-8df9d31d905b",
    "created_at": "2023-01-12T14:59:01.577269Z",
    "updated_at": "2025-03-27T02:06:10.947034Z",
    "deleted_at": null,
    "sha1_hash": "3b3059fb8a857ebf25ab08d7c6573cd6617fde8e",
    "title": "2021-08-04 - LockBit ransomware recruiting insiders to breach corporate networks",
    "authors": "",
    "file_creation_date": "2022-05-27T02:09:32Z",
    "file_modification_date": "2022-05-27T02:09:32Z",
    "file_size": 2236615,
    "plain_text": "# LockBit ransomware recruiting insiders to breach corporate networks\n\n**[bleepingcomputer.com/news/security/lockbit-ransomware-recruiting-insiders-to-breach-corporate-networks/](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-recruiting-insiders-to-breach-corporate-networks/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nAugust 4, 2021\n12:19 PM\n0\n\nThe LockBit 2.0 ransomware gang is actively recruiting corporate insiders to help them\nbreach and encrypt networks. In return, the insider is promised million-dollar payouts.\n\nMany ransomware gangs operate as a Ransomware-as-a-Service, which consists of a core\ngroup of developers, who maintain the ransomware and payment sites, and recruited\naffiliates who breach victims' networks and encrypt devices.\n\nAny ransom payments that victims make are then split between the core group and the\naffiliate, with the affiliate usually receiving 70-80% of the total amount.\n\nHowever, in many cases, the affiliates purchase access to networks from other third-party\npentesters rather than breaching the company themselves.\n\n\n-----\n\nWith LockBit 2.0, the ransomware gang is trying to remove the middle-man and instead\nrecruit insiders to provide them access to a corporate network.\n\n## LockBit 2.0 promises millions of dollars to insiders\n\n[In June, the LockBit ransomware operation announced the launch of their new LockBit 2.0](https://twitter.com/Intel_by_KELA/status/1406905385580118017?s=20)\nransomware-as-a-service.\n\nThis relaunch included redesigned Tor sites and numerous advanced features, including\n[automatically encrypting devices on a network via group policies.](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/)\n\nWith this relaunch, LockBit has also changed the Windows wallpaper placed on encrypted\ndevices to offer \"millions of dollars\" for corporate insiders who provide access to networks\nwhere they have an account.\n\nNew LockBit 2.0 wallpaper recruiting insiders\nThe full text, with the contact information redacted, explains that LockBit is looking for RDP,\nVPN, corporate email credentials that they can then use to gain access to the network.\n\nThe ransomware gang also says they will send the insider a \"virus\" that should be executed\non a computer, likely to give the ransomware gang remote access to the network.\n\n\n-----\n\nWould you like to earn millions of dollars?\nOur company acquire access to networks of various companies, as well as insider\ninformation that can help you steal the most valuable data of any company.\nYou can provide us accounting data for the access to any company, for example, login\nand password to RDP, VPN, corporate email, etc. Open our letter at your email.\nLaunch the provided virus on any computer in your company.\nCompanies pay us the foreclosure for the decryption of files and prevention of data\nleak.\nYou can communicate with us through the Tox messenger\nhttps://tox.chat/download.html\nUsing Tox messenger, we will never know your real name, it means your privacy is\nguaranteed.\nIf you want to contact us, use ToxID: xxxx\"\n\nWhen we first saw this message, it seemed counterintuitive to recruit an insider for a network\nalready been breached.\n\nHowever, this message is likely targeting external IT consultants who may see the message\nwhile responding to an attack.\n\nWhile this tactic may sound far-fetched, it is not the first time threat actors attempted to\nrecruit an employee to encrypt their company's network.\n\nIn August 2020, the FBI arrested a Russian national for attempting to recruit a Tesla\nemployee to plant malware on the network of Tesla's Nevada Gigafactory.\n\n### Related Articles:\n\n[Costa Rica declares national emergency after Conti ransomware attacks](https://www.bleepingcomputer.com/news/security/costa-rica-declares-national-emergency-after-conti-ransomware-attacks/)\n\n[The Week in Ransomware - May 6th 2022 - An evolving landscape](https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-may-6th-2022-an-evolving-landscape/)\n\n[Conti, REvil, LockBit ransomware bugs exploited to block encryption](https://www.bleepingcomputer.com/news/security/conti-revil-lockbit-ransomware-bugs-exploited-to-block-encryption/)\n\n[Online library app Onleihe faces issues after cyberattack on provider](https://www.bleepingcomputer.com/news/security/online-library-app-onleihe-faces-issues-after-cyberattack-on-provider/)\n\n[New Black Basta ransomware springs into action with a dozen breaches](https://www.bleepingcomputer.com/news/security/new-black-basta-ransomware-springs-into-action-with-a-dozen-breaches/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-04 - LockBit ransomware recruiting insiders to breach corporate networks.pdf"
    ],
    "report_names": [
        "2021-08-04 - LockBit ransomware recruiting insiders to breach corporate networks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535541,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653617372,
    "ts_modification_date": 1653617372,
    "files": {
        "pdf": "https://archive.orkl.eu/3b3059fb8a857ebf25ab08d7c6573cd6617fde8e.pdf",
        "text": "https://archive.orkl.eu/3b3059fb8a857ebf25ab08d7c6573cd6617fde8e.txt",
        "img": "https://archive.orkl.eu/3b3059fb8a857ebf25ab08d7c6573cd6617fde8e.jpg"
    }
}