{
    "id": "b92ec0ae-22a7-4602-a191-bf25243ea4e3",
    "created_at": "2023-01-12T15:10:36.234644Z",
    "updated_at": "2025-03-27T02:05:31.500588Z",
    "deleted_at": null,
    "sha1_hash": "35ff5951d533b51dab07f93fb72d8c9e7927fb66",
    "title": "2017-01-21 - Sage 2.0 Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T23:28:12Z",
    "file_modification_date": "2022-05-27T23:28:12Z",
    "file_size": 4924646,
    "plain_text": "# SANS ISC: Sage 2.0 Ransomware - SANS Internet Storm Center SANS Site Network Current Site SANS Internet Storm Center Other SANS Sites Help Graduate Degree Programs Security Training Security Certification Security Awareness Training Penetration Testing Industrial Control Systems Cyber Defense Foundations DFIR Software Security Government OnSite Training SANS ISC InfoSec Forums\n\n**isc.sans.edu/forums/diary/Sage+20+Ransomware/21959/**\n\nSage 2.0 Ransomware\n\n\n**_Introduction_**\n\nOn Friday 2017-01-20, I checked a malicious spam (malspam) campaign that\nnormally distributes Cerber ransomware. That Friday it delivered ransomware I'd\nnever seen before called \"Sage.\" More specifically, it was \"Sage 2.0.\"\n\n_Shown above: It's always fun to find ransomawre that's not Cerber or Locky._\n\nSage is yet another family of ransomware in an already crowded field. It was noted\n[on BleepingComputer forums back in December 2016 [1,](https://www.bleepingcomputer.com/forums/t/634978/sage-file-sample-extension-sage/) [2], and Sage is a variant](https://www.bleepingcomputer.com/forums/t/634747/sage-ransomware-sage-support-help-topic/)\nof [CryLocker [3]. Unfortunately, I can't find an in-depth write-up on Sage that I like.](https://www.bleepingcomputer.com/news/security/the-crylocker-ransomware-communicates-using-udp-and-stores-data-on-imgur-com/)\nWith that in mind, this diary examines Sage 2.0.\n\n**_The malspam_**\n\nEmails from this particular campaign generally have no subject lines, and they\nalways have no message text. The only content is a zip attachment containing a\nWord document with a malicious macro that downloads and installs ransomware.\nSometimes, I'll see a .js file instead of a Word document, but it does the same thing.\n\n\nBrad\n\n433 Posts\n\nISC\nHandler\nJan 21st\n2017\n\n\n-----\n\n_Shown above: Data from a spreadsheet tracking the malspam (1 of 3)._\n\nOften, the recipient's name is part of the attachment's file name. I replace those\nnames with [recipient] before I share any info. A more interesting fact is the\nattachments are often double-zipped. They contain another zip archive before you\nget to the Word document or .js file.\n\n_Shown above: Data from a spreadsheet tracking the malspam (2 of 3)._\n\n_Shown above: Example of a Word document with a malicious macro._\n\n\n-----\n\n_Shown above: Another example of the Word document with a malicious macro._\n\nThe Word document macros or .js files are designed to download and install\nransomware. In most cases on Friday, the ransomware was Sage 2.0.\n\n_Shown above: Data from a spreadsheet tracking the malspam (3 of 3), mostly Sage_\n_2.0._\n\n**_The infected host_**\n\nUnder default settings, an infected Windows 7 host will present a UAC window\nbefore Sage continues any further. It keeps appearing until you click yes.\n\n\n-----\n\n_Shown above: UAC pop-up caused by Sage._\n\nThe infected Windows host has an image of the decryption instructions as the\ndesktop background. There's also an HTML file with the same instructions dropped\nto the desktop. The same HTML file is also dropped to any directory with encrypted\nfiles. \".sage\" is the suffix for all encrypted files.\n\n_Shown above: Desktop of an infected Windows host._\n\n\n-----\n\nSage ransomware is kept persistent by a scheduled task, and it s stored as an\nexecutable in the user's AppData\\Roaming directory.\n\n_Shown above: Sage ransomware and it's scheduled task for persistence._\n\nFollowing the decryption instructions should take you to a Tor-based domain with a\ndecryptor screen. On Friday, the cost to decrypt the files was $2,000 US dollars (or\n2.22188 bitcoin).\n\n\n-----\n\n_Shown above: The Sage 2.0 decryptor._\n\n**_Sage 2.0 traffic_**\n\nSage ransomware generates post-infection traffic. In the image below, an initial\nHTTP GET request to smoeroota.top was caused by a .js file retrieving the\nransomware. The remaining HTTP POST requests are callback traffic generated by\nSage 2.0 from the infected Windows host.\n\n_Shown above: Screenshot of the infection traffic, filtered in Wireshark._\n\n\n-----\n\n_Shown above: TCP stream of an HTTP request for the post-infection traffic._\n\nWhen the callback domains for Sage didn't resolve in DNS, the infected host sent\nUDP packets sent to over 7,000 IP addresses. I think this could be UDP-based\npeer-to-peer (P2P) traffic, and it appears to be somehow encoded or encrypted.\nBleepingComputer's September 2016 write-up on CryLocker shows the same type\n[of UDP post-infection traffic, but CryLocker's traffic was not encrypted [4].](https://www.bleepingcomputer.com/news/security/the-crylocker-ransomware-communicates-using-udp-and-stores-data-on-imgur-com/)\n\n_Shown above: An HTTP request for the Sage 2.0 binary, followed by callback_\n_domains not resolving in DNS._\n\n\n-----\n\n_Shown above: UDP traffic caused by Sage 2.0 when callback domains were_\n_unavailable._\n\n_Shown above: Examining one of the UDP packets._\n\n**_Indicators of Compromise (IOCs)_**\n\nBelow are IOCs for Sage 2.0 from Friday 2017-01-20:\n\nRansomware downloads caused by Word document macros or .js files:\n\n54.165.109.229 port 80 - smoeroota.top - GET /read.php?f=0.dat\n54.165.109.229 port 80 - newfoodas.top - GET /read.php?f=0.dat\n84.200.34.99 port 80 - fortycooola.top - GET /user.php?f=0.dat\n\nPost-infection traffic:\n\n54.146.39.22 port 80 - mbfce24rgn65bx3g.er29sl.in - POST /\n\n\n-----\n\n66.23.246.239 port 80 mbfce24rgn65bx3g.er29sl.in POST /\n**_mbfce24rgn65bx3g.rzunt3u2.com (DNS queries did not resolve)_**\nVarious IP addresses, UDP port 13655 - possible P2P traffic\n\nTor-based domains to view the decryption instructions:\n\n**_7gie6ffnkrjykggd.rzunt3u2.com_**\n**_7gie6ffnkrjykggd.er29sl.in_**\n**_7gie6ffnkrjykggd.onion_**\n\nSHA256 hashes for the Sage 2.0 ransomware samples:\n\n0ecf3617c1d3313fdb41729c95215c4d2575b4b11666c1e9341f149d02405c05\n(352,328 bytes)\n362baeb80b854c201c4e7a1cfd3332fd58201e845f6aebe7def05ff0e00bf339\n(352,328 bytes)\n3b4e0460d4a5d876e7e64bb706f7fdbbc6934e2dea7fa06e34ce01de8b78934c\n(352,328 bytes)\n8a0a191d055b4b4dd15c66bfb9df223b384abb75d4bb438594231788fb556bc2\n(352,328 bytes)\nccd6a495dfb2c5e26cd65e34c9569615428801e01fd89ead8d5ce1e70c680850\n(352,328 bytes)\n\nExamples of locations on the infected Windows host where Sage 2.0 was made\npersistent:\n\nC:\\Users\\[username]\\AppData\\Roaming\\gNwO5YoE.exe\nC:\\Users\\[username]\\AppData\\Roaming\\wiqpNWm7.exe\nNOTE: File names appear to consists 8 random alphabetic characters with an\n.exe suffix.\n\n**_Final words_**\n\nAn important note: URLs for the ransomware download will send Cerber one day,\nbut the same URLs can send something like Sage ransomware the next.\n\nI'm not sure how widely-distributed Sage ransomware is. I've only seen it from this\none malspam campaign, and I've only seen it one day so far. I'm also not sure how\neffective this particular campaign is. It seems these emails can easily be blocked,\nso few end users may have actually seen Sage 2.0.\n\nStill, Sage is another name in the wide variety of existing ransomware families. This\nillustrates how profitable ransomware remains for cyber criminals.\n\n[Pcaps, emails, malware, and artifacts for this diary are available here.](http://www.malware-traffic-analysis.net/2017/01/21/index.html)\n\n--Brad Duncan\nbrad [at] malware-traffic-analysis.net\n\nReferences:\n\n[1] https://www.bleepingcomputer.com/forums/t/634978/sage-file-sample-extensionsage/\n\n[2] https://www.bleepingcomputer.com/forums/t/634747/sage-ransomware-sagesupport-help-topic/\n\n\n-----\n\n[3] [https://www.pcrisk.com/removal guides/10732 sage ransomware](https://www.pcrisk.com/removal-guides/10732-sage-ransomware)\n\n[4] https://www.bleepingcomputer.com/news/security/the-crylocker-ransomwarecommunicates-using-udp-and-stores-data-on-imgur-com/\n\n[Thread locked Subscribe](https://isc.sans.edu/forums/diary/subscribe/21959/) Jan 21st\n2017\n\n5 years ago\n\n\nThanks for sharing this, all the analysis is really good.\n\nRegards\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38775) Jan 23rd\n2017\n\n5 years ago\n\n\nHi, I am now investigating on this kind of Ransomware and it would be great if you\ncould answer the following question:\n\nHow are you able to differentiate the malspam campaigns and how are you able to\nsay that this campaign normally distributes Cerber ransomware?\n\nThe thing in this case is indeed an infection with Cerber at the first day, but\nexecuting it now, the payload for Sage 2.0 is downloaded and executed.\n\nThe confusion in this thing is perfect because two different variants of Ransomware\nare distributed the same way ...\n\nCheers\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38777) Jan 23rd\n2017\n\n5 years ago\n\nBrad\n\nMalspam campaigns are based on the characteristics of the traffic, URLs, emails,\nattachments, etc. I've been looking into this particular campaign since the beginning\nof the year.\n\n\n[malware-traffic-analysis.net/2017/01/04/…](http://malware-traffic-analysis.net/2017/01/04/index2.html)\n\n[malware-traffic-analysis.net/2017/01/05/…](http://malware-traffic-analysis.net/2017/01/05/index2.html)\n\n[malware-traffic-analysis.net/2017/01/09/…](http://malware-traffic-analysis.net/2017/01/09/index2.html)\n\n[malware-traffic-analysis.net/2017/01/13/…](http://malware-traffic-analysis.net/2017/01/13/index4.html)\n\n[malware-traffic-analysis.net/2017/01/17/…](http://malware-traffic-analysis.net/2017/01/17/index.html)\n\n[malware-traffic-analysis.net/2017/01/18/…](http://malware-traffic-analysis.net/2017/01/18/index.html)\n\n[malware-traffic-analysis.net/2017/01/18/…](http://malware-traffic-analysis.net/2017/01/18/index2.html)\n\nUltimately, ransomware is just another form of malware, and it can be distributed the\nsame way any other malware is. This particular malspam campaign has a history of\noccasionally changing the ransomware sent from the URLs generated by those\nWord documents or JS file.\n\n\n433 Posts\n\nISC\nHandler\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38779) Jan 23rd\n2017\n\n5 years ago\n\n\n-----\n\nThank you for your reply. It is rather interesting in this case, because I recognized\nthat the victim received on 29. November 2016, 18. January 2017 and 19. January\n2017 eMails from the same sender containing the Downloader for Cerber. The first\ntwo times there was a Javascript file in it and the last time, when the victim actually\nopened the file (and got infected) it was a Word document. The problem is that we\ndon't have any data to compare these campaigns. It is just possible investigating of\nthe reports we have. Is there any open database or other resource we could\ncompare and find out if it is the same campaign?\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38781) Jan 23rd\n2017\n\n5 years ago\n\nBrad\n\nUnfortunately, no I don't know of any databases. For what it's worth, if someone's\nemail is publicly known (posted anywhere on the web), it'll get malspam from any\nnumber of campaigns.\n\n\nThis particular campaign that I'm tracking is not targeted, and it spreads a wide net.\nIt's a botnet-based campaign from what I can tell, and it continues to spew massive\namounts of malspam out on a daily basis. Once again, it's not targeting people. It's\nonly using publicly-known email addresses that somehow get circulated on\nspammers' lists.\n\nSorry I can't be of more help.\n\n\n433 Posts\n\nISC\nHandler\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38783) Jan 23rd\n2017\n\n5 years ago\n\n\nThank you, this is helping me to understand the structure a bit better (I am rather\nnew to this topic). It is hard to learn about it if you just have a few reports and don't\nlook behind the whole thing ;) That is the great thing about such blogs like this one\nor yours - getting a better overview!\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38785) Jan 24th\n2017\n\n5 years ago\n\n\nI am currently under attack by this ransomware! So am I understanding that as of\ntoday the only option is, to pay the ransom so I can get my files back? I am not a\ncomputer specialist but have 5 that are computer specialists (all in different fields).\nThey all seem to have different answers. How do I know who to go with, especially\nsince my computer is on a time limit? $2,000 may not be a lot to some but it is to\nme, especially if I pay and it still doesn't work after. Anyone have any advice?\n\nThanks!\n\nCmlbalhll\n\n\nAnonymous\n\n\n-----\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38837) Feb 3rd\n2017\n\n5 years ago\n\n\nHi, I understand you completely. Try to use the following methods described here.\nhttp://www.besttechtips.org/remove-sage-2-0-ransomware-and-decrypt-sage-files/\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/38907) Feb 13th\n2017\n\n5 years ago\n\n\nWe got hit by Sage but managed to contain it. Out of three machines that were hit,\nonly one was damaged, as the other two were running anti-ransomware technology\nwith data protection & recovery (temasoft ranstop). Fortunately, the damaged\nmachine shared important folders as mapped drives and those files were also\nprotected by the anti-ransomware technology on the other two machines (actually I\nhad two copies in the backup. But we lost the files on that machine that were not\nshared.\n\n\nAnonymous\n\n\n[Quote](https://isc.sans.edu/forums/diary/quote/39432) May 2nd\n2017\n\n5 years ago\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-21 - Sage 2.0 Ransomware.pdf"
    ],
    "report_names": [
        "2017-01-21 - Sage 2.0 Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536236,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653694092,
    "ts_modification_date": 1653694092,
    "files": {
        "pdf": "https://archive.orkl.eu/35ff5951d533b51dab07f93fb72d8c9e7927fb66.pdf",
        "text": "https://archive.orkl.eu/35ff5951d533b51dab07f93fb72d8c9e7927fb66.txt",
        "img": "https://archive.orkl.eu/35ff5951d533b51dab07f93fb72d8c9e7927fb66.jpg"
    }
}