{
    "id": "b963db52-7f02-426b-80e5-ec90edf357ac",
    "created_at": "2023-01-12T15:01:41.397946Z",
    "updated_at": "2025-03-27T02:09:29.66312Z",
    "deleted_at": null,
    "sha1_hash": "1cdc020f6834303cc5bf0d2be9229328b8c28acd",
    "title": "2018-03-13 - New Variant of BankBot Banking Trojan Ups Ante, Cashes Out on Android Users",
    "authors": "",
    "file_creation_date": "2022-05-28T19:30:18Z",
    "file_modification_date": "2022-05-28T19:30:18Z",
    "file_size": 749193,
    "plain_text": "# Related Insights\n\n**[info.phishlabs.com/blog/new-variant-bankbot-banking-trojan-aubis](https://info.phishlabs.com/blog/new-variant-bankbot-banking-trojan-aubis)**\n\n## By The PhishLabs Team | March 13, 2018\n\n\nMarch 13, 2018\n\n\nA newly observed variant of BankBot has been discovered masquerading as Adobe Flash\nPlayer, Avito, and an HD Video Player. This variant, now detected by PhishLabs as BankBot\nAnubis, was first identified on March 5, 2018.\n\nBankBot Anubis takes mobile threats to the next level incorporating ransomware, keylogger\nabilities, remote access trojan functions, SMS interception, call forwarding, and lock screen\nfunctionality.\n\nAndroid Banking Trojans are sinister enough on their own; however, there is now a growing\ntrend of integrating the functionality of other malware genres alongside Banker’s typical\nphishing overlay and SMS-stealing capabilities. According to our research, Lokibot was the\nfirst Android banking trojan to integrate ransomware functionality. Now, one BankBot actor is\nfurther upping the ante with code aimed at delivering functionality that ranges from\nransomware to remote access.\n\nWhen the BankBot source code was first publicly leaked, many researchers forecasted an\nincrease in the number of threat actors using the malware and a spike in the development of\nnew variants with unique features. This forecast has now come to fruition, and multiple\nvariants are currently active.\n\nWhen reviewing recent detections we noticed that some new network endpoints had been\nintroduced to the command and control (C2) server infrastructure of one of the variants\nPhishLabs tracks. These new endpoints clued us into the new functionality and feature juicy\nnames like locker, keylogger, and ratgate.\n\nFigure 1 illustrates the typical set of PHP files referenced in earlier samples (left) alongside\nthe PHP files referenced in recent samples.\n\n\n-----\n\n_Figure 1. C2 Network Endpoints_\n\nThe BankBot malware’s configuration is stored in a file named ‘set.xml’ in the application’s\n‘shared prefs’ directory. This file is updated following installation, giving additional clues\nregarding the new functionality.\n\nFigure 2 shows an example of the static configuration and Figure 3 shows an updated\nversion. The updated version, which stores a base64-encoded image as part of an HTML\nfile, has been truncated for readability.\n\n\n-----\n\n_Figure 2._\n\n\n_Static Configuration_\n\n\n-----\n\n_Figure 3. Updated Configuration_\n\n## Locker – AnubisCrypt\n\nAs seen in the configuration, there are several entries related to the new ransomware\nfunctionality. These include ‘htmllocker’, which is updated after installation to contain the\nHTML code for a lock screen. This lock screen, shown in Figure 4, contains a poorly-worded\n\n\n-----\n\nmessage about illicit activity being detected on the victim s phone.\n\n_Figure 4. Lock screen_\n\nWhile the lock screen is reminiscent of other locking ransomware that simply disables access\nto the user interface, this implementation is indeed crypto ransomware. Some of the code\nresponsible for the ransomware functionality is shown in Figure 5. The encrypted files are\nrenamed with the extension ‘.AnubisCrypt’ and files are encrypted using a 256-bit symmetric\nkey.\n\n\n-----\n\n_Figure 5. Ransomeware encryption/decryption code_\n\nAdditional configuration fields related to the ransomware functionality include lock_btc,\nlock_amount, and key. These fields are updated via communication with the C2 server and\nwere never updated during execution of the samples analyzed for this article. Figure 6 shows\nthe code for populating these configuration entries. It appears that files encrypted with\nAnubisCrypt will be recoverable, based upon the symmetric key being stored in the\nconfiguration.\n\n_Figure 6. Ransomware configuration data population code_\n\n\n-----\n\n## Remote Access Trojan\n\nIn addition to the ransomware functionality detailed above, this version of BankBot now\ncontains remote access trojan (RAT) functionality. Commands available via the RAT service\ninclude Open Directory, Download File, Delete File/Folder, Start & Stop VNC, and Stop &\nStart Sound Recording. This functionality allows the attacker to directly manipulate the file\nsystem and monitor the victim’s activity. Figure 7 displays code for some of the\naforementioned RAT functions.\n\n_Figure 7. RAT command examples_\n\nThe malicious actor behind this update has also implemented keylogger functionality. The\nability to record sound and log keystrokes makes this malware both potent and remarkably\ninvasive. Figure 8 shows the implementation of the keylogger functionality, including the\nname of the log file.\n\n_Figure 8. Code to exfiltrate logged keystrokes_\n\n## Banking Trojan & Additional Functionality\n\nEven with all the new functionality, BankBot is still a banking trojan at heart. Like most\nAndroid bankers, BankBot monitors for a targeted application to be launched, and then\noverlays the legitimate app with a phishing screen to steal the victim’s credentials. It then\nuses its SMS theft capabilities to intercept any subsequent security codes sent from the\nbank.\n\nAdditional functionality found in BankBot Anubis includes:\n\n\n-----\n\nMonitor for attempts to remove the malware or reset the system\nAbuse accessibility features to authorize actions on behalf of the user\nSend, receive, and intercept SMS\nLock the screen with an overlay\nDisplay fake notifications and alerts\nCollect system information such as installed applications, IP address, and GPS location\nRequest additional permissions\nSend USSD requests\nForward calls to a specified number\nLaunch applications & open URLs\nUpdate command and control servers\nClear configuration data to kill the bot\n\n## Campaign Details\n\nThe samples analyzed for this article targeted a total of 275 unique applications from\norganizations across the globe. Recent additions to this list of targets include 29\ncryptocurrency applications. The domains utilized for command and control in these samples\nwere registered from a variety of geolocations, including Japan, Moldova, and France. The\ninfrastructure was hosted on servers in Ukraine, Germany, and the Netherlands.\n\nNearly all of the relevant strings in the sample are in English although there are some\ngrammatical and spelling errors. The malware configuration contains one string in Bulgarian\n(perehvat_sws → intercept SMS), however, the fact that this variant is based on leaked\nsource code renders this less meaningful. This updated variant has been observed\nmasquerading as Adobe Flash Player, Avito, and an HD Video Player.\n\n_Figure 9. Recent BankBot Anubis_\n\n_APK icons_\n\n## Analyzed Samples\n\n48b93f6e4c6717bb87eb60129cc5ef07733f63e94f19cd2fa8214e89f6a61fdc\n(com.gsiuwvq.tixidk)\n\n4b410fc2a49c822b0d4df3419087d9eb6fea6df7e1b5d21ca575c7b83f1a490f\n(com.zwezxdhsyawt.bsagweg)\n\n9bb207a05703406f05f5749299b4c68f0de159be06550588ef1415c181401241\n(com.griakeyicm.uvzbexhvdqt)\n\n\n-----\n\n5555a4226d3db9549a6d2b73a988f1ec0e399d766c2cae0727670b4fb0bd6de3\n(com.bgmnyn.shqwru)\n\nb3a4df38699300c2acb3efb3a29d5eb152e35ed1eb293fedb6d262441463421b\n(com.sqntwtqphxt.yipzsbjze)\n\n381b86843f3ebd8d4e4cf7aaa9b4b23dc64507d853745d54a65061250ea88b35\n(com.inmwyjdtrlhz.unjdjkgimvq)\n\n## C2s Observed\n\n91.243.80.118\n\nussensivitius.gq (88.99.180.21)\n\nwebcam4bdsm.tk (92.63.197.27)\n\ndomainprobr.tk\n\neltinjapp.cf (92.63.197.27)\n\n5.8.88.163\n\nWe published this in an earlier blog post (The Evolution of Mobile Banking Trojans… and\nWhat To Do About Them (Part II) but it’s worth mentioning again to help safeguard against\nmobile threats.\n\n## Staying Safe\n\nAs an individual, there are plenty of things you can do to minimize the chances of your\ndevices being infected by mobile banking trojans. Among other things, you can:\n\nWatch out for suspicious activity on your device and associated accounts, e.g., New\nand unknown device admin users being added, apps requesting extensive\npermissions, and strange activity on accounts accessed via mobile.\nUse antivirus software. This will help you to detect indicators that can’t be identified\nmanually.\nDon’t root your devices, and don’t change your settings to allow apps from unknown\nsources. Seriously, just don’t do it.\nDon’t install apps distributed by SMS, email, or ads, and don’t visit unofficial app stores.\nExercise caution even when installing from official stores. Only follow links to\napplications from trusted sites, and if you’re in any doubt, don’t install.\nKeep software and operating systems up to date, as many malware variants prey on\nolder, insecure versions.\nEnable account notifications from your bank. Most banks offer these for when certain\ntypes of activity are detected.\n\n\n-----\n\nBut of course, mobile banking trojans aren t just an issue for individuals. If you re concerned\nyour organization or customers could be harmed by mobile banking trojans, there are are\nseveral steps you can take:\n\nAttacks will happen. Educate your customers, particularly if your organization offers\none or more legitimate apps through official app stores, and provide users with best\npractice information.\nAllow users to report attacks or suspicious applications, and make sure you look into\neach reported incident.\nMake use of alternative two-factor authentication techniques (i.e., not SMS) – Physical\ntokens, biometrics, and one-time password applications are all good options.\nMonitor transactions and IP geolocation information to identify suspicious activity. On\nthe same note, provide your users with an easy way of informing you about upcoming\ntravel or significant activity in order to avoid unnecessary lockouts.\nOffer account notifications to inform your users of suspicious activity.\n\n{{cta(‘f8eb51c1-9d02-44f3-9779-6d6b6fb519cf’)}}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-13 - New Variant of BankBot Banking Trojan Ups Ante, Cashes Out on Android Users.pdf"
    ],
    "report_names": [
        "2018-03-13 - New Variant of BankBot Banking Trojan Ups Ante, Cashes Out on Android Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535701,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653766218,
    "ts_modification_date": 1653766218,
    "files": {
        "pdf": "https://archive.orkl.eu/1cdc020f6834303cc5bf0d2be9229328b8c28acd.pdf",
        "text": "https://archive.orkl.eu/1cdc020f6834303cc5bf0d2be9229328b8c28acd.txt",
        "img": "https://archive.orkl.eu/1cdc020f6834303cc5bf0d2be9229328b8c28acd.jpg"
    }
}