{
    "id": "b9826f43-655c-4a6d-8404-c8bd633d0da6",
    "created_at": "2023-01-12T15:06:28.326124Z",
    "updated_at": "2025-03-27T02:05:19.855149Z",
    "deleted_at": null,
    "sha1_hash": "b261f577731c09f781bb750f4b973db700387fac",
    "title": "2010-04-01 - SpyEye vs. ZeuS Rivalry",
    "authors": "",
    "file_creation_date": "2022-05-28T04:08:50Z",
    "file_modification_date": "2022-05-28T04:08:50Z",
    "file_size": 73981,
    "plain_text": "# SpyEye vs. ZeuS Rivalry\n\n**krebsonsecurity.com/2010/04/spyeye-vs-zeus-rivalry/**\n\nIt’s common for malware writers to taunt one another with petty insults nested within their\nrespective creations. Competing crime groups also often seek to wrest infected machines\nfrom one another. A very public turf war between those responsible for maintaining the\n[Netsky and](http://en.wikipedia.org/wiki/Netsky_%28computer_worm%29) [Bagle worms back in 2005, for example, caused a substantial increase in the](http://en.wikipedia.org/wiki/Bagle_%28computer_worm%29)\nvolume of threats generated by both gangs.\n\n[The latest rivalry appears to be budding between the authors of the Zeus Trojan — a crime](http://www.krebsonsecurity.com/?s=zeus&x=0&y=0)\nkit used by a large number of cyber thieves — and “SpyEye,” a relatively new kit on the block\nthat is taking every opportunity to jeer at, undercut and otherwise siphon market share from\nthe mighty Zeus.\n\n**[Symantec alluded to this in a February blog post that highlighted a key selling point of the](http://www.symantec.com/connect/blogs/spyeye-bot-versus-zeus-bot)**\nSpyEye crimeware kit: If the malware created with SpyEye lands on a computer that is\nalready infected with Zeus, it will hijack and/or remove the Zeus infection.\n\nNow, just a few months later, the SpyEye author\nis releasing a new update (v. 1.1) that he claims\nincludes the ability to inject content into Firefox\nand Internet Explorer browsers, just as Zeus\ndoes (this screen shot shows the result of a\ndemo configuration file on the left, which\ninstructs the malware to inject SpyEye and\n“Zeuskiller” banner ads into a live Bank of\nAmerica Web site). It is precisely this injection\n[ability that allows thieves using Zeus to defeat the](http://www.krebsonsecurity.com/2010/03/crooks-crank-up-volume-of-e-banking-attacks/) [security tokens that many banks require](http://www.krebsonsecurity.com/2010/02/comerica-phish-foiled-2-factor-protection/)\ncommercial customers to use for online banking.\n\nThe new version comes as the Zeus author is pushing out his own updates (v. 1.4), along\nwith a hefty price tag hike. The old Zeus kit started at around $4,000, while the base price of\n[the newer version is double that. According to research from Atlanta-based security firm](http://www.secureworks.com/research/threats/zeus/)\n**SecureWorks, Zeus plug-ins that offer additional functionality raise the price even more. For**\nexample:\n\n-Windows7/Vista compatibility module – $2,000\n\n-Backconnect module (lets criminals connect back to victim and make bank transactions\nthrough that PC) – $1,500\n\n-Firefox form grabbing (copies out any data entered into a form field, such as a user name\nand password) – $2,000\n\n-Jabber notification (a form of instant message) – $500\n\n\n-----\n\n-FTP clients saved credentials grabbing module – $2,000\n-VNC module — $10,000 (like GoToMyPC for the bad guys, reportedly no longer being\nsold/supported)\n\nThe SpyEye author declined to be interviewed for this story. But it’s clear from his Flash\nbanner ads reproduced here that he plans to keep up the public relations campaign against\nZeus, with a focus on the relatively low price: SpyEye costs just $500 (although the new\nFirefox injection tool runs an extra $1,000).\n\nSecureWorks has noted that the latest versions of Zeus include anti-piracy technology that\nuses a hardware-based licensing system that can only be run on one computer. “Once you\nrun it, you get a code from the specific computer, and then the author gives you a key just for\nthat computer,” SecureWorks wrote. “This is the first time we have seen this level of control\nfor malware.”\n\nNot to be outdone, the SpyEye author now claims his malware builder also includes a\nhardware lock, using VMProtect, a Russian commercial software protection package.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-04-01 - SpyEye vs. ZeuS Rivalry.pdf"
    ],
    "report_names": [
        "2010-04-01 - SpyEye vs. ZeuS Rivalry.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535988,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653710930,
    "ts_modification_date": 1653710930,
    "files": {
        "pdf": "https://archive.orkl.eu/b261f577731c09f781bb750f4b973db700387fac.pdf",
        "text": "https://archive.orkl.eu/b261f577731c09f781bb750f4b973db700387fac.txt",
        "img": "https://archive.orkl.eu/b261f577731c09f781bb750f4b973db700387fac.jpg"
    }
}