{
    "id": "b9a1d3e7-a7c1-4865-b1c8-562e1c2e8f5c",
    "created_at": "2023-01-12T15:09:25.147571Z",
    "updated_at": "2025-03-27T02:06:14.964757Z",
    "deleted_at": null,
    "sha1_hash": "ead70e0fc522ef8517bff811decb472d54aab743",
    "title": "2021-03-04 - Deception Engineering- exploring the use of Windows Service Canaries against ransomware",
    "authors": "",
    "file_creation_date": "2022-05-29T01:28:59Z",
    "file_modification_date": "2022-05-29T01:28:59Z",
    "file_size": 116793,
    "plain_text": "# Deception Engineering: exploring the use of Windows Service Canaries against ransomware\n\n**research.nccgroup.com/2021/03/04/deception-engineering-exploring-the-use-of-windows-service-canaries-against-**\nransomware/\n\nMarch 4, 2021\n\n## tl;dr\n\n\n-----\n\nWe [prototyped a Windows Service Canary in order to target parts of the ransomware kill](https://github.com/nccgroup/KilledProcessCanary)\nchain to minimize impact and overall success of operations. Multiple instances are installed\nmasquerading as common Windows services that are targeted by threat actors prior to\nencryption. If multiple instances of these services are stopped then a Canary token is\ntriggered and the host hibernated. In doing so we are able to alert, minimize the impact and\ngive the best possible chance of recovery.\n\n## Background – Ryuk’s TTPs\n\nRyuk is a well known and active ransomware first discovered in 2018 and covered by\n[CrowdStrike (January 2019), Carbon Black Threat Analysis Unit (February 2020) and](https://www.crowdstrike.com/blog/big-game-hunting-with-ryuk-another-lucrative-targeted-ransomware/)\n[Abdallah Elshinbary (May 2020). These write-ups all detail certain trade-craft used in Ryuk](https://n1ght-w0lf.github.io/malware%20analysis/ryuk-ransomware/#killing-processes)\ndeployments around service and process termination prior to encryption beginning via\n_kill.bat._\n\nThe list of Windows services and processes killed via kill.bat is extensive with Abdallah\nElshinbary providing a comprehensive list of both.\n\n## Thesis\n\nGiven that a number of services are stopped prior to encryption there exists the opportunity\nnot only for detection but also impact minimization.\n\nThe thesis is we can deploy a number of Canary Windows Services which keep track of how\nmany are running. If these Windows services are stopped (via net stop, sc or similar) not\nduring a host shutdown we are then able to respond automatically. This automated response\ninvolves firstly triggering a canary token and then hibernating the host.\n\nBy doing so we:\n\nAlert the defensive function with a high-signal alert.\nMinimize the impact via likelihood of successful encryption.\nGive the best chance of recovery.\n\n## Prototype\n\nThe implementation follows what we describe. It is installed in place of commonly targeted\nservices and there is a shared counter for the number of running instances which gets\ndecremented when stopped via sc.exe or net.exe. When the total number of running\n[instances drops below two we then fire a DNS canary token and then hibernate the host.](https://canarytokens.org/)\n\n### Canary Token Use\n\n\n-----\n\n[We ve used an extensibility feature of](https://docs.canarytokens.org/guide/dns-token.html#creating-a-dns-token) [DNS canary tokens to encode arbitrary data effectively](https://canarytokens.org/)\nusing them as Alerting as a Service. Specifically the host name which is hibernating is\nencoded into the DNS canary token. This means we know not only did it fire but also which\nhost. This obviously becomes useful when running on a large number of hosts.\n\n## Real World Efficacy\n\nIn short it is today unknown, but we hope others will take the concept, experiment and share\nreal-world efficacy data back with the community. Some [initial response has been a](https://therecord.media/solutions-to-detect-ransomware-attacks-can-often-be-very-trivial/)\ncommoditized product which does this will likely not work for any significant period of time,\nwhich seems rational:\n\n_[in a conversation today with The Record, MalwareHunterTeam, a security researcher who](https://twitter.com/malwrhunterteam)_\n_has tracked and analyzed hundreds of ransomware strains across the years, said that_\n_ransomware gangs are also likely to deploy countermeasures for Killed Process Canary if_\n_the tool ever becomes a hindrance to their operations._\n\n\n-----\n\nHowever the real answer is we don t know how effective it will or won t be today. What is\nclear however is there is opportunity to make the operating environment for threat actors\nsignificantly more hostile than it is today.\n\n## The Code\n\n[https://github.com/nccgroup/KilledProcessCanary](https://github.com/nccgroup/KilledProcessCanary)\n\n## Thanks and Feedback etc.\n\nThanks to Harry for the discussions which led to the prototype.\n\nFeedback welcome via pull requests, e-mail (ollie dot whitehouse at nccgroup dot com) or\n@ollieatnccgroup on Twitter.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-04 - Deception Engineering- exploring the use of Windows Service Canaries against ransomware.pdf"
    ],
    "report_names": [
        "2021-03-04 - Deception Engineering- exploring the use of Windows Service Canaries against ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536165,
    "ts_updated_at": 1743041174,
    "ts_creation_date": 1653787739,
    "ts_modification_date": 1653787739,
    "files": {
        "pdf": "https://archive.orkl.eu/ead70e0fc522ef8517bff811decb472d54aab743.pdf",
        "text": "https://archive.orkl.eu/ead70e0fc522ef8517bff811decb472d54aab743.txt",
        "img": "https://archive.orkl.eu/ead70e0fc522ef8517bff811decb472d54aab743.jpg"
    }
}