{
    "id": "b9a3bf05-defa-4f93-967a-a6c261e8c8db",
    "created_at": "2023-01-12T15:00:31.807352Z",
    "updated_at": "2025-03-27T02:16:59.272158Z",
    "deleted_at": null,
    "sha1_hash": "9381c4b1ddbd7511f4d41a6bcc39da0fb8f60343",
    "title": "2022-08-17 - DarkTortilla Malware Analysis",
    "authors": "",
    "file_creation_date": "2022-09-01T10:12:23Z",
    "file_modification_date": "2022-09-01T10:12:23Z",
    "file_size": 1878231,
    "plain_text": "# DarkTortilla Malware Analysis\n\n**secureworks.com/research/darktortilla-malware-analysis**\n\nCounter Threat Unit Research Team\n\nWednesday, August 17, 2022\nBy: Counter Threat Unit Research Team\n\n## Summary\n\n\n-----\n\n[DarkTortilla is a complex and highly configurable .NET-based crypter that has](https://blog.malwarebytes.com/cybercrime/malware/2017/03/explained-packer-crypter-and-protector/) [possibly been](https://blog.malwarebytes.com/threat-analysis/2015/08/rainbows-steganography-and-malware-in-a-new-net-cryptor/)\nactive since at least August 2015. It typically delivers popular information stealers and\nremote access trojans (RATs) such as AgentTesla, AsyncRat, NanoCore, and RedLine.\nWhile it appears to primarily deliver commodity malware, Secureworks® Counter Threat\nUnit™ (CTU) researchers identified DarkTortilla samples delivering targeted payloads such\nas Cobalt Strike and Metasploit. It can also deliver \"addon packages\" such as additional\nmalicious payloads, benign decoy documents, and executables. It features robust antianalysis and anti-tamper controls that can make detection, analysis, and eradication\nchallenging.\n\nFrom January 2021 through May 2022, an average of 93 unique DarkTortilla samples per\nweek were uploaded to the VirusTotal analysis service. Code similarities suggest possible\n[links between DarkTortilla and other malware: a crypter operated by the](https://github.com/malwares/Crypter/tree/master/%5BC%23%5D%20The%20RATs%20Crew%20Crypter) [RATs Crew threat](https://wiki.hackforums.net/RATs_Crew)\n[group, which was active between 2008 and 2012, and the Gameloader malware that](https://www.gosecure.net/blog/2021/11/02/new-malware-gameloader-in-discord-malspam-campaign-identified-by-gosecure-titan-labs/)\nemerged in 2021.\n\n## Delivery\n\nCTU™ analysis of VirusTotal samples revealed numerous campaigns delivering DarkTortilla\nvia malicious spam (malspam). The emails typically use a logistics lure and include the\nmalicious payload in an archive attachment with file types such as .iso, .zip, .img, .dmg, and\n.tar. The language of the email message is customized to the victim, and CTU researchers\nobserved samples in English, German, Romanian, Spanish, Italian, and Bulgarian. Figure 1\n[shows a German-language malspam sample. The redacted filename of the attached ISO](https://www.virustotal.com/gui/file/981aa83b2d33cca994021197237ac5ee3ad3402f7d25f04f4e76985f4ec8744c)\nimage archive file (.iso) includes the name of the organization the email was sent from. It is\nunclear if that organization was compromised. The archive file contains a single executable\nwith the same filename but the .exe extension. This executable is a DarkTortilla initial loader\n[sample.](https://www.virustotal.com/gui/file/5e03556be992d23088a3c49d24c45b1c21cd275bffb4e536348e8128d50374b6)\n\n\n-----\n\n_Figure 1. DarkTortilla malspam containing malicious archive attachment. (The German text_\n_translates to \"Good morning, Please give us your best price offer for our attached order._\n_Awaiting your kind reply. Kind regards\"). (Source: Secureworks)_\n\nCTU researchers also identified malicious documents (maldocs) delivering DarkTortilla. Most\nof these maldocs embed the DarkTortilla initial loader executable as a Packager Shell\nObject. Figure 2 shows a [sample that prompts the victim to double-click the embedded](https://www.virustotal.com/gui/file/4f15b28c91fa0e8d0dd9e86481bad04fa34fcaf564d08de7c4c0c513fc6e122d)\nPackager Shell Object, which executes the payload. Inspection of the Packager Shell\n[Objects properties revealed that it is an executable named RFQ-010129H.exe, which is a](https://www.virustotal.com/gui/file/55d7d9bd9d4a511417033b6c14ce93f962d6a6e6c6414f0cb7e455baee1d3ab7)\nDarkTortilla initial loader sample. Other analyzed maldocs use different approaches, such as\nleveraging embedded macros to automatically execute the Packager Shell Object when a\nvictim opens the document and enables macros.\n\n\n-----\n\n_Figure 2. Maldoc sample delivering DarkTortilla. (Source: Secureworks)_\n\n## High-level execution flow\n\nDarkTortilla consists of two components that rely on each other to successfully detonate\npayloads: a .NET-based executable (initial loader) and a .NET-based DLL (core processor).\nThe typical high-level execution flow for a DarkTortilla payload starts with execution of the\ninitial loader. The initial loader then retrieves its encoded core processor. While the encoded\ncore processor is typically embedded within the .NET resources of the initial loader, CTU\n[researchers identified initial loaders that retrieved their core processor from public paste sites](https://cyberhoot.com/cybrary/paste/)\nsuch as pastebin . pl, textbin . net, and paste . ee.\n\nThe initial loader decodes, loads, and executes the core processor. When executed, the core\nprocessor extracts, decrypts, and parses its configuration. The encrypted configuration is\nstored within the .NET resources of the initial loader as bitmap images. Depending on\nDarkTortilla's configuration, the core processor performs the following actions:\n\nDisplays a fake message box\n\n\n-----\n\nPerforms anti-virtual machine checks\nPerforms anti-sandbox checks\nImplements persistence\nMigrates execution to the Windows %TEMP% directory by using the \"Melt\"\nconfiguration element\nProcesses addon packages\nMigrates execution to its install directory\n\nThe core processor then injects and executes its configured main payload within the context\nof the configured subprocess. Finally, if configured, the core processor implements antitamper controls to prevent interference with execution of the initial loader, core processor,\ninjected subprocess, and WatchDog executable.\n\nFigure 3 illustrates this high-level DarkTortilla execution flow.\n\n\n-----\n\n_Figure 3. High-level execution flow for DarkTortilla infection. (Source: Secureworks)_\n\n## Initial loader\n\nInitial loader samples analyzed by CTU researchers were obfuscated using the DeepSea\n.NET code obfuscator. As a result, many aspects of the original code have been altered to\nthwart analysis. For example, namespace, class, function, and property names were\n\n\n-----\n\nrenamed from their original descriptive values to random characters. Figure 4 shows an\n[example of these obfuscated values within the code decompiled by the dnSpy .NET analysis](https://github.com/dnSpyEx/dnSpy)\ntool.\n\n_Figure 4. Obfuscated DarkTortilla initial loader sample. (Source: Secureworks)_\n\n[In addition to name obfuscation, DeepSea applies switch dispatch control flow obfuscation to](http://tigress.cs.arizona.edu/transformPage/docs/flatten/index.html)\nDarkTortilla's initial loader. This technique restructures the original linear code into switch\nstatements that transfer execution in a seemingly unpredictable pattern, making analysis\ndifficult. Figure 5 shows a switch statement at the entry point of a DarkTortilla [sample. In this](https://www.virustotal.com/gui/file/a0b96236bfd79d2ebeadb8e3deb9448af3ec8edd1ea9672b7ad4793934bb4c47)\nexample, the value stored in the \"num\" variable controls which code gets executed next. This\nvalue is obfuscated and is often the result of a conditional or mathematical expression\n[calculated at runtime, such as \"((!flag) ? 15 : 9)\" or \"Math.Abs(num2 * 25 * 25)\".](https://en.wikipedia.org/wiki/%3F:)\n\n\n-----\n\n_Figure 5. Switch dispatch control flow obfuscation applied to DarkTortilla initial loader._\n_(Source: Secureworks)_\n\nThe initial loader stores DarkTortilla's encrypted configuration as bitmap images. Figure 6\n[lists the partial resource section of one sample consisting of over 700 of these images.](https://www.virustotal.com/gui/file/b3754c6ecc445e9a3b37c5ebe68adb9630ca4aa89a8e8515468f39ae8131f141)\n\n\n-----\n\n_Figure 6. Encrypted configuration stored as bitmap images within the .NET resources of_\n_DarkTortilla initial loader. (Source: Secureworks)_\n\nThe initial loader's execution flow typically starts by checking for internet connectivity by\nissuing HTTP GET requests. In samples that implement this check, the initial loader attempts\n[to retrieve content from google . com, bing . com, or both. Some samples store the URLs in](https://www.virustotal.com/gui/file/45ef054bca2ae4d67e6623bf28ff75e5d178924602674c654e1b569aa74601cd)\nthe executable as plain text (see Figure 7), but most samples encode them. If the check fails,\nthe initial loader retries the request(s) until all are successful.\n\n\n-----\n\n_Figure 7. Internet connectivity check in DarkTortilla initial loader. (Source: Secureworks)_\n\nThe initial loader generates a 16-byte key to decode the core processor. This key is based\non an initial hard-coded value multiplied by the index value of its location in the destination\narray. Because the values are stored as single bytes, the maximum value for an element in\nthe array is 0xFF (255 decimal). For example, the decode key array for an initial hard-coded\nvalue of 0x6E (110 decimal) is\n\n[0x00,0x6E,0xDC,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF].\n\nThe initial loader then retrieves the encoded core processor data. This data commonly\nresides within the .NET resources of the initial loader binary. Figure 8 shows encoded core\nprocessor data residing within the \"pnj\" .NET resource of a DarkTortilla [sample.](https://www.virustotal.com/gui/file/45ef054bca2ae4d67e6623bf28ff75e5d178924602674c654e1b569aa74601cd)\n\n\n-----\n\n_Figure 8. Encoded core processor data stored within the .NET resources of DarkTortilla initial_\n_loader. (Source: Secureworks)_\n\nThe initial loader decodes the core processor data by applying the following algorithm to\neach byte:\n```\n     enc_byte ^ (dec_key_arr[idx % len(dec_key_arr)] ^ (idx + (seed_byte %\n\n     len(dec_key_arr)) & seed_byte)\n\n\n```\nenc_byte: The core processor byte array value being decoded\nidx: The encoded byte index in the core processor byte array\ndec_key_arr: The generated 16-byte decode key byte array\nseed_byte: The fourth byte of the 16-byte decode key byte array\n\nThe initial loader loads the decoded core processor assembly code and executes its predetermined entry point function.\n\n### Initial loader variant with externally hosted core processor\n\n\n-----\n\nInitial loader variants that retrieve the encoded core processor from public paste sites first\ndecode the URL where the core processor is hosted. The encoding logic applied to the URL\nvaries across analyzed DarkTortilla samples, making analysis and detection difficult. Figure 9\nshows a DarkTortilla [sample that encodes the URL (https: //pastebin . pl/view/raw/60b6b03b)](https://www.virustotal.com/gui/file/0a5dc3b6669cf31e8536c59fe1315918eb4ecfd87998445e2eeb8fed64bd2f2c)\nby prepending and appending random text.\n\n_Figure 9. DarkTortilla initial loader variant that retrieves encoded core processor data from_\n_public paste site. (Source: Secureworks)_\n\nThe initial loader retrieves an encoded string hosted at the decoded URL. This string\nrepresents the encoded core processor data. The string consists of fake XML tags, integer\n[values encoded with a shift cipher, and delimiters comprised of random letters (see Figure](https://en.wikipedia.org/wiki/Caesar_cipher)\n10). The downloaded data is stored in memory and is never saved to the filesystem.\n\n\n-----\n\n_Figure 10. Encoded DarkTortilla core processor data hosted on public paste site. (Source:_\n_Secureworks)_\n\nThe initial loader decodes the string by first removing the fake XML tags. The string is\nconverted into an array of integers by replacing the random letter character delimiters with a\nconsistent letter and then using that letter to split the string into integers. The last step is to\niterate through the integer array and subtract a pre-defined value. This value changes across\nsamples.\n\nIn the Figure 10 example (<xml>1002k1015U1069k925E928s925U925E925g929E925…\n</xml>), the consistent letter delimiter is \"k\" and the pre-defined subtracted value is 925:\n\n1. Remove XML tags: 1002k1015U1069k925E928s925U925E925g929E925…\n2. Replace random letters with consistent character:\n\n1002k1015k1069k925k928k925k925k925k929k925…\n3. Split into integer array: [1002, 1015, 1069, 925, 928, 925, 925, 925, 929, 925, …]\n4. Subtract pre-defined value from each integer: [77, 90, 144, 0, 3, 0, 0, 0, 4, 0, …]\n\nThe hex representation of the final integer array for this example is [4D, 5A, 90, 00, 03, 00,\n00, 00, 04, 00, …]. This decoded data is the core processor DLL (see Figure 11).\n\n\n-----\n\n_Figure 11. Decoded DarkTortilla core processor DLL. (Source: Secureworks)_\n\n## Core processor\n\nThe core processor contains DarkTortilla's primary functionality. From at least June 2020 to\nMarch 2022, the malware author transitioned through a limited number of filenames for this\nDLL that appeared to relate to a function or purpose (Deserialize.dll, SHCore1.dll,\n[PVCore1.dll, and SHCore2.dll). In March 2022, the names began to change more frequently](https://www.virustotal.com/gui/file/93dd1202697dbaed9ef4f4707f2628212bf13aad096de29c14924b1dae1d6d5b)\nto seemingly random names (e.g., BRIN.dll, UKRUSAIN.dll, KNIFALL.dll, NullSBAS.dll).\n\n### Configuration processing\n\nThe core processor identifies the following resources in the initial loader that are associated\nwith the encrypted configuration:\n\nThe bitmap image resource(s) containing the encrypted configuration data\nThe binary resource specifying the total number of images to process\nThe resource folder containing these images and binary resources\n\nThe names of these resources are calculated using the compile timestamp listed in the initial\nloader (which is not the file's actual compile timestamp) and two hard-coded values that\nrepresent an initialization value and the length of the resource name. The hard-coded\ninitialization and name length values were consistent across all DarkTortilla samples\nanalyzed by CTU researchers (see Table 1).\n\n**Initial loader resource** **Initialization value** **Resource name length value**\n\nResource folder 5 12\n\nImage count file 80 8\n\nImage file 20 8\n\n_Table 1. Values used to derive initial loader resource names._\n\n\n-----\n\nThese names are calculated via the following process:\n\n1. Divide the compile timestamp by <initialization value>.\n[2. Round the result using the Math.Round() function.](https://docs.microsoft.com/en-us/dotnet/api/system.math.round?view=net-6.0#system-math-round(system-decimal))\n3. Pass the result to the [Random.Random() function as a seed value. By using a](https://docs.microsoft.com/en-us/dotnet/api/system.random)\n\nprecalculated seed value, the malware author can generate a predictable 16-byte\nvalue.\n[4. Convert the 16-byte value to a GUID using the Guid.Guid() function, which transposes](https://docs.microsoft.com/en-us/dotnet/api/system.guid)\n\nthe byte order.\n5. Remove dash characters (‘-') added during the GUID conversion.\n6. Truncate the value to <resource name length> characters.\n\n[For example, the following calculation generates the resource folder name of a sample with a](https://www.virustotal.com/gui/file/b3754c6ecc445e9a3b37c5ebe68adb9630ca4aa89a8e8515468f39ae8131f141)\ncompile timestamp of \"Sun May 26 23:57:08 1985\" (integer: 486014228):\n\n1. 486014228 / 5 = 97202845.6\n2. Math.Round(97202845.6) = 97202846\n3. Random.Random(97202846) = d00bee25fa9dc9024fdf632727286708\n4. Guid.Guid(d00bee25fa9dc9024fdf632727286708) = 25ee0bd0-9dfa-02c9-4fdf\n632727286708\n5. Remove dashes = 25ee0bd09dfa02c94fdf632727286708\n6. Truncate to 12 characters = 25ee0bd09dfa\n\nApplying the same calculation to the other components reveals that the image count\nresource name for this sample is \"cd6935eb\" and the image base name is \"d390ea32\". The\nbitmap-formatted image names follow the pattern <image_base_name><image_index>,\nwhere the <image_index> value ranges from 0 to the value specified in the image count\nresource. In this sample, the image count resource value is 0x2D4 (integer: 724), which\nmeans DarkTortilla attempts to process 725 bitmap-formatted images with the names\nd390ea320, d390ea321, d390ea322, …, d390ea32723, d390ea32724.\n\nTo extract the encrypted configuration, the core processor iterates through each of the image\nresources in order, extracts the pixel data, and concatenates the pixel data into a byte array\n(see Figure 12).\n\n\n-----\n\n_Figure 12. Logic for extracting encrypted configuration from bitmap images. (Source:_\n_Secureworks)_\n\n[The resulting byte array is decrypted using the Rijndael cipher (also known as the Advanced](https://en.wikipedia.org/wiki/Advanced_Encryption_Standard)\nEncryption Standard (AES)) with Electronic Code Book (ECB) block cipher mode and\n[ISO10126 padding configured. The ISO10126 standard was withdrawn in 2007, so the use](https://en.wikipedia.org/wiki/Padding_(cryptography)#ISO_10126)\nof this padding could indicate that DarkTortilla's origins date back to 2007 or earlier. The key\nused to decrypt this data is stored as the hard-coded integer array [81, 42, 59, 7, 27, 70, 83,\n13, 71, 75, 17, 9, 39, 64, 3, 2] (see Figure 13).\n\n_Figure 13. Hard-coded key to decrypt DarkTortilla configuration. (Source: Secureworks)_\n\n\n-----\n\nDarkTortilla parses the decrypted configuration data into a structure so that its elements can\nbe easily referenced. Table 2 lists the potential configuration elements contained within\nDarkTortilla's decrypted configuration. Entries in bold indicate configuration elements that\nwere consistently present in all samples analyzed by CTU researchers.\n\n**Key** **Type** **Description**\n\n**%Installation%** **bool** **Install DarkTortilla and implement persistence**\n\n%InstallationReg% string Registry key used for persistence\n\n%InstallationKey% string Registry value used for persistence\n\n%InstallationDirectory% int Root install directory\n\n%InstallationFolder% string Subfolder name within the root install directory\n\n%InstallationFileName% string Filename for the initial loader executable within the root\nsubfolder\n\n%StartupFolder% bool Enable Startup folder persistence\n\n%Hidden% bool Enable \"Hidden\" registry persistence\n\n%HiddenReg% string \"Hidden\" registry key used for persistence\n\n%HiddenKey% string \"Hidden\" registry value used for persistence\n\n**%Message%** **bool** **Display fake message box**\n\n%MessageIcon% int Fake message box icon ID\n\n%MessageButton% int Fake message box button ID\n\n%MessageTitle% string Fake message box title\n\n%MessageBody% string Fake message box message\n\n%MessageRepetition% bool Display fake message box even if installed\n\n**%VM%** **bool** **Perform anti-virtual machine checks**\n\n**%SB%** **bool** **Perform anti-sandbox checks**\n\n**%InjectionPersist%** **bool** **Enable anti-tamper control for running processes**\n\n**%StartupPersist%** **bool** **Enable anti-tamper control for startup persistence**\n\n**%Melt%** **bool** **Migrate initial loader execution to the Windows**\n**%TEMP% directory**\n\n\n-----\n\n**Key** **Type** **Description**\n\n%MeltName% string Filename for the initial loader executable within the\nWindows %TEMP% directory\n\n%WatchDogName% string Filename for the anti-tamper WatchDog executable\n\n%WatchDogBytes% byte[] WatchDog byte array\n\n**%Compress%** **bool** **Indicates if payloads are zlib-compressed**\n\n**%Delay%** **int** **Number of seconds to delay execution within the**\n**core processor**\n\n**%HostIndex%** **int** **ID of the target subprocess name to use for**\n**main/addon payload injection**\n\n**%MainFile%** **byte[]** **Main payload byte array**\n\n**%FilesNum%** **int** **Number of addon packages to process**\n\nF.{0}.D byte[] Addon package (data): Payload byte array\n\nF.{0}.N string Addon package (name): Filename\n\nF.{0}.P int Addon package (path): Target install folder (special\nfolder ID)\n\nF.{0}.F string Addon package (folder): Target install subfolder\n\nF.{0}.O int Addon package (operation): Execution type (disk,\nmemory, none)\n\nF.{0}.T int Addon package (time): Execution delay (seconds)\n\nF.{0}.R int Addon package (run): Payload execution criterion\n\n_Table 2. DarkTortilla configuration elements. Bold text indicates elements that appear in all_\n_analyzed samples._\n\n### Fake message display\n\nDarkTortilla can be configured to display a message box when executed. The threat actor\ncan customize message box characteristics such as the display message, message box title,\n[and the icon and button configuration. Threat actors use fake message boxes to make](https://docs.microsoft.com/en-us/office/vba/language/reference/user-interface-help/msgbox-constants)\nvictims think that execution failed or that a legitimate application is loading and installing.\nTable 3 lists the configuration elements and values in one DarkTortilla [sample.](https://www.virustotal.com/gui/file/083acce46cb8cf35e37c778d1f4aee6814bca72d2874b793a47f9823f51df0fe/)\n\n\n-----\n\n**ConfigurationConfiguration**\n**elementelement** **Assigned value as it appears in the configurationAssigned value as it appears in the configuration**\n\n%Message% True\n\n%MessageIcon% 16\n\n%MessageButton% 0\n\n%MessageTitle% .Net Framework Initialization Error\n\n%MessageBody% To run this application, you first must install one of the following\nversion of the .Net Framework:\\r\\n.Net Framework, Version =\n4.8.0\n\n%MessageRepetition% True\n\n_Table 3. Fake message box-related configuration elements._\n\nFigure 14 shows the message box for the DarkTortilla sample configured with the values in\nTable 3. The %MessageRepetition% configuration element controls whether the message\nbox will continue to be displayed upon execution after DarkTortilla is installed and persistent\non the compromised system.\n\n_Figure 14. Fake message box. (Source: Secureworks)_\n\n### \"Melt\" execution migration\n\nIf the %Melt% configuration element is set to true, the core processor moves the initial loader\nexecutable to the Window's %TEMP% directory. It uses the %MeltName% configuration\nelement value as the executable filename (e.g., java.exe, PDF.exe, cookies.exe). The core\nprocessor runs the new executable and then terminates the original initial loader executable.\nHowever, the %TEMP% directory may not be the final destination for the initial loader. The\nexecutable could migrate again if the %Installation% configuration element is set to true.\n\n### Installation\n\n\n-----\n\nThe %Installation% configuration element controls whether DarkTortilla installs itself on a\nsystem. If set to true, the core processor moves the current DarkTortilla executable into the\ndirectory specified by the configuration. Table 4 lists the values stored in one DarkTortilla\n[sample.](https://www.virustotal.com/gui/file/53b3b37b7d1e40c80fcda2c424cd837379ac2ce93023de6c22ba3e2d94679671)\n\n**Configuration element** **Value**\n\n%InstallationDirectory% 38\n\n%InstallationFolder% WindowsPowerShell\n\n%InstallationFileName% PowerShellInfo.exe\n\n_Table 4. Installation configuration elements with example values._\n\nThe integer value assigned to the %InstallationDirectory% configuration element represents\na [CSIDL value associated with a special folder on the system. In Table 4, the value 38](https://docs.microsoft.com/en-us/windows/win32/shell/csidl)\n[corresponds to the Windows Program Files directory. Based on this configuration, the full](https://www.magnumdb.com/search?q=CSIDL_PROGRAM_FILES)\ninstall path and filename for this DarkTortilla sample is \"C:\\Program\nFiles\\WindowsPowerShell\\PowerShellInfo.exe\".\n\nTo install, the core processor terminates the currently running DarkTortilla executable. It\ncopies the executable to the configured installation path and filename, and then executes the\n[installed executable via Process.Start().](https://docs.microsoft.com/en-us/dotnet/api/system.diagnostics.process.start?view=net-6.0)\n\n### Persistence\n\nPersistence is controlled by the %Installation% configuration element in combination with the\n%Hidden% and %StartupFolder% configuration elements. DarkTortilla uses the logic in Table\n5 to determine the persistence type.\n\n**%Hidden%** **%StartupFolder%** **Persistence type**\n\nFalse False Use registry HKCU Run key\n\nTrue True Windows startup folder\n\nFalse True Windows startup folder\n\nTrue False Use registry HKCU Winlogon key\n\n_Table 5. Configuration elements determining the persistence type._\n\nA bug in the code causes the %StartupFolder% logic to override the %Hidden% logic if both\nconfiguration elements are set to true. The malware author erroneously used an \"if\"\nstatement instead of \"else if\" in the logic setting the persistence type (see Figure 15).\n\n\n-----\n\n_Figure 15. Error in persistence code. (Source: Secureworks)_\n\n[For Windows startup folder persistence, the core processor uses the WshShortcut COM](https://docs.microsoft.com/en-us/troubleshoot/windows-client/admin-development/create-desktop-shortcut-with-wsh)\nobject to create a .lnk shortcut file in the Windows startup folder. This file points to the\nconfigured installation path and filename of DarkTortilla's initial loader executable (see Figure\n16).\n\n_Figure 16. COM object that drops shortcut file in Windows startup folder for persistence._\n_(Source: Secureworks)_\n\nDarkTortilla features standard and hidden techniques for implementing persistence via the\nWindows registry. Both options implement persistence in the HKEY_CURRENT_USER\n(HKCU) hive as a hard-coded value in the core processor code. This persistence results in\nthe installed DarkTortilla initial loader executable being run every time the user logs in.\n\nFor standard registry persistence, the core processor uses the %InstallationReg% and\n%InstallationKey% values to set the target key/value combination. In every sample\nanalyzed by CTU researchers where standard persistence was configured, the\n%InstallationReg% value was \"Software\\Microsoft\\Windows\\CurrentVersion\\Run\". The\nvalue stored in %InstallationKey% varied across samples (e.g., \"Updates\", \"svchost\",\n\"Runtime Broker\").\n\n\n-----\n\nFor hidden registry persistence, the core processor uses the %HiddenReg% and\n%HiddenKey% values to set the target key/value combination. In every sample\nanalyzed by CTU researchers where hidden persistence was configured, the\n%InstallationReg% value was \"Software\\Microsoft\\Windows\nNT\\CurrentVersion\\Winlogon\" and the value stored in %HiddenKey% was \"Shell\". Prior\nto setting the hidden persistence registry value, DarkTortilla's core processor prepends\nthe installed initial loader executable path with the Windows shell value retrieved from\nthe HKEY_LOCAL_MACHINE (HKLM) hive. This value is typically \"explorer.exe\",\nresulting in \"explorer.exe,<installed_darktortilla_exe_path>\". For example, if the\nconfigured install path and executable name for a DarkTortilla sample is \"C:\\Program\nFiles\\WindowsPowerShell\\PowerShellInfo.exe\", then the HKCU Winlogon\\Shell registry\nentry is \"explorer.exe,C:\\Program Files\\WindowsPowerShell\\PowerShellInfo.exe\". To\ncreate these registry values, the core processor executes the following command via\nProcess.Start():\n```\n        cmd.exe /c REG ADD \"HKCU\\<configured_reg_key>\" /f /v \"\n   <configured_reg_val>\" /t\n\n        REG_SZ /d \"<installed_darktortilla_exe_path>\"\n\n\n### RunPE process injection\n\n```\nDarkTortilla can execute its payloads using process injection. With this method, the payload\nresides only in memory and never accesses the filesystem. The %HostIndex% configuration\nelement defines which legitimate process to target for process injection (see Table 6).\n\n\n**%HostIndex% value**\n\n0 (or any numeric value that is\n_not 1-6)_\n\n\n**Corresponding target**\n**process** **Source directory**\n\nInitial loader executable's\nname\n\n\n1 AppLaunch.exe Microsoft.NET Framework\nfolder\n\n2 svchost.exe System32 folder\n\n3 RegAsm.exe Microsoft.NET Framework\nfolder\n\n4 InstallUtil.exe Microsoft.NET Framework\nfolder\n\n5 mscorsvw.exe Microsoft.NET Framework\nfolder\n\n\n-----\n\n**%HostIndex% value**\n\n\n**Corresponding target**\n**process** **Source directory**\n\n\n6 AddInProcess32.exe Microsoft.NET Framework\nfolder\n\n_Table 6. %HostIndex% values and corresponding target processes used for payload_\n_injection._\n\nPrior to setting the target process name, the core processor checks for active processes\nnamed \"avp\". The avp.exe process is part of the Kaspersky Anti-Virus suite. If the core\nprocessor detects this process, it overrides the %HostIndex% value and sets the target\nprocess name to the name of the initial loader executable. When the %HostIndex% value is\n1-6, the core processor attempts to copy the legitimate target executable file to the Windows\n%TEMP% directory.\n\nDarkTortilla uses a .NET-based DLL named \"RunPe6\" for process injection. This DLL is\nembedded within the core processor as an encoded byte array (see Figure 17).\n\n_Figure 17. Encoded RunPe6 DLL stored as byte array within DarkTortilla core processor._\n_(Source: Secureworks)_\n\nTo decode each byte, the core processor uses the following equation with <xor_key> as the\nhard-coded integer array [45, 89, 125, 69, 250, 222, 111] and <seed> as the hard-coded\ninteger 99:\n\n\n-----\n\n```\ndecoded_byte encoded_byte (<xor_key>[(idx <seed>) % xor_key.Length])\n\n```\nThe core processor loads RunPe6 and calls its ‘Runn' function to execute the malicious\npayload within the context of the configured target subprocess. The core processor does not\ndirectly reference this function. Rather, it references the index values for the target class (18)\nand function (0). Figure 18 displays PowerShell code developed by CTU researchers to\nreplicate the core processor's target function identification logic.\n\n_Figure 18. Custom PowerShell script to identify RunPe6 function used for payload process_\n_injection. (Source: Secureworks)_\n\n### Addon package processing\n\nDarkTortilla can be configured with zero or more payloads known as addon packages. These\naddons are in addition to the main payload that DarkTortilla is tasked with delivering.\nObserved addons include benign decoy documents, legitimate executables, keyloggers,\nclipboard stealers, cryptocurrency miners, and additional DarkTortilla payloads. Each addon\npackage possesses a set of configuration elements composed of a static \"F\" character, an\ninteger \"{0}\" that represents the index value indicating the position of the addon in the\npackage array, and a character representing a particular property associated with the\npackage.\n\nThe %FilesNum% configuration element defines the number of addon packages to process.\nFor example, if the %FilesNum% value is 3, the configuration elements are F.0.<addon\n_property>, F.1.<addon property>, and F.2.<addon property>._\n\nThe F.{0}.D (data) configuration element contains the addon package payload binary data.\nThe core processor checks the %Compress% configuration element to determine if the\nstored data is compressed. If the element is set to true, the core processor decompresses\nthe data before processing it.\n\nThe core processor next determines if it should process the addon package by inspecting the\ninitial loader's installation state and the addon package's F.{0}.R (run) value. Table 7 lists the\ncriteria and their result.\n\n\n-----\n\n**Initial loader running from install** **F.{0}.R (run)** **Process addon**\n**directory** **value** **package?**\n\nTrue True Yes\n\nTrue False No\n\nFalse True No\n\nFalse False Yes\n\n_Table 7. Criteria for processing addon package._\n\nIf configured to process the addon package, the core processor inspects the F.{0}.O\n(operation) configuration element value to determine how to execute its payload. This value\ncan be any integer but is typically 0, 1, or 2. If the value is set to 0 or any value other than 1\nor 2, the core processor saves the payload to disk but does not execute it. If the value is 1,\nthe core processor saves the payload to disk and executes it. If the value is 2, the core\nprocessor executes the payload in memory via the same RunPE process injection technique\nand target process it uses for the main payload.\n\nIf the payload is saved to disk, the location is specified by the addon path (F.{0}.P), subfolder\n(F.{0}.F), and filename (F.{0}.N) configuration elements. The F.{0}.P integer value represents\na CSIDL value associated with a special folder on the system. For example, the value 2\ncorresponds to the Windows Start Menu/Programs folder. The full path of an analyzed\n[sample containing a F.{0}.P value of 2, an empty string for F.{0}.F, and a value of sertif.exe](https://www.virustotal.com/gui/file/5be86cfca25e295f88b5aab42a6f604d2f1bb97f3c73b01df664c137908e2ec4)\nfor F.{0}.N is \"C:\\Users\\<username>\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\sertif.exe\".\n\n### Main payload processing\n\nAfter processing addon packages and installing the initial loader executable if appropriate,\nDarkTortilla processes its main payload. This main payload is typically a commodity\ninformation stealer or remote access trojan (RAT). DarkTortilla stores the binary data for the\nmain payload in the %MainFile% configuration element. Processing this payload consists of\ntwo steps:\n\n1. The core processor queries the %Compress% configuration element to determine if the\n\nbinary data in the %MainFile% configuration element is compressed. If set to true, the\ncore processor decompresses the data.\n\n\n-----\n\n2. The core processor executes the main payload via RunPE process injection. Unlike the\n\naddon payloads, there is no option to save the main payload to the filesystem.\nTherefore, the main payload resides only in memory. The target process used for\ninjection is the same as the addon packages and is defined by the %HostIndex%\nconfiguration element.\n\n### Anti-analysis controls\n\nDarkTortilla core processor samples analyzed by CTU researchers were obfuscated using\nthe [ConfuserEx code obfuscator. In addition to the obfuscator altering namespace, class,](https://yck1509.github.io/ConfuserEx/)\nfunction, and property names, CTU researchers identified multiple samples where it injected\nspecially crafted code that did not affect execution but inhibited decompilation by tools such\nas dnSpy (see Figure 19). Bypassing this anti-analysis control requires removing the code\nthat caused the decompiler to break, identifying another sample that does not implement this\ncontrol, or piecing together analysis from multiple samples to understand the code.\n\n_Figure 19. Broken dnSpy decompilation of DarkTortilla core processor. (Source:_\n_Secureworks)_\n\nThe core processor includes code that that detects profilers and debuggers, but these antianalysis controls are not called. To detect profiling, the code verifies if the\n[COR_ENABLE_PROFILING environment variable is present and sets to the value of 1. To](https://docs.microsoft.com/en-us/previous-versions/dotnet/netframework-4.0/ee471451(v=vs.100)?redirectedfrom=MSDN)\ndetect debuggers, the code spawns a thread (see Figure 20) that continuously checks the\n\n\n-----\n\n[Debugger.IsAttached property and the](https://docs.microsoft.com/en-us/dotnet/api/system.diagnostics.debugger.isattached?view=net-6.0) [Debugger.IsLogging method. If the core processor](https://docs.microsoft.com/en-us/dotnet/api/system.diagnostics.debugger.islogging?view=net-6.0)\nidentifies a debugger or if the thread performing the checks is terminated, the code\nterminates the initial loader process. It is unclear if this code was added by ConfuserEx or\nthe malware author.\n\n_Figure 20. Debugger detection performed by DarkTortilla core processor. (Source:_\n_Secureworks)_\n\nThe core processor implements string encoding to obscure important strings such as the\nconfiguration keys. Figure 21 shows a code excerpt that passes the string length (17),\ncharacter index array ([26,8,13,18,19,0,11,11,0,19,8,14,13,17,4,6,26]), and capital letter\nindex array ([8,17]) to the decode function.\n\n_Figure 21. DarkTortilla core processor string obfuscation example. (Source: Secureworks)_\n\nThis function decodes the string by iterating through each value in the character index array\nand retrieving the corresponding character at the specified index in a hard-coded character\narray (see Figure 22).\n\n\n-----\n\n_Figure 22. Character array used by string decoding logic. (Source: Secureworks)_\n\nFigure 21 shows that the example's first three values of the character index array passed to\nthe decode function are 26, 8, and 13. These values correspond to the characters \"%\", \"i\",\nand \"n\" in the hard-coded character array shown in Figure 22. The values passed in the\ncapital letter index array (8, 17) indicate which characters should be capitalized (\"I\" and \"R\"\nin this example). Processing the character index array results in the decoded string\n\"%InstallationReg%\".\n\nThe %VM% configuration element enables DarkTortilla's anti-virtual machine (anti-VM)\ncontrols. If set to true, the core processor obtains information about the system by querying\nthe following Windows Management Instrumentation (WMI) objects:\n\nThe core processor also retrieves information about the system's running processes and\nservices. It then inspects this data for strings associated with Hyper-V, QEMU, Virtual PC,\nVirtualBox, and VMware. If any of the case-insensitive data matches the criteria in Table 8,\nthe core processor terminates the initial loader process.\n\n**Targeted**\n**technology** **Inspected entity** **Inspection logic**\n\nHyper-V Win32_DiskDrive Caption contains \"virtual\"\n\nHyper-V Win32_ComputerSystem Manufacturer contains \"microsoft\" and Model\ncontains \"virtual\"\n\nQEMU Win32_DiskDrive Name contains \"qemu\"\n\nVirtual PC Process Process list contains \"vmusrvc\" or both\n\"vpcmap\" and \"vmsrvc\"\n\nVirtualBox Win32_DiskDrive Model contains \"vbox\"\n\nVirtualBox Process ProcessName contains \"vboxservice\"\n\nVMware Win32_DiskDrive Name contains \"vmware\"\n\nVMware Win32_DiskDrive Model contains \"vmware\"\n\nVMware Win32_ComputerSystem Manufacturer contains \"vmware\" and Model\ncontains \"virtual\"\n\n\n-----\n\n**Targeted**\n**technology** **Inspected entity** **Inspection logic**\n\nVMware Win32_BIOS Serial number contains \"vmware\"\n\nVMware Win32_PnPEntity Name equals \"vmware pointing device\"\n\nVMware Win32_PnPEntity Name contains \"vmware sata\"\n\nVMware Win32_PnPEntity Name equals \"vmware usb pointing device\"\n\nVMware Win32_PnPEntity Name equals \"vmware vmci bus device\"\n\nVMware Win32_PnPEntity Name equals \"vmware virtual s scsi disk\ndevice\"\n\nVMware Win32_PnPEntity Name starts with \"vmware svga\"\n\nVMware Service ServiceImagePath contains \"vmware\" and\nServiceName equals \"vmtools\"\n\nVMware Service ServiceImagePath contains \"vmware\" and\nServiceName equals \"tpvcgateway\"\n\nVMware Service ServiceImagePath contains \"vmware\" and\nServiceName equals \"tpautoconnsvc\"\n\n_Table 8. DarkTortilla core processor anti-VM detections._\n\nThe %SB% configuration element enables DarkTortilla's anti-sandbox control. This control\n[only detects the Sandboxie sandbox. The core processor terminates the initial loader](https://sandboxie-plus.com/Sandboxie/)\nprocess if it detects a running process named \"sandboxierpcss\" in the current session.\n\n### Anti-tamper controls\n\nDarkTortilla's anti-tamper controls are the last step in its execution chain and occur after the\nmain payload is executed. The four controls ensure that nothing interferes with DarkTortilla's\nexecution of its critical components.\n\n1. The first anti-tamper control is employed by the core processor and ensures that the\n\ninjected subprocess running the main payload is immediately rerun if terminated. The\n%InjectionPersist% configuration element regulates this control. If set to true, the core\nprocessor starts a thread that monitors the state of the injected subprocess. If the\nsubprocess is terminated, this anti-tamper control automatically respawns the\nconfigured target subprocess, re-injects the main payload, and executes it within the\ncontext of the subprocess.\n\n\n-----\n\n2. The second anti-tamper control ensures that the initial loader executable is immediately\n\nrerun if terminated. DarkTortilla implements this functionality with a secondary .NETbased executable that it refers to as \"WatchDog\". The %InjectionPersist% configuration\nelement regulates this control. If set to true, the core processor drops the WatchDog\nexecutable and its configuration file to the Windows %TEMP% directory. It then\nexecutes the WatchDog executable, which monitors the initial loader process.\n\nThe WatchDog executable bytes are stored in the DarkTortilla %WatchDogBytes%\nconfiguration element, and the filename is stored in %WatchDogName%. Prior to\nprocessing, the core processor decompresses the WatchDog executable's bytes if the\n[%Compress% configuration element is set to true. Every WatchDog executable](https://www.virustotal.com/gui/file/2d0dc6216f613ac7551a7e70a798c22aee8eb9819428b1357e2b8c73bef905ad)\ndropped by DarkTortilla was identical:\n\nMD5 hash: 0e362e7005823d0bec3719b902ed6d62\nSHA1 hash: 590d860b909804349e0cdc2f1662b37bd62f7463\nSHA256 hash:\n2d0dc6216f613ac7551a7e70a798c22aee8eb9819428b1357e2b8c73bef905ad\n\nIf an executable with the configured WatchDog name already exists in the Windows\n%TEMP% directory, the core processor removes the existing executable's\n[Zone.Identifier Alternate Data Stream (ADS), which strips the executable of any](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-fscc/6e3f7352-d11c-4d76-8c39-2516a9df36e8)\nexisting [URL security zones. It then overwrites the existing executable with the new](https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/platform-apis/ms537183(v=vs.85)?redirectedfrom=MSDN)\nWatchDog executable.\n\nThe WatchDog configuration file dropped to the filesystem shares the same name as\nthe WatchDog executable but uses a .txt file extension. For example, the configuration\nfilename for \"WatchDog.exe\" is \"WatchDog.txt\". This configuration file contains three\nlines representing the following values:\n\nThe process ID of the initial loader executable\nThe path and filename of the initial loader executable\nThe process ID for the WatchDog executable\n\nIf the initial loader process terminates, the WatchDog process reruns it and refreshes\nthe contents of the WatchDog configuration text file with the new process ID\ninformation.\n\n3. The third anti-tamper control is employed by the core processor and ensures that the\n\ndropped WatchDog executable continues to execute. The core processor retrieves the\nWatchDog executable process ID from the WatchDog configuration file once per\nsecond and verifies that the corresponding process is running. If the WatchDog\nprocess terminates, the core processor breaks the loop, drops a new WatchDog\nconfiguration file, and reruns the WatchDog executable.\n\n\n-----\n\n4. The fourth anti-tamper control is employed by the core processor and maintains\n\npersistence for the initial loader. The %StartupPersist% configuration element regulates\nthis control. If set to true, the core processor starts a thread that sets persistence every\n30 seconds using the persistence type defined in the DarkTortilla configuration. The\ncontrol does not contain validation logic to check the persistence status, so it repeats\nthe process indefinitely.\n\n### Delayed execution\n\nThe core processor implements the kernel32.dll Sleep function to delay execution at the\nfollowing stages of the process. The length of delay is typically controlled by the value in the\n%Delay% configuration element. CTU researchers observed values ranging from 0 seconds\nto 300 seconds.\n\nPrior to implementing persistence, the core processor sleeps for the number of\nseconds specified by the %Delay% configuration element.\nPrior to processing addon packages, the core processor sleeps for the number of\nseconds specified by the %Delay% configuration element.\nThe core processor sleeps for a hard-coded 5 seconds after copying the source\nexecutable to the install directory but before running the executable.\n\nThe number of delays increases if the %Melt% and %Installation% configuration elements\nare set to true, as the delays are processed each time the executable migrates. These\ndelays can impede detection in sandbox environments if they exceed the maximum wait\ntime.\n\n## Possible malware connections\n\nDarkTortilla code shares similarities to other malware. For example, payload compression,\n[junk code inclusion, and payload execution via RunPe6 are also features of a RATs Crew](https://github.com/malwares/Crypter/blob/master/%5BC%23%5D%20The%20RATs%20Crew%20Crypter/Form1.cs#L161-L163)\ncrypter last updated in 2016. DarkTortilla could represent an evolution of that crypter.\nAdditionally, the Gameloader malware uses similar malspam lures and archive files as\nDarkTortilla. It also leverages .NET resources to store encoded DLLs and encrypted bitmap\nimages and delivers similar commodity malware payloads. However, there is insufficient\nevidence as of this publication to definitively link these malware families or threat actors to\nDarkTortilla.\n\n## Conclusion\n\nResearchers often overlook DarkTortilla and focus on its main payload. However, DarkTortilla\nis capable of evading detection, is highly configurable, and delivers a wide range of popular\nand effective malware. Its capabilities and prevalence make it a formidable threat.\n\n\n-----\n\n## Threat indicators\n\nThe threat indicators in Table 9 can be used to detect activity related to DarkTortilla. The URL\nmay contain malicious content, so consider the risks before opening it in a browser.\n\n**Indicator** **Type** **Context**\n\n59295e810bbdbfd64b8c41316ea13cae MD5 hash Malicious spam delivering\nDarkTortilla\n\n\n18391a58ee25a5cb8dfbf4d48517b5b0\n\nc66c5ae6\n\n981aa83b2d33cca994021197237ac5ee\n\n3ad3402f7d25f04f4e76985f4ec8744c\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nMalicious spam delivering\nDarkTortilla\n\nMalicious spam delivering\nDarkTortilla\n\n\n84872b60072011eab8940f3b49bdb582 MD5 hash DarkTortilla initial loader\n\n\n3da0f44d45a1d6676d52ce691d2f6d75\n\n4eb3097e\n\n5e03556be992d23088a3c49d24c45b1c\n\n21cd275bffb4e536348e8128d50374b6\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n2d74df3ce221f6ff48d20bac158a3e78 MD5 hash Malicious document delivering\nDarkTortilla\n\n\n0563e691801251cdfd363eee31858ead\n\n5ee3928b\n\n4f15b28c91fa0e8d0dd9e86481bad04f\n\na34fcaf564d08de7c4c0c513fc6e122d\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nMalicious document delivering\nDarkTortilla\n\nMalicious document delivering\nDarkTortilla\n\n\n827258f907c5087f498c413d28e2203e MD5 hash DarkTortilla initial loader\n\n\n5e0cb6076002b11a39636e07a217b493\n\n835e5bce\n\n55d7d9bd9d4a511417033b6c14ce93f9\n\n62d6a6e6c6414f0cb7e455baee1d3ab7\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\nc37aae0ff565a2e44f144f837b750279 MD5 hash DarkTortilla initial loader\n\n\ndde386911b091e894746b0f12d88a1fd\n\n18761fb9\n\na0b96236bfd79d2ebeadb8e3deb9448a\n\nf3ec8edd1ea9672b7ad4793934bb4c47\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n93fe6600c51014d7d6c2afedf8398f92 MD5 hash DarkTortilla initial loader\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n8f7340704745f3d53b284c101e93c42f\n\n8d4c2adc\n\n45ef054bca2ae4d67e6623bf28ff75e5\n\nd178924602674c654e1b569aa74601cd\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n6e91ad0972e104a277505104abe39d1e MD5 hash DarkTortilla initial loader\n\n\n261d699c3bb1a0042b88a45ed340f2d8\n\n6149464f\n\nb3754c6ecc445e9a3b37c5ebe68adb96\n\n30ca4aa89a8e8515468f39ae8131f141\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\ncd49f7c3c4e82dee128eedea9879bc33 MD5 hash DarkTortilla initial loader\n\n\n619bf90a8ea219e34bf57dda1a322914\n\nb9fa1c81\n\n0a5dc3b6669cf31e8536c59fe1315918\n\neb4ecfd87998445e2eeb8fed64bd2f2c\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n851816aa8cf45ba769f0d9420acfb3e5 MD5 hash DarkTortilla initial loader\n\n\n4178d5efa388caf2d0ffd4539cf285b1\n\nde5ffab6\n\n083acce46cb8cf35e37c778d1f4aee68\n14bca72d2874b793a47f9823f51df0fe\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\nf44695a8febb2a35576a59fa984629d2 MD5 hash DarkTortilla initial loader\n\n\n37ec57e5da46dc1990941a1bb3ffab9e\n\n74db346a\n\n53b3b37b7d1e40c80fcda2c424cd8373\n\n79ac2ce93023de6c22ba3e2d94679671\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n8d8c551dd572a1dc158de239b37eaa9a MD5 hash DarkTortilla initial loader\n\n\n6d4b4bcd107b09af37996c73a6448379\n\na31aaac4\n\n5be86cfca25e295f88b5aab42a6f604d\n\n2f1bb97f3c73b01df664c137908e2ec4\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla initial loader\n\nDarkTortilla initial loader\n\n\n0f89a2015ed9c1be5522e27c00276e52 MD5 hash DarkTortilla core processor\n(PVCore1)\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n5ad5b35f6cc093067c6f219f2d2107f4\n\n4248c5bb\n\n93dd1202697dbaed9ef4f4707f262821\n\n2bf13aad096de29c14924b1dae1d6d5b\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla core processor\n(PVCore1)\n\nDarkTortilla core processor\n(PVCore1)\n\n\n0e362e7005823d0bec3719b902ed6d62 MD5 hash DarkTortilla watchdog executable\n\n\n590d860b909804349e0cdc2f1662b37b\n\nd62f7463\n\n2d0dc6216f613ac7551a7e70a798c22a\n\nee8eb9819428b1357e2b8c73bef905ad\n\n\nSHA1\nhash\n\nSHA256\nhash\n\n\nDarkTortilla watchdog executable\n\nDarkTortilla watchdog executable\n\n\nhttps://pastebin.pl/view/raw/60b6b03b URL DarkTortilla encoded core\nprocessor download\n\n_Table 9. Indicators for this threat._\n\n## References\n\nArntz, Pieter. \"Explained: Packer, Crypter, and Protector.\" Malwarebytes Labs. March 27,\n2017. https://blog.malwarebytes.com/cybercrime/malware/2017/03/explained-packer-crypterand-protector/\n\nHasherezade. \"Rainbows, Steganography and Malware in a new .NET cryptor.\"\nMalwarebytes Labs. March 30, 2016. https://blog.malwarebytes.com/threatanalysis/2015/08/rainbows-steganography-and-malware-in-a-new-net-cryptor/\n\n[\"RATs Crew.\" Hack Forums. June 21, 2021. https://wiki.hackforums.net/RATs_Crew](https://wiki.hackforums.net/RATs_Crew)\n\nGoSecure Titan Labs. \"New Malware ‘Gameloader' in Discord Malspam Campaign.\"\nGoSecure. November 2, 2021. https://www.gosecure.net/blog/2021/11/02/new-malwaregameloader-in-discord-malspam-campaign-identified-by-gosecure-titan-labs/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-17 - DarkTortilla Malware Analysis.pdf"
    ],
    "report_names": [
        "2022-08-17 - DarkTortilla Malware Analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8bd26575-9221-47d1-9d8b-5c18354dc1bd",
            "created_at": "2022-10-25T16:07:24.335Z",
            "updated_at": "2025-03-27T02:02:10.176629Z",
            "deleted_at": null,
            "main_name": "Tortilla",
            "aliases": [],
            "source_name": "ETDA:Tortilla",
            "tools": [
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "CHINACHOPPER",
                "China Chopper",
                "SinoChopper",
                "Vasa Locker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535631,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1662027143,
    "ts_modification_date": 1662027143,
    "files": {
        "pdf": "https://archive.orkl.eu/9381c4b1ddbd7511f4d41a6bcc39da0fb8f60343.pdf",
        "text": "https://archive.orkl.eu/9381c4b1ddbd7511f4d41a6bcc39da0fb8f60343.txt",
        "img": "https://archive.orkl.eu/9381c4b1ddbd7511f4d41a6bcc39da0fb8f60343.jpg"
    }
}