{
    "id": "b9f03147-75fb-4de1-be6f-bf8862209ed5",
    "created_at": "2023-01-12T15:02:09.174941Z",
    "updated_at": "2025-03-27T02:06:05.065363Z",
    "deleted_at": null,
    "sha1_hash": "4dd441cebf9c45db521ecbc06bddced26ac4b91b",
    "title": "2021-05-14 - Elliptic Follows the Bitcoin Ransoms Paid by Colonial Pipeline and Other DarkSide Ransomware Victims",
    "authors": "",
    "file_creation_date": "2022-05-28T18:24:00Z",
    "file_modification_date": "2022-05-28T18:24:00Z",
    "file_size": 1012801,
    "plain_text": "# Elliptic Follows the Bitcoin Ransoms Paid by Colonial Pipeline and Other DarkSide Ransomware Victims\n\n**[elliptic.co/blog/elliptic-follows-bitcoin-ransoms-paid-by-darkside-ransomware-victims](https://www.elliptic.co/blog/elliptic-follows-bitcoin-ransoms-paid-by-darkside-ransomware-victims)**\n\n\n-----\n\n**Dr. Tom Robinson**\n\nElliptic's Co-founder and Chief Scientist discusses cryptocurrency forensics, investigations, compliance,\nand sanctions.\n\n_What does Elliptic's analysis tell us about DarkSide, the cybercrime group that held the US's_\n_energy infrastructure to ransom this week?_\n\n_Updated: 15 May 2021_\n\n[Elliptic clients can now use our transaction screening software to screen deposits for links to](https://www.elliptic.co/solutions/crypto-transaction-monitoring)\nthis high-profile incident.\n\nElliptic has identified the Bitcoin wallet used by the DarkSide ransomware group to receive\nransom payments from its victims, based on our intelligence collection and analysis of\nblockchain transactions. This wallet received the 75 BTC payment (worth $4.4 million at the\ntime of the transaction) made by Colonial Pipeline on May 8, following the crippling\ncyberattack on its operations - leading to widespread fuel shortages in the US.\n\nOur analysis shows that the wallet has been active since 4th March 2021 and has received\n57 payments from 21 different wallets. Some of these payments directly match ransoms\nknown to have been paid to DarkSide by other victims, such as 78.29 BTC (also worth $4.4\nmillion at the time of the transaction) sent by chemical distribution company Brenntag on May\n11.\n\nIn fact the affiliate’s share (the part of the ransom that goes to the deployer of the malware)\nof both the Colonial Pipeline and Brenntag ransom payments were sent to the same Bitcoin\naddress, suggesting that the same party was responsible for infecting both of these\nbusinesses.\n\nIn addition, our analysis shows that a previously unreported ransom payment for ~$320,000\nwas made to DarkSide on the 10th May: the bitcoins originated from the same exchange\nused by Colonial Pipeline.\n\nIn total, the DarkSide wallet has received Bitcoin transactions since March with a total value\nof $17.5 million. Ransoms associated with previous attacks were paid to other wallets.\n\n**Where is Darkside sending the bitcoins?**\n\nWe can also use blockchain analysis to follow the money trail and determine where DarkSide\nis sending its ransomware proceeds, to launder them or convert them to cash.\n\n\n-----\n\nIt has been [reported within the past hours that DarkSide itself has ceased operations and](https://www.bleepingcomputer.com/news/security/darkside-ransomware-servers-reportedly-seized-revil-restricts-targets/)\nhas had its funds seized - and indeed their wallet was emptied of the $5 million in Bitcoin it\n[contained on Thursday afternoon. There has been speculation that the bitcoins were seized](https://www.trtworld.com/business/servers-of-us-oil-pipeline-hackers-darkside-gets-shut-down-46726)\nby the US government - if that is the case they didn’t actually seize most of Colonial\nPipeline’s ransom payment - the majority of that was moved out of the wallet on the 9th May.\n\nBut by tracing previous outflows from the wallet, we can gain insights into how DarkSide and\nits affiliates were laundering their previous proceeds. What we find is that 18% of the Bitcoin\nwas sent to a small group of exchanges. This information will provide law enforcement with\ncritical leads to identify the perpetrators of these attacks.\n\nAn additional 4% has been sent to Hydra, the world’s largest darknet marketplace, servicing\n[customers in Russia and neighboring countries. As we revealed in previous research, Hydra](https://www.elliptic.co/blog/buried-treasure-criminals-to-go-to-extreme-lengths-to-cash-out-crypto)\noffers cash-out services alongside narcotics, hacking tools and fake IDs. These allow Bitcoin\nto be converted into gift vouchers, prepaid debit cards or cash Rubles. If you’re a Russian\ncybercriminal and you want to cash-out your crypto, then Hydra is an attractive option.\n\n**What can be done about this?**\n\nBy identifying this wallet, Elliptic’s clients, including financial institutions, crypto exchanges\nand fintechs will now be alerted to any client deposits that originate from the DarkSide wallet.\nBy using our [transaction and wallet screening tools they can ensure that DarkSide and other](https://www.elliptic.co/solutions/crypto-transaction-monitoring)\nransomware operators cannot cash-out or exchange their Bitcoin proceeds, disincentivizing\nthis activity.\n\n[Elliptic’s law enforcement clients can also use our software to trace these funds and seek to](https://www.elliptic.co/solutions/crypto-investigations)\nidentify those responsible for these crippling cyber attacks.\n\nLearn more about how Elliptic helps crypto businesses and financial institutions manage their\ncryptoasset risk.\n\nIf you don't already have Elliptic backing up your crypto AML compliance operations already,\nyou can schedule a demo today:\n\n## Disclaimer\n\nThis blog is provided for general informational purposes only. By using the blog, you agree\nthat the information on this blog does not constitute legal, financial or any other form of\nprofessional advice. No relationship is created with you, nor any duty of care assumed to\nyou, when you use this blog. The blog is not a substitute for obtaining any legal, financial or\n\n\n-----\n\nany other form of professional advice from a suitably qualified and licensed advisor. The\ninformation on this blog may be changed without notice and is not guaranteed to be\ncomplete, accurate, correct or up-to-date.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-14 - Elliptic Follows the Bitcoin Ransoms Paid by Colonial Pipeline and Other DarkSide Ransomware Victims.pdf"
    ],
    "report_names": [
        "2021-05-14 - Elliptic Follows the Bitcoin Ransoms Paid by Colonial Pipeline and Other DarkSide Ransomware Victims.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535729,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1653762240,
    "ts_modification_date": 1653762240,
    "files": {
        "pdf": "https://archive.orkl.eu/4dd441cebf9c45db521ecbc06bddced26ac4b91b.pdf",
        "text": "https://archive.orkl.eu/4dd441cebf9c45db521ecbc06bddced26ac4b91b.txt",
        "img": "https://archive.orkl.eu/4dd441cebf9c45db521ecbc06bddced26ac4b91b.jpg"
    }
}