{
    "id": "ba0d0529-a037-47d2-8d15-5e6495b1df85",
    "created_at": "2023-01-12T15:10:59.88664Z",
    "updated_at": "2025-03-27T02:06:07.65731Z",
    "deleted_at": null,
    "sha1_hash": "d38ffced00a2804dc616acf5b43b9149eb993290",
    "title": "2016-09-16 - Tofsee – modular spambot",
    "authors": "",
    "file_creation_date": "2022-05-28T04:07:02Z",
    "file_modification_date": "2022-05-28T04:07:02Z",
    "file_size": 210727,
    "plain_text": "# Technical analysis\n\n**cert.pl/en/news/single/tofsee-en/**\n\n\n-----\n\nTofsee, also known as Gheg, is another botnet analyzed by CERT Polska. Its main job is to\nsend spam, but it is able to do other tasks as well. It is possible thanks to the modular design\nof this malware – it consists of the main binary (the one user downloads and infects with),\nwhich later downloads several additional modules from the C2 server – they modify code by\noverwriting some of the called functions with their own. An example of some actions these\nmodules perform is spreading by posting click-bait messages on Facebook and VKontakte\n(Russian social network).\n\nBot communicates with the botmaster using non-standard protocol built on top of TCP. The\nfirst message after establishing the connection is always sent by the server – the most\nimportant thing it contains is a random 128-byte key used for encrypting further\ncommunication. It is therefore impossible to decode the communication if one wasn’t\nlistening right from its beginning.\n\nAt all times, bot keeps a list of resources (in the form of linked list) in memory. Just after bot\nstarts, the list is almost empty and contains only basic information, such as bot ID, but it is\nquickly filled by data received from the server in further messages. Resources can take\ndifferent forms – for example, it might be a list of mail subjects to be used in spam, but DLL\nlibraries extending bot capabilities are treated as named resources as well. Additionally, one\nof resources – work_srv – contains a list of C2 IP addresses. It is one of the first messages\nsent by server and, interestingly, may not contain itself – in this case, connection is soon\nterminated and a random server from the newly received list is chosen as communication\npartner. This usually happens during connection to one of C2s hardcoded in the binary –\neffectively, they act as “pointer” to real servers.\n\nAll sent emails are randomized – for this purpose, Tofsee uses a special script language (an\nexample file is in technical analysis section). Its body contains macros, which will be\nreplaced randomly by certain strings of characters during parsing – for example\n_%RND_SMILE will be substituted by one of several emoticons. Thanks to this randomization,_\nsimpler spam filters might pass these messages through.\n\nThe C2 IP address list is hardcoded in the binary in an encrypted form. The algorithm used\nfor obfuscation is very simple – it XORs the message with the hardcoded key.\n\n\n-----\n\nData decrypts to three IP+port pairs – at least in the analyzed sample, the port was equal to\n443 for all of them. The probable reason is to conceal communication by using port\ndedicated for SSL traffic.\n\n**Communication protocol**\n\n\n-----\n\nAfter establishing TCP connection the first message is sent by the server. Its size is always\n200 bytes long (though not all bytes are used – the final ones seem to be reserved, perhaps\nfor future expansion of the protocol). This message is also obfuscated by simple bitwise\noperations:\n\nDecrypted data form the following structure (we were not able to find the meaning of some of\nthe fields):\n\nFrom this point on all traffic (both incoming and outgoing) is encrypted using the the 128-byte\nkey received in the first message. The key is modified after every sent or received byte, so it\nis impossible to decrypt the transmission without listening to it from the beginning. XORing is\nused in such a way, that a single function can both encrypt and decrypt messages:\n\nParameters:\n\n_data – raw data_\n_key – short, 7-byte key, initialized by “abcdefg” bytes before the first message_\n_main_key – 128-byte key from the greeting message_\n_it – number of bytes sent/received till now_\n\nAll messages (except the greeting) consist of header and payload. The header is\nrepresented by the following structure:\n\nThe protocol supports data compression, but it is only used for bigger messages. Fields op,\n_subop1 and subop2 are certain constants defining message type. The binary contains code_\nhandling a large number of types, but in practice, only a fraction of them is used.\n\nPayload is sent after the header. Its exact structure and contents depend on message type –\nsome of them will be described in details below.\n\nThe first message sent by the bot has types {1,0,0} (op, subop1 and subop2, respectively)\nand is a quite big structure:\n\nSome of the field names (such as lid_file_upd) we got for free – we did not have to reverse\nthem by analyzing their usage, since bot saved them under those exact indices to internal\ndata structure, mapping variable names to their contents.\n\nServer response can have different forms as well. The simplest one – op=0 – means an\nempty response (or end of transmission consisting of multiple messages). If op=2, the server\nsends us a new resource – the message payload is in this case of the following structure:\n\nUsually after connecting to C2 server hardcoded in the binary the first message (after\ngreeting) received by the bot is a single resource named work_srv, which contains a list of a\ncouple of IP addresses and ports (this time different than 443), on which true C2 servers are\n\n\n-----\n\nlistening. The bot then disconnects from the current server and, after a while, starts the\ncommunication over with one of the freshly obtained IPs.\n\nIf op=1, the message’s meaning depends on subop2 and, additionally, first four bytes of\npayload (which are apparently used as flags in this case). For example, if these conditions\nare met: op=1, subop2&1=0, flags=4, the message is a C2 request for all resources the bot\nhas. The bot’s response is then a concatenated list of resources in a form similar to the\nshowed above, after which server sends tens or hundreds type 2 messages (containing\nresources) – resources, which bot does not have yet.\n\n**Resources**\n\nEvery resource is identified by its type – a small integer (up to 40, but most of them are\nbelow 10) and a short name, such as “priority”. Some of the most interesting types include:\n\nType 5\n\nContains plugin DLLs. Since they don’t have all of their symbols stripped, we could quickly\nguess plugins’ tasks. As of today, Tofsee downloads the following plugins:\n\n**Name of resource – number** **DLL name** **DLL MD5 hash**\n\n1 ddosR.dll fbc7eebe4a56114e55989e50d8d19b5b\n\n2 antibot.dll a3ba755086b75e1b654532d1d097c549\n\n3 snrpR.dll 385b09563350897f8c941b47fb199dcb\n\n4 proxyR.dll 4a174e770958be3eb5cc2c4a164038af\n\n5 webmR.dll 78ee41b097d402849474291214391d34\n\n6 protect.dll 624c5469ba44c7eda33a293638260544\n\n7 locsR.dll 2d28c116ca0783046732edf4d4079c77\n\n10 hostR.dll c90224a3f8b0ab83fafbac6708b9f834\n\n11 text.dll 48ace17c96ae8b30509efcb83a1218b4\n\n12 smtp.dll 761e654fb2f47a39b69340c1de181ce0\n\n13 blist.dll e77c0f921ef3ff1c4ef83ea6383b51b9\n\n14 miner.dll 47405b40ef8603f24b0e4e2b59b74a8c\n\n15 img.dll e0b0448dc095738ab8eaa89539b66e47\n\n16 spread1.dll 227ec327fe7544f04ce07023ebe816d5\n\n\n-----\n\n17 spread2.dll 90a7f97c02d5f15801f7449cdf35cd2d\n\n18 sys.dll 70dbbaba56a58775658d74cdddc56d05\n\n19 webb.dll 8a3d2ae32b894624b090ff7a36da2db4\n\n20 p2pR.dll e0061dce024cca457457d217c9905358\n\nJudging by these names, apart from spamming, Tofsee also has other functions, such as\ncoordinated DDoS, or cryptocurrency mining (as it turns out, one of the resources being\ndownloaded is a Litecoin miner).\n\nType 11\n\nContains periodically updated scripts in an atypical language, which are used to send spam.\nExample script:\n\nThe language is slightly similar to assembly – for example “J” as the first character in line\nmeans jump, and “L” – defines label. Script contains macros, which are substituted into other\ntext at runtime – for example %ATTNAME1.\n\nType 7\n\nContains general purpose macros. The name of these resources is the same as macro’s\nthey describe, for example %DATE_RAN_SUB (likely abbreviation of DATE RANDOM\n_SUBJECT). The resource content is a newline-separated list of substitutions, for example:_\n\nSince some of the variables need to contain literal newline character, several macros are\nhardcoded in binary for that very purpose, for example %SYS_N.\n\nType 8\n\nContains local macros. Since different email scripts might want to use macros with the same\nname, but different content, some of the macros are local. The resource names are of\n_NUM%VAR form, for example 1819%TO_NAME, where 1819 is number of the script being_\nthe scope of macro %TO_NAME.\n\nVariable substitutions are recursive, as seen on aforementioned example of\n_%DATE_RAN_SUB – macros can contain other macros. The script language also allows for_\nmore complicated constructs, such as %RND_DIGIT[3], meaning three random digits (often\nused in color’s hexadecimal description), or %{%RND_DEXL}{ %RND_SMILE}{}, meaning a\nrandom choice between %RND_DEXL, %RND_SMILE and an empty string. As we can see\nthe language is quite flexible.\n\nRest of the types contain only a handful of resources and are less interesting from our\nperspective, so we will skip their description in this article.\n\n\n-----\n\nHash of the analyzed binary and YARA rules matching this malware family will conclude this\nanalysis.\n\nHash:\nae0d32e51f36ce6e6e8c5ccdc3d253a0 - analyzed sample (main binary, before unpacking)\n\nYARA rules:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-09-16 - Tofsee – modular spambot.pdf"
    ],
    "report_names": [
        "2016-09-16 - Tofsee – modular spambot.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536259,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653710822,
    "ts_modification_date": 1653710822,
    "files": {
        "pdf": "https://archive.orkl.eu/d38ffced00a2804dc616acf5b43b9149eb993290.pdf",
        "text": "https://archive.orkl.eu/d38ffced00a2804dc616acf5b43b9149eb993290.txt",
        "img": "https://archive.orkl.eu/d38ffced00a2804dc616acf5b43b9149eb993290.jpg"
    }
}