{
    "id": "ba302ca7-0e7e-4492-ba36-f2e8e4f42b63",
    "created_at": "2023-01-12T15:02:03.458981Z",
    "updated_at": "2025-03-27T02:16:58.026822Z",
    "deleted_at": null,
    "sha1_hash": "da594d7b428d58b16edbf9012f948daed3c24cb8",
    "title": "2021-08-30 - CARBON SPIDER Embraces Big Game Hunting, Part 1",
    "authors": "",
    "file_creation_date": "2022-05-28T15:20:14Z",
    "file_modification_date": "2022-05-28T15:20:14Z",
    "file_size": 1647903,
    "plain_text": "# CARBON SPIDER Embraces Big Game Hunting, Part 1\n\n**[crowdstrike.com/blog/carbon-spider-embraces-big-game-hunting-part-1/](https://www.crowdstrike.com/blog/carbon-spider-embraces-big-game-hunting-part-1/)**\n\nEric Loui - Josh Reynolds August 30, 2021\n\n[Throughout 2020, CARBON SPIDER dramatically overhauled their operations. In April 2020,](https://adversary.crowdstrike.com/en-US/adversary/carbon-spider/)\nthe adversary abruptly shifted from narrow campaigns focused entirely on companies\noperating point-of-sale (POS) devices to broad, indiscriminate operations that attempted to\ninfect very many victims across all sectors. The goal of these campaigns was to conduct big\ngame hunting (BGH) operations using PINCHY SPIDER’s REvil ransomware.\n\nCARBON SPIDER deepened their commitment to BGH in August 2020 by using their own\nransomware, Darkside. In November 2020, the adversary took another step into the world of\n[BGH by establishing a ransomware-as-a-service (RaaS) affiliate program for Darkside,](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)\nallowing other actors to use the ransomware while paying CARBON SPIDER a portion of the\nransom received.\n\nPart One of this two-part blog series details how CrowdStrike Intelligence attributed Darkside\nto CARBON SPIDER. Part Two will look at CARBON SPIDER’s re-emergence after the\nColonial Pipeline attack, which led to the shutdown of Darkside RaaS and the creation of\n_BlackMatter RaaS._\n\n\n-----\n\n## Background\n\nCARBON SPIDER, commonly referred to as FIN7 and active since 2013, is one of the oldest\ncontinuously operating eCrime groups. Between 2015 and 2020, the adversary conducted\nlow-volume campaigns targeting company POS devices, primarily in the hospitality sector.\nThese campaigns featured a variety of malware, including the Sekur (Carbanak) RAT, _VB_\n_Flash,_ _Bateleur and_ _Harpy_ (GRIFFON). Using POS malware, including PILLOWMINT, the\nadversary harvested credit card track data and sold this data on criminal forums such as\nJoker’s Stash.\n\n## April 2020: Target Scope Widens\n\nIn April 2020, CARBON SPIDER abruptly shifted from narrow campaigns focused entirely on\ncompanies operating POS devices to broad, indiscriminate operations that attempted to\ninfect large numbers of victims across all sectors. The first of these occurred on April 14,\n2020, when the adversary likely compromised a legitimate email distribution service to\nconduct a broad spam campaign targeting thousands of recipients across numerous\nverticals.\n\nThis campaign used malicious links that led to a ZIP archive hosted on\n```\nhttps[:]//colahasch[.]com/portal/app/CommerceNetwork/\nview/9b25068f2941618fb9b08d6d089a47faae552c93f The ZIP archive contained a Leo\n\n```\n_VBS, which refers to a family of obfuscated scripts that download and execute a remote_\npayload.\n\nThe Leo VBS performs an HTTP GET request to\n```\nhttps[:]//alphalanding[.]com/successfully/warranty.eml?uid= and writes a JSS\n\n```\n_Loader binary to_ `%TEMP%\\PaintHelper.exe . JSS Loader, which has both .NET and C++`\nversions, has multiple capabilities, including the ability to load additional executables,\nPowerShell (PS) and JavaScript (JS) files.\n\nThe observed JSS Loader infection led to the download and execution of a setup VBScript\nfrom `https[:]//petshopbook[.]com . This script installs a custom Sekur PS stager to`\n```\n%LOCALAPPDATA%\\Microsoft\\WindowsDefender\\ClearTemp.ps1 and establishes\n\n```\npersistence for this stager with a second VBS that is launched by a scheduled task.\n\nSince this campaign, CARBON SPIDER has maintained an opportunistic target scope, using\nphishing attachments and links to deliver Harpy, Leo VBS, JSS Loader, Domenus VBS and\n_Domenus JS. Domenus VBS and JS are backdoors (written in VBS and JS, respectively)_\nthat enumerate a variety of system information, capture screenshots and browser history,\nand can download secondary payloads from a command-and-control (C2) server. Secondary\npayloads can include JS, Portable Executables (PEs), DLLs and PS scripts.\n\n\n-----\n\nCrowdStrike Intelligence observed numerous Domenus VBS/JS phishing campaigns that\nmade use of compromised and legitimate services to host Domenus toolchain payloads,\nincluding compromised WordPress installations, compromised SharePoint services,\ncompromised web servers and Google Docs.\n\n## REvil Ransomware Campaigns\n\nOn April 28, 2020, CrowdStrike Intelligence observed a Domenus VBS distribution campaign\nthat used a spear-phishing email containing a Google Docs link. The resulting Google Docs\npage contained a second link that, when clicked, directed the user to\n```\nhttps[:]//chauvinistable[.]com/perfsecure, ultimately redirecting to a compromised\n\n```\nSharePoint site. Here, the victim encountered a ZIP file containing a Domenus VBS file that,\nonce opened, downloaded and executed Harpy from\n```\nhttps[:]//electroncador[.]com/info .\n\n```\nThe redirect URL provided from the Google Docs page\n```\nhttps[:]//chauvinistable[.]com/perfsecure was hosted on the same IP address\n\n```\n( 185.163.45[.]249 ) resolving to a domain used by multiple Cobalt Strike samples sharing\nkey configuration metadata with Cobalt Strike samples used in several REvil incidents.\nThese Cobalt Strike samples were also observed in tandem with the custom PowerShell\nstager for Sekur. Separate reporting by Symantec further indicated that similar Cobalt Strike\nsamples were used in campaigns delivering REvil. Based on these multiple overlaps,\nCrowdStrike Intelligence assesses with moderate confidence that CARBON SPIDER was\nresponsible for certain REvil campaigns, likely stemming from JSS Loader or Domenus\n_VBS/JS infections._\n\n## Darkside Ransomware Campaigns + RaaS\n\nOn July 1, 2020, CARBON SPIDER sent a phishing email with the subject “Notification:\nPackage Status Fail.” The email purports to be from a customer who received an email from\nthe U.S.-based delivery company UPS (Figures 1 and 2). The message body attempts to\nimpersonate a UPS notification, but contains several grammar errors and non-idiomatic\nterms (e.g., “waybill”).\n\nFigure 1. CARBON SPIDER phishing email\n\n\n-----\n\nFigure 2. CARBON SPIDER phishing email (continued)\n\nThe link “Check” led to a Google Docs page, which contained a link that redirected to a ZIP\nfile. The ZIP file was hosted on a likely compromised SharePoint account and contained\n_Domenus VBS, which downloads Harpy from_ `https[:]//fashionableeder[.]com/info .`\nAt one victim, CARBON SPIDER subsequently deployed the aforementioned custom PS\n_Sekur stager and profiled the Active Directory environment using the utility ADFind._\n\nIn this incident, CARBON SPIDER also used the KillACK PS backdoor, executing the\nmalware using both PowerShell and PowerShell ISE. KillACK sends host information to a C2\nserver (in this case, `againcome[.]com or` `besaintegration[.]com ) and executes`\nprovided PS script blocks. Multiple KillACK modules have been observed by CrowdStrike\nIntelligence, including modules for conducting self-propagation and AMSI hot-patching, as\nwell as for executing Cobalt Strike stagers and enumerating network information.\n\n\n-----\n\nOn Aug. 9, 2020, CARBON SPIDER attempted to run the Darkside ransomware with the\nfilename `sleep.exe . This filename may reflect an attempt to masquerade as the legitimate`\nWindows executable with the same name.\n\nFollowing this incident, CrowdStrike Intelligence identified numerous similar Darkside\ncampaigns featuring distinctive CARBON SPIDER tooling, including Harpy, Domenus\n_VBS/JS, KillACK and Sekur. The adversary also used the commodity Cobalt Strike_\nframework and Plink tunneling tool in many of these campaigns. After achieving initial\naccess, the adversary consistently seeks to harvest valid administrative credentials to enable\nlateral movement and uses a variety of tools and techniques for this purpose, including\nCrackMapExec, Kerberoasting, Mimikatz, PowerSploit and SessionGopher. In one incident,\n[the adversary likely exploited the ZeroLogon vulnerability (CVE-2020-1472) against a](https://www.crowdstrike.com/blog/new-zerologon-dashboard-offers-greater-visibility-into-cve-2020-1472/)\ndomain controller.\n\nUsing valid credentials, CARBON SPIDER moves laterally through victim environments\nusing RDP and occasionally SSH. The adversary typically uses PS to run Cobalt Strike but\noccasionally writes Cobalt Strike stagers or KillACK backdoors to disk. Occasionally,\nCARBON SPIDER has deployed the legitimate GoToAssist or TightVNC tools to provide\nredundant control of hosts.\n\nSimilar to many other ransomware operators, CARBON SPIDER not only encrypted victim\nfiles using Darkside, but also exfiltrated data for publication on a dedicated leak site (DLS)\nhosted on Tor. For exfiltration, CARBON SPIDER primarily leveraged the MEGASync client\nfor hosting provider MEGA but also employed GoToAssist. Further, CARBON SPIDER\nfrequently conducted hypervisor jackpotting by encrypting ESXi servers using a version of\n_Darkside specifically designed for ESXi._\n\nOn Nov. 10, 2020, CARBON SPIDER announced the establishment of the Darkside RaaS\naffiliate program. The announcement, posted on two major Russian-language forums, states\nthat the operators of Darkside are looking for Russian-speaking affiliates who understand\nhow to recognize and delete backups. On Nov. 11, 2020, CARBON SPIDER added a new\nmessage to their DLS concerning the new affiliate program. This announcement claims “we\ncreated the perfect product for ourselves,” indicating that Darkside was originally exclusive to\none group and not shared.\n\nCrowdStrike Intelligence assesses that Darkside ransomware campaigns prior to this\nannouncement were likely conducted by CARBON SPIDER, and that CARBON SPIDER was\nresponsible for creating Darkside and introducing the RaaS affiliate program. This\nassessment carries moderate confidence, based on:\n\nMultiple separate Darkside incidents attributable to CARBON SPIDER\nLow overall volume of Darkside campaigns\nThe Nov. 11, 2020 announcement described above indicating Darkside was initially\nexclusive to one group\n\n\n-----\n\nThe Oct. 10, 2020 press release indicating Darkside is operated by a single group\n\nSubsequent to the creation of the Darkside RaaS program, CrowdStrike Intelligence\ncontinued to observe some Darkside campaigns almost certainly conducted by CARBON\nSPIDER — in addition to other campaigns operated by affiliates — featuring divergent\ntooling and TTPs. CARBON SPIDER’s campaigns featured the malware discussed above, in\naddition to heavy use of the Cobalt Strike post-exploitation framework.\n\n## Conclusion\n\nCARBON SPIDER’s shift from POS malware to BGH ransomware attacks exemplifies a\nbroader trend in the eCrime landscape. Numerous adversaries that previously relied on\n[banking trojans (e.g., INDRIK SPIDER) or POS compromises (e.g., GRACEFUL SPIDER)](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/)\n[have almost entirely reinvented themselves to focus on ransomware, reflecting how lucrative](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nBGH campaigns are. Until the economics of cybercrime fundamentally change, it is unlikely\nthese adversaries will alter their behavior.\n\n## Indicators of Compromise\n\n**Type** **Value**\n\n_Leo VBS_ `8279ce0eb52a9f5b5ab02322d1bb7cc9cb5b242b7359c3d4d754687069fcb7b8`\n\n\n_JSS_\n_Loader_\n\n_Sekur_\nstager\n\n_Domenus_\n_VBS_\n\n_Domenus_\n_JS_\n\n```\n98fe1d06e4c67a5a5666dd01d11e7342afc6f1c7b007c2ddbfc13779bcc51317\n\n```\n```\nbbd1c244c0861c0048d5eccecbb6dee1a6f57764c7d0028a7cbfd87c93d3166b\n\n```\n```\n00fb044af4c92bd06699aaf1d83c4e6805e96f501f84ad1d2ff0885384aa3ea1\n\n```\n```\n5b7115ab612dcff8e84b2258082a6e7c71b5d52237a4ae8a6642baeb36c2aa48\n\n```\n\n_KillACK_ `4f5eefe93ac2fa5f92c6bd245fff1400f6a61aeee07076c92c66d82f94dc45c3`\n\nTable 1. Exemplar SHA256 hashes of CARBON SPIDER malware\n\n## Explanation of Confidence Rating\n\n**High Confidence: Judgments are based on high-quality information from multiple**\nsources. High confidence in the quality and quantity of source information supporting a\njudgment does not imply that that assessment is an absolute certainty or fact. The\njudgment still has a marginal probability of being inaccurate.\n\n\n-----\n\n**Moderate Confidence: Judgments are based on information that is credibly sourced**\nand plausible, but not of sufficient quantity or corroborated sufficiently to warrant a\nhigher level of confidence. This level of confidence is used to express that judgments\ncarry an increased probability of being incorrect until more information is available or\ncorroborated.\n**Low Confidence: Judgments are made where the credibility of the source is uncertain,**\nthe information is too fragmented or poorly corroborated enough to make solid analytic\ninferences, or the reliability of the source is untested. Further information is needed for\ncorroboration of the information or to fill known intelligence gaps.\n\n**Additional Resources**\n\n_[For more intel about CARBON SPIDER, visit the CrowdStrike Adversary Universe.](https://adversary.crowdstrike.com/en-US/adversary/carbon-spider/)_\n_To find out how to incorporate intelligence on threat actors into your security strategy,_\n_visit the_ _[Falcon X™ Threat Intelligence page.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)_\n_Learn about the powerful, cloud-native CrowdStrike Falcon® platform by visiting the_\n_product webpage._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ to see for yourself how](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_true next-gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-30 - CARBON SPIDER Embraces Big Game Hunting, Part 1.pdf"
    ],
    "report_names": [
        "2021-08-30 - CARBON SPIDER Embraces Big Game Hunting, Part 1.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535723,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1653751214,
    "ts_modification_date": 1653751214,
    "files": {
        "pdf": "https://archive.orkl.eu/da594d7b428d58b16edbf9012f948daed3c24cb8.pdf",
        "text": "https://archive.orkl.eu/da594d7b428d58b16edbf9012f948daed3c24cb8.txt",
        "img": "https://archive.orkl.eu/da594d7b428d58b16edbf9012f948daed3c24cb8.jpg"
    }
}