{
    "id": "ba414b6b-dd99-41fb-9e8a-8e817e77f925",
    "created_at": "2023-01-12T15:06:19.103947Z",
    "updated_at": "2025-03-27T02:17:05.722638Z",
    "deleted_at": null,
    "sha1_hash": "150442e683da9cc50bdb19e7daf555e261e8d79c",
    "title": "2021-02-08 - What Is the Point of These Nation-State Indictments-",
    "authors": "",
    "file_creation_date": "2022-05-28T02:34:47Z",
    "file_modification_date": "2022-05-28T02:34:47Z",
    "file_size": 249376,
    "plain_text": "# What Is the Point of These Nation-State Indictments?\n\n**[lawfareblog.com/what-point-these-nation-state-indictments](https://www.lawfareblog.com/what-point-these-nation-state-indictments)**\n\nFebruary 8, 2021\n\nSkyline of Pittsburgh, Pennsylvania. (Pixabay, https://tinyurl.com/1aki1c38;\nhttps://pixabay.com/service/license/)\n\n[When the U.S. Department of Justice unsealed the indictment in 2020 that charged six](https://www.justice.gov/opa/press-release/file/1328521/download?utm_medium=email&utm_source=govdelivery)\nmilitary intelligence officers in Russia’s GRU with some of the most infamous cyber crimes\non record, it did so with great fanfare. Leading off the 30-minute press conference in\nWashington on Oct. 19, John Demers, the assistant attorney general for national security,\ncalled the crimes “the most disruptive and destructive series of computer attacks ever\n[attributed to a single group.” Demers wasn’t being hyperbolic. NotPetya, the most notorious](https://en.wikipedia.org/wiki/Petya_(malware))\n[attack engineered by this group, known as Sandworm, victimized dozens of companies and](https://en.wikipedia.org/wiki/Sandworm_(hacker_group))\nmillions of people and caused an estimated $10 billion in damages.\n\nThe indictment received mixed reviews. Writing in Lawfare, Harvard law professor (and\nLawfare co-founder) Jack Goldsmith was highly critical of both the document and the timing,\n[noting that the rollout occurred just two weeks before the presidential election. “What is the](https://www.lawfareblog.com/puzzle-gru-indictment)\npoint?” Goldsmith asked before answering his own question. “In a word: attribution.” He\n\n\n-----\n\nnoted that government officials had asserted that the indictment was a warning to would-be\nhackers that the government can gather undeniable evidence proving the attack, and it\nhighlighted the government’s ability to identify the perpetrators.\n\nGoldsmith was not impressed. “This warning and highlight are not news,” he continued, “at\nleast not to the sponsors of the attacks. The United States has for six years been playing up\nits extraordinary intelligence capacity to attribute malicious cyber operations. And for six\nyears the attacks have grown worse.” (He wrote this two months before Russia’s SolarWinds\nhack made even bigger headlines, raising the most serious questions yet about the country’s\ncapacity to sniff out cyber threats.)\n\nGoldsmith couldn’t understand why Demers and the others who took their turns at the\npodium were congratulating themselves. “None of my criticism is meant to minimize the\nhorror of the Russian actions,” he emphasized. “But naming and shaming is not much\naccountability. And trumpeting that fact is puzzling.” Especially right before the presidential\nelection, when the government should be assuring citizens that voting will be safe and\nsecure. Instead, Goldsmith suggested, the recitation of these crimes could well have the\nopposite effect.\n\nMany viewers of the press conference may have come away reassured by the “gotcha”\nspeech they heard from Demers. But Goldsmith had a point. Putting aside the timing of the\nannouncement, it does seem worth asking the deeper question. What are these indictments\naccomplishing? The United States does not have an extradition treaty with Russia. And\nthese guys from the GRU are not exactly going to bring their families to Disney World; if they\ndid, they’d find themselves in handcuffs long before they made it to Space Mountain.\n\nWhen you look at the tangible results of these nation-state indictments, it’s hard to see a lot\nof wins. None of the men whose names and photographs have graced their pages has\nlanded in prison. Or even faced trial. That’s a lot of time and money spent for words in a legal\ndocument.\n\nBut amid all of the doubts, the nation-state hacking indictments have achieved real progress.\nInvestigators have uncovered a great deal of information about this netherworld. They have\nlearned how to build cases, and how to cooperate with their counterparts in far-flung\nlocations. Countries that have seen enough of these crimes have worked together to find\ncommon solutions. Some of these collaborations have surprised even the participants—and\nmight surprise their critics, if they were better known.\n\nThere were similar doubts when the Justice Department rolled out the first of these\nindictments six years ago. The focus then was China, and the alleged crime was economic\nespionage. There had been years of complaints about this sort of thing. But back then, it was\nleft to security companies like Mandiant (now part of FireEye) to present evidence of cyber\n[crimes and attribute them publicly (which Mandiant did in China’s case in 2013). Before the](https://www.fireeye.com/content/dam/fireeye-www/services/pdfs/mandiant-apt1-report.pdf)\nJustice Department decided to pursue an indictment against five members of the People’s\n\n\n-----\n\nLiberation Army (PLA), President Obama s cautious nature seemed to align with the widely\nperceived futility of attempting legal action against agents of the Chinese government. But\n[behind the scenes, under pressure from the many U.S. companies that claimed they’d been](https://www.washingtonpost.com/world/national-security/indictment-of-pla-hackers-is-part-of-broad-us-strategy-to-curb-chinese-cyberspying/2014/05/22/a66cf26a-e1b4-11e3-9743-bb9b59cde7b9_story.html)\nvictimized by Chinese attacks, government officials were confronting their counterparts in\nChina with evidence of crimes. And they were drawing a distinction between spying, which\nthey acknowledged that all nations do, and theft. When the evidence they presented to China\nwas repeatedly rejected out of hand, the administration finally decided to act.\n\nThe [indictment was signed by David Hickton, then-U.S. attorney for the Western District of](https://www.justice.gov/iso/opa/resources/5122014519132358461949.pdf)\nPennsylvania, who spearheaded the initiative. The FBI’s Pittsburgh field office had gathered\nhighly detailed evidence that PLA officers had stolen proprietary information from, among\nothers, U.S. Steel and the nuclear power firm Westinghouse. Hickton took it to a grand jury\nand obtained a sealed indictment. After months of back and forth between Justice and the\nState Department, which opposed legal action against the PLA, the indictment was finally\nunsealed in May 2014.\n\n[At the time, Goldsmith wrote a measured response. He had reservations. Everyone seemed](https://www.lawfareblog.com/why-did-doj-indict-chinese-military-officers)\nto have some. Commentary and news articles alike acknowledged the obvious: There was\nvirtually no chance anyone would ever be tried on these charges. But Goldsmith did not\ndismiss the indictments as political theater. “Until yesterday,” Goldsmith wrote, “the [U.S.\ngovernment] complaints against China’s cyber-snooping were nothing but talk.…But\nyesterday’s step clearly (and predictably, and thus purposefully) offended the Chinese in a\nway that prior talk did not, and to that extent it shows that the [U.S. government] is somewhat\nmore serious about this issue, and might retaliate further regardless of the costs to itself.” A\n[Wall Street Journal editorial was less charitable. “The U.S. should respond with its own cyber](https://www.wsj.com/articles/SB10001424052702304652804579572320276145640)\nbattle plan that attacks Chinese targets and forces China to play defense rather than devote\nall of its resources to hacking U.S. targets.” The editorial concluded: “We can say with\ncertainty that an indictment of five junior PLA hackers will be no deterrent at all.”\n\nAs it turned out, the editorial was wrong. The indictment may not have accomplished a great\ndeal by itself, but it was part of a strategy the Obama administration used to pressure China\nto change course. And change it did. As New York Times reporter David Sanger wrote in his\n[book “The Perfect Weapon,” China replied by insisting that the indictment contained](https://www.penguinrandomhouse.com/books/547683/the-perfect-weapon-by-david-e-sanger/)\n“fabricated facts,” a pretty flimsy response. Then-Attorney General Eric Holder’s rejoinder,\naccording to Sanger, was: “If we fabricated all of this, then come over to Pittsburgh and\nembarrass us by forcing us to put up or shut up, and we’ll put up.” The leverage that the\nadministration needed to press its case was President Xi Jinping’s first state visit to\nWashington in September 2015. Obama’s team was threatening to impose sanctions on\nChina for cyberattacks, including the PLA’s. Xi was determined to avoid anything that would\nblemish his visit. On the eve of his trip, Xi sent an advance delegation to Washington to\nnegotiate. Before China’s president returned home, he and Obama announced an\nagreement that their governments would not, in Obama’s words, “conduct or knowingly\n\n\n-----\n\nsupport cyber-enabled theft of intellectual property, including trade secrets or other\nconfidential business information for commercial advantage.” And two months later, leaders\nof the G-20 [all committed to abide by the same agreement.](https://www.washingtonpost.com/world/national-security/worlds-richest-nations-agree-hacking-for-commercial-benefit-is-off-limits/2015/11/16/40bd0800-8ca9-11e5-acff-673ae92ddd2b_story.html)\n\nSo, was the PLA indictment a game-changer? Not exactly. There was no way to enforce it.\nAnd it didn’t end China’s hacking. Yet the Justice Department continued issuing these\nindictments and expanded the targets to include members of Iran’s Islamic Revolutionary\nGuard Corps, for its alleged role in a series of distributed denial-of-service attacks on U.S.\n[financial institutions, and North Korean computer programmer Park Jin Hyok, for his alleged](https://www.justice.gov/opa/press-release/file/1092091/download)\ninvolvement in a host of attacks, including those on Sony Pictures Entertainment after the\n[studio released “The Interview.” And before the latest GRU indictment, Special Counsel](https://en.wikipedia.org/wiki/The_Interview)\n[Robert Mueller indicted a dozen members of that organization in 2018 for attacks that sought](https://www.justice.gov/file/1080281/download)\nto influence the 2016 presidential election. Some of these indictments were accompanied by\nsanctions, but from the look of things, none has matched the success of the first.\n\nSo why expend the resources? Because these indictments have accomplished things that\nshouldn’t be taken for granted. They may not be dramatic, but they’re foundational.\nAttributing an attack is the first step in holding a nation-state accountable—if nowhere else,\nthen in the court of public opinion. For too long the U.S. government preferred to remain\nmum after a cyberattack, which suggested it was too ashamed to acknowledge the attack,\ntoo baffled to identify the source or too afraid to attribute it. Laying out the evidence shifts the\nblame from victim to perpetrator. It paves the way for sanctions. And it gives the world a\nclose look at the dangers in a legally rigorous form that cannot easily be dismissed as\n“fabricated facts.”\n\nIf anything, this seems more important today than it did in 2014. The past four years have\nbeen a time of “alternative facts.” A large segment of the U.S. population still believes\narguments about last year’s election that were thrown out of scores of courts for lack of\nevidence—any evidence. It’s never been more important to support the rule of law. And if\nthere was ever a time when the U.S. had reason to hold Russia to account—after what\namounts to a four-year pass—this is it. That’s one reason the Sandworm indictment was\nsurprising and noteworthy. Like the first indictment brought against China, this one also came\nfrom the U.S. attorney in Pittsburgh—this time, Republican appointee Scott Brady. It focused\non a broad range of attacks that began in 2015 and extended into 2019. They included some\nin the Western District of Pennsylvania, but a big difference from previous indictments is that\nnearly all of them occurred far from U.S. shores.\n\n[Writing in Slate after the unsealing of the Sandworm indictment, Josephine Wolff was](https://slate.com/technology/2020/10/russia-indictments-gru-hacking-ukraine-france.html)\nsurprised at “the U.S. willingness to use the full force of its own legal system to censure\nRussia for these attacks on non-U.S. targets.” A professor at Tufts University’s Fletcher\nSchool of Law and Diplomacy, Wolff saw this indictment as “a signal not just to Russia but\nalso to the rest of the world that the U.S. government regards online attacks on Ukrainian\n\n\n-----\n\ninfrastructure, South Korean events, French politicians, Georgian media outlets, and U.K.\ngovernment ministries as deserving of the same response as attacks on U.S. companies and\nelections.”\n\nLike the PLA indictment, this one was part of a strategy. It was preceded by a monthslong\neffort to build a coalition of countries to call out Russia. That initiative achieved liftoff in\n[February 2020, when the U.S. and the other “Five Eyes” countries, along with most of the](https://en.wikipedia.org/wiki/Five_Eyes#:~:text=The%20Five%20Eyes%20(FVEY)%20is,joint%20cooperation%20in%20signals%20intelligence.)\nEU, [publicly attributed Russia’s alleged attacks on the country of Georgia. At the time, the](https://www.justsecurity.org/69019/russian-cyber-attacks-against-georgia-public-attributions-and-sovereignty-in-cyberspace/)\neffort was [praised for the show of solidarity, and there were calls for more collective action of](https://www.fifthdomain.com/international/2020/02/21/why-the-us-chose-to-name-and-shame-russia-over-cyberattacks/)\nthis kind. But it was also criticized for the absence of hard evidence—another indication that\nindictments are important. That evidence, by the way, was delivered eight months later in the\nSandworm indictment, which added considerable heft to the package. It wasn’t simply\nanother example of the U.S. acting unilaterally to make some sort of statement. Instead of\none voice, there was a chorus. And a chorus of voices naming and shaming has a greater\nchance of deterring bad behavior than naming and shaming delivered by a soloist.\n\nThere’s another piece of the equation. Some cyber criminals in Eastern Europe work in both\nthe public and private sectors. They are players in organized crime. And their private work\nsometimes bleeds into hacking they do for nation-states—specifically Russia. And\nsometimes their criminal infrastructures are used by both of these enterprises. An early\n[example popped up in an indictment unsealed a week after that 2014 PLA indictment. This](https://www.justice.gov/sites/default/files/opa/legacy/2014/06/02/pittsburgh-indictment.pdf)\none involved a Russian named Evgeniy Bogachev, who in many respects was way ahead of\nhis time. He was operating what was known as the GameOver Zeus Botnet, a global network\nof an estimated 1 million computers infected with malware. Bogachev and his cronies used\nthis vast infrastructure to steal companies’ banking credentials and wire themselves money\nfrom company bank accounts. They employed citizens who were not connected to their gang\nto be money mules tasked (some unwittingly) with laundering the stolen funds. He also\nlaunched ransomware attacks years before they were a runaway hit with criminals. At the\ntime of the indictment, Bogachev and his confederates were believed to have stolen more\nthan $100 million.\n\nHe’s never been caught. He doesn’t seem to stray from Russia. His victims are mostly\ncompanies from the West. And he’s [found ways to spy for his country, which undoubtedly](https://www.wired.com/2017/03/russian-hacker-spy-botnet/)\nadds to his patina of untouchability. But if Bogachev was beyond the reach of the law, his\ncriminal infrastructure was not. The triumph of this case wasn’t that an indictment was\n[unsealed. It was that law enforcement was able to take down his giant botnet. How? Just as](https://www.wired.com/2017/03/russian-hacker-spy-botnet/)\nthe criminals were able to wreak havoc through an international confederation, law\n[enforcement succeeded by marshalling their own international gang. The press release](https://www.justice.gov/usao-wdpa/pr/us-leads-multi-national-action-against-gameover-zeus-botnet-and-cryptolocker-ransomware)\ncelebrating the takedown credited the work of officers in no fewer than a dozen countries.\n\n[Paul Rosenzweig wrote about the case in Lawfare. Rosenzweig was impressed by the broad](https://www.lawfareblog.com/gameover-zeuscryptolocker-indictment)\ncooperation—most surprisingly Ukraine’s. Authorities there seized servers in contested\nterritory: “a remarkable commitment from an unstable government,” Rosenzweig wrote. “As\nwith the Chinese indictment [from the previous week] this case was brought in Pittsburgh ”\n\n\n-----\n\nhe noted, which is an odd location to choose. Apparently, the office is developing an\nexpertise in cyber crime.” He concluded by complimenting “an effective use of law\nenforcement” and an “aggressive use of criminal law” that together signaled “that the U.S. is\nwilling to take steps in defending its networks that it has heretofore been a bit reluctant to\ntake.”\n\nEqually remarkable, in 2016 the U.S. attorney’s office in Pittsburgh obtained a sealed\n[indictment that alleged a Bulgarian man was part of a gang that bore some resemblance to](https://www.documentcloud.org/documents/3237822-Avalanche-Indictment-Krasimir-Nikolov.html)\nBogachev’s. Its victims were small- to medium-size businesses in the U.S. and Western\nEurope. The Bulgarian was arrested because he was the only one of the group who lived in\na country that had an extradition treaty with the United States, and he was promptly sent to\nPittsburgh. One of the men was based in Ukraine, where he ran a “bulletproof” hosting\n[service called Avalanche, which registered malicious domains for cyber criminals and hosted](https://krebsonsecurity.com/tag/avalanche/)\ntheir executable malware files on its servers. The investigation of this criminal enterprise\n[continued until 2019, when the U.S. attorney’s office unsealed an indictment that charged 10](https://www.justice.gov/opa/press-release/file/1163066/download)\n[men with a conspiracy to steal funds using Avalanche and GozNym malware. None of the](https://www.justice.gov/opa/press-release/file/1163066/download)\nmen worked directly for a nation-state (as far as could be learned), but five of them were in\nRussia. The others were in Ukraine, Georgia and Moldova. It looked like just another nameand-shame indictment. That familiar question surfaced again: What was the point?\n\nBut the prosecutors and FBI agents in Pittsburgh were not willing to let it go. They flew to\n[The Hague to meet with their counterparts from countries where victim companies were](https://www.justice.gov/usao-wdpa/pr/goznym-cyber-criminal-network-operating-out-europe-targeting-american-entities)\nlocated and where the gang members were based (except Russia). And they agreed to work\ntogether to bring as many of the criminals to justice as they could—no matter where that was\nand no matter who received credit. Germany was a major player. Europol and Eurojust were\ndeeply involved. The five in Russia were beyond their grasp. But much to the surprise of the\n[many naysayers, the others were not. Three, including the ringleader, were arrested in](https://www.justice.gov/opa/press-release/file/1163066/download)\nGeorgia. One of the FBI agents in Pittsburgh, who helped work the case, testified during the\n[Georgian trial by video linkup. All three were convicted, and the ringleader was sentenced to](https://www.justice.gov/usao-wdpa/press-release/file/1228291/download)\nseven years in prison. The Avalanche administrator was arrested in Ukraine. He escaped,\n[only to be rearrested. Then a judge inexplicably released him pending trial, and he](https://www.bleepingcomputer.com/news/security/judge-releases-avalanche-network-leader-despite-police-shootout/)\n[disappeared. The Bulgarian pleaded guilty in Pittsburgh and was sentenced to time served](https://www.justice.gov/opa/pr/goznym-cyber-criminal-network-operating-out-europe-targeting-american-entities-dismantled)\n(about three years).\n\nDid these cases transform the landscape? Hardly. There’s no shortage of cyber criminals in\nEastern Europe. The downfall of Avalanche and the conviction of four men didn’t put a dent\nin their ranks. But it was an important step. The Sandworm indictment in October that\nfocused on global attacks was impressive. But putting in the time and effort to develop\nevidence and relationships with cops and prosecutors far away—and trusting that they would\nsucceed, while knowing that they would get the credit if they did—was no small thing. It’s\nhow you build teams. It’s how you support the rule of law in places that have less experience\nwith it.\n\n\n-----\n\nMaybe it s time to stop asking that question about indictments. Here s the bottom line. If\nthere’s ever going to be a real chance in the legal realm to make a dent on cyberattacks—\nwhether the perpetrators are nation-states, organized gangs or individuals—the good guys\nwill have to show they know how to collaborate at least as well as the bad guys. Some of\nthem seem to have gotten that message.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-08 - What Is the Point of These Nation-State Indictments-.pdf"
    ],
    "report_names": [
        "2021-02-08 - What Is the Point of These Nation-State Indictments-.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535979,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653705287,
    "ts_modification_date": 1653705287,
    "files": {
        "pdf": "https://archive.orkl.eu/150442e683da9cc50bdb19e7daf555e261e8d79c.pdf",
        "text": "https://archive.orkl.eu/150442e683da9cc50bdb19e7daf555e261e8d79c.txt",
        "img": "https://archive.orkl.eu/150442e683da9cc50bdb19e7daf555e261e8d79c.jpg"
    }
}