{
    "id": "ba729b0d-0e0f-4863-b9f7-03b954e117c0",
    "created_at": "2023-01-12T15:05:52.404745Z",
    "updated_at": "2025-03-27T02:05:50.062216Z",
    "deleted_at": null,
    "sha1_hash": "69e2b8117825deccad0bdde3c8531428d8000ef2",
    "title": "2021-10-05 - Python ransomware script targets ESXi server for encryption",
    "authors": "",
    "file_creation_date": "2022-05-27T21:51:58Z",
    "file_modification_date": "2022-05-27T21:51:58Z",
    "file_size": 1261844,
    "plain_text": "# Python ransomware script targets ESXi server for encryption\n\n**[news.sophos.com/en-us/2021/10/05/python-ransomware-script-targets-esxi-server-for-encryption/](https://news.sophos.com/en-us/2021/10/05/python-ransomware-script-targets-esxi-server-for-encryption/)**\n\nAndrew Brandt October 5, 2021\n\nA recently-concluded investigation into a ransomware attack revealed that the attackers\nexecuted a custom Python script on the target’s virtual machine hypervisor to encrypt all the\nvirtual disks, taking the organization’s VMs offline.\n\nIn what was one of the quickest attacks Sophos has investigated, from the time of the initial\ncompromise until the deployment of the ransomware script, the attackers only spent just over\nthree hours on the target’s network before encrypting the virtual disks in a VMware ESXi\nserver.\n\nThe Python script embeds the text of the ransom note.\n\n\n-----\n\nThe attackers initially accessed their foothold by logging in to a TeamViewer account (one\nwhich didn’t have multi-factor authentication set up), running in the background on a\ncomputer that belongs to a user with Domain Administrator credentials in the target’s\nnetwork. The attackers logged on at 30 minutes past midnight in the target organization’s\ntime zone, and ten minutes later downloaded and ran a tool called Advanced IP Scanner to\nidentify targets on the network.\n\nJust before 2 am, the attackers downloaded an SSH client called Bitvise, and used it to log\ninto a VMware ESXi server they identified using Advanced IP Scanner. ESXi servers have a\nbuilt-in SSH service called the ESXi Shell that administrators can enable, but is normally\ndisabled by default.\n\nThis organization’s IT staff was accustomed to using the ESXi Shell to manage the server,\nand had enabled and disabled the shell multiple times in the month prior to the attack.\nHowever, the last time they enabled the shell, they failed to disable it afterwards. The\ncriminals took advantage of this fortuitous situation when they found the shell was active.\n\n## Python ransomware\n\nThree hours after the attackers scanned the network, they used their credentials to log into\nthe ESXi Shell, and copied a file named fcker.py to the ESXi datastore, which houses the\nvirtual disk images used by the VMs that run on the hypervisor.\n\nThe Python script uses the vim-cmd command functions of the ESXi Shell to produce a list\nof the names of all virtual machines installed on the server, then shuts them all down.\nOne by one, the attackers executed the Python script, passing the path to datastore disk\nvolumes as an argument to the script. Each individual volume contained the virtual disk and\nVM settings files for multiple virtual machines.\n\nThanks to some solid forensics work, the Rapid Response team recovered a copy of the\nPython script, even though the attackers appeared to have overwritten it with other data\nbefore deleting the file.\n\nOnly 6kb long, the small size of the script belies its abilities. The script contains variables that\nthe attacker can configure with multiple encryption keys, email addresses, and where they\ncan customize the file suffix that gets appended to encrypted files\n\n\n-----\n\nThe script\n\nembeds the file suffix it appends to encrypted files (ext), and email addresses (mail, mail2)\nto be used to contact the attacker for payment of the ransom as variables.\nInitially, the script “walks” the filesystem of a datastore and creates a directory map of the\ndrive, and inventories the names of every virtual machine on the hypervisor, writing them to a\nfile called vms.txt. It then executes the ESXi Shell command vim-cmd vmsvc/power.off,\none time for each VM, passing the VM names to the command as a variable, one at a time.\nOnly when the VMs have powered off will the script begin encrypting the datastore volumes.\n\nUsing a single instruction for each file it encrypts, the script invokes the open-source tool\nopenssl to encrypt the files with the following command:\n```\nopenssl rsautil -encrypt -inkey pubkey.txt -pubin -out [filename].txt\n\n```\nThe file encryption function within the Python script\nThe script then overwrites the contents of the original file with just the word fuck then deletes\nthe original file. Finally, it deletes the files that contain the directory listings, the names of the\nVMs, and itself by overwriting those files before deleting them.\n\n## Encryption keys generated on-the-fly\n\nOne thing that we noticed while walking through the code was the presence of multiple,\nhardcoded encryption keys, as well as a routine for generating even more encryption key\npairs. Normally, an attacker would only need to embed the “public key” that the attacker\ngenerated on their own machine and would be used to encrypt files on the targeted\ncomputer(s). But this ransomware appears to create a unique key every time it is run.\n\n\n-----\n\nEmbedded\n\npublic keys in the Python ransomware\nSo what’s going on with that?\n\nApparently, every time the malware is executed – and it appears the attackers executed the\nscript once for each ESXi datastore they wanted to encrypt – the ransomware generates a\nunique key pair that will be used for encrypting files during that particular execution.In the\ncase of the attack we investigated, there were three datastores the attackers targeted with\nindividual executions of the script, so the script created three unique key pairs, one for each\ndatastore.\n\nFor each execution targeting a different ESXi datastore (greyed out paths) the script\ngenerated a unique encryption key\nThe script has no ability to transmit these keys anywhere, and there’s no way for the attacker\nto predict what the keys will be, so the script has to leave behind a copy of the secret key\n(the key the attacker would need in order to decrypt the files) on the filesystem of the\ntargeted computer. But it would be a gigantic mistake to just leave that key lying around\n\n\n-----\n\n(whoever possesses the secret key could, theoretically, use it to decrypt everything without\nhaving to pay a ransom), so the script writes out a copy of that secret key, and then encrypts\nthe secret key using the embedded, hardcoded public key.\n\nThe script runs a routine that lists all the files in the path that’s provided to the script during\nexecution. For each file, the script generates a unique, 32-byte random code it calls the\n**aeskey, and then encrypts the file using the aeskey as a salt into the /tmp path.**\n\nFinally, it prepends the aeskey value to the encrypted file and appends a new file suffix to the\nname, overwrites the contents of the original file with the word fuck then deletes the original\nfile, and moves the encrypted version from /tmp to the datastore location where the original\nfile was stored.\n\n## Hypervisors are valuable targets\n\nMalware that runs under a Linux-like operating system such as ESXi uses is still relatively\nuncommon, but it is even less common for IT staff to install endpoint protection on servers\nlike these. Hypervisors in general are often quite attractive targets for this kind of attack,\nsince the VMs they host may run business-critical services or functions.\n\n\n-----\n\nESXi management tools can enable or disable the ESXi Shell either from within the tool, or\nlocally on the console connected to the server. The shell defaults to “Stopped.”\nAdministrators who operate ESXi or other hypervisors on their networks should follow\nsecurity best practices, avoiding password reuse, and using complex, difficult to brute-force\npasswords of adequate length. Wherever possible, enable the use of multi-factor\nauthentication and enforce the use of MFA for accounts with high permissions, such as\ndomain administrators.\n\nIn the case of ESXi, use of the ESXi Shell is something that can be toggled on or off from\neither a physical console at the machine itself, or through the normal management tools\nprovided by VMware. Administrators should only allow the Shell to be active during use by\nstaff, and should disable it as soon as maintenance (such as the installation of patches) is\ncomplete.\n\n[VMware has also published a list of best practices for administrators of their ESXi](https://docs.vmware.com/en/VMware-vSphere/7.0/com.vmware.vsphere.security.doc/GUID-E9B71B85-FBA3-447C-8A60-DEE2AE1A405A.html)\nhypervisors on how to secure them and limit the attack surface on the hypervisor itself.\n\nPython scripts of this type are detected by Sophos endpoint products as Troj/Ransom-GJR.\n\n\n-----\n\n## Acknowledgments\n\nSophosLabs wishes to acknowledge the work of Rajesh Nataraj, Andrew O’Donnell, and\nMauricio Valdivieso for their assistance\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-05 - Python ransomware script targets ESXi server for encryption.pdf"
    ],
    "report_names": [
        "2021-10-05 - Python ransomware script targets ESXi server for encryption.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535952,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653688318,
    "ts_modification_date": 1653688318,
    "files": {
        "pdf": "https://archive.orkl.eu/69e2b8117825deccad0bdde3c8531428d8000ef2.pdf",
        "text": "https://archive.orkl.eu/69e2b8117825deccad0bdde3c8531428d8000ef2.txt",
        "img": "https://archive.orkl.eu/69e2b8117825deccad0bdde3c8531428d8000ef2.jpg"
    }
}