{
    "id": "bb1d60f4-5938-4da7-b9c3-8e9c22d7684e",
    "created_at": "2023-01-12T15:00:10.728672Z",
    "updated_at": "2025-03-27T02:13:48.926917Z",
    "deleted_at": null,
    "sha1_hash": "7ae0675cd131bcebca239518b184c36248494ef7",
    "title": "2019-02-11 - How the Silence Downloader Has Evolved Over Time",
    "authors": "",
    "file_creation_date": "2022-05-28T17:32:38Z",
    "file_modification_date": "2022-05-28T17:32:38Z",
    "file_size": 1017054,
    "plain_text": "# How the Silence Downloader Has Evolved Over Time\n\n**[norfolkinfosec.com/how-the-silence-downloader-has-evolved-over-time/](https://norfolkinfosec.com/how-the-silence-downloader-has-evolved-over-time/)**\n\nnorfolk February 11, 2019\n\nIn a [previous post this blog briefly compared two versions of the Silence group’s proxy](https://norfolkinfosec.com/some-notes-on-the-silence-proxy/)\nmalware, a post-intrusion tool used to relay network traffic between a C2 endpoint and a\nnon-internet facing device. This post examines three versions of the group’s downloader and\ndocuments how it has changed over the last eighteen months. While some characteristics\nhave persisted, several notable functions have been removed, added, or modified in newer\nversions of this tool.\n\nTracking such changes helps analysts determine whether or not a newly discovered sample\n(on the network or in an online repository) is truly new; in the event that the sample is older\nand forensic data is missing, it can help approximate when the sample might have been\ndeployed.\n**October 2017**\n\nMD5: 404D69C8B74D375522B9AFE90072A1F4\n\nSHA1: 197d8bc245ba8b67ebf9a108d6707011fe8158f9\n\nSHA256: f24b160e9e9d02b8e31524b8a0b30e7cdc66dd085e24e4c58240e4c4b6ec0ac2\n\n[This Silence downloader was first publicly described at a high level in a Kaspersky Securelist](https://securelist.com/the-silence/83009/)\npost in October 2017. The downloader calls out to a C2, and the response allows it to:\n\n– Create an auto-start persistence entry in the registry (HKCU CurrentVersion\\Run) for a\ncopy of itself (“fal”)\n\n– Obtain an additional payload, save this payload to disk, and execute it (“|http”)\n\n– Delete itself (“DEL”)\n\nAs this malware serves as a simple, early-stage tool, these tasks (and their underlying\nmechanisms) have gone largely unexamined in the public space; however, there are several\ndistinct characteristics regarding how the earlier versions of the malware accomplish this\nworkflow. The figure below shows the malware’s logic flow prior to taking one of the actions\nabove:\n\n\n-----\n\nOctober 2017 Silence downloader logic flow\nRather than comparing the bytes (or their corresponding strings) as a whole, the malware\nperforms a byte-by-byte check of the action, jumping over the remainder of the comparisons\nshould a byte not match. If no task is identified, the malware sleeps and attempts to retrieve\na task from the C2 a second time. The figure below shows the functions called following a\nsuccessful parsing of the “|http” or “DEL” actions.\n\n**DEL and |http functions from the October 2017 Silence downloader**\n\n**November 2018 Sample**\n\n[Late last month, Reaqta published research that included details of a late-2018 version of the](https://reaqta.com/2019/01/silence-group-targeting-russian-banks/)\nSilence downloader. At a high level, the downloader includes a key addition: the downloader\nexecutes a series of command-line queries to obtain information about the infected device.\nThis information is stored locally in the user’s ProgramData folder in a file named\n“INFOCONTENT.TXT” and uploaded to the C2 server. Interestingly, a handful of the\ncommand-line commands are initially obfuscated, though several others remain in clear text.\n\n\n-----\n\n**Command-line information collection**\n\nWhile this is a key addition on its own, the author(s) of the tool also made two notable\nchanges to the tasking workflow:\n\n– The “fal” action used to create persistence has been removed. The tool now takes this step\nwithout prompting.\n\n– The “|http” action still exists; however, it is no longer initiated by a byte-by-byte comparison.\nInstead, the authors opted to use the StrStrA function to determine if “http” is in the task\nstring.\n\nCuriously, the authors did not change the “DEL” task initiation to align with the change to\n“|http.” It still uses the same single-byte comparison and jump. It’s possible that the authors\nwere either testing the new mechanism first or hadn’t yet had time to change both functions.\n\n**November 2018 sample. Left: “DEL” single-letter comparisons remain intact. Right:**\n**“|http” comparison replaced with StrStrA call.**\nAlthough the mechanism for calling the persistence routines changed between versions, the\nroutines themselves are largely consistent:\n\n\n-----\n\nLeft: 2017 persistence routine. Right: November 2018 persistence routine.\n**Late 2018/Early 2019 Samples**\n\nMD5: e2e1035f382c397d64303e345876a9db\n\nSHA1: c572ba3fcd991fd29919d171b8445dbb5277a51d\n\nSHA256: 4ea01c831c24b70b75bcdf9b33ad9c69e097cbadafd30599555a43a1f412455d\n\nC2: 185.244.131[.]68\n\nPivoting through VirusTotal using the string “%s\\%08x%08x.tmp” from the previous sample\nleads to a new set of updated downloaders from this threat actor. These more recent\nsamples contain significant changes, including:\n\n– A revised mechanism for establishing the registry-based persistence mechanism\n\n– An alternate persistence mechanism using depending on the detected operating system\n\n– An antivirus check to facilitate this check\n\n– The ability to execute a payload OR register a DLL\n\nThe screenshot below depicts the version check alongside the AV check. Notably, the\nauthors implemented an AV check that calls CreateToolhelp32Snapshot, Process32First,\nand Process32 next for each string, rather than calling each of these up front and then\nperforming the string comparison.\n\n\n-----\n\n**AV and Operating System Checks**\n\nDepending on the results of the OS detection and the AV check, the malware can create a\nregistry entry for persistence or create a scheduled task. Unlike the previous versions, the\nregistry entry is not created through API calls; instead, the malware decodes and executes a\ncommand line string:\n\n“/C REG ADD “HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run” /v “Windows\nSystem DLL”\n\nAlternatively, in this particular sample, the malware can create a scheduled task named “Avi\nCapture.”\n\nFinally, this version features an updated version of the C2 mechanism. The malware now\nuses a different set of APIs (Winsock) to contact the C2 and receive a response. The\ndownloader can both register a DLL or launch an executable file in this version. True to the\nprevious two versions, this workflow is initiated by a byte-by-byte check for “MZ” (a PE\nheader) in the file.\n\n**Workflow for DLL vs EXE execution in Late 2018/Early 2019 Silence Downloader**\n**Concluding Thoughts**\n\n\n-----\n\nTracking how a malware family changes over time helps categorize how new a newly\nuploaded or discovered sample really is. While compilation timestamps can be spoofed, a\nthreat actor is unlikely to revert to a previous version of a tool, particularly if it contains errors\nor lacks required features.\n\nIn the Silence downloader, it is apparent that the threat actors have taken an interest in\ncollecting a larger set of initial information (including operating system data). In addition, the\nthreat actors have also taken several measures to evade or bypass AV detection, including\nbasic process checking and string obfuscation.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-11 - How the Silence Downloader Has Evolved Over Time.pdf"
    ],
    "report_names": [
        "2019-02-11 - How the Silence Downloader Has Evolved Over Time.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e8ebcbda-e8df-4a38-a2a6-63b2608ee6f3",
            "created_at": "2023-01-06T13:46:38.88051Z",
            "updated_at": "2025-03-27T02:00:02.94193Z",
            "deleted_at": null,
            "main_name": "Silence group",
            "aliases": [
                "WHISPER SPIDER"
            ],
            "source_name": "MISPGALAXY:Silence group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535610,
    "ts_updated_at": 1743041628,
    "ts_creation_date": 1653759158,
    "ts_modification_date": 1653759158,
    "files": {
        "pdf": "https://archive.orkl.eu/7ae0675cd131bcebca239518b184c36248494ef7.pdf",
        "text": "https://archive.orkl.eu/7ae0675cd131bcebca239518b184c36248494ef7.txt",
        "img": "https://archive.orkl.eu/7ae0675cd131bcebca239518b184c36248494ef7.jpg"
    }
}