{
    "id": "bb25e26e-568d-4d9b-8a61-05e3b639d880",
    "created_at": "2023-01-12T15:09:29.422079Z",
    "updated_at": "2025-03-27T02:05:59.307491Z",
    "deleted_at": null,
    "sha1_hash": "bb4ad61995dbe34e441e2ac3cea2160bdba2a214",
    "title": "2018-08-01 - Inside Look at Emotet's Global Victims and Malspam Qakbot Payloads",
    "authors": "",
    "file_creation_date": "2022-05-28T15:18:41Z",
    "file_modification_date": "2022-05-28T15:18:41Z",
    "file_size": 96798,
    "plain_text": "# Inside Look at Emotet's Global Victims and Malspam Qakbot Payloads\n\n**blog.kryptoslogic.com/malware/2018/08/01/emotet.html**\n\n[Authored by: Kryptos Logic Vantage Team on Wednesday, August 1, 2018](https://twitter.com/kryptoslogic)\n\nTags: [emotet](https://www.kryptoslogic.com/blog/tag/emotet)\nThe Emotet botnet reputation precedes it; historically aggressive and malicious, today it has\nevolved and incorporated a number of advancements to create a more resilient botnet\ndelivery system, nearly immune from takedown. Recently, [US CERT reported that Emotet](https://www.us-cert.gov/ncas/alerts/TA18-201A)\nincidents (and its subsequent payload droppers) are affecting state, local, tribal, and\nterritorial (SLTT) governments at up to 1 million dollars per incident.\n\nWe have captured a global view of many of the active infections within the latest Emotet\nbotnet. At the time of this writing, we believe this to be the only publicly available coverage of\nactively infected Emotet peers.\n\n[In an earlier post, we announced Telltale and provided the WannaCry data set for](https://blog.kryptoslogic.com/malware/2018/04/09/wannacry-post.html)\norganizations to determine if they are still affected by residual ransomware risks. Today, we\nwill further enrich this data set by adding Emotet data promoted from the Vantage Breach\n[Intelligence Service to our free version of the offering, Telltale. Organizations looking to](https://telltale.kryptoslogic.com/)\nreduce their risk exposure to Emotet and or WannaCry should consider signing up for either\nof these breach notification offerings.\n\nThe remainder of this post will:\n\nProvide a high level view of the Emotet botnet distribution and some of its metrics;\nExamine the latest botnet trends and deep dive into a recent Qbot sample.\n\n## Emotet by the Numbers\n\nMost telemetry available today on Emotet has been likely sourced from vendor-specific AV or\nspam infection attempts (e.g. blocked infections). However, to be clear, the following visibility\nis sourced from the Emotet peers which are actively infected and participating in the botnet\n\n\n-----\n\nthat is, those which have not been blocked.\n\nOverall we can compute a partial view of at least one of the botnets:\n\n70,000+ unique IPs identified\n4000+ unique ASNs communicated\n5000+ unique organizations and telecoms affected\n170 countries affected\n\nIt would be fair to estimate the botnet is at any given point between 50,000 to 150,000\ninfected nodes. Looking at the aggregate of the information we can see how that breaks\ndown by country.\n\n**Total Hits by count.**\n\nWhile the science of evaluating the total infection hits for any given malware strain is out of\nscope for this post, what we can interpret from our source data and the traffic patterns\nagainst any particular IP address is that many organizations infected by Emotet have more\nthan one infection, which was likely triggered by a pivoting component like EternalBlue (you\nknow the same EternalBlue from NotPetya and WannaCry). We have observed several\norganizations (hospitals, research centers, etc) exhibit signs of dangerously high levels of\nEmotet infection volume. Clearly, the United States and South Korea have tells of high\nfrequency activity from some certain organizations which increase its numbers. While this is\ncertainly concerning, it is more prudent to examine the unique IP addresses graph below to\nget a different perspective not skewed by some of the noise of certain infected organizations.\n\n**Top 12 countries seen by Unique IP.**\n\nAgain we see a high number of United States coverage in the Unique IPs visualization. A\nspecial note should be given to India in that India typically has a high DHCP churn, resulting\nin higher than normal level of unique IPs for any given period.\n\nFinally we can observe a full global map distribution which shows us no real surprises other\nthan Emotet is widespread.\n\n**A global map of Emotet's reach, distributed by Source IP.**\n\n## Malspam Payload Show Signs of Evolving Botnet Trends\n\n\n-----\n\nWhile Qakbot is just one of many things that can be dropped we learn very quickly why the\nEmotet network introduces a significant level of risk to organizations. The latest Emotet\ndesign utilizes a new blueprint in the evolution of modern malware and botnets. Because\nEmotet’s Command and Control (C&C) systems work through a complex decentralized\nnetwork of infected hosts and proxy peers, it could prove a difficult take down task for law\nenforcement considering there are few single points of failure and would require multiple\nlevels of cooperation in near perfect harmony.\n\nTraditional botnets heavily depended on Peer-to-Peer for C2 communication and fallback,\nthis allowed researchers to peak into the activity of the botnet and observe victim machines,\nnewer/more resilient botnets seem to be moving away from this approach. Another way\nresearchers observed victim machines was to reverse engineer the domain generation\nalgorithm and register their own “sinkholes”. As botnets move away from DGA this becomes\nunfeasible. Emotet and other botnets such as TrickBot pose a unique challenge to\nresearchers and companies in the field.\n\nHowever, our research demonstrates that it is not impossible to gain insight into these\nevolved botnets. IPs tend to be harder to blacklist than domain C2s so the traditional “IOC”\napproach is becoming less and less effective, On the other hand, you have various payloads\nall with their own techniques. So while a good Predict, Prevent, and Detect agent like Tactics\n(or perhaps EDRs) can help, it still requires analysts to steer.\n\nConsequently, this also makes it difficult to block and track for most organizations, as IP\naddresses are constantly shifting and changing. This makes detecting the traffic a bit of a\nlong term whack-a-mole game.\n\nIronically, Emotet drops a variety of payloads (like Qakbot) which are in fact separate\nbotnets. Looking at a quite recent Malspam campaign we picked up a interesting Qakbot\nwhich in itself is another botnet sharing many of the same design resilience as Emotet, e.g.,\nproxy peers and no DGA.\n\n**Qakbot graph.**\n\nA thorough review of Qakbot, ranging from protocol version 10 to 12, was written up by Intel\nSecurity in Virus Bulletin. Current Qakbot samples (version 322.368) are at version 15 of the\nprotocol and behave similarly to version 12, with some exceptions:\n\nDGA mechanism appears to be completely gone\nThe 1024-bit RSA key used for encrypting keys and verifying signatures was removed,\nwith only the same 2048-bit key remaining\nThere are 31 possible C&C commands, upwards from the 25 described before\n\n\n-----\n\nWe found signs of Qakbot disabling HTTP2 in Firefox by modifying the profile.js configuration\nfile, where we used to see banking malware disabling SPDY. HTTP2 is the successor to\nSPDY so disabling these leaves only HTTP1, which is much easier to intercept. Typically this\nis done so that the malware can hook a specific function in the browser: in the case of\nFirefox they normally hook `nspr4!PR.Read .`\n\nLike Emotet, Qakbot contains signs of a UPnP library, removal of the DGA function, and\nreliance on decentralized peers through a proxy. To this end we see a malware which has\n\nBanking web injects;\nIts own botnet communication system outside of Emotet;\nStolen certificates and heavy use of Powershell and other defense evasion techniques.\n\n## Conclusion\n\nEmotet introduces significant challenges to the cybersecurity threat landscape which are\nvery concerning. In the past, botnets which may have been too large or introduced significant\nrisks could be taken down. If they were not taken down, at minimum defenders could\ncoordinate on specific protocols and IP addresses or certain security controls to counteract\nthe effectiveness and potential exposure of the botnet. However the resiliency introduced in\nthe latest trends of botnets such as Emotet, Dridex, and Qakbot suggest that takedowns will\nbe far more difficult, or infeasible and consequently operators will have quite a bit of difficulty\ncounteracting against a perpetual high frequency whack-a-mole IP address blacklisting\ngame.\n\nThe reality is that as Emotet continues to grow, it will increase public and private risk\nexposure to digital attacks which can be leveraged by staging attacks on top of these difficult\nto stop botnets. Whether it is a ransomware, a critical infrastructure attack, or the next\nEternalBlue, there is not much that can currently slow these attacks down in most\norganizational threat models. These types of new resilient botnets are a paradigm shift for\nattackers and have shown us the dangers of attack platforms which can undermine and\ncircumvent security controls at scale.\n\nWe’re pleased to be able to share the breach intelligence data we have gathered for free via\n[our Victim Notification service Telltale. You can sign-up and check for any observed activity](https://telltale.kryptoslogic.com/)\ncoming from your network for free. In the future we’ll be adding more and more malware\nfamilies to Telltale.\n\n## IOCs:\n\nA list of binaries signed by the above detailed malicious code signing certificate are available\n[here, a list of webinject URLs are available here and finally a list of webinject paths are](https://blog.kryptoslogic.com/malware/2018/08/01/files/iocs.txt)\n[available here.](https://blog.kryptoslogic.com/malware/2018/08/01/files/paths.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-08-01 - Inside Look at Emotet's Global Victims and Malspam Qakbot Payloads.pdf"
    ],
    "report_names": [
        "2018-08-01 - Inside Look at Emotet's Global Victims and Malspam Qakbot Payloads.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536169,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653751121,
    "ts_modification_date": 1653751121,
    "files": {
        "pdf": "https://archive.orkl.eu/bb4ad61995dbe34e441e2ac3cea2160bdba2a214.pdf",
        "text": "https://archive.orkl.eu/bb4ad61995dbe34e441e2ac3cea2160bdba2a214.txt",
        "img": "https://archive.orkl.eu/bb4ad61995dbe34e441e2ac3cea2160bdba2a214.jpg"
    }
}