{
    "id": "bb68074b-1587-4d9c-b01a-978698cd8bd0",
    "created_at": "2023-01-12T15:08:15.958389Z",
    "updated_at": "2025-03-27T02:12:03.873358Z",
    "deleted_at": null,
    "sha1_hash": "a19214e7ee5ea1ed35cde86723e82563f31f4e36",
    "title": "2021-03-26 - Imperva Observes Hive of Activity Following Hafnium Microsoft Exchange Disclosures",
    "authors": "",
    "file_creation_date": "2022-05-28T03:37:22Z",
    "file_modification_date": "2022-05-28T03:37:22Z",
    "file_size": 869824,
    "plain_text": "# Imperva Observes Hive of Activity Following Hafnium Microsoft Exchange Disclosures\n\n**[imperva.com/blog/imperva-observes-hive-of-activity-following-hafnium-microsoft-exchange-disclosures/](https://www.imperva.com/blog/imperva-observes-hive-of-activity-following-hafnium-microsoft-exchange-disclosures/)**\n\nMarch 26, 2021\n\n[Home >](https://www.imperva.com/) [Blog > Imperva Observes Hive of Activity Following Hafnium Microsoft Exchange](https://www.imperva.com/blog/)\nDisclosures\n\n[Application Security](https://www.imperva.com/blog/?category=application-security)\n\n## Introduction\n\n[On 2 March 2021, Microsoft and](https://msrc-blog.microsoft.com/2021/03/02/multiple-security-updates-released-for-exchange-server/) [Veloxity produced disclosures outlining the discovery of](https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/)\nfour zero day vulnerabilities affecting multiple versions of Microsoft Exchange Server. Each\nof the vulnerabilities have been attributed a severity rating from high to critical, however the\nmost impactful statement from both Microsoft and Veloxity was that these vulnerabilities\nformed an attack chain which was being actively exploited in the wild.\n\nSince the publication of these disclosures, details have emerged regarding the observed\nsource of the exploitation of these vulnerabilities. The attacks are being widely attributed to\n[the state-sponsored group dubbed Hafnium, alleged to be operating out of China.](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\n\nThe most notable of the new CVEs, [CVE-2021-26855, is a SSRF vulnerability in Microsoft](https://nvd.nist.gov/vuln/detail/CVE-2021-26855)\nExchange which allows an attacker to induce the server into performing “unintended\nactions” through the use of a series of specially crafted POST requests. The attacker can\nleverage this vulnerability to exploit the other CVEs to perform malicious actions, such as\ndump private email, or even achieve remote code execution.\n\n\n-----\n\nImperva has put dedicated security rules in place to protect our customers in a direct\nresponse to the initial disclosures. Imperva has also performed analysis on the attempted\nexploitation of these CVEs and we have produced the following insights.\n\n## Observations and Statistics\n\nSince the 2 March disclosures, Imperva has observed over 44k scanning and exploitation\nattempt sessions in the wild from over 1,600 unique source IPs, related to the Microsoft\n[Exchange CVE-2021-26855 SSRF. From this data, we have been able to identify the most](https://nvd.nist.gov/vuln/detail/CVE-2021-26855)\ntargeted industries and countries which have been affected by the vulnerability in the\naftermath of the disclosures.\n\n## Targeted Industries\n\nOne of the key observations we have made is that this vulnerability has impacted almost\nevery category of industry, this observation is explained by how ubiquitous the use of\nMicrosoft Exchange is across all sectors. According to our data, the Computing & IT sector\nwas the most targeted industry, with 21% of all targeted sites belonging to this category.\nNext was Financial Services with 18%, and Telecoms and ISPs completed the top 3 with\n10.5%. Below we show the breakdown of scanning and exploitation attempts against\nvarious industries.\n\n## Targeted Countries\n\nImperva observed both scanning and exploitation attempts against sites worldwide, with the\nUS being the most targeted country, with the UK and Singapore a distant second and third,\nrespectively.\n\n\n-----\n\n## Source Countries\n\nImperva observed that since the disclosures, relatively few scanning and exploitation\nattempts have been made from Chinese sources. This could be because exploitation, and\nto a greater extent, scanning has shifted to the wider public. It may also be because the\nattackers are using proxies to carry out the attacks. The chart below shows the top\nattacking countries by session count observed by Imperva analysts since the disclosures.\n\n## Attacker IP Reputation\n\n\n-----\n\nImperva s IP reputation allows for the identification of potentially suspicious or malicious\nbehaviour by means of tagging relevant IPs. From this data, 42.3% of the attacker source\nIPs were previously tagged by Imperva as having exhibited malicious behaviour and 8.45%\nof the attacker source IPs were previously tagged by Imperva as being identified as\nvulnerability scanners.\n\n## Observed Attacker Activity\n\nImperva analysts have observed various indicators of the attempted exploitation of the\n[Microsoft Exchange Hafnium CVE-2021-26855 in the wild, indicating various motives on the](https://nvd.nist.gov/vuln/detail/CVE-2021-26855)\npart of the attackers. As mentioned previously, an attacker can leverage the vulnerability to\nperform various unauthorized actions, including the collection of private information, and\neven the writing of arbitrary files to the server resulting in remote code execution. In this\nsection, we will discuss some of the requests we have observed and the perceived\nintentions and motivation of the attackers.\n\nDetailed descriptions of how the exploit chain works, and how it can be exploited are\n[available at various different sources [1][2], however the important thing to understand is](https://testbnull.medium.com/ph%C3%A2n-t%C3%ADch-l%E1%BB%97-h%E1%BB%95ng-proxylogon-mail-exchange-rce-s%E1%BB%B1-k%E1%BA%BFt-h%E1%BB%A3p-ho%C3%A0n-h%E1%BA%A3o-cve-2021-26855-37f4b6e06265)\nthat the vulnerability allows an attacker to send malicious requests to various backend\ncomponents in Microsoft Exchange by means of a specially crafted POST request to either\nthe Outlook Web Application or the Exchange Admin Centre, where the “X-BEResource”\nand “X-AnonResource-Backend” cookie values can be manipulated to specify the targeted\nresource. In our investigation following the disclosures we have observed the following in\nour data.\n\n## Crafted requests to /EWS/Exchange.asmx\n\nA common exploit request observed by Imperva attempting to exploit the CVE-2021-26855\nSSRF vulnerability was a POST request to Exchange Admin Centre (/ecp/) and Outlook\nWeb Application endpoints (/owa/) endpoint, with the crafted cookie value endpoints set to\nthe Exchange Web Services endpoint “/EWS/Exchange.asmx”. This allows the attacker to\ngain authenticated access to private mail on the server. This request accounted for 18% of\nexploitation attempts observed.\n\n\n-----\n\n## Crafted requests to /autodiscover/autodiscover.xml\n\nThe most common exploitation attempt of the SSRF observed by Imperva analysts were\nrequests to the Exchange Admin Centre endpoint (/ecp), with the vulnerabile cookie set with\nthe FQDN of the server, and the endpoint of /autodiscover/autodiscover.xml.\n\nAutodiscover in Exchange is a service which allows for the rapid collection of Exchange\nconfigurations, service URLs and supported protocols, therefore it makes an obvious target\nfor attackers who are attempting to quickly gather information, escalate privileges and\nmaintain persistence. In the case of this vulnerability the autodiscover service could be\nused to gather the information required for further exploitation of the other CVEs associated\nwith the chain. This request accounted for 51% of exploitation attempts observed.\n\n\n-----\n\n## Crafted requests to /mapi/emsmdb\n\nAnother pattern Imperva analysts observed were crafted POST requests to the Exchange\nAdmin Centre (/ecp), with the cookie value crafted with the /mapi/emsmdb endpoint.\n\nResearch into the published exploits and disclosures indicate that the “/mapi/emsmdb”\nendpoint can be abused to procure a valid SID, which can then allow the attacker to gain\nprivileges to the Exchange “proxyLogin.ecp” endpoint (Exchange HTTP proxy), which can\nin turn be used to obtain a valid “ASP.NET_SessionID” and “msExchEcpCanary” values\nwhich are required for further chained exploitation of MS exchange. This request accounted\nfor 3% of exploitation attempts observed.\n\n## How Imperva protects you\n\n[Imperva has implemented rules in Cloud WAF and](https://www.imperva.com/products/web-application-firewall-waf/) [On Prem WAF, which are effective](https://www.imperva.com/products/web-application-firewall-waf/)\nagainst all exploitation of CVE-2021-26855. These rules are also effective against the\n[chained exploitation of the subsequent CVEs: CVE-2021-26857,](https://nvd.nist.gov/vuln/detail/CVE-2021-26857) [CVE-2021-26858 and](https://nvd.nist.gov/vuln/detail/CVE-2021-26858)\n[CVE-2021-27065.](https://nvd.nist.gov/vuln/detail/CVE-2021-27065)\n\n\n-----\n\n## Check if you have been compromised\n\nSince the disclosures of these zero day vulnerabilities, various news articles have been\n[published reporting mass exploitation [1][2]. We recommend that if you have unpatched](https://www.bbc.com/news/technology-56372188)\nexchange servers in your organization, you apply the latest patches from Microsoft as soon\n[as possible, and use the following guide from Microsoft to check for any indicators of](https://msrc-blog.microsoft.com/2021/03/05/microsoft-exchange-server-vulnerabilities-mitigations-march-2021/)\ncompromise.\n\n## Try Imperva for Free\n\nProtect your business for 30 days on Imperva.\n\n[Start Now](https://www.imperva.com/free-trial/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-26 - Imperva Observes Hive of Activity Following Hafnium Microsoft Exchange Disclosures.pdf"
    ],
    "report_names": [
        "2021-03-26 - Imperva Observes Hive of Activity Following Hafnium Microsoft Exchange Disclosures.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536095,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653709042,
    "ts_modification_date": 1653709042,
    "files": {
        "pdf": "https://archive.orkl.eu/a19214e7ee5ea1ed35cde86723e82563f31f4e36.pdf",
        "text": "https://archive.orkl.eu/a19214e7ee5ea1ed35cde86723e82563f31f4e36.txt",
        "img": "https://archive.orkl.eu/a19214e7ee5ea1ed35cde86723e82563f31f4e36.jpg"
    }
}