{
    "id": "bb9bfcf4-b46e-4c83-9ab8-e8875a349155",
    "created_at": "2023-02-19T02:05:20.491566Z",
    "updated_at": "2025-03-27T02:16:39.530035Z",
    "deleted_at": null,
    "sha1_hash": "191cef5d1d84b81c8eb77119c7029fa74d23d9bc",
    "title": "2017-08-16 - Understanding the Mirai Botnet",
    "authors": "",
    "file_creation_date": "2017-07-13T19:01:22Z",
    "file_modification_date": "2017-08-08T17:06:53Z",
    "file_size": 1168109,
    "plain_text": "# Understanding the Mirai Botnet\n\n### Manos Antonakakis, Georgia Institute of Technology; Tim April, Akamai; Michael Bailey, University of Illinois, Urbana-Champaign; Matt Bernhard, University of Michigan, Ann Arbor; Elie Bursztein, Google; Jaime Cochran, Cloudflare; Zakir Durumeric and J. Alex Halderman, University of Michigan, Ann Arbor; Luca Invernizzi, Google; Michalis Kallitsis, Merit Network, Inc.; Deepak Kumar, University of Illinois, Urbana-Champaign; Chaz Lever, Georgia Institute of Technology; Zane Ma and Joshua Mason, University of Illinois, Urbana-Champaign; Damian Menscher, Google; Chad Seaman, Akamai; Nick Sullivan, Cloudflare;  Kurt Thomas, Google; Yi Zhou, University of Illinois, Urbana-Champaign\n\n#### https://www.usenix.org/conference/usenixsecurity17/technical-sessions/presentation/antonakakis\n\n## This paper is included in the Proceedings of the 26th USENIX Security Symposium\n\n### August 16–18, 2017 • Vancouver, BC, Canada\n\n\n-----\n\n### Understanding the Mirai Botnet\n\n#### Manos Antonakakis[⋄] Tim April[‡] Michael Bailey[†] Matthew Bernhard[◁] Elie Bursztein[◦]\n Jaime Cochran[▷] Zakir Durumeric[◁] J. Alex Halderman[◁] Luca Invernizzi[◦]\n Michalis Kallitsis[§] Deepak Kumar[†] Chaz Lever[⋄] Zane Ma[†][∗] Joshua Mason[†]\n Damian Menscher[◦] Chad Seaman[‡] Nick Sullivan[▷] Kurt Thomas[◦] Yi Zhou[†]\n\n‡Akamai Technologies _▷Cloudflare_ _⋄Georgia Institute of Technology_ _◦Google_\n§Merit Network †University of Illinois Urbana-Champaign _◁University of Michigan_\n\n\n#### Abstract\n\nThe Mirai botnet, composed primarily of embedded\nand IoT devices, took the Internet by storm in late 2016\nwhen it overwhelmed several high-profile targets with\nmassive distributed denial-of-service (DDoS) attacks. In\nthis paper, we provide a seven-month retrospective analysis of Mirai’s growth to a peak of 600k infections and\na history of its DDoS victims. By combining a variety\nof measurement perspectives, we analyze how the botnet emerged, what classes of devices were affected, and\nhow Mirai variants evolved and competed for vulnerable\nhosts. Our measurements serve as a lens into the fragile\necosystem of IoT devices. We argue that Mirai may represent a sea change in the evolutionary development of\nbotnets—the simplicity through which devices were infected and its precipitous growth, demonstrate that novice\nmalicious techniques can compromise enough low-end\ndevices to threaten even some of the best-defended targets.\nTo address this risk, we recommend technical and nontechnical interventions, as well as propose future research\ndirections.\n\n#### 1 Introduction\n\nStarting in September 2016, a spree of massive distributed\ndenial-of-service (DDoS) attacks temporarily crippled\nKrebs on Security [46], OVH [43], and Dyn [36]. The initial attack on Krebs exceeded 600 Gbps in volume [46]—\namong the largest on record. Remarkably, this overwhelming traffic was sourced from hundreds of thousands of\nsome of the Internet’s least powerful hosts—Internet of\nThings (IoT) devices—under the control of a new botnet\nnamed Mirai.\nWhile other IoT botnets such as BASHLITE [86] and\nCarna [38] preceded Mirai, the latter was the first to\nemerge as a high-profile DDoS threat. What explains\nMirai’s sudden rise and massive scale? A combination\n\n_∗Denotes primary, lead, or “first” author_\n\n\nof factors—efficient spreading based on Internet-wide\nscanning, rampant use of insecure default passwords in\nIoT products, and the insight that keeping the botnet’s\nbehavior simple would allow it to infect many heterogeneous devices—all played a role. Indeed, Mirai has\nspawned many variants that follow the same infection\nstrategy, leading to speculation that “IoT botnets are the\nnew normal of DDoS attacks” [64].\nIn this paper, we investigate the precipitous rise of Mirai and the fragile IoT ecosystem it has subverted. We\npresent longitudinal measurements of the botnet’s growth,\ncomposition, evolution, and DDoS activities from August 1, 2016 to February 28, 2017. We draw from a\ndiverse set of vantage points including network telescope\nprobes, Internet-wide banner scans, IoT honeypots, C2\nmilkers, DNS traces, and logs provided by attack victims. These unique datasets enable us to conduct the first\ncomprehensive analysis of Mirai and posit technical and\nnon-technical defenses that may stymie future attacks.\nWe track the outbreak of Mirai and find the botnet\ninfected nearly 65,000 IoT devices in its first 20 hours\nbefore reaching a steady state population of 200,000–\n300,000 infections. These bots fell into a narrow band of\ngeographic regions and autonomous systems, with Brazil,\nColumbia, and Vietnam disproportionately accounting for\n41.5% of infections. We confirm that Mirai targeted a\nvariety of IoT and embedded devices ranging from DVRs,\nIP cameras, routers, and printers, but find Mirai’s ultimate\ndevice composition was strongly influenced by the market\nshares and design decisions of a handful of consumer\nelectronics manufacturers.\nBy statically analyzing over 1,000 malware samples,\nwe document the evolution of Mirai into dozens of variants propagated by multiple, competing botnet operators.\nThese variants attempted to improve Mirai’s detection\navoidance techniques, add new IoT device targets, and introduce additional DNS resilience. We find that Mirai harnessed its evolving capabilities to launch over 15,000 attacks against not only high-profile targets (e.g., Krebs\n\n\n-----\n\n09/30/2016\n**Source code released**\n\n\n09/18/2016\n**OVH attacks**\n\n**begin**\n\n\n10/21/2016\n**Dyn attacks**\n\n\n02/23/2017\n**Deutsche Telekom**\n\n**attacker arrested**\n\n\n11/26/2016\n**Deutsche Telekom**\n\n**CWMP exploit**\n\n\nSept Oct Nov Dec Jan Feb\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|\n|---|---|---|---|---|---|---|---|---|---|\n||Sept||Oct|||Nov Dec Jan||Feb||\n\n\n08/01/2016\n**Mirai surfaces**\n\n\n09/21/2016\n**Krebs on Security**\n\n**peak attack**\n\n\n10/31/2016\n**Liberia Lonestar**\n\n**attacks begin**\n\n\n01/18/2017\n**Mirai author**\n\n**identified**\n\n\nFigure 1: Mirai Timeline —Major attacks (red), exploits (yellow), and events (black) related to the Mirai botnet.\n\n\non Security, OVH, and Dyn), but also numerous game\nservers, telecoms, anti-DDoS providers, and other seemingly unrelated sites. While DDoS was Mirai’s flavor\nof abuse, future strains of IoT malware could leverage\naccess to compromised routers for ad fraud, cameras for\nextortion, network attached storage for bitcoin mining,\nor any number of applications. Mirai’s reach extended\nacross borders and legal jurisdictions, and it infected devices with little infrastructure to effectively apply security\npatches. This made defending against it a daunting task.\nFinally, we look beyond Mirai to explore the security\nposture of the IoT landscape. We find that the absence of\nsecurity best practices—established in response to desktop worms and malware over the last two decades—has\ncreated an IoT substrate ripe for exploitation. However,\nthis space also presents unique, nuanced challenges in the\nrealm of automatic updates, end-of-life, and consumer notifications. Without improved defenses, IoT-based attacks\nare likely to remain a potent adversarial technique as botnet variants continue to evolve and discover new niches\nto infect. In light of this, Mirai seems aptly named—it is\nJapanese for “the future.”\n\n#### 2 The Mirai Botnet\n\nMirai is a worm-like family of malware that infected\nIoT devices and corralled them into a DDoS botnet. We\nprovide a brief timeline of Mirai’s emergence and discuss\nits structure and propagation.\n\n**Timeline of events** Reports of Mirai appeared as\nearly as August 31, 2016 [89], though it was not until\nmid-September, 2016 that Mirai grabbed headlines with\nmassive DDoS attacks targeting Krebs on Security [46]\nand OVH [74] (Figure 1). Several additional high-profile\nattacks later targeted DNS provider Dyn [36] and\nLonestar Cell, a Liberian telecom [45]. In early 2017, the\nactors surrounding Mirai came to light as the Mirai author\nwas identified [49]. Throughout our study, we corroborate\nour measurement findings with these media reports and\nexpand on the public information surrounding Mirai.\nAnother significant event in this timeline is the public\n\n\nrelease of Mirai’s source code on hackforums.net [4]. We\nrely on this code to develop our measurement methodology (Section 3). Furthermore, as we detail later (Section 5), this source code release led to the proliferation\nof Mirai variants with competing operators. One notable\nvariant added support for a router exploit through CPE\nWAN Management Protocol (CWMP), an HTTP-based\nprotocol that enables auto-configuration and remote management of home routers, modems, and other customerpremises equipment (CPE) [15]. This exploit led to an outage at Deutsche Telekom late November 2016 [47], with\nthe suspected attacker later arrested in February 2017 [13].\nIn this work, we track Mirai’s variants and examine how\nthey influenced Mirai’s propagation.\n\n**Botnet structure & propagation** We provide a summary of Mirai’s operation in Figure 2, as gleaned from\nthe released source code. Mirai spread by first entering\na rapid scanning phase (x) where it asynchronously and\n“statelessly” sent TCP SYN probes to pseudorandom IPv4\naddresses, excluding those in a hard-coded IP blacklist, on\nTelnet TCP ports 23 and 2323 (hereafter denoted TCP/23\nand TCP/2323). If Mirai identifies a potential victim, it entered into a brute-force login phase in which it attempted\nto establish a Telnet connection using 10 username and\npassword pairs selected randomly from a pre-configured\nlist of 62 credentials. At the first successful login, Mirai\nsent the victim IP and associated credentials to a hardcoded report server (y).\n\nA separate loader program (z) asynchronously infected these vulnerable devices by logging in, determining\nthe underlying system environment, and finally, downloading and executing architecture-specific malware ({).\nAfter a successful infection, Mirai attempted to conceal\nits presence by deleting the downloaded binary and obfuscating its process name in a pseudorandom alphanumeric string. As a consequence, Mirai infections did not\npersist across system reboots. In order to fortify itself,\nthe malware additionally killed other processes bound\nto TCP/22 or TCP/23, as well as processes associated\nwith competing infections, including other Mirai variants, .anime [25], and Qbot [72]. At this point, the bot\n\n\n-----\n\nFigure 2: Mirai Operation —Mirai bots scan the IPv4 address\nspace for devices that run telnet or SSH, and attempt to log in using a hardcoded dictionary of IoT credentials. Once successful,\nthe bot sends the victim IP address and associated credentials to\na report server, which asynchronously triggers a loader to infect\nthe device. Infected hosts scan for additional victims and accept\nDDoS commands from a command and control (C2) server.\n\nlistened for attack commands from the command and control server (C2) while simultaneously scanning for new\nvictims.\n\n**Malware phylogeny** While not directly related to\nour study, the Mirai family represents an evolution of\nBASHLITE (otherwise known as LizardStresser, Torlus,\nGafgyt), a DDoS malware family that infected Linux\ndevices by brute forcing default credentials [86]. BASHLITE relied on six generic usernames and 14 generic passwords, while the released Mirai code used a dictionary\nof 62 username/password pairs that largely subsumed\nBASHLITE’s set and added credentials specific to consumer routers and IoT devices. In contrast to BASHLITE,\nMirai additionally employed a fast, stateless scanning\nmodule that allowed it to more efficiently identify vulnerable devices.\n\n#### 3 Methodology\n\nOur study of Mirai leverages a variety of network vantage\npoints: a large, passive network telescope, Internet-wide\nscanning, active Telnet honeypots, logs of C2 attack\ncommands, passive DNS traffic, and logs from DDoS\nattack targets. In this section, we discuss our data sources\nand the role they play in our analysis. We provide a\nhigh-level summary in Table 1.\n\n\n#### 3.1 Network Telescope\n\nMirai’s indiscriminate, rapid scanning strategy lends itself to tracking the botnet’s propagation to new hosts. We\nmonitored all network requests to a network telescope [9]\ncomposed of 4.7 million IP address operated by Merit\nNetwork over a seven month period from July 18, 2016\nto February 28, 2017. On average, the network telescope\nreceived 1.1 million packets from 269,000 IP addresses\nper minute during this period. To distinguish Mirai traffic\nfrom background radiation [94] and other scanning activity, we uniquely fingerprinted Mirai probes based on\nan artifact of Mirai’s stateless scanning whereby every\nprobe has a TCP sequence number—normally a random\n32-bit integer—equal to the destination IP address. The\nlikelihood of this occurring incidentally is 1/2[32], and we\nwould expect to see roughly 86 packets demonstrating\nthis pattern in our entire dataset. In stark contrast, we\nobserved 116.2 billion Mirai probes from 55.4 million IP\naddresses. Prior to the emergence of Mirai, we observed\nonly three IPs that perform scans with this fingerprint.\nTwo of the IP addresses generated five packets; two on\nTCP/80 and three on TCP/1002. The third IP address belongs to Team Cymru [1], who conducts regular TCP/443\nscans.\nWe caution that the raw count of IP addresses seen\nscanning over time is a poor metric of botnet size due to\nDHCP churn [87]. To account for this, we tracked the size\nof the botnet by considering the number of hosts actively\n“scanning” at the start of every hour. We detected scans\nusing the methodology presented by Durumeric et al. [23],\nin which we group packets from a single IP address in\na temporal window into logical scans. We specifically\nidentified scans that targeted the IPv4 address space at an\nestimated rate of at least five packets per second, expiring\ninactive scans after 20 minutes. We geolocated IPs using\nMaxmind [61].\n\n#### 3.2 Active Scanning\n\nWhile Mirai is widely considered an IoT botnet, there\nhas been little comprehensive analysis of infected devices\nover the botnet’s entire lifetime. In order to determine the\nmanufacturer and model of devices infected with Mirai,\nwe leveraged Censys [22], which actively scans the IPv4\nspace and aggregates application layer data about hosts on\nthe Internet. We focused our analysis on scans of HTTPS,\nFTP, SSH, Telnet, and CWMP between July 19, 2016 and\nFebruary 28, 2017.\nA number of challenges make accurate device labeling\ndifficult. First, Mirai immediately disables common outward facing services (e.g., HTTP) upon infection, which\nprevents infected devices from being scanned. Second,\nCensys scans often take more than 24 hours to complete,\n\n\n-----\n\n**Role** **Data Source** **Collection Site** **Collection Period** **Data Volume**\n\nGrowth and size Network telescope Merit Network, Inc. 07/18/2016–02/28/2017 370B packets, avg. 269K IPs/min\n\nDevice composition Active scanning Censys 07/19/2016–02/28/2017 136 IPv4 scans, 5 protocols\n\nOwnership & evolution Telnet honeypots AWS EC2 11/02/2016–02/28/2017 141 binaries\nTelnet honeypots Akamai 11/10/2016–02/13/2017 293 binaries\nMalware repository VirusTotal 05/24/2016–01/30/2017 594 binaries\nDNS—active Georgia Tech 08/01/2016–02/28/2017 290M RRs/day\nDNS—passive Large U.S. ISP 08/01/2016–02/28/2017 209M RRs/day\n\nAttack characterization C2 milkers Akamai 09/27/2016–02/28/2017 64.0K attack commands\nDDoS IP addresses Akamai 09/21/2016 12.3K IP addresses\nDDoS IP addresses Google Shield 09/25/2016 158.8K IP addresses\nDDoS IP addresses Dyn 10/21/2016 107.5K IP addresses\n\nTable 1: Data Sources —We utilized a multitude of data perspectives to empirically analyze the Mirai botnet.\n\n\n**Protocol** **Banners** **Devices Identified**\n\nHTTPS 342,015 271,471 (79.4%)\nFTP 318,688 144,322 (45.1%)\nTelnet 472,725 103,924 (22.0%)\nCWMP 505,977 35,163 (7.0%)\nSSH 148,640 8,107 (5.5%)\n\nTotal 1,788,045 587,743 (31.5%)\n\nTable 2: Devices Identified —We identified device type, model,\nand/or vendor for 31.5% of active scan banners. Protocol banners varied drastically in device identifiability, with HTTPS\ncertificates being most descriptive, and SSH prompts being the\nleast.\n\nduring which devices may churn to new IP addresses. Finally, Censys executes scans for different protocols on\ndifferent days, making it difficult to increase label specificity by combining banners from multiple services. We\nnavigated these constraints by restricting our analysis\nto banners that were collected within twenty minutes of\nscanning activity (the time period after which we expire\na scan). This small window mitigates the risk of erroneously associating the banner data of uninfected devices\nwith Mirai infections due to DHCP churn.\nPost-filtering, our dataset included 1.8 million banners\nassociated with 1.2 million Mirai-infected IP addresses\n(Table 2). We had the most samples for CWMP, and\nthe least for SSH. We caution that devices with open\nservices that are not closed by Mirai (e.g., HTTPS and\nFTP) can appear repeatedly in Censys banner scans during\nour measurement window (due to churn) and thus lead to\nover counting when compared across protocols. As such,\nwe intentionally explored protocols in isolation from one\nanother and limited ourselves to measurements that only\nconsider relative proportions rather than absolute counts\nof infected hosts.\nFinally, we processed each infected device’s banner to\nidentify the device manufacturer and model. We first applied the set of regular expressions used by Nmap service\n\n\nprobes to fingerprint devices [58]. Nmap successfully\nhandled 98% of SSH banners and 81% of FTP banners,\nbut matches only 7.8% of the Telnet banners. In order to\nincrease our coverage and also accommodate HTTPS and\nCWMP (which Nmap lacks probes for), we constructed\nour own regular expressions to map banners to device\nmanufacturers and models. Unfortunately, we found that\nin many cases, there was not enough data to identify a\nmodel and manufacturer from FTP, Telnet, CWMP, and\nSSH banners and that Nmap fingerprints only provide\ngeneric descriptions. In total, we identified device type\nand/or model and manufacturer for 31.5% of banners\n(Table 2). We caution that this methodology is susceptible to misattribution in instances where port-forwarding\nand Universal Plug and Play (UPnP) are used to present\nmultiple devices behind a single IP address, making the\ndistinction between middlebox and end-device difficult.\n\n#### 3.3 Telnet Honeypots\n\nTo track the evolution of Mirai’s capabilities, we collected\nbinaries installed on a set of Telnet honeypots that masqueraded as vulnerable IoT devices. Mechanically, we\npresented a BusyBox shell [92] and IoT-consistent device\nbanner. Our honeypots logged all incoming Telnet traffic and downloaded any binaries that attackers attempted\nto install on the host via wget or tftp (the methods of\ninfection found in Mirai’s original source). In order to\navoid collateral damage, we blocked all other outgoing\nrequests (e.g., scanning and DoS traffic).\nWe logged 80K connection attempts from 54K IP addresses between November 2, 2016 and February 28,\n2017, collecting a total 151 unique binaries. We filtered\nout executables unrelated to Mirai based on a YARA signature that matched any of the strings from the original\nsource code release, leaving us with 141 Mirai binaries.\nWe supplemented this data with 293 binaries observed by\nhoneypots operated by Akamai, which served a similar\npurpose to ours, but were hosted on a different public\n\n\n-----\n\ncloud provider. As a final source of samples, we included\n594 unique binaries from VirusTotal [90] that we scanned\nfor using the YARA rules mentioned above. In total, we\ncollected 1,028 unique Mirai samples.\nWe analyzed the binaries for the three most common architectures—MIPS 32-bit, ARM 32-bit, and x86 32-bit—\nwhich account for 74% of our samples. We extracted\nthe set of logins and passwords, IP blacklists, and C2 domains from these binaries, identifying 67 C2 domains and\n48 distinct username/password dictionaries (containing a\ntotal 371 unique passwords).\n\n#### 3.4 Passive & Active DNS\n\nFollowing the public release of Mirai’s source code, competing Mirai botnet variants came into operation. We\ndisambiguated ownership and estimate the relative size\nof each Mirai strain by exploring passive and active DNS\ndata for the 67 C2 domains that we found by reverse engineering Mirai binaries. We also leveraged our DNS data\nto map the IP addresses present in attack commands to\nvictim domain names.\nFrom a large U.S. ISP, we obtained passive DNS data\nconsisting of DNS queries generated by the ISP’s clients\nand their corresponding responses. More specifically,\nwe collected approximately 209 million resource records\n(RRs)—queried domain name, and associated RDATA—\nand their lookup volumes aggregated on a daily basis.\nFor our active DNS dataset, we obtained 290 million\nRRs per day from Thales, an active DNS monitoring\nsystem [44]. Both datasets cover the period of August 1,\n2016 to February 28, 2017.\nUsing both passive and active DNS datasets, we performed DNS expansion to identify shared DNS infrastructure by linking related historic domain names (RHDN)\nand related historic IPs (RHIPs) [5]. This procedure began with the seed set of C2 domains and IPs extracted\nduring reverse engineering of our honeypotted binaries.\nFor a given seed foo.com, we identified the IP addresses\nthat foo.com previously resolved to and added them to\na growing set of domains and IPs. We additionally performed the reverse analysis, starting from an IP and finding any domain names that concurrently resolved it. Thus,\neven from a single domain name, we iteratively expanded\nthe set of related domain names and IP addresses to construct a graph reflecting the shared infrastructure used\nby Mirai variants. In total, we identified 33 unique DNS\nclusters that we explore in detail in Section 5.\n\n#### 3.5 Attack Commands\n\nTo track the DDoS attack commands issued by Mirai\noperators, Akamai ran a “milker” from September 27,\n2016–February 28, 2017 that connected to the C2 servers\n\n\nfound in the binaries uploaded to their honeypots. The\nservice simulated a Mirai-infected device and communicated with the C2 server using a custom bot-to-C2 protocol, which was reverse engineered from malware samples\nprior to source code release. In total, Akamai observed\n64K attack commands issued by 484 unique C2 servers\n(by IP address). We note that a naive analysis of attack\ncommands overestimates the volume of attacks and targets: individual C2 servers often repeat the same attack\ncommand in rapid succession, and multiple distinct C2\nservers frequently issued the same command. To account\nfor this, we heuristically grouped attack commands along\ntwo dimensions: by shared C2 infrastructure and by temporal similarity. We collapsed matching commands (i.e.,\ntuples of attack type, duration, targets, and command options) that occur within 90 seconds of each other, which\nyielded 15,194 attacks from 146 unique IP clusters. Our\nattack command coverage includes the Dyn attack [36]\nand Liberia attacks [45]. We did not observe attack commands for Krebs on Security and OVH, which occurred\nprior to the milker’s operation.\n\n#### 3.6 DDoS Attack Traces\n\nOur final data source consists of network traces and aggregate statistics from Akamai and Google Shield (the\nproviders for Krebs on Security) and Dyn. These attacks\ncover two distinct periods in Mirai’s evolution. We used\nthis data to corroborate the IP addresses observed in attacks versus those found scanning our passive network\ntelescope, as well as to understand the volume of traffic generated by Mirai[1]. From Akamai, we obtained an\naggregate history of all DDoS attacks targeting Krebs\non Security from 2012–2016, as well as a small sample of 12.3K IPs related to a Mirai attack on September\n21, 2016. For Google Shield, we shared a list of IP addresses observed by our network telescope and in turn\nreceived aggregate statistics on what fraction matched\nany of 158.8K IP addresses involved in a 1-minute Mirai\nHTTP-flood attack on September 25, 2016. Finally, Dyn\nprovided us with a set of 107.5K IP addresses associated\nwith a Mirai attack on October 21, 2016.\n\n#### 4 Tracking Mirai’s Spread\n\nAs a first step towards understanding Mirai, we analyzed\nhow the botnet bootstrapped its initial infections, what\ntypes of devices it targeted, and how it eventually infected\nan estimated 600K hosts. To contextualize the properties\nof Mirai, we compare it against prior botnets and worms.\n\n1We overlapped attack traces with every Mirai scanning IPs on our\nnetwork telescope. The overlap may have been inflated by non-Mirai\nattack IPs being assigned to Mirai devices over time through DHCP\nchurn.\n\n\n-----\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n�\n\n|Col1|Col2|Col3|\u0011\u0012\u000f\u000e\u0013 \u0006\u0006\u0005 \u0004\u0005 \u0007\u0007\u0007\u0007 \u0004\u0005\u0004\u0005 \b \u0004\u0005\u0004\u0005\u0002 \u0007\u0006 \u0004\u0004 \u0001 \u0001 \u0004\u0004\u0004\u0004 \u0001 \u0005|Col5|Col6|\n|---|---|---|---|---|---|\n|||||||\n|||||||\n|||||||\n|||||||\n|||||||\n|||||||\n\n\n�������� �������� �������� �������� �������� �������� ��������\n\n\n����\n\nFigure 3: Temporal Mirai Infections —We estimate of the number of Mirai-infected devices over time by tracking the number of\nhosts actively scanning with Mirai fingerprint at the start of every hour. Mirai started by scanning Telnet, and variants evolved to\ntarget 11 additional protocols. The total population initially fluctuated between 200,000–300,000 devices before receding to 100,000\ndevices, with a brief peak of 600,000 devices.\n\n\n������[�]\n\n������[�]\n\n������[�]\n\n������[�]\n\n������[�]\n\n������[�]\n\n������[�]\n\n�\n\n|Col1|Col2|\n|---|---|\n|||\n|||\n|||\n|||\n||\u0018\u0019|\n|||\n\n\n����\n\nFigure 4: Bootstrap Scanning —Mirai scanning began on August 1, 2016 from a single IP address in a bulletproof hosting\ncenter. Mirai infection spread rapidly with a 76-minute doubling time and quickly matched the volume of non-Mirai Telnet\nscanning.\n\n\n#### 4.1 Bootstrapping\n\nWe provide a timeline of Mirai’s first infections in Figure 4. A single preliminary Mirai scan occurred on August 1, 2016 from an IP address belonging to DataWagon,\na U.S.-based bulletproof hosting provider [48]. This\nbootstrap scan lasted approximately two hours (01:42–\n03:59 UTC), and about 40 minutes later (04:37 UTC) the\nMirai botnet emerged. Within the first minute, 834 devices began scanning, and 11K hosts were infected within\nthe first 10 minutes. Within 20 hours, Mirai infected\n64,500 devices. Mirai’s initial 75-minute doubling time\nis outstripped by other worms such as Code Red (37minute doubling time [70]) and Blaster (9-minute doubling time [10]). Mirai’s comparatively modest initial\ngrowth may be due to the low bandwidth and computational resources of infected devices, a consequence of the\nlow-accuracy, brute-force login using a small number of\ncredentials, or simply attributable to a bottleneck in loader\ninfrastructure.\n\n\n#### 4.2 Steady State Size\n\nWe observed multiple phases in Mirai’s life: an initial\nsteady state of 200,000–300,000 infections in September\n2016; a peak of 600,000 infections at the end of November 2016; and a collapse to roughly 100,000 infections at\nthe end of our observation window in late February 2017\n(Figure 3). Even though hosts were initially compromised\nvia a simple dictionary attack, Mirai was able to infect\nhundreds of thousands of devices. This is similar in scale\nto historical botnets such as the prolific Srizbi spam botnet (400,000 bots [83]), which was responsible for more\nthan half of all global botnet spam [35], and the Carna\nbotnet (420,000 bots [38]), the first botnet of IoT devices\ncompromised using default credentials.\nWhile the original Mirai variant infected devices by\nattempting Telnet and SSH logins with a static set of\ncredentials, later strains evolved to scan for other types of\nvulnerabilities. Most notably, Mirai-fingerprinted scans\ntargeting TCP/7547, the standard port for CWMP, began\nappearing in our dataset on November 26, 2016. Mirai\ncompromised CWMP devices through an RCE exploit\nin a SOAP configuration endpoint [41]. The new attack\nvector led to a renewed spike of infections (Figure 3). The\ndecay that followed may be explained best by Deutsche\nTelekom patching routers soon after the attack [21]. The\nnon-immediate decay may have been due to the devices\nrequiring a reboot for the patch to take effect.\nTo better understand the decrease in Mirai bots from\na steady state of 300,000 devices down to 100,000 devices, we examined the ASes in which raw population\ndecreased most significantly between September 21, 2016\nand February 28, 2017. The ASes with the largest reduction in devices were: Telefónica Colombia (−38,589 bots,\n−98.5%), VNPT Corp (−16,791 bots, −90.2%), and Claro\nS.A. (−14,150 bots, −80.2%). This suggests potential action by certain network operators to mitigate Mirai. While\na handful of ASes increased in prevalence over time, no\n\n-----\n\ntably Telefónica de Argentina (+3,287 bots, 3,365.1%)\nand Ecuadorian telecom company CNT EP (+1,447 bots,\n116.4%), the total increase (+10,500 bots) across all ASes\nis eclipsed by the overall decrease (−232,698 bots).\n\n**Mirai** **Mirai** **Telnet**\n**Country**\n**Infections** **Prevalence** **Prevalence**\n\nBrazil 49,340 15.0% 7.9%\nColombia 45,796 14.0% 1.7%\nVietnam 40,927 12.5% 1.8%\nChina 21,364 6.5% 22.5%\nS. Korea 19,817 6.0% 7.9%\nRussia 15,405 4.7% 2.7%\nTurkey 13,780 4.2% 1.1%\nIndia 13,357 4.1% 2.9%\nTaiwan 11,432 3.5% 2.4%\nArgentina 7,164 2.2% 0.2%\n\nTable 3: Geographic Distribution — We compare countries\nthat harbored the most infections on 09/21/2016—when Krebs\non Security was attacked—with countries that hosted the most\ntelnet devices on 07/19/2016 prior to Mirai’s onset. Mirai infections occurred disproportionately in South America and Southeast Asia, accounting for 50% of infections.\n\n#### 4.3 Global Distribution\n\nIn order to understand where Mirai infections were geographically concentrated, we calculated the geolocation\nof Mirai bots actively scanning at 00:00 UTC on September 21, 2016 (during the first Krebs on Security attack\nand Mirai’s peak steady state infection period). As shown\nin Figure 3, the bulk of Mirai infections stemmed from\ndevices located in Brazil (15.0%), Columbia (14.0%), and\nVietnam (12.5%). Mirai also exhibited a concentrated network distribution—the top 10 ASes accounted for 44.3%\nof infections, and the top 100 accounted for 78.6% of\ninfections (Table 4). Compared to the pre-Mirai global\ndistribution of telnet hosts, Mirai consisted of a disproportionate number of devices concentrated in South America\n\n**AS** **%** **AS** **%**\n\nTelefónica Colombia 11.9% Türk Telekom 3.2%\nVNPT Corp. 5.7% Chunghwa Telecom[†] 2.9%\nClaro S.A. 5.4% FPT Group 2.8%\nChina Telecom[†] 4.0% Korea Telecom[†] 2.6%\nTelefônica Brasil 3.4% Viettel Corporation 2.5%\n\nTable 4: AS Distribution —We list the 10 ASes with the largest\nnumber of infections on 09/21/2016, the day Krebs on Security\nwas attacked and the initial peak infection. The top 10 ASes\naccounted for 44.3% of infections, but only three of the top 10\nare within the top 100 global ASes (denoted [†]) [16].\n\n\nand Southeast Asia. This is possibly due to biases in manufacturer and market penetration in those regions. This\nis a stark contrast from many prior worms, which were\nprimarily concentrated in the U.S., including CodeRed\n(43.9%), Slammer (42.9%), Witty (26.3%), and Conficker\n(34.5%) [82]. Mirai largely infected regions the black\nmarket considers to be low-quality hosts used for proxies\nand DDoS [88] and may have limited potential avenues\nfor monetization.\nWe explored the dynamism of Mirai’s membership by\nexamining the correlation between the top Mirai scanning\nASes over time. We find that Mirai displayed general\nstability outside of the rapid growth phase in September\n2016 and when CWMP exploits were introduced in late\nNovember (Figure 5a). During the September growth\nperiod, the number of IPs in each AS rose across the\nboard with a few outliers. The growth of IPs belonging\nto Telefónica Colombia exceeded all other ASes and was\neventually responsible for the largest number of Mirai\ninfections. Other new introductions to the top 10 included\nIndia’s Bharti Airtel and Bharat Sanchar Nigam Limited,\nBrazil’s Claro S.A., and Korea Telecom.\nCWMP emergence also disrupted general network distribution stability. Between November 25–27, 7 of the\ntop 10 ASes decreased in rank to give rise to several previously unseen European ASes (e.g., Eircom and TalkTalk).\nTheir appearance was short-lived; by December 10, 2016,\nthese ASes fell back down in population. This suggests\nthat the vulnerable population of the CWMP exploit were\nconcentrated in Europe, but prompt patching returned\nMirai back to its original concentration in South America and Southeast Asia. The longterm stability of Mirai\nASes and geolocation demonstrates that Mirai has not\nexpanded significantly in the scope and scale of devices\nthat it infects. However, as the transient CWMP exploit\ndemonstrates, new infection vectors had the potential to\nquickly add to Mirai’s already sizable membership.\n\n#### 4.4 Device Composition\n\nWhile cursory evidence suggested that Mirai targets IoT\ndevices—Mirai’s dictionary of default usernames and\npasswords included routers, DVRs, and cameras [50],\nand its source compiled to multiple embedded hardware\nconfigurations—we provide an in-depth analysis of both\nthe intended device targets and successful infections.\nTo understand the types of devices that Mirai targeted,\nwe analyzed the credentials hardcoded into the binaries\nwe collected. We observed a total 371 unique passwords,\nand through manual inspection, we identified 84 devices\nand/or vendors associated with these passwords. Many\npasswords were too generic to tie to a specific device (i.e.,\n“password” applies to devices from a large number of\nmanufacturers), while others only provided information\n\n|Telefónica Colombia 11.9% VNPT Corp. 5.7% Claro S.A. 5.4% China Telecom† 4.0% Telefônica Brasil 3.4%|Türk Telekom 3.2% Chunghwa Telecom† 2.9% FPT Group 2.8% Korea Telecom† 2.6% Viettel Corporation 2.5%|\n|---|---|\n\n\n-----\n\n�\n\n\n�\n\n\n���\n\n���\n\n���\n\n���\n\n�\n\n|Col1|Col2|\n|---|---|\n|||\n|||\n||\u000f\u0010\u0011 \u0012\u0013\u0003\u0001 \u000f\u0010\u0011 \u0012\u0013\u0007\u0001\u0001 \u000f\u0010\u0011 \u0012\u0013\u0014\u0001\u0001|\n|||\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n||||||||\n||||||||\n|||||\u000f|\u0010\u0011\u0012 \u0013\u0014\u0012 \u0015\u0015\u0016 \u0014\u000e\u0017\u0018\u000e \u0014\u0019\u0015||\n||||||||\n\n\n�������� �������� �������� �������� �������� ��������\n\n����\n\n\n�������� �������� �������� �������� �������� ��������\n\n����\n\n\n���\n\n���\n\n���\n\n���\n\n�\n\n\n(a) AS Stability\n\n\n(b) Device Stability\n\n\nFigure 5: Stability of Measured Properties —From the temporal Pearson correlation of ASes (a) and device labels (b), we found\nthat our measurements were largely stable despite external factors like DHCP churn. Rapid growth of CWMP-based infections in\nlate November caused instability but calmed shortly thereafter.\n\n**Password** **Device Type** **Password** **Device Type** **Password** **Device Type**\n\n123456 ACTi IP Camera klv1234 HiSilicon IP Camera 1111 Xerox Printer\nanko ANKO Products DVR jvbzd HiSilicon IP Camera Zte521 ZTE Router\npass Axis IP Camera admin IPX-DDK Network Camera 1234 Unknown\n888888 Dahua DVR system IQinVision Cameras 12345 Unknown\n666666 Dahua DVR meinsm Mobotix Network Camera admin1234 Unknown\nvizxv Dahua IP Camera 54321 Packet8 VOIP Phone default Unknown\n7ujMko0vizxv Dahua IP Camera 00000000 Panasonic Printer fucker Unknown\n7ujMko0admin Dahua IP Camera realtek RealTek Routers guest Unknown\n666666 Dahua IP Camera 1111111 Samsung IP Camera password Unknown\ndreambox Dreambox TV Receiver xmhdipc Shenzhen Anran Camera root Unknown\njuantech Guangzhou Juan Optical smcadmin SMC Routers service Unknown\nxc3511 H.264 Chinese DVR ikwb Toshiba Network Camera support Unknown\nOxhlwSG8 HiSilicon IP Camera ubnt Ubiquiti AirOS Router tech Unknown\ncat1029 HiSilicon IP Camera supervisor VideoIQ user Unknown\nhi3518 HiSilicon IP Camera <none> Vivotek IP Camera zlxx. Unknown\nklv123 HiSilicon IP Camera\n\nTable 5: Default Passwords —The 09/30/2016 Mirai source release included 46 unique passwords, some of which were traceable to\na device vendor and device type. Mirai primarily targeted IP cameras, DVRs, and consumer routers.\n\n|Password Device Type|Password Device Type|Password Device Type|\n|---|---|---|\n\n|123456 ACTi IP Camera anko ANKO Products DVR pass Axis IP Camera 888888 Dahua DVR 666666 Dahua DVR vizxv Dahua IP Camera 7ujMko0vizxv Dahua IP Camera 7ujMko0admin Dahua IP Camera 666666 Dahua IP Camera dreambox Dreambox TV Receiver juantech Guangzhou Juan Optical xc3511 H.264 Chinese DVR OxhlwSG8 HiSilicon IP Camera cat1029 HiSilicon IP Camera hi3518 HiSilicon IP Camera klv123 HiSilicon IP Camera|klv1234 HiSilicon IP Camera jvbzd HiSilicon IP Camera admin IPX-DDK Network Camera system IQinVision Cameras meinsm Mobotix Network Camera 54321 Packet8 VOIP Phone 00000000 Panasonic Printer realtek RealTek Routers 1111111 Samsung IP Camera xmhdipc Shenzhen Anran Camera smcadmin SMC Routers ikwb Toshiba Network Camera ubnt Ubiquiti AirOS Router supervisor VideoIQ <none> Vivotek IP Camera|1111 Xerox Printer Zte521 ZTE Router 1234 Unknown 12345 Unknown admin1234 Unknown default Unknown fucker Unknown guest Unknown password Unknown root Unknown service Unknown support Unknown tech Unknown user Unknown zlxx. Unknown|\n|---|---|---|\n\n\nabout underlying software (e.g., “postgres”) and not an associated device. The devices we identified were primarily\nnetwork-attached storage appliances, home routers, cameras, DVRs, printers, and TV receivers made by dozens\nof different manufacturers (Table 5).\nMirai’s intended targets do not necessarily reflect the\nbreakdown of infected devices in the wild. We leveraged\nthe device banners collected by Censys to determine the\nmodels and manufacturers of infected devices. Our results\nacross all five protocols indicate that security cameras,\nDVRs, and consumer routers represent the majority of\nMirai infections (Table 6). The manufacturers responsible for the most infected devices we could identify are:\nDahua, Huawei, ZTE, Cisco, ZyXEL, and MikroTik (Table 7).\nWe note that these results deviate from initial media\nreports, which stated that Mirai was predominantly composed of DVRs and cameras [34,53,60]. This is likely due\nto the evolution of the Mirai malware over time, which\nchanged the composition of infected devices. Looking at\nthe longitudinal Pearson correlation of top device vendors,\n\n\nwe observe modest stability with the exception of two\nevent periods: the rapid growth phase in mid-September\n2016 and the onset of CWMP in late November 2016\n(Figure 5b). During the rapid growth, the emergence of\nconsumer routers manufactured by ASUS, Netgear, and\nZhone supplanted D-Link routers and Controlbr DVRs\nin the top 20 devices. Dahua, Huawei, ZyXEL, and ZTE\ndevices consistently remained in the Top 20.\n\nOur data indicates that some of the world’s top manufacturers of consumer electronics lacked sufficient security practices to mitigate threats like Mirai, and these\nmanufacturers will play a key part in ameliorating vulnerability. Unfortunately, as discussed in the previous\nsection, the menagerie of devices spanned both countries\nand legal jurisdictions, exacerbating the challenge of coordinating technical fixes and promulgating new policy to\nsafeguard consumers in the future.\n\n\n-----\n\n**CWMP (28.30%)** **Telnet (26.44%)** **HTTPS (19.13%)** **FTP (17.82%)** **SSH (8.31%)**\n\n|Router 4.7% Other 0.0% Unknown 95.3%|Router 17.4% Camera/DVR 9.4% Other 0.1% Unknown 73.1%|Camera/DVR 36.8% Router 6.3% Storage 0.2% Firewall 0.1% Other 0.2% Unknown 56.4%|Router 49.5% Storage 1.0% Camera/DVR 0.4% Media 0.1% Other 0.0% Unknown 49.0%|Router 4.0% Storage 0.2% Firewall 0.2% Security 0.1% Other 0.0% Unknown 95.6%|\n|---|---|---|---|---|\n\n\nTable 6: Top Mirai Device Types —We list the top types of infected devices labeled by active scanning, as a fraction of Mirai\nbanners found in Censys. Our data suggests that consumer routers, cameras, and DVRs were the most prevalent identifiable devices.\n\n**CWMP (28.30%)** **Telnet (26.44%)** **HTTPS (19.13%)** **FTP (17.82%)** **SSH (8.31%)**\n\n|Huawei 3.6% ZTE 1.0% Other 2.3% Unknown 93.1%|Dahua 9.1% ZTE 6.7% Phicomm 1.2% Other 3.3% Unknown 79.6%|Dahua 36.4% MultiTech 26.8% ZTE 4.3% ZyXEL 2.9% Huawei 1.6% Other 7.3% Unknown 20.6%|D-Link 37.9% MikroTik 2.5% ipTIME 1.3% Other 3.8% Unknown 54.8%|MikroTik 3.4% Other 1.8% Unknown 94.8%|\n|---|---|---|---|---|\n\n\nTable 7: Top Mirai Device Vendors —We list the top vendors of infected Mirai devices labeled by active scanning, as a fraction\nof Mirai banners found by Censys. The top vendors across all protocols were primarily camera, router, and embedded device\nmanufacturers.\n\n\n#### 4.5 Device Bandwidth\n\nAs an additional confirmation of embedded composition,\nwe examined the bandwidth of infected devices as gleaned\nfrom their scan rate, which is not artificially rate-limited\nby the original source code. Starting with the observed\nscanning rate and volume on our network telescope, we\nextrapolate across the entire IPv4 Internet by factoring in\nthe size of our network telescope (4.7 million IPs) and\nthe size of Mirai’s default IP blacklist (340.2 million IPs).\nWe found about half of the Mirai bots that scanned our\nnetwork telescope sent fewer than 10,000 scan packets\n(Figure 6). We further note that the majority of bots\nscanned at an estimated rate below 250 bytes per second.\nWe note however this is a strict underestimate, as Mirai\nmay have interrupted scanning to process C2 commands\nand to conduct brute force login attempts. In contrast,\nSQL Slammer scanned at 1.5 megabytes/second, about\n6000 times faster [68], and the Witty worm scanned even\nfaster at 3 megabytes/second [81]. This additionally hints\nthat Mirai was primarily powered by devices with limited\ncomputational capacity and/or located in regions with low\nbandwidth [3].\n\n\n�\n\n���\n���\n���\n���\n���\n���\n��� ����������\n��� ������������������������\n��� ���������������������\n�\n\n����[�] ����[�] ����[�] ����[�] ����[�] ����[�] ����[�] ����[�] ����[�]\n\nFigure 6: Network Capacity Distribution —Scan duration,\nprobes, and bandwidth were extrapolated to reflect scanning\nnetwork capacity across the full IPv4 Internet. A majority of\nprobes scan below 250 Bps for over 2,700 seconds.\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|\n|---|---|---|---|---|---|---|---|---|---|\n|||||||||||\n|||||||||||\n|||||||||||\n|||||||||||\n|||||||||||\n|||||||\u000e\u000f\u0010 \u0011\u0012\u0013\u0014\u0015\u0016 \u000e\u000f\u0010 \u0014\u000f\u0010\u0017\u0018\u0019\u0017\u001a\u001b \u0014 \u001a\u0015\u0016 \u0016\u0015\u000e \u000e\u000f\u0010 \u0017 \u0012\u000f\u001a\u0019\u0013\u0010 \u0016\u0015\u000e\u0013\u0010\u0017\u0016||||\n|||||||||||\n\n\nMirai in order to uncover the relationships between strains,\ntheir relative sizes, and the evolution of their capabilities.\n\n#### 5.1 Ownership\n\n\n#### 5 Ownership and Evolution\n\nAfter the public release of Mirai’s source code in late\nSeptember 2016, multiple competing variants of the botnet emerged. We analyze the C2 infrastructure behind\n\n\nIn order to identify the structure of Mirai command and\ncontrol servers, we turned to active and passive DNS data,\nwhich we used to cluster C2 IPs and domains based on\nshared network infrastructure. Seeding DNS expansion\nwith the two IPs and 67 domains that we collected by\nreverse engineering Mirai binaries, we identified 33 independent C2 clusters that shared no infrastructure. These\nvaried from a single host to the largest cluster, which contained 112 C2 domains and 92 IP addresses. We show\nthe connectivity of the top six clusters by number of C2\ndomains in Figure 7. The lack of shared infrastructure between these clusters lends credence to the idea that there\n\n\n-----\n\n**ID** **Max Lookup Vol.** **Notes**\n\n6 61,440 Attacked Dyn, other gaming related attacks\n1 58,335 The original botnet. Attacked Krebs on Security, OVH\n2 36,378 Attacked Lonestar Cell. Scans TCP/7547 and TCP/5555, removes DoD from blacklist, adds DGA\n13 9,657 —\n7 9,467 Scans TCP/7547\n\nTable 8: Cluster Size Estimate and Characteristics —We highlight the top five clusters by max single-day lookup volume within\na large U.S. ISP, which provides an indicator of their relative size. Each cluster is additionally labeled with observed evolutionary\npatterns and associated attacks.\n\n\n**Cluster 6** nextorrent.netproht.usgettwrrnty.us **Cluster 0** **Cluster 2**\n\n\nyellowcatdeal.winfindcatspecial.win33catspecials.pweduk-central.netCluster 23cheapkittensspecial.win33puppiesspecials.winhightechcrime.clubyellowpuppyspecial.pwlottobooker.ru33kittensspecials.pwcheapestdoggyspecial.pwcheapestdogspecial.pwyellowpetsspecials.pwgreenkittensdeal.pwfinddogdeal.wincheapestdogspecials.wingreendoggyspecial.pwbluepuppyspecial.pwsiterhunter.com33catsdeal.pwrobositer.comgreenbirdsspecials.winfindbirdsspecials.pwpostrader.orgbluepuppiesdeals.pwpostrader.eupostrader.itnfoservers.comsistematitanium.comescolavitoria.com.brgeroncioribeiro.compontobreventos.compornopokrovitel.ruavtotyn.rugideonneto.comgeneral-city.rulr-top.ruacessando.com.br2ws.com.brvkladpodprocenti.ruwoodpallet.com.brdaf-razbor.ru2world.com.brupfarm.rutomlive.rudardiwaterjet.ruhotelkhiva.ruvideostrannik.rudomisto.rufirstclaz-shop.ruinfonta.rualexander-block.rupavelsigal.rustt-spb.rusert-cgb.rudom-italia39.ruwwrf.ruyouporn.wfshokwave.ruosinniki-tatu.rudibamovie.bizigm-shop.rufood-syst.ruchildrens-health.rupiratetorrents.net5153030.rusims-4.ruvideo-girle.rumoreoverus.compoliklinikasp.rukiditema.rukia-moskva.rutaylor-lautner.ruavtoatelie-at.ruinfoyarsk.runrzkobn.ruxn----7sbhguokj.xn--p1aixn--80aac5cct.xn--80aswgxn--b1acdqjrfck3b7e.xn--p1aizosjoupf.ruaodxhb.ruzogrm.rusecurityupdates.usmehinso.rutxocxs.ruqlrzb.rutransfer.clubfavy.clubtr069.onlineadmin-vk.rualexandramoore.co.uknovotele.online soplya.comzugzwang.mebocciatime.rutimeserver.hostinfobusiness-eto-prosto.rukinosibay.ru5d-xsite-cinema.ruwapud.rukernelorg.downloadfastgg.netsillycatmouth.uskopernick.rutr069.pwjgop.orgmyfootbalgamestoday.xyzocalhost.hostsvoibuhgalter.ruaaliya.rumediaforetak.comreceptprigotovlenia.rujealousyworld.ruta-bao.comsony-s.rucheckforupdates.onlineparty-bar66.ruudalenievmiatin.ruanalianus.comintervideo.topdolgoprud.topdyndn-web.comabsentvodka.compolycracks.comrutrax.ruintervideo.onlineagrohim33.rukvartplata1.rugam-mon.rumufoscam.orgas62454.nethyrokumata.comvoxility.orgvoxility.mobibluematt.mebitcoinstats.comvoxility.comvoxility.rosipa.bebitnodes.io\n\noccurelay.netq5f2k0evy7go2rax9m4g.rubebux.netdopegame.su69speak.euip-149-202-144.eusecure-limited-accounts.comgramtu.plnetwxrk.orgdopegame.ru mp3impulse.rurussianpotatoes.rusl22.rudisabled.racingprotopal.clubtitata.ruicmp.onlinedumpsterrentalwestpalmbeachfl....blockquadrat.dee3ybt.topsemazen.com.trhexacooperation.commadlamhockeyleague.comgermanfernandez.cl3200138.comipeb.biz\n\nservdiscount-customer.comedhelppro.bidlayerjet.com kunathemes.comchiviti.comsecure-support.services6969max.comsecure-payment.onlinelateto.workmy2016mobileapplications.techserverhost.nameip-151-80-27.eudoki.cokentalmanis.infocloudtechaz.netaddsow.topmiddlechildink.comhappy-hack.ruzvezdogram.combrendasaviationplans.xyzzeldalife.comrencontreadopoursitedetours.xyzcritical-damage.orgnerafashion.com\n\n**Cluster 7** megadealsdiscounter.onlinestarpricediscounted.onlinegreatdealninja.onlinetopdealdiscounted.onlinebestsavingfinder.onlinebigdealsfinder.onlinebestpricecastle.onlinesuperpriceshopper.onlinemegadealsfinder.onlinesuperpriceshopping.onlinesantasbigcandycane.cxthqaf.comgrotekleinekerkstraat.nlrealsaunasuit.comsmsall.pkcenturystyleantiques.comboatnetswootnet.xyzkcgraphics.co.ukstbenedictschoolbx.orgplaykenogamesonline.comsteamon.ruskinplat.ruthcrcz.topskincoin24.ruok6666.netCluster 1\n\njoomlavision.comamgauto.vn gameshoper.ru gowars.ru tradewallet.ru\n\ntamthat.comirisstudio.vndacsanthitchua.comkleverfood.vnngot.netnamlimxanh.net.vnssldomainerrordisp2003.comherokids.vnousquadrant.comspevat.netapkmarket.mobikeyzet.rumuplay.ruskincoin.rukeygolds.rukeydealer.ruteamcoin.rusteamcoin24.rukeycoins.ruwalletzone.rutradewallet24.ru\n\ngamegolds.rugamewallet.ruplayerstore.ru\n\nFigure 7: C2 Domain Relationships —We visualize related\nC2 infrastructure, depicting C2 domains as nodes and shared\nIPs as edges between two domains. The top six clusters by C2\ndomain count consisted of highly connected components, which\nrepresent agile, long-lived infrastructures in use by botmasters.\n\nare multiple active bot operators during our study period.\nWhile Figure 7 provides a rough sense of Mirai C2 complexity, it does not indicate the number of bots that each\ncluster controlled. To estimate botnet membership, we\nmeasured the DNS lookup volume per cluster. In Figure 8,\nwe show the top clusters of domains based on the volume\nof DNS lookups at a large, name-redacted ISP. This single perspective is not comprehensive, but it allows us to\nobserve the rise and fall of different botnets over time,\nand may provide a hint of their relative sizes. A prime\nexample is cluster 1, which was the initial version of the\nMirai botnet involved in the early, high-profile attacks on\nKrebs on Security and OVH. Although it dominated in\nlookup volume in late September and early October, it\ngave way to newer clusters, 2 and 6, in mid-October. We\nprovide a list of the largest clusters by lookup and their\nunique characteristics in Table 8.\n\n\nWhile we cannot conclusively link each of these clusters to distinct operators, we note that each cluster utilized\nindependent DNS infrastructure and evolving malware,\nunderscoring the challenge of defending against these\nattacks through bespoke mitigations. Our results also\nconfirm the recent findings of Lever et al., who observed\nthat the naming infrastructure used by malware is often\nactive weeks prior to its operation [54]. In all cases, the\nfirst occurrence of DNS/IP lookup traffic for a cluster far\npreceded the date that the domains were used as C2 infrastructure for the botnet. For example, even though the\npeak lookup for cluster 2 occurred on October 21, 2016,\nthe first lookup of a C2 domain in this cluster occurred\non August 1, 2016 (Table 8). This also significantly predated the first binary collected for this cluster (October 24,\n2016), and the first attacks issued by the cluster (October 26, 2016). These results suggest that careful analysis\nof DNS infrastructure can potentially guide preventative\nmeasures.\n\n#### 5.2 Evolution\n\nAlthough the Mirai ecosystem exploded after the public\nsource code release on September 30, 2016, this was not\nthe botnet’s first major evolutionary step. Between August\n7, 2016 and September 30, 2016—when the source code\nwas publicly released—24 unique Mirai binaries were\nuploaded to VirusTotal, which we used to explore the\nbotnet’s initial maturation. Several key developments occurred during this period. First, we saw the underlying C2\ninfrastructure upgrade from an IP-based C2 to a domainbased C2 in mid-September. Second, the malware began\nto delete its executing binary, as well as obfuscate its process ID, also in mid-September. We additionally saw a\nnumber of features added to make the malware more virulent, including the addition of more passwords to infect\nadditional devices, the closing of infection ports TCP/23\nand TCP/2323, and the aggressive killing of competitive\nmalware in a sample collected on September 29, 2016.\nAfter the public release, we observed the rapid emergence of new features, ranging from improved infection\ncapabilities to hardened binaries that slow reverse engi\n\n-----\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n����[�]\n\n�\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|\n|---|---|---|---|---|---|---|---|---|---|---|\n||||||||||||\n||||||||||||\n||||||||||||\n||||||||||||\n||||||||||||\n||||||||||||\n||||||||||||\n\n\n�������� �������� �������� �������� �������� �������� ��������\n\n\n����\n\nFigure 8: C2 Cluster Lookup Volume —The DNS lookup volume of C2 DNS clusters in a large U.S. ISP establishes the relative\nsize of the botnet behind each cluster and chronicles its rise and fall. Note, for example, cluster 1 which represents the original botnet\nin use for the early high profile attacks on Krebs and OVH and the emergence of a myriad of clusters after the public source release.\n\n\nneering efforts. Between November 2, 2016 and February\n28, 2017, we observed 48 new sets of usernames and\npasswords, as well as changes to the IP blacklist. We note\nthat while many actors modified the set of credentials,\nthey often did so in different ways (Figure 9). This is\ntrue for other features as well. In one example, a variant\nevolved to remove U.S. Department of Defense blocks\nfrom the initial scanning blacklist. The malware further\nevolved to use new infection mechanisms. Most notably,\nin late November 2016, Mirai variants began to scan for\nTCP/7547 and TCP/5555, two ports commonly associated\nwith CWMP [15,93]. Additionally, one malware strain\nbegan to using domain generation algorithms (DGA) in\nthe place of a hardcoded C2 domain, though this feature\nwas short lived. By November 2016, packed binaries had\nemerged.\nTechniques to improve virulence and to aide in reliability were not simply limited to the client binaries. We\nfound evidence of operators using DNS to avoid or attempt to evade detection as well. Recent work by Lever\net al. demonstrated how attackers abuse the residual trust\ninherited by domains to perform many, seemingly unconnected types of abuse [55]. Mirai was no different\nfrom other types of malware—we found evidence that at\nleast 17% of Mirai domains abused residual trust. Specifically, these domains expired and were subsequently reregistered before they were used to facilitate connections\nbetween bots and C2 servers. This serves as a reminder\nthat although Mirai is unique in many ways, it still shares\nmuch in common with the many threats that came before\nit.\nBy combining the malware we observed with our DNS\ndata, we can also measure the evolution of the C2 clusters\nin Table 8. We note that cluster 2—the third largest by\nlookup volume—evolved to support many new features,\nsuch as scanning new ports TCP/7547 and TCP/5555,\nadding DGA, and modifying the source code blacklist to\nexclude Department of Defense (DoD) blocks. This is\nnot to say, however, that evolution guaranteed success.\n\n\nFigure 9: Password Evolution —The lineage of unique password dictionaries, labeled with their associated clusters, depicts\nmany malware strains modifying the default credential list to\ntarget additional devices. The node marked (*) indicates the\nreleased source code password dictionary and serves as the\nfoundation for the all divergent password variants\n\nCluster 23, which can be seen clearly in Figure 9, evolved\nvery rapidly, adding several new passwords over its active\ntime. Despite this evolution, this cluster was 19th out of\n33 clusters in terms of lookup volume over time and was\nunable to capture much of the vulnerable population. We\nalso note that not all successful clusters evolved either; for\nexample, cluster 6, which showed no evolutionary trend\nfrom its binaries, received the highest lookup volume of\nall the clusters.\n\n\n#### 6 Mirai’s DDoS Attacks\n\nThe Mirai botnet and its variants conducted tens of thousands of DDoS attacks during our monitoring period. We\nexplore the strategies behind these attacks, characterize\ntheir targets, and highlight case studies on high-profile\ntargets Krebs on Security, Dyn, and Liberia’s Lonestar\nCell. We find that Mirai bore a resemblance to booter ser\n\n-----\n\n**Attack Type** **Attacks** **Targets** **Class**\n\nHTTP flood 2,736 1,035 A\nUDP-PLAIN flood 2,542 1,278 V\nUDP flood 2,440 1,479 V\nACK flood 2,173 875 S\nSYN flood 1,935 764 S\nGRE-IP flood 994 587 A\nACK-STOMP flood 830 359 S\nVSE flood 809 550 A\nDNS flood 417 173 A\nGRE-ETH flood 318 210 A\n\nTable 9: C2 Attack Commands —Mirai launched 15,194 attacks between September 27, 2016–February 28, 2017. These\ninclude [A]pplication-layer attacks, [V]olumetric attacks, and\nTCP [S]tate exhaustion, all of which are equally prevalent.\n\nvices (which enable customers to pay for DDoS attacks\nagainst desired targets), with some Mirai operators targeting popular gaming platforms such as Steam, Minecraft,\nand Runescape.\n\n#### 6.1 Types of Attacks\n\nOver the course of our five month botnet infiltration,\nwe observed Mirai operators issuing 15,194 DDoS attack commands, excluding duplicate attacks (discussed\nin Section 3). These attacks employed a range of different resource exhaustion strategies: 32.8% were volumetric, 39.8% were TCP state exhaustion, and 34.5%\nwere application-layer attacks (Table 9). This breakdown\ndiffers substantially from the current landscape of DDoS\nattacks observed by Arbor Networks [7], where 65% of\nattacks are volumetric, 18% attempt TCP state exhaustion, and 18% are higher-level application attacks. While\namplification attacks [79] make up 74% of attacks issued\nby DDoS-for-hire booter services [40], only 2.8% of Mirai attack commands relied on bandwidth amplification,\ndespite built-in support in Mirai’s source code. This absence highlights Mirai’s substantial capabilities despite\nthe resource constraints of the devices involved.\n\n#### 6.2 Attack Targets\n\nStudying the victims targeted by Mirai sheds light on its\noperators. We analyzed the attack commands issued by\nMirai C2 servers (as detailed in Section 3) to examine who\nMirai targeted. In total, we observed 15,194 attacks issued\nby 484 C2 IPs that overlapped with 24 DNS clusters (Section 5). The attacks targeted 5,046 victims, comprised of\n4,730 (93.7%) individual IPs, 196 (3.9%) subnets, and 120\n(2.4%) domain names. These victims ranged from game\nservers, telecoms, and anti-DDoS providers, to political\nwebsites and relatively obscure Russian sites (Table 10).\n\n\nThe Mirai source code supports targeting of IPv4 subnets, which spreads the botnet’s DDoS firepower across\nan entire network range. Mirai issued 654 attacks (4.3%)\nthat targeted one or more subnets, with the three most\nfrequently targeted being Psychz Networks (102 attacks,\n0.7%), a data center offering dedicated servers and DDoS\nmitigation services, and two subnets belonging to Lonestar Cell (65 combined attacks, 0.4%), a Liberian telecom.\nWe also saw evidence of attacks that indiscriminately targeted large swathes of the IPv4 address space, including\n5 distinct /8 subnets and one attack on /0 subnet—the\nentire IPv4 space. Each of the /8 and /0 subnets, (with\nthe exception of the local 10.0.0.0/8) contain a large\nnumber of distributed network operators and total IP addresses, which drastically exceed the number of Mirai\nbots. As such, the Mirai attacks against these subnets\nlikely had modest impact.\nIf we exclude targeted subnet (due to their unfocused\nblanket dispersion across many networks), we find that\nMirai victims were distributed across 906 ASes and\n85 countries. The targets were heavily concentrated in the\nU.S. (50.3%), France (6.6%), the U.K. (6.1%), and a long\ntail of other countries. Network distribution was more\nevenly spread. The top 3 ASes—OVH (7.8%), Cloudflare (6.6%) and Comcast (3.6%)—only accounted for\n18.0% of victims.\nThe three most frequently targeted victims were\nLiberia’s Lonestar Cell (4.1%), Sky Network (2.1%), and\n```\n1.1.1.1 (1.6%). We examine Lonestar Cell in depth in\n\n```\nSection 6.3. Sky Network is a Brazilian company that\noperates servers for Minecraft (a popular game), which is\nhosted by Psychz Networks. The attacks against Psychz\nbegan on November 15, 2016 and occurred sporadically\nuntil January 26, 2017. 1.1.1.1 was likely used for testing [95]. Additional game targets in the top 14 victims included a former game commerce site longqikeji.com, and\nRunescape, another popular online game. The prevalence\nof game-related targets along with the broad range of other\notherwise unrelated victims shares many characteristics\nwith previously studied DDoS booter services [39].\nFor volumetric and TCP state exhaustion attacks, Mirai optionally specified a target port, which implied the\ntype of service targeted. We find a similar prevalence\nof game targets—of the 5,450 attacks with a specified port, the most commonly attacked were 80 (HTTP,\n37.5%), 53 (DNS, 11.5%), 25565 (commonly Minecraft\nservers [31,65], 9.2%), 443 (HTTPS, 6.4%), 20000 (often\nDNP3, 3.4%), and 23594 (Runescape game server, 3.4%).\nInterestingly, the 7th most common attack target was an\nIP address hosted by Voxility that was associated with one\nof the Mirai C2 servers, and we note that 47 of 484 Mirai\nC2 IPs were themselves the target of a Mirai DDoS attack.\nBy clustering these 484 C2 IPs by attack command, we\nidentified 93 unique clusters, of which 26 (28%) were\n\n\n-----\n\n**Target** **Attacks** **Cluster** **Notes**\n\n\nLonestar Cell 616 2 Liberian telecom targeted by 102 reflection attacks.\nSky Network 318 15, 26, 6 Brazilian Minecraft servers hosted in Psychz Networks data centers.\n1.1.1.1 236 1,6,7,11,15,27,28,30 Test endpoint. Subject to all attack types.\n104.85.165.1 192 1,2,6,8,11,15,21,23,26,27,28,30 Unknown router in Akamai’s AS.\nfeseli.com 157 7 Russian cooking blog.\nminomortaruolo.it 157 7 Italian politician site.\nVoxility hosted C2 106 1,2,6,7,15,26,27,28,30 C2 domain from DNS expansion. Exists in cluster 2 seen in Table 8.\nTuidang websites 100 — HTTP attacks on two Chinese political dissidence sites.\nexecrypt.com 96 — Binary obfuscation service.\nauktionshilfe.info 85 2,13 Russian auction site.\nhoutai.longqikeji.com 85 25 SYN attacks on a former game commerce site.\nRunescape 73 — World 26 of a popular online game.\n184.84.240.54 72 1,10,11,15,27,28,30 Unknown target hosted at Akamai.\nantiddos.solutions 71 — AntiDDoS service offered at react.su.\n\nTable 10: Mirai DDoS Targets —The top 14 victims most frequently targeted by Mirai run a variety of services. Online games, a\nLiberian cell provider, DDoS protection services, political sites, and other arbitrary sites match the victim heterogeneity of booter\nservices. Many clusters targeted the same victims, suggesting a common operator.\n\n\n**Attack Target** **Date** **Sample Size** **Intersection**\n\nAkamai[†] 09/21/2016 12,847 96.4%\nGoogle Shield[†] 09/25/2016 158,839 96.4%\nDyn[⋄] 10/21/2016 107,464 70.8%\n\nTable 11: Mirai Attack IPs —Client IPs from attacks on Krebs\non Security (denoted [†]) and Dyn (denoted _[⋄]) intersected signifi-_\ncantly with Mirai-fingerprinted scanning our network telescope,\nconfirming that both attacks were Mirai-based, but the lower\nDyn intersection hints that other hosts may have been involved.\n\n\n���\n\n��� ������������\n\n��������������������\n\n���\n\n���\n\n���\n\n��� ������� ������������������\n\n������������\n\n��� �������\n\n����������������\n\n���\n\n�\n\n�������� �������� �������� �������� �������� �������� ��������\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|\u0007\u0003\u0004 \u000f\u0010\u0011\u0012 \u0013|Col11|\u0014\u0015 \u0014|Col13|Col14|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n||||||||\u0016\u0017\u0018||\u0019\u001a\u001b \u000f||!\"\"#|||\n|||||||||||||||\n|||||||||||||||\n||||||||||\u0003\u0004\u0001 \u000f\u0010\u0011\u0012|||||\n|\u0002 %\u001a\u0013|&\u0007 \u000f\u0010\u0011\u0012 \u0018 !\"\"#||||\u0002||$ \u0003\b \u000f\u0010\u0011\u0012||\u0018\u0016 !\"\"#|||||\n||||||$ %\u001a||\u0013 \u0018 !\"\"#|||||||\n|||||||||||||||\n\n\ntargeted least once. This direct adversarial behavior reaffirms the notion of multiple, competitive botnet operators.\n\n#### 6.3 High Profile Attacks\n\n\n����\n\nFigure 10: Historical DDoS Attacks Targeting Krebs on Se**curity** —Brian Krebs’ blog was the victim of 269 DDoS attacks\nfrom 7/24/2012–9/22/2016. The 623 Gbps Mirai attack on\n9/21/2016 was 35 times larger than the average attack, and the\nlargest ever recorded for the site.\n\n\nSeveral high profile DDoS attacks brought Mirai into the\nlimelight beginning in September 2016. We analyze the\nfollowing three Mirai victims as case studies: Krebs on\nSecurity, Dyn, and the Liberian telecom provider Lonestar.\n\n**Krebs on Security** The popular Krebs on Security blog\nhas had a long history of being targeted by DDoS attacks\n(Figure 10), and on September 21, 2016 was subject to\nan unprecedented 623 Gbps DDoS attack—with Mirai as\nthe prime suspect. Placing this attack in context, it was\nsignificantly larger than the previously reported largest\npublicly-disclosed DDoS attack victim (i.e., Spamhaus at\n300+ Gbps [77]), but we note that attacks to non-disclosed\ntargets of 500 Gbps and 800 Gbps were reported in 2015\nand 2016 respectively [7]. To confirm the origin of the\nattack, we intersected a list of 12,847 attack IPs observed\nby Akamai with the Mirai IPs we saw actively scanning\nduring that period. We found a 96.4% overlap in hosts.\nGoogle Shield, who later took over DDoS protection of\n\n\nthe site, separately maintained a larger sample of 158,839\nattack IPs for an HTTP attack on September 25, 2016.\nWhen given the Mirai scanning IPs from that day, they\nfound 96% of their attack IPs overlapped. Our results\nillustrate the potency of the Mirai botnet, despite its composition of low-end devices concentrated in Southeast\nAsia and South America. We also identified which C2\nclusters were responsible for some of the largest attacks\nby correlating attack commands with naming infrastructure, and we note that cluster 1 (Figure 7) was responsible\nfor this attack.\n\n**Dyn** On October 21, 2016, Dyn, a popular DNS\nprovider suffered a series of DDoS attacks that disrupted\nname resolution for their clients, including high-traffic\nsites such as Amazon, Github, Netflix, PayPal, Reddit,\nand Twitter [71]. Consistent with Dyn’s postmortem report [36], we observed 23 attack commands that targeted\nDyn infrastructure, from 11:07–16:55 UTC. The first\n21 attacks were primarily short-lived (i.e., 25 second)\n\n\n-----\n\nSYN floods on DNS port 53, along with a few ACK and\nGRE IP attacks, and followed by sustained 1 hour and\n5 hour SYN attacks on TCP/53. We note a 71% intersection between the 107K IPs that attacked Dyn and Mirai\nscanning in our network telescope. This indicates that,\nwhile the attack clearly involved Mirai, there may have\nbeen other hosts involved as well.\nAlthough the first several attacks in this period solely\ntargeted Dyn’s DNS infrastructure, later attack commands\nsimultaneously targeted Dyn and PlayStation infrastructure, potentially providing clues towards attacker motivation. Interestingly, the targeted Dyn and PlayStation IPs are all linked to PlayStation name servers—\nthe domain names ns<00–03>.playstation.net resolve to IPs with reverse DNS records pointing to\n```\nns<1-4>.p05.dynect.net, and the domain names\nns<05–06>.playstation.net resolve to the targeted\n\n```\nPlayStation infrastructure IPs.\nThe attacks on Dyn were interspersed amongst other\nattacks targeting Xbox Live, Microsoft DNS infrastructure, PlayStation, Nuclear Fallout game hosting servers,\nand other cloud servers. These non-Dyn attacks are either\nACK/GRE IP floods, or VSE, which suggests that the\ntargets were Valve Steam servers. At 22:17 UTC, the\nbotnet issued a final 10 hour-long attack on a set of Dyn\nand PlayStation infrastructure. This pattern of behavior\nsuggests that the Dyn attack on October 21, 2016 was not\nsolely aimed at Dyn. The attacker was likely targeting\ngaming infrastructure that incidentally disrupted service\nto Dyn’s broader customer base. The attack was carried\nout by Cluster 6.\n\n**Lonestar Cell** Attacks on Lonestar Cell, a large telecom operator in Liberia and the most targeted victim\nof Mirai (by attack account), have received significant\nattention due to speculation that Mirai substantially deteriorated Liberia’s overall Internet connectivity [14,42].\nOthers have questioned these claims [45]. We cannot provide insight into Liberia’s network availability; instead,\nwe analyze attack commands we observed. Beginning\nat 10:45 UTC on October 31, 2016 until December 13,\n2016, a single botnet C2 cluster (id 2) issues a series of\n341 attacks against hosts in the Lonestar AS. 87% of the\nattacks are SYN or ACK floods and targeted both full subnets and addresses within 168.253.25.0/24, 41.57.81.0/24,\nand 41.57.85.0/24, all of which belong to Lonestar Cell\nor its parent company, MTN Group.\nIn addition to IP targets, we observe an NXDOMAIN attack issued on November 8, 2016 that targeted\n```\nsimregistration.lonestarcell.com. A single C2\n\n```\nIP never seen previously or subsequently issued a single\nattack on December 14. Attacks on Lonestar infrastructure continued again at 09:24 UTC on January 16, 2017\nand persisted until February 8, 2017, issuing 273 attacks\n\n\nfrom a single C2 IP address. In total there were 616 attacks, 102 of which used reflect traffic against Voxility,\nGoogle, Facebook, and Amazon servers towards Lonestar\nnetworks. The attack was carried out by C2 cluster 2\nand used the C2 domains: “mufoscam.org”, “securityupdates.us”, “jgop.org”, and “zugzwang.me”.\n\nAs we have seen, Mirai primarily used direct, nonreflective attacks on a wide range of protocols including\nthe less common GRE and VSE protocols. Even without\nrelying on amplification attacks, Mirai was still able to inflict serious damage as evidenced by high-profile attacks\nagainst Krebs on Security, Dyn, and Lonestar Cell. Furthermore, the juxtaposition of attacker geography (largely\nSoutheast Asia and South America) and victim geography\n(majority in the U.S.) places a spotlight on the importance\nof global solutions, both technical and non-technical, to\nprevent the rise of similar botnets. Otherwise, adversaries\nwill continue to abuse the most fragile hosts to disrupt the\noverall Internet ecosystem.\n\n#### 7 Discussion\n\nMirai has brought into focus the technical and regulatory\nchallenges of securing a menagerie of consumer-managed,\ninterfaceless IoT devices. Attackers are taking advantage\nof a reversal in the last two decades of security trends\nespecially prevalent in IoT devices. In contrast to desktop\nand mobile systems, where a small number of securityconscious vendors control the most sensitive parts of the\nsoftware stack (e.g. Windows, iOS, Android)—IoT devices are much more heterogeneous and, from a security perspective, mostly neglected. In seeking appropriate technical and policy-based defenses for today’s IoT\necosystem, we draw on the experience of dealing with\ndesktop worms from the 2000s.\n\n**Security hardening** The Mirai botnet demonstrated\nthat even an unsophisticated dictionary attack could compromise hundreds of thousands of Internet-connected devices. While randomized default passwords would be a\nfirst step, it is likely that attacks of the future will evolve\nto target software vulnerabilities in IoT devices much like\nthe early Code Red and Confickr worms [8,70]. To mitigate this threat before it starts, IoT security must evolve\naway from default-open ports to default-closed and adopt\nsecurity hardening best practices. Devices should consider default networking configurations that limit remote\naddress access to those devices to local networks or specific providers. Apart from network security, IoT developers need to apply ASLR, isolation boundaries, and\nprinciples of least privilege into their designs. From a\ncompliance perspective, certifications might help guide\nconsumers to more secure choices as well as pressure\nmanufacturers to produce more secure products.\n\n\n-----\n\n**Automatic updates** Automatic updates—already\ncanonical in the desktop and mobile operating system\nspace—provide developers a timely mechanism to patch\nbugs and vulnerabilities without burdening consumers\nwith maintenance tasks or requiring a recall. Automatic\nupdates require a modular software architecture by design to securely overwrite core modules with rollback\ncapabilities in the event of a failure. They also require\ncryptographic primitives for resource-constrained devices\nand building PKI infrastructure to support trusted updates.\nApart from these challenges, patching also requires the\nIoT community to actively police itself for vulnerabilities,\na potentially burdensome responsibility given the sheer\ndiversity of devices. Bug bounties can help in this respect:\nroughly 25% of all vulnerabilities patched by Chrome\nand Firefox came from bug bounties in 2015 [28], while\nNetgear launched a bug bounty for its router software in\nJanuary, 2017 [75]. In the event of a zero-day exploit that\ndisables automatic updates, IoT developers must provide\na secure fallback mechanism that likely requires physical\naccess and consumer intervention.\nThe Deutsche Telekom infection and subsequent fix\nprovide an excellent case study of this point. DT’s routers\nhad a vulnerability that enabled the botnet to spread via its\nupdate mechanism, which provides a reminder that basic\nsecurity hardening should be the first priority. However,\nsince DT did have an automatic update mechanism, it was\nalso able to patch devices rather swiftly, requiring minimal user intervention. Implementing automatic updates\non IoT devices is not impossible, but does take care to do\ncorrectly.\n\n**Notifications** Notifications via out-of-band channels\nserve as a fallback mechanism to bring devices back into\nsecurity compliance or to clear infections. Recent examples include alerting device administrators via CERT\nbulletins, emailing the abuse contact in WHOIS records,\nand in-browser warnings to site owners that a page is\ncompromised [24,56,57]. Notifications in the IoT space\nare complicated to say the least. IoT devices lack both a\npublic indication of ownership and an established communication channel to reach consumers. Were consumers\nreachable, there must also be a clear and simple update\npath to address the problem. As a minimum alternative,\nIoT devices could be required to register an email address\nwith the manufacturer or with a unified, interoperable\nmonitoring platform that can alert consumers of serious\nissues. This is a space where IoT requires non-technical\nintervention. The usability challenge of acting on notifications remains an open research problem.\n\n**Facilitating device identification** Even when device\nmodels or firmware versions are known to be vulnerable,\ndetecting such devices on the network can be extremely\ndifficult. This made our investigation more challenging,\n\n\nbut it also makes it hard for network operators to detect\nvulnerabilities in their or their customers’ devices. To\nmitigate this, IoT manufacturers could adopt a uniform\nway of identifying model and firmware version to the\nnetwork—say, encoding them in a portion of the device’s\nMAC address. Disclosing this information at layer 2\nwould make it visible to local network operators (or to\nthe user’s home router), which could someday take automated steps to disable remote access to known-vulnerable\nhardware until it is updated. Achieving this in a uniform\nway across the industry would likely require the adoption\nof standards.\n\n**Defragmentation** Fragmentation poses a security (and\ninteroperability) risk to maintaining and managing IoT devices. We observed numerous implementations of Telnet,\nFTP, and HTTP stacks during scanning. The IoT community has responded to this challenge by adopting a handful\nof operating systems, examples of which include Android\nThing, RIOT OS, Tock, and Windows for IoT [30]. This\npush towards defragmentation would abstract away the\nsecurity nuances required of our prescriptive solutions.\n\n**End-of-life** Even with security best practices in mind,\nend-of-life can leave hundreds of thousands of in-use IoT\ndevices without support. Lack of long-term support will\nyield a two class system of protected and unprotected\ndevices similar to the current state of Windows XP machines [63]. Over time, the risk that these devices pose to\nthe Internet commons will only grow unless taken offline.\n\n#### 8 Related Work\n\nSince as early as 2005, the security community has\nbeen working to understand, mitigate, and disrupt botnets [17]. For example, Zand et al. proposed a detection\nmethod based on identifying command and control signatures [97], and Gu et al. focused on analyzing network\ntraffic to aid in detection and mitigation [32,33]. Unfortunately, mitigation remains a difficult problem as botnets\noften evolve to avoid disruption [6].\nThis work follows in a long line studies that have analyzed the structure, behavior, and evolution of the botnet\necosystem [12,37,76,84,85,91,96]. Bailey et al. note that\neach technique used in understanding botnets has a unique\nset of trade offs, and only by combining perspectives can\nwe fully analyze the entire picture [11]. This observation\nand the seminal work of Rajab et al., implicating botnet\nactivity in 27% of all network telescope traffic, inspire\nour approach [2].\nBotnets have historically been used to launch DDoS\nattacks, and there exists a parallel set of studies focusing\non characterizing and defending against these attacks [66,\n67], as well as estimating their effect [69]. In response to\nthe recent growth of amplification attacks, there have been\n\n\n-----\n\nseveral studies investigating vulnerable amplifiers [20,51,\n79]. As DDoS attacks and infrastructure are becoming\nmore commonplace, attention has turned to exploring the\nDDoS for hire ecosystem [40].\nSince the emergence of IoT devices, security researchers have warned of their many inherent security\nflaws [80]. Researchers have found that IoT devices contain vulnerabilities from the firmware level [18, 19] up\nto the application level [26, 29, 73, 78]. Mirai is also\nnot the first of its kind to target IoT devices—several\nprecursors to Mirai exist, all of which exploit the weak\npassword nature of these devices [38,52,59,62,72]. As a\nresult of these widespread security failures, the security\ncommunity has been quick to design systems to secure\nthese kinds of devices. In one example, Fernandes et al.\nproposed Flowfence, which enables data flow protection\nfor emerging IoT frameworks [27]. Much more work\nis needed if we are to understand and secure this new\nfrontier.\nIn this work, we utilize a multitude of well-established\nbotnet measurement perspectives, which substantiate concerns about IoT security. We demonstrate the damage\nthat an IoT botnet can inflict upon the public Internet,\neclipsing the DDoS capabilities of prior botnets. We use\npreviously introduced solutions as guidelines for our own\nproposals for combating the Mirai botnet, and IoT botnets\nat large.\n\n#### 9 Conclusion\n\nThe Mirai botnet, composed primarily of embedded and\nIoT devices, took the Internet by storm in late 2016 when\nit overwhelmed several high-profile targets with some of\nthe largest distributed denial-of-service (DDoS) attacks\non record. In this work, we provided a comprehensive\nanalysis of Mirai’s emergence and evolution, the devices\nit targeted and infected, and the attacks it executed. We\nfind that while IoT devices present many unique security\nchallenges, Mirai’s emergence was primarily based on\nthe absence of security best practices in the IoT space,\nwhich resulted in a fragile environment ripe for abuse. As\nthe IoT domain continues to expand and evolve, we hope\nMirai serves as a call to arms for industrial, academic, and\ngovernment stakeholders concerned about the security,\nprivacy, and safety of an IoT-enabled world.\n\n#### Acknowledgments\n\nThe authors thank David Adrian, Brian Krebs, Vern Paxson, and the Censys Team for their help and feedback.\nThis work was supported in part by the National Science Foundation under contracts CNS-1345254, CNS1409505, CNS-1518888, CNS-1505790, CNS-1530915,\n\n\nCNS-1518741 and through gifts from Intel and Google.\nThe work was additionally supported by the U.S. Department of Commerce grant 2106DEK, Air Force Research\nLaboratory/Defense Advanced Research Projects Agency\ngrant 2106DTX, the Department of Homeland Security\nScience and Technology Directorate FA8750-12-2-0314,\nand a Google Ph.D. Fellowship. Any opinions, findings,\nconclusions, or recommendations expressed in this material are those of the authors and do not necessarily reflect\nthe views of their employers or the sponsors.\n\n#### References\n\n[[1] Team Cymru. http://www.team-cymru.org/.](http://www.team-cymru.org/)\n\n[2] M. Abu Rajab, J. Zarfoss, F. Monrose, and A. Terzis. A multifaceted approach to understanding the botnet phenomenon. In 6th\n_ACM Internet Measurement Conference, 2006._\n\n[[3] Akamai. Q4 2016 state of the Internet - connectivity report. https://](https://www.akamai.com/us/en/multimedia/documents/state-of-the-internet/q4-2016-state-of-the-internet-connectivity-report.pdf)\n[www.akamai.com/us/en/multimedia/documents/state-of-the-](https://www.akamai.com/us/en/multimedia/documents/state-of-the-internet/q4-2016-state-of-the-internet-connectivity-report.pdf)\n[internet/q4-2016-state-of-the-internet-connectivity-report.pdf.](https://www.akamai.com/us/en/multimedia/documents/state-of-the-internet/q4-2016-state-of-the-internet-connectivity-report.pdf)\n\n[4] Anna-senpai. [FREE] world’s largest net:Mirai botnet, client,\n[echo loader, CNC source code release. https://hackforums.net/](https://hackforums.net/showthread.php?tid=5420472)\n[showthread.php?tid=5420472.](https://hackforums.net/showthread.php?tid=5420472)\n\n[5] M. Antonakakis, R. Perdisci, D. Dagon, W. Lee, and N. Feamster.\nBuilding a dynamic reputation system for DNS. In 19th USENIX\n_Security Symposium, 2010._\n\n[6] M. Antonakakis, R. Perdisci, Y. Nadji, N. Vasiloglou, S. AbuNimeh, W. Lee, and D. Dagon. From throw-away traffic to bots:\nDetecting the rise of DGA-based malware. In 21st USENIX Secu_rity Symposium, 2012._\n\n[7] Arbor Networks. Worldwide infrastructure security report. [https://www.arbornetworks.com/images/documents/](https://www.arbornetworks.com/images/documents/WISR2016_EN_Web.pdf)\n[WISR2016_EN_Web.pdf.](https://www.arbornetworks.com/images/documents/WISR2016_EN_Web.pdf)\n\n[8] H. Asghari, M. Ciere, and M. J. G. Van Eeten. Post-mortem of\na zombie: Conficker cleanup after six years. In 24th USENIX\n_Security Symposium, 2015._\n\n[9] M. Bailey, E. Cooke, F. Jahanian, and J. Nazario. The Internet\nMotion Sensor - A Distributed Blackhole Monitoring System. In\n_12th Network and Distributed Systems Security Symposium, 2005._\n\n[10] M. Bailey, E. Cooke, F. Jahanian, and D. Watson. The Blaster\nworm: Then and now. IEEE Security & Privacy, 2005.\n\n[11] M. Bailey, E. Cooke, F. Jahanian, Y. Xu, and M. Karir. A survey\nof botnet technology and defenses. In Cybersecurity Applications\n_& Technology Conference For Homeland Security, 2009._\n\n[12] P. Barford and V. Yegneswaran. An Inside Look at Botnets. 2007.\n\n[[13] BBC. Router hacker suspect arrested at Luton airport. http://](http://www.bbc.com/news/technology-37510502)\n[www.bbc.com/news/technology-37510502.](http://www.bbc.com/news/technology-37510502)\n\n[14] K. Beaumont. \"Shadows Kill\"–—Mirai DDoS botnet testing\nlarge scale attacks, sending threatening messages about UK and\n[attacking researchers. https://medium.com/@networksecurity/](https://medium.com/@networksecurity/shadows-kill-mirai-ddos-botnet-testing-large-scale-attacks-sending-threatening-messages-about-6a61553d1c7)\n[shadows-kill-mirai-ddos-botnet-testing-large-scale-attacks-](https://medium.com/@networksecurity/shadows-kill-mirai-ddos-botnet-testing-large-scale-attacks-sending-threatening-messages-about-6a61553d1c7)\n[sending-threatening-messages-about-6a61553d1c7.](https://medium.com/@networksecurity/shadows-kill-mirai-ddos-botnet-testing-large-scale-attacks-sending-threatening-messages-about-6a61553d1c7)\n\n[15] J. Blackford and M. Digdon. TR-069 issue 1 amendment\n5. [https://www.broadband-forum.org/technical/download/TR-](https://www.broadband-forum.org/technical/download/TR-069_Amendment-5.pdf)\n[069_Amendment-5.pdf.](https://www.broadband-forum.org/technical/download/TR-069_Amendment-5.pdf)\n\n[16] CAIDA: Center for Applied Internet Data Analysis. AS ranking.\n\n[http://as-rank.caida.org/?mode0=as-ranking&n=100&ranksort=](http://as-rank.caida.org/?mode0=as-ranking&n=100&ranksort=3)\n[3, 2017.](http://as-rank.caida.org/?mode0=as-ranking&n=100&ranksort=3)\n\n\n-----\n\n[17] E. Cooke, F. Jahanian, and D. McPherson. The zombie roundup:\nUnderstanding, detecting, and disrupting botnets. In 1st USENIX\n_Steps to Reducing Unwanted Traffic on the Internet Workshop,_\n2005.\n\n[18] A. Costin, J. Zaddach, A. Francillon, and D. Balzarotti. A largescale analysis of the security of embedded firmwares. In 23rd\n_USENIX Security Symposium, 2014._\n\n[19] A. Costin, A. Zarras, and A. Francillon. Automated dynamic\nfirmware analysis at scale: A case study on embedded web interfaces. In 11th ACM Asia Conference on Computer and Communi_cations Security, 2016._\n\n[20] J. Czyz, M. Kallitsis, M. Gharaibeh, C. Papadopoulos, M. Bailey,\nand M. Karir. Taming the 800 pound gorilla: The rise and decline of NTP DDoS attacks. In 14th ACM Internet Measurement\n_Conference, 2014._\n\n[21] Deutsche Telekom. Telekom-hilt. [https://www.facebook.](https://www.facebook.com/telekomhilft/photos/a.143615195685585.27512.122768271103611/1199966633383764/?type=&theater)\n[com/telekomhilft/photos/a.143615195685585.27512.](https://www.facebook.com/telekomhilft/photos/a.143615195685585.27512.122768271103611/1199966633383764/?type=&theater)\n[122768271103611/1199966633383764/?type=&theater.](https://www.facebook.com/telekomhilft/photos/a.143615195685585.27512.122768271103611/1199966633383764/?type=&theater)\n\n[22] Z. Durumeric, D. Adrian, A. Mirian, M. Bailey, and J. A. Halderman. A search engine backed by Internet-wide scanning. In 22nd\n_ACM Conference on Computer and Communications Security,_\n2015.\n\n[23] Z. Durumeric, M. Bailey, and J. A. Halderman. An Internetwide view of Internet-wide scanning. In 23rd USENIX Security\n_Symposium, 2014._\n\n[24] Z. Durumeric, J. Kasten, D. Adrian, J. A. Halderman, M. Bailey,\nF. Li, N. Weaver, J. Amann, J. Beekman, M. Payer, et al. The matter of Heartbleed. In 14th ACM Internet Measurement Conference,\n2014.\n\n[25] EvoSec. New IoT malware? anime/kami. [https://evosec.eu/](https://evosec.eu/new-iot-malware/)\n[new-iot-malware/.](https://evosec.eu/new-iot-malware/)\n\n[26] E. Fernandes, J. Jung, and A. Prakash. Security analysis of emerging smart home applications. In 37th IEEE Symposium on Security\n_and Privacy, 2016._\n\n[27] E. Fernandes, J. Paupore, A. Rahmati, D. Simionato, M. Conti,\nand A. Prakash. Flowfence: Practical data protection for emerging\nIoT application frameworks. In 25th USENIX Security Symposium,\n2016.\n\n[28] M. Finifter, D. Akhawe, and D. Wagner. An empirical study\nof vulnerability rewards programs. In 22nd USENIX Security\n_Symposium, 2013._\n\n[29] L. Franceschi-Bicchierai. Hackers makes the first-ever ran[somware for smart thermostats. https://motherboard.vice.com/](https://motherboard.vice.com/en_us/article/internet-of-things-ransomware-smart-thermostat)\n[en_us/article/internet-of-things-ransomware-smart-thermostat.](https://motherboard.vice.com/en_us/article/internet-of-things-ransomware-smart-thermostat)\n\n[30] A. Froehlich. 8 IoT operating systems powering the\nfuture. [http://www.informationweek.com/iot/8-iot-operating-](http://www.informationweek.com/iot/8-iot-operating-systems-powering-the-future/d/d-id/1324464)\n[systems-powering-the-future/d/d-id/1324464.](http://www.informationweek.com/iot/8-iot-operating-systems-powering-the-future/d/d-id/1324464)\n\n[[31] Gamepedia Minecraft Wiki. Tutorials/setting up a server. http://](http://minecraft.gamepedia.com/Tutorials/Setting_up_a_server)\n[minecraft.gamepedia.com/Tutorials/Setting_up_a_server.](http://minecraft.gamepedia.com/Tutorials/Setting_up_a_server)\n\n[32] G. Gu, R. Perdisci, J. Zhang, and W. Lee. BotMiner: Clustering\nanalysis of network traffic for protocol-and structure-independent\nbotnet detection. In 17th USENIX Security Symposium, 2008.\n\n[33] G. Gu, J. Zhang, and W. Lee. Botsniffer: Detecting botnet command and control channels in network traffic. In 15th Network\n_and Distributed System Security Symposium, 2008._\n\n[34] B. Herzberg, D. Bekerman, and I. Zeifman. Breaking down mirai:\n[An IoT DDoS botnet analysis. https://www.incapsula.com/blog/](https://www.incapsula.com/blog/malware-analysis-mirai-ddos-botnet.html)\n[malware-analysis-mirai-ddos-botnet.html.](https://www.incapsula.com/blog/malware-analysis-mirai-ddos-botnet.html)\n\n[35] K. J. Higgins. Srizbi botnet sending over 60 billion spams a\n[day. http://www.darkreading.com/risk/srizbi-botnet-sending-over-](http://www.darkreading.com/risk/srizbi-botnet-sending-over-60-billion-spams-a-day/d/d-id/1129480)\n[60-billion-spams-a-day/d/d-id/1129480.](http://www.darkreading.com/risk/srizbi-botnet-sending-over-60-billion-spams-a-day/d/d-id/1129480)\n\n\n\n[36] S. Hilton. Dyn analysis summary of Friday October 21 attack. [http://hub.dyn.com/dyn-blog/dyn-analysis-summary-of-](http://hub.dyn.com/dyn-blog/dyn-analysis-summary-of-friday-october-21-attack)\n[friday-october-21-attack.](http://hub.dyn.com/dyn-blog/dyn-analysis-summary-of-friday-october-21-attack)\n\n[37] T. Holz, M. Steiner, F. Dahl, E. Biersack, and F. Freiling. Measurements and mitigation of peer-to-peer-based botnets: A case\nstudy on Storm worm. In 1st USENIX Workshop on Large-Scale\n_Exploits and Emergent Threats, 2008._\n\n[38] Internet Census 2012. Port scanning/0 using insecure embedded\n[devices. http://internetcensus2012.bitbucket.org/paper.html.](http://internetcensus2012.bitbucket.org/paper.html)\n\n[39] M. Karami and D. McCoy. Understanding the emerging threat\nof DDoS-as-a-service. In 6th USENIX Workshop on Large-Scale\n_Exploits and Emergent Threats, 2013._\n\n[40] M. Karami, Y. Park, and D. McCoy. Stress testing the booters:\nUnderstanding and undermining the business of DDoS services.\nIn 25th International Conference on World Wide Web, 2016.\n\n[41] kenzo2017. Eir’s d1000 modem is wide open to being\n[hacked. https://devicereversing.wordpress.com/2016/11/07/eirs-](https://devicereversing.wordpress.com/2016/11/07/eirs-d1000-modem-is-wide-open-to-being-hacked/)\n[d1000-modem-is-wide-open-to-being-hacked/.](https://devicereversing.wordpress.com/2016/11/07/eirs-d1000-modem-is-wide-open-to-being-hacked/)\n\n[42] S. Khandelwal. Someone is using mirai botnet to shut down\n[internet for an entire country. http://thehackernews.com/2016/11/](http://thehackernews.com/2016/11/ddos-attack-mirai-botnet.html)\n[ddos-attack-mirai-botnet.html.](http://thehackernews.com/2016/11/ddos-attack-mirai-botnet.html)\n\n[[43] O. Klaba. Octave klaba Twitter. https://twitter.com/olesovhcom/](https://twitter.com/olesovhcom/status/778830571677978624)\n[status/778830571677978624.](https://twitter.com/olesovhcom/status/778830571677978624)\n\n[44] A. Kountouras, P. Kintis, C. Lever, Y. Chen, Y. Nadji, D. Dagon,\nM. Antonakakis, and R. Joffe. Enabling network security through\nactive DNS datasets. In 19th International Research in Attacks,\n_Intrusions, and Defenses Symposium, 2016._\n\n[45] B. Krebs. Did the Mirai botnet really take Liberia of[fline? https://krebsonsecurity.com/2016/11/did-the-mirai-botnet-](https://krebsonsecurity.com/2016/11/did-the-mirai-botnet-really-take-liberia-offline/)\n[really-take-liberia-offline/.](https://krebsonsecurity.com/2016/11/did-the-mirai-botnet-really-take-liberia-offline/)\n\n[46] B. Krebs. Krebsonsecurity hit with record DDoS.\n[https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-](https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/)\n[with-record-ddos/.](https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/)\n\n[47] B. Krebs. New Mirai worm knocks 900k Germans offline. [https://krebsonsecurity.com/2016/11/new-mirai-worm-](https://krebsonsecurity.com/2016/11/new-mirai-worm-knocks-900k-germans-offline/)\n[knocks-900k-germans-offline/.](https://krebsonsecurity.com/2016/11/new-mirai-worm-knocks-900k-germans-offline/)\n\n[48] B. Krebs. Spreading the DDoS disease and selling the\n[cure. https://krebsonsecurity.com/2016/10/spreading-the-ddos-](https://krebsonsecurity.com/2016/10/spreading-the-ddos-disease-and-selling-the-cure/)\n[disease-and-selling-the-cure/.](https://krebsonsecurity.com/2016/10/spreading-the-ddos-disease-and-selling-the-cure/)\n\n[49] B. Krebs. Who is Anna-Senpai, the Mirai worm au[thor? https://krebsonsecurity.com/2017/01/who-is-anna-senpai-](https://krebsonsecurity.com/2017/01/who-is-anna-senpai-the-mirai-worm-author/)\n[the-mirai-worm-author/.](https://krebsonsecurity.com/2017/01/who-is-anna-senpai-the-mirai-worm-author/)\n\n[50] B. Krebs. Who makes the IoT things under attack?\n[https://krebsonsecurity.com/2016/10/who-makes-the-iot-](https://krebsonsecurity.com/2016/10/who-makes-the-iot-things-under-attack/)\n[things-under-attack/.](https://krebsonsecurity.com/2016/10/who-makes-the-iot-things-under-attack/)\n\n[51] M. Kührer, T. Hupperich, C. Rossow, and T. Holz. Exit from\nhell? reducing the impact of amplification DDoS attacks. In 23rd\n_USENIX Security Symposium, 2014._\n\n[[52] Level 3. Attack of things! http://www.netformation.com/level-3-](http://www.netformation.com/level-3-pov/attack-of-things-2)\n[pov/attack-of-things-2.](http://www.netformation.com/level-3-pov/attack-of-things-2)\n\n[[53] Level 3. How the grinch stole IoT. http://www.netformation.com/](http://www.netformation.com/level-3-pov/how-the-grinch-stole-iot)\n[level-3-pov/how-the-grinch-stole-iot.](http://www.netformation.com/level-3-pov/how-the-grinch-stole-iot)\n\n[54] C. Lever, P. Kotzias, D. Balzarotti, J. Caballero, and M. Antonakakis. A Lustrum of malware network communication: Evolution\nand insights. In 38th IEEE Symposium on Security and Privacy,\n2017.\n\n[55] C. Lever, R. Walls, Y. Nadji, D. Dagon, P. McDaniel, and M. Antonakakis. Domain-Z: 28 registrations later. In 37th IEEE Sympo_sium on Security and Privacy, 2016._\n\n\n-----\n\n[56] F. Li, Z. Durumeric, J. Czyz, M. Karami, M. Bailey, D. McCoy,\nS. Savage, and V. Paxson. You’ve got vulnerability: Exploring\neffective vulnerability notifications. In 25th USENIX Security\n_Symposium, 2016._\n\n[57] F. Li, G. Ho, E. Kuan, Y. Niu, L. Ballard, K. Thomas, E. Bursztein,\nand V. Paxson. Remedying web hijacking: Notification effectiveness and webmaster comprehension. In 25th International\n_Conference on World Wide Web, 2016._\n\n[[58] G. Lyon. Nmap network scanning. https://nmap.org/book/vscan-](https://nmap.org/book/vscan-fileformat.html)\n[fileformat.html.](https://nmap.org/book/vscan-fileformat.html)\n\n[59] M. Malik and M.-E. M. Léveillé. Meet Remaiten–a Linux\nbot on steroids targeting routers and potentially other\nIoT devices. [http://www.welivesecurity.com/2016/03/30/](http://www.welivesecurity.com/2016/03/30/meet-remaiten-a-linux-bot-on-steroids-targeting-routers-and-potentially-other-iot-devices/)\n[meet-remaiten-a-linux-bot-on-steroids-targeting-routers-and-](http://www.welivesecurity.com/2016/03/30/meet-remaiten-a-linux-bot-on-steroids-targeting-routers-and-potentially-other-iot-devices/)\n[potentially-other-iot-devices/.](http://www.welivesecurity.com/2016/03/30/meet-remaiten-a-linux-bot-on-steroids-targeting-routers-and-potentially-other-iot-devices/)\n\n[60] MalwareTech. Mapping Mirai: A botnet case study.\n[https://www.malwaretech.com/2016/10/mapping-mirai-a-](https://www.malwaretech.com/2016/10/mapping-mirai-a-botnet-case-study.html)\n[botnet-case-study.html.](https://www.malwaretech.com/2016/10/mapping-mirai-a-botnet-case-study.html)\n\n[[61] Maxmind, LLC. Geoip2. https://www.maxmind.com/en/geoip2-](https://www.maxmind.com/en/geoip2-city)\n[city.](https://www.maxmind.com/en/geoip2-city)\n\n[62] X. Mertens. Analyze of a Linux botnet client source\ncode. [https://isc.sans.edu/forums/diary/Analyze+of+a+Linux+](https://isc.sans.edu/forums/diary/Analyze+of+a+Linux+botnet+client+source+code/21305)\n[botnet+client+source+code/21305.](https://isc.sans.edu/forums/diary/Analyze+of+a+Linux+botnet+client+source+code/21305)\n\n[63] Microsoft. Support for Windows XP ended. [https://www.](https://www.microsoft.com/en-us/WindowsForBusiness/end-of-xp-support)\n[microsoft.com/en-us/WindowsForBusiness/end-of-xp-support.](https://www.microsoft.com/en-us/WindowsForBusiness/end-of-xp-support)\n\n[64] M. Mimoso. IoT botnets are the new normal of DDoS at[tacks. https://threatpost.com/iot-botnets-are-the-new-normal-of-](https://threatpost.com/iot-botnets-are-the-new-normal-of-ddos-attacks/121093/)\n[ddos-attacks/121093/.](https://threatpost.com/iot-botnets-are-the-new-normal-of-ddos-attacks/121093/)\n\n[[65] Minecraft Modern Wiki. Protocol handshaking. http://wiki.vg/](http://wiki.vg/Protocol#Handshaking)\n[Protocol#Handshaking.](http://wiki.vg/Protocol#Handshaking)\n\n[66] J. Mirkovic, S. Dietrich, D. Dittrich, and P. Reiher. Internet De_nial of Service: Attack and Defense Mechanisms (Radia Perlman_\n_Computer Networking and Security). Prentice Hall PTR, 2004._\n\n[67] J. Mirkovic and P. Reiher. A taxonomy of DDoS attack and DDoS\ndefense mechanisms. SIGCOMM Computer Communications\n_Review._\n\n[68] D. Moore, V. Paxson, S. Savage, C. Shannon, S. Staniford, and\nN. Weaver. Inside the Slammer worm. IEEE Security & Privacy,\n2003.\n\n[69] D. Moore, C. Shannon, D. J. Brown, G. M. Voelker, and S. Savage.\nInferring internet denial-of-service activity. ACM Transactions on\n_Computer Systems (TOCS), 2006._\n\n[70] D. Moore, C. Shannon, and K. Claffy. Code-Red: A case study on\nthe spread and victims of an Internet worm. In 2nd ACM Internet\n_Measurment Workshop, 2002._\n\n[71] S. Moss. Major DDoS attack on Dyn disrupts AWS, Twitter, Spotify and more. [http://www.datacenterdynamics.com/](http://www.datacenterdynamics.com/content-tracks/security-risk/major-ddos-attack-on-dyn-disrupts-aws-twitter-spotify-and-more/97176.fullarticle)\n[content-tracks/security-risk/major-ddos-attack-on-dyn-disrupts-](http://www.datacenterdynamics.com/content-tracks/security-risk/major-ddos-attack-on-dyn-disrupts-aws-twitter-spotify-and-more/97176.fullarticle)\n[aws-twitter-spotify-and-more/97176.fullarticle.](http://www.datacenterdynamics.com/content-tracks/security-risk/major-ddos-attack-on-dyn-disrupts-aws-twitter-spotify-and-more/97176.fullarticle)\n\n[72] P. Muncaster. Massive Qbot botnet strikes 500,000 machines\nthrough WordPress. [https://www.infosecurity-magazine.com/](https://www.infosecurity-magazine.com/news/massive-qbot-strikes-500000-pcs/)\n[news/massive-qbot-strikes-500000-pcs/.](https://www.infosecurity-magazine.com/news/massive-qbot-strikes-500000-pcs/)\n\n[73] C. O’Flynn. A lightbulb worm? a teardown of the philips hue.\nBlackhat Security Conference.\n\n[74] OVH. The DDoS that didn’t break the camel’s VAC*.\n[https://www.ovh.com/us/news/articles/a2367.the-ddos-that-](https://www.ovh.com/us/news/articles/a2367.the-ddos-that-didnt-break-the-camels-vac)\n[didnt-break-the-camels-vac.](https://www.ovh.com/us/news/articles/a2367.the-ddos-that-didnt-break-the-camels-vac)\n\n[75] D. Pauli. Netgear unveils world’s easiest bug bounty.\n[http://www.theregister.co.uk/2017/01/06/netgear_unveils_](http://www.theregister.co.uk/2017/01/06/netgear_unveils_worlds_easiest_bug_bounty/)\n[worlds_easiest_bug_bounty/.](http://www.theregister.co.uk/2017/01/06/netgear_unveils_worlds_easiest_bug_bounty/)\n\n\n\n[76] P. Porras, H. Saïdi, and V. Yegneswaran. A foray into Conficker’s\nlogic and rendezvous points. In 2nd USENIX Conference on Large_scale Exploits and Emergent Threats: Botnets, Spyware, Worms,_\n_and More, 2009._\n\n[[77] M. Prince. The DDoS that almost broke the internet. https://](https://blog.cloudflare.com/the-ddos-that-almost-broke-the-internet/)\n[blog.cloudflare.com/the-ddos-that-almost-broke-the-internet/.](https://blog.cloudflare.com/the-ddos-that-almost-broke-the-internet/)\n\n[78] E. Ronen, C. O’Flynn, A. Shamir, and A.-O. Weingarten. IoT\ngoes nuclear: Creating a ZigBee chain reaction.\n\n[79] C. Rossow. Amplification hell: Revisiting network protocols for\nDDoS abuse. In 21st Network and Distributed System Security\n_Symposium, 2014._\n\n[80] B. Schneier. The Internet of Things is wildly insecure–and often\n[unpatchable. https://www.schneier.com/essays/archives/2014/01/](https://www.schneier.com/essays/archives/2014/01/the_internet_of_thin.html)\n[the_internet_of_thin.html.](https://www.schneier.com/essays/archives/2014/01/the_internet_of_thin.html)\n\n[81] C. Shannon and D. Moore. The spread of the Witty worm. IEEE\n_Security & Privacy, 2004._\n\n[82] S. Shin and G. Gu. Conficker and Beyond: A Large-scale Empirical Study. In 26th Annual Computer Security Applications\n_Conference, 2010._\n\n[83] S. S. C. Silva, R. M. P. Silva, R. C. G. Pinto, and R. M. Salles.\nBotnets: A survey. 2013.\n\n[84] P. Sinha, A. Boukhtouta, V. H. Belarde, and M. Debbabi. Insights\nfrom the analysis of the Mariposa botnet. In 5th Conference on\n_Risks and Security of Internet and Systems, 2010._\n\n[85] B. Stone-Gross, M. Cova, L. Cavallaro, B. Gilbert, M. Szydlowski,\nR. Kemmerer, C. Kruegel, and G. Vigna. Your botnet is my\nbotnet: analysis of a botnet takeover. In 16th ACM conference on\n_Computer and Communications Security, 2009._\n\n[86] A. Tellez. Bashlite. [https://github.com/anthonygtellez/](https://github.com/anthonygtellez/BASHLITE)\n[BASHLITE.](https://github.com/anthonygtellez/BASHLITE)\n\n[87] K. Thomas, R. Amira, A. Ben-Yoash, O. Folger, A. Hardon,\nA. Berger, E. Bursztein, and M. Bailey. The abuse sharing economy: Understanding the limits of threat exchanges. In 19th Sym_posium on Research in Attacks, Intrusions and Defenses, 2016._\n\n[88] K. Thomas, D. Y. Huang, D. Wang, E. Bursztein, C. Grier, T. J.\nHolt, C. Kruegel, D. McCoy, S. Savage, and G. Vigna. Framing\ndependencies introduced by underground commoditization. In\n_14th Workshop on the Economics of Information Security, 2015._\n\n[89] @unixfreaxjp. Mmd-0056-2016 - Linux/Mirai, how an old ELF\n[malcode is recycled. http://blog.malwaremustdie.org/2016/08/](http://blog.malwaremustdie.org/2016/08/mmd-0056-2016-linuxmirai-just.html)\n[mmd-0056-2016-linuxmirai-just.html.](http://blog.malwaremustdie.org/2016/08/mmd-0056-2016-linuxmirai-just.html)\n\n[90] VirusTotal. Virustotal - free online virus, malware, and url scanner.\n\n[https://virustotal.com/en.](https://virustotal.com/en)\n\n[91] D. Wang, S. Savage, and G. M. Voelker. Juice: A longitudinal\nstudy of an SEO campaign. In 20th Network and Distributed\n_Systems Security Symposium, 2013._\n\n[92] N. Wells. Busybox: A swiss army knife for linux.\n\n[[93] WikiDevi. Eltel et-5300. https://wikidevi.com/wiki/Eltel_ET-](https://wikidevi.com/wiki/Eltel_ET-5300#Stimulating_port_5555_.28from_Internet.29)\n[5300#Stimulating_port_5555_.28from_Internet.29.](https://wikidevi.com/wiki/Eltel_ET-5300#Stimulating_port_5555_.28from_Internet.29)\n\n[94] E. Wustrow, M. Karir, M. Bailey, F. Jahanian, and G. Houston.\nInternet Background Radiation Revisited. In 10th ACM Internet\n_Measurement Conference, 2010._\n\n[95] E. Wustrow, M. Karir, M. Bailey, F. Jahanian, and G. Huston.\nInternet background radiation revisited. In 10th ACM Internet\n_Measurement Conference, 2010._\n\n[96] J. Wyke. The ZeroAccess botnet: Mining and fraud for massive\nfinancial gain. Sophos Technical Paper, 2012.\n\n[97] A. Zand, G. Vigna, X. Yan, and C. Kruegel. Extracting probable\ncommand and control signatures for detecting botnets. In 29th\n_ACM Symposium on Applied Computing, 2014._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Linux/Infection/2017-08-16 - Understanding the Mirai Botnet.pdf"
    ],
    "report_names": [
        "2017-08-16 - Understanding the Mirai Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f87ef0bf-0574-492f-aebc-63e5953938e2",
            "created_at": "2024-11-23T02:00:04.116692Z",
            "updated_at": "2025-03-27T02:00:03.465245Z",
            "deleted_at": null,
            "main_name": "Gorilla",
            "aliases": [],
            "source_name": "MISPGALAXY:Gorilla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1676772320,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1499972482,
    "ts_modification_date": 1502212013,
    "files": {
        "pdf": "https://archive.orkl.eu/191cef5d1d84b81c8eb77119c7029fa74d23d9bc.pdf",
        "text": "https://archive.orkl.eu/191cef5d1d84b81c8eb77119c7029fa74d23d9bc.txt",
        "img": "https://archive.orkl.eu/191cef5d1d84b81c8eb77119c7029fa74d23d9bc.jpg"
    }
}