{
    "id": "bb9ec054-a1a1-41bc-bb85-ba5360db8708",
    "created_at": "2023-01-12T15:05:23.159236Z",
    "updated_at": "2025-03-27T02:05:46.163649Z",
    "deleted_at": null,
    "sha1_hash": "66f28c7ac97d0e423dd3057e024f917ffb3ddf43",
    "title": "2021-03-29 - AP sources- SolarWinds hack got emails of top DHS officials",
    "authors": "",
    "file_creation_date": "2022-05-28T21:36:42Z",
    "file_modification_date": "2022-05-28T21:36:42Z",
    "file_size": 739583,
    "plain_text": "# AP sources: SolarWinds hack got emails of top DHS officials\n\n**[apnews.com/article/solarwinds-hack-email-top-dhs-officials-8bcd4a4eb3be1f8f98244766bae70395](https://apnews.com/article/solarwinds-hack-email-top-dhs-officials-8bcd4a4eb3be1f8f98244766bae70395)**\n\nBy ALAN SUDERMANMarch 29, 2021 GMT\n\n\nApril 20, 2021\n\n\nFILE - In this Aug. 18, 2020, file photo acting-Secretary of Homeland Security Chad Wolf, center, arrives to join President Donald Trump at Andr\npulled off largely through a hack of SolarWinds software .The hackers accessed accounts belonging to then-acting Secretary Chad Wolf and staff a\naccording to current and former senior Homeland Security Department and intelligence officials who were briefed on the extent of the breach. (AP\n\n\n-----\n\n-----\n\n1 of 2\n\nFILE - In this Aug. 18, 2020, file photo acting-Secretary of Homeland Security Chad Wolf, center, arrives to join President Donald Trump at\nAndrews Air Force Base in Md. In December, U.S. officials discovered that federal agencies had fallen victim to a cyberespionage effort pulled\noff largely through a hack of SolarWinds software .The hackers accessed accounts belonging to then-acting Secretary Chad Wolf and staff at\nthe Cybersecurity and Infrastructure Security Agency who focus on finding cyber threats from nation-state adversaries like Russia, according\nto current and former senior Homeland Security Department and intelligence officials who were briefed on the extent of the breach. (AP\nPhoto/J. Scott Applewhite, File)\n\n1 of 2\n\nFILE - In this Aug. 18, 2020, file photo acting-Secretary of Homeland Security Chad Wolf, center, arrives to join President Donald Trump at\nAndrews Air Force Base in Md. In December, U.S. officials discovered that federal agencies had fallen victim to a cyberespionage effort pulled\noff largely through a hack of SolarWinds software .The hackers accessed accounts belonging to then-acting Secretary Chad Wolf and staff at\nthe Cybersecurity and Infrastructure Security Agency who focus on finding cyber threats from nation-state adversaries like Russia, according\nto current and former senior Homeland Security Department and intelligence officials who were briefed on the extent of the breach. (AP\nPhoto/J. Scott Applewhite, File)\n\nSuspected Russian hackers gained access to email accounts belonging to the Trump administration’s head of the Department of Homeland\nSecurity and members of the department’s cybersecurity staff whose jobs included hunting threats from foreign countries, The Associated\nPress has learned.\n\n[The intelligence value of the hacking of then-acting Secretary Chad Wolf and his staff is not publicly known, but the symbolism is stark. Their](https://apnews.com/article/joe-biden-donald-trump-elections-5bbcaf7347b7fa55d3f980a206bdbfd7)\n[accounts were accessed as part of what’s known as the SolarWinds intrusion, and it throws into question how the U.S. government can protect](https://apnews.com/article/solarwinds-fireeye-hack-explained-07e55dfd7fb9e6de96b55a7788eaa93e)\nindividuals, companies and institutions across the country if it can’t protect itself.\n\nThe short answer for many security experts and federal officials is that it can’t — at least not without some significant changes.\n\n“The SolarWinds hack was a victory for our foreign adversaries, and a failure for DHS,” said Sen. Rob Portman of Ohio, top Republican on the\nSenate’s Homeland Security and Governmental Affairs Committee. “We are talking about DHS’s crown jewels.”\n\nThe Biden administration has tried to keep a tight lid on the scope of the SolarWinds attack as it weighs retaliatory measures against Russia.\nBut an inquiry by the AP found new details about the breach at DHS and other agencies, including the Energy Department, where hackers\naccessed top officials’ schedules.\n\nThe AP interviewed more than a dozen current and former U.S. government officials, who spoke on the condition of anonymity because of the\nconfidential nature of the ongoing investigation into the hack.\n\nMore Stories:\n\n– [EXPLAINER: How bad is the hack that targeted US agencies?](https://apnews.com/article/solarwinds-fireeye-hack-explained-07e55dfd7fb9e6de96b55a7788eaa93e)\n– [Microsoft server hack has victims hustling to stop intruders](https://apnews.com/article/technology-politics-national-security-hacking-email-4813d462835dcf54cd1397adb94d468b)\n– [General says attacks by foreign hackers are 'clarion call'](https://apnews.com/article/elections-hacking-united-states-russia-presidential-elections-bd87969fd1e13e0f0b2dca51e297469f)\n\nThe vulnerabilities at Homeland Security, in particular, intensify the worries following the SolarWinds attack and an even more widespread\nhack affecting [Microsoft Exchange’s email program, especially because in both cases the hackers were detected not by the government but by](https://apnews.com/article/technology-politics-national-security-hacking-email-4813d462835dcf54cd1397adb94d468b)\na private company.\n\nIn December, officials discovered what they describe as a sprawling, monthslong cyberespionage effort done largely through a hack of a widely\nused software from Texas-based SolarWinds Inc. At least nine federal agencies were hacked, along with dozens of private-sector companies.\n\nU.S. authorities have said the breach appeared to be the work of Russian hackers. Gen. Paul Nakasone, who leads the Pentagon’s cyber\nforce, said last week that the Biden administration is considering a “range of options” in response. Russia has denied any role in the hack.\n\nSince then, a series of headline-grabbing hacks has further highlighted vulnerabilities in the U.S. public and private sectors. A hacker tried\nunsuccessfully to poison the water supply of a small town in Florida in February, and this month a new breach was announced involving untold\nthousands of Microsoft Exchange email servers that the company says was carried out by Chinese state hackers. China has denied\n[involvement in the Microsoft breach.](https://apnews.com/article/china-email-89a61f711e14e51dc9f5b74ffe9c2ebf)\n\nSen. Mark Warner, a Virginia Democrat and head of the Senate Intelligence Committee, said the government’s initial response to the discovery\nof the SolarWinds hack was disjointed.\n\n“What struck me was how much we were in the dark for as long as we were in the dark,” Warner said at a recent cybersecurity conference.\n\nWolf and other top Homeland Security officials used new phones that had been wiped clean along with the popular encrypted messaging\nsystem Signal to communicate in the days after the hack, current and former officials said.\n\n\n-----\n\nO e o e ad st at o o c a, o co ed t e ede a at o d st at o as a o g t e age c es a ected by t e b eac, sa d t e\nagency was hampered in its response by outdated technology and struggled for weeks to identify how many servers it had running SolarWinds\nsoftware.\n\nThe FAA initially told the AP in mid-February that it had not been affected by the SolarWinds hack, only to issue a second statement a few\ndays later that it was continuing to investigate.\n\nFull Coverage: [Technology](https://apnews.com/hub/technology)\nAt least one other Cabinet member besides Wolf was affected. The hackers were able to obtain the schedules of officials at the Energy\nDepartment, including then-Secretary Dan Brouillette, one former high-placed administration official said. The schedules were not confidential\nand are subject to open records laws.\n\nEnergy Department spokesman Kevin Liao said it “has found no evidence the network that maintains senior officials’ schedules was\ncompromised.”\n\nThe new disclosures provide a fuller picture of what kind of data was taken in the SolarWinds hack. Several congressional hearings have been\nheld on the subject, but they have been notably short on details.\n\nRep. Pat Fallon, R-Texas, indicated at one of the hearings that a DHS secretary’s email had been hacked but did not provide additional detail.\nThe AP was able to identify Wolf, who declined to comment other than to say he had multiple email accounts as secretary.\n\nDHS spokesperson Sarah Peck said that “a small number of employees’ accounts were targeted in the breach” and that the agency “no longer\nsees indicators of compromise on our networks.”\n\nThe Biden administration has pledged to issue an executive order soon to address “significant gaps in modernization and in technology of\ncybersecurity across the federal government.” But the list of obstacles facing the federal government is long: highly capable foreign hackers\nbacked by governments that aren’t afraid of U.S. reprisals, outdated technology, a shortage of trained cybersecurity professionals and a\ncomplex leadership and oversight structure.\n\nThe recently approved stimulus package includes $650 million in new money for the Cybersecurity and Infrastructure Security Agency to\nharden the country’s cyber defenses. Federal officials said that amount is only a down payment on much bigger planned spending to improve\nthreat detection.\n\n“We must raise our game,” Brandon Wales, who leads the cybersecurity agency, said at a recent House committee hearing.\n\nThe agency operates a threat-detection system known as Einstein. Its failure to detect the SolarWinds breach before it was discovered by a\nprivate security company alarmed officials. Eric Goldstein, the agency’s executive assistant director for cybersecurity, told Congress that\nEinstein’s technology was designed a decade ago and has “grown somewhat stale.”\n\nAnthony Ferrante, a former director for cyber incident response at the U.S. National Security Council and current senior managing director at\nFTI Consulting, said part of the problem, both in government and in the private sector, is the lack of a skilled workforce.\n\nThe Microsoft Exchange hack, which to date has not affected any federal government agencies, was also discovered by a private firm.\n\nOne issue that’s flummoxed policymakers is that foreign state hackers are increasingly using U.S.-based virtual private networks, or VPNs, to\nevade detection by U.S. intelligence agencies, which are legally constrained from monitoring domestic infrastructure. The hosting services of\nAmazon Web Services and GoDaddy were used by the SolarWinds hackers to evade detection, officials said recently.\n\nThe Biden administration is not planning to step up government surveillance of the U.S. internet in response and instead wants to focus on\ntighter partnerships and improved information-sharing with the private-sector companies that already have broad visibility into the domestic\ninternet.\n\nResponsibility for responding to breaches, preventing new ones and providing oversight of those efforts is still unsettled, and last month\nleaders of the Senate Intelligence Committee initially criticized the Biden administration for a “disorganized response” to the SolarWinds hack\nbefore the White House issued a statement clarifying its leadership structure.\n\nThe Biden administration tapped Anne Neuberger, the deputy national security adviser for cyber and emergency technology, to respond to the\nSolarWinds and Microsoft breaches. It hasn’t appointed a national cyber director, a new position, frustrating some members of Congress.\n\n“We’re trying to fight a multifront war without anybody in charge,” said Sen. Angus King, an independent from Maine.\n\nThe Biden administration says it’s reviewing how best to set up the new position. “Cybersecurity is a top priority,” said White House\nspokesperson Emily Horne.\n\n___\n\nAssociated Press writer James LaPorta contributed to this report.\n\nAll contents © copyright 2022 The Associated Press. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-29 - AP sources- SolarWinds hack got emails of top DHS officials.pdf"
    ],
    "report_names": [
        "2021-03-29 - AP sources- SolarWinds hack got emails of top DHS officials.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535923,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653773802,
    "ts_modification_date": 1653773802,
    "files": {
        "pdf": "https://archive.orkl.eu/66f28c7ac97d0e423dd3057e024f917ffb3ddf43.pdf",
        "text": "https://archive.orkl.eu/66f28c7ac97d0e423dd3057e024f917ffb3ddf43.txt",
        "img": "https://archive.orkl.eu/66f28c7ac97d0e423dd3057e024f917ffb3ddf43.jpg"
    }
}