{
    "id": "bba712dd-9d31-4741-8a54-4af4893be122",
    "created_at": "2022-10-25T16:48:19.564202Z",
    "updated_at": "2025-03-27T02:15:37.938893Z",
    "deleted_at": null,
    "sha1_hash": "a082ec5024c8f285011e9287fa2b4c65dc13f784",
    "title": "Latest Spam Campaigns from TA505 Now Using New Malware Tools Gelup and FlowerPippi",
    "authors": "",
    "file_creation_date": "2019-07-04T17:24:34Z",
    "file_modification_date": "2019-07-04T17:24:34Z",
    "file_size": 2245681,
    "plain_text": "Latest Spam Campaigns from TA505 Now Using New Malware Tools Gelup and FlowerPippi\n\n## Technical Brief\n\n\n-----\n\n# Technical Analysis of the FlowerPippi Backdoor\nIn the campaign that we observed targeting Japan, Philippines, and Argentina on June 20, we saw TA505\nuse a seemingly new malware that we named “FlowerPippi,” from the malware’s algorithm name and the\nunused string in the malware (pipipipip). This malware can also be found on VirusTotal.\n\nSome of FlowerPippi’s variants were packed by a custom packer — the same one that TA505 uses. The\nunpacked payload is written in C++ and works as backdoor or downloader malware. FlowerPippi doesn’t\nhave an AutoRun function by itself; it is standalone and straightforwardly retrieves the payload.\n\n# FlowerPippi’s C&C Communication\nFlowerPippi collects some of the user’s information, which it sends to the C&C server. When collecting\ninformation, FlowerPippi generates the victim ID from the system’s MAC address using the FNV-1a hash\nalgorithm.\n\nFigure 1. Generating user ID from MAC address by using FNV-1a hash\n\nOn its first connection to the C&C server, the stolen information will be URL-encoded via the following\nformat, and will be encrypted by RC4 with a hardcoded key:\n\nid=<VICTIM_ID>&domain=<DOMAIN_NAME_OR_WORKGROUP>\n&proxy=<PROXY_SETTING>&rights=<IS_ADMIN>&os=<OS_VERSION_STR>&x64=<IS_X64>\n\n\n-----\n\nFigure 2. The RC4-encrypted data (top) and hardcoded RC4 key (bottom)\n\n# FlowerPippi’s Backdoor Commands\n\nIf the C&C server is active, FlowerPippi will receive binary-formed data. Figure 3 shows the data values.\n\nFigure 3. Snapshot of code showing response from the C&C server\n\n\n-----\n\nThe payload part is also encrypted in RC4 with the same key used to send data. The behaviors are based\non the following commands:\n\n**Command** **Behavior**\n\n0 Nothing\n\nDownload an executable from a specific URL and save it in %temp%\\<RANDOM>.exe, then\n1\nexecute and delete it\n\nDownload a DLL from a specific URL and save it in %temp%\\<RANDOM>.dll, then load it via\n2\nLoadLibrary and delete it\n\n3 Run arbitrary command\n\n4 Delete self by using bat file\n\nTable 1. Commands from FlowerPippi’s C&C server\n\nThe payload of the aforementioned C&C response will be decrypted, downloading the file from a URL\n(hxxp://krselectrical[.]co[.]uk/pes1[.]exe) and execute it.\n\n|Command|Behavior|\n|---|---|\n|0|Nothing|\n|1|Download an executable from a specific URL and save it in %temp%\\<RANDOM>.exe, then execute and delete it|\n|2|Download a DLL from a specific URL and save it in %temp%\\<RANDOM>.dll, then load it via LoadLibrary and delete it|\n|3|Run arbitrary command|\n|4|Delete self by using bat file|\n\n\n-----\n\n# Technical Analysis of the Gelup Downloader Malware\n\nIn the same June 20 campaign, we also found another apparently new, undisclosed malware, which we\nnamed “Gelup”. A custom packer was also used to pack some variants of this malware. Again, it uses the\nsame packer that TA505 has been using.\n\nThe unpacked payload is written in C++ and basically works as a downloader for another malware. What\nmakes Gelup different, however, is its obfuscation technique and UAC-bypassing function by mocking\ntrusted directories (spoofing the file’s execution path in a trusted directory), abusing auto-elevated\nexecutables, and using the dynamic-link library (DLL) side-loading technique.\n\n# Gelup has anti-static analysis techniques. \nFirst, Gelup resolves most Windows application programming interfaces (APIs) by using the hash just\nbefore calling it — a common technique used by a lot of malware families.\n\nSecond, the strings in Gelup’s code are decrypted at runtime. There are two methods to decrypt stings in\nGelup, as shown in Figure 4. One is for global values by using AES256-ECB, whose key is a hex string\nand the encrypted strings encoded by Base64. The second method uses XOR and Bit-shift for stack\nvalues.\n\nFigure 4. Dynamically resolved Windows API form hash (top); decrypted strings using AES256-ECB at\n\nruntime (center); and decrypted strings on stack using XOR and Bit-shift at runtime (bottom)\n\n\n-----\n\n# Gelup has anti-dynamic analysis function. \nThis is carried out by checking analysis/VM tools in the process, and if it’s running in a debugger,\nemulator, or sandbox.\n\nFigure 5. Snapshots of code showing Gelup’s anti-dynamic analysis capabilities:\nchecking anti-virus (AV), VM, and analysis tools in the process (top); checking if the cursor is moving,\n\nbut not the result (center left); checking if it’s running under Wine tool, a subsystem that runs\nWindows binary in a UNIX system (center right); checking if it’s run by debugger (bottom left);\n\nand examining exception by closing protected Handle (bottom right)\n\n# Gelup has multilayered steps for installing itself into the system. \n\nGelup’s infection chain has several steps, detailed below:\n\n1. **_Checking environment and user’s privilege. Gelup checks if it’s the first infection by examining if_**\n\n“%AppData%\\MSOCache” already exists. Gelup also determines the user privilege of the infected\n[system by using the NetUserGetInfo API. The system’s user privileges will be summed up and](https://docs.microsoft.com/en-us/windows/win32/api/lmaccess/nf-lmaccess-netusergetinfo)\nchecked if it’s bigger than 5, that is, all the privileges obtained by NetUserGetInfo is not\nUSER_PRIV_GUEST(0x0). Or in simpler terms, Gelup checks if the user in the infected system is a\nGuest or not.\n\n\n-----\n\nIn case the user/account is Guest, Gelup copies itself into “%AllUsersProfile%\\{RANDOM}.exe” and\nsets itself in the registry’s Run key. If the infected system’s user/account has the proper privileges, it\nproceeds with the UAC bypass process.\n\nFigure 6. Snapshot of code showing how Gelup uses NetUserGetInfo to check the user's privilege\n\n2. **_Bypassing UAC by mocking trusted directories. After checking the user privileges, Gelup tries to_**\n\nbypass UAC by “mocking” trusted directories and using DLL side-loading. This UAC-bypass\n[technique was previously demonstrated](https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e) by one of Tenable’s researchers last November 2018 as a\nproof of concept (PoC). This is the first time we've seen this technique used in the wild.\n\nAs Tenable’s research demonstrated, if a specific executable satisfies the conditions listed below, it\ncan be run with auto-elevation without the UAC dialog:\n\n    - The executable must be configured for auto-elevation, that is, privileges are elevated\nautomatically. To configure it, Windows OS will check if the executable has the “autoElevate”\nkey enabled in its manifest. If the value is “true”, it will be passed onto the next check.\n\n    - The executable must be properly signed.\n\n    - The executable must be run in a trusted directory, such as C:\\Windows\\System32.\n\nGelup follows the aforementioned method to bypass UAC. First, Gelup tries to create a directory\nnamed “C:\\\\Windows ” (the space after “Windows” is not a typo). However, Windows does not allow\nthe creation of a trailing spaced directory. In order to bypass this restriction, it abuses the\n[CreateDirectoryW](https://docs.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-createdirectorya) API with the “\\\\?\\” universal naming convention (UNC) prefix. This technique can\nbypass this filtering and successfully create a trailing spaced directory.\n\nNext, Gelup creates a “System32” directory in the trailing spaced directory and copies a legitimate\nComputerDefaults.exe from %Windir%\\System32 to that directory. In Tenable’s PoC, the copied\nexample file was winSAT.exe. However, the target file can be accepted if it’s properly signed and\nautoElevate is enabled. In fact, the copied ComputerDefaults.exe is signed by Microsoft and has the\nautoElevate key set as true.\n\n\n-----\n\nFigure 7. Snapshot of code showing how a UNC prefix is used to create a trailing spaced directory (top);\n\nand how the autoElevate key is enabled in the ComputerDefaults.exe manifest (bottom)\n\nAfter that, Gelup copies itself into the trailing spaced directory and renamed as “propsys.dll”. During\nthis time, Gelup trickily overwrites the Characteristics entry in its PE header with 0x2102\n(IMAGE_FILE_DLL | MAGE_FILE_32BIT_MACHINE | IMAGE_FILE_EXECUTABLE_IMAGE) in\norder to work as a DLL.\n\nFigure 8. Snippets of code showing: how Gelup overwrites the flag in\n_Characteristics entry of PE header with 0x2102 (top); and a comparison of code_\n\nof the overwritten DLL showing only one byte patched (bottom)\n\n[Gelup next executes the copied ComputerDefaults.exe by calling ShellExecuteExW. This legitimate](https://docs.microsoft.com/en-us/windows/win32/api/shellapi/nf-shellapi-shellexecuteexw)\nprogram is affected by the DLL side-loading of propsys.dll. Finally, the renamed Gelup, as propsys.dll,\nwill be successfully executed under the context of ComputerDefaults.exe without UAC dialog.\n\nGelup will then create the directory “%AppData%\\MSOCache” with the HIDDEN attribute. This\ndirectory creation will change the program flow at the start of execution.\n\n\n-----\n\nFigure 9. propsys.dll automatically loaded via DLL side-loading\n\n3. **_Performing Autorun technique by dropping shortcut file and using schetasks.exe. Once it_**\n\nsuccessfully runs in the trailing space directory, it will check for the presence of\n%AppData%\\MSOCache, and then it checks if the following files exist: C:\\Windows\\api.config,\n%TEMP%\\up.config, and %TEMP%\\tmpaddon_bak. The first two files will never exist upon second\nexecution, and accordingly, we have to see the file tmpaddon_bak first.\n\n[The tmpaddon_bak file contains the global atom](https://docs.microsoft.com/en-us/windows/desktop/dataxchg/about-atom-tables#global-atom-table) value, which is related to the original filepath. Global\natom is a kind of global variable for running processes. A process can use this function to pass and\n[receive data to or from remote processes. Gelup adds the current execution path in the global atom](https://docs.microsoft.com/en-us/windows/desktop/dataxchg/about-atom-tables#global-atom-table)\n[table](https://docs.microsoft.com/en-us/windows/desktop/dataxchg/about-atom-tables#global-atom-table) and writes the global atom value into %TEMP%\\tmpaddon_bak during the first execution. By\nchecking the existence of this file, Gelup can determine that the current execution is the second time.\nIf tmpaddon_bak exists, Gelup receives the original filepath by accessing the global atom table using\nthe value in tmpaddon_bak, and then deletes the original file and tmpaddon_bak.\n\n\n-----\n\nFigure 10. Screenshot of code showing how Gelup accesses global atom using tmpaddon_bak and\n\ndelete the original file (top); and the shortcut file binary embedded in Gelup (bottom)\n\n\n-----\n\nAfter cleanup, Gelup creates the shortcut file “C:\\$Recycle.Bin\\<RANDOM>\\<RANDOM>.lnk”, which\nis for C:\\Windows \\System32\\ComputerDefaults.exe. It’s worth mentioning that Gelup doesn’t create\na shortcut file at runtime; it literally has a shortcut file binary in itself. Gelup adds this shortcut file to\nthe task scheduler by running the schetasks.exe command, shown below. This command will be\nexecuted with the highest privilege upon login:\n\nschetasks.exe /create /rl highest /tn <RANDOM> /sc logon /tr\nC:\\$Recycle.Bin\\<RANDOM>\\<RANDOM>.lnk\n\nAfter successfully running this command, Gelup copies C:\\Windows\\write.exe, which is a legitimate\nfile, into C:\\Windows\\api.config. This file can be considered a sign indicating that scheduled tasks are\nbeing added. Once installation is finished, Gelup processes C&C communication next.\n\n# Gelup’s C&C Communication\n\nBefore starting C&C communication, Gelup writes a random string\nin %AppData%\\MSOCache\\<RANDOM>.xml. This XML file will be used as a sign to identify if the current\nconnection is the first C&C connection or not — if it exists, it must be during the second or later time.\n\nGelup uses HTTP (but using socket API) and JavaScript Object Notation (JSON) to communicate with its\nC&C server. Configurations for the C&C server will be decrypted just before connection.\n\nFigure 11. Decryption of configuration before C&C communication (top); the information that will be sent\n\nin the first connection (center); or the second or later connection (bottom)\n\nGelup collects the infected system’s user information with the following format, then sends it to the C&C\nserver. The information will be changed if it’s a first-time connection or not:\n\n  - tid — hashed username and hardware ID\n\n  - os — OS version as strings\n\n  - arch — if system is a x64-based machine\n\n  - rights — if system’s user is Administrator\n\n  - cmd — the result of command\n\n\n-----\n\nThe JSON information will be encrypted by AES256-ECB, whose key\n(736769476A5162373558736B71703962) is embedded in config, and is put in a JSON value of the key\n“w”, which is also embedded in the config. Gelup next builds an HTTP request header by itself and set\nthis JSON as the body before it sends it by POST to its C&C server.\n\nFigure 9. Encrypted information sent with HTTP POST\n\nFurther analysis showed that the C&C server looks active, but we couldn’t get a response from it. But as\na result of our analysis, we saw that the response is also in JSON format with the command encrypted\nwith the same key by AES256-ECB. The following are the accepted commands from the C&C server:\n\n**Command** **Behavior**\n\n100 Uninstall itself using MoveFileEx\n\n200 Nothing\n\n300 Save received file to %temp%\\<specified_name>, then execute it\n\n301 Save received file to %temp%\\<specified_name>, then execute it via cmd.exe /C\n\n302 Save received file to %temp%\\<specified_name>, then load it (LoadLibrayryEx)\n\nTable 1. Commands from Gelup’s C&C server\n\n# Analyzing the Shortcut File\n\nThe shortcut to the target file, which is used to bypass UAC, is embedded in Gelup’s binary itself. Thus,\nthis shortcut file could be created in the attacker’s environment. Below are some of the extracted\nmetadata as a result of parsing the shortcut file:\n\nCreated Timestamp (UTC): 2019/05/24 16:53:20\nAccessed Timestamp (UTC): 2019/05/24 16:53:20\nSerial No: F8EFD32C\nMAC Address: 08:00:27:CB:5D:D2 (CADMUS COMPUTER SYSTEMS (VirtualBox))\n\nAs the MAC Address shows, it appears the attackers also abuse VirtualBox, an open-source hosted\nhypervisor, to create this shortcut and develop their malware or other tools.\n\n|Command|Behavior|\n|---|---|\n|100|Uninstall itself using MoveFileEx|\n|200|Nothing|\n|300|Save received file to %temp%\\<specified_name>, then execute it|\n|301|Save received file to %temp%\\<specified_name>, then execute it via cmd.exe /C|\n|302|Save received file to %temp%\\<specified_name>, then load it (LoadLibrayryEx)|\n\n\n-----\n\n**TREND MICRO[TM] RESEARCH**\n\nTrend Micro, a global leader in cybersecurity, helps to make the world safe for exchanging digital information.\n\nTrend Micro Research is powered by experts who are passionate about discovering new threats, sharing key insights, and\nsupporting efforts to stop cybercriminals. Our global team helps identify millions of threats daily, leads the industry in\nvulnerability disclosures, and publishes innovative research on new threats techniques. We continually work to anticipate new\nthreats and deliver thought-provoking research.\n\n**www.trendmicro.com**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.04.TA505_Gelup_FlowerPippi/Tech-Brief-Latest-Spam-Campaigns-from-TA505-Now-Using-New-Malware-Tools-Gelup-and-FlowerPippi.pdf",
        "https://documents.trendmicro.com/assets/Tech-Brief-Latest-Spam-Campaigns-from-TA505-Now-Using-New-Malware-Tools-Gelup-and-FlowerPippi.pdf"
    ],
    "report_names": [
        "Tech-Brief-Latest-Spam-Campaigns-from-TA505-Now-Using-New-Malware-Tools-Gelup-and-FlowerPippi",
        "Tech-Brief-Latest-Spam-Campaigns-from-TA505-Now-Using-New-Malware-Tools-Gelup-and-FlowerPippi.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041737,
    "ts_creation_date": 1562261074,
    "ts_modification_date": 1562261074,
    "files": {
        "pdf": "https://archive.orkl.eu/a082ec5024c8f285011e9287fa2b4c65dc13f784.pdf",
        "text": "https://archive.orkl.eu/a082ec5024c8f285011e9287fa2b4c65dc13f784.txt",
        "img": "https://archive.orkl.eu/a082ec5024c8f285011e9287fa2b4c65dc13f784.jpg"
    }
}