{
    "id": "bba9e688-5edf-4938-ad54-a60d7dae755e",
    "created_at": "2023-01-12T15:03:40.351991Z",
    "updated_at": "2025-03-27T02:15:55.598433Z",
    "deleted_at": null,
    "sha1_hash": "6f9e2636f0f97759f24bbe864fe3050be8f46ff4",
    "title": "2017-04-03 - Dissecting One of APT29’s Fileless WMI and PowerShell Backdoors (POSHSPY)",
    "authors": "",
    "file_creation_date": "2022-05-28T00:23:53Z",
    "file_modification_date": "2022-05-28T00:23:53Z",
    "file_size": 94017,
    "plain_text": "# Dissecting One of APT29’s Fileless WMI and PowerShell Backdoors (POSHSPY)\n\n**[fireeye.com/blog/threat-research/2017/03/dissecting_one_ofap.html](https://www.fireeye.com/blog/threat-research/2017/03/dissecting_one_ofap.html)**\n\nThreat Research\n\nMatthew Dunwoody\n\nApr 03, 2017\n\n6 mins read\n\nMandiant has observed APT29 using a stealthy backdoor that we call POSHSPY. POSHSPY\nleverages two of the tools the group frequently uses: PowerShell and Windows Management\nInstrumentation (WMI). In the investigations Mandiant has conducted, it appeared that\nAPT29 deployed POSHSPY as a secondary backdoor for use if they lost access to their\nprimary backdoors.\n\n\n-----\n\nPOSHSPY makes the most of using built-in Windows features – so-called living off the land\n– to make an especially stealthy backdoor. POSHSPY's use of WMI to both store and persist\nthe backdoor code makes it nearly invisible to anyone not familiar with the intricacies of WMI.\nIts use of a PowerShell payload means that only legitimate system processes are utilized\n[and that the malicious code execution can only be identified through enhanced logging or in](https://www.fireeye.com/resources/greater_visibilityt)\nmemory. The backdoor's infrequent beaconing, traffic obfuscation, extensive encryption and\nuse of geographically local, legitimate websites for command and control (C2) make\nidentification of its network traffic difficult. Every aspect of POSHSPY is efficient and covert.\n\nMandiant initially identified an early variant of the POSHSPY backdoor deployed as\nPowerShell scripts during an incident response engagement in 2015. Later in that same\nengagement, the attacker updated the deployment of the backdoor to use WMI for storage\nand persistence. Mandiant has since identified POSHSPY in several other environments\ncompromised by APT29 over the past two years.\n\nWe first discussed APT29’s use of this backdoor as part of our “No Easy Breach” talk. For\nadditional details on how we first identified this backdoor, and the epic investigation it was\npart of, see the [slides and](https://www.slideshare.net/MatthewDunwoody1/no-easy-breach-derby-con-2016) [presentation.](https://www.youtube.com/watch?v=Ldzr0bfGtHc)\n\n**Windows Management Instrumentation**\n\nWMI is an administrative framework that is built into every version of Windows since 2000.\nWMI provides many administrative capabilities on local and remote systems, including\nquerying system information, starting and stopping processes, and setting conditional\ntriggers. WMI can be accessed using a variety of tools, including the Windows WMI\nCommand-line (wmic.exe), or through APIs accessible to programming and scripting\nlanguages such as PowerShell. Windows system WMI data is stored in the WMI common\ninformation model (CIM) repository, which consists of several files in the\nSystem32\\wbem\\Repository directory.\n\nWMI classes are the primary structure within WMI. WMI classes can contain methods (code)\nand properties (data). Users with sufficient system-level privileges can define custom classes\nor extend the functionality of the many default classes.\n\nWMI permanent event subscriptions can be used to trigger actions when specified conditions\nare met. Attackers often use this functionality to persist the execution of backdoors at system\nstart up. Subscriptions consist of three core WMI classes: a Filter, a Consumer, and a\nFilterToConsumerBinding. WMI Consumers specify an action to be performed, including\nexecuting a command, running a script, adding an entry to a log, or sending an email. WMI\nFilters define conditions that will trigger a Consumer, including system startup, the execution\nof a program, the passing of a specified time and many others. A FilterToConsumerBinding\nassociates Consumers to Filters. Creating a WMI permanent event subscription requires\nadministrative privileges on a system.\n\n\n-----\n\nWe have observed APT29 use WMI to persist a backdoor and also store the PowerShell\nbackdoor code. To store the code, APT29 created a new WMI class and added a text\nproperty to it in order to store a string value. APT29 wrote the encrypted and base64encoded PowerShell backdoor code into that property.\n\nAPT29 then created a WMI event subscription in order to execute the backdoor. The\nsubscription was configured to run a PowerShell command that read, decrypted, and\nexecuted the backdoor code directly from the new WMI property. This allowed them to install\na persistent backdoor without leaving any artifacts on the system’s hard drive, outside of the\nWMI repository. This “fileless” backdoor methodology made the identification of the backdoor\nmuch more difficult using standard host analysis techniques.\n\n**POSHSPY WMI Component**\n\nThe WMI component of the POSHSPY backdoor leverages a Filter to execute the\nPowerShell component of the backdoor on a regular basis. In one instance, APT29 created a\nFilter named BfeOnServiceStartTypeChange (Figure 1), which they configured to execute\nevery Monday, Tuesday, Thursday, Friday, and Saturday at 11:33 am local time.\n\n\n-----\n\nBfeOnServiceStartTypeChange WMI Query Language (WQL) filter condition\n\n\nFigure 1: “BfeOnServiceStartTypeChange” WMI Query Language (WQL) filter condition\nThe BfeOnServiceStartTypeChange Filter was bound to the CommandLineEventConsumer\nWindowsParentalControlsMigration. The WindowsParentalControlsMigration consumer was\nconfigured to silently execute a base64-encoded PowerShell command. Upon execution, this\ncommand extracted, decrypted, and executed the PowerShell backdoor payload stored in\nthe HiveUploadTask text property of the RacTask class. The PowerShell command contained\nthe payload storage location and encryption keys. Figure 2 displays the command, called the\n“CommandLineTemplate”, executed by the WindowsParentalControlsMigration consumer.\n\n\n-----\n\nWindowsParentalControlsMigration CommandLineTemplate\n\n\nFigure 2: WindowsParentalControlsMigration CommandLineTemplate\nFigure 3 contains the decoded PowerShell command from the “CommandLineTemplate.”\n\n\n-----\n\nDecoded CommandLineTemplate PowerShell code 1\n\n\n-----\n\nDecoded CommandLineTemplate PowerShell code 2\n\n\nFigure 3: Decoded CommandLineTemplate PowerShell code\n\n**POSHSPY PowerShell Component**\n\n[The full code for a POSHSPY sample is available here.](https://github.com/matthewdunwoody/POSHSPY/blob/master/poshspy_redacted.txt)\n\nThe POSHSPY backdoor is designed to download and execute additional PowerShell code\nand Windows binaries. The backdoor contains several notable capabilities, including:\n\n1. Downloading and executing PowerShell code as an EncodedCommand\n\n\n-----\n\nposhspy4\n\n\n2. Writing executables to a randomly-selected directory under Program Files, and naming the\nEXE to match the chosen directory name, or, if that fails, writing the executable to a systemgenerated temporary file name, using the EXE extension\n\n\n-----\n\nposhspy5\n\n\n3. Modifying the Standard Information timestamps (created, modified, accessed) of every\ndownloaded executable to match a randomly selected file from the System32 directory that\nwas created prior to 2013\n\n\n-----\n\nposhspy6\n\n\n4. Encrypting communications using AES and RSA public key cryptography\n\n\n-----\n\nposhspy7\n\n\n5. Deriving C2 URLs from a Domain Generation Algorithm (DGA) using lists of domain\nnames, subdomains, top-level domains (TLDs), Uniform Resource Identifiers (URIs), file\nnames, and file extensions\n\n\n-----\n\nposhspy8\n\n\n6. Using a custom User Agent string or the system's User Agent string derived from\nurlmon.dll\n\n\n-----\n\nposhspy9\n\n\n7. Using either custom cookie names and values or randomly-generated cookie names and\nvalues for each network connection\n\n\n-----\n\nposhspy10\n\n\n8. Uploading data in 2048-byte chunks\n\n\n-----\n\nposhspy11\n\n\n9. Appending a file signature header to all encrypted data, prior to upload or download, by\nrandomly selecting from the file types:\n\nICO\nGIF\nJPG\nPNG\nMP3\nBMP\n\n\n-----\n\nposhspy12\n\n\nThe [sample in this example used 11 legitimate domains owned by an organization located](https://github.com/matthewdunwoody/POSHSPY/blob/master/poshspy_redacted.txt)\nnear the victim. When combined with the other options in the DGA, 550 unique C2 URLs\ncould be generated. Infrequent beaconing, use of DGA and compromised infrastructure for\nC2, and appended file headers used to bypass content inspection made this backdoor\ndifficult to identify using typical network monitoring techniques.\n\n**Conclusion**\n\nPOSHSPY is an excellent example of the skill and craftiness of APT29. By “living off the\nland” they were able to make an extremely discrete backdoor that they can deploy alongside\ntheir more conventional and noisier backdoor families, in order to help ensure persistence\neven after remediation. As stealthy as POSHSPY can be, it comes to light quickly if you\n\n\n-----\n\n[know where to look. Enabling and monitoring enhanced PowerShell logging can capture](https://www.mandiant.com/resources/greater_visibilityt)\nmalicious code as it executes and legitimate WMI persistence is so rare that malicious\npersistence quickly stands out when enumerating it across an environment. This is one of\nseveral sneaky backdoor families that we have identified, including an off-the-shelf domain\nfronting backdoor and [HAMMERTOSS. When responding to an APT29 breach, it is vital to](https://www.fireeye.com/resources/hammertoss-stealthy-tactics-define-a-russian-cyber-threat-group)\nincrease visibility, fully scope the incident before responding and thoroughly analyze\naccessed systems that don't contain known malware.\n\n**Additional Reading**\n\nThis [PowerShell logging blog post contains more information on improving PowerShell](https://www.fireeye.com/blog/threat-research/2016/02/greater_visibilityt.html)\nvisibility in your environment.\n\nThis [excellent whitepaper by William Ballenthin, Matt Graeber and Claudiu Teodorescu](https://www.fireeye.com/resources/windows-management-instrumentation-wmi-offense-defense-and-forensics)\ncontains additional information on WMI offense, defense and forensics.\n\nThis [presentation by Christopher Glyer and Devon Kerr contains additional information on](https://files.sans.org/summit/Digital_Forensics_and_Incident_Response_Summit_2015/PDFs/TheresSomethingAboutWMIDevonKerr.pdf)\nattacker use of WMI in past Mandiant investigations.\n\n[The FireEye FLARE team released a WMI repository-parsing tool that allows investigators to](https://github.com/mandiant/flare-wmi/tree/master/python-cim)\nextract embedded data from the WMI repository and identify WMI persistence.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-03 - Dissecting One of APT29’s Fileless WMI and PowerShell Backdoors (POSHSPY).pdf"
    ],
    "report_names": [
        "2017-04-03 - Dissecting One of APT29’s Fileless WMI and PowerShell Backdoors (POSHSPY).pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535820,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1653697433,
    "ts_modification_date": 1653697433,
    "files": {
        "pdf": "https://archive.orkl.eu/6f9e2636f0f97759f24bbe864fe3050be8f46ff4.pdf",
        "text": "https://archive.orkl.eu/6f9e2636f0f97759f24bbe864fe3050be8f46ff4.txt",
        "img": "https://archive.orkl.eu/6f9e2636f0f97759f24bbe864fe3050be8f46ff4.jpg"
    }
}