{
    "id": "bbbda66d-ba65-406c-986b-43c954d4349b",
    "created_at": "2023-01-12T15:02:50.491275Z",
    "updated_at": "2025-03-27T02:16:09.653593Z",
    "deleted_at": null,
    "sha1_hash": "e44ad7727516f9d746d12508efd01d7ba48626b6",
    "title": "2020-01-14 - Inside of CL0P’s ransomware operation",
    "authors": "",
    "file_creation_date": "2022-05-27T21:12:29Z",
    "file_modification_date": "2022-05-27T21:12:29Z",
    "file_size": 671255,
    "plain_text": "# Inside of CL0P’s ransomware operation\n\n**[telekom.com/en/blog/group/article/inside-of-cl0p-s-ransomware-operation-615824](https://www.telekom.com/en/blog/group/article/inside-of-cl0p-s-ransomware-operation-615824)**\n\nBlog.Telekom\n\n01‑14‑2021\n[Thomas Barabosch](https://www.telekom.com/en/blog/592636-592636)\n\n17 Comments\n\nShare Share\nTwo clicks for more data privacy: click here to activate the button and send your\nrecommendation. Data will be transfered as soon as the activation occurs.\n\nPrint\n[Read out](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4779&lang=en&readid=readspeakercontent&url=https://www.telekom.com/en/blog/group/article/inside-of-cl0p-s-ransomware-operation-615824)\n\nTA505 (also known as FIN11) is a financially motivated cybercrime actor. They conduct Big\nGame Hunting operations, such as deployment of ransomware and extortion of large ransom\n[payment. In the past, I explained how they operate and I](https://www.telekom.com/en/blog/group/article/eager-beaver-a-short-overview-of-the-restless-threat-actor-ta505-609546) [scrutinized their tools. If you are not](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-s-box-of-chocolate-597672)\n[familiar with TA505 and CL0P then I recommend you to read our threat actor profile of TA505](https://www.telekom.com/en/blog/group/article/eager-beaver-a-short-overview-of-the-restless-threat-actor-ta505-609546)\nfirst.\n\nInsights into TA505’s ransomware operations.\n\n\n-----\n\nThree waves of spam originating from TA505 were observed in 2020: they started in\n[January/February, followed by a longer period during summer from June until September,](https://blog.fox-it.com/2020/11/16/ta505-a-brief-history-of-their-time/)\nand a very short period in early December. Throughout the months without spamming\nactivity, they added more and more victims to their ransomware portal “CL0P^-LEAKS”.\n\nThis blog post gives insights into their ransomware operations. First, I’ll detail the activity of\nthese operations throughout the last months. Next, I’ll describe what kind of victim\ninformation CL0P samples contain and explore why there are often multiple CL0P samples\nthat can be attributed to one victim. Finally, I’ll have a look at their two online portals that\nsupport their operations: their leak portal “CL0P^-LEAKS” and their negotiation portal that\nthey utilize to come to agreements with victims.\n\nOur Incident Response Service at Deutsche Telekom Security GmbH can quickly investigate\nand remediate ongoing TA505 intrusions. Please contact security-info@t-systems.com for\nmore information.\n\n## TA505 and CL0P operations from June 2020 until December 2020\n\nIn the following, I’ll give an overview of TA505’s activity during the second half of 2020. There\nwere two periods of spamming activity, followed by two periods of CL0P deployments.\n\n### First activity period\n\nThe first period of spamming activity began on 2020-06-02 and ceased on 2020-09-11.\nDuring this period TA505 sent out phishing mails nearly each work day in order to get a\nfoothold in many networks. Subsequently, they would filter down on interesting corporate\nnetworks and then they would advance their intrusion by moving laterally.\n\nThe end date of the observed spamming activity is particularly interesting due to an\nannouncement of Secura. On 2020-09-11, which was a Friday and therefore, the last day of\n[a typical TA505 spam week, Secura announced the Zerologon vulnerability. It is only](https://www.secura.com/blog/zero-logon)\nspeculation why TA505 did not continue its spamming activity on the next Monday: either it\nwas the publication of Zerologon that ended their spamming activity abruptly or they grasped\nthe opportunity to quickly move laterally in selected networks.\n\nIn September and October 2020, CL0P was able to deploy their ransomware at several\nvictims. The observed cases took mostly place on Friday and Saturday.\n\n### Second activity period\n\nIn mid-December 2020, TA505 returned for less than two weeks of spamming activity, likely\nto compromise possible victim networks for CL0P deployment during the Christmas holidays\n2020. Another motive might be to acquire access to new victim networks in order to resume\noperation in January / February 2021.\n\n\n-----\n\nAs of time of writing, there are no new victims listed on their leak portal CL0P -LEAKS .\nHowever, I found several CL0P samples indicating at least that the CL0P operators tried to\ndeploy their ransomware in two networks during Christmas. There are rumors that one of\nthese victims payed more than 200 Bitcoins (BTC) (almost six million dollars) ransom.\n\n## CL0P ransomware\n\nCL0P is the ransomware that is deployed after initial TA505 intrusions. Each CL0P sample is\nunique to a victim. First, it contains a 1024 bits RSA public key used in the data encryption.\nSecond, it contains a personalized ransom note.\n\nThe ransomware is written in C++ and developed under Visual Studio 2015 (14.0). So far,\nI’ve only observed CL0P samples for the x86 architecture. The unpacked sample size is\nbetween 100 KB and 200 KB. CL0P renames encrypted files and adds either the “.Cllp” or\nthe “.CI0p” file ending.\n\nThe ransomware contains a 1024 bits RSA public key, which is unique to each victim. While\n1024 bit RSA keys are deprecated, factoring of 1024 bit keys is still quite far away. As of\nJanuary 2021, the largest publicly known RSA key that was factored as part of the RSA\nFactoring Challenge had 829 bits.\n\nThere is already a good write-up of CL0P’s functionality from [S2W LAB. Therefore, I’ll refrain](https://www.notion.so/S2W-LAB-Analysis-of-Clop-Ransomware-suspiciously-related-to-the-Recent-Incident-English-088056baf01242409a6e9f844f0c5f2e)\nfrom describing how CL0P encrypts a system. Instead, I’ll look into how it decrypts its\nembedded ransom note and cases where there are multiple samples that can be attributed\nto a victim.\n\n### Decryption of embedded ransom note\n\nEach CL0P sample contains a ransom note, which is stored as a resource in the PE\nexecutable. Across several CL0P samples the resource string 0x99AB and the resource type\nID_HTML were consistent. This resource is a binary blob that is encoded with a XOR cipher.\nEach sample contains a 33 bytes long hard-coded XOR key. As of time of writing, I came\nacross two different keys that the CL0P operators reutilized across several samples.\n\nThe following screenshot shows the function responsible for storing the ransom note. Its only\nparameter is the path where to store the ransom note. The name of the ransom note is\nhardcoded (“README_README.txt”). First, this function builds the full path of the ransom\nnote and tries to create a file (lines 15 – 17) there. On success, it fetches the resource with\nname 0x99AB and reserves memory for the decrypted ransom note (lines 19 – 25). In a for\nloop each byte of the encrypted ransom note is XORed with a byte from the hard-coded XOR\nkey. This key byte is determined using the position of the current byte modulo the size of\nhard-coded key, which is 33 bytes (lines 26 – 27). Afterwards, the function stores the\ndecrypted ransom note and cleans up (lines 28 – 37).\n\n\n-----\n\nFigure 1 Decompiled algorithm for ransom note decryption\n\nThis note is specifically crafted for the victim. Let’s have a look at a redacted ransom note\nthat a recent CL0P sample dropped:\n\nFigure 2 Redacted CL0P ransom note\n\nTo reiterate what this ransom note comprises:\n\nThe name of the victim\nInformation about sensitive data they exfiltrated\n\nFile share paths\nUser names as part of these paths\nThe amount of data they exfiltrated\nA .onion link to their leak portal “CL0P^-LEAKS”\nSeveral email addresses to contact\nA link to their negotiation portal\n\nFirstly, these are sensitive information about the victim. Secondly, this is information to\ninteract with the CL0P operators. Therefore, it is recommendable to never upload\nransomware samples to the Internet.\n\nGiven the ransom note an attribution to a victim is possible. In the following, I’ll use this to\ninvestigate a very interesting trial and error behavior observed during CL0P intrusions.\n\n### Trial and error: Why are there several samples per victim?\n\nDuring the last three months, I could find more than a dozen CL0P samples on VirusTotal. In\nmultiple occurrences, there are several samples of CL0P that can be attributed to one victim.\nThese samples are compiled within a time frame of a couple of hours. In at least one incident\nresponse engagement, we could corroborate this behavior as well.\n\nThe question arises why are there several samples per victim? In the following sections, I’ll\ninvestigate the cases of four CL0P victims where multiple samples can be attributed to the\nsame victim. The attribution to a victim occurs based on two data points. First, CL0P\nsamples comprise a ransom note that mentions the victim name. Second, I consider CL0P’s\ntime stamps legitimate. This is in line with what we’ve seen in several incident response\nengagements.\n\n### Victim A\n\nThe case of victim A occurred on a Saturday during Autumn 2020. Both samples were\ncompiled on the same day within 30 minutes. The following table lists important properties\nregarding both samples:\n\n\n-----\n\n**Property** **Sample 1** **Sample 2**\n\ntime stamp 15:59:25 16:29:46\n\n\nservice\nname\n\n\nanti antivirus\nroutine\n\n\nMMCCSS VVSBUILDTPT2\n\nMcAfee Appcheck\n\n\nmutex name GJLKWHTJIOPK#GBFSgt233r2fdsfds;6y2#666 Gslkjrhtoji4k32mtiguj42kl\n\ncertificate signed (revoked) not signed\n\nThe first deployment of CL0P failed since the endpoint detection blocked Sample 1. As a\nconsequence, they compiled Sample 2. They changed the service name that CL0P registers\nas well as the mutex name it uses to ensure that not more than one instance runs on a\nsystem. Furthermore, they exchanged the functionality to deal with McAfee antivirus. The\n[operators defaulted to functionality to deal with Appcheck, which was already observed in](https://twitter.com/malwrhunterteam/status/1203380492281794568?s=20)\nDecember 2019.\n\nInteresting is that the first sample is signed with a (now) revoked certificate but the second\nsample is not signed. Either the operators forgot to sign of the second sample after the\ncompilation or the signing is carried out as a service by another entity and the operators did\nnot bother to sign the second sample.\n\nThe case of victim A shows that the CL0P operators adjust their ransomware in a trial and\nerror fashion during the deployment stage. This may give us some hints regarding the\nrelationship between the operators and developers of CL0P.\n\nWe can spin up several hypotheses. Either the operators and developers are the same, or\nthe operators work very closely with the developers who assist with recompilation during the\ndeployment stage. Another hypothesis is that the operators have access to the source code,\nthey are capable of changing the source code, recompiling it, and finally deploying the new\nbinary. This is not typical behavior seen by actors working as part of a Ransomware-as-aService program.\n\n### Victim B\n\n\n-----\n\nThe case of victim B took place during a Saturday in November 2020. Both samples were\ncompiled on the same day within 15 minutes. I list the relevant properties of both samples in\nthe following table:\n\n**Property** **Sample 1** **Sample 2**\n\ntime stamp 14:28:00 14:43:58\n\nservice name WinCheckDRVs (not installed) WinCheckDRVs\n\n\nanti antivirus\nroutine\n\n\nMany None\n\n\nmutex name GKLJHWRnjktn32uyhrjn23io#666 666GKLJHWRnjktn32uyhrjn23io#666\n\ncertificate Signed (revoked) not signed\n\nSample 1 is not capable of encryption. The CL0P operators changed the WinMain function of\nthis sample so that instead of encrypting the system, it runs a long sequence of\nShellExecuteA calls in order to kill several processes and stop several services. The\nfollowing screenshot shows a portion of the decompiled WinMain function.\n\nFigure 3 Decompiled WinMain function of CL0P sample that stops several services via\nShellExecuteA calls.\n\nSince the CL0P operators compiled Sample 1 with most of the WinMain logic replaced by\nShellExecuteA calls, there is a lot of dead code and unreferenced strings, respectively. For\ninstance, the service name and the mutex name strings are stored in the binary but they are\nnever created.\n\nSample 2, which was utilized to encrypt the infrastructure is fully working. It does not\ncomprise any functionality to cope with antivirus products. This is what Sample 1 (probably)\nachieved. The same service name was utilized but they slightly changed the mutex name by\nprepending another “666” to the mutex name string.\n\nAgain, Sample 1 is signed with a (now) revoked certificate but Sample 2 is not signed.\n\nIn the case of victim B, the CL0P gang encrypted the network but they did not achieve their\nobjective of being paid a ransom.\n\n### Victim C + D\n\n\n-----\n\nThe cases of victim C and victim D happened during the Christmas holidays 2020. Both\ncases occurred during the same day. All three samples that I’m aware of were compiled on\nthe same day within seven hours. The following table summarizes important properties of\nthem:\n\n**Property** **Sample 1** **Sample 3** **Sample 4**\n\ntime stamp 14:35:55 15:42:22 21:45:45\n\nservice name None BFEFservs BFEFservs\n\nanti antivirus routine Many None None\n\nmutex name None TWrsg24gredgre#W#666 TWrsg24gredgre#W#666\n\ncertificate not signed not signed not signed\n\nIn case of victim C, I could only find one sample (Sample 1) and I am missing the second\none (Sample 2). The CL0P operators compiled Sample 1 again with a long sequence of\nShellExecuteA calls to kill services / stop processes. This includs several security solutions\nlike McAfee and Sophos. Sample 1 does not conduct any encryption of files as it exits after\nthe ShellExecuteA calls. Again, there is a lot of dead code but this time there is neither a\nservice name string nor a mutex name string to be found. Unfortunately, I was not able to\nencounter Sample 2, which supposedly encrypted Victim C’s infrastructure.\n\nAs of time of writing, Victim C is not listed on CL0P’s leak portal. Therefore, we can suppose\nonly two things: either this was a failed intrusion and the ransomware was never rolled out\nbecause something went wrong during the deployment of Sample 1 or Sample 2. Or the\nCL0P operators deployed Sample 2 successfully, victim C paid the ransom, and is therefore\nnot listed on the leak portal.\n\nIn case of victim D, I found two samples. Both samples were compiled on the same day but\nwithin six hours. Both samples comprise the ransomware logic. The semantic capabilities of\nboth samples are almost equal. The difference between Sample 3 and Sample 4 is not as\nclear as in the cases of victim A and victim B, though.\n\nIn contrary to victim C, we’ve got clear indications letting us assume that CL0P achieved\ntheir objective of successfully encrypting victim D’s infrastructure.\n\n## CL0P’s online presences\n\n\n-----\n\nCL0P maintains two online presences to support its Big Game Hunting operations. The first\npresence is their leak portal called “CL0P^-LEAKS”. Its purpose is to frighten future victims\nby hosting sensitive data of past victims that didn’t pay the ransom. The second presence is\ntheir negotiation portal. This serves as a “customer support” for victims that are willing to\ncome to an agreement and pay the ransom.\n\n### Victim intimidation: CL0P’s leak portal\n\nCL0P is one of the ransomware gangs that adopted the double extortion technique. Before\nthey deploy their ransomware, they exfiltrate up to terabytes of sensitive data from the\nvictim’s network. In case the victim had proper backups setup and is not willing to pay the\nransom, they still can threaten to publish this data on their leak portal “CL0P^-LEAKS”. The\nportal lists 19 victims in January 2021. The majority of them residing in Germany. The\nfollowing screenshot shows their leak portal hosted on the TOR network:\n\nFigure 4 Leak portal “CL0P^-LEAKS”\n\nIn comparison to other ransomware gangs, CL0P is very ruthless. In some cases, they host\nterabytes of very sensitive data of their victims for months on their leak portal. The CL0P\noperators added the first victims in Spring of 2020, which they are still hosting after 9\nmonths.\n\n[As stated before, CL0P is going after the data of top executives. Several of their recent](https://www.zdnet.com/article/some-ransomware-gangs-are-going-after-top-execs-to-pressure-companies-into-paying)\nransom notes explicitly name data stolen from workstations that belong to top executives\n(including founders / CEOs) of the respective enterprises. This is likely based on the hope\nthat using data stolen from top executives in the extortion process raises their chances that\nthe victim pays. Nevertheless, they still exfiltrate data from network shares (e.g. finance /\nhuman resources data).\n\n### Victim support: CL0P’s negotiation portal\n\nThe sustainability of CL0P relies on victims paying the ransom. Based on their continuous\noperation one has to assume that a good portion of the victims agree to pay the significant\nransoms. Apart from their leak portal “CL0P^-LEAKS”, they offer a negotiation portal for\nevery victim. This is their tool to come to an agreement with victims that are willing to pay.\n\nAs of time of writing, the ransom note comprises the link to this portal. I was able to extract\nthe ransom note from several CL0P samples. The ransom notes show that a separate .onion\nlink is created for each victim. The following screenshot shows their negotiation portal and\nthe services it offers to their victims:\n\nFigure 5 CL0P's negotiation portal with chat support\n\n\n-----\n\nThese services are:\n\n**Chat: a support chat where the cybercriminals guide the victims through the**\nnegotiation process\n**Demo decrypt: a decryption tool that victims can use to decrypt up to five files of their**\nchoice\n**Buy bitcoin: information on how to buy bitcoins**\n**News: colorful screenshots of news related to CL0P’s latest cyberattacks**\n**About us: further links about them**\n\nThe CL0P operators try to convince their victims to pay by showing off their history of hacks\nin a colorful way (Section “News”). Links to third-party websites (Section “About Us”) give\nmore background information on them.\n\nFigure 6 External presentation of CL0P\n\nThe negotiation process follows the same pattern as with other ransomware gangs. The tone\nof the conversation is helpful and direct but never hostile. First, they ask if their interlocutor is\nauthorized to negotiate and mention that they are just interested in the money.\n\nOur goal is money, we are not interested in causing harm. We tell you the amount we\nwant to receive for unblocking the network and deleting all the files that we have\ndownloaded from you. We come to an agreement and after receiving the money, you\nreceive a decryptor and proof of file deletion.”\nThe CL0P operators\n\nIf both parties come to an agreement, then the CL0P operators provide a decryptor and a\nproof that they’ve deleted all exfiltrated files. In exchange they want money in bitcoin. They\noffer the free decryption of up to five non-critical files to prove that they can decrypt the\nvictim’s network and to show the victim their good will.\n\nThey demand amounts of 5% to 10% of the annual revenue but they tell victims that\ndiscounts of up to 30% are possible, if they come to an agreement within less than a half\nweek. Nevertheless, they are open to further bargaining so that the final ransom is way less\nthan the initial demand of 5% to 10% of the annual revenue.\n\nOnce both parties agreed on a price, the CL0P operators offer further support and\nsuggestions on how to make transfers in Bitcoin. They are willing to accept small fluctuations\ndue to Bitcoin. Though, they know that Bitcoin fluctuates a lot and they only fix a ransom for\n24 hours.\n\n\n-----\n\nAfter they received the ransom in their Bitcoin wallet, they still continue their support. Victims\nare typically very concerned about three things. First, what data CL0P was able to exfiltrate\nand that they receive a file deletion report. Second, they require further support to decrypt\ntheir infrastructure. Third, they want a report on how the network breach happened. The\nCL0P operators seem to help victims with these issues even after they’ve already been paid.\n\n## Conclusion\n\nCL0P was one of the most active Big Game Hunting operations in 2020. They were able to\n[breach several large enterprises. Their intrusions are linked to TA505. I expect that these](https://www.telekom.com/en/blog/group/article/eager-beaver-a-short-overview-of-the-restless-threat-actor-ta505-609546)\nintrusions continue with the same speed and frequency in 2021.\n\nCL0P samples comprise personalized ransom notes that mention the victim and give away\ncrucial details about the negotiation process. The CL0P operators offer their own portal for\nnegotiations, including a support service via chat.\n\nIn cases where victims do not pay the ransom, they upload large amounts of sensitive data\nto their portal “CL0P^-LEAKS”. As of time of writing, they continue to host this data there, in\nsome cases for more than nine months.\n\nI documented the trial and error behavior observed during CL0P deployments: in several\ndeployments there is more than one sample that is linked to a victim. In some cases, it\nseems that the first sample was an initial test whether or not the endpoint detection blocks\nthe sample. In other cases, the first sample does not contain the decryption capability since\nthe operators likely commented it out for this build.\n\nThis shows that the CL0P operators have access to the source code of CL0P. They are\ncapable of compiling and quickly fixing issues in it during an ongoing deployment. This\nunderlines the assumption that this ransomware gang is a closed group of individuals\nsharing mutual resources and working closely together.\n\n## Appendix A: IoCs\n\nThe following table lists network IoCs associated with TA505’s spamming activity in\nDecember 2020.\n\n**IOC** **Description**\n\nxbox-ms-store-debug[.]com SDBBot CC December 2020\n\nbak0-store[.]com Get2 CC 2020-12-08\n\n\n-----\n\nres-backup[.]com Get2 CC 2020-12-10\n\nms-debug-services[.]com Get2 CC 2020-12-14\n\nms-pipes-service[.]com Get2 CC 2020-12-17\n\n© Thx to Pixabay.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-14 - Inside of CL0P’s ransomware operation.pdf"
    ],
    "report_names": [
        "2020-01-14 - Inside of CL0P’s ransomware operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "059b16f8-d4e0-4399-9add-18101a2fd298",
            "created_at": "2022-10-25T15:50:23.29434Z",
            "updated_at": "2025-03-27T02:00:55.431907Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Evilnum"
            ],
            "source_name": "MITRE:Evilnum",
            "tools": [
                "More_eggs",
                "EVILNUM",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39ea99fb-1704-445d-b5cd-81e7c99d6012",
            "created_at": "2022-10-25T16:07:23.601894Z",
            "updated_at": "2025-03-27T02:02:09.882982Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Jointworm",
                "Operation Phantom in the [Command] Shell",
                "TA4563"
            ],
            "source_name": "ETDA:Evilnum",
            "tools": [
                "Bypass-UAC",
                "Cardinal RAT",
                "ChromeCookiesView",
                "EVILNUM",
                "Evilnum",
                "IronPython",
                "LaZagne",
                "MailPassView",
                "More_eggs",
                "ProduKey",
                "PyVil",
                "PyVil RAT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraPreter",
                "TerraStealer",
                "TerraTV"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535770,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1653685949,
    "ts_modification_date": 1653685949,
    "files": {
        "pdf": "https://archive.orkl.eu/e44ad7727516f9d746d12508efd01d7ba48626b6.pdf",
        "text": "https://archive.orkl.eu/e44ad7727516f9d746d12508efd01d7ba48626b6.txt",
        "img": "https://archive.orkl.eu/e44ad7727516f9d746d12508efd01d7ba48626b6.jpg"
    }
}