{
    "id": "bbf308dc-11f3-4de9-b142-7b15856de18e",
    "created_at": "2023-01-12T15:09:03.550807Z",
    "updated_at": "2025-03-27T02:05:44.6173Z",
    "deleted_at": null,
    "sha1_hash": "4dd735e07ecb7d40faa9567cd7207bd9b8eb8899",
    "title": "2016-11-08 - SPAMTORTE VERSION 2- DISCOVERY OF AN ADVANCED, MULTILAYERED SPAMBOT CAMPAIGN THAT IS BACK WITH A VENGEANCE",
    "authors": "",
    "file_creation_date": "2022-05-28T04:51:02Z",
    "file_modification_date": "2022-05-28T04:51:02Z",
    "file_size": 430052,
    "plain_text": "# Blog | Cognyte\n\n**cis.verint.com/2016/11/08/spamtorte-version-2/**\n\n\n-----\n\n## The War in Ukraine: from Fake News to Cyber-Attacks\n\nConventional warfare has not been a high priority for many countries for the better part\nof a century, and intelligence and military organizations have become focused on\nthreats such as terrorism and serious crime. The current situation in Ukraine, one in\nwhich a global power has invaded another sovereign state, has delivered a wakeup\ncall…\n\nBy Omer Frenkel\n\nApr 06 2022 · 6 Min Read\n\n\n-----\n\n## Financial Sanctions Evasion with Crypto – Here’s How to Stop it\n\nWhat can law enforcement and government agencies do to reveal individuals\ncircumventing sanctions with crypto? New sanctions against Russia have prompted\nindividuals and companies to illegally use cryptocurrencies to bypass regulations. This\nprimer describes how crypto can be used to evade sanctions – and what you can do to\nstop it.  The sanctions on…\n\nBy Tom Sadon, Director of Product Marketing\n\nMar 29 2022 · 3 Min Read\n\n\n-----\n\n## Botnet Marketplaces Statistics in 2021\n\nBotnet markets have been evolving and growing since they first emerged in 2018.\nThese automated stores sell stolen login credentials for websites and platforms,\nobtained from computers infected with an infostealer, to cyber criminals. Some markets\nprovide a full system of fingerprints to threat actors so they can mask themselves as\nvictims. Cognyte’s latest annual…\n\nBy Cognyte CTI Research Group\n\nMar 20 2022 · 5 Min Read\n\n\n-----\n\n## Digital Wallet Cybercrime is the Next Target to Watch\n\nRising interest of threat actors in digital wallets may have affected trade of stolen credit\ncards on dark web markets The use of digital wallets is on the rise and is likely to\ncontinue to grow and supplant credit cards as the payment method of choice for online\npurchases. Since the start of the Covid-19…\n\nBy Cognyte CTI Research Group\n\nMar 20 2022 · 5 Min Read\n\n\n-----\n\n## Cognyte Named Leader in Digital Intelligence Solutions by Frost & Sullivan\n\nSecurity organizations are in a perpetual race to keep up with evolving digital\ntechnologies and the rise of big data. Technology continues to provide criminals with\nsophisticated tools to commit crimes and evade law enforcement. At the same time, the\nincreased volume, variety, and complexity of data has made it difficult for organizations\nto generate…\n\nBy Cognyte\n\nMar 20 2022 · 5 Min Read\n\n\n-----\n\n## Join us at ISS World Middle East 2022\n\nCognyte is headed to Dubai to meet with law enforcement homeland security\nprofessionals, security analysts, investigators, cyber-crime pros, and more at the\nworld’s largest law enforcement and public safety gathering. We are excited to meet in\nperson with the security community to exchange ideas, share best practices, and\ndiscuss the latest developments in security analytics….\n\nBy Cognyte\n\nFeb 28 2022 · 2 Min Read\n\n\n-----\n\n## IBM sells i2: what’s next for your analytics platform?\n\nIBM’s sale of i2 to Harris makes the security community rethink what they need in an\ninvestigative analytics platform The world of security analytics is a buzz concerning the\nrecent sale of IBM’s i2 portfolio to Harris Computer. Users have become speculative as\nto potential shifts and the uncertainty of the solution’s roadmap and ongoing\nsupport. Savvy organizations are using this as an opportunity to evaluate what they\nneed in…\n\nBy Cognyte\n\nJan 12 2022 · 3 Min Read\n\n\n-----\n\n## 5 Kinds of Cryptocurrency Crime\n\nTechnology has made almost every aspect of our lives – and the lives of criminals –\neasier. The blockchain has fostered an ecosystem in which illicit actors can easily\noperate anonymously and internationally, stalling financial investigations and setting\nthe stage for increased crypto crime. In our previous blog we outlined how criminal\nactors exploit the…\n\nBy Tom Sadon, Director of Product Marketing\n\nNov 09 2021 · 6 Min Read\n\n\n-----\n\n## Are Telecoms the Most Popular Target of Cyber-Attacks in 2021?\n\nRecent headlines have focused on data breaches of social media platforms, but the\nfrequency and impact of these attacks pale in comparison to those in cyber-criminals’\nfavorite industry: telecommunications. Cyber-attacks on telecoms are popular because\ntheir databases carry detailed information on millions of customers. A successful\ntelecom data breach could yield contact details, social security…\n\nBy Cognyte CTI Research Group\n\nNov 09 2021 · 3 Min Read\n\n\n-----\n\n## Money Laundering: The Key to Cryptocurrency Crime\n\nMoney laundering is a common theme among many crypto crimes. Criminal actors\nexploit the anonymity of the blockchain to launder gains from both off-chain and onchain crimes to obfuscate the sources of illicit funds and convert them into cash for\nbank deposits. Cryptocurrency is used by criminals to launder funds from diverse types\nof crimes,…\n\nBy Tom Sadon, Director of Product Marketing\n\nNov 07 2021 · 6 Min Read\n\n\n1 / 4\n\n[>](https://www.cognyte.com/blog/page/2/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-11-08 - SPAMTORTE VERSION 2- DISCOVERY OF AN ADVANCED, MULTILAYERED SPAMBOT CAMPAIGN THAT IS BACK WITH A VENGEANCE.pdf"
    ],
    "report_names": [
        "2016-11-08 - SPAMTORTE VERSION 2- DISCOVERY OF AN ADVANCED, MULTILAYERED SPAMBOT CAMPAIGN THAT IS BACK WITH A VENGEANCE.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536143,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653713462,
    "ts_modification_date": 1653713462,
    "files": {
        "pdf": "https://archive.orkl.eu/4dd735e07ecb7d40faa9567cd7207bd9b8eb8899.pdf",
        "text": "https://archive.orkl.eu/4dd735e07ecb7d40faa9567cd7207bd9b8eb8899.txt",
        "img": "https://archive.orkl.eu/4dd735e07ecb7d40faa9567cd7207bd9b8eb8899.jpg"
    }
}