{
    "id": "bc209d63-79c2-4572-9a59-26ef97bf19dd",
    "created_at": "2023-12-19T02:03:50.731551Z",
    "updated_at": "2025-03-27T02:06:15.308179Z",
    "deleted_at": null,
    "sha1_hash": "312885ec160f68228c8ec450e3f61b54a25e17d5",
    "title": "HrServ - Previously unknown web shell used in APT attack",
    "authors": "Kaspersky",
    "file_creation_date": "2023-12-12T17:55:49Z",
    "file_modification_date": "2023-12-12T17:55:49Z",
    "file_size": 314854,
    "plain_text": "# HrServ – Previously unknown web shell used in APT attack\n\n**securelist.com/hrserv-apt-web-shell/111119**\n\nAuthors\n\n[Mert Degirmenci](https://securelist.com/author/mertdegirmenci/)\n\n## Introduction\n\nIn the course of our routine investigation, we discovered a DLL file, identified as hrserv.dll,\nwhich is a previously unknown web shell exhibiting sophisticated features such as custom\nencoding methods for client communication and in-memory execution. Our analysis of the\nsample led to the discovery of related variants compiled in 2021, indicating a potential\ncorrelation between these separate occurrences of malicious activity.\n\n## Initial infection\n\nAccording to our telemetry data, the PAExec.exe process initiates the creation of a\nscheduled task on the system named MicrosoftsUpdate (sic), which in turn is designed to\nexecute a .BAT file.\n\n\n1\n\n2\n\n\n\"schtasks\" /create /sc DAILY /tn MicrosoftsUpdate /tr \"$system32\\cmd.exe /c\n\n$public\\JKNLA.bat $public\\hrserv.dll\" /ru system /f\n\n\nThe .BAT file accepts the path of a DLL file as an argument. In this instance, the script is\nprovided with the file $public\\hrserv.dll, which is then copied to the System32 directory. After\nthis operation, the script configures a service via the system registry and the sc utility. It then\nactivates the newly created service.\n\n## HrServ web shell\n\n**MD5** 418657bf50ee32acc633b95bac4943c6\n\n**SHA1** cb257e00a1082fc79debf9d1cb469bd250d8e026\n\n**SHA256** 8043e6c6b5e9e316950ddb7060883de119e54f226ab7a320b743be99b9c10ec5\n\n\n**Link**\n**time**\n\n\n2023-Aug-30 08:28:15\n\n\n-----\n\n**File type** PE32+ executable (DLL) (console) x86-64, for MS Windows\n\n**Compiler** Microsoft Visual C/C++(2015 v.14.0)\n\nThe sequence of operations starts with the registration of a service handler. HrServ then\ninitiates an HTTP server utilizing the HTTP server API for its functionality. It calls the\nHttpAddUrlToGroup function to register the following URL so that matching requests are\nrouted to the request queue.\n\n1 http://+:80/FC4B97EB-2965-4A3B-8BAD-B8172DE25520/\n\nClient-server communication uses custom encoding techniques that include Base64\nencoding and FNV1A64 hashing algorithms.\n\nBased on the type and information within an HTTP request, specific functions are activated.\nThese functions are distinguished by the GET parameter named cp. In addition, the DLL file\nutilizes the value of the NID cookie for various purposes. The use of the GET parameter\npattern and the cookie value is consistent with practices employed by Google. We suspect\nthat this intentional similarity in naming conventions is intended to disguise these requests in\nnetwork traffic, making it more challenging to detect such malicious activity.\n\nAn example of such a request would be:\n\n1 &cp=1&client=desktop-gws-wiz-on-focus-serp&xssi=t&hl=en-TW&authuser=0&pq=\n\n\n**Request**\n**type**\n\n\n**cp**\n**value**\n\n\n**Description**\n\n\nGET 0 Call VirtualAlloc and copy a custom decoded NID cookie value, then\ncreate a new thread.\n\nPOST 1 Create a file using the custom decoded NID cookie value and write the\ncustom decoded POST data to that file.\n\nGET 2 Read a file using the custom decoded NID cookie value and return it as\na response by appending it to the end of the “data:image/png;base64”\nstring;\n\nIf an error occurs while reading the file, HrServ responds with the\nstring:\n\ndata:image/png;base64,c3Dlc+DheRzlKBV2Yh92KS//;\n\nGET 4 Return Outlook Web App HTML data.\n\n\n-----\n\nPOST 6 Call VirtualAlloc and copy the custom decoded POST data, then create\na new thread.\n\nGET 7 Return Outlook Web App HTML data [Duplicate].\n\n### Code execution\n\nIf the cp value in the request is 6, this indicates a code execution process.\n\nInitially, it extracts the value of the NID cookie and applies its custom decoding\ntechnique\nIt writes this decoded value to the specified registry path, denoted as\n“HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\IdentityStore\\RemoteFile”\nThe custom-decoded POST data is then copied to the memory, after which a new\nthread is created and the process enters a sleep state.\n\nIn a particular observed scenario, the cp value is unknown. A multifunctional implant is\nactivated in the system memory. The implant creates a file in the directory “%temp%”,\nretrieves information from the registry, performs some actions based on this information, and\nrecords the output of these actions in the created file. As a result, the registry and the\ntemporary file are used as a communication channel between the implant and HrServ.\n\n\n-----\n\nAvailable commands of the memory implant\n\nBased on our telemetry data, after successfully establishing a foothold and placing the\nmemory implant in the system memory, the next actions are to erase the previously existing\ntraces by deleting the scheduled “MicrosoftsUpdate” job and both the initial DLL and batch\nfiles:\n\n\n1\n\n2\n\n\nschtasks /delete /tn MicrosoftsUpdate /f\n\ncmd /c \"del /f/s/q $public\\hrserv.dll & del /f/s/q $public\\JKNLA.bat\"\n\n\n### Older variants\n\nWe have also discovered earlier, differently named variants of HrServ. These DLL files date\nback to early 2021. They also use the custom encoding algorithm and behave the same way\nafter a file read error However there are subtle differences\n\n\n-----\n\nThe web shell URL of these older variants differs from the current one:\n\n1 https://+:443/owa/MSExchangeService.svc\n\nThese samples exhibit a distinct behavior by creating a process and retrieving its\noutput through a pipe, as opposed to allocating a memory section and creating a\nthread from it.\n\n## Victims\n\nThe only known victim according to our telemetry is a government entity in Afghanistan.\n\n## Attribution\n\nThe TTPs analyzed in this investigation are not associated with any known threat actors we\nare tracking, but there are a few things that we observed:\n\nthe GET parameters used in the hrserv.dll file, which is used to mimic Google services,\n[include “hl”. This specifies the host language of the user interface. Although this](https://developers.google.com/custom-search/docs/xml_results?hl=en#WebSearch_Query_Parameter_Definitions)\nparameter has no functionality within the attack vector, the assigned value “en-TW”\nspecifies that the Google search interface should be displayed in English, but the\nsearch results should be displayed in Traditional Chinese:\n\n1 &cp=1&client=desktop-gws-wiz-on-focus-serp&xssi=t&hl=en-TW&authuser=0&pq=\n\nthe samples include help strings for specific conditions, in English. We saw multiple\ntypos that suggest the actor behind the samples is not a native English speaker.\n\nAn error message with a typo\n\n## Conclusion\n\nThe analyzed sample represents a capable web shell. Based on the compile timestamps, its\norigins date back to at least 2021. This sophisticated malware variant exhibits the ability to\ninitiate in-memory executions. In the observed scenario, communication is established\nthrough registry manipulations and temporary files.\n\n\n-----\n\nNotably, the web shell and memory implant use different strings for specific conditions. In\naddition, the memory implant features a meticulously crafted help message. Considering\nthese factors, the malware’s characteristics are more consistent with financially motivated\nmalicious activity. However, its operational methodology exhibits similarities with APT\nbehavior. Despite the malware’s prolonged activity over several years, multiple instances\ninvolving these samples have not been documented. Our efforts are ongoing as we continue\nto monitor related activity, with the goal of unraveling the mystery in future investigations.\n\n## Indicators of compromise\n\n### File hashes\n\n[b9b7f16ed28140c5fcfab026078f4e2e](https://opentip.kaspersky.com/b9b7f16ed28140c5fcfab026078f4e2e/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[418657bf50ee32acc633b95bac4943c6](https://opentip.kaspersky.com/418657bf50ee32acc633b95bac4943c6/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[d0fe27865ab271963e27973e81b77bae](https://opentip.kaspersky.com/d0fe27865ab271963e27973e81b77bae/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[890fe3f9c7009c23329f9a284ec2a61b](https://opentip.kaspersky.com/890fe3f9c7009c23329f9a284ec2a61b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nHrServ – Previously unknown web shell used in APT attack\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/cexiy4us0t2ygcu6mewyys4aad5ogv83"
    ],
    "report_names": [
        "Kaspersky_HrServ-webshell-in-APT-attack(11-22-2023)"
    ],
    "threat_actors": [],
    "ts_created_at": 1702951430,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1702403749,
    "ts_modification_date": 1702403749,
    "files": {
        "pdf": "https://archive.orkl.eu/312885ec160f68228c8ec450e3f61b54a25e17d5.pdf",
        "text": "https://archive.orkl.eu/312885ec160f68228c8ec450e3f61b54a25e17d5.txt",
        "img": "https://archive.orkl.eu/312885ec160f68228c8ec450e3f61b54a25e17d5.jpg"
    }
}