{
    "id": "bc367fc6-4450-4968-89dc-d50756b8d5d6",
    "created_at": "2023-01-12T14:59:38.587613Z",
    "updated_at": "2025-03-27T02:05:58.201559Z",
    "deleted_at": null,
    "sha1_hash": "1094f2af1134dbe3385eed5a98b2181f2f442ee3",
    "title": "2020-05-18 - Netwalker Fileless Ransomware Injected via Reflective Loading",
    "authors": "",
    "file_creation_date": "2022-05-29T01:11:37Z",
    "file_modification_date": "2022-05-29T01:11:37Z",
    "file_size": 136895,
    "plain_text": "# Reflective Loading Runs Netwalker Fileless Ransomware\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/netwalker-fileless-ransomware-injected-via-reflective-loading/](https://blog.trendmicro.com/trendlabs-security-intelligence/netwalker-fileless-ransomware-injected-via-reflective-loading/)**\n\nMay 18, 2020\n\nThreat actors are continuously creating more sophisticated ways for malware to evade defenses. We have\n[observed Netwalker ransomware attacks that involve malware that is not compiled, but written in](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware)\nPowerShell and executed directly in memory and without storing the actual ransomware binary into the disk.\n[This makes this ransomware variant a fileless threat, enabling it to maintain persistence and evade](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/security-101-how-fileless-attacks-work-and-persist-in-systems)\ndetection by abusing tools that are already in the system to initiate attacks.\n\nThis type of threat leverages a technique called reflective dynamic-link library (DLL) injection, also referred\nto as reflective DLL loading. The technique allows the injection of a DLL from memory rather than from disk.\nThis technique is stealthier than regular DLL injection because aside from not needing the actual DLL file on\ndisk, it also does not need any windows loader for it to be injected. This eliminates the need for registering\nthe DLL as a loaded module of a process, and allowing evasion from DLL load monitoring tools. Recently,\n[we have witnessed threat actors using this technique to deploy ColdLock ransomware. Now, we have seen](https://blog.trendmicro.com/en_us/research/20/e/targeted-ransomware-attack-hits-taiwanese-organizations.html)\nthe same attack using a filelessly executed Netwalker ransomware. The payload begins with a PowerShell\n[script detected as Ransom.PS1.NETWALKER.B.](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.PS1.NETWALKER.B)\n\n## Analysis of the PowerShell Script\n\nFigure 1. Overview of the PowerShell script’s behavior\n\nThe script hides under multiple layers of encryption, obfuscation, and encoding techniques. For this sample,\nwe were able to reveal three layers of code. The top-most layer executes a base64-encoded command.\n\nFigure 2. Code snippet of top-most layer of code (base64 encoded command)\n\nDecoding this will expose the next layer of code, which is hexadecimal-encoded and XOR-encrypted.\n\nFigure 3. Second layer of code (hexadecimal-encoded and XOR-encrypted)\n\n\n-----\n\nDecoding and decrypting will then reveal the main script, which is still quite obfuscated, making the content\nmore difficult for analysts to decipher.\n\nFigure 4. Code snippet of the obfuscated main script\n\nThe file reflectively injects a ransomware DLL into the memory of the legitimate running process\nexplorer.exe. The ransomware is embedded in the script in hex format.\n\nFigure 5. Ransomware binaries embedded in the script in hex format\n\nTaking the binaries out of the script and decoding them will result in two DLLs; one is an x86 version (for 32\nbit OS) of the ransomware, while the other is the x64 version (for 64 bit OS).\n\nIt uses the following part of the script to determine the environment it is running on so that it can set the DLL\nversion to use:\n\nFigure 6. Script that determines what environment the ransomware is running on\n\nTo successfully perform reflective injection, it first locates the API addresses of the functions it needs from\nkernell32.dll:\n\nFigure 7. Ransomware collecting API Addresses from kernell32.dll\n\nThen it uses the following functions to set up accurate memory address calculations:\n\nFigure 8. Functions for setting up memory calculations\n\nFigure 9. Code snippet for computing the needed memory addresses\n\nIn this manner, the script itself acts as the DLL’s own custom loader. This eliminates the need for a\ntraditional windows loader, which usually makes use of the LoadLibrary function. The script itself can\ncompute and resolve its needed memory address and relocations to load the DLL correctly.\n\nIt then specifies the process it will inject into; in this case it searches for the running Windows Explorer\nprocess.\n\nFigure 10. Code snippet for searching running Windows Explorer process\n\nAfterwards, it will write and execute the ransomware DLL into the memory space of explorer.exe through the\nfollowing code:\n\nFigure 11. Code snippet of writing the ransomware DLL code into memory\n\nFinally, it deletes Shadow Volume Copies and prevent the victim from using Shadow Volumes to recover\ntheir encrypted files.\n\nFigure 12. Code snippet for deleting Shadow Volume Copies\n\n[This sample appears to have been derived from PowerSploit’s Invoke-Mimikatz module, an open source](https://github.com/PowerShellMafia/PowerSploit/blob/master/Exfiltration/Invoke-Mimikatz.ps1)\nprogram that was originally intended to reflectively load Mimikatz completely in memory for stealthy\ncredential dumping.\n\n## Analysis of the Fileless Ransomware\n\n\n-----\n\nThis variant of Netwalker is similar to its predecessors in terms of behavior. It renames encrypted files using\n6 random characters as extension:\n\nFigure 13. Encrypted files renamed using 6 random characters as extension\n\nIt drops ransom notes at various folders in the system and opens one after it has encrypted the data and\ndocuments of the victim. As with usual ransomware, it does this to extort money from the victim in exchange\nfor the decryption of their files.\n\nFigure 14. Netwalker ransom note\n\nIt adds the following registry entry. Adding this entry is a known behavior of Netwalker:\n\nHKEY_CURRENT_USER\\SOFTWARE\\{8 random characters}\n\n{8 random characters} = {Hex values}\n\nFigure 15. Sample registry entry added by Netwalker\n\nThe ransomware terminates some processes and services, some examples of which are related to backup\nsoftware and data related applications. It is likely that it does this as an attempt to debilitate any efforts the\nvictim may take in performing backup and recovery operations after the ransomware attack.\n\nBelow are some examples of services terminated by the ransomware (for the full list of services, please see\n[this report):](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.PS1.NETWALKER.B)\n\n*backup*\n*sql*\nAcronisAgent\nARSM\nserver Administrator\nShadowProtectSvc\nwbengine\n\nThe ransomware also stops security software-related processes to evade detection and termination of its\nmalicious activities.\n\nAdditionally, it also terminates processes relating to user data and documents, as well as software for\ncreating backups. Then it will proceed to encrypt files created through those applications.\n\n[Example processes terminated by the ransomware (for the full list of processes, please see this report):](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.PS1.NETWALKER.B)\n\n*sql*\nexcel.exe\nntrtscan.exe\npowerpnt.exe\nwbengine*\nwinword.exe\nwrsa.exe\n\n\n-----\n\nNetwalker mainly targets common user files during its encryption routine, such as Office documents, PDFs,\nimages, videos, audio, and text files, among others. Other than that, it apparently doesn’t want to render the\nsystem completely useless since it generally avoids encrypting any critical files, executables, Dynamic Link\nLibraries, registries, or other system-related files.\n\n## Conclusions and Recommendations\n\nIt appears that attackers are now adding Reflective DLL injection into their ransomware arsenal in an\nattempt to make their attacks untraceable and more difficult to investigate by security analysts.\nRansomware in itself poses a formidable threat for organizations. As a fileless threat, the risk is increased\nas it can more effectively evade detection and maintain persistence. Blended threats such as this make use\nof multiple techniques, making it necessary for organizations to use various layers of security technologies\nto effectively protect their endpoints, such as security solutions that employ behavior monitoring and\nbehavior-based detections.\n\nThese types of attacks can affect victims tremendously, and they can be painstakingly difficult to recover\nfrom. Employing adequate preventive measures, such as applying best practices, will greatly minimize the\nrisk of infection. Here are some of our recommendations to help avoid ransomware attacks:\n\nRegularly back up critical data to mitigate the effects of a ransomware attack\nApply the latest software patches from OS and third-party vendors.\n[Exercise good email and website safety practices](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\nFor employees, alert the IT security team of potentially suspicious emails and files.\nImplement application whitelisting on your endpoints to block all unknown and unwanted applications.\nRegularly educate employees on the dangers of social engineering.\n\n[Below are some of our recommendations to protect systems from fileless threats:](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/security-technology/risks-under-the-radar-understanding-fileless-threats)\n\nSecure PowerShell use by taking advantage of its logging capability to monitor suspicious behavior.\nUse PowerShell commands such as ConstrainedLanguageMode to secure systems from malicious\ncode.\nConfigure system components and disable unused and outdated ones to block possible entry points.\nNever download and execute files from unfamiliar sources\n\nWe also recommend security solutions that utilize behavior monitoring that can work against these types of\nthreats:\n\n[Trend Micro Apex One™ - Features behavioral analysis that protects against malicious scripts,](https://blog.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\ninjection, ransomware, and memory and browser attacks related to fileless threats.\n\n## Indicator of Compromise\n\n**SHA-256** **Trend Micro Pattern**\n**Detection**\n\nf4656a9af30e98ed2103194f798fa00fd1686618e3e62fba6b15c9959135b7be [Ransom.PS1.NETWALKER.B](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.PS1.NETWALKER.B)\n\nRansomware\n\nRansomware in itself poses a formidable threat for organizations. As a fileless threat, the risk is increased\nas it can more effectively evade detection. We discuss how Netwalker ransomware is deployed filelessly\nthrough reflective DLL injection\n\n\n-----\n\nBy: Karen Victor May 18, 2020 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-18 - Netwalker Fileless Ransomware Injected via Reflective Loading.pdf"
    ],
    "report_names": [
        "2020-05-18 - Netwalker Fileless Ransomware Injected via Reflective Loading.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535578,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653786697,
    "ts_modification_date": 1653786697,
    "files": {
        "pdf": "https://archive.orkl.eu/1094f2af1134dbe3385eed5a98b2181f2f442ee3.pdf",
        "text": "https://archive.orkl.eu/1094f2af1134dbe3385eed5a98b2181f2f442ee3.txt",
        "img": "https://archive.orkl.eu/1094f2af1134dbe3385eed5a98b2181f2f442ee3.jpg"
    }
}