{
    "id": "bcc27ae6-047a-40c6-80de-7fbc3e0d461b",
    "created_at": "2022-10-25T16:48:10.478223Z",
    "updated_at": "2025-03-27T02:15:38.121629Z",
    "deleted_at": null,
    "sha1_hash": "e76e58648d529f7171fe87500cfe5b8ce2813e0b",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-05-15T04:27:12Z",
    "file_modification_date": "2020-05-15T04:27:12Z",
    "file_size": 998568,
    "plain_text": "# LOLSnif – Tracking Another Ursnif-Based Targeted Campaign\n\n**[telekom.com/en/blog/group/article/lolsnif-tracking-another-ursnif-based-targeted-campaign-600062](https://www.telekom.com/en/blog/group/article/lolsnif-tracking-another-ursnif-based-targeted-campaign-600062)**\n\nTool leaks are very interesting occurrences in cyber security. On one hand, they may burn the\nleaked tool since it got either publicly known or it facilitates the analysis of the tool significantly.\nOn the other hand, it transfers capabilities to other, possibly lower-skilled actors. In my new blog\npost I analyze a newer version of Ursnif, which has been turned into an exploration tool and\ndownloader. Because: In case of malicious software, source code leaks are very remarkable\nevents. But first a small classification to get started. A notable example from the cyber security\nhistory was the leak of the exploit code “Eternal Blue” (CVE-2017-0144) in 2017. This very\npowerful remote exploit empowered many lower-skilled actors to conduct intrusions with ease.\n\nSuch leaks have occurred every now and then and they will most likely continue to occur in the\nyears to come. The leak of the banking Trojan Zeus definitely shaped the malware landscape\nduring the 2010s. Its source code was leaked in 2010. What followed was a plethora of offspring\nthat share the same code base with the original Zeus banking Trojan. For instance, the\n[zeusmuseum lists 28 families including Citadel, Pandabanker, and more recently Zloader. Many](https://zeusmuseum.com/)\nfamilies continued to operate as banking Trojans like their ancestor but some of them adopted\n[another purpose like the downloader Zloader.](https://malpedia.caad.fkie.fraunhofer.de/details/win.zloader)\n\nBesides the Zeus source code leak, there are many more interesting leaks, each of them\ndeserves its own story. In this blog article, I focus on another malware family whose source code\ngot leaked in 2014. This family is called Ursnif (also known as Gozi2/ISFB). Ursnif is a fullyfledged banking Trojan. There has been many great technical as well as historical work on this\n[family in the recent years. For instance, Maciej Kotowicz wrote a very good write-up on this family](https://lokalhost.pl/txt/isfb_still.live.and.licking.Botconf2016.pdf)\n[in 2016 and the podcast “Malicious Life” produced two episodes about the history of Gozi, the](https://malicious.life/gozi-and-the-rise-of-malware-as-a-service/)\nancestor of Ursnif. Today, the source code of Ursnif can be easily found on the Internet. Many\nactors took this solid code base and based their work on it.\n\nIn this blog post, I analyze a recent Ursnif variant, which was repurposed to be a reconnaissance\ntool and downloader. It is a modern variant utilizing techniques like LOLBins, Component Object\nModel (COM) interfaces to instrument the Internet Explorer and as a consequence bypass local\nproxies as well as Windows Management Instrumentation (WMI) to interact with the operating\nsystem in place of native Win32 APIs. Campaigns associated with this variant start with a\ncascade of several layers of obfuscation, which ensures that the detection rate is very low, even\nseveral days after a campaign has started. This variant plays an important role in these\ncampaigns which appear to be targeted cybercrime attacks.\n\n[It was first publicly mentioned in August 2019, which is in line with the registration dates of some](https://www.fortinet.com/blog/threat-research/ursnif-variant-spreading-word-document.html)\nassociated domains and it gained momentum in autumn and winter 2019/2020. Recently, a blog\n[article scrutinized one of its campaigns in April 2020, pointing out its use of LOLBins. In a](https://lolbas-project.github.io/)\nnutshell, LOLBins stands for “Living Off the Land Binaries”, which means to utilize system tools\nthat are already on a target system in order to carry out nefarious purposes. For instance, there\n\n\n-----\n\n[are dozens of Windows system tools that can be utilized to download files, dump credentials, or](https://lolbas-project.github.io/)\nexecute other binaries. As a consequence, attacks do not need to bring their own tools and may\nhide their traces in other legitimate uses of these tools.\n\nTo the best of my knowledge, it is not yet tracked under its own name. Since the Ursnif variant\nthat I will look into in this blog article makes use of LOLBins and there is already a reference to\n[this (“Ursnif via LOLbins”), I will refer to it as LOLSnif in the following.](https://thedfirreport.com/2020/04/24/ursnif-via-lolbins/)\n\n## Digging Deeper into A Recent Campaign\n\nAt first, I will look into a recent LOLSnif campaign started on 2020-04-07 in order to get an idea of\nthe actors TTPs. Later, I will zoom out and review recent activity of other campaigns of the\nassociated actor.\n\nEach campaign begins with a cascade of several layers of obfuscation. It all starts with a spam\nemail that contains an encrypted ZIP archive. The mail mentions the password for decryption and\nencourages the recipient to open it.\n\nThe next layer is a 1.34 MB sized, heavily obfuscated JavaScript file called\n“my_presentation_v8s.js”\n(4d98790aa67fb14f6bedef97f5f27ea8a60277dda9e2dcb8f1c0142d9619ef52). Its first submission\n[to VirusTotal was on 2020-04-07 and its initial detection rate was very low. This JavaScript file](https://www.virustotal.com/gui/file/4d98790aa67fb14f6bedef97f5f27ea8a60277dda9e2dcb8f1c0142d9619ef52/detection/f-4d98790aa67fb14f6bedef97f5f27ea8a60277dda9e2dcb8f1c0142d9619ef52-1586270067)\nultimately drops a PE executable with file name “UtBuefba.txt“ as well as a text file to\n“AppData\\Local\\Temp”. The text file contains what appears to be an eight character long ASCII\nkey that the PE executable requires to unpack properly. This might be a way to thwart analysis if\nonly the PE executable is shared.\n\nThe DLL is first launched via “regsvr32.exe -s [redacted]\\AppData\\Local\\Temp\\\\UtBuefba.txt”. The\noption “-s” stands for silent registration, which does not show a dialog box. Even though DLLs to\n[be loaded with regsvr32 are required to comprise the exports “DllRegisterServer” and](https://en.wikipedia.org/wiki/Regsvr32)\n“DllUnregisterServer”, this DLL does not export them. It has just a regular DLL entry point.\nHowever, this file unpacks an APlib-compressed Ursnif DLL. This DLL\n(e3d89b564e57e6f1abba05830d93fa83004ceda1dbc32b3e5fb97f25426fbda2) is not known on\nVirusTotal as of 2020-04-17.\n\nBefore I continue with the analysis of the DLL, let me note that the techniques that the actor\nutilizes in their cascade of obfuscated layers ensure very low detection rates of their tools within\nthe first days.\n\n## Dissecting LOLSnif\n\nThe DLL that I unpacked in the previous section is part of a recent fork of Ursnif, which I will refer\nto as LOLSnif in the following. LOLSnif comprises two main components: the loader and the\nworker component. The first drops the latter. Both are PE DLLs with slightly broken headers,\nwhere the DOS header magic number (“MZ”) as well as the PE header magic number (“PE”) are\noverwritten. While this may hinder some sandbox solutions to properly dump the payloads, this\ncan be easily fixed. Notably both are x86 binaries. During my research I did not find any x64\nbinaries related to this malware.\n\n\n-----\n\n### The Loader\n\nThe unpacked DLL\n(e3d89b564e57e6f1abba05830d93fa83004ceda1dbc32b3e5fb97f25426fbda2) comprises two\nexports: the DLL entry point and DllRegisterserver that is required for DLL registration with\nregsvr32. It resembles an Ursnif loader and uses the same configuration mechanism (JJ\nstructure).\n\nThe following screenshots illustrates a JJ structure right beneath the section listing of the PE\nheader. Each configuration section starts off with the magic number 0x4A4A (“JJ”) and holds an\noffset to the data as well as a CRC32 tag to describe the data type (e.g. additional payload). A\n[profound introduction into the configuration format of Ursnif can be found here.](https://labs.sentinelone.com/writing-malware-configuration-extractors-isfb-ursnif/)\n\nJJ structure\n\nThe loader comprises two configuration sections. The first section is an “INSTALL_INI” that is\nrequired to install the payload of the second section. The second section contains an APlibcompressed DLL that is the actual worker. Before this second DLL is unpacked the loader checks\nwhether the operating system has a Russian or Chinese localization. If so, then the loader silently\nstops its operation.\n\n### The Worker\n\n\n-----\n\nLOLSnif’s worker still resembles an original Ursnif worker. For instance, the general structure of\nthe project is still preserved. This includes peculiarities like the configuration storage using JJ\nstructures and the encrypted “.bss” section that holds strings and other data that deserves\nprotection. Although there are some slight changes to the encryption algorithm. However, there\nare several interesting enhancements that I will detail later on.\n\nIts configuration format is the same as its ancestor. The following screenshot shows a\nconfiguration blob that is highlighted with colors. Its first part compromises structures with offsets\nto strings and information on the data type. At the end of the blob (grey area) are these strings\nstored. For instance, the area highlighted in blue contains the command and control server\naddresses. This area is followed by a list of public DNS server. Notably this blob contains\nconfiguration parameters for a DGA (Domain Generation Algorithm), e.g. the domain where to\ndownload keywords for domain generation (constitution[.]org). However, LOLSnif does not\ncomprise any functionality to generate domain names.\n\nConfiguration blob\n\nAs its ancestor Ursnif, LOLSnif comes with a encrypted “.bss” section that holds, for example,\nstrings. This section is decrypted on startup. However, the decryption algorithm differs slightly\nfrom the original code base. The following screenshot depicts the decryption algorithm. The\ndecryption key is still based on the sample’s compilation date, which is hard-coded in the binary.\nHowever, there are some modifications to this key. Also, the original Ursnif utilized a rolling XOR\nalgorithm, where LOLSnif’s algorithm is based on add / sub instructions. The full list of decrypted\n[strings can be found in Appendix B (pdf, 121.5 KB).](https://www.telekom.com/resource/blob/600078/0a7581ca22c85e654a49eeb2cd302c02/dl-20200511-lolsnif-appendix-b-en-data.pdf)\n\n\n-----\n\nDecryption algorithm\n\nFurthermore, some strings do not have references. Hence, they are dead and not needed. While\nthis may be an issue with the disassembler, this is rather an issue with the code. The strings are\ndefined in Ursnif's code as macros (see header file “Common/cschar.h”). Therefore, the authors\nof the malware must keep track of them. This may suggest that this functionality is not yet\nimplemented, or the author forgot to clean up all unused functionality like in the DGA example.\n\nThe interaction with the registry is implemented in two ways: via native Win32 APIs (e.g.\nRegOpenKey, RegEnumKey, RegCloseKey) and via Windows Management Instrumentation\n(WMI). There are wrapper functions that take a Boolean argument in order to decide whether to\nuse the Win32 API or WMI. For instance, the following screenshot shows a wrapper function for\nsetting a string value of a registry key. The first argument (annotated as “use_wmi” in the\ndisassembly) determines the use of native API or WMI.\n\n\n-----\n\nWrapper function\n\nLOLSnif seems to be only built for x86. However, it clearly anticipates that it will run on x64\nplatforms as well. For instance, it utilizes the flag “__ProviderArchitecture” to request data from a\n64 bit WMI provider as an 32 bit application.\n\nAnother interesting aspect is that LOLSnif makes extensive use of COM interfaces. It was\nreported that this malware instruments the Internet Explorer via IWebBrowser in order to contact\nits Command and Control servers (CC). This tactic allows it to bypass any proxy configuration in a\ncooperate network since Internet Explorer typically knows how to talk to the proxy. LOLSnif\nanticipates that there might be invalid certificate warnings since it searches in the DOM via\nIHTMLElement for the string “invalidcert”. If it encounters this string, then it confirms the warning\nto send the payload to the CC server. However, the current sample does not utilize https but\nrather plain http. Furthermore, the malware sets Internet Explorer as standard browser in order to\navoid any popups during operation.\n\n[This Ursnif variant makes use of LOLBins (as also pointed out in this blog). For instance, LOLBins](https://thedfirreport.com/2020/04/24/ursnif-via-lolbins/)\nare utilized to start the malware from the registry (mshta.exe + powershell.exe). Furthermore,\nLOLSnif is capable of download and execute further modules as well as payloads. For instance, a\n[recent blog post mentions that the associated actor dropped a Cobalt Strike BEACON as well as](https://thedfirreport.com/2020/04/24/ursnif-via-lolbins/)\na legitimate TeamViewer VNC client.\n\n## Zooming Out: Tracking LOLSnif’s /api1 Activity Throughout the Last Months\n\n\n-----\n\nBased on the campaign that I observed in April 2020, I pivoted to track LOLSnif activity\nthroughout the last months. There are several links we can leverage to find more samples and\n[domains. Appendix A (pdf, 93.0 KB) lists all IoCs that I found during my investigation. First, the](https://www.telekom.com/resource/blob/600076/ff2f4f0adcfcef604c1f8aa0c3a615e2/dl-20200511-lolsnif-appendix-a-en-data.pdf)\nstring decryption algorithm of LOLSnif differs from the original code base. Therefore, I hunted for\nmore samples based on this algorithm. This yielded several samples from which I was able to\nextract the configuration. The following table shows the unique configurations that I was able to\nfind.\n\n\n#### Hash (SHA256 prefix)\n\n\n#### Botnet ID\n\n\n#### Server ID\n\n\n#### Serpent Key\n\n\n#### Compilation Timestamp\n\n\n#### 8d700ea\n\n\n#### 1000\n\n\n#### 730\n\n\n#### W7fx3j0lFvOxT2kF\n\n\n#### Thu Oct 31 14:55:25 2019 UTC\n\n\n#### c206f90\n\n\n#### 2000\n\n\n#### 730\n\n\n#### W7fx3j0lFvOxT2kF\n\n\n#### Wed Dec 4 16:56:24 2019 UTC\n\n\n-----\n\n#### 7307f15\n\n\n#### 3000\n\n\n#### 730\n\n\n#### W7fx3j0lFvOxT2kF\n\n\n#### Wed Feb 19 11:18:20 2020 UTC\n\n\n#### f48e634\n\n\n#### 2000\n\n\n#### 730\n\n\n#### U7yKaYwFde7YtppY\n\n\n#### Wed Feb 19 11:18:24 2020 UTC\n\n\n#### 8ffe59d\n\n\n#### 3000\n\n\n#### 730\n\n\n#### W7fx3j0lFvOxT2kF\n\n\n#### Wed Apr 1 17:32:33 2020 UTC\n\n\nAll samples share the same server ID (730) and the same RSA key (not listed here). There are\nthree botnet IDs (1000, 2000, 3000) that follow an increasing pattern with each campaign. Their\ncompilation timestamps seem to be legit. All but the last share the domain ”wensa[.]at” or a\nsubdomain of it. As we later will see, the actor utilized this domain for roughly six months. The\nserpent CBC key is “W7fx3j0lFvOxT2kF” in all cases but one. This outlier belongs to the botnet ID\n2000, which has the key “U7yKaYwFde7YtppY”. Interestingly, there are two samples that were\ncompiled within four seconds on 2020-02-19, which suggests that there is some form of build\nautomation.\n\n\n-----\n\nAnother way is to pivot on the CC infrastructure. First, all samples use “/api1” as part of their\nURLs, e.g. “been.dianer[.]at/api1”. Second, all domains but one uses the “.at” TLD. There is one\nTOR “.onion” domain “6buzj3jmnvrak4lh.onion”. If we utilize passive DNS information regarding\nthe already known domains / IPs, then we find further interesting information. There are many\ndomains that the associated actor utilized for several months. The domain “wensa[.]at” was\nprobably utilized for the longest time, roughly six months.\n\nThe following timeline shows the unique configurations and some of the domains. The samples\nare described by their SHA256 prefix and their serpent CBC key prefix, e.g. 8d700ea_W7. The\ndomains have a first seen date (FS) and some of them a last seen date (LS). The domains\nlamanak[.]at and kamalak[.]at that the actor probably registered at the very beginning of their\noperation are still from time to time associated with IPs of their infrastructure. Furthermore, I\nsuppose that the aforementioned wensa[.]at domain was replaced by the pipen[.]at domain in\nMarch 2020.\n\nTimeline\n\nThe associated actor does either not care about OpSec or is very sure of their capabilities since\nthey are reusing domains and IPs several times and they utilize them sometimes for very long\nperiods of time.\n\n## Conclusion\n\n\n-----\n\nIn this blog, I’ve scrutinized a recent Ursnif variant to which I refer as LOLSnif and its recent\nactivity. The associated actor possibly conducts targeted cybercrime operations that are still\nongoing. At the heart of these campaigns is a variant of the Ursnif Trojan that was repurposed as\na downloader and reconnaissance tool to meet the actor’s special needs.\n\nThe techniques utilized by this actor such as LOLBins, heavy obfuscation, as well as COM\ninterfaces and the TTPs observed by others in later stages of an attack such as utilization of post\nexploitation frameworks (Cobalt Strike) and VNC clients (TeamViewer) suggest that this actor is\ninvolved in targeted attacks. The attacks are ongoing since month without much public attention.\nThis maybe the reason why the associated actor reuses domains and IPs over and over again.\n\nNevertheless, this actor should not be overlooked and maybe more data in the future (e.g. from\nIncident Response Engagements) helps to shed some light on the ultimate goal of this actor.\n\n### Appendix A: IoCs (pdf, 93.0 KB)\n\n Appendix B: Full Dump of Decrypted Strings (pdf, 121.5 KB)\n\n[More informationCybersecurity: TA505’s Box of Chocolate](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-s-box-of-chocolate-597672)\n[Cybersecurity: Dissecting Emotet - part one](https://www.telekom.com/en/blog/group/article/cybersecurity-dissecting-emotet-part-one-592612)\n[Cybersecurity: Dissecting Emotet - part two](https://www.telekom.com/en/blog/group/article/cybersecurity-dissecting-emotet-part-two-596128)\n[Media information: Telekom presents current figures on cyber security](https://www.telekom.com/en/media/media-information/archive/telekom-presents-current-figures-on-cyber-security-573050)\n[Media information: The Global Guardian never sleeps](https://www.telekom.com/en/media/media-information/archive/the-global-guardian-never-sleeps-582556)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.05.14.LOLSnif/Cybersecurity_%20Tool%20leaks%20are%20very%20interesting%20occurrences%20in%20cyber%20security.%20_%20Deutsche%20Telekom.pdf"
    ],
    "report_names": [
        "Cybersecurity_ Tool leaks are very interesting occurrences in cyber security. _ Deutsche Telekom"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1589516832,
    "ts_modification_date": 1589516832,
    "files": {
        "pdf": "https://archive.orkl.eu/e76e58648d529f7171fe87500cfe5b8ce2813e0b.pdf",
        "text": "https://archive.orkl.eu/e76e58648d529f7171fe87500cfe5b8ce2813e0b.txt",
        "img": "https://archive.orkl.eu/e76e58648d529f7171fe87500cfe5b8ce2813e0b.jpg"
    }
}