{
    "id": "bce224a8-2165-4a6e-8bdd-c10eb77268fb",
    "created_at": "2022-10-25T16:48:15.795101Z",
    "updated_at": "2025-03-27T02:10:49.327216Z",
    "deleted_at": null,
    "sha1_hash": "b65c2bd1f50ac2172ba00b59e1dc08750f7d7089",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-03-29T20:17:42Z",
    "file_modification_date": "2019-04-03T12:58:10Z",
    "file_size": 4342395,
    "plain_text": "### MARCH 2019 SHORT VERSION\n\n# CRIME WITHOUT PUNISHMENT\n\n### IN-DEPTH ANALYSIS OF JS-SNIFFERS\n\n###### REGISTER FOR A FREE PRODUCT TOUR TO TEST DRIVE\n\n ALL THE BENEFITS OF GROUP-IB THREAT INTELLIGENCE\n\n AND RECEIVE THE FULL VERSION OF THE REPORT BY\n\n CONTACTING US THROUGH\n\n research@group-ib.com\n\n\n-----\n\n## TABLE OF CONTENTS\n\n###### Introduction \b 3 Key findings \b 5\n\nSubject of research 5\n\nHow JS-sniffers work 6\n\nMethods of infection 8\n\nAttacks via supply chain 8\n\nJS-sniffer as a service 12\n\nScale of infections and victims 12\n\nRecommendations for affected parties 14\n\n###### Detailed description of JS-sniffers families \b 15\n\nGMO 15\n\nTokenLogin 16\n\nTokenMSN 19\n\nImageID 20\n\n**СHAPTER IS AVAILABLE IN FULL VERSION ONLY**\n\nPreMage 26\n\nMagentoName 27\n\nPHP backdoors 28\n\nGetBilling 31\n\nWebRank 32\n\nPostEval 38\n\nIllum 39\n\nFakeCDN 43\n\nCoffeMokko 45\n\nReactGet 49\n\nG-Analytics 56\n\nQoogle 60 \b\b\n\n\n###### 2 CONFIDENTIAL\n\n\n-----\n\n## INTRODUCTION\n\nThe underground market for the sale and rental of malware, like any other market,\nhas its own structure and is divided into segments. Each niche has its own\ndevelopers, customers, sellers, and intermediaries. In this case, the products include\nviruses, Trojans of all types, RAT, rootkits, as well as frameworks for their creation builders and various modules that allow purchasers to create complex malware or\nimprove the characteristics of existing malware samples.\n\nOften, however, cybersecurity analysts are unaware of threats that do not rush to\nmake themselves known. Over time, the market niche of these threats increases,\nnew actors appear, the software itself begins to be divided into families, competition\nunfolds, and damage increases. The result is a poorly-studied type of malware\nstriking a blow.\n\nThus, in September 2018 it became known that users of the site and mobile\napplication of the international airline British Airways were compromised. All of its\ncustomers who made bookings using the company's official website or application\nbetween 25 August and 5 September, 2018 were at risk. In total, the personal and\nfinancial data of 380,000 people fell into the hands of threat actors.\n\nThe new incident became known in March 2019, thanks to the Group-IB team.\nGroup-IB Threat Intelligence experts discovered that the website of the international\nsporting goods company FILA UK was infected, which could have led to the theft of\npayment details of at least 5,600 customers for the past 4 months.\n\nIn both cases, threat actors injected JavaScript code stealing the financial data\nentered by users. It was done using a JS-sniffer. This type of malware seemed to\nbe a rather primitive threat to large players like banks and payment systems, as it is\ncommonly believed that the targets of JS-sniffers are small online stores. But it's\ntime to question that belief. First, when a site is infected, everyone is involved in the\nchain of victims - end-users, payment systems, banks\nand companies that sell their goods and services on\nthe Internet. Secondly, the examples above are not\n\n###### What is JS-sniffer?\n\nthe only precedents of JS-sniffers being planted on\nthe sites of large companies, which means that this A JS-sniffer is a type of malicious code injected by threat\n“insignificant threat” is growing. actor into the victim's website to intercept user input: bank\n\ncard numbers, names, addresses, logins, passwords.\n\n\nGroup-IB Threat Intelligence specialists continuously\nmonitor the appearance of new JS-sniffers,\nboth universal and specially designed for specific CMS (Content Management\nSystem). Taking into account the growing volume of this malicious code market\nsegment, Group-IB team decided to analyse the family of JS-sniffers, significantly\ncomplementing previously existing descriptions and reports on the market.\n\n###### 3 CONFIDENTIAL\n\n\n-----\n\n**In this report, the Group-IB team presents the results of its**\n**study and analysis of the following parameters describing the**\n**JS-sniffer market:**\n\n- **Total number of JS-sniffer families has reached 38 (whereas previously**\nonly 12 were known). 15 out of these 38 families are described in the report\n(and at least 8 out of these 15 families are described for the first time). The\nrest will be uploaded to Group-IB Threat Intelligence system.\n\n- **Classification of JS-sniffers was added describing two types of**\nJS-sniffers: universal and specialized (developed for a specific CMS or\npayment system).\n\n- **Connections between JS-sniffers and signs of “competition” at the**\ntechnological level when malicious code of the one family is programmed to\n“displace” an earlier infection or use it as a “donor”.\n\n- **Ways JS-sniffers are sold or rented, as well as how customers are moving**\nfrom one JS-sniffer provider to another.\n\n- **Classic and new schemes of attacks, including the creation of fake**\n\nwebpages for real payment systems with full copy of their branding.\n\n- **The total number of sites infected with JS-sniffers with confirmed**\nbelonging to a particular family.\n\nThe trends in the development of JS-sniffers identified in this study\ndeepen our understanding of this type of threat and provide a good\nbasis for investigating cybercrime carried out with this malicious code.\n\n\n#### 38\n\n\n㌀\nJS-snifers will e\nuploaded to Group-IB\nThreat Intelligence\n\n\n###### 4 CONFIDENTIAL\n\n\n-----\n\n## KEY FINDINGS\n\n###### Subject of research\n\nA JS-sniffer is a type of malicious code injected by threat actor into the victim's\nwebsite to intercept user's input: bank card numbers, names, addresses, logins,\npasswords and other data. Threat actors resell the data they obtain or use it\nthemselves to purchase valuable goods, usually for the purpose of resale and,\naccordingly, to earn money.\n\n\nRiskIQ analysts were the first to analyse the activities\nof JS-sniffers, and identified 12 groups under\nthe common name MageCart. Group-IB experts\nstudied these JS-sniffers and, thanks to proprietary\nanalytical systems, were able to discover their entire\ninfrastructure as well as access sources and tools.\nThis approach allowed for better attribution and\nidentification of at least 38 different families.\n\n\n###### Group or family?\n\nA JS-sniffer can either be developed by a particular threat\n\nactor, or be a program provided to customers for rental or\n\nsale. Since in some cases it is difficult to determine how\n\nmany people use the JS-sniffer, Group-IB experts call them\n\nfamilies, not threat actors.\n\n\nEach family has unique characteristics, and they are most likely managed by\ndifferent people: all JS-sniffers perform similar functions and the creation of two\nJS-sniffers by one cybercriminal would be inexpedient.\n\nThe research continues: descriptions of all JS-sniffers appear in the Group-IB\nThreat Intelligence system. This report analyses the work of 15 JS-sniffer families\nand the differences between them. At least 8 of these families are described for the\nfirst time and have not been investigated before.\n\n**TokenLogin** **March 2016** **Illum** **End of 2016** **MagentoName** **December 2017**\n\n**TokenMSN** **Mid 2016** **WebRank** **End of 2016** **ImageID** **End of 2017**\n\n**G-Analytics** **September 2016** **ReactGet** **June 2017** **GetBilling** **Start of 2018**\n\n**PreMage** **November 2016** **PostEval** **Mid 2017** **Qoogle** **April 2018**\n\n**FakeCDN** **November 2016** **CoffeMokko** **September 2017** **GMO** **May 2018**\n\nList of JS-sniffer families analyzed in this report: 15 out of 38 discovered by Group-IB team\n\n###### 5 CONFIDENTIAL\n\n\n-----\n\nPotentially huge number of victims (it's a rare person today who doesn't buy\nonline) and illustrate the urgency of the problem. Also this threat is not being taken\nseriously as it should be and therefore cybercriminals have a sense of impunity and\nthe number of attacks is growing. A multi-linked chain of victims include different\nparties: user, online store, payment system, bank, all of them suffer from attacks.\n\n**USERS** **ONLINE SHOPS**\n\n  - data compromise   - reputational damage, customer\n\noutflow and even closure\n\n  - direct financial loss\n\n                                        - compliance and violation of\nregulatory requirements for data\nsafety\n\n                                        - reimbursement of losses to clients\n\n**PAYMENT SYSTEM** **CARD ISSUER BANK**\n**OR ACQUIRING BANK**\n\n                                        - reputational damage, compromise\n\n  - Illegal use of the brand - phishing pages of customer card data\n\n  - reduced user confidence & trust   - operational costs on investigating\n\nmoney theft from a client’s card\n\n  - safety system alarms, suspicions of\ntargeted attacks    - safety system alarms, suspicion\n\nof targeted attacks\n\n                                        - reimbursement of losses to clients\n\n###### How JS-sniffers work\n\n**Step 1 - Obtain access to the site with the ability to change scripts on it**\n\n- **Option 1 - obtain login and password for the administrator panel via password-stealing**\nmalware or other methods.\n\n- **Option 2 - find vulnerable sites and use exploits of popular CMS or known vulnerabilities of**\nservice providers to get access to modify site files.\n\n- **Option 3 - find another group that has already gained access to the site and buy it out.**\n\n**Step 2 - Acquire the JS-sniffer**\n\n- **Option 1 - develop the JS-sniffer.**\n\n- **Option 2 - purchase/rent the JS-sniffer on an underground forum.**\n\n**Step 3 - Install the JS-sniffer**\n\nJS-sniffer installed via a control panel or web-shell collects data and sends it to a\nhost managed by the threat actor. Some families use methods that allow them stay\nunnoticed during a manual check:\n\n- adding it to the legitimate library of scripts;\n\n- suspending JS-sniffer activity when a user uses the developer console (e.g. Chrome\nDevTools or Firefox Browser Toolbox).\n\n###### 6 CONFIDENTIAL\n\n|USERS •• data compromise •• direct financial loss|ONLINE SHOPS •• reputational damage, customer outflow and even closure •• compliance and violation of regulatory requirements for data safety •• reimbursement of losses to clients|\n|---|---|\n|PAYMENT SYSTEM OR ACQUIRING BANK •• Illegal use of the brand - phishing pages •• reduced user confidence & trust •• safety system alarms, suspicions of targeted attacks|CARD ISSUER BANK •• reputational damage, compromise of customer card data •• operational costs on investigating money theft from a client’s card •• safety system alarms, suspicion of targeted attacks •• reimbursement of losses to clients|\n\n\n-----\n\n**Step 4 - Monetization**\n\n- **Option 1 - sale data to carders - cybercriminals who earn money**\nfrom the resale of goods or services purchased using stolen bank\ncards. From each card, the threat actor can get from 1 to 5 USD.\nThis method is the simplest and require only to have contacts with\nseveral verified buyers.\n\n- **Option 2 - using stolen cards to purchase goods which are easy to**\nresell: gadgets, electronics, home appliances, interior items, clothes\nand shoes.\n\nThe picture shows a telegram bot offering to buy data\n\nstolen by JS-sniffers - 24/7, at a price of 5 to 10 dollars.\n\nAfter being collected, the payment information and personal data of the victim are\nsent to the threat actor's server. The server responsible for receiving stolen data\nis a gate. The JS-sniffer chain can use multiple levels of gates located on different\nservers or hacked sites, making it difficult to detect the threat actor's end server.\nHowever, in some cases, the administrative panel is located on the same host as the\ngate used for collecting the stolen data.\n\nThe threat actor's end server for tracking JS-sniffer activity and exporting stolen\ndata can be either a fully-featured administrative panel or a server for hosting\ndatabase administration tools. For example, administrative panel functions can be\nperformed by such tools as Adminer or phpMyAdmin.\n\nScheme of the sniffer’s work\n\n###### 7 CONFIDENTIAL\n\n\n-----\n\n###### Methods of infection:\n\nThreat actors use various methods to infect sites and inject malicious code:\n\n**1) CMS vulnerabilities - malicious code can be injected into the code of online**\nstore sites by exploiting vulnerabilities in CMS developed specifically for online\nstores - Magento, OpenCart and others.\n\n- By downloading a web shell to the site by exploiting the\nvulnerability, with subsequent modification of the site\nfiles; or\n\n- By implementing JS-sniffer code by exploiting a\nvulnerability that allows malicious code to be added to\none of the site code blocks: for example, to a footer.\n\n**2) Hacking the administrative panel of the site**\n\nThe JS-sniffer can be installed by obtaining the\nadministrative panel of the site with the permission to\nedit files. Login and password can be compromised by\nseveral methods:\n\n- Stealers (if the web developer saved the password in the\nbrowser)\n\n\n\n- Brute force\n\n- Injecting code for password stealing\n\n**3) Hacking of third-party services**\n\n\nBreakdown of attacked resources by CMS\n\n\nThe JS-sniffer can get to the target site by hacking third-party services, the scripts\nof which work on the target site:\n\n- Hacking websites which provide services for online stores (customer support chats, or\nanalytics and statistics systems). By injecting malicious code into the code of service\nscripts, the JS-sniffer gets into the code of online stores' sites.\n\n- Hacking the accounts of CDN services with the ability to modify scripts loaded from CDN\nto target sites.\n\n###### Attacks via supply chain\n\nThe threat actor that used the WebRank JS-sniffer family often carried out attacks\non third-party sites that provide various services for other sites. For example, by\nhacking into the web analytics system, threat actors injected the JS-sniffer code\ninto the web analytics script. This script, which is loaded by a large number of sites,\nloaded a bank card JS-sniffer along with itself.\n\nThe use of third parties to deliver JS-sniffers to victims' websites also explains\nthe hacking of the rival MagentoName JS-sniffer family. During one wave of\nMagentoName JS-sniffer infections, the threat actor used JS-sniffers posted on\nhacked legitimate websites. WebRank JS-sniffer operators gained access to the\nMagentoName JS-sniffer code and added their malicious code to it.\n\n###### 8 CONFIDENTIAL\n\n\n-----\n\nOne of these attacks was the attack on Feedify, a real-time push notifications\nservice. By injecting the JS-sniffer code into the code of the file, which was\nlocated at https://feedify.net/getjs/feedbackembad-min-1.0.js, the threat actor\nautomatically uploaded the JS-sniffer to all Feedify customers, and their sites were\ninfected with the feedbackembad-min-1.0.js script.\n\nThe injected code was obfuscated. Decoding the script produces JS-sniffer code.\nStolen data was sent to the threat actor's website: https://info-stat.ws/js/slider.\njs. Data is only sent if the user's address meets certain criteria. Hackers use this\nmethod to try to determine whether the user is on the payment page, by using a list\nof keywords.\n\nInitially, the JS-sniffer was injected into the Feedify code on 17 August, and on 11\nSeptember it was detected and removed. However, the intruders re-infected it\non 12 September. Attacks on third-party suppliers have proven successful: more\nthan 60% of the 300 sites downloading the Feedify script belong to eCommerce\nwebsites, and therefore are targets for the WebRank JS-sniffer family.\n\n###### Target payment systems\n\nIn terms of architecture, each JS-sniffer has a client and a server parts.\n\n**The client part of the JS-sniffer** **The server part of the JS-**\n**is responsible for initial data** **sniffer is the application the**\n**collection, which can be carried** **JS-sniffer operator works**\n**out in various ways:** **with.**\n\n  - on a hard-coded list of names of The functions performed by the\npayment forms fields for various server depend on how accurately\npayment systems; the client part determines the\n\n  - using a list of regular expressions type of data stolen: if the data\nthat define fields of interest to the is transmitted in unprocessed\nJS-sniffer and contain sensitive form, it means that identification\ninformation; of the card number, CVV,\n\nexpiration date, etc is done in the\n\n  - according to the list of basic HTML\nelements used in the payment form. administrative panel.\n\nProcessing the data in the administrative panel is advantageous, as it is easier for\nthe hacker to make changes to the administrative panel code if necessary than to\nchange the code of the JS-sniffer injected into the online store website.\n\nHowever, many JS-sniffer families are not universal and use unique options for\neach individual payment system, which requires modification and testing of the\nscript before each infection.\n\n###### 9 CONFIDENTIAL\n\n|The client part of the JS-sniffer is responsible for initial data collection, which can be carried out in various ways: •• on a hard-coded list of names of payment forms fields for various payment systems; •• using a list of regular expressions that define fields of interest to the JS-sniffer and contain sensitive information; •• according to the list of basic HTML elements used in the payment form.|The server part of the JS- sniffer is the application the JS-sniffer operator works with. The functions performed by the server depend on how accurately the client part determines the type of data stolen: if the data is transmitted in unprocessed form, it means that identification of the card number, CVV, expiration date, etc is done in the administrative panel.|\n|---|---|\n\n\n-----\n\n###### Universal JS-sniffers\n\nUniversal JS-sniffers are JS-sniffer families that are set up to steal information\nfrom different types of payment forms and do not require modifications for specific\nwebsites.\n\n**G-Analytics and WebRank JS-sniffer families are designed to collect all the**\ncontent of the hardcoded list of HTML elements, which means that parsing all\nthe collected information is conducted in the administrative panels of these JSsniffers, on the server side.\n\n**WebRank JS-sniffers search for elements such as “text”, “a”, “button”, “input”,**\n“submit” and “form” and create specific event handlers for them all.\n\n**G-Analytics JS-sniffers search for elements such as \"input\", \"select\", \"textarea\",**\n\"checkbox\". If the result of this search contains data matching the regular\nexpression of a credit card number, the JS-sniffer sends this information to the\nattackers’ server.\n\n###### JS-sniffers for specific CMS\n\nMost JS-sniffer families detected were created to steal information from the\npayment forms of a specific CMS. These JS-sniffers search for specific fields by the\nlist of names hardcoded in the JS-sniffer source code. Such fields could contain the\nvictim’s payment information.\n\nThe following JS-sniffer families search default Magento fields:\n\n- PreMage\n\n- MagentoName\n\n- FakeCDN\n\n- Qoogle\n\nThe GetBilling JS-sniffer family also targets Magento websites, however it\nsearches not for fields but for forms, by name.\n\nThe PostEval JS-sniffer family targets OpenCart websites. These JS-sniffers use\na hardcoded list of names that correspond to the fields in a payment form. The list\nof field names is used to search for the victim’s payment information.\n\n###### 10 CONFIDENTIAL\n\n\n-----\n\n###### Breakdown of target payment systems by JS-sniffer families\n\n**GMO** **TokenLogin** **TokenMSN** **ImageID** **CoffeMokko** **ReactGet**\n\n###### ● ● ● ● Adyen\n\n ● ANZ eGate\n\n ● ● ● ● ● ● Authorize.Net\n\n ● ● ● Braintree\n\n ● Chase Paymentech (Orbital)\n\n ● Cielo\n\n ● ● CyberSource\n\n ● DataCash (MasterCard)\n\n ● EBANX\n\n ● ● ● eWAY\n\n ● ● Fat Zebra\n\n ● First Data\n\n ● Flint\n\n ● Heartland Payment Systems\n\n ● heidelpay\n\n ● LinkPoint\n\n ● MivaPay\n\n ● Moip\n\n ● Moneris Solutions\n\n ● MundiPagg\n\n ● Pagar.me\n\n ● PagSeguro\n\n ● Payflow\n\n ● Paymetric\n\n ● PayOnline\n\n ● ● ● ● PayPal\n\n ● Pin Payments\n\n ● PsiGate\n\n ● Quickbooks Merchant Services\n\n ● Realex Payments\n\n ● ● ● ● Sage Pay\n\n ● Secure Trading\n\n ● ● ● ● ● Stripe\n\n ● Tranzila\n\n ● ● USAePay\n\n ● ● ● ● Verisign\n\n ● Wirecard\n\n ● Website Payments Pro\n\n ● ● WorldPay\n\n 11 CONFIDENTIAL\n\n\n-----\n\n###### JS-sniffer as a service\n\nEach individual family of JS-sniffers can represent\ndifferent types of services. When analysing\nunderground forums intended for communication\nbetween cybercriminals, a large number of services\nwere discovered offering their customers a complete\nsolution, including:\n\n- JS-sniffer or utility for generating JS-sniffers;\n\n- Administrative panel for data processing and tracking\nJS-sniffer activity;\n\n- Manuals for infecting online store sites;\n\n- Ready-made exploits to infect sites;\n\n\n###### How much JS-sniffers cost\n\nThe cost of JS-sniffers ranges from $250 to $5,000. Some\n\nservices provide the opportunity to work in partnership:\n\nthe client provides access to the store and gets 80% of\n\nthe revenue, and the JS-sniffer creator is responsible\n\nfor providing hosting servers, technical support and an\n\nadministrative panel for the client.\n\n\n\n- Auxiliary utilities for searching for vulnerabilities and mass infection of the sites.\n\nAn analysis of some JS-sniffer families showed that in some cases the domains used to\nstore the JS-sniffer code and to collect stolen data were registered by different users.\nIn other cases, the code has been modified, and different obfuscation methods and\ntechniques of hiding malicious activity were used. This may indicate that a separate\nfamily of JS-sniffers is used by different threat actors, that is, delivered as a service.\n\nIn other cases, the activities of a certain threat actor have been clearly defined, which\ncould mean independence from outside developers and usage of its own products\nonly. This would mean that these threat actors must have at least one person with web\ndevelopment skills and knowledge of languages such as HTML, JavaScript and PHP.\n\n###### Scale of infections and victims\n\nThe JS-sniffer families which have been detected were used to infect at least 2,440\nonline stores that accept bank cards. The total daily number of visitors of all the\ninfected sites is more than 1.5 million people.\n\nThe average number of visitors to infected sites for each JS-sniffer family shows which\nJS-sniffers are used to infect the most popular online stores: the average number of\nvisitors to sites infected with Illum, G-Analytics and TokenMSN is about 3,000 people\nper day per site while the same number for MagentoName is about 500 people.\n\nDue to the massive infections of sites (with the\nhighest numbers of total visitors for infected\nsites being on those infected by the families\nMagentoName and CoffeMokko), sites infected with\nthese JS-sniffers are visited by more than 440,000\npeople daily. The JS-sniffer family which infected\nthe third-most sites is the WebRank, representing\n250,000 visitors.\nAn analysis of the sites showed that more than\nhalf of them were infected with the MagentoName,\nwhose operators use vulnerabilities to inject\nmalicious code into the code of sites running older\nversions of CMS Magento.\n\nStatistics of total visitors for sites infected by different JS- 12\n\n###### CONFIDENTIAL\n\n\n-----\n\n###### More than 13% of infections occur due to the WebRank, which is used in attacks on third-party services to inject malicious code into target sites. Additionally, 11% are infected by JS-sniffers of the CoffeMokko family.\n\nBreakdown of attacked resources by JS-sniffers families\n\nBased on an analysis of the list of TLDs (top-level domains) of infected online\nstores, it can be concluded that attackers are generally interested in infecting sites\n\nfrom major developed countries: the USA,Great Britain, Australia, Germany.\n\nBreakdown of attacked resources by top-level domains\n\n###### 13 CONFIDENTIAL\n\n\n-----\n\n###### Recommendations for affected parties:\n\n**For the issuer bank of the compromised card**\n\n- Notify users about possible risks arising in the online payment process when using bank\ncards.\n\n- If your company's bank cards have been compromised, block the card and inform users\nabout the use of an online store that has been infected with a JS-sniffer.\n\n**For online store administrators**\n\n- Use strong, unique passwords and change them regularly.\n\n- Install all necessary updates for your software, including CMS. This will complicate the\nprocess of loading the web shell for the attacker.\n\n- For payment on a website, use a payment window that opens inside a separate iframe\nelement, without using third-party scripts.\n\n- Carry out regular inspections and safety audits of your site.\n\n- Use the appropriate systems to log all changes that occur on the site, as well as log access\nto the site control panel, and track file change dates. This will help you detect infection of\nsite files with malicious code, as well as the fact of unauthorized access to the site or web\nserver.\n\n**For the payment system / payment processing bank**\n\n- If you provide payment services for e-commerce sites, inform your customers about the\nthreat of JS-sniffers and basic security techniques when accepting online payments on\nthe sites.\n\n- Use an online payment window that runs on a separate page of your service, not on the\nonline store page. This will help to prevent theft of customers' bank card data even if\nmalicious code is injected into the online store website.\n\n- Make sure that your services use a correctly-configured Content Security Policy.\n\n###### 14 CONFIDENTIAL\n\n\n-----\n\n## DETAILED DESCRIPTION\n OF JS-SNIFFERS FAMILIES\n\n\n###### GMO\n\n\nnewly\ndiscovered\n\n\nThe GMO JS-sniffer was used in attack on FILA UK described in the introduction to\nthis report. It attacks websites running CMS Magento, the earliest activity for dates\nback to 07 May, 2018 when the domain name and a gate were created.\n\n###### Description\n\nWhen a site is infected, the attackers inject JavaScript code into the code of the\ntarget site page that is responsible for loading the JS-sniffer: the code checks\nwhether user billing data has already been collected by checking the presence of\ndata in localStorage with a special key, or whether there is a /checkout/ substring.\nIf at least one of these conditions is true, the body of the JS-sniffer responsible for\ninterception of the user's credit card will be injected into the online store page. The\nreference to a PHP-script returning JS-sniffer code is encoded in Base64.\n\nData collection is carried out with hard-coded names of payment form fields.\n\nIf the data is collected successfully, it will be saved to localStorage and then sent\nto the JS-sniffer gate via an image request. The link to the gate is also Base64encoded, and the gate is located on the same server as the script for loading the\nJavaScript code of the JS-sniffer.\n\n###### 15 CONFIDENTIAL\n\n\n-----\n\n###### Infrastructure\n\n**Domain**\n\ngmo.li\n\n###### TokenLogin\n\n\nnewly\ndiscovered\n\n\nAnalysis of malicious campaigns using this family of credit card JS-sniffers showed\nthat website infections were first detected in the middle of 2016. The first domain\nname created for hosting an administrative panel for the TokenLogin JS-sniffer was\nregistered on 31 March 2016.\n\nIt was also discovered that some files of one of the hosts used to deploy the\nadministrative panel were modified in April 2016. We can therefore assume that\nthis JS-sniffer family appeared around this time. JS-sniffers of the TokenLogin\nfamily were detected on websites that work with CMSs and platforms such as\n**Magento, Shopify, and Bigcommerce.**\n\n###### Description\n\nThe TokenLogin JS-sniffer was developed using the jQuery framework. During an\ninfection, malicious script injects JS-sniffer into existing HTML before the last body\ntag. This type of infection has two goals: first, to make it complicated to manually\ndetect the JS-sniffer code, and second, to make automatic reinfection simpler in\ncase the JS-sniffer is removed.\n\nPresumably, when the attackers gain access to a shop’s website, they create\nadditional backdoors to regain access and restore the JS-sniffer. In such cases, in\norder to automatically inject the JS-sniffer into the website, attackers must create\na routine that will find the last body tag and place sniffing code before it.\n\nAll payment data is saved to local storage and then sent to the attacker’s server\nvia an HTTP POST request, as long as the JS-sniffer is active. In some cases,\nJS-sniffers that run data validation were found; in other cases, there were no\nmodifications or checks of stolen data on the client side.\n\n###### 16 CONFIDENTIAL\n\n\n-----\n\n###### Administrative panel\n\nWhile analysing hosts used as gates for receiving\nstolen information, multiple administrative panels with\ntext in Russian were detected.\n\nSome folders on the web servers were open, which\nprovided us with “Last modified” dates and helped us\nunderstand when these panels were deployed for new\ncampaigns.\n\n###### Monetisation of stolen information\n\nGroup-IB specialists detected a sample of the JSsniffer presumably linked to the TokenLogin family and\nactively used in 2016.\n\n###### 17 CONFIDENTIAL\n\n\n-----\n\nThe domain name jscdn-jquery.com, which was used as a gate for collecting\nstolen data, led to the IP address 5.8.88.165. The same IP address is linked to the\nJabber-server coffee.creditcard, which was used by a seller of stolen credit cards\nin 2016. This seller owned a service created for selling payment information stolen\nusing JS-sniffer on Russian-speaking underground forums.\n\nThe domain name jqueryextd.us was registered by a user with the email address\n**futbolka183@yandex.ru. Group-IB specialists found that this email address is**\nowned by a user with the nickname futbolka.\n\n###### Mass infections\n\nA sample of the JS-sniffer that uses the domain name jquery-cdnlib.com as gate\nwas used to infect several websites belonging to a Californian marketing company\nthat sells music band merchandise. Several dozen websites were infected as a\nresult of this attack.\n\n###### Infrastructure\n\n**Detection date/**\n**Domain**\n**Creation date**\n\na11dd11blogger.com 25/04/2016\n\nair-frog33.pw 01/11/2016\n\ncdn-js-42.com 09/09/2016\n\ncdnbotstrap.com 14/03/2017\n\ncloud-update.top 18/11/2016\n\ncr1red-one.ltd 15/02/2017\n\njquery-cdnlib.com 28/02/2017\n\njquerycdnlibrary.com 10/05/2017\n\njqueryextd.us 31/03/2016\n\njqueryexts.us 16/12/2017\n\njscdn-jquery.com 10/02/2017\n\nmagento-analytics.com 12/05/2018\n\n###### 18 CONFIDENTIAL\n\n\n-----\n\n###### TokenMSN\n\n\nextension of\ncurrent research\n\n\nThe main part of the infection campaign using the TokenMSN family of credit card\nJS-sniffers started in the middle of 2017. However, several of the samples detected\nwere created earlier, in the middle of 2016. This JS-sniffer family was used to infect\nMagento websites.\n\n###### Description\n\nDuring an infection campaign, attackers conducted multiple attacks by injecting\nmalicious code into website HTML code. This malicious code, in JavaScript, was\ndesigned to steal personal and payment information. This family of JS-sniffers is\npresumably a modified or updated version of the TokenLogin JS-sniffer family.\n\nThe main difference between these two families is that in the case of TokenMSN\nJS-sniffers, the malicious script is injected through a link from the attacker’s server\nand can often be inserted into the legitimate code of web analytics systems, for\nexample. At the request of the web root, which acts as a gate for the JS-sniffer,\nusers are redirected to msn.com.\n\nTokenLogin and TokenMSN JS-sniffer families also\nshare similarities. For example, they both use AJAX\nand jQuery. They also both have a token parameter in\nthe gate URL, although in the case of TokenMSN this\nparameter has a constant value of KjsS29Msl.\n\nWhile analysing hosts used by this JS-sniffer family,\nGroup-IB specialists detected that there were multiple\nversions of JS-sniffers located on some of them.\nThe newest sample was uploaded to these hosts in\nSeptember 2018.\n\n###### 19 CONFIDENTIAL\n\n\n-----\n\n###### Analysis of infrastructure\n\nThe domain name analiticoscdn.com was registered on 12 May 2017 by a person\nwith the email address yalishanda@rocketmail.com. A user with the nickname\nyalishanda is the owner of a bulletproof hosting service for cybercriminals on\nRussian-speaking underground forums.\n\nThe domain names analyzer-js.com, js-cloud.com, and js-react.com were resolved\ninto 24, 39, and 35 unique IP addresses since April 2018. Presumably, the owner of\nthese domain names used the service to hide the real IP addresses of servers.\n\n###### Infrastructure\n\n\n###### ImageID\n\n\nextension of\ncurrent research\n\n\nImageID is one of the JS-sniffer families most widely used for attacks on online\nshops. During the entire time that the JS-sniffer was active, the developer added\nseveral improvements. Currently, this JS-sniffer family has an advantage over the\nothers. After infecting the target website, the JS-sniffer works as a keylogger: it\nlogs every keystroke and sends it to the attackers’ server every time the victim fills\nin a checkout form on the infected website.\n\nThe first detected domain names linked to this family were registered at the end\nof 2017, which could mean that the main part of the infection campaign started\naround this time. Attackers infected websites running on the CMSs and platforms\n**Magento, OpenCart, Shopify, WooCommerce, and WordPress.**\n\n###### 20 CONFIDENTIAL\n\n\n-----\n\n###### Description\n\nSamples of this JS-sniffer family were used as keyloggers. They sent Base64encoded payment information to the attacker-controlled server, which is a\nmiddleware between the victim’s browser and the JS-sniffer’s administrative panel.\nBased on the function names in the JS-sniffer source code and simple obfuscation,\nit is likely that each JS-sniffer was generated with random function names and\nvariables. However, it had to be human-readable to allow for simple modifications\nin case it was necessary to edit the source code for a specific online shop or if the\ncode was not working.\n\nWhile analysing the gate host used to collect stolen\ncredentials, an unknown login page was detected. At\nfirst, this login page was identified as a login page for\nthe malware family Agent Tesla.\n\nThrough in-depth analysis, some negligible differences\nfrom the Agent Tesla panel were discovered. The\npurpose of this panel remains unknown, however.\n\nWhile analysing an infected website, Group-IB specialists found that the attackers\nused not only a JS-sniffer, but also a fake payment form. For some reason, the\nattackers were forced to create and inject a fake payment form that was loaded\nfrom the other compromised website. This payment form offers victims two\npayment options: by credit card or PayPal. If the user chooses to pay via PayPal,\n\n###### 21 CONFIDENTIAL\n\n\n-----\n\nthe fake form will show an error message saying that this\npayment method is currently unavailable.\n\nIf the user chooses to pay by credit card, all payment\ninformation is sent to the script validation.php on the\nsame compromised website as the fake payment form.\nThe script validation.php sends stolen information to\nthe next level gate.\n\nWhile stolen payment information is sent, empty files\nare created in the first gate’s /database/ directory.\nThe name of each file is an MD5 value of the victim’s\nIP address and a User-Agent value. Presumably, this\ntechnique is used to avoid data duplication in the JSsniffer’s administrative panel.\n\nWhile analysing the ImageID infection campaign,\nGroup-IB specialists found one interesting sample,\nwhich was slightly different from the other samples in\nthis family. Nevertheless, it had the same parameter\nlist in the gate URL, Base64-encoding of stolen\ninformation, and encoded gate address in the JSsniffer source code.\n\nThe main differences between this particular sample\nand other JS-sniffers in this family are different\nJS-sniffer source codes and different methods of\ninjecting the JS-sniffer into the source code of the\ncompromised e-commerce website. In this case,\nthe JS-sniffer was injected by a direct link to the\nJavaScript file from the attacker-controlled server.\n\nThe functionality of sending stolen data is similar to\nthe one described above, however it does not contain\nany obfuscated code or randomly generated function\nnames.\n\n###### 22 CONFIDENTIAL\n\n\n-----\n\nWhile analysing a gate used by this JS-sniffer, GroupIB discovered a log file directory. Each file contained\ninformation intercepted from a compromised online\nshop by a credit card JS-sniffer, and each log file\nstored information from one website. At the time of\nthe analysis, the directory contained 122 log files. Each\nfile contained the name and values of fields from HTML\nforms filled in on the infected websites as victims\nproceeded with their payment.\n\nBased on the file modification dates, we can conclude\nthat this JS-sniffer received more than 20 requests\nfrom different infected websites.\n\nWhile analysing the gate on the website adsservicess.\ncom, our specialists discovered an ImageID JSsniffer’s administrative panel. This administrative\npanel is linked to an old version of the JS-sniffer,\nseeing as CAPTCHA was removed from the login page\nin later versions.\n\nTo hide the JS-sniffer’s malicious activity, operators of\nthe gate jquerylivecdn.com cloned the legitimate website\nhttps://jquery.com and deployed their clone to the gate\nhost.\n\nDuring a recent e-commerce website infection campaign,\nattackers used a gate with the domain name google\n###### 23 CONFIDENTIAL\n\n\n-----\n\nanalytics.org to collect stolen payment information. This domain name imitates the\nlegitimate domain name of the Google Analytics service. Attackers used an updated\nversion of the JS-sniffer, which includes detection of Chrome Developer Tools and\nFirebug. This technique is used for hiding malicious activity from analysts.\n\n###### Administrative panel\n\nWhile analysing the gate google-analytics.org,\nGroup-IB found an archive with the source code of\nan administrative panel of this JS-sniffer family, with\nscripts for middleware deployment.\n\nThe text file with the database dump makes it possible\nto determine which types of payment data the JSsniffer stole and saved.\n\n###### 24 CONFIDENTIAL\n\n\n-----\n\nMoreover, there was a text file with PHP code for the\ndeployment of middleware scripts or gates. The code\nis similar to the example found previously, but contains\nsome modifications.\n\nTo create new samples of the JS-sniffer, there is a\nspecial tab in the administrative panel that includes a\ngenerator of JS-sniffers and settings for each script.\n\nWhile researching this family of credit card JS-sniffers,\nour specialists discovered that one of the versions\nof the administrative panel was posted publicly on\nseveral Russian-speaking underground forums.\n\n###### Infrastructure\n\n**Detection date/**\n**Domain**\n**Creation date**\n\n94.249.236.106 30/11/2017\n\nanonimousall.xyz 30/10/2017\n\ngoogles-contents.com 21/09/2017\n\ngstaticss.com 10/09/2017\n\niwanalekseeff.000webhostapp.com -/\njackhemmingway.com 20/08/2018\n\nmiorita-timisoara.ro 01/08/2018\n\n###### 25 CONFIDENTIAL\n\n\n-----\n\n###### 26 CONFIDENTIAL\n\n\n-----\n\n##### CONFIDENTIAL\n NOT FOR PUBLICATION OR ANY DISTRIBUTION\n\n\n###### REGISTER FOR A FREE PRODUCT TOUR TO TEST\n\n DRIVE ALL THE BENEFITS OF GROUP-IB THREAT\n\n INTELLIGENCE AND RECEIVE THE FULL VERSION\n\n OF THE REPORT BY CONTACTING US THROUGH\n\n intelligence@group-ib.com\n\n 27 CONFIDENTIAL\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/Group-IB/Group-IB_js-sniffers.pdf"
    ],
    "report_names": [
        "Group-IB_js-sniffers"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1553890662,
    "ts_modification_date": 1554296290,
    "files": {
        "pdf": "https://archive.orkl.eu/b65c2bd1f50ac2172ba00b59e1dc08750f7d7089.pdf",
        "text": "https://archive.orkl.eu/b65c2bd1f50ac2172ba00b59e1dc08750f7d7089.txt",
        "img": "https://archive.orkl.eu/b65c2bd1f50ac2172ba00b59e1dc08750f7d7089.jpg"
    }
}