{
    "id": "bd3d5ffe-9acf-466c-b400-6d9cc636f5fa",
    "created_at": "2023-03-03T02:06:45.18026Z",
    "updated_at": "2025-03-27T02:16:26.184772Z",
    "deleted_at": null,
    "sha1_hash": "49f67c344146acc6e6a79da5dee395c5b7398fc9",
    "title": "2023-02-23 - Evasive cryptojacking malware targeting macOS found lurking in pirated applications",
    "authors": "",
    "file_creation_date": "2023-03-01T09:37:17Z",
    "file_modification_date": "2023-03-01T09:37:17Z",
    "file_size": 1465047,
    "plain_text": "# Beware of macOS cryptojacking malware.\n\n**[jamf.com/blog/cryptojacking-macos-malware-discovered-by-jamf-threat-labs/](https://www.jamf.com/blog/cryptojacking-macos-malware-discovered-by-jamf-threat-labs/)**\n\n[Jamf Blog](https://www.jamf.com/blog/)\n\nFebruary 23, 2023\nby\nJamf\nThreat Labs\n\n## Evasive cryptojacking malware targeting macOS found lurking in pirated applications\n\n[Security,](https://www.jamf.com/blog/category/security/) [Jamf Threat Labs](https://www.jamf.com/blog/category/jamf-threat-labs/)\nOver the past few months Jamf Threat Labs has been following a family of malware that\nresurfaced and has been operating undetected, despite an earlier iteration being a known\nquantity to the security community. In this article, we’ll examine this malware and the glimpse\nit offers into the ongoing arms race between malware authors and security researchers as\nwell as highlight the need for enhanced security on Apple devices to ensure their safe and\neffective use in production environments.\n\n**_Written by Matt Benyo_**\n\n**_Researched by Matt Benyo, Ferdous Saljooki and Jaron Bradley_**\n\nDuring routine monitoring of our threat detections in the wild, we encountered an alert\nindicating XMRig usage, a command-line crypto-mining tool. While XMRig is commonly used\nfor legitimate purposes, its adaptable, open-source design has also made it a popular choice\n\n\n-----\n\nfor malicious actors. This particular instance was of interest to us as it was executed under\nthe guise of the Apple-developed video editing software, Final Cut Pro. Further investigation\nrevealed that this malicious version of Final Cut Pro contained a modification unauthorized\nby Apple that was executing XMRig in the background. At the time of our discovery, this\nparticular sample was not detected as malicious by any security vendors on VirusTotal. Since\nJanuary 2023, a handful of vendors have detected the malware. However, many of the\nmalicious applications continue to go unidentified by most vendors.\n\nAdware has traditionally been the most widespread type of macOS malware, but\ncryptojacking, a stealthy and large-scale crypto-mining scheme, is becoming increasingly\nprevalent. Given that crypto-mining requires a significant amount of processing power, it is\nlikely that the ongoing advancements in Apple ARM processors will make macOS devices\neven more attractive targets for cryptojacking. While cryptojacking itself is not a new concept,\nthis particular variant employs some novel tactics.\n\nThis malware makes use of the Invisible Internet Project (i2p) for communication. i2p is a\nprivate network layer that anonymizes traffic, making it a less noticeable alternative to Tor.\nThis malware uses i2p to download malicious components and send mined currency to the\nattacker's wallet.\n\nWhile searching for other examples of malware that use i2p routing, we found that the\n[techniques of this sample were similar to those reported by Trend Micro in February 2022.](https://www.trendmicro.com/en_us/research/22/b/latest-mac-coinminer-utilizes-open-source-binaries-and-the-i2p-network.html)\nDespite the similarities, there were still discrepancies and unanswered questions, such as\nwhy this particular sample went undetected by all vendors on VirusTotal, even though the\nmalware family had already been documented.\n\nIn their report, Trend Micro speculated that the Mach-O sample may have arrived in a DMG\npackage for Adobe Photoshop CC 2019. However, they were unable to find the DMG itself.\nGiven that we were seeing a very similar scenario play out with Final Cut Pro, we also\nwanted to identify where this malware was coming from.\n\nIn an attempt to pinpoint the source of the malware, we turned to a Pirate Bay mirror and\nsearched for torrents of Final Cut Pro. We downloaded the most recent torrent with the\nhighest number of seeders and checked the hash of the application executable. It matched\nthe hash of the infected Final Cut Pro we had discovered in the wild. We now had our\nanswer.\n\n\n-----\n\nWe observed that the torrent was uploaded by a user with a yearslong track record of\nuploading pirated macOS software torrents, many of which were among the most widely\nshared versions for their respective titles:\n\nAfter a thorough analysis of the torrent upload DMGs, we discovered that the uploader was\nthe source of the malware we found and also confirmed it to be the source of the previously\nreported samples. Furthermore, we found that virtually every one of the dozens of uploads\nthat began in 2019 was compromised with a malicious payload to surreptitiously mine\ncryptocurrency.\n\nThis discovery presented a rare opportunity to trace the evolution of a malware family. What\nstarted as a rudimentary and conspicuous scheme had iterated through three distinct stages\nof evolution into something with creative evasion techniques. As far as we could tell, only\nsamples from the first generation of this malware family have been reported on.\n\nOur findings were made even more significant by the ability to trace the timeline of when the\nsamples entered circulation in the torrent community, when they started being submitted to\nVirusTotal, and when vendors started to successfully detect the different stages of this\nmalware. This provided valuable insights into the progression of the malware and its\nevolution and allowed us to better understand the tactics and techniques used by those\nbehind the malware.\n\n\n-----\n\n## Life, uh… finds a way\n\nAs we mentioned, our Final Cut sample was evading AV detection while the samples\npreviously reported were being detected across the board. Having found the direct source of\nthis malware, we had the luxury of directly comparing the samples. We observed clear\n\n\n-----\n\ndelineation points where the samples started to use new obfuscation techniques. Many of\nthese techniques were not present in the first-generation samples that were previously\nreported on.\n\nSo, what changed?\n\nThe first-generation samples used the AuthorizationExecuteWithPrivileges API to gain\nelevated privileges, which were needed to install the Launch Daemon for persistence.\nHowever, this process involved a conspicuous password prompt stating that the application\nneeded to make changes. Later first generation samples changed to a user Launch Agent,\nwhich would not require the conspicuous prompt. However, the second-generation samples\nthat began to appear on the Pirate Bay in April 2021 had no traditional persistence methods,\nsuch as Launch Daemons or Launch Agents, that were observed. Instead, the malware\nseems to rely on the user launching the application bundle to start the mining process.\n\nLater variants of the malware mask its malicious i2p components within the application\nexecutable using base64 encoding. We compared the third-generation pirated Final Cut Pro\nto a genuine copy and observed that it was significantly larger, weighing in at 11.9MB\ncompared to the standard 3.7MB. This is due to the presence of two large base64 encoded\nblobs and shell commands within the application executable.\n\n## Just Push Play\n\nWhen the user double-clicks the Final Cut Pro icon, the trojanized executable runs, kicking\noff the shell calls to orchestrate the malware setup. Contained within the same executable\nare two large base64 blobs that are decoded via shell calls. Decoding both of these blobs\nresults in two corresponding tar archives. One contains a working copy of Final Cut Pro. The\nother base64 encoded blob decodes to a customized executable responsible for handling the\nencrypted i2p traffic. Once the embedded data has been decoded from base64 and\nunarchived, the resulting components are written to the /private/tmp/ directory as hidden\nfiles. After executing the i2p executable, the setup script uses curl over i2p to connect to the\n\n\n-----\n\nmalicious author s web server and download the XMRig command line components that\nperform the covert mining. The version of Final Cut Pro that is launched and presented to the\nuser is called from this directory and eventually removed from the disk.\n\n1. User downloads and double-clicks application bundle\n2. Trojanized executable runs\n3. Working base64 encoded Final Cut Pro executable extracted\n4. Base64 encoded i2p executable extracted and disguised as mdworker_shared on\n\nexecution\n5. The Miner executable is pulled from the command and control server\n6. Mining begins disguised as mdworker_local process\n\n## Gaslight\n\nAll of this rapid staging on the launch of the application bundle is handled by the series of\nshell calls embedded in the malicious binary. We observed three different iterations of this\nshell setup loop. The earlier iteration was less involved and existed in a fairly readable format\nwhen dumped via the strings utility:\n\n\n-----\n\nIn the later iterations, the script has been converted to an oversized one-liner. This longer\nscript also handles building the configuration file settings for the miner:\n\nThe bash loop in this malware has a distinctive feature that was iterated on, but first\nappeared in 2019 samples. Despite our condemnation of the actions of malware authors, it's\nhard not to be intrigued by the clever use of the following commands:\n```\n(APID=$$;(while true; do sleep 3;(pgrep -x 'Activity Monitor' > /dev/null) &&\nbreak;done;); [ \\\"$I2PD_PID\\\" != \\\"\\\" ] && kill -9 \\\"$I2PD_PID\\\" > /dev/null\n2>&1; [ \\\"$PIDW\\\" != \\\"\\\" ] && kill \\\"$PIDW\\\" > /dev/null 2>&1; [ \\\"$PID\\\" !=\n\\\"\\\" ] && kill \\\"$PID\\\" > /dev/null 2>&1; pkill \\\"._${r_nme}\\\"; pkill\n\\\"._${r_i2}\\\"; kill \\\"$APID\\\" > /dev/null 2>&1;); exit) & echo $! >\n\\\"/tmp/i2pd/._pid\\\");\n\n```\nThe script runs a continuous loop that checks the list of running processes every 3 seconds,\nlooking for the Activity Monitor. If it finds the Activity Monitor, it immediately terminates all of\nits malicious processes. As a result, if the victim notices that their CPU is running hotter than\n\n\n-----\n\nnormal while unwittingly mining crypto for the attacker, and opens the Activity Monitor to\nconfirm their suspicion, the malware stops its activity and hides until the next time the victim\nlaunches the application.\n\nIn the third and latest generation of the script, we found a deceptive technique more\ncommonly found in Linux malware. The script uses the built-in bash command exec with the\n```\n-a flag to launch malicious processes. The -a flag enables the setting of a custom name for\n\n```\nthe process, which appears in the output of commands like ps aux. To blend in with the other\nrunning processes, the malware author chose to set the process names to the paths of\n```\nmdworker_local and mdworker_shared, which are the names of legitimate service\n\n```\nprocesses related to the Spotlight feature. This makes it more challenging to notice the\nmalicious processes and is yet another evasion technique employed by the malware.\nNothing to see here!\n\n## Ventura Raises the Bar\n\nAs we described previously, the later iterations of this malware stopped relying on launchd\nfor persistence and instead relied on the user launching the pirated software to initiate the\nminer. This approach allows the malware to steal CPU time for the duration of the active\nsession and provides a high degree of stealth. However, this strategy's success depends on\nthe software's regular launch by the victim.\n\nIn macOS Ventura, Apple has introduced security improvements that pose a new challenge\nto this approach. The more stringent codesigning checks in Ventura verify that all notarized\napps are correctly signed and have not been modified by unauthorized processes, even after\nthe first launch. This is an improvement from previous versions of macOS, where\nGatekeeper would only validate applications during their initial launch and would regard the\nfile as trusted once it was successfully launched.\n\n\n-----\n\nIn this case, major torrent clients on macOS (namely Transmission and uTorrent) do not\napply any quarantine attributes, thus bypassing the validation checks on a macOS Monterey\nsystem. However, on macOS Ventura, despite the lack of quarantine attributes, the modified\nversion of Final Cut Pro failed to launch and we received an error message. This was\nbecause the malware left the original code signing intact but modified the application, thus\ninvalidating the signature and failing the system security policy. The ongoing checks in\nVentura make it more difficult to bypass this validation, unlike in previous versions where\nsidestepping it was possible by avoiding or removing the quarantine attribute.\n\nOn the other hand, macOS Ventura did not prevent the miner from executing. By the time the\nuser receives the error message, that malware has already been installed. It did prevent the\nmodified version of Final Cut Pro from launching, which could raise suspicion for the user as\nwell as greatly reduce the probability of subsequent launches by the user.\n\n## One More Thing…\n\nBefore we declare this malware family DOA with the Ventura security updates, it must be\nnoted that this error message was only seen on the pirated versions of Logic Pro and Final\nCut Pro (both are Apple titles). At the time of writing, the pirated Photoshop uploaded by\nwtfisthat34698409672 still successfully launches both the malicious and working\n\n\n-----\n\ncomponents on the latest version of macOS Ventura 13.2 and earlier. This seems to be due\nto a minor difference in how the executable in the working copy of Photoshop is called\ncompared to how the Final Cut and Logic Pro executables are launched. These could likely\nbe restored to working order with minor adjustments from the malware author.\n\n## Epilogue: The Danger of Pirated Applications\n\nPirated software delivered over peer-to-peer networks makes for an ideal malware delivery\nmechanism for multiple reasons:\n\n1. Until macOS Ventura, file quarantine was a keystone piece in the macOS malware\nstrategy. Applying the quarantine attribute to downloaded files has historically been an “optin” affair and major torrent clients willfully opt out of applying the quarantine attribute to the\nfiles they download, thus eliminating one of the biggest security hurdles for malware authors.\n\n2. For any remaining hurdles, the malware author has an unwitting collaborator in the user\nthat downloaded the pirated application. The user has a strong potential to be coaxed into\nmanually disabling other security features, like Gatekeeper. Take for example this text from\nthe README.txt :\n```\nIf you have issues with image (annoying image/application is damaged messages\npretending you cannot open things) run in Terminal: sudo spctl --masterdisable\n\n```\n(Note: this command is used to entirely disable Gatekeeper functionality. Consider that there\nis no follow-up instruction for re-enabling it.)\n\n3. There is also a psychological component. The user knows they are doing something\nillegal, and it is not surprising when Apple’s built-in security prevents them from running\npirated Apple software. Furthermore, if the user eventually suspects that they may have\ninadvertently run malware on their work computer, they are far less likely to explain what\nactions took place to anyone in the Security or IT departments.\n\nJamf Protect specifically reports on whether Gatekeeper has been disabled on any\nendpoints.\n\n\n-----\n\nAll known versions of this malware family are detected and blocked by Jamf Protect Threat\nPrevention.\n\nDiscovered malware samples were shared with Apple. As of version 2166, XProtect\nsignatures have also been updated to defend against this threat.\n\n## IoC's\n```\nUniversal Binaries\nc19e78df3b3462064b9d78bc138674a7e8df28c7\n7628d90cfd311bfd4997729a232ca77a6d443619\n62ed66c1835ef5558ce713467f837efde508d5e4\n69fd812cf3760dc3dff5d41972cc635de9a0844d\n53fd50b23372a73e74e7cdc370f51ac560a1130f\nc56046c322316233d23db034670496756a6942fe\nd510b4c602404767f9ef75f5a48017d2b3743c4c\nbce251548798f159e99e71e68b65bbb4a9607296\n6ee76d296abf8da0f98d23f545ba4aa7c69e8211\ncea42a9b59cfa262453b508ea21d96f87bb793da\ne99f8ec210b26270894f16fe9c43f1203c13fb32\nbebe1ad82d595434c6ef529cb4f75f4937a04e5f\nc10079ed5885c64c0da6302bc91adf5b293aef4c\n140790186d0c60a604c5dd9f9d2c8dbc500da1c9\n2defaf34319b6255db45c8bebf55d5095a41bed8\nd86695fb9e56e03253503781f42f1069a5cc10d1\nf6348b7b79e48b5d2c13b8aa560c795d7a2c21d8\n278290e9b2517fa208bb019a0dc53a5a78995d84\ncf685bb0fe5e078ea28a25a7cf8774b168787db4\n96667da937efd370197fd94cc9a80b4fb3e8c153\n2b28169bdaee62eaaec708a9fa245b1c1e6c0e29\n\n```\n\n-----\n\n```\n325a470ec2ee3319f996723496689d052f3c3b47\na605e20250e66726a58699a2ae4f7264c8c2e4e2\n3ab040271882eb6c3a028498c7469450610ef7b8\n8ed83d6593bb0c7404f4571c91a4a80022088922\n687ec2b7d79ed6f953c7f519044b7117d12bdafa\n53bea5f857571d73b7b4a1f6db1edd340d453bca\n68f4979c04b4753a9f275f29c00d4b260f4c2ec0\n97fbb98f1ecbb2533204eca2967cf4117e388f22\n8907721154fc4079f9fc68e58c0ca742ffc1c9af\n89f2bb7f96317837514bbae70d47ac1e00626ac1\n5e4792e459f1107cf83ce3293141f9ba3026b015\n95f71894eec20f9727ff1311ad078de38ae4e774\n2ae591a3e14d77a9bc077fe61712c6b77f71fc11\nDMGs\nb5dd15e765ed5839a7d2c16c50e6cf3334c4b894\n3a714063188b24f0392c163d7910be00216a5f04\na72b548ca570d8c74ed4c465716c4e37328f9bc1\nf35bddfbb82ae1b137cbd454bc18f2b859cc5882\nc5b34662f22f35f3995144b24015309bbe318cd9\n7da20852d79f7443b88449e8ed18e092c2aaa3bb\n699da2b8d35f344121d93a74adf89349d3c8d922\n11e4f795551e6db0fe9a9c52eec35f134b089478\n7312b319b84be6bde845b10ea61619c33473f784\n5aae6e00b3ab0b32a8c75a2952674d7665b3f705\n6b987ffc3fd6a2bcfb931426be4118cd943737da\nc64c21d2e08cb8a28e31c4d883a1e75fd1c7851b\n\n```\n\n-----\n\n```\n0e73071ceb9d2481361777b33b8443ec0acb0793\nebd417f4ab9e7bb6deaacab9de1611df67908317\n8e4dff96e1740764d60fbff8cfae8c673f1a7a3f\n828fb69b80e60de6f6206fd63b496cc0923082f4\n11ee7a59ecd287628ff251b435777f6d4429e40c\n05b7e1864b7b570a339c8072830cdd9bcbf21d1a\neb3a1808bd24026314bec69caadbc882f1976982\ncc9afb9efea37aee31cd74fb064de4b732fb84b3\nc8d230830d0912236c48c31ad11b93707088ce9f\n0cc8e03a08baa73379ac6c55cbb18fa78b87923d\n4f0ba59e2ee80ff854bca33944f825d4c8cfe23e\n163d9ce53deadd54ad50d7d0120b5db550724689\n33d79b8ee94f7bd0a542863cd5a8926d8e0263d9\n048a93a696f1bf0bdf6f6e3506d65d21a4a9f681\nd4d1c97c5803162e452c79811d61e1487c9cfe62\n9e387d79fd6412715a5a4bca02b7e27a08299c4b\ndfcf0b6af4593f32060176768164702f45cb556b\ne857a9c520402ccc6abe3244c1e93ac9e2a6ac3d\ne857a9c520402ccc6abe3244c1e93ac9e2a6ac3d\n5eb0e95aa6cc68ec05103561b02d38d4f69e4980\nc222fe1be761f05c665c40c14781e40f97460569\nc3d062bc3fa3b4ecfc68e69a7dc26d9e0ac56538\n901a08aa9996fa95e4a844c24eb7b81da0b52923\n9e04ca30e6ae20e8d2bbf2772a93145bd4b5b8c6\n90835a1173e9ed414e8240d0e14acb13f73f642f\nbe30f974111ad50312f654db9e040c6ab99d054c\n\n```\n\n-----\n\n```\nb48927641b53e363d7183fe7faaaa7be8b01cec9\nPKGs\ncedd8f8ae61dc47130c34b39d9795083cc90ac1f\nBash Scripts\nfbdf0af70f95d3c87cf8bcacc2d6673d9ccd4620\n8701f8b0aeb2c66298eb1b4297d98664f8c1f1b9\n5b304a1da9f56e8ffdfb68940fdd0bc2887d2eb9\necffd9553c67478a55f7303f6cadf356101f9216\n80f2682d60303ea9098444a35cb35e697ae18187\n638ef84a29c747419027c306833d6420d351b244\n\n```\nJamf\nThreat Labs\nJamf\n\nJamf Threat Labs is comprised of experienced threat researchers, cybersecurity experts and\ndata scientists, with skills that span penetration testing, network monitoring, malware\nresearch and app risk assessment primarily focused on Apple and mobile ecosystems.\n\nSubscribe to the Jamf Blog\nHave market trends, Apple updates and Jamf news delivered directly to your inbox.\n\nTo learn more about how we collect, use, disclose, transfer, and store your information,\n[please visit our Privacy Policy.](https://www.jamf.com/privacy-policy/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-23 - Evasive cryptojacking malware targeting macOS found lurking in pirated applications.pdf"
    ],
    "report_names": [
        "2023-02-23 - Evasive cryptojacking malware targeting macOS found lurking in pirated applications.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1677809205,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1677663437,
    "ts_modification_date": 1677663437,
    "files": {
        "pdf": "https://archive.orkl.eu/49f67c344146acc6e6a79da5dee395c5b7398fc9.pdf",
        "text": "https://archive.orkl.eu/49f67c344146acc6e6a79da5dee395c5b7398fc9.txt",
        "img": "https://archive.orkl.eu/49f67c344146acc6e6a79da5dee395c5b7398fc9.jpg"
    }
}