{
    "id": "bd590156-4f7e-4f18-8264-cd0ac1113bd4",
    "created_at": "2022-10-25T16:48:17.989085Z",
    "updated_at": "2025-03-27T02:17:01.03644Z",
    "deleted_at": null,
    "sha1_hash": "423f5a4c910cbb9c0c31136fa8ffbbf9dcafd0e2",
    "title": "12271_Blackberry_ContellatingBooklet_FULL_ModifiedLinks.indd",
    "authors": "",
    "file_creation_date": "2021-11-15T16:14:28Z",
    "file_modification_date": "2021-11-15T16:14:37Z",
    "file_size": 14266502,
    "plain_text": "# FINDING  BEACONS IN THE\n\n##### A Guide to  Cyber Threat Intelligence\n\n# DARK\n\n\n-----\n\n_To Sam, the little fighter, and Noah, the unsung hero._\n_Your strength, courage, and silliness inspires us all._\n\n\n-----\n\n## About the Authors\n\n**T.J. O’Leary – Principal Threat Researcher**\n\nT.J. is a Principal Threat Researcher with the Threat Hunting & Intelligence team at BlackBerry. He holds\nan MSc in Forensic Computing and Cybercrime Investigation and a BEng in Electronic Engineering. He\nbegan his career in the military and has a background in system administration, networking, security operations, malware analysis, and reverse engineering. In his spare time, he enjoys watching motorsport,\ntraining martial arts and spending time with his wife and kids.\n\n**Tom Bonner – Distinguished Threat Researcher**\n\nTom has over two decades of experience in the cybersecurity/anti-malware industry. From reverse engineering malware and developing detection technologies, to incident response, DFIR and threat intelligence, he enjoys tackling complex R&D problems across the cybersecurity landscape. Tom resides in\nthe English countryside with his wife and two children.\n\n**Marta Janus – Distinguished Threat Researcher**\n\nMarta is a reverse engineering expert and enthusiast with more than 12 years of experience in cybersecurity, currently focused on tracking high profile threat actors and campaigns. Besides hunting for\nsophisticated malware and dissecting it, Marta enjoys hiking, philosophy, and holds a master’s degree\nin archaeology.\n\n**Dean Given – Senior Threat Researcher**\n\nDean is a Senior Threat Researcher within the Threat Hunting & Intelligence team at BlackBerry. He\nholds a MSc in Cybersecurity and a BSc (Hons) in Computer Security & Digital Forensics. He has 7+\nyears of experience across various roles in cybersecurity and has a background in Security Operations,\nNetwork Security, Malware Analysis and Reverse Engineering. In his spare time, he enjoys watching\nsports, golfing, and is an avid movie fan.\n\n**Eoin Wickens - Threat Researcher**\n\nEoin holds a BSc (Hons) in Computer Systems from Cork Institute of Technology, graduating with\nmultiple academic awards including the IBM Prize. He finds both enjoyment and purpose in reverse\nengineering malware, software engineering for analysis automation and anything to do with triathlon.\nEoin’s work specializes in Threat Hunting & Intelligence, helping to stay one step ahead of the bad guys\nthrough a variety of creative and effective means.\n\n**Jim Simpson – Director of Threat Intelligence**\n\nJim is the Director of Threat Intelligence at BlackBerry. He has over 15 years of experience working the\nfull gamut of security roles before joining Cylance and then BlackBerry, doing what he can to help his\nteam do what they do best, and snowboarding whenever he gets the chance.\n\n\n-----\n\n## About the Editors\n\n**Natasha Rohner – Senior Managing Editor**\n\nNatasha spent six years at the helm of ThreatVector, BlackBerry’s award-winning cybersecurity blog,\nworking closely with the Research & Intelligence team to produce threat research deep-dives and white\npapers. An avid science fiction fan, she has also published eight novels for large media companies such\nas Rebellion and New Line Cinema, including the official book adaptations of Hollywood movie blockbusters such as Blade, Final Destination, and Nightmare on Elm Street. Her original horror trilogy Dante’s\n_Girl was published by Solaris, a division of UK gaming giant Games Workshop._\n\n**Lysa Myers – Principal Threat Researcher**\n\nLysa began her cybersecurity career in a malware research lab in the weeks before the Melissa virus\noutbreak in 1999. As the industry has evolved, she’s moved from threat research to security education.\nAs part of the BlackBerry Research & Intelligence Team, she uses her unique perspective to help make\nthreat research more accessible. She and her spouse live on a hobby farm in the Pacific Northwest, with\nan assortment of miniature farm animals.\n\n**Steve Kovsky – Editorial Director**\n\nSteve Kovsky is responsible for BlackBerry’s global corporate communications content strategy, including thought leadership publications, blogs, social media and customer advocacy. He spent more\nthan 20 years as a professional journalist, covering all aspects of information technology in print, radio,\ntelevision and online. In 2013, he went over to “The Dark Side” (aka marketing) as head of content for\nWebsense/ForcePoint, then Director of Digital Content and Executive Communications for CrowdStrike.\n\n## About the Reviewers\n\n**Mark Stevens – Technical Director, Incident Response**\n\nMark has over two decades of industry experience with the last 13 dedicated to cybersecurity. He started his security career at JP Morgan Chase and has worked for several industry leaders including Mandiant and IBM. Mark now leads the BlackBerry international incident response (IR) team.\n\n**Seagen Levites – Senior Director, Data Architecture**\n\nSeagen has been working in cybersecurity from the time Y2K was considered a threat. He operated in\nthe endpoint and endpoint management space before moving to research, automated malware analysis, and then joining Cylance as employee #20.\n\n**David Beveridge – Vice President of Research Engineering**\n\nDavid Beveridge began his career in software development 23 years ago, and he switched to a cybersecurity focus in 2004. Armed with the audacious idea that handsets would soon begin to replace\ncomputers, he started down the road of Artificial Intelligence development in the InfoSec world, which\neventually led him to join Cylance and then BlackBerry. He holds 13 patents in Computer Science, including 11 in the field of AI.\n\n\n-----\n\n## Contents\n\n**Foreword** **8**\n\n**Introduction** **11**\n\n**So, You Want to Gather Cyber Threat Intelligence?** **13**\nWhat will you find in this book? 13\nWho is this book for? 13\nHow can you benefit? 14\nWhy are we writing about it now? 14\nHow is this book organized? 15\nChapter 1 – Beyond the Hype 16\nChapter 2 – All Your Beacons Are Belong to Us 16\nChapter 3 – We are Beacon 16\nChapter 4 – We Can’t Stop Here, this is Beacon Country 16\nChapter 5 – Beacon of Hope 16\nChapter 6 – Debrief 16\nDisclaimer 16\n\n**1. Beyond the Hype** **17**\nCyber Threat Intelligence 17\nOur CTI lifecycle for an XDR world 18\nPlanning & Direction 19\nCollection 20\nProcessing 21\nAnalysis 22\nDissemination 22\nEvaluation and Feedback 23\nAligning the Stars: The CTI Lifecycle 23\n\n**2. All Your Beacons Are Belong to Us** **25**\nData Collection 25\nDefining the Scope 25\nCrafting Some Queries 26\nData Validation 32\nPillaging Team Servers 33\nProcessing 34\nBeacon Config Extraction 35\nAutomating the Hunt for Cobalt Strike 39\n\n**3. We are Beacon** **40**\nStager vs. Stageless 40\nMalleable C2 41\nMalleable PE 44\nExample Extracted Beacon Configuration 47\nDetecting the Beacon Configuration with YARA 53\n\n**4. We Can’t Stop Here, this is Beacon Country** **54**\nConstellating 54\nNetworking 55\nNetblocks 56\n\n\n-----\n\nPorts 58\nCertificates 59\nConfiguration 61\nWatermark 64\nSSL Public Keys 65\nBeacon Type 67\nC2SERVER 68\nHTTP 70\nProxy 72\nSMB 73\nDNS 75\nInjection 76\nCompilation Timestamps 79\nRich headers 82\nImport hashes 83\nExport Names 85\nPROCINJ_STUB 86\nDEPRECATED_SPAWNTO 89\nMiscellaneous 91\n\n**5. Beacon of Hope** **92**\nIntelligence Correlation 92\nAPT41 94\nAPT41 Continued - Gh0st in the Machine 96\nAPAC Red Teams 98\nDarkSide 100\nFIN7 102\nWizardSpider 103\nRyuk 103\nBazarLoader 104\nTrickBot 106\nConti 108\nMAN1 110\nUrsnif - Saigon Fork 111\nTA505 113\nIcedID 112\nSalfram Phishing Campaign 113\nTA505 113\nTA575 114\nAn Initial Access Broker - Zebra2104 116\nEnter MountLocker 117\nEnter StrongPity 118\nEnter Phobos 120\nHidden Dragon 121\nRecap 122\n\n**6. Debrief** **123**\nPlanning & Direction 123\nCollection 123\nProcessing 124\nAnalysis 124\nInsights 124\nTrends 125\nDiscoveries 125\n\n\n-----\n\nDissemination 125\nThreat Intelligence 125\nThreat Hunting 126\nIncident Response 127\nForensics 127\nData Science 127\nSOC 128\nRed Team 128\nEvaluation and Feedback 130\nBeyond the Hype and Back Again 131\n\n\n-----\n\n## Foreword\n\nThere are probably hundreds of thousands of unique malware types. Analysts around the world have\ndifferent vernacular and may call malware different things depending on its role, type, or variety. Viewed\nabstractly, many pro's like to refer to each unique strain of malware as an ecosystem, framework, or\nfamily of related code.\n\nEvery type of malware ecosystem, malware framework, or malware code family could have many interdependent parts. But each family is really its own genetic species, with its own DNA that tells it how to\nact, how to communicate, and how to do malicious things at the behest of an adversary. Each malware\nspecies has a population ranging from the single digits to the millions. Some species or families of\nmalware are designed to co-exist and cooperate in symbiosis with others.\n\nThe genetic analogy of malware falls apart when you consider that they do not form on their own in the\nwild, but are designed, written, programmed and (mostly) operated by humans. But we are still left to\nwonder, what causes turnover in malware? What is the average lifespan of a malware species? What\ncauses malware to rise and fall in popularity or efficacy? Why do some malware ecosystems fail in\nmonths, and why do others live long, healthy lives? And more interestingly, what selective pressures\nforce a malware family to evolve, or to go extinct?\n\nWhen I joined Mandiant in 2013, the threats that we faced at the time were no different from today,\nexcept for the names. We worked interactive intrusion activity all night, every night, and the intelligence\nteam – like biologists, classifying and identifying new species in the field – could not give names to new\nmalware families fast enough.\n\nEarly in an intrusion operation, attacks often employ simple droppers, downloaders and reverse shells.\nThese early-stage malware families are light and fast, often with trivial persistence and simple communications methods, and they require minimal development time from a malware author.\n\nEarly-stage malware typically has a half-life of less than six months and is easy to abandon and replace\nif it gets “burned” or detected. Simply put, these were cheap, throwaway code families that did not\nsurvive long in the wild. They came and went quickly and many did not even last long enough to merit\na name.\n\nBut after initial access, our adversaries often deployed late-stage malware frameworks. Once the adversary had a seemingly undetected foothold, they would switch out early malware for deeper malware frameworks referred to interchangeably as “post-exploitation tooling,” “command-and-control (C2)\nframeworks,” or simply “late-stage” malware “backdoors.”\n\nLate-stage malware frameworks often use stealthy C2 schemas and network protocols. They often\nhave a “core implant” with a modular plugin architecture and novel persistence mechanisms, and they\nare designed to provide comprehensive command-line access to remote operators. Late-stage malware ecosystems require huge development investments and are expected to provide years of utility.\nAn example of an early-stage malware family may be a simple HTTP downloader that uses a common\nWindows\\CurrentVersion\\Run registry key for persistence. An example of a late-stage malware could\nbe something like Cobalt Strike’s immensely versatile Beacon payload.\n\nEarly-stage malware gets replaced wholesale when it gets burned, whereas late-stage malware can last\nfor decades with tweaks, forks, improvements, and plugins. Late-stage malware has a longer lifespan\n\n\n-----\n\nbecause attackers want to protect their development investments. To get extra life out of core implants\n(such as TrickBot or SHADOWPAD/POISONPLUG), malware developers must introduce new plugins,\nnew functionality, and new obfuscations. And they must create increasingly elaborate packaging and\nmulti-layered delivery schemes to evade detection and subvert meaningful analysis.\n\nYou are likely familiar with some of the titans of late-stage malware, from the days of yore. For example,\nPoison Ivy and PlugX, which may have been in use as far back as 2005. Or Gh0st RAT, which goes as far\nback as 2008. And HiKit, which goes back to at least 2011, maybe earlier.\n\nPoison Ivy and Gh0st dominated nearly a decade of intrusion operations, and they were for the most\npart stomped out by public research and tooling to help improve global detection. These families survive in a miniscule footprint today, but evolutionary pressure pushed these species close to extinction.\n\nHiKit and PlugX were detected, and while they were not snuffed out, they were both forced to evolve.\nOver the years we have seen several modernizations, tweaks, forks, and derivatives. In the face of evolutionary pressure, malware developers are working to get extra mileage out of their investments. Source\ncode from both of these families have been used to create new malware frameworks altogether. These\nfamilies aren’t dead yet, but I think the continued development effort shows that we have levied some\ncost on the adversaries who wish to continue using these toolkits.\n\nWhile watching the ascent and decline of Pirpi, CozyCar, Xagent, Zxshell, Derusbi, and countless other beloved malware families, I’ve learned that it takes years of community effort, intelligence sharing,\nopen-source tooling, and public detection research to apply pressure on the dominant late-stage malware frameworks. Versatile late-stage, post-exploitation malware ecosystems become even more complicated because we need to study not only the malware itself, but also how the malware is configured,\ndeployed and operated by a variety of threat actors in a multitude of campaigns over a long period of\ntime. Rather than just deep analysis of single samples, we must approach doing bulk analysis of tens of\nthousands of files at a time, all within the context of thousands of intrusion operations. That’s no small\nfeat, especially when it comes to the topic du jour, Cobalt Strike.\n\nCobalt Strike is a post-exploitation framework that was developed to emulate the greatest features of\nlate-stage malware ecosystems and allow its users to simulate adversary actions. The adoption of Cobalt Strike by global threat actors, and the framework’s use in hundreds of genuine intrusions, ransoms,\nand data breaches, shows that Beacon has fought its way to the top. It currently sits on the throne as\nthe reigning champ of all malware toolkits. If it works, it wins.\n\nWhile Poison Ivy and Gh0st have gone out to pasture, Cobalt Strike and its core implant Beacon have\nstepped into the limelight. This forces analysts and researchers around the world to renew their approaches to collecting, processing and sharing information about Cobalt Strike and its use in bulk.\n\nCan you detect Cobalt Strike payloads before they execute? Or only after they execute? Can you detect\nthe network C2 traffic? And when you see Cobalt Strike detections, can you differentiate between a red\nteam engagement and a bona fide intrusion?\n\nMore proactively, can you develop intelligence on a Cobalt Strike wave before the first phishing email\nis sent your way? Can you identify a C2 server before the adversary builds their first payload? Can you\nextract additional intelligence directly from adversary-controlled infrastructure? These are questions\nthat each organization must ask itself, and the team at BlackBerry are offering different ways to say yes.\n\n“Finding Beacons in the Dark” is a labor of love by practitioners for practitioners. What began as a\nproject to detect Cobalt Strike exploded into a full-blown automation platform for broad collection, processing, and data harvesting from Cobalt Strike team servers with corresponding Beacon payloads and\ntheir configuration details.\n\n\n-----\n\nThrough creating this system and analyzing the data en masse, the BlackBerry Research & Intelligence\nTeam observed trends and developed a holistic picture of Cobalt Strike across many phases of the\nthreat intelligence lifecycle. From static payload analysis to configs to server fingerprints to unique\ntoolmarks, the authors of this book provide a practical and detailed look at the Cobalt Strike framework\nitself and then dive into examples that will help you understand how it gets used in the wild. There are\nsome handy detection rules and scripts, as well.\n\nThere’s more than meets the eye in these pages, and through the lens of Cobalt Strike you may gain a\nbetter understanding of how threat actors tend to design, configure and operate malware of all types.\n(Spoiler alert: ports 80, 443 and 8080 are malware config favorites for good reason -- they are almost\nalways “open” on network gear!)\n\nIf you’re like me, you’ll probably have fun spelunking through the details and operationalizing what you\nlearn. I hope that this inspires you to become a part of the evolutionary pressure, and more broadly, I\nhope that this work serves as a model for how to build and share bulk intelligence analysis about prolific\nmalware families.\n\nSteve Miller (@stvemillertime)\nResearcher, Stairwell, Inc.\nIthaca, New York\nOctober 1, 2021\n\n##### about steve miller\n\nSteve Miller is a researcher of adversary tradecraft, obsessed with finding human fingerprints in digital\nartifacts. Rather than the “Who, What, or Why” of a breach, he focuses on the “How” – the TTPs or modi\noperandi of threat actors. Steve loves to operate at the intersection of incident response, threat intelligence, and detection engineering. When he is not finding evil, smashing malware, or writing creative detection rules, he can probably be heard making loud noises with modular synthesizers, drum machines\nand other music gear in his underground beat laboratory. Steve is an alumnus analyst of Champlain\nCollege, Mandiant, the U.S. Department of Homeland Security, U.S. Department of State, U.S. Army Intelligence and Security Command (INSCOM), and the National Security Agency. He joined cybersecurity\ncompany Stairwell, Inc. in August 2021.\n\n\n-----\n\n## INTRODUCTION\n\nCobalt Strike provides adversary simulation and threat emulation software that is widely used by red teams\nand heavily abused by malicious threat actors. It has become a highly prevalent threat, employed by a vast\nnumber of Advanced Persistent Threat (APT) and cybercrime groups across the globe.\n\nIt is easy to see why this is the case, as it is fully featured and well-documented. From reconnaissance\nand spear-phishing to post-exploitation and covert communications, Cobalt Strike is feature-rich, well\nsupported, and actively maintained by its developers. Beacon, Cobalt Strike’s primary payload, provides a\nwealth of features for attackers, which facilitate:\n\n      - Reverse shells and remote command execution\n\n      - Keylogging and screenshots\n\n      - Data exfiltration\n\n      - SOCKS proxying\n\n      - Pivoting\n\n      - Privilege elevation\n\n      - Credential and hash harvesting\n\n      - Port scanning and network enumeration\n\nFor a lot of legitimate as well as criminal organizations, leveraging Cobalt Strike can be cheaper and faster\nthan developing their own tooling. At the time of writing, licensing starts at $3,500 per license per year. If you\nare an unscrupulous bad actor who is using a cracked or leaked copy, the cost goes down to literally nothing.\n\nFrom a threat intelligence or law enforcement perspective, Cobalt Strike’s widespread use can often make\nthe task of attribution more challenging, and the current upward trend in utilization is not showing any\nsign of decline.\n\nProofpoint researchers recently reported a 161% year-over-year uptick in the use of Cobalt Strike by\ncybercriminals. It has become a perennial problem for security practitioners, requiring robust solutions\nthat can aid in providing both defensive capabilities and enhanced threat intelligence.\n\n\n**Threat Post**\n_Cobalt Strike Usage Explodes Among Cybercrooks_\nhttps://threatpost.com/cobalt-strike-cybercrooks/167368/\n\n**Proofpoint**\n_Cobalt Strike: Favorite Tool from APT to Crimeware_\nhttps://www.proofpoint.com/us/blog/threat-insight/cobalt-strike-favorite-tool-apt-crimeware\n\n\nOn the defensive side of things, the best thing we can do to tackle the challenge of combating the rogue\nuse of Cobalt Strike is to have solid processes in place. These processes need to be not only well thought\nout, but also driven by data.\n\n\n-----\n\n##### the role of cyber threat intelligence in xdr\n\nWe have defi ned a robust Cyber Threat Intelligence (CTI) lifecycle that considers stakeholders for all products and services across the extended detection and response (XDR) solution space. Over the course of\nthis book, we’ll guide you through our lifecycle and use Cobalt Strike as a practical hands-on case study.\n\nYou may ask, what is XDR? XDR is a fairly new term and one that a lot of folks are not yet familiar with. This\nis how IT consulting fi rm Gartner has defi ned it:\n\n_“XDR is a SaaS-based, vendor-specifi c, security threat detection and incident response tool that natively_\n_integrates multiple security products into a cohesive security operations system that unifi es all licensed_\n_components.” - Gartner_\n\nAt its core, XDR is a data ingestion and enrichment strategy. This means that it ingests telemetry from\ncybersecurity products and services, as well as insights from threat intelligence teams and information\nfrom third-party sources. This data is then stored in a data lake, which is essentially a storage solution\nfor raw data on any scale. The ingested data is then further processed to create additional context, which\nthen drives intelligence-based threat-detection and correlation of incidents and alerts for all XDR products\nand services.\n\n_Figure 1 – Topological view of XDR_\n\nSo why does XDR matter in the context of this book? Well, the automated ingestion and correlation of\nintelligence data helps to decrease the burden of “alert fatigue” for Security Operations Center (SOC)\nanalysts and incident responders. By providing more contextual information concerning incidents and\nalerts, incident responders are better informed to react swiftly and decisively. In addition, the data can\nbe used for the automation of Incident Response (IR) Playbooks, to help orchestrate workfl ows and\nprocesses during incidents.\n\nHow then, do you produce, correlate, and consume CTI to empower XDR-enabled solutions and services?\n\nAs prevention is always better than a cure, the ultimate solution needs to be more proactive than reactive. The hunted must become the hunter, and for this pursuit, Cobalt Strike Team Servers, our quarry.\n\n\n-----\n\n#### SO, YOU WANT TO GATHER CYBER THREAT INTELLIGENCE?\n\n##### what will you find in this book?\n\nIn this book, the BlackBerry Research & Intelligence Team presents a system for hunting the Internet\nfor instances of Cobalt Strike Team Server, which is the C2 server for one of the most pervasive threats\ndeployed by modern threat groups: Cobalt Strike Beacon.\n\nIn addition, we present our Cyber Threat Intelligence (CTI) lifecycle, which outlines our multi-phase\napproach to building intelligence-led protection for products and services underpinning most XDR products and services. The lifecycle outlines the following phases:\n\n      - Project planning and direction\n\n      - Data collection, processing, analysis, and dissemination\n\n      - Continuous improvements via evaluation and feedback\n\nBy following our CTI lifecycle to hunt for Team Servers, and extracting configurations from the Beacon\npayloads they serve, we aim to demonstrate how you can leverage the resulting dataset to provide powerful intelligence insights. These insights can help to reveal clusters of servers associated with known\nthreat groups and campaigns, as well as links between them that were previously unseen, empowering\nyou to expose correlations between seemingly disparate network infrastructure.\n\nFinally, the resulting intelligence can also be leveraged to provide actionable Indicators of Compromise\n(IOCs) to all XDR stakeholders, including defenders, hunters, analysts, and investigators alike. These\nwill help you to:\n\n      - Defend your organization\n\n      - Produce in-depth CTI reports\n\n      - Better understand the threat landscape\n\n      - Give better advice to your C-level executives and security teams so that they can make well\ninformed security-oriented decisions\n\n##### who is this book for?\n\nThis book is for anyone with an interest in gathering Cyber Threat Intelligence, those who want to further\ntheir understanding of Cobalt Strike, or those who simply enjoy a good technical read.\n\nThat said, the people who might derive the most reward from this book may include:\n\n    - Threat Intelligence Analysts\n\n   - Threat Hunters\n\n      - Incident Responders\n\n      - Forensic Investigators\n\n      - SOC Analysts\n\n      - Red Teamers\n\n##### how can you benefit?\n\nBy defining a CTI lifecycle, we present a blueprint to help you with creating one that fits your own needs.\nIt can also be used to help build your own automation platform for harvesting and disseminating cyber\nthreat intelligence.\n\n\n-----\n\nWalking you through our lifecycle, we begin the collection phase by hunting for active Cobalt Strike\nTeam Servers. Once the true cyber adversaries’ Team Server instances are identifi ed, it gives us a\nunique opportunity to reveal trends and patterns within the data. These insights can help to perform a\nvariety of useful things, such as:\n\n      - Building profi les of threat actors\n\n      - Broadening knowledge of existing threat groups\n\n    - Tracking both ongoing and new threat actor campaigns\n\n      - Providing actionable intelligence to SOC analysts and IR teams\n\n      - Fine tuning security products and services under the XDR umbrella\n\nWhile we use the example of Cobalt Strike in this book, we hope this exercise sparks your imagination\nand inspires you to use this for other threat intelligence quests. This industry thrives because it is populated by so many individuals who are passionate about the sharing of information, including tools, tips\nand techniques. By adding our contribution, we hope to keep this altruistic tradition alive.\n\nAll these things aside, we hope that in reading this book you may learn a thing or two, have a laugh along\nway, or even gain insight into our processes for the purposes of competitive intelligence!\n\n##### why are we writing about it now?\n\nThe unfortunate reality is that the rate of cyber intrusions has grown exponentially in recent years, with\nhigh-profi le ransomware attacks becoming a staple feature of the daily news cycle. The ease with\nwhich threat actors can arm themselves with advanced adversarial tooling means that what was once\nquite a complex affair is now nearly effortless. In some cases, it is as simple as copying and pasting\na few commands and pressing a few buttons, as we saw with the leaked Conti ransomware playbook.\n\n_Figure 2 – Truncated list of Conti ransomware playbook fi les – Translated_\n\n\n-----\n\n**BleepingComputer**\n_Translated Conti ransomware playbook gives insight into attacks_\nhttps://www.bleepingcomputer.com/news/security/translated-conti-ransomware-playbook-givesinsight-into-attacks/\n\n\nWhile not the only culprit, Cobalt Strike Beacon has been the common denominator in these attacks\ntime and again. Lesser-financed and lesser-resourced groups – as well as those just looking to blend in\nwith the crowd – need look no further than cracked, leaked or trial versions of Cobalt Strike. The low barrier to entry this provides, with the ease of propagation through botnets and other distribution services,\nhas acted as a catalyst for the ransomware epidemic and expedited its rate of growth.\n\nTo improve our own intelligence-led protection and correlation of malicious instances of these components, BlackBerry created an automated system to scan for Cobalt Strike Team Servers. It downloads\nBeacons then extracts and stores their configurations for further processing, analysis, and dissemination.\n\nThe aim of this book is to aid the security community by sharing this knowledge, presenting the steps\nwe’ve taken to create this automated system, and most importantly, demonstrating how to derive\nmeaningful threat intelligence from the resulting dataset. This information can then be used to provide\ninsights, trends and intelligence on threat groups and campaigns.\n\n##### how is this book organized?\n\nThis book is organized into six chapters. It begins with an introduction to our CTI lifecycle, where we outline our processes and methodologies. Next, we’ll delve into the specifics of how to develop a system\nto perform automated hunting of Cobalt Strike Team Servers, which can yield useful and meaningful\nintelligence data.\n\nWe will then introduce Cobalt Strike Beacon and its configuration profiles, as well as a full table of\nconfiguration options and common values for quick reference. We will use the resulting knowledge and\ndataset to dig deeper into insights and identify trends, uncovering some unexpected revelations along\nthe way.\n\nFinally, we will enrich our dataset with open-source intelligence (OSINT) using our Threat Intelligence\nPlatform (TIP), and look to uncover new correlations and groupings, before circling back to reassess our\nCTI objectives and findings in a debrief.\n\n\n-----\n\n##### chapter 1 – beyond the hype\nIn the first chapter, we’ll outline our CTI lifecycle. We’ll outline how the lifecycle is leveraged throughout\nthe following chapters to achieve our intelligence objective, which is an automated hunting system for\nCobalt Strike.\n\n##### chapter 2 – all your beacons are belong to us\nThe second chapter focuses on the hunt for Cobalt Strike Team Servers. It guides the reader through\ndeveloping an automation system to support the collection and processing phases of the CTI lifecycle.\n\n##### chapter 3 – we are beacon\nThe third chapter aims to acquaint the reader with Cobalt Strike Beacon configurations, including Malleable C2 profiles and Portable Executable (PE) stager modifications.\nHere we’ll be introducing the various configuration values that we will be exploring further to produce\ninsights and trends in the following chapter. We also present a handy reference table containing all\npossible settings along with common values.\n\n##### chapter 4 – we can’t stop here, this is beacon country\nIn the fourth chapter, we perform the analysis phase of the CTI lifecycle. We’ll share insights, trends and\ndiscoveries that can be used to augment XDR products and services.\n\n##### chapter 5 – beacon of hope\nChapter five focuses on how correlating data with OSINT can enhance CTI. Here we reveal how the\ninsights we’ve uncovered can be used to correlate intelligence with relative ease, and how you can begin\nto track Team Server deployments to broaden your awareness of threat actors and campaigns.\n\n##### chapter 6 – debrief\nIn the final chapter, we will recap our CTI lifecycle and review each phase as it pertains to building a system for hunting Cobalt Strike. We’ll also explore the intelligence insights uncovered along our journey.\n\n##### disclaimer\n\nIt is worth mentioning that no Team Servers were harmed in the making of this book! All findings throughout\nthe book originate from Beacon analysis. We have not installed, remotely or locally operated, reverse\nengineered nor debugged Team Server to arrive at any of our findings or conclusions.\n\n\n-----\n\n### chapter one\n\n## BEYOND THE HYPE\n\n##### cyber threat intelligence\n\nThe most visible aspects that many people associate with CTI are the cool names and awesome logos\ngiven to vulnerabilities and threat actors such as HeartBleed, Shellshock, OceanLotus, and even Squirrel\nWaffle. More than that, CTI is a discipline, albeit one in its infancy. And as such, it needs a little formalizing.\n\nRecent advances in cybersecurity technology, such as XDR, certainly necessitate the need for more formal\nand mature processes. CTI is now widely used to underpin XDR solutions. This means that intelligence\ninsights are leveraged to enhance protection and correlation, leading to an increased efficacy for security\nproducts and a reduction in alert fatigue for SOCs. We call this intelligence-led protection and correlation.\n\nThe current CTI landscape draws from multiple sources, including the military, intelligence agencies, universities, and the private sector, to name a few. All these influences have offered significant improvements\nto what was once simply termed “threat research”, and have helped to evolve CTI processes, workflows,\nand paradigms in a short period of time. The speed of development in this area inevitably leads to some\nconfusion and a lack of consensus on the right way to approach CTI creation.\n\nWe’d love to say we have the silver-bullet solution for how to do it properly. In reality, this book aims to\nhighlight some of the common phases and most critical areas so that we are all on the same page (no\npun intended). When you get hooked on CTI and want to improve your organization’s program, there are\nnumerous resources, such as books, papers, talks, blogs, and training programs that can help you.\n\nUnderstanding CTI as a lifecycle – where people, processes, and technology work in harmony – will lead\nto the production of intelligence that can be used to assess risk, identify threats, and make informed decisions. And if you insist, you can even give that intelligence product a cool name and a supervillain-esque\npersonification.\n\nNow that we’ve introduced the concept of CTI, almost everyone will have a different interpretation of what\nthat means. To avoid any misunderstandings, here is our working definition of CTI that will help you to\nunderstand what we are all trying to achieve...\n\n_“Cyber Threat Intelligence collects information to answer specific questions (such as who, what, where,_\n_when, how, or why) about a person or thing that is likely to cause damage or danger to computers or_\n_networked systems.”_\n\nThat’s kind of wordy, so feel free to take the sentiment and create your own definition for your organization.\nIt’s important to have a well-understood definition that works for you.\n\nHaving both your team and management coalesce around a well-formed idea is hugely beneficial. It keeps\neveryone focused on achieving their goals, while management is clear on the outcomes the team will deliver.\n\nHaving defined our deliverables, let’s put some thought into how to do it. While there is a great deal of creative\nthinking involved in CTI, it should not be the sole requirement of the team. Without a defined framework,\ncreative thinking can spark inspiration, but it will have no way of following through on its promise.\n\n\n-----\n\nBy agreeing on a framework, and then developing the people, processes, and tooling to support its execution,\nteam members will be able to understand their responsibilities on a tactical and strategic level. The ideal\nsituation is to have well-trained people follow a repeatable process that is supported by the appropriate\ntooling, which aligns with a scientifi c methodology. If you achieve this, it will enhance (rather than rely on)\nthe intuition of individuals.\n\n##### our cti lifecycle for an xdr world\n\nThere are many versions of the CTI lifecycle. The one we choose to use is adapted from multiple lifecycles\nand allows us to build repeatable, iterative processes to support the production of intelligence that works\nfor all stakeholders in our organization.\n\nThis section is not meant to be the defi nitive CTI lifecycle. We hope that it will spawn ideas that you can\nassess for your own organization and help inform the lifecycle you choose to follow. It also serves as\nscaffolding for further information laid out in this book.\n\nEach of the processes, scripts and analyses discussed in this book can be tied back to a distinct phase\nof the lifecycle. Thinking of it in this way can provide order to what might seem to be chaos. (If not chaos,\nthen maybe Thanos, - chaos’ older, more-chaotic sibling.)\n\nThe lifecycle we describe in this section isn’t prescriptive in terms of the processes or technology required.\nThat’s all up to you to decide. The framework we’re providing allows you to decide the appropriate people,\nprocesses and technology that work best, to accomplish the goals of each phase.\n\nLikewise, there is no set number of processes to include in each of the phases. It all depends on what is\nneeded to achieve your intelligence requirements.\n\n_Figure 3 – Our CTI lifecycle_\n\nSpeaking of intelligence requirements, this leads us nicely onto the fi rst (seemingly most mundane, certainly\nmost overlooked, and yet critically important) phase.\n\n\n-----\n\n##### planning & direction\n\nDuring the planning and direction phase of the CTI lifecycle, we like to set up two key components:\n\n    - The question (or questions) to be answered\n\n    - The audience who requires the answer(s)\n\nThat sounds easy, right?\n\nThat’s why this phase is often overlooked or poorly thought through. But the results of paying mere lip\nservice to planning and direction will haunt you.\n\nGetting this phase right will lead to greater efficiency and focus for your team, as well as a better intelligence\nproduct for your audience. This is the best chance to rid yourselves of ambiguity and assumptions about\nwhat you are trying to achieve.\n\nThinking back to the description of CTI, the statement, “collects information to answer specific questions”\nstands out. The planning and direction phase is where you define the question you are going to answer\nthroughout the rest of the lifecycle. Everything you do should be focused on answering the question\ndefined in this phase.\n\nWhile we are talking about questions; not all questions are created equal when it comes to intelligence\nrequests. Questions that are generally narrow in scope and those which form a closed loop work better.\nThey help us by creating tailored knowledge to support specific decisions the individual or group is looking\nto make.\n\nUnderstanding the difference between broad and closed-loop questions can be a little tricky, so let’s look\nat some example questions:\n\n_What is the biggest cyber threat today?_\n\nThis question is too broad. Simply put, there are too many different ways to answer it. People can reasonably\nhave different interpretations of what is required. For example: How do you define “cyber threat?” How do\nyou define “biggest?” Who is the target that you’re most concerned with? As there is no focus around what\nis required, the resulting product will not be useful in supporting any meaningful decision. This might feel\nsatisfying to explore, but for practical purposes, it will be wasted effort.\n\nA more closed-loop example might be:\n\n_What public-facing vulnerabilities have been most commonly exploited in the last three months?_\n\nThis question is very specific. It clearly delineates what threat we’re concerned with (public-facing vulnerabilities), what aspect of it is most relevant (most commonly exploited), and it gives a limited timeframe (three months).\n\nWhile you don’t necessarily need to have this much specificity, the more information you can include in\nthe question, the better your answer will be. This kind of question will result in the team understanding\nwhat is required of them, which means less chance of researchers going off-track. The answer will lead\nto actionable intelligence and may still be quite satisfying to explore.\n\n\n-----\n\nHaving this narrow focus when producing the intelligence product is key to keeping your team on track\nto produce what is needed. This is where things can get a little nuanced; during the process of answering the question, the team is going to have to work with a lot of data. Some portion of this data may not\nbe relevant to the question being set. But if your team has taken the time to collect, process and analyze\nthis data, don’t waste that work (you might just get a book out of it!).\n\nIn the world of XDR, this data has its place and should not be discarded as waste. To illustrate the point;\nwhile refining sugar cane into sugar, one byproduct of the process is molasses. Where sugar is the\nsweet and shimmering answer to the question, the mineral-rich molasses is the analyzed data that is\nirrelevant to the desired outcome.\n\nOther teams will be able to make use of this gooey goodness, and they can make something truly valuable out of it. Spread the love and find the teams in your organization that can make the best use of the\nresults of your hard work.\n\nIn this phase you should also think about exactly who is going to consume the produced intelligence,\nand what their requirements are. It is all too easy for a passionate researcher to get caught up in a cool\nexploit or innovative obfuscation technique. But if the intended audience is a CISO looking to decide\nwhat tooling to buy based on trends in attacker tactics, techniques, and procedures (TTPs), an intelligence product that goes down a different rabbit hole is worthless for answering this question.\n\nAn audience might think differently than you, and they could require things that you would disregard.\nOne way to help define who needs which information is to describe three different types of intelligence:\n\n**• Strategic - Broader trends for a non-technical audience**\n\n**• Tactical - Outlining TTPs of threat actors for a technical audience**\n\n**• Operational - Details about malware and attacks for a technical audience**\n\nHopefully, you now understand the importance of this phase and can see how putting a little more time\nand thought into it will pay off for the rest of your endeavors.\n\n##### collection\n\nNow that we know what facts we seek and who will be consuming those facts, we need some data to\nwork with. Before you get all excited and grab all the data from All-The-Things™, keep in mind the question\nthat we are trying to answer. We need data to answer that question. Specifically, we need relevant data.\n\nCollection is where we gather that relevant data. This could be both internal and external data, including:\n\n    - File hashes\n\n    - IP addresses\n\n   - Domains\n\n    - Political news articles\n\n    - Historical information\n\n   - Logs\n\n    - IR reports\n\n    - Blogs\n\n   - Dark web\n\n    - Social media sources\n\n    - Code snippets from online repos\n\n   - Data dumps\n\n\n-----\n\nFrom a very generic perspective, external data sources are usually easier to access and consume because\nthey come from products that are made to be used that way. External sources typically have a well-defined\ninterface for extracting data, such as via API, or export functionality within the user interface.\n\nInternal data sources require more time and development effort to introduce because they usually aren’t\ncoming from products designed with that functionality in mind. Pulling that data out might require extra\nprocesses from teams like IR or the SOC, which are busy with their other daily responsibilities. It might also\nrequire further development of internal tools, diverting development resources away from improvements\nto the primary function of the tool is a tricky balancing act\n\nThe trade-off to consider is that while internal sources contain information that is way more relevant to\nyour organization, an over-reliance on external sources might not give you the insight you require.\n\nRegardless of where you get your data from, collection is the perfect place to introduce automation. As\nyou read through the rest of the book, look at the queries and processes used to automate the harvest of\nCobalt Strike Beacons. You should see that they can all be performed by either a human or in an automated\nfashion. Where things can be automated, try to make that a reality. The biggest benefit of having humans\nin the mix will become apparent soon.\n\n##### processing\n\nNow you have data, but it might not be ready yet for human consumption. Processing is where you manipulate the data. You organize it, label it, translate it, deobfuscate it, decrypt it, and filter it. You make it ready\nfor the analyst to use.\n\nAs with the previous phase, automation is pretty much a prerequisite for the processing phase. The number\nof manipulations you are likely to have to do, over the sheer volume of data you will inevitably gather, is\na huge waste of your most precious resource – your team. Not to mention, this sort of processing is\nsoul-destroying drudge work.\n\nThe final thing to think about as you’re processing data is how to provide a curated dataset somewhere\nthat your analysts can interrogate it. You can make this as complicated or simple as you like. Microsoft®\nExcel® pivot tables can be a pretty powerful starting point. Maltego® and Jupyter® Notebook offer more\nadvanced visualizations. And for the truly adventurous, PyQt5 makes custom data visualizations very easy.\n\n_Fi_ _4_ _Th P Qt5 b_ _d i_ _li_ _ti_ _t_ _l_ _d_ _l_ _d f_ _i_ _i_ _B_ _d t_ _t_\n\n\n-----\n\n##### analysis\n\nSo now we have a question, we have an audience, and we have relevant data. This is the point at which\nhumans cannot be replaced. In a phase shrouded by the psychology of cognitive biases, competing hypotheses, and a myriad of reasoning techniques, we attempt to answer the initial question we were assigned.\n\nWhen conducting analysis, it is important to keep the two outputs from planning and direction clear in your\nmind: What is the question, and who is it for?\n\nIf you are in the intelligence-creation space, you are (or at least should be) a curious person. While this is\na terrific quality for analysts, it has a significant downside. You always want to know more, so you might\nstruggle with where to stop analyzing.\n\nOn the surface, understanding more about any given subject is better, right? Creating a masterpiece of a\nreport that takes four months to write means the data you reference might be out of date and therefore not\nactionable. Conversely, if you work quicker and get the data out sooner, you might not have the time you\nneed to assure the accuracy of the data. This balance between time and accuracy versus completeness\nis something everyone in the field battles with.\n\nTo help with this balance, let us go back to planning and direction. Who is going to consume the intelligence,\nand what do they need from it?\n\nAs a very rough, very generic guide, we can look back at the different types of intelligence:\n\n**• Strategic - Greater need for accuracy and completeness, less time sensitive.**\n\n**•** **Tactical - The middle ground. As complete as it can be, while being delivered as quickly as possible.**\n\n**•** **Operational - Needs information as close to real time as possible; some lack of accuracy is**\ntolerated.\n\nBefore we move on to the next phase, it is worth noting that entire careers have gone into understanding\nhow to analyze data. There is no way we can hope to do the science of research and intelligence analysis\nany justice in this book. If you are wanting to understand the way people think and reason, Richard J.\nHeuer’s book Psychology of Intelligence Analysis is a great place to start.\n\n##### dissemination\n\nOnce you break away from the fun stuff, it is time to gently place your intelligence baby into the hands of\nits new owner(s). Your creation needs to be released for consumption by vested stakeholders. In reality,\nthis will likely involve many teams and individuals who are involved in providing XDR services.\n\nReferring to the initial phase of planning and development again, the medium for this publication will depend\non the audience and their requirements. As with everything contained in this section, there is no right or\nwrong way, but there are factors to consider with the different types of intelligence products available.\n\nSOC analysts and IR teams are going to want an intelligence product they can parse quickly, and perhaps\nload into tooling. Executives are going to require something that is easily understood, preferably in report\nformat, or potentially as a briefing with slides and key findings.\n\nRemember where we said that the planning and direction phase will haunt you, if it’s done sloppily? If you\ngive your IR team a 40-page PDF file, or your executives a list of contextualized IOCs, people aren’t going\nto see the value in the intelligence you have lovingly crafted. Delivery of the information should not be an\nafterthought.\n\n\n-----\n\nThere it is: we’ve planned, collected, processed, analyzed the data. And now we’ve delivered it to the stakeholder. We’re done, finished, time for the next… But wait! We’re not quite there yet.\n\nThere’s one last, equally important, phase to consider before we can call our lifecycle complete.\n\n##### evaluation and feedback\n\nWe made it to the final phase, and it’s time to evaluate the delivered item against the goal we created in the\nplanning phase. Did we deliver what we wanted to? Was it accurate? Was it timely?\n\nWe can’t possibly attempt to answer those questions without something to compare it to. This once again\nhighlights the importance of the planning and direction phase.\n\nAside from evaluating the product, we should highlight any deficits that were discovered in any phase of\nthe lifecycle so that improvements can be made. Because this is a cyclical process, if this step is missed,\nit will mean a degradation of the service over time, and repeated failures in future projects.\n\nEvaluating the lifecycle can help us with automation too. Full automation is not always immediately achievable. It often requires an iterative approach over time, with cyclical analysis and development driven by\ninsights gleaned from repeated manual processing, as well as feedback from stakeholders.\n\nAn approach that we’ve implemented, which we’ve found helps us when analyzing the successes and failures\nof each phase, is to look at each one through the lens of the three main components needed to deliver it:\n\n    - People\n\n   - Process\n\n   - Techology\n\nFor example, when considering the collection phase, ask the following questions:\n\n    - Do we have the skill set we needed within the team to identify the relevant data required?\n\n    - Does the process for gathering the data execute in a timely fashion?\n\n    - Do we have the right tools in place to ingest the data?\n\nIf you look at it from this perspective, you can then make recommendations and secure funding with specificity. And if you want to go the extra mile, you can quantify the improvements to make a business case.\n\n##### aligning the stars: the cti lifecycle\n\nOK, now that we’ve gotten all the administrative details out of the way, let the games begin.\n\nTypically, when you use the CTI lifecycle within your organization, the points at which the requestor or\ncustomer will interact with the lifecycle are limited. They will be involved in the planning and direction\nphase, helping to define what they need and how they need it. The next point at which they will be involved\nis when they receive the product, in the dissemination.\n\nThe majority of the work you do will be completed out of the spotlight. For the purposes of this book, we will\nwalk through those phases, to give inspiration in how you can approach the lifecycle within your organization.\n\nQuick quiz: What is the first phase of the lifecycle? You got it, Planning & Direction!\n\nSo, for the purposes of this book – what was our question, and who was our initial audience?\n\n\n-----\n\nEric Milam, our Vice President of Research, tasked the BlackBerry Research & Intelligence Team with\nproviding intelligence to all XDR stakeholders to help them proactively protect and defend against Cobalt\nStrike.\n\nWe then asked ourselves….\n\n_“How do we proactively defend against Cobalt Strike?”_\n\nThere is a lot in that question. If you look at it through the advice above, does it meet the requirements of\na narrow question?\n\nNot really! It is broad, and it isn’t an intelligence question. But it has an intelligence component.\n\nSo, we worked on what was actually required from the intelligence side of the team. In order to answer the\nbigger question, we have several teams who need to consume our intelligence, including SOC teams, product\nengineering, data scientists and analysts, all contributing to products and services under the XDR umbrella.\n\nThat one question became several questions, with different audiences across the XDR solution space,\nand therefore different deliverables.\n\nOur SOC requires contextualized alert information, and asked:\n\n_“How can we improve incident correlation and reduce alert fatigue?”_\n\nProduct engineering wants a better understanding of the operation of Cobalt Strike Beacon, posing the\nquestion:\n\n_“How can we fine-tune EDR to detect Beacon payloads?”_\n\nData scientists want labelled data for training models, wondering:\n\n_“What features are helpful for training models to classify_\n_Cobalt Strike Beacon payloads and configurations?”_\n\nIR wants intelligence correlation, IOCs and TTPs, asking:\n\n_“How can we improve correlation and campaign tracking relating to Cobalt Strike?”_\n\nFinally, intelligence analysts asked:\n\n_“How can we track Team Servers and campaigns?”_\n\nThroughout the remainder of this book, we’ll demonstrate our CTI lifecycle by building an automation\nsystem to collect and process Cobalt Strike Beacon payloads, uncovering over 6,000 Team Servers along\nthe way. We’ll provide our insights and trends from analyzing over 48,000 Beacons served from those\n6,000+ Team Servers, and we also exhibit how intelligence correlation can be performed to enhance our\nknowledge of threat groups.\n\nFinally, we will debrief, and assess how our results helped answer the questions posed by the various\nstakeholders.\n\n\n-----\n\n### chapter two\n\n## ALL YOUR BEACONS ARE BELONG TO US\n\nTo defend against Cobalt Strike, we must first understand how it operates.\n\nCobalt Strike works in an agent and server configuration. Each Beacon is deployed (usually surreptitiously) as an agent on the endpoint and is configured to communicate with a Team Server that acts\nas the C2.\n\nOne is rendered useless without the other, which gives us a couple of options in terms of hunting and\ndetection capabilities. We can choose to detect and respond to either the Beacon or the Team Server,\nhowever, there are reasons why you may choose one over the other.\n\nDetecting and responding to the Beacon likely means that a threat actor is already active on our networks, or that there has been a patient zero victim. This approach is therefore largely reactive. Detecting\nthe Team Server has no such requirement and means we do not have to wait for a device to be targeted\nbefore taking action to defend ourselves.\n\nTo be proactive, which is the ideal scenario, we must be actively looking to locate and identify Cobalt\nStrike Team Servers in the wild. Ideally this would happen as soon as possible once a new Team Server\nis deployed. This would allow us to take preventative actions, thereby cutting the head off the snake\nbefore it ever has a chance to get close enough to bite.\n\nSo, where can we look to find a source of Team Servers for our data collection purposes?\n\n#### DATA COLLECTION\n##### defining the scope\n\nThere are several data sources we can use to generate a list of Cobalt Strike servers that we will want\nto defend against. These sources can include the following:\n\n    - Threat intelligence feeds\n\n    - Industry reports\n\n    - Incident response data\n\n    - EDR alerts\n\n    - Threat hunting\n\nWhile they are still valuable, many of these sources are reactive in nature and place defenders on the back\nfoot. By the time something ends up in an intelligence report or has triggered alerts in your SIEM, something\nbad has potentially already happened.\n\n\n-----\n\nThere are several public methodologies for identifying Cobalt Strike Team Servers or active Beacons.\n\nThese can include, but are not limited to:\n\n    - Default security certificates\n\n    - Default port (50050/TCP)\n\n    - A tell-tale extra null byte in HTTP server responses\n\n    - Jitter and sleep interval analysis\n\n    - JARM signatures\n\n    - DNS redirector response\n\n\n**RecordedFuture**\n_A Multi-Method Approach to Identifying Rogue Cobalt Strike Servers_\nhttps://www.recordedfuture.com/cobalt-strike-servers/\n\n\nAs already stated, our aim is to stay one step ahead of the bad guys and detect Team Servers in the wild.\nTo this end, we have three main options:\n\n      - Scan the entire Internet using a custom-built scanner with the purpose of detecting and analyzing\nCobalt Strike Team Servers\n\n    - Leverage well-known and established scanning services already available on the Internet such\nas Shodan, Rapid7, Censys or ZoomEye\n\n      - Build a hybrid system that leverages public services in conjunction with a private, more targeted\nscanner\n\nAll options have their strengths and weaknesses. They require differing levels of investment and have\ndifferent barriers to entry for any organization looking to implement such a system.\n\nBuilding and operating a bespoke Internet-wide scanner and analyzer is the best option in terms of the\npotential quantity of results. It also offers the best ability to add customizations. But this is also the most\nexpensive option in terms of the time and skills required to implement it. It might be beyond many organizations’ capabilities or budget.\n\nThe use of public scanning services can be helpful for organizations that do not have an existing way\nof discovering or tracking Cobalt Strike infrastructure. However, without an additional layer of human or\nautomated analysis for quality assurance, these services might not yield optimal results. You could not\nachieve a high level of certainty that a server is indeed hosting a Cobalt Strike instance.\n\nBuilding a hybrid system is a happy medium between these two approaches. This should provide results\nthat have a high level of certainty, but in a more cost-effective manner. Granted, you might not have the same\nvolume of results as from a bespoke system, but it would certainly still offer a good return on investment.\n\n##### crafting some queries\n\nTrying to build a scanner to scan the entire Internet, to accurately fingerprint the systems found, and then\nto store all the resulting data is no mean feat. Don’t forget to add to this the potentially significant effort\nrequired to procure the budget for your AWS (Amazon Web Services) bill if you want to do this continuously\nand rapidly, and to store the results for any length of time.\n\nThis is where services like Shodan can make life easier, as they have already done the legwork for you.\nOther researchers have used similar services like Censys and ZoomEye. Or you can opt to use datasets\nfrom Rapid7 instead for Cobalt Strike hunting.\n\n\n-----\n\nFor this paper we will focus on Shodan, but Rapid7 Open Data was also invaluable in our data collection\nphase. You may decide to use one or even all the services mentioned.\n\n\n**Shodan**\nhttps://www.shodan.io/\n\n**Rapid7 Open Data**\nhttps://opendata.rapid7.com/\n\n**Censys**\nhttps://censys.io/\n\n**ZoomEye**\nhttps://www.zoomeye.org/\n_Identifying Cobalt Strike team servers in the wild by using ZoomEye_\nhttps://80vul.medium.com/identifying-cobalt-strike-team-servers-in-the-wild-by-using-zoomeyedebf995b6798\n\n\nThe important part of this phase is getting relevant data to feed to the next stage of our analysis. Firstly,\nwe need to craft search queries to unlock the value in Shodan’s data. To limit false positives, these queries\nneed to be based on known Cobalt Strike Team Server characteristics. The results of these queries will still\nneed further scrutiny and processing to increase the level of certainty that a server is hosting Cobalt Strike.\n\nIt will take time, experimentation, and regular updates to craft a good set of queries that can account for\nthe different versions of Team Server. These queries should also include instances where the threat actor\nhas customized their deployment, causing it to go undetected by an existing query set.\n\nHere, we have crafted a query that can be used to detect the “404 Not Found” HTTP response returned\nfrom the NanoHTTPD server used in the backend of a Cobalt Strike Team Server.\n\n_Figure 5 - Shodan query to detect Cobalt Strike ‘404 NOT FOUND’ response_\n\nThis query searches for a HTTP server returning a “404 Not Found” response that has a content length of\nzero, a content type of “text/plain”, and which returns a “Date” header.\n\n_Figure 6 – Default NanoHTTPD HTTP header response_\n\nThe number of results returned via this Shodan query is huge, with more than 322,000 in total. The majority\nof these would likely be false positives. This is due to the way Shodan queries operate; they will trigger on\nany systems that contain the values specifi ed in our query, including systems that contain other headers\nin addition to those specifi ed.\n\n\n-----\n\n_Figure 7 – Shodan Query results for \"404 NOT FOUND\" response from Cobalt Strike Team Server_\n\nFor those familiar with programming logic or string comparisons, it is best to think of Shodan queries as\na “contains” comparison, rather than “equals”. To work around this, we will require a tighter, more specifi c\nquery to fi lter some of these extraneous results out.\n\nFor example, if we wanted to remove results that contain a “Connection” header, we can append “AND\nNOT “Connection”” to our existing query. This would signifi cantly reduce the number of results and cut\ndown on false positives.\n\nThe alternative to fi ltering at the query level is to perform some additional processing of the results, using\nautomation or scripting.\n\nDepending on your level of Shodan API access, you might be forced to refi ne the query quite a bit, or else\nyou risk exceeding your API keys limitations. You will defi nitely need more than one query to cover the\nrange of Cobalt Strike server confi gurations or customizations, so make sure you adjust your approach\nto suit your API limits.\n\nThere needs to be a balance between having a query that is not so tight that it creates false negatives,\nbut also not so loose that you create false positives (which in effect are wasted API query results). API\nlimitations aside, in most scenarios a false positive is more favorable than a false negative. False positives\ncan be whittled down later, but false negatives are missed Team Servers, which are potentially active in\nthe wild and used to conduct attacks.\n\nAnother query that has provided valuable results for detecting Cobalt Strike Team Servers is based on\nJARM fi ngerprinting. JARM is a Transport Layer Security (TLS) fi ngerprinting tool developed by Salesforce,\nwhich they have leveraged to detect Cobalt Strike Team Servers and other malicious servers.\n\n\n**Salesforce**\n_Easily Identify Malicious Servers on the Internet with JARM_\nhttps://engineering.salesforce.com/easily-identify-malicious-servers-on-the-internet-with-jarme095edac525a\n\n\nShodan added JARM search functionality in November 2020, and it is proving to be a powerful tool in the\nthreat hunter’s arsenal. The Cobalt Strike Team Server is written in Java, and each Java TLS stack has a\nvery specifi c JARM fi ngerprint. As Java 11 is frequently used as the build version for a great number of\nCobalt Strike Team Servers, its JARM fi ngerprint has also become a JARM fi ngerprint for Cobalt Strike.\n\nssl.jarm:\"07d14d16d21d2107c42d41d00041d24a458a375eef0c576d23a7bab9a9fb1\"\n\n_Figure 8 - Shodan Query for Cobalt Strike/Java 11 SSL JARM fi ngerprint_\n\n\n-----\n\n**Cobalt Strike**\n_A Red Teamer Plays with JARM_\nhttps://blog.cobaltstrike.com/2020/12/08/a-red-teamer-plays-with-jarm/\n\n**SANS**\n_Threat Hunting with JARM_\nhttps://isc.sans.edu/forums/diary/Threat+Hunting+with+JARM/26832/\n\n\nSearching a known Java 11 JARM associated with Cobalt Strike, we received a little over 6,000 results:\n\n_Figure 9 - Shodan Query Results for SSL JARM fi ngerprint for Cobalt Strike Team Server_\n\nThese results contain Cobalt Strike Team Servers as well as legitimate servers running the Java 11 TLS\nstack, so false positives will be present.\n\nWe also need to consider that spoofi ng JARM signatures is a possibility, whereby a server can be confi gured to masquerade as a Cobalt Strike Team Server from a TLS/JARM perspective. These spoofed\nservers might be confi gured to act as a honeypot that could be used to detect systems like ours, that are\nattempting to discover Cobalt Strike Team Servers in the wild. These servers can then be blocked during\nfuture deployments, potentially thwarting our scanning efforts.\n\n\n**Stefan Grimminck**\n_Spoofi ng JARM signatures. I am the Cobalt Strike server now!_\nhttps://grimminck.medium.com/spoofi ng-jarm-signatures-i-am-the-cobalt-strike-server-nowa27bd549fc6b\n\n\nAdditionally, threat actors with an awareness of JARM fi ngerprinting could also modify their TLS stack in\na way that alters their JARM fi ngerprint to evade detection. Looking at the top 10 JARM fi ngerprints for\nTeam Servers we have observed in the wild, we can confi rm that this is the case. The top result by far is\nthe JARM fi ngerprint for the Java 11 TLS stack, but there are several notable deviations from this.\n\n\n-----\n\n_Figure 10 – Top 10 JARM fi ngerprints_\n\nOther queries can be based on criteria such as Cobalt Strike’s default, self-signed SSL certifi cate, which\nwe’ll take a closer look at later in the book.\n\nssl.cert.serial:146473198\n\n_Figure 11 - Shodan query to check for Default SSL Serial_\n\nThis SSL certifi cate should ideally be changed from the default prior to a live operation or engagement, but\npeople often neglect to change it when they deploy a Team Server. This gives us an opportunity to discover\nservers that still use this certifi cate, whether intentionally or not.\n\n_Figure 12 - Shodan Query Results for SSL certifi cate serial for Cobalt Strike Team Server_\n\n\n-----\n\nLastly, we can also craft queries based on the numerous Malleable C2 profi les for additional coverage\n(we’ll cover these profi les in more detail in Chapter 3).\n\nOne such example would be a query to detect Team Servers using the Microsoft Update Malleable C2\nprofi le. This profi le is confi gured to use a certifi cate common name of www[.]windowsupdate.com, to\nmasquerade as a legitimate Microsoft certifi cate.\n\n_Figure 13 – HTTP certifi cate from Microsoft Update malleable C2 profi le_\n\nWhen we query for servers using this certifi cate common name, we get far fewer results when compared\nto the other queries. But this time we get a higher likelihood of true positives.\n\n_Figure 14 – Shodan query results for “Microsoft Update” HTTP certifi cate_\n\nWith some time and experimentation, and further knowledge of Malleable C2 profi les, common certifi cates,\nand HTTP response headers, we can craft multiple queries that will return an abundance of data, which\nwe will need to further validate for potential Team Server activity.\n\n\n-----\n\n##### data validation\n\nNow that we have crafted some queries and started to gather data, how do we validate the results?\n\nThere are a few questions that we can ask of the data, which can increase our confidence of a valid detection:\n\n1. Do any servers appear in multiple result sets? (i.e., are there detection overlaps?)\n2. Have any of the collected servers been reported via OSINT channels, threat intelligence feeds,\nor been observed attacking other organizations?\n3. Can we coerce the Team Server to serve up a Beacon?\n\nAt a minimum, we need to interrogate the datasets and intelligence feeds for detection overlaps and\nduplications and check if any of the servers have already been observed carrying out malicious activities.\nDetection overlaps can be used to our advantage here; if we have two or more differing queries or datasets\nthat return data containing the same IP address, then it can increase the likelihood that the discovered IP\nis in fact an operating Team Server.\n\nThe ideal scenario is one where we can force a server from our dataset to serve us a Beacon. If we can\ndo so, then we will know for certain that we have discovered a Team Server and can mark it for the next\nstages of our CTI lifecycle.\n\nThis will not always be possible, as Team Servers can be protected behind redirectors that can limit\nconnections to the Team Server itself, thereby preventing us from retrieving a Beacon. In this instance,\nthere are further ways of detecting Cobalt Strike redirectors that can be added into our validation process\nto further increase our detection confidence.\n\nSticking with the objective of retrieving a Beacon from a Team Server, we need to know how we can emulate\na valid stager check-in so that we are served a Beacon.\n\nThere is a bit of behavior that was implemented purposefully to allow interoperability between Cobalt Strike\nand Metasploit Framework generated stagers that can help us here. Both Metasploit and Cobalt Strike\nstage their payloads in such a way that a specially crafted HTTP request – where the Uniform Resource\nIdentifier (URI) matches a specific checksum8 value – will cause the Team Server to serve a Beacon.\n\nDepending on the mode of operation and the architecture of the payload being staged, the URI may need to\nbe of a specific length and have a specific checksum8 value. The breakdown of how this works for Cobalt\nStrike can be seen in the table below.\n\n**Architecture** **Mode** **Checksum8** **URI Length** **Example URI**\n\nx86 Normal 92 ANY /aaaaaw\n\nx64 Normal 93 4 /dVbA\n\nx84 Strict 92 5 /aa910\n\nx64 Strict 93 5 /ab820\n\n_Table 1 - Stager URI breakdown_\n\n|Architecture|Mode|Checksum8|URI Length|Example URI|\n|---|---|---|---|---|\n|x86|Normal|92|ANY|/aaaaaw|\n|x64|Normal|93|4|/dVbA|\n|x84|Strict|92|5|/aa910|\n|x64|Strict|93|5|/ab820|\n\n\n-----\n\nArmed with this knowledge, we can develop a simple Python script that can generate a URI string to satisfy\nany checksum8 validation and URI length checks. This script ultimately could be used to spoof a stager\ncheck-in.\n\n_Figure 15 –  Python script to generate a URI of a specifi ed length and Checksum8 value_\n\nThis approach does have its limitations. If the adversary is using a stageless payload in their deployment,\nor if they have disabled staging altogether, we would not be able to retrieve a payload. A stageless payload\nis one that contains both the payload stage and its confi guration in a self-contained package, so there\nis no requirement for a check-in to the C2 to complete the infection process (for more details see Stager\nvs. Stageless).\n\n##### pillaging team servers\n\nAt this point, we have one or even several data sources that are providing us with targets for scanning.\nWe also have a means of generating the correct stager URI required for us to try and download a Beacon\nfrom each of the suspected Team Servers. Combining these two pieces of information, we can begin to\nautomate the process of emulating a stager check-in to each of the potential targets, and thus save any\nreturned payloads to disk for subsequent processing and analysis.\n\n\n-----\n\n_Figure 16 - Python function to attempt to download a Cobalt Strike Beacon_\n\n##### processing\n\nAt this point, we should have some payloads ready for processing, although not all of them will be Cobalt\nStrike Beacons. We may have inadvertently hit on legitimate content or have been served spoofed content\nto mask the presence of an actual Team Server.\n\nA valid Beacon payload stage is normally a Portable Executable (PE) fi le, most commonly a dynamic-link\nlibrary (DLL), or position-independent shellcode that will decode a PE. We can fi lter out false positives by\nremoving fi les that are not PE fi les or that are smaller data fi les (less than 200KB), as Cobalt Strike payloads\nare generally larger than this size. What remains should be Cobalt Strike Beacons ready for confi guration\nextraction.\n\n\n-----\n\n##### beacon config extraction\n\nAs already mentioned, the payload served by a Team Server takes one of two possible forms:\n\n1. PE DLL (32 or 64 bit)\n2. Shellcode (32 or 64-bit) that subsequently decodes and refl ectively loads a PE DLL fi le in-memory\n\nIf we have been served the latter, then we will need to decode the encoded PE before we can attempt to\nextract the confi guration data. This can be achieved in several ways, but two of the most common and\neasiest to scale are:\n\n1. Statically, by locating the encrypted PE payload and then decrypting it\n2. Dynamically, by emulating the shellcode so it self-decrypts, and then writing the decrypted PE\npayload to disk\n\nUsing either option requires an understanding of how the shellcode decodes the payload within.\n\nThe fi rst block of the served payload is the decoder routine, which is responsible for XOR decoding the\nembedded PE. Immediately following the shellcode is a 32-bit XOR key that is used to decode both the\npayload size and the payload. Immediately after the XOR key is a 32-bit XOR encoded payload size, which\nis in turn followed by the variable-length, XOR encoded payload.\n\n_Figure 17 - Breakdown of a shellcode stager_\n\nWhen observed in IDA Pro (a popular disassembler), we can see a call to the decoder function immediately\nprior to the XOR key, with the encoded size and payload immediately following.\n\n_Figure 18 – IDA view of shellcode and other key components of the shellcode stager_\n\nThis knowledge will prove useful later when we attempt to decode the payload.\nInspection of the decoder function reveals that it uses an output differential XOR routine to decode the\nBeacon payload. The XOR key is initially used to decode the fi rst DWORD of the payload, and then updated\nto the value of the fi rst decoded DWORD, which is then used to decode the second DWORD. This process\nis repeated until the entire payload is fully decoded, which is determined by the decoded size DWORD.\n\n\n-----\n\n_Figure 19 - Output Differential XOR decode routine_\n\nNow we are aware of the structure of the shellcode payload served-up by the Team Server and how it\nperforms its decoding. We can develop some code to perform this statically, so that we can retrieve the\nBeacon payload for further processing.\n\n_Fi_ _20 P th_ _f_ _ti_ _t d_ _d_ _h ll_ _d_ _d B_\n\n\n-----\n\nThis code first checks the shellcode’s target architecture (32/64-bit) based on the opcode of the first\ninstruction of the shellcode. The architecture will determine the pattern of the “call” instruction that should\nbe located at the end of the decode function.\n\nIf a specified “call” pattern can be found, then we will have located the offset for the end of the decoder\nroutine. Once we know this offset, we can then determine the values for the XOR key and payload size\nusing their location relative to this offset. With the XOR key and payload size in hand, we can then perform\nthe output differential XOR decode process, thereby retrieving the encoded Beacon payload.\n\nThe final stage in processing is the extraction of the config from the Beacon itself. Locating the config\nwithin a decoded Beacon can be performed quickly using known binary patterns commonly found in the\nconfig. Cobalt Strike Beacon configs have a particular structure and are single-byte XOR encoded, which\ncauses the encoded config to have tell-tale patterns in its encoded form. The structure looks like this\n(using Kaitai Struct):\n\n_Figure 21 - Cobalt Strike Config Entry Structure_\n_(https://gist.github.com/sixdub/a5361168ba7acecf7a7a214bf7e5d3d3)_\n\n_Index is a WORD (2-byte) value starting at offset 0x0 and is effectively the Setting ID number. The fieldtype_\nis also a WORD, with three possible values:\n\n    - 0x1 for short\n\n    - 0x2 for integer (2 or 4 bytes)\n\n    - 0x3 for data or string\n\nThe value of fieldtype informs us of how to parse the fieldvalue. The fieldlength is also a 2-byte value\nindicating the length of the following data in the fieldvalue.\n\nXOR encoding such a rigid collection of structures is highly susceptible to cryptanalysis, causing patterns\nto emerge in the encoded data. This is especially clear when those structures are XOR encoded using a\nnon-null preserving XOR encoding scheme.\n\n\n-----\n\nDepending on the version of Cobalt Strike Team Server that generated and served the Beacon in question,\nthis will determine the pattern we need to search for. The default XOR key value is 0x69 for versions prior\nto version 4, and 0x2e from version 4 onwards.\n\nIt is rare to see Beacons that have strayed from these default XOR values, but it can and does happen. In\nsuch cases, it would be necessary to brute force the XOR key value.\n\nThe first record in a Beacon’s config is the “Beacon Type” setting. The “Beacon Type” entry in the config has\nan index of 0x1, fieldtype of 0x1, fieldlength of 0x2 and the fieldvalue varies depending on the Beacon Type.\nThis means that the first six bytes of the Beacon config remain static and have a hex value of \\x00\\x01\\\nx00\\x01\\x00\\x02. When this is encoded using XOR with a key of 0x69 or 0x2e, we end up with two possible\noutput patterns to search for in order to locate the start of a config block. These are \\x2e\\x2f\\x2e\\x2f\\\nx2e\\x2c and \\x69\\x68\\x69\\x68\\x69\\x6b.\n\nIf we find such a pattern, we will simultaneously know where the config starts as well as the value of the\nXOR key used in its encoding. Incidentally, this is also a useful “quick ‘n dirty” means of distinguishing\nbetween versions 3.x and 4.x of Cobalt Strike.\n\nIf neither pattern is discovered, then we might be looking at one of the rare Beacons using a non-default\nXOR key. But we can still apply the same methodology in order to locate the encoded config by rotating\nthrough all possible single-byte XOR key values until a matching pattern is found.\n\nNow that we can find the config within a decoded Beacon and have awareness of the XOR key as well as\nan understanding of the structure of each setting in the config, we can automate the final step of extracting\nthe configuration. Once the configuration is parsed and dumped, we can store the results in a database\nfor further analysis. SQLite is more than adequate for this purpose, but an ELK (Elasticsearch, Logstash,\nand Kibana) stack works well, too. It all depends on what best serves your needs and fits with existing\nservices and solutions.\n\nSeveral Beacon config parsers are available and in common use by the security community. Here’s a helpful\nand informative blog post about building a parser using Kaitai Struct.\n\n\n**Justin Warner**\n_Using Kaitai Struct to Parse Cobalt Strike Beacon Configs_\nhttps://sixdub.medium.com/using-kaitai-to-parse-cobalt-strike-beacon-configs-f5f0552d5a6e\n\n\n-----\n\n##### automating the hunt for cobalt strike\n\nNow that we have defi ned our data sources, pillaged some Team Servers for shellcode and Beacons, and\nextracted their confi gs, we need to consolidate everything into an automated workfl ow.\n\nThis automation can serve the needs of key stakeholders across all XDR products and services.\n\n_Figure 22 - Cobalt Strike hunting automation_\n\nData collected from multiple sources will be passed through a validation process to provide a confi dence\nrating based on several criteria, such as:\n\n1. Source of data i.e., threat intelligence feed, Shodan, IR etc.\n2. Confi dence of search query (if any)\n3. Overlap in detections i.e., same data from multiple sources\n4. Beacon retrieved and processed\n\nOnce evaluated and scored, the data can be stored, disseminated, and acted upon as required. If necessary,\nthis data could also be made accessible using an API so that it can be easily leveraged in future automation endeavors. When performed at scale, and over a long period of time, the resulting dataset can offer a\nwealth of information that can be used to bolster defenses, prevent breaches, and enhance intelligence.\n\nBut before we delve into the dataset closely, it’s worth spending a moment familiarizing ourselves with\nBeacon’s confi guration and “Malleable C2 profi les”, so we can take stock of some of the data we have to\nplay with.\n\n\n-----\n\n### chapter three\n\n## WE ARE BEACON\n\nAs you’re gathering data, it’s important to understand one aspect of Cobalt Strike functionality, as it\nmakes a big difference in our ability to create clusters. Cobalt Strike Beacons are highly configurable\nthrough their use of Malleable profiles, which offer an unusual opportunity for both defenders and threat\nactors.\n\nMalleable profiles specify how a Beacon acts and looks in the target environment. These profiles also\nspecify what parameters are to be used within their communication protocol, and even the method that\nBeacon uses to inject into other processes.\n\nMalleable profiles use their own “profile language” that allows the attacker to state individual Beacon\nparameters. It also enables attackers to craft a bespoke binary so that they can remain undetected by\nsecurity solutions and blend in with existing activity on the endpoint.\n\nCobalt Strike uses the phrase “Malleable C2” as an umbrella term, but it describes more than just communications settings. The highly configurable and malleable nature of Cobalt Strike can be broken down\ninto several sections:\n\n    - Malleable C2:\n\n     - General settings\n\n     - HTTP stager options\n\n     - HTTP GET/POST request metadata\n\n     - HTTPS certificates\n\n    - Malleable PE:\n\n     - Process injection\n\n     - Post exploitation\n\nBefore we delve into the nuts and bolts of Malleable profiles, it’s probably best to introduce some terminology around “stagers” first.\n\n##### stager vs. stageless\n\nA Cobalt Strike Beacon can be either served by a payload stager or deployed directly in the form of a\nso-called “stageless package”.\n\nA stager is a small executable that will download the Beacon payload DLL from a remote Team Server.\nThe executable consists of a simple routine that uses Windows® APIs to pull down the payload and run\nit directly from memory.\n\nThe downloaded Beacon binary starts with a small shellcode stub that is placed at the beginning of its\nDOS header. The shellcode executes the ReflectiveLoader (or renamed) export, which in turn loads the\nBeacon DLL into memory and executes it.\n\n\n-----\n\nThere are several types of Cobalt Strike stagers working over different protocols, the most common\nbeing:\n\n    - HTTP/HTTPS stagers that simply download a Beacon payload using the InternetReadFile API\n\n    - DNS stagers that use the DNSQuery_A API to read a Beacon payload from DNS TXT record\nresponses\n\n    - CP/Bind stagers that connect to the specifi ed IP address using raw sockets and read a\nBeacon payload directly over the socket\n\n    - SMB stagers that read a Beacon payload locally through a Windows named pipe\n\nConversely, stageless payloads do not rely on any network/inter-process communication to pull down a\nBeacon payload. Instead, the Beacon DLL is obfuscated and embedded inside the initial shellcode. The\nshellcode then decrypts the DLL and executes the code in its header, which in turn refl ectively injects\nthe DLL into memory.\n\n##### malleable c2\n\nThe Malleable C2 section of the profi le refers specifi cally to the defi nition of the communication protocol used between the Beacon and the Team Server. In the Malleable C2 language, each section is\nreferred to as a “block,” which delineates the grouping of parameters to be set within each section.\n\nThe following examples of these blocks have been taken from the “jquery-c2.3.14.profi le” Malleable C2\nprofi le.\n\n\n**Cobalt Strike**\n_Malleable Command and Control_\nhttps://www.cobaltstrike.com/help-malleable-c2\n\n**Threat Express**\n_malleable-c2/jquery-c2.3.14.profi le_\nhttps://github.com/threatexpress/malleable-c2/blob/master/jquery-c2.3.14.profi le\n\n\n_General_\n\nThese are general options that defi ne operational settings for the Beacon’s C2 communication such as\n_useragent, tcp_port, pipename etc._\n\n_Figure 23 – Example Malleable C2 profi le_\n\n\n-----\n\n_HTTP-Confi g_\n\nThe http-confi g block is a server-side block that defi nes the served HTTP response headers, as well as\nwhich user-agents are allowed or blocked when specifi ed by clients in their HTTP request headers. If the\nuser-agent is blocked, the requestor will receive a 404 error.\n\nIf the server is behind an HTTP redirector, the trust_x_forwarder_for parameter can be set. However, both\nthis option and the user-agent permission modifi er are not used within the following example.\n\n_Figure 24 – Example HTTP confi guration options_\n\n_HTTP-Stager_\n\nThe _http-stager block defi nes the parameters used within the HTTP staging process for the Beacon_\nbinary itself. These are used to retrieve the Beacon binary from the Team Server. The http-get and http_post blocks aren’t used until the Beacon has been loaded into memory on the victim machine. While not_\nshown here, a nested server block can also be specifi ed for server-side confi guration. We have chosen\nto omit the server block from the subsequent examples, as they are not as relevant to the confi guration\nextraction as the client block.\n\n_Figure 25 – Example HTTP stager options_\n\n_HTTP-GET_\n\nThe http-get block defi nes both server-side and client-side parameters such as the URI to be used in\nfacilitating GET requests. In the following example a nested client block then holds client-specifi c GET\nrequest modifi ers, such as header fi elds and encoding. This block and the subsequent http-post block in\nthe next example also have client/server agnostic parameters, as well as the nested blocks.\n\n\n-----\n\n_Figure 26 – Example HTTP GET options_\n\n_HTTP-POST_\n\nLike the http-get block, the http-post block defi nes the parameters to be used in sending POST requests.\nThe _id block specifi es the parameter to be appended to the POST request URI and the_ _output block_\ndetermines how the data is encoded.\n\n_Figure 27 – Example HTTP POST options_\n\n\n-----\n\n_HTTPS-Certifi cate_\n\nThe https-certifi cate block enables the operator to fully customize the certifi cate that they use for Cobalt\nStrike C2 communications. Three scenarios are possible when encrypting the communication:\n\n    - Use a trusted and signed certifi cate stored within a Java Keystore fi le\n\n    - Create your own self-signed certifi cate\n\n    - Specify values to be used with the default Cobalt Strike self-signed certifi cate\n\n_Figure 28 – Example HTTPS certifi cate options_\n\n##### malleable pe\n\nWhile the section on Malleable C2 deals with the communication between Team Server and Beacon, the\nMalleable PE section defi nes the in-memory characteristics and non-network-related behaviors of the\nBeacon payload on a victim’s machine.\n\n_Stage_\n\nThe stage block is largely responsible for the physical attributes of a Beacon binary. Various parameters\ncan be toggled to enable different methods of detection evasion, such as the stomppe, obfuscate and\n_sleep_mask boolean operators._\n\nOther values such as compile_time, and rich_header can help in further obfuscating the binary by altering attributes that researchers might use to identify or track the actor.\n\nOf special note are the transform-x86 and transform-x64 blocks, which allow for further modifi cation of\nthe Beacon’s injection stage using three operators: prepend, append and strrep, depending on the target\narchitecture of the Beacon.\n\nAs the name suggests, prepend is used to prepend bytes to this stage, append to append, and strrep to\nreplace or remove default strings (for example, null out the beacon.dll module name).\n\nIn the example below we can see several bytes being prepended. This is in fact a NOP sled.\n\n\n-----\n\n_Figure 29 – Example Beacon stager options_\n\n\n**Cobalt Strike**\n_PE and Memory Indicators_\nhttps://www.cobaltstrike.com/help-malleable-postex#memory\n\n\n_Process Injection_\n\nThe process-inject block is responsible for the parameters used to facilitate process injection. This includes the technique to be used to allocate memory and the allocation size, among others. Like the\nstage block, the transform-* blocks are used to pad and transform the injected data.\n\nLastly, an execute block is used to specify the methods by which the Beacon will inject into a process.\nYou can specify multiple values here and they will be tried if previous values fail. As the documentation\nsays, the execute options must cover all “corner-cases” such as self-injection, or cross-session remote\nprocess injection. With this said, we will see these parameters when extracting the confi guration from\nthe binary.\n\n\n-----\n\n_Figure 30 – Example Process injection options_\n\n\n**Cobalt Strike**\n_Process Injection_\nhttps://www.cobaltstrike.com/help-malleable-postex#processinject\n\n\n_Post Exploitation_\n\nThe spawnto options are used by Beacon to control which process it will spawn and inject certain payloads into. Several payloads, such as screenshots, keyloggers, and hash dumping are implemented as\nWindows DLLs. Because of this, they require a target process to be injected into in order to execute.\n\nThe _spawnto paths must be the full path to the target process, although environment variables are_\naccepted, and special keywords, syswow64 (x86) and sysnative (x64) are resolved by Beacon to their\nrespective paths, depending on architecture.\n\n_Figure 31 – Post exploitation options_\n\n\n-----\n\nIn addition, it is also possible to supply settings to configure output pipe names, perform “smart” injection, enable/disable AMSI (the Windows Antimalware Scan Interface), and obfuscate post-exploitation\npayload DLLs.\n\n\n**Cobalt Strike**\n_Post Exploitation Jobs_\nhttps://www.cobaltstrike.com/help-malleable-postex#postex\n\n\n_Example Extracted Beacon Configuration_\n\nYou can see an example of some of the settings that can be extracted from a Beacon below. Depending\non the configuration and version of Cobalt Strike, not all settings will be present or populated. We’ve\nincluded the most popular values observed across our dataset for reference purposes:\n\n|ID|Name|Type|Setting Description|Common Values|\n|---|---|---|---|---|\n|1|BEACONTYPE|SHORT|Type of Cobalt Strike Beacon|0x0 (HTTP – windows/beacon_http/ reverse_http) 0x1 (Hybrid HTTP and DNS – win- dows/beacon_dns/reverse_http) 0x2 (SMB – windows/beacon_smb) 0x4 (TCP – windows/beacon_tcp) 0x8 (HTTPS – windows/beacon_https/ reverse_https) 0x10 (Bind TCP – windows/beacon_ tcp/bind_tcp)|\n|2|PORT|SHORT|Port to use for C2 communication|80, 443, 8080, …|\n|3|SLEEPTIME|INT|Time between C2 check-ins (in millisec- onds).|60000, 5000, …|\n|4|MAXGETSIZE|INT|Maximum size of GET transaction.|1048616, 1398104, …|\n|5|JITTER|SHORT|Percentage variation above and below the value of SLEEPTIME, which creates a sleep range from which a random sleep value is chosen.|0, 20, 37, …|\n|6|MAX_DNS|SHORT|Maximum length of hostname when uploading data over DNS.|255|\n\n\n-----\n\n|7|PUBKEY_MD5|STRING|MD5 hash of SSL public key used for metadata encryption whenever a Beacon checks-in.|e9ae865f5ce035176457188409f6020a, …|\n|---|---|---|---|---|\n|8|C2SERVER|STRING|List of C2 Team Server IPs/domains and URIs. May be indicative of domain fronting.|192.168.0.1,/cx tencentcs.com,/cx amazonaws.com,/cx cloudfront.net,/cx …|\n|9|USERAGENT|STRING|User-Agent for HTTP communications. Default is random IE11.|Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; yie11; rv:11.0) like Gecko|\n|10|SUBMITURI|STRING|URI used in HTTP GET transactions.|/submit.php|\n|11|C2_MAL- LEABLE_IN- STRUCTIONS|STRING|Operations to carry out on C2 response data buffer – see blog post: https://usualsus- pect.re/article/cobalt- strikes-malleable-c2- under-the-hood|Base64 decode, NetBIOS decode “a”, …|\n|12|C2_GETREQ_ META|STRING|Metadata fields passed in HTTP GET request.|Cookie|\n|13|C2_POST- REQ_META|STRING|Metadata passed in HTTP POST request.|Content-Type: application/oc- tet-stream, id|\n|14|DEPRECAT- ED_SPAWNTO|STRING|Formerly a hex encod- ed process name. Currently an MD5 hash of a file (sometimes releasenotes.txt) on the Team Server.|72756e646c6c33322e657865 (run- dll32.exe) fbf34aa48d6080bf8ef3eaff8ecf9a31|\n|15|PIPENAME|STRING|Name of the pipe to use for SMB Beacon’s peer-to-peer commu- nication.|\\\\%s\\pipe\\msagent_%x|\n|16|DEPRECAT- ED_KILLDATE_ YEAR|INT|Date after which Bea- con will refuse to run – Year component.|0|\n\n\n-----\n\n|17|DEPRECAT- ED_KILLDATE_ MONTH|INT|Date after which Bea- con will refuse to run – Month component.|0|\n|---|---|---|---|---|\n|18|DEPRECAT- ED_KILLDATE_ DAY|INT|Date after which Bea- con will refuse to run – Day component.|0|\n|19|DNS_IDLE|INT|IP address used to indicate no tasks are available for DNS Beacon.|0.0.0.0|\n|20|DNS_SLEEP|INT|Force a sleep prior to each DNS request.|0, 1|\n|21|SSH_HOST|STRING|SSH hostname|ssh.example.com|\n|22|SSH_PORT|SHORT|SSH port|22|\n|23|SSH_USER- NAME|STRING|SSH username|username|\n|24|SSH_PASS- WORD|STRING|SSH password|password|\n|25|SSH_PUBKEY|STRING|Base 64 encoded SSL public key used for metadata encryption whenever a Beacon checks in.|MIGfMA0GCSqGSIb3DQEB- AQUAA4GNADCBiQKBgQC- D+Oczoukk74PeZXRGOM2yY3qhD- D26eZpDSzwrw78VelF8lpJ8pNZ- rrkgrSaeN60KUCaWoyxRCL1AA7/ zwXEpg1lzpDcP1iVdFxyFD- 40Dg1EMn4Cw4t3GkwtAnD6HqTK- wvGm2ThqVZH2hH3tu5HIt7u/xIerzsY- JReoVoR3dsqmQIDAQABAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAA==|\n|26|C2_VERB_GET|STRING|Verb to use for GET transaction.|GET, POST|\n|27|C2_VERB_ POST|STRING|Verb to use for POST transaction.|POST, GET|\n|28|C2_CHUNK_ POST|INT|Chunk Beacon re- sponses.|0, 1|\n|29|SPAWNTO_ X86|STRING|The 32-bit program that the Beacon will inject DLL payloads into.|%windir%\\syswow64\\rundll32.exe|\n\n\n-----\n\n|30|SPAWNTO_ X64|STRING|The 64-bit program that the Beacon will inject DLL payloads into.|%windir%\\sysnative\\rundll32.exe|\n|---|---|---|---|---|\n|31|CRYPTO_ SCHEME|SHORT|Encrypt Beacon C2 communications.|0, 1|\n|32|PROXY_CON- FIG|STRING|Address of SOCKS proxy server.|http://127.0.0.1:8080|\n|33|PROXY_USER|STRING|SOCKS proxy user- name.|test|\n|34|PROXY_BE- HAVIOR|STRING|SOCKS proxy Pass- word.|test|\n|35|PROXY_BE- HAVIOR|SHORT|Proxy behavior setting.|Use IE settings, Use direct connection, Use Proxy Server|\n|36|DEPRECATED _INJECT_OP- TIONS|SHORT|Replaced by PRO- CINJ_ALLOWED.|1, 3|\n|37|WATERMARK|INT|Cobalt Strike custom- er ID.|305419896, 0, 1873433027, 1359593325, …|\n|38|CLEANUP|SHORT|Determines if Beacon will attempt to free memory associated with the Reflective DLL package that initialized it.|0, 1|\n|39|CFG_CAU- TION|SHORT|Perform CreateThread before injecting code into memory.|0, 1|\n|40|KILLDATE|INT|Date after which Bea- con will refuse to run (YYYYMMDD).|0, 20211231, 20990101, …|\n|41|GARGLE_ NOOK|INT|Obfuscate .text sec- tion size.|0, 152826, …|\n|42|GARGLE_SEC- TIONS|STRING|Obfuscate section information.|00600200b1fb- 020000000300c0a0030000b003008c- cd03|\n|43|PROCINJ_ PERMS_I|SHORT|Initial permissions for injected content.|PAGE_EXECUTE_READWRITE|\n\n\n-----\n\n|44|PROCINJ_ PERMS|SHORT|Final permissions for injected content.|PAGE_EXECUTE_READWRITE|\n|---|---|---|---|---|\n|45|PROCINJ_MI- NALLOC|INT|Minimum amount of memory to request for injected content.|17500|\n|46|PROCINJ_ TRANSFORM_ X86|STRING|Transform x86 inject- ed content.|Prepend: b’\\x90\\x90’|\n|47|PROCINJ_ TRANSFORM_ X64|STRING|Transform x64 inject- ed content.|Prepend: b’\\x90\\x90’|\n|48|DEPRECAT- ED_PROCINJ_ ALLOWED|SHORT|Replaced by PRO- CINJ_EXECUTE.|5, 7|\n|49|BIND_HOST|SHORT|Bind to 0.0.0.0 or local- host (applies to Bind Beacon only).|0, 1|\n|50|USES_COOK- IES|SHORT|Store transformed metadata into HTTP header Cookie.|0, 1|\n|51|PROCINJ_EX- ECUTE|STRING|Windows APIs used in process injection to a remote process.|CreateThread SetThreadContext CreateRemoteThread RtlCreateUserThread NtQueueApcThread-s NtQueueApcThread|\n|52|PROCINJ_AL- LOCMETHOD|SHORT|Allocation method/ API used by Reflective- Loader.|VirtualAllocEx, NtMapViewOfSection|\n|53|PROCINJ_ STUB|STRING|MD5 hash of the cobaltstrike.jar Team Server JAR archive.|b2736f1cbba90d42286fc42bfba74f4d|\n|54|HOST_HEAD- ER|STRING|Host header value in HTTP communica- tions.|Host: 8.8.8.8|\n|55|EXIT_FUNK|SHORT|If set, sleep indefinite- ly instead of calling ExitThread. Only used if CFG_CAU- TION is also set.|0, 1|\n|56|SSH_BANNER|STRING|SSH Banner.|-|\n\n\n-----\n\n|57|SMB_FRAME_ HEADER|STRING|Header to prepend to SMB messages.|Prepend: b’\\x04’ Prepend: b’\\x05\\x80’ Prepend: b’\\x07\\x80\\x80\\x80’|\n|---|---|---|---|---|\n|58|TCP_FRAME_ HEADER|STRING|Header to prepend to TCP messages.|Prepend: b’\\x04’ Prepend: b’\\x05\\x80’|\n|59|HEADERS_TO_ REMOVE|STRING|List of HTTP client headers to remove from Beacon C2.|-|\n|60|DNS_BEA- CONING|STRING|DNS subhost prefix for beaconing requests.|-|\n|61|DNS_GET_A_ RECORD|STRING|DNS subhost prefix for A record requests.|cdn., …|\n|62|DNS_GET_ AAAA_RE- CORD|STRING|DNS subhost prefix for AAAA record requests.|www6., …|\n|63|DNS_GET_ TXT_RECORD|STRING|DNS subhost prefix for TXT record requests.|api., …|\n|64|DNS_PUT_ METADATA|STRING|DNS subhost prefix for metadata record requests.|www[.], …|\n|65|DNS_PUT_ OUTPUT|STRING|DNS subhost prefix for PUT record requests.|post., …|\n|66|DNS_RESOLV- ER|STRING|List of IP addresses for the DNS resolver to use for egress.|1.1.1.1 8.8.8.8 …|\n|67|DNS_STRAT- EGY|SHORT|Behavior for choosing which host to use for egress.|round-robin random failover duration|\n|68|DNS_STRATE- GY_ROTATE_ SECONDS|INIT|Duration to use each host before using the next host.|-1|\n|69|DNS_STRATE- GY_FAIL_X|INT|Failover retry count.|-1|\n|70|DNS_STRATE- GY_FAIL_SEC- ONDS|INT|Failover retry timeout.|-1|\n\n\n_Table 2 – Cobalt Strike Beacon configuration structure showing common default values_\n\n\n-----\n\n##### detecting the beacon configuration with yara\n\nThe following YARA rule can be used to detect the XOR encoded configuration used by Cobalt Strike\nBeacon stagers based on commonly observed values. The rule is optimized to first check for one of the\ncommon XOR encoded configuration headers in the .data section, before checking the .data section for\nvarious XOR encoded strings commonly found in Beacon profiles.\n\n_Figure 32 – YARA rule for detecting Cobalt Strike Beacon XOR encoded configurations in PE files_\n\nThe rule will detect more than 99.9% of the Beacons DLL payloads we’ve encountered. It typically only\nfails on payloads that have been manually reconfigured to use non-standard XOR keys or those that use\na very sparse configuration.\n\n\n-----\n\n### chapter four\n\n## WE CAN’T STOP HERE, THIS IS BEACON COUNTRY\n\nArmed with a dataset comprising information from over 6,000 Team Servers, as well as the configuration and\nPE stager data from nearly 48,000 Beacons, we can begin to perform the analysis phase of the CTI lifecycle.\nThe initial analysis we performed on the dataset focused on clustering information based on several unique\nindicators. This clustering can help us spot patterns regarding a variety of different features such as:\n\n      - Common configuration settings\n\n      - Compilation timestamps\n\n      - Popular Team Server IP addresses\n\n      - ASNs used for hosting\n\n      - Ports used for serving Beacons\n\n      - Domains used for fronting\n\n      - Watermark values\n\n      - Process injection and memory allocation techniques\n\nThese insights can prove invaluable for fine-tuning the alerting capabilities of XDR products and services.\nThey can also help you to build profiles on new threat actors and correlate intelligence about known groups\nand campaigns.\n\nDuring the manual analysis phase, we also made several previously undocumented discoveries concerning\nBeacon configuration settings that can be particularly useful for tracking and monitoring threat groups.\nLet’s delve more closely into the Malleable C2, post exploitation, and stager settings to see what insights\nwe can glean from such a comprehensive dataset of Beacons.\n\n##### constellating\n\nAnalyzing Beacon configuration data can give great insight into the various Cobalt Strike configuration\npossibilities and the frequency with which each configuration value occurs. As mentioned, this data is\nexcellent for the tuning of security products. It can also be hugely beneficial in a SOC environment to\naugment and improve upon existing incident alerting and detection mechanisms.\n\nTo further enhance our clustering capabilities, we can perform some deep visual analysis of the configuration data. This can help us see patterns that are only visible when we have access to a lot of data. For\nexample, simply by extracting and correlating the C2SERVER setting, we can see clusters of Cobalt Strike\nnetworks emerge that would not ordinarily be apparent. We colloquially refer to these as “constellations”\ndue to their resemblance to stars in the night sky.\n\n\n-----\n\n_Figure 33 – Clustering Infrastructure based on the extracted C2SERVER setting_\n\nIn the visualization above, each luminous speck (or star in a constellation!) is an IP or domain that has\neither served a Beacon or is acting as a C2 server for a Beacon. To create the connections between\nnodes, we track the IP or domain that has served a particular Beacon and then link it to the infrastructure dictated by the C2SERVER setting.\n\nWhen we create connections within a larger dataset, we can start to see clear patterns emerge. Infrastructure that seemed disparate begins to form relationships, or it will overlap with known infrastructure\nfrom threat groups and active campaigns. This also aids attribution, as we only need to identify “a single\nstar in the night sky” (via an IP address or confi guration setting) to map the entire constellation (that is\nto say, a threat group).\n\nFinally, it is worth noting that some of the largest clusters are likely due to custom Network Address\nTranslation (NAT) or routing confi gurations, rather than being a cluster of individual Cobalt Strike Team\nServers, making some of the constellations appear larger than they might be in reality.\n\n##### networking\n\nThe information gained through scraping the Internet for Beacons helps to paint a clearer picture of the\nCobalt Strike topography. This includes a variety of features, from popular hosting netblocks and Autonomous System Numbers (ASNs), to common ports, domain fronting and default certifi cates.\n\nLet’s dive in and take a look at some of the most common networking trends.\n\n\n-----\n\n##### netblocks\n\nLooking at the ASNs for the 6,000+ Team Server IP addresses in our dataset, we can easily determine\nwhich netblocks are primarily responsible for Team Server deployments:\n\n_Figure 34 – Top 10 Team Server ASNs since March 2021_\n\nThis reveals an interesting trend: Threat actors are increasingly likely to use legitimate cloud providers\nfor hosting. This allows the malware operators to conceal their traffi c from monitoring systems, which\nmakes the task of automated blocking trickier. This is especially problematic because several large and\nreputable companies are fi rmly in the top 20 list of providers:\n\n|ASN|Country|\n|---|---|\n|CNNIC-ALIBABA-CN-NET-AP Hangzhou Alibaba Advertising Co., Ltd.|CN|\n|CNNIC-TENCENT-NET-AP Shenzhen Tencent Computer Systems Company Limited|CN|\n|AS-CHOOPA|US|\n|CLAYERLIMITED-AS-AP Clayer Limited|HK|\n|POWERLINE-AS-AP POWER LINE DATACENTER|HK|\n|AMAZON-02|US|\n|DIGITALOCEAN-ASN|US|\n|CNNIC-ALIBABA-US-NET-AP Alibaba US Technology Co., Ltd.|CN|\n|IT7NET|CA|\n|HOSTKEY-AS|NL|\n|ASSEFLOW Amsterdam Internet Exchange AMS-IX|IT|\n\n\n-----\n\n|BCPL-SG BGPNET Global ASN|SG|\n|---|---|\n|GOOGLE|US|\n|PINDC-AS|RU|\n|ASN-QUADRANET-GLOBAL|US|\n|ITLDC-NL|UA|\n|AS-COLOCROSSING|US|\n|SELECTEL-MSK|RU|\n|XIAOZHIYUN1-AS-AP ICIDC NETWORK|US|\n|UCLOUD-HK-AS-AP UCLOUD INFORMATION TECHNOLOGY HK LIMITED|HK|\n\n\n_Table 3 – Popular ASNs_\n\nThe popularity of individual netblocks hosting Cobalt Strike Team Server is perhaps most helpful for\nalerting and monitoring purposes. Often, Team Server is hosted on an IP range used solely for nefarious\npurposes, and these ranges can be blocked directly by security software and appliances, as well as used\nto conduct further hunting, monitoring and alert correlation:\n\n_Figure 35 – Top 10 netblocks hosting Team Sever since January 2021_\n\n\n-----\n\nWe can see which countries have been responsible for hosting most of the Cobalt Strike servers over\nthe past eight months by performing an IP geolocation lookup for each of the Team Server IP addresses\nin our dataset and correlating them with last seen date:\n\n_Figure 36 – Top 10 countries hosting Team Severs since January 2021_\n\n##### ports:\n\nCobalt Strike Beacons are typically served on standard HTTP/S ports. Over two-thirds of Team Servers\nare confi gured to serve Beacons using ports 80, 443, and 8080:\n\n_Figure 37 – Top 25 Team Server ports serving Beacon payloads_\n\n\n-----\n\nThis information can prove useful in the automation phase, especially when presented with a suspected\nTeam Server IP address with no port information (this is a fairly common occurrence when scraping\nblogs and OSINT sources). In this instance, it is at least possible to try knocking on the top 25 common\nports to see if the Team Server can be pillaged for Beacons. Nearly 90% of the time this results in success.\n\n##### certificates\n\nAs mentioned, for Beacons served over HTTPS, the attackers will confi gure an SSL certifi cate that the\nTeam Server uses to perform encryption. SSL certifi cates are often reused across network infrastructure, and this can provide a reliable means of grouping Beacons for hunting, alerting, and investigative\npurposes.\n\nAlthough not frequently supplied, common certifi cate names from across our dataset include:\n\n_Figure 38 – Top 10 SSL certifi cate names_\n\n\n-----\n\nDelving deeper, one particular SSL certifi cate, with a serial number of 146473198, is especially widespread and used to serve 11% of all Beacons in our dataset. Searching for the certifi cate serial number\non Shodan uncovers a further 677 IP addresses (not all active) using this “default”, Cobalt Strike-affi liated HTTPS certifi cate:\n\n_Figure 39 – Default Cobalt Strike SSL certifi cate_\n\nBased on historical IP analysis, this SSL certifi cate has been associated with at least 9,000 Cobalt Strike\nTeam Server deployments over time. Why anyone deploying Team Server – whether they’re a red-teamer or threat actor – would use the default certifi cate is somewhat of a mystery. It is easy to detect and,\nas we’ve already demonstrated, this can be a very powerful mechanism for discovering active Team\nServers on the Internet.\n\nFinally, the top 10 certifi cates from our dataset were used to serve over 12% of all Beacons, but the\ndefault is by far the most widespread:\n\n\n-----\n\n_Figure 40 - Top 10 certifi cate serials_\n\n##### configuration\n\nThe following sections will focus on the confi guration data contained within Beacon payloads. We will\nbe honing in on many of the options that are specifi ed by the attackers via Malleable C2 profi les, as\nwell as some of the lesser-known options (such as SSL public keys and stager options) that have been\nrecovered from Beacon PE fi les.\n\nBy performing further analysis of our Beacon dataset, it was possible to fi nd the various profi les used\nto confi gure Beacons. To do this, we fi rst obtained as many Malleable C2 profi les as we could get our\nhands on. Then we built an add-on for our automation system that checks for similarities with various\nconfi guration values within Beacon payloads.\n\nBy using an algorithm called “hamming distance,” it is possible to compare two strings and determine\nhow many times someone would need to edit them (or make substitutions) to make the strings identical. The resulting number of edits or substitutions is called the “edit distance.”\n\nBased on that computed edit distance, we can then decide how similar to known profi les the HTTP and\nGET request metadata is, and whether the metadata has been modifi ed from the base profi le. This can\nbe yet another helpful approach for tracking threat actors.\n\nIn addition, values from the “stage” section of the Malleable C2 profi le (such as the compile time and rich\nheader) are compared to those in the Beacon PE fi les we’ve obtained, to determine if a known stager\nprofi le was used. This is worth checking closely, as it is entirely possible for threat actors to mix and\nmatch confi g blocks. And again, this can be a useful indicator for campaign tracking purposes.\n\nAcross our dataset, we’ve observed the following profi les, based on HTTP GET/POST metadata and\nstager compile times and rich headers:\n\n\n-----\n\n_Common Malleable Profi le Confi guration Values_\n\n_Figure 41 - Profi les by HTTP GET request metadata:_\n\n_Figure 42 - Profi les by stager compile time:_\n\n\n-----\n\n_Figure 43 - Profi les by HTTP POST request meta:_\n\n_Figure 44 - Profi les by stager rich header:_\n\n\n-----\n\n##### watermark\n\nEach Cobalt Strike build is shipped with a watermark value that is unique per customer/license. In theory, this should offer the perfect mechanism for tracking threat actors who deploy Cobalt Strike Team\nServers in the wild.\n\nUnfortunately, the watermark value is easily spoofed, and there are many trial, cracked, and leaked copies of Cobalt Strike that are easy to acquire. This means that the watermark value can often be a poor\nchoice for performing attribution or classification of major threat groups.\n\nOn the other hand, this watermark can be useful for tracking red teams. Legitimate penetration testers\nhave less incentive to go to extra lengths to obfuscate their Beacon payloads or to perform advanced\nnetwork operational security (OPSEC) for their Team Server deployments. Therefore, watermark values\nwith a lower frequency tend to be more indicative of red team activity.\n\nBelow is the breakdown of the most common watermark values observed in our dataset:\n\n_Figure 45 – Common watermarks_\n\nWe have tried our best, given the opportunities for spoofing and reuse, to map watermark values to\nknown threat actor groups. However, because so many of these groups use the same build (either\naccidentally or on purpose), it highlights how ineffective it can be to cluster around watermarks alone:\n\n|Decimal|Hex|Status|Threat Actor|\n|---|---|---|---|\n|0|0|Trial/Leaked/Spoofed|Many|\n|305419896|12345678|Leaked|Ryuk TrickBot Maze EvilCorp Pyxie APT41|\n|452436291|1AF7A143|Custom|REvil/Sodin/Sodinokibi|\n\n\n-----\n\n|3|3|Spoofed|Cobalt Group|\n|---|---|---|---|\n|1580103814|5E2E7886|Leaked|APT27 Qbot IcedID DarkSide Conti Hancitor WizardSpider|\n|1359593325|5109BF6D|Leaked|TrickBot/SmokeLoader Nobelium/APT29|\n|1873433027|6FAA51C3|Leaked|TA511/Hancitor|\n|849087011|329C0A23|Custom|SolarStorm|\n|1|1|Spoofed|Finspy|\n|892810033|35373331|Custom|Teardrop/SolarStorm|\n|16777216|1000000|Spoofed|Ryuk|\n\n\n_Table 4 – Known Cobalt Strike watermarks_\n\n##### ssl public keys\n\nAside from SSL certificates deployed on the Team Server itself, Beacons are also bundled with an additional SSL public key. This is part of a public/private key pair that is generated on the server whenever\nsomeone installs Cobalt Strike. The public key is subsequently embedded in all Beacons generated on\nthe same server and used for C2 check-ins. It is important to note that this key pair is entirely different\nfrom the SSL key pair used for the HTTPS certificate on the Team Sever.\n\nUnlike watermarks, the SSL public key stored within a Beacon’s configuration offers a fantastic means\nof clustering Beacons. We can virtually guarantee that the key is unique per Team Server installation,\nbut they often do get reused, for example via virtual machine redeployments. In other instances, threat\nactors will use a single Team Server to configure payloads for deployment from other servers within\ntheir control. This allows us to easily spot, then subsequently track and monitor their infrastructure.\nOverall, 37% of Beacons are supplied with the top five SSL public keys. Several of the most popular keys\nbelong to notorious threat groups.\n\n\n-----\n\n_Figure 46 –Top 10 SSL public key MD5s since January 2021_\n\nWhen you’re presented with a Beacon IP that is gathered from an IR engagement, or harvested from\nOSINT feeds, it is usually possible to locate several more Beacons sharing the same SSL public key. This\ncan yield further IP addresses and intelligence pertaining to infrastructure that might otherwise seem\nto be unrelated.\n\nWe have found that leveraging this clustering technique has been very helpful for us in expanding our\nintelligence of C2 infrastructure. It helped us fi nd the connections between a wide range of actors and\ncampaigns, both active and historical. It can also help you to build a high level of confi dence in your own\nintelligence assessments.\n\nSeveral popular SSL public keys used by known threat groups include:\n\n**MD5** **Count of** **Group**\n**Beacons**\n\n1186914578623be126e5f3e8c058d719 1412 MAN1\n\n8ac540617dddcdf575f6dc207abb7344 1318 DoppelPaymer\n\nf61884abc8f4ba7a0caa288b326a70ee 621 Kegtap\n\n0ce7b6482c1f24e42f2935f5026d338d 257 TA575/Dridex\n\nb3e6b9dd84dae6be68cb40cda4366b77 23 APT41\n\n_Table 5 – Popular SSL public keys from Beacon confi gs_\n\n|MD5|Count of Beacons|Group|\n|---|---|---|\n|1186914578623be126e5f3e8c058d719|1412|MAN1|\n|8ac540617dddcdf575f6dc207abb7344|1318|DoppelPaymer|\n|f61884abc8f4ba7a0caa288b326a70ee|621|Kegtap|\n|0ce7b6482c1f24e42f2935f5026d338d|257|TA575/Dridex|\n|b3e6b9dd84dae6be68cb40cda4366b77|23|APT41|\n\n\n-----\n\n_Figure 47 –Top 10 SSL public key MD5s_\n\nThe vast majority of SSL public keys extracted from confi gurations cluster with one or more Beacons\nfrom our dataset. Again, this further highlights the great potential for clustering and tracking.\n\n##### beacon type\n\nIf you look at the most common communications protocols employed by the Beacons we’ve seen hosted on the Internet – plus some others we’ve obtained through other channels such as IRs and hunting\n– you’ll see no huge surprises:\n\n_Figure 48 – Common Beacon types_\n\n\n-----\n\nAs expected, HTTP is by far the most common protocol (93%). The next most common are HTTPS\n(3.9%), and a hybrid mixture of HTTP and DNS (2.2%). This leaves SMB, TCP, and Bind TCP Beacons,\nwhich combined account for less than 0.1% of all payloads.\n\nSMB Beacons are almost certainly underrepresented in our dataset, as they tend to be more commonly\nstaged within local networks for further lateral movement, and not publicly hosted on the Internet.\nAs a result, the bulk of the SMB stagers in our dataset came from incident response investigations and\nonline malware repositories.\n\nThe full list of beacon types supported by Team Server is as follows:\n\n**Type** **Description**\n\nwindows/beacon_http/reverse_http HTTP\n\nwindows/beacon_https/reverse_https HTTPS\n\nwindows/beacon_dns/reverse_dns_txt DNS\n\nwindows/beacon_bind_pipe SMB\n\nwindows/beacon_bind_tcp TCP\n\nwindows/beacon_reverse_tcp Winsock 2 Pivot\n\nwindows/beacon_extc2 External C2\n\nwindows/foreign/reverse_http Foreign HTTP\n\nwindows/foreign/reverse_https Foreign HTTPS\n\n_Table 6 - Types of Cobalt Strike Beacon_\n\n##### C2SERVER\n\nA closer inspection of the C2SERVER configuration values is quite revealing. It shows us that attackers\nincreasingly prefer to use domain fronting. This is a technique that allows an attacker to route Beacon\nC2 traffic via reputable third-party redirectors, in a way that typically makes use of highly trusted Content Delivery Networks (CDNs). The traffic is encrypted over HTTPS, and it is often indiscernible from\nlegitimate communications.\n\n|Type|Description|\n|---|---|\n|windows/beacon_http/reverse_http|HTTP|\n|windows/beacon_https/reverse_https|HTTPS|\n|windows/beacon_dns/reverse_dns_txt|DNS|\n|windows/beacon_bind_pipe|SMB|\n|windows/beacon_bind_tcp|TCP|\n|windows/beacon_reverse_tcp|Winsock 2 Pivot|\n|windows/beacon_extc2|External C2|\n|windows/foreign/reverse_http|Foreign HTTP|\n|windows/foreign/reverse_https|Foreign HTTPS|\n\n\n-----\n\n_Figure 49 – Popular fronting domains since January 2021_\n\nApproximately 3.5% of all Beacons in our dataset were confi gured to use domain fronting. The bulk of\nBeacons are confi gured to use either Softline or Tencent. AWS, CloudFront® and Microsoft® Azure®\nare also popular reputable redirectors favored by threat actors, with Google services previously being\ntargeted, as reported by Domain Tools.\n\n\n**DomainTools**\n_COVID-19 Phishing With a Side of Cobalt Strike_\nhttps://www.domaintools.com/resources/blog/covid-19-phishing-with-a-side-of-cobalt-strike\n\n\nBeacons confi gured to operate using domain fronting may be considerably harder for SOC analysts and\nincident responders to identify. Because the network traffi c appears to be legitimate, these Beacons\ntend to lack obvious network-based IOCs, making detection of Beacon traffi c at the network perimeter\nmore challenging for defenders.\n\n\n**Cobalt Strike**\n_High-reputation Redirectors and Domain Fronting_\nhttps://blog.cobaltstrike.com/2017/02/06/high-reputation-redirectors-and-domain-fronting/\n\n\n-----\n\n##### http\n\nFor HTTP-based communications, each Beacon is confi gured with a user-agent string that is used to\nform part of the HTTP request headers sent to the Team Server. The user-agent strings are nearly\nalways “spoofed,” with the default option used to specify a randomly selected Internet Explorer 11 user-agent. It is important to note that it’s possible to specify alternatives via Malleable C2 profi les.\n\nIn many cases, the user-agent strings are not especially common. When combined with other indicators,\nthey can occasionally be useful in spotting suspicious activity via network monitoring tools. For example, a macOS® X user-agent string originating from a Windows-based host, or Firefox® in a Chrome™\nenvironment.\n\nLooking at our dataset, we observed slightly more than 300 unique user-agent strings, with just over half\nof them being used 10 or more times:\n\n_Figure 50 – Frequency of the top 10 user-agent strings_\n\nThe SUBMITURI confi guration option specifi es the URI path to use when sending HTTP requests. Despite over 300 URIs being specifi ed across our Beacon confi g dataset, the default path (/submit.php)\nwas by far the most popular.\n\n\n-----\n\nGET and POST request metadata can also be specifi ed. This is where attackers can really get creative in\nsupplying additional HTTP headers as part of Cobalt Strike’s Malleable C2 confi guration. The vast majority of the headers are taken from public profi le repositories. However, there are several bespoke profi les\nin use as well. These can often be used to attribute Beacons to particular threat actors or campaigns\nwith a high degree of confi dence.\n\n\n**GitHub**\n_rsmudge - Malleable C2 Profi les_\nhttps://github.com/rsmudge/Malleable-C2-Profi les\n\n\nUnsurprisingly, the default profi le is the most prominent, with just shy of 80% of Beacons specifying\nnothing more than “Cookie” in the HTTP GET request metadata. A further 3.2% of Beacons use an\nunmodifi ed amazon.profi le. The remaining profi les each account for less than 1% of the total set of\nBeacons.\n\n_Figure 52 – Prevalence of open-source Malleable C2 profi les_\n\nThe host header used in HTTP GET and POST requests is also confi gurable as part of the Malleable C2\nprofi le. As with many settings, the values are often spoofed, and they differ from the actual hostname\nthat the Team Server IP will resolve to. This can be a semi-reliable method for detecting Beacon network traffi c, as well as for detecting domain fronting, where the host header is different from that of the\n_C2SERVER setting._\n\n\n-----\n\n_Figure 53 – “Common” HTTP hostnames_\n\n##### proxy\n\nCobalt Strike Beacon can be manually confi gured to operate via a proxy server, although it doesn’t seem\nto be a particularly popular option. Less than 0.05% of the samples from our dataset were confi gured\nto do so using a username/password. A further 0.3% of samples were confi gured to use a direct connection to the Internet (without a proxy), while the remainder of the samples will use the default IE proxy\nsettings.\n\nThe following proxy URIs were uncovered from our dataset:\n\n_Figure 54 – Common proxy IP addresses_\n\n\n-----\n\n_Figure 55 – Proxy behavior_\n\nIt seems likely that most Beacons confi gured to use a proxy server are deployed by red teams. Threat\ngroups tend to use other proxying and tunnelling mechanisms for routing their C2 traffi c, such as\nSOCKS5 proxies and SSL port forwarding.\n\n##### smb\n\nSMB Beacons (windows/beacon_smb) use an SMB pipe name embedded within the Beacon confi guration in order to enable C2 communication with a named pipe server using the Windows SMB protocol.\n\n\n**Cobalt Strike**\n_SMB Beacon_\nhttps://www.cobaltstrike.com/help-smb-beacon\n\n\n-----\n\nThe following list of SMB pipe names should be viewed with a soupçon of distrust, as most of them\nhave been harvested from Beacons that were served by Team Servers that were hosted on the Internet.\nThis is not typically how SMB Beacons are deployed. They are typically distributed via shellcode stagers\ninstead and are used to perform further lateral movement within a compromised network. Therefore,\nthe results from our dataset certainly do not convey the full picture, with only 2.7% of Beacons containing pipe names:\n\n_Figure 56 – Common SMB pipe names_\n\nOther common pipe names frequently employed by Beacons that we’ve encountered elsewhere include\n(where # represents a random base 10 digit):\n\n|Pipe name|Prof ile|\n|---|---|\n|\\\\.\\pipe\\MSSE-###-server|Default|\n|\\\\.\\pipe\\msagent_##|Default (SMB)|\n|\\\\.\\pipe\\status_##|Default|\n|\\\\.\\pipe\\postex_####|Default|\n|\\\\.\\pipe\\mypipe-h##|havex.prof ile|\n|\\\\.\\pipe\\mypipe-f##|havex.prof ile|\n|\\\\.\\pipe\\interprocess_##|gmail.prof ile|\n|\\\\.\\pipe\\ntsvcs|Many|\n|\\\\.\\pipe\\scerpc|Many|\n|\\\\.\\pipe\\DserNamePipe##|Many|\n|\\\\.\\pipe\\PGMessagePipe##|Many|\n|\\\\.\\pipe\\MsFteWds##|Many|\n\n\n-----\n\n|\\\\.\\pipe\\f4c3##|zillow.profile|\n|---|---|\n|\\\\.\\pipe\\f53f##|zillow.profile|\n|\\\\.\\pipe\\mojo.5688.8052.183894939787088877##|jQuery profiles|\n|\\\\.\\pipe\\Common|jQuery profiles|\n|\\\\.\\pipe\\named|jQuery profiles|\n|\\\\.\\pipe\\pipe|jQuery profiles|\n|\\\\.\\pipe\\windows.update.manager##|windows-updates.profile|\n|\\\\.\\pipe\\windows.update.manager###|windows-updates.profile|\n|\\\\.\\pipe\\Winsock2\\CatalogChangeListener-###-0,|jquery-c2.4.2.profile|\n|\\\\.\\pipe\\browser_##|malleable-c2-randomizer.py|\n|\\\\.\\pipe\\comnode_##|malleable-c2-randomizer.py|\n|\\\\.\\pipe\\spoolss_##|malleable-c2-randomizer.py|\n|\\\\.\\pipe\\llsrpc_##|malleable-c2-randomizer.py|\n|\\\\.\\pipe\\comnap_##|malleable-c2-randomizer.py|\n\n\n_Table 7 – SMB pipe names from profiles_\n\nThese pipe names can be useful for alerting and blocking in EDR solutions. They can also be helpful in\ndigital forensic investigations involving in-memory Cobalt Strike payloads.\n\n##### dns\n\nIn April 2021, F-Secure published research into Cobalt Strike DNS redirectors, where they presented\nmethods for fingerprinting Team Servers based on DNS responses.\n\n**F-Secure**\n_Detecting Exposed Cobalt Strike DNS Redirectors_\nhttps://labs.f-secure.com/blog/detecting-exposed-cobalt-strike-dns-redirectors/\n\n\nWe can see from the configuration dataset that 68% of Beacons are configured to use 0.0.0.0 as the\nDNS idle IP. As mentioned by F-Secure’s researchers, the 0.0.0.0 DNS idle value is the default, and should\nnot be used in production environments. As a result, we can probe DNS servers for 0.0.0.0 responses\nin A records, which can be used as another reliable mechanism for identifying Team Severs in the wild.\n\nWith approximately 25% of Beacons specifying no DNS idle value at all, the remaining 7% of Beacons\nare often configured to use DNS from major providers, including:\n\n    - 8.8.4.4 (Google)\n\n    - 8.8.8.8 (Google)\n\n    - 114.114.114.114 (China Telecom)\n\n    - 1.1.1.1 (CloudFlare)\n\n\n-----\n\n_Figure 57 – DNS idle IP addresses_\n\nThis information can be helpful for monitoring DNS requests at network egress points for signs of\nBeacon DNS activity, as well as during forensic investigations involving DNS C2 traffi c from in-memory\npayloads.\n\n##### injection\n\nThe SPAWNTO option is used to confi gure the target process that Cobalt Strike will spawn and inject\npost-exploitation DLL payloads into (in response to certain commands, such as screenshot, keylogger\nand hashdump). Different target processes are specifi ed depending on processor architecture (x86/\nx64), although the default process, rundll32.exe, is by far the most popular:\n\n_Figure 58 – Popular x86 SPAWNTO processes_\n\n\n-----\n\nThe list of target injection processes for x64 is largely identical to x86, apart from the differences in the\nfully qualifi ed fi le paths:\n\n_Figure 59 – Popular x64 SPAWNTO processes_\n\nCombining the fi le names used for both the x86 and x64 SPAWNTO values provides a full overview of the\nprocesses most frequently targeted for injection. This helps us to narrow the focus for tuning security\nsoftware and forensic analysis:\n\n|Process Name|Percentage|\n|---|---|\n|rundll32.exe|94.53%|\n|gpupdate.exe|2.11%|\n|dllhost.exe|0.80%|\n|svchost.exe -k netsvcs|0.36%|\n|wusa.exe|0.32%|\n|mstsc.exe|0.28%|\n|WerFault.exe|0.25%|\n|mavinject.exe|0.13%|\n|openf iles.exe|0.11%|\n|explorer.exe|0.09%|\n|iexplore.exe|0.09%|\n\n\n-----\n\nAs explored earlier, Cobalt Strike’s method of process injection is highly confi gurable via the Malleable\npost exploitation settings, with the most popular methods/APIs used to execute shellcode being:\n\n_Figure 60 – Injection execution techniques_\n\nWhen allocating memory for the shellcode payload, the Windows API VirtualAllocEx is most commonly\nused, although around 3% of Beacons will use NtMapViewOfSection with a fi le mapping instead.\n\n_Figure 61 – Frequency of allocation techniques_\n\nHowever, roughly 5% of Beacons are confi gured to use transformations. These will append/prepend\nadditional code (typically a simple NOP sled, although sometimes it will be something more\n\n\n-----\n\nadventurous) to the injection shellcode stub to prevent detection. It is also possible to remove the write\nfl ag from the page protections, so it is important to note that in the end not all Beacon payloads will\nnecessarily reside in RWX memory (4%).\n\n_Figure 62 – Common process injection transformations (x86)_\n\n_Figure 63 – Frequency of memory protection fl ags_\n\n##### compilation timestamps\n\nThere is some advantage in knowing the compilation date/timestamps of Cobalt Strike Beacons, even\nthough they are often spoofed via the stager confi guration, or simply zeroed out (which accounts for\nnearly 3.5% of Beacons). When the value is left unmodifi ed, it can provide a quick and simple way for\nresearchers to determine the version of Beacon/Team Server in operation:\n\n\n-----\n\n|Release Date|Version|Timestamps|\n|---|---|---|\n|8 December 2016|3.6|2016-12-07T21:14:47 2016-12-07T21:25:22|\n|23 May 2017|3.8|2017-05-22T21:21:18 2017-05-22T21:21:47|\n|26 September 2017|3.9|2017-10-26T04:32:19|\n|9 April 2018|3.11|2018-03-22T20:35:00 2018-03-22T20:35:11 2018-03-22T20:35:14|\n|6 September 2018|3.12|2018-09-05T21:53:17 2018-09-05T21:54:00|\n|4 May 2019|3.14|2019-04-18T23:51:29 2019-04-18T23:53:25|\n|5 December 2019|4.0|2019-12-05T12:00:49 2019-12-05T12:01:49|\n|22 February 2020|4.0|2020-02-21T04:55:08|\n|25 June 2020|4.1|2020-06-23T19:17:48 2020-06-23T19:18:44 2020-06-23T19:21:26|\n|6 November 2020|4.2|2020-11-03T01:27:30 2020-11-03T01:31:35|\n|3 March 2021|4.3|2021-03-02T08:03:15 2021-03-09T16:42:17|\n|17 March 2021|4.3|2021-03-16T17:37:35 2021-03-16T06:10:34|\n\n\n_Table 9 – Cobalt Strike Beacon compilation timestamps_\n\nAs we can see from our dataset, of the beacons that have their timestamps unmodified, over 40% of\nBeacons are version 4.0. Version 4.2 is gaining in popularity at 14%, which is just slightly above version\n4.1 at 13%. Version 4.3 is slowly gaining traction at around 6% usage. The use of version 3.x Beacons\nhas tailed off quite dramatically in recent months.\n\n\n-----\n\n_Figure 64 – Top 10 compilation timestamps_\n\nWhen specifi ed via the stager confi guration, the compilation timestamp can be most revealing due to a\ntime zone conversion bug in Team Server.\n\nThe server appears to interpret the compile_time confi guration value as a local time before converting\nit to UTC for storing in the Beacon PE header. The result is that any Beacon built using a compile_time\nvalue specifi ed in the stager confi guration will leak the time zone offset of the server. This gives us yet\nmore forensically sound evidence that we can use to correlate with incident events and IP geolocations\nto try and pinpoint the location of attackers.\n\n\n-----\n\n_Figure 65 –Stager time zone offsets and their respective frequencies_\n\n##### rich headers\n\nThe rich header, or signature, is embedded within the DOS stub of a PE fi le. It contains information\npertaining to the executable linker, including the count of various sources and the version of the tools\nused to compile them. For example, here is a typical rich header from a Beacon DLL viewed in PE Tree.\nThe header indicates that Visual Studio® 2012 was used to compile and link 53 object fi les and a single\nexported function:\n\n_Figure 66 – DOS stub and rich header from a Beacon PE fi le_\n\n\n-----\n\nThe top 12 rich headers observed in our set of Beacon PE files account for nearly 90% of all payloads:\n\n_Figure 67 – Top 12 rich header MD5s_\n\nThe rich headers can be specified via the stager profile settings, or simply left unaltered in the original\nBeacon PE files. For this reason, they can provide malware researchers with a semi-reliable mechanism\nfor hunting, clustering and classifying Beacon payloads within malware datasets. They can also provide\nforensic investigators with helpful signatures for finding in-memory payloads.\n\n\n**GitHub**\n_PE Tree_\nhttps://github.com/blackberry/pe_tree\n\n\n##### import hashes\n\nAn import hash, commonly known as an “imphash,” is a checksum that is calculated from the DLL\nand function names that are present in a PE file’s import descriptor. Often unique per malware family/\nvariant, imphashing can be an excellent technique for clustering malicious PE files based on similarity.\n\n\n-----\n\n_Figure 68 – Import descriptor showing wininet.dll imports from a Beacon PE file_\n\nFrom our Beacon dataset, we can see that the top 12 import hashes calculated from Beacon DLL files\nbelong to just over 90% of all payloads:\n\n_Figure 69 – Top 12 import hashes_\n\nAgain, much like the rich header, knowing Cobalt Strike’s associated imphashes can be a useful tool for\nmalware analysts and researchers with respect to hunting, clustering and classifying Beacons.\n\n\n-----\n\n##### export names\n\nThe exported module and function name within a Beacon PE file are referenced by the export descriptor.\nThis contains either the default Beacon DLL name (beacon.dll or beacon_x64.dll) and exported function\nname (ReflectiveLoader@1), or values specified by the attacker via a transform block in the “stage”\nsection of the Malleable profile.\n\nContaining just a solitary exported function, the export descriptor for an x86 Beacon DLL typically looks\nlike this:\n\n_Figure 70 – Export descriptor from a Beacon PE file_\n\nNote time TimeDateStamp in the IMAGE_EXPORT_DESCRIPTOR. This is often overlooked when adversaries perform time-stomping of the TimeDateStamp in the PE file header, especially in Beacon DLLs.\nThe net result is that the original compilation time is often still in the export descriptor, even if it has\nbeen overwritten in the PE headers. In this instance the TimeDateStamp is known to belong to Cobalt\nStrike version 4.0\n\nIn total, the top 13 exported module names from across our dataset account for nearly 97% of all Beacon PE files we’ve obtained:\n\n\n-----\n\n_Figure 71 – Top 10 exported module names_\n\nFurther default module names observed in the wild include:\n\n    - pivot.dll\n\n    - pivot.x64.dll\n\n    - dnsb.dll\n\n    - dnsb.x64.dll\n\nThis knowledge can aid in the tuning of security solutions as well as assisting forensic investigators\nwhen inspecting in-memory Beacon payloads.\n\n##### procinj_stub\n\nSurprisingly, it just so happens that the configuration setting _PROCINJ_STUB is somewhat of a mis-_\nnomer. This setting has absolutely nothing to do with process injection or shellcode stubs. In fact, this\nunintuitively named configuration value actually contains an MD5 hash of the Cobalt Strike Java archive\n(cobaltstrike.jar). This archive contains the server-side component that provides the Team Server operators with a GUI to generate, operate, deploy, and control Beacon payloads.\n\nWhen correlated with its corresponding Java archive commonly found in online malware repositories,\nsuch as VirusTotal, the MD5 hash of the cobaltstrike.jar package allows us to determine not only the\nexact version of the Team Server in use, but also whether the Team Server in operation is a leaked,\ncracked, trial or even a private version. Even if the Java archive is unavailable to assist with version\nidentification, it is still an extremely valuable clustering mechanism, especially in the case of private and\ncustomized builds.\n\nAs a comparison, the SSL public key allows us to cluster Beacons generated by a single Team Server\ninstallation, while conversely, the “process injection stub” hash allows us to cluster Beacons generated\non any server running the same cobaltstrike.jar Java application. Even if the threat actor is aware of this\nhash, they are extremely unlikely to modify the cobaltstrike.jar Team Server archive between generating\nBeacons. This means that the hash is highly likely to remain constant.\n\nGiven that each cobaltstrike.jar is theoretically unique per version, per “customer” (accepting leaked\nversions), this gives us the confidence to cluster Beacons not only from seemingly unrelated attacks\nbut also from seemingly disparate Team Servers. That is assuming that the operators reuse the same\ncobaltstrike.jar application, which is a strong possibility within threat groups.\n\n\n-----\n\nA point to note is that if a threat actor is aware of this secret hashing mechanism, then the value can be\nspoofed without impairing the functionality of the Beacon. This is unlike SSL public keys, where it would\nbreak C2 functionality if someone were to tamper with them.\n\nIn theory, these MD5s are not an entirely infallible pivot for performing clustering and attribution. However, in practice they are rarely tampered with, and they routinely yield invaluable information and intelligence.\n\nEight out of the top 10 most popular Cobalt Strike hashes belong to leaked builds and can be found on\nVirusTotal. The remaining two hash values are nulled out, with one known to convey a 0-byte string/file,\nwhich suggests that there is either a bug in Team Server, or perhaps certain operators might have some\nawareness of this secret hashing mechanism.\n\nCurrently, threat actors running leaked copies of Cobalt Strike appear to be favoring versions 4.0 to 4.3,\nalthough a recent build of 4.4 from August 2021 seems to be gaining popularity among several distinct\ngroups.\n\n_Figure 72 - Top 10 PROCINJ_STUB hashes of cobaltstrike.jar_\n\nThe clandestine nature of this feature raises several questions:\n\n1. Why add the hash of the Cobalt Strike Java package archive to the config of a Beacon at all?\n2. Was this a purposeful choice by the developers?\n3. What other Easter eggs, either accidental or deliberate, have the developers left lurking in\nTeam Server?\n\n\n-----\n\nIf this was done on purpose, then it might have been to track or differentiate between licensed customers and those using unlicensed or cracked copies of Cobalt Strike. But this is pure speculation. We’ll\nleave you, dear reader, to draw your own conclusions.\n\nThe top PROCINJ_STUB hashes reveal just how prevalent leaked, cracked, and trial builds of Cobalt\nStrike have become:\n\n|PROCINJ_STUB|SHA256|Version|\n|---|---|---|\n|a56c813864af878a4c10083ca- 1578e0a|8ba9ba1ca1ad484ea3dd9bdc- d419515006149e41f0b1edd12698ac1ecd5351b9|4.0|\n|187ab8f- 98098de95714613f8544c9613|d8a8ec922dd8863da80be182faa97b901cd75fc- 9d600e94a291d14384597571b|4.1|\n|0ce2f55444e4793516b5afe- 967be9255|9b49f169aa607e70562a15f161c- d00a4a173e598d3faa1cd7bf4bfe3027c5078|4.2|\n|0ce2f55444e4793516b5afe- 967be9255|9b49f169aa607e70562a15f161c- d00a4a173e598d3faa1cd7bf4bfe3027c5078|4.2|\n|b54afe01ec6a75ed- f35e1a44f8bd3929|56a53682084c46813a5157d73d7917100c- 9979b67e94b05c1b3244469e7ee07a|4.2 (20201106)|\n|303ae5ba3c016e- 498624505880fad314|558f61bfab60ef5e6bec15c8a6434e94249621f- 53e7838868cdb3206168a0937|4.0|\n|32cd41edf0810c5b5f498edf- 4731cc6d|02fa5afe9e58cb633328314b279762a03894df6b- 54c0129e8a979afcfca83d51|4.3|\n|da7489d9f303b6a5db- c484fdf78721d1|ef4c688e6c499332d63dd1fccf1f7c- 388502c6836014f24ef52b4c01ab6b8c86|3.14|\n|d41d8cd98f- 00b204e9800998ecf8427e|e3b0c44298fc1c149afbf4c8996fb92427ae41e- 4649b934ca495991b7852b855|Empty file|\n|a49f5445f01a9f3240ee- a9e46ee66c81|1f472f1ad1d5aea0cb51200f07f2fcdb24c- 8b0646ef1ebe2d72e3cf7b2c54662|4.3|\n|b2736f1cbba90d42286fc42b- fba74f4d|c3c243e6218f7fbaaefb916943f500722644ec- 396cf91f31a30c777c2d559465|4.3|\n|367635691cdd- 70722ef5706a8f0ca7e6|1f2c29099ba7de0f7f05e0ca0efb58b56ec422b- 65d1c64e66633fa9d8f469d4f|4.1|\n|60e790d9492bbbc2da- 556be9edd5ceee|fb27c7c014c4df8f0820d940b01b8a1f5d27c- c7c018ab4f489df1b950992cb83|4.1|\n|d10ba2f46586cefb- 16817150c6c1168e|981c124ac263a6e0bdd68ec8faa22a44c80536b- 382203f3a2f79f45c37e1d5cc|4.0|\n|cd89fa488ffa5c795876d04f- 95b3733c|eef76cda6ea8c0b46613cf2f20f48d2c- 2fa067b9f2291599fb4ad0cf96961f46|4.0|\n|67bfc989d7549f873ae09c4fd- 48f2a66|272eeaaefd6d2489e434c7c73e7de7a3941c- c77865697c3955df518e62e4e641|4.1|\n\n\n-----\n\n|30aa21b939d29f3a2cf6a5c- 3038c328b|17a2ccec7b41b- 585d5a1239b12818d74d454b577db10b- 2607d482311944e10e9|3.14 (20190504) Licensed|\n|---|---|---|\n|46a0fae303e4d26d61ff- c6a347adef56|86991bed942cc39c0796091243ea58844b- ce577f7cb8172b3f737fa0ecad0e38|4.1|\n|446714587d79d27df098dd- 3e82f27ff3|7de98cb0bd3e8f3804ea7eaca400a955aee- 59a23684428bd17b2c7c89c5f1efa|4.1 (20200625)|\n|4300e055262500719f12645a 0bc536b8|810095d5fc630f6de2d24f34e94b8a5652d7269c- 31c78668b4078a63d16712fe|4.0 (20191205)|\n|95de7e032f607fb7b32b7d- 387ca18645|41976f79674855bb092598257c896b2de5e- ce3e3d5509d57c37d7c161850caf6|4.4 (20210801)|\n|45606e73f3a76c2834a3ca- e67306a611|b6cd3b4ea7d1d4dd00afe7e894b7c- 7ca0f82f8b809494d92ba48ed35a6531bf6|3.14 (20190502)|\n|799b1726911eb1fc6073f- 5c96821f299|1cdfa75b103f4b3218a9f6ddec137a5438c5e- 6571151d0979c60d96dfbbf9231|4.3|\n\n\n_Table 10 – PROCINJ_STUB hashes by popularity_\n\n##### deprecated_spawnto\n\nMuch like the PROCINJ_STUB setting, one could be forgiven for thinking that this setting contains the\ntarget process name to inject to, and that it is now deprecated. After even a cursory glance at our dataset, it appears as if this value contained a hex encoded executable name for the SPAWNTO setting at\nsome point in time. This is indicated by the value 72756e646c6c33322e657865, which is present in 76\nof our Beacons:\n\n_Figure 73 – CyberChef decoded DEPRECATED _SPAWNTO value for rundll32.exe_\n\n\n-----\n\nIn reality, this setting presents another mystery. Most of the values appear to be MD5s hashes, and not\nthe expected hex-encoded process names:\n\n_Figure 74 – Top DEPRECATED _SPAWNTO values_\n\nThe plot thickens further, as two of the hashes appear on VirusTotal. They belong to a pair of text files\ncontaining release notes for Cobalt Strike 3.12 and 3.13:\n\n_Figure 75 – DEPRECATED _SPAWNTO release notes_\n\n\n-----\n\nThe DEPRECATED_SPAWNTO configuration value seems to have been misappropriated at some point\nin time, much like the PROCINJ_STUB setting that we mentioned before, which was used to covertly\nembed the hash of the Team Server Java archive into all Beacon configurations.\n\nThe DEPRECATED_SPAWNTO setting instead seems to surreptitiously embed the hash value of a file\nlocated on the Team Server into the Beacon payload configuration. And like PROCINJ_STUB, the developers may well have intended it to be a crude tracking mechanism for monitoring Beacons deployed in\nthe wild. But, again, this is speculation.\n\n##### miscellaneous\n\nFinally, there are several Boolean options that can be specified to control the behavior of Cobalt Strike\nBeacons. Although none of them are frequently set, it seems worth mentioning them for the sake of\ncompleteness:\n\n**Option** **Percentage** **Description**\n\nCRYPTO_SCHEME 5% Enable data encryption\n\nC2_CHUNK_POST 4% Chunk HTTP post requests\n\nUSE_COOKIES 4% Enable the use of cookies\n\nCLEANUP 5% Free memory associated with\nthe Beacon stager\n\n_Table 11 – Miscellaneous Boolean configuration options_\n\nNow that we’ve looked at the various configuration values, cluster points and statistics, let’s take a look\nat the data in practice.\n\nTime to get hunting!\n\n|Option|Percentage|Description|\n|---|---|---|\n|CRYPTO_SCHEME|5%|Enable data encryption|\n|C2_CHUNK_POST|4%|Chunk HTTP post requests|\n|USE_COOKIES|4%|Enable the use of cookies|\n|CLEANUP|5%|Free memory associated with the Beacon stager|\n\n\n-----\n\n### chapter five\n\n## BEACON OF HOPE\n\n##### intelligence correlation\n\nWe took a largely automated approach to performing intelligence correlation with OSINT, hunting for\nmany indicators from our Cobalt Strike dataset in our TIP. This was successful in linking clusters with\npublicly documented threat actor infrastructure and uncovering further clusters for closer manual inspection.\n\nWe also spent (and continue to spend) many hours manually correlating OSINT with our dataset (e.g.,\nsearching IOCs on Twitter!) and pivoting on those findings to yield further indicators and intelligence.\nIn the end, we found correlations with dozens of major threat actors and campaigns, including some\nfamiliar faces:\n\n    - DarkSide\n\n    - REvil/Sodin\n\n   - APT41\n\n   - CostaRicto/SombRAT\n\n   - KEGTAP & SINGLEMALT\n\n    - IcedID\n\n    - Ursnif\n\n    - WizardSpider\n\n   - Ryuk\n\n    - Conti\n\n    - TrickBot\n\n    - Nempty/Netfilim/Nephilim\n\n   - FIN7\n\n   - Maze\n\n   - DoppelPaymer\n\n   - MAN1/Moskal/TA505\n\n   - Nobelium/APT29\n\n    - Pyxie\n\n    - StrongPity\n\n   - MountLocker\n\n   - Phobos\n\n\n-----\n\nBased on OSINT correlation, the following threat groups have been particularly prevalent in our dataset\nover the past year or so:\n\n_Figure 76 – Correlation with known threat groups and research_\n\nEach Beacon tagged above is related to existing intelligence (whether private or OSINT) and offers us\nthe potential to perform further clustering on our dataset to uncover more intelligence insights and\ncorrelations.\n\nGiven a wealth of superb OSINT, a vast dataset of Beacons, and strong clustering capabilities around all\nthe information harvested thus far, we aim to show the ease with which you can now unravel campaigns\nfrom known threat actors.\n\nThe intelligence presented is by no means exhaustive. Several follow-up blogs and papers have been\npublished, or are already planned, based around some of the more intricate and elaborate discoveries.\nIt is worth mentioning how important an altruistic approach is, taken by many companies and individuals, in openly and freely sharing intelligence with the cybersecurity community. It would not have been\npossible to compile such a comprehensive chapter on intelligence correlation without that, let alone\nwith so little effort.\n\nKudos to all the vendors and individuals mentioned herein. Your research has been invaluable and greatly appreciated!\n\n\n-----\n\n##### apt41\n\nAPT41 (aka WINNTI, aka Barium) is a prolifi c Chinese state-sponsored cybercrime group. Active since\n2012, and initially performing espionage and fi nancially motivated attacks against prominent targets in\nthe computer game industry, they now reportedly focus on more state-aligned targets.\n\nWhere once the infamous PlugX malware was the remote access Trojan (RAT) of choice for APT41\noperatives, Cobalt Strike is starting to gain in popularity in several recent campaigns, and we’ll explore\nmanual correlation techniques that you can use to elaborate on APT41’s Team Server infrastructure.\n\nA blog post published by FireEye in March of 2020 explored APT41’s tactics, including their use of malicious documents, exploits, and Cobalt Strike. The report indicated that the group was using a bespoke\nMalleable C2 profi le with at least one of its Cobalt Strike Beacons.\n\n\n**FireEye**\n_This Is Not a Test: APT41 Initiates Global Intrusion Campaign Using Multiple Exploits_\nhttps://www.mandiant.com/resources/apt41-initiates-global-intrusion-campaign-using-multipleexploits\n\n\nWe uncovered a Malleable C2 profi le on GitHub that is very similar to that of the one mentioned in the\nFireEye blog. This one seems to have been authored by a Chinese security researcher with the pseudonym “1135.”\n\nThese profi les had several similarities: both used jQuery Malleable C2 profi les, and portions of the HTTP\nGET profi le block are almost identical. HTTP header fi elds such as accept, user-agent, host, and referrer,\nas well as the set-uri fi eld, were all exact matches to the profi le data listed in the FireEye blog.\n\n_Figure 77 - jQuery Malleable C2 from the “1135” GitHub_\n\n\n**GitHub**\n_Bootcss Malleable C2 Profi le_\nhttps://github.com/1135/1135-CobaltStrike-ToolKit/blob/master/Malleable%20C2%20Files/jquery.\nxxx.js_CN_cdn.bootcss.com_for_cs3.14_.txt\n\n\n-----\n\nBy extracting and correlating the HTTP headers used in the GET and POST requests defi ned in the\nBeacon confi gs, we can generate revealing connections between previously disparate Cobalt Strike\ninfrastructure.\n\n_Figure 78 – Clustering on cdn.bootcss.com POST Request Meta_\n\nWhile we identifi ed a relatively small number of Beacons using the bootcss[.]com domain as part of their\nMalleable C2 confi guration, there were also a few clusters with a unique SSL public key (b3e6b9dd84dae_6be68cb40cda4366b77) that enabled us to identify additional beacons related to APT41._\n\n_Figure 79 - Pivoting to a new cluster based on SSL public key_\n\n\n-----\n\nThe Beacons served by these new nodes are using different domain names to those from the original\ncluster that attempt to make the Beacon traffic look like legitimate Microsoft traffic.\n\n**IP** **Domain**\n\n144.202.98[.]198 zalofilescdn[.]com\n\n107.182.24[.]70 isbigfish[.]xyz\n\n185.14.29[.]72 www[.]microsoftbooks.dns-dns[.]com\n\n193.42.114[.]73 www[.]microsoftbooks.dns-dns[.]com\n\n149.28.78[.]89 www[.]mlcrosoft[.]site\n\n23.67.95[.]153 ns.mircosoftdoc[.]com\n\n104.27.132[.]211 cdn.microsoftdocs.workers[.]dev\nccdn.microsoftdocs.workers[.]dev\n\n_Table 12 - APT41 phishing domains_\n\nThe domains we found share similarities in their naming convention, which masquerade as a legitimate\nMicrosoft phishing domain www[.]mlcrosoft[.]site, both appear within a blog from Positive Technologies. Further hunting for the IP address 149.28.78[.]89 reveals links to a campaign referenced in a\nPrevailion blog, “The Gh0st Remains the Same.”\n\n##### apt41 continued - gh0st in the machine\n\nIn the Prevailion blog, we can find two IOCs that appear in the cluster above; the IP 149.28.78[.]89, and\nthe domain mlcrosoft[.]site. That blog associated those IOCs with the Higaisa APT group, which operates out of North Korea.\n\nThe domain mlcrosoft[.]site also appears in a blog from Positive Technologies. That article has additional overlapping IOCs and talks about the same campaign as mentioned in the Prevailion blog. However,\nit makes a strong argument that the activity is from APT41, rather than Higaisa APT.\n\n|IP|Domain|\n|---|---|\n|144.202.98[.]198|zalofilescdn[.]com|\n|107.182.24[.]70|isbigfish[.]xyz|\n|185.14.29[.]72|www[.]microsoftbooks.dns-dns[.]com|\n|193.42.114[.]73|www[.]microsoftbooks.dns-dns[.]com|\n|149.28.78[.]89|www[.]mlcrosoft[.]site|\n|23.67.95[.]153|ns.mircosoftdoc[.]com|\n|104.27.132[.]211|cdn.microsoftdocs.workers[.]dev ccdn.microsoftdocs.workers[.]dev|\n\n\n**Prevalion**\n_The Gh0st Remains the Same_\nhttps://www.prevailion.com/the-gh0st-remains-the-same-2/\n\n**Positive Technologies**\n_Higaisa or Winnti? APT41 backdoors, old and new_\nhttps://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41backdoors-old-and-new/\n\n\n-----\n\nWhen we do a side-by-side comparison of the domains from the Positive Technologies blog and our\ndatasets, there is a strong similarity between naming conventions used:\n\n**BlackBerry IOCs** **Positive Technologies IOCs**\n\nwww[.]microsoftbooks.dns-dns[.]com microsoftbooks.dynamic-dns[.]net\n\ncdn.microsoftdocs.workers[.]dev microsoftdocs.dns05[.]com\n\nccdn.microsoftdocs.workers[.]dev ns.microsoftdocs.dns05[.]com\n\nns.mircosoftdoc[.]com ns1.microsoftsonline[.]net\n\n_Table 13 – Domain similarities_\n\nWe also discovered that mlcrosoft[.]site and mircosoftdoc[.]com both appear in the Azure-Sentinel detection rule for known Barium phishing domains. The IP 144.202.98[.]198 has also been previously\nassociated with APT41/Barium by a Microsoft researcher.\n\n|BlackBerry IOCs|Positive Technologies IOCs|\n|---|---|\n|www[.]microsoftbooks.dns-dns[.]com|microsoftbooks.dynamic-dns[.]net|\n|cdn.microsoftdocs.workers[.]dev|microsoftdocs.dns05[.]com|\n|ccdn.microsoftdocs.workers[.]dev|ns.microsoftdocs.dns05[.]com|\n|ns.mircosoftdoc[.]com|ns1.microsoftsonline[.]net|\n\n\n**GitHub**\n_Azure-Sentinel – Detections – MultipleDataSources_\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/\nBariumDomainIOC112020.yaml\n\n**Ajeet Prakash**\n_Hunting for Barium using Azure Sentinel_\nhttps://techcommunity.microsoft.com/t5/microsoft-sentinel-blog/hunting-for-barium-using-azuresentinel/ba-p/1875913\n\n\nAnother IP from this cluster, 185.14.29[.]72, was recently providing virtual hosting for several domain\nnames such as:\n\n    - chaindefend[.]bid\n\n    - defendchain[.]xyz\n\n    - assistcustody[.]xyz\n\n    - www[.]microsoftonlineupdate.dynamic-dns[.]net\n\nPreviously, this IP has been associated with DNS resolutions for _schememicrosoft[.]com and_ _www[.]_\n_microsoftbooks.dns-dns[.]com. Several of the domains also have links to 209.99.40[.]222, an IP known_\nto perform malicious DNS/bulletproof hosting. As of Sept. 14, 2021, this IP resolved to a new domain\nvery briefly: Microsoftonlineupdate.dynamic-dns[.]net. This domain also conforms to a similar naming\nconvention to those we have seen previously in Table 13.\n\n\n**BlackBerry ThreatVector Blog**\n_For more a more in-depth look at this threat actor and our subsequent findings - make sure to check_\n_out our blog:_\nhttps://blogs.blackberry.com/en/2021/10/drawing-a-dragon-connecting-the-dots-to-find-apt41\n\n\n-----\n\n##### apac red teams\n\nAside from APT41, a handful of other threat groups and red teams from the APAC region are also using\nthe bootcss[.]com Malleable C2 profile, yielding further notable clusters.\n\nThe most popular SSL public key is shared by four IP addresses that are serving up 10 Beacons between\nthem:\n\n**IP** **Country**\n\n119.28.93[.]67 HK\n\n119.28.42[.]138 HK\n\n39.96.0[.]85 CN\n\n172.93.43[.]32 US\n\n_Table 14 – IPs based on SSL public key hash (defb5d95ce99e1ebbf421a1a38d9cb64)_\n\nAnother cluster of two IPs and six Beacons is also significant; here the profile was subtly modified to\nreplace bootcss[.]com for the GET request metadata, but not for the POST request. For the GET request\nmetadata, the Beacon was instead configured to use static.aliyun[.]com (Alibaba Cloud Computing)\nrather than bootcss[.]com as the domain, while the C2 server URI was changed from /jquery-3.3.1.min.\njs to /require-jquery-v1.js.\n\nFurther pivoting on the C2 server configuration revealed four additional beacons from two new IPs\nsharing the same domain.\n\n**IP** **Domain**\n\n40.73.6[.]221 www[.]aliyun.com[.]co\n\n139.217.99[.]29 www[.]microport.com[.]cn\n\n47.92.121[.]151 www[.]microport.com[.]cn\n\n39.98.84[.]58 www[.]microport.com[.]cn\n\n_Table 15 – APT41 IPs/domains from POST request metadata clustering_\n\nThese beacons all appear to have been deployed against Chinese targets, possibly by red teams in\nChina.\n\nOverall, 35 Beacons share a remarkably similar config (for one that is not widely in the public domain),\nand they use 74.125.196[.]113 for the DNS_IDLE value, but without the default mojo.5688.8052.1838949\n_39787088877## named pipe. Watermark values vary between 305419896, 0 and 1873433027:_\n\n|IP|Country|\n|---|---|\n|119.28.93[.]67|HK|\n|119.28.42[.]138|HK|\n|39.96.0[.]85|CN|\n|172.93.43[.]32|US|\n\n|IP|Domain|\n|---|---|\n|40.73.6[.]221|www[.]aliyun.com[.]co|\n|139.217.99[.]29|www[.]microport.com[.]cn|\n|47.92.121[.]151|www[.]microport.com[.]cn|\n|39.98.84[.]58|www[.]microport.com[.]cn|\n\n\n-----\n\n|IP|Count|Country|\n|---|---|---|\n|45.77.13[.]213|7|JP|\n|119.28.42[.]138|4|HK|\n|93.115.21[.]242|4|NL|\n|45.137.151[.]106|3|GB|\n|119.28.93[.]67|2|HK|\n|39.96.0[.]85|2|CN|\n|47.101.177[.]45|2|CN|\n|121.196.59[.]237|2|CN|\n|96.45.182[.]23|2|US|\n|157.245.169[.]236|2|US|\n|118.25.108[.]240|2|CN|\n|172.93.43[.]32|2|US|\n|139.180.218[.]213|2|SG|\n\n\n_Table 16 – Further IPs using the Chinese jQuery profile_\n\nSeveral of the above IPs have previously been associated with campaigns from Kinsing/SysupdataMiner, as well as being loosely affiliated with red teams based in China.\n\nOne of the Team Servers, 45.77.13[.]213, was unique in that it served up five different Beacons, all configured with a user-agent string that is subtly modified from the base profile:\n\n**_Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_1) AppleWebKit/537.36 (KHTML, like Gecko)_**\n**_Chrome/83.0.4103.106 Safari/537.36_**\n\nCompared to:\n\n**_Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko)_**\n**_Chrome/88.0.4324.192 Safari/537.36_**\n\nFinally, four of the Beacons specify null or 8.8.4.4 for the DNS_IDLE option, all of which are hosted on\n39.101.199[.]31 (Alibaba).\n\nAcross all the Beacons using the bootcss jQuery profile, only four unique user-agent strings were observed. Several of these should not be particularly common in recently updated Windows-based environments, seeing as they normally originate from Mac® based browsers. These types of oddities can\nbe good indicators for defenders when crafting rules for hunting and alerting.\n\n\n-----\n\n|User-agent|Browser/OS|\n|---|---|\n|Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.106 Safari/537.36|Chrome/MacOS 10|\n|Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4324.192 Safari/537.36|Chrome/MacOS 10|\n|Mozilla/5.0 (Windows NT 6.3; Trident/7.0; rv:11.0) like Gecko|IE11/Windows 6.3|\n|Mozilla/5.0 (Windows NT 6.1; rv:24.0) Gecko/20100101 Firefox/24.0|Mozilla Firefox 24.0/Windows 7 6.1|\n\n\n_Table 17 – User-agents employed by Chinese jQuery Beacons_\n\n##### darkside\n\nDarkSide is a ransomware-as-a-service (RaaS) that fi rst appeared in the wild in August 2020. With frequent updates, version 2 surfaced around March 2021. The DarkSide threat group offers their malware\nfor download on the dark web, and like many other RaaS vendors, they allow their customers to download malware and target victims to extort money, exfi ltrate fi les, and then share in the proceeds with the\nmalware creators.\n\n\n**BlackBerry**\n_BlackBerry Prevents DarkSide Ransomware — Years Before It Ever Existed_\nhttps://blogs.blackberry.com/en/2021/05/blackberry-prevents-darkside-ransomware-years-before-itever-existed\n\n\nWhen correlating intelligence against our TIP, we uncovered a report by Cybersecurity and Infrastructure\nSecurity Agency (CISA) from July 2021 that attributes the IP 99.83.154[.]118 to DarkSide.\n\n\n**CISA**\n_10337802.r1.v1_\nhttps://us-cert.cisa.gov/sites/default/fi les/publications/MAR-10337802-1.v1.WHITE.pdf\n\n\nOne of the most recent domains associated with that IP, tgbyhnedc[.]com, has historical resolutions for\n103.140.186[.]35. This IP is present in our dataset, and is used by a pair of Beacons that are confi gured\nto perform domain fronting via Google videos™:\n\n_Figure 80 - DarkSide domain fronting via Google videos™_\n\n\n-----\n\nFurthermore, fi ve other Beacons also share the same PROCINJ_STUB hash, and all but one of these are\nloosely based on the youtube_video.profi le.\n\n_Figure 81 - Darkside infrastructure clustered on PROCINJ_STUB hash_\n\nOverall, these overlaps reveal three new IPs and two new domains likely associated with attacks deploying DarkSide ransomware.\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n99.83.154[.]118 N/A N/A N/A\n\n103.140.186[.]35 abc.tgbyhnedc[.]com 2021-04-12 2021-04-12\n\n195.123.221[.]182 login.eyetomsky[.]com 2021-03-29 2021-08-11\n\n91.235.128[.]97 cafebizup[.]com 2021-04-02 2021-07-06\n\n_Table 18 – Darkside IPs_\n\nThe IP 195.123.221[.]182 is hosted in the Netherlands, and it appears to be providing DNS for several\nRussian top-level domains.\n\nInterestingly, several DarkSide-related Beacons contain a unique PROCINJ_STUB value (the hash of the\nTeam Server JAR archive), which can be used to monitor for new Team Servers and Beacons deployed\nby this particular DarkSide affi liate.\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|99.83.154[.]118|N/A|N/A|N/A|\n|103.140.186[.]35|abc.tgbyhnedc[.]com|2021-04-12|2021-04-12|\n|195.123.221[.]182|login.eyetomsky[.]com|2021-03-29|2021-08-11|\n|91.235.128[.]97|cafebizup[.]com|2021-04-02|2021-07-06|\n\n\n-----\n\n##### fin7\n\nFIN7 is a Russian, fi nancially motivated cybercrime group, notorious for deploying point-of-sale (PoS)\nmalware against U.S. retail and hospitality targets in the since 2015.\n\nIn late March of 2021, the ThreatConnect Research Team published a threat intelligence update that\nidentifi ed possible FIN7 infrastructure. The hosting ISP, registrar, SSL certifi cate and naming convention\nhad strong consistencies with infrastructure that was previously attributed to FIN7. IPs and domains associated with their fi ndings were correlated with our dataset and found to be serving Beacons between\nJuly 2020 and July 2021.\n\n\n**ThreatConnect**\n_ThreatConnect Research Roundup: Threat Intel Update 3/25/21_\nhttps://threatconnect.com/blog/threatconnect-research-roundup-threat-intel-update-3-25-21/\n\n\nThe correlations revealed fi ve IP addresses associated with FIN7 that were doubling as Cobalt Strike\ninfrastructure, using three unique SSL certifi cates, and serving up over 20 Beacons between them. Four\nout of those fi ve IP addresses were using a modifi ed version of the Gmail™ Malleable C2 profi le.\n\nThe original, unmodifi ed POST request metadata is as follows:\n\n_ui=d3244c4707, hop=6928632, start=0, Content-Type: application/x-www-form-ur-_\n_lencoded;charset=utf-8, OSID=, Cookie`_\n\nFIN7, however, appear to be using a subtle modifi cation to the ui and hop parameters:\n\n_ui=d3221c1438, hop=3938730, start=0, Content-Type: application/x-www-form-ur-_\n_lencoded;charset=utf-8, OSID=, Cookie_\n\nUsing this modifi ed POST request as a clustering point reveals some additional infrastructure with links\nto FIN7.\n\n_Figure 82 - Clustering FIN7 infrastructure using POST Request Meta setting_\n\n\n-----\n\nA total of four additional IPs and two additional domains were uncovered and are listed below as a\nsupplement to ThreatConnect’s original findings.\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n85.217.171[.]12 85.217.171[.]12 2021-02-05 2021-04-29\n\n195.2.93[.]160 195.2.93[.]160 2020-07-14 2020-09-05\n\n185.206.145[.]227 coincidencious[.]com 2021-03-19 2021-07-22\n\n92.63.105[.]58 wisecrackism[.]com 2021-02-17 2021-03-13\n\n89.163.214[.]57 89.163.214[.]57 2021-02-01 2021-02-04\n\n185.203.116[.]7 cdnoid[.]com 2021-02-11 2021-03-02\n\n95.142.40[.]121 techniquesaholic[.]com 2020-07-20 2020-09-04\n\n213.202.211[.]246 213.202.211[.]246 2021-01-01 2021-05-18\n\n188.120.248[.]114 188.120.248[.]114 2020-09-07 2020-11-20\n\n_Table 19 – FIN7 C2_\n\nOccasionally, the FIN7 operators have been observed nulling out the PROCINJ_STUB hash in the Beacon\nconfig. This is almost certainly good OPSEC, but about half of the Beacon configurations allude to a\nleaked copy of Cobalt Strike 4.2 (20201106) being deployed.\n\n##### wizardspider\n\nWizardSpider (aka UNC1878) is a Russian cybercrime group. Since 2018, they have deployed a variety\nof malware, including TrickBot, Ryuk and Conti, primarily attacking targets for financial gain.\n\nIntelligence correlation has revealed several overlaps with WizardSpider campaigns in our dataset, allowing us to shine a light on some of this group’s activities, and better monitor their future operations.\n\n##### ryuk\n\nIn the latter half of October 2020, the ThreatConnect Research Team detected some newly registered\ninfrastructure that is potentially linked to the Threat Group WizardSpider and their Ryuk ransomware\nfamily.\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|85.217.171[.]12|85.217.171[.]12|2021-02-05|2021-04-29|\n|195.2.93[.]160|195.2.93[.]160|2020-07-14|2020-09-05|\n|185.206.145[.]227|coincidencious[.]com|2021-03-19|2021-07-22|\n|92.63.105[.]58|wisecrackism[.]com|2021-02-17|2021-03-13|\n|89.163.214[.]57|89.163.214[.]57|2021-02-01|2021-02-04|\n|185.203.116[.]7|cdnoid[.]com|2021-02-11|2021-03-02|\n|95.142.40[.]121|techniquesaholic[.]com|2020-07-20|2020-09-04|\n|213.202.211[.]246|213.202.211[.]246|2021-01-01|2021-05-18|\n|188.120.248[.]114|188.120.248[.]114|2020-09-07|2020-11-20|\n\n\n**GitHub**\n_ThreatConnect - IOCs_\nhttps://github.com/ThreatConnect-Inc/research-team/blob/master/IOCs/WizardSpider-UNC1878Ryuk.csv\n\n\n-----\n\nThe C2 domains from their report were registered via Openprovider. The domains use SSL certifi cates\ncontaining similar string criteria compared to prior Ryuk infrastructure. Several IPs and domains associated with their fi ndings were also present in our dataset. These IPs and domains served Cobalt Strike\nBeacons between July 2020 and July of 2021. One additional IP address, 108.62.141[.]5, was discovered in our dataset, which shared C2 domains with an IP reported by ThreatConnect.\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n74.118.138[.]139 touchroof[.]com 2021-02-07 2021-07-15\nfocuslex[.]com\n\n108.62.141[.]5 touchroof[.]com 2021-05-19 2021-05-19\nfocuslex[.]com\n\n45.153.241[.]16 45.153.241[.]16 2020-07-10 2021-02-18\n\n172.106.86[.]22 45.176.188[.]137 2021-03-11 2021-03-15\n\n162.252.172[.]41 172.106.86[.]22 2021-03-03 2021-03-16\n51.81.142[.]72\n\n_Table 20 – WizardSpider/Ryuk C2_\n\nAgain, using the PROCINJ_STUB hash, it is possible to ascertain the version of Team Server deployed\non the server. In this instance, the hash belongs to the fourth most leaked build, 4.2 (from 2020-11-06).\n\n##### bazarloader\n\nAn AlienVault Pulse from January 26, 2021 lists 88.119.171[.]105 as a possible IP associated with WizardSpider/UNC1878:\n\n_Figure 83 – AlientVault Pulse for 88.119.171[.]105_\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|74.118.138[.]139|touchroof[.]com focuslex[.]com|2021-02-07|2021-07-15|\n|108.62.141[.]5|touchroof[.]com focuslex[.]com|2021-05-19|2021-05-19|\n|45.153.241[.]16|45.153.241[.]16|2020-07-10|2021-02-18|\n|172.106.86[.]22|45.176.188[.]137|2021-03-11|2021-03-15|\n|162.252.172[.]41|172.106.86[.]22 51.81.142[.]72|2021-03-03|2021-03-16|\n\n\n**AlienVault**\n_Possible UNC1878 / Wizard Spider Domain servicessilverroomhotspot[.]com_\nhttps://otx.alienvault.io/pulse/600fe8f0617db5e51ad89f5b\n\n\n-----\n\nA tweet from Joe Slowik a couple of days later hints at a further link to BazarLoader based on the servicessilverroomhotspot[.]com domain:\n\n_Figure 84 – Joe Slowik tweet with BazarLoader details_\n\nDelving into our dataset, the IP address from the AlienVault Pulse is present, but specifi ed as the\nC2SERVER setting in the Beacon confi g. The actual Team Server hosting the Beacon is on another IP\nentirely:\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n217.12.202[.]115 88.119.171[.]105 2021-01-25 2021-02-08\n\n_Table 21 – WizardSpider/BazarLoader C2_\n\nA Beacon payload (SHA256 of 5351…) was observed communicating with the above IP since 2021-0128. The Beacon is signed using a possibly stolen code signing certifi cate issued to “JJ ELECTRICAL\nSERVICES LIMITED,” with a serial of bbd4dc3768a51aa2b3059c1bad569276. This certifi cate was used\nto sign a further Cobalt Strike Beacon with a timestamp of 2021-02-02 17:25:31 (SHA256 of d67ba…),\nwhich is attributed to TrickBot in a report from Intel 471 published in May 2021.\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|217.12.202[.]115|88.119.171[.]105|2021-01-25|2021-02-08|\n\n\n**Intel 471**\n_Look how many cybercriminals love Cobalt Strike_\nhttps://intel471.com/blog/Cobalt-strike-cybercriminals-trickbot-qbot-hancitor\n\n\n-----\n\nThe full hashes for both of the above samples are:\n\n   - 5351984d7eaf9464f27c202f94b6475ffb73904191c973d7c737a0f3cdfbde0e\n\n   - d67baca49193bd23451cca76ff7a08f79262bf17fb1d8eb7adaf7296dca77ad6\n\nThe Malleable C2 profi le used by the WizardSpider/BazarLoader Beacons in our dataset differs from the\njQuery profi le observed by Intel 471. The latest samples appear to be based on an Amazon® Malleable\nC2 profi le (using 0.0.0.0 for DNS idle), while another sample, signed with the stolen certifi cate, was using\na DNS idle value of 114.114.114.114 (China Telecom).\n\nBeacons served from both IPs share the same PROCINJ_STUB hash, indicating they are both running a\nleaked copy of Cobalt Strike 4.0.\n\n##### trickbot\n\nTrickBot was initially a banking Trojan, uncovered in 2016 and leveraged by its operators to facilitate\nfi nancial gain. Since its inception, TrickBot has grown in complexity. It is now a modular, multi-stage,\njack-of-all-trades, offering credential harvesting, crypto mining, exfi ltration, reconnaissance and more.\n\n\n**BlackBerry**\n_Threat Spotlight: TrickBot Infostealer Malware_\nhttps://blogs.blackberry.com/en/2019/09/blackberry-cylance-vs-trickbot-infostealer-malware\n\n\nA blog published by The DFIR report in May 2021 identifi es a TrickBot campaign that was used to fi rst\ndeploy Cobalt Strike Beacon and then a credential-stealing tool called LaZagne.\n\n_Figure 85 – LaZagne GitHub repository (https://github.com/AlessandroZ/LaZagne)_\n\n\n-----\n\nThe blog provides the following network IOCs for Cobalt Strike:\n\n    - 147.135.78[.]200:80\n\n    - 23.108.57[.]39:443\n\n    - wideri[.]com\n\n    - http[:]//172.82.179[.]170/w.dll\n\n\n**The DFIR Report**\n_Trickbot Brief: Creds and Beacons_\nhttps://thedfirreport.com/2021/05/02/trickbot-brief-creds-and-beacons/\n\n\nFurther intelligence from RiskIQ published during September 2021 provides some additional context,\nlinking the IP 23.108.57[.]39 with a further ~650 IPs and attributing the overall campaign to WizardSpider. RiskIQ also disclosed details of a new zero-day vulnerability in Microsoft® Word (CVE-2021-40444)\nthat was likely being exploited to deliver the Beacon payloads through malicious documents.\n\nIn this instance, clustering on SSL public keys associated with Team Server IPs revealed little further in\nthe way of additional infrastructure. This indicated that the operators of this particular botnet are employing some good OPSEC, installing Team Server afresh for each deployment. However, despite being\ncautious, WizardSpider left a breadcrumb trail we could follow to correlate intelligence and uncover\nfurther infrastructure.\n\nThe first part of the trail related to module names. Most of the module names employed by this threat\nactor were manually specified and non-default:\n\n    - internsystem.dll\n\n    - commnicationsdebug.dll\n\n   - debugcomm.dll\n\n    - networkinternals.dll\n\n    - encryptfull.dll\n\n    - systemintern.dll\n\n    - networkcomm.dll\n\n    - cableplatform.dll\n\n    - debugcommunications.dll\n\nIn addition, many of the Beacons also used non-default process names for injection (SPAWNTO), such\nas:\n\n    - %windir%\\sysnative\\wusa.exe\n\n    - %windir%\\sysnative\\mstsc.exe\n\n    - %windir%\\system32\\calc.exe\n\nThe final interesting portion of the breadcrumb trail concerns the use of a domain generation algorithm\n(DGA), which is used to generate domains names for the beacon C2SERVER setting. In this instance,\nthe generated domain names tend to follow a simple nomenclature (6-12 characters, no prefix and a\n.com suffix). For example:\n\n\n-----\n\n    - cloudstomes[.]com\n\n    - touchroof[.]com\n\n    - newiro[.]com\n\n    - derotin[.]com\n\n    - pipipub[.]com\n\n    - wideri[.]com\n\n    - hireja[.]com\n\n    - slicemia[.]com\n\n   - mebonux[.]com\n\n    - tucosu[.]com\n\n    - wuluxo[.]com\n\n   - dimuyum[.]com\n\n    - buremih[.]com\n\n    - nokuje[.]com\n\nArmed with this knowledge, we can now produce a simple tool to label these samples in our dataset, as\nwell as to label incoming samples. This makes it easy to correlate emerging intelligence with WizardSpider’s activities.\n\n##### conti\n\nIn May 2021, WizardSpider deployed the Conti ransomware in an attack against the Health Service\nExecutive (HSE), the public health service of Ireland. As a result of the attack, the HSE was forced to\nshut down its IT systems to regain control of the situation, resulting in appointment cancellations and\nloss of services.\n\nSecurity researcher Michael Koczwara revealed a further Conti ransomware campaign from July 2021\nthat employed a Beacon to deliver further payloads and stagers.\n\n\n**Michael Koczwara**\n_Conti Ransomware Group Cobalt Strike C2 Analysis & Persistence (Anydesk, Atera, Splash)_\nhttps://michaelkoczwara.medium.com/conti-ransomware-group-cobalt-strike-c2-analysis-rdppersistence-cc535d35eaba\n\n\nAs noted by Koczwara in his report, the threat actors devoted little time and attention to protecting their\nservers. Further clustering against our dataset using the user-agent string, submit URI, and the existence of azureedge[.]net in the HTTP host headers, reveals a further web of Conti-related Team Server\nIPs, and over 65 Beacon payloads.\n\n\n-----\n\n_Figure 86 - Clustering of Conti infrastructure on user-agent, submit URI and Malleable C2 profi le_\n\nAll the Beacon’s payloads are confi gured using the jquery-c2.4.3.profi le. And 16 of the samples are set\nto perform domain fronting via Microsoft Azure, using either azureedge[.]net or workhub.microsoft[.]\ncom for the C2 server.\n\n_Figure 87 – Location of TrickBot Team Servers_\n\n\n-----\n\nMost of the Beacons contain a PROCINJ_STUB value that corresponds to the MD5 hash value of Cobalt\nStrike Team Server 4.3.\n\n##### man1\n\nMAN1 (aka Moskal, aka TA511) is another financially motivated cybercrime group, active since 2018.\nThey are renowned for deploying malware called Hancitor via malspam campaigns. Since late 2019,\nHancitor has been used to deploy Beacon, amongst other malware, such as Ursnif and EvilPony.\n\n\n**BlackBerry**\n_Threat Spotlight: Dissecting the MAN1 Group’s Macro_\nhttps://blogs.blackberry.com/en/2017/03/threat-spotlight-dissecting-the-man1-groups-macro\n\n_Threat Spotlight - MAN1 Malware: Temple of Doom_\nhttps://blogs.blackberry.com/en/2017/08/threat-spotlight-man1-malware-group-resurfaces\n\n\nWe found evidence of MAN1 in our dataset in the form of two IPs, 31.44.184[.]47 and 192.99.250[.]2.\nBoth IPs were mentioned in a Unit 42 blog post from April 2021 examining traffic from Hancitor infections.\n\n\n**Unit 42**\n_Wireshark Tutorial: Examining Traffic from Hancitor Infections_\nhttps://unit42.paloaltonetworks.com/wireshark-tutorial-hancitor-followup-malware/\n\n\nThe second IP, 192.99.250[.]2, was helpful for pivot searches. It resulted in the discovery of several further Beacons in our dataset that were configured to use the IP as part of the C2SERVER configuration\nvalue:\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n173.199.115[.]116 173.199.115[.]116 2021-02-10 2021-02-10\n173.234.25[.]78\n192.99.250[.]2\n\n173.234.25[.]78 173.199.115[.]116 2020-11-12 2021-02-20\n173.234.25[.]78\n192.99.250[.]2\n\n192.99.250[.]2 173.234.25[.]78 2021-02-11 2021-02-11\n192.99.250[.]2\n\n31.44.184[.]47 31.44.184[.]4 2020-09-06 2020-11-19\n\n_Table 22 – Hancitor C2_\n\nThe 192.99.250[.]2 address tends to be the preferred IP/host in the C2SERVER setting when serving up\nBeacons over port 8080, whereas the Team Server IP will be used in the C2SERVER value for Beacons\nserved over port 80. Aside from these distinctions, the Beacons all appear to employ a default configuration with a watermark value of 0, leaving limited opportunity for further clustering. Nevertheless, we\nnow have more intelligence on MAN1’s Beacons, and the first/last seen datetimes help to broaden our\nunderstanding of campaign timelines.\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|173.199.115[.]116|173.199.115[.]116 173.234.25[.]78 192.99.250[.]2|2021-02-10|2021-02-10|\n|173.234.25[.]78|173.199.115[.]116 173.234.25[.]78 192.99.250[.]2|2020-11-12|2021-02-20|\n|192.99.250[.]2|173.234.25[.]78 192.99.250[.]2|2021-02-11|2021-02-11|\n|31.44.184[.]47|31.44.184[.]4|2020-09-06|2020-11-19|\n\n\n-----\n\n##### ursnif - saigon fork\n\nUrsnif (aka Gozi) is a multifaceted malware family with an emphasis on information stealing that has\nbeen leveraged to exfi ltrate sensitive data from targets. It has been particularly pervasive from 2016\nonwards. Since 2007, variants of the malware have been detected in Europe, Japan, and Australia, with\nmore recent outbreaks in the U.S. and U.K.\n\n\n**BlackBerry**\n_Threat Spotlight: URSNIF Infostealer Malware_\nhttps://blogs.blackberry.com/en/2018/02/threat-spotlight-ursnif-infostealer-malware\n\n\nSince 2020, Ursnif has often been distributed via malspam and used to facilitate deployment of multiple\nmalware payloads, including Cobalt Strike Beacon.\n\nIn January 2020 researchers at FireEye published a report on a malware dubbed Saigon, in which they\nindicated what appeared to be a fork of the Ursnif aka Gozi banking malware.\n\n\n**FireEye**\n_SAIGON, the Mysterious Ursnif Fork_\nhttps://www.mandiant.com/resources/saigon-mysterious-ursnif-fork\n\n\nDuring that period, an IP (146.0.72[.]76) that was part of the Saigon C2 infrastructure was also present in\nour dataset. The IP was seen to be serving a pair of Cobalt Strike Beacons based on the Stack Overfl ow\nMalleable C2 profi le between November 2020 and January of 2021.\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n146.0.72[.]76 146.0.72[.]76 2020-11-06 2021-01-17\n\n146.0.72[.]84 146.0.72[.]84 2019-03-27 2021-02-05\n\n_Table 23 – Ursnif C2_\n\nThe SSL certifi cate used by the server listed in the FireEye report has also been linked to a second IP\non the same CIDR, 146.0.72[.]76/24. This IP was also historically associated with Team Server deployments on an array of ports.\n\n_Figure 88 - SSL certifi cate used across Ursnif related IPs_\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|146.0.72[.]76|146.0.72[.]76|2020-11-06|2021-01-17|\n|146.0.72[.]84|146.0.72[.]84|2019-03-27|2021-02-05|\n\n\n-----\n\n##### icedid\n\nThe IcedID malware family first appeared in the wild in September of 2017 and began life as a banking\nTrojan. Since then, it has evolved through numerous functionality upgrades to have the means to carry\nout wide array of malicious capabilities. After one recent campaign from early 2021, documented by\nresearchers at Checkpoint, it was discovered that some of their findings regarding the IcedID C2 infrastructure were also present in our dataset. Their infrastructure was seen to be serving Cobalt Strike\nBeacons between September 2020 until as recently as May of 2021.\n\n\n**Check Point Research**\n_Melting Ice – Tracking IcedID Servers with a few simple steps_\nhttps://research.checkpoint.com/2021/melting-ice-tracking-icedid-servers-with-a-few-simple-steps/\n\n\nFurther research from FireEye into IcedID reveals additional infrastructure and overlapping IOCs with\nour dataset in the form of several C2 server IPs. FireEye specified that these were involved in an IcedID-related infection chain that was part of a campaign from the threat actor UNC2198 in the latter half\nof 2020.\n\n\n**FireEye**\n_So Unchill: Melting UNC2198 ICEDID to Ransomware Operations_\nhttps://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomwareoperations.html\n\n\nWhen correlated with our dataset, we can start to unveil further IcedID connections, helping us further\nmap and monitor their infrastructure.\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n139.60.161[.]50 149.28.45[.]70 2021-03-31 2021-04-03\n74.121.191[.]2\n\n74.121.191[.]2 139.60.161[.]50 2021-02-26 2021-05-04\n149.28.45[.]70\n159.65.36[.]16\n162.247.154[.]106\n185.172.129[.]132\n192.95.16[.]245\n45.176.188[.]137\n45.63.69[.]93\n51.81.142[.]72\n74.121.191[.]2\n\n74.50.60[.]96 139.60.161[.]50 2021-03-26 2021-04-03\n149.28.45[.]70\n74.121.191[.]2\n\n193.34.167[.]34 193.34.167[.]34 2020-09-23 2020-10-12\n\n195.123.240[.]219 195.123.240[.]219 2020-09-23 2020-09-23\n\n5.149.253[.]199 5.149.253[.]199 2020-06-29 2021-01-01\n\nTable 24 – IcedID C2\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|139.60.161[.]50|149.28.45[.]70 74.121.191[.]2|2021-03-31|2021-04-03|\n|74.121.191[.]2|139.60.161[.]50 149.28.45[.]70 159.65.36[.]16 162.247.154[.]106 185.172.129[.]132 192.95.16[.]245 45.176.188[.]137 45.63.69[.]93 51.81.142[.]72 74.121.191[.]2|2021-02-26|2021-05-04|\n|74.50.60[.]96|139.60.161[.]50 149.28.45[.]70 74.121.191[.]2|2021-03-26|2021-04-03|\n|193.34.167[.]34|193.34.167[.]34|2020-09-23|2020-10-12|\n|195.123.240[.]219|195.123.240[.]219|2020-09-23|2020-09-23|\n|5.149.253[.]199|5.149.253[.]199|2020-06-29|2021-01-01|\n\n\n-----\n\n##### salfram phishing campaign\n\nSalfram is a malware packer/crypter that has primarily been used in the obfuscation and delivery of fi rst\nstage payloads during malspam campaigns. Such payloads include the ZLoader, AveMaria, SmokeLoader and Gozi malware families, as described in research published by Cisco Talos in September of\n2020.\n\n\n**Cisco Talos**\n_Salfram: Robbing the place without removing your name tag_\nhttps://blog.talosintelligence.com/2020/09/salfram-robbing-place-without-removing.html\n\n\nIt is notable that several of the IPs that were being used at that time for those campaigns are also present in our dataset. They served Cobalt Strike Beacons between October and November of 2020.\n\n**IP** **C2SERVER** **First Seen** **Last Seen** **Version**\n\n185.153.196[.]209 185.153.196[.]209 2020-07-25 2020-10-01 4.0\n\n31.44.184[.]125 31.44.184[.]125 2020-08-22 2020-11-19 3.14\n\n31.44.184[.]50 31.44.184[.]50 2020-07-19 2020-11-15 4.1\n\n_Table 25 – C2s associated with Salfram delivery and post-compromise_\n\nWhile this information is not recent, it may be of benefi t in historical investigations, and may yet help to\nyield further intelligence correlations.\n\n##### dridex\n\n_TA505_\n\nTA505 is a long-running, fi nancially motivated threat actor that has been active since at least 2014.\nTA505, named by Proofpoint, is best known for deploying banking Trojans such as Dridex and TrickBot\nas well as ransomware such as Locky and Clop. Based on prior research from Intel471, a solitary IP\naddress mentioned in their report (176.121.14[.]175) was found to have shared a self-signed certifi cate\nwith two more IP addresses in our dataset.\n\n_Figure 89 - Excerpt from Intel471 blog on TA505_\n\n|IP|C2SERVER|First Seen|Last Seen|Version|\n|---|---|---|---|---|\n|185.153.196[.]209|185.153.196[.]209|2020-07-25|2020-10-01|4.0|\n|31.44.184[.]125|31.44.184[.]125|2020-08-22|2020-11-19|3.14|\n|31.44.184[.]50|31.44.184[.]50|2020-07-19|2020-11-15|4.1|\n\n\n**Intel471**\n_Flowspec – TA505’s bulletproof hoster of choice_\nhttps://intel471.com/blog/bulletproof-hoster-of-choice\n\n\n-----\n\nThese overlaps potentially reveal further historic TA505 related infrastructure:\n\n**IP** **C2SERVER** **First Seen** **Last Seen**\n\n176.121.14[.]175 176.121.14[.]175 2020-08-24 2021-02-14\n\n91.214.124[.]54 91.214.124[.]54 2019-12-25 2020-02-10\n\n45.67.229[.]188 45.67.229[.]188 2020-07-28 2020-09-02\n\n_Table 26 - TA505 C2_\n\nThe 91.214.124[.]54 was loosely attributed to TA505 in a report by the French CERT published in February 2021. The new IP, 45.67.229[.]188, is running a leaked copy of Cobalt Strike 4.0, according to the\nPROCINJ_STUB hash.\n\n_Figure 90 - Excerpt from the French CERT report_\n\n|IP|C2SERVER|First Seen|Last Seen|\n|---|---|---|---|\n|176.121.14[.]175|176.121.14[.]175|2020-08-24|2021-02-14|\n|91.214.124[.]54|91.214.124[.]54|2019-12-25|2020-02-10|\n|45.67.229[.]188|45.67.229[.]188|2020-07-28|2020-09-02|\n\n\n**French CERT**\n_INFRASTRUCTURE D'ATTAQUE DU GROUPE CYBERCRIMINEL TA505_\nhttps://www.cert.ssi.gouv.fr/uploads/CERTFR-2021-CTI-002.pdf\n\n\n##### ta575\n\nTA575, another group identifi ed by Proofpoint, is a notorious Russian cybercrime actor that is also responsible for deploying and operating the infamous Dridex banking Trojan.\n\nSince February 2021, TA575 has deployed over 50 Cobalt Strike Team Servers, after shunning the\nnow-defunct PowerShell Empire post-exploitation framework.\n\n\n**BlackBerry**\n_Threat Thursday: TA575/Dridex_\nhttps://blogs.blackberry.com/en/2021/08/threat-thursday-ta575-dridex\n\n\n-----\n\nWe’ve been tracking TA575’s Team Server deployments using the SSL public keys in their Beacon’s\nconfi gurations.\n\nDespite being hosted on over 50 servers, the SSL public key in question (0ce7b_6482c1f24e42f2935f5026d338d) remains constant across all payloads. This means that the operators_\nof this Cobalt Strike infrastructure have clearly used a single server to build all Beacons, before deploying them from multiple Team Servers. The Team Servers are all using a leaked build of version 4.3,\naccording to the PROCINJ_STUB value.\n\nFurther tracking of the SSL public key across Beacon confi gurations has allowed us to collate infrastructure belonging to the TA575 threat actor that had previously been disparate and unattributed.\n\n_Figure 91 - Clustering TA575/Dridex infrastructure using SSL public key Hash_\n\nLargely fl ying under the radar, portions of the infrastructure have been used by thousands of Beacons\nand malicious document stagers across several distinct malspam campaigns. In more recent offensives, such as the Fake Kaseya VSA phishing campaign fi rst reported by Trustwave in early July, the\nTeam Server infrastructure was used for staging further Dridex payloads.\n\n\n-----\n\n_Figure 92 - TA575 Cobalt Strike Team Server deployments by country since February 2021_\n\n\n**GitHub**\n_BlackBerry IOCs_\nhttps://github.com/blackberry/threat-research-and-intelligence\n\n\n##### an initial access broker - zebra2104\n\nWhen looking for domains relating to another campaign, we stumbled upon an interesting domain. It\nhad a similar naming convention, but it proved to be unrelated to the previous hunt.\n\nA single domain led us down a path where we would uncover multiple ransomware attacks plus an\nAPT C2, and subsequently revealed what we believe to be the infrastructure of an Initial Access Broker\n(IAB) that we have dubbed Zebra2104. IABs typically gain entry into a high-value victim network, then\nsell access to the highest bidder on underground forums. Later, the winning bidders will typically deploy\nransomware and other fi nancially motivated malware within the victim’s organization.\n\nThis presents a great opportunity to examine how performing attribution of IABs can often be a complex\nundertaking, and how further intelligence correlation can help us to better observe constellations on a\ncloudy night, so to speak.\n\nLet’s explore what we found!\n\n\n-----\n\n##### enter mountlocker\n\nWe identified Cobalt Strike beacons being served from the domain trashborting[.]com in April of 2021.\nWe had identified multiple beacons with different configuration data that were reaching out to the domain during April and August of the same year.\n\nA Beacon served from the IP 87.120.37[.]120 had trashborting[.]com as the specified C2SERVER in its\nconfiguration:\n\n**IP** **Country** **ASN** **ASN Number**\n\n87.120.37[.]120 Bulgaria Neterra Ltd AS34224\n\n_Table 27 – Details for 87.120.37[.]120_\n\nThe trashborting[.]com domain was registered with a ProtonMail email address (ivan.odencov1985[@]\nprotonmail[.]com) and contained Russian WHOIS registrant information:\n\n**Type** **ROC**\n\nRegistrar PDR Ltd. d/b/a PublicDomainRegistry.com\n\nDomain Status client delete prohibited\nclient update prohibited\nclient delete prohibited\nclient hold\n\nEmail ivan.odencov1985[@]protonmail[.]com (registrant, admin, tech)\n\nName Ivan (registrant, admin, tech)\n\nOrganization \nStreet \nCity Moscow (registrant, admin, tech)\n\nState Moscow (registrant, admin, tech)\n\nPostal Code 123066 (registrant, admin, tech)\n\nCountry RU (registrant, admin, tech)\n\nPhone +7.993216690 (registrant, admin, tech)\n\nName Servers ns1.entrydns.net\nns2.entrydns.net\nns3.entrydns.net\nns4.entrydns.net\n\n_Table 28 – WHOIS registrant information for trashborting[.]com_\n\n|IP|Country|ASN|ASN Number|\n|---|---|---|---|\n|87.120.37[.]120|Bulgaria|Neterra Ltd|AS34224|\n\n|Type|ROC|\n|---|---|\n|Registrar|PDR Ltd. d/b/a PublicDomainRegistry.com|\n|Domain Status|client delete prohibited client update prohibited client delete prohibited client hold|\n|Email|ivan.odencov1985[@]protonmail[.]com (regis- trant, admin, tech)|\n|Name|Ivan (registrant, admin, tech)|\n|Organization|-|\n|Street|-|\n|City|Moscow (registrant, admin, tech)|\n|State|Moscow (registrant, admin, tech)|\n|Postal Code|123066 (registrant, admin, tech)|\n|Country|RU (registrant, admin, tech)|\n|Phone|+7.993216690 (registrant, admin, tech)|\n|Name Servers|ns1.entrydns.net ns2.entrydns.net ns3.entrydns.net ns4.entrydns.net|\n\n\n-----\n\nThis email address was used to register two other sister domains on the same date - 2020-07-17:\n\n    - supercombinating[.]com\n\n    - ideanotsure[.]com\n\nAt this point, we performed some further OSINT correlation and discovered that Sophos had attributed the domain supercombinating[.]com to a MountLocker intrusion, based on IOCs they published on\nGitHub:\n\n_Figure 93 – Sophos GitHub IOCs for supercombinating[.]com_\n_(https://github.com/sophoslabs/IoCs/blob/master/Ransomware-MountLocker.csv)_\n\nWe then discovered that all three of these domains had been observed serving Beacons.\n\n##### enter strongpity\n\nAfter investigating the supercombinating[.]com domain further, we noticed something peculiar; it had\npreviously resolved to the IP 91.92.109[.]174. This IP had another resolution within a similar timeframe:\nmentiononecommon[.]com\n\nThe name mentiononecommon[.]com is of particular interest to us, as Cisco Talos intelligence reported\nthat the APT group “StrongPity,” also known as “Promethium,” used this domain to serve its namesake\nmalware.\n\n\n**Cisco Talos**\n_PROMETHIUM extends global reach with StrongPity3 APT_\nhttps://blog.talosintelligence.com/2020/06/promethium-extends-with-strongpity3.html\n\n\nThree fi les attributed to StrongPity were served from this domain in 2020, according to VirusTotal.\n\n\n-----\n\n|SHA256|Filename|\n|---|---|\n|c936e01333e3260547a8c319d9cfc1811ba5793e182d0688db679ec2b30644c5|Installer.exe|\n|e843af007ac3f58e26d5427e537cdbddf33d118c79dfed831eee1ffcce474569|SecurityHost.exe|\n|8844d234d9e18e29f01ff8f64db70274c02953276a2cd1a1a05d07e7e1feb55c|SecurityHost.exe|\n\n\n_Table 29 – mentiononecommon[.]com StrongPity samples_\n\nBoth supercombinating[.]com and mentiononecommon[.]com resolved to the following IP, which alternated resolutions between the two domains at different overlapping time periods.\n\n**Domain** **First Seen** **Last Seen**\n\nmentiononecommon[.]com 2020-03-14 2021-03-05\n\nsupercombinating[.]com 2020-07-20 2020-09-27\n\n_Table 30 - First/last seen timestamps for mentiononecommon[.]com and supercombinating[.]com_\n\nThis is more evident when we look at VirusTotal’s display of Passive DNS Replication, where the resolution of 91.92.109[.]174 alternates between the two domains of interest.\n\n_Figure 94 - Alternating Resolutions of 91.92.109[.]174 according to VirusTotal_\n\nNot only this, but the domain mentiononecommon was registered to a ProtonMail address with a similar\nnaming convention, which also has WHOIS registrant information pointing to Russia. The domain registrant email address associated with the WHOIS record is timofei66[@]protonmail[.]com.\n\n|Domain|First Seen|Last Seen|\n|---|---|---|\n|mentiononecommon[.]com|2020-03-14|2021-03-05|\n|supercombinating[.]com|2020-07-20|2020-09-27|\n\n\n-----\n\n##### enter phobos\n\nInitially we thought we had found a link between StrongPity and MountLocker through the entanglement\nof supercombinating and mentiononecommon. Our working theory changed when we saw Phobos ransomware being deployed from the same C2 server as MountLocker, as shown in the following fi gure\nand confi rmed by the Any.Run sandbox report mentioned by The DFIR Report.\n\n_Figure 95 – The Phobos link_\n\nThis presented a bit of a conundrum. Are these ransomware operators actually in cahoots?\n\nIf MountLocker owned the infrastructure, then the chance would be slim that another ransomware operator was also working from it. Additionally, in several instances a delay was observed between initial\ncompromise using Cobalt Strike and further ransomware being deployed. Based on these factors, we\ncan infer that the infrastructure is not that of StrongPity, MountLocker, or Phobos, but of a fourth group;\none we believe is an IAB that we named and continue to track as Zebra2104.\n\nThis further demonstrates the power of intelligence correlation. From just one lead derived from the\nCobalt Strike scanner, combined with OSINT, we now have valuable intelligence on the actions of four\ndifferent threat actors. Not only this, but we can also provide a level of context into their operations to\nSOC analysis and incident responders during related incidents.\n\n\n**BlackBerry ThreatVector Blog**\n_For more a more in-depth look at this threat actor and our subsequent fi ndings - make sure to check_\n_out our blog:_\nhttps://blogs.blackberry.com/en/2021/11/zebra2104\n\n\n-----\n\n##### hidden dragon\n\nFor clusters where there are no existing intelligence overlaps with available OSINT, there can be many\nbenefi ts in taking the time to dig more closely into IOC relationships. This can lead to the uncovering of\nadditional intelligence, even if it doesn’t always immediately lead to attribution.\n\nLet’s explore one such cluster that we shall dub “Hidden Dragon” (awesome logo to follow!).\n\nDelving into one of the larger C2SERVER clusters in our dataset, we can clearly spot several dubious\ncorrelations after exploring the history behind the network operator.\n\n_Figure 96 - Large cluster of Cobalt Strike Team Servers_\n\nThe central node in this cluster is the 168.206.191[.]222 IP address. This IP appears to be connected to\n240 unique Team Servers based on the C2SERVER values correlated from recovered Beacons.\n\nThe IP block 168.206.0[.]0/16, within which 99% of this Cobalt Strike network resides, is operated by\nthe Internet Service Provider (ISP) Clayer Limited (ASN 137951). It is based out of Hong Kong and is\ncurrently assigned to the organization The Atomic Energy Board. The only other ISP owning infrastructure that forms a part of this network, IP 45.88.6[.]84, is ASLINE Limited (ASN 18013), also based out\nof Hong Kong.\n\n\n-----\n\nAs reported by the South African news outlet, mybroadband.co.za, the IP block 168.206.0[.]0/16 – containing a total of 65,536 individual addresses – was part of a large chunk of IP address space that\nwas stolen from AFRINIC, the regional Internet Registry for Africa. This theft was carried out by a malicious insider, who subsequently sold the netblock on the grey market for somewhere in the region of\nR20,512,768 (African Rands), which equates to approximately $1.4 million USD. The confirmed owner\nof this IP block is “NECSA,” Nuclear Energy Corporation of South Africa, a name that is similar to the IP\nblock’s currently assigned organization: The Atomic Energy Board.\n\n**mybroadband.co.za**\n_The Great African IP Address Heist – South African Internet resources worth R558 million usurped with_\n_shady domains_\nhttps://mybroadband.co.za/news/security/367188-the-great-african-ip-address-heist-south-africaninternet-resources-worth-r558-million-usurped-with-shady-domains.html\n\nAt the time of publishing (November 2020), the MyBroadband blog reports that the very same IP block\nwas under active route squatting. Route squatting is where an unauthorized operator “squats” on a\nblock of IP addresses that do not belong to it. The ISPs Clayer and ASLINE are the reported route squatters for this IP block. The latest report from AFRINIC still marks this IP block as “under dispute” as of\nJanuary 2021.\n\n\n**African Network Information Centre**\n_AFRINIC WHOIS DATABASE ACCURACY REPORT_\nhttps://afrinic.net/ast/pdf/afrinic-whois-audit-report-full-20210121.pdf\n\n\nAll the servers within this cluster are running the most popular leaked version of Cobalt Strike 4.0 and\nthey are configured to serve Beacon payloads on ports 9999 and 9998 (the WebSphere Application\nServer Liberty Profile port).\n\nAll Beacons pillaged from the Team Servers are reverse HTTP payloads, each employing the default\nMalleable C2 profile. They leave very little in the way of unique configuration values to distinguish them\nfrom most other payloads. However, the SSL public key (81a3eeb8ceb74cf508f6bcfc408e0305) relates\nto 2053 Beacon payloads across 240 Team Servers in our dataset, allowing us to group these IPs together with a high degree of confidence.\n\nWhile we may not currently be able to attribute the “Hidden Dragon” infrastructure to a known threat\ngroup, it will be only a matter of time before at least one IP is attributed by threat intelligence analysts.\nAt that point, the dominos will tumble. But in the meantime, we can at least provide limited intelligence\nif these IPs are observed during incidents.\n\n##### recap\n\nLet's quickly recap all we’ve done so far. We've followed our CTI lifecycle, built an automation system\nfor hunting Team Servers, pillaged Beacons, and parsed configuration data. We've explored the configuration settings in-depth to uncover insights and trends, and we’ve discovered further clustering techniques. Leveraging OSINT and the new clustering capabilities, we’ve correlated intelligence. This allows\nus to differentiate the many APT groups, campaigns, access brokers and other nefarious cybercriminals, from the intended customer for Cobalt Strike, which is red teams and pentesters.\n\nNow it's time to disseminate our findings and revaluate key stages of the lifecycle in a debrief.\n\n\n-----\n\n### chapter six\n\n## DEBRIEF\n\nIn this final chapter, we’ll reassess the CTI questions defined in the planning and direction phase, and the\nsteps undertaken during each subsequent phase to arrive at our solution. We’ll then recap the insights,\ntrends, observations, and discoveries uncovered throughout the CTI lifecycle as they pertain to each of\nour key stakeholders, and how the data can be leveraged to enhance detection and correlation capabilities across the XDR solution space.\n\n##### planning & direction\n\n_“How do we proactively defend against Cobalt Strike?”_\n\nWe discussed how this question was too broad to allow for adequate concentration on the desired\noutcome. So, it had to be broken into more focused, direct, closed-loop questions for various XDR stakeholders:\n\n_“How can we improve incident correlation and reduce alert fatigue?” – SOC Team_\n\n_“How can we fine-tune EDR to detect Beacon payloads?” – Product Engineering_\n\n_“What features are helpful for training models to classify Cobalt Strike_\n_Beacon payloads and configurations?” – Data Science_\n\n_“How can we improve correlation and campaign tracking relating to Cobalt Strike?” – Incident Response_\n\n_“How can we track Team Servers and campaigns?” – Threat Intelligence_\n\nWe also highlighted that the by-product of directed intelligence efforts still has a use, and that feeding\ncontextualized information into an XDR-capable platform has benefits to teams beyond the stakeholder\nwho requested the intelligence.\n\n##### collection\n\nCollection is the first phase of an intelligence-led, proactive defense posture.\n\nIn the collection phase, the aim was to generate a list of potential Cobalt Strike Team Servers while\nkeeping false positives to a minimum. This ensures that the data collected is relevant, accurate and\n(most importantly) timely: That is to say, it’s collected before anyone is targeted.\n\nWhile several options were possible, we opted to demonstrate how to build a system that leverages data\ncollected by public Internet scanning services in order to lower the barrier to entry for organizations.\n\n\n-----\n\nIn this regard, we demonstrated how to craft several queries based on some of Cobalt Strike’s known\ncharacteristics that can be used to discover active Team Server Infrastructure, such as:\n\n    - Cobalt related HTTP response headers\n\n    - SSL JARM fingerprints\n\n    - SSL certificate serial numbers\n\n    - Malleable C2 profile settings\n\nWith queries crafted and data gathered, we discussed how a Team Server stages its Beacons and how\nwe might use this knowledge to our advantage to obtain said Beacons for further analysis.\n\nAs part of this, we provided some Python scripts that can be leveraged in your own systems, so you may\nstart to pillage and plunder Team Servers before they can do the same to you.\n\n##### processing\n\nWith a bounty of Beacons in hand, we started the process of extracting the “configgy goodness” that will\nprovide the information from which we will extract our Intelligence.\n\nThe first step was to separate the wheat from the chaff, so to speak. We removed any invalid payloads\nfrom our dataset based on size and data type.\n\nNext, we discussed how to decode the shellcode-based payloads to make it possible for us to access\nthe embedded PE and its config. This involved extracting the XOR key and payload size from the shellcode and performing the differential XOR decode process.\n\nOnce the PE was decoded, we discussed the Beacons’ config formatting, its structure and its XOR encoding. These are details which are essential for the config extraction process.\n\nWith our newfound understanding of the structure of each setting in the config, we touched on how\nautomation of this final step (config extraction) would be possible.\n\nFrom here, the analysis and intelligence dissemination phases can take place.\n\n##### analysis\n\nThe insights, trends and discoveries uncovered during the analysis phase have been leveraged to enhance detection and correlation capabilities for various products and services within our XDR solution\nspace, including anti-malware, EDR and SOC services.\n\nLet’s review how some of this information was of benefit.\n\n##### insights\n\nThe insights uncovered during the analysis phase included a raft of host and network-based indicators.\nFrom IPs, netblocks and certificates, to process names, injection techniques and pipe names, this information is fed to blocklists to enhance detection. It is also correlated to provide intelligence insights for\nvarious products and services.\n\nFor BlackBerry, these insights are used to inform and enhance our various commercial cybersecurity\nproducts and service offerings. For you, the information can be similarly distributed across your internal\nXDR framework to provide an additional layer of protection against Cobalt Strike vector attacks.\n\n\n-----\n\n##### trends\n\nThe frequency of configuration settings, deployment of Team Servers and prevalence of Beacons helps\nus to fine-tune EDR rules for alerting purposes. Knowing the most popular configuration values, such as\nnamed pipes or target processes for injections, can help analysts and investigators to swiftly craft rules\nto grab most low-hanging fruit with a high degree of confidence.\n\n##### discoveries\n\nPerhaps the biggest revelation during the analysis phase was the discovery of what can best be described as hidden watermarks embedded in Beacon configurations.\n\nAfter considerable analysis, it appears that the SSL public key embedded in configs can often be used\nto cluster Beacons configured on the same server, while the misleadingly named PROCINJ_STUB can\nbe used to track which Team Server builds were used. The DEPRECATED_SPAWNTO configuration can\nalso be used to perform clustering in some instances.\n\nThese sparsely documented “hidden watermarks” have proved invaluable for enhancing intelligence\ncorrelation (more so than the actual watermark setting!).\n\n##### dissemination\n\nAfter enriching our dataset during the human analysis phase, we were ready to disseminate our research and findings to our various stakeholders.\n\nLet’s look at how some of the data was consumed by various teams and XDR product and services\nstakeholders.\n\n##### threat intelligence\n\nAs demonstrated under the “Beacon of Hope” chapter, the main benefit to threat intelligence has been\nincreased correlation with known threat groups. This led to greater confidence when performing attribution and a broader understanding of active threat groups and campaigns.\n\nThe “watermark” values have allowed us to perform some powerful monitoring, by tracking values such\nas the SSL public keys to cluster Beacons and Team Servers.\n\nWe can then use these values to further our knowledge and understanding of campaigns, as well as\nproduce some cool graphs and charts to keep our management team happy!\n\n\n-----\n\n_Figure 97 – Cobalt Strike detections by industry vertical_\n\nWe can use this information to correlate against detections originating on endpoints we protect and\nmonitor. In instances where we have details of threat groups, we can immediately deploy our IR teams\nto engage with the clients, providing them with full campaign details and indicators before they even\ncomplete a compromise assessment.\n\nWith IABs increasingly establishing a foothold, then deploying Beacon and selling access to the highest bidder within a matter of days, this speedy response can present a brief window of opportunity to\ndisrupt campaigns before more (often fi nancially motivated) threats are deployed. It also presents the\npossibility of separately tracking threat actors who solely perform IAB services vs. those who deploy\nransomware and other threats, as in the case of StrongPity/MountLocker/Phobos.\n\n##### threat hunting\n\nOnce equipped with the dataset, our internal threat hunting teams wasted no time in identifying Team\nServer traffi c and Beacons from a variety of sources, including private data feeds and online malware\nrepositories, such as VirusTotal.\n\nPart of the reason for Cobalt Strike’s prominence is that, when it is confi gured carefully, it can operate\nsurreptitiously. When packaged and deployed with additional care, it can be used to evade detection in\nmany security solutions and services. While most security vendors fare perfectly well at detecting and\nblocking Cobalt Strike Beacon payloads on disk, when it’s deployed in-memory via complex stagers,\nthings get a little more complicated due to transformations and injection techniques.\n\nOne such example our threat hunters uncovered was a strange process connecting to a known Team\nServer IP. The process was odd, in that it was clearly a legitimate version of Java, used to invoke an\nopen-source web server application developed by Oracle, called GlassFish. After some research, it was\ndiscovered that the threat group called WINNTI has been exploiting a remote code execution vulnerability in GlassFish webservers to deploy Cobalt Strike Beacon payloads against selected targets.\n\nHaving the ability to hunt for and monitor Team Server IPs is invaluable. It helps to not only improve the\neffi cacy of cybersecurity products and services, which is far and away the main aim, but also to uncover\nnew and exciting intelligence fi ndings. In this instance, we found an exploitable web server application\n\n\n-----\n\nand further TTPs employed by the WINNTI group. Our customers benefit from enhanced protection and\nmonitoring, and we all get richer in shared intel!\n\n\n**NTT**\n_The Operations of Winnti group_\nhttps://hello.global.ntt/-/media/ntt/global/insights/white-papers/the-operations-of-winnti-group.pdf\n\n\n##### incident response\n\nUnsurprisingly, our incident response team frequently encounters Cobalt Strike Beacon at the heart\nof their investigations. To that end, correlating our dataset with public and private intelligence allows\nincident responders to perform attribution with a higher degree of accuracy. They can also correlate\nincident and campaign timelines, as well as uncover related IOCs to use for hunting during live investigations and compromise assessments. This helps them perform further actor and campaign profiling,\nand it offers the chance to gather further contextual information around Team Servers. This in turn\nleads to better intelligence production, enhanced alerting capabilities and more publishable research\nopportunities across the XDR solutions and services space.\n\n##### forensics\n\nOn that face of it, the dataset might not seem overly beneficial to forensic analysts. However, mining the\ndata for common filenames, module and export names, profile strings, rich headers and import hashes\nprovides a wealth of generic indicators that can be leveraged to assist in cybersecurity forensics. As\nmentioned, Cobalt Strike Beacon payloads often reside entirely in-memory, and sometimes under exploited processes. Being able to quickly and efficiently ascertain whether Beacon is active on a system\nwhen looking at a memory dump can be highly beneficial to investigators.\n\nTo that end, keyword files can be crafted and used to grep memory for common strings, and YARA rules\ncan be written to detect fragments of Malleable C2 profiles. Additionally, automatically correlating IPs\nfound in-memory with Team Server infrastructure via your forensic framework of choice offers a powerful mechanism to aid further forensic workflows, such as automatically extracting and processing\nBeacon payloads and configurations from memory.\n\n##### data science\n\nHaving a curated and labelled dataset comprised of Beacons, parsed configuration settings and intelligence correlations presents a couple of interesting opportunities for the application of machine\nlearning.\n\nThe first, perhaps most obvious application, is the identification of Beacon DLLs for classification purposes. Using the corpus of Beacon payloads pillaged from Team Servers, we can train a variety of supervised machine learning (ML) models using methods such as KNN and SVC to classify Cobalt Strike\nBeacon payloads accurately and reliably based on PE file features.\n\nThe second, perhaps less obvious application, is the identification of clusters of infrastructure belonging\nto individual threat groups. To do this, we first need to figure out how best to coerce Beacon configuration settings into usable ML training features (for example, hashing strings and performing hamming\ndistance calculations against Malleable C2 profiles). Then we can train a classifier to not only spot relationships between configurations, but also to reveal what decisions led to those conclusions. This can\nlead to the discovery of new intelligence and allow us to determine if previously unseen Beacons relate\nto known groups and campaigns.\n\n\n-----\n\n_Figure 98 – Covariance ranking of features used to train a Cobalt Strike Beacon detection model_\n_(feature labels redacted)_\n\nWe plan to revisit this topic more in-depth in a future book!\n\n##### soc\n\nSOC analysts can take the enriched dataset and begin to select common indicators with which to build\nrules for alerting. The most obvious data to consume fi rst is the IP and port listings, as well as URIs, certifi cate information and module names. These are typically indicators that most EDR platforms support\nand that tend to yield high-confi dence alerts.\n\nIn general, anything that benefi ts the SOC also benefi ts our XDR products and services. We can use\ncorrelation techniques to improve the accuracy of alerts, thereby reducing alert fatigue. But we can also\nbegin to provide context and meaning beyond simply tagging traffi c as originating from Cobalt Strike\nBeacon.\n\nThese days, the most powerful opportunity for SOC analysts is in identifying threat groups from incident\nalerts and providing actionable intelligence alongside contextual details. This will empower analysts\nand responders alike in their decision-making and case-handling from the moment an incident occurs.\n\n##### red team\n\nAlthough red teams were not a direct stakeholder in any phase of our CTI lifecycle, it’s worth spending\nsome time considering the implications of some of the fi ndings with respect to OPSEC when deploying\nCobalt Strike.\n\nThe fi rst consideration is around the general hardening of Team Server infrastructure. We’ve observed\n\n\n-----\n\nseveral threat groups deploying complex tunnelling mechanisms to obscure their C2 infrastructure in\nthe past, and we expect this to become more commonplace, especially as it helps to defeat automated\nhunting systems. From SOCKS proxies to TOR fronting, SSH tunnelling and general IP hardening, we\nexpect red teamers and threat actors will likely step up their game with respect to network OPSEC.\n\nThe next major consideration concerns the new “watermarks”, and the possibilities that now exist for\ntracking Team Server operators based on these hidden values. Whilst some of the values may be trivially spoofed without harming the functionality of Beacon, such as the PROCINJ_STUB and DEPRECAT_ED_SPAWNTO, others, like the SSL public key, cannot be tampered with as easily without breaking the_\nC2 check-in process. This would leave operators with little choice but to rotate public/private keys often,\nwhich would likely be a hassle to perform with any regularity.\n\nIt might seem like creating a highly customized Beacon would be an obvious choice for attackers. But\nthat’s the beauty of this method of correlation. While the intention of many bad actors was to use Cobalt\nStrike to blend in with the crowd, it is now becoming apparent that there is sufficient “uniqueness” in\nBeacon configurations to track and monitor users.\n\nThe main consideration for attackers when deploying Cobalt Strike these days is how best to strike a\nbalance when customizing Beacon. Use a default Malleable C2 profile and you risk being easily blocked\non the endpoint, while conversely, if you supply a highly customized profile, you risk being easily tracked.\nFinally, a perhaps more drastic approach to evade detection would be to write your own customized\nport of Beacon to interoperate with Team Server. This is exactly the method that researchers at Intezer\nrecently discovered, with a Linux port of Beacon build for RedHat distributions and leveraging OpenSSL\nfor cryptography. Interestingly, the new Beacon, dubbed Vermilion Strike, retains the configuration data\nfrom Windows Beacons (simply ignoring irrelevant settings), meaning the possibility for clustering on\nthe SSL public key and other hidden watermarks still exists.\n\n\n**Intezer**\n_Vermilion Strike: Linux and Windows Re-implementation of Cobalt Strike_\nhttps://www.intezer.com/blog/malware-analysis/vermilionstrike-reimplementation-cobaltstrike/\n\n\nDefenders and attackers will continue to play the cat and mouse game. We wait for the inevitable advances in OPSEC with bated breath.\n\n\n-----\n\n##### evaluation and feedback\n\nThe evaluation and feedback stage has led to continuous improvement throughout the CTI lifecycle, and\nindeed, will most likely continue to yield improvements long after this book has been published.\n\nDuring the early phase of the lifecycle, most feedback was focused on enhancing our automation platform, with the primary focus on producing more intelligence data to allow us greater options for clustering. Initially we started with a dataset mostly comprising parsed Beacon configuration data, but over\ntime, this has grown considerably to ultimately include:\n\n**Team Server information**\n\n    - First/Last seen dates and times\n\n    - Certificate name/serial/domain/hash\n\n    - Geolocation\n\n   - ASN\n\n    - Netblock\n**Beacon configuration**\n\n    - Configuration settings\n\n    - Time zone offset\n\n    - Malleable C2 profile identification\n\n    - Domain fronting\n\n    - Rich headers\n\n    - Import hashes\n\n    - Compile times\n\n   - Module name\n\n    - Exports\n**Miscellaneous**\n\n    - Threat actor\n\n    - Labels\n\n    - OSINT correlation\n\nSince disseminating the dataset to our various stakeholders, feedback is becoming more tailored to\neach consumer’s specific circumstances. Some stakeholders require confidence ratings for IP blocklists, others want real-time updates for new Team Servers and Beacons discovered in the wild, while\nsome want charts and graphs to plot the Cobalt landscape. Some of these tasks take minutes to complete, while others are perhaps slightly more involved, and will feed back into our software development\nlifecycle for planning and implementation.\n\n##### fulfilling the xdr mission\n\nAs the CTI discipline matures, we find the process becoming less of an art and more of a science. This\nnewly emerging intelligence paradigm has led to huge benefits for cyber awareness across all security\nproducts and services in the XDR solution space. Intelligence-led protection will pave the way for smarter, more unified security services with increased awareness. Greater intelligence and awareness will\nultimately lead to significant gains in machine-based detection capabilities, as well as superior real-time\ncontextual information.\n\nCombining the holistic view of the security landscape offered by XDR with contextual intelligence and\ndeep insights offers many exciting new opportunities in the cybersecurity arena. One such avenue, machine-based decision-making in response to incidents, seems imminently achievable. By automatically\nderiving playbooks from contextual intelligence correlated with alerts, we can potentially greatly aid\ndecision making and case management in response to incidents for SOC and IR teams alike.\n\n\n-----\n\n##### beyond the hype and back again\n\nA final word on CTI; we created this book as a case study highlighting the importance of the lifecycle,\nand how to think about the processes that may be required. There are ideas on building a data-gathering\nand intelligence-creation pipeline, using automation to collect and ingest data, correlating what you are\nseeing, and linking to existing research.\n\nWe tried to frame this as a defined, structured approach; one that needs to be repeatable. In this way,\nit’s more science, and less art. While all of this is true, working in this field is immensely rewarding and\nat times, downright awesome.\n\nDon’t take the seriousness with which we’ve talked about frameworks and proper procedures in this\nbook as meaning you will have less fun. The truth is quite the opposite: By ensuring you have the right\nprocesses and technology in place, the people working with the data will have more time to focus on the\ncool shi… stuff. It provides the base from which to let creativity flow.\n\nBeing involved in the work of threat intelligence often does not feel like a job. The rush when a hypothesis is proven correct is addictive. So too is the personal challenge you can set for yourself when you\nexperience a moment of finding your hypothesis is wrong. Wanting, even needing, to understand the\ndata and why you were wrong is intoxicating.\n\nOur lofty hope is that this book can be used to help teams understand the environment they operate in,\nto make better decisions. We hope to get you to a point of taking proactive measures to stop or detect\nmalice sooner. And we want more people to experience the rush of doing this important work.\n\nTo all the analysts, researchers, IR, SOC and intelligence teams reading this, we hope you’re having as\nmuch fun as we are in making the world a better, safer place.\n\n_– The BlackBerry Research and Intelligence Team_\n\n\n-----\n\n##### Disclaimer\n\n_The information contained in this book is intended for educational purposes only. BlackBerry does_\n_not guarantee or take responsibility for the accuracy, completeness and reliability of any third-party_\n_statements or research referenced herein. The analysis expressed in this report reflects the current_\n_understanding of available information by our research analysts and may be subject to change as_\n_additional information is made known to us. Readers are responsible for exercising their own due_\n_diligence when applying this information to their private and professional lives. BlackBerry does not_\n_condone any malicious use or misuse of information presented in this report._\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/FINDING%20BEACONS%20IN%20THE%20DARK%201650728751599.pdf",
        "https://www.blackberry.com/content/dam/blackberry-com/asset/enterprise/pdf/direct/bb-ebook-finding-beacons-in-the-dark.pdf",
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-15 - Finding Beacons in the Dark - A Guide to CTI (X).pdf"
    ],
    "report_names": [
        "FINDING BEACONS IN THE DARK 1650728751599",
        "bb-ebook-finding-beacons-in-the-dark.pdf",
        "2021-11-15 - Finding Beacons in the Dark - A Guide to CTI (X).pdf"
    ],
    "threat_actors": [
        {
            "id": "c72c09b8-81ba-4e6e-9094-cd84ee4bda79",
            "created_at": "2022-10-25T15:50:23.667393Z",
            "updated_at": "2025-03-27T02:00:55.517974Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [
                "CostaRicto"
            ],
            "source_name": "MITRE:CostaRicto",
            "tools": [
                "PowerSploit",
                "SombRAT",
                "PsExec",
                "PS1",
                "CostaBricks"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b77f9b40-dca7-449d-819e-115cd2295b41",
            "created_at": "2022-10-25T16:07:23.502671Z",
            "updated_at": "2025-03-27T02:02:09.834738Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "ETDA:CostaRicto",
            "tools": [
                "CostaBricks",
                "PowerSploit",
                "PsExec",
                "SombRAT",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab9d6b30-7c60-4d0b-8f49-e2e913c28508",
            "created_at": "2022-10-25T16:07:24.584775Z",
            "updated_at": "2025-03-27T02:02:10.289029Z",
            "deleted_at": null,
            "main_name": "UNC1878",
            "aliases": [],
            "source_name": "ETDA:UNC1878",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "Ryuk",
                "Team9Backdoor",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "115cf618-02a8-42b8-8d25-305292eafedb",
            "created_at": "2023-11-21T02:00:07.396534Z",
            "updated_at": "2025-03-27T02:00:03.251048Z",
            "deleted_at": null,
            "main_name": "CostaRicto",
            "aliases": [],
            "source_name": "MISPGALAXY:CostaRicto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7583fbd4-2bc9-458d-81da-50b27b84e136",
            "created_at": "2023-02-15T02:01:49.565258Z",
            "updated_at": "2025-03-27T02:00:03.113558Z",
            "deleted_at": null,
            "main_name": "TA575",
            "aliases": [],
            "source_name": "MISPGALAXY:TA575",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "49822165-5541-423d-8808-1c0a9448d588",
            "created_at": "2022-10-25T16:07:23.384093Z",
            "updated_at": "2025-03-27T02:02:09.772829Z",
            "deleted_at": null,
            "main_name": "Barium",
            "aliases": [
                "Brass Typhoon",
                "Pigfish"
            ],
            "source_name": "ETDA:Barium",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Barlaiy",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "POISONPLUG",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1f6ae238-765f-4495-9d54-6a7883d7a319",
            "created_at": "2022-10-25T16:07:24.573456Z",
            "updated_at": "2025-03-27T02:02:10.284644Z",
            "deleted_at": null,
            "main_name": "TA511",
            "aliases": [
                "MAN1",
                "Moskalvzapoe"
            ],
            "source_name": "ETDA:TA511",
            "tools": [
                "Agentemis",
                "Chanitor",
                "Cobalt Strike",
                "CobaltStrike",
                "Ficker Stealer",
                "Hancitor",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0a4f4edc-ea8c-4a30-8ded-35394e29de01",
            "created_at": "2023-01-06T13:46:39.178183Z",
            "updated_at": "2025-03-27T02:00:03.014032Z",
            "deleted_at": null,
            "main_name": "UNC1878",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC1878",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "542cf9d0-9c68-428c-aff8-81b6f59dc985",
            "created_at": "2023-02-15T02:01:49.554105Z",
            "updated_at": "2025-03-27T02:00:03.110991Z",
            "deleted_at": null,
            "main_name": "Moskalvzapoe",
            "aliases": [
                "MAN1",
                "TA511"
            ],
            "source_name": "MISPGALAXY:Moskalvzapoe",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a6c351ea-01f1-4c9b-af75-cfbb3b269ed3",
            "created_at": "2023-01-06T13:46:39.390649Z",
            "updated_at": "2025-03-27T02:00:03.072899Z",
            "deleted_at": null,
            "main_name": "Kinsing",
            "aliases": [
                "Money Libra"
            ],
            "source_name": "MISPGALAXY:Kinsing",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1636992868,
    "ts_modification_date": 1636992877,
    "files": {
        "pdf": "https://archive.orkl.eu/423f5a4c910cbb9c0c31136fa8ffbbf9dcafd0e2.pdf",
        "text": "https://archive.orkl.eu/423f5a4c910cbb9c0c31136fa8ffbbf9dcafd0e2.txt",
        "img": "https://archive.orkl.eu/423f5a4c910cbb9c0c31136fa8ffbbf9dcafd0e2.jpg"
    }
}