{
    "id": "bd5a0c40-0916-495f-baae-596a1654cbd8",
    "created_at": "2023-06-05T02:06:16.249518Z",
    "updated_at": "2025-03-27T02:17:01.946158Z",
    "deleted_at": null,
    "sha1_hash": "78968ffb1a8fbafa2142feb5db5660fc83cc611b",
    "title": "2023-04-18 - DDosia Project- How NoName057(16) is trying to improve the efficiency of DDoS attacks",
    "authors": "",
    "file_creation_date": "2023-06-04T12:27:05Z",
    "file_modification_date": "2023-06-04T12:27:05Z",
    "file_size": 755365,
    "plain_text": "# DDosia Project: How NoName057(16) is trying to improve the efficiency of DDoS attacks\n\n**decoded.avast.io/martinchlumecky/ddosia-project-how-noname05716-is-trying-to-improve-the-efficiency-of-ddos-**\nattacks/\n\nApril 18, 2023\n\nby [Martin ChlumeckýApril 18, 202314 min read](https://decoded.avast.io/author/martinchlumecky/)\n\nThrough their DDosia project, pro-Russia hacktivist group NoName057(16) is still\nconducting DDoS attacks, mostly with the goal to take offline websites of institutions and\ncompanies in European countries. On its Telegram channels, the group openly\ncommunicates the fact that they perform their actions in support of Russia in the war\nagainst Ukraine, and it’s apparent that their activities will further continue during the war.\nThe group has been offering payments in cryptocurrencies to people who install their\nDDosia tool in order to participate in their attacks. We want to create awareness that people\nwho have NoName057(16)’s DDoS tool installed on their computer not only participate in\ncybercrime, but also support the groups’ warfare activities.\n\nWe detect and block DDosia to make the internet a safer place, and we continue to track\nDDoS victims and configurations of the DDosia botnet because such information helps to\nmitigate the impact of DDoS attacks.\n\nSince the first Python version needed to be more efficient, the group released a new Go\n[variant of bots in late 2022. SentinelLabs has described the first variant of the Go](https://www.sentinelone.com/labs/noname05716-the-pro-russian-hacktivist-group-targeting-nato)\nimplementation, including the C2 servers at that time active. A few days later, [Team Cymru](https://www.team-cymru.com/post/a-blog-with-noname)\npublished an investigation about the botnet architecture describing the DDoS attacks as a\nlargely static infrastructure.\n\nGiven the above findings, it is apparent that the C2 structure is still evolving. The primary\npurpose of the following analysis is to explore the C2 architecture and current\ncommunication process between the botnet and C2 servers. Therefore, we have been\n\n\n-----\n\nactively monitoring the DDosia botnet and have found several innovations in the bot\nimplementation and the botnet infrastructure. The C2 infrastructure is composed of one\ncentral server and two proxies forwarding bot requests. This, combined with an update\nmechanism, makes the botnet rather resilient to disruptions. The latest versions also\ninclude a bot authentication mechanism for all the C2 communication along with IP address\nblocklisting, presumably to hinder tracking of the project.\n\n## Implementation Overview\n\nThe first implementation of DDosia came into the world around July 2022. Being authored\nby the NoName057(16) group, there was interestingly a brief coexistence with the Bobik\nbotnet before the botnet was dismantled, presumably in favor of DDosia. It was written in\nPython using threads as a means of parallelism; nevertheless, it was still lacking in terms of\nefficacy. Since the first version, DDosia relied on HTTP protocol for C2 communication, with\nJSON configs distributed by the servers.\n\nThe lack of efficacy presumably motivated changes in DDosia, namely the move from\n[Python to Go that we saw in late 2022, with SentinelLabs describing the first Go variants.](https://www.sentinelone.com/labs/noname05716-the-pro-russian-hacktivist-group-targeting-nato)\nThe main advantage of Go in comparison to Python is direct compilation into native code\nalong with the absence of Python’s GIL that may severely affect the performance of\nthreaded code in Python. Interestingly, these new versions are also multi-platform, as we’ve\nseen variants for all major operating systems (Windows, macOS, Linux, Android). Evidently,\nthe bot development is still in progress, as we see new functionalities, such as HTTP\nauthentication, being added to DDosia along with slight changes in the configuration file.\n\n\n-----\n\n_Console output of the Go-Stresser version 1.0 – variant 1_\n\n## Go Implementation\n\nLet’s take a closer look at the second variant of DDosia bot from March 6, 2023, that came\nup with the authentication mechanism, presumably to combat researchers snooping for lists\nof targets.\n\n\n-----\n\n_Console output of the Go-Stresser version 1.0 – variant 2_\nBuild Package\n\nThe aforementioned variant has support for multiple architecture as well as multiple\nplatforms; unsurprisingly, it is also written in Go. The builds are distributed via the Telegram\nchannel “Project DDosia” in the form of a zip file with the builds as follows:\n\nWindows x64 and arm64\nLinux x64 and arm64\nmacOS x64 and arm64\n\nThe names of the executable are changed sometimes; there is a list of the captured names:\n\ndosia_app_(windows|macos|linux)_(x64|arm64)\nd_(win|mac|linux)_(x64|arm64)\npd_(win|mac|linux)_(x64|arm64)\ndosia_(win|mac|linux)_(x64|arm64)\n\nExecution Workflow\n\nA working dir of the bot executable must contain a text file client_id.txt with the User```\nHash of the registered user. The form of the User-Hash is a BCrypt hash with these\n\n```\nparameters $2a$16$.\n\n\n-----\n\nThe first outcome communication is to use nordvpn.com to get detailed information about\nthe bot IP address that is sent to the C2 server. The second outcome is to use C2 as a POST\nmethod to /login URL with data representing information about the bot IP, user ID, and bot\nidentification.\n\n_Login to C2_\nThe Client-Hash is the result of a library that returns the OS native machine UUID/GUID. It\n[is an open-source implementation of Go MachineID by Denis Brodbeck. The Client-hash](https://github.com/denisbrodbeck/machineid#unique-key-reliability)\nhas a suffix representing the current PID (5481 in this case).\n\n_Login response from C2 during login_\nIf the authentication is successful, C2 returns HTTP/1.1 200 OK with a token in the form of\nepoch/Unix timestamp, and the target configuration can then be downloaded via GET\n```\n/client/get_targets. The first variant of the DDosia bot does not implement any\n\n```\nauthentication mechanism, but the valid token is necessary to get the target configuration\nsuccessfully in the current C2 architecture; otherwise, 401 Unauthorized is returned.\n\n\n-----\n\n_Getting targets from C2_\nThe returned JSON file is similar to the first variant, with the difference that the original\nJSON configuration is wrapped up in a data key. Additionally, the new key token is included\nin each response of GET /client/get_targets. The token is a fresh token for further\ncommunication.\n\n_The new form of returned configuration_\nThe new configuration supports four attack types: http, http2, nginx_loris, and tcp. The rest\nof the items are the same as SentinelLabs, and we described previously; see C&C\nCommunication and [SentinelLabs.](https://www.sentinelone.com/labs/noname05716-the-pro-russian-hacktivist-group-targeting-nato)\n\nWhen the login and get targets operation are successful, the bot creates approximately 20\nworking threads that perform the DDoS attack using a synchronized method since the bot\ncounts the number of successful connections. Therefore, the bot waits for an attacked\nserver response; if the response is 200, the attempt is counted as a successful attack.\nSubsequently, the newest bot implementation is eight times faster than the initial\nimplementation in Python.\n\nContinuous statistics are sent each ~four minutes back to the C2 server through POST\n```\n/set_attack_count.\n\n```\n\n-----\n\n_Sending the attacks’ statistics back to C2_\nThese statistics help the attacker track the target configuration’s effectiveness and respond\nin time with a new configuration. If everything goes as expected, a new target configuration\nis requested every ~10 minutes. However, sometimes the C2 server is unable to handle\nrequests, and a connection cannot be established. In this case, the bot continues on the\nlatest target configuration and tries to contact C2 later. Figure 1 provides an overview of the\ncommunication between the C2 server and a bot.\n\n\n-----\n\n**Figure 1. C2**\n\ncommunication workflow\n\n## Bot Updater\n\nOne of the unknowns remains the question of the bot updates. Our investigations into this\narea are still in progress, and we are trying to confirm our hypothesis that there is an\nautomatic bot updater.\n\nWe’ve observed a few takedowns of C2 servers and new build releases in the last months.\nWe expected a delay of several days between the bot updates and further DDoS attacks.\nHowever, the time between the C2 takedown and the new DDoS attacks was several hours.\n\n\n-----\n\nTherefore, our hypothesis is that there is an automatic updater since it is improbable to\nmanually update approximately 7,200 independent clients within several hours.\n\nThe count of new bot releases was considerable in the last four months, as Figure 2\nillustrates. So, there should be some automatic updater.\n\n**Figure 2. DDosia executable hits**\n\n### C2 Protection\n\nAll C2 servers have used HTTP protocol to communicate, which was unencrypted. So, it\nwas only a matter of time before the DDosia authors tried to implement a mechanism to\nprotect the target configurations.\n\nTemporary DNS Records\n\nThe first attempt to implement the protection mechanism was around January 28, 2023.\nThe main idea was to use temporary DNS records, which are rotated every midnight. The\nDNS record is then reconfigured to a non-existent record. As a result of the 24-hour period,\nthe initial DNS record is not captured by any online monitoring services, so the history of\nDNS records includes only the non-existent or invalid records. Consequently, the valid IP\naddress of C2 severe is not recorded anywhere, and it would not be easy to find them.\n\nThis mechanism has been seen in the cases on January 28-29, 2023. Two builds with\nhardcoded DNS records were set to non-existent IPs after midnight. The next day, the new\nbuilds with new DNS records were released.\n\n\n-----\n\nFor example, deac48f968269bb5e75ceb9417f6680d8787a03ba0768e25d8716f189a079574\nbuild has two DNS records (pkcds2cas7.ignorelist.com,\n```\npqw2vsi21mx74.twilightparadox.com) that led to 212.73.134.208. However, the DNS\n\n```\nrecords were reconfigured to 127.0.0.2 from midnight on January 27-28, 2023. So, if you\nresolve the DNS records today, you cannot resolve the initial IP since the address is already\nuntraceable.\n\nThe same case was seen from midnight on January 28-29, 2023, on the\n```\n5c1be24a5fa75b70c50515a061d2d3ce911b785188328408edc0a79dfc5e3173 build. The\n\n```\nother two DNS records (trafficsearch.ddns.net, trafficanalyzer.bounceme.net) led to\n```\n94.140.115.129. The DNS records were also reconfigured to invalid IP addresses; namely\n0.0.0.0.\n\n```\nImplementing this mechanism was probably not successful because the count of reported\ntargets on the group telegram was lower on January 28, as Figure 3 demonstrates.\nMoreover, there were reported taken-down domains from the previous target configuration.\nFinally, the build that was released on January 30 contained hard-coded IP addresses of\nthe C2 server (94.140.114.239).\n\nRequest Authentication\n\nThe second attempt to implement the protection mechanism was on March 7, 2023. The\ncommunication with the C2 server is also via HTTP, but a token mechanism was designed\nand realized. Therefore, anybody cannot download the target configuration (list of attacked\ndomains) freely without authentication as before.\n\n\n-----\n\n**Figure 4.**\n\nAuthentication mechanism\nThe first communication with the C2 server is the login request, as described above in\n**Figure 4. First, the request must include the header User-Hash, which users obtain during**\nthe registration process in the DDosia Project Telegram channel. The other necessary\ncondition is data about the GeoIP of the bot. If the IP address or ISP of the given bot is on\nthe blocklist (e.g. Avast), the authentication process ends with 401 Unauthorized.\nHowever, if the authentication is successful, the login request reruns the token in the string\nform.\n\nThe token is valid for approximately 15 minutes, and the constant 0xF must be added each\ntime the token is used for the following requests to the C2 servers. The adjusted token is\nincluded in the HTTP header as a Time entry, and each response then consists of a new\nfresh token value.\n\n## C2 Architecture\n\nThe C2 architecture is dynamically changing. We noticed four IP addresses related to the\nDDosia project since the beginning of 2023. Three addresses are active web servers run on\nUbuntu using nginx/1.18.0. More importantly, these web servers return the same target\nconfigurations and provide the services like logging into the botnet as well as reporting\nstatistics to the attackers. The currently discovered C2 architecture of the DDosia project is\nshown in Figure 5.\n\n\n-----\n\n**Figure 5. C2 architecture**\nUsing HTTP, the central C2 server (M) is contacted by proxy C2 servers P1 and P2\nthroughout port 5001. The DDosia bots reach the proxy servers also using HTTP via port\n```\n80, where requests are forwarded to the central server. Any suspicious outcome from the\n\n```\nprimary server has not been detected yet. However, one suspicious server or client\ncommunicates, especially with the primary and P2 servers. We recorded the most network\nactivity of a suspicious IP (161.35.199.2) around February 14, 2023. The purpose of this\nsuspicious machine is still unknown, but it can be a testing or monitoring service.\n\nBesides the bots’ communication over port 80, we detected connections on port 22 for both\nproxy servers. The transmission on port 22 is not implemented in the bot executables we\nanalyze, but our telemetry indicates a higher communication volume. However, most\ncaptured IPs contacting port 22 are suspicious due to port scans or SSH brute force\nattacks.\n\nIn addition, the C2 infrastructure relies heavily on proxy servers which contributes to the\nresilience of DDosia’s infrastructure. Nevertheless, our monitoring revealed that outages\nindicated by 502 Bad Gateway error responses from the proxy servers. The first significant\ndisruption occurred during the deployment of the authentication mechanism. The outage\n\n\n-----\n\nlasted for several hours – the duration and the timing indicates that development issues\nmay have been responsible. The root of the problem seems to be partially fixed as recent\noutages were resolved within one hour.\n\n## DDosia Tracking\n\nWe still continue to monitor the DDosia project targets and the count of users that have\njoined the project. We will publish detailed information about the targets, configurations, and\nvolunteers in a subsequent post. Figure 6 illustrates a quick overview.\n\n\n-----\n\n**Figure 6. Attacked countries and trend of the joined users**\nWe’ve also observed that DDosia’s community is steadily growing, though there can be\ndoubts about the capacity new members can contribute. Nevertheless, it seems that in this\nspecific case, a volunteer-based model is rather efficient and easier to manage than a\n\n\n-----\n\nmalware-based botnet; however, its availability is probably enabled by the political\ncircumstances.\n\n## Conclusion\n\nIt is evident that the project is still in development, and NoName057(16) is trying to improve\nthe efficiency of the DDoS attacks. They are trying to move to a more efficient Go platform\nbecause the pilot variant written in Python was lacking in performance.\n\nMany of the changes seem to be motivated by protecting the target configuration and C2\narchitecture secrecy. Hence, the latest version of DDosia bots has realized the\nauthentication mechanism for C2 communication.\n\nOur most interesting observation was probably the implementation of an update mechanism\nin the client since previous updates caused only short-term disruptions to the project’s\neffectiveness. This has also increased the resilience of the C2 mechanism, as it is no longer\nnecessary to do a manual update after a server takedown. The update mechanism is still\nunder our investigation. In a future blog post, we plan to release a more detailed analysis of\nthe tracker’s historical data.\n\n## References\n\n[Tagged asbotnet,](https://decoded.avast.io/tag/botnet/) [ddos](https://decoded.avast.io/tag/ddos/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-18 - DDosia Project- How NoName057(16) is trying to improve the efficiency of DDoS attacks.pdf"
    ],
    "report_names": [
        "2023-04-18 - DDosia Project- How NoName057(16) is trying to improve the efficiency of DDoS attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "b05a0147-3a98-44d3-9b42-90d43f626a8b",
            "created_at": "2023-01-06T13:46:39.467088Z",
            "updated_at": "2025-03-27T02:00:03.100909Z",
            "deleted_at": null,
            "main_name": "NoName057(16)",
            "aliases": [
                "Nnm05716",
                "NoName057",
                "NoName05716",
                "05716nnm"
            ],
            "source_name": "MISPGALAXY:NoName057(16)",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1685930776,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1685881625,
    "ts_modification_date": 1685881625,
    "files": {
        "pdf": "https://archive.orkl.eu/78968ffb1a8fbafa2142feb5db5660fc83cc611b.pdf",
        "text": "https://archive.orkl.eu/78968ffb1a8fbafa2142feb5db5660fc83cc611b.txt",
        "img": "https://archive.orkl.eu/78968ffb1a8fbafa2142feb5db5660fc83cc611b.jpg"
    }
}