{
    "id": "bd755ddd-5fab-4ed7-80f2-e8d6d3cb854f",
    "created_at": "2023-01-12T15:09:29.704969Z",
    "updated_at": "2025-03-27T02:05:21.298746Z",
    "deleted_at": null,
    "sha1_hash": "5c130cc0a7b9f966d4f7dcaa84ff9dd5b9cf8900",
    "title": "2016-10-01 - Source Code for IoT Botnet ‘Mirai’ Released",
    "authors": "",
    "file_creation_date": "2019-06-02T13:52:59Z",
    "file_modification_date": "2019-06-02T13:53:13Z",
    "file_size": 2736410,
    "plain_text": "###### Confidence in the Connected World\n\n\n_™_\n\n\n###### Confidence in the Connected World\n\n### Year in Review\n\n\n-----\n\n###### Welcome Message\n\n In 2018, CIS once again demonstrated the importance of our role as an independent, global leader in cybersecurity.\n\n Among our most notable accomplishments was the creation of the Elections Infrastructure Information Sharing & Analysis Center® (EI-ISAC®). Using the guiding principle of “We can achieve more collectively,” CIS entered the election security arena with the EI-ISAC in March. In a parallel landmark development, CIS led the collaborative production of A Handbook for Elections Infrastructure Security to help election officials and their technical support teams defend U.S. election systems and networks vital to our functioning democracy.\n\n\n**A Handbook for**\n\n**Elections**\n**Infrastructure**\n**Security**\n\n★ ★ ★ ★ ★★ ★ ★ ★ ★\n\n\n-----\n\n###### 3\n\n\n###### 1,500\n\n\n###### Throughout the remainder of 2018, the EI-ISAC grew to include all 50 states and almost 1,500 total members, including many local election officials and their technical staff members, election technology vendors, and federal partners. In 10 scant months, the EI-ISAC became the fastest-growing ISAC in history. The EI-ISAC also deployed network monitoring sensors, called “Albert sensors,” to help protect the most critical elements of our election infrastructure.\n\n By sharing information about the threat landscape, monitoring network activity for malicious traffic, educating election officials about cybersecurity, and identifying necessary technical cybersecurity controls, the EI-ISAC helped the U.S. election community make substantial strides toward ensuring the security and integrity of our elections.\n\n During the primaries and mid-term elections, the EI-ISAC sponsored an online National Cyber Situational Awareness Room, which connected election offices across the nation with the U.S. Department of Homeland Security, the FBI, and the EI-ISAC Security Operations Center. The Situation Room provided real-time awareness of cyber threats as well as physical incidents.\n\n\n###### identifying necessary technical cybersecurity controls, the EI-ISAC helped the U.S. election community make substantial strides toward ensuring the security and integrity of our elections.\n\n During the primaries and mid-term elections, the EI-ISAC sponsored an online National Cyber Situational Awareness Room, which connected election offices across the nation with the U.S. Department of Homeland Security, the FBI, and the EI-ISAC Security Operations Center. The Situation Room provided real-time awareness of cyber threats as well as physical incidents.\n\n\n-----\n\n###### 5,000 +3,000\n#### 150[%]\n\n###### During 2018, the Multi-State Information Sharing & Analysis Center® (MS-ISAC®) added more than 3,000 new members to reach 5,000 members. Overall membership saw a 150 percent increase. MS-ISAC municipal government members now cover 80 percent of the U.S. population. Our partnership with state and local government organizations and the Department of Homeland Security continues to grow stronger with increased depth and breadth of the intelligence provided through the MS-ISAC monitoring, information sharing, and cyber education missions.\n\n CIS also greatly expanded the quality and quantity of our product offerings this year. In January 2018, CIS launched an effort to provide complimentary CIS SecureSuite® subscriptions to all U.S. state, local, tribal, and territorial governments. These organizations now have access to this suite of powerful tools and CIS support services, which will simplify implementation and enforcement of high priority security controls. \n\n\n###### new members to reach 5,000 members. Overall membership saw a 150 percent increase. MS-ISAC municipal government members now cover 80 percent of the U.S. population. Our partnership with state and local government organizations and the Department of Homeland Security continues to grow stronger with increased depth and breadth of the intelligence provided through the MS-ISAC monitoring, information sharing, and cyber education missions.\n\n CIS also greatly expanded the quality and quantity of our product offerings this year. In January 2018, CIS launched an effort to provide complimentary CIS SecureSuite® subscriptions to all U.S. state, local, tribal, and territorial governments. These organizations now have access to this suite of powerful tools and CIS support services, which will simplify implementation and enforcement of high priority security controls. \n\n\n-----\n\n###### +160 million hours\n\n In 2018, the number of CIS Hardened Images™ available for Amazon Web Services®, Microsoft® Azure, and Google Cloud® platforms was significantly increased. Cloud customers used more than 160 million machine hours of CIS Hardened Images in 2018. These cloud services have emerged as our fastest-growing and most impactful products.\n\n The CIS Controls™ continue to set the standard for best practices in cyber defense as recognized by leading organizations around the world. Global recognition included the European Telecommunications Standards Institute, now globally known as ETSI, updating its compendium of Technical Reports to include the CIS Controls. In addition, the Aerospace Industries Association (AIA) embraced the CIS Controls as the basis for their Cyber Standard Practice document. \n\n\n###### 5\n\n\n###### impactful\n\n ndard for best ng ognition rds\n\n\n###### In 2018, the number of CIS Hardened Images™ available\n Cloud® platforms was significantly increased. Cloud customers used more than 160 million machine hours of CIS Hardened Images in 2018. These cloud services have emerged as our fastest-growing and most\n\n\n###### Numerous additions were made to the portfolio of companion guides for these CIS best practice standards, including the Implementation Guide for Industrial Control Systems, which provides cyber defense guidance for Industrial Control System environments. In addition, CIS released the CIS Risk Assessment Methodology (CIS RAM), to assist organizations in assessing overall organizational cyber risks. To date, the CIS Controls have been downloaded more than 157,000 times.\n\n These 2018 achievements reflect the unwavering commitment by the CIS team to help safeguard organizations of all sizes against cyber threats—in short, to continue our mission to deliver Confidence in the Connected World.  Sincerely,\n\n**John M. Gilligan**\n\n\n###### 157K\n Downloads\n\n\n###### including the Systems\n\n Connected World.\n\n\n-----\n\n###### At a Glance\n\n\n#### %\n\n# 36\n###### CIS grew its workforce by 36 percent\n\n\n-----\n\n###### 2018\n\n\n-----\n\n###### CIS Benchmarks\n\n##### 1M+ 32\n\n###### CIS Benchmarks CIS Benchmarks downloads developed\n or updated\n\n\n-----\n\n###### 9\n\n##### 31 148 30+\n\n###### CIS Benchmarks CIS Benchmarks Active CIS developed or publicly available Benchmarks in updated in communities formats to support covering multiple assessment and technology implementation platforms\n\n\n-----\n\n###### CIS SecureSuite\n\n\n###### 6,800[+]\n SecureSuite membership increased to more than 6,800 members in 2018.\n\n\n###### CIS Services provided vulnerability assessments, and managed security services, social engineering/ phishing services, and penetration testing services\n\n\n-----\n\n###### 2018 CIS SecureSuite Members by Industry* 11\n\n0.7% Education\n\n1.4% Education Public Schools & Colleges\nPrivate Schools & Colleges\n\n0.3% Restaurants & Lodging\n1.7% International Government\nSLTT\n\n0.3% Education\nCommercial Education/Training\n\n1.8% Media & Entertainment\n\n2.4% Travel & Transportation\n\n21.1% Financial Services\n\n3% Retail\n\n3% Telecommunications\n\n4.1% Not-for-Profit\n\n4.6% Energy/Utilities\nPrivate\n\n15.7% IT Consulting/Services\n\n5% Government\nNational/Federal\n\n5.3% Insurance\n\n5.9% Healthcare\n\n8.3% High Tech Mfg &\n**Value Added Reseller**\n\n7.6% Manufacturing & Consumer Goods 7.7% Business Services\nNon-IT or Financial\n\n- Percentages above exclude U.S. state, local, territorial and tribal\ngovernments and public academic institutions\n\n\n-----\n\n###### CIS Hardened Images\n\n CIS became the Seller of Record for CIS Hardened Images™ in the AWS Marketplace® in 2018. CIS expanded offerings in the AWS Marketplace to include CIS Hardened Images for Ubuntu® 18.04 and Amazon Linux® 2. CIS also released our first container base image using Ubuntu 16.04. CIS Hardened Images for Red Hat® Enterprise Linux 6 and 7, SUSE® Linux 12, and Ubuntu 18.04 were released in the Microsoft® Azure Marketplace. Additionally, CIS Hardened Images for SUSE Linux 11 and 12 and Ubuntu 18.04 were released in Google Cloud Platform™.\n\n\n-----\n\n###### 13\n\n\n###### Current number of CIS Hardened Images by provider:\n\n Amazon Web Services® \n\n  Microsoft® Azure                                19\n\n  Google Cloud Platform[™]           15\n\n 2018 Combined CIS Hardened Images Hours and Usage by Technology\n\n60,000,000\n\n50,000,000\n\n40,000,000\n\n30,000,000\n\n20,000,000\n\n10,000,000\n\n\n###### Azure GCP\n\n\n###### Amazon Web Services® \n\n\n-----\n\n###### CIS Controls\n\n\n###### Overview Developed by a global community of experienced IT practitioners, the CIS Controls are a technology- and vendor-independent set of concise, prioritized cybersecurity actions and best practices. The CIS Controls team successfully increased global awareness and adoption of this actionable set of best practices, while simultaneously producing extensive new guidance content in 2018. \n\n\n-----\n\n###### 15\n\n\n###### The CIS Controls Version 7 was launched in the first quarter of this year. New features in CIS Controls Version 7 include:\n •[ Improved consistency and simplification of the  ] wording of each Sub-Control\n •[ Implementation of “one ask” per Sub-Control]\n •[ More focus on authentication, encryption, ] and application white listing\n •[ Better accounting for security technology ] and emerging security problems\n •[ Better alignment with other frameworks ] (such as the NIST CSF)\n •[ Supports the development of related products ] (e.g., measurements/metrics, implementation guides)\n •[ Identifies types of CIS Controls (basic, foundational,  ] and organizational)\n\n Paraguay Government\n\n The government of Paraguay formally approved the use of CIS Controls Version 7 as the cybersecurity baseline for all government institutions. Implementation of the CIS Controls 1-6, considered the basic Controls, will start in February 2020. The goal is full implementation of all CIS Controls by 2024.\n\n\n-----\n\n##### V7\n\n\n##### V7\n\n\n-----\n\n###### 17\n • [CIS Controls V7 Measures and Metrics][ – The CIS]\n Controls are organized in a hierarchal structure. There are 20 Controls that are further divided into 171 Sub-Controls. As more organizations are adopting this set of best practices, there is an increased interest in being able to measure and manage their implementation of the 171 Sub-Controls. CIS Controls V7 Measures and Metrics addresses how to measure if a Sub-Control has been implemented successfully based on Six Sigma levels. Six Sigma is a data-driven approach to quality, which works to reduce variation and the associated defects, wastes, and risks in any process.\n\n • [The CIS Controls team started work with the ]\n University of North Carolina at Charlotte to develop criteria for objectively measuring each of the 171 Sub-Controls. The primary focus will be on measuring the different levels of the three implementation groups. This work will pave the way for the future creation of automated tools that will measure the CIS Controls implementation.\n\n\n-----\n\n###### MS-ISAC\n\n\n-----\n\n###### 19\n\n\n###### 75,571\n\n\n###### 18,300[+]\n\n\n###### Analyzed over 18,300 pieces of suspected malware\n\n\n-----\n\n###### SLTT\n  669\n\n\n###### The Multi-State Information Sharing & Analysis Center (MS-ISAC), with financial support from the Department of Homeland Security, continued its mission to improve the cybersecurity posture of the nation’s state, local, tribal, and territorial (SLTT) governments through focused cyber threat identification, protection, detection, response, and recovery activities this year. Individual sectors within our membership all saw marked increases in growth throughout the year. MS-ISAC tribal government membership increased by 81 percent, K-12 schools by 333 percent, and public utilities by 125 percent.\n\n MS-ISAC also runs the Nationwide Cybersecurity Review (NCSR), which provides insight on the level of maturity and risk awareness of the SLTT’s information security programs from year to year. DHS and MS-ISAC use the results of this report to work on improving the cybersecurity of the SLTT community.\n\n The results of the 2018 NCSR are based on participation from 669 SLTT entities in 43 states. They include 277 local governments (representing 43 states), six tribes, and 343 state agencies (representing 24 states). An analysis of this year’s results showed that state, local, and tribal peer groups continued to report overall scores which fell below the recommended minimum maturity level.\n\n All NCSR participants continue to identify the same top five security concerns over the past four years:\n\n •[ Lack of sufficient funding]\n •[ Increasing sophistication of threats]\n •[ Lack of documented processes]\n •[ Emerging technologies]\n •[ Inadequate availability of cybersecurity professionals ]\n\n\n###### SLTT Entities\n\n\n-----\n\n-----\n\n###### EI-ISAC The EI-ISAC is a voluntary and collaborative effort based on a strong partnership between CIS, the DHS Cybersecurity and Infrastructure Security Agency (CISA), and the Election Infrastructure Subsector Government Coordinating Council (EIS-GCC).\n\n During 2018, the EI-ISAC evolved from an idea to a formalized collective of dedicated election officials, their staff members, associations, technology vendors, federal partners, and cybersecurity experts working tirelessly to help secure the U.S. elections infrastructure.\n\n\n###### The EI-ISAC was conceived as a means of leveraging the many capabilities and the infrastructure of the MS-ISAC. The integration of the two continued after the EI-ISAC’s formal launch in March. Both the MS-ISAC and EI-ISAC benefit by operating under the auspices of CIS. This allows them to work together to educate and protect SLTT governments from the myriad cyber threats that are aimed at both the traditional government IT systems and those specific to elections.\n\n Both ISACs continue to utilize centralized, and in many cases shared, resources to enable a greater level of visibility and information-sharing across the elections and the SLTT government sectors to benefit the constituencies of both organizations. Everything from webcasts to workgroups to in-person meetings integrates the needs of both ISACs, offering efficiency and consistency for the Membership.\n\n\n-----\n\n###### 23\n\n\n###### 2018 EI-ISAC Membership Growth\n\n1600\n\n1400\n\n1200\n\n1000\n\n800\n\n600\n\n400\n\n200\n\n0\n\n###### ISACs Combined Security Best Practice Recommendations and Tools\n •[ Security Operations Center (SOC) providing 24/7/365 ] incident triage and immediate responses\n •[ Computer Emergency Response Team (CERT) to] provide incident responses and forensic services\n •[ Cyber Threat Intelligence Team to provide ] forward-leaning analysis, written products, and presentations\n •[ Engineering Team to provide sensor deployment and ] technical assistance\n •[ Stakeholder Engagement Team to provide member  ] support and engagement\n •[ Election-specific and general threat intelligence and  ] vulnerability monitoring\n •[ National Cyber Situational Awareness Room to ] monitor election activity\n •[ Training sessions and webinars]\n\n The EI-ISAC will continue to operate in partnership with members and stakeholders nationwide to ensure the\n f\n\n\n-----\n\n###### CIS CyberMarket\n\n\n###### CIS CyberMarket® continues to serve the U.S. state and local government communities by identifying top- notch cybersecurity vendors, vetting them through the CIS CyberMarket Product Review Board, and then negotiating a significant discount for CIS CyberMarket partners. In 2018, our government partners saved more than $11 million on software and services provided by SANS and other vendors.\n\n CIS continued to expand these partnerships this year by adding solution providers including Belarc and Akamai, who are offering our members new and innovative cyber defense tools. \n\n CIS CyberMarket\n\n\n-----\n\n###### $11 million+ saved\n\n CIS CyberMarket staff also continue to leverage the expertise of our partners and CIS subject matter experts by sharing their knowledge in our Cybersecurity Quarterly. This digital publication features articles on how to implement best practices, summaries of recent cyber threats and attacks, and other cyber defense information crucial to state and local governments.\n\n\n###### 25\n\n\n-----\n\n###### CIS Leadership\n\n Officers & Board of Directors\n\n Officers\n\n William Pelgrin Chairman Co-Founder and Partner CyberWA Inc.\n\n John M. Gilligan CEO and President Center for Internet Security\n\n Bruce Moulton Treasurer Retired\n\n Deirdre O’Callaghan Secretary and Chief Counsel Center for Internet Security\n\n\n###### Directors\n\n Jack Arthur Octo Consulting Group\n\n Dr. Ramon Barquin President and CEO Barquin International\n\n Jane Holl Lute \n\n Christopher Painter\n\n Alan Paller Founder and Director of Research SANS Institute\n\n Franklin Reeder  Co-Founder Center for Internet Security\n\n Richard Schaeffer Advisor Riverbank Associates LLC\n\n Roberta Stempfley Director, CERT Division Software Engineering Institute\n\n Phil Venables Managing Director and Chief Information Risk Officer Goldman Sachs & Co.\n\n\n###### Founder and Director of Research SANS Institute\n Secretary and Chief Counsel Center for Internet Security Franklin Reeder \n Co-Founder Center for Internet Security\n\n Richard Schaeffer Advisor Riverbank Associates LLC\n\n Roberta Stempfley Director, CERT Division Software Engineering Institute\n\n Phil Venables Managing Director and Chief Information Risk Officer Goldman Sachs & Co.\n\n\n-----\n\n###### Executive Team\n\n Sean Atkinson Chief Information Security Officer\n\n Brian Calkin Chief Technology Officer\n\n Carolyn Comer Chief Human Resources Officer\n\n Gina Chapman Chief of Staff\n\n Thomas Duffy Senior Vice President Operations and Services Chair, Multi-State ISAC\n\n Curtis Dukes Executive Vice President General Manager Security Best Practices\n\n\n###### Meg Keyes     Senior Vice President Sales and Business Services\n\n Angelo Marcotullio Chief Information Officer\n\n Tony Sager Senior Vice President and Chief Evangelist\n\n Albert Szesnat Chief Financial Officer\n\n\n-----\n\n###### Twitter twitter.com/CISecurity\n\n LinkedIn linkedin.com/company/122681\n\n Instagram instagram.com/cisecurity\n\n Facebook facebook.com/CenterforIntSec\n\n YouTube youtube.com/user/TheCISecurity\n\n 31 Tech Valley Drive East Greenbush, New York 12061 518.266.3460 Fax 518.266.2085  www.cisecurity.org\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/CIS - Year in Review - 2018.pdf"
    ],
    "report_names": [
        "CIS - Year in Review - 2018.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536169,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1559483579,
    "ts_modification_date": 1559483593,
    "files": {
        "pdf": "https://archive.orkl.eu/5c130cc0a7b9f966d4f7dcaa84ff9dd5b9cf8900.pdf",
        "text": "https://archive.orkl.eu/5c130cc0a7b9f966d4f7dcaa84ff9dd5b9cf8900.txt",
        "img": "https://archive.orkl.eu/5c130cc0a7b9f966d4f7dcaa84ff9dd5b9cf8900.jpg"
    }
}