{
    "id": "bda965b5-ce75-4bba-8f1d-8e507020663e",
    "created_at": "2023-01-12T15:03:00.960898Z",
    "updated_at": "2025-03-27T02:17:01.226291Z",
    "deleted_at": null,
    "sha1_hash": "71cd5d4538f8bb3f97d236d24cd47389af8bd795",
    "title": "2022-04-27 - New APT Group Earth Berberoka Targets Gambling Websites With Old and New Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:22:03Z",
    "file_modification_date": "2022-05-28T15:22:03Z",
    "file_size": 217865,
    "plain_text": "# New APT Group Earth Berberoka Targets Gambling Websites With Old and New Malware\n\n**[trendmicro.com/en_us/research/22/d/new-apt-group-earth-berberoka-targets-gambling-websites-with-old.html](https://www.trendmicro.com/en_us/research/22/d/new-apt-group-earth-berberoka-targets-gambling-websites-with-old.html)**\n\nApril 27, 2022\n\nWe recently found a new advanced persistent threat (APT) group that we have dubbed Earth\nBerberoka (aka GamblingPuppet). This APT group targets gambling websites on Windows,\nmacOS, and Linux platforms using old and new malware families.\n\nBy: Daniel Lunghi, Jaromir Horejsi April 27, 2022 Read time: ( words)\n\nWe recently discovered a new advanced persistent threat (APT) group that we have dubbed\nEarth Berberoka (aka GamblingPuppet). Based on our analysis, this group targets gambling\nwebsites. Our investigation has also uncovered that Earth Berberoka targets the Windows,\nLinux, and macOS platforms, and uses malware families that have been historically\nattributed to Chinese-speaking individuals.\n\nIn this blog entry, we provide an overview of the Windows malware families used by Earth\nBerberoka in its campaign. This malware lineup includes tried-and-tested malware families\nthat have been upgraded, such as PlugX and Gh0st RAT, and a brand-new multistage\nmalware family that we have dubbed PuppetLoader.\n\nWe discuss the full technical details of Earth Berberoka’s malware families aimed at Linux\nand macOS as well as Windows, infection vectors, targets, and possible connections with\nother APT groups in our research paper “Operation Earth Berberoka: An Analysis of a\nMultivector and Multiplatform APT Campaign Targeting Online Gambling Sites.”\n\n## Technical analysis\n\n**PuppetLoader**\n\nWe discovered a new malware family that we have dubbed PuppetLoader. It is a complex,\nfive-stage malware family that uses some interesting techniques, including hijacking loaded\nmodules to launch malicious code and hiding malicious payloads and modules in modified\nbitmap image (BMP) files.\n\n**_Stage 1: Obfuscator and loader_**\n\n_Incorrect RC4 implementation_\n\n\n-----\n\nIn this stage, a blob of payload data is decrypted using a hard-coded key\n(2726c6aea9970bb95211304705b5f595) and what appears to be an RC4 (Rivest Cipher 4)\nalgorithm. However, the cipher’s “swap” operation in the pseudorandom generation part of\nthe cipher code was improperly implemented. This resulted in the proper encryption of only\nthe headers and the first few sections of the payload, while the latter sections were left\nalmost entirely in clear text.\n\nIt seems that this hard-coded key and flawed RC4 implementation were also used in a\nmalware family named TigerPlug, probably because it spreads the PlugX malware. We found\nno public reporting of its behavior and features.\n\n_Hijacking loaded module_\n\nAfter the payload is decrypted, it is loaded in the machine’s memory and is executed using a\nstealthy method: PuppetLoader starts by loading a legitimate DLL from the\nWindows\\System32 directory. The loading process is then hijacked to replace the legitimate\nlibrary with a malicious one. This is done by hooking NTDLL APIs such as\nNtQueryAttributesFile, NtOpenFile, NtCreateSection, NtMapViewOfSection, NtQuerySection\nand ZwClose.\n\nThe loader uses undocumented NTDLL APIs, such as RtlPushFrame, RtlPopFrame, and\nRtlGetFrame, to avoid recursive booking, which happens when a hooked function indirectly\ncalls itself.\n\nTo properly load the malicious payload, a frame tagged as “LDFM” is allocated and filled with\nthe necessary parameters, such as file names’ memory addresses and allocated buffer\nhandles or addresses that contain the malicious payload. After their values are identified,\nsome parameters are set immediately, while others are set at a later time.\n\nFigure 1.\n\nLDFM loading frame\nLdrLoadDll is then called to load a legitimate asyclfilt.dll library. Afterward, previously hooked\nAPI functions are called, resulting in the loaded DLL name’s being replaced with lz32.dll,\nwhich is a legitimate DLL. The content of this legitimate DLL is then replaced by a malicious\npayload that is inside the hooked NtMapViewOfSection function.\n\n\n-----\n\nThen, the LdrLoadDll function rebases the newly loaded malicious image and loads all of the\nneeded dependencies. The malware no longer needs the frame once the handle is returned\nfrom the LdrLoadDLL function, which is why it pops the frame by calling RtlPopFrame,\nunhooks previously hooked functions, and verifies whether the loading is successful or not\nby calling GetModuleHandleW (asycfilt.dll).\n\nThe malware then dynamically resolves the export function called Install and sets the\nparameter value to “11BF29E1371C0D83C530BD1BF346”, which decrypts to a function\ncalled OneTime. For its command-line parameters, PuppetLoader uses the same flawed\nRC4 implementation using the password “whk0q9ogev6ofg8d”.\n\nThese hijacking steps result in the following:\n\n[The loaded asycfilt.dll module can be seen by parsing the PEB_LDR_DATA structure](https://docs.microsoft.com/en-us/windows/win32/api/winternl/ns-winternl-peb_ldr_data)\nthat contains all loaded modules in the current process.\n\nFigure 2. asycfilt.dll shown among loaded\n\nmodule names\n\nlz32.dll is opened based on process monitoring tools.\n\nFigure 3.\n\nlz32.dll shown among opened files\n\nOnly PuppetLoader’s dropper payload is loaded and none of the previously mentioned\nlibraries is actually loaded.\n\n**_Stage 2: Dropper_**\n\nThe dropper creates and drops several files in an infected machine.\n\nFile Function\n\nCpuppetProcessFileSharer Used for sharing data during the different infection stages\n\nConfig.ini Saves the execution reason and the globally unique identifier\n(GUID) value based on ComputerName\n\n\n-----\n\nMSVCPX00.dll DLL file of BasicLoader\n\nverisign.bmp BMP file with encrypted Core\n\nbitmap.bmp BMP file with encrypted Client.MainConsole\n\nTable 1. The files created and dropped by the dropper\n\nThe hard-coded GUID ({78106D5F-CD1A-A8C4-A625-6863092B4BBA}) is inserted into\nCPuppetProcessFileSharer (C:\\\\Users\\\\Public\\\\Pictures\\\\Desktop.inf). We believe that it\nserves as a marker that stage 2 has been completed.\n\nConfig.ini (C:\\Users\\Public\\Videos\\Config.ini) contains the GUID and the reason, which is the\nhard-coded value “StartupBasicLoader” encrypted using a key (whk0q9ogev6ofg8d).\n\nThe svchost.exe is started in suspended mode with this command-line parameter:\n\n-cmd -NoModuleLoadDLL -DisplayName=KeepAuthority.Client.MainConsole.x64.Release InvokeMethodName=Run -InokeMethodParam=NULL”\n\nThis is also encrypted with the previously mentioned key and a new thread is created within\nsvchost.exe to make it load the BasicLoader payload, MSVCPX00.dll. It is interesting to note\nthat there is a typographical error in “-InokeMethodParam.”\n\n**_Stage 3: BasicLoader_**\n\nThe BasicLoader stage starts by adding a hard-coded GUID ({78106D5F-CD1A-A8C4-A6256863092B4BBA}) into CPuppetProcessFileSharer. As with stage 2, we believe that this is\nlikely a marker that stage 3 has started running.\n\nBasicLoader searches for BMP files across directories in Users\\\\Public (Desktop,\nDocuments, Downlaods, Music, Pictures, and Videos). It checks each directory for BMP files\nthat would pass the required structure. For the BMP files that do, the payload appended to\nthe BMP file is decrypted, loaded into memory, and executed. The BMP file is made up of\nonly 33 x 11 pixels and 338 bytes, and the data appended to it is the payload that is\nencrypted with the same flawed RC4 implementation.\n\nFigure 4. A small BMP file, to which encrypted payloads are appended\n\n**_Stage 4: Core_**\n\nThis stage begins when a hard-coded GUID ({7D8DA9DC-1F3B-2E5C-AA599418E652E4AA}) is added to CPuppetProcessFileSharer. Similar to the other stages, this is\nlikely a marker that stage 4 has started running.\n\n\n-----\n\nAfter this, the malware starts a system logger thread, where the logged information is\nreceived via a pipe and is saved to a file with a hard-coded name. The logged information\ncan come from other modules or processes. Based on our analysis, each log file entry is\nseparated by a separator (0xAABBCCDD), followed by a custom RC4 password and\nmessage length.\n\nThe decrypted log can include the following information:\n\nThe module that was run\nThe parameters at which this module was run\nAt which stage (GUID from CPuppetProcessFileSharer) the action was performed\n\nFigure 5. Decrypted log\n\nfrom Core\nThe following command-line arguments are also implemented during this stage:\n\n-DisplayName\n-InokeMethodParam (sic)\n-InvokeMethodName\n-NoModuleLoadDLL\n-LoadShellcode\n\nWhile the other arguments are mostly self-explanatory, we highlight two arguments worth\nnoting: -NoModuleLoadDLL uses the same technique as the stage 1 loader and LoadShellcode allocates a memory block, copies shellcode, and executes it.\n\n**_Stage 5: Client.MainConsole_**\n\nThis is the main client binary written in C++, which is the last stage of PuppetLoader’s\ninfection chain.\n\nThe code is structured in several classes that handle different tasks, such as managing the\ninteractive shell, uploading and downloading files, installing new modules, monitoring victim\nbehavior, and executing callback functions when conditions are met.\n\nCPipeCmdManager – interactive shell manager\n\nArguments:\n\n-flushusersession\n\n-createcmd\n\n-destorycmd (sic)\n\n\n-----\n\n-excutecmd\n\n-cmdkeepalive\n\nCommonLib::CcmdMulArgDecoder – command-line argument decoder, additional\nmodule related to command-line arguments\n\nArguments:\n\n-ModuleLog\n\n-LogText\n\n-ModuleID\n\n-ModuleVersion\n\n-MountStatus\n\n-Path\n\n-IsDelete\n\n-ModuleKeepAlive\n\n-UploadFile\n\nThe client then establishes communication with a command-and-control (C&C) server via\nUDP (User Datagram Protocol) and recognizes different types of custom UDP packets:\n\nUDP packet Description\n\nRemoteModuleCommandPacket Command to be executed by interactive shell\n\nRemoteModuleCommandResultPacket Result of running shell command\n\nFileTransferContent_Packet Determines whether to upload or download a file\n\nUploadFilePacket Uploaded file content\n\nFileManage_FolderContent_Packet Folder content\n\nVecProcessPacket Vector object with running processes\n\nInstallModulePacket BMP with encrypted module to be installed\n\nRemoteClientSystemInfoPacket Sent by login callback every time a new user\nlogs in\n\n\n-----\n\nModuleKeepAlivePacket Tells the C&C server that the connection is still\nalive\n\nTable 2. The custom UDP packets recognized by the client\n\nThe backdoor functions implemented in the main client are:\n\nInteractive shell\nUpload file\nDownload file\nList files\nTerminate process\nList processes\nInstall module\nLogin callback\nEnumerate RDP sessions\n\nThe communication protocol via UDP uses the same RC4 encryption. A sent and/or received\npacket contains a 16-byte RC4 key and the length of an RC4-encrypted payload, followed by\nanother packet with the encrypted payload itself.\n\n**oRAT**\n\nAnother malware family that we obtained both Windows and macOS samples of during our\ninvestigation was oRAT. Interestingly, this was the first time that we had analyzed samples of\nthis malware family written in the Go language.\n\nThe oRAT droppers that we found in our analysis were a MiMi chat application built using the\nElectron JS framework and a DMG (disk image) file. We discuss the full details of both in our\nresearch paper.\n\nThe samples are flagged as version 0.5.1 for both Windows and macOS samples, and have\nthe same features and configurations.\n\nThe configuration file and the AES decryption key are appended in an encrypted form to the\nPE (Portable Executable) file overlay.\n\nFigure 6. The decrypted oRAT configuration\n\n\n-----\n\nThe configuration is decrypted using the AES-GCM (AES with Galois/Counter Mode)\nalgorithm. The malware then parses it and enables the gateway or traffic forwarder mode if it\nis specified in the configuration settings.\n\nFor the malware operator to directly connect to an infected machine and execute commands\nvia GET or POST requests, the malware starts local servers on the infected machine to listen\non ports that have been specified in the configuration settings for control commands.\n\nThe network communications can be in plain text or encrypted, depending on the\nconfiguration of the file:\n\n“tcp” for plain text\n[“stcp” for encrypted TCP communications using the golang-tls library](https://github.com/denji/golang-tls)\n“sudp” for encrypted UDP traffic using the [Quic-go library](https://github.com/lucas-clemente/quic-go)\n\n[The control server is implemented by registering routes. This simple mechanism leads to](https://developpaper.com/understanding-the-implementation-of-http-server-in-golang/)\ntranslating GET/POST requests directly as internal Go commands. Requesting a URL\ntherefore results in executing the corresponding code on an infected system.\n\nWe obtained oRAT samples that register these routes:\n\nGET /agent/info\nGET /agent/ping\nPOST /agent/upload\nGET /agent/download\nGET /agent/screenshot\nGET /agent/zip\nGET /agent/unzip\nGET /agent/kill-self\nGET /agent/portscan\nGET /agent/proxy\nGET /agent/ssh\nGET /agent/net\n\n**PuppetDownloaders (C++ downloaders)**\n\nDuring our investigation, we also saw malicious websites that distribute fake Adobe Flash\nPlayer updates that were actually delivering C++ downloaders.\n\nThe infection starts with an executable written in C++ that connects through a Winsock API\nto a domain or IP address in a specific port. The downloaded content is saved as\nSMTemp.dat, and using the executable’s file name and a hard-coded XOR key, a file named\nLoader.dll is decrypted and copied to the disk. If the executable is renamed for whatever\nreason, the DLL decryption fails and the malware’s second stage does not go through.\n\n\n-----\n\nIf the SMTemp.dat file exists, the Loader.dll file executes it. After that, the loader decrypts a\nlegitimate Adobe Flash Player installer and executes it, in order to deceive the victim into\nthinking that the executable is a legitimate installer.\n\nDuring our investigation, we noted that the server hosting the second stage of the\nPuppetDownloaders malware payload was offline. It is also interesting to note that the string\ndecryption routine of this malware is a simple XOR with the string “2020-05-24 13:00:29” as\nits key. The first 13 bytes of the password that is used to decode the string are the same as\nthe last 13 bytes.\n\nFigure 7. XOR decryption routine\n\nWe dubbed these downloaders PuppetDownloaders since they are connected to the\nPuppetLoader malware family, as evidenced by our observations:\n\nThis malware and PuppetLoader both use the same string decryption routine that uses\nthe same key.\nThis malware and PuppetLoader both use the same XOR key\n(2726c6aea9970bb95211304705b5f595) that is used to decrypt the embedded\nLoader.dll file.\nThis malware and PuppetLoader’s decrypted Loader.dlls share similar strings such as\n“[-] UnExist pwszModuleFunName:”. This suggests that a common framework was\nused to compile both DLLs.\n\n**MFC socket downloaders**\n\nWe also saw WinRAR self-extracting (SFX) files dropping downloaders written using the\nMicrosoft Foundation Class Library (MFC) framework. These MFC socket downloaders have\nan identical structure: One function creates a socket, connects to a domain or IP address,\nsends a short string, and then calls “recv” twice.\n\nThe code flow is redirected through a call to EnumDesktopsA or EnumWindows, whose\ncallback function pointers point to the downloaded content.\n\n\n-----\n\nThe downloaders attempt to access ports 8080, 29527, and 8885. They also send the strings\n“feiji”, “@5436”, and “fhfgj@jfggdsg” to the sockets. We found multiple additional samples of\nthe same malware family that have the same structure and send the same strings. However,\nit is possible that multiple groups might be covertly sharing the source code for this malware.\n\n**PlugX**\n\n[PlugX is a remote access tool (RAT) that has been used as a malicious tool for espionage for](https://www.trendmicro.com/en_us/research/12/i/unplugging-plugx-capabilities.html)\nmore than a decade. We found that Earth Berberoka uses PlugX to target 32-bit and 64-bit\narchitectures, based on the samples we obtained and analyzed.\n\nThis malware family sends a DWORD, a 32-bit unsigned integer, in the HELLO packet. A\ncompromised system then sends the HELLO packet, which looks like a date in the\n“yyyymmdd” format, to the C&C server.\n\nWe found the following DWORDs in multiple samples we analyzed, which suggest that the\nversions we found were developed within the last three years: 20190520, 20201106, and\n20210804.\n\nAll of the samples we found are loaded in the same way: A legitimate and signed file that is\nvulnerable to DLL sideloading is placed alongside a malicious DLL, which decrypts and loads\nthe third file containing the final payload.\n\nOne of these malicious DLL files has the PDB (program database) path\nC:\\Users\\Administrator\\Desktop\\Plug7.0(Logger)\\logexts\\x64\\Release\\logexts.pdb.\n\n**Gh0st RAT**\n\nWe also saw at least three different variants of [Gh0st RAT, another malware family that has](https://attack.mitre.org/software/S0032/)\n[been in the wild for more than 10 years, being used in Earth Berberoka’s campaign. This](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ghostrat)\nmalware family’s source code is public, which is why it has many variants.\n\nOne of the variants we analyzed had an interesting destructive feature: It replaces the\nmaster boot record (MBR) to display an explicit message (“I am virus ! F*ck you :-)”). This\n[particular message was also seen in a public report from a victim of this Gh0st RAT variant.](https://d.thaihosttalk.com/t/i-am-virus-fuck-you/34081)\nA 2017 Industrial Control Systems Cyber Emergency Response Team (ICS-CERT) [report](https://www.cisa.gov/uscert/sites/default/files/documents/Destructive_Malware_White_Paper_S508C.pdf)\nalso discussed how Gh0st RAT variants wiped the MBR and replaced it with messages that\nvaried across different samples.\n\n**Other Known Malware Families**\n\nWe also found other legitimate tools being abused by Earth Berberoka and a malware family\nbeing used by the group in its campaign:\n\n[Quasar RAT – a Windows-based open-source RAT that has been used by APT groups](https://www.cisa.gov/uscert/ncas/analysis-reports/AR18-352A)\nfor network exploitation\n\n\n-----\n\n[AsyncRAT – an open-source RAT that can be used to remotely monitor and control](https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat)\ndevices via an encrypted connection\n[Trochilus – a stealthy RAT that can evade sandbox analysis and can be used in](https://securityaffairs.co/wordpress/43889/cyber-crime/new-rat-trochilus.html)\ncyberespionage campaigns\n\n## Security recommendations\n\nOur analysis points to Earth Berberoka’s having multiple tools and a large infrastructure at its\ndisposal to target the Southeast Asian gambling market. To avoid falling victim to Earth\nBerberoka’s attacks, users and operators of gambling websites can adopt the following\nsecurity recommendations:\n\nProperly vet emails, websites, and apps before clicking on links or downloading apps.\nDownload apps only from trusted sources.\nWatch out for malicious website flags, such as errors in grammar and spelling.\nBlock threats that arrive via email, such as malicious links, through hosted email\nsecurity and antispam protection.\nUse a multilayered security solution that helps with detecting, scanning, and blocking\nmalicious URLs.\n\nThe full technical details of our investigation can be found in our research paper, which we\n[will publish soon. We list down the indicators of compromise (IOCs) for Windows,](https://documents.trendmicro.com/assets/txt/earth-berberoka-windows-iocs-2.txt) [Linux, and](https://documents.trendmicro.com/assets/txt/earth-berberoka-linux-iocs-2.txt)\n[macOS in separate text files. We also provide the domain list in a separate text file.](https://documents.trendmicro.com/assets/txt/earth-berberoka-macos-iocs-2.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-27 - New APT Group Earth Berberoka Targets Gambling Websites With Old and New Malware.pdf"
    ],
    "report_names": [
        "2022-04-27 - New APT Group Earth Berberoka Targets Gambling Websites With Old and New Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "452d2d74-e812-45d6-b0fe-b8a6cc4ebd01",
            "created_at": "2022-10-25T16:07:23.562676Z",
            "updated_at": "2025-03-27T02:02:09.865955Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "ETDA:Earth Berberoka",
            "tools": [
                "Agent.dhwf",
                "AngryRebel",
                "AsyncRAT",
                "CinaRAT",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Kaba",
                "Korplug",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "PuppetLoader",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav",
                "Yggdrasil",
                "oRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2664d6f5-f918-4978-87f8-f6afad7402c6",
            "created_at": "2023-01-06T13:46:39.393669Z",
            "updated_at": "2025-03-27T02:00:03.073942Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "MISPGALAXY:Earth Berberoka",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535780,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653751323,
    "ts_modification_date": 1653751323,
    "files": {
        "pdf": "https://archive.orkl.eu/71cd5d4538f8bb3f97d236d24cd47389af8bd795.pdf",
        "text": "https://archive.orkl.eu/71cd5d4538f8bb3f97d236d24cd47389af8bd795.txt",
        "img": "https://archive.orkl.eu/71cd5d4538f8bb3f97d236d24cd47389af8bd795.jpg"
    }
}