{
    "id": "bdafc74a-0455-4f4d-8344-d3eb59943c85",
    "created_at": "2023-01-12T15:05:58.964756Z",
    "updated_at": "2025-03-27T02:16:25.674929Z",
    "deleted_at": null,
    "sha1_hash": "fe6d95de3e2ae5f71d91419f2dd8e4761209d7c6",
    "title": "2022-03-24 - Coper Banking Trojan- Android Malware Posing As Google Play Store App Installer",
    "authors": "",
    "file_creation_date": "2022-05-27T23:06:43Z",
    "file_modification_date": "2022-05-27T23:06:43Z",
    "file_size": 1779087,
    "plain_text": "# Coper Banking Trojan\n\n**blog.cyble.com/2022/03/24/coper-banking-trojan/**\n\n## Android Malware Posing as Google Play Store App Installer\n\n\nMarch 24, 2022\n\n\nDuring our routine Open-Source Intelligence (OSINT) research, Cyble Research Labs came across\nvarious malware samples of Coper malware from a third-party intelligence website. Coper is linked to\n**ExoBotCompat, a revised version of Exobot Android malware.**\n\nCoper malware apps are modular in design and include a multi-stage infection method and many\ndefensive tactics to survive removal attempts. Coper malware was initially discovered targeting\nColombian users around July 2021.\n\nNewer versions of the Coper Banking trojan have been observed targeting Android users in different\ncountries across Europe. They are anticipated to expand their scope to other regions in the future,\ntargeting a variety of banking apps worldwide.\n\n\n-----\n\nThis type of malware is generally known for impersonating financial institution apps called\n**Bancolombia Personas. Newer versions of the Coper malware also started to adopt impersonating**\nUtility apps.\n\nThe infection itself is broken down into two distinct phases. The first step is to install the fake app that\nthe Threat Actors (TAs) pass off as banking software. This app is nothing more than a dropper, and its\nsole purpose is to disseminate and install the primary harmful module hidden within the malicious app.\n\nThe features in the current version of Coper malware are listed below:\n\nSend USSD requests\nSend SMS\nLock the device screen\nUnlock the device screen\nStart intercepting SMS\nStop intercepting SMS\nDisplay a push notification\nRe-display phishing window on top of the specified app\nRun a keylogger\nStop a keylogger\nUninstall applications specified in the command\nUninstall itself with the dropper app\n\n## Technical Analysis\n\n### APK Metadata Information\n\nApp Name: Play Store app install\nPackage Name: com.theseeye5\nSHA256 Hash: 4261cc05a8c4ecaf1605ef931397a4d97cc12fe38738a4f6016c3695aa2c571f\n\nFigure 1 shows the metadata information of an application.\n\nFigure 1 – App Metadata Information\nThe figure below shows the application icon impersonating the Google Play Store app displayed on the\nAndroid device.\n\n\n-----\n\nFigure 2 – App Icon and Name\n\n\n-----\n\n### Manifest Description\n\nThe fake Play Store app asks for 32 permissions, of which the TA takes advantage of 12. The\nmalware’s harmful permission requests are listed below:\n\n**Permission** **Description**\n\n**READ_PHONE_STATE** Allows the application to access the phone features of the device\n\n**ADD_VOICEMAIL** Allows an application to add voicemails into the system\n\n**CALL_PHONE** Allows the application to call phone numbers without your\nintervention\n\n**READ_EXTERNAL_STORAGE** Allows an application to read from external storage.\n\n**WRITE_EXTERNAL_STORAGE** Allows an application to write to external storage.\n\n**WRITE_SETTINGS** Allows an application to modify the system’s settings data.\n\n**CALL_PHONE** Perform call without user intervention\n\n**READ_SMS** Access user’s SMSs stored in the device\n\n**RECEIVE_SMS** Fetch and process SMS messages\n\n**SEND_SMS** Allows the app to send SMS messages\n\n**SYSTEM_ALERT_WINDOW** Allows to display system alerts over other apps\n\nWe found the activity class that is initiated when the app is launched via the icon. This was determined\nby looking at the Android components declared in the Manifest file. Figure 3 depicts the declaration of\nthis activity.\n\nFigure 3 – Launcher Activity\nIn addition to the launcher activity, the application’s Manifest file contains several receivers & services\nand the application’s subclass.\n\n## Source Code Review\n\nApart from the application’s subclass, the rest of the components identified from the Manifest file are\nmissing. Hence, we can infer that the application is packed.\n\n**“com.theseeye5.KSNckdWjjyIXg” is the applications subclass initiated on launching the application.**\nThe application loads its components from the library file upon analyzing the subclass, as shown below.\n\n\n-----\n\nFigure 4 – Application’s Subclass loading library file\nThe project file browser can also be used for viewing the library file’s presence. libyvr.so is visible in\nthe screenshot below.\n\nFigure 5 – Library file in Project file representation\n\nUpon analyzing the “.so” file, the application acts as a dropper, which is the initial phase of the Coper\nmalware that drops and installs the malware’s primary harmful module hiding inside the victim’s Android\ndevice.\n\n\n-----\n\nAs seen in Figure 4, the file drops an encrypted.dex file. This file can be decrypted to reveal the Coper\nmalware’s malicious code, as shown below.\n\nFigure 6 – Decrypted Dex file\n\nUpon analyzing the decrypted.dex file, we were able to find the presence of missed Receivers,\nServices, and Mainactivity of the application. Below, we have listed the malicious activities the\napplication can perform:\n\nThe application uses the Device Administration API along with the DeviceAdminReceiver subclass\nto enable/disable device admin to the apps that users install on their devices.\n\n\n-----\n\nFigure\n\n7 – Enabling/Disabling Device Admin\n\nThe application can read all the incoming SMS messages from the infected device.\n\nFigure 8 – Reading Incoming SMS\n\nThe application’s entry point/launcher activity reads installed packages from the user’s device.\n\n\n-----\n\nFigure 9 – Launcher activity of the malicious application\n\nThe malware reads the incoming notifications by verifying the packages and steals the messages\nfrom the notification using Notification Listener Service.\n\nFigure 10 – Reads and cancels the notification using Notification Listener service\nLike other Banking Trojans, Coper malware requests users to enable the Accessibility Service to\nperform various Accessibility Event types to conduct malicious activities, as shown in the below figure.\n\n\n-----\n\nFigure 11 – Accessibility Event Types\nThe malware maintains a connection with the C&C server and queries it every minute. If the malware\ngets the relevant instructions from the C&C server, the time interval can be altered to ensure the\nmalware gets sufficient time to perform other malicious functionalities.\n\nCoper malware may also alter additional configuration parameters, as shown in Figure 12.\n\nFigure 12 – Timer Delay and Configuration Changes Performed by malware\n\n\n-----\n\nThe list of webinjects or applications for which malicious apps attempt to steal data were also identified.\nCoper malware usually has a targeted list of applications in their remote server that prohibits them from\nrunning in the infected device. Coper malware actively targets banking applications across Europe,\nAustralia, and even parts of South America.\n\nThe malware also receives commands from the TA through the C&C URL hard coded within the app in\nencrypted text. Figure 13 depicts the list of commands stored within the app in encrypted text.\n\nFigure 13 –\n\nCommands received from C&C server\nThe list of commands used in Coper malware are given below:\n\n**Command** **Description**\n\nussd Run a USSD request\n\nsms Send an SMS\n\nregister_again Dynamically registering a broadcast receiver\n\n\n-----\n\nlock_on & lock_off Lock/Unlock the device screen\n\nintercept_on & intercept_off Start/Stop intercepting SMS\n\nvnc_start & vnc_stop Start/Stop a VNC\n\npush Demonstrate a push notification\n\nrepeat_inject Re-display a phishing window on top of the targeted app’s\nwindow\n\n\nstart_keylogger &\nstop_keylogger\n\n\nRun/Stop a Keylogger\n\n\nuninstall_apps Delete an application specified in the command\n\nkill_bot Delete itself and the dropper\n\nopen_url Launches the defined URL\n\nrun_app Run a defined package\n\nUpon further analysis, we were able to find the hardcoded additional Command and Control (C&C)\ndomains, webinjects, and configuration data by the Malware author. The hard-coded C&C domains and\nconfiguration data are shown below.\n\nFigure 14 – Additional C&C domains and configuration data hardcoded by malware author\n\n**Dynamic C&C servers:**\n\n_hxxps://s22231232fdnsjds[.]top/PArhFzp5sG2sN/_\n_hxxps://s32231232fdnsjds[.]top/PArhFzp5sG2sN/_\n_hxxps://s42231232fdnsjds[.]top/PArhFzp5sG2sN/_\n\nCoper trojans have several defense measures. Controlling the integrity of the core malicious component\nis one of them. The Copper malware will attempt to restore it if it is removed.\n\nCoper malware also has a secondary safety measure to monitor potentially harmful behavior to the\ntrojan, such as:\n\nThe user trying to modify the device administrators’ list user access to the trojan’s information\npage from the system’s list of installed apps.\nThe user visiting the Google Play Protect page in the Play Store app.\n\n\n-----\n\nThe user changes the trojan s access privileges for the Accessibility Services features.\n\n## Conclusion\n\nAccording to our research, Banking trojans no longer conduct assaults only based on overlay or using\nrented Mobility as a Service (MaaS), as previously detected in numerous Banking Trojan malware\nvariants.\n\nThis malware uses Virtual Network Computing (VNC) to initiate screen recording services by\nrecognizing the foreground settings in the list of apps.\n\nFinancial institutions must strengthen their mobile-first approach and prepare for the challenges posed\nby this virus by understanding the security landscape. This aim may be achieved by implementing a\nreal-time threat-driven mobile security strategy.\n\n## Our Recommendations\n\nWe have listed some essential cybersecurity best practices that create the first line of control against\nattackers. We recommend that our readers follow the best practices given below:\n\n### How To Prevent Malware Infection?\n\nDownload and install software only from official app stores like Google Play Store or the iOS App\nStore.\nUse a reputed anti-virus and internet security software package on your connected devices, such\nas PCs, laptops, and mobile devices.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nEnable biometric security features such as fingerprint or facial recognition for unlocking the mobile\ndevice where possible.\nBe wary of opening any links received via SMS or emails delivered to your phone.\nEnsure that Google Play Protect is enabled on Android devices.\nBe careful while enabling any permissions.\nKeep your devices, operating systems, and applications updated.\n\n### How To Identify Whether You Are Infected?\n\nRegularly check the Mobile/Wi-Fi data usage of applications installed in mobile devices.\nKeep an eye on the alerts provided by Anti-viruses and Android OS and take necessary actions\naccordingly.\n\n### What To Do When You Are Infected?\n\nDisable Wi-Fi/Mobile data and remove SIM card – as in some cases, the malware can re-enable\nthe Mobile Data.\nPerform a factory reset.\nRemove the application in case a factory reset is not possible.\nTake a backup of personal media Files (excluding mobile applications) and perform a device reset.\n\n\n-----\n\n### What To Do In Case Of Any Fraudulent Transaction?\n\nIn case of a fraudulent transaction, immediately report it to the concerned bank.\n\n### What Should Banks Do To Protect Their Customers?\n\nBanks and other financial entities should educate customers on safeguarding themselves from\nmalware attacks via telephone, SMS, or emails.\n\n## MITRE ATT&CK® Techniques\n\n**Tactic** **Technique ID** **Technique Name**\n\n**Initial Access** [T1476](https://attack.mitre.org/versions/v7/techniques/T1476/) Deliver Malicious App via Other Mean\n\n**Defense Evasion** [T1406](https://attack.mitre.org/techniques/T1406) Obfuscated Files or Information\n\n**Initial Access/Defense Evasion** [T1444](https://attack.mitre.org/techniques/T1444/) Masquerade as Legitimate Application\n\n**Collection** [T1513](https://attack.mitre.org/techniques/T1513/) Screen Capture\n\n\n**Collection**\n[T1412](https://attack.mitre.org/techniques/T1412)\n\n\nCapture SMS Messages\n\n\n**Credential Access** [T1417](https://attack.mitre.org/techniques/T1417/) Input Capture (Keylogger)\n\n**Command and Control** [T1436](https://attack.mitre.org/techniques/T1436) Commonly Used Ports\n\n## Indicators Of Compromise (IOCs)\n\n**Indicators** **Indicator**\n**Type**\n\n\n**Description**\n\n\n**4261cc05a8c4ecaf1605ef931397a4d97cc12fe38738a4f6016c3695aa2c571f** SHA256 Hash of the\nanalysed\nAPK file\n\n**9b07766286667e6444c93e86d833a426a5d660f0** SHA1 Hash of the\nanalysed\nAPK file\n\n**85b7a0e8cdee68bca806fc45948c2d82** MD5 Hash of the\nanalysed\nAPK file\n\n**hxxps://s22231232fdnsjds[.]top/** URL C&C\nservers\n\n**hxxps://s32231232fdnsjds[.]top/** URL C&C\nservers\n\n\n-----\n\n**hxxps://s42231232fdnsjds[.]top** URL C&C\nservers\n\n## About Us\n\n[Cyble is a global threat intelligence SaaS provider that helps enterprises protect themselves from](https://cyble.com/)\ncybercrimes and exposure in the Darkweb. Its prime focus is to provide organizations with real-time\nvisibility to their digital risk footprint. Backed by Y Combinator as part of the 2021 winter\ncohort, Cyble has also been recognized by Forbes as one of the top 20 Best Cybersecurity Startups To Watch In 2020. Headquartered in Alpharetta, Georgia, and with offices in Australia, Singapore,\nand India, Cyble has a global presence. To learn more about Cyble, visit [www.cyble.com.](https://cyble.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-24 - Coper Banking Trojan- Android Malware Posing As Google Play Store App Installer.pdf"
    ],
    "report_names": [
        "2022-03-24 - Coper Banking Trojan- Android Malware Posing As Google Play Store App Installer.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535958,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653692803,
    "ts_modification_date": 1653692803,
    "files": {
        "pdf": "https://archive.orkl.eu/fe6d95de3e2ae5f71d91419f2dd8e4761209d7c6.pdf",
        "text": "https://archive.orkl.eu/fe6d95de3e2ae5f71d91419f2dd8e4761209d7c6.txt",
        "img": "https://archive.orkl.eu/fe6d95de3e2ae5f71d91419f2dd8e4761209d7c6.jpg"
    }
}