{
    "id": "bdbc6f28-0a9e-4acb-91bc-7731fd5487cb",
    "created_at": "2022-10-25T16:48:15.919391Z",
    "updated_at": "2025-03-27T02:08:42.779693Z",
    "deleted_at": null,
    "sha1_hash": "61c047476369c5069e39f3d06825d847d924d216",
    "title": "Recent Observations In Tibet-Related Information Operations: Advanced Social Engineering For The Distribution Of Lurk Malware",
    "authors": "Citizen Lab",
    "file_creation_date": "2012-07-27T11:59:23Z",
    "file_modification_date": "2012-07-27T12:52:31Z",
    "file_size": 557811,
    "plain_text": "**Research Brief**\n# The Citizen Lab \nNumber 10 – July 2012\n\n**_Recent Observations in Tibet-Related Information Operations:_**\n\n**_Advanced Social Engineering for the Distribution of LURK Malware_**\n\n## KEY FINDINGS\n\n   - Social engineering techniques observed in recent targeted malware attacks against Tibetan\norganizations appear to repurpose authentic, privately-held, sensitive content of Tibetan groups — in\ncontrast to typical malware attacks that rely on simpler social engineering methods, such as referencing\nthemes of interest to the organization or copying publicly available legitimate content. The use of this\nunique content suggests that attackers may have achieved a preliminary level of infiltration into\nTibetan organizations, which could allow them to increase the apparent authenticity of subsequent\nattacks.\n\n   - These recent malware attacks have incorporated a “passwording” technique, whereby attached,\ninfected Microsoft Office files are encrypted and can only be opened with a password provided in the\nemail body.\n\n   - The payload of each of these targeted malware attacks is the LURK malware, a remote access trojan\nthat is a variant of Gh0stRAT.\n\n   - Once active, the malware delivered through each of these targeted attacks connects to the same\ncommand-and-control server: dtl.dnsd.me:63 (184.105.64.183), which if inaccessible uses a backup\ndomain, dtl.eatuo.com:63. Both dnsd.me and eatuo.com are dynamic DNS providers, and eatuo.com\nhas the same domain registration information as the well-known Chinese provider 3322.net.\n\n\n**Research Brief**\n# The Citizen Lab \nNumber 10 – July 2012\n\n\n-----\n\n## BACKGROUND\n\nThis blog post is the third in a series documenting the use of information operations against Tibetans and\nothers who advocate for Tibetan rights and freedoms.\n\nPrevious research by the Citizen Lab has described information operations that leveraged the issue of [self-](http://citizenlab.org/2012/03/information-operations-and-tibetan-rights-in-the-wake-of-self-immolations-part-i/)\n[immolations amongst Tibetans, as well as a recent](http://citizenlab.org/2012/03/information-operations-and-tibetan-rights-in-the-wake-of-self-immolations-part-i/) [European Parliament resolution on the human rights](https://citizenlab.org/2012/06/spoofing-the-european-parliament/)\nsituation in Tibet.\n\n## OVERVIEW\n\nIn its ongoing study of targeted cyber threats against civil society organizations, Citizen Lab has analyzed 11\nmalicious emails sent to Tibetan organizations between May and July 2012 that display noteworthy common\nelements, including malware that connects to the same command-and-control server.\n\nAttackers have targeted at least three separate organizations, sending the malicious emails to seven different\nemail addresses associated with those three organizations.\n\nIn each of these emails, the malicious file is password-protected, such that it can only be opened with a\npassword provided in the email text (or in one case, in an image attached to the email), and the payload —\nLURK malware — is the same.\n\nThe level of authenticity of the social engineering used in these emails, however, has increased over time, with\nthe most recent emails repurposing sensitive content of Tibetan groups that was most likely privately held\nand/or inaccessible to the general public.\n\nThe use of such content suggests that attackers may have achieved a preliminary level of infiltration into\nTibetan organizations, which could allow them to accomplish more advanced and effective social engineering,\nthereby increasing the risk of compromise.\n\n## TARGETED MALWARE ATTACKS\n\nIn the 11 emails there are four distinct messages used in the attacks, as outlined and illustrated below. The\nmalicious attachments are all Microsoft Office documents — two Word documents and two Excel files — that\nare encrypted using four-digit numeric passwords, perhaps in an attempt to prevent detection of the malicious\nfile by antivirus software, or to increase the apparent authenticity of the document.\n\nThe passwords appear to have been chosen to reflect dates of historical significance with respect to Tibet —\nfor example, 1959 was the year of the Tibetan uprising against the rule of the Communist Party of China,\nwhich is commemorated by the Tibetan community every year on March 10. The malicious payloads all\ncommunicate with the same command-and-control (C2) server (discussed further below).\n\n\n-----\n\n**1. “Droeshi”**\n\nThe first email, which was only sent to one email address of which we are aware, was sent on May 24,\n2012 from what appears to be a compromised yahoo.com email account associated with a Tibetan\nactivist, from the IP address 209.234.204.31 (likely a compromised server):\n\n\n-----\n\nNote that the salutation does not include the name of the recipient, nor is it signed. The password\n[required to open the attachment is 4155.[1] The attachment is a Word document named Droeshi final.doc](https://citizenlab.org/2012/07/recent-observations/#1)\n— when opened and supplied with the password, it crashes Word and drops its malicious payload\n(described in more detail below). No clean file is dropped or shown to the user, and there is no author\nor summary metadata.\n\n**2. “Statement of the Kashag”**\n\nThe second email was sent on July 5 to at least two different organizations. The body of these emails\n[contains only “PASSWORD: 0706.”[2] The subject is “THE STATEMENT OF THE KASHAG ON](https://citizenlab.org/2012/07/recent-observations/#2)\nTHE SEVENTY-SEVENTH BIRTHDAY CELEBRATION OF HIS HOLINESS THE DALAI\nLAMA” and the “From” address spoofs the real address of a Tibetan organization. Although the emails\nare identical and were sent from the same IP address (65.166.97.211), the actual email addresses used\nto send each message differ: eabliz@gmx.com and [hientr@gmx.com.](mailto:hientr@gmx.com)\n\nThis email also attached a single Word document, July6thFinal.doc, that exhibits similar behaviour to\nthe Droeshi document but drops a slightly different malicious executable.\n\n**3. “The concept notes”**\n\nThe third email came in two versions on July 17, differing only in an additional blank line in the email\nbody and a typo in the subject line of one version. The social engineering has been significantly\nstepped up in this attack, though there are still numerous tell-tale signs that it is not legitimate. This\nemail had five attachments: four benign .docx files, as well as a malicious Excel file named\nEIDHR_action_plan.xlsx.\n\n\n-----\n\nAgain there is no name in the salutation, but the email is signed in this case. The signature and “From”\naddress used spoof a representative of the Office of Tibet.\n\nThe Word documents attached to this email contain what appears to be an actual application by a\nTibetan organization to the European Instrument for Democracy and Human Rights (EIDHR).\n\nThe timing of this attack is particularly noteworthy in that a [genuine EIDHR call for proposals —](https://webgate.ec.europa.eu/europeaid/online-services/index.cfm?do=publi.welcome&nbPubliList=15&orderby=upd&orderbyad=Desc&searchtype=RS&aofr=132760)\nincluding for “Actions Aimed at Fighting Cyber-Censorship and to Promote Internet Access and\nSecure Digital Communication” — was pending at the time, with a July 20 deadline for concept notes.\n\nSuch documentation related to grant proposals is typically of a sensitive and internal nature to civil\nsociety organizations, and inclusion of such content in a targeted malware attack is concerning, as it\nsuggests access to confidential materials and perhaps even awareness of the parameters of the EIDHR\ncall.\n\n[Only the attached malicious Excel file requires the password — 1933[3] — to open, whereas the](https://citizenlab.org/2012/07/recent-observations/#3)\nattached Word documents are not password protected. The malicious Excel file is actually an [OLE file,](http://support.microsoft.com/kb/86008)\nnot the newer Office Open XML format that the .xlsx extension suggests, and Excel refuses to open it\nunless the extension is changed to .xls. The dropped malicious executable is identical to the one from\nthe “Statement of the Kashag” email.\n\nThis file also drops a clean document, “set.xls,” in the user’s temporary folder and opens it in Excel.\nThe contents of the file were unreadable on all computers we tried it on, displaying only question\nmarks. However, the metadata of the file shows the author as ‘walkinnet’.\n\n\n-----\n\nWe saw five instances of this message, going to three different organizations. The email with the typo\nin the subject (“Tthe concept notes“) went to two different organizations, from a different IP\n(66.103.141.237) than the “Statement of the Kashag” email. Different gmx.com addresses were used to\nsend each message: c100tibet_board@gmx.com and ijoni_futbollisti@gmx.com.\n\nThe other three instances of this email had the subject “The concept notes” and were sent by yet more\nunique gmx.com addresses: abarbour@gmx.com, jigme1@gmx.com and agnes9@gmx.com. The first\ntwo were sent from the same IP as used for the “Statement of the Kashag,” but the third came from\n207.178.172.2.\n\n\n-----\n\n**4. “August visit of South African group”**\n\nThe most recent email was sent on July 20 to at least two organizations, one of which received it at two\ndifferent addresses. The email contains text and an Excel attachment that, as with the “The concept\n_notes” email, suggest the attacker had access to confidential communications of a Tibetan_\norganization.\n\nThe spoofed “From” address, subject (“August visit of South African group”), and text of the email all\nappear to be repurposed from an authentic message sent to a Tibetan organization from a person\nseeking advice regarding an upcoming trip to Dharamsala, and the content includes in-depth details on\ntrip logistics and planning.\n\nIn this case, the password required to open the attached Excel file is not in the body of the email, but\nadded (rather awkwardly) to an attached image of the logo of the organization belonging to the spoofed\nsender. The password is “1959,” the year of the aforementioned Tibetan uprising.\n\nThe attached Excel file, Dharamsala August 2012 Full program.xls, is similar to the malicious\nattachment in “The concept notes” email, but it drops a different clean file. In this case the file is\nreadable and contains what is almost certainly an authentic itinerary, which is referenced in the email.\nThe clean file is also called set.xls, defaults to the same Chinese font, and has the same ‘walkinnet’\nauthor metadata as the clean document in “The concept notes.”\n\n## TECHNICAL ANALYSIS\n\n**Delivery Methods**\n\nWithin the dataset examined by Citizen Lab, two Word documents and two Excel documents were sent\n[embedded with LURK malware, a remote access trojan that is a variant of Gh0stRAT. Note that the XLSX file](https://www.mcafee.com/us/resources/white-papers/foundstone/wp-know-your-digital-enemy.pdf)\nis actually a standard .XLS file, not the new XML format.\nThe MD5 hashes of the documents are as follows:\n\nDroeshi final.doc – 58f6922dedb0d43c4478a4f38ad08620\n\nJuly6thFinal.doc – f2a0787388dd6373336b3f23f204524a\n\nEIDHR_action_plan.xlsx – 0fe550a5d1187d38984c505ef7741638\n\nDharamsala August 2012 Full program.xls – 971f99af0f9df674a79507ed7b3010fb\n\n\n-----\n\nEach document is encrypted with a four-digit numeric password, a tactic seen previously in other emails. This\ntactic makes it more difficult to identify embedded payloads and the vulnerability used.\n\nAll of the files except for the first (Droeshi final.doc) have the same malware files embedded. The first uses a\nvariant of the LURK trojan that is very similar, but not identical, to the others.\n\n**Infection**\n\nIn each of the four cases, the document exploit drops the LURK trojan:\n\n%Temp%\\iexplore.exe\n\nTwo different versions of the trojan were seen between the four cases. While they all use the same filenames,\nin one case, the MD5 of the trojan is different:\n\nJuly6thFinal.doc, EIDHR_action_plan.xlsx, Dharamsala August 2012 Full program.xls:\n16160a6a9b905c69cb8e92c319212980\nDroeshi final.doc: 1c22ee3326affee30c3fa65f0b8413d5\n\nLURK also uses the following files:\n\n%AppData%\\Application Data\\Help\\CREATELINK.EXE\n%AppData%\\Help\\IconCacheEt.DAT\n%AppData%\\Help\\IconConfigEt.DAT\n%AppData\\\\Help\\iexplore.exe\n\nAdditionally, the samples that use Excel as their vector also drop a clean file, opened after the malware\nexecutes:\n\n\n-----\n\n%Temp%\\set.xls\n\nFor persistence, the trojan also creates the following link in the Startup folder, pointing at the iexplore.exe\nbinary in %AppData%:\n\nC:\\Documents and Settings\\user\\Start Menu\\Programs\\Startup\\iexplore.lnk\n\nThe binary in %AppData% is only 9KB and acts as a launcher.\n\nIconConfigEt.DAT is the trojan’s configuration file, storing the C2 server addresses and ports, as well as a\ncampaign name identifier. The file is mostly encrypted, with the campaign name stored in the clear. The\nconfiguration options are read from the main executable using GetPrivateProfileStringW(), a function for pre-\nregistry configuration storage. This function is for backwards compatibility with pre-registry 16-bit Windows\napplications, and is not commonly used in modern applications.\n\n\n-----\n\nDecryption of the configuration file is done in sub_4044B0() using a key generated in sub_404430() — the\ndefault is 0x11B29719, in the case of the more common version of the trojan the key is 0x11B297A9. Once\nthe values have been read from the decrypted file, it is re-encrypted in sub_404560().\n\nEncrypted on disk (default):\n\nDecrypted:\n\nOnce the configuration file is decrypted, the values are still not readable. Fortunately, the second layer\ndecryption is an easy process — just decrement each character by 1.\n\nThe values read from the configuration file are:\n\n1. Section [PPP], key P: Primary C2 server port number\n\n2. Section [WWW], key W: Primary C2 server name\n\n3. Section [PPP1], key P1: Secondary C2 server port number\n\n4. Section [WWW1], key W1: Secondary C2 server name\n\n5. Section [PPP2], key P2: Tertiary C2 server port number\n\n6. Section [WWW2], key W2: Tertiary C2 server name\n\n7. Section [MMM], key M: Campaign name\n\n\n-----\n\nIn the configuration files we have looked at for this run, the primary server is dtl.dnsd.me:63, and the\nsecondary server is dtl.eatuo.com:63. Both dnsd.me and eatuo.com are dynamic DNS providers, and\neatuo.com has the same domain registration information as the well-known Chinese provider 3322.org. No\ntertiary server is given.\n\nThe malware checks in sub_4040E0() for a value of “Mark” in the registry at the following location:\n\nHKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\DbxUpdateET\\\n\nIf a value is not found, it is set with the campaign name read from the configuration file key M.\n\n**Campaign Names**\n\nThe four samples we received use three different campaign names, identified as follows in value 7 of each\nconfiguration file:\n\nDroeshi final.doc: campaign id TIBET\nJuly6thFinal.doc: campaign id T706 (note that the password on the file is also 0706, keeping on theme)\nEIDHR_action_plan.xlsx: campaign id T801\nDharamsala August 2012 Full program.xls: campaign id T801\n\nThe campaign names strongly suggest that these runs are specific to the Tibetan community, and that the Txxx\nattacks may be coming from the same source. The July6thFinal.doc, EIDHR_action_plan.xlsx, and\nDharamsala August 2012 Full program.xls documents all drop the same trojan; the Droeshi final.doc trojan is\nslightly different (although uses much of the same code).\n\n**Malware Analysis**\n\nThese samples match the behavior seen with other recorded instances of samples from this family in the wild.\n[LURK is also known as Troj~Agent-XAT (Sophos), TROJ_MDROP.TPB and TROJ_MDROP.TPC (Trend](http://www.sophos.com/en-us/threat-center/threat-analyses/viruses-and-spyware/Troj%7EAgent-XAT/detailed-analysis.aspx)\nMicro), and can also be picked up by more general antivirus detection such as [Generic PWS.y (McAfee). In](http://www.mcafee.com/threat-intelligence/malware/default.aspx?id=1024926)\n\n\n-----\n\nthe sample analyzed by Sophos, the campaign ID is “IE_0day” — not immediately related to attacks on the\nTibetan community.\n\nMany more samples within this family exist with reports online — look for “DbxUpdateET” (where the\ncampaign ID is stored in the registry) or the dropped files “IconCacheEt” and “IconConfigEt.” Another\nTibetan-themed example using the dtl.eatuo.com domain was reported by [ZenLab on March 26, 2012.](https://malwarelab.zendesk.com/entries/21199507-tibetan-journalists-targeted-by-gh0strat-in-protest-pictures-rar)\n\nThe LURK malware is also referenced with a description of the communication protocol in Command Five’s\n[paper “Command and Control in the Fifth Domain.” The network behavior we observed matches the described](http://www.commandfive.com/papers/C5_APT_C2InTheFifthDomain.pdf)\nprotocol.\n\nAn additional file with the T801 campaign ID that we observed used twice was uploaded to ThreatExpert and\ncan be found [here.](http://www.threatexpert.com/report.aspx?md5=ee5d4a5dddeef35a2b722fa907753e71)\n\n**Command and Control Information**\n\nA port scan of the C2 server shows the following ports are open:\n\nPORT STATE SERVICE VERSION\n21/tcp open tcpwrapped\n53/tcp open domain?\n80/tcp closed http\n81/tcp open hosts2-ns?\n135/tcp open msrpc Microsoft Windows RPC\n1026/tcp open msrpc Microsoft Windows RPC\n8080/tcp open http-proxy?\n\nIn addition to port 63 (which is not shown as open in the above scan), ports 81 and 53 are both LURK.\n\n**Network Traffic**\n\nIn addition to the dropped files, infected machines can be found on a network by looking for the following\nindications of compromise:\n\n   - DNS lookup of the C2 domains: dtl.dnsd.me, dtl.eatuo.com\n\n   - Traffic to the C2 IP: 184.105.64.183 — this includes traffic over port 53, which is normally DNS\n\n\n-----\n\n   - TCP traffic over port 53 that begins with “LURK0”\n\nThe beginning of a network connection to the C2 server looks like this:\n\nIf the C2 is not actively responding, not much data will be transmitted beyond TCP:\n\nFor detection, Jaime Blasco from AlienVault has written a Snort rule that will detect LURK traffic (originally\nfound [here):](http://labs.alienvault.com/labs/index.php/2012/some-apt-cc-traffic-snort-rules/)\n\n\n-----\n\nalert tcp $HOME_NET any -> $EXTERNAL_NET $HTTP_PORTS (msg:”APT LURK communication\nprotocol detected”; flow:established,to_server; content:”|4C 55 52 4B 30|”; depth:5;\nreference:url,www.commandfive.com/papers/C5_APT_C2InTheFifthDomain.pdf;\nclasstype:trojan-activity; sid:3000006; rev:1;)\n\n## RECOMMENDATIONS\n\n   - Civil society organizations, particularly those working on issues related to Tibetan rights, should\nexercise caution with respect to any email containing a link or attachment. As the targeted malware\nattacks analyzed in this report demonstrate, content used to induce a recipient to open a malicious file\nmay at one point have actually been authentic and private — and is that much more likely to appear\nlegitimate. For tips on other ways to detect probable malware attacks and prevent compromise, see\n[Citizen Lab’s Recommendations for Defending Against Targeted Cyber Threats.](https://citizenlab.org/docs/recommendations.html)\n\n   - Civil society organizations should be wary of emails attaching password-protected documents and\nproviding said password in the email body. Such purported “security” measures are not an indicator of\nauthenticity.\n\n   - Citizen Lab encourages civil society organizations and individuals working on human rights issues that\nhave encountered these types of targeted malware attacks to contact us at hrthreats[AT]citizenlab.org.\nWe appreciate submission of data, which will help strengthen our analysis of cyber threats.\n\n## __________________\n\n FOOTNOTES\n\n1 On April 1, 1955, the governments of India and China signed a protocol by which India handed over control\n[of communications services in Tibet to China. See Protocol between the Governments of India and China](http://www.commonlii.org/in/other/treaties/INTSer/1955/2.html)\n_[Regarding the Handing Over of Postal, Telegraph and Public Telephone Services in the Tibet Region of](http://www.commonlii.org/in/other/treaties/INTSer/1955/2.html)_\n_[China.](http://www.commonlii.org/in/other/treaties/INTSer/1955/2.html)_\n\n\n-----\n\n2 The Fourteenth Dalai Lama Tenzin Gyatso was [born on July 6, 1935.](http://www.dalailama.com/biography/chronology-of-events)\n3 The Thirteenth Dalai Lama Thupten Gyatso [passed away on December 17, 1933.](http://www.dalailama.com/biography/chronology-of-events)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/njc3dvwkbx4i9y0s300r3k3ocrj1gmua",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2012/2012.07.10.SE_LURK_Malware/Tibet_Lurk.pdf"
    ],
    "report_names": [
        "Tibet_Lurk"
    ],
    "threat_actors": [
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041322,
    "ts_creation_date": 1343390363,
    "ts_modification_date": 1343393551,
    "files": {
        "pdf": "https://archive.orkl.eu/61c047476369c5069e39f3d06825d847d924d216.pdf",
        "text": "https://archive.orkl.eu/61c047476369c5069e39f3d06825d847d924d216.txt",
        "img": "https://archive.orkl.eu/61c047476369c5069e39f3d06825d847d924d216.jpg"
    }
}