{
    "id": "bdf0e76d-cd8e-4460-adfe-55bcdcd02ed2",
    "created_at": "2023-01-12T15:07:13.454676Z",
    "updated_at": "2025-03-27T02:11:47.693868Z",
    "deleted_at": null,
    "sha1_hash": "2942712d0a48ee23a68f3cc3225035d0d45fd339",
    "title": "2017-04-21 - BrickerBot Author Claims He Bricked Two Million Devices",
    "authors": "",
    "file_creation_date": "2022-05-27T22:38:47Z",
    "file_modification_date": "2022-05-27T22:38:47Z",
    "file_size": 340286,
    "plain_text": "# BrickerBot Author Claims He Bricked Two Million Devices\n\n**[bleepingcomputer.com/news/security/brickerbot-author-claims-he-bricked-two-million-devices/](https://www.bleepingcomputer.com/news/security/brickerbot-author-claims-he-bricked-two-million-devices/)**\n\nCatalin Cimpanu\n\nBy\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nApril 21, 2017\n01:30 AM\n1\n\nJust like Wifatch and Hajime, the BrickerBot malware is the work of a vigilante grey-hat,\nwho goes online by the name of Janit0r, a nickname he chose on the Hack Forums\ndiscussion boards.\n\nIf you're unfamiliar, BrickerBot is a new malware family that was first identified at the start of\nthe month by Radware researchers. The malware made headlines because it was the first\nthreat of its kind that intentionally bricked IoT and networking devices, by rewriting the flash\nstorage space of affected devices with random data.\n\nSuch actions rendered troves of devices useless, many needing a firmware reinstall, but as\nmany needing to be replaced altogether.\n\nDestructive actions like these caught the attention of authorities. In the US, the Department\nof Homeland Security’s Industrial Control Systems Cyber Emergency Response Team (ICS[CERT) issued an official alert last week, warning companies to disable Telnet and SSH](https://ics-cert.us-cert.gov/alerts/ICS-ALERT-17-102-01A)\naccess to their devices and asking owners to change their devices' default factory\npasswords.\n\n\n-----\n\n## Anonymous tip leads us to Hack Forums profile\n\nSince BrickerBot's appearance, law enforcement and the infosec community have been on\nthe hunt for new information regarding how BrickerBot operates and who's behind it.\n\nNew information surfaced over the Easter weekend when Bleeping Computer received an\nanonymous tip about the online identity of BrickerBot's creator. The tipster pointed us\ntowards the profile of a Hack Forums user named janit0r.\n\nWe ignored the tip at first since Hack Forums is known to attract a crowd of braggadocio\nhackers, many of whom tend to \"embellish\" their abilities or knowledge. We expected that\nthat two weeks after BrickerBot's discovery, Hack Forums would be abuzz with people\ntrying to take credit for BrickerBot, but it was strangely silent.\n\nOn Monday, feeling bad that we did not follow through with the same dilligence that the\ntipster had warned us with, we decided to have another look over janit0r's profile.\n\nWhat we discovered was a user that registered on January 21, 2017, had the forum boards\nset up to use the Alaska timezone and had made four posts.\n\nRight off the bat, his first post was the most interesting one. In a forum topic discussing a\ndecline in the number of active Mirai bots, Janit0r made the following statement. Remind\nyou, this still almost two months and a half before Radware's BrickerBot discovery.\n\nI have killed over 200K telnet devices since Nov.. you've probably seen a drop in your bot\ncounts by now.\n\n\n-----\n\nHis second and third posts also came before BrickerBot became public and attested to his\nskills as a reverse engineer, in a topic he started himself, discussing a security flaw in\nDahua 2nd and 3rd generation IP cameras.\n\nThe researcher who discovered and made public the flaw, withheld proof-of-concept exploit\ncode for one month, to give Dahua customers time to apply a firmware update. Janit0r\n[showed dissatisfaction with the researcher's action and published exploitation details for](http://seclists.org/fulldisclosure/2017/Mar/7)\nthat particular bug himself.\n\nHis last post was in a topic started by a user who \"heard\" that BrickerBot's source had\nleaked. Janit0r's response was quick and to the point.\n\nI'm gonna call bullshit on this rumor.. I'm pretty sure I'd be sitting in jail if someone had\nmanaged to snatch the full source off my desktop :P\n\n\n-----\n\nAt this point, we had to confirm that Janit0r was indeed BrickerBot's author and not just\nsome guy bragging on Hack Forums. This is how we spent the next two days, scraping\nthrough the Dark Web, underground hacking forums, and getting in contact with a few\nthreat intelligence analysts we knew.\n\nBy Wednesday, we didn't manage to find any other clue of Janit0r's existence, or anybody\nelse claiming to be BrickerBot's author, with some solid proof on his side. That's when we\n[just gave up, and launched a desperate tweet, asking BrickerBot's author to reach out.](https://twitter.com/campuscodi/status/854660397374296064)\n\n## BrickerBot's Author reaches out\n\nLo and behold, this was exactly what happened. The same day, we received an email from\na person claiming to be BrickerBot's creator.\n\nThe email contained lots of details about BrickerBot's operation and internal structure.\nNevertheless, at this point, we knew that there could be the possibility that someone was\npulling a prank.\n\n[Chance had it that someone else had also seen our tweet. That person was Victor Gevers,](https://twitter.com/0xDUDE)\na security researcher mostly known for tracking the destructive ransom attacks against\nMongoDB and other databases.\n\nIn the [Bleeping Computer article that broke the news of BrickerBot's existence, we asked](https://www.bleepingcomputer.com/news/security/new-malware-intentionally-bricks-iot-devices/)\nVictor for his expert opinion on this new malware's behavior and repercussions. Victor not\nonly put BrickerBot in perspective for our readers, but also asked BrickerBot's creator to\nreach out and discuss an alternative method of dealing with unsecured IoT devices, instead\nof blindly destroying people's property.\n\nUnknown to all was that BrickerBot author had reached out to Victor hours after our article\nwent live. The two had shared notes and Victor was acting as an intermediary between\nJanit0r and various CERTs. All the operational details shared with us on Wednesday were\nthe same Janit0r shared with Victor in the previous three weeks, confirming we were\nspeaking with the same person.\n\n\n-----\n\n## Yes, I am janit0r\n\n\"Yes, I was janit0r on Hackforums,\" the BrickerBot author started his email, which then\ncontinued with Janit0r showing his anger at the sad state of affairs in the realm of IoT\nsecurity.\n\nLike so many others I was dismayed by the indiscriminate DDoS attacks by IoT botnets in\n2016. I thought for sure that the large attacks would force the industry to finally get its act\ntogether, but after a few months of record-breaking attacks it became obvious that in spite\nof all the sincere efforts the problem couldn't be solved quickly enough by conventional\nmeans.\n\nThe IoT security mess is a result of companies with insufficient security knowledge\ndeveloping powerful Internet-connected devices for users with no security knowledge. Most\nof the consumer-oriented IoT devices that I've found on the net appear to have been\ndeployed almost exactly as they left the factory.\n\nFor example 9 out of every 10 Avtech IP cameras that I've pulled the user db from were set\nup with the default login admin/admin! Let that statistic sink in for a second.. and then\nconsider that if somebody launched a car or power tool with a safety feature that failed 9\ntimes out of 10 it would be pulled off the market immediately. I don't see why dangerously\ndesigned IoT devices should be treated any differently and after the Internet-breaking\nattacks of 2016 nobody can seriously argue that the security of these devices isn't\nimportant.\n\nI hope that regulatory bodies will do more to penalize careless manufacturers since market\nforces can't fix this problem. The reality of the market is that technically unskilled consumers\nwill get the cheapest whitelabel DVR they can find at their local store, then they'll ask their\nnephew to plug it into the Internet, and a few minutes later it'll be full of malware. At least\nwith 'BrickerBot' there was some brief hope that such dangerous devices could become the\nmerchant's and manufacturer's problem rather than our problem.\n\n## BrickerBot allegely wiped over two million devices\n\nI joined Hackforums in January mainly to see if my activities had been noticed by the botnet\nkids. Back then 200,000 bricked units seemed like a lot and I was sure I was close to the\nend of it. Now when the count is over 2 million it's clear that I had no idea (and still have no\nidea) how deep the rabbit hole of IoT insecurity is. I'm certain that the worst is still ahead of\nus.\n\nI hope the unconventional actions by 'BrickerBot' have helped in buying another year of\ntime for governments, vendors and the industry in general to get the current IoT security\nnightmare under control.\n\n\n-----\n\nMany other people have also done important things to combat IoT malware (Team White,\nHajime author, @packetcop and his fellow sinkholers, etc) so I'm by no means claiming\n[credit for Mirai being weak in Q1/2017, but if Imeij and](https://www.bleepingcomputer.com/news/security/new-imeij-iot-malware-targets-avtech-equipment/) [Amnesia have suffered a little](https://www.bleepingcomputer.com/news/security/irresponsible-chinese-dvr-vendor-still-the-target-of-iot-botnets-one-year-later/)\nrecently then it's probably mainly my fault ;)\nJanit0r's email then goes on to detail a few operational details regarding BrickerBot's\ninfrastructure, also dispelling the notion that he's a madman set on the random destruction\nof IoT devices.\n\nIn reality, Janit0r wants to be considered in the same class as the White Team, the selfproclaimed white-hat hackers behind the Wifatch malware, and the author of the Hajime\nmalware, [another vigilante who created a new malware family last October that tries to](https://www.bleepingcomputer.com/news/security/vigilante-hacker-uses-hajime-malware-to-wrestle-with-mirai-botnets/)\nsecure IoT devices by force.\n\nThe [Radware writeup made 'BrickerBot' sound simplistic, but it actually carries 86 protocol](https://security.radware.com/ddos-threats-attacks/brickerbot-pdos-permanent-denial-of-service/)\nand device-specific payloads and is relatively successful at mitigating commonly exploited\ndevices. The bot's every action has a statistically determined purpose and what might've\nseemed like buggy behavior in the honeypot really isn't.\n\nAs a preference 'BrickerBot' will try to secure units without damaging them and the bricking\nbehavior is a 'plan B' (yes the B stands for brick :) for units which are unlikely to be\nsecurable. A blogger on the net wondered about 'BrickerBot' simply trying to change his\nhoneypot's login and this would've been due to the bot assuming the device had a\npersistent user db. Because the honeypots are often quite different from any actual devices\nthe behaviors in them are usually weird.\n\nIf security researchers made their honeypots look more like actual devices (that one could\nactually find with default credentials on the net) and hosted them on dirtier networks they\nwould find even more interesting things going on..\nVictor Gevers, who confirmed Janit0r's bricking statistics also believes this person is only\nmisguided, and hopes to convince him to abandon his ways. \"The writer of the email does\nnot strike me as a bad person,\" Gevers told Bleeping Computer based on his own\ncommunications with Janit0r. \"Just some young guy who was too eager to solve a problem.\"\n\n## Janit0r wants a change in IoT security standards\n\nFor the time being, Janit0r doesn't seem interested in stopping BrickerBot attacks, or at\nleast not until officials and hardware vendors take a look at IoT security and start changing\nthings with a hurry.\n\nAuthorities have been talking about IoT security standards for years, but in the meantime,\nsome of the same vendors participating in those discussions have continued to ship out\ninsecure devices with the same ol' default passwords. In a follow-up email, Janit0r wrote the\nfollowing.\n\n\n-----\n\nI consider my project a form of Internet Chemotherapy I sometimes jokingly think of myself\nas The Doctor. Chemotherapy is a harsh treatment that nobody in their right mind would\nadminister to a healthy patient, but the Internet was becoming seriously ill in Q3 and\nQ4/2016 and the moderate remedies were ineffective. The side effects of the treatment\nwere harmful but the alternative (DDoS botnet sizes numbering in the millions) would have\nbeen worse. I can only hope hope that when the IoT relapse comes we'll have better ways\nto deal with it. Besides getting the number of IoT DDoS bots to a manageable level my\nother key goal has been to raise awareness. The IoT problem is much worse than most\npeople think, and I have some alarming stories to tell.\n\n## Janit0r is a wanted man\n\nNonetheless, the actions of BrickerBot place this malware in the same category as other\ndestructive e-threats, such as ransomware and banking trojans. Janit0r already knows he's\na wanted man and has taken many precautions.\n\nTracking down Janit0r's real life persona may also be a little harder than going after\nteenagers that rent DDoS botnets with their father's credit card. While he signed his Hack\nForums posts with the name \"Rob,\" Janit0r also used different names within each email,\nsaid he never intends to log into his Janit0r Hack Forums account again, and has\nconsistently changed email addresses every few days.\n\nFor what's worth it, Janit0r has been very careful with his OpSec, compared to many of\n[today's hackers, who, according to a Flashpoint report released yesterday, prefer Skype as](https://www.flashpoint-intel.com/blog/cybercrime/cybercriminal-communication-strategies/)\ntheir main communications method, an IM service known to give up data on its users to law\nenforcement.\n\n## Janit0r: I'm not a security researcher\n\nCurrent clues like Janit0r's reverse engineering skills, in-depth knowledge of the malware\nscene, and a desire to do good, point to the fact that we may be dealing with another\nsecurity researcher or network engineer that has decided to do something about the everincreasing number of unsecured network and IoT devices.\n\n\"For what it's worth I'll state that I've never actually worked in networking, systems\nadministration, information security or anything of the sort, but I have a hobby interest in all\nof the above. I believe that basic knowledge in such things is good self-defense in the 21st\ncentury,\" Janit0r wrote in an email.\n\nRight now, all users and companies can do is to follow Radware and ICS-CERT's\nrecommendations, and block access to Telnet and SSH ports, and also change the device's\ndefault password. Otherwise, they may get a visit from BrickerBot, and it might reach Plan\nB.\n\n\n-----\n\n_[Headline image credit: Simeon W & Bleeping Computer](https://www.flickr.com/photos/46928881@N02/24446860255/in/photolist-DfhxQB-2cSP41-gcBHQ-qFs9Y7-eyzbiN-4gcQh9-6xH853-9HXu2J-8HLUDP-ft7TF-8ZURoc-GtGKb-7F6bG-4cH9jN-7vmcPk-5E5Krv-5E5Kp8-5E5Km8-3N54A-id4DED-7LSzE3-8AiBT6-5HWxeg-gcBJx-p6HXd7-4SzStc-oCTM7k-9e6f5f-e8xPbF-id4Qg9-pr2JL-qHiEWy-4cHeas-5CSNn8-ag9UR4-6CpNTx-qHqWFX-4Hmv7e-7LSzDo-qkn5yr-64e6Y3-4S6zZt-djp6gV-tFLLz-7TRKKp-6335Hv-fivCQi-21jZr-4or5Y-bw8voK/)_\n\n### Related Articles:\n\n[Microsoft detects massive surge in Linux XorDDoS malware activity](https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/)\n\n[Microsoft: Sysrv botnet targets Windows, Linux servers with new exploits](https://www.bleepingcomputer.com/news/security/microsoft-sysrv-botnet-targets-windows-linux-servers-with-new-exploits/)\n\n[New cryptomining malware builds an army of Windows, Linux bots](https://www.bleepingcomputer.com/news/security/new-cryptomining-malware-builds-an-army-of-windows-linux-bots/)\n\n[Emotet botnet switches to 64-bit modules, increases activity](https://www.bleepingcomputer.com/news/security/emotet-botnet-switches-to-64-bit-modules-increases-activity/)\n\n[New stealthy BotenaGo malware variant targets DVR devices](https://www.bleepingcomputer.com/news/security/new-stealthy-botenago-malware-variant-targets-dvr-devices/)\n\n[Botnet](https://www.bleepingcomputer.com/tag/botnet/)\n[BrickerBot](https://www.bleepingcomputer.com/tag/brickerbot/)\n[IoT](https://www.bleepingcomputer.com/tag/iot/)\n[Malware](https://www.bleepingcomputer.com/tag/malware/)\n\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nCatalin Cimpanu is the Security News Editor for Bleeping Computer, where he covers topics\nsuch as malware, breaches, vulnerabilities, exploits, hacking news, the Dark Web, and a\nfew more. Catalin previously covered Web & Security news for Softpedia between May\n2015 and October 2016. The easiest way to reach Catalin is via his XMPP/Jabber address\nat campuscodi@xmpp.is. For other contact methods, please visit Catalin's author page.\n\n[Previous Article](https://www.bleepingcomputer.com/news/microsoft/microsoft-sets-new-release-schedule-for-windows-10-with-two-major-updates-per-year/)\n[Next Article](https://www.bleepingcomputer.com/news/security/aes-ni-ransomware-dev-claims-hes-using-shadow-brokers-exploits/)\n\n### Comments\n\n\n-----\n\n[DodoIso - 5 years ago](https://www.bleepingcomputer.com/forums/u/988239/dodoiso/)\n\nIt would be interesting to know what actions are taken before PLAN B... Quickly\nbrowsing through the Radware article, it seems a better approach to fix the problem is\nto program the device's firewall to deny incoming and outgoing WAN traffic, and the\ndevice would still be usable locally by the innocent customer. If enough customers\nreturn their device to vendors because they do not perform as advertised, that would\nget the wheel turning. Bricking a device is kind of 'off-warranty', waste time, and raise\nthe customers' cost tremendously to prove to the vendors that they did nothing wrong.\nThe burden should be on the vendors, not the customers.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-21 - BrickerBot Author Claims He Bricked Two Million Devices.pdf"
    ],
    "report_names": [
        "2017-04-21 - BrickerBot Author Claims He Bricked Two Million Devices.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536033,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1653691127,
    "ts_modification_date": 1653691127,
    "files": {
        "pdf": "https://archive.orkl.eu/2942712d0a48ee23a68f3cc3225035d0d45fd339.pdf",
        "text": "https://archive.orkl.eu/2942712d0a48ee23a68f3cc3225035d0d45fd339.txt",
        "img": "https://archive.orkl.eu/2942712d0a48ee23a68f3cc3225035d0d45fd339.jpg"
    }
}