{
    "id": "be1f8032-7e7c-4e5c-b502-77a95c638f70",
    "created_at": "2023-01-12T15:07:40.603888Z",
    "updated_at": "2025-03-27T02:09:30.053067Z",
    "deleted_at": null,
    "sha1_hash": "6c1c4295bb1bbcbc9b02324b002d2d0843a2d8f9",
    "title": "2021-09-08 - Rapidly Evolving BlackMatter Ransomware Tactics",
    "authors": "",
    "file_creation_date": "2022-05-28T23:15:39Z",
    "file_modification_date": "2022-05-28T23:15:39Z",
    "file_size": 2265512,
    "plain_text": "# Rapidly Evolving BlackMatter Ransomware Tactics\n\n**ciphertechsolutions.com/rapidly-evolving-blackmatter-ransomware-tactics/**\n\nSeptember 8, 2021 | By Cipher Tech ACCE Team\n\n## Summary\n\nCipher Tech analysts monitoring VirusTotal for BlackMatter ransomware activity discovered new\nvariants of BlackMatter malware self-reporting as versions 1.9 and 2.0. The new BlackMatter malware samples contain\nadditional functionality, changes to the configuration data, and version 2.0 additionally introduces changes to the configuration\ndecryption algorithm. Cipher Tech analysts developed an ACCE module to automate the extraction of BlackMatter malware’s\nconfiguration data. Cipher Tech’s analysis reveals new variants of BlackMatter malware and a refinement in BlackMatter’s\ntactics, techniques, and procedures.\n\n## Who is BlackMatter\n\nBlackMatter is a ransomware affiliate program actively attacking victims that was first identified in July\n2021 by [RecordedFuture and a security researcher pancak3. BlackMatter claims to derive from the now inactive REvil](https://www.recordedfuture.com/blackmatter-ransomware-successor-darkside-revil/)\nand DarkSide ransomware affiliate programs. Supporting BlackMatter’s claim, a joint code correlation effort\n[between BleepingComputer and Emsisoft suggests that BlackMatter malware’s’ encryption routines contain strong similarities](https://www.bleepingcomputer.com/news/security/darkside-ransomware-gang-returns-as-new-blackmatter-operation/)\nto DarkSide malware samples.\n\nBlackMatter claims to target companies in the US, UK, Canada, or Australia with between 500 – 15,000 hosts and revenues of\nat least 100K. BlackMatter claims they will not target the following industries and will provide free decryption services\nto BlackMatter victims in these industries.\n\nHospitals\nCritical infrastructure facilities\nOil and gas industry\nDefense industry\nNon-profit companies\nGovernment sector\n\n## Background\n\nCipher Tech analysts leveraged ACCE to discover, decrypt, and parse configuration data from BlackMatter ransomware\nsamples with reported version numbers of 1.9 and 2.0. Cipher Tech has not identified detailed public reporting for samples with\na version number above 1.2. This suggests either a fast development cycle or a refinement in TTPs with respect to versioning.\n\n\n-----\n\nCipher Tech s ACCE software enables the automated extraction of configuration data from supported malware samples. ACCE\nindicated that parsing the 1.9 and 2.0 samples configuration data differed from the expected format of\nACCE’s existing BlackMatter configuration parser. Based on the change in configuration, Cipher\nAnalysts examined both samples to identify differences between BlackMatter’s 1.2 ransomware sample,\nBlackMatter’s 1.9 ransomware sample, and BlackMatter’s 2.0 ransomware sample.\n\nAnalysis of the BlackMatter 1.9 sample and its configuration data revealed that BlackMatter added additional capabilities to\nBlackMatter 1.9. BlackMatter 1.9 contains the following new functionality:\n\nPrint ransom notes to a locally installed computer\nCheck the hostname of a compromised system prior to installation\nAdditional verification checks to ensure BlackMatter does not encrypt their own ransom note\nProvide additional details and evidence of stolen information within the ransom note\n\n[Further analysis of the BlackMatter 2.0 sample, reported by @sisoma2 on Twitter, and its configuration data revealed that](https://twitter.com/sisoma2/status/1431175543341338626?s=21)\nBlackMatter uses all the changes indicated for 1.9 above, and changed the decryption algorithm for the configuration data and\nsome encrypted strings. BlackMatter 2.0 uses the following decryption methodology:\n\nA 64-bit seed/key for configuration and string decryption\nA modified MMIX-LCG pseudo-random number generator (PRNG) algorithm for generating the key used to decrypt each\n8-byte block of the encrypted configuration data / string.\nA byte-swap algorithm for adjusting the generated MMIX-LCG state value into an XOR key for decrypting each 8-byte\nblock.\n\n## Samples Compared\n\nThis post will demonstrate these changes in BlackMatter Versions 1.9 and 2.0 in comparison to a BlackMatter Version 1.2\nsample. For the purposes of the analysis presented below:\n\nVersion 1.2 reflects the BlackMatter Ransomware with MD5 598c53bfef81e489375f09792e487f1a, compiled 2021-0723T20:51:18+00:00\nVersion 1.9 reflects the BlackMatter Ransomware with MD5 f1c260c31b9d3f9ff54a142d508ec602, compiled 2021-0812T22:22:01+00:00\nVersion 2.0 reflects the BlackMatter Ransomware with MD5 38035325b785329e3f618b2a0b90eb75, compiled 2021-0816T07:13:07+00:00\n\n## Configuration Decryption\n\n[The encrypted configuration data structure for 1.9 remains the same as previously documented by Group-IB, the data is](https://blog.group-ib.com/blackmatter)\nstored in the .rsrc PE section, although there are no actual resources, the following Python construct documents the layout:\n\n_Figure 1: Version 1.9 Encrypted Configuration Structure_\n\nThe encrypted configuration data structure for 2.0, however, is modified to account for the change in decryption algorithm. The\nfollowing Python structure defines the change, where the seed is now 8 bytes instead of 4:\n\n_Figure 2: Version 2.0 Encrypted Configuration Structure_\n\n**Algorithm Changes**\n\n\n-----\n\nThe decryption algorithm in Versions 1.2 and 1.9 used an XOR algorithm where the key for each 4 byte block was generated\nusing a modified Delphi/Pascal-LCG PRNG. The standard Delphi/Pascal-LCG masks each round to generate a floating point\nnumber in the range 0-1, where the modified algorithm masks each round using the following, where “seed” is the initial seed\nvalue reflected in Figure 1:\n\n_Figure 3: Version 1.9 Delphi/Pascal-LCG Mask_\n\nVersion 2.0 uses a modified MMIX-LCG algorithm for key generation, where the standard parameters are represented in\nFigure 4 and the BlackMatter parameters are represented in Figure 5. Additionally, in the standard MMIX-LCG the value is not\nmasked, and in BlackMatter the value is masked as seen in Figure 6, where “seed” is the initial seed value reflected in Figure\n2.\n\n_Figure 4: Standard MMIX-LCG Parameters_\n\n_Figure 5: BlackMatter MMIX-LCG Parameters_\n\n_Figure 6: BlackMatter MMIX-LCG Mask_\n\nIn addition to the LCG-PRNG algorithm changes, 2.0 decrypts in 8-byte blocks (previously 4-byte blocks) and conducts a byteswap on the MMIX-LCG generated value each round before using it as an XOR key for the 8-byte block. For each MMIX-LCG\ngenerated value, the following byte-swap is performed:\n\n_Figure 7: Version 2.0 Byte-Swap_\n\nFollowing decryption, there are no additional changes in the procedure, and configuration data is aPLib decompressed in all\nversions (1.2, 1.9, and 2.0) and parsed.\n\n**Configuration Parsing**\n\nThe decrypted and decompressed configuration data yields several differences, as described below. There were no changes\nin the configuration data from 1.9 to 2.0, so all differences will reflect a comparison between 1.2 and 1.9.\n\nDifference 1: Configuration Flag – Print Ransom Note\n\n_Figure 8: Version 1.2/1.9 Configuration Flag Parsing_\n\nThe first noticeable difference is in the number of parsed flags. In Version 1.2 on the left, 8 flags are parsed, while in Version\n1.9 on the right, 9 flags are parsed.\n\n\n-----\n\n_Figure 9: Version 1.2/1.9 Configuration Structure_\n\nThe additional flag is described above for Version 1.9 on the right as print_ransom, which is noticeably absent from Version 1.2\non the left. If the print_ransom field is set, during runtime the BlackMatter ransomware will invoke the method below, which\ncalls the dynamically resolved API GetDefaultPrinterW (which is not resolved in Version 1.2) and if the default printer is not a\n“PDF” printer, it will print the ransom note to that printer.\n\n_Figure 10: Version 1.9 Print Ransom Note Function_\n\nDifference 2: Configuration Parameter – Invalid Hostnames\n\n\n-----\n\n_Figure 11: Version 1.9 Configuration Structure_\n\nThe second configuration difference is in the inclusion of invalid hostname hashes, displayed in the structure above. The\n[hostnames are leveraged in the “safe mode” function, as described by Sophos. The difference from Version 1.2 to Version 1.9](https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/)\nis the inclusion of a function which checks if the compromised system is an invalid host.\n\n_Figure 12: Version 1.2/1.9 Safe Install Function_\n\nAs displayed in the screenshot below, the comparison is achieved by hashing and comparing the hostname to the list of invalid\nhostname hashes, using the ROR-13-ADD hash algorithm (lowercase string, include null terminator).\n\n\n-----\n\n_Figure 13: Version 1.9 Invalid Host Name Check_\n\nThe Version 1.9 analyzed sample was not configured with any invalid hostname hashes, however, it can be surmised that the\nmalware authors are attempting to avoid running in Sandboxes or other Virtual Analysis Environments.\n\nDifference 3: Configuration Parameter – Ransom Note Hash\n\n_Figure 14: Version 1.2/1.9 Configuration Structure_\n\nThe final configuration difference is the inclusion of the ransom note hash, using the ROR-13-ADD hash algorithm (include null\nterminator, use seed of -1).\n\n\n-----\n\n_Figure 15: Version 1.2/1.9 Verify Not Ransom Note Function_\n\nIn Version 1.2 on the left, we can observe that the BlackMatter ransomware will verify the input file is the same size as the\nransom note, and that the filename hash (ROR-13-ADD hash algorithm (lowercase string, include null terminator, use seed of\n-1)) is the same as the previously calculated value. On the right, Version 1.9 contains the same checks, but additionally hashes\nthe file data to compare against the configured hash value.\n\nRansom notes have been observed in varying sizes, with some containing extra information in comparison to others, so the\npurpose of this change is unknown.\n\nDifference 4: Ransom Note\n\nThe ransom note obtained from Version 1.9 contains significantly more content than the one obtained from Version 1.2. The\nadditional content includes details of the type of information stolen from the victim and print.sc links which presumably provide\nevidence that the information has been stolen. print.sc is a screenshot sharing service associated with\nthe [LightShot screenshot application.](https://app.prntscr.com/en/index.html)\n\n_Figure 16: Version 1.9 Ransom Note_\n\n\n-----\n\n_Figure 17: Version 1.2 Ransom Note_\n\n## Conclusion\n\nThe BlackMatter ransomware group is actively compromising victims and evolving their ransomware tooling and processes;\nnetwork defenders need to remain just as vigilant. Cipher Tech’s ACCE solution leverages more than a decade of defense\nexpertise to provide a service that can support your incident response and malware analysis teams in automating the process\nof identifying, unpacking, deobfuscating, decrypting, and parsing supported adversarial tooling.\n\nCipher Tech will continue to monitor the ransomware threat landscape and do our part to inform defenders on the threats to\ntheir networks and their customers’ data.\n\n## IOCs\n\n**Hashes (MD5)**\n\nVersion 1.2\n\n18b8ab6af00f387f98b6d7f20253b87b\n\n598c53bfef81e489375f09792e487f1a\n\n639bb7abbd9bc6a9c275d0bf9555b610\n\n6de1ba98baeda1f31e128f982e3878eb\n\n9c26a90a84078a406babb3543d79b8b7\n\na55bc3368a10ca5a92c1c9ecae97ced9\n\nad260da314d2f8f3f1531cc5779cbba9\n\nba375d0625001102fc1f2ccb6f582d91\n\nd0512f2063cbd79fb0f770817cc81ab3\n\ne1f8b95beb02cd39e55cd8b31419b10f\n\ne6b0276bc3f541d8ff1ebb1b59c8bd29\n\ned74126d9234ac9c1dd21483e82a0dff\n\nVersion 1.6\n\n01aef1c692a50a9d0e0369a58b1516ff\n\n10aa058a3ac49e016cad7987b8e09886\n\n1dd464cbb3fbd6881eef3f05b8b1fbd5\n\n3317daace715dc332622d883091cf68b\n\nVersion 1.9\n\n\n-----\n\nf1c260c31b9d3f9ff54a142d508ec602\n\nVersion 2.0\n\n38035325b785329e3f618b2a0b90eb75\n7b125a148ce0e0c126b95395dbf02b0e\nead753c057b5c3888ed2484013400b82\n38035325b785329e3f618b2a0b90eb75\n\nC2 URLs\n\nhttp://mojobiden.com\nhttp://nowautomation.com\nhttp://paymenthacks.com\n\nTOR Ransom URLs\n\nhttp://supp24maprinktc7uizgfyqhisx7lkszb6ogh6lwdzpac23w3mh4tvyd.onion/LEOYRMQLSRHFGFGYWF2T5\nhttp://supp24maprinktc7uizgfyqhisx7lkszb6ogh6lwdzpac23w3mh4tvyd.onion/OR7OTLBK8D5UVHZ0Q\nhttp://supp24maprinktc7uizgfyqhisx7lkszb6ogh6lwdzpac23w3mh4tvyd.onion/OYPF561W4U8HVA0NLVCKJCZB\nhttp://supp24yy6a66hwszu2piygicgwzdtbwftb76htfj7vnip3getgqnzxid.onion/7NT6LXKC1XQHW5039BLOV\nhttp://supp24yy6a66hwszu2piygicgwzdtbwftb76htfj7vnip3getgqnzxid.onion/EBVCVJNCPM6A3NKJ\nhttp://supp24yy6a66hwszu2piygicgwzdtbwftb76htfj7vnip3getgqnzxid.onion/GDBJS76DH3D4IKQD2QO7R\nhttp://supp24yy6a66hwszu2piygicgwzdtbwftb76htfj7vnip3getgqnzxid.onion/O3KTUJZRE6CB4Q1OBR\n\nTOR Blog URLs\n\nhttp://blackmax7su6mbwtcyo3xwtpfxpm356jjqrs34y4crcytpw7mifuedyd.onion/xscSyb9oue/b2ec5065190ebe423b201a9f2af97bb7\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-08 - Rapidly Evolving BlackMatter Ransomware Tactics.pdf"
    ],
    "report_names": [
        "2021-09-08 - Rapidly Evolving BlackMatter Ransomware Tactics.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536060,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653779739,
    "ts_modification_date": 1653779739,
    "files": {
        "pdf": "https://archive.orkl.eu/6c1c4295bb1bbcbc9b02324b002d2d0843a2d8f9.pdf",
        "text": "https://archive.orkl.eu/6c1c4295bb1bbcbc9b02324b002d2d0843a2d8f9.txt",
        "img": "https://archive.orkl.eu/6c1c4295bb1bbcbc9b02324b002d2d0843a2d8f9.jpg"
    }
}