{
    "id": "be5fed6d-1512-4c92-9c8b-8939ffddea6d",
    "created_at": "2023-01-12T15:00:04.753488Z",
    "updated_at": "2025-03-27T02:16:17.041719Z",
    "deleted_at": null,
    "sha1_hash": "89228df2b8ddf0baf9fb5e02199de2df65dd29a1",
    "title": "2021-10-05 - Drawing a Dragon- Connecting the Dots to Find APT41",
    "authors": "",
    "file_creation_date": "2022-05-28T23:16:27Z",
    "file_modification_date": "2022-05-28T23:16:27Z",
    "file_size": 1349556,
    "plain_text": "# Drawing a Dragon: Connecting the Dots to Find APT41\n\n**[blogs.blackberry.com/en/2021/10/drawing-a-dragon-connecting-the-dots-to-find-apt41](https://blogs.blackberry.com/en/2021/10/drawing-a-dragon-connecting-the-dots-to-find-apt41)**\n\nThe BlackBerry Research & Intelligence Team\n\n### Executive Summary\n\nThe [BlackBerry Research & Intelligence Team recently connected seemingly disparate](https://blogs.blackberry.com/en/category/research-and-intelligence)\nmalware campaigns, which began with an unusual Cobalt Strike configuration that was first\n[included in a blog post published the same month as COVID-19 lockdowns began in](https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html)\nEurope and the U.S. What we found led us through a malicious infrastructure that had been\npartially documented in articles by several other research organizations.\n\nThe image we uncovered was that of a state-sponsored campaign that plays on people’s\nhopes for a swift end to the pandemic as a lure to entrap its victims. And once on a user’s\nmachine, the threat blends into the digital woodwork by using its own customized profile to\nhide its network traffic.\n\n### Introduction\n\n\n-----\n\nAPT41 is a prolific Chinese state-sponsored cyberthreat group that has conducted malware\ncampaigns related to espionage and financially motivated criminal activity dating as far back\nas [2012. This threat group has targeted organizations around the world, in verticals such as](https://www.fireeye.com/current-threats/apt-groups.html)\ntravel, telecommunications, healthcare, news and education.\n\nAPT41 has often used [phishing emails with malicious attachments as an initial infection](https://www.fireeye.com/current-threats/apt-groups.html)\nvector. Once it has gained access to a target organization, it typically deploys more\nadvanced malware to establish a persistent foothold. This group uses a variety of different\nmalware families including information stealers, keyloggers and backdoors.\n\nBlackBerry researchers have been monitoring Cobalt Strike activity that used a bespoke,\nmalleable command-and-control (C2) profile, which had settings that were previously\ndocumented in a report by FireEye in March of 2020. They attributed this configuration to\nAPT41-related activity.\n\nWe were able to uncover what we believe is additional APT41 infrastructure by taking these\nunique aspects and following the trail of digital breadcrumbs. Overlapping indicators of\ncompromise (IOCs) linked the trail of our findings to those of two additional campaigns\n[documented by Positive Technologies and](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/) [Prevailion. These posts were titled \"Higaisa or](https://www.prevailion.com/the-gh0st-remains-the-same-2/)\n_Winnti? APT41 backdoors, old and new,\" and \"The Gh0st Remains the Same,\" respectively._\n\nWe also found three additional phishing lures targeting victims in India, containing\ninformation related to new tax legislation and COVID-19 statistics. These messages\nmasqueraded as being from Indian government entities.\n\nThese lures were part of an execution chain that had the goal of loading and executing a\nCobalt Strike Beacon on a victim’s network. The phishing lures and attachments also fit\ntactics that were previously used in infection vectors by APT41. These findings show that\nthe APT41 group is still regularly conducting new campaigns, and that they will likely\ncontinue to do so in the future.\n\n### Connecting the Dots\n\nA recent [blog post published by FireEye in March of 2020 explored APT41’s tactics,](https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html)\nincluding their use of malicious documents, exploits and Cobalt Strike. The report indicated\nthat the group was using a bespoke, malleable C2 profile with at least one of its Cobalt\nStrike Beacons.\n\nA malleable C2 profile is a feature within Cobalt Strike that allows an attacker to customize\na Beacon’s network communications to its C2 channel in a way that allows it to blend into\nnormal traffic on a victim network. For example, there are publicly available profiles that are\ndesigned to look like legitimate network traffic from Amazon, Gmail, OneDrive and many\nothers.\n\n\n-----\n\n[We uncovered a malleable C2 profile on GitHub that is very similar to that of the one](https://github.com/1135/1135-CobaltStrike-ToolKit/blob/master/Malleable%20C2%20Files/jquery.xxx.js_CN_cdn.bootcss.com_for_cs3.14_.txt)\nmentioned in the FireEye blog. This one seems to have been authored by a Chinese\nsecurity researcher with the pseudonym “1135.”\n\nThese profiles had several similarities: Both used jQuery Malleable C2 profiles, and portions\nof the HTTP GET profile block are almost identical. HTTP header fields such as “accept,”\n“user-agent,” “host,” and “referer,” as well as the “set-uri” field, were all exact matches to the\nprofile data listed in the FireEye blog.\n\n_Figure 1: JQuery Malleable C2 from the ‘1135’ Github_\n\nArmed with this data point, we can perform some deeper visual analysis of Beacon\nconfiguration data in our possession to reveal patterns that are only perceptible when a\nlarge data set is accessible. By extracting and correlating the HTTP headers used in the\nGET and POST requests defined in the Beacon configs, we can generate revealing\nconnections between seemingly disparate Cobalt Strike infrastructure.\n\n\n-----\n\n_Figure 2: Clustering on \"cdn.bootcss.com\" HttpPost_Metadata_\n\nWhile we identified a relatively small number of Beacons using the BootCSS domain as part\nof their Malleable C2 configuration, there were also a few clusters with unique configuration\nmetadata that enabled us to identify additional beacons related to APT41.\n\nThe Beacons served by these new nodes are using a different malleable profile to those in\nthe original cluster that attempts to make the Beacon traffic look like legitimate Microsoft\ntraffic.\n\n**IP** **Domain**\n\n\n-----\n\n**144.202.98.198** zalofilescdn[.]com\n\n**107.182.24.70** isbigfish[.]xyz\n\n**185.14.29.72** www[.]microsoftbooks[.]dns-dns[.]com\n\n**193.42.114.73** www[.]microsoftbooks.dns-dns[.]com\n\n**149.28.78.89** www[.]mlcrosoft[.]site\n\n**23.67.95.153** ns[.]mircosoftdoc[.]com\n\n**104.27.132.211** cdn[.]microsoftdocs[.]workers[.]dev\n\nccdn[.]microsoftdocs[.]workers[.]dev\n\nThe domains we found share similarities in their naming convention, which try to\nmasquerade as legitimate Microsoft® domains. Searching for these IPs and domains in a\nvariety of open source intelligence tool (OSINT) repositories reveals some connections that\nbear further examination. The IP 107.182.24[.]70 as well as the domain\nwww[.]mlcrosoft[.]site both appear within a blog from from Positive Technologies. Further\nhunting for the IP address 149.28.78[.]89 reveals links to a campaign mentioned in the\npreviously referenced Prevailion blog.\n\n### Gh0st in the Machine\n\nIn that blog, we can find two IOCs that appear in the cluster above; the IP 149.28.78.89,\nand the domain mlcrosoft.site. The blog associated those IOCs with the Higaisa advanced\npersistant threat (APT) group, which operates out of North Korea.\n\nThe domain mlcrosoft[.]site also appears in the blog from Positive Technologies. That article\nhas additional overlapping IOCs, and talks about the same campaign as mentioned in the\nPrevailion blog. However, it makes a strong argument that the activity is from APT41 rather\nthan Higaisa APT.\n\nWhen we do a side-by-side comparison of the domains from the Positive Technologies blog\nand our datasets, there is a strong similarity between naming conventions used:\n\n**BlackBerry IOCs** **Positive Technologies IOCs**\n\n\n-----\n\n**www[.]microsoftbooks.dns-dns[.]com**\n\n**cdn[.]microsoftdocs.workers[.]dev**\n\n**ccdn[.]microsoftdocs.workers[.]dev**\n\n**ns[.]mircosoftdoc[.]com**\n\n\nmicrosoftbooks[.]dynamic-dns[.]net\n\nmicrosoftdocs[.]dns05[.]com\n\nns[.]microsoftdocs.dns05[.]com\n\nns1[.]microsoftsonline[.]net\n\n\nWe also discovered that mlcrosoft[.]site and mircosoftdoc[.]com both appear in the AzureSentinel detection rule for known Barium phishing domains. The IP 144.202.98[.]198 has\nalso been previously associated with APT41/Barium by a Microsoft researcher.\n\nAnother IP from this cluster, 185.14.29[.]72, was recently providing virtual hosting for\nseveral domain names such as:\n\nchaindefend[.]bid\ndefendchain.[]xyz\nassistcustody[.]xyz\nmicrosoftonlineupdate.dynamic-dns[.]net\n\nPreviously, this IP has been associated with DNS resolutions for schememicrosoft[.]com\nand www.microsoftbooks[.]dns-dns.com. Several of the domains also have links to\n209.99.40[.]222, an IP that is known to perform malicious DNS/bulletproof hosting.\n\nAs of Sept. 14, 2021, this IP resolved to a new domain very briefly:\nwww.microsoftonlineupdate.dynamic-dns[.]net. This domain also conforms to a naming\nconvention similar to those we have seen in the previous table.\n\n\n-----\n\n_Figure 3: Teamserver geolocation_\n\n### Phishing Lures\n\nBy performing further intelligence correlation to investigate these URLs further, we found a\nmalicious PDF that reaches out to ccdn[.]microsoftdocs.workers[.]dev. This site had\npreviously hosted a Cobalt Strike Team Server.\n\nFurther digging reveals a set of three PDFs used as malicious phishing lures, which are\nlinked to the *.microsoftdocs.workers[.]dev domains. These lures all target victims in India,\neither promising information regarding new India-specific income taxation rules or COVID19 advisories.\n\nThe first lure – “Income tax new rules for NRI.pdf.lnk” – contains both a PDF document and\nan embedded PowerShell script. Upon execution, the PDF is displayed to the user, after\nwhich the PowerShell is executed in the background.\n\n\n-----\n\n_Figure 4: Phishing lure 1_\n\nThe PowerShell script downloads and executes a payload via “%temp%\\conhost.exe,”\nwhich loads a payload file called \"event.dat.\" This .DAT file is a Cobalt Strike Beacon.\n\nThe second and third lures each have similar execution flows and component parts; a PDF\nlure, conhost.exe, and an event.* payload. In this case, these event files had a .LOG\nextension, rather than .DAT.\n\n\n-----\n\nThe biggest difference between the second and third lures is that one uses a self-extracting\narchive named “India records highest ever single day covid_19 recoveries.pdf.exe,” and the\nother uses a ZIP file named “India records highest ever single day COVID-19\nrecoveries.zip.”\n\n_Figure 5: Contents of lures 2 and 3_\n\nLures two and three also contain the same information within their respective PDFs. Both\nrelate to a record high number of COVID-19 recoveries in India, information which purports\nto be from the Indian Government Ministry of Health & Family Welfare.\n\n\n-----\n\n_Figure 6: Phishing lure 2 and 3 PDF contents_\n\nBy extracting the configurations from each of the three lures’ event.* Beacon payloads, we\ncan see that the C2 server address used in the configuration data differs slightly:\n\nLure-1 uses ccdn[.]microsoftdocs.workers.dev/en-us/windows/apps/\nLure-2 & 3 use cdn[.]microsoftdocs.workers.dev/en-us/windows/apps/\n\nThe same can be seen for the HttpGet_Metadata and HttpPost_Metadata host addresses:\n\nLure-1 uses ccdn[.]microsoftdocs.workers.dev\nLure-2 & 3 use cdn[.]microsoftdocs.workers.dev\n\n\n-----\n\n**KEY** **VALUE**\n\nBeaconType HTTPS\n\nPort 443\n\nSleepTime 1000\n\nMaxGetSize 1398104\n\nJitter 0\n\nMaxDNS 255\n\nC2Server ccdn[.]microsoftdocs.workers.dev,/enus/windows/apps/ (Lure 1)\ncdn[.]microsoftdocs.workers.dev,/enus/windows/apps/ (Lure 2&3)\n\nUserAgent Mozilla/5.0 (MSIE 10; Windows NT 6.1; Trident/5.0)\n\nHttpPostUri /en-us/windows/windows-server/\n\nMalleable_C2_Instructions Base64 decode\n\nHttpGet_Metadata ConstHeaders\n\nHost: ccdn[.]microsoftdocs.workers.dev (Lure-1)\nHost: cdn[.]microsoftdocs.workers.dev(Lure-2&3)\nUser-Agent: Mozilla/5.0 (Windows NT 6.1;\nTrident/5.0)\nAccept: */*\nAccept-Encoding: gzip, deflate, br\n\nMetadata\n\nbase64\nprepend \"__cfduid=\"\nheader \"Cookie\"\n\n\n-----\n\nHttpPost_Metadata ConstHeaders\n\nHost: ccdn[.]microsoftdocs.workers.dev (Lure-1)\nHost: cdn[.]microsoftdocs.workers.dev(Lure-2&3)\nUser-Agent: Mozilla/5.0 (Windows NT 6.1;\nTrident/5.0)\nAccept: */*\nAccept-Encoding: gzip, deflate, br\n\nSessionId\n\nbase64url\nparameter \"k\"\n\nOutput\n\nbase64\nprint\n\nDNS_Idle 104.88.34.55\n\nDNS_Sleep 0\n\nHttpGet_Verb GET\n\nHttpPost_Verb POST\n\nHttpPostChunk 0\n\nSpawnto_x86 %windir%\\syswow64\\gpupdate.exe\n\nSpawnto_x64 %windir%\\sysnative\\gpupdate.exe\n\nCryptoScheme 0\n\nProxy_Behavior Use IE settings\n\nWatermark 305419896\n\nbStageCleanup False\n\n\n-----\n\nbCFGCaution False\n\nKillDate 0\n\nbProcInject_StartRWX True\n\nbProcInject_UseRWX True\n\nbProcInject_MinAllocSize 0\n\nProcInject_PrependAppend_x86 Empty\n\nProcInject_PrependAppend_x64 Empty\n\nProcInject_Execute CreateThread\nSetThreadContext\nCreateRemoteThread\nRtlCreateUserThread\n\nProcInject_AllocationMethod VirtualAllocEx\n\nbUsesCookies True\n\nA report by Subex from September 2020 described a campaign using similar phishing lures,\n[also targeting Indian nationals, which they attributed to the Evilnum APT group. The](https://www.subexsecure.com/pdf/malware-reports/sept-2020/Evilnum-Infostealer-lurking-in-Indian-cyberspace%20.pdf)\nindicators of compromise (IOCs) in this report are quite similar (or even identical) to those of\nthe phishing lures we’ve previously investigated. We believe that this attack was\nperpetrated by APT41 and not the Evilnum group for several reasons:\n\nThe first is that the Event.* payloads are in fact Cobalt Strike Beacons, as per the extracted\nconfiguration data shown in the table above. This behavior is indicative of APT41 rather\nthan the Golden Chickens Malware-as-a-Service (MaaS), as reported in the Subex Evilnum\nAPT report.\n\nThe second reason is that there are several configuration settings that indicate APT41\nactivity when they’re aggregated. These same settings were present within the phishing lure\nBeacons and have been observed in previous attacks by this group.\n\n\n-----\n\n[In addition to this, the aforementioned blog from Positive Technologies contained](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/)\noverlapping infrastructure that ties in with what we have observed. They documented\nsimilar phishing lures using PDF documents as bait, which they attributed to APT41.\n\nThese lures follow a similar naming convention to the ones we’ve documented here. Their\nexecution chains encompass both a loader and payload component, but Cobalt Strike was\njust one of several potential payloads that were listed.\n\nThe use of spear-phishing attachments to gain initial access has been a known APT41 tool,\ntechnique and procedure (TTP) for years. In addition, the previously discussed overlap in\nnetwork infrastructure adds credence to this being an APT41-affiliated campaign.\n\n### Conclusions\n\nIt’s a rare treat for a research organization to have a truly robust set of data about any one\nthreat. Having a security industry that puts a strong emphasis on the public sharing of\ninformation means that we can put our collective heads together to create a more complete\npicture.\n\nAn article posted by FireEye initially pointed us to a Malleable C2 profile for Cobalt Strike.\nWe researched this and found a similar profile that had Beacons using the BootCSS\ndomain as part of their configuration. This then pointed us to additional overlapping\nconfiguration metadata within the Beacon configuration, which subsequently steered us into\nidentifying a whole new cluster and a new set of domains.\n\nThis discovery led us to find connections with the campaign referenced in the Prevailion\npost, which ushered us into seeing overlaps within the IOCs in the Positive Technologies\nblog. We found that these IOCs also overlap with those of the Azure-Sentinel detection rule\nfor the APT41 threat actor group.\n\nWhen we looked deeper into the activities of the threats within these clusters, the\nsimilarities continued. Reports from Subex and Positive Technologies described campaigns\nusing PDF files that lured people in with a variety of tactics, including leveraging people’s\ndesire to see information indicating a swift end to the COVID-19 pandemic.\n\nWith the resources of a nation-state level threat group, it’s possible to create a truly\nstaggering level of diversity in a threat infrastructure. And while no one security group has\nthat same level of funding, by pooling our collective brainpower we can still uncover the\ntracks that the cybercriminals involved worked so hard to hide.\n\n### Indicators of Compromise (IoCs)\n\nPlease view our GitHub for the IoCs referenced in this\nreport: [https://github.com/blackberry/threat-research-and-intelligence/blob/main/APT41.csv](https://github.com/blackberry/threat-research-and-intelligence/blob/main/APT41.csv)\n\n\n-----\n\n_Want to learn more about cyber threat hunting? Check out the BlackBerry Research &_\n_Intelligence Team’s new book,_ _Finding Beacons in the Dark: A Guide to Cyber Threat_\n_Intelligence - now available for pre-order_\n\n**_here._**\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats,\nproviding intelligence analysis for the benefit of defenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-05 - Drawing a Dragon- Connecting the Dots to Find APT41.pdf"
    ],
    "report_names": [
        "2021-10-05 - Drawing a Dragon- Connecting the Dots to Find APT41.pdf"
    ],
    "threat_actors": [
        {
            "id": "059b16f8-d4e0-4399-9add-18101a2fd298",
            "created_at": "2022-10-25T15:50:23.29434Z",
            "updated_at": "2025-03-27T02:00:55.431907Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Evilnum"
            ],
            "source_name": "MITRE:Evilnum",
            "tools": [
                "More_eggs",
                "EVILNUM",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39ea99fb-1704-445d-b5cd-81e7c99d6012",
            "created_at": "2022-10-25T16:07:23.601894Z",
            "updated_at": "2025-03-27T02:02:09.882982Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Jointworm",
                "Operation Phantom in the [Command] Shell",
                "TA4563"
            ],
            "source_name": "ETDA:Evilnum",
            "tools": [
                "Bypass-UAC",
                "Cardinal RAT",
                "ChromeCookiesView",
                "EVILNUM",
                "Evilnum",
                "IronPython",
                "LaZagne",
                "MailPassView",
                "More_eggs",
                "ProduKey",
                "PyVil",
                "PyVil RAT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraPreter",
                "TerraStealer",
                "TerraTV"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7a257844-df90-4bd4-b0f1-77d00ff82802",
            "created_at": "2022-10-25T16:07:24.376356Z",
            "updated_at": "2025-03-27T02:02:10.199451Z",
            "deleted_at": null,
            "main_name": "Venom Spider",
            "aliases": [
                "Golden Chickens",
                "Venom Spider"
            ],
            "source_name": "ETDA:Venom Spider",
            "tools": [
                "More_eggs",
                "PureLocker",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Taurus Loader Reconnaissance Module",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraCrypt",
                "TerraPreter",
                "TerraRecon",
                "TerraStealer",
                "TerraTV",
                "TerraWiper",
                "ThreatKit",
                "VenomKit",
                "VenomLNK",
                "lite_more_eggs"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "49822165-5541-423d-8808-1c0a9448d588",
            "created_at": "2022-10-25T16:07:23.384093Z",
            "updated_at": "2025-03-27T02:02:09.772829Z",
            "deleted_at": null,
            "main_name": "Barium",
            "aliases": [
                "Brass Typhoon",
                "Pigfish"
            ],
            "source_name": "ETDA:Barium",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Barlaiy",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "POISONPLUG",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88802a4b-5b3d-42ee-99e6-8a4f5fd231f6",
            "created_at": "2023-01-06T13:46:38.851345Z",
            "updated_at": "2025-03-27T02:00:02.935087Z",
            "deleted_at": null,
            "main_name": "GC01",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens01",
                "Golden Chickens 01"
            ],
            "source_name": "MISPGALAXY:GC01",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5c90ccc-0f18-4e07-a246-b62101ab2f6f",
            "created_at": "2023-01-06T13:46:38.854407Z",
            "updated_at": "2025-03-27T02:00:02.935908Z",
            "deleted_at": null,
            "main_name": "GC02",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens02",
                "Golden Chickens 02"
            ],
            "source_name": "MISPGALAXY:GC02",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535604,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1653779787,
    "ts_modification_date": 1653779787,
    "files": {
        "pdf": "https://archive.orkl.eu/89228df2b8ddf0baf9fb5e02199de2df65dd29a1.pdf",
        "text": "https://archive.orkl.eu/89228df2b8ddf0baf9fb5e02199de2df65dd29a1.txt",
        "img": "https://archive.orkl.eu/89228df2b8ddf0baf9fb5e02199de2df65dd29a1.jpg"
    }
}