{
    "id": "be930c70-9f0d-465b-8724-d73467760a00",
    "created_at": "2023-01-12T15:07:54.531345Z",
    "updated_at": "2025-03-27T02:05:18.663823Z",
    "deleted_at": null,
    "sha1_hash": "18ac37e4699c8021e413179ee0dc38f8652b59d6",
    "title": "2020-12-01 - There’s a RAT in my code- new npm malware with Bladabindi trojan spotted",
    "authors": "",
    "file_creation_date": "2022-05-28T19:27:42Z",
    "file_modification_date": "2022-05-28T19:27:42Z",
    "file_size": 1676140,
    "plain_text": "# There’s a RAT in my code: new npm malware with Bladabindi trojan spotted\n\n**[blog.sonatype.com/bladabindi-njrat-rat-in-jdb.js-npm-malware](https://blog.sonatype.com/bladabindi-njrat-rat-in-jdb.js-npm-malware)**\n\n\n-----\n\nOver the Thanksgiving weekend, Sonatype discovered new malware within the npm registry.\nThis time, the typosquatting packages identified by us are laced with a popular Remote\nAccess Trojan (RAT).\n\nThe malicious packages are:\n\n[jdb.js](https://www.npmjs.com/package/jdb.js)\n[db-json.js](https://www.npmjs.com/package/db-json.js)\n\nBoth of these packages have been published by the same author.\n\nOn Friday, Sonatype’s [Nexus Intelligence, which includes next generation machine learning](https://www.sonatype.com/nexus/intelligence)\nalgorithms that automatically detect potentially malicious open source components, flagged\n“jdb.js” for being suspicious.\n\nThis is the same state-of-the-art technology that has recently unveiled open source malware\n[like CursedGrabber, fallguys’ successor](https://blog.sonatype.com/npm-malware-xpc.js) _[discord.dll, typosquatting npm packages like](https://blog.sonatype.com/discord.dll-successor-to-npm-fallguys-)_\n_[electorn,](https://blog.sonatype.com/sonatype-spots-malicious-npm-packages)_ _[twilio-npm, and many more.](https://blog.sonatype.com/twilio-npm-is-brandjacking-malware-in-disguise)_\n\nUpon digging deeper, we discovered that the author behind “jdb.js” had also published\nanother malicious npm package, “db-json.js.”\n\nAs the name implies, “jdb.js” attempts to mimic the legitimate NodeJS-based database\nlibrary, [jdb. Similarly, “db-json.js” carries an identical name to the genuine db-json library.](https://www.npmjs.com/package/jdb)\n\n\n-----\n\nHowever, jdb.js is in fact a malicious package bundled with a Remote Access Trojan (RAT)\n[called njRAT aka Bladabindi.](https://en.wikipedia.org/wiki/Njrat)\n\nRATs are a type of malware that enable attackers to take over an infected system, execute\narbitrary commands, run keyloggers, and discreetly conduct other surveillance activities.\n\n**njRAT is an info-stealing trojan that had been deployed in widespread attacks that led**\n[Microsoft to shut down 4 million sites in 2014.](https://krebsonsecurity.com/2014/07/microsoft-darkens-4mm-sites-in-malware-fight/)\n\n[In recent years, variants of njRAT/Bladabindi have been distributed via Bitcoin scams on](https://www.bleepingcomputer.com/news/security/youtube-bitcoin-scams-pushing-the-njrat-backdoor-infostealer/)\n[YouTube and via Excel phishing emails. And, given njRAT’s customizability and easy](https://www.zdnet.com/article/malware-gang-uses-net-library-to-generate-excel-docs-that-bypass-security-checks/)\navailability on the darknet, the malware has also been shipped by threat actors as part of\n[their ransomware exploit kits.](https://www.bleepingcomputer.com/news/security/new-lord-exploit-kit-pushes-njrat-and-eris-ransomware/)\n\n## Dissecting npm malware “jdb.js”\n\nPublished last week, “jdb.js” is an npm package (not a JavaScript file) with just one version\n1.0.0 that contains 3 files:\n\n_package.json, the manifest file_\n_module.js, an obfuscated script_\n_patch.exe, Windows executable containing the njRAT payload_\n\nThe counterfeit component has scored just below a 100 downloads, thanks to Sonatype’s\nautomated systems catching it shortly after release.\n\nThe package.json manifest file contained within the package launches module.js as soon as\nthe package is installed.\n\n_module.js is a heavily obfuscated script containing multiple base64-encoded chunks that_\ncannot be easily deciphered: decoding these strings renders gibberish values, implying these\nbase64 chunks contain binary, or encrypted data.\n\n\n-----\n\n**Image: Obfuscated module.js file (code spread out by us for legibility)**\n\nThe script conducts multiple sinister activities such as data gathering and reconnaissance,\n[and ultimately launches patch.exe which is an njRAT dropper written in .NET.](https://www.virustotal.com/gui/file/d6c04cc24598c63e1d561768663808ff43a73d3876aee17d90e2ea01ee9540ff/detection)\n\nAlthough patch.exe contains an older, known njRAT strand, at the time of our analysis,\n[VirusTotal indicated this particular sample was first submitted to the engine last week by](https://www.virustotal.com/gui/file/d6c04cc24598c63e1d561768663808ff43a73d3876aee17d90e2ea01ee9540ff/details)\nSonatype, meaning it contained at least some new information.\n\nDecompiling the executable reveals that crucial information.\n\nOne of the class constructors, called “OK”, has hardcoded strings revealing the location of\nthe command and control (C2) server and port the malware would be communicating with,\nthe local Windows folder where it would drop itself, etc.\n\n\n-----\n\n**Image: hardcoded strings within patch.exe sample, such as C2 server IP address,**\n**name of the dropped process, etc.**\n\nAs soon as patch.exe runs, it copies itself into the local “TEMP” folder on the system and\nrenames itself to “dchps.exe” (a value revealed within the screenshot). The C2 server and\nport it establishes a connection to is 46.185.116.2:5552.\n\nHowever, prior to communicating with the C2 infrastructure, the malicious executable edits\nWindows firewall rules to ensure it would have no trouble communicating with the hardcoded\nIP. To do so, it issues the legitimate “netsh” command multiple times, starting with:\n\nnetsh firewall add allowedprogram \"C:\\Users\\admin\\AppData\\Local\\Temp\\dchps.exe\"\n\"dchps.exe\" ENABLE\n\nThe commands that can be remotely executed by the C2 server operator are quite\nextensive\n\n\n-----\n\nBy infecting a host with this malware, a remote attacker gains the ability to log keystrokes,\nmodify registry values, initiate system shutdown or restart at will, edit web browser (IE) start\n[page, “speak” to the user via text-to-speech synthesis (via SAPI.Spvoice), kill or relaunch](https://docs.microsoft.com/en-us/previous-versions/windows/desktop/ms723602(v=vs.85))\ncritical system processes like task manager, system restore, and PING, in addition to taking\ncontrol of hardware devices like CD drives, monitors, mouse, keyboard, etc.\n\n**Image: Partial list of commands an njRAT C2 server can send to execute on the**\n**infected host for the trojan to execute**\n\nThe malware also contains a hardcoded link,\n_https://dl.dropbox[.]com/s/p84aaz28t0hepul/Pass.exe, now disabled by Dropbox, that has_\n[also frequently appeared in other njRAT samples.](https://www.virustotal.com/gui/file/3cdec66fd12d4592e4a37c9f4f1ddd6dd8878e7a9215054df3041fbd3a3ea578/detection)\n\nIt is worth noting the C2 server IP 46.185.116.2 that this sample communicates with is the\n[same IOC observed in some CursedGrabber binaries indicating the threat actors behind](https://blog.sonatype.com/npm-malware-xpc.js)\nCursedGrabber and the npm malware “jdb.js” could be linked.\n\n## Honest-looking “db-json.js” hides “jdb.js” within\n\n\n-----\n\nAlthough jdb.js exhibits obvious malicious signs, it s db-json.js that s concerning for it\nmight be harder for a human and a machine to spot immediately.\n\nFirst of all, “db-json.js” has a proper README page on npm, at the time of analysis, touting it\nto be JsonDb, an “easy to use module that makes database based on json files.”\n\nThere are well-documented instructions provided for the developer on how to incorporate this\nlibrary in their application.\n\n**Image: npm package “db-json.js” with a believable npm README page**\n\nThe package “db-json.js” appears clean on a first glance as it contains functional code one\nwould expect from a genuine JSON DB creation package. Yet, it is secretly pulling in the\n[malicious “jdb.js” as a dependency, something Sonatype has repeatedly warned about.](https://www.sonatype.com/press-release-blog/next-generation-nexus-intelligence)\n\nShown below is the manifest file in both versions 1.0.3 and 1.0.4 that contain “jdb.js” as a\ndependency.\n\n\n-----\n\nFurthermore, in version 1.0.4, the quasi-innocuous “dbmanager.js” class goes a step further\nby appending multiple empty lines towards the end of its functional code, with the very last\nline being:\n\nrequire('jdb.js');\n\n\n-----\n\n**Image: db-json.js containing otherwise “clean” code secretly launches jdb.js**\n\nThis means even if someone is able to dodge “jdb.js,” by using “db-json.js” in their\napplication, not only would they be infecting their machine with njRAT malware, they also put\nother developers at risk: developers who would install or fork applications built with “dbjson.js.”\n\nIn our recent state of the software supply chain report, we documented a 430% increase in\nmalicious code injection within OSS projects - or next-gen software supply chain attacks, and\nthis isn’t the first time we have seen attacks including counterfeit components.\n\n[Discovery of yet another family of counterfeit components, especially after “discord.dll” and](https://blog.sonatype.com/discord.dll-successor-to-npm-fallguys-)\nother Sonatype-discovered malware had already made headlines, speaks to the damage\nthat is possible to your software supply chain if adequate protections are not in place.\n\n## Timeline:\n\n\n-----\n\nSonatype s timeline related to the malicious package s discovery and reporting is as follows:\n\n**November 27th, 2020: Suspicious package “jdb.js” is picked up by our**\nautomated malware detection system within a day of its publication to npm\nregistry. While manually analyzing the package, another package “dbjson.js” by the same author is discovered.\n\nAlthough suspicious components can be automatically quarantined, our\nSecurity Research team immediately adds both packages to our data,\nassigning them identifier(s): sonatype-2020-1168.\n\n**November 27th, 2020: npm security team is notified the same day of**\nmalicious packages. Note: the day of this report fell over the Thanksgiving\nholiday weekend.\n\n**[November 30th, 2020: npm security team removes “jdb.js” (advisory) and](https://www.npmjs.com/advisories/1584)**\n[“db-json.js” (advisory).](https://www.npmjs.com/advisories/1585)\n**December 1st, 2020: Public disclosure via this blog post.**\n\nBased on the visibility we have, no Sonatype customers have downloaded either of these\npackages, and our customers remain protected against such counterfeit components.\n\nSonatype’s world-class open source intelligence, which includes our automated malware\ndetection technology, safeguards your developers, customers, and software supply chains\nfrom infections like these.\n\nIf you're not a Sonatype customer and want to find out if your code is vulnerable, you can\nuse Sonatype's free [Nexus Vulnerability Scanner to find out quickly.](https://www.sonatype.com/appscan)\n\nVisit the [Nexus Intelligence Insights page for a deep dive into other vulnerabilities like this](https://www.sonatype.com/nexus-intelligence-insights)\none or subscribe to automatically receive Nexus Intelligence Insights hot off the press.\n\n## Indicators of Compromise (IOCs):\n\nThis is not an exhaustive list of IOCs. Other njRAT samples exist in the wild.\n\n**URLs and IPs:**\n\n46.185.116.2:5552\n\nhttps://dl.dropbox[.]com/s/p84aaz28t0hepul/Pass.exe\n\n**Hashes:**\n\n\n-----\n\nd6c04cc24598c63e1d561768663808ff43a73d3876aee17d90e2ea01ee9540ff\n86c11e56a1a3fed321e9ddc191601a318148b4d3e40c96f1764bfa05c5dbf212\n\nTags: [vulnerabilities,](https://blog.sonatype.com/topic/vulnerabilities) [npm,](https://blog.sonatype.com/topic/npm) [featured,](https://blog.sonatype.com/topic/featured) [Nexus Intelligence Insights,](https://blog.sonatype.com/topic/nexus-intelligence-insights) [malicious code npm](https://blog.sonatype.com/topic/malicious-code-npm)\n\n### Written by Ax Sharma\n\nAx is a Security Researcher at Sonatype and Engineer who holds a passion for perpetual\nlearning. His works and expert analyses have frequently been featured by leading media\noutlets. Ax's expertise lies in security vulnerability research, reverse engineering, and\nsoftware development. In his spare time, he loves exploiting vulnerabilities ethically and\neducating a wide range of audiences.\n\nFollow me on:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-01 - There’s a RAT in my code- new npm malware with Bladabindi trojan spotted.pdf"
    ],
    "report_names": [
        "2020-12-01 - There’s a RAT in my code- new npm malware with Bladabindi trojan spotted.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536074,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653766062,
    "ts_modification_date": 1653766062,
    "files": {
        "pdf": "https://archive.orkl.eu/18ac37e4699c8021e413179ee0dc38f8652b59d6.pdf",
        "text": "https://archive.orkl.eu/18ac37e4699c8021e413179ee0dc38f8652b59d6.txt",
        "img": "https://archive.orkl.eu/18ac37e4699c8021e413179ee0dc38f8652b59d6.jpg"
    }
}