{
    "id": "be970e50-8aed-4d4f-8e44-baa7eec07b75",
    "created_at": "2023-01-12T15:00:34.349269Z",
    "updated_at": "2025-03-27T02:16:03.266002Z",
    "deleted_at": null,
    "sha1_hash": "fa833650e770c04542e74821b04c0c0854e6d5fa",
    "title": "2021-05-13 - Transparent Tribe APT expands its Windows malware arsenal",
    "authors": "",
    "file_creation_date": "2022-05-28T15:28:46Z",
    "file_modification_date": "2022-05-28T15:28:46Z",
    "file_size": 3318110,
    "plain_text": "# Transparent Tribe APT expands its Windows malware arsenal\n\n**blog.talosintelligence.com/2021/05/transparent-tribe-infra-and-targeting.html**\n\nBy [Asheer Malhotra,](https://twitter.com/asheermalhotra) [Justin Thattil and](https://twitter.com/ThattilJustin) [Kendall McKay.](https://twitter.com/kkmckay22)\n\nTransparent Tribe, also known as APT36 and Mythic Leopard, continues to create fake domains mimicking legitimate military and\ndefense organizations as a core component of their operations. Cisco Talos' previous research has mainly linked this group to\n[CrimsonRAT, but new campaigns show they are expanding their Windows malware arsenal with ObliqueRAT.](https://blog.talosintelligence.com/2021/02/obliquerat-new-campaign.html)\n\nWhile military and defense personnel continue to be the group's primary targets, Transparent Tribe is increasingly targeting diplomatic\nentities, defense contractors, research organizations and conference attendees, indicating that the group is expanding its targeting.\n\n\n-----\n\nOur recent research into Transparent Tribe uncovered two types of domains the group uses in their various campaigns: fake domains\nmasquerading as legitimate Indian defense and government-related websites, and malicious domains posing as content-hosting\n[sites. These domains work in conjunction with each other to deliver maldocs distributing CrimsonRAT and](https://malpedia.caad.fkie.fraunhofer.de/details/win.crimson) [ObliqueRAT.](https://blog.talosintelligence.com/2021/02/obliquerat-new-campaign.html)\n\nBased on our findings, Transparent Tribe's tactics, techniques, and procedures (TTPs) have remained largely unchanged since 2020,\nbut the group continues to implement new lures into its operational toolkit. The variety of maldoc lures Transparent Tribe employs\nindicates the group still relies on social engineering as a core component of its operations.\n\n## Hosting infrastructure\n\nTransparent Tribe uses a two-pronged approach for registering malicious domains: Fake domains masquerading as legitimate sites\nbelonging to government, defense, or research entities, and malicious domains that resemble file-sharing websites.\n\n### Fake domains\n\nOur latest Transparent Tribe research confirms that the group continues to create malicious domains mimicking defense-related\nentities as a core component of their operations. During our most recent investigation, we discovered a fake domain,\nclawsindia[.]com, registered by the attackers. This domain masquerades as the website for the Center For Land Warfare Studies\n(CLAWS), an India-based think tank covering national security and military issues. (The legitimate domain for CLAWS is claws[.]in.)\nThe malicious clawsindia[.]com domain was previously hosted on 164[.]68[.]101[.]194, a known command and control (C2) for\nCrimsonRAT, Transparent Tribe's custom .NET remote access trojan (RAT). At this point, we cannot confirm how the attackers are\nusing or intend to use this domain as part of their broader operations. However, we also identified a subdomain,\nmail[.]clawsindia[.]com, hosted on the same IP, suggesting that the attackers are using it as part of a malspam campaign.\n\nBelow is one of the attackers' maldocs they used to target individuals applying for the CLAWS \"Chair of Excellence,\" an honorary title\nfor those making exceptional research contributions to strategic studies, according to the think tank's official [documentation. The](https://www.claws.in/static/CoAS-CoE-2021-PROPOSAL.pdf)\n[victim is encouraged to click on an embedded URL hosted on sharingmymedia[.]com, which then downloads ObliqueRAT, the trojan](https://blog.talosintelligence.com/2021/02/obliquerat-new-campaign.html)\ndiscovered by Talos in 2020 associated with threat activity targeting entities in South Asia.\n\nWe cannot confirm how the maldocs were delivered to victims, but we suspect they were probably sent as attachments to phishing\nemails based on previous threat actor behavior and the targeted nature of this particular lure. Security researchers previously\ndiscovered Transparent Tribe using sharingmymedia[.]com to host Android malware targeting Indian military and defense personnel.\n\nFigure 1: Maldoc masquerading as a congratulatory notice from CLAWS.\n\n\n-----\n\nAlthough we could not confirm the initial infection vector of ObliqueRAT maldocs, earlier campaigns had the same infection chain as\nthose seen in previous CrimsonRAT operations. In such cases, adversaries would deliver phishing maldocs to targets containing a\nmalicious VBA macro that extracted either the CrimsonRAT executable or a ZIP archive embedded in the maldoc. The macro\ndropped the implant to the disk, setting up persistence mechanisms and eventually executing the payload on the infected endpoint.\n\nThe actors recently deviated from the CrimsonRAT infection chains to make their ObliqueRAT phishing maldocs appear more\nlegitimate. For example, attackers leveraging ObliqueRAT started hosting their malicious payloads on compromised websites instead\nof embedding the malware in the maldoc. In one such case in early 2021, the adversaries used iiaonline[.]in, the Indian Industries\nAssociation's legitimate website, to host ObliqueRAT artifacts. The attackers then moved to hosting fake websites resembling those\nof legitimate organizations in the Indian subcontinent. Figure 2 shows the attackers' use of HTTrack, a free website copier program,\nto duplicate a legitimate website to use for their own malicious purposes. The attackers then used this fake website, which they\nhosted on a domain that was nearly identical to its legitimate counterpart, to distribute ObliqueRAT. These examples highlight\nTransparent Tribe's heavy reliance on social engineering as a core TTP and the group's efforts to make their operations appear as\nlegitimate as possible.\n\nFigure 2: Fake website cloned using HTTrack on May 29, 2020.\n\nAnother fake domain the group uses to serve CrimsonRAT is 7thcpcupdates[.]info. This domain masquerades as an information\nportal for [The 7th Central Pay Commission (CPC) of India, which provides payment information and updates for government](https://www.finmin.nic.in/seven-cpc)\nemployees. The malicious domain prompts the victim to enter their name and email address to sign up and download a seemingly\nimportant \"guide on pay and allowance.\"\n\n\n-----\n\nFigure 3: 7thcpcupdates[.]info landing page.\n\nOnce the victim enters their information, the portal prompts them to download the guide. Upon clicking \"Download Now,\" a malicious\nXLS file is downloaded onto the victim's computer. After enabling macros, the file executes CrimsonRAT on the endpoint.\n\n\n-----\n\nFigure 4: The \"Download Now\" button contains a link to a malicious XLS with CrimsonRAT embedded in it.\n\n### Malicious file-sharing domains\n\nTransparent Tribe also regularly registers domains that appear to be legitimate file- and media-sharing services. For example, the\ngroup has used drivestransfer[.]com, file-attachment[.]com, mediaclouds[.]live, and emailhost[.]network during their operations. In the\nCLAWS example above, the adversaries used another such malicious domain, sharingmymedia[.]com, to host ObliqueRAT.\n(Additional domains are listed in the IOCs section.) The infection chain involving these domains is similar to the one described above\nin which the threat actors use social engineering to convince the victim to download and open the malware hosted on these sites.\n\n\n-----\n\nFigure 5: A sample XLS maldoc containing a malicious macro hosted on emailhost[.]network.\n\n## Lures and targeting\n\nTransparent Tribe uses a variety of themes in their lures that evolved over time. The group has leveraged generic themes, such as\nresumes and CVs, since early 2019. From 2019 and continuing into 2020, the attackers started using honeytrap-themed lures to trick\ntargets into opening ZIP archives and maldocs that posed as pictures of women. By mid-2020, the attackers reverted to primarily\ndistributing military-themed maldocs. These maldocs did not contain popular news topics, as seen in older campaigns, but instead\nmasqueraded as logistical and operational documents for the Indian Armed Forces.\n\n\n-----\n\nBut Transparent Tribe s attacks are not limited to only India. In one campaign, the attackers used an Iranian Ministry of Foreign Affairs\n(MOFA)-themed maldoc to distribute CrimsonRAT in mid-2019. Then, in mid- to late-2020, the attackers targeted diplomatic entities\nwith RAR archives pretending to be related to the British High Commision in Islamabad, Pakistan. In mid-2020, we observed the first\ninstance of conference attendees being targeted in the form of a CrimsonRAT maldoc masquerading as the agenda for an Afghani\nconference. However, since the start of this year, the group has increasingly used lures disguised as content from Indian governmentsponsored conferences.\n\n### Defense-themed lures\n\nTransparent Tribe has historically used military and defense-themes in their phishing emails and maldocs to target Indian military and\ngovernment personnel. In one such case, we observed the group using the COVID-19 pandemic to target defense personnel.\n\nFigure 6: Transparent Tribe's spear-phishing email targeting defense personnel.\n\n[The embedded XLS maldoc masquerades as a generic Health Advisory on COVID-19. This is in line with previous reporting on](https://www.kaspersky.com/about/press-releases/2020_transparent-tribe-transparent-lives-new-android-spyware-distributed-under-the-guise-of-popular-apps)\nTransparent Tribe's use of official COVID-19 applications and content to serve Android malware.\n\n\n-----\n\nFigure 7: Attached malicious XLS macro.\n\nAnother lure targeted Indian Defense Advisors attached to various Indian embassies in Southeast Asia, as seen in Figure 8.\n\nFigure 8: Spear-phishing email targeting Defense Advisors.\n\n[This lure consisted of a list of countries pertaining to one of the College of Defense Management's (CDM) study tours.](https://cdm.ap.nic.in/)\n\n\n-----\n\nFigure 9: Maldoc impersonating a list for CDM study tours.\n\n### Conference attendees\n\nTransparent Tribe also finds attendees of specific conferences to target. Figure 10 shows a maldoc part of a 2020 operation used to\ndistribute CrimsonRAT. The malicious XLS contained the agenda for \"Building a Peaceful Afghanistan: Regional and International\nSupport for afghan Peace\" dialogue series conducted by the [Heart of Asia Society (HAS).](https://heartofasiasociety.org/)\n\nFigure 10: Maldoc impersonating the agenda for HAS' dialogue series 2020.\n\n### Diplomatic themes\n\nIn one incident, we observed Transparent Tribe using an Iranian-themed lure to distribute CrimsonRAT. The maldoc is a note from\nIran's Foreign Minister responding to the U.S. designation of Iran's Revolutionary Guard Corps (IRGC) as a Foreign Terrorist\nOrganization (FTO). We could not determine who the intended targets were.\n\n\n-----\n\nFigure 11: Maldoc pretending to be a note from the MOFA Iran.\n\nIn another instance, we observed a malicious ZIP archive targeting the British High Commission in Islamabad with CrimsonRAT.\n\nFigure 12: Malicious archive with BHC-themed filenames containing CrimsonRAT.\n\n### HoneyTraps\n\nTransparent Tribe consistently uses alluring documents and file names, commonly referred to as honeytraps, to trick victims into\nexecuting malicious content on their endpoints. Specifically, we have observed the group using resume documents and archives,\nsuch as ZIPs and RARs, with alluring themes distributing CrimsonRAT.\n\n\n-----\n\nFigure 13: One of the many honeytrap lure maldocs used by Transparent Tribe.\n\nTransparent Tribe also delivers malicious archives containing CrimsonRAT executables using various themes, including honeytraps.\nIn a few of these instances, the malicious executables in the archives contained honeytrap-themed icons to entice the victims into\nexecuting them.\n\nFigure 14: CrimsonRAT executables from as early as 2019 containing explicit icons.\n\n## Conclusion\n\nTransparent Tribe relies heavily on the use of maldocs to spread their Windows implants. While CrimsonRAT remains the group's\nstaple Windows implant, their development and distribution of ObliqueRAT in early 2020 indicates they are rapidly expanding their\nWindows malware arsenal. Email and maldoc lures employed to spread these implants consist of multiple themes, including\nconference agendas, honeytrap lures and diplomatic themes. However, two common generic themes used consistently in their\noperations are fake resumes and military related topics. This indicates the group continues to primarily target defense personnel in\nthe Indian subcontinent. Transparent Tribe uses generically themed content-hosting domains as well as malicious domains\n\n\n-----\n\nmasquerading as legitimate defense related websites. Coupled with the use of compromised websites to host malicious artifacts, this\nis evidence that the group is evolving their TTPs to appear more legitimate.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the execution of the malware detailed in this post. Try](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nAMP for free [here.](https://cisco.com/go/tryamp)\n\n[Cisco Secure Email can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances such as Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Adaptive Security Appliance and](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html) [Meraki MX can detect malicious activity associated with this threat.](https://meraki.cisco.com/products/appliances)\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs and URLs, whether users](https://umbrella.cisco.com/)\nare on or off the corporate network.\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks potentially dangerous sites and tests suspicious](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\nsites before users access them.\n\nAdditional protections with context to your specific environment and threat data are available from the Cisco Secure Firewall\nManagement Center.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available for purchase on\n[Snort.org.](https://www.snort.org/products)\n\nThe following SIDs have been released to detect this threat: 57551-57562\n\n[Cisco Secure Endpoint (AMP) users can use Orbital Advanced Search to run complex OSqueries to see if their endpoints are](https://orbital.amp.cisco.com/help/#:~:text=Cisco%20Orbital%20(%E2%80%9COrbital%E2%80%9D),(Creators%20Update)%20or%20later.)\n[infected with this specific threat. For specific OSqueries on this threat, click here and](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_obliquerat_filepath.yaml) [here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_obliquerat_mutex.yaml)\n\n## IOCs\n\n[A complete list of IOCs is available here.](https://talosintelligence.com/resources/209)\n\n### Malicious Domains\n\n\n-----\n\n**Domains with specific themes:**\n\nclawsindia[.]com\nmail[.]clawsindia[.]com\nlarsentobro[.]com\nmillitarytocorp[.]com\n7thcpcupdates[.]info\nindia[.]gov[.]in[.]attachments[.]downloads[.]7thcpcupdates[.]info\nemail[.]gov[.]in[.]attachment[.]drive[.]servicesmail[.]site\ntprlink[.]com\narmypostalservice[.]com\nisroddp[.]com\nmail[.]isroddp[.]com\npmayindia[.]com\nmailer[.]pmayindia[.]com\nmailout[.]pmayindia[.]com\nemail[.]gov[.]in[.]maildrive[.]email\n\n**Generic Themed Domains:**\n\nurservices[.]net\ndrivestransfer[.]com\nemailhost[.]network\nmediaclouds[.]live\nmediabox[.]live\nmediafiles[.]live\nmediaflix[.]net\nmediadrive[.]cc\nhostflix[.]live\nshareflix[.]co\nstudioflix[.]net\nsocial.medialinks[.]cc\nshare.medialinks[.]cc\nservicesmail[.]site\nfilelinks[.]live\nfile-attachment[.]com\nmediashare[.]cc\nshareone[.]live\ncloudsbox[.]net\nfilestudios[.]net\ndatacyncorize[.]com\ntemplatesmanagersync[.]info\ndigiphotostudio[.]live\nonedrives[.]cc\nsharingmymedia[.]com\nawsyscloud[.]com\nshareboxs[.]net\nmaildrive.email\nsharemydrives[.]com\nnewsupdates.myftp[.]org\nbjorn111.duckdns[.]org\ntgservermax.duckdns[.]org\nsystemsupdated.duckdns[.]org\nvmd41059.contaboserver.net\nvmi433658.contaboserver.net\ntgservermax.duckdns[.]org\nmicrsoft[ ]ddns net\n\n\n-----\n\n### URLs\n\nhxxp://drivestransfer[.]com/files/Officers-Posting-2021.doc\nhxxp://drivestransfer[.]com/files/Special-Services-Allowance-Armd-Forces.xlam\nhxxp://drivestransfer[.]com/myfiles/Dinner%20Invitation.doc/win10/Dinner%20Invitation.doc\nhxxp://drivestransfer[.]com/files/Officers-Posting-2021.doc\nhxxp://drivestransfer[.]com/files/Parade-2021.xlam\nhxxp://drivestransfer[.]com/files/Age-Review-of-Armd-Forces.doc\nhxxp://drivestransfer[.]com/files/My-Resume-Detail.doc\nhxxps://emailhost[.]network/National-Conference-2021\nhxxp://mediaclouds[.]live/files/cnics.zip\nhxxp://mediaclouds[.]live/files/attachment.zip\nhxxp://mediabox[.]live/anita-resume4\nhxxp://mediabox[.]live/files/nisha-resume-2020.zip\nhxxp://mediafiles[.]live/files/my%20fldr%20for%20u%20diensh.zip\nhxxp://mediafiles[.]live/files/for%20u%20krishna%20my%20pic%20and%20video%20fldr.zip\nhxxp://mediafiles[.]live/files/khushi%20pics%20all.zip\nhxxps://mediafiles[.]live/aditii\nhxxps://mediaflix[.]net/BHC-PR\nhxxp://mediaflix[.]live/files/skype-lite.apk\nhxxp://mediadrive[.]cc/?a=W1549544649I\nhxxp://mediadrive[.]cc/?\na=W1550558721I&fbclid=IwAR1PzHnHCOjDqfpqaBqxnY4o1xMX6ibdgXAComUmJuHFYHgtCBHFq5NlYug\nhxxp://hostflix[.]live/files/my_new_pic.zip\nhxxp://shareflix[.]co/files/lkgame.apk\nhxxp://shareflix[.]co/larmina-circulum-vetae-complete-2020\nhxxps://studioflix[.]net/my-social\nhxxp://social.medialinks[.]cc/files/scan0001.rar\nhxxp://social.medialinks[.]cc/Case-Detail\nhxxp://social.medialinks[.]cc/my-100-pics\nhxxp://social.medialinks[.]cc/files/hot_song.rar\nhxxp://email.gov.in.attachment.drive.servicesmail[.]site/files/Co ast%20Guard%20HQ%2010.rar\nhxxps://email.gov.in.attachment.drive.servicesmail[.]site/New-Projects-List\nhxxp://filelinks[.]live/files/Note%20Verbal.doc\nhxxp://filelinks[.]live/Details-and-Invitations\nhxxp://file-attachment[.]com/files/fauji%20india%20september%202019.xls\nhxxp://file-attachment[.]com/files/pfp-73rd%20independence%20day%20gallantry%20awards%20.xls\nhxxp://mediashare[.]cc/?a=W1551315913I\nhxxps://shareone[.]live/New-sonam-cv1\nhxxp://cloudsbox[.]net/files/new%20cv.zip\nhxxp://cloudsbox[.]net/files/new%20preet%20cv.zip\nhxxp://cloudsbox[.]net/files/preet.doc\nhxxp://cloudsbox[.]net/files/sonam%20karwati.zip\nhxxp://cloudsbox[.]net/files/nisha%20arora%20sharma.zip\nhxxp://cloudsbox[.]net/files/cv%20ssss.zip\nhxxp://cloudsbox[.]net/files/sonamkarwati.exe\nhxxps://cloudsbox[.]net/files/sonam\nhxxps://cloudsbox[.]net/My-Pic\nhxxp://cloudsbox[.]net/files/sonam%20karwati.exe\nhxxp://cloudsbox[.]net/files/sonam\nhxxps://cloudsbox[.]net/sonam-karwati5\nhxxp://cloudsbox[.]net/sonam11\nhxxps://cloudsbox[.]net/sonam11\nhxxp://filestudios[.]net/files/Nisha%20Doc.doc\nhxxp://filestudios[.]net/\nhxxps://filestudios[.]net/Sunita-Singh1.html\nhxxp://filestudios[.]net/files/sonam%20cv.zip\nhxxp://templatesmanagersync[.]info/essa.dotm\nhxxp://10feeds[.]com/temp.dotm\n\n\n-----\n\nhxxp://datacyncorize[.]com/\nhxxps://datacyncorize[.]com/\nhxxps://datacyncorize[.]com/INDISEM-2021.ppt\nhxxps://datacyncorize[.]com/INDISEM-2021(INDISEM-2021.ppt)\nhxxps://datacyncorize[.]com/\nhxxps://datacyncorize[.]com/INDISEM-2021\nhxxps://datacyncorize[.]com/INDISEM-2021(INDISEM-2021.ppt\nhxxps://datacyncorize[.]com/NDC-Updates\nhxxp://sharingmymedia[.]com/recordsdata/Standards-of-Military-Officers.doc\nhxxps://sharingmymedia[.]com/files/1More-details.doc\nhxxp://sharingmymedia[.]com/files/Criteria-of-Army-Officers.doc\nhxxp://sharingmymedia[.]com/files/7All-Selected-list.xls\nhxxps://sharingmymedia[.]com/files/More-details.docm\nhxxps://sharingmymedia[.]com/myfiles/Immediate%20Message.docm/Unknown%20OS%20Platform/Immediate%20Message.docm\nhxxps://7thcpcupdates[.]info/downloads/7thPayMatrix.xls\nhxxp://armypostalservice[.]com/myfiles/file.doc/win7/file.doc\nhxxp://isroddp[.]com/rEmt1t_pE7o_pe0Ry/hipto.php\nhxxp://newsupdates.myftp[.]org/lee/vbc.exe\n\n### IP Addresses\n\n23[.]254.119.11\n64[.]188.12.126\n64[.]188.25.232\n75[.]119.139.169\n95[.]168.176.141\n107[.]175.64.209\n107[.]175.64.251\n151[.]106.14.125\n151[.]106.19.218\n151[.]106.56.32\n162[.]218.122.126\n164[.]68.101.194\n167[.]114.138.12\n167[.]160.166.177\n173[.]212.192.229\n173[.]212.226.184\n173[.]212.228.121\n173[.]249.14.104\n173[.]249.50.57\n176[.]107.177.54\n178[.]132.3.230\n181[.]215.47.169\n185[.]117.73.222\n185[.]136.161.124\n185[.]136.163.197\n185[.]136.169.155\n185[.]174.102.105\n185[.]183.98.182\n192[.]99.241.4\n193[.]111.154.75\n198[.]46.177.73\n198[.]54.119.174\n206[.]81.26.164\n207[.]154.248.69\n209[.]127.16.126\n212[.]8.240.221\n216[.]176.190.98\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-13 - Transparent Tribe APT expands its Windows malware arsenal.pdf"
    ],
    "report_names": [
        "2021-05-13 - Transparent Tribe APT expands its Windows malware arsenal.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535634,
    "ts_updated_at": 1743041763,
    "ts_creation_date": 1653751726,
    "ts_modification_date": 1653751726,
    "files": {
        "pdf": "https://archive.orkl.eu/fa833650e770c04542e74821b04c0c0854e6d5fa.pdf",
        "text": "https://archive.orkl.eu/fa833650e770c04542e74821b04c0c0854e6d5fa.txt",
        "img": "https://archive.orkl.eu/fa833650e770c04542e74821b04c0c0854e6d5fa.jpg"
    }
}