{
    "id": "bea0d235-244e-40e2-9233-b35ee7dcb5f8",
    "created_at": "2023-01-12T15:08:56.903304Z",
    "updated_at": "2025-03-27T02:09:30.122317Z",
    "deleted_at": null,
    "sha1_hash": "965319a0fabc9b6555cd2d8c43cf47c7cd33f323",
    "title": "2019-09-11 - Vulnerable Private Networks- Corporate VPNs Exploited in the Wild",
    "authors": "",
    "file_creation_date": "2022-05-28T04:02:21Z",
    "file_modification_date": "2022-05-28T04:02:21Z",
    "file_size": 209047,
    "plain_text": "# Vulnerable Private Networks: Corporate VPNs Exploited in the Wild\n\n**[volexity.com/blog/2019/09/11/vulnerable-private-networks-corporate-vpns-exploited-in-the-wild/](https://www.volexity.com/blog/2019/09/11/vulnerable-private-networks-corporate-vpns-exploited-in-the-wild/)**\n\nSeptember 11, 2019\n\nby Sean Koessel, Steven Adair\n\nThe details of multiple, critical Pulse Secure SSL VPN vulnerabilities are well known; they were disclosed in detail by two\nsecurity researchers as part of a talk at [Black Hat USA 2019 on August 7, 2019. What has not been widely covered, but](https://i.blackhat.com/USA-19/Wednesday/us-19-Tsai-Infiltrating-Corporate-Intranet-Like-NSA.pdf)\nshould come as no surprise, is that APT actors have been actively exploiting these vulnerabilities in order to gain access\n[to targeted networks. The vulnerability being exploited is CVE-2019-11510, which allows a remote unauthenticated](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11510)\nattacker to send specially crafted requests that allow read access of arbitrary files on the Pulse Secure VPN. This includes\naccess to databases that the VPN server uses to track sessions, cleartext credentials, and NTLM hashes. Volexity has\nobserved multiple attackers exploiting this vulnerability starting approximately a week after the talk was given. Volexity has\nworked on multiple incidents where networks, whose remote access is protected by two-factor authentication (2FA), have\nbeen intruded upon.\n\nThe arbitrary file read vulnerability, along with a handful of other security issues, was initially described and patched on\nApril 25, 2019, by Pulse Secure as detailed in a security advisory from the company, tracked as [SA44101. Volexity](https://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101)\nbelieves that as of mid-August, a significant number of organizations had not actually applied updates that would have\nfixed this issue. This means that numerous organizations were—and still are—at risk and are potentially allowing\nunauthorized access to their networks and systems.\n\n## Active Exploitation\n\nVolexity has observed attackers actively exploiting CVE-2019-11510 against vulnerable Pulse Secure VPN servers.\nDecrypted TLS sessions and logs confirm that attackers have been accessing various files to assist in compromising\ntarget networks.\n\nThe following files have been observed as part of testing/vulnerability confirmation:\n\n/etc/passwd (testing/confirmation of vulnerability)\n\n/etc/hosts (testing/confirmation of vulnerability)\n\n\n-----\n\nThe following files have been observed being accessed to obtain session IDs, cleartext credentials, and other stored or\ncached system and user data:\n\n/data/runtime/mtmp/lmdb/randomVal/data.mdb\n\n/data/runtime/mtmp/lmdb/dataa/data.mdb\n\n/data/runtime/mtmp/system\n\nOnce the attackers obtained the database files, Volexity observed the following behavior:\n\nConnections to the VPN using obtained session IDs in order to resume or takeover an existing valid session\nLocally stored accounts cracked and leveraged to connect to VPN services\nConnections to the VPN's administrative interface using obtained sessions IDs, possibly in an attempt to conduct\nremote code execution against newly connecting VPN clients\nLogin attempts against other corporate resources, such as e-mail, using credentials that were stored by the Pulse\nSecure VPN server database in the clear\n\nWhile it should not be a surprise, it should be noted that 2FA will not prevent an attacker from hijacking a valid\nauthenticated session. Once the initial login occurs from the valid user that supplied credentials and a valid second\nauthentication factor, that session can now be hijacked by an attacker who will ride in on the session without further\nimpediment (more on this below).\n\n### Local Accounts\n\nIt is common for an organization to use a separate directory for its users, such as an LDAP server, for authentication.\nHowever, Pulse Secure devices will have one or more local administrator accounts. Any of the administrator accounts on\nthe system, such as the default \"admin\" account, should have their password changed. It should be considered\ncompromised and potentially cracked by a remote attacker. Furthermore, organizations should also check to see if they\nhave any active or valid local accounts that are not administrative users and may potentially have VPN access. These\naccounts could potentially be set up in a manner that also circumvents 2FA.\n\nThe account settings can be found under Authentication -> Auth. Servers. The typical next step is to look at the users\nunder \"Administrators\" and \"System Local.\" Below is an example of how a locally enabled user account under System\nLocal will appear.\n\n## Detection\n\nIf you are running a vulnerable version of the Pulse Secure SSL VPN, it would be safe to assume that credentials used on\nthe device since early August 2019 may be compromised. It is possible that the database containing cleartext credentials\ncould have been stolen and leveraged without leaving any indicators in the logs on your Pulse Secure VPN server. Special\nconcern should be given to VPNs that are not protected by 2FA or other resources not protected by 2FA that leverage the\n\n\n-----\n\nsame credentials as the Pulse Secure VPN (e.g., Active Directory). Look for authentications from unknown sources or\nfrom IP addresses listed in the Network Indicators section below. Pay close attention to multi-factor authentication failures\nthat were invalid or were otherwise incomplete/abandoned.\n\n### Unauthenticated Web Requests\n\nIf a Pulse Secure VPN is set up to log unauthenticated web requests, logs can be examined for entries similar to the\nfollowing:\n\ninfo - [x.x.x.x] - System()[][] - 2019/08/14 09:15:26 - VPN-Remote - Connection from IP x.x.x.x not authenticated yet\n(URL=/danana/../dana/html5acc/guacamole/../../../../../../../data/runtime/mtmp/lmdb/randomVal/data.mdb?/dana/html5acc/guacamole/)\n\nEntries like the above indicate exploit attempts against the SSL VPN. These logs can be studied further to look for access\nto other files and to identify IP addresses responsible for probing and attacking an organization's VPN server. Attempted\naccess to the /admin URL may also be of particular interest when reviewing these logs.\n\nNote: Unauthenticated web request logging may not be enabled by default. In order to enable this logging, an\nadministrator must go to System -> Log/Monitoring -> User Access -> Settings and check [x] Unauthenticated Requests.\n\n### Session Hijacking\n\nOne of the major risks this vulnerability poses it that it can allow a remote attacker to bypass all forms of authentication\ntypically required by an organization's VPN server, especially one that otherwise requires 2FA to access. Volexity has\nobserved multiple attackers leveraging data taken from the session databases to then directly access a target's VPN\nserver. This is done simply by providing an active session ID in a cookie called DSID. Setting the DSID cookie to a valid\nactive session will allow an attacker to drop right into the authenticated user's VPN session on a Pulse Secure VPN and\nbegin accessing whatever resources are available to that user. The Pulse Secure VPN will also allow multiple\nsimultaneous users with the same session ID. The valid authenticated user will not receive any indication that their\nsession is in use on another device nor will it impact their session.\n\nPulse Secure VPN logs do give an indication that this activity has occurred. Log lines such as the following should appear:\n\n2019-08-14 09:35:32 - PulseSecure - [1.2.3.4] DOMAIN\\username - Remote address for user DOMAIN\\username\nchanged from 1.2.3.4 to 5.6.7.8.\n\nAdditionally, the logs may also appear similar to the following:\n\n2019-08-14 09:38:56 - PulseSecure - [1.2.3.4] DOMAIN\\username - Remote address for user DOMAIN\\username\nchanged from 5.6.7.8 to .\n\nIf you see several lines like this with the IP addresses changing back and forth, this may be a good indication of multiple\nactive users on a single session. It should be noted that logs entries like this will happen legitimately as users change IP\naddresses. Seeing lines like this should be expected. Look for frequent occurrences, suspect IPs, or one IP address\nshowing up on several occasions for multiple different users.\n\n**Mitigation**\n\nTo mitigate this vulnerability, upgrade to a non-vulnerable version of the Pulse Secure VPN software. Volexity would\nstrongly recommend cutting off all access to any Pulse Secure VPN servers until they are patched. All credentials used on\nthe system, both locally stored and from remote authentication sources, should be reset/changed immediately. This also\nincludes any multi-factor authentication API keys that may have been stored on the device. Furthermore, it is critical that\nany credential or secret that is stored or used on the Pulse Secure VPN be changed immediately. Attackers are actively\nleveraging credentials to attempt to connect to other resources that may not required 2FA.\n\n## Network Indicators\n\nVolexity has observed the following IP addresses exploiting this vulnerability or taking advantage of data likely obtained\nfrom exploitation between August 14, 2019 - August 28, 2019:\n\n\n-----\n\n**IPv4 Address** **Notes**\n\n104.217.128.133 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n185.163.46.141 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n185.200.116.203 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n192.126.124.26 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n23.152.0.247 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n27.102.70.150 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n37.120.150.98 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n5.157.10.2 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n5.197.149.19 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n5.254.81.170 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n5.254.81.178 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n94.242.246.46 IP address observed actively scanning and exploiting CVE-2019-11510.\n\n## Conclusion\n\nSeveral organizations recently experienced, or are currently experiencing, breaches due to data accessed or\ncompromised from VPN instances that were not updated prior to early-to-mid August. Volexity observed widespread\nexploitation of this vulnerability on August 14, 2019. The actual details of the exploit were widely released to the public on\nAugust 7, 2019. Organizations that patched vulnerable instances of their Pulse Secure VPN on August 14 or later should\nconsider any credentials used or stored on their Pulse Secure to be compromised. It is also reasonable to expect that\nexploitation was widely known from August 7, 2019, and onward as well. Volexity strongly recommends organizations take\na close look at their logs and determine if they may have been breached. Any organization with questions about how best\nto analyze their logs or that need assistance determining if they have experienced a breach are welcome to reach out to\n[Volexity via our website contact form.](https://www.volexity.com/company/contact/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-11 - Vulnerable Private Networks- Corporate VPNs Exploited in the Wild.pdf"
    ],
    "report_names": [
        "2019-09-11 - Vulnerable Private Networks- Corporate VPNs Exploited in the Wild.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536136,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653710541,
    "ts_modification_date": 1653710541,
    "files": {
        "pdf": "https://archive.orkl.eu/965319a0fabc9b6555cd2d8c43cf47c7cd33f323.pdf",
        "text": "https://archive.orkl.eu/965319a0fabc9b6555cd2d8c43cf47c7cd33f323.txt",
        "img": "https://archive.orkl.eu/965319a0fabc9b6555cd2d8c43cf47c7cd33f323.jpg"
    }
}