{
    "id": "bebb4e57-50ae-4aed-8757-d171984d8b47",
    "created_at": "2022-12-27T17:06:16.880748Z",
    "updated_at": "2025-03-27T02:16:43.036072Z",
    "deleted_at": null,
    "sha1_hash": "dd68d4dcb03e50702ffb675ddd58f6429df3ef51",
    "title": "Malicious Cyber Actors Continue to Exploit Log4Shell in VMware Horizon Systems",
    "authors": "CISA, CGCYBER\"",
    "file_creation_date": "2022-07-18T15:28:22Z",
    "file_modification_date": "2022-07-18T15:28:22Z",
    "file_size": 437182,
    "plain_text": "Co-Authored by:\n\nTLP:WHITE\n\nProduct ID: AA22-174A\nJune 23, 2022\n\nMalicious Cyber Actors Continue to Exploit\nLog4Shell in VMware Horizon Systems\nSUMMARY\nThe Cybersecurity and Infrastructure Security\nAgency (CISA) and United States Coast Guard\nCyber Command (CGCYBER) are releasing this\njoint Cybersecurity Advisory (CSA) to warn\nnetwork defenders that cyber threat actors,\nincluding state-sponsored advanced persistent\nthreat (APT) actors, have continued to exploit\nCVE-2021-44228 (Log4Shell) in VMware\nHorizon® and Unified Access Gateway (UAG)\nservers to obtain initial access to organizations\nthat did not apply available patches or\nworkarounds.\n\nActions to take today:\n• Install fixed builds, updating all affected\nVMware Horizon and UAG systems to\nthe latest versions. If updates or\nworkarounds were not promptly applied\nfollowing VMware’s release of updates\nfor Log4Shell in December 2021, treat\nall affected VMware systems as\ncompromised.\n• Minimize the internet-facing attack\nsurface by hosting essential services on\na segregated demilitarized (DMZ) zone,\nensuring strict network perimeter access\ncontrols, and implementing regularly\nupdated web application firewalls\n(WAFs) in front of public-facing services.\n\nSince December 2021, multiple threat actor\ngroups have exploited Log4Shell on unpatched,\npublic-facing VMware Horizon and UAG\nservers. As part of this exploitation, suspected\nAPT actors implanted loader malware on\ncompromised systems with embedded executables enabling remote command and control (C2). In\none confirmed compromise, these APT actors were able to move laterally inside the network, gain\naccess to a disaster recovery network, and collect and exfiltrate sensitive data.\nThis CSA provides the suspected APT actors’ tactics, techniques, and procedures (TTPs);\ninformation on the loader malware; and indicators of compromise (IOCs). The information is derived\nfrom two related incident response engagements and malware analysis of samples discovered on the\nvictims’ networks.\nDisclaimer: the information in this joint Cybersecurity Advisory is provided \"as is\" for informational purposes\nonly. CISA and CGCYBER do not provide any warranties of any kind regarding this information or endorse any\ncommercial product or service, including any subjects of analysis. This document is marked TLP:WHITE.\nDisclosure is not limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk\nof misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright\nrules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light\nProtocol, see https://www.cisa.gov/tlp/.\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nCISA and CGCYBER recommend all organizations with affected systems that did not immediately\napply available patches or workarounds to assume compromise and initiate threat hunting activities\nusing the IOCs provided in this CSA, Malware Analysis Report (MAR)-10382580-1, and [MAR10382254-1]. If potential compromise is detected, administrators should apply the incident response\nrecommendations included in this CSA and report key findings to CISA.\nSee the list below to download copies of IOCs:\n•\n•\n•\n•\n\nAA22-174A stix\nMAR-10382580-1\nMAR-10382254-1\nMAR-10382580.r2.v1 (added July 18, 2022)\n\nTECHNICAL DETAILS\nNote: this advisory uses the MITRE ATT&CK for Enterprise framework, version 11. See Appendix A\nfor a table of the threat actors’ activity mapped to MITRE ATT&CK® tactics and techniques.\nLog4Shell is a remote code execution vulnerability affecting the Apache® Log4j library and a variety of\nproducts using Log4j, such as consumer and enterprise services, websites, applications, and other\nproducts, including certain versions of VMware Horizon and UAG. The vulnerability enables malicious\ncyber actors to submit a specially crafted request to a vulnerable system, causing the system to\nexecute arbitrary code. The request allows the malicious actors to take full control of the affected\nsystem. (For more information on Log4Shell, see CISA’s Apache Log4j Vulnerability Guidance\nwebpage and VMware advisory VMSA-2021-0028.13.)\nVMware made fixes available in December 2021 and confirmed exploitation in the wild on\nDecember 10, 2021.[1] Since December 2021, multiple cyber threat actor groups have exploited\n[T1190] Log4Shell on unpatched, public-facing VMware Horizon and UAG servers to obtain initial\naccess [TA0001] to networks.\nAfter obtaining access, some actors implanted loader malware on compromised systems with\nembedded executables enabling remote C2. These actors connected to known malicious IP address\n104.223.34[.]198.[2] This IP address uses a self-signed certificate CN: WIN-P9NRMH5G6M8. In at\nleast one confirmed compromise, the actors collected and exfiltrated sensitive information from the\nvictim’s network.\nThe sections below provide information CISA and CGCYBER obtained during incident response\nactivities at two related confirmed compromises.\n\nVictim 1\nCGCYBER conducted a proactive threat-hunting engagement at an organization (Victim 1)\ncompromised by actors exploiting Log4Shell in VMware Horizon. After obtaining access, threat actors\nuploaded malware, hmsvc.exe, to a compromised system. During malware installation, connections\nto IP address 104.223.34[.]198 were observed.\n\nPage 2 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nCISA and CGCYBER analyzed a sample of hmsvc.exe from the confirmed compromise. hmsvc.exe\nmasquerades as a legitimate Microsoft® Windows® service (SysInternals LogonSessions software)\n[T1036.004] and appears to be a modified version of SysInternals LogonSessions software\nembedded with malicious packed code. When discovered, the analyzed sample of hmsvc.exe was\nrunning as NT AUTHORITY\\SYSTEM, the highest privilege level on a Windows system. It is unknown\nhow the actors elevated privileges.\nhmsvc.exe is a Windows loader containing an embedded executable, 658_dump_64.exe. The\nembedded executable is a remote access tool that provides an array of C2 capabilities, including the\nability to log keystrokes [T1056.001], upload and execute additional payloads [T1105], and provide\ngraphical user interface (GUI) access over a target Windows system's desktop. The malware can\nfunction as a C2 tunneling proxy [T1090], allowing a remote operator to pivot to other systems and\nmove further into a network.\nWhen first executed, hmsvc.exe creates the Scheduled Task [T1053.005],\nC:\\Windows\\System32\\Tasks\\Local Session Updater, which executes malware every hour.\nWhen executed, two randomly named *.tmp files are written to the disk at the location\nC:\\Users\\<USER>\\AppData\\Local\\Temp\\ and the embedded executable attempts to connect to\nhard-coded C2 server 192.95.20[.]8 over port 4443, a non-standard port [TT571]. The executable’s\ninbound and outbound communications are encrypted with a 128-bit key [T1573.001].\nFor more information on hmsvc.exe, including IOCs and detection signatures, see MAR-10382254-1.\n\nVictim 2\nFrom late April through May 2022, CISA conducted an onsite incident response engagement at an\norganization (Victim 2) where CISA observed bi-directional traffic between the organization and\nsuspected APT IP address 104.223.34[.]198. During incident response, CISA determined Victim 2\nwas compromised by multiple threat actor groups.\nThe threat actors using IP 104.223.34[.]198 gained initial access to Victim 2’s production\nenvironment in late January 2022, or earlier. These actors likely obtained access by exploiting\nLog4Shell in an unpatched VMware Horizon server. On or around January 30, likely shortly after the\nthreat actors gained access, CISA observed the actors using PowerShell scripts [T1059.001] to\ncallout to 109.248.150[.]13 via Hypertext Transfer Protocol (HTTP) [T1071.001] to retrieve\nadditional PowerShell scripts. Around the same period, CISA observed the actors attempt to\ndownload [T1105] and execute a malicious file from 109.248.150[.]13. The activity started from IP\naddress 104.155.149[.]103, which appears to be part of the actors’ C2 [TA0011] infrastructure.\nAfter gaining initial access to the VMware Horizon server, the threat actors moved laterally [TA0008]\nvia Remote Desktop Protocol (RDP) [T1021.001] to multiple other hosts in the production\nenvironment, including a security management server, a certificate server, a database containing\nsensitive law enforcement data, and a mail relay server. The threat actors also moved laterally via\nRDP to the organization’s disaster recovery network. The threat actors gained credentials [TA0006]\n\nPage 3 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nfor multiple accounts, including administrator accounts. It is unknown how these credentials were\nacquired.\nAfter moving laterally to other production environment hosts and servers, the actors implanted loader\nmalware on compromised servers containing executables enabling remote C2. The threat actors used\ncompromised administrator accounts to run the loader malware. The loader malware appears to be\nmodified versions of SysInternals LogonSessions, Du, or PsPing software. The embedded\nexecutables belong to the same malware family, are similar in design and functionality to\n658_dump_64.exe, and provide C2 capabilities to a remote operator. These C2 capabilities include\nthe ability to remotely monitor a system's desktop, gain reverse shell access, exfiltrate data, and\nupload and execute additional payloads. The embedded executables can also function as a proxy.\nCISA found the following loader malware:\n●\n\nSvcEdge.exe is a malicious Windows loader containing encrypted executable\nf7_dump_64.exe. When executed, SvcEdge.exe decrypts and loads f7_dump_64.exe into\nmemory. During runtime, f7_dump_64.exe connects to hard-coded C2 server\n134.119.177[.]107 over port 443.\n\n●\n\nodbccads.exe is a malicious Windows loader containing an encrypted executable. When\nexecuted, odbccads.exe decrypts and loads the executable into memory. The executable\nattempts communication with the remote C2 address 134.119.177[.]107.\n\n●\n\npraiser.exe is a Windows loader containing an encrypted executable. When executed,\npraiser.exe decrypts and loads the executable into memory. The executable attempts\nconnection to hard-coded C2 address 162.245.190[.]203.\n\n●\n\nfontdrvhosts.exe is a Windows loader that contains an encrypted executable. When\nexecuted, fontdrvhosts.exe decrypts and loads the executable into memory. The\nexecutable attempts connection to hard-coded C2 address 155.94.211[.]207.\n\n●\n\nwinds.exe is a Windows loader containing an encrypted malicious executable and was found\non a server running as a service. During runtime, the encrypted executable is decrypted and\nloaded into memory. The executable attempts communication with hard-coded C2 address\n185.136.163[.]104. winds.exe has complex obfuscation, hindering the analysis of its code\nstructures. The executable’s inbound and outbound communications are encrypted with an\nXOR key [T1573.001].\n\nFor more information on these malware samples, including IOCs and detection signatures, see MAR10382580-1.\nAdditionally, CISA identified a Java® Server Pages (JSP) application (error_401.js) functioning as a\nmalicious webshell [T505.003] and a malicious Dynamic Link Library (DLL) file:\n●\n\nerror_401.jsp is a webshell designed to parse data and commands from incoming HTTP\nrequests, providing a remote operator C2 capabilities over compromised Linux and Windows\nsystems. error_401.jsp allows actors to retrieve files from the target system, upload files to\n\nPage 4 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nthe target system, and execute commands on the target system. rtelnet is used to execute\ncommands on the target system. Commands and data sent are encrypted via RC4\n[T1573.001]. For more information on error_401.jsp, including IOCs, see [MAR10382580-2].\n●\n\nnewdev.dll ran as a service in the profile of a known compromised user on a mail relay\nserver. The malware had path: C:\\Users\\<user>\\AppData\\Roaming\\newdev.dll. The DLL\nmay be the same newdev.dll attributed to the APT actors in open-source reporting; however,\nCISA was unable to recover the file for analysis.\n\nThreat actors collected [TA0009] and likely exfiltrated [TA0010] data from Victim 2’s production\nenvironment. For a three week period, the security management and certificate servers\ncommunicated with the foreign IP address 92.222.241[.]76. During this same period, the security\nmanagement server sent more than 130 gigabytes (GB) of data to foreign IP address\n92.222.241[.]76, indicating the actors likely exfiltrated data from the production environment. CISA\nalso found .rar files containing sensitive law enforcement investigation data [T1560.001] under a\nknown compromised administrator account.\nNote: the second threat actor group had access to the organization's test and production\nenvironments, and on or around April 13, 2022, leveraged CVE-2022-22954 to implant the Dingo Jspy webshell. According to trusted third-party reporting, multiple large organizations have been\ntargeted by cyber actors leveraging CVE-2022-22954 and CVE-2022-22960. For more information on\nexploitation of CVE-2022-22954 and CVE-2022-22960, see CISA CSA Threat Actors Chaining\nUnpatched VMware Vulnerabilities for Full System Control.\n\nINCIDENT RESPONSE\nIf administrators discover system compromise, CISA and CGCYBER recommend:\n1. Immediately isolating affected systems.\n2. Collecting and reviewing relevant logs, data, and artifacts.\n3. Considering soliciting support from a third-party incident response organization that can\nprovide subject matter expertise, ensure the actor is eradicated from the network, and avoid\nresidual issues that could enable follow-on exploitation.\n4. Reporting incidents to CISA via CISA’s 24/7 Operations Center (report@cisa.gov or 888-2820870). To report cyber incidents to the Coast Guard pursuant to 33 CFR Section\n101.305, contact the U.S. Coast Guard (USCG) National Response Center (NRC)\n(NRC@uscg.mil or 800-424-8802).\n\nPage 5 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\n\nMITIGATIONS\nCISA and CGCYBER recommend organizations install updated builds to ensure affected VMware\nHorizon and UAG systems are updated to the latest version.\n•\n\nIf updates or workarounds were not promptly applied following VMware’s release of\nupdates for Log4Shell in December 2021, treat those VMware Horizon systems as\ncompromised. Follow the pro-active incident response procedures outlined above prior to\napplying updates. If no compromise is detected, apply these updates as soon as possible.\no\no\n\no\n\no\no\n\nSee VMware Security Advisory VMSA-2021-0028.13 and VMware Knowledge Base\n(KB) 87073 to determine which VMware Horizon components are vulnerable.\nNote: until the update is fully implemented, consider removing vulnerable components\nfrom the internet to limit the scope of traffic. While installing the updates, ensure\nnetwork perimeter access controls are as restrictive as possible.\nIf upgrading is not immediately feasible, see KB87073 and KB87092 for vendorprovided temporary workarounds. Implement temporary solutions using an account\nwith administrative privileges. Note that these temporary solutions should not be\ntreated as permanent fixes; vulnerable components should be upgraded to the latest\nbuild as soon as possible.\nPrior to implementing any temporary solution, ensure appropriate backups have been\ncompleted.\nVerify successful implementation of mitigations by executing the vendor supplied script\nHorizon_Windows_Log4j_Mitigations.zip without parameters to ensure that no\nvulnerabilities remain. See KB87073 for details.\n\nAdditionally, CISA and CGCYBER recommend organizations:\n•\n•\n\n•\n\nKeep all software up to date and prioritize patching known exploited vulnerabilities (KEVs).\nMinimize the internet-facing attack surface by hosting essential services on a segregated\nDMZ, ensuring strict network perimeter access controls, and not hosting internet-facing\nservices non-essential to business operations. Where possible, implement regularly updated\nWAFs in front of public-facing services. WAFs can protect against web based exploitation\nusing signatures and heuristics that are likely to block or alert on malicious traffic.\nUse best practices for identity and access management (IAM) by implementing multifactor\nauthentication (MFA), enforcing use of strong passwords, and limiting user access through the\nprinciple of least privilege.\n\nPage 6 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\n\nCONTACT INFORMATION\nRecipients of this report are encouraged to contribute any additional information related to this threat.\n•\n\n•\n\nTo request incident response resources or technical assistance related to these threats, email\nCISA at report@cisa.gov. To contact Coast Guard Cyber Command in relation to these\nthreats, email maritimecyber@uscg.mil.\nTo report cyber incidents to the Coast Guard pursuant to 33 CFR Section 101.305, contact the\nUSCG NRC (NRC@uscg.mil or 800-424-8802).\n\nPage 7 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\n\nRESOURCES\n●\n\n●\n\nFor more information on Log4Shell, see:\n○\n\nCISA’s Apache Log4j Vulnerability Guidance webpage,\n\n○\n\nJoint CSA Mitigating Log4Shell and Other Log4j-Related Vulnerabilities, or\n\n○\n\nCISA’s database of known vulnerable services on the CISA GitHub® page.\n\nSee National Security Agency (NSA) and Australian Signals Directorate (ASD) guidance Block\nand Defend Web Shell Malware for additional guidance on hardening internet-facing systems.\n\nREFERENCES\n[1] VMware Security Advisory VMSA-2021-0028.13\n[2] Fortinet’s blog New Milestones for Deep Panda: Log4Shell and Digitally Signed Fire Chili Rootkits\n\nAPPENDIX A: INDICATORS OF COMPROMISE\nSee MAR-10382580-1 and MAR-10382254-1 and Table 1 for IOCs. See the list below to download\ncopies of these IOCs:\n●\n\nMAR-10382580-1\n\n●\n\nMAR-10382254-1\nTable 1: Indicators of Compromise\n\nType\n\nIndicator\n\nDescription\n\nIP address\n\n104.223.34[.]198\n\nIP address closely associated\nwith the installation of malware\non victims.\n\n92.222.241[.]76\n\nVictim 2 servers communicated\nwith this IP address and sent\ndata to it during a three-week\nperiod.\n\n109.248.150[.]13\n\nActors attempting to download\nand execute a malicious file\nfrom this address.\n\n104.155.149[.]103\n\nAppears to be a part of the\nactors’ C2 infrastructure.\n\nPage 8 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nType\n\nIndicator\n\nDescription\n\nNetwork Port\n\n192.95.20[.]8:80\n\nSame description as IP\n192.95.20[.]8, but includes\nthe specific destination port of\n80, which was identified in logs\nand during malware analysis.\n\n1389\n\nThis was the most common\ndestination port for Log4Shell\nexploitation outbound\nconnections. Multiple unique\ndestination addresses were\nused for Log4Shell callback.\n\n104.223.34[.]198:443\n\nIP address closely associated to\nthe installation of malware on\nvictims with the specific\ndestination port of 443.\n\nScheduled\nTask\n\nC:\\Windows\\System32\\Tasks\\Local Session Scheduled task created by\nUpdate\nhmsvc.exe to execute the\nprogram hourly.\n\nFile Path\n\nC:\\Windows\\Temp\\lnk{4_RANDOM_CHARS}.tmp File created by hmsvc.exe with\na random four-character\nfilename.\nC:\\Windows\\Temp\\lnk<4_RANDOM_NUMS_CHAR\nS>.tmp\n\nFile created by hmsvc.exe with\na random four-character\nfilename.\n\nPage 9 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\n\nAPPENDIX B: THREAT ACTOR TTPS\nSee Table 2 for the threat actors’ tactics and techniques identified in this CSA. See the MITRE\nATT&CK for Enterprise framework, version 11, for all referenced threat actor tactics and techniques.\nTable 2: Tactics and Techniques\nTactic\n\nTechnique\n\nInitial Access [TA0001]\n\nExploit Public-Facing Application [T1190]\n\nExecution [TA0002]\n\nCommand and Scripting Interpreter: PowerShell\n[T1059.001]\nScheduled Task/Job: Scheduled Task\n[T1053.005]\n\nPersistence [TA0003]\n\nServer Software Component: Web Shell\n[T1505.003]\n\nDefense Evasion [TA0005]\n\nMasquerading: Masquerade Task or Service\n[T1036.004]\n\nCredential Access [TA0006]\nLateral Movement [TA0008]\n\nRemote Services: Remote Desktop Protocol\n[T1021.001]\n\nCollection [TA0009]\n\nArchive Collected Data: Archive via Utility\n[T1560.001]\nInput Capture: Keylogging [T1056.001]\n\nCommand and Control [TA0011]\n\nApplication Layer Protocol: Web Protocols\n[T1071.001]\nEncrypted Channel: Symmetric Cryptography\n[1573.001]\nIngress Tool Transfer [T1105]\nNon-Standard Port [T1571]\n\nPage 10 of 11 | Product ID: AA22-174A\n\nTLP:WHITE\n\nCISA | CGCYBER\n\nTLP:WHITE\nTactic\n\nTechnique\nProxy [T1090]\n\nDISCLAIMER\n© 2021 The MITRE Corporation. This work is reproduced and distributed with the permission of The\nMITRE Corporation.\n\nACKNOWLEDGEMENTS\nCISA and CGCYBER would like to thank VMware and Secureworks for their contributions to this\nCSA.\n\nPage 11 of 11 | Product ID: AA22-174A\n\nTLP:WHITE",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/uscert/ncas/alerts/aa22-174a",
        "https://www.cisa.gov/uscert/sites/default/files/publications/AA22-174A_Joint_CSA_Malicious_Cyber_Actors_Exploiting_Log4Shell_in_Unpatched_VMware_Horizon_Systems_FINAL.pdf"
    ],
    "report_names": [
        "AA22-174A_Joint_CSA_Malicious_Cyber_Actors_Exploiting_Log4Shell_in_Unpatched_VMware_Horizon_Systems_FINAL.pdf"
    ],
    "threat_actors": [
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1672160776,
    "ts_updated_at": 1743041803,
    "ts_creation_date": 1658158102,
    "ts_modification_date": 1658158102,
    "files": {
        "pdf": "https://archive.orkl.eu/dd68d4dcb03e50702ffb675ddd58f6429df3ef51.pdf",
        "text": "https://archive.orkl.eu/dd68d4dcb03e50702ffb675ddd58f6429df3ef51.txt",
        "img": "https://archive.orkl.eu/dd68d4dcb03e50702ffb675ddd58f6429df3ef51.jpg"
    }
}