{
    "id": "bec896cb-1367-433a-a3cf-9c1f51f42de7",
    "created_at": "2023-01-12T15:01:43.108135Z",
    "updated_at": "2025-03-27T02:14:39.034795Z",
    "deleted_at": null,
    "sha1_hash": "20a18ba82629c2d0abda177b32deee265f38d7eb",
    "title": "2022-05-05 - Threat Thursday- ZingoStealer – The Cost of “Free”",
    "authors": "",
    "file_creation_date": "2022-05-28T23:25:19Z",
    "file_modification_date": "2022-05-28T23:25:19Z",
    "file_size": 2870889,
    "plain_text": "# Threat Thursday: ZingoStealer – The Cost of “Free”\n\n**[blogs.blackberry.com/en/2022/05/threat-thursday-zingostealer](https://blogs.blackberry.com/en/2022/05/threat-thursday-zingostealer)**\n\nThe BlackBerry Research & Intelligence Team\n\n### Summary\n\nEveryone likes a great deal, and the closer something gets to free, the more universal its\nappeal. In the case of ZingoStealer, the lure of “free” seems to be successfully attracting\nboth predators and prey. Even those who make their living as a cybercriminal might still try\nto keep their costs in check as they look to wreak havoc, but sometimes there are costs to\nmalware operators for “free” software that aren’t necessarily paid by the victim.\n\nThe ZingoStealer information stealer, also known as Ginzo, is malware targeting Windows®\nsystems that was first discovered in March 2022 being distributed by a Russian group\ncalled the “Haskers Gang.” On March 4, they uploaded a video to YouTube showcasing the\ninfostealer, announcing that the malware is available for free to its members, distributed via\nthe Ginzo Telegram channel. An additional variant is available for US$3, which contains a\ncrypter malware called “ExoCrypt” that encrypts the threat to help the attacker evade\nantivirus detection.\n\n\n-----\n\nThe free offer seems to be fueling a spike of adoption for the malware. The malware s\nvictims, primarily home users, are lured in by the appeal of getting something for nothing –\nin their case, it’s the promise of free access to “cracked” versions of popular video games\nand software.\n\nZingoStealer instead steals sensitive user data such as login credentials and\ncryptocurrencies. Stolen information is returned to the command-and-control (C2) server\nand used for financial gain by the attacker. The malware also packs an additional punch,\ndelivering malicious payloads to the target machines. For example, in the binary analyzed in\nthis report, an [XMRig cryptocurrency miner was dropped to the machine post-execution .](https://blogs.blackberry.com/en/2020/12/lessons-from-the-front-line-threat-hunting)\n\nAs it turns out, home users trying to score a free download are not the only ones who might\nbe getter somewhat more – or less – than they bargained for. Attackers making use of the\nfree malware could also be getting shortchanged on the “free” offer: As our analysis\nreveals, the malware authors maintain access to all data stolen by their clients, and they\ncould well be profiting from it in addition to, or even in advance of, their clientele. Not so\n“free,” after all.\n\n### Operating System\n\n Risk & Impact\n\n Technical Analysis\n\nZingoStealer is delivered as a highly obfuscated .NET executable. The initial file is\nobfuscated using ConfuserEx, an open-source protector tool for .NET files. The file is\ndecrypted on the fly using the type initializer \".cctor,\" which causes error messages when\nattempting to use automatic deobfuscation tools. This makes readable code more difficult to\nobtain, providing the attacker with a means of impeding analysis.\n\n\n-----\n\n_Figure 1 – Obfuscated .NET ZingoStealer executable_\n\nWhen executed, the first thing the malware does is reach out to its C2 server to retrieve a\nlist of dependencies (also shown in Figure 2). These files are dropped into the directory\nwhere the malware was initially executed.\n\nBouncyCastle.Crypto.dll\nDotNetZip.dll\nNewtonsoft.json.dll\nSystem.Data.SQLite.dll\nSQLite.Interop.dll (x64 and x86)\n\nThe files are used by the malware to provide core functionality during the attack.\n\n_Figure 2 – DLL dependencies dropped into the same folder where the malware was_\n_executed_\n\nThe malware will then create a folder on the target machine in the directory\n“User\\AppData\\Local\\GinzoFolder.” This is where stolen information is stored. As shown in\nFigure 3 below, three subdirectories are created within this folder using the following\n\n\n-----\n\nnames:\n\nBrowsers\nWallets\nDesktop Files\n\n_Figure 3 – Subdirectories are created within the “\\GinzoFolder\\” directory_\n\n### Information Stealing\n\nThe malware begins its information heist by taking a screenshot of the victim’s screen\nwithout their knowledge or consent. The screenshot is stored in the\n**_%AppData%Local%GinzoFolder% directory as “Screenshot.Png.”_**\n\nZingoStealer also performs a fingerprint of the victim’s system, as seen in Figure 4,\ngathering information about the target machine and storing it in a text file called\n“system.txt,” in the %GinzoFolder% mentioned above. This information includes the\nfollowing:\n\nWindows Version\nAV Information\nUsername\nCPU Name\nGPU Name\nRAM Amount\nPublic and Local IP Address and location\nScreen Resolution\n\n\n-----\n\n_Figure 4 – Core infostealing functionality of ZingoStealer_\n\n### Browsers\n\nZingoStealer next scans the victim’s device in an effort to collect sensitive information\nrelated to popular web browsers. The information gathered includes login data, cookies,\nbrowser extensions, auto-fill information and any other sensitive data. The malware targets\nthe following browsers:\n\nGoogle Chrome\nFirefox\nOpera and Opera GX\n\n### Cryptocurrency\n\nOne of the main functions of ZingoStealer is its cryptocurrency stealing ability. The malware\nscours the target machine in search of any data associated with the crypto wallet\nextensions seen below. A crypto wallet is an application used to both cold-store and retrieve\ndigital cryptocurrency assets.\n\nBinance Wallet Guarda EQUAL Wallet BitApp Wallet iWallet\n\nWombat Brave Wallet Coinbase Wallet MathWallet MetaMask\n\nNifty Wallet Tron Link Bitcoin Dash Litecoin\n\n\n-----\n\nZingoStealer checks browser extensions for wallet credentials for popular cryptocurrency\nservices, such as Binance and Coinbase.\n\nAdditionally, the malware will search the %AppData% directory for any wallet data that is\nrelated to the following cryptocurrencies:\n\nCoinomi Ethereum Atomic Exodus Jaxx Liberty\n\nBytecoin Guarda Armory Electrum Zcash\n\n### Exfiltration\n\nThe malware will perform exfiltration of all gathered data from the target machine back to\nthe C2 server. In the case of the binary used in this analysis, it was hosted at\n172[.]67[.]129[.]178. All information stored within the directory %GinzoFolder% is\ncompressed into “ginzoarchive.zip” as seen in Figure 5 and is sent back to the C2 server\nvia a POST request.\n\n_Figure 5 – Data is read from the Ginzo archive file and sent to the C2 server_\n\nThe malware also stores a datetime value in a file called “ChromeUploadTime.txt” within the\n**%AppData%Local% directory. This value is used to ensure that the harvested data is not**\nbeing sent too frequently to the server. This helps the malware to stay under the radar and\nevade detection.\n\n### Additional Payloads – XMRig Miner\n\nAnother functionality of ZingoStealer, which makes it more dangerous than your average\ninfostealer, is that it drops additional payloads to the victim’s machine. The payload dropped\nby the malware varies depending on how it was set up by the malware operator. For\nexample, samples have been observed dropping copies of RedLine infostealer (previously\nanalyzed by the BlackBerry Research & Intelligence Team) onto the target machine. Such\npayloads provide additional monetization methods for the ZingoStealer authors and users.\n\nIn the instance of the sample analyzed in this report, an injector for the XMRig\ncryptocurrency miner was dropped to the system. Cryptocurrency miners are used in\nattacks to steal computing power to mine for coins; this process is also known as\n[cryptojacking.](https://blogs.blackberry.com/en/2019/05/outlaw-monero-cryptojacking-in-the-wild)\n\n\n-----\n\nThe file for XMRig was dropped into the %AppData\\%Local% directory, as shown in Figure\n6. Its filename is generated using a random 6-digit hex number, in this case it was\n“346590.exe.”\n\n_Figure 6 – Additional payload XMRig dropped to the AppData\\Local directory_\n\nThe file for XMRig is dropped and executed when the initial ZingoStealer file is launched.\nZingoStealer does this by utilizing its file “conhost.exe” to issue the command\n**_\"C:\\Windows\\System32\\conhost.exe\" \"C:\\Users\\_**\n**_<USERNAME>\\AppData\\Local\\346590.exe.\"_**\n\nOnce executed, the malware launches PowerShell to issue the base64-encoded command\nseen in Figure 7 below.\n\n_Figure 7 – PowerShell launched and base64-encoded command executed utilizing the \"-_\n_EncodeCommand\" option_\n\nDecoding this command reveals its functionality: It is used to create two exclusions in\nWindows Defender to avoid being detected.\n\nAdd-MpPreference -ExclusionPath @($env:UserProfile $env:SystemDrive) -Force\n\n\n-----\n\nAdd-MpPreference -ExclusionExtension @( exe, dll ) -Force\n\nThe XMRig malware attempts to achieve persistence by creating a copy of itself in the\n**%AppData%Roaming%Chrome% directory under the filename “updater.exe,” as shown in**\nFigure 8. In addition to this, it creates a scheduled task to ensure that this executable runs\nat system startup.\n\n_Figure 8 – Miner creates a copy of itself in the \\Roaming\\Chrome directory under the name_\n_\"updater.exe\"_\n\nThe newly created executable also drops a binary into the\n**%Roaming%Windows%Telemetry% directory called “sihost64.exe.” The XMRig miner is**\nthen injected into the “explorer.exe” process where cryptocurrency mining operations begin.\nThe miner will periodically send beacon updates back to the C2 server, as seen in Figure 9.\n\n_Figure 9 – Miner injected into the \"explorer.exe\" process sends beacon updates to the C2_\n_server_\n\n### Control Panel\n\nThe ZingoStealer malware provides a C2 Control panel for its users (the malware\noperators) to login and access all harvested data. The panel is hosted at the address\n“network[.]nominally[.]ru/admin/login.php.”\n\nIt is important to remember that all harvested data is being funneled to the threat actors’\nservers. This means that they can also access any stolen data, and it would come as no\nsurprise if they were using data harvested by those malware operators for their own\nmonetary gain. After all, the malware is being offered for free!\n\n\n-----\n\n_Figure 10 – ZingoStealer control panel which can be used to access harvested data_\n\n### Conclusion\n\nZingoStealer contains all the functionality expected from a typical infostealer. What sets it\napart from its peers within the malware landscape is its ability to deliver additional, and\npotentially more dangerous, payloads. At present, the malware has been observed\ndelivering XMRig and RedLine. However, since the malware is available for free and offered\nas a Malware-as-a-Service (MaaS), it would come as no surprise to see these additional\npayloads continue to vary in coming months.\n\nZingoStealer has experienced a rapid increase in popularity, considering it was first\ndiscovered in March. At the time of writing this, a retrohunt was carried out on VirusTotal\nusing the YARA rule attached to this report. The results returned 950+ positive hits for\ndifferent binaries of the malware. As this threat’s popularity continues to rise, it will be\ninteresting to see how the malware operator’s choice of additional malicious payloads\nbundled with the malware evolves.\n\n\n-----\n\nAs the malware seems to be primarily targeting home users, and is being spread by\nmasquerading as a “cracked” version of popular video games and software, people must be\nextra vigilant when visiting websites to download new software. It’s important to only\ndownload from trusted links provided by legitimate vendors, rather than third-party or\n“pirate” websites. Also, for those who store cryptocurrencies on their devices, ensure you\nhave sufficient security measures in place around accessing and storing this information.\n\n### YARA Rule\n\nThe following YARA rule was authored by the BlackBerry Research & Intelligence Team to\ncatch the threat described in this document:\n\nimport \"pe\"\n\nrule ZingoStealer {\n\nmeta:\ndescription = \"Detects ZingoStealer Infostealer\"\n\nauthor = \"BlackBerry Threat Research Team\"\n\ndate = \"2022-04-22\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0\n(https://www.apache.org/licenses/LICENSE-2.0) and open to any user or organization, as\nlong as you use it under this license and ensure originator credit in any derivative to The\nBlackBerry Research & Intelligence Team\"\n\nstrings:\n\n$s1 = \"Ginzo.pdb\"\n\n$s2 = \"Ginzo.exe\"\n\n$s3 = \"Org.BouncyCastle.Crypto\"\n\n$s4 = \"DotNetZip\"\n\n$s5 = \".cctor\"\n\n$s6 = \"Newtonsoft.Json.Linq\"\n\n$s7 = \"System.Data.SQLite\"\n\ncondition:\n\n(\n\n//PE File\n\nuint16(0) == 0x5a4d and\n\n//Imphash\n\npe.imphash() == \"f34d5f2d4577ed6d9ceec516c1f5a744\" and\n\n//All Strings\n\nall of ($s*) )\n\n}\n\n### Indicators of Compromise (IoCs)\n\n\n-----\n\n**Hashes**\n\nb969bdc2c6a6614e13b3a33296ba25762b9f6935f7cb0674e5f84c96c9640e71\n\n - Zingo .NET\n\nee1524e4980cac431ae0f92888ee0cc8a1fa9e7981df0be6abd7efa98adf9a45\n\n– Miner\n1b3d0f2b2a65b7791e277851802a57536928fbc2f34d1eea747bb59467608d60\n\n– sihost64.exe\n\n**Files**\n\nJvm.exe\n\n**IP Address**\n\n172[.]67[.]129[.]178\n\n**Download URLs**\n\nhxxps://nominally[.]ru/cis.txt\n\nhxxps://nominally[.]ru/ginzolist.txt\n\nhxxps://nominally[.]ru/library/System.Data.SQLite.dll\n\nhxxps://nominally[.]ru/library/Newtonsoft.Json.dll\n\nhxxps://nominally[.]ru/library/BouncyCastle.Crypto.dll\n\nhxxps://nominally[.]ru/library/x86/SQLite.Interop.dll\n\nhxxps://nominally[.]ru/library/x64/SQLite.Interop.dll\n\nhxxps://nominally[.]ru/library/antiwm.exe\n\nhxxps://nominally[.]ru/library/generation.exe\n\n**C2 Panels**\n\nnetwork[.]nominally[.]ru/admin/login.php - ZingoStealer\n\ncontrol[.]nominally[.]ru/login.php – XMRig Cryptominer\n\n**Folders**\n\n%LOCALAPPDATA%\\ChromeUploadTime.txt\n\n%LOCALAPPDATA%\\GinzoFolder\n\n%LOCALAPPDATA%\\GinzoFolder\\Wallets\n\n%LOCALAPPDATA%\\GinzoFolder\\Browsers\n\n%LOCALAPPDATA%\\GinzoFolder\\DesktopFiles\n\n%LOCALAPPDATA%\\GinzoFolder\\ ginzoarchive.zip\n\n%LOCALAPPDATA%\\GinzoFolder\\Screenshot.png\n%LOCALAPPDATA%\\GinzoFolder\\system.txt\n\n### References\n\n[https://blog.talosintelligence.com/2022/04/haskers-gang-zingostealer.html](https://blog.talosintelligence.com/2022/04/haskers-gang-zingostealer.html)\n\n[https://blogs.blackberry.com/en/2021/07/threat-thursday-redline-infostealer](https://blogs.blackberry.com/en/2021/07/threat-thursday-redline-infostealer)\n\n[https://www.youtube.com/watch?v=3Myj1yT6-ro – Haskers Gang announcement video](https://www.youtube.com/watch?v=3Myj1yT6-ro)\n\n### BlackBerry Assistance\n\n\n-----\n\nIf you re battling this malware or a similar threat, you ve come to the right place, regardless\nof your existing BlackBerry relationship.\n\n[The BlackBerry Incident Response team is made up of world-class consultants dedicated to](https://www.blackberry.com/us/en/services/incident-response)\nhandling response and containment services for a wide range of incidents, including\nransomware and Advanced Persistent Threat (APT) cases.\n\nWe have a global consulting team standing by to assist you, providing around-the-clock\nsupport where required, as well as local assistance. Please contact us\nhere: https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incidentresponse-containment\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats,\nproviding intelligence analysis for the benefit of defenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-05 - Threat Thursday- ZingoStealer – The Cost of “Free”.pdf"
    ],
    "report_names": [
        "2022-05-05 - Threat Thursday- ZingoStealer – The Cost of “Free”.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535703,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1653780319,
    "ts_modification_date": 1653780319,
    "files": {
        "pdf": "https://archive.orkl.eu/20a18ba82629c2d0abda177b32deee265f38d7eb.pdf",
        "text": "https://archive.orkl.eu/20a18ba82629c2d0abda177b32deee265f38d7eb.txt",
        "img": "https://archive.orkl.eu/20a18ba82629c2d0abda177b32deee265f38d7eb.jpg"
    }
}