{
    "id": "bed794c2-3b84-4b11-86d1-ac70308c6d41",
    "created_at": "2023-01-12T14:59:44.402474Z",
    "updated_at": "2025-03-27T02:05:52.996091Z",
    "deleted_at": null,
    "sha1_hash": "b6b83b006d467e3ea050a68a04d75c0946eafefc",
    "title": "2021-10-05 - The REBOL Yell- A New Novel REBOL Exploit",
    "authors": "",
    "file_creation_date": "2022-05-28T16:08:24Z",
    "file_modification_date": "2022-05-28T16:08:24Z",
    "file_size": 2993632,
    "plain_text": "# The REBOL Yell: A New Novel REBOL Exploit\n\n**frsecure.com/blog/the-rebol-yell-new-rebol-exploit/**\n\nBy Oscar Minks October 5, 2021\n\n**_A novel exploit explained and why default deny and user awareness are still king!_**\n\n[Ever heard of REBOL? If not, you may be seeing and hearing a lot of it soon. We recently](https://en.wikipedia.org/wiki/Rebol)\ndiscovered a REBOL exploit used for command-and-control.\n\nSo, what is REBOL? How is it being used as an exploit? And most importantly, what can you do\nto minimize the potential damage it can do to you and your organization?\n\n## What is REBOL?\n\nLet’s be clear here, REBOL itself is not a malicious program. It has been used for very\nlegitimate operations. In our study here, we will illustrate how it is being used for evil in the wild.\n\nREBOL is a “multi-paradigm dynamic programming language” that was designed to be used for\nnetwork communications and distributed computing. It is multi-platform, can run on any\noperating system (OS), and it introduced the idea of dialecting—small, optimized, domainspecific languages for code and data.\n\nIt can be used to program internet applications (client and server-side), database applications,\nutilities, and multimedia applications.\n\nREBOL is also very lightweight—the entire install is less than 1MB, making deployment on a\nvictim machine very trivial.\n\n\n-----\n\n### Why are we talking about this?\n\nAs I mentioned previously, we recently discovered a novel technique that utilizes REBOL as a\ncommand-and-control environment.\n\nI’ve scoured the internet high and low and am unable to identify anyone else who has found and\ndocumented this technique. Therefore, I feel it is our duty to get this information to the public so\nyou can be aware and implement controls in your environment to prevent this technique from\nbeing deployed.\n\n### REBOL Functionality\n\nFirst, let’s look at some functionality of REBOL.\n\nWe’re specifically looking at REBOL/View 2.7 in this article, but the same logic can be applied to\nother versions.\n\n_Components of the REBOL Application_\nAs you can see from the screenshot above, there are lots of powerful components that are built\ninto this application. Windows registry, network components, DLL access, Windows installers,\nCommand-shell access, etc.\n\n\n-----\n\nFor the sake of brevity, we re not going to dig into all of these, but just understand there isn t\nmuch that you can’t do through this interface.\n\nAnd please keep in mind—it’s OS agnostic. Custom programs can be built and executed crossplatform.\n\nNow that we understand a bit more about what REBOL is and what it can do, let’s dig into how\nthis was used in a recent exploit and I think you’ll see the power of this program when used\nmaliciously.\n\n## REBOL Exploit\n\n### It Always Starts with a Phish\n\nOkay, it doesn’t always, but you know what I’m saying.\n\nSo long as default-deny is still king for the good guys, phishing is and will remain king for the\nbad guys. In this case, our victim received an email with a malicious Excel spreadsheet (XLS)\nattached.\n\nThe malicious XLS looked decently legitimate and included (surprise) VBA macros.\n\n_Phishing Email sent with malicious XLS attached_\n\n\n-----\n\n_VBA Macros_\nThe macros were quite simple. The language is set by calling the data in the “subject” field of\nthe XLS, which is JScript. Code is added from the “comments” field of the document.\n\n_Macros_\nYou can see the code in the image below is slightly obfuscated (reversed), but essentially it is\ninvoking WindowsInstaller.Installer to install an MS located at hxxp://172.105.178.\n\n[119]/install.msi using an eval statement.\n\n_Contents of Subject and Comments_\nOnce the user opens the document and enables the macros, the system then reaches out to the\nmalicious website and installs the payload as expected (install.msi).\n\n_First_\n\n_malicious connection_\n\n### Dropped Files\n\nOnce the MSI is executed, it creates the directory c:\\programdata\\Temp and drops the following\nfiles:\n\n\n-----\n\n_Files_\n\n_dropped from MSI_\nLet’s dissect these files quickly. AudioDriver is actually REBOL/View 2.7.8.\n\nInfo.txt is a simple text file that contains a string used to identify the victim.\n\n_Info.txt_\n\nRandom.txt appears to be just that—a randomly generated string of numbers.\n\n_Random.txt_\n\nImage.ico is a bit more interesting. We can see here that it dynamically builds a value for “ID”\nand uses that information to access a URL: hxxp://139.59.93.[223]/c.php. There is also a sleep\ntimer of three (3), meaning it will repeat this function every three seconds until the process\nterminates.\n\n_Image.ico_\n\n### The Execution of the REBOL Exploit\n\nWe then see install.msi execute “audiodriver.exe” (REBOL) using the following syntax which\ncalls the image.ico configuration file.\n\n\n-----\n\n_REBOL execution from_\n\n_install.MSI_\nOn execution, the process modifies the following registry key for the persistence of\nREBOL/View.\n\n_Registry Modification_\n\n_Key Value_\n\nIt then begins making repeated queries to this malicious IP:\n\n_Connections to attacker_\nHere, we can see the structure of the GET request attempting to retrieve c.php appended with\ndynamic ID and Info parameters making an http connection using the User-Agent of “REBOL\nView 2.7.8.3.1”\n\n_HTTP_\n\n_Request_\n\n### What’s next?\n\n\n-----\n\nThe attacker is then able to embed REBOL commands in the .php file for complete command\nand control! When the victim retrieves c.php that includes REBOL commands, they are\nexecuted locally through the running REBOL View instance.\n\nIn our lab environment, we did some quick testing to confirm this functionality, and the execution\nis quite trivial.\n\nWe stood up an httpd server, routed all traffic to our malicious IP there, created the target c.php\nfile, and input some commands in proper syntax for REBOL into this file.\n\nThe first command instructed REBOL to show the user an alert: “all your base are belong to us.”\n\nThis was followed by a call to execute a PowerShell command that extracts the IP configuration\nfrom our victim and places the result into a text file named ips.txt.\n\n_Lab c.php contents_\nAfter executing our payload on the victim machine, sure enough, we were greeted with an alert:\n\n_Alert_\n\nAnd subsequently—ips.txt appeared in the c:\\programdata\\temp folder:\n\n_Created file ips.txt_\n\nAnd the text file contained the output from the ipconfig command.\n\n\n-----\n\n_Ips.txt_\n\n_contents_\n\n### Other Uses\n\nThat’s pretty darn simple, right? Now, let’s explore what other mechanisms could easily be\nimplored by this novel REBOL exploit technique.\n\nWe know that attackers love to live off the land. Using this REBOL exploit, anything that an\nattacker can execute using Windows PowerShell, WMI, or really any local function can be\ntunneled through this program. Recon, enumeration, privilege escalation, lateral movement, and\ndata-exfil techniques can certainly be achieved using this mechanism.\n\nWhat we are looking at is a command-and-control environment using a little-known, off-the-shelf\nprogram that will not fire any signature-based alerts on your systems.\n\nIt is not malware; it is a legitimate program being used with malicious intent.\n\nIn our real-world analysis of this technique, we observed our attacker using this functionality for\nrecon and enumeration as well as deployment of another backdoor for persistence. In this case,\nwe were able to act quickly, identify the point of ingress, identify the systems that were pivoted\nto, and eradicate our attacker without significant impact or damage. If this went unnoticed, we all\nknow where this likely ends—ransom.\n\n## Preventing and Mitigating a REBOL Exploit\n\n### Default Deny is Still King\n\nThis is a perfect example of why application allow-listing in your environment is an effective\napproach to stopping this technique (and others that may be similar).\n\nAudit the applications in your environment and only allow those required for business function to\nrun.\n\n\n-----\n\nFor now, if you don t have a legitimate use for REBOL in your environment, block it while you\nwork on implementing your application allow-list approach. (You ARE going to get right on that,\naren’t you?)\n\n### Disable Macros!\n\nSimple, right?\n\n### End-User Awareness\n\nAlso, let’s not forget to train your users!\n\nThe human is always the weakest link, and that’s okay. We are all… human, and to live is to err.\n\nBecause we all make mistakes, it’s not the mistake that is most important it is our response to\nthe mistake.\n\nTrain your users to be able to identify when they may have fallen victim, and ensure they know\nhow to properly report issues like these. Also, encourage your users to report anything seen as\nsuspicious. Reward them if possible! Be sure everyone errs on the side of caution. If an enduser or anyone else is unsure, report it and get help!\n\nHave a process and staff that is fully capable of responding to and analyzing potential exploits. If\n[you don’t have the internal capabilities, get a partner that does!](https://frsecure.com/services/incident-response/)\n\nTime is critical when responding to events like this. If you are quick to act, you can most likely\ncontain before the real damage is done.\n\n## The Indicators of Compromise (IoCs) for REBOL Yell\n\nThe full list of IoCs for this REBOL exploit is below. Be sure to block the hashes and IPs. But\nalso know—these IPs are a revolving door and will likely be shut down (if they aren’t already) by\nthe time we publish this.\n\nHappy hunting all!\n\n### Files and Hash in SHA256\n\nrebol-core-278-2-4.tar.gz\n\n0881B0FDE0C36F27D540B53D6167E2D141EB39F7DEA13447A9650F72DC8BEF2E\nrebol-core-278-2-5.tar.gz\n\nEDFA75F1BE9D0D4F92A217185A3810E05B0DEE41F8D24096F7568515B7B4AA06\nrebol-core-278-3-1.exe\n\n2A5E3AC2CCA464030A911B7052E8127979D960EB3518259A94FD99632E418BEF\nrebol-core-278-4-10.tar.gz\n\n5AAE66B90BFBA05921FD54B0F7DC3F25BE761749C990BAB1F67378D37347D1F0\n\n\n-----\n\n### IPs\n\n\nrebol-core-278-4-2.tar.gz\n\n7F75B197C01A3FFFDA5C15655A3006742DD0EB2F6A248651FAA80D07FD053BB0\nrebol-core-278-4-3.tar.gz\n\nB0080DF93905F56209875D811C6632C825C385E05D390B220C5D9555A8D38EEE\nrebol-core-278-4-8.tar.gz\n\n14F01A73886D61EF2FD99A005DE2FAB14C9AABB7B15DE0165DB9BC4AE16F76B0\nrebol-core-278-7-2.tar.gz\n\n38361CA43D869EC687F5D35A556125E0328BACEBD43B47FA919BAFA9F13A7122\nrebol-core-278-9-4.tar.gz\n\nF020F4260CD9A14C17A7C95F5D161F8843A1F111A366CEDD50DC0B28BB5D9D74\nrebol-view-278-2-4.tar.gz\n\nCE05B8F8434C04C7CBA515F442B0E01805A9079C1902D7AFA0E32258093566C9\nrebol-view-278-2-5.tar.gz\n\n9AFF51EB1D388EC93CE6385EB77A285064A101B5F2F716851170D2E6B9F6E031\nrebol-view-278-3-1.exe\n\n215E28F9660472B6271A9902573C9D190E4D7CCCA33FCF8D6054941D52A3AB85\nrebol-view-278-4-2.tar.gz\n\n918CA549EEA412F519C24593258B186A7C64A202AEAF08C3DEC094BB13D8B04B\nrebol-view-278-4-3.tar.gz\n\nA30C11C4446B70D606E950108E1A5F324F304C2B6DFD515E5DF1BE1930B67967\nrebol-view-278-4-8.tar.gz\n\n115E270F8694E0270493D1CA53879DD8670E28D14BBBFE9240913BEB4F17F1F5\nrebol-view-278-7-2.tar.gz\n\n7A3537DD61E0C754F113CF48DD37EE154984DBCC58C0EBD17B186D3C62853AED\nrebol-view-278-9-4.tar.gz\n\n4E08BA0E1D5EB7230B4E91D6CF9D573C7918352ED7FC8D67A433C3A1B7D83183\n\n139.59.93.[223]\n172.105.178.[119]\n\n\n## Closing Thoughts\n\nWe’re going to coin this exploit the “REBOL Yell!”\n\nIt is quite noisy (3-second intervals for command retrieval) and gives me a reason to include a\nBilly Idol meme with a hint of fall…\n\n\n-----\n\nAlso, a big shout out to Kyle McCray—our case handler who first observed this technique.\n\nAs always, FRSecure is here to help. Whether you suspect you’ve been compromised as part of\nthis attack or are simply hoping to shore your defenses before this becomes a larger concern,\n[please do not hesitate to reach out to our incident response team.](https://frsecure.com/incident-response)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-05 - The REBOL Yell- A New Novel REBOL Exploit.pdf"
    ],
    "report_names": [
        "2021-10-05 - The REBOL Yell- A New Novel REBOL Exploit.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535584,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653754104,
    "ts_modification_date": 1653754104,
    "files": {
        "pdf": "https://archive.orkl.eu/b6b83b006d467e3ea050a68a04d75c0946eafefc.pdf",
        "text": "https://archive.orkl.eu/b6b83b006d467e3ea050a68a04d75c0946eafefc.txt",
        "img": "https://archive.orkl.eu/b6b83b006d467e3ea050a68a04d75c0946eafefc.jpg"
    }
}