{
    "id": "bed90f31-6ef8-4958-954a-bebeb46b8a90",
    "created_at": "2023-01-12T15:10:24.611771Z",
    "updated_at": "2025-03-27T02:05:55.399823Z",
    "deleted_at": null,
    "sha1_hash": "2e1e201df186b8326cf3c9f24a0c5109173bc31b",
    "title": "2019-03-26 - WinRAR Zero-day Abused in Multiple Campaigns",
    "authors": "",
    "file_creation_date": "2022-05-28T03:30:12Z",
    "file_modification_date": "2022-05-28T03:30:12Z",
    "file_size": 5183000,
    "plain_text": "# WinRAR Zero-day Abused in Multiple Campaigns\n\n**[fireeye.com/blog/threat-research/2019/03/winrar-zero-day-abused-in-multiple-campaigns.html](https://www.fireeye.com/blog/threat-research/2019/03/winrar-zero-day-abused-in-multiple-campaigns.html)**\n\n## Threat Research Blog\n\nMarch 26, 2019 | by [Dileep Kumar Jallepalli](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-authors/cap-dileep-kumar-jallepalli)\n[Vulnerability](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-tags/vulnerability)\n\n[Zero-day](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-tags/zero-day)\n\n[WinRAR, an over 20-year-old file archival utility used by over 500 million users worldwide,](https://www.win-rar.com/start.html)\nrecently acknowledged a long-standing vulnerability in its code-base. A recently\npublished path traversal zero-day vulnerability, disclosed in CVE-2018-20250 by Check Point\nResearch, enables attackers to specify arbitrary destinations during file extraction of ‘ACE’\nformatted files, regardless of user input. Attackers can easily achieve persistence and code\nexecution by creating malicious archives that extract files to sensitive locations,\nlike the Windows “Startup” Start Menu folder. While this vulnerability has been fixed in the\nlatest version of WinRAR (5.70), WinRAR itself does not contain auto-update features,\nincreasing the likelihood that many existing users remain running out-of-date versions.\n\nFireEye has observed multiple campaigns leveraging this vulnerability, in addition to those\n[already discussed by 360 Threat Intelligence Center. Below we will look into some](https://ti.360.net/blog/articles/upgrades-in-winrar-exploit-with-social-engineering-and-encryption/)\ncampaigns we came across that used customized and interesting decoy documents with a\n\n\n-----\n\nvariety of payloads including ones which we have not seen before and the ones that\nused off-the-shelf tools like PowerShell Empire.\n\n### Campaign 1: Impersonating an Educational Accreditation Council\n\nInfection Vector\n\nWhen the ACE file Scan_Letter_of_Approval.rar is extracted with vulnerable WinRAR\nversions lower than 5.70, it creates a file named winSrvHost.vbs in the Windows Startup\nfolder without the user’s consent. The VBScript file is executed the next time Windows starts\nup.\n\nDecoy Document\n\nTo avoid user suspicion, the ACE file contains a decoy document, “Letter of Approval.pdf”,\nwhich purports to be from CSWE, the Council on Social Work Education as shown in Figure\n1. This seems to be copied from [CSWE website.](https://www.cswe.org/getattachment/Accreditation/Accreditation-Process/Candidacy-Eligibility-Application-Help-Document.pdf.aspx)\n\nFigure 1: Decoy document impersonating CSWE\n\nVBS Backdoor\n\nThe VBS file in the Startup folder will be executed by wscript.exe when Windows starts up.\nThe VBS code first derives an ID for the victim using custom logic based on a combination of\nthe ComputerName, Processor_identifier and Username. It obtains these from environment\nstrings as shown in Figure 2\n\n\n-----\n\nFigure 2: Deriving victim ID\n\nInterestingly, the backdoor communicates with the command and control (C2) server using\nthe value of the Authorization HTTP header using the code in Figure 3.\n\nFigure 3: Base64-encoded data in Authorization header\n\nThe VBS backdoor first sends the base64-encoded data, including the victim ID and the\nComputerName, using the code in Figure 4.\n\nFigure 4: Base64-encoded victim data\n\nIt then extracts the base64-encoded data in the Authorization header of the HTTP response\nfrom the C2 server and decodes it. The decoded data starts with the instruction code from\nthe C2 server, followed with additional parameters.\n\nC2 Communication\n\nThe malware reaches out to the C2 server at 185[.]162.131.92 via an HTTP request. Actual\ncommunication is via the Authorization field, as shown in Figure 5.\n\nFigure 5: Communication via Authorization field\n\n\n-----\n\nUpon decoding the value of the Authorization field, it can be seen that the malware is\nsending the Victim ID and the computer name to the C2 server. The C2 server responds with\nthe commands in the value of the Authorization HTTP header, as shown in Figure 6.\n\nFigure 6: C2 commands in Authorization field\n\nUpon decoding, the commands are found to be “ok ok”, which we believe is the default C2\ncommand. After some C2 communication, the C2 server responded with instructions to\ndownload the payload from hxxp://185.49.71[.]101/i/pwi_crs.exe, which is a Netwire RAT.\n\nCommands Supported by VBS Backdoor\n\n**Command** **Explanation**\n\nd Delete the VBS file and exit process\n\nPr Download a file from a URL and execute it\n\nHw Get hardware info\n\nav Look for antivirus installed from a predefined list.\n\nIndicators\n\n**File Name** **Hash/IP Address**\n\nScan_Letter_of_Approval.rar 8e067e4cda99299b0bf2481cc1fd8e12\n\nwinSrvHost.vbs 3aabc9767d02c75ef44df6305bc6a41f\n\nLetter of Approval.pdf dc63d5affde0db95128dac52f9d19578\n\n\n-----\n\npwi_crs.exe 12def981952667740eb06ee91168e643\n\nC2 185[.]162.131.92\n\nNetwire C2 89[.]34.111.113\n\n### Campaign 2: Attack on Israeli Military Industry\n\nInfection Vector\n\nBased on the email uploaded to VirusTotal, the attacker seems to send a spoofed email to\nthe victim with an ACE file named SysAid-Documentation.rar as an attachment. Based on\nthe VirusTotal uploader and the email headers, we believe this is an attack on an Israeli\nmilitary company.\n\nDecoy Files\n\nThe ACE file contains decoy files related to documentation for SysAid, a help desk service\nbased in Israel. These files are shown as they would be displayed in WinRAR in Figure 7.\n\nFigure 7: Decoy files\n\nThumbs.db.lnk\n\nThis LNK file target is ‘C:\\Users\\john\\Desktop\\100m.bat’. But when we look at the icon\nlocation using a LNK parser, as shown in Figure 8, it points to an icon remotely hosted on\none of the C2 servers, which can be used to steal NTLM hashes.\n\nFigure 8: LNK parser output\n\nSappyCache Analysis\n\n\n-----\n\nUpon extraction, WinRAR copies a previously unknown payload we call SappyCache to the\nStartup folder with the file name ‘ekrnview.exe’. The payload is executed the next time\nWindows starts up.\n\nSappyCache tries to fetch the next-stage payload using three approaches:\n\n1) Decrypting a File: The malware tries to read the file at %temp%\\..\\GuiCache.db. If it is\nsuccessful, it tries to decrypt it using RC4 to get the C2 URLs, as shown in Figure 9.\n\n\n-----\n\nFigure 9: Decrypting file at GuiCache.db\n\n2) Decrypting a Resource: If it is not successful in retrieving the C2 URL using the previous\nmethod, the malware tries to retrieve the encrypted C2 URLs from a resource section, as\nshown in Figure 10. If it is successful, it will decrypt the C2 URLs using RC4.\n\n\n-----\n\nFigure 10: Decrypting a resource\n\n3) Retrieving From C2: If it is not successful in retrieving the C2 URLs using those previous\ntwo methods, the malware tries to retrieve the payload from four different hardcoded URLs\nmentioned in the indicators. The malware creates the HTTP request using the following\ninformation:\n\nComputer Name, retrieved using the GetComputerNameA function, as the HTTP\nparameter ‘name’ (Figure 11).\n\nFigure 11: Retrieving computer name using GetComputerNameA\n\nWindows operating system name, retrieved by querying the ProductName value from\nthe registry key SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion, as the HTTP\nparameter ‘key’ (Figure 12).\n\n\n-----\n\nFigure 12: Retrieving Windows OS name using ProductName value\n\nThe module name of the malware, retrieved using the GetModuleFileNameA function,\nas the HTTP parameter ‘page’ (Figure 13).\n\nFigure 13: Retrieving malware module name using using GetModuleFileNameA\n\n\n-----\n\nThe list of processes and their module names, retrieved using the Process32First and\nModule32First APIs, as the HTTP parameter ‘session_data’ (Figure 14).\n\nFigure 14: Retrieving processes and modules using Process32First and Module32First\n\nA fragment of the HTTP request that is built with the information gathered is shown in Figure\n15.\n\nFigure 15: HTTP request fragment\n\n\n-----\n\nIf any of the aforementioned methods is successful, the malware tries to execute the\ndecrypted payload. During our analysis, the C2 server did not respond with a next-level\npayload.\n\nIndicators\n\n**File Name/Type** **Hash/URL**\n\nSysAid-Documentation.rar 062801f6fdbda4dd67b77834c62e82a4\n\nSysAid-Documentation.rar 49419d84076b13e96540fdd911f1c2f0\n\nekrnview.exe 96986B18A8470F4020EA78DF0B3DB7D4\n\nThumbs.db.lnk 31718d7b9b3261688688bdc4e026db99\n\nURL1 www.alahbabgroup[.]com/bakala/verify.php\n\nURL2 103.225.168[.]159/admin/verify.php\n\nURL3 www.khuyay[.]org/odin_backup/public/loggoff.php\n\nURL4 47.91.56[.]21/verify.php\n\nEmail 8c93e024fc194f520e4e72e761c0942d\n\n### Campaign 3: Potential Attack in Ukraine with Empire Backdoor\n\nInfection Vector\n\nThe ACE file named zakon.rar is propagated using a malicious URL mentioned in the\nindicators. [360 Threat Intelligence Center has also encountered this campaign.](https://twitter.com/360TIC/status/1101022904156741632)\n\nDecoy Documents\n\nThe ACE file contains a file named Ukraine.pdf, which contains a message on the law of\nUkraine about public-private partnerships that purports to be a message from Viktor\nYanukovych, former president of Ukraine (Figure 16 and Figure 17).\n\n\n-----\n\nFigure 16: Ukraine.pdf decoy file\n\nFigure 17: Contents of decoy file\n\nBased on the decoy PDF name, the decoy PDF content and the VirusTotal uploader, we\nbelieve this is an attack on an individual in Ukraine.\n\nEmpire Backdoor\n\nWhen the file contents are extracted, WinRAR drops a .bat file named mssconf.bat in the\nStartup folder. The batch file contains commands that invoke base64-encoded PowerShell\ncommands. After decoding, the PowerShell commands invoked are found to be the Empire\nbackdoor, as shown in Figure 18. We did not observe any additional payloads at the time of\nanalysis.\n\nFigure 18: Empire backdoor\n\nIndicators\n\n\n-----\n\n**File Name/URL** **Hash/URL**\n\nzakon.rar 9b19753369b6ed1187159b95fc8a81cd\n\nmssconf.bat 79B53B4555C1FB39BA3C7B8CE9A4287E\n\nC2 31.148.220[.]53\n\nURL http://tiny-share[.]com/direct/7dae2d144dae4447a152bef586520ef8\n\n### Campaign 4: Credential and Credit Card Dumps as Decoys\n\nDecoy Documents\n\nThis campaign uses credential dumps and likely stolen credit card dumps as decoy\ndocuments to distribute different types of RATs and password stealers.\n\nOne file, ‘leaks copy.rar’, used text files that contained stolen email IDs and passwords as\ndecoys. These files are shown as they would be displayed in WinRAR in Figure 19.\n\n\n-----\n\nFigure 19: Text files containing stolen email credentials as decoy\n\nAnother file, ‘cc.rar’, used a text file containing stolen credit card details as a decoy. The file\nas it would be displayed in WinRAR and sample contents of the decoy file are shown in\nFigure 20.\n\n\n-----\n\nFigure 20: Text file containing stolen credit card details as decoy\n\nPayloads\n\nThis campaign used payloads from different malware families. To keep the draft concise, we\ndid not include the analysis of all of them. The decompilation of one of the payloads with\nhash 1BA398B0A14328B9604EEB5EBF139B40 shows keylogging capabilities (Figure 21).\nWe later identified this sample as QuasarRAT.\n\n\n-----\n\nFigure 21: Keylogging capabilities\n\nThe decompilation of all the .NET-based payload shows that much of the code is written in\nChinese. The decompilation of malware with hash\nBCC49643833A4D8545ED4145FB6FDFD2 containing Chinese text is shown in Figure 22.\nWe later identified this sample as Buzy.\n\n\n-----\n\nFigure 22: Code written in Chinese\n\nThe other payloads also have similar keylogging, password stealing and standard RAT\ncapabilities. The VirusTotal submissions show the use of different malware families in this\ncampaign and a wide range of targeting.\n\nHashes of ACE Files\n\n**File Name** **Hash**\n\n\n-----\n\nleaks copy.rar e9815dfb90776ab449539a2be7c16de5\n\ncc.rar 9b81b3174c9b699f594d725cf89ffaa4\n\nzabugor.rar 914ac7ecf2557d5836f26a151c1b9b62\n\nzabugorV.rar eca09fe8dcbc9d1c097277f2b3ef1081\n\nCombolist.rar 1f5fa51ac9517d70f136e187d45f69de\n\nNulled2019.rar f36404fb24a640b40e2d43c72c18e66b\n\nIT.rar 0f56b04a4e9a0df94c7f89c1bccf830c\n\nHashes of Payloads\n\nFile name Hash Malware Family\n\nexplorer.exe 1BA398B0A14328B9604EEB5EBF139B40 QuasarRAT\n\nexplorer.exe AAC00312A961E81C4AF4664C49B4A2B2 Azorult\n\nIntelAudio.exe 2961C52F04B7FDF7CCF6C01AC259D767 Netwire\n\nDiscord.exe 97D74671D0489071BAA21F38F456EB74 Razy\n\nDiscord.exe BCC49643833A4D8545ED4145FB6FDFD2 Buzy\n\nold.exe 119A0FD733BC1A013B0D4399112B8626 Azorult\n\nFireEye Detection\n\nFireEye detection names for the indicators in the attack:\n\n\n-----\n\nFireEye Endpoint Security **IOC: WINRAR (EXPLOIT)**\n\n**MG: Generic.mg**\n\n**AV:**\n\nExploit.ACE-PathTraversal.Gen\nExploit.Agent.UZ\nExploit.Agent.VA\nGen:Heur.BZC.ONG.Boxter.91.1305E319\nGen:Variant.Buzy.2604\nGen:Variant.Razy.472302\nGeneric.MSIL.PasswordStealerA.5CBD94BB\nTrojan.Agent.DPAS\nTrojan.GenericKD.31783690\nTrojan.GenericKD.31804183\n\nFireEye Network Security FE_Exploit_ACE_CVE201820250_2\nFE_Exploit_ACE_CVE201820250_1\nBackdoor.EMPIRE\nDownloader.EMPIRE\nTrojan.Win.Azorult\nTrojan.Netwire\n\nFireEye Email Security FE_Exploit_ACE_CVE201820250_2\nFE_Exploit_ACE_CVE201820250_1\nFE_Backdoor_QUASARRAT_A\nFE_Backdoor_EMPIRE\n\n### Conclusion\n\nWe have seen how various threat actors are abusing the recently disclosed WinRAR\nvulnerability using customized decoys and payloads, and by using different propagation\ntechniques such as email and URL. Because of the huge WinRAR customer-base, lack of\nauto-update feature and the ease of exploitation of this vulnerability, we believe this will be\nused by more threat actors in the upcoming days.\n\nTraditional AV solutions will have a hard time providing proactive zero-day detection for\n[unknown malware families. FireEye MalwareGuard, a component of](https://www.fireeye.com/blog/products-and-services/2018/07/malwareguard-fireeye-machine-learning-model-to-detect-and-prevent-malware.html)\nFireEye Endpoint Security, detects and blocks all the PE executables mentioned in this blog\npost using machine learning. It’s also worth noting that this vulnerability allows the malicious\nACE file to write a payload to any path if WinRAR has sufficient permissions, so although the\nexploits that we have seen so far chose to write the payload to startup folder, a more\ninvolved threat actor can come up with a different file path to achieve code execution so that\n\n\n-----\n\nany behavior based rules looking for WinRAR writing to the startup folder can be bypassed.\nEnterprises should consider blocking vulnerable WinRAR versions and mandate updating\nWinRAR to the latest version.\n\nFireEye Endpoint Security, FireEye Network Security and FireEye Email Security detect and\nblock these campaigns at several stages of the attack chain.\n\n### Acknowledgement\n\nSpecial thanks to Jacob Thompson, Jonathan Leathery and John Miller for their valuable\nfeedback on this blog post.\n\nPrevious Post\nNext Post\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-26 - WinRAR Zero-day Abused in Multiple Campaigns.pdf"
    ],
    "report_names": [
        "2019-03-26 - WinRAR Zero-day Abused in Multiple Campaigns.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536224,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1653708612,
    "ts_modification_date": 1653708612,
    "files": {
        "pdf": "https://archive.orkl.eu/2e1e201df186b8326cf3c9f24a0c5109173bc31b.pdf",
        "text": "https://archive.orkl.eu/2e1e201df186b8326cf3c9f24a0c5109173bc31b.txt",
        "img": "https://archive.orkl.eu/2e1e201df186b8326cf3c9f24a0c5109173bc31b.jpg"
    }
}