{
    "id": "bf0cf37e-73d7-4b6e-8587-7584a439b82d",
    "created_at": "2023-01-12T15:09:45.868124Z",
    "updated_at": "2025-03-27T02:17:23.434026Z",
    "deleted_at": null,
    "sha1_hash": "81c9d84f209ae6076b31d5d3e3873a8185ca877f",
    "title": "2019-10-17 - The Untold Story of the 2018 Olympics Cyberattack, the Most Deceptive Hack in History",
    "authors": "",
    "file_creation_date": "2022-05-28T02:05:53Z",
    "file_modification_date": "2022-05-28T02:05:53Z",
    "file_size": 1015207,
    "plain_text": "# The Untold Story of the 2018 Olympics Cyberattack, the Most Deceptive Hack in History\n\n**[wired.com/story/untold-story-2018-olympics-destroyer-cyberattack/](https://www.wired.com/story/untold-story-2018-olympics-destroyer-cyberattack/)**\n\nAndy Greenberg, Excerpt October 17, 2019\n\nJust before 8 pm on February 9, 2018, high in the northeastern mountains of South Korea,\nSang-jin Oh was sitting on a plastic chair a few dozen rows up from the floor of\nPyeongchang's vast, pentagonal Olympic Stadium. He wore a gray and red official [Olympics](https://www.wired.com/tag/olympics/)\njacket that kept him warm despite the near-freezing weather, and his seat, behind the press\nsection, had a clear view of the raised, circular stage a few hundred feet in front of him. The\n[2018 Winter Olympics opening ceremony was about to start.](https://www.wired.com/story/olympics-opening-ceremony-drone-show/)\n\nAs the lights darkened around the roofless structure, anticipation buzzed through the 35,000person crowd, the glow of their phone screens floating like fireflies around the stadium. Few\nfelt that anticipation more intensely than Oh. For more than three years, the 47-year-old civil\nservant had been director of technology for the Pyeongchang Olympics organizing\ncommittee. He'd overseen the setup of an IT infrastructure for the games comprising more\nthan 10,000 PCs, more than 20,000 mobile devices, 6,300 Wi-Fi routers, and 300 servers in\ntwo Seoul data centers.\n\nThat immense collection of machines seemed to be functioning perfectly—almost. Half an\nhour earlier, he'd gotten word about a nagging technical issue. The source of that problem\nwas a contractor, an IT firm from which the Olympics were renting another hundred servers.\n\n\n-----\n\nThe contractor s glitches had been a long-term headache. Oh s response had been\nannoyance: Even now, with the entire world watching, the company was still working out its\nbugs?\n\n[Andy Greenberg is a WIRED senior writer. This story is excerpted from his book Sandworm,](https://www.wired.com/author/andy-greenberg/)\nto be published on November 5, 2019.\n\nThe data centers in Seoul, however, weren't reporting any such problems, and Oh's team\nbelieved the issues with the contractor were manageable. He didn't yet know that they were\nalready preventing some attendees from printing tickets that would let them enter the\nstadium. So he'd settled into his seat, ready to watch a highlight of his career unfold.\n\nTen seconds before 8 pm, numbers began to form, one by one, in projected light around the\nstage, as a choir of children's voices counted down in Korean to the start of the event:\n\n“Sip! … Gu! … Pal! … Chil!”\n\nIn the middle of the countdown, Oh's Samsung Galaxy Note8 phone abruptly lit up. He\nlooked down to see a message from a subordinate on KakaoTalk, a popular Korean\nmessaging app. The message shared perhaps the worst possible news Oh could have\nreceived at that exact moment: Something was shutting down every domain controller in the\nSeoul data centers, the servers that formed the backbone of the Olympics' IT infrastructure.\n\nAs the opening ceremony got underway, thousands of fireworks exploded around the\nstadium on cue, and dozens of massive puppets and Korean dancers entered the stage. Oh\nsaw none of it. He was texting furiously with his staff as they watched their entire IT setup go\ndark. He quickly realized that what the partner company had reported wasn't a mere glitch. It\nhad been the first sign of an unfolding attack. He needed to get to his technology operations\ncenter.\n\nAs Oh made his way out of the press section toward the exit, reporters around him had\nalready begun complaining that the Wi-Fi seemed to have suddenly stopped working.\nThousands of internet-linked TVs showing the ceremony around the stadium and in 12 other\nOlympic facilities had gone black. Every RFID-based security gate leading into every\nOlympic building was down. The Olympics' official app, including its digital ticketing function,\nwas broken too; when it reached out for data from backend servers, they suddenly had none\nto offer.\n\n[The Pyeongchang organizing committee had prepared for this: Its cybersecurity advisory](https://www.wired.com/tag/cybersecurity/)\ngroup had met 20 times since 2015. They'd conducted drills as early as the summer of the\n[previous year, simulating disasters like cyberattacks, fires, and earthquakes. But now that](https://www.wired.com/category/security/cyberattacks-hacks/)\none of those nightmare scenarios was playing out in reality, the feeling, for Oh, was both\ninfuriating and surreal. “It's actually happened,” Oh thought, as if to shake himself out of the\nsense that it was all a bad dream.\n\n\n-----\n\nOnce Oh had made his way through the crowd, he ran to the stadium s exit, out into the cold\nnight air, and across the parking lot, now joined by two other IT staffers. They jumped into a\nHyundai SUV and began the 45-minute drive east, down through the mountains to the\ncoastal city of Gangneung, where the Olympics' technology operations center was located.\n\nFrom the car, Oh called staffers at the stadium and told them to start distributing Wi-Fi hot\nspots to reporters and to tell security to check badges manually, because all RFID systems\nwere down. But that was the least of their worries. Oh knew that in just over two hours the\nopening ceremony would end, and tens of thousands of athletes, visiting dignitaries, and\nspectators would find that they had no Wi-Fi connections and no access to the Olympics\napp, full of schedules, hotel information, and maps. The result would be a humiliating\nconfusion. If they couldn't recover the servers by the next morning, the entire IT backend of\nthe organizing committee—responsible for everything from meals to hotel reservations to\nevent ticketing—would remain offline as the actual games got underway. And a kind of\ntechnological fiasco that had never before struck the Olympics would unfold in one of the\nworld's most wired countries.\n\n**Oh arrived at the technology operations center in Gangneung by 9 pm, halfway into the**\nopening ceremony. The center consisted of a large open room with desks and computers for\n150 staffers; one wall was covered with screens. When he walked in, many of those staffers\nwere standing, clumped together, anxiously discussing how to respond to the attack—a\nproblem compounded by the fact that they'd been locked out of many of their own basic\nservices, like email and messaging.\n\nAll nine of the Olympic staff's domain controllers, the powerful machines that governed which\nemployee could access which computers in the network, had somehow been paralyzed,\ncrippling the entire system. The staff decided on a temporary workaround: They set all the\nsurviving servers that powered some basic services, such as Wi-Fi and the internet-linked\nTVs, to bypass the dead gatekeeper machines. By doing so, they managed to bring those\nbare-minimum systems back online just minutes before the end of the ceremony.\n\nOver the next two hours, as they attempted to rebuild the domain controllers to re-create a\nmore long-term, secure network, the engineers would find again and again that the servers\nhad been crippled. Some malicious presence in their systems remained, disrupting the\nmachines faster than they could be rebuilt.\n\nOh and his staff worked frantically to rebuild the Olympics’ digital nervous system.\n\nA few minutes before midnight, Oh and his administrators reluctantly decided on a desperate\nmeasure: They would cut off their entire network from the internet in an attempt to isolate it\nfrom the saboteurs who they figured must still have maintained a presence inside. That\nmeant taking down every service—even the Olympics' public website—while they worked to\nroot out whatever malware infection was tearing apart their machines from within.\n\n\n-----\n\nFor the rest of the night, Oh and his staff worked frantically to rebuild the Olympics digital\nnervous system. By 5 am, a Korean security contractor, AhnLab, had managed to create an\nantivirus signature that could help Oh's staff vaccinate the network's thousands of PCs and\nservers against the mysterious malware that had infected them, a malicious file that Oh says\nwas named simply winlogon.exe.\n\nAt 6:30 am, the Olympics' administrators reset staffers' passwords in hopes of locking out\nwhatever means of access the hackers might have stolen. Just before 8 that morning, almost\nexactly 12 hours after the cyberattack on the Olympics had begun, Oh and his sleepless\nstaffers finished reconstructing their servers from backups and began restarting every\nservice.\n\nAmazingly, it worked. The day's skating and ski jumping events went off with little more than\na few Wi-Fi hiccups. R2-D2-style robots puttered around Olympic venues, vacuuming floors,\ndelivering water bottles, and projecting weather reports. A Boston Globe reporter later called\nthe games “impeccably organized.” One USA Today columnist wrote that “it's possible no\nOlympic Games have ever had so many moving pieces all run on time.” Thousands of\nathletes and millions of spectators remained blissfully unaware that the Olympics' staff had\nspent its first night fighting off an invisible enemy that threatened to throw the entire event\ninto chaos.\n\nIllustration: Joan Wong\n\n**Within hours of the attack, rumors began to trickle out into the cybersecurity community**\nabout the glitches that had marred the Olympics' website, Wi-Fi, and apps during the\nopening ceremony. Two days after the ceremony, the Pyeongchang organizing committee\nconfirmed that it had indeed been the target of a cyberattack. But it refused to comment on\nwho might have been behind it. Oh, who led the committee's response, has declined to\ndiscuss any possible source of the attack with WIRED.\n\nThe incident immediately became an international whodunit: Who would dare to hack the\nOlympics? The Pyeongchang cyberattack would turn out to be perhaps the most deceptive\nhacking operation in history, using the most sophisticated means ever seen to confound the\nforensic analysts searching for its culprit.\n\n[The difficulty of proving the source of an attack—the so-called attribution problem—has](https://www.wired.com/2016/12/hacker-lexicon-attribution-problem/)\nplagued cybersecurity since practically the dawn of the internet. Sophisticated hackers can\nroute their connections through circuitous proxies and blind alleys, making it almost\nimpossible to follow their tracks. Forensic analysts have nonetheless learned how to\ndetermine hackers' identities by other means, tying together clues in code, infrastructure\nconnections, and political motivations.\n\n\n-----\n\nIn the past few years, however, state-sponsored cyberspies and saboteurs have increasingly\nexperimented with another trick: planting false flags. Those evolving acts of deception,\ndesigned to throw off both security analysts and the public, have given rise to fraudulent\nnarratives about hackers' identities that are difficult to dispel, even after governments\nannounce the official findings of their intelligence agencies. It doesn't help that those official\nfindings often arrive weeks or months later, with the most convincing evidence redacted to\npreserve secret investigative techniques and sources.\n\n[When North Korean hackers breached Sony Pictures in 2014 to prevent the release of the](https://www.wired.com/2014/12/sony-hack-what-we-know/)\nKim Jong-un assassination comedy The Interview, for instance, they invented a hacktivist\ngroup called Guardians of Peace and tried to throw off investigators with a vague demand for\n“monetary compensation.” Even after the FBI officially named North Korea as the culprit and\nthe White House imposed new sanctions against the Kim regime as punishment, several\nsecurity firms continued to argue that the attack must have been an inside job, a story picked\nup by numerous news outlets—including WIRED.\n\n[When state-sponsored Russian hackers stole and leaked emails from the Democratic](https://www.wired.com/2016/07/heres-know-russia-dnc-hack/)\nNational Committee and Hillary Clinton's campaign in 2016, we now know that the Kremlin\nlikewise created diversions and cover stories. It invented a lone Romanian hacker named\n[Guccifer 2.0 to take credit for the hacks; it also](https://www.wired.com/story/russia-false-flag-hacks/) spread the rumors that a murdered DNC\nstaffer named Seth Rich had leaked the emails from inside the organization—and it\ndistributed many of the stolen documents through a fake whistle-blowing site called\nDCLeaks. Those deceptions became conspiracy theories, fanned by right-wing\n[commentators and then-presidential candidate Donald Trump.](https://www.wired.com/2017/01/timeline-trumps-strange-contradictory-statements-russian-hacking/)\n\nThe deceptions generated a self-perpetuating ouroboros of mistrust: Skeptics dismissed\neven glaring clues of the Kremlin's guilt, like Russian-language formatting errors in the\nleaked documents, seeing those giveaways as planted evidence. Even a joint statement\nfrom US intelligence agencies four months later naming Russia as the perpetrator couldn't\nshake the conviction of disbelievers. They persist even today: In an _Economist/YouGov poll_\n[earlier this year, only about half of Americans said they believed Russia interfered in the](https://www.wired.com/tag/russia/)\nelection.\n\nWith the malware that hit the Pyeongchang Olympics, the state of the art in digital deception\ntook several evolutionary leaps forward. Investigators would find in its code not merely a\nsingle false flag but layers of false clues pointing at multiple potential culprits. And some of\nthose clues were hidden deeper than any cybersecurity analyst had ever seen before.\n\nFrom the start, the geopolitical motivations behind the Olympics sabotage were far from\nclear. The usual suspect for any cyberattack in South Korea is, of course, North Korea. The\nhermit kingdom has tormented its capitalist neighbors with military provocations and lowgrade cyberwar for years. In the run-up to the Olympics, analysts at the cybersecurity firm\nMcAfee had warned that Korean-speaking hackers had targeted the Pyeongchang Olympic\n\n\n-----\n\norganizers with phishing emails and what appeared to be espionage malware. At the time,\nMcAfee analysts hinted in a phone call with me that North Korea was likely behind the spying\nscheme.\n\nBut there were contradictory signals on the public stage. As the Olympics began, the North\nseemed to be experimenting with a friendlier approach to geopolitics. The North Korean\ndictator, Kim Jong-un, had sent his sister as a diplomatic emissary to the games and had\ninvited South Korea's president, Moon Jae-in, to visit the North Korean capital of Pyongyang.\nThe two countries had even taken the surprising step of combining their Olympic women's\nhockey teams in a show of friendship. Why would North Korea launch a disruptive\ncyberattack in the midst of that charm offensive?\n\nThen there was Russia. The Kremlin had its own motive for an attack on Pyeongchang.\nInvestigations into doping by Russian athletes had led to a humiliating result in advance of\nthe 2018 Olympics: Russia was banned. Its athletes would be allowed to compete but not to\nwear Russian flags or accept medals on behalf of their country. For years in the lead-up to\nthat verdict, a state-sponsored Russian hacker team known as Fancy Bear had been\n[retaliating, stealing and leaking data from Olympics-related targets. Russia's exile from the](https://www.wired.com/2016/09/anti-doping-agency-attack-shows-russian-hackers-getting-bolder/)\ngames was exactly the sort of slight that might inspire the Kremlin to unleash a piece of\ndisruptive malware against the opening ceremony. If the Russian government couldn't enjoy\nthe Olympics, then no one would.\n\nIf Russia had been trying to send a message with an attack on the Olympics' servers,\nhowever, it was hardly a direct one. Days before the opening ceremony, it had preemptively\ndenied any Olympics-targeted hacking. “We know that Western media are planning pseudoinvestigations on the theme of ‘Russian fingerprints’ in hacking attacks on information\nresources related to the hosting of the Winter Olympic Games in the Republic of Korea,”\n[Russia's Foreign Ministry had told Reuters. “Of course, no evidence will be presented to the](https://www.reuters.com/article/us-olympics-2018-cyber/games-organizers-confirm-cyber-attack-wont-reveal-source-idUSKBN1FV036)\nworld.”\n\nIn fact, there would be plenty of evidence vaguely hinting at Russia's responsibility. The\nproblem, it would soon become clear, was that there seemed to be just as much evidence\npointing in a tangle of other directions too.\n\n**Three days after the opening ceremony, Cisco's Talos security division revealed that it had**\nobtained a copy of Olympics-targeted malware and dissected it. Someone from the Olympics\norganizing committee or perhaps the Korean security firm AhnLab had uploaded the code to\nVirusTotal, a common database of malware samples used by cybersecurity analysts, where\n[Cisco's reverse-engineers found it. The company published its findings in a blog post that](https://blog.talosintelligence.com/2018/02/olympic-destroyer.html)\n[would give that malware a name: Olympic Destroyer.](https://www.wired.com/story/olympic-destroyer-malware-pyeongchang-opening-ceremony/)\n\n\n-----\n\nIn broad outline, Cisco s description of Olympic Destroyer s anatomy called to mind two\n[previous Russian cyberattacks, NotPetya and](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/) [Bad Rabbit. As with those earlier attacks,](https://www.wired.com/story/badrabbit-ransomware-notpetya-russia-ukraine/)\nOlympic Destroyer used a password-stealing tool, then combined those stolen passwords\nwith remote access features in Windows that allowed it to spread among computers on a\nnetwork. Finally, it used a data-destroying component to delete the boot configuration from\ninfected machines before disabling all Windows services and shutting the computer down so\nthat it couldn't be rebooted. Analysts at the security firm CrowdStrike would find other\napparent Russian calling cards, elements that resembled a piece of Russian ransomware\nknown as XData.\n\nYet there seemed to be no clear code matches between Olympic Destroyer and the previous\nNotPetya or Bad Rabbit worms. Although it contained similar features, they had apparently\nbeen re-created from scratch or copied from elsewhere.\n\nThe deeper analysts dug, the stranger the clues became. The data-wiping portion of Olympic\nDestroyer shared characteristics with a sample of data-deleting code that had been used not\nby Russia but by the North Korean hacker group known as Lazarus. When Cisco\nresearchers put the logical structures of the data-wiping components side by side, they\nseemed to roughly match. And both destroyed files with the same distinctive trick of deleting\njust their first 4,096 bytes. Was North Korea behind the attack after all?\n\nThere were still more signposts that led in completely different directions. The security firm\n[Intezer noted that a chunk of the password-stealing code in Olympic Destroyer matched](https://www.intezer.com/2018-winter-cyber-olympics-code-similarities-cyber-attacks-pyeongchang/)\n[exactly with tools used by a hacker group known as APT3—a group that multiple](https://www.wired.com/story/nsa-zero-day-symantec-buckeye-china/)\ncybersecurity firms have linked to the Chinese government. The company also traced a\ncomponent that Olympic Destroyer used to generate encryption keys back to a third group,\nAPT10, also reportedly linked to China. Intezer pointed out that the encryption component\nhad never been used before by any other hacking teams, as far as the company's analysts\ncould tell. Russia? North Korea? China? The more that forensic analysts reverse-engineered\nOlympic Destroyer's code, the further they seemed to get from arriving at a resolution.\n\nIn fact, all those contradictory clues seemed designed not to lead analysts toward any single\nfalse answer but to a collection of them, undermining any particular conclusion. The mystery\nbecame an epistemological crisis that left researchers doubting themselves. “It was\npsychological warfare on reverse-engineers,” says Silas Cutler, a security researcher who\nworked for CrowdStrike at the time. “It hooked into all those things you do as a backup\ncheck, that make you think ‘I know what this is.’ And it poisoned them.”\n\nThat self-doubt, just as much as the sabotage effects on the Olympics, seemed to have been\nthe malware's true aim, says Craig Williams, a researcher at Cisco. “Even as it accomplished\nits mission, it also sent a message to the security community,” Williams says. “You can be\n_misled.”_\n\n\n-----\n\n**The Olympics organizing committee, it turned out, wasn t Olympic Destroyer s only victim.**\nAccording to the Russian security firm Kaspersky, the cyberattack also hit other targets with\n[connections to the Olympics, including Atos, an IT services provider in France that had](https://www.cyberscoop.com/atos-olympics-hack-olympic-destroyer-malware-peyongchang/)\nsupported the event, and two ski resorts in Pyeongchang. One of those resorts had been\ninfected seriously enough that its automated ski gates and ski lifts were temporarily\nparalyzed.\n\nIn the days after the opening ceremony attack, Kaspersky's Global Research and Analysis\nTeam obtained a copy of the Olympic Destroyer malware from one of the ski resorts and\nbegan dusting it for fingerprints. But rather than focusing on the malware's code, as Cisco\nand Intezer had done, they looked at its “header,” a part of the file's metadata that includes\nclues about what sorts of programming tools were used to write it. Comparing that header\nwith others in Kaspersky's vast database of malware samples, they found it perfectly\nmatched the header of the North Korean Lazarus hackers' data-wiping malware—the same\none Cisco had already pointed to as sharing traits with Olympic Destroyer. The North Korean\ntheory seemed to be confirmed.\n\nBut one senior Kaspersky researcher named Igor Soumenkov decided to go a step further.\nSoumenkov, a hacker prodigy who'd been recruited to Kaspersky's research team as a\nteenager years earlier, had a uniquely deep knowledge of file headers, and he decided to\ndouble-check his colleagues' findings.\n\nA tall, soft-spoken engineer, Soumenkov had a habit of arriving at work late in the morning\nand staying at Kaspersky's headquarters well after dark—a partially nocturnal schedule that\nhe kept to avoid Moscow traffic.\n\nOne night, as his coworkers headed home, he pored over the code at a cubicle overlooking\nthe city's jammed Leningradskoye Highway. By the end of that night, the traffic had thinned,\nhe was virtually alone in the office, and he had determined that the header metadata didn't\nactually match other clues in the Olympic Destroyer code itself; the malware hadn't been\nwritten with the programming tools that the header implied. The metadata had been forged.\n\nThis was something different from all the other signs of misdirection that researchers had\nfixated on. The other red herrings in Olympic Destroyer had been so vexing in part because\nthere was no way to tell which clues were real and which were deceptions. But now, deep in\nthe folds of false flags wrapped around the Olympic malware, Soumenkov had found one\nflag that was provably false. It was now clear that someone had tried to make the malware\nlook North Korean and failed due to a slipup. It was only through Kaspersky's fastidious\ntriple-checking that it came to light.\n\n“It was psychological warfare on reverse-engineers.”\n\n\n-----\n\nA few months later, I sat down with Soumenkov in a Kaspersky conference room in Moscow.\nOver an hour-long briefing, he explained in perfect English and with the clarity of a computer\nscience professor how he'd defeated the attempted deception deep in Olympic Destroyer's\nmetadata. I summarized what he seemed to have laid out for me: The Olympics attack\nclearly wasn't the work of North Korea. “It didn't look like them at all,” Soumenkov agreed.\n\nAnd it certainly wasn't Chinese, I suggested, despite the more transparent false code hidden\nin Olympic Destroyer that fooled some researchers early on. “Chinese code is very\nrecognizable, and this looks different,” Soumenkov agreed again.\n\nFinally, I asked the glaring question: If not China, and not North Korea, then who? It seemed\nthat the conclusion of that process of elimination was practically sitting there in the\nconference room with us and yet couldn't be spoken aloud.\n\n“Ah, for that question, I brought a nice game,” Soumenkov said, affecting a kind of chipper\ntone. He pulled out a small black cloth bag and took out of it a set of dice. On each side of\nthe small black cubes were written words like Anonymous, Cybercriminals, Hacktivists, USA,\n_China, Russia, Ukraine, Cyberterrorists, Iran._\n\nKaspersky, like many other security firms, has a strict policy of only pinning attacks on\nhackers using the firm's own system of nicknames, never naming the country or government\nbehind a hacking incident or hacker group—the safest way to avoid the murky and often\npolitical pitfalls of attribution. But the so-called attribution dice that Soumenkov held in his\nhand, which I'd seen before at hacker conferences, represented the most cynical\nexaggeration of the attribution problem: That no cyberattack can ever truly be traced to its\nsource, and anyone who tries is simply guessing.\n\nSoumenkov tossed the dice on the table. “Attribution is a tricky game,” he said. “Who is\nbehind this? It's not our story, and it will never be.”\n\n**Michael Matonis was working from his home, a 400-square-foot basement apartment in**\nthe Washington, DC, neighborhood of Capitol Hill, when he first began to pull at the threads\nthat would unravel Olympic Destroyer's mystery. The 28-year-old, a former anarchist punk\nturned security researcher with a controlled mass of curly black hair, had only recently\nmoved to the city from upstate New York, and he still didn't have a desk at the Reston,\nVirginia, office of FireEye, the security and private intelligence firm that employed him. So on\nthe day in February when he started to examine the malware that had struck Pyeongchang,\nMatonis was sitting at his makeshift workspace: a folding metal chair with his laptop propped\nup on a plastic table.\n\nOn a whim, Matonis decided to try a different approach from much of the rest of the\nperplexed security industry. He didn't search for clues in the malware's code. Instead, in the\ndays after the attack, Matonis looked at a far more mundane element of the operation: a\n\n\n-----\n\nfake, malware-laced Word document that had served as the first step in the nearly disastrous\nopening ceremony sabotage campaign.\n\nThe document, which appeared to contain a list of VIP delegates to the games, had likely\nbeen emailed to Olympics staff as an attachment. If anyone opened that attachment, it would\nrun a malicious macro script that planted a backdoor on their PC, offering the Olympics\nhackers their first foothold on the target network. When Matonis pulled the infected document\nfrom VirusTotal, the malware repository where it had been uploaded by incident responders,\nhe saw that the bait had likely been sent to Olympics staff in late November 2017, more than\ntwo months before the games began. The hackers had laid in wait for months before\ntriggering their logic bomb.\n\nMatonis began combing VirusTotal and FireEye's historical collection of malware, looking for\nmatches to that code sample. On a first scan, he found none. But Matonis did notice that a\nfew dozen malware-infected documents from the archives corresponded to his file's rough\ncharacteristics: They similarly carried embedded Word macros and, like the Olympicstargeted file, had been built to launch a certain common set of hacking tools called\nPowerShell Empire. The malicious Word macro traps, however, looked very different from\none another, with their own unique layers of obfuscation.\n\nOver the next two days, Matonis searched for patterns in that obfuscation that might serve as\na clue. When he wasn't at his laptop, he'd turn the puzzle over in his mind, in the shower or\nlying on the floor of his apartment, staring up at the ceiling. Finally, he found a telling pattern\nin the malware specimens' encoding. Matonis declined to share with me the details of this\ndiscovery for fear of tipping off the hackers to their tell. But he could see that, like teenage\npunks who all pin just the right obscure band's buttons to their jackets and style their hair in\nthe same shapes, the attempt to make the encoded files look unique had instead made one\nset of them a distinctly recognizable group. He soon deduced that the source of that signal in\nthe noise was a common tool used to create each one of the booby-trapped documents. It\nwas an open source program, easily found online, called Malicious Macro Generator.\n\nMatonis speculated that the hackers had chosen the program in order to blend in with a\ncrowd of other malware authors, but it had ultimately had the opposite effect, setting them\napart as a distinct set. Beyond their shared tools, the malware group was also tied together\nby the author names Matonis pulled from the files' metadata: Almost all had been written by\nsomeone named either “AV,” “BD,” or “john.” When he looked at the command and control\nservers that the malware connected back to—the strings that would control the puppetry of\nany successful infections—all but a few of the IP addresses of those machines overlapped\ntoo. The fingerprints were hardly exact. But over the next days, he assembled a loose mesh\nof clues that added up to a solid net, tying the fake Word documents together.\n\nOnly after he had established those hidden connections did Matonis go back to the Word\ndocuments that had served as the vehicles for each malware sample and begin to Googletranslate their contents, some written in Cyrillic. Among the files he'd tied to the Olympic\n\n\n-----\n\nDestroyer bait, Matonis found two other bait documents from the collection that dated back to\n2017 and seemed to target Ukrainian LGBT activist groups, using infected files that\npretended to be a gay rights organization's strategy document and a map of a Kiev Pride\nparade. Others targeted Ukrainian companies and government agencies with a tainted copy\nof draft legislation.\n\nThis, for Matonis, was ominously familiar territory: For more than two years, he and the rest\nof the security industry had watched Russia launch a series of destructive hacking\noperations against Ukraine, a relentless cyberwar that accompanied Russia's invasion of the\ncountry after its pro-Western 2014 revolution.\n\nEven as that physical war had killed 13,000 people in Ukraine and displaced millions more, a\nRussian hacker group known as Sandworm had waged a full-blown cyberwar against\nUkraine as well: It had barraged Ukrainian companies, government agencies, railways, and\nairports with wave after wave of data-destroying intrusions, including two unprecedented\nbreaches of Ukrainian power utilities in 2015 and 2016 that had caused blackouts for\nhundreds of thousands of people. Those attacks culminated in NotPetya, a worm that had\nspread rapidly beyond Ukraine's borders and ultimately inflicted $10 billion in damage on\nglobal networks, the most costly cyberattack in history.\n\nIn Matonis' mind, all other suspects for the Olympics attack fell away. Matonis couldn't yet\nconnect the attack to any particular hacker group, but only one country would have been\ntargeting Ukraine, nearly a year before the Pyeongchang attack, using the same\ninfrastructure it would later use to hack the Olympics organizing committee—and it wasn't\nChina or North Korea.\n\nStrangely, other infected documents in the collection Matonis had unearthed seemed to\ntarget victims in the Russian business and real estate world. Had a team of Russian hackers\nbeen tasked with spying on some Russian oligarch on behalf of their intelligence\ntaskmasters? Were they engaged in profit-focused cybercrime as a side gig?\n\nRegardless, Matonis felt that he was on his way to finally, definitively cutting through the\nOlympics cyberattack's false flags to reveal its true origin: the Kremlin.\n\nIllustration: Joan Wong\n\n**After Matonis had made those first, thrilling connections between Olympic Destroyer and a**\nvery familiar set of Russian hacking victims, he sensed he had explored beyond the part of\nOlympic Destroyer that its creators had intended for researchers to see—that he was now\npeering behind its curtain of false flags. He wanted to find out how much further he could go\ntoward uncovering those hackers' full identities. So he told his boss that he wouldn't be\ncoming into the FireEye office for the foreseeable future. For the next three weeks, he barely\n\n\n-----\n\nleft his bunker apartment. He worked on his laptop from the same folding chair, with his back\nto the only window in his home that allowed in sunlight, poring over every data point that\nmight reveal the next cluster of the hackers' targets.\n\nA pre-internet-era detective might start a rudimentary search for a person by consulting\nphone books. Matonis started digging into the online equivalent, the directory of the web's\nglobal network known as the Domain Name System. DNS servers translate human-readable\ndomains like facebook.com into the machine-readable IP addresses that describe the\nlocation of a networked computer that runs that site or service, like 69.63.176.13.\n\nMatonis began painstakingly checking every IP address his hackers had used as a\ncommand and control server in their campaign of malicious Word document phishing; he\nwanted to see what domains those IP addresses had hosted. Since those domain names\ncan move from machine to machine, he also used a reverse-lookup tool to flip the search—\nchecking every name to see what other IP addresses had hosted it. He created a set of\ntreelike maps connecting dozens of IP addresses and domain names linked to the Olympics\nattack. And far down the branch of one tree, a string of characters lit up like neon in Matonis'\nmind: account-loginserv.com.\n\nA photographic memory can come in handy for an intelligence analyst. As soon as Matonis\nsaw the account-loginserv.com domain, he instantly knew he had seen it nearly a year earlier\nin an FBI “flash”—a short alert sent out to US cybersecurity practitioners and potential\nvictims. This one had offered a new detail about the hackers who, in 2016, had reportedly\nbreached the Arizona and Illinois state boards of elections. These had been some of the\nmost aggressive elements of Russia's meddling in US elections: Election officials had\nwarned in 2016 that, beyond stealing and leaking emails from Democratic Party targets,\nRussian hackers had broken into the two states' voter rolls, accessing computers that held\nthousands of Americans' personal data with unknown intentions. According to the FBI flash\nalert Matonis had seen, the same intruders had also spoofed emails from a voting\ntechnology company, later reported to be the Tallahassee, Florida-based firm VR Systems, in\nan attempt to trick more election-related victims into giving up their passwords.\n\nMatonis had found a fingerprint that linked the Olympics attackers back to a hacking\noperation that directly targeted the 2016 US election.\n\nMatonis drew up a jumbled map of the connections on a piece of paper that he slapped onto\nhis refrigerator with an Elvis magnet, and marveled at what he'd found. Based on the FBI\nalert—and Matonis told me he confirmed the connection with another human source he\ndeclined to reveal—the fake VR Systems emails were part of a phishing campaign that\nseemed to have also used a spoofed login page at the account-loginserv.com domain he'd\nfound in his Olympic Destroyer map. At the end of his long chain of internet-address\nconnections, Matonis had found a fingerprint that linked the Olympics attackers back to a\n\n\n-----\n\nhacking operation that directly targeted the 2016 US election. Not only had he solved the\nwhodunit of Olympic Destroyer's origin, he'd gone further, showing that the culprit had been\nimplicated in the most notorious hacking campaign ever to hit the American political system.\n\nMatonis had, since he was a teenager, been a motorcycle fan. When he was just barely old\nenough to ride one legally, he had scraped together enough money to buy a 1975 Honda\nCB750. Then one day a friend let him try riding his 2001 Harley-Davidson with an 1100 EVO\nengine. In three seconds, he was flying along a country road in upstate New York at 65 miles\nan hour, simultaneously fearing for his life and laughing uncontrollably.\n\nWhen Matonis had finally outsmarted the most deceptive malware in history, he says he felt\nthat same feeling, a rush that he could only compare to taking off on that Harley-Davidson in\nfirst gear. He sat alone in his DC apartment, staring at his screen and laughing.\n\n**By the time Matonis had drawn those connections, the US government had already drawn**\nits own. The NSA and CIA, after all, have access to human spies and hacking abilities that\nno private-sector cybersecurity firm can rival. In late February, while Matonis was still holed\nup in his basement apartment, two unnamed intelligence officials told _[The Washington Post](https://www.washingtonpost.com/world/national-security/russian-spies-hacked-the-olympics-and-tried-to-make-it-look-like-north-korea-did-it-us-officials-say/2018/02/24/44b5468e-18f2-11e8-92c9-376b4fe57ff7_story.html)_\nthat the Olympics cyberattack had been carried out by Russia and that it had sought to frame\nNorth Korea. The anonymous officials went further, blaming the attack specifically on\nRussia's military intelligence agency, the GRU—the same agency that had masterminded the\ninterference in the 2016 US election and the blackout attacks in Ukraine, and had unleashed\nNotPetya's devastation.\n\nBut as with most public pronouncements from inside the black box of the US intelligence\napparatus, there was no way to check the government's work. Neither Matonis nor anyone\nelse in media or cybersecurity research was privy to the trail the agencies had followed.\n\nA set of US government findings that were far more useful and interesting to Matonis came\nmonths after his basement detective work. On July 13, 2018, special counsel Robert Mueller\n[unsealed an indictment against 12 GRU hackers for engaging in election interference, laying](https://www.justice.gov/file/1080281/download)\nout the evidence that they'd hacked the DNC and the Clinton campaign; the indictment even\nincluded details like the servers they'd used and the terms they'd typed into a search engine.\n\nDeep in the 29-page indictment, Matonis read a description of the alleged activities of one\nGRU hacker named Anatoliy Sergeyevich Kovalev. Along with two other agents, Kovalev\nwas named as a member of GRU Unit 74455, based in the northern Moscow suburb of\nKhimki in a 20-story building known as “the Tower.”\n\nThe indictment stated that Unit 74455 had provided backend servers for the GRU's intrusions\ninto the DNC and the Clinton campaign. But more surprisingly, the indictment added that the\ngroup had “assisted in” the operation to leak the emails stolen in those operations. Unit\n\n\n-----\n\n74455, the charges stated, had helped to set up DCLeaks.com and even Guccifer 2.0, the\nfake Romanian hacker persona that had claimed credit for the intrusions and given the\nDemocrats' stolen emails to WikiLeaks.\n\nKovalev, listed as 26 years old, was also accused of breaching one state's board of elections\nand stealing the personal information of some 500,000 voters. Later, he allegedly breached a\nvoting systems company and then impersonated its emails in an attempt to hack voting\nofficials in Florida with spoofed messages laced with malware. An FBI wanted poster for\nKovalev showed a picture of a blue-eyed man with a slight smile and close-cropped, blond\nhair.\n\nThough the indictment didn't say it explicitly, Kovalev's charges described exactly the\nactivities outlined in the FBI flash alert that Matonis had linked to the Olympic Destroyer\nattack. Despite all of the malware's unprecedented deceptions and misdirections, Matonis\ncould now tie Olympic Destroyer to a specific GRU unit, working at 22 Kirova Street in\nKhimki, Moscow, a tower of steel and mirrored glass on the western bank of the Moscow\nCanal.\n\n**A few months after Matonis shared those connections with me, in late November of 2018, I**\nstood on a snow-covered path that wound along that frozen waterway on the outskirts of\nMoscow, staring up at the Tower.\n\nI had, by then, been following the hackers known as Sandworm for two full years, and I was\nin the final stages of [writing a book that investigated the remarkable arc of their attacks. I had](https://www.amazon.com/Sandworm-Cyberwar-Kremlins-Dangerous-Hackers/dp/0385544405)\ntraveled to Ukraine to interview the utility engineers who'd twice watched their power grids'\ncircuit breakers be flipped open by unseen hands. I'd flown to Copenhagen to speak with\nsources at the shipping firm Maersk who whispered to me about the chaos that had unfolded\nwhen NotPetya paralyzed 17 of their terminals at ports around the globe, instantly shutting\ndown the world's largest shipping conglomerate. And I'd sat with analysts from the Slovakian\ncybersecurity firm ESET in their office in Bratislava as they broke down their evidence that\ntied all of those attacks to a single group of hackers.\n\nBeyond the connections in Matonis' branching chart and in the Mueller report that pinned the\nOlympics attack on the GRU, Matonis had shared with me other details that loosely tied\nthose hackers directly to Sandworm's earlier attacks. In some cases, they had placed\ncommand and control servers in data centers run by two of the same companies, Fortunix\nNetworks and Global Layer, that had hosted servers used to trigger Ukraine's 2015 blackout\nand later the 2017 NotPetya worm. Matonis argued that those thin clues, on top of the vastly\nstronger case that all of those attacks were carried out by the GRU, suggested that\nSandworm was, in fact, GRU Unit 74455. Which would put them in the building looming over\nme that snowy day in Moscow.\n\n\n-----\n\nStanding there in the shadow of that opaque, reflective tower, I didn t know exactly what I\nhoped to accomplish. There was no guarantee that Sandworm's hackers were inside—they\nmay have just as easily been split between that Khimki building and another GRU address\nnamed in the Mueller indictment, at 20 Komsomolskiy Prospekt, a building in central Moscow\nthat I'd walked by that morning on my way to the train.\n\nThe Tower, of course, wasn't marked as a GRU facility. It was surrounded by an iron fence\nand surveillance cameras, with a sign at its gate that read GLAVNOYE UPRAVLENIYE\nOBUSTROYSTVA VOYSK—roughly, “General Directorate for the Arrangement of Troops.” I\nguessed that if I dared ask the guard at that gate if I could speak with someone from GRU\nUnit 74455, I was likely to end up detained in a room where I would be asked hard questions\nby Russian government officials, rather than the other way around.\n\nThis, I realized, might be the closest I had ever stood to Sandworm's hackers, and yet I could\nget no closer. A security guard appeared on the edge of the parking lot above me, looking\nout from within the Tower's fence—whether watching me or taking a smoke break, I couldn't\ntell. It was time for me to leave.\n\nI walked north along the Moscow Canal, away from the Tower, and through the hush of the\nneighborhood's snow-padded parks and pathways to the nearby train station. On the train\nback to the city center, I glimpsed the glass building one last time, from the other side of the\nfrozen water, before it was swallowed up in the Moscow skyline.\n\n**In early April of this year, I received an email via my Korean translator from Sang-jin Oh,**\nthe Korean official who led the response to Olympic Destroyer on the ground in\nPyeongchang. He repeated what he'd said all along—that he would never discuss who might\nbe responsible for the Olympics attack. He also noted that he and I wouldn't speak again:\nHe'd moved on to a position in South Korea's Blue House, the office of the president, and\nwasn't authorized to take interviews. But in our final phone conversation months earlier, Oh's\nvoice had still smoldered with anger when he recalled the opening ceremony and the 12\nhours he'd spent desperately working to avert disaster.\n\n“It still makes me furious that, without any clear purpose, someone hacked this event,” he'd\nsaid. “It would have been a huge black mark on these games of peace. I can only hope that\nthe international community can figure out a way that this will never happen again.”\n\nEven now, Russia's attack on the Olympics still haunts cyberwar wonks. (Russia's foreign\nministry didn't respond to multiple requests for comment from WIRED.) Yes, the US\ngovernment and the cybersecurity industry eventually solved the puzzle, after some initial\nfalse starts and confusion. But the attack set a new bar for deception, one that might still\nprove to have disastrous consequences when its tricks are repeated or evolve further, says\nJason Healey, a cyberconflict-focused researcher at the Columbia School for International\nand Public Affairs\n\n\n-----\n\nOlympic Destroyer was the first time someone used false flags of that kind of sophistication\nin a significant, national-security-relevant attack,” Healey says. “It's a harbinger of what the\nconflicts of the future might look like.”\n\n“If you can't imagine this with US and Russia, imagine it with India and Pakistan, or China\nand Taiwan, where a false flag provokes a much stronger response than intended.”\n\nHealey, who worked in the George W. Bush White House as director for cyber infrastructure\nprotection, says he has no doubt that US intelligence agencies can see through deceptive\nclues that muddy attribution. He's more worried about other countries where a misattributed\ncyberattack could have lasting consequences. “For the folks that can't afford CrowdStrike\nand FireEye, for the vast bulk of nations, attribution is still an issue,” Healey says. “If you\ncan't imagine this with US and Russia, imagine it with India and Pakistan, or China and\nTaiwan, where a false flag provokes a much stronger response than even its authors\nintended, in a way that leaves the world looking very different afterwards.”\n\nBut false flags [work here in the US, too, argues John Hultquist, the director of intelligence](https://www.wired.com/story/russia-false-flag-hacks/)\nanalysis at FireEye and Matonis' former boss before Matonis left the firm in July. Look no\n[further, Hultquist says, than the half of Americans—or 73 percent of registered Republicans](https://big.assets.huffingtonpost.com/athena/files/2019/02/13/5c6446b4e4b08da0ec8141f3.pdf)\n—who refuse to accept that Russia hacked the DNC or the Clinton campaign.\n\nAs the 2020 election approaches, Olympic Destroyer shows that Russia has only advanced\nits deception techniques—graduating from flimsy cover stories to the most sophisticated\nplanted digital fingerprints ever seen. And if they can fool even a few researchers or\nreporters, they can sow even more of the public confusion that misled the American\nelectorate in 2016. “The question is one of audience,” Hultquist says. “The problem is that\nthe US government may never say a thing, and within 24 hours, the damage is done. The\npublic was the audience in the first place.”\n\nThe GRU hackers known as Sandworm, meanwhile, are still out there. And Olympic\nDestroyer suggests they've been escalating not only their wanton acts of disruption but also\ntheir deception techniques. After years of crossing one red line after another, their next move\nis impossible to predict. But when those hackers do strike again, they may appear in a form\nwe don't even recognize.\n\n_Source photos: Getty Images; Maxim Shemetov/Reuters (building)_\n\n_From the book_ **[SANDWORM, by Andy Greenberg, to be published on November 5, 2019, by](https://www.amazon.com/Sandworm-Cyberwar-Kremlins-Dangerous-Hackers/dp/0385544405)**\n_Doubleday, an imprint of the Knopf Doubleday Group, a division of Penguin Random House_\n_LLC. Copyright © 2019 by Andy Greenberg. Greenberg is a senior writer for WIRED._\n\n_[This article appears in the November issue. Subscribe now.](https://subscribe.wired.com/subscribe/splits/wired/WIR_Edit_Hardcoded?source=ArticleEnd_CMlink)_\n\n\n-----\n\n_Let us know what you think about this article. Submit a letter to the editor at_\n_[mail@wired.com.](http://10.10.0.46/mailto:mail@wired.com)_\n\n_When you buy something using the retail links in our stories, we may earn a small affiliate_\n_[commission. Read more about how this works.](https://www.wired.com/2015/11/affiliate-link-policy/)_\n\nMore Great WIRED Stories\n\n[WIRED25: Stories of people who are racing to save us](https://www.wired.com/story/wired25-stories-people-racing-to-save-us/?itm_campaign=BottomRelatedStories_Sections_1)\n[Massive, AI-powered robots are 3D-printing entire rockets](https://www.wired.com/story/massive-ai-powered-robots-are-3d-printing-entire-rockets/?itm_campaign=BottomRelatedStories_Sections_1)\n_[Ripper—the inside story of the egregiously bad videogame](https://www.wired.com/story/ripper/?itm_campaign=BottomRelatedStories_Sections_1)_\n[USB-C has finally come into its own](https://www.wired.com/story/usb-c-surface-pro-kindle-ps5-iphone-standard/?itm_campaign=BottomRelatedStories_Sections_1)\n[Planting tiny spy chips in hardware can cost as little as $200](https://www.wired.com/story/plant-spy-chips-hardware-supermicro-cheap-proof-of-concept/?itm_campaign=BottomRelatedStories_Sections_1)\n👁 Prepare for the [deepfake era of video; plus, check out the](https://www.wired.com/story/prepare-deepfake-era-web-video/?itm_campaign=BottomRelatedStories_Sections_1) [latest news on AI](https://www.wired.com/category/business/artificial-intelligence/?itm_campaign=BottomRelatedStories_Sections_1)\nJ Want the best tools to get healthy? Check out our Gear team’s picks for the best\nfitness trackers, [running gear (including shoes and](https://www.wired.com/gallery/best-running-gear/?itm_campaign=BottomRelatedStories) [socks), and](https://www.wired.com/gallery/best-running-socks/?itm_campaign=BottomRelatedStories) [best headphones.](https://www.wired.com/gallery/best-headphones-under-100/?itm_campaign=BottomRelatedStories)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-17 - The Untold Story of the 2018 Olympics Cyberattack, the Most Deceptive Hack in History.pdf"
    ],
    "report_names": [
        "2019-10-17 - The Untold Story of the 2018 Olympics Cyberattack, the Most Deceptive Hack in History.pdf"
    ],
    "threat_actors": [
        {
            "id": "ed4c7e37-461f-40f1-ad43-6ad7e21b32bc",
            "created_at": "2022-10-25T16:07:24.303712Z",
            "updated_at": "2025-03-27T02:02:10.165915Z",
            "deleted_at": null,
            "main_name": "TaskMasters",
            "aliases": [],
            "source_name": "ETDA:TaskMasters",
            "tools": [
                "404-Input-shell web shell",
                "ASPXSpy",
                "ASPXTool",
                "AtNow",
                "DbxDump Utility",
                "HTran",
                "HUC Packet Transmit Tool",
                "Mimikatz",
                "NBTscan",
                "PortScan",
                "ProcDump",
                "PsExec",
                "PsList",
                "RemShell",
                "RemShell Downloader",
                "gsecdump",
                "jsp File browser",
                "nbtscan",
                "pwdump",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4ae78ca3-8bc8-4d67-9df1-a85df250a8a0",
            "created_at": "2024-10-08T02:00:04.469211Z",
            "updated_at": "2025-03-27T02:00:03.437849Z",
            "deleted_at": null,
            "main_name": "TaskMasters",
            "aliases": [
                "BlueTraveller"
            ],
            "source_name": "MISPGALAXY:TaskMasters",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536185,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653703553,
    "ts_modification_date": 1653703553,
    "files": {
        "pdf": "https://archive.orkl.eu/81c9d84f209ae6076b31d5d3e3873a8185ca877f.pdf",
        "text": "https://archive.orkl.eu/81c9d84f209ae6076b31d5d3e3873a8185ca877f.txt",
        "img": "https://archive.orkl.eu/81c9d84f209ae6076b31d5d3e3873a8185ca877f.jpg"
    }
}