{
    "id": "bf72e5b2-d81b-4407-a7fc-abd90b798c89",
    "created_at": "2023-01-12T15:06:23.948643Z",
    "updated_at": "2025-03-27T02:17:00.069974Z",
    "deleted_at": null,
    "sha1_hash": "669dfb147a873710ed364e8ecb3e9238bee3f889",
    "title": "2020-06-04 - COVID-19 and New Year greetings- an investigation into the tools and methods used by the Higaisa group",
    "authors": "",
    "file_creation_date": "2022-05-28T03:15:43Z",
    "file_modification_date": "2022-05-28T03:15:43Z",
    "file_size": 1409979,
    "plain_text": "# COVID-19 and New Year greetings: an investigation into the tools and methods used by the Higaisa group\n\n**[ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/covid-19-and-new-year-greetings-the-higaisa-group/](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/covid-19-and-new-year-greetings-the-higaisa-group/)**\n\nPositive Technologies\n\nPublished on 4 June 2020\n\nIn March 2020 specialists from the PT Expert Security Center conducted an analysis on the activities of the APT group Higaisa. This group\nwas [first studied by security analysts at Tencent in November 2019. In that analysis, Tencent specialists reached the conclusion that Higaisa](https://s.tencent.com/research/report/836.html)\nhas its origins in South Korea. The group, which is still active today, can be tracked all the way back to 2009. According to the Tencent\nanalysis, Higaisa's main targets have been government, public, and trade organizations in North Korea; however, they have also carried out\nattacks in China, Japan, Russia, Poland, and other nations.\n\nHigaisa distributes messages containing real news and information on current events to initially spread their malware. They have also used\nmessages containing seasonal greetings, which congratulate their recipients on holidays such as New Year, the Chinese Lantern Festival, and\nNorth Korean national holidays. In most cases the messages are written in English, implying that English-speaking countries could also be\ntargets.\n\nWith the recent prevalence of the coronavirus (COVID-19) pandemic, many APT groups, including Gamaredon, SongXY, TA428, Lazarus,\nKonni, and Winnti, have been using the topic of COVID-19 in their email distributions. Higaisa is no exception.\n\nThis article is an investigation into one of the malicious files created by Higaisa. The file was discovered by security experts on March 11 while\nconducting another study on information security threats. The file is also compared with earlier files, and observed changes are noted and\nanalyzed.\n\n## Object #1: File 20200308-sitrep-48-covid-19.pdf.lnk\n\n\n-----\n\nFigure 1. PDF document containing a World Health Organization (WHO) report\n\n### Stage 1. Shortcut\n\nThe malware originates from a file called 20200308-sitrep-48-covid-19.pdf.lnk, which is concealed as a PDF file.\n\nFigure 2. Contents of the LNK\n\nfile\nThe file is a .lnk shortcut with the icon of a PDF document. When opened, the command cmd.exe /c is executed with the following command\nstring (note: line breaks and spaces have been added for readability):\n\n\n-----\n\nFigure 3. The command string executed\n\nby the shortcut\nAs a result, copies of the shortcut and a file called C:\\Windows\\System32\\CertUtil.exe (under the name of msoia.exe) are placed into a\ntemporary folder. Instead of directly using the name CertUtil.exe, the file mask *ertu*.exe and the for command are used to conduct search,\nbypassing filename signatures.\n\nBy launching findstr.exe, the Base64-encoded payload at the end of the LNK file is retrieved and then decoded using CertUtil.exe (msioa.exe).\n\n### Stage 2. Archive\n\nThe decoding results in a CAB archive, which is unpacked into the same %tmp% folder and contains the following files:\n\n3UDBUTNY7YstRc.tmp (DLL, used for autorun)\n9sOXN6Ltf0afe7.js (installation script)\n486AULMsOPmf6W.tmp (a legitimate executable file used for autorun)\n[20200308-sitrep-48-covid-19.pdf (the original WHO report, used as bait)](https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200308-sitrep-48-covid-19.pdf)\ncSi1r0uywDNvDu.tmp (XSL; contains part of the installation code written in VBScript)\nMiZl5xsDRylf0W.tmp (installer payload)\n\nAfter the files have been retrieved, the malware moves to the next stage in the process of achieving persistence in the system, launching the\nfile 9sOXN6Ltf0afe7.js.\n\n### Stage 3. JS script. Part one.\n\nThe script is written as one line:\n\nFigure 4. A fragment of the code from\n\n9sOXN6Ltf0afe7.js\nIn effect, the script executes the following console commands:\n\nFigure 5. Console commands in 9sOXN6Ltf0afe7.js\nA folder with the name cscript.exe is created in the temporary folder called %tmp%. The original script interpreter, cscript.exe, is then copied\ninto this folder with the name msproof.exe. An XSL file by the name of WsmPty.xsl is copied in as well. This is what the XSL file looks like:\n\nFigure 6. A fragment\n\nof the code in WsmPty.xsl\nA legitimate script, %windir%\\System32\\winrm.vbs (a console tool for work with the Windows Remote Management API), is launched using the\ninterpreter. It is then passed the command get wmicimv2/Win32 Process?Handle=4 and the output format: format:pretty.\n\n\n-----\n\ne t s o at s spec ed, _bs s pu ed_ o t e d ecto y e e t e te p ete csc pt e e a d t e e _s_ _ty s a e ocated_\n_winrm.vbs is used to format the command output (regardless of whether it was successfully executed). This will then run the VBScript code_\nembedded in the file.\n\nThis method, [described by Matt Graeber in 2018, bypasses application whitelisting restrictions to run unauthorized code. There is one](https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404)\nessential condition for winrm.vbs to work—the string cscript.exe must be present in the path to the interpreter. This is why the folder that it is\ncopied into is created with this particular name.\n\n### Stage 4. XSL\n\nThe VBScript code that is launched contains a hex string and code that are responsible for decoding and executing the file. Here you can see\nthe code with all hex strings converted into bytes and deobfuscated variable names:\n\nFigure 7. Deobfuscated VBScript\n\ncode\nEssentially, what the code does is create a file called OFFICE12 in the user profile, as well as a shortcut called Accessories.lnk in the startup\ndirectory. The shortcut does not directly launch the payload, instead using the function FileProtocolHandler from the url.dll library:\n```\nC:\\Windows\\System32\\rundll32.exe C:\\Windows\\system32\\url.dll,FileProtocolHandler %UserProfile%\\OFFICE12\\MSOStyle.exe\n\n```\nAdditionally, a file called 2m7EBxdH3wHwBO.tmp is created in %tmp% via the function Write4D5A90. This file contains three bytes from the\nbeginning of an EXE file: 0x4D, 0x5A, 0x90.\n\n### Stage 3. JS script. Continuation\n\nOnce the VBScript in XSL has been run, console commands launched by the JS code continue to be executed. Three files are copied into the\nfolder OFFICE12 that was created in the user profile. Those files are:\n\nMSOSTYLE.EXE\nOINFO12.OCX\nWordcnvpxy.exe\n\nThe last file, which is the payload, is built from the three-byte introductory string created by VBScript and from MiZl5xsDRylf0W.tmp, which was\nunpacked earlier. The result is a valid .exe file.\n\nMSOSTYLE.EXE is a legitimate file from the Microsoft Office 2007 package. It is responsible for sideloading the dynamic link library\nOINFO12.OCX.\n\nOINFO12.OCX contains the code for executing the final payload:\n\n\n-----\n\nFigure 8. Launching Wordcnvpxy.exe in DllMain\n\nIt also contains code in exported functions that is not actually run (we suspect that this is part of an attempt to avoid detection in sandbox\nenvironments):\n\nFigure 9. The code of GetOfficeData() Figure 10. The code of\n\nDeleteOfficeData()\nThe last step in the script is to open the PDF file that was used as bait.\n\n### Wordcnvpxy.exe downloader\n\nThe payload is an application that creates a hidden window (the name of the class and the window is SK_Parasite).\n\nFigure 11.\n\nWindow creation and event processing loop in Wordcnvpxy.exe\nEssential functions are loaded dynamically. Base64 with the following non-standard alphabet is used to decode library names:\n_z2bqw7k90rJYALIQUxZK%sO=hd5C4piVMFlaRucWy31GTNH-mED8fnXtPvSojeB6g. Instead of using function names, their hashes are used,_\nusing [SuperFastHash algorithm.](http://www.azillionmonkeys.com/qed/hash.html)\n\n\n-----\n\nFigure 12. Dynamically loaded libraries\n\nThe main code is run in a separate thread: every 10 minutes, the application contacts the C&C server motivation[.]neighboring[.]site and\npasses it the computer's identifier in the User-Agent string. The identifier is a SuperFastHash of the system volume serial number and the\nname of the computer.\n\nFigure 13. Main downloader cycle\nThe response from the server is saved into a temporary file. If the response contains at least 10 bytes, it is decoded from Base64 and divided\ninto two segments separated by the symbol $. The first segment contains the RC4-encoded executable file, and the second contains its\nfilename without an extension.\n\nFigure 14. Processing the server response\n\nThe method used to construct a key for decoding the RC4 encryption is interesting. It is generated via a recurrent sequence that begins with\ntwo numbers (28 and 39), and every subsequent number equals the sum of the previous two, mod 255. The key consists of 64 bytes and\nbegins with the first sum in the sequence. The key is later expanded to 256 bytes (by looping) and is used in the standard RC4 algorithm.\n\n\n-----\n\nFigure 15. Generation of the RC4 key in Wordcnvpxy.exe\n\nThe executable file received from the server is saved in %TEMP% with the specified name and is then launched.\n\n## Object #2: 邀请函.doc (Invitation card.doc)\n\nThis is an RTF file containing a congratulatory statement:\n\nFigure\n\n16. Document with holiday greetings\nThe document was created using the popular builder 'Royal Road RTF' (also known as 8.t), which exploits the CVE-2018-0798 vulnerability in\n[Microsoft Equation Editor. This builder is not publicly accessible, but is widely used by Chinese APT groups, including TA428, Goblin Panda,](https://malpedia.caad.fkie.fraunhofer.de/details/win.8t_dropper)\nIceFog, and [SongXY. The name '8.t' originates from the fact that the malware creates a file called 8.t containing the encoded payload in a](https://www.ptsecurity.com/ww-en/analytics/cybersecurity-threatscape-q4-2017/)\ntemporary folder.\n\nExploitation results in the creation of a file called %APPDATA%\\microsoft\\word\\startup\\intel.wll. This file is a DLL dropper, which is loaded the\nnext time Microsoft Word is launched. Its payload consists of two files: %ALLUSERSPROFILE%\\TotalSecurity\\360ShellPro.exe and\n_%ALLUSERSPROFILE \\TotalSecurity\\utils\\FileSmasher.exe. The files are encoded using xor 0x1A._\n\n\n-----\n\nFigure 17. The main\n\nfunction in the intel.wll dropper (fragment)\nThe dropper achieves persistence in the system by creating a shortcut in the startup directory that launches\n_%ALLUSERSPROFILE%\\TotalSecurity\\360ShellPro.exe with key /func=5. This file is a modified component of the antivirus tool 360 Total_\nSecurity, and is used to transfer control to the downloader FileSmasher.exe via a method similar to DLL side-loading.\n\nThe legitimate 360ShellPro.exe file contains a number of relative paths to the executable file. The correct file is selected and launched\ndepending on the value of the argument /func=.\n\nFigure 18. File selection based on the func parameter\n\n### FileSmasher.exe downloader\n\nIn many ways, FileSmasher.exe resembles Wordcnvpxy.exe. It is also a windowed application (class name: NIS_K). However, in this case, the\nrelevant code is launched using a 10-minute timer, not a separate thread.\n\n\n-----\n\nFigure 19. Window creation,\n\ntimer set-up, and event processing loop in FileSmasher.exe\nDynamic DLL loading is not used (all imports are static) and the address of the C&C server is restored using a similar RC4 decoding function\n(instead of decoding from Base64 with a nonstandard alphabet). However, the initial elements in the series used to generate the key have\ndifferent values (8 and 5), and the generative algorithm is fully repeated.\n\nFigure 20. RC4 key generation in FileSmasher.exe\n\nThe CRC32 from the system volume serial number is used as an infected machine identifier. It is passed explicitly as a GET parameter. The\nfollowing is the full address that the downloader uses to access the server: http://walker[.]shopbopstar[.]top/blog/index.php?ei={32 random\n_chars}&ti={volume serial CRC32}_\n\nFigure 21. Construction of a URL to\n\naccess the monitoring server, from FileSmasher.exe\nThe loading algorithm is practically identical:\n\nThe server response is saved in a temporary file and is processed only if it contains at least 10 bytes.\nIn contrast to Wordcnvpxy.exe, there is no Base64 decoding.\nThe response is divided into two parts using an ampersand (&) instead of a dollar sign ($).\nThe first segment is also an executable file encrypted with RC4, and the second part is its name without an extension.\nThe file is decoded using the same function that is responsible for decoding the address (the RC4 key parameters are 8 and 5).\n\nThe loaded file is launched using CreateProcess.\n\nIt is worth noting that the resource files for Wordcnvpxy.exe and FileSmasher.exe include a dialogue window, \"About,\" containing the\napplication's name and copyright information.\n\n\n-----\n\nFigure 22. The\n\n\"About\" dialogue window from the resources included in FileSmasher.exe\nThis window as well as other resources (Menu, Accelerators) are generated by Visual Studio when the project is created. In the case of\nWordcnvpxy.exe, the application name indicated in the dialogue window matches the name of the window's class (SK_Parasite). However, this\nis not the case for FileSmasher.exe. Here, the application is called AttackBot, and in its case we see the abbreviation NIS, which we saw\nearlier in the name of the window class (NIS_K).\n\nExperts at Tencent drew a connection between Higaisa and the Republic of Korea and identified its main targets as North Korean government\nand trade organizations. This suggests that NIS could stand for National Intelligence Service (The National Intelligence Service of the Republic\n[of Korea). SK_Parasite could be a reference to the South Korean film Parasite (released in 2019). Alone, these data are insufficient to draw](https://en.wikipedia.org/wiki/Parasite_(2019_film))\nfirm conclusions; however, they can be seen as circumstantial evidence for a connection with South Korea.\n\n### Related objects\n\nThe contents of the initial document (New Year greetings) and the date the file was created (22.12.2019) specify the period during which it was\nused. However, it is not the only object of its kind. Analysts at Tencent [identified another distribution of malicious files during the same period.](https://s.tencent.com/research/report/895.html)\nIn that case the filenames were Happy-new-year-2020.scr and 2020-New-Year-Wishes-For-You.scr. These files are executable and use a\ncongratulatory JPG file as bait. The image is dropped from an executable file and opened in the default viewer.\n\n\n-----\n\nFigure 23. The image contained in Happy-new-year-2020.scr\n\nFigure 24. The image contained in 2020\nNew-Year-Wishes-For-You.scr\nOther than the exploitation of the CVE-2018-0798 vulnerability, the structure of these threats is effectively identical to the RTF document. SCR\nfiles are droppers whose payload is decrypted using xor 0x1A and unpacked into the subdirectory of %ALLUSERSPROFILE%.\n\n\n-----\n\nFigure 25. The main function in 2020-New-Year\nWishes-For-You.scr dropper (fragment)\nThe payload consists of a legitimate executable file (rekeywiz.exe from Windows 7 is used) and the DLL downloader Duser.dll. The legitimate\nfile is added to startup using a shortcut.\n\nThe downloader decrypts the URL using RC4 (the initial values are 8, 5 and 9, 5) and adds a random string and the CRC32 computer identifier\ninto the GET parameter.\n\nFigure 26. Construction of a URL to access the\n\ncontrol server, from Duser.dll (2020-New-Year-Wishes-For-You.scr dropper)\nThe downloader instance unpacked from 2020-New-Year-Wishes-For-You.scr to establish a connection with the C&C server uses a statically\nlinked libcurl library. The other instance uses statically imported functions from the winhttp.dll library, just like FileSmasher.exe.\n\nThe server is accessed at the following addresses: http://adobeinfo[.]shopbopstar[.]top/notice/index.php and\n_http://petuity[.]shopbopstar[.]top/research/index.php._\n\nIn both cases data is received from the server in the same format as in FileSmasher.exe.\n\nRegardless of the fact that neither of the droppers that we have described actually create any windows, they do contain a standard set of\nwindow resources, including the \"About\" dialogue window. The strings \"K_NIS\" and \"KISA\" are used as application names.\n\n## C&C server responses\n\nTwo types of components were used as the payloads distributed by the C&C server:\n\n\n-----\n\ne syste o at o co ecto ( oStea e ), c esse t a y p o des t e u ct o o u g t e co so e co a d syste _o &_\n_ipconfig -all & tasklist & net view & dir c:\\ & dir c:\\users\\ & dir d:\\ & dir e:\\ and relays the response to the command server._\nGh0st RAT in a variety of modified forms, particularly with all essential functionality implemented in DLL plug-ins loaded from the C&C\nserver.\n\nThese instances of Gh0st RAT are interesting when compared with the publicly accessible source code, as they implement a non-standard\nencryption of incoming and outgoing data. In packets containing less than 10 payload bytes (not including the header), the first 10 bytes are\nprocessed with a 0x12 xor key. The bytes 0x0 and 0x12 are left unchanged. Data are compressed with LZO instead of zlib.\n\nFigure 27. Decompiled code of the function\n\nCClientSocket::OnRead\nIn addition, the m_bPacketFlag field (the signature of packets sent to the command sever) is initialized with a pseudorandom value calculated\nusing the value returned from calling GetTickCount(). In the original code, the field is equal to Gh0st.\n\nFigure 28. Initialization of the field CClientSocket::m_bPacketFlag\n\n## Conclusion\n\nThe results of our study demonstrate how the malicious objects used by the Higaisa group have evolved over time. Beginning with a simple\ndistribution of executable files, they shifted towards utilizing exploits and complex multi-stage threats. However, the structure of their tools\n(such as droppers and downloaders) remained largely unchanged. To deter detection, the attackers modified details such as the control server\nURL, RC4 key parameters, the legitimate files used for DLL side-loading, and the libraries used for HTTP interaction.\n\n**Author: Alexey Zakharov, Positive Technologies**\n\n## IOCs\n\n**Filename** **MD5** **SHA-1** **SHA-256**\n\n\n20200308-sitrep-48covid-19.pdf.lnk\n\n\n21a51a834372ab11fba72fb865d6830e 9ceb6e0e4ad0a2c03751d0563a82a79ebb94ec95 95489af84596a21b6fcc\n\n\noGhPGUDC03tURV.tmp 37f78b1ad43959a788162f560bdc9c79 992d530d4bb35fb8dbdfb690740ead6e0fa974ec f74199f59533fbbe57f0b\n\nOINFO12.OCX 83d04f21515c7e6316f9cd0bb393a118 e00b982a14835dae781bbbe06055d7d18acc6eb0 a49133ed68bebb66412\n\n9sOXN6Ltf0afe7.js 4f8ff5e70647dbc5d91326346c393729 2fd4eb78e53af6a5b210943ca8f0e521bb567afb 70b8397f87e4a0d235d\n\nMSOSTYLE.EXE 371e896d818784934bd1456296b99cbe 88f23b0913ef5f94cd888605504e1e54c3a6e48f 604679789c46a01aa32\n\n\n20200308-sitrep-48covid-19.pdf\n\n\nfaf5ef01f4a9bf2aba7ede67dcc5a2d4 4e0c1a05360c6bebf903a708acf6792b13f43870 2dd886cc041ea6e5e80\n\n\ncSi1r0uywDNvDu.tmp eefeb76d26338e09958aae5d81479178 c400e10a8f2b5b62f919033e2db0a1f99b1a3c38 9d52d8f10673518cb9f1\n\nMiZl5xsDRylf0W.tmp c1d8966fa1bd7aee41b2c4ad731407d3 6e7e3277801669f3053bf364ae6be89f00017c89 b578a237587054f351f7\n\n\n-----\n\n**Filename** **MD5** **SHA-1** **SHA-256**\n\nWordcnvpxy.exe fd648c3b7495abbe86b850587e2e5431 d0e0d641f3a063fb02c7f862ea8586312af5fa2e 002c9e0578a8b76f626e\n\n**Filename** **MD5** **SHA-1** **SHA-256**\n\n邀请函.doc 2123bf482c9c80cb1896ff9288ad7d60 ea02db9b92cbf1d243b502d130aa2dd6c98637d2 500b6037ddb5efff0dd91f75b22c\n\nintel.wll 59a55c7bbc0ee488ec9e2cf50b792a56 a29ce0331015f2a3e87fd7fe1ce9dae228808b59 1b978324df504451c2a3430e32d\n\n360ShellPro.exe d5e42cc18906f09d5bab62df45b5fcf6 46833928f75db90220451e026997d039730906fa 1acd3cbc83dd4153f07b869b314\n\nFileSmasher.exe ea628fef3b547a1476d915963415e64c 07dbfaa430a201ce81f5079dd1e48379fac27177 f2c60274e625bcb051909797b35\n\nmotivation[.]neighboring[.]site\n\nwalker[.]shopbopstar[.]top\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-04 - COVID-19 and New Year greetings- an investigation into the tools and methods used by the Higaisa group.pdf"
    ],
    "report_names": [
        "2020-06-04 - COVID-19 and New Year greetings- an investigation into the tools and methods used by the Higaisa group.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d9dfc61-6138-497a-b9da-33885539f19c",
            "created_at": "2022-10-25T16:07:23.720008Z",
            "updated_at": "2025-03-27T02:02:09.944484Z",
            "deleted_at": null,
            "main_name": "Icefog",
            "aliases": [
                "ATK 23",
                "Dagger Panda",
                "Icefog",
                "Red Wendigo"
            ],
            "source_name": "ETDA:Icefog",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Dagger Three",
                "Fucobha",
                "Icefog",
                "Javafog",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43c8747-c898-448a-88a9-76bff88e91b5",
            "created_at": "2024-02-02T02:00:04.058535Z",
            "updated_at": "2025-03-27T02:00:03.302832Z",
            "deleted_at": null,
            "main_name": "Opal Sleet",
            "aliases": [
                "OSMIUM",
                "Konni",
                "Vedalia"
            ],
            "source_name": "MISPGALAXY:Opal Sleet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b9458777-d970-4e89-b2d2-e532140a390f",
            "created_at": "2024-05-01T02:03:08.140328Z",
            "updated_at": "2025-03-27T02:05:17.41728Z",
            "deleted_at": null,
            "main_name": "NICKEL JUNIPER",
            "aliases": [
                "OSMIUM ",
                "Opal Sleet ",
                "Konni"
            ],
            "source_name": "Secureworks:NICKEL JUNIPER",
            "tools": [
                "KONNI"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e6c64ba5-12e1-4f04-97d5-077d83da95e1",
            "created_at": "2024-10-08T02:00:04.466964Z",
            "updated_at": "2025-03-27T02:00:03.436873Z",
            "deleted_at": null,
            "main_name": "SongXY",
            "aliases": [],
            "source_name": "MISPGALAXY:SongXY",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2c7ecb0e-337c-478f-95d4-7dbe9ba44c39",
            "created_at": "2022-10-25T16:07:23.690871Z",
            "updated_at": "2025-03-27T02:02:09.921431Z",
            "deleted_at": null,
            "main_name": "Goblin Panda",
            "aliases": [
                "1937CN",
                "Conimes",
                "Cycldek",
                "Goblin Panda"
            ],
            "source_name": "ETDA:Goblin Panda",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "BackDoor-FBZT!52D84425CDF2",
                "BlueCore",
                "BrowsingHistoryView",
                "ChromePass",
                "CoreLoader",
                "Custom HDoor",
                "Destroy RAT",
                "DestroyRAT",
                "DropPhone",
                "FoundCore",
                "HDoor",
                "HTTPTunnel",
                "JsonCookies",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NBTscan",
                "NewCore RAT",
                "PlugX",
                "ProcDump",
                "PsExec",
                "QCRat",
                "RainyDay",
                "RedCore",
                "RedDelta",
                "RoyalRoad",
                "Sisfader",
                "Sisfader RAT",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Win32.Staser.ytq",
                "USBCulprit",
                "Win32/Zegost.BW",
                "Xamtrav",
                "ZeGhost",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7d553b83-a7b2-431f-9bc9-08da59f3c4ea",
            "created_at": "2023-01-06T13:46:39.444946Z",
            "updated_at": "2025-03-27T02:00:03.093712Z",
            "deleted_at": null,
            "main_name": "GOBLIN PANDA",
            "aliases": [
                "Conimes",
                "Cycldek"
            ],
            "source_name": "MISPGALAXY:GOBLIN PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535983,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653707743,
    "ts_modification_date": 1653707743,
    "files": {
        "pdf": "https://archive.orkl.eu/669dfb147a873710ed364e8ecb3e9238bee3f889.pdf",
        "text": "https://archive.orkl.eu/669dfb147a873710ed364e8ecb3e9238bee3f889.txt",
        "img": "https://archive.orkl.eu/669dfb147a873710ed364e8ecb3e9238bee3f889.jpg"
    }
}