{
    "id": "bf727d8c-cf5a-4d8a-8116-a3f2e2542763",
    "created_at": "2023-01-12T15:00:21.554961Z",
    "updated_at": "2025-03-27T02:16:28.736693Z",
    "deleted_at": null,
    "sha1_hash": "37eb8f7b4eac9900280883f329a70aa03d167c60",
    "title": "2020-04-28 - Hiding in plain sight- PhantomLance walks into a market",
    "authors": "",
    "file_creation_date": "2022-05-28T00:42:03Z",
    "file_modification_date": "2022-05-28T00:42:03Z",
    "file_size": 1658971,
    "plain_text": "# Hiding in plain sight: PhantomLance walks into a market\n\n**securelist.com/apt-phantomlance/96772/**\n\nAuthors\n\nAlexey Firsh\n\nLev Pikman\n\nIn July 2019, Dr. Web [reported about a backdoor trojan in Google Play, which appeared to be sophisticated and unlike common malware often](https://news.drweb.com/show/?i=13349&c=0&p=0)\nuploaded for stealing victims’ money or displaying ads. So, we conducted an inquiry of our own, discovering a long-term campaign, which we\ndubbed “PhantomLance”, its earliest registered domain dating back to December 2015. We found dozens of related samples that had been\nappearing in the wild since 2016 and had been deployed in various application marketplaces including Google Play. One of the latest samples\nwas published on the official Android market on November 6, 2019. We informed Google of the malware, and it was removed from the market\nshortly after.\n\n\n-----\n\n**_The latest example of spyware in Google Play disguised as a browser cleaner_**\n\nDuring our investigation, we discovered various overlaps with reported OceanLotus APT campaigns. Thus, we found multiple code similarities\nwith the previous Android campaign, as well as macOS backdoors, infrastructure overlaps with Windows backdoors and a few cross-platform\nresemblances.\n\nBesides the attribution details, this document describes the actors’ spreading strategy, their techniques for bypassing app market filters,\nmalware version diversity and the latest sample deployed in 2020, which uses Firebase to decrypt the malicious payload. We also found out\n[that Blackberry Cylance research team investigated this activity.](https://threatvector.cylance.com/en_us/home/mobile-malware-and-apt-espionage-prolific-pervasive-and-cross-platform.html)\n\nOur report is broken down into several sections.\n\n1. Malware versions – technical description of versions found, their features and relationships between them.\n2. Spread – information on specific tactics used by the threat actors for distributing their malware.\n3. Infrastructure – further details on uncovered infrastructure pieces as well as overlaps found.\n4. Victimology – thoughts on the actors’ interests in choosing their targets.\n5. Overlaps with previous campaigns – details of similarities with all related campaigns that we have identified.\n\nMore information on PhantomLance is available to customers of Kaspersky Intelligence Reporting. For more information, contact\n[intelreports@kaspersky.com](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n\n## Malware versions\n\nFor the purposes of the research, we divided samples we found into a series of “versions” based on technical complexity: from the basic\nVersion 1 to the highly sophisticated Version 3. Note that they do not fully correlate with the chronological order of their appearance ITW: for\nexample, we observed Version 1 samples in late 2019 and in 2017, the year that we also saw Version 3.\n\n\n-----\n\nu ct o a ty o a sa p es a e s a t e a pu pose o spy a e as to gat e se s t e o at o e t e bas c u ct o a ty as ot\nvery broad, and included geolocation, call logs, contact access and SMS access, the application could also gather a list of installed\napplications, as well as device information, such as model and OS version. Furthermore, the threat actor was able to download and execute\nvarious malicious payloads, thus, adapting the payload that would be suitable to the specific device environment, such as Android version and\ninstalled apps. This way the actor is able to avoid overloading the application with unnecessary features and at the same time gather\ninformation needed.\n\n### Version 1\n\nWe attribute the latest Google Play sample (MD5: 2e06bbc26611305b28b40349a600f95c) to this version. This is a clear payload, and unlike\nthe other versions, it does not drop an additional executable file. Our main theory about the reasons for all these versioning maneuvers is that\nthe attackers are trying to use diverse techniques to achieve their key goal, to bypass the official Google marketplace filters. And achieve it\nthey did, as even this version passed Google’s filters and was uploaded to Google Play Store in 2019 (see Spreading for details).\n\nNo suspicious permissions are mentioned in the manifest file; instead, they are requested dynamically and hidden inside the dex executable.\nThis seems to be a further attempt at circumventing security filtering. In addition to that, there is a feature that we have not seen before: if the\nroot privileges are accessible on the device, the malware can use a reflection call to the undocumented API function “setUidMode” to get\npermissions it needs without user involvement.\n\nNote that this trick only works with Android SDK version 19 or higher.\n\nMost of the aforementioned operations naturally require root access, but we believe that the root exploit may be delivered as payload in a\nserver response to collected device info. Also, some of the applications that the malware mimics will have notified the user that they only work\non rooted devices. For instance, Browser Cleaner can only clean up the browser cache if it is given root permissions.\n\n### Version 2\n\nSpecimens of this version were also detected in 2019 and earlier. One of the samples was located in Google Play Store in November 2019\n[and described in the Dr. Web blog. Based on our detection statistics and spotted version stamps, we believe that this version is a replacement](https://vms.drweb.ru/virus/?i=18042508&lng=en)\nfor Version 3, which we did not observe in 2019.\n\nBelow are the most valuable points and main differences from the Version 1.\n\nThe malicious payload APK is now packed in an encrypted file in the assets directory and is decrypted by the first stage using an AES\nalgorithm A decryption key and initialization vector (IV) are located in the first 32 + 16 bytes of the encrypted payload\n\n\n-----\n\nAfter decryption, the asset file will look like this.\n\nAs you can see, before the APK magic, the file header contains strings that are used for making further reflection calls to payload methods.\nHere is the first-stage code fragment with explanations regarding the payload loading process.\n\nAll Version 2 payloads use the same package name, “com.android.play.games”, which probably mimics the official Google Play Games\npackage, “com.google.android.play.games”.\n\nMoreover, we spotted developer version stamps in decrypted payloads.\n\n**MD5** **Developer version stamp**\n\n65d399e6a77acf7e63ba771877f96f8e 5.10.6084\n\n6bf9b834d841b13348851f2dc033773e 5.10.6090\n\n8d5c64fdaae76bb74831c0543a7865c3 5.10.9018\n\n\n-----\n\n3285ae59877c6241200f784b62531694 5.10.9018\n\ne648a2cc826707aec33208408b882e31 5.10.9018\n\nIt is worth mentioning payload manifests, which do not contain any permission requests. As stated in the description of Version 1, permissions\nrequired by the malicious features are granted via an undocumented Android API.\n\nWe have found two different certificates used for signing Version 2 payloads.\n\n**MD5** **Certificate**\n\n6bf9b834d841b13348851f2dc033773e Serial Number: 0xa4ed88e620b8262e\nIssuer: CN=Lotvolron\n\nValidity: from = Wed Jan 20 11:30:49 MSK 2010\n\n65d399e6a77acf7e63ba771877f96f8e\n\n8d5c64fdaae76bb74831c0543a7865c3 Serial Number: 0xd47c08706d440384\nIssuer: CN=Ventoplex\n\nValidity: from = Wed Apr 13 05:21:26 MSK 2011\n\n3285ae59877c6241200f784b62531694\n\ne648a2cc826707aec33208408b882e31\n\nAlthough validity dates look spoofed in both cases and do not point to any real deployment times, by analyzing all payload certificates, we\ndiscovered that the second one (Ventoplex) was used to sign Version 3 payloads as well.\n\n### Version 2.1\n\nThe latest samples of PhantomLance discovered in the early 2020 introduced a new technique for decrypting payloads: the malicious payload\nwas shipped with its dropper, encrypted with AES. The key is not stored anywhere in the dropper itself but sent to the device using Google’s\nFirebase remote config system. The other technical features are very similar to the ones we observed in Version 2, so we tagged this\ngeneration as Version 2.1.\n\nWe were able to make a valid request to PhantomLance’s Firebase API. The response consisted of a JSON struct containing the AES\ndecryption key, where the “code_disable” value is the decryption key for payload.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n\n{\n\n\"entries\": {\n\n\"code_disable\": \"27ypYitp1UFc9Tvh\"\n\n},\n\n\"appName\": \"com.ozerlab.callrecorder\",\n\n\"state\": \"UPDATE\"\n\n}\n\n\nWhat is important, the dropper expects that the AES decryption key will be stored in a parameter named “code”, so this specific variant should\nnot function properly. Besides, we noticed that Firebase previously returned one more field, named “conf_disable”, which has the same value\nas the “code_disable”, so we assume that the actors are still tinkering with this new feature.\n\nAnother interesting technique that the actors are trying to implement is a third-stage payload implant. The second-stage payload (MD5:\n83cd59e3ed1ba15f7a8cadfe9183e156) contains an APK file named “data” (MD5: 7048d56d923e049ca7f3d97fb5ba9812) with a corrupted\nheader in the assets path.\n\n\n-----\n\nThe second stage reads this APK file, decrypts it and rewrites its first 27 bytes as described below.\n\nThis results in an APK file (MD5: c399d93146f3d12feb32da23b75304ba) that appears to be a typical PhantomLance payload configured with\nalready known C2 servers (cloud.anofrio[.]com, video.viodger[.]com, api.anaehler[.]com). This third-stage APK is deployed with a custom\nnative library named “data.raw”, also stored at the assets path. This library is used for achieving persistence on the infected device and\n[appears to be a custom daemonized ELF executable based on the open-source “daemon.c” Superuser tool component, while in previous](https://github.com/Miracle963/root/blob/5c8356dec3e175ab6b506344bcbfb570f51b02d5/Superuser-master/Superuser/jni/su/daemon.c)\n[samples, we saw MarsDaemon used for this purpose.](https://github.com/Marswin/MarsDaemon)\n\n\n-----\n\n**_Code comparison of the library used to daemonize the third stage payload with daemon.c source code hosted on Github_**\n\n### Version 3\n\nWhile we have found that Version 2 has been used as a replacement for this one, as we have not observed any new deployments of Version 3\nin 2019, it still looks more advanced in terms of technical details than Version 2. According to our detection statistics and deployment dates on\napplication markets, Version 3 was active at least from 2016 to 2018.\n\nBelow are the most valuable points and main differences between Version 3 and Version 2.\n\nThe first-stage dropper appears even more obfuscated than that in Version 2; it uses a similar way of decrypting the payload, but it has minor\ndifferences. The encrypted content is split into multiple asset files under 10256 bytes in size plus an encrypted config file, and contains payload\ndecryption details.\n\nBelow is the payload decryption sequence.\n\n1. Decrypt the payload config file from the assets with both a hardcoded name and AES key.\n2. Read the following values from the decrypted payload config file in this order:\n\nAES key for APK payload decryption\nClass and method names for reflection calls to the payload\nMD5 for APK payload integrity check\nNumber and names of the split APK payload parts\n3. Decrypt the APK payload header hardcoded in the first stage with the AES key from the payload config. Write it to the APK payload file.\n4. Using decrypted names of the split payload parts, decrypt their content and append them to the APK payload file one by one.\n5. Check the integrity of the resulting APK payload file by comparing with the MD5 value decrypted from the payload config.\n6. Load and run the APK payload.\n\nThe following reversed code fragment represents the actual payload decryption process.\n\n\n-----\n\nEach Version 3 payload has the same package name, “com.android.process.gpsp”, and is signed with the same certificate (CN=Ventoplex),\nused to sign some of the Version 2 payloads.\n\nThe only developer version stamp that we have found in Version 3 payloads is “10.2.98”.\n\nAnother notable finding is the 243e2c6433815f2ecc204ada4821e7d6 sample, which we believe belongs to a Version 3 payload. However, no\nrelated dropper has been spotted in the wild, and unlike the other payloads, it is signed with a debug certificate and not obfuscated at all,\nrevealing all variable/class/method names and even BuildConfig values. Our guess that this is a debug developer version that somehow got\nleaked.\n\nAs a conclusion to this technical review, it is worth saying that all payloads across the different versions, even Version 1, which is in fact a clear\npayload without a dropper, share a code structure and locations where sensitive strings, such as С2 addresses, are stored.\n\n## Spread\n\nThe main spreading vector used by the threat actors is distribution through application marketplaces. Apart from the com.zimice.browserturbo,\nwhich we have reported to Google, and com.physlane.opengl, reported by Dr. Web, we have observed tracks indicating that many malicious\napplications were deployed to Google Play in the past and have now been removed.\n\n**_These search results contain a link to already-removed malware in Google Play_**\n\nSome of the applications whose appearance in Google Play we can confirm.\n\n**Package name** **Google Play persistence date (at least)**\n\n\n-----\n\ncom.zimice.browserturbo 2019-11-06\n\ncom.physlane.opengl 2019-07-10\n\ncom.unianin.adsskipper 2018-12-26\n\ncom.codedexon.prayerbook 2018-08-20\n\ncom.luxury.BeerAddress 2018-08-20\n\ncom.luxury.BiFinBall 2018-08-20\n\ncom.zonjob.browsercleaner 2018-08-20\n\ncom.linevialab.ffont 2018-08-20\n\nBesides, we have identified multiple third-party marketplaces that, unlike Google Play, still host the malicious applications, such as\nhttps://apkcombo[.]com, https://apk[.]support/, https://apkpure[.]com, https://apkpourandroid[.]com and many others.\n\n**_Example of a malicious application with a description in Vietnamese that is still available in a third-party marketplace_**\n**_(hxxps://androidappsapk[.]co/detail-cham-soc-be-yeu-babycare/)_**\n\nIn nearly every case of malware deployment, the threat actors try to build a fake developer profile by creating a Github account that contains\nonly a fake end-user license agreement (EULA). An example is the one below, reported by us to Google.\n\n**_This Google Play page contains a fake developer email_**\n\nHere is a related Github account with the same handle, registered on October 17, 2019.\n\n\n-----\n\n**_A Github profile that is part of the fake developer identity_**\n\nThe account contains only one report with one file described as some type of EULA.\n\nDuring our extensive investigation, we spotted a certain tactic often used by the threat actors for distributing their malware. The initial versions\nof applications uploaded to app marketplaces did not contain any malicious payloads or code for dropping a payload. These versions were\naccepted because they contained nothing suspicious, but follow-up versions were updated with both malicious payloads and code to drop and\nexecute these payloads. We were able to confirm this behavior in all of the samples, and we were able to find two versions of the applications,\nwith and without a payload.\n\nAn example of this behavior can be seen in Ads Skipper (https://apkpure[.]ai/ads-skipper), in ApkPure.\n\n**_Versions of Ads Skipper with (v. 2.0) and without (v. 1.0) a malicious payload in ApkPure_**\n\nThird-party marketplaces like those mentioned in the table above often serve as a mirror for Google Play: they simply copy applications and\nmetadata from Google Play to their own servers. Therefore, it is safe to assume that the samples listed in the table were copied from Google\nPlay as well.\n\n## Infrastructure\n\n\n-----\n\ne a a y g t e С se e ast uctu e, e qu c y de t ed u t p e do a s t at s a ed s a t es t p e ous o es but e e ot\nlinked to any known malware samples. This allowed us to uncover more pieces of the attackers’ infrastructure.\n\n**_Example of related infrastructure_**\n\nTracking PhantomLance’s old infrastructure, which dated back four years, we noticed that the expired domain names had been extended. The\nmaintenance suggested that the infrastructure might be used again in the future.\n\n**Domain** **Registered** **Last updated**\n\nosloger[.]biz 2015-12-09 2019-12-01\n\nlog4jv[.]info 2015-12-09 2019-11-26\n\nsqllitlever[.]info 2015-12-09 2019-11-26\n\nanofrio[.]com 2017-05-16 2020-03-30\n\nanaehler[.]com 2017-05-16 2020-03-30\n\nviodger[.]com 2017-05-16 2020-04-07\n\nThe PhantomLance TTPs indicate that samples are configured only with subdomains as C2 servers, while most, but not all, parent domains do\nnot have their own IP resolution. We checked the ones that did have a valid resolution and found that they all resolved to the same IP address:\n188.166.203[.]57. It belongs to the DigitalOcean cloud infrastructure provider and, according to Domaintools, hosts a total of 129 websites.\n\nLooking up records for this IP address in our passive DNS database suggests that a few dozen of these websites are legitimate, as well as the\naforementioned PhantomLance domains and two more interesting overlaps with OceanLotus infrastructure:\n\n\n-----\n\nb o se sy [ ]co o do a used as a C a p e ous y pub c y epo ted sa p e ( 5 b 990e 9e a 88 06 b e9d 0d9 9)\n[considered by the industry to be the OceanLotus APT.](https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/)\ncerisecaird[.]com: privately received information indicates that this domain is related to OceanLotus as well.\n\n## Victimology\n\nWe have observed around 300 infection attacks on Android devices in India, Vietnam, Bangladesh, Indonesia, etc. starting in 2016. Below is a\nrough cartographic representation of countries with top attempted attacks.\n\nWe have also seen a number of detections in Nepal, Myanmar and Malaysia. As you can see, this part of South Asia seems to be targeted by\nthe actors the most.\n\nNote that due to the chosen distribution vector (publication of malicious samples on publicly available application stores), there should be\nsecondary infection of random victims not directly related to the actors’ interests.\n\nTo get more details on targeted victims, we looked at the types of applications that the malware mimicked. Apart from common luring\napplications, such as Flash plugins, cleaners and updaters, there were those that specifically targeted Vietnam.\n\nluxury.BeerAddress – “Tim quan nhau | Tìm quán nhậu” (“Find each other | Find pubs” in Vietnamese). An application for finding the\nnearest pub in Vietnam.\n\n\n-----\n\ncodede o c u c add ess ịa ể à ờ( C u c ace )\n\nPublisher description (hxxps://apk.support/app-en/com.codedexon.churchaddress) translated from Vietnamese:\n_Information about churches near you or the whole of Vietnam, information about patronies, priests, phone numbers, websites, email,_\n_activities, holidays…_\n\nbulknewsexpress.news – “Tin 247 – Đọc Báo Hàng Ngày” (“Read Daily Newspaper”)\n\nMimics the Vietnamese www.tin247.com mobile news application.\n\n## Overlaps with previous campaigns\n\nIn this section, we provide a correlation of PhantomLance’s activity with previously reported campaigns related to the OceanLotus APT.\n\n### OceanLotus Android campaign in 2014-2017\n\nIn May 2019, Antiy Labs published a report (https://www.antiy.net/p/analysis-of-the-attack-of-mobile-devices-by-oceanlotus/) in which they\ndescribed an Android malware campaign, claiming that it was related to OceanLotus APT. We checked the provided indicators using\ninformation from our telemetry and found that the very first tracks of these samples date back to December 2014.\n\nIt is important to note that according to our detection statistics, the majority of users affected by this campaign were located in Vietnam, with\nthe exception of a small number of individuals located in China.\n\nThe main infection vector seems to be links to malicious applications hosted on third-party websites, possibly distributed via SMS or email\nspearphishing attacks. Examples below.\n\n**Referring URL for victim** **Malware URL**\n\n\nhxxp://download.com[.]vn/android/download/nhaccuatuidownloader/31798\n\n\nhxxp://113.171.224.175/videoplayer/NhacCuaTuiDownloader[.]apk\n\n\nhxxp://nhaccuatui.android.zyngacdn.com/NhacCuaTuiDownloader[.]apk 2014-12-29\n\n\n-----\n\nhxxp://www.mediafire.com/file/1elber8zl34tag4/framaroot-xpro[.]apk hxxp://download1825.mediafire.com/tyxddh46orzg/1elber8zl34tag4/fram\nxpro[.]apk\n\nThe latest registered malware download event occurred in December 2017. We observed a small amount of activity in 2018, but judging by the\nvolume of hosted malware and the number of detections we observed, the main campaign took place from late 2014 to 2017.\n\nTo best visualize the similarities we discovered, we made a code structure comparison of the sample from the old reported OceanLotus\nAndroid campaign (MD5: 0e7c2adda3bc65242a365ef72b91f3a8) and the only unobfuscated (probably a developer version) PhantomLance\npayload v3 (MD5: 243e2c6433815f2ecc204ada4821e7d6).\n\n**_Code structure comparison of a sample linked to OceanLotus and PhantomLance payload v3._**\n\nDespite the multiple differences, we observed a similar pattern used in malware implementation. It seems that the developers have renamed\n“module” to “plugin”, but the meaning remains the same. Overlapping classes look quite similar and have the same functionality. For example,\nhere is a comparison of the methods contained in the Parser classes.\n\n**Parser from 0e7c2adda3bc65242a365ef72b91f3a8** **ParserWriter/Reader from 243e2c6433815f2ecc204ada4821e7d6**\n\npublic void appendBoolean(boolean f) public void appendBoolean(boolean value)\n\npublic void appendByte(byte data) public void appendByte(byte value)\n\npublic void appendBytes(byte[] data) public void appendBytes(byte[] value)\n\npublic void appendDouble(double val) public void appendDouble(double value)\n\npublic void appendInt(int val) public void appendInt(int value)\n\npublic void appendLong(long val) public void appendLong(long value)\n\nprivate void appendNumber(Object value)\n\n\n-----\n\npublic void appendShort(short val) public void appendShort(short value)\n\npublic void appendString(String str) public void appendString(String value)\n\npublic byte[] getContents() public byte[] getContents()\n\npublic void appendFloat(float val)\n\npublic boolean getBoolean() public boolean getBoolean()\n\npublic byte getByte() public byte getByte()\n\npublic byte[] getBytes() public byte[] getBytes()\n\npublic double getDouble() public double getDouble()\n\npublic float getFloat()\n\npublic int getInt() public int getInt()\n\npublic long getLong() public long getLong()\n\npublic short getShort() public short getShort()\n\nbyte getSignal()\n\npublic String getString() public String getString()\n\ngetStringOfNumber()\n\nUsing our malware attribution technology, we can see that the PhantomLance payloads are at least 20% similar to the ones from the old\nOceanLotus Android campaign.\n\n### OceanLotus macOS backdoors\n\n[There are multiple public](https://blog.trendmicro.com/trendlabs-security-intelligence/new-macos-backdoor-linked-to-oceanlotus-found/) [reports of macOS backdoors linked by the industry to OceanLotus. We examined these in order to find possible](https://www.welivesecurity.com/2019/04/09/oceanlotus-macos-malware-update/)\noverlaps, with the caveat that it was really difficult to compare malware implemented for two completely different platforms, since two different\nprogramming languages were obviously used for the implementation process. However, during the analysis of the macOS payload (MD5:\n306d3ed0a7c899b5ef9d0e3c91f05193) dated early 2018, we were able to catch a few minor tracks of the code pattern used in the Android\nmalware implementation described above. In particular, three out of seven main classes had the same names and similar functionality:\n“Converter”, “Packet” and “Parser”.\n\n\n-----\n\n### Summary of overlaps\n\nAnother notable attribution token that applies to most of OceanLotus malware across platforms is usage of three redundant, different C2\nservers by each sample, mostly subdomains. Below is an example of this from the samples examined above and OceanLotus Windows\nmalware described in our private report.\n\n**MD5** **C2 servers** **Description**\n\n\n0d5c03da348dce513bf575545493f3e3 mine.remaariegarcia[.]com\negg.stralisemariegar[.]com\n\napi.anaehler[.]com\n\nd1eb52ef6c2445c848157beaba54044f sadma.knrowz[.]com\nckoen.dmkatti[.]com\n\nitpk.mostmkru[.]com\n\n306d3ed0a7c899b5ef9d0e3c91f05193 ssl.arkouthrie[.]com\ns3.hiahornber[.]com\n\nwidget.shoreoa[.]com\n\n51f9a7d4263b3a565dec7083ca00340f ps.andreagahuvrauvin[.]com\npaste.christienollmache[.]xyz\n\natt.illagedrivestralia[.]xyz\n\n\nPhantomLance Android\n\nOceanLotus Android campaign 2014-2017\n\nOceanLotus MacOS backdoor\n\nOceanLotus Windows backdoor\n\n\nBased on the complete analysis of previous campaigns, with the actors’ interests in victims located in Vietnam, infrastructure overlaps between\nPhantomLance and OceanLotus for Windows, multiple code similarities between an old Android campaign and MacOS backdoors, we attribute\nthe set of the Android activity (campaign 2014-2017 and PhantomLance) to OceanLotus with medium confidence.\n\n\n-----\n\nConsidering the timeline of the Android campaigns, we believe that the activity reported by Antiy Labs is a previous campaign that was\nconducted by OceanLotus until 2017, and PhantomLance is a successor, active since 2016.\n\nIn summarizing the results of this research, we are able to assess the scope and evolution of the actors’ Android set of activity, operating for\nalmost six years.\n\n## IOC\n\n### Kaspersky Lab products verdicts\n\n**PhantomLance**\n\nHEUR:Backdoor.AndroidOS.PhantomLance.*\n\nHEUR:Trojan-Dropper.AndroidOS.Dnolder.*\n\n**Android campaign linked to OceanLotus (2014-2017)**\n\nHEUR:Trojan.AndroidOS.Agent.eu\n\nHEUR:Trojan.AndroidOS.Agent.vg\n\nHEUR:Trojan-Downloader.AndroidOS.Agent.gv\n\n**macOS campaign linked to OceanLotus**\n\nHEUR:Backdoor.OSX.OceanLotus.*\n\n### MD5\n\n**PhantomLance malware**\n\n2e06bbc26611305b28b40349a600f95c\n\nb1990e19efaf88206f7bffe9df0d9419\n\n7048d56d923e049ca7f3d97fb5ba9812\n\ne648a2cc826707aec33208408b882e31\n\n3285ae59877c6241200f784b62531694\n\n8d5c64fdaae76bb74831c0543a7865c3\n\n6bf9b834d841b13348851f2dc033773e\n\n0d5c03da348dce513bf575545493f3e3\n\n\n-----\n\n0e c adda3bc65 a365e b9 3a8\na795f662d10040728e916e1fd7570c1d\nd23472f47833049034011cad68958b46\n8b35b3956078fc28e5709c5439e4dcb0\naf44bb0dd464680395230ade0d6414cd\n65d399e6a77acf7e63ba771877f96f8e\n79f06cb9281177a51278b2a33090c867\nb107c35b4ca3e549bdf102de918749ba\n83cd59e3ed1ba15f7a8cadfe9183e156\nc399d93146f3d12feb32da23b75304ba\n83c423c36ecda310375e8a1f4348a35e\n94a3ca93f1500b5bd7fd020569e46589\n54777021c34b0aed226145fde8424991\n872a3dd2cd5e01633b57fa5b9ac4648d\n243e2c6433815f2ecc204ada4821e7d6\n\n**PhantomLance payload-free versions**\n\na330456d7ca25c88060dc158049f3298\n\na097b8d49386c8aab0bb38bbfdf315b2\n\n7285f44fa75c3c7a27bbb4870fc0cdca\n\nb4706f171cf98742413d642b6ae728dc\n\n8008bedaaebc1284b1b834c5fd9a7a71\n\n0e7b59b601a1c7ecd6f2f54b5cd8416a\n\n**Android campaign 2014-2017**\n\n0e7c2adda3bc65242a365ef72b91f3a8\n\n50bfd62721b4f3813c2d20b59642f022\n\n5079cb166df41233a1017d5e0150c17a\n\n810ef71bb52ea5c3cfe58b8e003520dc\n\nc630ab7b51f0c0fa38a4a0f45c793e24\n\nce5bae8714ddfca9eb3bb24ee60f042d\n\nd61c18e577cfc046a6252775da12294f\n\nfe15c0eacdbf5a46bc9b2af9c551f86a\n07e01c2fa020724887fc39e5c97eccee\n2e49775599942815ab84d9de13e338b3\n\n315f8e3da94920248676b095786e26ad\n\n641f0cc057e2ab43f5444c5547e80976\n\n### Domains and IP addresses\n\n**PhantomLance**\n\nmine.remaariegarcia[.]com\n\negg.stralisemariegar[.]com\n\napi.anaehler[.]com\n\ncloud.anofrio[.]com\n\nvideo.viodger[.]com\n\nterm.ursulapaulet[.]com\n\ninc.graceneufville[.]com\n\nlog.osloger[.]biz\n\nfile.log4jv[.]info\n\nnews.sqllitlever[.]info\n\nus.jaxonsorensen[.]club\n\nstaff.kristianfiedler[.]club\n\nbit.catalinabonami[.]com\n\nhr.halettebiermann[.]com\n\ncyn.ettebiermahalet[.]com\n\n**Android campaign 2014-2017**\n\nmtk.baimind[.]com\n\nming.chujong[.]com\n\nmokkha.goongnam[.]com\n\nckoen.dmkatti[.]com\n\n\n-----\n\nsad a o [ ]co\nitpk.mostmkru[.]com\naki.viperse[.]com\ngame2015[.]net\ntaiphanmemfacebookmoi[.]info\nnhaccuatui.android.zyngacdn[.]com\nquam.viperse[.]com\njang.goongnam[.]com\n\n[Apple MacOS](https://securelist.com/tag/apple-macos/)\n[APT](https://securelist.com/tag/apt/)\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Google Android](https://securelist.com/tag/google-android/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Spyware](https://securelist.com/tag/spyware/)\n[Trojan-Dropper](https://securelist.com/tag/trojan-dropper/)\n\nAuthors\n\nAlexey Firsh\n\nLev Pikman\n\nHiding in plain sight: PhantomLance walks into a market\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-28 - Hiding in plain sight- PhantomLance walks into a market.pdf"
    ],
    "report_names": [
        "2020-04-28 - Hiding in plain sight- PhantomLance walks into a market.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535621,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1653698523,
    "ts_modification_date": 1653698523,
    "files": {
        "pdf": "https://archive.orkl.eu/37eb8f7b4eac9900280883f329a70aa03d167c60.pdf",
        "text": "https://archive.orkl.eu/37eb8f7b4eac9900280883f329a70aa03d167c60.txt",
        "img": "https://archive.orkl.eu/37eb8f7b4eac9900280883f329a70aa03d167c60.jpg"
    }
}