{
    "id": "bfc2dda4-6b70-4d44-8b0c-f139b6a544a7",
    "created_at": "2023-01-12T14:58:56.057319Z",
    "updated_at": "2025-03-27T02:16:57.99966Z",
    "deleted_at": null,
    "sha1_hash": "73bcdf2f6319054ffaebeea727782259e9870d60",
    "title": "2020-05-28 - DarkSide Pipeline Attack Shakes Up the Ransomware-as-a-Service Landscape",
    "authors": "",
    "file_creation_date": "2022-05-28T22:04:51Z",
    "file_modification_date": "2022-05-28T22:04:51Z",
    "file_size": 605303,
    "plain_text": "# How Ransomware Adversaries Reacted to the DarkSide Attack\n\n**[crowdstrike.com/blog/how-ransomware-adversaries-reacted-to-the-darkside-pipeline-attack/](https://www.crowdstrike.com/blog/how-ransomware-adversaries-reacted-to-the-darkside-pipeline-attack/)**\n\nCrowdStrike Threat Intel Team May 28, 2021\n\n[The repercussions from the Colonial Pipeline DarkSide ransomware incident have garnered](https://www.crowdstrike.com/blog/falcon-protects-from-darkside-ransomware/)\nglobal attention and caused major shifts in the ransomware ecosystem. Many criminal\nforums have now banned ransomware, and as a result, many ransomware-as-a-service\n(RaaS) operators have already ended their public communications regarding affiliate and\npartner recruitment. While this incident will have a significant short- to medium-term impact\non the public-facing operations of RaaS provisions,the RaaS operation model will unlikely be\nabandoned and will likely continue in more private and secure communication channels.\n\n## Ransomware Infection at Pipeline Company\n\nOn May 7, 2021, Colonial Pipeline — operator of 5,500 miles of pipeline from the Gulf Coast\nto the U.S. East Coast providing 45% of the gasoline to this region — was the victim of a\nransomware infection. Initial details surrounding the incident were very tightly controlled, and\ninformation filtered out slowly, likely due to the engagement of U.S. government and law\nenforcement agencies. On May 9, 2021, the FBI released a public statement expressing they\nwere “working closely with the company and our government partners.” The FBI’s follow-up\n\n\n-----\n\nstatement on May 10 publicly indicated the incident involved the DarkSide ransomware. It\nwas later reported Colonial Pipeline had approximately 100GB of data stolen from their\nnetwork, and the organization allegedly paid almost $5 million USD to a DarkSide affiliate.\n\n## Government Statements Regarding Attribution\n\nOn May 10, President Biden stated the U.S. intelligence community had no evidence at the\ntime that the Russian government was involved in this incident — but evidence did exist that\nthe actors responsible were located in Russia. In response to a question about possible state\nties of the DarkSide operators, the United States National Security Council’s most senior\ncybersecurity official publicly described them as “a criminal actor.” On May 11, 2021, the\nRussian Embassy in the U.S. released a statement that they “took note of the attempts of\nsome media to accuse Russia of a cyberattack on Colonial Pipeline” and distanced\nthemselves from the ransomware incident, stating they “categorically reject the baseless\nfabrications of individual journalists and reiterate that Russia does not conduct ‘malicious’\nactivity in the virtual space.”\n\n## CARBON SPIDER\n\nCrowdStrike Intelligence attributes the operation of the DarkSide RaaS to CARBON\n[SPIDER, and is a skilled eCrime (ECX) group, highly likely Eastern Europe- or Russia-](https://adversary.crowdstrike.com/ecrime-index-ecx/)\nbased.\n\nCARBON SPIDER has been active since at least 2013 and previously targeted the\nhospitality and retail sectors in pursuit of payment card data. In April 2020, CARBON\n[SPIDER began conducting big game hunting (BGH) operations. The evolution from targeted](https://www.crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-ransomware/)\n[eCrime to BGH is reminiscent of how other adversaries (such as INDRIK SPIDER and](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/)\n[WIZARD SPIDER) have shifted their operations to focus primarily or exclusively on BGH.](https://adversary.crowdstrike.com/adversary/wizard-spider/)\n\nCARBON SPIDER’s BGH campaigns were likely motivated by the COVID-19 pandemic and\nthe reduction in point-of-sale (POS) transactions. The adversary used PINCHY SPIDER’s\n_REvil RaaS prior to introducing their own ransomware, DarkSide, in August 2020, and were_\n[among the first ransomware operators to target VMWare ESXi systems. In November 2020,](https://www.crowdstrike.com/blog/carbon-spider-sprite-spider-target-esxi-servers-with-ransomware/)\nCARBON SPIDER made the business decision to advertise their DarkSide ransomware to\naffiliates via a RaaS model and have been successfully growing their operations since.\n\n### CARBON SPIDER’s Reaction\n\nOn May 10, 2021, CARBON SPIDER posted a press release to the DarkSide dedicated leak\nsite (DLS) stating they are “apolitical,” do not participate in “geopolitics,” and their “goal is to\nmake money, and not creating problems for society” (Figure 1).\n\n\n-----\n\nFigure 1. CARBON SPIDER’s press release on their DLS\n\nCARBON SPIDER further stated there is “no need” to associate the group with a “defined\ngovernment,” and that they are introducing a system to check potential affiliate victims of the\nRaaS before encryption to prevent “social consequences.” CrowdStrike Intelligence\nassesses that CARBON SPIDER is highly likely located in Russia or neighboring countries,\nand there is currently no indication the group or any Darkside RaaS affiliates are associated\nwith any state-operated or politically motivated threat actors.\n\nThe rapid response and introduction of a vetting process for affiliate victims suggests\nCARBON SPIDER is aware the Colonial Pipeline incident was conducted by an affiliate of\nthe DarkSide RaaS as opposed to CARBON SPIDER themselves. This is based on the\nimposition of moderation and checking of potential partner victims prior to infection with\n_DarkSide._\n\nA statement on May 13, 2021 — purportedly from CARBON SPIDER — claimed the\nadversary group lost access to the DarkSide DLS, payment servers and content delivery\nnetwork (CDN) servers. The statement also claimed CARBON SPIDER servers had been\nblocked “at the request of law enforcement agencies.” Furthermore, cryptocurrency allegedly\nbelonging to CARBON SPIDER and their clients had been transferred to an unknown\naddress. A revision to the statement (subsequently made by the “Russian OSINT” Telegram\nchannel) claimed that “no arrests were made” and “DarkSide has simply shut down.”\nWhether the DarkSide RaaS will remain closed permanently is currently unclear; however,\nnew infrastructure for other CARBON SPIDER tools has been identified since the alleged\n_DarkSide shutdown, indicating CARBON SPIDER will highly likely remain a sophisticated_\nand active threat actor.\n\n## Forum Reactions\n\nOn May 13, 2021, XSS forum administrators made an extensive post detailing their\nprohibition of ransomware-related posts and ban on threads associated with ransomware\naffiliate programs, rental and sale. All future topics meeting any of the criteria will reportedly\n\n\n-----\n\nbe removed — threads related to Avaddon, DarkSide, LockBit, REvil and Trinage\nransomware were all removed from the forum. The following reasons were provided for the\nchange in policy:\n\nThe main purpose of the forum is “technical education” and research, and these goals\ndo not align with the purely financial motivations of ransomware operators.\n“Newbies” attract media attention under the pretense of making large sums of money\nwithout learning, coding, or thinking, and with minimal effort and restraint.\nRansomware has become a hugely covered topic in the media and attracts negative\nattention through “hype,” “noise,” and “nonsense.”\nRansomware has become associated with a “number of unpleasant phenomenon,”\nincluding geopolitics, extortion and government hacking.\n\nThe following day, similar posts appeared on Exploit and RaidForums stating that due to the\nmass-media attention, it was no longer feasible to entertain posts relating to ransomware.\nThe statement on Exploit suggested that this restriction only applied to ransomware\nspecifically, allowing other content — criminal or otherwise — to continue without restriction.\n\n## Ransomware Operators’ Reactions\n\n[PINCHY SPIDER, developers and operators of the popular REvil RaaS, announced](https://adversary.crowdstrike.com/adversary/pinchy-spider/)\nintentions to move away from the forums to private communications, and additionally\ndetailed “significant restrictions” on future REvil operations:\n\nSocial-sector victims (such as academic and healthcare organizations) are not to be\ninfected.\nInfections against government-sector entities in any country are strictly prohibited.\nAffiliates must provide the owners of the RaaS with detailed information regarding any\npotential target and obtain permission prior to initiating ransomware operations.\n\n[RIDDLE SPIDER, operators of the Avaddon RaaS, posted a similar announcement “due to](https://www.crowdstrike.com/resources/reports/global-threat-report/)\nthe current situation” in the U.S., listing the following restrictions on future Avaddon\noperations:\n\nEntities in the Commonwealth of Independent States (CIS) are not to be infected.\nWork against public-sector victims (such as academic and healthcare organizations) is\nprohibited.\nPermission of the “administration” must be sought prior to infection.\n\nIn contrast, the operators of Babuk Locker ransomware criticized the reactions within the\neCrime community, predicted RaaS “will die,” encouraged “pentesters” (likely a reference to\neCrime actors specializing in compromising networks) to abandon public RaaS programs,\n\n\n-----\n\nand announced intentions to launch a huge platform for independent leaks — supposedly\nfor use by “successful no-name teams” who do not run from the “ship like rats and change\nthe policy” of their operations (Figure 2).\n\nFigure 2. Extract of an announcement by Babuk Locker operators on their DLS\n\n## Access Brokers\n\nThe changes on the criminal underground forums have also impacted other eCrime actors,\nincluding access brokers. Access brokers are threat actors that gain backend access to\nvarious organizations and advertise this access to other eCrime actors via criminal\nunderground forums or private communication channels. Access broker offerings are heavily\ntailored toward BGH operators and their affiliates, often including the annual revenue of the\nvictim — acquired from public sources — as this can be used to calculate the potential\nransom demand.\n\nSince the beginning of 2021, CrowdStrike Intelligence has observed access brokers\nadvertise initial access to entities in the energy sector, including oil and gas companies.\nEntities in these sectors can be lucrative victims since they often possess relatively large\nannual revenues that are of interest to ransomware operators and affiliates. On Jan. 2, 2021,\na Ukraine-based access broker stated in a dual English- and Russian-language forum that\nthey were planning to deploy an unspecified ransomware variant against an oil and gas\nentity. A portion of funds received from this operation was later transferred to an associated\ngroup of Bitcoin (BTC) wallets that also received the ransom from the Colonial Pipeline\nincident. On Feb. 13 and March 7, 2021, the access broker barf advertised administrator and\nuser access to two different entities in the energy and the oil and gas sectors on a dual\nEnglish- and Russian-language forum.\n\nSince the Colonial Pipeline incident and the changes introduced by the forum administrators,\nthere has been a general decline in the number of access broker advertisements on the\nforums — aside from one Brazil-based access broker targeting a Europe-based oil and gas\ncompany who is seemingly intent on selling their access despite the ban on ransomwarerelated offerings. Similar to the reaction by RaaS operators, access broker activity is unlikely\nto cease, but brokers will likely increasingly adopt the use of private communications for\nadvertising and selling access in the near term. Access brokers will almost certainly continue\nto target entities within the energy sector as the vertical remains a lucrative target for\nransomware operations, and access brokers profit from providing initial access opportunities.\n\n\n-----\n\n## Looking Forward\n\nThe intense attention surrounding the Colonial Pipeline incident has had a significant impact\non the criminal marketplace and the political landscape. Scrutiny of this event will almost\ncertainly alter how ransomware operators conduct their activity and how government and law\nenforcement agencies respond to the ransomware threat.\n\nRaaS operators, such as CARBON SPIDER (DarkSide), PINCHY SPIDER (REvil), and\nRIDDLE SPIDER (Avaddon), have apparently accepted blanket forum bans on the\ndiscussion and marketing of ransomware services. These bans likely spell the end for most\npublic communications regarding affiliate and partner recruitment. The aforementioned\ngroups have also issued warnings to their affiliates that they must request approval prior to\ndeploying ransomware across a victim environment. These new guidelines are a response to\nfallout from the Colonial Pipeline incident — likely caused by an unseasoned DarkSide RaaS\naffiliate — who likely failed to conduct proper due diligence on Colonial Pipeline before\ninfecting them. While the attack was certainly deliberate, the significant social and economic\nconsequences were either unconsidered or underestimated. This attack was likely not meant\nto intentionally disrupt gasoline supply to a wide swath of the U.S. East Coast: Colonial\nPipeline stated that it “proactively took certain systems offline to contain the threat, which\ntemporarily halted all pipeline operations.”\n\nWhile the operators of Babuk Locker have been defiant in the wake of the Colonial Pipeline\nransomware incident, other actors (such as WIZARD SPIDER) have not publicly responded\nto the attention on the ransomware marketplace. These adversaries already operate a\nprivate operation with only trusted partners and affiliates, and it is unlikely such groups will\npublicly respond at all. Most public RaaS vendors will likely retreat for a short- to mediumtimeframe and will continue to operate in a more closed and private fashion — a choice\nalready demonstrated by PINCHY SPIDER. While CARBON SPIDER allegedly closed their\n_DarkSide RaaS, the adversary is successful, sophisticated, and resourceful, and has not_\nceased all activity. CARBON SPIDER, and possibly other RaaS vendors, will likely take time\nto reevaluate their operations and return to eCrime activity — albeit not necessarily involving\n[ransomware — under a new name or brand.](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/)\n\nThe recent developments surrounding the Colonial Pipeline incident and subsequent\nreactions from ransomware operators showcase the importance of maintaining situational\nawareness of quickly evolving threats. This is facilitated by monitoring the shifting dynamics\nin underground criminal communities but also by understanding the context and impact these\nactivities have on the overall ecosystem. Proactive measures (such as active monitoring) are\ncritical to staying ahead of the adversary to protect your organization.\n\n**Additional Resources**\n\n\n-----\n\n_Read more about CARBON SPIDER s tactics and DarkSide ransomware in this blog:_\n_Hypervisor Jackpotting: CARBON SPIDER and SPRITE SPIDER Target ESXi Servers_\n_With Ransomware to Maximize Impact._\n_[Download the CrowdStrike 2021 Global Threat Report for more information about big](https://www.crowdstrike.com/resources/reports/global-threat-report/)_\n_game hunting adversaries tracked by CrowdStrike Intelligence in 2020._\n_To learn more about how to incorporate intelligence on threat actors into your security_\n_strategy, visit the_ _[Falcon X™ Premium Threat Intelligence page.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/premium/)_\n_[See how the powerful, cloud-native CrowdStrike Falcon® platform protects customers](https://www.crowdstrike.com/endpoint-security-products/)_\n_from DarkSide ransomware in this blog: DarkSide Goes Dark: How CrowdStrike Falcon_\n_Customers Were Protected._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-28 - DarkSide Pipeline Attack Shakes Up the Ransomware-as-a-Service Landscape.pdf"
    ],
    "report_names": [
        "2020-05-28 - DarkSide Pipeline Attack Shakes Up the Ransomware-as-a-Service Landscape.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6148aa7-4347-4444-a2a0-dbbf7c0f121c",
            "created_at": "2022-10-25T16:07:24.12696Z",
            "updated_at": "2025-03-27T02:02:10.11675Z",
            "deleted_at": null,
            "main_name": "Riddle Spider",
            "aliases": [
                "Avaddon Team"
            ],
            "source_name": "ETDA:Riddle Spider",
            "tools": [
                "Avaddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "38e9c8e3-38f8-4500-8c5c-8349b3e9a998",
            "created_at": "2023-01-06T13:46:39.207556Z",
            "updated_at": "2025-03-27T02:00:03.021608Z",
            "deleted_at": null,
            "main_name": "RIDDLE SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:RIDDLE SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7268a08d-d4d0-4ebc-bffe-3d35b3ead368",
            "created_at": "2022-10-25T16:07:24.225216Z",
            "updated_at": "2025-03-27T02:02:10.144446Z",
            "deleted_at": null,
            "main_name": "Sprite Spider",
            "aliases": [
                "Gold Dupont",
                "Sprite Spider"
            ],
            "source_name": "ETDA:Sprite Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Coroxy",
                "Defray 2018",
                "Defray777",
                "DroxiDat",
                "Glushkov",
                "LaZagne",
                "Metasploit",
                "PyXie",
                "PyXie RAT",
                "Ransom X",
                "RansomExx",
                "SharpHound",
                "Shifu",
                "SystemBC",
                "Target777",
                "Vatet",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "27e51b73-410e-4a33-93a1-49cf8a743cf7",
            "created_at": "2023-01-06T13:46:39.210675Z",
            "updated_at": "2025-03-27T02:00:03.022315Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "SPRITE SPIDER"
            ],
            "source_name": "MISPGALAXY:GOLD DUPONT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "07775b09-acd9-498e-895f-f10063115629",
            "created_at": "2024-06-04T02:03:07.817613Z",
            "updated_at": "2025-03-27T02:05:17.351811Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "Sprite Spider "
            ],
            "source_name": "Secureworks:GOLD DUPONT",
            "tools": [
                " ArtifactExx",
                " Cobalt Strike",
                " Defray",
                " Metasploit",
                " PyXie",
                " Shifu",
                " SystemBC",
                " Vatet",
                "777"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535536,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653775491,
    "ts_modification_date": 1653775491,
    "files": {
        "pdf": "https://archive.orkl.eu/73bcdf2f6319054ffaebeea727782259e9870d60.pdf",
        "text": "https://archive.orkl.eu/73bcdf2f6319054ffaebeea727782259e9870d60.txt",
        "img": "https://archive.orkl.eu/73bcdf2f6319054ffaebeea727782259e9870d60.jpg"
    }
}