{
    "id": "c001fd7d-5d24-4a61-b3ef-df4d04e28979",
    "created_at": "2022-10-25T16:48:22.473155Z",
    "updated_at": "2025-03-27T02:13:04.35113Z",
    "deleted_at": null,
    "sha1_hash": "b039fa56126220d8df26a5ad6853a884bd76581e",
    "title": "Taiwan Presidential Election: A Case Study on Thematic Targeting",
    "authors": "PWC",
    "file_creation_date": "2016-04-04T00:02:41Z",
    "file_modification_date": "2016-04-04T00:02:41Z",
    "file_size": 1338727,
    "plain_text": "## Keeping CISOs and CIO’s confident about cyber security related issues including threat detection, data protection, breach readiness, security architecture, digital solutions and network security monitoring.\n\n Taiwan Presidential Election: A Case Study on Thematic Targeting\n\n17 March 2016\nBy Michael Yip\n\n[@michael_yip](https://twitter.com/michael_yip)\n\nExecutive Summary\nIn January 2016, Tsai Ing­wen was elected as the first female president of Taiwan. Prior to the election, it was reported that the election was going to\nbe the target of a series of attacks by Chinese threat actors.[1] Looking back on the malware observed from different groups over that period of time,\nwe have been able to piece together evidence which suggests that several distinct threat actors launched attacks using the Taiwan presidential election\nas a spear phishing theme. This blog post provides an overview of the malware and the network infrastructure associated with the threat actors who\nhave taken advantage of this event.\n\n**EvilGrab**\nThe first sample we came across using the Taiwan election theme was an Excel spreadsheet named 2016年台灣總統選舉觀戰團 行程\n20160105.xls (393dafa8bd5e30334d2cbf23677e1d2e). Once the spreadsheet is executed, a file called 6EC5.tmp is dropped in the\n\n%temp% folder. The file is in fact an executable binary which, once executed, spawns a ctfmon.exe process and clones itself in the\n\n%userprofile% directory as a file called IEChecker.exe (fb498e6a994d6d53b80c53a05fc2da36).\n\n**Figure 1: ctfmon.exe process creates a set of registry keys and drops IEChecker.exe in %userprofile%.**\n\n\n-----\n\n**Figure 2: Registry values containing encoded modules used by the Evilgrab malware.**\n\nAside from creating IEChecker.exe, the malicious ctfmon process also creates a set of registry keys at the following paths which contain\n\nencoded data. These are in fact modules used by the malware and this behavior shows that the malware analysed is an EvilGrab sample[2]:\n\nHKCU\\Software\\rar\\e\n\nHKCU\\Software\\rar\\s\n\nHKCU\\Software\\rar\\data\n\nHKCU\\Software\\rar\\ActiveSettings\n\nHKCU\\Software\\Classes\\VirtualStore\\MACHINE\\Software\\rar\\e\n\nThe malware establishes persistence by setting an Autorun key called ctfmon to ensure IEChecker.exe is executed on startup.\n\n**Figure 3: An AutoRun key is set by the ctfmon process to ensure IEChecker.exe is executed on startup.**\n\nThe malware also beacons to the command and control (C2) 192.225.226[.]98 on port 8080 by sending TCP SYN packets approximately\n\nevery 30 seconds.\n\n**DynCalc/Numbered Panda/APT12**\nThe second sample we came across was an executable named 總統辯論會後：民眾政黨支持趨勢變化.exe\n\n(791931e779a1af6d2e1370e952451aea) which translates to “Post presidential debate: support for people’s political parties changes”. The\n\nsample was submitted to VirusTotal by a user in Taiwan on 11th January 2016, five days before the presidential election.\n\n**Figure 4: Malware was submitted to Virustotal on 11th January 2016 by a user in Taiwan.**\n\nThe binary uses the standard Microsoft Word icon, shown below, to trick users into thinking the file is a legitimate Microsoft Word Document.\n\n\n-----\n\n**Figure 5: The malicious binary with a Word icon.**\n\nOn execution, the binary creates a file called ka4281x3.log in the same directory as the original binary; this file contains encoded data. The\n\nnaming convention of this file has been reported as distinctive to the IXESHE[3] and the related Etumbot[4] malware family, and it is based on the\nbehavioral similarity with other Etumbot samples (e.g. 2b3a8734a57604e98e6c996f94776086) that we believe this attack is associated with\n\nAPT12.\n\nAside from the .log file, a decoy document is also created and displayed to the victim as shown below. Research on the content of the decoy\n\ndocument shows that the content is likely to have been taken from a presentation with\n\nthe same title, “總統辯論會後：民眾政黨支持趨勢變化”, originally written by TaiwanThinkTank.[5] The figure below shows the same content\nfrom the presentation being used in the decoy document. The lack of formatting in the decoy document suggests that the attacker simply copied and\npasted the content from the PDF to create a new Word document. The similarity of the content is as shown below:\n\n**Figure 6: The original presentation from the Taiwan Thinktank[6] titled “總統辯論會後：民眾政黨支持趨勢變化” with a slide showing the**\n**results from the latest opinion poll (left) and the decoy document dropped by the IXESHE/Etumbot sample (right).**\n\nThe malware then drops a binary called vecome.exe into %Appdata%\\Roaming\\Location and installs an Autorun key to ensure the dropped\n\nbinary is executed on startup.\n\n**Figure 7: An Autorun key is installed to ensure vecome.exe is executed on startup.**\n\nSimilar to other IXESHE/Etumbot samples, the malware drops six temporary files in the %temp% folder:\n\n\n-----\n\n**Figure 8:**\n**Six temporary files created by the IXESHE/Etumbot sample.**\n\nThe malware communicates with the C2 201.21.94[.]135 on port 443 over SSL. The SSL certificate used is associated with the email address\n\nexam@google.com[7] and has the serial 00 8b be a3 a0 a9 1b 1c 78.\n\n**Figure 9: SSL**\n**certification is associated with the email address exam@google.com.**\n\n**SunOrcal and Surtr**\nThe last sample we have identified using the Taiwan election theme was a malicious Microsoft Word document named 2016總統選舉民情中心預測\n值.doc (09ddd70517cb48a46d9f93644b29c72f). The content of this file contains two blank squares (Figure 10) however, once a self­\n\nextracting archive (SFX) is dropped, a separate decoy document is displayed which contains one line of text that mentions the presidential election.\n\n\n-----\n\n**Figure 10: The malicious document used to drop a self­extracting archive in %temp% (top) and the subsequent decoy document displayed to**\n\n**the victim (bottom).**\n\nHowever, the sentence is nonsensical and it reads as if the attacker simply concatenated a few unrelated lines together. Interestingly, a search for the\nsentences revealed that it had been used as the title of a spear phishing email sent to a number of politicians and activists in Hong Kong including\nJames To[8], Tommy Cheung[9] and Joshua Wong.[10] Wong is a well­known student activist in Hong Kong and he publicly announced on\nFacebook on 6th January 2016 that he had received the spear phishing email but was not tricked into opening the .rar attachment (Figure 11), which\nshares the same filename as the document file referenced in Figure 10.\n\n\n-----\n\nExamining the EXIF data of the decoy document dropped by our sample shows that the document was created on the same day as the spear phishing\nemail was sent.\n\n**Figure 12: EXIF data of the decoy document highlight the similarity in timing of the attack.**\n\nGiven similarities in the theme and text used in the spear phish, as well as the timing of the campaign against the Hong Kong activist and the creation\ntime of the decoy document, we believe both attacks are likely to be the same.\n\nReturning to the analysis of our sample, once the lure document is executed, a self­extracting archive is dropped and executed. The archive contains\nthree files, a batch script, a copy of the wget binary and a further binary called iuso.exe.\n\n**Figure 13: The dropped self­extracting archive.**\n\nOnce executed, the binaries are dropped in the %programdata% directory and the batch script is executed to download the second stage malware\n\nfrom a compromised host kcico[.]com.\n\n**Figure 14: Batch script used to download the malware from a compromised website.**\n\nThe downloaded binary wthk.exe is then executed and two new nested directories are generated in %programdata%: “Javame” and “sun\n\norcal”. Based on the use of this unique folder name “sun orcal” which dates back to as early as 2013[11] and which appears to be a misspelling\n\nof Sun Oracle, we refer to this malware as SunOrcal.\n\nBelow are the full nested paths:\n\nC:\\ProgramData\\Javame\\Java\\Jre\\helper\\113507\n\nC:\\ProgramData\\sun orcal\\java\\JavaUpdata\n\nC:\\ProgramData\\sun orcal\\java\\SunJavaUpdata\n\nOnce wthk.exe is executed, it clones itself to \\sun orcal\\java\\SunJavaUpdata as a file called SunJavaUpdata.exe. In addition, a\n\nshortcut called SunJavaUpdataData.lnk is created in the Javame folder which points to the malware SunJavaUpdata.exe.\n\nThe purpose of this shortcut became clear when we examined the changes made to the registry. The malware modifies the startup key at\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folder\\ to point to the\n\n\\Javame\\Java\\Jre\\helper\\113507 directory, causing Explorer to execute the shortcut when it first loads and which in effect ensures the\n\nmalware is executed on startup.\n\n\n-----\n\n**SunOrcal persistence mechanism.**\n\nAs shown in the batch script, once wthk.exe has finished executing, iuso.exe is then executed. Examining the code of this binary shows that\n\nthe sole purpose of this binary is to sleep for one minute and then execute a binary in %programdata% called Keyainst.exe. Unfortunately, we\n\nwere unable to retrieve this binary.\n\nExamining the network traffic generated by SunJavaUpdata.exe, we find that the malware communicates with the C2 domain\n\nsafety.security­centers[.]com which resolved to the IP address 210.61.12[.]153 at\n\nthe time of writing. According to DomainTools[12], the domain security­centers[.]com is associated with two email addresses:\n\nRegistrant email: an_ardyth@123mail.org\n\nAdmin/tech email: janmiller­domain@googlemail.com\n\nInterestingly, the malware stores the C2 in the registry key at HKCU\\Software\\Google\\info:\n\n**Figure**\n**16: C2 information and campaign code stored in registry.**\n\nThe figure also shows what appears to be a campaign code “wthkdoc0106” with “wthk” being the malware name, “doc” being the type of\n\ndocument used for malware delivery and “0106” denoting 6th January which is the date of the attack, as shown in Figure 11 and Figure 12.\n\nAside from the campaign code, the malware also has a hardcoded mutex “M&BX^DSF&DA@F”:\n\n\n-----\n\n**Figure 17: Hardcoded mutex M&BX^DSF&DA@F.**\n\nAnother interesting observable from the malware sample is a call to a DLL function, FunctionWork, which is hardcoded in the malware.\n\n**Figure 18: SunOrcal malware calls a function called FunctionWork which is hardcoded in the malware.**\n\nAlthough we were unable to find direct overlap in network infrastructure used by our SunOrcal sample and other threat actors, we were able to\nidentify other SunOrcal samples which have shared network infrastructure with the Surtr malware, previously reported by Citizen Labs[13] back in\n2013.\n\nIn particular, by finding samples that create the same folder names “javame” and “sun orcal”, we came across the following SunOrcal samples\n\nwhich shares the same mutex, folder structure, registry paths and calls the DLL function “FunctionWork”:\n\n6b3804bf4a75f77fec98aeb50ab24746 (C2: www.olinaodi[.]com)\n\n1fd33fe7c2800225bfc270f9ae053b65 (C2: www.eyesfeel256[.]com)\n\n397021af7c0284c28db65297a6711235 (C2: safetyssl.security­centers[.]com)\n\n415f5752bf5182b9d108d7478ba950f9 (C2: www.eyesfeel256[.]com)\n\nLooking at the WHOIS information of olinaodi[.]com and eyesfeel256[.]com show that they are registered with the same email address\n\ntoucan6712@163.com. A reverse WHOIS lookup on the email address returned a total of fourteen domains, the majority of which follow related\n\nthemes such as fly, dream, eyes and feel.\n\nParticularly interesting is flyoutside[.]com which was reported by Citizen Lab in 2013 as a C2 domain associated with the Surtr malware. The\n\nSurtr samples associated with this C2 are:\n\n\n-----\n\n6da1abd5d7ed21a3328d9fdfaf061f24\n\n**Figure**\n**19: List of domains registered using the email address toucan6712@163.com.**\n\nBased on the use of the same registrant email address that is associated with only a small number of domains with related themes in addition to the\ntargeting of Tibet and Hong Kong, both of which are autonomous regions that have been problematic to China’s internal security, we believe with\nhigh confidence that both SunOrcal and Surtr RATs are used by the same threat actor. Based on the creation date of some of the domains, we believe\nthe threat actor has been active as early as 2010.\n\n**Conclusion**\nSpear phishing has long been one of the most common and effective ways in which an attacker can deliver malware on to victim machines to\ncompromise target organisations. The success or failure of this technique relies on the ability of attackers to trick victims into opening the malicious\nattachment and this is why high­profile events and headlines are often used as lures.\n\nAs with other high­profile events, the Taiwanese presidential election in January was no different. In this blog post, we have shown that three distinct\nespionage threat actors have used the election as theme to lure their victims into opening the malicious documents. This highlights the importance of\nsecurity awareness training to ensure staff members, particularly those with access to sensitive information, remain vigilant in order to help defend\nagainst well­crafted spear­phishing attacks.\n\nMichael Yip | Cyber Threat Detection & Response\n\n+44 (0)20 78043900\n\n### @michael_yip\n\n[1] http://www.bloomberg.com/news/articles/2015­12­20/taiwan­opposition­hacked­as­china­s­cyberspies­step­up­attacks­iif2vmh1\n\n[[2] See http://blog.trendmicro.com/trendlabs­security­intelligence/evilgrab­malware­family­used­in­targeted­attacks­in­asia/ and, more recently,](http://blog.trendmicro.com/trendlabs-security-intelligence/evilgrab-malware-family-used-in-targeted-attacks-in-asia/)\n\n\n-----\n\n[4] http://www.arbornetworks.com/blog/asert/wp content/uploads/2014/06/ASERT Threat Intelligence Brief 2014 07 Illuminating Etumbot APT.pdf\n\n[5] www.taiwanthinktank.org/english/welcome\n\n[6] http://www.taiwanthinktank.org/chinese/page/5/71/3074/0\n\n[7] Note that it is possible to provide a fake address when creating a SSL certificate and so this does not necessarily mean that the attacker controls this email address.\n\n[8] https://en.wikipedia.org/wiki/James_To\n\n[9] https://zh.wikipedia.org/wiki/%E5%BC%B5%E7%A7%80%E8%B3%A2\n\n[10] https://en.wikipedia.org/wiki/Joshua_Wong_(activist)\n\n[11] http://contagiodump.blogspot.co.uk/2013/09/sandbox­miming­cve­2012­0158­in­mhtml.html\n\n[12] https://whois.domaintools.com/security­centers.com\n\n[13] https://citizenlab.org/2013/08/surtr­malware­family­targeting­the­tibetan­community/\n\n[« Cyber security ­ Are you ready for the new data privacy world? | Main](http://pwc.blogs.com/cyber_security_updates/2016/02/client-webcast-cyber-security.html)\n\n**Comments**\n\n**Verify your Comment**\n\n**Previewing your Comment**\n\nPosted by: |\nThis is only a preview. Your comment has not yet been posted.\n\nPost Edit\n\nYour comment could not be posted. Error type:\n[Your comment has been saved. Comments are moderated and will not appear until approved by the author. Post another comment](javascript:void 0;)\nThe letters and numbers you entered did not match the image. Please try again.\nAs a final step before posting your comment, enter the letters and numbers you see in the image below. This prevents automated programs from\nposting comments.\nHaving trouble reading this image? View an alternate.\n\nContinue\n\n© 2012­2016 PwC. All rights reserved. PwC refers to the PwC network and/or one or more of its member firms, each of which is a separate legal\n[entity. Please see www.pwc.com/structure for further details.](http://www.pwc.com/gx/en/about/corporate-governance/network-structure.html)\n[Privacy Statement](http://www.pwc.co.uk/who-we-are/privacy-statement.html)\n[Cookies info](http://www.pwc.co.uk/who-we-are/cookies.html)\n[Legal Disclaimer](http://www.pwc.co.uk/who-we-are/legal-disclaimer.html)\n[Provision of Services](http://www.pwc.co.uk/who-we-are/provision-of-services.html)\n[Diversity](http://www.pwc.co.uk/who-we-are/corporate-sustainability/encouraging-diversity.html)\n\n|Post|Edit|\n|---|---|\n\n|Col1|Col2|\n|---|---|\n|Continue||\n\n\nContinue\n\n\nPost\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/lyradpx3h7eic3dyiz33ufiia0wj7otn",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.03.17.Taiwan-election-targetting/PWC_Taiwan-Presidential-Election-A-Case-Study-on-Thematic-Targeting%28Mar-17-2016%29.pdf"
    ],
    "report_names": [
        "PWC_Taiwan-Presidential-Election-A-Case-Study-on-Thematic-Targeting(Mar-17-2016)"
    ],
    "threat_actors": [
        {
            "id": "d18fe42c-8407-4f96-aee0-a04e6dce219a",
            "created_at": "2023-01-06T13:46:38.275292Z",
            "updated_at": "2025-03-27T02:00:02.79092Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "Calc Team",
                "IXESHE",
                "BRONZE GLOBE",
                "BeeBus",
                "DynCalc",
                "DNSCalc",
                "Crimson Iron",
                "NUMBERED PANDA",
                "TG-2754",
                "Group 22"
            ],
            "source_name": "MISPGALAXY:APT12",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6a660ea2-1118-404a-9f8f-f0d6a1e9f184",
            "created_at": "2022-10-25T15:50:23.685924Z",
            "updated_at": "2025-03-27T02:00:55.52357Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "APT12",
                "IXESHE",
                "DynCalc",
                "Numbered Panda",
                "DNSCALC"
            ],
            "source_name": "MITRE:APT12",
            "tools": [
                "Ixeshe",
                "RIPTIDE",
                "HTRAN"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c5f79f58-db78-4cd7-88cf-c029a2199360",
            "created_at": "2022-10-25T16:07:23.325227Z",
            "updated_at": "2025-03-27T02:02:09.738383Z",
            "deleted_at": null,
            "main_name": "APT 12",
            "aliases": [
                "APT 12",
                "BeeBus",
                "Bronze Globe",
                "CTG-8223",
                "Calc Team",
                "Crimson Iron",
                "DNSCalc",
                "DynCALC",
                "Group 22",
                "Numbered Panda"
            ],
            "source_name": "ETDA:APT 12",
            "tools": [
                "AUMLIB",
                "ETUMBOT",
                "Exploz",
                "Graftor",
                "HIGHTIDE",
                "IHEATE",
                "IXESHE",
                "RIPTIDE",
                "RapidStealer",
                "Specfix",
                "THREEBYTE",
                "bbsinfo",
                "mswab",
                "yayih"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6e26922-3f4f-4243-9af5-cf9bea8b93bd",
            "created_at": "2022-10-25T16:47:55.577163Z",
            "updated_at": "2025-03-27T02:05:17.26824Z",
            "deleted_at": null,
            "main_name": "BRONZE GLOBE",
            "aliases": [
                "CTG-8223 ",
                "DNSCalc",
                "DyncCalc",
                "Numbered Panda ",
                "APT12 "
            ],
            "source_name": "Secureworks:BRONZE GLOBE",
            "tools": [
                " BeepService",
                " Etumbot",
                " Gh0st RAT",
                " Ixeshe",
                " Mswab",
                " RAdmin",
                " Seatran",
                " SvcInstaller",
                " Ziyang",
                "Badpuck"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041584,
    "ts_creation_date": 1459728161,
    "ts_modification_date": 1459728161,
    "files": {
        "pdf": "https://archive.orkl.eu/b039fa56126220d8df26a5ad6853a884bd76581e.pdf",
        "text": "https://archive.orkl.eu/b039fa56126220d8df26a5ad6853a884bd76581e.txt",
        "img": "https://archive.orkl.eu/b039fa56126220d8df26a5ad6853a884bd76581e.jpg"
    }
}