{
    "id": "c01c88b0-5594-4072-bd13-8d59a2b49309",
    "created_at": "2023-01-12T14:59:55.450711Z",
    "updated_at": "2025-03-27T02:17:05.538989Z",
    "deleted_at": null,
    "sha1_hash": "de78ba8505e9b1a9417805a8275635197e818c96",
    "title": "2022-12-14 - Reassessing cyberwarfare. Lessons learned in 2022",
    "authors": "",
    "file_creation_date": "2022-12-29T00:29:10Z",
    "file_modification_date": "2022-12-29T00:29:10Z",
    "file_size": 2584699,
    "plain_text": "# Reassessing cyberwarfare. Lessons learned in 2022\n\n**[securelist.com/reassessing-cyberwarfare-lessons-learned-in-2022/108328/](https://securelist.com/reassessing-cyberwarfare-lessons-learned-in-2022/108328/)**\n\nAuthors\n\nGReAT\n\n[Kaspersky ICS CERT](https://securelist.com/author/icscert/)\n\nAt this point, it has become cliché to say that nothing in 2022 turned out the way we\nexpected. We left the COVID-19 crisis behind hoping for a long-awaited return to normality\nand were immediately plunged into the chaos and uncertainty of a twentieth-century-style\nmilitary conflict that posed serious risks of spreading over the continent. While the broader\ngeopolitical analysis of the war in Ukraine and its consequences are best left to experts, a\nnumber of cyberevents have taken place during the conflict, and our assessment is that they\nare very significant.\n\n\n-----\n\nIn this report, we propose to go over the various activities that were observed in cyberspace\nin relation to the conflict in Ukraine, understand their meaning in the context of the current\nconflict, and study their impact on the cybersecurity field as a whole.\n\n**_Timeline of significant cyber-events predating Feb 24th_**\n\nIn the modern world, it has become very difficult to launch any kind of military campaign\nwithout intelligence support in the field. Most intelligence is gathered from various sources\nthrough methods such as HUMINT (human intelligence, gathered from persons located in\nthe future conflict area), SIGINT (signals intelligence, gathered through the interception of\nsignals), GEOINT (geospatial intelligence, such as maps from satellites), or ELINT\n(electronic intelligence, excluding text or voice), and so on.\n\n[For instance, according to the New York Times, in 2003, the United States made plans for a](https://www.nytimes.com/2009/08/02/us/politics/02cyber.html?_r=1)\nhuge cyberattack to freeze billions of dollars in Saddam Hussein’s bank accounts and cripple\nhis government before the invasion of Iraq. However, the plan was not approved because the\ngovernment feared collateral damage. Instead, a more limited plan to cripple Iraq’s military\nand government communication systems was carried out during the early hours of the war in\n2003. This operation included blowing up cellphone towers and communication grids as well\nas jamming and cyberattacks against Iraq’s telephone networks. According to the same\narticle, another such attack took place in the late 1990s when the American military attacked\na Serbian telecommunications network. Inadvertently, this also affected the Intelsat\ncommunications system for days, proving that the risk of collateral damage during\ncyberwarfare is pretty high.\n\n\n-----\n\nThe lessons learned from these events may allow predicting kinetic conflicts by monitoring\nnew cyberattacks in potential areas of conflict. For instance, in late 2013 and January 2014,\nwe observed higher-than-normal activity in Ukraine by the Turla APT group, as well as a\n[spike in the number of BlackEnergy APT sightings. Similarly, at the beginning of February](https://securelist.com/be2-custom-plugins-router-abuse-and-target-profiles/67353/)\n2022, we noticed a huge spike in the amount of activity related to Gamaredon C&C servers.\nThis activity reached hitherto-unseen levels, suggesting massive preparations for a major\nSIGINT gathering effort.\n\nAs shown by these cases, during modern conflicts, we can expect to see significant signs\nand spikes in cyberwarfare relating to both collection of intelligence and destructive attacks\nin the days and weeks preceding military attacks. Of course, we should note that the\nopposite is also possible: for instance, starting in June 2016, but most notably since\nSeptember 2016 all the way to December 2016, the Turla group intensified their satellitebased C&C registrations tenfold compared to its 2015 average. This indicated unusually high\nactivity by the Turla group, which signaled a never-before-seen mobilization of the group’s\nresources. At the same time, there was no ensuing military conflict that we know of.\n\n### Key insights\n\nToday’s military campaigns follow gathering of supporting intelligence in the field; this\nincludes SIGINT and ELINT among others\nSignificant military campaigns, such as the 2003 invasion of Iraq, have been\ncomplemented by powerful cyberattacks designed to disable the enemy’s\ncommunication networks\n\n\n-----\n\nIn February 2022, we noticed a huge spike in activity related to Gamaredon C&C\nservers; a similar spike was observed in Turla and BlackEnergy APT activity in late\n2013 and early 2014\nWe can expect to see significant signs and spikes in cyberwarfare in the days and\nweeks preceding military conflicts\n\n## Day one\n\nOn the very first day of the conflict (February 24, 2022), a massive wave of indiscriminate\npseudo-ransomware and wiper attacks hit Ukrainian entities. We were not able to determine\nany form of consistency when it came to the targeting, which led us to believe that the main\nobjective of these attacks may have been to cause chaos and confusion — as opposed to\nachieving precise tactical goals. Conversely, the tools leveraged in this phase were just as\nvaried in nature:\n\nRansomware (IsaacRansom);\nFake ransomware (WhisperGate);\nWipers (HermeticWiper, CaddyWiper, DoubleZero, IsaacWiper);\nICS/OT wipers (AcidRain, Industroyer2).\n\nSome of them were particularly sophisticated. As far as we know, HermeticWiper remains\n[the most advanced wiper software discovered in the wild. Industroyer2 was discovered in the](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nnetwork of a Ukrainian energy provider, and it is very unlikely that the attacker would have\nbeen able to develop it without access to the same ICS equipment as used by the victim.\nThat said, a number of those tools are very crude from a software engineering perspective\nand appear to have been developed hurriedly.\n\nWith the notable exception of AcidRain (see below), we believe that these various\ndestructive attacks were both random and uncoordinated – and, we argue, of limited impact\nin the grand scheme of the war. Our assessment of the threat landscape in Ukraine in the\n[first months of the war can be found on SecureList.](https://securelist.com/evaluation-of-cyber-activities-and-the-threat-landscape-in-ukraine/106484/)\n\nThe volume of wiper and ransomware attacks quickly subsided after the initial wave, but a\n[limited number of notable incidents were still reported. The Prestige ransomware affected](https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/)\ncompanies in the transportation and logistics industries in Ukraine and Poland last October.\n[One month later, a new strain named RansomBoggs again hit Ukrainian targets – both](https://twitter.com/ESETresearch/status/1596181925663760386)\nmalware families were attributed to Sandworm. Other “ideologically motivated” groups\ninvolved in the original wave of attacks appear to be inactive now.\n\n### Key insights\n\nLow-level destructive capabilities can be bootstrapped in a matter of days.\n\n\n-----\n\nBased on the uncoordinated nature of these destructive attacks, we assess that some\nthreat actors appear to be capable of recruiting isolated groups of hackers on short\nnotice, to perform destabilizing tasks. We can only speculate as to whether those\ngroups are internal resources reassigned to low-level cyberattacks or external entities\nthat can be mobilized when the need arises.\nWhile the impact of these destructive cyber-attacks paled in comparison to the effects\nof the kinetic attacks taking place at the same time, it should be noted that this\ncapability could in theory be directed against any country outside of the context of an\narmed conflict and under the pretense of traditional cybercrime activity.\n\n## The Viasat “cyberevent”\n\nOn the [24th](https://twitter.com/NordnetOFFICIEL/status/1496774782527979523) [of February, Europeans who relied on the ViaSat-owned “KA-SAT” satellite faced](https://twitter.com/NordnetOFFICIEL/status/1496774782527979523)\n[major Internet access disruptions. This so-called “cyber-event”](https://www.cnbc.com/2022/02/28/ukraine-updates-viasat-says-cyber-event-disrupting-satellite-internet-service.html) [started around 4h UTC, less](https://twitter.com/netblocks/status/1498365220107997191?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1498365220107997191%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fnetblocks.org%2Freports%2Finternet-disruptions-registered-as-russia-moves-in-on-ukraine-W80p4k8K)\n[than two hours after the Russian Federation publicly announced the beginning of the “special](https://novayagazeta.ru/articles/2022/02/24/my-budem-stremitsia-k-demilitarizatsii-i-denatsifikatsii-ukrainy-putin-obiavil-o-nachale-spetsoperatsii-v-ukraine-news)\n[military operation” in Ukraine. As could be read from government requests for proposals, the](https://web.archive.org/web/20220313011410/https:/prozorro.gov.ua/tender/UA-2020-12-23-008256-c)\nUkrainian government and military are notable consumers of KA-SAT access, and were\n[reportedly affected by the event. But the disruptions also triggered major consequences](https://www.reuters.com/world/satellite-outage-caused-huge-loss-communications-wars-outset-ukrainian-official-2022-03-15/)\n[elsewhere, such as interrupting the operation of wind turbines in Germany.](https://www.reuters.com/business/energy/satellite-outage-knocks-out-control-enercon-wind-turbines-2022-02-28/)\n\n[ViaSat quickly suspected that disruptions could be the result of a cyberattack. It directly](https://www.reuters.com/business/aerospace-defense/satellite-firm-viasat-probes-suspected-cyberattack-ukraine-elsewhere-2022-02-28/)\n[affected satellite modems firmwares, but was](https://web.archive.org/web/20220310184453/https:/www.satsig.net/cgi-bin/yabb/YaBB.pl?num=1646161484) [still to be understood as of mid-March.](https://web.archive.org/web/20220310194524/https:/www.reversemode.com/2022/03/satcom-terminals-under-attack-in-europe.html)\nKaspersky experts ran their own investigations and notably uncovered a likely intrusion path\nto a remote access point in a management network, while analyzing modem internals and a\n[likely-involved wiper implant. The “AcidRain” wiper was first described later in March, while](https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/)\n[ViaSat published an official analysis of the cyber-attack. The latter confirmed that a threat](https://news.viasat.com/blog/corporate/ka-sat-network-cyber-attack-overview)\nactor got in through a remote-management network exploiting a poorly configured VPN, and\nultimately delivered destructive payloads, affecting tens of thousands of KA-SAT modems.\nOn May 10, the European Union attributed those malicious activities to the Russian\nFederation.\n\nA lot of technical details about this attack are still unknown and may later be shared away\n[from government eyes. Yet it is one of the most sophisticated attacks revealed to date in](https://www.reuters.com/world/europe/exclusive-us-spy-agency-probes-sabotage-satellite-internet-during-russian-2022-03-11/)\nconnection to the conflict in Ukraine. The malicious activities were likely conducted by a\nskilled and well-prepared threat actor, within an accurate timeframe which cannot be\n[fortuitous. While the sabotage has likely failed to disrupt the Ukrainian defense badly](https://zetter.substack.com/p/viasat-hack-did-not-have-huge-impact)\nenough, it had multiple effects beyond the battlefield: stimulating the US Senate to require a\n[state of play on satellite cybersecurity, accelerating SpaceX Starlink deployment (and later,](https://twitter.com/elonmusk/status/1579116633947525122)\n[unexpected bills), as well as questioning the rules for dual-use infrastructure during armed](https://edition.cnn.com/2022/10/13/politics/elon-musk-spacex-starlink-ukraine/index.html)\nconflicts.\n\n### Key insights\n\n\n-----\n\nThe ViaSat sabotage once again demonstrates that cyberattacks are a basic building\nblock for modern armed conflicts and may directly support key milestones in military\noperations.\nAs it has been suspected for years, advanced threat actors likely preposition\nthemselves in various strategic infrastructural assets in preparation for future disruptive\nactions.\nCyberattacks against common communication infrastructures are highly likely during\narmed conflict, as belligerents might consider these to be of dual use. Due to the\ninterlinked nature of the Internet, a cyberattack against this kind of infrastructure will\nlikely have side-effects for parties that are not involved in the armed conflict. Protection\nand continuity planning are of utmost importance for this communications\ninfrastructure.\nThe cyberattack raises concerns about the cybersecurity of commercial satellite\nsystems, which may support various applications, from selfie geolocation to military\n[communications. While protective measures against kinetic combat in space are](https://arstechnica.com/science/2019/07/france-says-it-will-create-its-own-space-based-weapons-program/)\n[frequently discussed by military forces, and more datacenters are expecting to fly soon](https://www.datacenterknowledge.com/hardware/space-final-frontier-data-centers)\n… ground-station management systems and operators still seem to be highly exposed\nto common cyberthreats.\n\n## Taking sides: professional ransomware groups, hacktivists, and DDoS attacks\n\nAs has always been the case, wartime has a very specific impact on the information\nlandscape. It is especially true in 2022, now that humanity commands the most potent\ninformation spreading tools ever created: social networks and their well-documented\n[amplification effect. Most real-world events related to the war (accounts of skirmishes, death](https://journals.sagepub.com/doi/full/10.1177/00027642221118264)\ntolls, prisoner of war testimonies) are shared and refuted online with varying degrees of good\nfaith. Traditional news outlets are also affected by the broader context of information warfare.\n\nDDoS attacks and, to a lesser extent, defacement of random websites have always been\nregarded as low-sophistication and low-impact attacks by the security community. DDoS\nattacks, in particular, require generating heavy network traffic that attackers typically cannot\nsustain for very long periods of time. As soon as the attack stops, the target website\nbecomes available again. Barring temporary loss of revenue for e-commerce websites, the\nonly value provided by DDoS attacks or defacement is the humiliation of the victim. Since\nnon-specialized journalists may not know the difference between the various types of\nsecurity incidents, their subsequent reporting shapes a perception of incompetence and\ninadequate security that may erode users’ confidence. The asymmetric nature of\ncyberattacks plays a key role in supporting a David vs. Goliath imagery, whereby symbolic\nwins in the cyberfield help convince ground troops that similar achievements are attainable\non the real-life battlefield.\n\n\n-----\n\nAccording to Kaspersky DDoS Protection, since the beginning of 2022 during 11 months the\nservice registered ~1.65 more attacks than in the whole 2021. While this growth may be not\ntoo significant, the resources have been under attack 64 times longer compared to 2021. In\n2021 the average attack lasted ~28 minutes, in 2022 – 18.5 hours, which is almost 40 times\nlonger. The longest attack lasted 2 days in 2021, 28 days (or 2486505 seconds) in 2022.\n\n**_Total duration of DDoS attacks detected by Kaspersky DDoS Protection in seconds,_**\n**_by week, 2021 vs 2022_**\n\nSince the start of the war, a number of (self-identified) hacktivist groups have emerged and\nstarted conducting activities to support either side. For instance, a stunt organized by the\ninfamous collective Anonymous involved causing a traffic jam in Moscow by sending dozens\nof taxis to the same location.\n\n\n-----\n\nKaspersky DDoS protection also reflects this trend. Massive DDoS attacks were spread\nunevenly over the year with the most heated times being in spring and early summer.\n\n**_Number of DDoS attacks detected by Kaspersky DDoS Protection in seconds, by_**\n**_week, 2021 vs 2022_**\n\nThe attackers peaked in February-early March, reflecting growth of hacktivism, which has\ndied down by autumn. Currently we see a regular anticipated dynamic of attacks, though\ntheir quality has changed. In May-June we detected extremely long attacks. Now their length\nhas stabilized, nevertheless, while typical attacks used to last a few minutes, now they last\nfor hours.\n\nOn February 25, 2022, the infamous Conti ransomware group announced their “full support\nof Russian government”. The statement included a bold phrase: “If anybody will decide to\n_organize a cyberattack or any war activities against Russia, we are going to use our all_\n_possible resources to strike back at the critical infrastructures of an enemy“. The group_\nfollowed up rather quickly with another post, clarifying their position in the conflict: “As a\n_response to Western warmongering and American threats to use cyber warfare against the_\n_citizens of Russian Federation, the Conti Team is officially announcing that we will use our_\n_full capacity to deliver retaliatory measures in case the Western warmongers attempt to_\n_target critical infrastructure in Russia or any Russian-speaking region of the world. We do not_\n_ally with any government and we condemn the ongoing war. However, since the West is_\n_known to wage its wars primarily by targeting civilians, we will use our resources in order to_\n_strike back if the well being and safety of peaceful citizens will be at stake due to American_\n_cyber aggression“._\n\nTwo days later, a Ukrainian security researcher leaked a large batch of internal private\nmessages between Conti group members, covering over one year of activity starting in\nJanuary 2021. This dump delivered a significant blow to the group who saw their inner\nactivities exposed before the public, including Bitcoin wallet addresses related to many\n\n\n-----\n\nmillion of US dollars received in ransom. At the same time, another cybercriminal group\ncalled “CoomingProject” and specializing in data leaks, announced they would support the\nRussian Government if they saw attacks against Russia:\n\nOther groups, such as Lockbit, preferred to stay neutral, claiming their “pentesters” were an\ninternational community, including Russians and Ukrainians, and it was “all business”, in a\nvery apolitical manner:\n\nOn February 26, Mykhailo Fedorov, the Vice Prime Minister and Minister of Digital\n[Transformation of Ukraine, announced the creation of a Telegram channel to “continue the](https://twitter.com/FedorovMykhailo/status/1497642156076511233)\nfight on the cyber front”. The initial Telegram channel had a typo in the name\n(itarmyofurraine) so a second one was created.\n\n\n-----\n\n**_IT ARMY of Ukraine Telegram channel_**\n\nThe channel operators constantly give tasks to the subscribers, such as DDoS’ing various\nbusiness corporations, banks, or government websites:\n\n\n-----\n\n**_List of DDoS targets posted by IT ARMY of Ukraine_**\n\nWithin a short time, the [IT Army of Ukraine, composed of volunteers coordinating via Twitter](https://en.wikipedia.org/wiki/IT_Army_of_Ukraine)\n[and Telegram, reportedly defaced or otherwise DDoSed over 800 websites, including high-](https://www.ukrinform.net/rubric-ato/3526518-it-army-attacks-over-800-russian-websites-in-two-weeks-ministry-of-digital-transformation.html)\nprofile entities such, as the Moscow Stock Exchange[1].\n\n\n-----\n\nParallel activity has also been observed by other groups, which have taken sides as the\nconflict was spilling over into neighboring countries. For instance, the Belarusian CyberPartisans claimed they had disrupted the operations of the Belarusian Railway by switching it\nto manual control. There goal was to slow the movement of Russian military forces through\nthe country.\n\n**_Belarusian Cyber-Partisans post_**\n\nA limited and by far not exhaustive list of some of the ransomware or hacktivist groups that\nexpressed their opinion about the conflict in Ukraine include:\n\n**Open UA support** **Open RU support** **Neutral**\n\nRaidForums Conti ransomware Lockbit ransomware\n\nAnonymous collective CoomingProject ransomware ALPHV ransomware\n\nIT ARMY of Ukraine Stormous ransomware\n\nBelarusian Cyber-Partisans KILLNET\n\nAgainstTheWest\n\nNB65\n\nSquad303\n\nKelvinsecurity + …\n\nAmong the openly pro-Russian groups, Killnet, which was originally established as a\nresponse to the “IT Army of Ukraine”, is probably the most active. In late April, they attacked\nRomanian Government websites in response to statements by Marcel Ciolacu, president of\nthe Romanian Chamber of Deputies, after he promised Ukrainian authorities “maximum\n[assistance”. On May 15, Killnet published a video on their telegram channel declaring war on](https://www.emcrc.co.uk/post/killnet-declare-war-on-the-uk-and-nine-other-nations)\n\n\n-----\n\nten nations: the United States, the United Kingdom, Germany, Italy, Latvia, Romania,\nLithuania, Estonia, Poland, and Ukraine. Following these activities, the international hacking\n[collective known as “Anonymous” declared cyber war against Killnet on May 23.](https://www.msn.com/en-us/news/world/anonymous-declares-cyber-war-against-pro-russian-hacker-group-killnet/ar-AAXClKn)\n\nKillnet continued its activities throughout 2022, preceding their attacks with an\nannouncement on their Telegram channel. In October, the group started attacking\n[organizations in Japan, which they later stopped due to a lack of funds. It later attacked a US](https://techmonitor.ai/technology/cybersecurity/japan-cyberattack-killnet)\n[airport and governmental websites and businesses, often without significant success. On](https://www.washingtonpost.com/transportation/2022/10/10/hackers-cyber-attack-airport-websites/)\n[November 23, Killnet briefly took down the website of the European Union. Killnet also](https://securityaffairs.co/wordpress/138906/hacktivism/killnet-ddos-european-parliament.html)\nrepeatedly targeted websites in Latvia, Lithuania, Norway, Italy, and Estonia. While Killnet’s\nmethods are not sophisticated, they continually make headlines and drive attention to the\ngroup’s activities and stance.\n\n### Key insights\n\nThe conflict in Ukraine has created a breeding ground for new cyberware activity by\nvarious parties including cybercriminals and hacktivists, who rushed to support their\nfavorite sides\nWe can expect the involvement of hacktivist groups in all major geopolitical conflicts\nfrom now on.\nThe cyberware activities are spilling over into neighboring countries and affecting a\nlarge number of entities, including governmental institutions and private companies\nSome groups, such as the IT Army of Ukraine, have been officially backed by\ngovernments, and their Telegram channels include hundreds of thousands of\nsubscribers\nThe majority of attacks have relatively low complexity\nMost of the time, attacks conducted by these groups have a very limited impact on\noperations but may erroneously be reported as serious incidents and cause\nreputational damage.\nThese activities may originate from genuine “grassroots” hacktivists, groups\nencouraged or supported by one of the belligerents, or from the belligerents\nthemselves – and telling which is which may well prove impossible.\n\n## Hack and leak\n\nOn the more sophisticated end of attacks attempting to hijack media attention, hack-and-leak\noperations have been on the rise since the beginning of the conflict. The concept is simple:\nbreaching into an organization and publishing its internal data online, often via a dedicated\nwebsite. This is significantly more difficult than a simple defacing operation, since not all\nmachines contain internal data worth releasing. Hack-and-leak operations, therefore, require\nmore precise targeting, and will, in most cases, also demand more skill from attackers, as\nthe information they are looking for is, more often than not, buried deep within in the victim’s\nnetwork.\n\n\n-----\n\n[An example of such a campaign is the doxing of Ukrainian soldiers. Western entities were](https://www.express.co.uk/news/science/1638740/russia-launches-cyberattack-poland-government-sites-shut-down-killnet-ukraine-war)\n[also targeted, such as the Polish government or many prominent pro-Brexit figures in the](https://notesfrompoland.com/2022/07/07/media-falling-into-putins-trap-in-reporting-hacked-emails-warns-polish-pm-following-latest-leak/)\nUK. In the latter cases, internal emails were published, leading to scrutiny by investigative\njournalists. In theory, these data leaks are subject to manipulation. The attackers have all the\ntime they need to edit any released document or could just as well inject entirely forged\nones.\n\nIt is important to note that it is absolutely unnecessary for the attacker to go to such lengths\nfor the data leak to be damaging. The public availability of the data is proof itself that a\nserious security incident took place, and the legitimate, original content may already contain\nincriminating information.\n\n### Key insights\n\nIn our [2023 APT predictions, we foresee that hack-and-leak operations will be on the](https://securelist.com/advanced-threat-predictions-for-2023/107939/)\nrise next year, as they are very efficient against entities that already have high media\nexposure and corruption levels (i.e. politicians).\nInformation warfare is not internal to a conflict, but instead directed at all onlookers. We\nexpect that the vast majority of such attacks will not be directed at the belligerents, but\nrather at entities who are perceived as being too supportive (or not supportive enough)\nof either side.\nWhether it is hack-and-leak operations or DDoS, cyberattacks emerge as a non-kinetic\nmeans of diplomatic signaling between states.\n\n## Poisoned open-source repositories, weaponizing open-source software\n\nOpen-source software has many benefits. Firstly, it is often free to use, which means that\nbusinesses and individuals can save money on software costs. However, since anyone can\ncontribute to the code and make improvements, this can also be abused and in turn, open\nsecurity trapdoors. On the other hand, since the code can be publicly examined for any\npotential security vulnerabilities, it also means that given enough scrutiny, the risks of using\nopen-source software can be mitigated to decent levels.\n\nBack in March, RIAEvangelist, the developer behind the popular npm package “node-ipc”,\n[published modified versions of the software that contained a special functionality if the](https://www.bleepingcomputer.com/news/security/big-sabotage-famous-npm-package-deletes-files-to-protest-ukraine-war/)\nrunning systems had a Russian or Belarusian IP address. On such systems, the code would\noverwrite all files with a heart emoji, additionally deploying the message, WITH-LOVEFROM-AMERICA.txt, originating in another module created by the same developer. The\nnode-ipc package is quite popular with over 800,000 users worldwide. As is often the case\nwith open-source software, the effect of deploying these modified “node-ipc” versions was\nnot restricted to direct users; other open-source packages, for instance “Vue.js”, which\nautomatically include the latest node-ipc version, amplified the effect.\n\n\n-----\n\nPackages aimed to be spread in the Russian market did not always lead to destruction of\nfiles, some of them contained hidden functionality such as adding a Ukrainian flag to a\nsection of the website of software or political statements in support of the country. In certain\ncases the functionality of the package is removed and replaced with political notifications. It\nis worth noting that not all packages had this functionality hidden with some authors\nannouncing the functionality in the package description.\n\n**_One of the projects encourages to spread a file that once opened will start hitting_**\n**_various pages of the enlisted servers via JavaScript to overload the websites_**\n\nOther repositories and software modules found on GitHub included those specifically created\nto DDoS Russian governmental, banking and media sites, network scanners specifically for\ngathering data about Russian infrastructure and activity and bots aimed at mass reporting of\nTelegram channels.\n\n### Key insights\n\nAs the conflict drags on, popular open-source packages can be used as a protest or\nattack platform by developers or hackers alike\nThe impact from such attacks can extend further that the open-source software itself,\npropagating to other packages that automatically rely on the trojanized code\n\n## Fragmentation\n\n\n-----\n\nDuring the past years, most notably after 2014, this process began to expand to the IT\nSecurity world, with nation states passing laws banning each other’s products, services, and\ncompanies.\n\nFollowing the start of the conflict in Ukraine in February 2022, we have seen a lot of western\ncompanies exiting the Russian market and leaving their users in a difficult position when it\ncomes to receiving security updates or support. At the same time, some western nations\nhave pushed laws banning the use of Russian software and services due to a potential risk\nof these being used to launch attacks.\n\nObviously, one cannot totally rule out the possibility of political pressure being applied to\nweaponize products, technologies, and services of some minor market players. When it\ncomes to global market leaders and respected vendors, however, we believe this to be\nextremely unlikely.\n\nOn the other hand, searching for alternative solutions can be extremely complicated.\nProducts from local vendors, whose secure development culture, as we have often found, is\nusually significantly inferior to that of global leaders, are likely to have “silly” security errors\nand zero-day vulnerabilities, rendering them easy prey for both cybercriminals and\nhacktivists.\n\nShould the conflict continue to exacerbate, organizations based in countries where the\npolitical situation does not require addressing the above issues, should still consider the\nfuture risk factors that may affect everyone:\n\nThe quality of threat detection decreases as IS developers lose some markets,\nresulting in the expected loss of some of their qualified IS experts. This is a real risk\nfactor for all security vendors experiencing political pressure.\nThe communication breakdowns between IS developers and researchers located on\nopposite sides of the new “iron curtain” or even on the same side (due to increased\ncompetition on local markets) will undoubtedly decrease the detection rates of security\nsolutions that are currently being developed.\nDecreasing CTI quality: unfounded politically motivated cyberthreat attribution,\nexaggerated threats, lower statement validity criteria due to political pressure and in an\nattempt to utilize the government’s political narrative to earn additional profits.\n\nGovernment attempts to consolidate information about incidents, threats, and vulnerabilities\nand to limit access to this information detract from overall awareness, since information may\nsometimes be kept under wraps without good reason.\n\n### Key insights\n\nGeopolitics are playing an important role and the process of fragmentation is likely\ngoing to expand\n\n\n-----\n\nSecurity updates are probably the top issue when vendors end support for products or\nleave the market\nReplacing established, global leaders with local products might open the doors to\ncybercriminals exploiting zero-day vulnerabilities\n\n## Did a cyberwar happen?\n\nEver since the beginning of the conflict, the cybersecurity community has debated whether or\nnot what was going on in Ukraine qualifies as “cyberwar”. One indisputable fact, as\ndocumented throughout this report, is that significant cyberactivity did take place in\nconjunction with the start of the conflict in Ukraine. This may be the only criteria we need.\n\nOn the other hand, many observers had envisioned that in the case of a conflict, devastating\npreemptive cyberattacks would cripple the “special operation” party. With the notable\nexception of the Viasat incident, whose actual impact remains hard to evaluate, this simply\ndid not take place. The conflict instead revealed an absence of coordination between cyberand kinetic forces, and in many ways downgraded cyberoffense to a subordinate role.\nRansomware attacks observed in the first weeks of the conflict qualify as distractions at best.\nLater, when the conflict escalated this November and the Ukrainian infrastructure (energy\nnetworks in particular) got explicitly targeted, it is very telling that the Russian military’s tool\nof choice for the job was missiles, not wipers[2].\n\n\nIf you subscribe to the definition of cyberwar as any kinetic conflict supported through cybermeans, regardless of their tactical or strategic value, then a cyberwar did happen in February\n[2022. Otherwise, you may be more satisfied with Ciaran Martin‘s qualification of](https://www.lawfareblog.com/cyber-realism-time-war)\n“cyberharassment”[3].\n\n### Key insights\n\nThere is a fundamental impracticality to cyberattacks; an impracticality that can only be\njustified when stealth matters. When it does not, physical destruction of computers\nappears to be easier, cheaper, and more reliable.\nUnless very significant cyberattacks have failed to reach public awareness, at the time\nof writing this, the relevance of cyberattacks in the context of open war has been vastly\noverestimated by our community.\n\n## Conclusion\n\nThe conflict in Ukraine will have a lasting effect on the cybersecurity industry and landscape\nas a whole. Whether the term “cyberwar” applies or not, there is no denying that the conflict\nwill forever change everyone’s expectations about cyberactivity conducted in wartime, when\na major power is involved. Unfortunately, there is a chance that established practice will\nbecome the de facto norm.\n\n\n-----\n\nBefore the war broke out, several ongoing multiparty processes (UN s [OEWG and](https://www.un.org/disarmament/open-ended-working-group/) [GGE)](https://www.un.org/disarmament/group-of-governmental-experts/)\nattempted to establish a consensus on acceptable and responsible behavior in cyberspace.\nGiven the extreme geopolitical tensions we are currently experiencing, it is doubtful that\nthese already difficult discussions will bear fruit in the near future.\n\n[A promising initiative in the meantime is the ICRC’s “digital emblem” project: a proposed](https://blogs.icrc.org/law-and-policy/2022/11/03/digital-emblemfive-questions-law-tech-policy/)\nsolution to clearly identify machines used for medical or humanitarian purposes, in the hopes\nthat attackers will refrain from damaging them. Just like the real-life red cross and red\ncrescent emblems cannot stop bullets, digital emblems will not prevent cyberattacks on a\ntechnical level – but they will at least make it obvious to everyone that medical infrastructure\nis not a legitimate target.\n\nAs it seems more and more likely that the conflict will drag on for years, and with the death\ntoll already being high… we hope that everyone can at least agree on that.\n\n_[1]_ _The point of this section is not to evaluate the accuracy of those numbers, which are self-_\n\n_reported in many cases, but to study how these cyberattacks are used to shape narratives._\n\n\n\n[2] This report does not make the assumption that the Russian military would use, could use,\n\n[or has ever used wiper malware. US-CERT however went on the record on this exact](https://www.cisa.gov/uscert/ncas/alerts/aa22-110a)\n[subject. So did a number of industry peers.](https://techmonitor.ai/technology/cybersecurity/gru-russia-hacktivist-google-mandiant)\n\n[3] We recognize that information about ongoing cyberattacks and their impact isn’t exactly\n\nforthcoming. This assessment may be revised at a later date, when more data becomes\navailable.\n\n[APT](https://securelist.com/tag/apt/)\n[Cyberwarfare](https://securelist.com/tag/cyberwarfare/)\n[Data leaks](https://securelist.com/tag/data-leaks/)\n[DDoS-attacks](https://securelist.com/tag/dos-attacks/)\n[Doxing](https://securelist.com/tag/doxing/)\n[hacktivists](https://securelist.com/tag/hacktivists/)\n[Malware](https://securelist.com/tag/malware/)\n[Nation State Sponsored Espionage](https://securelist.com/tag/nation-state-sponsored-espionage/)\n[Open source](https://securelist.com/tag/open-source/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Wiper](https://securelist.com/tag/wiper/)\n\nAuthors\n\n\n-----\n\nGReAT\n\n[Kaspersky ICS CERT](https://securelist.com/author/icscert/)\n\nReassessing cyberwarfare. Lessons learned in 2022\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-14 - Reassessing cyberwarfare. Lessons learned in 2022.pdf"
    ],
    "report_names": [
        "2022-12-14 - Reassessing cyberwarfare. Lessons learned in 2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f547e816-ea17-442e-915d-c5c76a30669b",
            "created_at": "2022-10-25T16:07:23.891717Z",
            "updated_at": "2025-03-27T02:02:10.016882Z",
            "deleted_at": null,
            "main_name": "NB65",
            "aliases": [],
            "source_name": "ETDA:NB65",
            "tools": [
                "NB65"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4f472ea8-b147-486d-8533-88f8036343a6",
            "created_at": "2024-01-23T13:22:35.081084Z",
            "updated_at": "2025-03-27T02:00:03.285792Z",
            "deleted_at": null,
            "main_name": "Cyber Partisans",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Partisans",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8754f54b-7154-4996-b065-94f04f846022",
            "created_at": "2023-11-07T02:00:07.095161Z",
            "updated_at": "2025-03-27T02:00:03.171719Z",
            "deleted_at": null,
            "main_name": "NB65",
            "aliases": [
                "Network Battalion 65"
            ],
            "source_name": "MISPGALAXY:NB65",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63f532e6-4b4a-4f17-bbff-8517f0dd1868",
            "created_at": "2024-01-09T02:00:04.192588Z",
            "updated_at": "2025-03-27T02:00:03.277255Z",
            "deleted_at": null,
            "main_name": "KelvinSecurity",
            "aliases": [],
            "source_name": "MISPGALAXY:KelvinSecurity",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "05b0c294-6e79-4d58-8291-73d2c1c7d9bd",
            "created_at": "2024-06-25T02:00:05.048321Z",
            "updated_at": "2025-03-27T02:00:03.392046Z",
            "deleted_at": null,
            "main_name": "BlueHornet",
            "aliases": [
                "APT49",
                "AgainstTheWest"
            ],
            "source_name": "MISPGALAXY:BlueHornet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535595,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1672273750,
    "ts_modification_date": 1672273750,
    "files": {
        "pdf": "https://archive.orkl.eu/de78ba8505e9b1a9417805a8275635197e818c96.pdf",
        "text": "https://archive.orkl.eu/de78ba8505e9b1a9417805a8275635197e818c96.txt",
        "img": "https://archive.orkl.eu/de78ba8505e9b1a9417805a8275635197e818c96.jpg"
    }
}