{
    "id": "c03a2fd2-9253-45f5-a5a5-4eca8bb6bb10",
    "created_at": "2023-01-12T15:02:01.549182Z",
    "updated_at": "2025-03-27T02:08:12.788529Z",
    "deleted_at": null,
    "sha1_hash": "1232dfff667981098cd36ae57756f25b43a3a29e",
    "title": "2022-09-02 - Buzzing in the Background- BumbleBee, a New Modular Backdoor Evolved From BookWorm",
    "authors": "",
    "file_creation_date": "2022-10-02T12:13:23Z",
    "file_modification_date": "2022-10-02T12:13:23Z",
    "file_size": 4732820,
    "plain_text": "# BumbleBee a New Modular Backdoor Evolved From BookWorm\n\n**[trendmicro.com/en_us/research/22/i/buzzing-in-the-background-bumblebee-a-new-modular-backdoor-evolv.html](https://www.trendmicro.com/en_us/research/22/i/buzzing-in-the-background-bumblebee-a-new-modular-backdoor-evolv.html)**\n\nSeptember 2, 2022\n\n_Updated on Sept. 6, 2022, at 11:55 p.m. ET to clarify the reason behind the naming of this_\n_BumbleeBee malware._\n\n_Updated on Sept. 2, 2022, at 9:55 p.m. ET to clarify the difference between this BumbleBee_\n_malware and the Bumblebee ransomware loader._\n\n## Introduction\n\nIn March 2021, we investigated a backdoor with a unique modular architecture. Its type of\nmodular framework made our static analysis more challenging because it required us to first\nrebuild its structure or use dynamic analysis to understand its functionality and behavior.\n\nWe called it “BumbleBee” since the developer of this tool originally named it as such\n(“bumblebee” in Chinese: 大黄蜂).\n\nOur analysis found that BumbleBee only had little malicious code in its payload, and what it\ndoes on the surface is track keys and clipboard content. However, further investigation revealed\na controller application that expands the malware’s capabilities.\n\nThis type of backdoor is similar to another of its kind called BookWorm, in which it can be\ninferred that BumbleBee is a refactored version of BookWorm. At the time of writing, BumbleBee\nhas only been deployed in Taiwan; together with its use of Simplified Chinese as the language\nfor its user interface, this malware can be suspected to be deployed by malicious Chinese\nactors. This blog will tackle BumbleBee’s capabilities and our analysis of this backdoor. It's\nimportant to note that this BumbleBee malware family is different from the [Bumblebee loader, a](https://www.bleepingcomputer.com/news/security/new-bumblebee-malware-replaces-contis-bazarloader-in-cyberattacks/)\nloader malware that is used by ransomware groups to drop backdoors to gain access to\ncorporate networks.\n\n## BumbleBee – a refactored modular backdoor\n\nBumbleBee is a modular backdoor that comprises two applications, a server and a client\napplication (a master and slaver application, respectively in the malware’s jargon). Once the\nclient application is deployed on the target computer (these are commonly local government\ndevices), threat actors can control the machine using the server module. Let us take a deeper\nlook into this backdoor.\n\n**_Layered deployment – client application_**\n\n\n-----\n\nWe have encountered the client application in a security breach incident. Its unique layer-inlayer” architecture caught our attention. The module has a self-extracted file that contains three\nmain parts: a legitimate executable (XcrSvr.exe), side-loaded DLL (XecureIO_v20.dll) and the\nshellcode binary file (ore) in the file system to execute the legitimate executable.\n\nFigure 1. Architecture of BumbleBee\n\n\n-----\n\nFigure 2. Metadata of XcrSvr.exe\n\n_XCrSvr.exe is the executable in the XecureVistaCryptoSvr module developed by SoftForum._\nThis file is exploited to launch the side-loaded DLL, XecureIO_v20.dll, which will work as the\nnext-stage loader that executes the shellcode “ore,” which is the main component in this\nbackdoor. This shellcode contains multiple modules of its own (shown in Table 1). Each module\nhas corresponding 32-bit and 64-bit versions of binaries in the shellcode except for launcher.dll.\n\nName Description\n\n_launcher.dll_ The first-stage launcher that loads all the subsequent modules. It decrypts a list\nof modules in memory and executes each in order.\n\n_kernel.dll_ The utility component that controls all the other modules.\n\n_installer.dll_ The module used to install components in the compromised machine.\n\n_keylog.dll_ The keylog component monitors the keystrokes and clipboard content of the\nvictim, and records actions from the victim such as running a process, entering\na password, and getting the text of a window. The stolen data will then be run\nthrough a XOR logic gate with a two-byte key 0xF29D and saved under\n%temp%\\kb\\[UserName]\\. The timestamp will be used as the file name.\n\n_loader.dll_ The module that reads the shellcode.\n\n\n-----\n\n_slaver.dll_ The main module that interacts with the other methods once the backdoor is\nlaunched.\n\nTable 1. BumbleBee's modules\n\nIf a victim is compromised for the first time, launcher.dll loads and launches all the other\nmodules. The installer modules will be responsible for the installation and establishing\npersistence on the compromised machine via the following steps:\n\n1. Drop a copy of the XecureIO_v20.dll in %APPDATA%\\LOCAL\\TEMP folder.\n2. Encrypt original shellcode file (to be a “bin” file) and path information (to be a “path” file) by\n\nusing RC4 algorithm (key is the value of “ProductID” from\n“HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\Registration”)\n3. Drop bpu.dll (used to bypass UAC) and launched by rundll32.exe.\n4. Establish persistence on compromised machine.\n5. Delete the original SFX file.\n\nNotably, as XecureIO_v20.dll is loaded by XcrSvr.exe, it will check if the parent process is\n“XcrSvr.exe.” If so, it will patch the entry point of XcrSvr.exe with a long jump instruction to direct\nexecution flow to the malicious code.\n\nFigure 3. XecureIO_v20.dll hooks its parent process’ entry point\n\nFigure 4 The original entry point\n\n\n-----\n\nFigure\n\n5. The patched entry point\nBased on our analysis, we think the reason is that the malicious code embedded in\nXecureIO_v20 will not run if it followed the normal execution flow of XCrSvr.exe. Hence, once\n_XecureIO_v20.dll is loaded by XCrSvr.exe, it will patch the entry point of XCrSvr.exe and jump_\nto the address of the malicious code to make sure the code can be executed properly.\n\nAfter the client is installed and the persistence is established, the loader, XecureIO_v20.dll, will\nretrieve the value of “ProductID” from the registry key\n“HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\Registration” and use it as\nthe key to decrypt the encrypted payload (the file “bin”) dropped in the first installation. Using the\ninformation on the compromised machine as a key to encrypt the payload makes it much more\ndifficult for analysts to decrypt and debug the malware in the analysis environment.\n\n\nFile\nname\n\n\nDescription\n\n\npath An RC4-encrypted path string used to find the location of next-stage shellcode. It\ncould be a file path or a registry path starting with HKLM or HKCU.\n\nbin The next-stage RC4-encrypted shellcode payload.\n\nTable 2. Payload file names\n\n**_Expanded control – server application_**\n\nDue to BumbleBee’s complex client application, it took some time for us to fully analyze its\nfunctionality. While doing so, we ran across the server application of the malware that acts as a\ncontroller. This provided us with further understanding on how BumbleBee works.\n\nAs the client application is running on the infected device, it will communicate with the server\napplication and show the information of the machine it is in. Details, such as computer name,\nexternal IP address, geographic location, OS, CPU, and memory, are collected by the client\napplication.\n\n\n-----\n\nFigure 6. Connection established\n\nFigure 7. Built-in options in server application\nBased on the options in the server application shown in Figure 7, we can determine that it\nsupports the following functions for controlling the compromised machine:\n\nFunctions Description\n\n\n文件管理 (File\nmanagement)\n\n屏幕控制 (Remote\ndesktop control)\n\n进程管理 (Process\nmanagement)\n\n服务管理 (Service\nmanagement)\n\n注冊表编辑 (Registry\neditor)\n\n控制台命令\n(Command shell)\n\n\nUpload/download/delete/list files from the victim’s environment\n\nControl the victim’s desktop remotely\n\nList and manage running processes with the image names, current\nfolder, process id and parent process id\n\nList and manage current services status\n\nList and manage the victim’s registry key\n\nExecute the command shell\n\n\n-----\n\n交互式控制台\n(Interactive console)\n\n反向代理 (Reverse\nproxy)\n\n\nExecute the command shell\n\nReverse proxy to help expose a local server behind a NAT or firewall\nto the internet\n\n\n键盘记录 (Keylogger) Log keystrokes and clipboard contents\n\nTable 3. Supported functions\n\nBumbleBee’s modular framework allowed it to embed a small amount of malicious code that\ninvolves stealing keystrokes and clipboard content in the client’s shellcode. However, it could\nexpand its capabilities through its server application by loading additional modules. This design\nproves that BumbleBee is flexible, allowing its developers to focus on the development of\nadditional modules instead of having to rebuild the malware itself. Its structure could also reduce\nthe risk of exposing itself to analysts and their own modules for comparison.\n\n## Network communication\n\nBumbleBee communicates over the HTTP protocol. It first creates an HTTP request that acts as\na network beacon to notify the command and control (C&C) server. The POST request with the\nfollowing URL, http://<C&C server>/update/, is the initial network beacon. The client application\nwill send information of the compromised machine, which is encrypted by RC4 (see Figure 8\nand Figure 9) once the first connection is established successfully. All other communication\ntraffic, except for the victim information, are encrypted between server and client applications\nusing the RC4 and compressed by LZO (Lempel–Ziv–Oberhumer) algorithm.\n\nTo make sure the received payload is correct, BumbleBee adopts a CRC32 checksum with\nreversed-presentation mode to verify the received data. For the CRC32 calculation, a selfdefined value, ”20200105” is used as the initial value (typically, the value is 0xffffffff) for\nchecksum calculation.\n\n\n-----\n\nFigure 8. Encrypted information of the compromised machine\n\nFigure 9. Decrypted information (by RC4)\n\n## Persistence\n\nDuring the investigation, we found that BumbleBee adopted several techniques for persistence.\nIt will use different techniques depending on the configuration. Here are the techniques adopted\nby the BumbleBee sample we found:\n\nAbuse registry run key to repeatedly execute the malware once system boot\nCreate Windows services to repeatedly execute malicious payloads\nUse Windows logon scripts automatically executed at logon initialization to establish\npersistence via adding a Registry key HKEY_CURRENT_USER\\Environment\n\"UserInitMprLogonScript\"\n\n## Attribution\n\n\n-----\n\nDue to the unique modular structure and installation procedures, we started to work on a\nliterature review to clarify if it is an exclusive tool used by a certain threat actor. We found a\nsimilar backdoor, “BookWorm,” [revealed by Palo Alto in 2015. They share the following features:](https://unit42.paloaltonetworks.com/bookworm-trojan-a-model-of-modular-architecture/)\n\n1. Both are self-extracted files and abuse legitimate executables to load self-made malware.\n2. Both use the same registry value as RC4 encryption key to encrypt their payload.\n3. Both use modular architecture in the conception of the backdoor.\n4. Both appeared in Southeast Asia, targeting local government-related organizations (similar\n\nvictimology).\n5. Both use RC4 and LZO algorithms in C&C communications (similar network protocol).\n\nWe think BumbleBee is likely to be the refactored BookWorm backdoor. They have similar\ntactics, techniques, and procedures (TTPs), unique encryption approach, and similar target\nsectors. According to the language (Simplified Chinese) shown in server application, we suspect\nthat the origins and developers of BumbleBee may be in China and of Chinese descent.\n\n## Conclusion\n\nSince BumbleBee and Bookworm share the same features, BumbleBee is likely a refactored\nform of the latter. Focusing on Asian local government targets, all signs point to a suspect linked\nto a Chinese hacker group.\n\nBumbleBee, being a modular framework, is not only flexible but sophisticated as it will require\nanalysts to investigate its structure and behavior. Another aspect of having a modular framework\nis that they can just keep developing additional modules since it can easily be integrated with\nthe current version of said malware.\n\nWith its modular capabilities, the threat may deploy additional modules that may prove\ndangerous. Thus, an advanced layer of protection and quick detection is needed to prevent the\n[backdoor from taking root in the system. Trend Micro Vision One™ offers both within different](https://www.trendmicro.com/en_us/business/products/detection-response/managed-xdr-mdr.html)\nentry points of a backdoor.\n\n## IOCs\n\n_Trojan.Win32.MULTICOM.ZTIC_\n\n_f8809c6c56d2a0f8a08fe181614e6d9488eeb6983f044f2e6a8fa6a617ef2475_ _slaver.exe_\n\n_Trojan.Win32.REGLOAD.ZTI_\n\n_ea5db8d658f42acad38106cbc46eea5944607eb709fb00f8adb501d4779fbea0_ _XecureIO_v20.dll_\n\n_3fc6c5df4a04d555d5cbf2ca53bed7769b5595fc6143a2599097cb6193ef8810_ _XecureIO_v20.dll_\n\n\n-----\n\nBackdoor.Win32.BUMBLEB.ZTIC\n\n_eeca34fba68754e05e7307de61708e4ce74441754fcc6ae762148edf9e8e2ca0_ ore\n\n_6690b7ace461b60b7a72613c202d70f4684c8cdc5afbb4267c67b5fe5dbf828e_ bin\n\n_4ecde81a476f1e4622d192fe2f120f7c5c3ec58bf118b791d5532f3ff61c09ee_ bin\n\n_8ab8bb836b074e170c129b7f0523d256930fd1f8cf126ca1875b450fdb6c4c05_ bin\n\n_515cb31b2c89df83ea6d54d5c0c3e4fe9a024319d9bd8fd76ad351860bd67ea3_ ore\n\n_8e340746339614ca105a1873dad471188b24421648d080e37d52b87f4ced5e6d_ bin\n\n**C&C:**\n\n-   http[:]//www[.]synolo[.]ns01[.]biz:80/update\n\n-   http[:]//118[.]163[.]105[.]130:80/update\n\n## MITRE\n\nTactics Techniques\n\nDefense Evasion T1574.002 - Hijack Execution Flow: DLL SideLoading\n\nT1070.004 - Indicator Removal on Host:\nFile Deletion\n\nT1055 - Process Injection\n\nT1480.001 - Execution Guardrails:\nEnvironmental Keying\n\nPersistence T1547.001 - Boot or Logon Autostart Execution:\nRegistry Run Keys / Startup Folder\n\nT1037.001 - Boot or Logon Initialization\nScripts: Logon Script (Windows)\n\nT1548.003 - Create or Modify System\nProcess: Windows Service\n\nPrivilege Escalation T1548.002 - Abuse Elevation Control\nMechanism: Bypass User Account Control\n\nCollection T1056.001 - Input Capture: Keylogging\n\nReconnaissance T1592 - Gather Victim Host Information\n\n\n-----\n\nCommand and Control T1071.001 - Application Layer Protocol: Web\nProtocols\n\nT1090 - Proxy\n\nT1573.001 - Encrypted Channel:\nSymmetric Cryptography\n\nT1132.001 - Data Encoding: Standard\nEncoding\n\nResource Development T1587.001 - Develop Capabilities: Malware\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-02 - Buzzing in the Background- BumbleBee, a New Modular Backdoor Evolved From BookWorm.pdf"
    ],
    "report_names": [
        "2022-09-02 - Buzzing in the Background- BumbleBee, a New Modular Backdoor Evolved From BookWorm.pdf"
    ],
    "threat_actors": [
        {
            "id": "8386d4af-5cca-40bb-91d7-aca5d1a0ec99",
            "created_at": "2022-10-25T16:07:23.414558Z",
            "updated_at": "2025-03-27T02:02:09.787347Z",
            "deleted_at": null,
            "main_name": "Bookworm",
            "aliases": [],
            "source_name": "ETDA:Bookworm",
            "tools": [
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Scieron",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "ffrat",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535721,
    "ts_updated_at": 1743041292,
    "ts_creation_date": 1664712803,
    "ts_modification_date": 1664712803,
    "files": {
        "pdf": "https://archive.orkl.eu/1232dfff667981098cd36ae57756f25b43a3a29e.pdf",
        "text": "https://archive.orkl.eu/1232dfff667981098cd36ae57756f25b43a3a29e.txt",
        "img": "https://archive.orkl.eu/1232dfff667981098cd36ae57756f25b43a3a29e.jpg"
    }
}