{
    "id": "c0ae20b6-f19a-4f96-af82-c705f9226cae",
    "created_at": "2023-01-12T14:59:42.677784Z",
    "updated_at": "2025-03-27T02:16:26.575725Z",
    "deleted_at": null,
    "sha1_hash": "ddfb15789f85f984c2e0790f6d22df517f7d4298",
    "title": "2021-10-19 - Social Network Account Stealers Hidden in Android Gaming Hacking Tool",
    "authors": "",
    "file_creation_date": "2022-05-29T10:34:57Z",
    "file_modification_date": "2022-05-29T10:34:57Z",
    "file_size": 373058,
    "plain_text": "# Social Network Account Stealers Hidden in Android Gaming Hacking Tool\n\n**[mcafee.com/blogs/other-blogs/mcafee-labs/social-networks-account-stealer-hidden-in-android-gaming-hacking-tool/](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/social-networks-account-stealer-hidden-in-android-gaming-hacking-tool/)**\n\nOctober 19, 2021\n\nAuthored by: Wenfeng Yu\n\nMcAfee Mobile Research team recently discovered a new piece of malware that specifically\nsteals Google, Facebook, Twitter, Telegram and PUBG game accounts. This malware hides\nin a game assistant tool called “DesiEsp” which is an assistant tool for PUBG game available\non GitHub. Basically, cyber criminals added their own malicious code based on this DesiEsp\nopen-source tool and published it on Telegram. PUBG game users are the main targets of\nthis Android malware in all regions around the world but most infections are reported from\nthe United States, India, and Saudi Arabia.\n\n## What is an ESP hack?\n\n[ESP Hacks, (short for Extra-Sensory Perception) are a type of hack that displays player](https://combatarms.fandom.com/wiki/ESP_Hacks)\ninformation such as HP (Health Points), Name, Rank, Gun etc. It is like a permanent tunedup [KDR/HP Vision. ESP Hacks are not a single hack, but a whole category of hacks that](https://combatarms.fandom.com/wiki/KDR_/_HP_Vision)\nfunction similarly and are often used together to make them more effective.\n\n## How can you be affected by this malware?\n\nAfter investigation, it was found that this malware was spread in the channels related to\nPUBG game on the Telegram platform. Fortunately, this malware has not been found\non Google Play.\n\n\n-----\n\nFigure 1. Re-packaged hacking tool distributed in Telegram\n\n## Main dropper behavior\n\nThis malware will ask the user to allow superuser permission after running:\n\nFigure 2. Initial\n\nmalware requesting root access.\nIf the user denies superuser request the malware will say that the application may not work:\n\n\n-----\n\nFigure 3.\n\nError message when root access is not provided\nWhen it gains root permission, it will start two malicious actions. First, it will steal accounts by\naccessing the system account database and application database.\n\nFigure 4. Get a Google account from the Android system account database.\nSecond, it will install an additional payload with package\nname “com.android.google.gsf.policy_sidecar_aps” using the “pm install”\ncommand. The payload package will be in the assets folder, and it will disguise the file name\nas “*.crt” or “*.mph”.\n\nFigure 5. Payload disguised as a certificate file\n\n(crt extension)\n\n## Stealing social and gaming accounts\n\nThe dropped payload will not display icons and it does not operate directly on the screen of\nthe user’s device. In the apps list of the system settings, it usually disguises the package\nname as something like “com.google.android.gsf” to make users think it is a system service\nof Google It runs in the background in the way of Accessibility Service Accessibility Service\n\n\n-----\n\nis an auxiliary function provided by the Android system to help people with physical\ndisabilities use mobile apps. It will connect to other apps like a plug-in and can it access the\nActivity, View, and other resources of the connected app.\n\nThe malware will first try to get root permissions and IMEI (International Mobile Equipment\nIdentity) code that later access the system account database. Of course, even if it does not\nhave root access, it still has other ways to steal account information. Finally, it also will try to\nactivate the device-admin to difficult its removal.\n\n## Methods to steal account information\n\nThe first method to steal account credentials that this malware uses is to monitor the login\nwindow and account input box text of the stolen app through the AccessibilityService\ninterface to steal account information. The target apps include Facebook\n(com.facebook.kakana), Twitter (com.twitter.android), Google (com.google.android.gms) and\nPUBG MOBILE game (com.tencent.ig)\n\nThe second method is to steal account information (including account number, password,\nkey, and token) by accessing the account database of the system, the user config file, and\nthe database of the monitored app. This part of the malicious code is the same as the parent\nsample above:\n\nFigure 6. Malware accessing Facebook account information using root privileges\nFinally, the malware will report the stolen account information to the hacker’s server via\nHTTP.\n\n## Gaming users infected worldwide\n\nPUBG games are popular all over the world, and users who use PUBG game assistant tools\nexist in all regions of the world. According to McAfee telemetry data, this malware and its\nvariants affect a wide range of countries including the United States, India, and Saudi\nArabia:\n\n\n-----\n\nFigure 7. Top affected countries include USA, India, and Saudi Arabia\n\n## Conclusion\n\nThe online game market is revitalizing as represented by e-sports. We can play games\nanywhere in various environments such as mobiles, tablets, and PCs (personal computers).\nSome users will be looking for cheat tools and hacking techniques to play the game in a\nslightly advantageous way. Cheat tools are inevitably hosted on suspicious websites by their\nnature, and users looking for cheat tools must step into the suspicious websites. Attackers\nare also aware of the desires of such users and use these cheat tools to attack them.\n\nThis malware is still constantly producing variants that use several ways to counter the\ndetection of anti-virus software including packing, code obfuscation, and strings encryption,\nallowing itself to infect more game users.\n\nMcAfee Mobile Security detects this threat as Android/Stealer and protects you from this\nmalware attack. Use security software on your device. Game users should think twice before\ndownloading and installing cheat tools, especially when they request Superuser or\naccessibility service permissions.\n\n## Indicators of Compromise\n\n**Dropper samples**\n\n36d9e580c02a196e017410a6763f342eea745463cefd6f4f82317aeff2b7e1a5\n\nfac1048fc80e88ff576ee829c2b05ff3420d6435280e0d6839f4e957c3fa3679\n\nd054364014188016cf1fa8d4680f5c531e229c11acac04613769aa4384e2174b\n\n\n-----\n\n3378e2dbbf3346e547dce4c043ee53dc956a3c07e895452f7e757445968e12ef\n\n7e0ee9fdcad23051f048c0d0b57b661d58b59313f62c568aa472e70f68801417\n\n6b14f00f258487851580e18704b5036e9d773358e75d01932ea9f63eb3d93973\n\n706e57fb4b1e65beeb8d5d6fddc730e97054d74a52f70f57da36eda015dc8548\n\nff186c0272202954def9989048e1956f6ade88eb76d0dc32a103f00ebfd8538e\n\n706e57fb4b1e65beeb8d5d6fddc730e97054d74a52f70f57da36eda015dc8548\n\n3726dc9b457233f195f6ec677d8bc83531e8bc4a7976c5f7bb9b2cfdf597e86c\n\ne815b1da7052669a7a82f50fabdeaece2b73dd7043e78d9850c0c7e95cc0013d\n\n**Payload samples**\n\n8ef54eb7e1e81b7c5d1844f9e4c1ba8baf697c9f17f50bfa5bcc608382d43778\n\n4e08e407c69ee472e9733bf908c438dbdaebc22895b70d33d55c4062fc018e26\n\n6e7c48909b49c872a990b9a3a1d5235d81da7894bd21bc18caf791c3cb571b1c\n\n9099908a1a45640555e70d4088ea95e81d72184bdaf6508266d0a83914cc2f06\n\nca29a2236370ed9979dc325ea4567a8b97b0ff98f7f56ea2e82a346182dfa3b8\n\nd2985d3e613984b9b1cba038c6852810524d11dddab646a52bf7a0f6444a9845\n\nef69d1b0a4065a7d2cc050020b349f4ca03d3d365a47be70646fd3b6f9452bf6\n\n06984d4249e3e6b82bfbd7da260251d99e9b5e6d293ecdc32fe47dd1cd840654\n\n**Domain**\n\nhosting-b5476[.]gq\n\n[McAfee Labs Threat Research Team](https://www.mcafee.com/blogs/author/mcafee-labs/)\nMcAfee Labs is one of the leading sources for threat research, threat intelligence, and\ncybersecurity thought leadership. See our blog posts below for more information.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-19 - Social Network Account Stealers Hidden in Android Gaming Hacking Tool.pdf"
    ],
    "report_names": [
        "2021-10-19 - Social Network Account Stealers Hidden in Android Gaming Hacking Tool.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535582,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653820497,
    "ts_modification_date": 1653820497,
    "files": {
        "pdf": "https://archive.orkl.eu/ddfb15789f85f984c2e0790f6d22df517f7d4298.pdf",
        "text": "https://archive.orkl.eu/ddfb15789f85f984c2e0790f6d22df517f7d4298.txt",
        "img": "https://archive.orkl.eu/ddfb15789f85f984c2e0790f6d22df517f7d4298.jpg"
    }
}