{
    "id": "c0b1bd1b-77fb-4353-9b4c-d1b1723707c2",
    "created_at": "2023-01-12T15:07:32.590864Z",
    "updated_at": "2025-03-27T02:05:48.332265Z",
    "deleted_at": null,
    "sha1_hash": "45b102b10196f9efc3580af91e5a86e5dc1bb89d",
    "title": "2018-11-12 - What’s new in TrickBot- Deobfuscating elements",
    "authors": "",
    "file_creation_date": "2022-05-28T02:32:10Z",
    "file_modification_date": "2022-05-28T02:32:10Z",
    "file_size": 556179,
    "plain_text": "# What’s new in TrickBot? Deobfuscating elements\n\n**[blog.malwarebytes.com/threat-analysis/malware-threat-analysis/2018/11/whats-new-trickbot-deobfuscating-elements/](https://blog.malwarebytes.com/threat-analysis/malware-threat-analysis/2018/11/whats-new-trickbot-deobfuscating-elements/)**\n\nhasherezade November 12, 2018\n\n[Trojan.TrickBot has been present in the threat landscape from quite a while. We wrote about](https://blog.malwarebytes.com/detections/trojan-trickbot/)\nits first version [in October 2016. From the beginning, it was a well organized modular](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\nmalware, written by developers with mature skills. It is often called a banker, however its\nmodular structure allows to freely add new functionalities without modifying the core bot. In\n[fact, the functionality of a banker is represented just by one of many of its modules.](https://www.webroot.com/blog/2018/03/21/trickbot-banking-trojan-adapts-new-module/)\n\n[With time, developers extended TrickBot capabilities by implementing new modules – for](https://www.malwarebytes.com/trickbot/)\n[example, the one for stealing Outlook credentials. But the evolution of the core bot, that was](https://blog.malwarebytes.com/threat-analysis/2017/08/trickbot-comes-with-new-tricks-attacking-outlook-and-browsing-data/)\nused for the deployment of those modules, was rather slow. The scripts written to decode\nmodules from the first version worked till recent months, showing that the encryption schema\nused to protect them stayed unchanged.\n\nOctober 2018 marks end of the second year since TrickBot’s appearance. Possibly the\nauthors decided to celebrate the anniversary by a makeover of some significant elements of\nthe core.\n\nThis post will be an analysis of the updated obfuscation used by TrickBot’s main module.\n\n## Behavioral analysis\n\n\n-----\n\nThe latest TrickBot starts its actions from disabling Windows Defender s real-time monitoring.\nIt is done by deploying a PowerShell command:\n\nAfter that, we can observe behaviors typical for TrickBot.\n\nAs before, the main bot deploys multiple instances of svchost, where it injects the modules.\n\nPersistence is achieved by adding a scheduled task:\n\nIt installs itself in %APPDATA%, in a folder with a name that depends on the bot’s version.\n\n\n-----\n\nEncrypted modules are stored in the Data folder (old name: Modules), along with their\nconfiguration:\n\nAs it turns out, recently the encryption of the modules has changed (and we had to update\n[the scripts for decoding).](https://github.com/hasherezade/malware_analysis/tree/master/trickbot)\n\nThe new element in the main installation folder is the settings file, that comes under various\nnames, that seems to be randomly chosen from some hardcoded pool. It’s most commonly\noccurring name is settings.ini (hardcoded), but there are other variants such as: profiles.ini,\nSecurityPreloadState.txt, pkcs11.txt. The format of the file looks new for the TrickBot:\n\n\n-----\n\nWe can see many strings, that at first looks scrambled/encrypted. But as it turns out, they are\njunk entries that are added for obfuscation. The real configuration is stored in between of\nthem, in a string that looks like base64 encoded. Its meaning will be explained in the further\npart of this post.\n\n## Inside\n\nIn order to better understand the changes, we need to take a deep dive in the code. As\n[always, the original sample comes packed – this time there are two layers of protection to be](https://www.virustotal.com/en/file/9b6ff6f6f45a18bf3d05bba18945a83da2adfbe6e340a68d3f629c4b88b243a8/analysis/)\n[removed before we get the main bot.](https://www.virustotal.com/en/file/3a56e9ce42c6d028f1c1dd3efe535dbcdd90490b12a093eec312bf276bda0b37/analysis/)\n\nThe main bot comes with 2 resources: RES and DIAL, that are analogical to the resources\nused before.\n\n\n-----\n\nRES – is an encrypted configuration file, in XML format. It is encrypted in the same way as\nbefore (using AES, with key derived by hashing rounds), and we can decode it using an old\nscript: [trickbot_config_decoder.py. (Mind the fact that the first DWORD in the resource is a](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/trick_config_decoder.py)\nsize, and not a part of the encrypted data – so, it needs to be removed before using the\nscript).\n\nDIAL – is an elliptic curve public key (ECC curve p-384), that is used to verify the signature\nof the aforementioned encrypted configuration, after it is decrypted.\n\n**Obfuscation**\n\n[In the first edition, TrickBot was not at all obfuscated – we could even find all the strings in](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\nclear. During the two years of evolution, it has slowly changed. Several months ago, the\nauthors decided to obfuscate all the strings, using a custom algorithm (based on base64). All\nthe obfuscated strings are aggregated from a single hardcoded list:\n\nWhen any of them is needed, it is selected by its index and passed to the decoding function:\n\n\n-----\n\n[Example – string fetched by the index 162:](https://gist.github.com/hasherezade/ff0b9ebacb1e47464cf6783e787e69b8#file-extracted_list-txt-L226)\n\n[The deobfuscation process, along with the used utility, was described here. Due to the fact](https://gist.github.com/hasherezade/2f09ae061b196ce16fce777472649346)\nthat the API of the decoding functions didn’t change since then, the same method can be\nused until today. The list of deobfuscated strings, extracted from the currently analyzed\n[sample can be found here.](https://gist.github.com/hasherezade/ff0b9ebacb1e47464cf6783e787e69b8#file-extracted_list-txt)\n\nAdditionally, we can find other, more popular methods of strings obfuscation. For example,\nsome of the strings that are divided into chunks, one DWORD per each:\n\nThe same method was used by GandCrab, and can be deobfuscated with the following\nscript.\n\n\n-----\n\nSimilarly, the Unicode strings are divided:\n\nMost of the imports used by TrickBot are loaded dynamically. That makes static analysis\nmore difficult, because we cannot directly see the full picture: the pointers are retrieved just\nbefore they are used.\n\n[We can solve this problem in various ways, i.e. by adding tags by an automated tracer.](https://github.com/hasherezade/tiny_tracer)\n[Created CSV/tags file for one of the analyzed samples is available here (it can be loaded to](https://gist.github.com/malwarezone/b406da290b873d2ae7867ec79029a88e)\n[the IDA database with the help of IFL plugin).](https://github.com/hasherezade/ida_ifl)\n\nThe picture given below shows the fragment of TrickBot’s code after the tags are loaded. As\nwe can see, the addresses of the imported functions are retrieved from the internal structure\nrather than from the standard Import Table, and then they are called via registers.\n\n\n-----\n\nApart from the mentioned obfuscation methods, on the way of its evolution, TrickBot is going\nin the direction of string randomization. Many strings that were hardcoded in the initial\nversions are now randomized or generated per victim machine. For example the mutex\nname:\n\n**Used encryption**\n\n\n-----\n\n[In the past, modules were encrypted by AES in CBC mode. The key used for encryption was](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/trick_config_decoder.py#L20)\n[derived by hashing initial bytes of the buffer. Once knowing the algorithm, we could easily](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/trick_config_decoder.py#L14)\ndecrypt the stored modules along with their configuration.\n\nIn the recent update the authors decided to complicate it a bit. Yet they didn’t change the\n[main algorithm, but just introduced an additional XOR layer. Before the data is passed to the](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/trick_config_decoder.py#L68)\nAES, it is first XORed with a 64 character long, dynamically generated string, that we will\nrefer as the bot key:\n\nThe mentioned bot key is generated per victim machine. First, GetAdapterInfo function is\nused:\n\nThe retrieved structure (194 bytes) is hashed by SHA256 and then the hash is converted into\nstring:\n\n\n-----\n\nThe reconstructed algorithm to generate the Bot Key (and the utility to generate the keys)\n[can be found here.](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/make_bot_key.cpp)\n\nThis key is then stored in the dropped settings file.\n\n**Encoding settings**\n\nAs mentioned before, new editions of TrickBot drop a new settings file, containing some\nencoded information. Example of the information that is stored in the settings:\n```\n0441772F66559A1C71F4559DC4405438FC9B8383CE1229139257A7FE6D7B8DE9 1085117245 5 6 13\n\n```\nThe elements:\n\n1. the BotKey (generated per machine)\n\n2. a checksum of a test string: (0-256 bytes encoded with the same charset) – used for the\npurpose of a charset validation\n\n3. three random numbers\n\n\n-----\n\nThe whole line is base64 encoded using a custom charset, that is generated basing on the\nhardcoded one:\n“HJIA/CB+FGKLNOP3RSlUVWXYZfbcdeaghi5kmn0pqrstuvwx89o12467MEDyzQjT”.\n\nYet, even at this point we can see the effort of the authors to avoid using repeatable patterns.\nThe last 8 characters of the charset are swapped randomly. The pseudocode of the\ngeneration algorithm:\n\nRandomization of the n characters:\n\n\n-----\n\nExample of the transformation:\n\ninp: “HJIA/CB+FGKLNOP3RSlUVWXYZfbcdeaghi5kmn0pqrstuvwx89o12467MEDyzQjT”\n\nout: “HJIA/CB+FGKLNOP3RSlUVWXYZfbcdeaghi5kmn0pqrstuvwx89o12467jDEzTyQM”\n\n[The decoder can be found here: trick_settings_decoder.py](https://github.com/hasherezade/malware_analysis/blob/master/trickbot/trick_settings_decoder.py)\n\n## Slowly improving obfuscation\n\nThe authors of TrickBot never cared much about obfuscation. With time they slowly started to\nintroduce its elements, but, apart from some twists, it’s still nothing really complex. We can\nrather expect that this trend will not change rapidly, and after updating the scripts for new\nadditions, decoding Trick Bot elements will be as easy for the analysts as it was before.\n\nIt seems that the authors believe in a success based on quantity of distribution, rather than\non attempts of being stealthy in the system. They also focus on constant adding new\nmodules, to diversify the functionality (i.e. recently, they added a new module for attacking\n[Point-Of-Sale systems).](https://www.vkremez.com/2018/11/lets-learn-introducing-latest-trickbot.html)\n\n## Scripts\n\n\n-----\n\nUpdated scripts for decoding TrickBot modules for malware analysts:\n[https://github.com/hasherezade/malware_analysis/tree/master/trickbot](https://github.com/hasherezade/malware_analysis/tree/master/trickbot)\n\n## Indicators of compromise\n\nSample hash:\n```\n9b6ff6f6f45a18bf3d05bba18945a83da2adfbe6e340a68d3f629c4b88b243a8\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-12 - What’s new in TrickBot- Deobfuscating elements.pdf"
    ],
    "report_names": [
        "2018-11-12 - What’s new in TrickBot- Deobfuscating elements.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536052,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653705130,
    "ts_modification_date": 1653705130,
    "files": {
        "pdf": "https://archive.orkl.eu/45b102b10196f9efc3580af91e5a86e5dc1bb89d.pdf",
        "text": "https://archive.orkl.eu/45b102b10196f9efc3580af91e5a86e5dc1bb89d.txt",
        "img": "https://archive.orkl.eu/45b102b10196f9efc3580af91e5a86e5dc1bb89d.jpg"
    }
}