{
    "id": "c143dbde-a82b-46b6-9bfe-21c8c18905e7",
    "created_at": "2022-10-25T16:48:15.662573Z",
    "updated_at": "2025-03-27T02:08:40.171044Z",
    "deleted_at": null,
    "sha1_hash": "1c1dd830c28d3981de3c71fbd7dd3dd31d2f4e6e",
    "title": "HP_Bromium_Threat_Insights_Report_Q4_2020_V5.pdf",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 2662549,
    "plain_text": "## THREAT INSIGHTS\n\n### R E P O R T\n\n#### Q 4 - 2 0 2 0\n\n\n-----\n\n###### Q4 2020\n\n THREAT LANDSCAPE\n\nWelcome to the Q4 2020 edition of the HP-Bromium Threat Insights Report. The report reviews notable malware\ntrends identified by HP Sure Click from the fourth quarter of 2020 (1 October to 31 December), so that security teams are\nequipped with the knowledge to combat emerging threats and improve their security postures.\n\nHP Sure Click Enterprise is deployed on desktops and laptops, capturing malware and allowing it to run inside secure\ncontainers called micro-virtual machines.¹ Adding isolation to the endpoint security stack transforms your endpoints into\nyour strongest defence, while giving network defenders a unique advantage to be able to track and understand malware\nthat tries to enter your networks.\n\n###### NOTABLE THREATS\n\n\n###### Dridex Surges in Q4\n\nQ4 2020 saw a significant increase in malicious spam distributing\nDridex malware.² The number of Dridex samples isolated by HP Sure\nClick more than tripled in Q4 compared to Q3, representing a 239%\nincrease. According to HP Sure Click telemetry, Dridex was the\nsecond most widely circulating crimeware family behind Emotet.\nAlthough originating in 2012 as a banking Trojan, since 2017 Dridex’s\noperators have increasingly shifted their tactics to extorting money\nfrom victims using ransomware.\n\n\n# 239%\n\n##### rise in Dridex samples isolated by HP Sure Click in Q4 2020, compared to Q3\n\n\nDridex’s distributors commonly propagate the malware using malicious Excel spreadsheets that download the Trojan from\nremote web servers. The proportion of spreadsheet malware increased by 9% in Q4 compared to Q3 (Figure 5), which was\npartially driven by the uptick in Dridex activity. Interestingly, since mid-2020 some Dridex loader documents started to\ncontain hundreds of URLs from which to download the malware. Consequently, the high number of potential download\nservers makes the loader more resilient to takedown action by hosting providers and domain registrars. It also increases\nthe likelihood of successfully downloading the payload. Instead of blocking one URL, network security controls such as\nweb proxies would need to block hundreds of URLs to prevent the malware from being downloaded and executed.\n\n###### Malicious Executable Email Attachments on the Rise\n\nThe volume of executable format malware,\nespecially Portable Executable EXE files, isolated by\nHP Sure Click in Q4 grew by 12%, compared to Q3\n(Figure 8). This increase was primarily driven a rise\nin malicious email campaigns distributing\nattachments using these file types. In particular,\nwe saw large campaigns targeting German users\ndelivering Formbook and Agent Tesla remote\naccess Trojans (RATs).³ ⁴ The sender addresses were\nspoofed to make it appear that they originated from\nlegitimate German companies. The emails lured\nvictims into opening the attachments by claiming\nthey were monetary grants or orders.\n\n\n-----\n\n###### Web Browser Exploits Lead to FickerStealer\n\nIn November 2020, HP Threat Research identified a\nmalware campaign relying on misspelled domains of\npopular instant messaging services. Visitors to the\nwebsites were redirected to RigEK landing pages that\nattempted to exploit web browser and plugin vulnerabilities\nto infect their systems with FickerStealer malware.⁵\n\nRigEK is an exploit kit that was first seen in 2014, but\nsaw a big decline in 2017.⁶ After being redirected to a\nRigEK landing page, the victim’s web browser and\noperating system is profiled for vulnerable browser and\nplugin versions, including Flash, Java and Silverlight. If a\nvulnerable version is found and other environmental\ncriteria are met, RigEK delivers an exploit. Following\nexploitation, a PowerShell script writes an obfuscated\nJScript file to the user’s %Temp% directory, which\ndownloads the final malware payload using a\nWinHttpRequest object.\n\n\n###### Q4 2020\n\nFigure 2 - HP Sure Click Enterprise behavioural trace showing the\nexploitation of Internet Explorer 11 by RigEK in a micro-VM.\n\n\nFickerStealer is a family of information stealing malware that emerged in October 2020 on Russian-language underground\nforums. Its capabilities include stealing sensitive information such as passwords, browser autocomplete forms and\ncryptocurrency wallets.\n\n###### APOMacroSploit, a New Office Malware Builder Emerges\n\nIn Q4 2020, we detected a previously unseen Office malware builder called APOMacroSploit that was used to target users\nthrough malicious spam campaigns. The emails adopted delivery-themed lures that distributed weaponised XLS\nattachments (Figures 3 and 4). The documents contained Excel 4 macros that download and run remotely-hosted BAT\nscripts using PowerShell’s Net.WebClient.DownloadFile method. To collect information about the campaign, the threat\nactors used a legitimate hyperlink shortening and analytics service called\ncutt[.]ly. Ultimately, the batch scripts led to BitRAT being deployed to the\nvictims’ computers.⁷ Advertisements for BitRAT and APOMacroSploit\nwere spotted in several underground forums and chatrooms in 2020.\nAccording to a message from one of APOMacroSploit’s sellers, each\ndocument costs $50 USD.⁸\n\nFigure 3 - Malicious spam email containing APOMacroSploit malware Figure 4 - Social engineering image embedded in\n\n\n-----\n\n###### Q4 2020\n\n\n###### ZLoader Makes a Return using Password-protected Office Loaders\n\nIn October 2020, HP Sure Click telemetry detected an increase in ZLoader banking Trojan activity.⁹ Its distributors used a\ncombination of techniques to increase the likelihood of compromising systems. Some of the loaders were Word documents\nthat cause a VBA macro to run only after the documents are closed. They used a topical lure by purporting to be invoices\nfrom a pharmaceutical company involved in clinical trials. The macros deobfuscated, dropped and executed ZLoader\npayload DLLs to randomly-named folders in the C:\\ directory without needing to download the Trojan from a distribution\nserver.\n\nThe attackers behind this campaign also used password-protected Excel files. This can be an effective way of slowing\ndown investigations that rely on conventional sandboxes because security teams must retrieve the email containing the\npassword to examine the document. HP Sure Click speeds up investigations because it captures a full behavioural trace of\nactivity when the document is opened by a user. Figures 5 and 6 shows how a user clicked on a link leading to a web server\n(securefiles[.]top) hosting a ZLoader Excel document. After downloading the file, the user opened it and entered the\npassword, which caused a ZLoader DLL to be dropped and executed inside a micro-VM.\n\nFigure 5 - ZLoader sample isolated by HP Sure Click. Figure 6 - ZLoader behavioural trace.\n\n###### Emotet Email Thread Hijacking\n\nOne reason for Emotet’s high infection rate was how its operators automated the creation of targeted phishing emails\nusing data stolen from victims. By exfiltrating victims’ email mailboxes, the botnet was able to spoof sender addresses,\nsubject lines, attachment fllenames and the body text of emails. This information was used to craft convincing phishing\nemails that would be sent as replies to existing email threads, a technique called email thread hijacking. Ultimately, the\nemails sought to trick targets into opening malicious email attachments or clicking on links leading to malicious documents\nthat would infect their systems with Emotet. In December 2020, HP Sure Click isolated an Emotet phishing email targeting\na government organisation in Central America. The email bore the hallmarks of being crafted using mailbox data stolen\nfrom a PC infected with Emotet, which was then used to email the recipient (Figure 7).\n\n\n-----\n\n###### Q4 2020\n\n\nFigure 7 - Emotet phishing email likely created from stolen email data.\n\n###### NOTABLE TECHNIQUES\n\n DOSfuscation in Emotet Downloaders\n\nBefore law enforcement seized Emotet’s command and control infrastructure in January 2021, we noticed that its\noperators increased the complexity of the obfuscation used in their Word downloaders (Figure 8).¹⁰ Samples in December\n2020 shared many similarities to DOSfuscation techniques, a collection of command line argument obfuscation methods\ndescribed by Daniel Bohannon in 2018.¹¹ The goal of these techniques is to evade rigid detection rules by hiding suspicious\nstrings from command line arguments. While the Antimalware Scan Interface (AMSI) in Windows 10 has improved visibility\ninto obfuscated scripts, determined attackers can apply these techniques to interpreted languages that aren’t supported\nby AMSI. Telltale indicators of DOSfuscation include using environmental variable substrings, character insertions,\nreversals and for-loop encoding.\n\nFigure 8 - DOSfuscation techniques in Emotet download script from December 2020.\n\n\n-----\n\n###### Q4 2020\n\n\n###### ACTIONABLE INTELLIGENCE\n\n Notable Trends\n\nQ4 2020 saw threat actors switch from Word document malware to\nspreadsheet and executable formats, such as EXE, XLS and XLSM\n(Figure 9). The most effective execution techniques involved old\ntechnologies such as Excel 4.0 macros that often offer limited\nvisibility to detection tools.\n\nIn line with the rest of 2020, the most frequent exploit isolated by\nHP Sure Click - accounting for nearly three-quarters of all\nexploits - was of CVE-2017-11882, a memory corruption\nvulnerability in Microsoft Office’s Equation Editor.¹² There was a\n12% growth in malware that exploits CVE-2017-0199, a Microsoft\nWord remote code execution vulnerability (Figure 10).¹³\n\n\n# 88%\n\n##### of threats isolated by HP Sure Click were delivered by email in Q4 2020. The remaining 12% were web downloads.\n\n\nOf the threats stopped by HP Sure Click in Q4 2020, 29% were not known by hash to antivirus scanning engines when they\nwere isolated, suggesting a high degree of sample novelty due to widespread use of packers and polymorphic and\nmetamorphic obfuscation techniques. On average, it took 8.8 days for samples to become known by hash to other antivirus\nengines.\n\n68 adversary techniques documented in the MITRE ATT&CK matrix were seen in this period.¹⁴ The most popular techniques\nused by threats were Execution through Module Load (T1129), Obfuscated Files or Information (T1027) and Execution\nthrough API (T1106).\n\nFigure 9 - Change in file types isolated by HP Sure Click Figure 10 - Change in top exploits isolated by HP Sure Click\nf Q3 t Q4 2020 f Q Q\n\n\n-----\n\n###### Q4 2020\n\n\n###### HP Sure Click Enterprise Recommendations\n\nHP Sure Click Enterprise enhances protection because malware is isolated from the host computer and cannot spread onto\nthe corporate network. We recommend updating to the latest HP Sure Click Enterprise software release and using the\nOperational and Threat Dashboards in HP Sure Controller to ensure isolation is running correctly on your endpoints.\n\nIn your HP Sure Click Enterprise policy, we recommend that untrusted file support for email clients and Microsoft Office\nprotection options are enabled (these are enabled by default in our recommended policies). Switching on these settings is\nan easy way to reduce the risk of infection posed by phishing campaigns. Please contact HP Support if you need help\napplying suggested configurations.\n\nFigure 11 - MITRE ATT&CK heatmap showing the range of techniques used by threats isolated Q4 2020.\n\n###### Indicators and Tools\n\nThe HP Threat Research team regularly publishes Indicators of Compromise (IOCs), signatures and tools to help security\nteams to defend against threats. You can access these resources from the HP Threat Research GitHub repository.¹⁵\n\n###### STAY CURRENT\n\nThe HP-Bromium Threat Insights Report is made possible by customers who opt to share their threats with HP. Alerts that\nare forwarded to us are analysed by our security experts to reduce false positives and annotated with contextual\ninformation about each threat.\n\nTo learn more, review the Knowledge Base article on threat forwarding.¹⁶ We recommend that customers take the\nfollowing actions to ensure that they get the most out of their HP Sure Click Enterprise deployments:\n\n - Enable the Threat Intelligence Service and threat forwarding. This will keep your endpoints updated with the latest\nBromium Rules File (BRF) so that you benefit from detecting emerging threats in your network.\n\n- Plan to update HP Sure Controller with every new release to receive new dashboards and report templates. See the\nlatest release notes and software downloads available on the Customer Portal.¹⁷ ¹⁸\n\n\n-----\n\n###### Q4 2020\n\n\n\n- Update HP Sure Click Enterprise endpoint software at least twice\na year to stay current with detection rules added by HP-Bromium\nthreat research team.\n\nFor the latest threat research, head over to the HP Threat Research\nblog, where our researchers regularly dissect new threats and share\ntheir findings.¹⁹\n\n###### ABOUT THE HP-BROMIUM THREAT INSIGHTS REPORT\n\nEnterprises are most vulnerable from users opening email\nattachments, clicking on hyperlinks in emails, and downloading\nfiles from the web. HP Sure Click Enterprise protects the enterprise\nby isolating risky activity in micro-VMs, ensuring that malware\ncannot infect the host computer or spread onto the corporate\nnetwork. Since the malware is contained, HP Sure Click Enterprise Figure 12 - Recommended threat forwarding settings\ncollects rich forensic data to help our customers harden their in HP Sure Controller.\ninfrastructure. The HP-Bromium Threat Insights Report highlights\nnotable malware campaigns analysed by our threat research team\nso that our customers are aware of emerging threats and can take action to protect their environments.\n\n###### REFERENCES\n\n[1] https://www8.hp.com/us/en/solutions/sure-click-enterprise.html\n\n[2] https://malpedia.caad.fkie.fraunhofer.de/details/win.dridex\n\n[3] https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla\n\n[4] https://malpedia.caad.fkie.fraunhofer.de/details/win.formbook\n\n[5] https://malpedia.caad.fkie.fraunhofer.de/details/win.fickerstealer\n\n[6] https://unit42.paloaltonetworks.com/unit42-decline-rig-exploit-kit/\n\n[7] https://malpedia.caad.fkie.fraunhofer.de/details/win.bit_rat\n\n[8] https://research.checkpoint.com/2021/apomacrosploit-apocalyptical-fud-race/\n\n[9] https://www.proofpoint.com/uk/blog/threat-insight/zloader-loads-again-new-zloader-banking-malware-variant-returns\n\n[10] https://malpedia.caad.fkie.fraunhofer.de/details/win.emotet\n\n[11] https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf\n\n[12] https://nvd.nist.gov/vuln/detail/CVE-2017-11882\n\n[13] https://nvd.nist.gov/vuln/detail/CVE-2017-0199\n\n[14] https://attack.mitre.org/\n\n[15] https://github.com/hpthreatresearch\n\n[16] https://support.bromium.com/s/article/What-information-is-sent-to-Bromium-from-my-organization\n\n[17] https://support.bromium.com/s/topic/0TOU0000000Hz18OAC/latest-news?language=en_US&tabset-3dbaf=2\n\n[18] https://my.bromium.com/software-downloads/current\n\n[19] https://threatresearch.ext.hp.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://threatresearch.ext.hp.com/wp-content/uploads/2021/03/HP_Bromium_Threat_Insights_Report_Q4_2020.pdf"
    ],
    "report_names": [
        "HP_Bromium_Threat_Insights_Report_Q4_2020.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/1c1dd830c28d3981de3c71fbd7dd3dd31d2f4e6e.pdf",
        "text": "https://archive.orkl.eu/1c1dd830c28d3981de3c71fbd7dd3dd31d2f4e6e.txt",
        "img": "https://archive.orkl.eu/1c1dd830c28d3981de3c71fbd7dd3dd31d2f4e6e.jpg"
    }
}