{
    "id": "c158dd3d-6e78-41fd-abbf-247f689707a2",
    "created_at": "2023-01-12T15:00:37.790254Z",
    "updated_at": "2025-03-27T02:10:04.30251Z",
    "deleted_at": null,
    "sha1_hash": "ebc4f9a5a384ec4412b58279d713f23c5b6747a2",
    "title": "2018-03-06 - Gozi ISFB Remains Active in 2018, Leverages -Dark Cloud- Botnet For Distribution",
    "authors": "",
    "file_creation_date": "2022-05-27T21:57:57Z",
    "file_modification_date": "2022-05-27T21:57:57Z",
    "file_size": 948062,
    "plain_text": "# Gozi ISFB Remains Active in 2018, Leverages \"Dark Cloud\" Botnet For Distribution\n\n**[blog.talosintelligence.com/2018/03/gozi-isfb-remains-active-in-2018.html](http://blog.talosintelligence.com/2018/03/gozi-isfb-remains-active-in-2018.html)**\n\n[This blog post was authored by Edmund Brumaghin and](https://www.blogger.com/profile/10442669663667294759) [Holger Unterbrink, with](https://blogs.cisco.com/author/holgerunterbrink)\n[contributions from Adam Weller.](https://blogs.cisco.com/author/adamweller)\n\n## Executive Summary\n\nGozi ISFB is a well-known and widely distributed banking trojan, and has been in the threat\nlandscape for the past several years. Banking trojans are a type of malware that attackers\nleverage in an attempt to obtain banking credentials from customers of various financial\ninstitutions. The source code associated with Gozi ISFB has been leaked several times over\nthe years, and the robust features available within the Gozi ISFB code base have since been\nintegrated into additional malware, such as GozNym. Talos published detailed research\n[about GozNym in a September 2016 blog post. Since then, Talos has been monitoring Gozi](http://blog.talosintelligence.com/2016/09/goznym.html)\nISFB activity, and has discovered a series of campaigns over the past six month that have\nbeen making use of the elusive \"Dark Cloud\" botnet for distribution. In investigating the\ninfrastructure associated with Dark Cloud, we identified a significant amount of malicious\nactivity making use of this same infrastructure, including Gozi ISFB distribution, Nymaim\ncommand and control, and a variety of different spam campaigns and scam activity. Talos is\npublishing details related to ongoing Gozi ISFB activity, the Dark Cloud botnet, as well as the\nadditional threats we have observed using this infrastructure over the past couple of years.\n\n\n-----\n\n## Campaign Details\n\nTalos has observed several distribution campaigns over the past few months that exhibit\nunusual characteristics. These campaigns appear to be relatively low-volume, with the\nattackers choosing to target specific organizations. They do not appear to send large\namounts of spam messages to the organizations being targeted, instead choosing to stay\nunder the radar while putting extra effort into the creation of convincing emails, in an attempt\nto evade detection while maximizing the likelihood that the victim will open the attached files.\n\nOur engineers have discovered that while the Gozi ISFB campaigns are ongoing, the\ndistribution and C2 infrastructure does not appear to stay active for extended periods,\nmaking analysis of older campaigns and samples more difficult. The attackers appear to be\nvery quickly moving to new domains and IP addresses, not only for each campaign, but also\nfor individual emails that are part of the same campaign. The campaigns that Talos analyzed\ntook place during the fourth quarter of 2017, and have continued into 2018, with new\ncampaigns being launched every week in an attempt to ensnare more victims and generate\nrevenue for the attackers.\n\n## Malicious Spam Campaigns\n\nThis malware is distributed using malicious spam email campaigns, which feature Microsoft\nWord file attachments that function as malware downloaders. The emails appear targeted in\nnature, an example of which is shown below.\n\nInterestingly, the attackers chose to create emails that appear to be part of an existing email\nthread, likely in an attempt to convince the victim of their legitimacy. In addition to crafting the\nemail delivering the malicious Word document, they also create additional email subjects and\naccompanying bodies, which were included with the malicious email. This is not something\nthat is typically seen in most malicious email campaigns, and shows the level of effort the\nattackers put into making the emails seem legitimate to maximize the likelihood that the\nvictim would open the attached file.\n\n\n-----\n\nFigure 1: Example Email Message\n\nWhen opened, the attached Word document displays the following decoy image that makes\nit appear as if the attachment is a document that was created using Office 365. It instructs\nthe user to \"Enable Editing\" and then \"Enable Content.\"\n\n\n-----\n\nFigure 2: Malicious Word Document\n\nIn the case that the victim follows the instructions, macros embedded within the Word\ndocument will execute, facilitating the download and executing the malware from an attackercontrolled server. The infection process associated with these emails is described in the\nfollowing section.\n\n## Infection Process\n\nAs mentioned above, the Word documents come with an embedded, obfuscated visual basic\nfor applications, or VBA, macro, which in most cases, is executed when the document is\nclosed by the victim, as shown in the following screenshot. Executing the macro when the\ndocument is closed is a clever trick to bypass some sandbox systems, which only open the\ndocuments, but never close them during analysis.\n\n\n-----\n\nFigure 3: Obfuscated VBA Macro\n\nOnce deobfuscated, the macro does nothing more than simply download an HTA file from a\nweb server. Figure 4 shows the deobfuscated final call from the script above. In other\ndocuments, they are using different or slightly modified VBA macros, but deobfuscated, they\nall do a similar final call, similar to what is shown in Figures 4 and 5.\n\nFigure 4: Final Macro Call\n\nFigure 5: Alternate Macro Call\n\nDue to the fact that HTA files are seen as local applications, the content is executed as a\nfully trusted application. Therefore, no security-related questions are asked to the user. The\ncontent that is downloaded from qdijqwdunqwiqhwew[.]com is an obfuscated JavaScript\nscript (see Figure 6)\n\nFigure 6: Obfuscated JavaScript\n\nThe lopomeriara variable is a very long obfuscated string which we have shortened (...) in\nthe screenshot. Deobfuscated, it resolves to:\n\nFigure 7: Deobfuscated Javascript\n\nIn other words, it is using ActiveX to execute a PowerShell script, which downloads and\nexecutes the malware to be installed on the victim's machine. In this case the filename was\n84218218.exe.\n\n\n-----\n\nWe have analyzed more than 100 malicious Word documents from this campaign, and it\nappears that the vast majority of them are individualized. The individualized ones all appear\nsimilar, but all their hashes are different, and their VBA code is either completely different or\nat least slightly modified. Even the image that the adversaries are using in these documents\n(see Figure 8) is not the same — it differs by slightly changed color values and pixels as you\ncan see in Figure 9.\n\nFigure 8: Document Image\n\nFigure 9: Image Comparison\n\nAn example of the slightly changed VBA code skeleton can be seen in Figure 10. The\nadversaries are changing variables, function names, arrays, etc. for more or less every\nsingle Word document. Nevertheless, in the majority of documents, the basic code structure\nstays the same. Sometimes they are re-ordering the functions, or they add or remove a few\nlines of code. But as shown in Figures 10 and 11, the main algorithms stay the same.\n\n\n-----\n\nFigure 10: VBA Skeleton Comparison\n\nFigure 11: Additional Comparison\n\nAs mentioned above, there are some documents where the VBA script is completely\ndifferent. The rightmost image in Figure 12 is an example of this. Deobfuscated, it is doing\nthe same known \"http://<some server>/...php?utma=....\" HTTP request which we have seen\nbefore.\n\n\n-----\n\nFigure 12: VBA Code Differences\n\nWe focused the majority of our investigation on campaigns between the fourth quarter of\n2017 until the present, but based on other reports and our telemetry data, they have likely\nbeen going on for a couple of years. Within the data that we collected, the adversaries have\nchanged the images within the Word documents from time to time (Figures 13 and 14) and\nused different VBA code in their malicious macros. The schema stays the same, the pixels\nand color values of the pictures inside the different campaigns are slightly changed, but the\nmessage stays the same.\n\nFigure 13: Earlier Document Image\n\n\n-----\n\nFigure 14: Document Image Font Differences\n\nAn interesting point is that some of them are even localized, as you can see below in Figure\n15. This matches the corresponding phishing emails we talked about before. The separate\nattacks are highly customized and targeted.\n\nFigure 15: Document Image Localization\n\n## Payload\n\nThe payload (e.g. 84218218.exe as described above), is different depending on the specific\ncampaign. The vast majority of payloads are banking trojans based on the Gozi ISFB code\nbase, but we have also seen executables identified by AV products as belonging to other\nmalware families, such as CryptoShuffler, Sennoma and SpyEye. We have looked closer into\nthe payload mentioned above, and we can clearly identify it as ISFB. Its functionality is very\n[similar to the one described in this report by the Polish Computer Emergency Response](https://journal.cecyf.fr/ojs/index.php/cybin/article/view/15/19)\nTeam (CERT). For example, the sample is using the same rolling XOR algorithm to protect\nits strings.\n\n\n-----\n\nThe anti-VM methods used within this sample are also identical — the BSS section\nencryption and the dropper payload setup are very similar. The dropper is also obfuscated\nwith useless strings. It is interesting to note that in the sample we analyzed, the DGA code\nmentioned in the paper above is included, but it is never used due to its configuration. The\nsample we analyzed was using a hardcoded domain to communicate with the C2 server.\nThis domain is tmeansmderivinclusionent[.]net. The sample was not configured to use TOR.\n\nRegarding the decryption of the BSS section, this sample presents a particularity. It has a\nloop, which creates small temporary files with a random file name. After creating the files, it\nqueries their creation file time. Then, it applies some transformations to the four least\nsignificant bytes of this timestamp to generate a one-byte value. Due to the transformation\nalgorithm, this will result in a value between 0x00000008 and 0x000000FF. See the\npseudocode below:\n\nt = t >> 16\nt = t & 0x000000F7\nt = t + 8\n\nThis one-byte value is then added to the decryption key. With this key, the malware tries to\ndecrypt the BSS section. If the decryption fails, it starts the loop again, and creates the next\nfile until the section has been properly decoded. This technique seems to replace the antisandbox technique based on mouse movement mentioned in previous reports. Although this\napproach would not hinder dynamic analysis in a full-system VM, we believe it could be an\nattempt to bypass simpler application-level emulators that may not properly implement the\nWindows API (e.g., those which might return a fixed timestamp).\n\nThe malware loader contains two versions of the same DLL. One is a 32-bit DLL, and the\nother is a 64-bit DLL, both of which contain the malware's hardcoded configuration. The way\nthey store the DLLs and configuration values is by leveraging a set of structures indexed in\nan array located right after the section table (referred to as FJ-struct in the report mentioned\nabove). After the decryption, depending on the victim machine, either the 32-bit or the 64-bit\nDLL is injected into the explorer.exe process running on the victim machine.\n\n## The Dark Cloud Botnet\n\nIn analyzing the domains and associated infrastructure used to distribute this malware, as\nwell as the associated C2 domains, Talos identified significant overlap between the\ninfrastructure used in these campaigns and what has been described as being associated\nwith a botnet referred to as \"Dark Cloud.\" This botnet was initially described in 2016 in a blog\npost [here. This botnet is interesting, as it was reportedly initially created to provide a](https://krebsonsecurity.com/2016/05/carding-sites-turn-to-the-dark-cloud/)\n\"bulletproof\" way to host several carding sites. It has since expanded, and is also being used\nfor the distribution and administration of various malware families. During our analysis of the\ninfrastructure being used, we identified significant Gozi ISFB and Nymaim distribution and\n\n\n-----\n\nC2, adult dating spam, various carding resources and other malicious activities from this\ninfrastructure.\n\nThere are several interesting characteristics associated with this particular botnet. One of the\nmost prominent is the use of fast flux techniques, which makes tracking the backend\ninfrastructure more difficult. By frequently changing the DNS records associated with the\nmalicious domains, attackers can make use of an extensive network of proxies, continuously\nchanging the address of the IP being used to handle communications to the web servers the\nattacker controls.\n\nTalos observed that the time-to-live (TTL) value for DNS records associated with domains\nused in these malware campaigns were typically set to 150, allowing the attackers to issue\nDNS record updates every three minutes.\n\nFigure 16: Sample DNS TTL Values\n\nAs we began investigating the domains and IP addresses associated with the distribution\nand post-infection C2 of Gozi ISFB, we noticed that in most of the cases the same\ninfrastructure was being used by the various carding forums referenced in the\nKrebsOnSecurity article mentioned above. Using passive DNS data, we collected every IP\naddress that the domains under investigation had been seen resolving to. We also\nperformed the reverse operation, collecting every domain that had ever been seen resolving\nto the IP addresses we previously collected in an attempt to get the most complete picture of\nthe infrastructure.\n\nOnce we had this information collected, we began to investigate all of the activity that had\nbeen observed associated with this infrastructure. What we discovered was a laundry list of\ncybercriminal activities, all being conducted using this same infrastructure over the past\ncouple of years.\n\nOne of the most notable carding forums leveraging this fast flux botnet is known as Uncle\nSam.\n\n\n-----\n\nFigure 17: Uncle Sam Website\n\nIn addition to Uncle Sam, we also observed the following carding sites and forums also\nmaking use of this infrastructure:\n\nPaysell\nTry2Swipe\nCVVShop\nCsh0p\nRoyalDumps\nMcDuck\nPrvtzone\nVerified\n\nNote that in several cases, the site owners had registered their domains using multiple TLDs\n(such as .BZ, .WS and .LV TLDs, for example).\n\nWe wrote a script that captured all of the IP addresses that the Uncle Sam website resolved\nto over a 24-hour period. We determined that over this period, the website had resolved to\n287 unique IP addresses. This equates to an IP rotation of approximately 12 times per hour,\nor every five minutes. This demonstrates just how fluid the DNS configuration associated\nwith these domains is and how much infrastructure is being used by these attackers.\n\n\n-----\n\nIn addition to various carding websites, we also identified a significant number of Nymaim\nsamples which were beaconing out to IP addresses within this botnet. Nymaim is a malware\nfamily that functions as a downloader for additional malware, most commonly seen\nassociated with the delivery of ransomware.\n\nTalos also observed that over the past couple of years, several of the domains we\ninvestigated were hosting fake mail generator applications, primarily used to generate spam\nmessages associated with various adult dating websites.\n\n## Geographic Distribution\n\nIn analyzing all of the infrastructure associated with this botnet, we identified that the\nattackers appear to be actively avoiding using proxies and hosts located in Western Europe,\nCentral Europe and North America. The majority of the systems we analyzed were located in\nEastern Europe, Asia, and the Middle East. Below is a graphic showing where the largest\nnumber of systems were located globally.\n\n\n-----\n\nFigure 18: Geographic Heat Map\n\nAdditionally, the following bar graph shows the hosting providers around the world that were\nmost heavily used for hosting the systems used by this botnet.\n\nFigure 19: Most Impacted ASNs\n\nTalos is continuing to investigate and track the operations of this botnet to ensure customers\nremain protected from the various threats that are associated with it.\n\n## Conclusion\n\nGozi ISFB is a banking trojan that has been used extensively by attackers who are targeting\norganizations around the world. It has been around for the past several years, and ongoing\ncampaigns indicate that it will not be going away any time soon. Attackers are continuing to\nmodify their techniques and finding effective new ways to obfuscate their malicious server\n\n\n-----\n\ninfrastructure in an attempt to make analysis and tracking more difficult. Talos has identified\nthe Dark Cloud botnet being used for a multitude of malicious purposes. We will continue to\nmonitor these threats as they continue to evolve over time to ensure that customers remain\nprotected and the public is informed with regards to continued use of threats such as Gozi\nISFB, Nymaim and others.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as NGFW, NGIPS, and Meraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase onSnort.org.](https://www.snort.org/products)\n\nSNORT IDs: 39686, 42894\n\n\n-----\n\n## Indicators of Compromise (IOC)\n\n### Malicious Document Hashes\n\n[A full list of malicious documents associated with these campaigns can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5a9d1f4c49487.txt)\n\n### Domains\n\n[A full list of domains associated with these campaigns can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5a9d21419c1e0.txt)\n\n### IP Addresses\n\n[A full list of IP addresses associated with these campaigns can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5a9d21a8d2607.txt)\n\n### Executable File Hashes\n\n[A full list of executable hashes associated with these campaigns can be found here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5a9d21f9c03d0.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-06 - Gozi ISFB Remains Active in 2018, Leverages -Dark Cloud- Botnet For Distribution.pdf"
    ],
    "report_names": [
        "2018-03-06 - Gozi ISFB Remains Active in 2018, Leverages -Dark Cloud- Botnet For Distribution.pdf"
    ],
    "threat_actors": [
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535637,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1653688677,
    "ts_modification_date": 1653688677,
    "files": {
        "pdf": "https://archive.orkl.eu/ebc4f9a5a384ec4412b58279d713f23c5b6747a2.pdf",
        "text": "https://archive.orkl.eu/ebc4f9a5a384ec4412b58279d713f23c5b6747a2.txt",
        "img": "https://archive.orkl.eu/ebc4f9a5a384ec4412b58279d713f23c5b6747a2.jpg"
    }
}