{
    "id": "c1a2e883-66dd-4edf-839e-1f556cad2405",
    "created_at": "2023-04-05T02:10:20.407318Z",
    "updated_at": "2025-03-27T02:06:12.829487Z",
    "deleted_at": null,
    "sha1_hash": "619270dce40a16fab6614153a7adbbffa796f412",
    "title": "2022-12-22 - Nitol DDoS Malware Installing Amadey Bot",
    "authors": "",
    "file_creation_date": "2023-04-03T08:32:42Z",
    "file_modification_date": "2023-04-03T08:32:42Z",
    "file_size": 2610704,
    "plain_text": "# Nitol DDoS Malware Installing Amadey Bot\n\n**asec.ahnlab.com/en/44504/**\n\nBy Sanseo December 22, 2022\n\nThe ASEC analysis team recently discovered that a threat actor has been using Nitol DDoS\nBot to install Amadey. Amadey is a downloader that has been in circulation since 2018, and\nbesides extorting user credentials, it can also be used for the purpose of installing additional\nmalware.\n\nAmadey is being actively distributed again this year, and even until very recently, it has been\npropagating itself on websites disguised as cracks and keygens for normal software and\n[installing other malware on the infected systems.[1]](https://asec.ahnlab.com/en/36634/) Additionally, in the second half of this\nyear, Amadey was used in attacks involving LockBit 3.0, which targeted Korean corporate\nusers. Amadey was distributed as attachments to spam emails and was responsible for\n[installing LockBit Ransomware.[2]](https://asec.ahnlab.com/en/41450/)\n\n\nWhile monitoring the actively distributed Amadey Bot, the ASEC analysis team found the\nNitol DDoS Bot malware installing Amadey. Nitol is a DDoS Bot with a Denial of Service\n(DDoS) attack feature, and while its numbers have decreased recently, it is a malware that\nhas been steadily used in attacks since long ago. For example, in 2021, there was a history\n[of it being uploaded to a Korean forum archive, infecting many Korean users.[3]](https://asec.ahnlab.com/en/24986/)\n\n\n-----\n\n**Figure 1. The malware distribution posts that were uploaded on a Korean program-**\n**sharing website**\nNitol Malware that installed Amadey is the same file as the malware covered in the above\nblog post. This tells us that even after over a year, it is still being used in attacks up until now.\nThis file is being shared via torrent, disguised as cracks for Hancom and MS Office, and it is\ninfecting many users even at the current moment. The following are the names of paths\nwhere Nitol was detected.\n```\n\\Hancom 2020\\crack.exe\n\n\\[Official Korean Version] Office 2007\\setup.exe\n\n\\microsoft office 2016\\setup.exe\n\n\\SketchUp Pro 2018\\crack.exe\n\n```\n**Nitol Malware Analysis**\n\nNitol used in the attacks was packed with Themida to hinder analysis. Nitol is a DDoS Bot\nthat supports various forms of DDoS attacks, and the one used in the attacks has 0x50 for its\nsettings data. When it communicates with C&C servers, it stands by for 5 seconds and sets\nthe system’s hidden files and folders to be invisible. The following is the settings data for\nNitol.\n\n**Bit Settings** **Feature**\n\n\n-----\n\n**Bit Settings** **Feature**\n\n0x01 Exclude installation process\n\n0x02 Auto-delete\n\n0x04 Check virtual environment\n\n0x08 Check sandbox environment\n\n0x10 Sleep (5 seconds)\n\n0x20 Generate dummy packet\n\n0x40 System configuration (does not display hidden files)\n\n0x80 Assign hidden properties to the malware\n\n**Table 1. Nitol settings data**\nThe virtual environment check uses the IN command to check whether it is running on a\nVMware virtual machine. As for sandbox environments, it checks whether the “api_log.dll”\nand “SbieDll.dll” DLLs are loaded. If it confirms that it’s in a virtual or sandbox environment,\nNitol is shut down.\n\nThe dummy packet-generating option creates a random IP address and attempts to connect\nby matching the port number of an actual C&C address. When this process is successful,\ndummy data is transmitted. These behaviors are repeated 10 times, and it is likely that this is\nfor the purpose of hindering network behavior analysis.\n\nAs the option that excludes the installation process is not activated in this malware, an\ninstallation process runs when the malware is executed. The installation process includes a\nself-copying stage where the malware copies itself under a random 6-character name in\n%APPDATA%, and a persistence maintaining stage where it uses the reg command to\nregister itself to the Run key. When the installation process is complete, it executes the\nmalware in the copied path and connects to the C&C server.\n\n  - “C:\\Windows\\System32\\reg.exe” ADD\n“HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run” /V “My App” /t REG_SZ\n/F /D “C:\\Users\\vmuser\\AppData\\Roaming\\gkqske.exe”\n\nCurrently, access to the C&C server is unavailable, but once the connection is successfully\nestablished, the malware transmits basic information about the infected system, as shown\nbelow.\n\n**Offset** **Data**\n\n\n-----\n\n**Offset** **Data**\n\n+0x0000 0x00000001\n\n+0x0004 Language and country information (Locale)\n\n+0x0044 Computer name\n\n+0x00C4 Windows version\n\n+0x0104 RAM size (GB)\n\n+0x0124 CPU performance (MHz)\n\n+0x0144 “Client”\n\n**Table 2. Information about the infected system to be sent to the C&C server**\n\n**Figure 2. Past packet captured**\nWhen Nitol sends the infected system’s information to the C&C server, the server returns the\ncommand. The command can perform various functions including DDoS attacks,\ndownloading files, and running updates. For reference, DDoS attacks were divided into three\ncategories below, but the malware supports many more types of DDoS attacks.\n\n\n-----\n\n**Figure 3. User-Agent used in DDoS attacks**\n\n**Command** **Feature**\n\n0x0002 DDoS Attack #1\n\n0x0003 DDoS Attack #2\n\n0x0004 DDoS Attack #3\n\n0x0005 Stop DDoS attack\n\n0x0006 Auto-delete\n\n0x0010 Download and run payload (SW_HIDE)\n\n0x0011 Download and run payload (SW_SHOW)\n\n0x0012 Update\n\n0x0013 Web page access via Internet Explorer (Hidden)\n\n0x0014 Web page access via Internet Explorer (IE popup)\n\n0x0016 Destroy MBR\n\n**Table 3. Commands that can be performed by Nitol**\nOut of the commands, there is one that receives a URL from the C&C server and connects to\nthe corresponding web page using Internet Explorer. The command can be configured to\naccess the web page unknown to the user or have Internet Explorer pop up to have users be\naware.\n\n**Figure 4.**\n\n**Accessing web page using IE**\nAdditionally, there is also a command that changes MBR to incapacitate the system after a\nreboot. When the system is restarted after the following data is written on MBR, it shows the\nstring “Game Over” as shown below and makes the system unable to reboot.\n\n\n-----\n\n**Figure 5. MBR destruction routine**\n\n**Figure 6. After rebooting**\nNitol supports a command that downloads additional payloads, and this command was used\nto install Amadey Bot. The following are ASD (AhnLab Smart Defense) infrastructure logs\nthat show Nitol having downloaded Amadey from an external address.\n\n\n-----\n\n**Figure 7. Nitol installing Amadey Bot**\n**Installing Additional Payloads Using Amadey (Amadey Bot, njRAT)**\n\nAfter being installed by Nitol, Amadey Bot attempts to connect to C&C servers. When this\nprocess is successful, Amadey downloads a plugin responsible for extorting information to\ncollect information from the infected system and send them to the C&C server. Besides\naccount credentials, Amadey also takes periodic screenshots and sends them to the C&C\nserver. The following blog post goes into a detailed analysis of Amadey.\n\n[Amadey Bot Being Distributed Through SmokeLoader](https://asec.ahnlab.com/en/36634/)\n\n**Figure 8. Amadey’s network traffic**\nAn examination of the current version of Amadey shows that it receives a command from the\nC&C server to install additional payloads, and accordingly, it downloads and installs a total of\n4 files. These files are Amadey, Nitol, and a downloader, The Nitol mentioned above is Type\nA, but Amadey also installs Nitol Type B.\n\n**TeamViewerSetupx64.exe : Amadey**\n**TeamViewer_Desktop.exe : Nitol Type A**\n**explorer.exe : Nitol Type B**\n**ServiceManager.exe : Downloader (Dotnet Packer)**\n\n\n-----\n\nThe top-level list of the addresses where the malware are downloaded from is unavailable,\nbut it can be assumed that there are various other malware strains aside from those\nmentioned.\n\n**Figure 9. Download page**\n\nThe malware installed by the threat actor mimic original programs, with names such as\nTeamViewer, Explorer, and AnyDesk. The threat actor not only disguises the filename but\nalso the icons to resemble the original programs when distributing the malware.\n\n**Figure 10. Icons of malware used in attacks**\nTorrent is the main platform used in malware propagation alongside file-sharing sites. When\ninstalling cracks or keygen files of commercial software using torrents, there is a risk of being\ninfected with malware disguised as these programs. When Nitol is installed, the user PC acts\nas a DDoS Bot and can be used in DDoS attacks. In addition, it can also be used for\ninstalling additional malware such as Amadey. As for Amadey, it stays in the infected system\nto not only extort user credentials but also install additional malware.\n\nUsers should apply the latest patch for OS and programs such as Internet browsers, and\nupdate V3 to the latest version to prevent malware infection in advance.\n\n**File Detection**\n\n– Backdoor/Win.Nitol.C4533062 (2021.06.24.01)\n\n– Trojan/Win.Generic.R539958 (2022.12.09.01)\n\n– Downloader/Win.Amadey.C5329944 (2022.12.12.01)\n\n– Downloader/Win.MSIL.C5329945 (2022.12.12.01)\n\n– Downloader/Win.Amadey.C5329946 (2022.12.12.01)\n\n\n-----\n\n**Behavior Detection**\n– Malware/MDP.Behavior.M3108\n\n**MD5**\n\n– 3038c7bb0f593df3f52f0644c894c7ba : Nitol Type A\n\n– d332cf184ac8335d2c3581a48ee0ad87 : Amadey (AnyDesk.exe)\n– 852011cf885e76c0441dd52fdd280db7 : Amadey (TeamViewerSetupx64.exe)\n\n– 0c9df67f152a727b0832aa4e7f079a71 : Nitol Type A (TeamViewer_Desktop.exe)\n\n– e79b48eefa43aa34f360f68618992236 : Nitol Type B (explorer.exe)\n\n– f01b49498b82320973c6006ee117f91e : Dotnet Downloader (ServiceManager.exe)\n\n**C&C URL**\n\n– rlarnjsdud0502.kro.kr:2222 : Nitol Type A\n\n– hxxp://AQWe9sfiWSwPyVMJ[.]xyz/jg94cVd30f/index.php : Amadey\n\n– hxxp://PMVqdJfUf3WlX9kI[.]xyz/jg94cVd30f/index.php : Amadey\n\n– hxxp://SmgqNt3EIxXkSAsU[.]xyz/jg94cVd30f/index.php : Amadey\n\n– 45.89.255[.]250:50505 : Nitol Type A\n\n– gy9.gyddos[.]com:8889 : Nitol Type B\n\n– 45.89.255[.]250:40404 : Nitol Type B\n\n– 45.89.255[.]250:30303 : Downloader (Dotnet Packer)\n\n**Download URL**\n\n– hxxp://45.89.255[.]250:8080/AnyDesk.exe : Amadey\n\n– hxxp://45.89.255[.]250:8080/TeamViewer_Desktop.exe : Nitol Type A\n– hxxp://45.89.255[.]250:8080/explorer.exe : Nitol Type B\n\n– hxxp://45.89.255[.]250:8080/TeamViewerSetupx64.exe : Amadey\n\n– hxxp://45.89.255[.]250:8080/ServiceManager.exe : Downloader (Dotnet Packer)\n\n– hxxp://45.89.255[.]250:8080/Kwvwz.png : Dotnet Downloader\n\n**Reference**\n\n**[1]** [[ASEC Blog] Amadey Bot Being Distributed Through SmokeLoader](https://asec.ahnlab.com/en/36634/)\n\n**[2]** [[ASEC Blog] LockBit 3.0 Being Distributed via Amadey Bot](https://asec.ahnlab.com/en/41450/)\n\n**[3]** [[ASEC Blog] Nitol Malware Being Distributed in Forum Archive](https://asec.ahnlab.com/en/24986/)\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to**\n**check related IOC and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information-en/)\n\n[Tagged as:Amadey,crack,DDOS,Nitol](https://asec.ahnlab.com/en/tag/amadey-en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-22 - Nitol DDoS Malware Installing Amadey Bot.pdf"
    ],
    "report_names": [
        "2022-12-22 - Nitol DDoS Malware Installing Amadey Bot.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660620,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1680510762,
    "ts_modification_date": 1680510762,
    "files": {
        "pdf": "https://archive.orkl.eu/619270dce40a16fab6614153a7adbbffa796f412.pdf",
        "text": "https://archive.orkl.eu/619270dce40a16fab6614153a7adbbffa796f412.txt",
        "img": "https://archive.orkl.eu/619270dce40a16fab6614153a7adbbffa796f412.jpg"
    }
}