{
    "id": "c1a55f80-f46e-4e44-a181-d66282641df5",
    "created_at": "2023-01-12T15:09:29.116924Z",
    "updated_at": "2025-03-27T02:05:51.664211Z",
    "deleted_at": null,
    "sha1_hash": "1f02e07d0dda4e81017a25d2f3e41c4cd5f86020",
    "title": "2022-11-18 - An AI Based Solution to Detecting the DoubleZero .NET Wiper",
    "authors": "",
    "file_creation_date": "2022-11-28T19:10:51Z",
    "file_modification_date": "2022-11-28T19:10:51Z",
    "file_size": 1447676,
    "plain_text": "# An AI Based Solution to Detecting the DoubleZero .NET Wiper\n\n**unit42.paloaltonetworks.com/doublezero-net-wiper/**\n\nAkshata Rao, Zong-Yu Wu, Wenjun Hu November 19, 2022\n\nBy [Akshata Rao,](https://unit42.paloaltonetworks.com/author/akshata-rao/) [Zong-Yu Wu and](https://unit42.paloaltonetworks.com/author/zong-yu-wu/) [Wenjun Hu](https://unit42.paloaltonetworks.com/author/wenjun-hu/)\n\nNovember 18, 2022 at 6:00 PM\n\n[Category: Malware](https://unit42.paloaltonetworks.com/category/malware-2/)\n\nTags: [.NET Framework,](https://unit42.paloaltonetworks.com/tag/net-framework/) [Cortex,](https://unit42.paloaltonetworks.com/tag/cortex/) [Cortex XDR,](https://unit42.paloaltonetworks.com/tag/cortex-xdr/) [DoubleZero wiper,](https://unit42.paloaltonetworks.com/tag/doublezero-wiper/) [Machine Learning,](https://unit42.paloaltonetworks.com/tag/machine-learning/) nextgeneration firewall, [threat prevention,](https://unit42.paloaltonetworks.com/tag/threat-prevention/) [WildFire,](https://unit42.paloaltonetworks.com/tag/wildfire/) [wiper](https://unit42.paloaltonetworks.com/tag/wiper/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/doublezero-net-wiper/)\n\n## Executive Summary\n\nUnit 42 researchers introduce a machine learning model that predicts the maliciousness of\n.NET samples based on specific structures in the file, by analyzing a .NET wiper named\nDoubleZero. We identify the challenges of detecting this threat through PE structural analysis\nand conclude by examining the cues picked up by the machine learning model to detect this\nsample.\n\n\n-----\n\nWhile wipers are not necessarily new, the recent discovery of several new wipers associated\nwith the ongoing Russia-Ukraine cyber activity has driven renewed public interest in\nunderstanding how to identify and defend against their use.\n\nPalo Alto Networks customers receive protections from .NET malwares with Cortex XDR or\nthe Next-Generation Firewall with cloud-delivered security services, including WildFire and\nAdvanced Threat Prevention.\n\nRelated Unit 42 Topics [Machine Learning,](https://unit42.paloaltonetworks.com/tag/machine-learning/) [WildFire,](https://unit42.paloaltonetworks.com/tag/wildfire/) [.NET Framework](https://unit42.paloaltonetworks.com/tag/net-framework/)\n\n## Table of Contents\n\nDoubleZero Wiper\n\nExamining the PE File Structure\n\nAn Inside Look Into .NET files\n\nApplying Machine Learning to .NET Malware Detection\n\nDetecting the DoubleZero Wiper\n\nConclusion\n\nIndicators of Compromise\n\nAdditional Resources\n\n## DoubleZero Wiper\n\nThe wiper DoubleZero was revealed to the public by Ukraine CERT in March 2022. It is one\n[of many wipers – including HermeticWiper,](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115a) [IsaacWiper and](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115b) [CaddyWiper – that were](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115c)\napparently targeted against their country.\n\nDoubleZero is implemented in C#, and it is heavily obfuscated. This wiper is capable of\ntypical, non-reversible and destructive actions that include the following:\n\nGaining the highest privilege in the host\nHunting down all available targeted files from every volume\nDestroying targeted files or disk volumes within a short period of time\n\nUnlike HermeticWiper and other wipers that damage the Master Boot Record (MBR) or GUID\nPartition Table (GPT), DoubleZero only wipes the first 4096 bytes in selected files using the\nfile system driver. We limit our focus on the .NET samples feature engineering, but this\n[Splunk article provides a more in-depth technical analysis of the wiper sample.](https://www.splunk.com/en_us/blog/security/threat-update-doublezero-destructor.html)\n\n**SHA256** 3b2e708eaa4744c76a633391cf2c983f4a098b46436525619e5ea44e105355fe\n\n**File size** 419.50 KB\n\n\n-----\n\n## Examining the PE File Structure\n\nResearchers have been commonly using Microsoft Windows Portable Executable (PE) file\nstructure to detect PE malware for many years. The thought behind this tactic is that variants\nof the same malware family can often share similarities in their file structure.\n\nMachine learning models also detect PE malware based on the file structure. To do so, they\nhave historically used PE header characteristics, imports and section attributes to recognize\nknown malware characteristics.\n\nWhile the .NET PE file structure is based on the PE format, a lot of its functionality is\nencoded within the .NET specific structures. In the next section, we’ll dive deeper into the\n.NET structural attributes.\n\n### An Inside Look Into .NET files\n\nThe .NET open source framework was introduced in 2002 and is available by default in most\nMicrosoft Windows platforms. The framework provides developers with powerful, built-in\nmethods to access the internet, file system and encryption. Having these options already\navailable makes this framework attractive to both system administrators and malware\nauthors.\n\nMicrosoft Windows PE loader will already know how to load and execute the .NET sample\nonce the framework is ready, since .NET assembly re-uses the PE file format.\n\nDuring code generation, the source code for .NET compatible languages is compiled to\nplatform-agnostic Common Intermediate Language (CIL) byte code. A special .NET\nIMAGE_DIRECTORY_ENTRY_COM_DESCRIPTOR can be found in the data directory for\nreferencing the Cor20 header, as shown in Figure 1. The Cor20 header (otherwise known as\nthe CLR header) contains .NET specific information like versioning and resource information\nand the location of the Metadata header. The resources, streams, type references, methods,\nCIL byte codes and usage of external assemblies are all in the metadata. For a more\n[detailed description, please refer to our article on dotnetfile.](https://unit42.paloaltonetworks.com/dotnetfile/)\n\n\n-----\n\nFigure 1. A simple illustration of .NET file structure.\n\n\n-----\n\nUnlike most PE files, where dependent libraries and APIs can be found in the import table,\nfor a .NET file the import table contains just one module (the mscoree.dll) and one imported\nfunction (_CorExeMain for executables and _CorDllMain for dynamic load libraries). The\nresources are contained within the .NET storage stream instead of the .rsrc section.\n\nThe entry point of the PE header points to the _CorExeMain or _CorDllMain of the\nmscoree.dll, while the actual entry point can be found in the Cor20 header as shown in\nFigure 2. Thus, some of the most useful attributes to identify PE malware files do not contain\nmany clues for .NET malware.\n\nFigure 2. .NET specific structures and the data they hold.\n[The metadata table contains defined tables for Module, MethodDef and Assembly among](https://www.ntcore.com/files/dotnetformat.htm#MetaTables)\nothers. By examining the .NET file structure, we can see it provides a lot more information\nabout the file as compared to the PE file structure alone. Instead of only using the general\nPE features for the .NET machine learning solution, we added the data specifically parsed\nfrom the structure of .NET samples. These customized features improve the quality of our\nmachine learning solutions.\n\n## Applying Machine Learning to .NET Malware Detection\n\nWe have trained a machine learning model on custom features learned on the PE file\nstructure, .NET file structure and other file characteristics of .NET samples, as shown in\nFigure 3.\n\n\n-----\n\nAs .NET is an extremely popular file type in customer environments, it is necessary for us to\nhave a quick turnaround time in case any disruptive false positives emerge. This means that\nour model’s functionality has to be well understood by researchers, and that the predictions\ncould be reverse engineered.\n\nBecause .NET files are so ubiquitous, they also have a highly imbalanced distribution of\nbenign vs. malicious samples. Consequently, the trained model has to ensure that we\nmaintain extremely low false positive rates while retaining detection accuracy.\n\nFigure 3. An overview of our detection workflow.\n\n## Detecting the DoubleZero Wiper\n\nThe malware sample has a single import, _CorExeMain, from mscoree.dll, consistent with\nother .NET executable files. It contains only .text and .reloc sections, all of which are native\nto the PE file format and have fairly low entropy. Hence, there’s not much we can learn from\nthis file’s PE structure.\n\nThe CIL bytecode uses obfuscation to hide the string resources that are critical for pattern\nbased detection. It also interleaves random code among actual operations, together with\nflattened control flow, to make the code harder to follow. However, we can glean a lot about\nthe objective of this malware by observing the imported libraries and associated API calls\nfound in the decompiled code.\n\nThe imports System.DirectoryServices.ActiveDirectory and System.Security.AccessControl\nindicate the intention to interact with the Active Directory and access control attributes of the\nfiles\n\n\n-----\n\nThe regular expression function imported by System.Text.RegularExpressions is used to\nlocate certain files by patterns.\n\nThe most significant signs of malicious code usage are the calls to the unmanaged DLL\nfunctions. [Platform Invoke (P/Invoke) enables the managed codes in .NET to call the](https://learn.microsoft.com/en-us/dotnet/standard/native-interop/pinvoke)\nunmanaged functions. Calling the lower level APIs directly is a well known anti-analysis\ntechnique to evade API hooking by sandbox. The following unmanaged APIs are used in the\nsample:\n\nntdll.ntopenfile\nntdll.ntfscontrolfile\nntdll.rtlntstatustodoserror\nntdll.rtladjustprivilege\nkernel32.closehandle\nkernel32.getfilesizeex\nkernel32.getlasterror\nuser32.exitwindowsex\n\nIn most of the use cases, there are equivalent managed functions in .NET runtime libraries to\nuse. However, this sample intends to operate at a lower level with some of the unmanaged\nAPIs in ntdll.dll.\n\nThe target files and the regular expression patterns are surprisingly stored as plain strings,\nas shown in Figure 4. This possible mistake by the threat actor allows us to get more insights\nabout the objective of the sample.\n\nFigure 4. An example decompiled code snippet where the sample uses regular expressions\nto search the target files.\nThough obfuscation exists, we are still able to get the argument FsControlCode for the call to\nntdll.NtFsControlFile, which is 0x980c8 = FSCTL_SET_ZERO_DATA. This is how the wiper\nwrites 4K of null bytes to a targeted file that was opened by ntdll.NtOpenFile.\n\nThe sample calls ntdll.RtlAdjustPrivilege several times with privileges 9, 17, 18 and 19.\nThese privileges are SeTakeOwnershipPrivilege, SeBackupPrivilege, SeRestorePrivilege\nand SeShutdownPrivilege respectively. These privileges are used to ensure the wiper has\nthe access right to destroy the target file and reboot the system after all the actions are done.\n\nUnlike HermeticWiper and ransomware like LockBit, DoubleZero doesn’t delete the shadow\ncopies that can possibly be used to recover files from the damage. However, the wiper does\nkill any process named lsass. [Lsass is important to the Windows system, and any application](https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service)\n\n\n-----\n\nthat kills this process is most likely malicious.\n\nThe aforementioned file characteristics give us clues that the machine learning model uses\nto detect the sample. Though obfuscation is more common among malicious .NET files,\nbecause the sample uses several unmanaged APIs as well as sensitive target path patterns,\nthese stand out as potentially malicious indicators.\n\n## Conclusion\n\nResearchers have been using PE file structure to detect variants within malware families for\nyears, as they often share similarities in their file structure. Despite the .NET framework\nbeing well known, it can still be challenging to detect files using this strategy. Some of the\nmost useful attributes for identifying PE malware files don’t offer many clues for identifying\n.NET malware.\n\nWe have highlighted the fundamental difference between .NET and PE samples to help\nidentify where those clues could be hiding. In doing so, we illustrated that machine learning\nfeature engineering can be improved by correctly parsing out the .NET specific data\nstructure.\n\nWe also showed that imported libraries, unmanaged API calls and unencrypted strings are\nthe most useful features for detecting .NET malware. While a recent wiper called DoubleZero\nwas analyzed as an example, the features that are important for detecting .NET can be\ngeneralized, and this feature can be broadly useful for future research efforts.\n\n[Palo Alto Networks customers receive protections from .NET malware with Cortex XDR or](https://www.paloaltonetworks.com/cortex/cortex-xdr)\nthe [Next-Generation Firewall with](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [cloud-delivered security services including WildFire and](https://www.paloaltonetworks.com/network-security/security-subscriptions)\n[Advanced Threat Prevention.](https://www.paloaltonetworks.com/network-security/advanced-threat-prevention)\n\n## Indicators of Compromise\n\n3b2e708eaa4744c76a633391cf2c983f4a098b46436525619e5ea44e105355fe\n\n## Additional Resources\n\n[DoubleZero Wiper](https://cert.gov.ua/article/38088)\n\n[Threat Update DoubleZero Destructor](https://www.splunk.com/en_us/blog/security/threat-update-doublezero-destructor.html)\n\n[HermeticWiper](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115a)\n\n[IsaacWiper and HermeticWizard](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115b)\n\n[CaddyWiper](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115c)\n\n[dotnetfile Open Source Python Library: Parsing .NET PE Files Has Never Been Easier](https://unit42.paloaltonetworks.com/dotnetfile/)\n\n**Get updates from**\n\n**Palo Alto**\n\n\n-----\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-18 - An AI Based Solution to Detecting the DoubleZero .NET Wiper.pdf"
    ],
    "report_names": [
        "2022-11-18 - An AI Based Solution to Detecting the DoubleZero .NET Wiper.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536169,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1669662651,
    "ts_modification_date": 1669662651,
    "files": {
        "pdf": "https://archive.orkl.eu/1f02e07d0dda4e81017a25d2f3e41c4cd5f86020.pdf",
        "text": "https://archive.orkl.eu/1f02e07d0dda4e81017a25d2f3e41c4cd5f86020.txt",
        "img": "https://archive.orkl.eu/1f02e07d0dda4e81017a25d2f3e41c4cd5f86020.jpg"
    }
}