{
    "id": "c1eb513e-df29-4ab5-98e4-7d0219fd4706",
    "created_at": "2023-01-12T15:06:10.343268Z",
    "updated_at": "2025-03-27T02:06:11.878289Z",
    "deleted_at": null,
    "sha1_hash": "d0cd90eaba7eae5c13ac5314f37bd659a4f61395",
    "title": "2022-01-05 - Can You Trust a File’s Digital Signature- New Zloader Campaign exploits Microsoft’s Signature Verification putting users at risk",
    "authors": "",
    "file_creation_date": "2022-05-27T22:55:57Z",
    "file_modification_date": "2022-05-27T22:55:57Z",
    "file_size": 2543499,
    "plain_text": "# Can You Trust a File’s Digital Signature? New Zloader Campaign exploits Microsoft’s Signature Verification putting users at risk\n\n**research.checkpoint.com/2022/can-you-trust-a-files-digital-signature-new-zloader-campaign-exploits-microsofts-**\nsignature-verification-putting-users-at-risk/\n\nJanuary 5, 2022\n\nJanuary 5, 2022\n\n**Research by: Golan Cohen**\n\n## Introduction\n\nLast seen in August 2021, Zloader, a banking malware designed to steal user credentials\nand private information, is back with a simple yet sophisticated infection chain. Previous\nZloader campaigns, which were seen in 2020, used malicious documents, adult sites and\nGoogle ads to infect systems.\n\nEvidence of the new campaign was first seen around early November 2021. The techniques\nincorporated in the infection chain include the use of legitimate remote management\nsoftware (RMM) to gain initial access to the target machine.\n\n\n-----\n\nFIGURE 1 – SIMPLIFIED INFECTION CHAIN\n\nThe malware then exploits Microsoft’s digital signature verification method to inject its\npayload into a signed system DLL to further evade the system’s defenses. This evidence\nshows that the Zloader campaign authors put great effort into defense evasion and are still\nupdating their methods on a weekly basis.\n\n**Infection Chain**\n\n[The infection starts with the installation of Atera software on the victim’s machine. Atera is a](https://www.atera.com/)\nlegitimate, enterprise remote monitoring and management software, designed for IT use.\nAtera can install an agent and assign the endpoint to a specific account using a unique .msi\nfile that includes the owner’s email address. The campaign authors created this installer\n(b9d403d17c1919ee5ac6f1475b645677a4c03fe9) with a temporary email address:\n[‘[email protected]’. The file imitates a Java installation, just like in previous Zloader](https://research.checkpoint.com/cdn-cgi/l/email-protection)\ncampaigns. As of this moment, the exact distribution method for this file is not fully\nunderstood.\n\n_Figure 2 – The malicious installer_\n\n\n-----\n\nOnce the agent is installed on the machine, the attacker has full access to the system and is\nable to upload/download files, run scripts, etc. Atera offers a free 30-day trial for new users,\nwhich is enough time for the attacker to stealthily gain initial access. Previously, Atera was\nused by the Conti ransomware group to gain persistence and remote access.\n\n_Figure 3 – Create custom Atera installer_\n\n_Figure 4 – The email used in the malicious installer_\n\n\n-----\n\n_Figure 5 – Atera Functions_\n\nFollowing the agent installation, the attacker then uploads and runs two .bat files onto the\ndevice using the “Run Script” function:\n\ndefenderr.bat is used to modify Windows Defender preferences.\nload.bat is used to load the rest of the malware.\n\n\n-----\n\n_Figure 6 – defenderr.bat_\n\nThe rest of the files are hosted on the domain teamworks455[.]com and are downloaded\nfrom there.\n\n_Figure 7 – load.bat_\n\nThe load.bat script downloads and runs new.bat, which checks for admin privileges and\n[requests them using the BatchGotAdmin script. It then continues to download another bat file](https://sites.google.com/site/eneerge/scripts/batchgotadmin)\n(new1.bat). This new script adds more exclusions to Windows Defender for different folders,\n\n\n-----\n\ndisables different tools on the machine that could be used for detection and investigation\nsuch as cmd.exe and the task manager. It also downloads other files into the %appdata%\nfolder:\n\n9092.dll – The main payload, Zloader.\nadminpriv.exe – Nsudo.exe. Enables running programs with elevated privileges.\nappContast.dll – Used to run 9092.dll and new2.bat.\nreboot.dll – Also used to run 9092.dll.\nnew2.bat – Disables “Admin Approval Mode” and shuts down the computer.\nauto.bat – Placed in the Startup folder for boot persistence.\n\nFigure 8 – New.BAT\n\n\n-----\n\nFigure 9 – New1.BAT\n\nNext, the script runs mshta.exe with file appContast.dll as the parameter. When we took a\ncloser look at the DLL, we noticed that the file is signed by Microsoft with a valid signature\n(see below for further explanation) and its original filename is AppResolver.dll. Comparing\nthe two files, we see that in the malicious DLL, the author appended a script to the file.\n\n\n-----\n\n_Figure 10 – Valid Signature_\n\n\n-----\n\n_Figure 11 – Original Filename_\n\n_Figure 12 – Comparison of appResolver.dll and appContast.dll_\n\nThis script then enters a sleeping phase using the file WScriptSleeper.vbs which is written to\nthe %temp% directory. Next, it runs 9092.dll (the main Zloader payload) using regsvr32.exe.\n\n\n-----\n\n[A full technical analysis of Zloader was published by Malwarebytes in May 2020. Ultimately,](https://www.malwarebytes.com/resources/files/2020/06/the-silent-night-zloader-zbot_final.pdf)\nthe malware calls msiexec.exe and injects its payload into the running process. Msiexec then\ncommunicates with the C2 server at the domain lkjhgfgsdshja[.]com.\n\n_Figure 13 – Communication to the C2 server_\n\n_Figure 14 – Strings extracted from msiexec memory_\n\n\n-----\n\nFinally, the new2.bat script edits the registry\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System to disable the\n“administrator in Admin Approval Mode” user type, which runs all applications by default with\nfull administrator privileges, and then shuts down the computer for the changes to take\neffect.\n\n## Persistence\n\nWhen the malware initially runs, it places an auto.bat script under the Startup folder which\nruns mshta.exe with reboot.dll as a parameter. Similar to appContast.dll, and then the script\ndeletes itself. In the figure below, we see that regsvr32.exe is called with zoom.dll and\n9092.dll. The file zoom.dll is missing, which indicates that this campaign might still be under\ndevelopment and we will see it in the future.\n\nAfter injecting msiexec.exe with the malicious code, a random registry key value is created\nunder HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run. This runs regsvr32.exe with\na copy of 9092.dll, which is placed in a newly created folder in %appdata%. This is how the\nmalware persists the next time the system reboots.\n\n_Figure 15 – reboot.dll_\n\n## File Signature\n\nAs mentioned above, the file appContast.dll has a valid signature by Microsoft but the file\nhas been modified and injected with a malicious script. This begs the question – how was it\ndone?\n\nIf we compare the malicious DLL with the original one on a byte level, we can see the file\nwas modified in a few places: File checksum and two places that match the signature size.\n\n\n-----\n\n_Figure 16 – A (benign) is appResolver.dll, B (malicious) is appContast.dll_\n\n_Figure 17 – appResolver.dll CheckSum_\n\n_Figure 18 – appResolver.dll signature size_\n\n\n-----\n\n_figure 19 – appResolver.dll signature size (2)_\n\nThese simple modifications to a signed file maintain the signature’s validity, yet enables us to\nappend data to the signature section of a file. As we can’t run compiled code from the\nsignature section of a file, placing a script written in VBscript or JavaScript and running the\nfile using mshta.exe is an easy solution that could evade some EDRs.\nAs a sanity check, we created our own signed PE file with an appended script\n(A6ED1667BB4BB9BAC35CE937FF08C7216D63EBB4) that opens the calculator app when\nrun as a parameter to mshta.exe.\nThis gap is apparently a known issue mentioned in the following CVEs: CVE-2020-1599,\nCVE-2013-3900, and CVE-2012-0151. Microsoft addressed the issue in 2013 with a Security\nBulletin and pushed a fix. However, they stated after implementing it that they “determined\nthat impact to existing software could be high.” Therefore, in July 2014, they pulled the\nstricter file verification and changed it to an opt-in update.\n\nIn other words, this fix is disabled by default, which is what enables the malware author to\nmodify the signed file.\n\n[Further explanation about how to enable the strict file verification is available here, which](https://docs.microsoft.com/en-us/security-updates/SecurityAdvisories/2014/2915720?redirectedfrom=MSDN)\nincludes modifying the registry keys:\n\n_Figure 20 – Keys needed to change to mitigate the issue_\n\n\n-----\n\nWe note that reboot.dll is also signed in the same way. After applying the fix, both DLLs have\nan invalid signature.\n\n**Campaign Victims**\n\nDuring our analysis, we found an open directory, hosted at teamworks455[.]com, that holds\nsome of the files that are downloaded and used. Every few days, the author makes changes\nto the files and the check.php script returns a different DLL file with the same behavior, but a\ndifferent hash. In the file `entries’, we can see a list of victims that are infected with Zloader\nand their country of origin.\n\n_Figure 21 – teamworks455[.]com/_country_\n\nAs of January 2, 2022, there are 2170 unique victim IPs that downloaded the malicious DLL\nfile. This graph shows the number of victims from each country (“Other” category includes\ncountries with less than 15 victims). As you can see, most of the victims reside in the United\nStates and Canada\n\n\n-----\n\n_Figure 22 – Downloads per country_\n\n**Campaign Authors**\n\nDue to a few similarities with previous campaigns by MalSmoke, we believe that they are the\ncybercriminals behind this campaign:\n\nMalware in previous campaigns by MalSmoke are known to masquerade as Java\nplugins, which is occurring in this case.\nThere is a connection between the registrar information of the domain\nteamworks455[.]com, where the current campaign files are hosted, and the domain\n[pornislife[.]online which was linked to a MalSmoke campaign in 2020](https://blog.malwarebytes.com/threat-analysis/2020/11/malsmoke-operators-abandon-exploit-kits-in-favor-of-social-engineering-scheme/)\n\n\n-----\n\n_Figure 24 – teamworks455[.]com/racoon_\n\nFinally, when looking through the ‘entries’ file, we found two IP addresses that might be\nrelated to the attackers.\n\nFigure 25 – Possible addresses related to the campaign\n\n[The first address, 185[.]191[.]34[.]223, was spotted in an IP blacklist that is categorized as](https://raw.githubusercontent.com/firehol/blocklist-ipsets/master/cybercrime.ipset)\n“cybercrime.” The second address, 185[.]191[.]34[.]209, can be seen attempting to download\nthe payload multiple times, using different user-agents. This could indicate that the authors\nwere testing their payload. Both addresses are found in AbuseIPDB:\n\n\n-----\n\n_Figure 26 – Abuseipdb 185[.]191[.]34[.]223_\n\n_Figure 27 – Abuseipdb 185[.]191[.]34[.]209_\n\n**Conclusion**\n\nZloader campaigns have been previously spotted in the wild in multiple forms. In this\nparticular case, we see that the authors put a lot of effort into the evasion methods. Two\nnoteworthy ways seen here are using legitimate RMM software as an initial access to a\ntarget machine, and appending code to a file’s signature while still maintaining the\nsignature’s validity and running it using mshta.exe.\nThe ability to append code to a file’s signature has been known for many years and multiple\nCVEs were assigned as mentioned above. To mitigate the issue, all vendors should conform\nto the new Authenticode specifications to have these settings as default, instead of an opt-in\nupdate. Until that happens, we can never be sure if we can truly trust a file’s signature.\n\n**Safety Tips**\n\nWe recommend that users apply Microsoft’s update for strict Authenticode verification. To do\nso, paste these lines into Notepad and save the file with .reg extension before running it.\n\nWindows Registry Editor Version 5.00\n\n[HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Cryptography\\Wintrust\\Config]\n\n“EnableCertPaddingCheck”=”1”\n\n\n-----\n\n[HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Cryptography\\Wintrust\\Config]\n\n“EnableCertPaddingCheck”=”1”\n\nWe should also note that after applying the fix, some signatures of legitimate benign\ninstallers will show up with an invalid signature. In addition, if mshta.exe is not relevant in\nyour environment, you may disable it and mitigate the execution of scripts that are inserted\ninto such files.\n\n**Check Point Threat Emulation and** **[Harmony endpoint provides protection against this](https://www.checkpoint.com/harmony/advanced-endpoint-protection/)**\n**threat:**\n\nExploit.Wins.CVE-2013-3900.A\nTrojan-Downloader.Win.Zloader.E\nTrojan-Downloader.Win.Zloader.F\n\n**MITRE ATT&CK**\n\n**IOCs**\n\nAteraAgent Scripts:\n\nDefenderr.bat – 1CA89010E866FB97047383A7F6C83C00C3F31961\n\nLoad.bat – F3D73BE3F4F5393BE1BC1CF81F3041AAD8BE4F8D\n\nwww.teamworks455[.]com\n\nC2 Servers:\n\nhttps://asdfghdsajkl[.]com/gate.php\n\n\n-----\n\nhttps://iasudjghnasd[.]com/gate.php\n\nhttps://kdjwhqejqwij[.]com/gate.php\n\nhttps://kjdhsasghjds[.]com/gate.php\n\nhttps://dkisuaggdjhna[.]com/gate.php\n\nhttps://dquggwjhdmq[.]com/gate.php\n\nhttps://lkjhgfgsdshja[.]com/gate.php\n\nhttps://daksjuggdhwa[.]com/gate.php\n\nhttps://eiqwuggejqw[.]com/gate.php\n\nhttps://djshggadasj[.]com/gate.php\n\nFiles:\n\nJava.msi – B9D403D17C1919EE5AC6F1475B645677A4C03FE9\n\nnew.bat – 0926F8DF5A40B58C6574189FFB5C170528A6A34D\n\nnew1.bat – 9F1C72D2617B13E591A866196A662FEA590D5677\n\nnew2.bat – DE0FA1529BC652FF3C10FF16871D88F2D39901A0\n\n9092.dll – A25D33F3F8C2DA6DC35A64B16229D5F0692FB5C5,\n7A57118EE3122C9BDB45CF7A9B2EFD72FE258771,\n2C0BC274BC2FD9DAB82330B837711355170FC606\n\nAdminpriv.exe – 3A80A49EFAAC5D839400E4FB8F803243FB39A513\n\nappContast.dll – 117318262E521A66ABA4605262FA2F8552903217\n\nreboot.dll – F3B3CF03801527C24F9059F475A9D87E5392DAE9\n\nauto.bat – 3EA3B79834C2C2DBCE0D24C73B022A2FF706B4C6\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-05 - Can You Trust a File’s Digital Signature- New Zloader Campaign exploits Microsoft’s Signature Verification putting users at risk.pdf"
    ],
    "report_names": [
        "2022-01-05 - Can You Trust a File’s Digital Signature- New Zloader Campaign exploits Microsoft’s Signature Verification putting users at risk.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535970,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653692157,
    "ts_modification_date": 1653692157,
    "files": {
        "pdf": "https://archive.orkl.eu/d0cd90eaba7eae5c13ac5314f37bd659a4f61395.pdf",
        "text": "https://archive.orkl.eu/d0cd90eaba7eae5c13ac5314f37bd659a4f61395.txt",
        "img": "https://archive.orkl.eu/d0cd90eaba7eae5c13ac5314f37bd659a4f61395.jpg"
    }
}