{
    "id": "c1f3e1b1-0cd5-46c4-995d-569d39b30824",
    "created_at": "2023-01-12T15:10:25.933982Z",
    "updated_at": "2025-03-27T02:16:25.725997Z",
    "deleted_at": null,
    "sha1_hash": "548a30e11c8f9e62178a2c6c099eabd69dc17f2d",
    "title": "2017-10-27 - British security minister says North Korea was behind WannaCry hack on NHS",
    "authors": "",
    "file_creation_date": "2022-05-29T01:31:37Z",
    "file_modification_date": "2022-05-29T01:31:37Z",
    "file_size": 2341908,
    "plain_text": "# British security minister says North Korea was behind WannaCry hack on NHS\n\n**independent.co.uk/news/uk/home-news/wannacry-malware-hack-nhs-report-cybercrime-north-korea-uk-ben-wallace-**\na8022491.html\n\nOctober 27, 2017\n\nThe British government has admitted publicly for the first time that it is all but certain North\nKorea carried out the \"WannaCry\" malware attack which devastated NHS IT systems in May.\n\nA report released by the National Audit Office (NAO) on Friday found that hospital trusts\nwere left vulnerable to the attack because basic recommendations on cyber-security were\nnot followed.\n\nSpeaking on the BBC's Today programme, the security minister Ben Wallace said the\ngovernment now believes a North Korean hacking group was responsible, but stopped short\nof suggesting the UK could carry out retaliatory attacks.\n\n\n-----\n\nThis attack, we believe quite strongly that this came from a foreign state, Mr Wallace said.\nAdding that the state involved was \"North Korea\", he said: \"We can be as sure as possible. I\nobviously can’t go into the detail of intelligence, but it is widely believed in the community and\nacross a number of countries that North Korea had taken this role.\"\n\n### Recommended\n\n[WannaCry hack report exposes basic failings in NHS cybersecurity](http://www.independent.co.uk/news/uk/home-news/health-department-it-security-wannacry-nhs-hack-report-jeremy-hunt-funding-national-audit-office-nao-a8021881.html)\n\nAsked what the UK could do in response to the attack, the minister admitted that it would be\n\"challenging\" to arrest anyone when a \"hostile state\" was involved.\n\nHe called on the West to instead develop a \"doctrine of deterrent\" similar to that used to\nprevent the use of nuclear weapons. \"We do have a counter attack capability,\" he said. \"But\nlet's remember we are an open liberal democracy with a large reliance on IT systems. We\nwill obviously have a different risk appetite. If you get into tit for tat there has to be serious\nconsideration of the risk we would expose UK citizens to.\"\n\nEarlier an independent investigation concluded that the cyber attack which crippled parts of\nthe NHS could have been prevented if \"basic IT security\" measures had been taken.\n\nThe head of the NAO warned the health service and Department of Health to \"get their act\ntogether\" in the wake of the WannaCry crisis, or risk suffering a more sophisticated and\ndamaging future attack.\n\nThe NAO's probe found that almost 19,500 medical appointments, including 139 potential\ncancer referrals, were estimated to have been cancelled, with five hospitals having to divert\nambulances away after being locked out of computers on 12 May.\n\n### Recommended\n\n[North Korea 'to blame for WannaCry ransomware attack'](http://www.independent.co.uk/news/world/asia/north-korea-responsible-wannacry-ransomware-microsoft-brad-smith-cyber-attack-nsa-a8000166.html)\n\n[WannaCry hack hero's parents say there is 'no doubt' he is innocent](http://www.independent.co.uk/news/uk/home-news/wanncry-cyber-attack-nhs-marcus-hutchins-parents-innocent-kronos-malware-fbi-court-case-a7897516.html)\n\n[Wannacry hero in court as experts criticise 'bizarre' US prosecution](http://www.independent.co.uk/news/uk/home-news/marcus-hutchins-malwaretech-wannacry-arrest-latest-in-court-nhs-hack-hacker-hero-plead-not-guilty-a7878266.html)\n\n['Petya' cyber attack worse than WannaCry hack that crippled NHS](http://www.independent.co.uk/life-style/gadgets-and-tech/news/petya-cyber-attack-hack-wannacry-ransomware-nhs-am-i-safe-security-a7811001.html)\n\n\n-----\n\n[World being hit by new version of the virus that crippled the NHS](http://www.independent.co.uk/life-style/gadgets-and-tech/news/nhs-hack-cyber-attack-wannacry-world-global-ukraine-russia-rosneft-maersk-a7810656.html)\n\nThe malware is believed to have infected machines at 81 health trusts across England – a\nthird of the 236 total, plus computers at almost 600 GP surgeries, the NAO found.\n\nAll were running computer systems – the majority Windows 7 – that had not been updated to\nsecure them against such attacks.\n\nMr Wallace accepted that the attack could have been avoided if software had been properly\nupdated.\n\n\"It's a salient lesson for us all that all of us, from individuals to governments to large\norganisations, have a role to play in maintaining the security of our networks,\" he said.\n\nBritish systems came under attack on a weekly basis from organised criminals and \"a\nnumber\" of foreign countries which seek to collect intelligence or carry out a \"statesponsored criminal attack\".\n\nExpanding on the prospect of the UK fighting back back online, he said: \"Other countries do\nhave doctrines and military thinking along that line, but the West – the United States, Europe\nand the United Kingdom – are much more thoughtful about these things because, ultimately,\nif we were to take some action, we have to remember that some of these states may, as we\nhave seen with this WannaCry, strike out at the rest of our functions.\"\n\nIn a report cataloguing the failures which led to May's attack, the NAO said that while the\nhealth service's IT arm NHS Digital had issued \"critical alerts\" about WannaCry in March and\nApril, the DoH had \"no formal mechanism\" to determine whether local NHS organisations\nhad taken any action.\n\nNAO head Sir Amyas Morse said: \"There are more sophisticated cyber threats out there than\nWannaCry so the Department (of Health) and the NHS need to get their act together to\nensure the NHS is better protected against future attacks.\"\n\nMore than 300,000 computers in 150 countries were infected with the WannaCry\nransomware.\n\nIt crippled organisations from government agencies and global companies by targeting\ncomputers with outdated security.\n\n_Additional reporting by agencies_\n\n### More about\n\n[WannaCryNHSNorth Koreacyber crime](http://www.independent.co.uk/topic/wannacry)\n\n\n-----\n\n## Join our new commenting forum\n\nJoin thought-provoking conversations, follow other Independent readers and see their replies\n\nComments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-27 - British security minister says North Korea was behind WannaCry hack on NHS.pdf"
    ],
    "report_names": [
        "2017-10-27 - British security minister says North Korea was behind WannaCry hack on NHS.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536225,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653787897,
    "ts_modification_date": 1653787897,
    "files": {
        "pdf": "https://archive.orkl.eu/548a30e11c8f9e62178a2c6c099eabd69dc17f2d.pdf",
        "text": "https://archive.orkl.eu/548a30e11c8f9e62178a2c6c099eabd69dc17f2d.txt",
        "img": "https://archive.orkl.eu/548a30e11c8f9e62178a2c6c099eabd69dc17f2d.jpg"
    }
}