{
    "id": "c283fce6-c19f-40ba-aecf-596e0a520c02",
    "created_at": "2023-01-12T15:03:55.883545Z",
    "updated_at": "2025-03-27T02:10:04.323256Z",
    "deleted_at": null,
    "sha1_hash": "ce3f2b14be017d888d8bf8153aff9af24b52248f",
    "title": "2017-11-14 - IceID Banking Trojan Targeting Banks, Payment Card Providers, E-Commerce Sites",
    "authors": "",
    "file_creation_date": "2022-05-27T21:56:27Z",
    "file_modification_date": "2022-05-27T21:56:27Z",
    "file_size": 265523,
    "plain_text": "# IceID Banking Trojan Targeting Banks, Payment Card Providers, E-Commerce Sites\n\n**[digitalguardian.com/blog/iceid-banking-trojan-targeting-banks-payment-card-providers-e-commerce-sites](https://digitalguardian.com/blog/iceid-banking-trojan-targeting-banks-payment-card-providers-e-commerce-sites)**\n\nNovember 14, 2017\n\n### The Industry’s Only SaaS-Delivered Enterprise DLP\n\nOur unique approach to DLP allows for quick deployment and on-demand scalability, while\nproviding full data visibility and no-compromise protection.\n\n### No-Compromise Data Protection is:\n\nCloud-Delivered\nCross Platform\nFlexible Controls\n\n[Platform Overview](https://digitalguardian.com/products/threat-aware-data-protection-platform)\n\n[Chris Brook Tuesday November 14, 2017](https://digitalguardian.com/author/chris-brook)\n\nA new banking Trojan, first spotted by researchers in September, has been targeting banks,\npayment card providers, and mobile services providers, to name a few industries.\n\n\n-----\n\nResearchers said Monday that a new banking Trojan, IcedID, is still in its infancy but has the\npotential to rival other big name Trojans, like Zeus, Gozi, and Dridex, in due time.\n\nAccording to [researchers with IBM’s X-Force, a division of the company that investigates](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)\nthreats and vulnerabilities, IcedID has been targeting banks, payment card providers, mobile\nservices providers, payroll, and e-commerce websites in the U.S. since September, when it\nfirst began making the rounds.\n\nCybercriminals behind IcedID are using the Emotet loader, spread via malicious spam, to\ndistribute payloads. Emotet isn't new; researchers with Microsoft's Malware Protection\nCenter first [spotted it back in 2014. At that time the malware was involved in a spam](https://blogs.technet.microsoft.com/mmpc/2015/01/06/emotet-spam-campaign-targets-banking-credentials/)\ncampaign, mostly against German language speakers and banks, that was stealing account\nusernames and passwords from email and messaging software.\n\nDevelopers behind Emotet added new capabilities this past summer to help it propagate and\nmaintain persistence. While the malware still excels at stealing account credentials – from\nGoogle accounts, webmail services, even FTP accounts saved in Internet Explorer – it can\nalso take that information to send out phishing emails from compromised accounts.\n\nLike Emotet, IcedID is adept at proliferating; the Trojan keeps tabs on users’ online activity\nvia a local proxy for traffic tunneling. It can also jump from endpoint to endpoint, and infect\nterminal servers like printers and shared network devices via Lightweight Directory Access\nProtocol, or LDAP, Limor Kessem, an executive security advisor with IBM, wrote Monday.\n\nLike most banking Trojans, [GozNym and](http://blog.malwarebytes.com/threat-analysis/2017/08/trickbot-comes-with-new-tricks-attacking-outlook-and-browsing-data/) [TrickBot in particular, IcedID uses both webinjection](https://blog.malwarebytes.com/threat-analysis/2017/08/trickbot-comes-with-new-tricks-attacking-outlook-and-browsing-data/)\nand redirection attacks to perpetrate financial fraud.\n\nThe malware downloads a file from its command and control server to help it determine\nwhich webinjection attack it will use. Once determined and triggered, the malware executes\nthe webinjection and sends the victim to a phony bank site that mimics the one initially\nrequested. After being tricked into entering their credentials, the attacker controls the\nsession.\n\nThe redirection attacks are designed to look “seamless,” according to IBM. Instead of\nshuttling a user off to a new, fake site that has a different URL, the attack displays the\nlegitimate bank’s URL in the address bar and the bank’s actual SSL certificate.\n\nResearchers suggest that given the similarities of the Trojan, the authors of IcedID may be\nbehind other similar banking Trojans.\n\n\"While it is still early to tell how it will fare, its current capabilities, distribution choices and\ntargets point to a group that is no stranger to this domain,\" Kessem, along with Maor Wiesen,\nTal Darsan, Tomer Agayev, co-authors on the report, wrote Monday.\n\n\n-----\n\nWhile IcedID certainly seems like it could be poised to take the throne from those other\nbanking Trojans, it’s clear that some, like Dridex, just won't go away.\n\nEarlier this year Dridex adopted a new bypass technique that lets it execute without\ntriggering a Windows UAC alert, it also co-opted a new injection method, known as\n[AtomBombing, to help it evade detection. In April the malware was found being spread in a](https://www.proofpoint.com/us/threat-insight/post/dridex-campaigns-millions-recipients-unpatched-microsoft-zero-day)\nmassive spam campaign that exploited a Microsoft Word zero day. The attacks, which\nbypassed most mitigaiton efforts, took advantage of the way Microsoft handled OLE2Link\nobjects.\n\nA variant of Dridex [just two months ago targeted users of the cloud-based accounting firm](https://www.trustwave.com/Resources/SpiderLabs-Blog/Malware-Xeroing-in-on-Cloud-Accounting-Customers/)\nXero. Attackers spooked messages that came from the service, then tricked users into\ndownloading .zip archives containing a JavaScript file that in turn, steals private and personal\ninformation.\n\nChris Brook\n\n## SUBSCRIBE\n\nGet email updates with the latestfrom the Digital Guardian Blog\n\nDaily   Weekly\n\nThank you for subscribing!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-14 - IceID Banking Trojan Targeting Banks, Payment Card Providers, E-Commerce Sites.pdf"
    ],
    "report_names": [
        "2017-11-14 - IceID Banking Trojan Targeting Banks, Payment Card Providers, E-Commerce Sites.pdf"
    ],
    "threat_actors": [
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535835,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1653688587,
    "ts_modification_date": 1653688587,
    "files": {
        "pdf": "https://archive.orkl.eu/ce3f2b14be017d888d8bf8153aff9af24b52248f.pdf",
        "text": "https://archive.orkl.eu/ce3f2b14be017d888d8bf8153aff9af24b52248f.txt",
        "img": "https://archive.orkl.eu/ce3f2b14be017d888d8bf8153aff9af24b52248f.jpg"
    }
}