{
    "id": "c2cf205d-ec5f-4046-b2af-fd6751e95778",
    "created_at": "2023-01-12T15:01:58.596545Z",
    "updated_at": "2025-03-27T02:06:08.121343Z",
    "deleted_at": null,
    "sha1_hash": "20e59bfdd8f12ed68eb5c9bf7a6f3c5268e9c5a0",
    "title": "2022-03-17 - Rook ransomware analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T21:48:56Z",
    "file_modification_date": "2022-05-28T21:48:56Z",
    "file_size": 102492,
    "plain_text": "# Rook ransomware analysis\n\n**seguranca-informatica.pt/rook-ransomware-analysis/**\n\nMarch 17, 2022\n\nRook ransomware is relatively recent, and one of the advantages of this line’s other threats is the multithreading engine that pulverizes the\nencryption speed during its execution. In this article, we will go through the details of rook, describe the most effective techniques, and provide\nsome measures to fight ransomware in general.\n\nRook is a recent malware and a fresh variant of the leaked Babuk ransomware code. The source code was leaked in a Russian underground\nforum in September 2021, and now criminals can perform changes or simply improve their arsenal by using the intelligence of this piece.\n\n**_Figure 1: Babuk — source code leaked September 2021._**\n\nThe malware was observed during a threat hunting activity by malware experts on VirusTotal. On Nov. 30th, 2021, the Rook operators claimed\nthe first victim: a Kazakh financial organization where criminals stole 1,123 GB of information.\n\nAs usual, this kind of threat is often implanted on internal networks via CobalStrike after a well-succeeded cyberattack. However, security\nresearchers found some phishing emails and torrent downloads with MS Office files infected with CobalStrike beacons to distribute the threat\naround the globe.\n\nAt first glance, the executable seems to be packed with UPX according to the section names, and a string with suspicious length can be\nobserved — probably related to the key used during the encryption process.\n\n\n-----\n\n**_Figure 2: Details about the Rook ransomware sections and suspicious string size._**\n\n## Rook — technical details\n\nAfter executing on the target machine, Rook tries to find a specific mutex “asfgjkl878645165456fa888” to avoid re-infection or simply create it if\nthe machine is a good candidate.\n\n\n-----\n\n**_Figure 3: Mutex created after the Rook execution. If the mutex is valid, the malware terminates the execution._**\n\n## Drives and network resources with multi-threading power\n\nNext, the malicious process continues, and the network resources and local drives are enumerated. After that, a multi-thread mechanism is\nused to speed up the encryption process, as observed in Figure 4 below.\n\n\n-----\n\n**_Figure 4: Multi-thread mechanism implemented by Rook operators to speed up the encryption process._**\n\nIn detail, the malware calculates the number of threats that it needs to encrypt the files simultaneously (24 times the number of processors).\n\n\n-----\n\n**_Figure 5: Calculation of the number of threats to use to encrypt files._**\n\n## Preparing the encryption process\n\nOne of the main tasks before starting the encryption process is the creation of the RSA asymmetric keys. The ransomware uses the\nRegCreateKeyExW API call to open the Software subkey available on “HKEY_CURRENT_USER.” If the public key exists, Rook uses it. On\nthe other hand, an RSA key pair is generated: “RookPublicKey” and “aRookprivatekey,” and the values are stored on the Windows Registry.\nThe described process is illustrated in Figure 6 below.\n\n\n-----\n\n-----\n\n**_Figure 6: Rook — generation of RSA public-private key pair during execution._**\n\n## Terminate services and processes and skip folders and files\n\nAs observed in other ransomware families, Rook has hardcoded a list of services to be terminated before starting the encryption task,\npreventing, thus, any errors affecting the encryption process.\n\n\n-----\n\n**_Figure 7: Block of code responsible for terminating a list of hardcoded services._**\n\nThe complete list of services is presented below.\n\n\n-----\n\n**_Figure 8: List of processes terminated during the Rook execution._**\n\nSome specific folders can’t be encrypted and damaged during the ransomware execution, or the entire operating system breaks. A list of target\nfolders and files is also coded in a wide char array by Rook operators, as observed in Figure 9.\n\n\n-----\n\n**_Figure 9: List of folders and specific files skipped during the Rook execution._**\n\n## Ransomware note and encrypted files\n\nA file called “HowToRestoreYourFiles.txt” is dropped during the ransomware execution with the instructions (ransomware note) to follow to\nrecover the damaged files.\n\n\n-----\n\n**_Figure 10: Ranonsware note created during the ransomware execution._**\n\nIn addition, the extension “.rook” is also appended to the damaged files.\n\n## Rook – darkweb website\n\nAs observed with other ransomware threats, initially, a demand for payment to decrypt the damaged files is suggested. If the victims don’t pay\nthe ransom, the Rook operators leak the exfiltration data by parts in an extended extorsion schema. This type of extortion scheme creates\ntension and fear, forcing the victims to pay the ransom for the data.\n\n\n-----\n\n**_Figure 11: Rook website available on the Tor network._**\n\n## Learning about rook ransomware\n\nRook ransomware is a recent threat within the malware landscape. It is based on the babuk leaked code and tunned into a powerful weapon\nthat can encrypt a target machine in minutes due to its multi-threading mechanism. Although there is no perfect formula to stop ransomware\ninfections, the implementation of monitoring and the usage of endpoint security solutions, updated antivirus, and the increasing use of canary\nfiles are some of the mechanisms that could prevent the dissemination of these threats in the wild.\n\n**The article was initially published by Pedro Tavares on** **[resources.infosecinstitute.com.](https://resources.infosecinstitute.com/topic/rook-ransomware-analysis/)**\n\n**All rights reserved ®** **[infosecinstitute.com](http://infosecinstitute.com/)**\n\n[Pedro Tavares](https://seguranca-informatica.pt/author/pipocaz/)\n**[Pedro Tavares is a professional in the field of information security working as an Ethical Hacker/Pentester, Malware Researcher and also a](https://www.linkedin.com/in/sirpedrotavares/)**\n[Security Evangelist. He is also a founding member at CSIRT.UBI and Editor-in-Chief of the security computer blog seguranca-informatica.pt.](https://seguranca-informatica.pt/)\n\nIn recent years he has invested in the field of information security, exploring and analyzing a wide range of topics, such as pentesting (Kali\nLinux), malware, exploitation, hacking, IoT and security in Active Directory networks. He is also Freelance Writer (Infosec. Resources Institute\n[and Cyber Defense Magazine) and developer of the 0xSI_f33d – a feed that compiles phishing and malware campaigns targeting Portuguese](https://feed.seguranca-informatica.pt/)\ncitizens.\n\n[Read more here.](https://seguranca-informatica.pt/contacto/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-17 - Rook ransomware analysis.pdf"
    ],
    "report_names": [
        "2022-03-17 - Rook ransomware analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535718,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653774536,
    "ts_modification_date": 1653774536,
    "files": {
        "pdf": "https://archive.orkl.eu/20e59bfdd8f12ed68eb5c9bf7a6f3c5268e9c5a0.pdf",
        "text": "https://archive.orkl.eu/20e59bfdd8f12ed68eb5c9bf7a6f3c5268e9c5a0.txt",
        "img": "https://archive.orkl.eu/20e59bfdd8f12ed68eb5c9bf7a6f3c5268e9c5a0.jpg"
    }
}