{
    "id": "c30a4a14-d427-4cf7-9e8d-61c946bdf9ec",
    "created_at": "2023-01-12T15:08:30.291114Z",
    "updated_at": "2025-03-27T02:17:01.901448Z",
    "deleted_at": null,
    "sha1_hash": "f985c32b733aaa7ccc242099f76380f5f1226858",
    "title": "2020-03-12 - Vicious Panda- The COVID Campaign",
    "authors": "",
    "file_creation_date": "2022-08-18T03:28:39Z",
    "file_modification_date": "2022-08-18T03:28:39Z",
    "file_size": 2250036,
    "plain_text": "# Vicious Panda: The COVID Campaign\n\n**research.checkpoint.com/2020/vicious-panda-the-covid-campaign**\n\nMarch 12, 2020\n\n## Introduction\n\n\nMarch 12, 2020\n\n\nCheck Point Research discovered a new campaign against the Mongolian public sector, which takes advantage of the current\nCoronavirus scare, in order to deliver a previously unknown malware implant to the target.\n\nA closer look at this campaign allowed us to tie it to other operations which were carried out by the same anonymous group, dating back\nto at least 2016. Over the years, these operations targeted different sectors in multiple countries, such as Ukraine, Russia, and Belarus.\n\nIn this report, we will provide a full analysis of the TTPs utilized throughout this campaign, the infrastructure, and the new tools we\nuncovered during our research, of what we believe to be a Chinese-based threat actor.\n\n## Lure Documents\n\nThe investigation started when we identified two suspicious RTF documents sent to the Mongolian public sector. The documents were\nwritten in the Mongolian language, with one of them allegedly from the Mongolian Ministry of Foreign Affairs:\n\n\n-----\n\nDocument 1: Information about the prevalence of new Coronavirus infections\n\nDocument 2: Purchases for buildings in documentary projects\n\nThese RTF files were weaponized using version `7.x of a tool named RoyalRoad (aka` `8.t ).`\n\nThis tool, which is commonly used by various Chinese threat actors, allows the attacker to create customized documents with embedded\nobjects that exploit the Equation Editor vulnerabilities of Microsoft Word.\n\n## Infection Chain\n\nAfter the victim opens the specially crafted RTF document, and the Microsoft Word vulnerability is exploited, a file named `intel.wll is`\ndropped into the Word startup folder: `%APPDATA%\\Microsoft\\Word\\STARTUP .`\n\nThis [persistence technique is often used by newer versions of the so-called RoyalRoad. Every time that Microsoft Word application is](https://attack.mitre.org/techniques/T1137/)\nlaunched, all the DLL files with a `WLL extension in the Word Startup folder would launch as well, triggering the infection chain we`\ndescribe below:\n\n\n-----\n\nInfection Chain Diagram\n\nThis not only serves as a persistence technique, but also prevents the infection chain from fully “detonating” if run inside a sandbox, as a\nrelaunch of Microsoft Word is required for the full execution of the malware.\n\nAfter it’s loaded, the malicious `intel.wll DLL proceeds to download and decrypt the next stage of the infection chain, from one of the`\nthreat actor’s servers: `95.179.242[.]6 .`\n\nThe next stage downloaded is also a DLL file, and it serves as the main loader of the malware framework developed by the attackers. It is\nexecuted using `Rundll32, and it communicates with another one of the threat actor’s C&C servers ( 95.179.242[.]27 ) to receive`\nadditional functionality.\n\nThe threat actor operates the C&C server in a limited daily window, going online only for a few hours each day, making it harder to\nanalyze and gain access to the advanced parts of the infection chain.\n\nAt the final stage of the infection chain, after the appropriate command is received, the malicious loader downloads and decrypts a RAT\nmodule, also in the form of a DLL file, and loads it into memory. This plug-in like architecture might hint at the existence of other modules,\nin addition to the payload we received.\n\nThe RAT module appears to be a custom and unique malware, though it also includes some rather common core capabilities, listed\nbelow:\n\nTake a screenshot\nList files and directories\nCreate and delete directories\nMove and delete files\nDownload a file\nExecute a new process\nGet a list of all services\n\n## Open Window\n\nAt the beginning of our research, one of the attacker’s servers, which served the next stage malware, had directory listing enabled for a\nlimited time. This allowed us to download all hosted files, as well as to gain some insight into the operation timeline and the working hours\nof the attackers.\n\n\n-----\n\nOpen directory at 95.179.242[.]6\n\nEven though they were available for download, all the files on the server came encrypted.\n\nLuckily, by utilizing the same encryption scheme seen in our infection chain, we were able to decrypt most of the files stored on the\nserver.\n```\nkey = \"VkvX7CK7X7*t$x&hssLR6fOyFSaKrFJKx&@#AK*[email protected]$nsCNKPe\"\n\ndef decrypt(enc,offset):\n\n  decrypted = \"\"\n\n  for i in range(len(enc)):\n\n    decrypted += chr((ord(enc[i]) ^ ord(key[(i + offset) & 0x3f])))\n\n  return decrypted\n\n```\nDecryption scheme derived from “intel.wll”\n\nThe dozen of files that we were able to decrypt can be divided into four main clusters of malware loader families. Their embedded internal\nnames and core functionality are described below:\n\n**http_dll.dll (Intel.wll)** The first stage loader described above. Decrypts the C&C address, then downloads and decrypts the next\nstage DLL, and executes it via `Rundll32 .`\n\n**ppdown.dll** Functions as downloader and decryptor for the .rar files stored on the attackers’ server. Reads an\n```\n             access.txt file from the server, decrypts it and splits the result into 3 parts:\n\n```\n1) The name of the next stage to download.\n\n2) The next stage export function to call.\n\n3) The decryption key for the next stage.\n\n**Rundll32Templete.dll** This variant serves as loader and decryptor for next stage payload. The payload is encrypted in .sect section.\n\n**Minisdllpub.dll** The second stage loader, fully described below. Loads additional DLL plugins. A similar version of this\npayload, called minisdllpublog.dll, contains some additional debug printing capabilities.\n\nPayload types found on the server\n\n## Connection to other samples\n\nAfter gaining access to the additional decrypted files, we were able to hunt for similar samples.\n\nSearching for similar files by the internal names ( http_dll, `Rundll32Templete` and `minisdllpub ), unique exported functions`\n( Engdic, `WSSet and` `MSCheck ) and code similarities (decryption methods, communication patterns, etc.), allowed us to find more`\nsamples related to the attacker:\n\n```\n5560644578a6bcf1ba79f380ca8bdb2f9a4\nb40b7\n207477076d069999533e0150be06a20ba74\nd5378\n\n```\n```\nhttp_dll.dll\nhttp_dll.dll\n\n```\n\n-----\n\n```\n b942e1d1a0b5f0e66da3aa9bbd0fb46b8e1\n 6d71d\n 9ef97f90dcdfe123ccb7d9b45e6fa9eceb2\n 446f0\n cf5fb4017483cdf1d5eb659ebc9cd7d1958\n 8d935\n 92de0a807cfb1a332aa0d886a6981e7dee1\n 6d621\n cde40c325fcf179242831a145fd918ca728\n 8d9dc\n 2426f9db2d962a444391aa3ddf75882faad\n 0b67c\n 9eda00aae384b2f9509fa48945ae8209039\n 12a90\n 2e50c075343ab20228a8c0c094722bbff71\n c4a2a\n 2f80f51188dc9aea697868864d88925d64c\n 26abc\n\n```\nNewly discovered related samples\n\n```\nhttp_dll.dll\nhcc_dll.dll\nRundll32Templet\ne.dll\nRundll32Templet\ne.dll\nminisdllpublog.\ndll\nIrmonSvc.dll\nIrmonSvc.dll\nIrmonSvc.dll\nNWCWorkstation.\ndll\n\n```\n\nOne of the samples found ( 92de0a807cfb1a332aa0d886a6981e7dee16d621 ) led us to an [article covering a similar initial infection chain,](https://bbs.pediy.com/thread-256810.htm)\nwhich appears to be after Ukrainian targets.\n\nAnother sample ( 9ef97f90dcdfe123ccb7d9b45e6fa9eceb2446f0 ) was originally dropped by an RTF [document which appears to be](https://www.virustotal.com/gui/file/5187c9a84f5e69ba4b08538c3f5e7432e7b45ac84dec456ea07325ff5e94319a/detection)\ntargeting entities in the Russian Federation, back in late 2018.\n\n## Infrastructure\n\nAnalyzing the newly discovered samples introduced us to a larger part of the infrastructure utilized by the threat actor, and a common\nTTP: All the C&C servers were hosted on Vultr servers and the domains were registered via the GoDaddy registrar.\n\n\n-----\n\nInfrastructure overview\n\nAs we analyzed this campaign, in addition to the infrastructure used, we also noticed an interesting behavior by the attackers\n\nAt a certain point, the C&C server `95.179.242[.]6 stopped serving the open directory listing. A few days later` `dw.adyboh[.]com`\nbecame an open directory:\n\nOpen directory listing at dw.adyboh[.]com\n\nThis might indicate that the attackers are enabling directory listing, when one of their payload delivery servers is in active use.\n\n## Attribution\n\n\n-----\n\nFrom the malicious document perspective, we believe that the naming scheme for `intel.wll  which is dropped by version` `7.x of`\n```\nRoyalRoad is not enough to make a clear cut attribution, as we observed the same name used by various threat actors dropping\n\n```\ndifferent malware families such as `Bisonal and` `Poison Ivy .`\n\nFrom the payload perspective, on the other hand, once we found the additional related samples mentioned in the Hunting section above,\nwe were able to connect it to a known threat group. In the `NWCWorkstation.dll sample mentioned above, we observed a unique string`\nas part of the logging functionality: “V09SS0lO”. This led us to an [article from 2017 by Palo Alto Networks, titles Threat Actors Target](https://unit42.paloaltonetworks.com/unit42-threat-actors-target-government-belarus-using-cmstar-trojan/)\n**Government of Belarus, which describes an attack that utilizes a RAT named** `BYEBY .`\n\n[The article itself also connects to a previous article dating back to 2016, where the same tools were used in an attack targeting the](https://unit42.paloaltonetworks.com/digital-quartermaster-scenario-demonstrated-in-attacks-against-the-mongolian-government/)\nMongolian government. The article also explores the connections between these attacks and previous attacks related to the `Enfal`\nTrojan.\n\nBy comparing the IOCs from the 2017 attack to our campaign we observed several similarities:\n\n**Infrastructure Similarities**\n\nThe servers from the 2017 publication were set on the same infrastructure as all the other samples found during our investigation, and\nutilize Vultr and GoDaddy services.\n\n**Code Similarities**\n\nWhen analyzing one of the files from the open directory ( bf9ef96b9dc8bdbc6996491d8167a8e1e63283fe ), we noticed that it decrypts\nand loads a DLL named `wincore.dll . By investigating this dropped file, we were able to make several correlations to the` `BYEBY`\nsample from 2017:\n\n1. String similarity:\n\n“BYEBY” strings\n\n“wincore.dll” strings\n\n1. Function similarity – Important functions in both `BYEBY and` `wincore.dll have almost the same implementation. One such`\n\nfunction is the payloads’ main thread function.\n\n\n-----\n\nMalware implementation similarities\n\n1. Global Call-Graph and X-Ref Graph – Even though some obfuscation exists in both samples, we were able to verify that they have\n\nsimilar call and reference graphs, meaning that the core functionality of the executables is the same.\n\n## Payload – In Depth Analysis\n\nTo recap, the second stage payload in the attack chain, is an encrypted DLL file named `minisdllpub.dll . The DLL, downloaded from`\n```\n95.179.242[.]6, is a downloader for an additional payload. In the following section, we go over its implementation and highlight the\n\n```\ncharacteristics which are unique to this payload.\n```\nMinisdllpub.dll begins by creating a mutex with the name Afx:DV3ControlHost . This is a unique indicator that can later be used\n\n```\nto hunt for more samples in the wild. It then defines a structure of size `0x5f8 to store system and environment information such as the`\nname of the running computer, IP addresses, the username, and OS Version. Next, another structure of size `0x3FC is created, this time`\nto store pointers to loaded DLLs and API functions, as well as the command and control IP address ( 95.179.242[.]27 ) and port\n( 443 ).\n\nAfter setting up these structures, the flow continues and a new thread is created. First, it fetches several lists of API functions, and\ndynamically loads them. As can be seen in the following image, each list is comprised of the name of a library followed by a sequence of\nAPI functions to load from this library. Pointers to these functions are then added to the previous structure which are used to dynamically\ninvoke them when needed.\n\nComma-separated lists of API functions, prepended with the library name\n\n\n-----\n\nThe second stage payload then sets up HTTP or HTTPS communication, depends on several checks, and starts communicating with its\nremote control in new threads. When the server replies, it sends XOR encoded DLL to the malware, with the key `0x51 .`\n```\nMinisdllpub.dll then decodes the given payload and dynamically loads the new PE to memory.\n\n```\nWhen loaded, it searches for an export function with the name e. The malware then keeps listening to commands from the server, and\nwhen those are received, it passes them to the `\"e\" function of the newly loaded payload. By doing so, the second-stage is operating as`\na middle-man between the C&C and the final payload – a remote access tool.\n\nThe malware is searching for the export function “e”, in order to invoke it\n\nAt this point, we have a unique layout of modules loaded on the victim’s computer. First, is the `Minisdllpub.dll that was initially`\nloaded using `Rundll32 by` `http_dll.dll ( intel.wll ) when a Microsoft Office application was executed. Next, we have the RAT`\npayload itself which receives its control commands not directly from the C&C, but through `Minisdllpub.dll that acts as a mediator.`\n\nLoader execution flow\n\nInterestingly, in addition to the commands to execute, `Minisdllpub.dll also passes several structures to the final payload. The`\nstructures which were previously built and filled, are now used by the RAT to dynamically invoke API functions and deliver data to the\nC&C server. This unique approach of re-using function pointers that were loaded in the previous module makes the analyzing the RAT\nhardly possible without having the previous stage as well.\n\nThe supported functionalities of the final payload, as well as the respective commands it receives and sends, are described in the table in\nAppendix A.\n\n## Conclusion\n\n\n-----\n\nIn this campaign, we observed the latest iteration of what seems to be a long running Chinese based operation against a variety of\ngovernments and organizations worldwide. This specific campaign leverages the COVID-19 pandemic to lure victims to trigger the\ninfection chain.\n\nThe attackers updated their toolset from documents with macros and older RTF exploits to the latest variation of the “RoyalRoad” RTF\nexploit-builder observed in the wild.\n\nThe full intention of this Chinese APT group is still a mystery, but it is clear they are here to stay and will update their tools and do\nwhatever it takes to attract new victims to their network.\n\n[Check Point SandBlast Agent protects against this APT attack, and prevents it from the very first steps.](https://www.checkpoint.com/products/advanced-endpoint-protection/)\n\n**Appendix A: RAT Module – Supported Commands**\n\n\n**Command ID**\n**(Sent from C&C)**\n\n\n**Sub Command ID**\n**(Sent from C&C)**\n\n\n**Description** **Response ID**\n**(Sent from Bot)**\n\n\n**0x21** Write a file to a specified path. Set the written file’s timestamp to\nthe timestamp of the local kernel32.dll.\n\n\n0x22\n\n\n**0x23** Get contents of a file. 0x24\n\n**0x25** List files in a directory. 0x26\n\n**0x2E** Execute command in a new thread. 0x31\n\n**0x2F** Execute a command. 0x30\n\n**0x32** 0x00 Create a directory of by a given path. 0x33\n\n**0x32** 0x01 Remove a directory in a given path. 0x33\n\n**0x32** 0x02 Move a file from a given path to a given directory. 0x33\n\n**0x32** 0x03 Delete a file in a given path. 0x33\n\n\n**0x32** 0x04 Move a file from a given path to a given directory. (Same as\nsubcommand 0x02)\n\n\n0x33\n\n\n**0x34** 0x07 Get a list of all the services. 0x35\n\n**0x34** 0x08 Execute a new process using WinExec. 0x35\n\n**0x34** 0x09 Execute a new process. (Same as subcommand 0x08) 0x35\n\n**0x34** 0x0A Take a screenshot. 0x35\n\n**0x34** 0x15 Set registry key values. 0x35\n\n**0x34** 0x16 Download file from URL. 0x3A or 0x3B\n\n**0x34** 0x17 Download file from URL. (Same as subcommand 0x16) 0x3A or 0x3B\n\n**0x34** 0x18 Create Pipes and execute a new process. 0x3D or 0x3B\n\n**0x34** 0x19 Create Pipes and execute a new process (same as 0x18). 0x3D or 0x3B\n\n\n**0x36** Copy the file of the current process with a “.t” extension and\nmodify the registry.\n\n**Appendix B: Files on the server**\n\n\n0x37\n\n\n**Internal File Name** **SHA-1** **Server**\n**Location**\n\n\n**Exports**\n\n\n**http_dll.dll** dde7dd81eb9527b7ef99ebeefa821b11581b98e0 img\\0115\\WRql7X Engdic\n\n**http_dll.dll** fc9c38718e4d2c75a8ba894352fa2b3c9348c3d7 bin\\0612wy3\\KFuGrS-code MSCheck\n\n**ppdown.dll** 601a08e77ccb83ffcd4a3914286bb00e9b192cd6 bin\\0612wy3\\KFuGrS MSCheck\n\n**ppdown.dll** 27a029c864bb39910304d7ff2ca1396f22aa32a2 bin\\0612wy3\\KFuGrS-ppd-bak MSCheck\n\n\n-----\n\n**Rundll32Templete.dll** 8b121bc5bd9382dfdf1431987a5131576321aefb img\\0115\\CYMi0Y-bak\n\nimg\\0115\\R7pEFv\n\n\nWSSet\n\n\n**Rundll32Templete.dll**\n**(x64)**\n\n\nbf9ef96b9dc8bdbc6996491d8167a8e1e63283fe bin\\test0625\\CmlN0i MSCheck\n\n\n**minisdllpub.dll** fcf75e7cad45099bf977fe719a8a5fc245bd66b8 img\\0115\\CYMi0Y\n\nimg\\0120\\VIdALQ\n\nimg\\1224\\AF9i1i\n\n**minisdllpublog.dll** 0bedd80bf62417760d25ce87dea0ce9a084c163c bin\\0612wy3\\KFuGrS-www\n\nbin\\0617wy3\\LX5sG1\n\n\nWSSet\n\nMSCheck\n\n\n**gg.dll** 5eee7a65ae5b5171bf29c329683aacc7eb99ee0c bin\\0612wy3\\TTXk1U.rar MSCheck\n\n\n**minisdllpub.dll** 3900054580bd4155b4b72ccf7144c6188987cd31 Dropped by\n\n8b121bc5bd9382dfdf1431987a5131576321aefb\n\n**wincore.dll** e7826f5d9a9b08e758224ef34e2212d7a8f1b728 Dropped by\n\nbf9ef96b9dc8bdbc6996491d8167a8e1e63283fe\n\n**Appendix C: Additional IOCs**\n\n**Servers:**\n```\n95.179.242[.]6\n\n95.179.242[.]27\n\n199.247.25[.]102\n\n95.179.210[.]61\n\n95.179.156[.]97\n\ndw.adyboh[.]com\n\nwy.adyboh[.]com\n\nfeb.kkooppt[.]com\n\ncompdate.my03[.]com\n\njocoly.esvnpe[.]com\n\nbmy.hqoohoa[.]com\n\nbur.vueleslie[.]com\n\nwind.windmilldrops[.]com\n\n```\n**RTFs:**\n```\n234a10e432e0939820b2f40bf612eda9229db720\n\n751155c42e01837f0b17e3b8615be2a9189c997a\n\nae042ec91ac661fdc0230bdddaafdc386fb442a3\n\nd7f69f7bd7fc96d842fcac054e8768fd1ecaa88a\n\ndba2fa756263549948fac6935911c3e0d4d1fa1f\n\n```\n**DLLs:**\n\n\nWSSet\n\nLoadKernel\n\n\n-----\n\n```\ndde7dd81eb9527b7ef99ebeefa821b11581b98e0\n\nfc9c38718e4d2c75a8ba894352fa2b3c9348c3d7\n\n601a08e77ccb83ffcd4a3914286bb00e9b192cd6\n\n27a029c864bb39910304d7ff2ca1396f22aa32a2\n\n8b121bc5bd9382dfdf1431987a5131576321aefb\n\nbf9ef96b9dc8bdbc6996491d8167a8e1e63283fe\n\nfcf75e7cad45099bf977fe719a8a5fc245bd66b8\n\n0bedd80bf62417760d25ce87dea0ce9a084c163c\n\n5eee7a65ae5b5171bf29c329683aacc7eb99ee0c\n\n3900054580bd4155b4b72ccf7144c6188987cd31\n\ne7826f5d9a9b08e758224ef34e2212d7a8f1b728\n\na93ae61ce57db88be52593fc3f1565a442c34679\n\n5ff9ecc1184c9952a16b9941b311d1a038fcab56\n\n36e302e6751cc1a141d3a243ca19ec74bec9226a\n\n080baf77c96ee71131b8ce4b057c126686c0c696\n\nc945c9f4a56fd1057cac66fbc8b3e021974b1ec6\n\n5560644578a6bcf1ba79f380ca8bdb2f9a4b40b7\n\n207477076d069999533e0150be06a20ba74d5378\n\nb942e1d1a0b5f0e66da3aa9bbd0fb46b8e16d71d\n\n9ef97f90dcdfe123ccb7d9b45e6fa9eceb2446f0\n\ncf5fb4017483cdf1d5eb659ebc9cd7d19588d935\n\n92de0a807cfb1a332aa0d886a6981e7dee16d621\n\ncde40c325fcf179242831a145fd918ca7288d9dc\n\n2426f9db2d962a444391aa3ddf75882faad0b67c\n\n9eda00aae384b2f9509fa48945ae820903912a90\n\n2e50c075343ab20228a8c0c094722bbff71c4a2a\n\n2f80f51188dc9aea697868864d88925d64c26abc\n\n```\n**RAT:**\n```\n238a1d2be44b684f5fe848081ba4c3e6ff821917\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-12 - Vicious Panda- The COVID Campaign.pdf"
    ],
    "report_names": [
        "2020-03-12 - Vicious Panda- The COVID Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f5c5d5d4-3969-4e34-9982-55144c3908eb",
            "created_at": "2022-10-25T16:07:24.37846Z",
            "updated_at": "2025-03-27T02:02:10.200339Z",
            "deleted_at": null,
            "main_name": "Vicious Panda",
            "aliases": [
                "Bronze Dudley"
            ],
            "source_name": "ETDA:Vicious Panda",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "BBSRAT",
                "Byeby",
                "Cmstar",
                "Enfal",
                "Lurid",
                "Pylot",
                "RoyalRoad",
                "Travle",
                "meciv"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6e79c98d-c678-4f28-b869-5723a78e71f4",
            "created_at": "2023-01-06T13:46:39.422441Z",
            "updated_at": "2025-03-27T02:00:03.08607Z",
            "deleted_at": null,
            "main_name": "Vicious Panda",
            "aliases": [
                "SixLittleMonkeys"
            ],
            "source_name": "MISPGALAXY:Vicious Panda",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536110,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1660793319,
    "ts_modification_date": 1660793319,
    "files": {
        "pdf": "https://archive.orkl.eu/f985c32b733aaa7ccc242099f76380f5f1226858.pdf",
        "text": "https://archive.orkl.eu/f985c32b733aaa7ccc242099f76380f5f1226858.txt",
        "img": "https://archive.orkl.eu/f985c32b733aaa7ccc242099f76380f5f1226858.jpg"
    }
}