{
    "id": "c351fc30-ab8b-48a1-a70e-75065b3a7efd",
    "created_at": "2023-01-12T15:00:05.157343Z",
    "updated_at": "2025-03-27T02:09:18.171063Z",
    "deleted_at": null,
    "sha1_hash": "93c5ba676248434f296b153640b9d3db9c4dd8d9",
    "title": "2022-04-26 - How Cybercriminals Abuse Cloud Tunneling Services",
    "authors": "",
    "file_creation_date": "2022-05-28T00:44:03Z",
    "file_modification_date": "2022-05-28T00:44:03Z",
    "file_size": 5037930,
    "plain_text": "# How Cybercriminals Abuse Cloud Tunneling Services\n\n**[trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/how-cybercriminals-abuse-cloud-tunneling-services](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/how-cybercriminals-abuse-cloud-tunneling-services)**\n\n**By Ryan Flores, Stephen Hilt, Lord Remorin**\n\nCloud tunneling services, which allow users to expose internal systems from their homes or businesses to the internet by relaying the traffic\nthrough cloud-based systems, have grown in use over the past few years. Unfortunately, as with any kind of service that helps developers\nand infrastructure administrators, cybercriminals have been abusing these services for various illicit operations.\n\nLegitimate cloud tunneling services are beneficial to a wide range of people, from home users to large-enterprise employees. They are also\ncommonly used to help developers test and deploy code, and to share services with select people and groups on the internet. The use\ncases for these services range from small-scale, such as playing local games with friends, to industrial-scale, including testing out large\nsystems on the internet before pushing the code to production. Malicious actors, on the other hand, have their own method of using these\nservices: They employ cloud tunneling to mask their real locations as well as for short-lived purposes, so they do not deploy permanent\nonline infrastructure.\n\nIn this article, we describe the legitimate uses of cloud tunneling services for enterprises and contrast them with how cybercriminals abuse\nthese services. We also delve into security implementations intended to help users completely block cloud tunneling, or as an alternative,\nsince some might be using these services, to best gauge and monitor the potential risk that using cloud tunneling services could bring. We\nalso take a look at defense strategies that involve the detection of both authorized and unauthorized use of cloud tunneling services,\nincluding any potential attempt to bypass corporate restrictions by cybercriminals or rogue employees.\n\n01\n\n### An Overview of Cloud Tunneling Services\n\n02\n\n### Testing Methodology\n\n03\n\n### Possible Malicious Uses of ngrok and Other Cloud Tunneling Services\n\n04\n\n### Defense Measures\n\n05\n\n### Conclusion\n\n06\n\n### Appendix\n\n## An Overview of Cloud Tunneling Services\n\n\n-----\n\nA tunneling service is used to expose a service through a cloud system so as to obscure the original source, whether for short or long\nperiods. This is done typically because the service is behind a security system or the user wants to limit who has access to the original\nsource. A tunneling service is a useful tool for users who want to expose only a specific portion of the service online. The use of tunneling is\nnot limited to large systems in a corporate environment; it can also be used in smaller, more personal projects. During our research into\ntunneling systems, we observed it being implemented in a variety of online systems, including login pages, security tools, chat platforms,\nvideo recording systems — such as IP cameras, network video recorders (NVRs), and video management systems (VMSs) — and even\ngame servers.\n\nBefore we discuss how cloud tunneling services are being used for malicious purposes, we must first understand how these services are\nused legitimately within the network. The primary benefit of cloud tunneling services is as a user-friendly tool for exposing services to the\ninternet. With these services, users can quickly deploy local development services online while avoiding the hassle of configuring firewalls\nand registering domain names.\n\nA developer who needs to test their web applications online can simply run their service and configure a tunnel to circumvent any firewall\nconfiguration — even when the development server is running behind network address translation (NAT). We have seen a popular cloud\n[tunneling service, ngrok, being used to expose the staging environment of a BroadVoice service used for VoIP applications. In this scenario,](https://www.broadvoice.com/)\na tunnel enables the development team to safely perform third-party integration testing and provides the team the ability to sort out any\nissues before deploying the app or service into production.\n\nUsing a tunnel can be very convenient for a home user who either is anxious about modifying the port forwarding rules on their router or has\nrestricted access to their router’s configuration because of internet service provider limitations. The user can install the service they want to\nrun and simply use a tunnel application for clients to connect through the internet. Some services even suggest using tunnels in their\ntutorials. For example, Rocket.Chat’s [installation guide on Github suggests using ngrok as an option for sharing the chat server online.](https://github.com/RocketChat/Rocket.Chat.RaspberryPi)\n\nFigure 1. Rocket.Chat’s installation guide suggesting the use of ngrok\n\nIn addition to chat platforms, we have also seen ngrok being used for home automation applications like Home Assistant, Homebridge, and\nOpenHAB. For DIY users who want to install video monitoring or surveillance in their homes, Blue Iris is a popular choice among VMS\napplications and provides tutorials on its forum on how to use ngrok to easily access its web portal and perform monitoring away from the\nhome network.\n\n\n-----\n\n-----\n\nFigure 2. Screenshots of the login pages of Home Assistant (top) and Blue Iris (bottom)\n\nAside from developers and home users, we have also seen ngrok being used by e-commerce businesses in some parts of Asia. A good\nexample of this is the web panel for administrative access for coin-operated Wi-Fi network access in the Philippines. In this example, the\nmachines act as a gateway for selling internet access via Wi-Fi that is paid by the minute. The management of these machines can be done\nlocally, but since it involves managing multiple machines from various locations, administrators can simplify this by using tunneling services\nfor access.\n\n\n-----\n\nFigure 3. A screenshot of the web panel for coin-operated Wi-Fi access\n\nYet another use of ngrok we have commonly observed is for hosting local game servers on the internet. Games that have locally hosted\nservers, like Minecraft and Foundry Virtual Tabletop, frequently popped up while we were investigating ngrok traffic. Employees can deploy\nlocal game servers from their home networks and host them on ngrok to be accessed on a corporate network. For organizations that restrict\naccess to gaming servers, it is an added challenge to identify gaming-related network traffic.\n\n\n-----\n\nFigure 4. Servers for Minecraft (top) and Foundry Virtual Tabletop (bottom) hosted on ngrok\n\n## Testing Methodology\n\n[While looking at a few cloud tunneling services, we determined that the primary application we would focus on would be ngrok because of](https://ngrok.com/)\nits overwhelmingly large market share that emerged in our datasets, roughly 99% of the HTTP traffic of cloud tunneling services. The other\n[cloud tunneling services we considered were localhost.run,](https://localhost.run/) [PageKite,](https://pagekite.net/) [Localtunnel,](https://localtunnel.me/) [Serveo, and](http://serveo.nl/) [Packetriot. While these services could be](http://packetriot.com/)\nused by malicious actors in the same manner, this paper focuses on ngrok as our use case.\n\nFigure 5. The distribution of HTTP traffic for cloud tunneling services based on our datasets in 2021 (in terms of how many times data was\nsent over HTTP)\n\n\n-----\n\n[Figure 6. An overview of how ngrok works](https://surajpanker82.medium.com/ngrok-96fd33ca869c)\n\nNot all of the services use the same back-end implementation, but the concepts of how they operate are the same. For ngrok, the user\ndownloads a binary, for Windows, macOS, or Linux.\n\nThe ngrok platform offers three account levels:\n\nFree use that does not require an account\nA free account with limited features\nA paid account with extra features that can cost up to US$25 a month\n\nInitially, we chose a free account and went right to setting it up. After downloading the binary, we needed an authtoken to have access to\nmore features.\n\n\n-----\n\nFigure 7. A screenshot of the ngrok website\n\nTo test the application, we set up a Rocket.Chat server and pointed ngrok to port 3000, which is the port we used for our Rocket.Chat\ninstall.\n\nFigure 8. Building the tunnel up with the ngrok command\n\nThe way ngrok works is based on the type of account, and whether the TCP or HTTP options are being used. When we started this\nresearch using the ngrok HTTP URLs, we included the computed subdomain to ngrok.io in the URL to point the browser to the HTTP-type\nconnections.\n\nBased on our observations, the subdomain contained 12 characters, either with or without hyphens based on when it was generated. A\nnewer generated subdomain contains hyphens (specifically, separating the IP address of the machine that is running ngrok) and starts with\na 4-byte hex word. On a higher-tier paid account, the user can use a custom subdomain that can contain, for example, their organization’s\nname or another important aspect of the company or service they are trying to expose. If the user is not careful, they could expose their\ninternet point of presence to an attacker. At the same time, an attacker could also have their real IP address exposed.\n\nAn attacker could perform some basic open-source intelligence (OSINT) to find the target domain. Examples of this include searching\nGitHub for code that might point to cloud tunneling services and using the search strings “site:victim.com” and “ngrok.io” on Google.\nFurthermore, if the TCP option is in use, instead of the 12-character subdomain, the host number appears as the subdomain along with a\nrandomly assigned port. An example of this would be 4[.]tcp.ngrok.io:10667.\n\nFigure 9. A Rocket.Chat example used for testing purposes\n\n\n-----\n\nAs expected, the service was exposed and a user could log in and use the system as if locally connected. Based on some testing, we\ndiscovered that the system running the ngrok tunneling service would communicate only with ngrok’s servers via an encrypted SSL tunnel\nover port 443, while the client machine would interact with the URL that was provided. Interestingly, ngrok provides an HTTPS option using\na valid certificate that is wild-carded for *.ngrok.io.\n\nFigure 10. A screenshot of the certificate information used by ngrok.io for HTTPS\n\nOne characteristic we discovered while looking into how the ngrok service works was that it is persistent in trying to build the tunnel from the\nmachine running ngrok. It first tries to connect to tunnel.REGION.ngrok.com, and if that fails, it tries to connect to equinox.io to look for an\nupdate. It then tries to connect to dns.google.com to look up ngrok.com’s IP addresses and, finally, if that fails, it pulls a JSON file from\ns3.amazonaws.com, hosted on Amazon Simple Storage Service (S3).\n\nFigure 11. A screenshot of dns.google.com looking up tunnel.us.ngrok.com\n\n\n-----\n\nFigure 12. A JSON file hosted on an Amazon S3 bucket with the IP addresses of tunnel.REGION.ngrok.com\n\nFigure 13. A diagram of how ngrok tunnels are built and how clients interact with them\n\n## Possible Malicious Uses of ngrok and Other Cloud Tunneling Services\n\nAs with any other online platform, malicious actors could take advantage of ngrok and other cloud tunneling services, and use them for\nmalicious purposes. Services like ngrok and Tor could be used by cybercriminals to hide their true IP addresses. However, the difference\nbetween ngrok and Tor is that services tunneled through ngrok are still accessible via the regular internet while services tunneled through\nTor can be accessed only through Tor. This can be a deciding factor for a cybercriminal when choosing a target network, as they might\nprefer one with wider access over a network that can be accessed only via Tor.\n\nDuring our research, we categorized cloud tunneling service abuse into two malicious use cases: internal threats and external threats.\nInternal threats are attacks where cloud tunneling services are unknowingly used on an infected endpoint or network to expose internal\nservices like SMB, FTP, and HTTP, while external threats are the more typical cyberattacks such as phishing, drive-by download, and\nmalware command-and-control (C&C) communication through the cloud tunnel network.\n\nAspect **Internal threats** **External threats**\n\nAttacker already present in target machine or network Yes No\n\nCloud tunneling service binary execution Server is running in a machine on corporate network Server is running remotely\n\n\nPossible tactics, techniques, and procedures (TTPs) Lateral movement\nData exfiltration\n\nTable 1. A comparison of internal and external cloud tunneling service threats\n\n### Internal Threats\n\n\nMalware file hosting\nMalware C&C server\nPhishing scams\nExploit kits\n\n\n-----\n\nA cloud tunneling service could be used maliciously on a target machine or network to unknowingly expose nonpublic services to the\ninternet. These services could be anything that is accessible from the machine the cloud tunneling service is executed on, such as internal\nweb applications, database servers, and file-sharing services.\n\nCybercriminals and insider threats such as rogue employees could easily expose company-restricted services that are meant to be\naccessible only on the intranet without having to deal with router configurations. Attackers with access to compromised servers could also\nhost services like web servers and malware C&C servers for nefarious activities.\n\n[In July 2020, we discovered an attack that exposed an SMB port using ngrok. After exposing the service, the attacker used tools like](https://www.trendmicro.com/en_us/research/20/i/analysis-of-a-convoluted-attack-chain-involving-ngrok.html)\nSmbExec to run a local Windows shell on the infected machine, and then downloaded and executed a keylogger. This incident shows that a\nlegitimate application used for tunneling services could be misused. And since the network traffic while establishing a tunnel to ngrok’s\nservers is normally seen on DevOps networks, a malicious actor could mask its network activity and avoid its being flagged as malicious.\n\n[The data exfiltration capabilities of ngrok include a built-in feature to host a local directory straight to the internet without starting a file-](https://ngrok.com/docs#http-file-urls)\nhosting service on the affected machine.\n\n### External Threats\n\nWhile we have seen cloud tunneling services being used to bypass the firewall rules set up by network administrators to expose internal\nservices, a far more common use of the service by cybercriminals is for malware traffic or for hosting phishing websites. For malicious\nactors using malware that requires communicating back to a C&C server, using cloud tunneling services could be advantageous because of\nthe ease with which users can set up infrastructure. In addition, malicious actors using paid plans could also hide their true IP addresses via\ncustom reserved subdomains. Thus, they could avoid registering domains and setting up SSL certificates, which, if not done properly, could\nlead to identity exposure through an OSINT investigation.\n\nTutorials on sites like YouTube and GitHub also contribute to the growing popularity of cloud tunneling services for exposing services to the\ninternet. There are a good number of tutorials on YouTube that show cloud tunneling services being used for malicious purposes, such as\nsetting up a remote administration tool (RAT) C&C server or an HTTP server for hosting a phishing page. We believe that these tutorials\ncater to the more entry-level cybercriminals who are looking to deploy RATs for their own use.\n\nAs of this research, the most common malicious use of cloud tunneling services is for setting up phishing pages and malware C&C servers.\nWe discuss these further in the following subsections. It is important to note, however, that these are just the most common and there are\nother malicious use cases, such as using ngrok for hosting malware binaries or exploit kits.\n\n[One example of ngrok’s being used in an attack occurred in 2019, when the threat actors behind the Lord Exploit Kit (not connected with](https://blog.malwarebytes.com/threat-analysis/2019/08/say-hello-to-lord-exploit-kit/)\none of the authors of this research) used the service to host its web server. Initially, they used it to deliver the njRAT malware, before\neventually expanding its use to the distribution of the Eris ransomware. During this campaign, the random generation of subdomains by\nngrok became an advantage to the threat actors running the exploit kit.\n\n**Phishing**\n\n[Penetration-testing tools such as SocialFish have integrated cloud tunneling services into their phishing toolkits (specifically, version 2 for](https://github.com/UndeadSec/SocialFish)\nSocialFish, which, unlike the latest versions, has ngrok integrated). With such toolkits, penetration testers and red teamers, as well as\ncybercriminals, could not only create phishing pages with just a few keystrokes, but also generate working cloud tunneling service URLs\nthat could be immediately sent out via email, chat apps, and a variety of other methods. This makes it very convenient for would-be\nphishers, as they would not even need to register any domain name, deal with any web hosting service, or go through the trouble of hacking\nweb servers and hosting the phishing page there.\n\n\n-----\n\nFigure 14. The Social Fish website offering an older version with ngrok integrated\n\nThe most popular phishing kits we found were targeting users of Instagram, Facebook, Bank of America, Gmail, Paypal, Netflix, and\nDropbox. We also found phishing kits for ANZ, Bank of Colombia, Chase Bank, and Banco de la Nación Argentina. However, the latter\nphishing kits were smaller in volume than the former group.\n\n\n-----\n\nFigure 15. The open directories of phishing pages targeting users of Adobe (top) and AOL (bottom)\n\n\n-----\n\nFigure 16. A sample Instagram phishing page found in ngrok URLs\n\nFigure 17. The distribution of phishing kits according to volume (in terms of how many times data was sent over HTTP)\n\nNormally, phishing kits abuse web hosting services or are hosted on compromised sites and typo-squatting sites. Tunneling services have\nbeen gaining popularity among malicious actors since they provide a convenient alternative for hosting phishing pages.\n\n\n-----\n\nOne reason phishing pages that use cloud tunneling services could be dangerously deceptive is that if a user is sent, say, an ngrok based\nphishing URL, there is a high chance that the recipient would assume that it is a legitimate site, since they can visit the HTTPS version and\nget a valid signature from ngrok.\n\nOver the years, people have been trained to view the lock icon in their browsers as a guarantee that the websites they are visiting are\nsecure. In this case, there is a valid certificate for the domain, which in turn might lead to higher victim counts for a phishing campaign.\nFurthermore, if they are using a paid ngrok subscription, for example, attackers could use a subdomain similar to the one they are\nmimicking to add authenticity to their phishing campaign.\n\nFigure 18. A comparison of a legitimate page (left) and a phishing page (right) for PayTickr logins\n\n**Malware Command-and-Control Servers**\n\nIn the cybercriminal underground, there is plenty of discussion surrounding cloud tunneling services, particularly ngrok, and how they could\nbe abused for malicious purposes. When we started this research, we browsed underground forums and found plenty of examples, from\ndeveloping or hosting malware to tutorials on making phishing sites using cloud tunneling services.\n\nFigure 19. A screenshot from a thread on Hack Forums on how to install the DarkComet RAT using ngrok\n\n\n-----\n\nFigure 20. A screenshot from a discussion on ngrok and phishing\n\nThe discussions in the underground match what we have observed as the main form of abuse of cloud tunneling services, such as for\nphishing and for tracking avoidance. Cybercriminals are paying attention to cloud tunneling services as they attempt to hide themselves\nfrom their victims by tunneling communications through the services’ systems.\n\nMalicious actors could hide their true identities by not exposing any IP addresses or domain name registrations. By using cloud tunneling\nservices, they could make the network traffic of their malware look as though it were being used for legitimate purposes, making it seem that\nthe target’s network is communicating with clean IP addresses and domains. For this reason, we have seen an increase in commodity\nmalware families (which are commonly used by entry-level cybercriminals) that use cloud tunneling services to expose their C&C servers.\n[One popular example is DarkComet, which has had C&C servers hiding behind ngrok’s network.](https://dl.acm.org/doi/fullHtml/10.1145/3366423.3380277)\n\nFigure 21. DarkComet being hosted on one of ngrok’s TCP ports\n\nThe use of ngrok with malware has been rising since 2020. From Jan. 1 to Dec. 31, 2021, we found nearly 16,000 unique malware samples\nthat used ngrok to route C&C traffic. Malware families such as DarkComet, AsyncRAT, NanoCore, and several keylogger families were\namong the most recurring samples we found that used ngrok, with njRAT as the top malware family. The reason these specific malware\n\n\n-----\n\nfamilies have been commonly used is that they are easily downloadable and the instructions on how to configure them are widely available.\n\nFigure 22. A comparison of the numbers of malware files using ngrok from 2016 to 2021\n\n\n-----\n\nFigure 23. The distribution of malware families using ngrok as part of their routines in 2021\n\n\n-----\n\nFigure 24. An njRAT configuration containing ngrok TCP tunnels as C&C host\n\nPenetration testers also take advantage of services like ngrok to prevent being detected on the network, whether through hosting malware\nor using it as a C&C server. It is not just commodity malware families (like the ones mentioned in the previous paragraph) that use such\nservices; penetration-testing tools commonly used by both penetration testers and cybercriminals, such as Cobalt Strike and Meterpreter\nbinaries, do as well.\n\n## Defense Measures\n\nAs with any tool or service that could be exploited for malicious purposes, ngrok and other cloud tunneling services have their own set of\nadvantages and disadvantages. In their case, the advantages stem from the afforded convenience of setting up a private server and hosting\nit on the internet. But this convenience is a double-edged sword since it could also be beneficial to attackers who want to integrate these\nservices into their schemes.\n\nIn this section, we list several defense measures network administrators can implement to prevent the abuse of ngrok and other cloud\ntunneling services on their networks.\n\n### Managing the Access of Certain Users to Cloud Tunneling Services\n\nFor some businesses that have cloud tunneling services as an essential part of their operations, access should be limited only to users who\nneed these services. Doing this can prevent attackers who gain access to the network from using the services for C&C, data exfiltration, or\nother malicious purposes. Employees with access to these tunneling services should be regularly checked and logged for access to these\nservices to ensure that their access is being used for approved purposes as defined by the organization.\n\nWith unlimited access, network administrators could often be blindsided as to what services are exposed since almost anyone from the\ncompany can simply start a tunnel to access systems that are meant to be accessed only from internal networks. For large organizations, it\nmight be better from a security standpoint to prevent employees from using cloud tunneling to expose services to the internet, and to use a\nvirtual private network (VPN) instead to connect to the intranet.\n\n### Creating Application Filters\n\n\n-----\n\nStopping the installation of specific binaries for cloud tunnels and adding alerts when they are present on a machine can help minimize the\nrisk of unintended use of these services on the network.\n\n### Preventing the Creation of Tunnels Using Cloud Tunneling Services’ IP Addresses\n\nNetwork administrators can block SSL handshake to prevent establishing a secured tunnel between a host machine and a cloud tunneling\nservice’s server. In the case of ngrok, this can also be accomplished by blocking all connections going to ngrok’s IP addresses listed in the\nJSON file hosted on Amazon S3. A Bash command can be executed to list all of the IP addresses associated with ngrok that are being\nused to establish a tunnel, and another to create firewall rules for dropping outgoing connections to ngrok tunnels.\n\nFigure 25. The Bash command to list all IP addresses associated with ngrok that are being used to establish a tunnel\n\nFigure 26. The Bash command to create firewall rules for dropping outgoing connections to ngrok tunnels\n\nSince ngrok implements multiple methods of resolving the IP address of a tunnel, blocking the IP addresses can prove more effective at\npreventing the successful creation of a secured tunnel. The list of IP addresses changes over time and thus should be checked regularly to\nbe able to block them while minimizing the interruption of other services that might be hosted on these IP addresses.\n\nFigure 27. IP addresses used by ngrok\n\n### Creating Alerts for or Blocking External Threats Using Cloud Tunneling Services\n\nAs discussed earlier, phishing kits and C&C servers could be tunneled through services like ngrok. The risk of a successful phishing attempt\nor malware communication can be reduced by preventing network traffic (HTTP and TCP connections) coming from cloud tunneling\nservices. In ngrok’s case, this can be achieved by creating alerts for or blocking the following:\n\nDNS requests to *.ngrok.io (see Appendix for snort rules)\nHTTPS TLS connections going to *.ngrok.io\n\n### Regularly Monitoring for Updates to Exposed Services\n\nThe fact that a service is hosted on the internet, regardless of whether it was port-forwarded through the router or via cloud tunnels, could\nincrease the attack footprint of an organization. For example, although ngrok’s ability to generate random subdomains to tunnel web servers\n(HTTP and HTTPS) can help prevent attackers from blindly guessing the information of their victims, this might not be the case if the\nwebpage is permanently hosted and the user decides to reserve a fixed subdomain for use. Developers who are testing web servers that\nare integrated to an application (such as an Android APK file or a Windows application) typically use fixed subdomains to avoid the hassle\nof recompiling just to test the new servers.\n\nThe same goes for TCP tunnels with ngrok. Even though ngrok provides a random tunnel and random port to use for free, the tunnel and\nport number are limited in range. Thus, an attacker could simply scan the tunnels with a specified range of ports to identify the services that\nare running behind ngrok.\n\nKeeping everything updated reduces the attack surface that cybercriminals could exploit. This also applies to home users, including gamers\nwho use cloud tunneling services to expose game servers.\n\n### Best Practices Against ngrok Abuse\n\n\n-----\n\nWe contacted ngrok to let the platform know of our findings from this research. In response, ngrok stated that it applies a multi pronged\nstrategy of real-time monitoring, account monitoring, and third-party reporting to detect, isolate, and remove malicious content from our\nservice as quickly as possible.”\n\n[To prevent malicious activities that abuse its platform, ngrok has implemented certain security enhancements, which have been available on](https://ngrok.com/abuse)\nversions 2 and 3 of ngrok since April 13, 2022, to users with paid accounts. One of these is its disabling of users’ ability to serve HTML\ncontent anonymously, that is, all users must register with a confirmed email on file. As an ongoing practice, ngrok also has all free accounts\nhave the origin IP address embedded both in the HTTP headers in the response and in the tunnel URL itself. And because attackers are\n[continuously innovating, ngrok provides an abuse reporting API to allow trusted third parties to integrate abuse reporting into their own](https://ngrok.com/docs/api#api-abuse-reports)\ndetection processes.\n\n[Within enterprises, ngrok recommends that IT and security personnel block all *.ngrok.io traffic and use custom ingress to create their own](https://ngrok.com/docs/secure-tunnels#agent-ingress)\nnamed ngrok entry points, such as developername.tunnel.company.com. This eliminates personal ngrok accounts from the network while\nallowing centralized policy management across all connections.\n\n[Outside enterprises, ngrok recommends that organizations and their security teams use their own domain, such as tunnel.company.com, to](https://ngrok.com/docs/guides/how-to-set-up-a-custom-domain)\nstandardize URLs across external systems and apply their own TLS certificate to the traffic. This creates consistent, predictable naming and\n[makes end-to-end encryption the default. In addition, they can add OAuth 2.0 or OpenID Connect powered by their identity provider to limit](https://ngrok.com/docs/cloud-edge#oauth)\nngrok access to authenticated and authorized.\n\n[The ngrok management layer also enables security teams to tune their organizations’ security postures. Ngrok supports IP restrictions on](https://ngrok.com/docs/platform#ip-policies-restrictions)\nany portion of its service — the agent, tunnel access, the dashboard, and even the API — to limit access to known good IP ranges. The\n[entire ngrok platform implements observability through event subscriptions to integrate into security information and event management](https://ngrok.com/docs/cloud-edge#observability)\n(SIEM) for near-real-time insight across the entire platform. Finally, security teams can push over-the-wire updates to keep all ngrok agents\nsynchronized.\n\n## Conclusion\n\nCloud tunneling services provide users a very convenient way to expose systems, applications, and services to the internet without going\nthrough the trouble of configuring routers, firewalls, web hosting, and domain registration. It is no surprise that the accessibility they afford\nappeals to development teams and other users, such as technically inclined gamers and home automation enthusiasts.\n\nHowever, new technologies, especially those that involve exposing services and machines to remote access, need to be scrutinized for\npotential security implications. While convenient, tunneling services circumvent traditional network security mechanisms, which might\nenable rogue or disgruntled employees to open a backdoor into the network. Similarly, well-meaning but security-unaware employees might\nalso inadvertently expose critical systems to attackers through unattended tunnel instances.\n\nMalware and phishing attacks using cloud tunneling services, particularly ngrok, have seen a dramatic increase over the past two years. A\ndisadvantage defenders face with regard to cloud tunneling services is that these services make identifying malicious network traffic more\ndifficult for network security teams. Traditional network scanning technologies such as intrusion detection systems (IDSs) and intrusion\nprevention systems (IPSs) would not be able to flag malicious C&C communication if encapsulated through cloud tunnels. Incident\nresponders would have a difficult time validating exploit and phishing pages hosted on cloud tunneling services because of their transient\nnature.\n\nWhile cloud tunneling services have their place, CIOs, CISOs, and cybersecurity personnel should take into consideration the various risks\npresented by these services and formulate usage policies applicable to their organizations. Some organizations can outright ban the use of\nthese services, especially in the case of businesses that do not really need them. But others, especially those in the middle of digitizing or\nintegrating their systems, might not be able to stop the use of cloud tunnels without hindering ongoing system development and integration\nprojects.\n\nFor an organization that needs cloud tunnels, a sit-down meeting between the security team and the development team is a must. The\ndevelopment team must define the exact use case it has for cloud tunnels and lay out the scope and time frame when these services are to\nbe used. This gives the security team proper context to identify whether specific cloud tunneling traffic is valid or not. The security team can\nalso suggest alternatives, such as providing a test network where cloud tunneling traffic can be safely allowed or obtaining paid accounts or\nsubscriptions on cloud tunneling services to enable all available security-oriented features.\n\nSecurity works best when all stakeholders understand what is at stake. By highlighting the risks of cloud tunnels and the actual use and\nabuse of these services by malicious actors, cybersecurity and software development teams can put the use of cloud tunnels in their\nagenda in order to find a suitable arrangement that will minimize risks while allowing the development teams to continue their work.\n\n## Appendix\n\n### Analyzed Malware SHA-256\n\n\n-----\n\n**SHA-256** **Malware**\n**family**\n\n\n**Detection name**\n\n\n04c584f7dc1c1fa978f59cc966a0664589e7709a7f79b888614e14ef48309e7d AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n116a1bf0810fec723298377ec6b57bd5328d74ba5e3397545e86311873f9e677 AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n22ab0a3460b348696d7df493c57c26240b1f72fc5bc06751dce6c300f371698f AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n30b7bf839fabec042c362ae8306b7b699911e8e712494a8d5a5a064db4a3a4ed AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n525c8a4537286abee8f7aa7319d7c65a05452291dee486991f97e06ae3e1332c AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n949ab25990b3bf6677eea51b09839b2fd36ffea939565f449b9c6d4f3d0c138a AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n97416fca437cfbe1d5e0a3cdcb7a47db4cbc05e97cfc861868d066f78a76b07d AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\nb5ae89b1f057505f02b7d12f37524acb1b91d11b598dcbdc956f7167dc745fe9 AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\ne2d1ea986b91e056594a326abc4cf9a76f7094ff8528b66e594c6a6ca57a98c7 AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\nf5db1c44a4eb1b56114323c2645ca3e56614e1bedc0a89e70fc912388b7c485c AsyncRAT Backdoor.MSIL.ASYNCRAT.AZ\n\n\n4ebceaccaf39fffdd849815fcc75cf85d8cd3326c83220323e331582790233c6 Cobalt\nStrike\n\nc24fad806575b49a6f6f885f3e57c711f319174bcdeedbf70f2cc4aa65bbfc65 Cobalt\nStrike\n\nd1963148b49a5e651aca0a78fa848a3a9950f21c0cc586c13eca4eef352bbddb Cobalt\nStrike\n\n\nTrojan.Win32.COBALT.SM\n\nTrojan.Win32.COBALT.SM\n\nTrojan.Win32.COBALT.SM\n\n\n12b8cb4e6421f2031d619717b0c6d2b4aec205a7270cad493297764970eb5fb7 DarkComet BKDR_FYNLOS.SMM\n\n2d1747b4b841eb10e54300f387e1bb1d10911fde626179c5b4a7b61e1c850b3a DarkComet BKDR_FYNLOS.SMM\n\n35de1d0c1b59bb9099796866c86e7722e273f38d6794ad3e577866d5558dfb80 DarkComet BKDR_FYNLOS.SMM\n\na3fe8799e6d0dc83fb57029e322a8f9c04562a18492c20e098d523c584d0a8a8 DarkComet BKDR_FYNLOS.SMM\n\nad2266bae9999b84ea79c159dfe606cb8f1c30fa2989629042b058ae351f8bf5 DarkComet BKDR_FYNLOS.SMMBKDR_FYNLOS.SMM\n\nc82fe31eb056ba43d7c33295035a23952a51ef5c3b002367d7677eccf8b67cae DarkComet BKDR_FYNLOS.SMM\n\nd1f1eddacc07f799773805c971cd49d23c57c4939a09bd7a8d8aa89e580f2178 DarkComet BKDR_FYNLOS.SMM\n\ne1861f88576a3e310e3feaad7d747425b40510068541d2d4b223c483bf71493c DarkComet BKDR_FYNLOS.SMM\n\ned63fc3c0b01416f9a2126a6ebd82e10e7be526b2035890245027e4b70f4e60c DarkComet BKDR_FYNLOS.SMM\n\nf5893afcb7391969fb3d6e16f908fb5b85341d29f92403e85b4515fea2668293 DarkComet BKDR_FYNLOS.SMM\n\n\n27c881e3ede8be9316f4d08cad7470b3d5d7c01b63c47fb099b5b5503b169fb3 Metasploit\nShellcode\n\n\nBackdoor.Win32.SWRORT.SMB\n\n\n-----\n\n8b6dda7b5c7dbcecc2072f67620194d0def87b7bacca66a2b2010b1c78081419 Metasploit\nShellcode\n\n9427d2dbe0ae36456656136df394f56ec08381cd6d68d5f12ba126284129e155 Metasploit\nShellcode\n\nc09f1ae3f86cda5b49da24c3c6942c1edc7577644aa602074ac7a9e236b5e84b Metasploit\nShellcode\n\n\nTrojan.Win32.METERPRETER.GAJC\n\nBackdoor.Win32.SWRORT.SMB\n\nTrojan.Win32.METERPRETER.GAJC\n\n\n460b09da596e354ea9e8207414b9789181a0923ef3c820f6fbf164c2255912db NanoCore BKDR_NOANCOOE.SM\n\n46336387c7356587d94318b1f439ee1c47654bf0ac84c534758996a2f4fbf666 NanoCore BKDR_NOANCOOE.SM\n\n64c79aea781eadec0c3ab32808660ecd9205b910e8c5e8b43f41b19cdef7ad66 NanoCore BKDR_NOANCOOE.SMUPS\n\n8dc26896a28c36ccc7a93b3435a42954a9325802d4e3ee0731067802ab9d6fd2 NanoCore BKDR_NOANCOOE.SM\n\nab1cd62b3fea7cff71d8b2c59515a20f612ad4c82ae470d1995dee55ed3f923e NanoCore BKDR_NOANCOOE.SM\n\nbb39887e5668ce591aba14bca153c225183f5d4b0ef5ea0f85c0855505b418d7 NanoCore BKDR_NOANCOOE.SM\n\nd112e19d34e88c040a70367143569c965cb48dbb1fa36579838c51f8ca9ebe7c NanoCore BKDR_NOANCOOE.SM\n\ndf0dcc7475e1497ac795bc2a11136c54299221e850373726b69aceaeecf4fa3b NanoCore BKDR_NOANCOOE.SM\n\nec2c954ab2acbb52f79b2cf1f24cbf935e28575900dca2e205b22cd0e5781a16 NanoCore BKDR_NOANCOOE.SM\n\nf292c9d84f219dbc6821729b92a37b6771c3ac0f3e69f154f37a636d87b176fe NanoCore BKDR_NOANCOOE.SM\n\n264bbb47e0b55c06aaa9e558902b6389891d8d17d76ad7eec634f2e358289b81 njRAT BKDR_BLADABI.SMC\n\n2951818c48bf700f26bb64ff55a4fd190cc752ce201ed8425c7531a728c2c4dd njRAT BKDR_BLADABI.SMC\n\n2a58840511e2d1293c8ff7eb25461824ac5734f7e930cecf2af3a102ec7a82c3 njRAT BKDR_BLADABI.SMC\n\n4b44701bcc0b7d99f309c7704d4c58f3dbe4ea207d7ff915fe0aa22d9975a2d1 njRAT BKDR_BLADABI.SMC\n\n70db49695386b79dcf21ca2346ee1ebad08b1cc6e49d30839be09aec32e39e7e njRAT BKDR_BLADABI.SMC\n\n73c425fc318a0f89a9ca5794355fbb78bd595174cb3a30f871176a3a4d79601a njRAT BKDR_BLADABI.SMC\n\nc95e3799e0a9981a4a6bb6ab7c71294a2ecf836b3ca6339bbd756a70010b75ea njRAT BKDR_BLADABI.SMC\n\nd4386d967f7e50c8380c9075079590cf7a95d54dc523a50f2bf55d29f799710d njRAT BKDR_BLADABI.SMC\n\neb2966a2181e0df015b7b8e7ae2fe581b6cb505ee3456efa6b5a340edb5e5764 njRAT BKDR_BLADABI.SMC\n\nffaf0ab447bce485f4a7db970f3da1fb854c5e6b6df22327af0e02215e92f20f njRAT BKDR_BLADABI.SMC\n\nShow more\n\n### Ngrok DNS Alerting Snort Rules\n\n\n-----\n\nalert udp $HOME_NET any any 53 (msg: ET POLICY DNS Query to a .ngrok domain (ngrok.com) ; content: |01 00 00 01 00 00\n00 00 00 00|\"; depth:10; offset:2; content:\"|05|ngrok|03|com|00|\"; fast_pattern; distance:0; nocase; classtype:policy-violation;\nsid:2022641; rev:1; metadata:created_at 2016_03_23, updated_at 2016_03_23;)\nalert udp $HOME_NET any -> any 53 (msg:\"ET POLICY DNS Query to a *.ngrok domain (ngrok.io)\"; content:\"|01 00 00 01 00 00 00\n00 00 00|\"; depth:10; offset:2; content:\"|05|ngrok|02|io|00|\"; fast_pattern; distance:0; nocase; classtype:policy-violation; sid:2022642;\nrev:1; metadata:created_at 2016_03_23, updated_at 2016_03_23;)\n\n### Yara Rule\n\nimport \"cuckoo\"\n\nrule ngrok_traffic\n\n{\n\ncondition:\n\ncuckoo.network.http_request(/https:\\/\\/.*\\.ngrok\\.io/) or\n\ncuckoo.network.http_request(/http:\\/\\/.*\\.ngrok\\.io/) or\n\ncuckoo.network.dns_lookup(/\\d\\.tcp\\.ngrok\\.io/)\n\ncuckoo.network.dns_lookup(/.*\\.ngrok\\.io/)\n\n}\n\n### Bash Commands\n\ncurl -s https://s3.amazonaws.com/dns.ngrok.com/tunnel.json | jq -r '.[][]'\nfor ip in `curl -s https://s3.amazonaws.com/dns.ngrok.com/tunnel.json | jq -r '.[][]'`; do echo \"iptables -A OUTPUT -s 0.0.0.0/0 -d $ip -p\nall -j DROP\"; done\n\nX\n\nHIDE\n\n**Like it? Add this infographic to your site:**\n\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste the code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats) [Cloud Computing,](https://www.trendmicro.com/vinfo/us/security/news/cloud-computing) [Cybercrime](https://www.trendmicro.com/vinfo/us/security/news/cybercrime)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-26 - How Cybercriminals Abuse Cloud Tunneling Services.pdf"
    ],
    "report_names": [
        "2022-04-26 - How Cybercriminals Abuse Cloud Tunneling Services.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653698643,
    "ts_modification_date": 1653698643,
    "files": {
        "pdf": "https://archive.orkl.eu/93c5ba676248434f296b153640b9d3db9c4dd8d9.pdf",
        "text": "https://archive.orkl.eu/93c5ba676248434f296b153640b9d3db9c4dd8d9.txt",
        "img": "https://archive.orkl.eu/93c5ba676248434f296b153640b9d3db9c4dd8d9.jpg"
    }
}