{
    "id": "c36d1549-61b8-4b71-89fa-8fa89e90e4e0",
    "created_at": "2023-01-12T15:08:34.091676Z",
    "updated_at": "2025-03-27T02:05:50.160528Z",
    "deleted_at": null,
    "sha1_hash": "225cbb8f7fde484a8465cbe025ddc1ce3e7ac989",
    "title": "2022-03-18 - Double header- IsaacWiper and CaddyWiper",
    "authors": "",
    "file_creation_date": "2022-05-28T23:23:33Z",
    "file_modification_date": "2022-05-28T23:23:33Z",
    "file_size": 6073677,
    "plain_text": "# Double header: IsaacWiper and CaddyWiper\n\n**[blog.malwarebytes.com/threat-intelligence/2022/03/double-header-isaacwiper-and-caddywiper/](https://blog.malwarebytes.com/threat-intelligence/2022/03/double-header-isaacwiper-and-caddywiper/)**\n\nThreat Intelligence Team March 18, 2022\n\nAs war in Ukraine rages, new destructive malware continues to be discovered. In this short\nblog post, we will review IsaacWiper and CaddyWiper, two new wipers that do not have\nmuch in common based on their source code, but with the same intent of destroying targeted\nUkrainian computer systems.\n\n## IsaacWiper\n\nIsaacWiper was one of the artifacts security company ESET reported to be targeting\nUkraine. Other artifacts were named as HermeticWiper (wiper), HermeticWizard (spreader)\nand HermeticRansom (ransomware). IsaacWiper is far less advanced than HermeticWiper,\n[the first wiper that was found which we analyzed here.](https://blog.malwarebytes.com/threat-intelligence/2022/03/hermeticwiper-a-detailed-analysis-of-the-destructive-malware-that-targeted-ukraine/)\n\nIsaacWiper is made of an executable, compiled with Visual Studio. The executable has\nimported functions like DeviceIoControl, WriteFile, MoveFile, GetDiskFreeSpaceEx,\nFindNextFileW. Although these functions are legitimate, the combination of all these imports\ncould be suspicious. Sections analysis, on other hand, is perfectly normal. No strange\nsegments are found and entropy has the expected values:\n\n\n-----\n\nThe sample is presented in DLL form with just one export, named _Start@4 that contains the\nmain functionality of the malware:\n\nThe malware will iterate through all system disks, overwriting the first bytes of these disks:\n\nThe following chunk shows an extract of the code responsible for that behavior. Also, it can\nbe seen how the volume is unlocked after write operations:\n\n\n-----\n\nWe have found that not only the physicalDrive but also partitions are wiped in the process.\nThe wiper will iterate through the filesystem, enumerating files and overwriting them. This\nbehavior is similar to ransomware activity, but in this case there is no decryption key. Once\nthe data has been overwritten, it is lost:\n\nThe attackers left in the code various log strings. An example of one of these debug strings,\nbeing referenced inline is presented below:\n\nIn fact, these debug strings describe pretty well the malware functionality. All debug strings\nare presented below:\n\n\n-----\n\nAs it can be seen, the attackers’ goal is destroying data on victims systems. Affected users\nwill lose their files, and their computers will be unbootable, forcing them to reinstall the OS.\n\n## CaddyWiper\n\nCaddyWiper is a 3rd Wipper (after HermeticWiper and IzaakWiper) that was observed in this\nyear’s attack on Ukraine. In contrast to HermeticWiper, this one is very small, and has less\ncomplex capabilities.\n\nThe sample is not signed and its compilation date is: 14 March 2022 07:19:36 UTC. The\nexecutable is dedicated to destroying files and partition information for each available disk.\n\nThe main function of the wiper can be seen below:\n\n\n-----\n\nFirst, the wiper checks if it is running on the Primary Domain Controller. The malware will\navoid trashing Domain Controllers, probably because it wants to keep them alive for the\npurpose of propagation.\n\nIf the current machine is not a Domain Controller, the wiping starts. It recursively wipes files\nin the `C:\\Users directory. Then, it iterates over available hard disks, starting from “ D: ”`\nand wipes recursively all the files it can access.\n\nThe wiping is done in the following way:\n\n\n-----\n\nIt tries to grant access to the files before writing:\n\n\n-----\n\nAll the files/directories are enumerated by well-known APIs:\n```\nFindFirstFileA / FindNextFileA . If the found element is a directory, the function is\n\n```\ncalled recursively. And if it is a file, a new buffer filled with 0s is allocated, and the file content\nis overwritten with it. The buffer is limited to 10 Mb max, so if the file is bigger than this, only\nthe beginning of it will be wiped.\n\nInterestingly, this enumeration starts from the drive letter `D (treating` `C as a separate`\ncase), so if there are any disks mounted as `A or` `B, they are skipped. Finally the malware`\nwipes layout information of the available disks/partitions:\n\n\n-----\n\nIt starts from the `\\\\.\\PHYSICALDRIVE9, and at each iteration decrements the partition`\nnumber by one.\n\nThe wiping of the partition layout is implemented via IOCTL sent to the drive device:\n```\nIOCTL_DISK_SET_DRIVE_LAYOUT_EX . The malware sets an empty buffer as the new layout.\n\n```\nThe sample is very mildly obfuscated and most of the used strings are stack-based. Also the\nImport Table is very small, containing only one function. All the needed functions are\ndynamically retrieved, with the help of a custom lookup routine:\n\n\n-----\n\nCaddyWiper is extremely light in comparison to HermeticWiper, which was the most complex\nfrom all the wipers that have been associated with those attacks. There is no code overlap\nbetween each of them, and most likely they have been written by different authors.\n\n## Protection\n\nMalwarebytes clients are protected against both of these wipers:\n\n\n-----\n\n## References\n\n1. https://www.welivesecurity.com/2022/03/01/isaacwiper-hermeticwizard-wiper-worm\ntargeting-ukraine/\n2. https://www.eset.com/int/about/newsroom/press-releases/research/eset-research\nukraine-hit-by-destructive-attacks-before-and-during-the-russian-invasion-with-hermet/\n\n## Indicators of Compromise\n\n**IsaacWiper**\n\n13037b749aa4b1eda538fda26d6ac41c8f7b1d02d83f47b0d187dd645154e033\n\n**CaddyWiper**\n\n\n-----\n\na294620543334a721a2ae8eaaf9680a0786f4b9a216d75b55cfd28f39e9430ea\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-18 - Double header- IsaacWiper and CaddyWiper.pdf"
    ],
    "report_names": [
        "2022-03-18 - Double header- IsaacWiper and CaddyWiper.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536114,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653780213,
    "ts_modification_date": 1653780213,
    "files": {
        "pdf": "https://archive.orkl.eu/225cbb8f7fde484a8465cbe025ddc1ce3e7ac989.pdf",
        "text": "https://archive.orkl.eu/225cbb8f7fde484a8465cbe025ddc1ce3e7ac989.txt",
        "img": "https://archive.orkl.eu/225cbb8f7fde484a8465cbe025ddc1ce3e7ac989.jpg"
    }
}