{
    "id": "c397fa91-1c74-4b6b-adf0-feaa307f25f8",
    "created_at": "2023-01-12T15:04:19.408804Z",
    "updated_at": "2025-03-27T02:05:33.220324Z",
    "deleted_at": null,
    "sha1_hash": "1f99378b8fbd6b3e583508b1e8fc758cf23bf5b1",
    "title": "2020-05-11 - The Anatomy of an APT Attack and CobaltStrike Beacon’s Encoded Configuration",
    "authors": "",
    "file_creation_date": "2022-05-28T04:46:51Z",
    "file_modification_date": "2022-05-28T04:46:51Z",
    "file_size": 1876074,
    "plain_text": "# The Anatomy of an APT Attack and CobaltStrike Beacon’s Encoded Configuration\n\n**[labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/](https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/)**\n\nGal Kristal\n\nEven in these uncertain times, state-sponsored groups continue their hacking attempts and\nwe must stay vigilant at all times. We recently investigated such a state-sponsored attack on\na SentinelOne customer, one of the leaders in their field of business.\n\nIn light of the Coronavirus lockdowns and subsequent understaffing at many businesses, we\nwere contacted by the customer to help investigate an intrusion that was discovered in their\nnetwork by threat alerts in their SentinelOne Console.\n\nWe were contacted shortly after the malicious activity was discovered and asked to find the\nattackers’ persistence methods as well as to ensure full remediation.\n\n[In this post, we’ll describe the procedure of how we did that by using SentinelOne features](https://www.sentinelone.com/platform/)\nas well as other tools and methods we developed along the way.\n\n## Key Points\n\n**1. Progression: The attack propogated initially through the company’s VPN to an inner**\nWindows server, and then on to the Domain Controller and afterward to servers containing\nthe sought-after data.\n\n\n-----\n\n**2. Toolkit: The attackers used a** [CobaltStrike beacon with a then-unknown persistence](https://www.cobaltstrike.com/)\nmethod using DLL hijacking (detailed below). Other than that, the group relied solely on\nLOLBins and mostly fileless methods for local execution and lateral movement.\n\n**3. Hunting: Beacon configuration parsing tool and related SentinelOneQL hunting queries.**\n\n## Entry Point\n\nWe learned from the customer that the same actor had accessed the company in August\n2019 via their Citrix server. Even though the customer has had multiple credential rotations\n[since, implemented haveibeenpwned password lookups and aligned with NIST 800-63B, our](https://haveibeenpwned.com/)\nassessment was that the actor had used intelligence gained from stolen credentials in their\nprevious access to connect to the company’s VPN service.\n\nThe attackers connected to the company’s VPN through a public PureVPN node. This hides\ntheir real IP address in the VPN’s logs and makes attribution more difficult.\n\n## Lateral Movement\n\nAt the beginning of our investigation, we reviewed the threats marked by the SentinelOne\nAgent in the Console. One of the Attack Storylines looked like this:\n\n\n-----\n\nFrom this, we could see how the attackers achieved lateral movement and what code they\nran: a one-line PowerShell payload that we identified as a CobaltStrike Beacon stager:\n\nIt’s easy to see from the Attack Storyline that after the beacon was up and running, they first\nran `quser to verify they’re running as SYSTEM and then migrated themselves into`\n```\nexplorer.exe for masquerading as a benign process.\n\n```\nFrom `explorer.exe, they ran multiple recon commands (the IPs in this post were changed`\nfor privacy):\n\nWe can tell that at least some of the commands aren’t as part of an automated recon script\nby their occasional typo; for example, these commands were ran one after the other:\n\nBy looking at that explorer’s DNS requests and PowerShell HTTP requests we were able to\n[obtain their C2 domains. To verify these domains we base64-decoded the Beacon’s](https://www.sentinelone.com/blog/guide-encode-decoded-base64/)\n[PowerShell stager and analyzed that shellcode using the great scdbg tool:](http://sandsprite.com/blogs/index.php?uid=7&pid=152)\n\n\n-----\n\nOne of their first actions in the network was to dump credentials via copying the NTDS. To do\nso, using the Beacon they connected to the Domain Controller’s C$ share and uploaded\n```\nupdate.bat, and to run it they created a remote scheduled task. But instead of running the\n\n```\ntask on demand, it was timed so it would run shortly after:\n\nThe batch file contained the commands to dump the NTDS (and other registry files needed\nto parse it) and delete the scheduled task:\n\nTo exfiltrate the NTDS the attackers used rar.exe that was already present on the system\n(validating the target has WinRAR installed first):\n\nIn our searches, the usage of WinRAR’s CLI tool with password encryption was found to be\npretty indicative of malicious actions.\n\n\n-----\n\nBy taking the NTDS from the network the attackers can freely move laterally as any user\nusing pass-the-hash or golden/silver tickets.\n\nRemedial actions taken at this point:\n\n1. Changing credentials across the domain\n2. Replacing the VPN product with one supporting MFA\n3. Initiating a full rollback to all reported threats in the SentinelOne console\n4. Restarting infected systems\n\n## Persistence\n\nSoon after these actions, we saw in the SentinelOne Console that after a user logs in to the\ninfected systems the beacon starts signalling again. Not surprisingly, the adversary had used\nsome kind of persistence here.\n\nWe found an interesting file drop they had made very early in this operation – a DLL file to\n```\nC:Windowswlanapi.dll that was uploaded remotely to several systems.\n\n```\nThe dropped DLL contains an encoded Beacon payload and a custom-made unpacker. It\nmasquerades by name to a legitimate `wlanapi.dll, which is part of the Wireless LAN`\nservice ( wlansvc ) responsible for exporting functions for tasks such as listing nearby\nwireless networks and connecting to them. In our research, we found that this file does not\nalways exist by default and is probably downloaded automatically by the OS when there is a\nwireless adapter.\n\nThis DLL is loaded by `explorer.exe when a user logs in, as explained in in this detailed`\npost, which was released just as we finished our research.\n\nThis is how the exports of the normal `wlanapi.dll look:`\n\n\n-----\n\nBut the dropped DLL has no exports, and the `DllMain looks like this:`\n\nThe `beacon_init is a simple function that decodes the Beacon payload and runs it in a`\nnew thread.\n\nIt starts with a check of whether it’s running in `svchost.exe, but then totally ignores that`\ncheck.\n\nAs pseudocode:\n\nIt then creates a mutex named `GlobalexampleMutex . It builds the mutex name using a`\n**float for the first 16 chars and an int for the remaining three characters:**\n\n\n-----\n\nThis means the string `\"GlobalexampleMutex\" won’t be found in a string search on this`\nbinary, only `\"GlobalexampleMu\" .`\n\nThen it copies the encoded Beacon buffer to a newly allocated memory, from where it `XORs`\nit using a hardcoded 10-byte key:\n\nWe dumped to file the decoded Beacon from memory and parsed it using a script we wrote\nto extract the Beacon’s configuration.\n\n## Beacon Configuration Parsing\n\nDuring our investigation, we wanted to make sure we had extracted every bit of information\nfrom the memory dumps we had and the persistence we that we had found so we can use\nthat data to search for the same actor across all our customers and in VirusTotal.\n\nTo this end, we wrote a Python script that parses CobaltStrike Beacon configuration from a\nPE file or a memory dump. The Beacon’s configuration is usually XOR-encoded using a\nsingle hardcoded byte, which is 0x69 in Beacon version 3 and 0x2e in Beacon version 4,\nand is in a TLV (Type-length-value) format.\n\n[In our searches we found good scripts (thanks JPCERT and](https://github.com/JPCERTCC/aa-tools/blob/master/cobaltstrikescan.py) [CAPE!), but they lacked support](https://github.com/kevoreilly/CAPEv2/blob/master/modules/processing/parsers/CAPE/CobaltStrike.py)\nfor Beacon version 4 and didn’t parse every field there is in the configuration, so we chose to\nrewrite and improve them.\n\n[The script is available here and its usage is simple:](https://github.com/Sentinel-One/CobaltStrikeParser)\n\n\n-----\n\nParsing the Beacon encoded inside the `wlanapi.dll gives this (cleaned a bit for brevity):`\n\n\n-----\n\nUsing this information it’s possible to create Yara rules that match the exact configuration of\nthe Beacon you want. Let’s say you want to find Beacons version 3 with `Host:`\n```\nofficeasiaupdate.appspot.com as header parameter and a combination of parameters\nDNS_Idle=0.0.0.0 and SleepTime=3000 :\n\n```\nThen in a Yara rule:\n\n\n-----\n\nAny feedback and pull requests are welcomed.\n\n## IOCs\n\n**MD5: 87E00060C8AB33E876BC553C320B37D4**\n\n**SHA1: BDF9679524C78E49DD3FFDF9C5D2DC8980A58090**\n\n**Description: wlanapi.dll (Persistence)**\n\n## MC2 Domains and DNS queries\n```\neustylejssync.appspot[.]com\n*.asiasyncdb[.]com\nofficeasiaupdate.appspot[.]com (as HOST header)\n\n Yara Rules\nrule custom_packer\n{  \n     meta:    \n     description = \"Detects the beginning of the actors packer\"\n     strings:    \n          $b1 = {C7 44 24 38 53 56 43 48}\n    $b2 = {C7 44 24 3C 4F 53 54 2E}\n    $b3 = \"exampleMu\"\n     condition:\n      (uint16(0) == 0x5a4d) and all of ($b*)\n}\n\n Related Queries for Hunting with SentinelOneQL\n\n```\n\n-----\n\nHere are some queries that can be used in the Visibility page in the SentinelOne Console.\nThese queries can help find some of the actions that were described above but as for any\nhunting query – they might need fine-tuning for some environments.\n\n**Suspicious Folders in Use**\n\nUnsigned DLL being dropped straight into windows, system32 or syswow64 folders:\n```\nEventType in ( \"File Modification\", \"File Creation\", \"File Deletion\", \"File\nRename\" ) AND FileType ContainsCIS \"dll\" AND FileFullName ContainsCIS \"windows\" AND (\n( SignedStatus = \"signed\" AND VerifiedStatus != \"verified\" ) OR SignedStatus !=\n\"signed\" ) AND (FileFullName RegExp \"windows[^]+$\" OR FileFullName RegExp\n\"windowssys(tem32|wow64)[^]+$\")\n\n```\nDLL being moved into windows, system32 or syswow64 folders:\n```\nEventType = \"File Rename\" AND FileType ContainsCIS \"dll\" AND FileFullName ContainsCIS\n\"windows\" AND (FileFullName RegExp \"windows[^]+$\" OR FileFullName RegExp\n\"windowssys(tem32|wow64)[^]+$\")\n\n```\nSuspicious BAT / CMD files being dropped into temp folder:\n```\nEventType IN ( \"File Modification\", \"File Creation\", \"File Deletion\", \"File\nRename\" ) AND FileFullName ContainsCIS \"windowstemp\" AND (FileFullName\n[email protected] \".bat\" OR FileFullName EndsWithCIS \".cmd\" ) AND FileFullName RegExp\n\"windowstemp[^{}]+$\"\n\n```\n**Suspicious Processes / Command Lines in Use**\n\nUsing too many cmd /c with RCE Living off the land binaries\n```\nProcessCmd ContainsCIS \"cmd\" AND ProcessCmd ContainsCIS \"/c\" AND ProcessCmd RegExp\n\"cmd.*s/cs.*cmd.*s/cs\" AND ProcessCmd RegExp \"s(at|sc|schtasks|wmic)\"\n\n```\nor\n```\nProcessCmd ContainsCIS \"cmd\" AND ProcessCmd ContainsCIS \"/c\" AND ProcessCmd RegExp \"\n(at|sc|schtasks|wmic)(s|\"|.exe).*cmd.*s/cs\"\n\n```\nRar with password or with a specific compression level (our research suggests it’s rare to\nsee it used legitimately with the RAR CLI tool).\n```\n(ProcessCmd ContainsCIS \"-hp\" AND ProcessCmd RegExp \"sas.*s-hp[^s]+s\") OR (ProcessCmd\nContainsCIS \"-m\" AND ProcessCmd RegExp \"sas.*s-m[0-5]s\")\n\n```\nExecuting scheduled task once on a specific time\n```\nProcessCmd ContainsCIS \"/sc\" AND ProcessCmd RegExp \"(-|/)sc\" AND ProcessCmd RegExp \"\n(-|/)st\" AND ProcessCmd ContainsCIS \"once\" AND ProcessCmd RegExp \"(-|/)tn\" AND\nProcessCmd RegExp \"(-|/)tr\"\n\n```\n**Suspicious Behavioral Indicators**\n\n\n-----\n\nLoading a wlanapi.dll or wlanhlp.dll that was dropped from a different process.\n```\nIndicatorName = \"LoadUnreleatedLibrary\" AND IndicatorMetadata ContainsCIS\n\"wlanapi.dll\" OR IndicatorMetadata ContainsCIS \"wlanhlp.dll\"\n\n```\nIn this case, the Unknown file is referenced to lateral movements groups.\n```\nIndicatorName = \"LoadUnreleatedLibrary\" AND ProcessName = \"Unknown file\"\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-11 - The Anatomy of an APT Attack and CobaltStrike Beacon’s Encoded Configuration.pdf"
    ],
    "report_names": [
        "2020-05-11 - The Anatomy of an APT Attack and CobaltStrike Beacon’s Encoded Configuration.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535859,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653713211,
    "ts_modification_date": 1653713211,
    "files": {
        "pdf": "https://archive.orkl.eu/1f99378b8fbd6b3e583508b1e8fc758cf23bf5b1.pdf",
        "text": "https://archive.orkl.eu/1f99378b8fbd6b3e583508b1e8fc758cf23bf5b1.txt",
        "img": "https://archive.orkl.eu/1f99378b8fbd6b3e583508b1e8fc758cf23bf5b1.jpg"
    }
}