{
    "id": "c45eb386-bc5e-4372-9c33-5ab618cc21ea",
    "created_at": "2022-10-25T16:48:20.677131Z",
    "updated_at": "2025-03-27T02:16:26.064201Z",
    "deleted_at": null,
    "sha1_hash": "d2e73b16a7d9c49d90b2474ca235956cbf0ec7e0",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-08-04T15:57:47Z",
    "file_modification_date": "2022-08-04T09:05:27Z",
    "file_size": 970329,
    "plain_text": "AUGUST 2022\n\n###### DETAILED REPORT\n\n## Quarterly Adversarial Threat Report\n\n###### Ben Nimmo, Global Threat Intelligence Lead\n\n David Agranovich, Director, Threat Disruption\n\n Margarita Franklin, Director of Public Affairs, Security\n\n Mike Dvilyanski, Head of Cyber Espionage Investigations\n\n Nathaniel Gleicher, Head of Security Policy\n\n\n-----\n\n##### TABLE OF CONTENTS\n\nPurpose of this report 3\n\nSummary of our findings 3\n\n**Removing cyber espionage networks** **5**\n\n**Removing emerging harms networks** **9**\n\nMass reporting networks 11\n\nBrigading networks 12\n\nCoordinated violating networks 13\n\n**Removing inauthentic behavior networks** **16**\n\n**Removing coordinated inauthentic behavior networks** **18**\n\nIn-depth Research & Analysis 21\n\nAppendix: Threat indicators 31\n\n\n-----\n\n##### PURPOSE OF THIS REPORT\n\nOur public threat reporting began about five years ago when we first shared our findings about\n\n[coordinated inauthentic behavior (CIB) by a Russian influence operation. Since then, we have](https://about.fb.com/news/tag/coordinated-inauthentic-behavior/)\n\nexpanded our ability to respond to a wider range of adversarial behaviors as global threats have\n\ncontinued to evolve. To provide a more comprehensive view into the risks we tackle, we’ve also\n\nexpanded our regular threat reports to include cyber espionage, inauthentic behavior, and other\n\nemerging harms — all in one place, as part of the quarterly reporting series we’re testing. In\n\naddition to sharing our analysis and threat research, we’re also publishing threat indicators to\n\ncontribute to the efforts by the security community to detect and counter malicious activity\n\nelsewhere on the internet (See Appendix ).\n\nWe expect the make-up of this report to continue to evolve in response to the changes we see in\n\nthe threat environment and as we expand to cover new areas of our Trust & Safety work. This\n\nreport is not meant to reflect the entirety of our security enforcements, but to share notable trends\n\nand investigations to help inform our community’s understanding of the evolving security threats\n\nwe see. During some quarters, our reporting may focus more on a particular adversarial trend or\n\ntactics we see emerge across different threat actors. During other quarters, we may dive into an\n\nespecially complex investigation or walk through a novel policy application and related threat\n\ndisruptions. We welcome ideas from our peers across the defender community to help make these\n\nreports more informative, and we’ll adjust as we learn from feedback.\n\nFor a quantitative view into our Community Standards’ enforcement, including content-based\n\nactions we’ve taken at scale and our broader integrity work, please visit Meta’s Transparency\n\n[Center here: https://transparency.fb.com/data/ .](https://transparency.fb.com/data/)\n\n\n-----\n\n##### KEY FINDINGS\n\n   - Our quarterly threat report provides a comprehensive view into the risks we see across\n\nmultiple policy violations including Coordinated Inauthentic Behavior (CIB), cyber\n\nespionage, inauthentic behavior and other emerging harms, like mass reporting.\n\n   - We took action against two cyber espionage operations in South Asia. One was linked to a\n\ngroup of hackers known in the security industry as Bitter APT, and the other, APT36, to the\n\nstate-linked actors in Pakistan. More here .\n\n   - As part of disrupting new and emerging threats, we removed a brigading network in India,\n\na mass reporting network in Indonesia and coordinated violating networks in Greece, India\n\nand South Africa. More here .\n\n   - Under our Inauthentic Behavior policy against artificially inflating distribution, we took down\n\ntens of thousands of accounts, Pages and Groups around the world. Our manual\n\ninvestigations around the Philippines election allowed us to build automated enforcement\n\nsystems to defend against this sort of activity globally and at scale. More here .\n\n   - We also removed three networks engaged in CIB operations, including one network linked to\n\na PR firm in Israel and two separate troll farms – one in Malaysia targeting domestic\n\naudiences and one in Russia targeting global discourse about the war in Ukraine. We\n\nincluded an in-depth threat research and analysis into the Russian network linked to the\n\nself-proclaimed entity CyberFront Z and individuals associated with past activity by the\n\nInternet Research Agency (IRA). More here .\n\n\n-----\n\n# 01\n\n### Removing two cyber espionage networks\n\n from South Asia\n\n**Cyber espionage actors typically target people across the internet to collect intelligence,**\n\nmanipulate them into revealing information and compromise their devices and accounts.\n\nAs part of these latest disruptions against both networks, we took down accounts, blocked their\n\ndomain infrastructure from being shared on our services, and notified people who we believe were\n\ntargeted by these malicious groups. We also shared information with security researchers and our\n\nindustry peers so they too can take action to stop this activity. We have included threat indicators,\n\nincluding malware hashes and command and control infrastructure, in the Appendix to this report,\n\nto enable further research and detection by the security community.\n\n##### Bitter APT\n\n**We took action against a group of hackers — known in the security industry as** **[Bitter](https://blog.cyble.com/2021/02/24/bitter-apt-enhances-its-capability-with-windows-kernel-zero-day-exploit/)**\n\n**APT — that operated out of South Asia, and targeted people in New Zealand, India, Pakistan**\n\n**and the United Kingdom.**\n\nWhile this group’s activity was relatively low in sophistication and operational security, it was\n\npersistent and well-resourced. Bitter used various malicious tactics to target people online with\n\nsocial engineering and infect their devices with malware. They used a mix of link-shortening\n\nservices, malicious domains, compromised websites and third-party hosting providers to distribute\n\ntheir malware. Our platform was one of the elements of the broader cross-platform cyber\n\nespionage operation.\n\nWe identified the following new and noteworthy tactics, techniques, and procedures (TTPs) used\n\nby this threat actor across the internet:\n\n\n-----\n\n- **Social engineering: Bitter relied on fictitious personas, posing as attractive young women,**\n\njournalists or activists, across the internet to build trust with the people it targeted to trick\n\nthem into clicking on malicious links or downloading malware. Rather than indiscriminately\n\ntargeting people with phishing, this group typically invested time and effort in establishing\n\nconnections with its targets through various channels, including email.\n\n- **iOS application: Our most recent investigation found Bitter deploying a chat application for**\n\niOS that users could download via Apple’s Testflight service for developers to help them\n\nbeta-test their new applications. This meant that hackers didn't need to rely on exploits to\n\ndeliver custom malware to targets and could utilize official Apple services to distribute the\n\napp in an effort to make it appear more legitimate, as long as they convinced people to\n\ndownload Apple Testflight and tricked them into installing their chat application. We don’t\n\nhave any visibility into whether this app contained malicious code and assess that it may\n\nhave been used for further social engineering on an attacker-controlled chat medium. We\n\nreported our findings to Apple.\n\n- **Android malware: We found Bitter using a new custom Android malware family we named**\n\nDracarys. Notably, it used accessibility services, a feature in the Android operating system\n\nto assist users with disabilities, to automatically click through and grant the app certain\n\npermissions without the user having to do it. Bitter injected Dracarys into trojanized\n\n(non-official) versions of YouTube, Signal, Telegram, WhatsApp, and custom chat\n\napplications capable of accessing call logs, contacts, files, text messages, geolocation,\n\ndevice information, taking photos, enabling microphone, and installing apps. While the\n\nmalware functionality is fairly standard, as of this writing, malware and its supporting\n\ninfrastructure has not been detected by existing public anti-virus systems. It shows that\n\nBitter has managed to reimplement common malicious functionality in a way that went\n\nundetected by the security community for some time.\n\n- **Adversarial adaptation: This group has aggressively responded to our detection and**\n\nblocking of its activity and domain infrastructure. For example, Bitter would attempt to post\n\nbroken links or images of malicious links so that people would have to type them into their\n\nbrowser rather than click on them — all in an attempt to unsuccessfully evade enforcement.\n\n\n-----\n\n##### APT36\n\n**We took action against a group of hackers in Pakistan — known in the security industry as APT36**\n\n**— that targeted people in Afghanistan, India, Pakistan, UAE, and Saudi Arabia, including military**\n\n**personnel, government officials, employees of human rights and other non-profit organizations**\n\n**and students. Our investigation connected this activity to state-linked actors in Pakistan.**\n\nWhile this group’s activity was relatively low in sophistication, it was persistent and targeted many\n\nservices across the internet – from email providers to file-hosting services to social media. APT36\n\nused various malicious tactics to target people online with social engineering to infect their devices\n\nwith malware. They used a mix of malicious and camouflaged links, and fake apps to distribute their\n\nmalware targeting Android and Windows-run devices.\n\nWe identified the following new and noteworthy tactics, techniques, and procedures (TTPs) used\n\nby this threat actor across the internet:\n\n   - **Social engineering: APT36 used fictitious personas — posing as recruiters for both**\n\nlegitimate and fake companies, military personnel or attractive young women looking to\n\nmake a romantic connection — in an attempt to build trust with the people they targeted.\n\n   - **Fake, spoofed and real websites: APT36 deployed a wide range of tactics, including the use**\n\nof custom infrastructure to deliver their malware. Some of these domains masqueraded as\n\nphoto-sharing websites or generic app stores, while others spoofed the domains of real\n\ncompanies like the Google Play Store, Microsoft’s OneDrive and Google Drive. Additionally,\n\nthis group used common file-sharing services like WeTransfer to host malware for short\n\nperiods of time.\n\n   - **Camouflaged links: This group used link-shortening services to disguise malicious URLs.**\n\nThey also used social cards and preview sites — the online tools used in marketing to\n\ncustomize what image is displayed when a particular URL is shared on social media — to\n\nmask redirection and ownership of domains APT36 controlled.\n\n   - **Android malware: APT36 didn’t directly share malware on our platforms, but rather used the**\n\nabove tactics to share malicious links to sites they controlled and where they hosted\n\nmalware. In several cases, this group used a modified version of commodity Android\n\nmalware known as XploitSPY available on Github. While XploitSPY appears to have been\n\noriginally developed by a group of self-reported ethical hackers in India, APT36 made\n\nmodifications to it to produce a new malware variant we call LazaSpy. These changes\n\nincluded adding technical checks to only run malicious functionality if the target’s device\n\n\n-----\n\nwas located in either Pakistan or India and wasn’t an emulator — likely in an attempt to\n\navoid scrutiny by security researchers. Our malware analysis of several samples, however,\n\nfound that APT36 failed to properly implement this functionality. This threat actor is a good\n\nexample of a global trend we’ve seen where low-sophistication groups choose to rely on\n\nopenly available malicious tools, rather than invest in developing or buying sophisticated\n\noffensive capabilities. As such, APT36 is known for using a range of different malware\n\nfamilies, and we found that in this recent operation it had also trojanized (non-official)\n\nversions of WhatsApp, WeChat and YouTube with another commodity malware family\n\nknown as Mobzsar or CapraSpy. Both malware families are capable of accessing call\n\nlogs, contacts, files, text messages, geolocation, device information, photos and\n\nenabling microphone.\n\n\n-----\n\n# 02\n\n### Removing “emerging harms” networks [ 1 ]\n\nWhile our threat disruption work [began with tackling inauthentic operations where people hide](https://about.fb.com/news/tag/coordinated-inauthentic-behavior/)\n\nwho’s behind them, we have also seen authentic actors engage in adversarial and harmful\n\nbehaviors on our platform and across the internet. This section of the report details how our\n\nthinking about this adversarial space has evolved and what steps we’re taking to stay ahead.\n\nThis work began following the US 2020 elections. Since then, we have been working with teams\n\nacross Meta to expand our network disruption efforts to new areas so we can address threats\n\nthat come from groups of authentic accounts coordinating on our platform to violate our\n\n[Community Standards](https://transparency.fb.com/en-gb/policies/community-standards/) and cause harm.\n\n**Here is how our efforts against emerging harms work in a nutshell: Our cross-functional security**\n\nteams who work on these adversarial behaviors act as a “threat intelligence incubator”: they\n\nidentify and study specific adversarial behaviors and then develop tailored policies and\n\nenforcement protocols to take action against those behaviors. Next, they investigate and disrupt\n\nnetworks, carefully scoping the enforcements to ensure we avoid over-enforcing and silencing\n\ninnocent users. Over time, as we learn more and understand the nature of the threats more clearly,\n\nour goal is to transition each of these individual targeted efforts from the disruption-only phase to\n\nalso include scaled automated detection. We do this by feeding the common tactics and\n\ntechniques we see these networks rely on into our scaled detection and enforcement systems. To\n\ninform the community about our ongoing efforts, we’ve [begun](https://about.fb.com/news/2021/09/removing-new-types-of-harmful-networks/) publicly [reporting and sharing our](https://about.fb.com/wp-content/uploads/2021/12/Metas-Adversarial-Threat-Report.pdf)\n\nfindings with security researchers and our industry peers.\n\nHere are the new problem areas we’ve been working to tackle:\n\n   - **Mass reporting, in which groups of people coordinate to abuse our reporting tools by falsely**\n\nreporting people in an attempt to silence them;\n\n1 The threat disruption program focused on emerging harms outlined in this section was developed and\nlaunched by a multidisciplinary team working across Meta, including Artemis Seaford and Alberto Fittarelli\nwho led this effort.\n\n\n-----\n\n   - **Brigading, in which groups of people coordinate to harass people on our platforms in**\n\nattempt to intimidate and silence them;\n\n   - **Coordinated Violating Networks, in which groups of people work together to break the**\n\nrules outlined in our Community Standards.\n\nThese individual efforts are currently in various stages of maturity and will continue to move from\n\ndisruption-only enforcements to adding automated detection as part of our disruption toolbox for\n\neach of the new problem areas we tackle. We share more details on our progress and specific\n\nenforcement examples in the following subsections.\n\n\n-----\n\n##### Mass reporting\n\n**[What is it? Under our Inauthentic Behavior policies, we remove activity when we find adversarial](https://transparency.fb.com/en-gb/policies/community-standards/inauthentic-behavior/)**\n\nnetworks that coordinate to abuse our reporting systems to get accounts or content incorrectly\n\ntaken down from our platform, typically with the intention of silencing others. We began\n\ndeveloping and implementing this policy in early 2021.\n\n**As an example, in Q2 of 2022, we removed a network of about 2,800 accounts, Groups and Pages**\n\nin Indonesia that worked together to falsely report people for various violations, including hate\n\nspeech, impersonation, terrorism and bullying, in an attempt to have them and their posts\n\nwrongfully removed from Facebook. Most of these reports focused on people in Indonesia,\n\nprimarily within the Wahhabi Muslim community. To conceal their activity and avoid detection, the\n\nindividuals in this network would replace letters with numbers when posting about their targets.\n\nThey, at times, created fake accounts that impersonated real people and then used them to report\n\nauthentic users for impersonation.\n\n\n-----\n\n##### Brigading\n\n**[What is it? Under our Bullying and Harassment policies, we remove activity when we find](https://transparency.fb.com/en-gb/policies/community-standards/bullying-harassment/)**\n\nadversarial networks that work together to engage in repetitive behavior, often in the form of\n\nsending direct messages to their targets, or mass-commenting on their posts. The behavior is\n\n[usually intended to overwhelm, harass or silence the target. We began developing and enforcing](https://about.fb.com/news/2021/12/metas-adversarial-threat-report/)\n\nthis policy in 2021.\n\n**For example, in Q2 of 2022, we took down a brigading network of about 300 accounts on**\n\nFacebook and Instagram in India that worked together to mass-harass people, including activists,\n\ncomedians, actors and other influencers. This network was active across the internet, including\n\nFacebook, Instagram, YouTube, Twitter and Telegram. On our apps, the individuals behind this\n\nactivity relied on a combination of authentic and duplicate accounts — many of which were\n\ndisabled for violating our rules against hate speech and harassment by our scaled, automated\n\nsystems. These accounts would call on others to harass people who posted content that this group\n\ndeemed offensive to Hindus. The members of this network would then post high volumes of\n\nnegative comments under the targets’ posts. In response, some people would hide or delete their\n\nposts leading to celebratory comments claiming a “successful raid.”\n\n\n-----\n\n##### Coordinated Violating Networks\n\n**[What is it? Under our Account Integrity policies, we remove coordinated violating networks when](https://transparency.fb.com/en-gb/policies/community-standards/account-integrity-and-authentic-identity/)**\n\nwe find people — whether they use authentic or fake accounts — working together to violate or\n\n[evade our Community Standards . We began developing and enforcing this latest policy in 2021.](https://transparency.fb.com/policies/community-standards/account-integrity-and-authentic-identity/)\n\nOur Community Standards govern what is and isn’t allowed on our services. We have automated\n\ndetection and manual review systems to address content violations, and we publicly [report](https://about.fb.com/news/2022/05/community-standards-enforcement-report-q1-2022/) the\n\nquantitative results of this work at global scale on a quarterly basis.\n\nHowever, in some cases, we’ve observed tightly organized groups working together to violate our\n\nrules while taking steps to evade enforcement — hence combining adversarial behavior with\n\ncontent-level violations of our Community Standards, like incitement to violence, hate speech,\n\nbullying and harassment, or misinformation. In these cases, the potential for harm caused by the\n\ntotality of the network's activity far exceeds the impact of each individual post or action.\n\nIn response to organized groups relying on authentic means to break our rules, we created the\n\nCoordinated Violating Networks (CVN) policy. It goes beyond our existing responses to\n\ncontent-level violations and enables us to take action against entire networks — whether these are\n\ncentralized adversarial operations or more decentralized groups — as long as they work together to\n\nsystematically violate our policies (see examples further in this subsection).\n\nSince we’ve developed this latest enforcement lever, we’ve enforced against networks with widely\n\nvarying aims and behaviors. It included: groups coordinating harassment against women,\n\ndecentralized movements working together to call for violence against medical professionals and\n\ngovernment officials, an anti-immigrant group inciting hate and harassment, and a cluster of\n\nactivity focused primarily on coordinating the spread of misinformation.\n\nAs mentioned at the start of Section 2, we rely on our tailored enforcement protocols to take\n\naction against these coordinated violating networks by manually investigating networks and\n\nthen carefully determining the scope of each network disruption to help us avoid over-enforcing\n\nand silencing innocent users. Over time, as we learn more and further understand the nature\n\nof the threats, we will begin working to add automated detection to our toolbox against this\n\ntype of abuse.\n\n\n-----\n\nHere are some examples of our latest CVN enforcements:\n\n**Greece: We removed two clusters of accounts and Pages on Facebook and Instagram that worked**\n\ntogether to repeatedly violate our policies against misinformation, hate speech and incitement to\n\nviolent overthrow of the government. They were associated with two conspiracy groups: the\n\n“Guardians of the Constitution” and the “Holy Declarationists” who position themselves as the true\n\nprotections of the Constitutions and argue that the Greek government has no constitutional\n\nauthority. The individuals behind this activity used authentic and duplicate accounts to manage\n\nGroups and Pages, some of which were enforced against by our review systems for various content\n\nviolations, including incitement to violence. They targeted politicians, judges, doctors, journalists\n\n[and educators with calls to violence and harassment. According to public reporting, individuals](https://greekreporter.com/2021/12/14/greek-anti-vaxxers-jailed/)\n\nconnected to this activity were linked to the kidnapping of a high school principal for enforcing\n\nCOVID-19 checks. They brought him to the police to report him for breaching the constitution,\n\nwhich led to the arrest of the kidnappers.\n\n   - **Most common content violation types by this network: Violence & incitement; hate speech;**\n\nbullying and harassment; misinformation.\n\n\n-----\n\n**India: We removed several clusters totalling about 2,000 accounts, Pages and Groups on Facebook**\n\nand Instagram that targeted women in India with sexualizing content and harassment. The people\n\nbehind each cluster of activity used authentic and duplicate accounts to manage Pages and Groups\n\nand flock to female users’ accounts with uninvited content, including nudity, sexual solicitation and\n\nhate speech. In at least one case, an account targeted at least 700 people.\n\n   - **Most common content violation types by this network: Sexual solicitation; hate speech;**\n\nbullying and harassment.\n\n**South Africa: We removed several clusters totalling about 200 Facebook accounts, Pages and**\n\nGroups that coordinated the harassment of migrants from other countries in Africa. Some of them\n\norganized under the brand “Operation Dudula,” which according to [public reporting](https://www.bbc.com/news/world-africa-60698374) is used by some\n\nin South Africa to campaign against undocumented foreign workers and blame them for poverty.\n\n[Some members of Operation Dudula have been publicly linked to street violence. On our services,](https://www.washingtonpost.com/world/2022/06/05/south-africa-operation-dudula-immigration/)\n\nthis particular cluster of activity included Pages and Groups that called for attacks against\n\nmigrants, organized offline marches and events, and celebrated reports of violence. Our automated\n\nsystems detected and removed much of this content. Likely in response to our detection and in an\n\nattempt to evade enforcement, the people behind this activity used duplicate and inauthentic\n\naccounts to manage their Pages and Groups. While we aren’t banning all Operation Dudula content,\n\nwe’re continuing to monitor the situation and will take action if we find additional violations to\n\nprevent abuse on our platform and protect people using our services.\n\n   - **Most common content violation types by this network: Violence and incitement; bullying**\n\nand harassment; hate speech; misinformation.\n\n\n-----\n\n# 03\n\n### Removing Inauthentic behavior\n\n**[What is Inauthentic Behavior? Inauthentic behavior (IB), as detailed in our Community Standards,](https://www.facebook.com/communitystandards/inauthentic_behavior)**\n\nis an effort to mislead people or Facebook about the popularity of content, the purpose of a\n\ncommunity (i.e. Groups, Pages, Events) or the identity of the people behind it. It is primarily\n\ncentered around amplifying and increasing the distribution of content, and is often (but not\n\nexclusively) financially motivated.\n\nIB operators typically focus on quantity rather than the quality of engagement. For example, they\n\nmay use large numbers of low-sophistication fake accounts to mass-post or like their content — be\n\nit commercial, social or political. They often use tactics similar to other large-scale online activities,\n\nlike spam.\n\nThis behavior pattern distinguishes IB from Coordinated Inauthentic Behavior (CIB) where\n\noperators invest in mimicking human social activity as closely as possible. Think of an elaborate\n\nfictitious journalist persona or a Middle-East-focused think tank managing multiple online accounts\n\nand websites to support their cover story, while trying to build trust with their targets and promote\n\nparticular narratives. IB operators, on the other hand, can sometimes involve the use of fake\n\naccounts, but we typically see little attempt to obfuscate their identity from Facebook and only the\n\nmost superficial attempts to construct a false identity.\n\nBoth of these violations are serious issues and we enforce against both, but we rely on very\n\ndifferent tools that respond to their distinct behaviors. CIB networks typically require manual,\n\nexpert investigations to uncover deception, whereas the relatively non-complex and repetitive\n\nnature of IB makes it particularly vulnerable to scaled detection and automated enforcement\n\nsystems.\n\nThis approach allows us to learn and improve our defenses in response to adversarial adaptation\n\nacross both violations, while removing IB clusters of activity at scale, no matter whether they aim\n\nto promote celebrity gossip, political news or clickbait with an aim to amass an audience.\n\nImportantly, constantly refining our scaled enforcement and detection allows us to disrupt IB\n\n\n-----\n\nclusters sooner, reducing their ability to build an audience. If CIB operations turn to IB tactics to\n\nmassage their engagement figures, they may also be taken down by our automated systems\n\nwithout manual investigation — freeing our expert investigators to focus on emerging,\n\nsophisticated threats.\n\nOur recent work in the Philippines ahead of its election is a good example of this approach to\n\ncombining expert investigations and scaled detection and enforcement. It is a model we’re hoping\n\nto extend to other areas of our threat disruption work as we continue building our understanding of\n\nthe threat environment worldwide.\n\n\n#### In focus: Philippines\n\n**Manual investigations and disruptions:**\n\nAhead of the Philippines election, our investigative teams took down about 10,000\n\naccounts for violating IB policy. They used IB tactics to inflate the distribution of content\n\nthat included election-related posts, including some that used politics as a spam lure at the\n\ntime when people were interested in following these topics. Through this threat intelligence\n\nwork, we continued to work on identifying repetitive patterns of behavior that are most\n\ncharacteristic of IB clusters in the region.\n\n**Automated detection at scale :**\n\nBased on these and earlier insights, we were able to automate the detection of these IB\n\npatterns to complement manual investigations. As a result, we identified hundreds of IB\n\nclusters in the Philippines and took action against over 15,000 thousand accounts after\n\nexpert review to ensure we don’t over-enforce. On average, these spammy clusters were\n\nless than six months old when we disabled them.\n\n**Automated enforcement:**\n\nIn addition to manual disruptions and automated detection, we also focused on automating\n\nenforcement against some of these IB patterns, based on the most reliable signals derived\n\nas part of our election preparation work in the Philippines. As a result, our disruption\n\nsystems were able to tackle specific types of high-confidence, repetitive inauthentic\n\nbehavior in the Philippines and globally. Specifically, we took down more than 50,000\n\naccounts engaged in IB, with about 10% originating in or targeting the Philippines and the\n\nrest coming from at least 100 different countries. Most of them were less than two months\n\nold when we caught them.\n\n\n-----\n\n# 04\n\n### Coordinated inauthentic behavior (CIB)\n\n**We view CIB as coordinated efforts to manipulate public debate for a strategic goal, in which fake**\n\naccounts are central to the operation. In each case, people coordinate with one another and use\n\nfake accounts to mislead others about who they are and what they are doing. When we investigate\n\nand remove these operations, we focus on behavior rather than content — no matter who’s behind\n\nthem, what they post or whether they’re foreign or domestic.\n\n**Continuous CIB enforcement: We monitor for efforts to come back by the networks we previously**\n\nremoved. Using both automated and manual detection, we continuously remove accounts and\n\nPages connected to networks we took down in the past.\n\n##### Malaysia\n\n**We removed 596 Facebook accounts, 180 Pages, 11 Groups and 72 Instagram accounts for**\n\n**[violating our policy against coordinated inauthentic behavior . This network originated in Malaysia](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**and targeted domestic audiences in that country.**\n\nThe individuals behind it ran a troll farm — a coordinated effort by co-located operators to corrupt\n\nor manipulate public discourse by using fake accounts and misleading people about who is behind\n\nthem. They were active across the internet, including Facebook, TikTok, Twitter and Instagram, and\n\nposted memes in Malay in support of the current government coalition, with claims of corruption\n\namong its critics. On Facebook, this network managed Pages, including those posing as\n\nindependent news entities, and promoted police while criticizing the opposition. Typically, their\n\nposting activity accelerated during weekdays, taking breaks for lunch. Their fake accounts were\n\nfairly under-developed and some of them used stolen profile pictures. Some of them were detected\n\nand disabled by our automated systems.\n\n\n-----\n\nWe found this network after reviewing information about a small portion of this activity initially\n\nsuspected to have originated in China by researchers at Clemson University. Although the people\n\nbehind it attempted to conceal their identity and coordination, our investigation found links to the\n\nRoyal Malaysia Police.\n\n   - Presence on Facebook and Instagram: 596 Facebook accounts, 180 Pages, 11 Groups and\n\n72 accounts on Instagram.\n\n   - Followers: About 427,000 accounts followed one or more of these Pages, around 4,000\n\naccounts joined one or more of these Groups and about 15,000 accounts followed one or\n\nmore of these Instagram accounts.\n\n   - Advertising: Around $6,000 in spending for ads on Facebook and Instagram, paid for\n\nprimarily in Malaysia ringgit.\n\n##### Israel\n\n**We removed 259 Facebook accounts, 42 Pages, 9 Groups and 107 Instagram accounts for**\n\n**[violating our policy against coordinated inauthentic behavior . This network originated in Israel](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n\n**and targeted Angola, Nigeria and the Gaza region in Palestine.**\n\nWe identified several clusters of activity that were present on multiple social media platforms and\n\noperating their own websites — with each cluster focused on a particular country. They included\n\nfictitious NGOs, media organizations and other entities that had presence across the internet, likely\n\nas “backstops” to make them appear more legitimate so they can withstand scrutiny by platforms\n\nand researchers. We found and removed the network before it was able to build its audiences, with\n\nthe Nigeria-focused cluster detected shortly after it first appeared on our platform.\n\nThe individuals behind this activity relied on fake accounts — some of which were detected and\n\ndisabled by our automated systems — to post, comment, manage Groups and Pages and share\n\nlinks to their off-platform websites. Some of these accounts posed as local independent\n\njournalists. Most of the accounts used profile pictures copied from elsewhere on the internet, while\n\nothers used profile pictures likely generated using artificial intelligence techniques like generative\n\nadversarial networks (GAN). This operation appeared to have leveraged fake engagement services\n\nto buy likes in an attempt to make its content and fictitious entities appear more popular than they\n\nwere, including to demonstrate the effectiveness of these campaigns to their benefactors.\n\n\n-----\n\nThis network posted primarily in English, Arabic and Portuguese about news and current events in\n\nthe countries they targeted, including positive commentary about the government of Angola, one\n\nof the political candidates in Nigeria and criticism of Hamas in Gaza.\n\nWe found this network as a result of an internal investigation into the suspected coordinated\n\ninauthentic behavior in the region. Although the people behind it attempted to conceal their\n\nidentities and coordination, our investigation found links to Mind Force, a PR firm in Israel. It is now\n\nbanned from our platforms.\n\n   - Presence on Facebook and Instagram: 259 Facebook accounts, 42 Pages, 9 Groups and\n\n107 accounts on Instagram.\n\n   - Followers: About 224,000 accounts followed one or more of these Pages, around 9,000\n\naccounts joined one or more of these Groups, and about 208,000 accounts followed one or\n\nmore of these Instagram accounts.\n\n   - Advertising: Around $12,000 in spending for ads on Facebook and Instagram, paid for\n\nprimarily in Euros and US dollars.\n\n\n-----\n\n##### Russia\n\n### IN-DEPTH RESEARCH & ANALYSIS:\n\n#### CERTAINLY THE Z TEAM\n\nBy Mike Torrey, Security Engineer, Ben Nimmo, Global Threat Intelligence Lead, and the IO Threat\n\nIntelligence Team\n\n###### EXECUTIVE SUMMARY:\n\nWe took down a network of Instagram accounts operated by a troll farm in St. Petersburg, Russia,\n\nwhich targeted global public discourse about the war in Ukraine. This appeared to be a poorly\n\nexecuted attempt, publicly coordinated via a Telegram channel, to create a perception of\n\ngrassroots online support for Russia’s invasion by using fake accounts to post pro-Russia\n\ncomments on content by influencers and media.\n\nWe detected this activity and began taking action in March, right after reviewing public reporting\n\nby the Russian outlet [Fontanka . They exposed a physical troll farm operated out of an office](https://www.fontanka.ru/2022/03/21/70522490/)\n\nbuilding in St. Petersburg, only 10 days after it had advertised job postings for “spammers,\n\ncommenters, content analysts, designers and programmers” focused on YouTube, Telegram and\n\nTikTok. We took down the network in early April, once we completed our investigation, and have\n\ncontinued to detect and disable its attempts to come back. We linked this activity to a\n\nself-proclaimed entity called “Cyber Front Z,” and to individuals associated with past activity\n\nby the Internet Research Agency (IRA). Cyber Front Z is now banned from our platforms.\n\nOur investigation found attempts at driving comments to people’s content on Instagram,\n\nFacebook, TikTok, Twitter, YouTube, LinkedIn, VKontakte and Odnoklassniki. It appears that hired\n\n“trolls” worked in shifts seven days a week, with a daily brief break for lunch. According to public\n\nreporting, they were divided into teams specializing on particular platforms they were meant to\n\n“spam.” The operation had an overt and a covert component. Overtly, they ran a Telegram channel\n\nthat regularly called on its followers to go to particular accounts or posts by public figures or news\n\nmedia and flood them with pro-Russia comments. Covertly, they ran fake accounts that posted\n\nsuch comments themselves — likely to make it look as if their crowdsourcing had been effective.\n\n\n-----\n\nThe targets included politicians, journalists, actors, celebrities and commercial brands from around\n\nthe world — anyone who might have spoken out in support of Ukraine.\n\nThis deceptive operation was clumsy and largely ineffective — definitely not “A team” work. On\n\nInstagram, for example, more than half of these fake accounts were detected and disabled by our\n\nautomated systems soon after creation. Their efforts didn’t see much authentic engagement, with\n\nsome comments called out as coming from trolls. We also found instances of the “trolls” who\n\nsprinkled pro-Ukraine comments on top of the paid pro-Russia commentary, in a possible attempt\n\nto undermine the operation from within.\n\n###### TAKEDOWN BY THE NUMBERS\n\n   - Presence on Facebook and Instagram: 45 Facebook accounts and 1,037 Instagram\n\naccounts.\n\n   - Followers: About 49,000 accounts followed one or more of these Instagram accounts.\n\n   - Advertising: Around $1,400 in spending for ads on Facebook and Instagram, paid\n\nfor in rubles.\n\n###### THE BEANBAG TROLLS\n\nJust like the IRA’s early efforts, the Z Team was exposed by undercover journalists who responded\n\nto job ads inviting them to join the ranks of the troll farm. The Z Team story first broke in late\n\nMarch, when Fontanka published a long exposé of this “patriotic movement” that employed several\n\nhundred people for 45,000 roubles a month (around $440 at the time) to comment online in\n\nsupport of the war in Ukraine. Reportedly, the employees were divided into specific\n\nplatform-focused departments — around two dozen people each — and given the login details for\n\nfake accounts to be operated from the employees’ personal devices and post 200 times a day.\n\nFontanka’s photos from inside the building showed the trolls working on beanbags.\n\nThe Z Team’s activity centered around the Telegram channel with over 100,000 followers as of this\n\nwriting, which routinely (multiple times a day) posted a list of “targets” on many platforms,\n\nincluding Twitter, LinkedIn, VKontakte and Odnoklassniki. Here is one example:\n\n\n-----\n\n**Image**\n\nThis public Telegram post from May 26, 2022 shares specific URLs\n\nand invites followers to comment on the Twitter and Instagram\n\naccounts of Finnish Prime Minister Sanna Marin.\n\n**Translation**\n\n“Prime Minister of Finland Sanna Marin arrived in Ukraine. They\n\nshowed her the broken towns of Irpin and Bucha, so that the Finn\n\nwould cry and fork out for restoration. Of course, they blamed Russia\n\nfor everything. In Kyiv, Sanna also met Zelya, who bowed and asked\n\nfor military assistance and EU accession.\n\nWe must explain to the Finnish politician that Ukraine will be\n\nliberated from Nazism by the Russian army, so petitions from\n\nZelensky from the cocaine acceptance center are not her level.\n\n🔽 Let’s fly here and massively urge not to support the Ukronazis 🔽\n\nIn English : Stop support ukrainian nazi, Sanna! Russia will free\n\nUkraine from the criminal regime!”\n\nThanks to Fontanka's reporting, we were able to build on their findings. While the original story did\n\nnot mention our apps, we were able to uncover a network of related accounts on Instagram. It\n\nappears that the organizers used the people they hired as simply a typing pool to flood\n\npro-Ukrainian posts with comments on one topic only — Russia’s war — using very basic, fake\n\naccounts that kept getting caught. They were low in sophistication, represented no distinct\n\npersonas and were essentially fungible. A large portion of them were detected and disabled by\n\nautomation even before we found their link to this activity. Some appeared to have been purchased\n\nfrom account farms around the world; others were created in batches in Russia in early March\n\n2022. The bulk of this activity on our platform consisted of comments on other people’s content,\n\nrather than standalone posts.\n\nMost comments were in Russian, and often replied to the substance of the posts they were\n\ncommenting on, rather than reusing the same generic phrases. None of the specific comments we\n\nreviewed as part of this investigation violated our content policies. In fact, according to Fontanka,\n\nthe operators were explicitly instructed not to be insulting, presumably to avoid platform\n\nenforcement. We took this network down based on its violating behavior, not the content it posted.\n\n\n-----\n\n**Image**\n\nComment under a post by Angelina Jolie from one of the Z Team’s\n\nfake accounts.\n\n**Translation**\n\n“Russia is sending tons of humanitarian aid to Ukraine, and the local Nazis\n\nand Banderites are holding citizens hostage and giving them no chance to\n\nlive. Ukraine will be liberated from the neo-Nazis!”\n\nThe Z Team’s online behavior was similar to other troll farms we’ve disrupted over the years,\n\nincluding in [Albania](https://about.fb.com/wp-content/uploads/2021/04/March-2021-CIB-Report.pdf) and [Nicaragua . All of these networks posted to a fixed schedule with a clear](https://about.fb.com/wp-content/uploads/2021/11/October-2021-CIB-Report.pdf)\n\nworking-day pattern, seven days a week, with a slow start in the morning and a surge toward the\n\nend of the day — possibly as the operators rushed to meet their posting quotas. The pattern\n\nshowed much less of a lunchtime dip in Russia than what we observed in Albania and Nicaragua,\n\nand little variation between weekdays and the weekend.\n\nWe assess that this on-platform cluster was operated by about several dozen individuals\n\non Instagram.\n\n**Image**\n\nTimeline of the Z Team’s posting activity, Monday\n\nthrough Sunday.\n\n\n-----\n\n#### Meeting the CIB threshold\n\n- As part of our assessment of whether a network engages in deceptive behavior that rises\n\nto the level of CIB (rather than IB), we look at the complexity of the deceptive activity as\n\none of the key factors.\n\n- In certain ways, the behavior in this case was not complex. At the individual account level,\n\nwe saw no serious attempts at what we call “persona-building” to make the fake accounts\n\nlook believable. The network did not engage in multiple forms of influence strategies (it\n\nfocused solely on mass commenting), nor did it systematically attempt to evade\n\nenforcement.\n\n- However, the operators mostly used unique comments, with little evidence of recycling\n\nthem. This shows an intentional and labor-intensive effort, distinguishing the network\n\nfrom other cases that fall under our spam and inauthentic engagement policies. Another\n\nfeature is the extent to which the activity was targeted and tailored. The network was\n\nnot sharing content in a scattershot way. Instead, the operation chose precise targets –\n\nsometimes to push back against specific pro-Ukraine messages and even memes.\n\n- Overall, the behavior on our services was only one piece of a much larger, more complex\n\ncross-platform effort. But it is important to note that cross-platform activity alone\n\nwithout coordination and the unique, targeted content would not be sufficient for a\n\nCIB call, and would fall under our spam and inauthentic engagement policies.\n\n- Finally, although the individual accounts did not engage in much persona-building, the\n\noverall operation did attempt to create the perception of a fictitious grass-roots\n\nmovement, Cyber Front Z, at the cross-platform level. In reality, Cyber Front Z is a troll\n\nfarm paying people to use fake profiles to deceive people about support for the war.\n\n\n###### BACK TO THE BASICS\n\nThe people behind the Z Team took some steps to conceal their identities. However, our\n\ninvestigation identified links to individuals associated with past activity by the Internet\n\nResearch Agency.\n\n\n-----\n\nThe Z Team’s tactics closely resembled those of the IRA in its earliest days, in 2013, when it\n\nfocused on targeting the Russian opposition domestically, including now-jailed activist Alexei\n\nNavalny. The [earliest exposés](https://www.novayagazeta.ru/articles/2013/09/09/56265-gde-zhivut-trolli-kak-rabotayut-internet-provokatory-v-sankt-peterburge-i-kto-imi-zapravlyaet) of the IRA’s Russian-language activity spoke of an office in the Olgino\n\nsuburb of St. Petersburg, where teams of Russians were paid to mass-post pro-government\n\ncomments on online forums, including LiveJournal. Back then, that operation advertised widely for\n\nwriters, tipping off several investigative journalists, who responded to the ads, worked in the\n\nbuilding and then exposed the now infamous troll-farm.\n\nWhat we found this year is that while the Z Team updated the platforms it targeted and moved to\n\nthe city center, it followed the same path as its predecessor — hiring people to mass comment and\n\nletting an undercover journalist in with them. Even the look was similar, apart from the beanbags\n\nand the “Z” flags.\n\n**Image**\n\nOpen-source footage of the IRA’s office in 2015, from Andrei\n\n[Soshnikov/YouTube .](https://www.youtube.com/watch?v=5r_VAxvu4l8)\n\n**Image**\n\nOpen-source footage of the Z Team offices in 2022,\n\n[from Fontanka .](https://www.fontanka.ru/2022/03/21/70522490/)\n\nIn terms of tactics, however, the Z Team behaved very differently from some of the IRA-linked\n\n[operations we disrupted in 2020 and 2022 . These had moved onto creating a small number of](https://about.fb.com/news/2020/09/august-2020-cib-report/)\n\ncredible fake accounts that were backstopped across multiple platforms, and tried to co-opt\n\nunwitting journalists by recruiting them to work for non-existent NGOs or news outlets. Unlike the\n\nZ Team, they put a premium on deception, and relied on operators to maintain elaborate fictitious\n\npersonas across platforms and withstand scrutiny while interacting with people.\n\n\n-----\n\n###### FAKE v. REAL\n\nFrom the start, the Z Team portrayed its mission as opposing pro-Ukrainian online activity. Its first\n\nTelegram post, on March 12, urged followers to “fight back in the information battlefield against the\n\npropagandists of the Kyiv junta funded by the Western world.”\n\nThe organizers regularly went head-to-head with pro-Ukraine organic commenting activity. Their\n\nTelegram channel identified social media posts that were receiving high volumes of pro-Ukraine\n\ncomments, and directed its followers and fake accounts to respond with pro-Russian comments.\n\nThe Z Team sometimes even copied memes that had been created by supporters of Ukraine, and\n\ndefaced them with swastikas and other far-right imagery to promote the Russian government’s\n\n“de-Nazification” claim.\n\n**Image**\n\nA meme created by a Ukrainian online activist group in March, highlighting\n\nthe plight of civilians in the besieged city of Mariupol.\n\n**Image**\n\nThe same meme copied and defaced by Cyber Front Z, showing a member\n\nof the Azov Battalion.\n\nIn many ways, the pro-Russia operation attempted to mirror the anti-war communities defending\n\nUkraine. However, there were key differences. First, the Z Team relied on fake accounts run\n\nby paid posters. Second, anti-war and pro-Ukraine comments typically outnumbered the\n\nZ Team’s comments.\n\nFor example, on March 28, the Z Team targeted a post by the Finnish defense minister with\n\ncomments that included the claim, “This info (battle) field is under the control of the Russian\n\nFederation's Cyber Front” (illustrated below). In fact, of the 255 accounts that commented on this\n\npost, almost 200 came from Ukraine, while just over 20 were operated by the Z Team.\n\n\n-----\n\n**Image**\n\nA typical comment from one of the Cyber Front Z’s fake accounts,\n\nreplying to a post by the Finnish minister of defense, and representing\n\nthe letter “Z,” characteristic of the Russian invasion.\n\n**Translation of the comment: “ Info (battle)field under the control of the**\n\nRussian Federation’s Cyber Front.”\n\n###### Z-GRADE MISSES\n\nOur investigation has not found evidence of the Z Team sparking significant support among\n\nauthentic communities around the world. The regular misses by this campaign likely contributed to\n\nthis lack of success.\n\nFor example, a Telegram post on May 26 invited followers to tell then-UK Foreign Secretary Liz\n\nTruss that “the de-Nazification of Ukraine is inevitable, even if London is defending the\n\nUkro-Nazis.” It listed what the Z Team thought were the relevant accounts on Twitter, Instagram\n\nand Facebook. Instead of her actual Facebook Page, however, they linked to a fan Page with about\n\n30 followers that had not posted since 2018.\n\n**Image**\n\nPublic Telegram post by the Z Team, targeting then-Foreign Secretary\n\nLiz Truss. Note the three URLs at the bottom: the Twitter link leads to\n\nher verified account, the Instagram link is that of the British Embassy in\n\nMoscow, but the Facebook Page is a fan Page unused since 2018.\n\n\n-----\n\nIn another example, the Z Team invited its followers to comment in English on the Instagram\n\naccount of Finnish Prime Minister Sanna Marin. As of mid-June, these comments had not appeared\n\nanywhere on our apps. Similarly, a Telegram post on May 21 called on the Z Team’s supporters to\n\ncomment on the social media accounts of actor Morgan Freeman, with a similar result.\n\nWe saw more failed attempts to drum up a conversation on other platforms, including Twitter and\n\nYouTube. In late May, the Z Team steered people toward Twitter accounts including those of the\n\nPresident of Poland, the International Ice Hockey Federation (IIHF), the French Tennis Federation,\n\nand YouTube channels including the IIHF, Ukrainian singer Max Barskih, and Russian rock group\n\n“ Машина Времени ” (“Time Machine”). None of these showed a high volume of pro-Russia\n\ncomments, while some people called them out as “Russian trolls.”\n\n**Image**\n\n**Left : The Z Team providing its**\n\nfollowers on Telegram with a set\n\nof comments for the IIHF after it\n\nbanned the Russian and\n\nBelarusian teams, including the\n\nphrase “Sport is out of politics!”\n\n**Right : Comments on an IIHF**\n\nYouTube video, including two\n\nquoting the Z Team message (red\n\nboxes) and another user calling\n\nout the trolls (blue box).\n\nIn isolated cases, the fake accounts appear to have assumed a split personality when posting in\n\nEnglish versus Russian. The same account would reply to some posts with its usual pro-Russia\n\ncomments, and to other posts they’d respond with pro-Ukraine comments. In some cases, they\n\nappeared to have copied and pasted pro-Ukraine comments from the very groups the Z Team\n\nexplicitly opposed. This might be a case of individual operators undermining this fictitious\n\nmovement from within.\n\n\n-----\n\n**Image**\n\nThree comments by the same fake Instagram account on\n\nMarch 31, 2022, in the span of 24 minutes. The account\n\nposted the English text, which appeared to have been copied\n\nand pasted from other people’s pro-Ukraine posts, four times\n\nin three minutes.\n\n**Translation**\n\nHow accurate the Russian soldier is! Two bullets through\n\nthe heart! Not even Clint Eastwood could do that For Russia\n\n� 💪 💤\n\nThese examples underscore the importance of analyzing attempted influence operations according\n\nto the evidence, and not taking any claims of viral success at face value. Some threat actors try to\n\ncapitalize on the public’s fear of influence operations by trying to create the false perception of\n\n[widespread manipulation, even if there is no evidence — a phenomenon we called out in 2020 as](https://about.fb.com/wp-content/uploads/2021/05/IO-Threat-Report-May-20-2021.pdf)\n\n“perception hacking.” It is possible that operators may also do this in an attempt to convince their\n\nfunders or employers of their effectiveness in corralling large-scale authentic movements, while\n\n“faking” this engagement on the back end. However, the available evidence suggests that they\n\nhaven’t succeeded in rallying substantial authentic support online as part of this operation.\n\nInterestingly, the Z Team’s activity was publicized as a “patriotic movement” by a number of\n\nRussian media entities, including those previously reported to have links with the IRA. This\n\namplification aspect offers an opportunity for future open-source research.\n\n\n-----\n\n### Appendix: Threat indicators\n\n##### 1. BITTER APT\n\n Domains & C2s\n\n|D omain|D escription|\n|---|---|\n|signalpro[.]org|Hosting Dracarys Malware|\n|signal-premium[.]org|Hosting Dracarys Malware|\n|signalpremium[.]com|Hosting Dracarys Malware|\n|telegram-pro[.]org|Hosting Dracarys Malware|\n|signal-premium-app[.]org|Dracarys Malware C2|\n|youtubepremiumapp[.]com|Dracarys Malware C2|\n|pflix.camdvr[.]org|Dracarys Malware C2|\n|94.140.114[.]22|Dracarys Malware C2|\n|weather.play-protect[.]com|Assessed to be attacker controlled infrastructure|\n|gallery.play-protect[.]com|Assessed to be attacker controlled infrastructure|\n|sikhsiyasatapp[.]net|Assessed to be attacker controlled infrastructure|\n|telegramapppro[.]org|Assessed to be attacker controlled infrastructure|\n|play-protect[.]com|Assessed to be attacker controlled infrastructure|\n|www.sikhsiyasatapp[.]net|Assessed to be attacker controlled infrastructure|\n|briarapppro[.]org|Assessed to be attacker controlled infrastructure|\n|islam-360-plus[.]com|Assessed to be attacker controlled infrastructure|\n|converse-app[.]org|Assessed to be attacker controlled infrastructure|\n|telegram-app[.]tech|Assessed to be attacker controlled infrastructure|\n|appprotonvpn[.]com|Assessed to be attacker controlled infrastructure|\n\n\n-----\n\n|linphone-app[.]com|Assessed to be attacker controlled infrastructure|\n|---|---|\n|appbriar[.]com|Assessed to be attacker controlled infrastructure|\n|gosignal[.]org|Assessed to be attacker controlled infrastructure|\n|app2.appvlc[.]com|Assessed to be attacker controlled infrastructure|\n\n\n##### Hashes\n\n|MD5|Description|Malware Family|\n|---|---|---|\n|a 3d18021cd444e8fe23fffc1a6140071|Signal Pro|Dracarys|\n|0 7532dea34c87ea2c91d2e035ed5dc87|Youtube Premium|Dracarys|\n|e 20473bea7fe5968f0a032303838b601|Signal Pro|Dracarys|\n|d 9a39c41e9f599766b5527986e807840|pflix|Dracarys|\n|b 06e2f95ecf7012138bee314be9baed9|pflix|Dracarys|\n\n\n-----\n\n##### 2. APT36\n\n Domains & C2s\n\n|Domain|Description|\n|---|---|\n|1 drivestorage[.]com|Assessed to be actor-controlled domain hosting malware|\n|a ppsupdate[.]net|Assessed to be actor-controlled domain hosting malware|\n|a rchiverst[.]com|Assessed to be actor-controlled domain used to redirect to other actor-controlled domains|\n|f ilestudios[.]net|Assessed to be actor-controlled domain hosting malware|\n|h atvax[.]com|C2 for malware|\n|m edizz[.]co|C2 for malware|\n|p lay[.]google[.]com[.]whatsapp[.]playapps[.]ga|Assessed to be actor-controlled domain hosting malware|\n|r atapi11223344786[.]azurewebsites[.]net|C2 for malware|\n|r deskapi719543132892786[.]azurewebsites[.]net|C2 for malware|\n|r karsin453287786[.]azurewebsites[.]net|C2 for malware|\n|s ecureapplication[.]azurewebsites[.]net|C2 for malware|\n|s ecurechat[.]azurewebsites[.]net|C2 for malware|\n\n\n-----\n\n|s hareflx[.]com|Assessed to be actor-controlled domain hosting malware|\n|---|---|\n|s hareflx[.]createasocialcard[.]top|Social card preview site that redirects to actor-controlled domain|\n|s hareflx[.]social-card-share[.]top|Social card preview site that redirects to actor-controlled domain|\n|s hareflx[.]socialpreviews[.]top|Social card preview site that redirects to actor-controlled domain|\n|s toreupdates[.]net|Assessed to be actor-controlled domain hosting malware|\n|t estandroidopen[.]azurewebsites[.]net|C2 for malware|\n|t heambix[.]org|C2 for malware|\n|y oursdrive[.]com|Assessed to be actor-controlled domain hosting malware|\n\n\n##### Hashes\n\n- `5d885fd9b896c8d59dbdc6b3ae4068662544f401d98a7eba757b329714d87c45`\n\n- `b3510e0a8775d9ab5c8409510041dc1e7da47923d5bf3e8f0848a4a3970ffca7`\n\n- `7999f5af42e6a825db56aa800a6b957c19d609225cc339f12cf85dde06af3b74`\n\n- `5d9027c76306efd5fb57f42dbbaa26f976657a523c32d8fd3fa628ee1417d0aa`\n\n##### Yara rule\n```\n rule xploitspy_rat {\n  meta:\n\n```\n\n-----\n\n```\n   source = \"Facebook\"\n   date = \"2022-08-04\"\n   description = \"Android RAT found on GitHub at\n https://github.com/XploitWizer/XploitSPY/tree/master/client/app/src/main/java/\n com/remote/app.\"\n  strings:\n   $func0 = \"0xAU\"\n   $func1 = \"0xCL\"\n   $func2 = \"0xCO\"\n   $func3 = \"0xFI\"\n   $func4 = \"0xGP\"\n   $func5 = \"0xIN\"\n   $func6 = \"0xLO\"\n   $func7 = \"0xMI\"\n   $func8 = \"0xPM\"\n   $func9 = \"0xSM\"\n   $func10 = \"0xWI\"\n   $func11 = \"0xCB\"\n   $func12 = \"0xNO\"\n   $applist0 = \"appName\"\n   $applist1 = \"packageName\"\n   $applist2 = \"versionName\"\n   $applist3 = \"versionCode\"\n   $notif0 = \"appName\"\n   $notif1 = \"postTime\"\n  condition:\n\n```\n\n-----\n\n```\n   7 of ($func*) and (\n    all of ($applist*)\n    or all of ($notif*)\n   )\n }\n rule lazaspy_android_rat {\n  meta:\n   source = \"Facebook\"\n   date = \"2022-08-04\"\n   description = \"Custom Android RAT built on top of XploitSPY\"\n  strings:\n   $s0 = \"/.System/Ct.csv/\"\n   $s1 = \"/.System/sm.csv/\"\n   $s2 = \"logg.txt\"\n   $s3 = \"ulog.txt\"\n   $s4 = \"This Feature is currently Unavailable. Comming Soon!\"\n   $s5 = \"Press Back Again to Exit.\"\n   $s6 = \"Please Grant Permission to Continue\"\n   $s7 = \"Try Again something went wrong\"\n   $s8 = \"Deleting Conversation Please wait\"\n   $s9 = \"please type something\"\n   $s10 = \"Message not Sent\"\n  condition:\n   7 of ($s*) and xploitspy_rat\n }\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://about.fb.com/wp-content/uploads/2022/08/Quarterly-Adversarial-Threat-Report-Q2-2022.pdf"
    ],
    "report_names": [
        "Quarterly-Adversarial-Threat-Report-Q2-2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf6cb670-bb69-473f-a220-97ac713fd081",
            "created_at": "2022-10-25T16:07:23.395205Z",
            "updated_at": "2025-03-27T02:02:09.777308Z",
            "deleted_at": null,
            "main_name": "Bitter",
            "aliases": [
                "T-APT-17",
                "TA397"
            ],
            "source_name": "ETDA:Bitter",
            "tools": [
                "Artra Downloader",
                "ArtraDownloader",
                "Bitter RAT",
                "BitterRAT",
                "Dracarys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "655f7d0b-7ea6-4950-b272-969ab7c27a4b",
            "created_at": "2022-10-27T08:27:13.133291Z",
            "updated_at": "2025-03-27T02:00:55.490812Z",
            "deleted_at": null,
            "main_name": "BITTER",
            "aliases": [
                "T-APT-17"
            ],
            "source_name": "MITRE:BITTER",
            "tools": [
                "ZxxZ"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1659628667,
    "ts_modification_date": 1659603927,
    "files": {
        "pdf": "https://archive.orkl.eu/d2e73b16a7d9c49d90b2474ca235956cbf0ec7e0.pdf",
        "text": "https://archive.orkl.eu/d2e73b16a7d9c49d90b2474ca235956cbf0ec7e0.txt",
        "img": "https://archive.orkl.eu/d2e73b16a7d9c49d90b2474ca235956cbf0ec7e0.jpg"
    }
}