{
    "id": "c45edf92-0e65-4643-b306-adc7bd1d5711",
    "created_at": "2023-01-12T14:59:54.64654Z",
    "updated_at": "2025-03-27T02:13:57.338161Z",
    "deleted_at": null,
    "sha1_hash": "fa21f284c164071760373b45067966cc8dd209ad",
    "title": "2022-02-22 - Russia-Ukraine Cyberattacks Updated How to Protect Against Related Cyberthreats Including DDoS Hermet",
    "authors": "",
    "file_creation_date": "2022-05-25T14:28:20Z",
    "file_modification_date": "2022-05-25T14:28:20Z",
    "file_size": 3261310,
    "plain_text": "# Russia-Ukraine Cyberattacks (Updated): How to Protect Against Related Cyberthreats Including DDoS, HermeticWiper, Gamaredon, Website Defacement, Phishing and Scams\n\n**[unit42.paloaltonetworks.com/preparing-for-cyber-impact-russia-ukraine-crisis](https://unit42.paloaltonetworks.com/preparing-for-cyber-impact-russia-ukraine-crisis/)**\n\nFebruary 22, 2022\n\nBy [Unit 42](https://unit42.paloaltonetworks.com/author/unit42/)\n\nFebruary 22, 2022 at 3:00 PM\n\n[Category: Government,](https://unit42.paloaltonetworks.com/category/government/) [Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Threat Advisory/Analysis](https://unit42.paloaltonetworks.com/category/threat-briefs-assessments/threat-advisory-analysis/)\n\nTags: [Advanced URL Filtering,](https://unit42.paloaltonetworks.com/tag/advanced-url-filtering/) [Cortex,](https://unit42.paloaltonetworks.com/tag/cortex/) [DDoS,](https://unit42.paloaltonetworks.com/tag/ddos/) [Defacement,](https://unit42.paloaltonetworks.com/tag/defacement/) [Gamaredon,](https://unit42.paloaltonetworks.com/tag/gamaredon/) [HermeticWiper,](https://unit42.paloaltonetworks.com/tag/hermeticwiper/)\n[Nation-state,](https://unit42.paloaltonetworks.com/tag/nation-state/) [Russia,](https://unit42.paloaltonetworks.com/tag/russia/) [threat prevention,](https://unit42.paloaltonetworks.com/tag/threat-prevention/) [Ukraine,](https://unit42.paloaltonetworks.com/tag/ukraine/) [WhisperGate,](https://unit42.paloaltonetworks.com/tag/whispergate/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\n[This post is also available in: 日本語 (Japanese)](https://unit42.paloaltonetworks.jp/preparing-for-cyber-impact-russia-ukraine-crisis/)\n\n## Executive Summary\n\nOver the past several weeks, Russia-Ukraine cyber activity has escalated substantially.\nBeginning on Feb. 15, a series of distributed denial of service (DDoS) attacks commenced.\nThese attacks have continued over the past week, impacting both the Ukrainian government\nand banking institutions. On Feb. 23, a new variant of wiper malware named HermeticWiper\nwas discovered in Ukraine. Shortly after, a new round of website defacement attacks were\nalso observed impacting Ukrainian government organizations.\n\nConsistent with our previous reporting on the topic, several western governments have\nissued recommendations for their populations to prepare for cyberattacks that could disrupt,\ndisable or destroy critical infrastructure. We have already observed an increase in Russian\n[cyber activity, which we reported on in our initial Threat Brief published last month and our](https://unit42.paloaltonetworks.com/ukraine-cyber-conflict-cve-2021-32648-whispergate/)\n[recent report on the Gamaredon group. Future attacks may target U.S. and Western](https://unit42.paloaltonetworks.com/gamaredon-primitive-bear-ukraine-update-2021/)\nEuropean organizations in retaliation for increased sanctions or other political measures\nagainst the Russian government. We recommend that all organizations proactively prepare to\ndefend against this potential threat.\n\n\n-----\n\nThis post was substantially updated on Feb. 24 to add information on the recent DDoS\nattacks, HermeticWiper malware and website defacement; update our recommendations for\nhow organizations should prepare for potential cyber impact; and provide additional details\nfor our customers and clients on how we can help. This post was substantially updated March\n31 to add information on phishing and scam attacks, cybersquatting trends, fake donation\nwebsites, DoS attacks on Ukrainian news sites and distribution of malicious binaries.\n\nFull visualization of the techniques observed, relevant courses of action and indicators of\n[compromise (IoCs) related to this report can be found in the Unit 42 ATOM viewer.](https://unit42.paloaltonetworks.com/atoms/hermeticwiper)\n\nWe will continue to provide updates with new information and recommendations as they\nbecome available.\n\n\nAttack Types Discussed in\nRelation to Russia-Ukraine\nCyber Activity\n\nNamed Threat Groups and\nMalware\n\n\n[DDoS, website defacement, wiper](https://unit42.paloaltonetworks.com/tag/ddos/)\n\nHermeticWiper, [Gamaredon,](https://unit42.paloaltonetworks.com/tag/gamaredon/) [WhisperGate,](https://unit42.paloaltonetworks.com/tag/whispergate/)\n[OctoberCMS vulnerability](https://unit42.paloaltonetworks.com/tag/octobercms/)\n\n\nTypes of Protections Covered Best Practices, Proactive Assessments, Ransomware\nReadiness, WildFire, Threat Prevention, XSOAR, Cortex\nXpanse\n\n## Table of Contents\n\nDDoS Attacks Impacting Ukrainian Government and Banking Institutions\n\nHermeticWiper Malware\n\nWebsite Defacement\n\n\n-----\n\nRise in Phishing and Scam Attacks\nIncrease in Cybersquatting Trends\nFake Donation Websites\nDoS Attacks on Ukrainian News Sites\nDistribution of Apps\nHow Palo Alto Networks Is Working to Keep You Safe\nHow You Should Prepare for an Increase in Cyberthreats Such as Wipers, DDoS, Website\nDefacement and Other Related Attacks\nHow Unit 42 Threat Intelligence and Security Consulting Can Help\nAdditional Cybersecurity Resources\nIndicators of Compromise\nAppendix A: Cortex Xpanse: Identifying Assets That May Be Impacted by CISA’s Known\nExploited Vulnerabilities\n\n## DDoS Attacks Impacting Ukrainian Government and Banking Institutions\n\n[On Feb. 15, the Cyberpolice of Ukraine reported that residents were actively receiving fake](https://twitter.com/CyberpoliceUA/status/1493578811492950020)\nSMS text messages. These messages were likely intended to cause alarm among the\npopulation, as they claimed that ATMs were malfunctioning.\n\n\n-----\n\nFigure 1. Example text message provided by the Cyberpolice of Ukraine.\n\n[Shortly after the text messages were observed, several DDoS attacks occurred. These attacks](https://www.bloomberg.com/news/articles/2022-02-16/ukraine-suffers-biggest-ddos-attack-on-record-in-russia-standoff)\nimpacted Ukrainian government organizations including the Ministry of Defense, Ministry of\nForeign Affairs, Armed Forces of Ukraine and the publicly funded broadcaster Ukrainian\nRadio. Additionally, the attacks targeted two banking institutions, PrivatBank and\nOschadbank. An initial investigation into the DDoS attacks suggested that Mirai and Meris\nbot networks may have been leveraged in the attacks.\n\n[On Feb. 18, both the United States and the United Kingdom attributed these DDoS attacks to](https://www.whitehouse.gov/briefing-room/press-briefings/2022/02/18/press-briefing-by-press-secretary-jen-psaki-deputy-national-security-advisor-for-cyber-and-emerging-technology-anne-neuberger-and-deputy-national-security-advisor-for-international-economics-and-dep/)\nRussia’s Main Intelligence Directorate (GRU).\n\n\n-----\n\nOver the past week, Ukraine has continued to observe a relatively constant flow of DDoS\nattacks targeting its government and financial institutions. However, at this time, attribution\n[for the ongoing attacks has not been established. The Ukrainian CERT did identify a post on](https://cert.gov.ua/article/37211)\nRaidForums from a user named “Carzita” that suggested that additional actors may also be\nlaunching DDoS and defacement attacks for undisclosed reasons.\n\n\n-----\n\nFigure 2. Carzita post on RaidForums.\n\n## HermeticWiper Malware\n\n\n-----\n\nOn Feb. 23, a malicious file named conhosts._exe (SHA256:\n1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591) was uploaded to\na public malware repository from an organization in Kyiv, Ukraine. This executable is a\nsigned file with a valid signature from an organization named Hermetica Digital Ltd. This\nsigning certificate has since been explicitly revoked by its issuer. Upon execution, this file\nenumerates all files on a hard drive, wipes the partition info and then forces a system reboot,\nwhich predictably results in the following screen:\n\nFigure 3. Missing operating system after hard drive is wiped.\n\nFurther analysis has confirmed that the malware accepts command-line arguments allowing\nan attacker to instruct the malware to sleep for a period of time or to shut down the system.\n\nAdditionally the kernel module responsible for the actual wiping activity is from a legitimate\napplication called EaseUS Partition Master. This software is designed as free partition\nsoftware that can reorganize disk space for better performance.\n\n[In tracking this threat, early reports show that the malware has been deployed against a](https://zetter.substack.com/p/second-wiper-attack-strikes-systems?utm_source=url)\nfinancial institution in Ukraine as well as two contractors in Latvia and Lithuania that\n[provide services to the Ukrainian Government. Additionally, ESET researchers have warned](https://twitter.com/ESETresearch/status/1496581903205511181)\nthat they found this malware installed across “hundreds of machines” in Ukraine.\n\n\n-----\n\nFigure 4. ESET research warning.\n\n## Website Defacement\n\nConcurrent with the discovery of wiper malware, we also witnessed a second round of\nwebsite defacements on Feb. 23. These attacks appear to have copied the messaging template\nobserved in attacks exploiting the OctoberCMS vulnerability a month earlier on Jan.14, while\nadding a .onion web address and a message in red font that translates to, “Do you need proof,\nsee the link at the end.”\n\n\n-----\n\nFigure 5. Website defacement message. A new message in red font translates to “Do you need proof, see\n\nthe link at the end.”\n\nThe .onion site links to an entity calling themselves “Free Civilian” and offering to sell\ndatabases containing the personal data of Ukrainian citizens. Over the past 24 hours, the list\nof entities on the leaks section has expanded to 48 gov.ua domains and one Ukranian\ncompany (motorsich[.]com) that builds engines for airplanes and helicopters.\n\n\n-----\n\nFigure 6. Free Civilian .onion site.\n\n\n-----\n\nFigure 7. New leaks offered on the Free Civilian .onion site.\n\n## Rise in Phishing and Scam Attacks\n\n\n-----\n\nOur team analyzed the larger trends regarding Ukraine-related phishing and scam URLs\ndetected by Advanced URL Filtering. We noticed an overall increase in the detection of\nwebsites that host phishing and scam URLs on domains using Ukraine-related TLDs such as\ngov.ua and com.ua, or containing popular Ukraine-related keywords such as \"ukraine\" and\n\"ukrainian\". This trend correlates with an increase in Google searches for terms like \"Ukraine\naid.\" The increase in online searches containing Ukraine-related keywords likely makes such\n[URLs a more lucrative target for attackers, and past examples show that attackers are known](https://unit42.paloaltonetworks.com/covid-19-themed-phishing-attacks/)\nfor taking advantage of current events.\n\nFrom January to late February, it appears that the number of Ukraine-related phishing and\nscam sites largely followed a similar trend as Ukraine-related internet searches; however, the\nnumber of phishing and scam sites has continued to rise through mid-late March as the\nsituation remains ongoing. Figure 8 shows that the number of Ukraine-related\nphishing/scam sites is currently continuing to rise about a month after the “Ukraine aid”\nsearch term started trending in Google search.\n\nFigure 8. Comparison of the number of websites (hostnames) hosting Ukraine-related phishing and scam\n\nURLs and worldwide search interest in “Ukraine Aid” as reported by Google Trends.\n\nAmong these phishing and scam URLs, we found a targeted phishing attack. On March 16\nwhile ingesting a third-party data feed, our in-house machine learning models detected a\nphishing webpage targeting a Ukrainian state administration employee. The webpage is\nimitating a popular cloud file storage site. Upon visiting the webpage, the “Username” field is\npre-populated with the targeted employee’s email address, and the user is then prompted to\nenter in their password in order to view a sensitive document as shown in Figure 9.\n\n\n-----\n\nFigure 9. hxxps://startrackzm[.]com/wap-admin/ONE-DRIVE/one%20d%20%20no%20auto.php?\nEmail=REDACTED@REDACTED.gov.ua. A phishing webpage targeting a Ukrainian state administration\n\nemployee, detected by our in-house machine learning models on March 16.\n\nOur teams at Palo Alto Networks are actively monitoring the phishing landscape surrounding\nUkraine-related URLs and are sharing this threat intelligence with relevant authorities in\n[Ukraine and internationally. We are also sharing a list of IoCs that were detected as phishing](https://github.com/pan-unit42/iocs/commit/259a6dedbd92d82c0caf24cff34716f0b2a62ec1)\nand scam URLs. Palo Alto Networks customers who subscribe to Advanced URL Filtering are\nalready protected from these IoCs.\n\n## Increase in Cybersquatting Trends\n\nWe monitored a list of 50 legitimate Ukraine-related domains (e.g., popular news and\ndonation websites) and keywords (e.g., Ukraine, refugee) as targets for cybersquatting. We\ndetected 11,637 cybersquatting newly registered domains (NRDs) during February and\nMarch. In particular, we noticed a sharp increase in the number of cybersquatting domains\nthat were registered close to Feb. 24, as shown in Figure 10 below.\n\n\n-----\n\nFigure 10. A spike in the number of squatting NRDs close to Feb. 24.\n\nWe manually analyzed a sample set of these cybersquatting domains. Below we share some\ninteresting case studies.\n\n### Fake Donation Websites\n\nWe identified more than two dozen domains requesting donations to support Ukraine. A\ndetailed analysis of these domains revealed that many of them are fake. These donation\nwebsites provide little to no information about the associated organization and distribution\nof funds. Many of these websites use cryptocurrency wallets (e.g., BTC, ETH) to accept\npayment (likely because these wallets are easy to set up and require no verification).\n\n[We also find that some websites are mimicking popular donation websites or organizations](https://unit42.paloaltonetworks.com/cybersquatting/)\nto trick users into paying them money. We show some examples in Figure 11. For instance,\n[donatetoukraine[.]com is pretending to be associated with the popular Come Back Alive](https://www.comebackalive.in.ua/)\ncampaign. While the banking information shared on the donation website matches the\noriginal campaign website, we confirmed that the BTC wallet address is different from the\nactual.\n\n\n-----\n\nFigure 11. The screenshots show various examples of websites impersonating legitimate Ukraine\nrelated entities, asking for donations.\n\n### DoS Attacks on Ukrainian News Sites\n\nWe found a cybersquatting domain – save-russia[.]today – that is launching DoS attacks on\nUkrainian news sites. Once a user opens the website in the browser, it starts making requests\nto various Ukrainian news sites and lists the number of requests made to each new site on the\nhome page, as shown in Figure 12 below.\n\n\n-----\n\nFigure 12. A cybersquatting domain save-russia[.]today is launching DoS attacks on Ukrainian news sites.\n\nWe strongly recommend that users be alert to the possibility of cybersquatting domains. In\nparticular, fake donation websites mimicking popular websites can be misleading, as\ndescribed earlier. Before donating money, we recommend checking whether the website is\nreferenced and shared by the official charity or government organization. Our teams at Palo\nAlto Networks will continue monitoring domain squatting attacks and work to protect\n[customers against them. We are also sharing a list of IoCs publicly and have shared this](https://github.com/pan-unit42/iocs/commit/259a6dedbd92d82c0caf24cff34716f0b2a62ec1)\nthreat intelligence with relevant authorities in Ukraine.\n\n## Distribution of Apps\n\nWe detected campaigns of fake downloads where threat actors have set up web pages to host\nmalicious binaries. We found that these campaigns were targeting Ukrainian users. Most of\nthese web pages show malicious binaries as popular browsers or communication apps in\norder to deceive users. For example, we detected a website that was distributing a malicious\nbinary by masquerading as a popular global communication app targeting users in Ukraine.\nThis domain is still active and trying to target Ukrainian users at the time of writing this post.\nNote that Palo Alto Networks customers receive protections against such domains from the\n[Next-Generation Firewall via Advanced URL Filtering,](https://www.paloaltonetworks.com/network-security/advanced-url-filtering) [DNS Security and WildFire URL](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/dns-security)\nAnalysis subscriptions.\n\n\n-----\n\nFigure 13: A website distributing a malicious binary by masquerading as a popular global\n\ncommunication app.\n\nWe also found that these fake download campaigns rotate domains to distribute the same\nmalicious binaries. For example, we detected two domains distributing the same malicious\nbinary where one domain was impersonating a popular, widely used video conferencing\napplication and the other a widely used internet browser.\n\nThe distribution of fake browsers and communication apps targeting Ukrainian users at this\ntime is concerning. Our teams at Palo Alto Networks will continue to monitor and work to\n[protect our customers against such attacks. We are publicly sharing a list of IoCs and shared](https://github.com/pan-unit42/iocs/commit/259a6dedbd92d82c0caf24cff34716f0b2a62ec1)\nthis threat intelligence with relevant authorities in Ukraine. We also advise Ukrainian users\nto only install software and apps from verified and official websites.\n\n## How Palo Alto Networks Is Working to Keep You Safe\n\nConsistent with our previous reporting on the situation, Unit 42 continues to lead a\ncompany-wide effort to collect, evaluate and disseminate the latest intelligence on cyber\nactivity related to Russia and Ukraine. We are actively collaborating with our partners in\nindustry and governments to share our analysis and findings based on our global threat\ntelemetry network.\n\nThese efforts have enabled us to make near-daily updates to our platform to ensure our\n[customers have the best protection possible. This includes blocking hundreds of domain](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\nnames, IP addresses and URLs for our customers related to newly discovered attacks. We’ve\n[updated and added signatures to the WildFire analysis and Cortex XDR Prevent and Pro](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nproducts to block newly discovered vulnerabilities and malware including HermeticWiper.\n[Read more about Cortex XDR protections. Our](https://www.paloaltonetworks.com/blog/security-operations/cortex-xdr-protections-against-malware-associated-with-ukraine-and-russia-cyber-activity/) [Threat Prevention and Web Application and](https://www.paloaltonetworks.com/network-security/threat-prevention)\nAPI Security products added coverage for the OctoberCMS vulnerability exploited in the\n[WhisperGate attacks, and we released an XSOAR Playbook to help organizations hunt for](https://xsoar.pan.dev/marketplace/details/WhisperGateCVE202132648)\n[this threat. Cortex Xpanse can assist with understanding and managing your organization’s](https://www.paloaltonetworks.com/cortex/cortex-xpanse)\nattack surface as well as identifying vulnerable resources.\n\n\n-----\n\n[We have released public reports on the WhisperGate attacks and the infrastructure and](https://unit42.paloaltonetworks.com/ukraine-cyber-conflict-cve-2021-32648-whispergate/)\n[tactics used by the Gamaredon group. On the Unit 42 website, you will also find a free ATOM](https://unit42.paloaltonetworks.com/gamaredon-primitive-bear-ukraine-update-2021/)\nwhich contains a structured mapping of the Gamaredon group’s tactics aligned to MITRE’s\nATT&CK framework.\n\n[As the situation continues to develop, we’ll continue to update our blog with the latest](https://unit42.paloaltonetworks.com/)\ninformation.\n\n## How You Should Prepare for an Increase in Cyberthreats Such as Wipers, DDoS, Website Defacement and Other Related Attacks\n\nThere is no single action you can take to protect your organization against this threat. Unlike\na new malware family or vulnerability in the wild, the attacks we expect could come in many\nforms. Several western governments have proposed broad recommendations focused on\ntechnical hygiene. We consider these appropriate given the variety of tactics that Russian\nactors have used in the past.\n\nWe recommend organizations prioritize actions in the following four areas:\n\n1. Patch Internet-Facing and Business Critical Software: Apply patches for any\n\n[software containing vulnerabilities – not just those known to be exploited in the wild.](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\nThis is most urgent for software that is internet-facing and necessary for your\nbusiness’s operations, such as webmail, VPNs and other remote access solutions.\n2. Prepare for Ransomware and/or Data Destruction: A likely form of disruptive\n\ncyberattack will either use ransomware or a destructive attack that poses as\n[ransomware. As we saw with the NotPetya attacks in 2017 and the WhisperGate attacks](https://unit42.paloaltonetworks.com/unit42-threat-brief-petya-ransomware/)\njust last month, an attack that demands a ransom may not actually be “ransomware.”\nThe malware used in these attacks destroyed data without any chance of recovery, using\nthe ransom demand simply to cover its true intention. The use of HermeticWiper\nfurther demonstrates this point. The preparation required to prevent and recover from\nthese attacks is similar in either case. Testing back-up and recovery plans is critical, as\nwell as testing your continuity of operations plan in case your network or other key\nsystems are disabled in the attack.\n3. Be Prepared to Respond Quickly: Ensure that you designate points of contact\n\nacross your organization in key areas in case of a cybersecurity incident or disruption in\ncritical infrastructure. Test your communication protocol (and backup protocols) to\navoid being caught without a clear mechanism to disseminate critical information.\nPerform a table-top exercise with all of the key parties to walk through how you would\nrespond in the event the worst happens.\n\n\n-----\n\n4. Lock Down Your Network: Making small policy changes can decrease the\n\n**likelihood of a successful attack against your network. Many applications**\n**can be abused, even though the application itself may not be malicious. If**\n**your organization doesn’t require their functionality, blocking them will**\n**improve your security posture. For example, recent attacks have abused**\n**popular applications – like Trello and Discord – to distribute malicious**\n**files. Users didn’t need to use the software to be impacted, the attackers**\n**simply used the platforms to host links to files.**\n\nThere is no way to know for certain what shape an attack may take, but taking these steps will\nhelp provide broad protection against what we expect to come.\n\n## How Unit 42 Threat Intelligence and Security Consulting Can Help\n\nUnit 42, the threat intelligence and security consulting arm of Palo Alto Networks, has a team\nof experts who can help your organization assess and test your security controls with\nproactive assessments and incident simulation services. Because of the likelihood of\nransomware attacks – or destructive attacks that pose as ransomware – it may be beneficial\nto focus on preparing in this area, particularly ensuring backup and recovery plans are in\nplace. We have distilled the knowledge we’ve gained from responding to hundreds of\n[ransomware incidents into our Ransomware Readiness Assessment offering, which is](https://www.paloaltonetworks.com/ransomware-readiness-assessment)\ndesigned to help organizations strengthen their processes and technology to mitigate threats\nlike the ones we expect in the coming days and weeks.\n\nIf you think you may have been compromised by wiper attacks, Gamaredon, DDoS attacks or\nother cyber activity related to Russia-Ukraine, or have an urgent matter, get in touch with the\n[Unit 42 Incident Response team or call North America Toll-Free: 866.486.4842](http://start.paloaltonetworks.com/contact-unit42.html)\n(866.4.UNIT42), EMEA: +31.20.299.3130, APAC: +65.6983.8730, or Japan:\n+81.50.1790.0200.\n\n## Additional Cybersecurity Resources\n\n[Threat Brief: Ongoing Russia and Ukraine Cyber Conflict (Jan. 20)](https://unit42.paloaltonetworks.com/ukraine-cyber-conflict-cve-2021-32648-whispergate/)\nRussia’s Gamaredon aka Primitive Bear APT Group Actively Targeting Ukraine (Updated\nFeb. 16)\nSpear Phishing Attacks Target Organizations in Ukraine, Payloads Include the Document\nStealer OutSteel and the Downloader SaintBot\n[Threat Briefing: Protecting Against Russia-Ukraine Cyber Activity](https://register.paloaltonetworks.com/unit42briefingrussiaukraine)\n[Palo Alto Networks Resource Page: Protect Against Russia-Ukraine Cyber Activity](https://www.paloaltonetworks.com/russia-ukraine-cyber-resources)\n[Cortex XDR Protections Against Malware Associated with Ukraine and Russia Cyber Activity](https://www.paloaltonetworks.com/blog/security-operations/cortex-xdr-protections-against-malware-associated-with-ukraine-and-russia-cyber-activity/)\n[CISA: Shields Up Technical Guidance](https://www.cisa.gov/uscert/shields-technical-guidance)\n\n## Indicators of Compromise\n\n\n-----\n\n### HermeticWiper SHA256\n\n1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\n\n0385eeab00e946a302b24a91dea4187c1210597b8e17cd9e2230450f5ece21da\n\na64c3e0522fad787b95bfb6a30c3aed1b5786e69e88e023c062ec7e5cebf4d3e\n\n3c557727953a8f6b4788984464fb77741b821991acbf5e746aebdd02615b1767\n\n2c10b2ec0b995b88c27d141d6f7b14d6b8177c52818687e4ff8e6ecf53adf5bf\n\n06086c1da4590dcc7f1e10a6be3431e1166286a9e7761f2de9de79d7fda9c397\n\n### Certificate\n\nName Hermetica Digital Ltd\n\nThumbprint 1AE7556DFACD47D9EFBE79BE974661A5A6D6D923\n\nSerial Number 0C 48 73 28 73 AC 8C CE BA F8 F0 E1 E8 32 9C EC\n\n### Website Defacement Domain\n\ngcbejm2rcjftouqbxuhimj5oroouqcuxb2my4raxqa7efkz5bd5464id[.]onion\n\n### Scam and Phishing URLs, Fake Donation Sites, Fake Browser or Messenger\n\n[Please see the IoCs on GitHub.](https://github.com/pan-unit42/iocs/commit/259a6dedbd92d82c0caf24cff34716f0b2a62ec1)\n\n## Appendix A: Cortex Xpanse: Identifying Assets That May Be Impacted by CISA's Known Exploited Vulnerabilities\n\nIn [Alert AA22-011A (updated March 1, 2022), the U.S. Department of Homeland Security’s](https://www.cisa.gov/uscert/ncas/alerts/aa22-011a)\nCybersecurity and Infrastructure Security Agency (DHS/CISA) identifies a selection of\nvulnerabilities that Russian advanced persistent threat (APT) groups are assessed to have\nexploited in the past, but recommends that users take action against a much broader list of\nknown exploited vulnerabilities (KEVs). The cited KEVs and their impacted devices – all of\nwhich can be identified using Cortex Xpanse – are:\n\nCVE-2018-13379 FortiGate VPNs\nCVE-2019-1653 Cisco router\nCVE-2019-2725 Oracle WebLogic Server\nCVE-2019-7609 Kibana\nCVE-2019-9670 Zimbra software\nCVE-2019-10149 Exim Simple Mail Transfer Protocol\nCVE-2019-11510 Pulse Secure\nCVE-2019-19781 Citrix\nCVE-2020-0688 Microsoft Exchange\nCVE-2020-4006 Multiple Vmware Products\nCVE-2020-5902 F5 Big-IP\nCVE-2020-14882 Oracle WebLogic\n\n\n-----\n\nCVE-2021-26855 Microsoft Exchange\n\nCortex Xpanse’s ability to index the entire internet helps organizations discover, prioritize,\nand remediate significant exposures on their attack surfaces – including all of the impacted\n[services listed above. We routinely observe vulnerable devices across the global internet,](https://www.paloaltonetworks.com/blog/security-operations/why-do-our-adversaries-prey-on-years-old-vulnerabilities-because-you-let-them/)\ndespite the fact that most of these CVEs are more than two years old.\n\nBeyond Alert AA22-011A, CISA’s overarching guidance for attack surface reduction includes\nhardening of forward-facing network services, with prioritized patching of KEVs, as\n[documented in Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of](https://cyber.dhs.gov/bod/22-01/)\nKnown Exploited Vulnerabilities (KEV). This directive requires agencies to remediate all\n[vulnerabilities that CISA includes in their KEV catalog based on an assessment that the](https://www.cisa.gov/known-exploited-vulnerabilities)\nvulnerabilities “carry significant risk to the federal enterprise.” Learn more and see a detailed\nworkflow example on the Palo Alto Networks SecOps blog, “How Xpanse Can Identify CISAIdentified Known Exploited Vulnerabilities.”\n\n_Updated April 1, 2022, at 11 a.m. PT._\n\n**Get updates from Palo Alto Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-22 - Russia-Ukraine Cyberattacks Updated How to Protect Against Related Cyberthreats Including DDoS Hermet.pdf"
    ],
    "report_names": [
        "2022-02-22 - Russia-Ukraine Cyberattacks Updated How to Protect Against Related Cyberthreats Including DDoS Hermet.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535594,
    "ts_updated_at": 1743041637,
    "ts_creation_date": 1653488900,
    "ts_modification_date": 1653488900,
    "files": {
        "pdf": "https://archive.orkl.eu/fa21f284c164071760373b45067966cc8dd209ad.pdf",
        "text": "https://archive.orkl.eu/fa21f284c164071760373b45067966cc8dd209ad.txt",
        "img": "https://archive.orkl.eu/fa21f284c164071760373b45067966cc8dd209ad.jpg"
    }
}