{
    "id": "c499b09d-763b-4bec-8113-d5e061b67671",
    "created_at": "2023-01-12T15:02:53.319769Z",
    "updated_at": "2025-03-27T02:08:16.791776Z",
    "deleted_at": null,
    "sha1_hash": "9e82d219245c51fae819d31f86e2c68e20dc0f60",
    "title": "2022-09-29 - America’s Throwaway Spies How the CIA failed Iranian informants in its secret war with Tehran",
    "authors": "",
    "file_creation_date": "2022-10-02T12:26:49Z",
    "file_modification_date": "2022-10-02T12:26:49Z",
    "file_size": 2969991,
    "plain_text": "# How the CIA failed Iranian spies in its secret war with Tehran\n\n**reuters.com/investigates/special-report/usa-spies-iran/**\n\nBy JOEL SCHECTMAN and BOZORGMEHR SHARAFEDIN\n\nThe spy was minutes from leaving Iran when he was nabbed.\n\nGholamreza Hosseini was at Imam Khomeini Airport in Tehran in late 2010, preparing for a\nflight to Bangkok. There, the Iranian industrial engineer would meet his Central Intelligence\nAgency handlers. But before he could pay his exit tax to leave the country, the airport ATM\nmachine rejected his card as invalid. Moments later, a security officer asked to see\nHosseini’s passport before escorting him away.\n\nHosseini said he was brought to an empty VIP lounge and told to sit on a couch that had\nbeen turned to face a wall. Left alone for a dizzying few moments and not seeing any\nsecurity cameras, Hosseini thrust his hand into his trouser pocket, fishing out a memory card\nfull of state secrets that could now get him hanged. He shoved the card into his mouth,\nchewed it to pieces and swallowed.\n\nNot long after, Ministry of Intelligence agents entered the room and the interrogation began,\npunctuated by beatings, Hosseini recounted. His denials and the destruction of the data were\nworthless; they seemed to know everything already. But how?\n\n“These are things I never told anyone in the world,” Hosseini told Reuters. As his mind raced,\nHosseini even wondered whether the CIA itself had sold him out.\n\n\n-----\n\nIranian engineer Gholamreza Hosseini spent nearly a decade in a Tehran prison following his\nconviction for spying for the U.S. Central Intelligence Agency (CIA). He said the agency\nabandoned him following his 2010 arrest. Handout via REUTERS\nRather than betrayal, Hosseini was the victim of CIA negligence, a year-long Reuters\ninvestigation into the agency’s handling of its informants found. A faulty CIA covert\ncommunications system made it easy for Iranian intelligence to identify and capture him.\nJailed for nearly a decade and speaking out for the first time, Hosseini said he never heard\nfrom the agency again, even after he was released in 2019.\n\nThe CIA declined to comment on Hosseini’s account.\n\nHosseini’s experience of sloppy handling and abandonment was not unique. In interviews\nwith six Iranian former CIA informants, Reuters found that the agency was careless in other\nways amid its intense drive to gather intelligence in Iran, putting in peril those risking their\n\n\n-----\n\nlives to help the United States.\n\nOne informant said the CIA instructed him to make his information drops in Turkey at a\nlocation the agency knew was under surveillance by Iran. Another man, a former government\nworker who traveled to Abu Dhabi to seek a U.S. visa, claims a CIA officer there tried\nunsuccessfully to push him into spying for the United States, leading to his arrest when he\nreturned to Iran.\n\nSuch aggressive steps by the CIA sometimes put average Iranians in danger with little\nprospect of gaining critical intelligence. When these men were caught, the agency provided\nno assistance to the informants or their families, even years later, the six Iranians said.\n\nJames Olson, former chief of CIA counterintelligence, said he was unaware of these specific\ncases. But he said any unnecessary compromise of sources by the agency would represent\nboth a professional and ethical failure.\n\n“If we’re careless, if we’re reckless and we’ve been penetrated, then shame on us,” Olson\nsaid. “If people paid the price of trusting us enough to share information and they paid a\npenalty, then we have failed morally.”\n\nThe men were jailed as part of an aggressive counterintelligence purge by Iran that began in\n2009, a campaign partly enabled by a series of CIA blunders, according to news reports and\nthree former U.S. national security officials. Tehran has claimed in state media reports that its\nmole hunt ultimately netted dozens of CIA informants.\n\nTo tell this story, Reuters conducted dozens of hours of interviews with the six Iranians who\nwere convicted of espionage by their government between 2009 and 2015.\n\nTo vet their accounts, Reuters interviewed 10 former U.S. intelligence officials with\nknowledge of Iran operations; reviewed Iranian government records and news reports; and\ninterviewed people who knew the spies.\n\nNone of the former or current U.S. officials who spoke with Reuters confirmed or disclosed\nthe identities of any CIA sources.\n\nThe CIA declined to comment specifically on Reuters’ findings or on the intelligence\nagency’s operations in Iran. A spokeswoman said the CIA does its utmost to safeguard\npeople who work with the agency.\n\nIran's Ministry of Foreign Affairs and its Mission to the United Nations in New York did not\nrespond to requests for comment.\n\nHosseini was the only one of the six men Reuters interviewed who said he was assigned the\nvulnerable messaging tool. But an analysis by two independent cybersecurity specialists\nfound that the now-defunct covert online communication system that Hosseini used – located\n\n\n-----\n\nby Reuters in an internet archive – may have exposed at least 20 other Iranian spies and\npotentially hundreds of other informants operating in other countries around the world.\n\nThis messaging platform, which operated until 2013, was hidden within rudimentary news\nand hobby websites where spies could go to connect with the CIA. Reuters confirmed its\nexistence with four former U.S. officials.\n\nThese failures continue to haunt the agency years later. In a series of internal cables last\n[year, CIA leadership warned that it had lost most of its network of spies in Iran and that](https://www.nytimes.com/2021/08/26/world/middleeast/us-israel-bennett-cia-mossad.html)\n[sloppy tradecraft continues to endanger the agency’s mission worldwide, the New York](https://www.nytimes.com/2021/10/05/us/politics/cia-informants-killed-captured.html)\nTimes reported.\n\n“This is a very serious, very serious intelligence goal to penetrate Iran’s nuclear\nweapons program. You don’t get a much higher priority than that.”\n\nThe CIA considers Iran one of its most difficult targets. Ever since Iranian students seized the\nAmerican embassy in Tehran in 1979, the United States has had no diplomatic presence in\nthe country. CIA officers are instead forced to recruit potential agents outside Iran or through\nonline connections. The thin local presence leaves U.S. intelligence at a disadvantage amid\n[events such as the protests now sweeping Iran over the death of a woman arrested for](https://www.reuters.com/world/middle-east/iran-security-forces-clash-with-protesters-over-aminis-death-2022-09-27/)\nviolating the country’s religious dress code.\n\nFour former intelligence officers interviewed by Reuters said the agency is willing to take\nbigger risks with sources when it comes to spying on Iran. Curbing the Islamic Republic’s\nnuclear ambitions has long been a priority in Washington. Tehran insists its nuclear efforts\nare solely for energy needs.\n\n“This is a very serious, very serious intelligence goal to penetrate Iran’s nuclear weapons\nprogram. You don’t get a much higher priority than that,” said James Lawler, a former CIA\nofficer whose focus included weapons of mass destruction and Iran. “So when they do the\nrisk-versus-gain analysis, you’ve got to consider the incredible amount of gain.”\n\nMuch has been written about the decades-long shadow war between Iran and Washington,\nin which both sides have avoided a full military confrontation but have carried out sabotage,\nassassinations and cyberattacks. But the six informants, interviewed by Reuters for the first\ntime, gave an unprecedented firsthand account of the deadly spy game from the perspective\nof Iranians who served as CIA foot soldiers.\n\nThe six Iranians served prison terms ranging from five to 10 years. Four of them, including\nHosseini, stayed in Iran after their release and remain vulnerable to rearrest. Two fled the\ncountry and have become stateless refugees.\n\nThe six men acknowledged that their CIA handlers never made firm promises to help if they\nwere caught. Still, all had believed that U.S. assistance would one day come.\n\n\n-----\n\nThe espionage busts could pose a challenge to the CIAs credibility as it seeks to rebuild its\nspy network in Iran. The country’s state media publicized some of these cases, portraying\nthe agency as feckless and inept.\n\n“It’s a stain on the U.S. government,” Hosseini told Reuters.\n\nCIA spokeswoman Tammy Kupperman Thorp declined to comment on Hosseini, the cases of\nother captured Iranians or any aspect of how the agency conducts operations. But she said\nthe CIA would never be careless with the lives of those who help the agency.\n\n“CIA takes its obligations to protect the people that work with us very seriously and we know\nthat many do so bravely at great personal risk,” Thorpe said. “The notion that CIA would not\nwork as hard as possible to safeguard them is false.”\n\nThe CIA says it does its utmost to safeguard people who assist the agency. A Reuters\ninvestigation found that the CIA was often careless in protecting lower-level sources in Iran.\nREUTERS/Larry Downing\nAn angry volunteer\n\n\n-----\n\nHosseini s leap to espionage came after he had climbed a steep path to a lucrative career.\nThe son of a tailor, he grew up in Tehran and learned lathing and auto mechanics, he said,\nshowing Reuters his trade-school diploma.\n\nAlong the way, teachers spotted Hosseini’s intelligence and pushed him to study industrial\nengineering at the prestigious Amirkabir University of Technology, he said. Hosseini said a\nprofessor there put him in touch with a former student with ties to the Iranian government\nwho eventually became his business partner.\n\nFounded in 2001, their engineering company provided services to help businesses optimize\nenergy consumption. The firm at first worked mainly with food and steel factories, Hosseini\nsaid, over time scoring contracts with Iran’s energy and defense industries. Hosseini’s\naccount of his professional background is confirmed in corporate records, Iranian media\naccounts and interviews with six associates.\n\nHosseini said the company’s success made his family affluent, allowing him to buy a large\nhouse, drive imported cars and go on foreign vacations. But in the years after the election of\nPresident Mahmoud Ahmadinejad, who served from 2005 to 2013, his business teetered.\n\nGholamreza Hosseini in 2005 at the University of Tehran Science and Technology Park. The\nengineer said he later supplied information about two important Iranian nuclear sites to the\nCIA. Handout via REUTERS\nUnder Ahmadinejad, a hardliner aligned with the country’s theocratic ruler, Iran’s security\nforces were encouraged to enter the industrial sector, increasing the military’s control over\nlucrative commercial projects. Established companies often found themselves relegated to\n\n\n-----\n\nthe role of subcontractors for these newcomers, Iranian democracy activists said, shrinking\ntheir slice of the pie.\n\nBefore long, Hosseini said, all of his new contracts had to be routed through some of these\nfirms, forcing him to lay off workers as earnings tumbled.\n\n“They didn’t know how to do the work, but they took the lion’s share of the profits,” said\nHosseini, his voice rising as he recounted the events a decade later. “It was as if you were\nthe head of the company, doing everything from 0 to 100, and seeing your salary being given\nto the most junior employees. I felt raped.”\n\nAt the same time, U.S. rhetoric was ramping up against Ahmadinejad. Washington viewed\nIran’s president as a dangerous provocateur set on building nuclear weapons. Hosseini\nbegan to feel that his life was being destroyed by a corrupt system, and that the government\nwas too erratic to be allowed to obtain nukes. His anger grew.\n\nOne day in 2007, he said he opened the CIA public website and clicked the link to contact\nthe agency: “I’m an engineer who has worked at the nuclear site Natanz and I have\ninformation,” he wrote in Persian.\n\nLocated 200 miles south of Tehran, Natanz is a major facility for uranium enrichment.\nArchived web records from Hosseini’s engineering firm from 2007 say the company worked\non civilian electrical power projects. Reuters could not independently confirm Hosseini’s work\nat Natanz.\n\nA month later, to his surprise, Hosseini said he received an email back from the CIA.\n\nPart of the team?\n\nThree months after that contact, Hosseini said he flew to Dubai. At the fashionable shopping\nmarket Souk Madinat Jumeirah, he looked for a blonde woman holding a black book. He was\nstanding outside the restaurant where they had agreed to meet, when she arrived\naccompanied by a man.\n\nThe restaurant manager guided them to a table secluded in a corner. The woman introduced\nherself only as Chris, speaking in English while her colleague translated in Persian. As she\nsipped a glass of champagne, Chris told him they were the people Hosseini had been\nexchanging messages with over the past few months in Google’s chat platform. She asked\nHosseini about his work.\n\nHosseini said he explained that his company had several years earlier worked on contracts\nto optimize the flow of electricity at the Natanz site, a complex balancing act to keep\ncentrifuges spinning at precisely the speed needed to enrich uranium. Located in central\n\n\n-----\n\nIran, Natanz was the heart of Tehran s nuclear program, which the government said was to\nproduce civilian electricity. But Washington saw Natanz as the core of Iran’s push to acquire\nnuclear weapons.\n\n[Hosseini told Chris his firm was a subcontractor of Kalaye Electric, a company sanctioned in](https://home.treasury.gov/news/press-releases/200721612254215654)\n2007 by the U.S. government over its alleged role in Iran’s nuclear development program. He\nadded that he was seeking additional contracts at other sensitive nuclear and military sites.\n\nKalaye Electric did not respond to requests for comment.\n\nThe next day the three met again, this time at Hosseini’s hotel room overlooking the Gulf.\nHosseini unfurled a maze-like map across the desk showing the electricity connected to the\nNatanz nuclear facility. As he did, Chris’s mouth dropped open wide, Hosseini recalled.\n\nWhile several years old, Hosseini explained, the map’s notations of the amount of power\nflowing into the facility provided Washington a baseline to estimate the number of centrifuges\ncurrently active. That evidence, he believed, could be used to assess progress toward\nprocessing the highly enriched uranium needed for a nuclear weapon.\n\nHosseini said he didn’t know it at the time, but Natanz was already in the crosshairs of U.S.\n[authorities. That same year, Washington and Israel launched a cyberweapon that would](https://www.reuters.com/article/cyberwar-stuxnet-idUSL1N0BQ5ZW20130226)\nsabotage those very centrifuges, infecting them with a virus that would cripple uranium\nenrichment at Natanz for years to come, security analysts concluded. Reuters could not\ndetermine whether the information provided by Hosseini assisted in that cyber sabotage or\nother operations.\n\n\n-----\n\nIran s then-President Mahmoud Ahmadinejad on a 2008 visit to the Natanz nuclear\nenrichment facility in central Iran. REUTERS/Presidential official website/Handout (IRAN)\nIn subsequent meetings, Hosseini said, the CIA asked him to turn his attention to a broader\nU.S. goal: identifying possible critical points in Iran’s national electric grid that would cause\nlong and paralyzing blackouts if struck by a missile or saboteurs.\n\nHosseini said he continued to meet with the CIA in Thailand and Malaysia, in a total of seven\nmeetings over three years. To show evidence of his travels, Hosseini provided photographs\nof entry stamps in his passport for all but his first two trips, for which he said he had used an\nolder, now discarded, passport.\n\nAs the relationship progressed, Hosseini said, Chris was replaced with a male handler who\nwas accompanied by officials described as more senior in the CIA’s Iran operations, as well\nas technical experts able to keep up with his engineering jargon.\n\nThe new role motivated Hosseini, injecting his work with a sense of urgency and purpose. He\nscrambled to win business that would give him greater access to the intelligence the CIA\nsought. He said his company secured a contract with a unit of Setad, the sprawling business\nconglomerate controlled by Iran’s Supreme Leader Ayatollah Ali Khamenei, to assess the\nelectrical needs of a giant shopping and commercial building project in the north of Tehran.\n\nIranians walk on a promenade in northern Tehran late last year. The United States and Iran\nsevered diplomatic ties more than 40 years ago. Relations between the two nations remain\nstrained. Majid Asgaripour/WANA (West Asia News Agency) via REUTERS\n\n\n-----\n\nRepresenting the supreme leader s commercial organization, Hosseini pushed the state\npower company Tavanir for the electricity the sprawling development required, Hosseini said.\nWhen Tavanir said it didn’t have enough electricity to meet the project’s giant demands,\nHosseini asked the company to provide in-depth analyses of the national grid. This allowed\nhim access to maps showing how electricity flowed to nuclear and military sites and how\ncritical points of the network could be sabotaged.\n\nSetad and Tavanir did not respond to requests for comment.\n\nIn August 2008, a year after becoming a spy, Hosseini said he met with an older, broadshouldered CIA officer and others at a hotel in Dubai.\n\nGholamreza Hosseini says a CIA officer purchased this stuffed bear for his daughter as a\nbirthday gift.\n\n“We need to expand the commitment,” Hosseini recounted the officer saying. The officer\nhanded Hosseini a piece of paper and asked him to write a promise that he would not\nprovide the information he was sharing to another government, a CIA practice intended to\ndeepen a feeling of commitment from an informant, two former CIA officials said.\n\n\n-----\n\nAnother CIA officer in the meeting then showed Hosseini a covert communications system\nhe could use to reach his handlers: a rudimentary Persian-language soccer news website\ncalled Iraniangoals.com. Entering a password into the search bar caused a secret\nmessaging window to pop up, allowing Hosseini to send information and receive instructions\nfrom the CIA.\n\nWhen Hosseini lamented missing his daughter’s third birthday during one of the trips, he said\na CIA officer bought him a teddy bear to give to the child. “I felt that I had joined the team,”\nHosseini told Reuters.\n\nSecret system breakdown\n\nWhat Hosseini didn’t know was that the world’s most powerful intelligence agency had given\n[him a tool that likely led to his capture. In 2018, Yahoo News reported that a flawed web-](https://www.yahoo.com/video/cias-communications-suffered-catastrophic-compromise-started-iran-090018710.html)\nbased covert communications system had led to the arrest and execution of dozens of CIA\ninformants in Iran and China.\n\nReuters located the secret CIA communications site identified by Hosseini, Iraniangoals.com,\nin an internet archive where it remains publicly available. Reuters then asked two\nindependent cyber analysts – Bill Marczak of University of Toronto’s Citizen Lab, and Zach\nEdwards of Victory Medium – to probe how Iran may have used weaknesses in the CIA’s\nown technology to unmask Hosseini and other CIA informants. The two are experts on\nprivacy and cybersecurity, with experience analyzing electronic intelligence operations. The\neffort represents the first independent technical analysis of the intelligence failure.\n\nMarczak and Edwards quickly discovered that the secret messaging window hidden inside\nIraniangoals.com could be spotted by simply right-clicking on the page to bring up the\nwebsite’s coding. This code contained descriptions of secret functions, including the words\n“message” and “compose” – easily found clues that a messaging capability had been built\ninto the site. The coding for the search bar that triggered the secret messaging software was\nlabeled “password.”\n\nFar from being customized, high-end spycraft, Iraniangoals.com was one of hundreds of\nwebsites mass-produced by the CIA to give to its sources, the independent analysts\nconcluded. These rudimentary sites were devoted to topics such as beauty, fitness and\nentertainment, among them a Star Wars fan page and another for the late American talk\nshow host Johnny Carson.\n\nEach fake website was assigned to only one spy in order to limit exposure of the entire\nnetwork in case any single agent was captured, two former CIA officials told Reuters.\n\nBut the CIA made identifying those sites easy, the independent analysts said. Marczak\nlocated more than 350 websites containing the same secret messaging system, all of which\nhave been offline for at least nine years and archived. Edwards confirmed his findings and\n\n\n-----\n\nmethodology. Online records they analyzed reveal the hosting space for these front websites\nwas often purchased in bulk by the dozen, often from the same internet providers, on the\nsame server space. The result was that numerical identifiers, or IP addresses, for many of\nthese websites were sequential, much like houses on the same street.\n\n“The CIA really failed with this,” said Marczak, the Citizen Lab researcher. The covert\nmessaging system, he said, “stuck out like a sore thumb.”\n\nIn addition, some sites bore strikingly similar names. For example, while Hosseini was\ncommunicating with the CIA through Iraniangoals.com, a site named Iraniangoalkicks.com\nwas built for another informant. At least two dozen of the 350-plus sites produced by the CIA\nappeared to be messaging platforms for Iranian operatives, the analysts found.\n\nAll told, these features meant the discovery of a single spy using one of these websites\nwould have allowed Iranian intelligence to uncover additional pages used by other CIA\ninformants. Once those sites were identified, nabbing the operatives using them would have\nbeen simple: The Iranians just had to wait and see who showed up. In essence, the CIA\nused the same row of bushes for its informants worldwide. Any attentive espionage rival\nwould have been able to spot them all, the analysts said.\n\nThis vulnerability went far beyond Iran. Written in various languages, the websites appeared\nto be a conduit for CIA communications with operatives in at least 20 countries, among them\nChina, Brazil, Russia, Thailand and Ghana, the analysts found.\n\nCIA spokeswoman Thorp declined to comment on the system.\n\nReuters confirmed the nature of the intelligence failure of the CIA’s cookie-cutter websites\nwith three former national security officials.\n\nThe agency wasn’t fully aware that this system had been compromised until 2013, after\nmany of its agents began to go missing, according to the former U.S. officials.\n\nStill, the CIA had never considered the network safe enough for its most prized sources. Toptier informants receive custom-made covert communications tools, built from scratch at\nagency headquarters in Langley, Virginia, to seamlessly blend into the life of a spy without\ndrawing attention, three former CIA officers said.\n\nThe mass-produced sites, they said, were for sources who were either not considered fully\nvetted or had limited, albeit potentially valuable, access to state secrets.\n\n“This is for a person viewed as not worth the investment of advanced tradecraft,” one of the\nformer CIA officials said.\n\nThe CIA declined to comment on the covert communications system and the intelligence\nfailure.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\nThe CIA produced hundreds of websites embedded with a secret messaging tool for\ncommunicating with operatives. Screenshots of some of these archived sites, all defunct\nsince at least 2013, show they were created in a variety of languages, including English,\nRussian, Chinese and Arabic.\n\nCaste system for spies\n\n“We will go to hell and back to protect our sources,” said Lawler, the former CIA officer.\n\nIt’s a common refrain from agency veterans. But it sometimes comes with an asterisk.\n\nSome former intelligence officers privately acknowledge that the CIA protects its informants\non a sliding scale based on the perceived worth of the spy, an ever-shifting assessment\nalmost never fully explained to the source.\n\nAt the top of the pyramid are what the CIA calls “fully recruited, highly vetted assets.” These\nare people such as high-level government officials or nuclear scientists who have direct,\ncontinued access to critical secrets. CIA officers sometimes spend years trying to lure these\nkey operatives into becoming agents.\n\n\n-----\n\nIf the officer succeeds in the recruitment – and gets the blessing of headquarters – the newly\nminted agent is put on CIA books with a regular CIA paycheck. Such spies are sometimes\nissued the kinds of ingenious gadgets and training that are the stuff of Hollywood legend. If a\nhighly vetted asset is captured, the loss reverberates at the top levels of the CIA. The CIA\nwill sometimes track down the child or spouse of an executed agent years afterward to offer\nmillion-dollar compensation and a discreetly marked agency medal to commemorate the\nsacrifice, former officers said.\n\nBut a lot of the intelligence the CIA gathers comes from low-level informants who never\nbecome “full-fledged members of the roster of spies,” said Paul Pillar, a 28-year veteran of\nthe U.S. intelligence community, mainly at the CIA, where he worked as a senior analyst on\nthe Middle East.\n\nSuch informants - sometimes disgruntled ex-officials or spurned lovers - may have just\nfragments of a bigger secret the agency seeks to uncover.\n\n“You take what you can get,” Pillar said.\n\nThese sources often receive less protection than a high-level asset, no regular payments\nand usually no commitment of CIA help if they get caught, former CIA officers said.\n\nInside Iran, the CIA placed low-level informants at dire risk, interviews with six of the former\nspies revealed. The spies knew they were jeopardizing their lives when they gave\ninformation to the United States and said the agency didn’t make any promises about their\nsecurity. In interviews with Reuters, however, the men repeatedly stated their belief that the\nCIA would do its best to protect them.\n\nOne of these men, Mohammad Aghaei, said he mulled going to the CIA for years before he\nacted.\n\nAghaei is a former longtime member of the Basij, a religious paramilitary organization that\nviolently suppressed student pro-democracy demonstrations in the late 1990s and 2000s.\nHe said he became disaffected by how Khamenei used religious ideology to preserve power.\nAghaei wanted to support the Iranian dissidents he had seen attacked in the streets, he\nsaid, and thought America might help.\n\n\n-----\n\nMohammad Aghaei in 2018 in Turkey, where he lived for a time as a refugee. He fled Iran\nafter serving nearly six years in prison for espionage after providing information to the CIA.\nHandout via REUTERS\nYears later, Aghaei came up with a plan to ask the CIA for financial support for a well-known\nIranian dissident, the son of a prominent cleric, whom he knew. In 2011, he flew to Istanbul,\ntook a taxi to the consulate, and told the security guard he wanted to talk to the CIA.\n\nAghaei’s description of his initial vetting at the consulate closely matches what former U.S.\nofficials told Reuters was standard procedure for handling such a “walk-in” looking to connect\nwith the CIA.\n\nHe said he was first strip-searched by uniformed guards, then brought to another room.\nThere Aghaei was questioned for several hours about his background and motives by a\ndiplomatic security official who frequently left the room only to return with further questions.\n\nThe Iranian said he did ultimately meet with a CIA officer that day. But she wasn’t interested\nin supporting the dissident. Instead, she was more drawn to Aghaei’s family ties to Iranian\nsecurity forces. Aghaei had disclosed that he had relatives working in the Intelligence\nMinistry as well as the Islamic Revolutionary Guard Corps, an elite branch of the military. The\nCIA officer offered to reimburse him for his trip, then proposed a small mission for him to\nprove himself.\n\n\n-----\n\nAghaei said she asked him to use his family connections to gather information on the Quds\nForce, an arm of the Revolutionary Guards that operates abroad, including names, phone\nnumbers and addresses of senior commanders. He was provided no training in how to avoid\ndetection, nor given a covert way of contacting the CIA officer, he said.\n\nHe was told simply to show up again at the Istanbul consulate once he’d completed his task,\nand given $2,000 to cover his travel costs. Aghaei said he returned to Turkey a few months\nlater to share the information he’d gathered. The same CIA officer prepped him for another\nmission. But after returning to Iran in December 2011, he was soon captured.\n\n“We know you have had meetings at the consulate,” an Intelligence Ministry interrogator said\nfollowing the arrest, Aghaei recounted to Reuters.\n\nHe knew he was taking a risk – but not the full extent of it. The CIA had learned a year earlier\nfrom phone intercepts that Iranian operatives were surveilling the consulate, hunting for\nturncoats such as Aghaei, according to a former U.S official with direct knowledge of the\nsituation.\n\nWhy, then, bring Aghaei back to the consulate when the CIA was aware it was being\nmonitored? A veteran senior CIA intelligence officer said such a scenario is born from the\nreality that most volunteers ultimately fail to produce valuable intelligence and are often\ndouble agents. Prior to a meeting with a source outside the station, a CIA officer may spend\nhours walking around a city to evade any tails, the former officer explained. Sometimes that’s\nconsidered too much hassle and risk to take for a new volunteer, he said.\n\nAghaei spent almost six years in Tehran’s Evin prison on espionage charges, according to\njudicial records, fellow prisoners and Iranian media accounts.\n\nThe CIA declined to comment on whether it knew that the Iranians allegedly were surveilling\nthe U.S. consulate, nor would it say whether it had met with Aghaei. Reuters could not\nindependently confirm Aghaei’s account of the meetings.\n\nHe spoke to Reuters from refugee centers where he fled following his release, first in Turkey,\nthen in Switzerland.\n\n\n-----\n\n-----\n\nMohammad Aghaei in western Turkey in March 2020 near the border crossing with Greece.\nHe said the CIA never contacted him again following his espionage arrest. He’s now a\nrefugee in Switzerland. Handout via REUTERS\n\nVisa ploy\n\nNot all informants are volunteers. The CIA at times pressures, even deceives, Iranians\nhoping to secure U.S. visas into providing intelligence when they apply at consulates in the\nUnited Arab Emirates or Turkey, according to five former U.S. national security officials.\n\nAfter an Iranian drops off an application, diplomatic officers are instructed to examine\nwhether their employment history or family ties could make them valuable. A few days later,\na promising applicant might receive a phone call asking them to return to the consulate to\nanswer more detailed questions.\n\nAs CIA officers, posing as consular officers, reel the applicant into increasingly probing\nmeetings, they hold out the possibility that the visa application will be approved, according to\nthe national security officials, all of whom were directly involved in such practices. By the\ntime the Iranian realizes he has given information to an intelligence officer, the unwitting\ninformant has often made disclosures that could land him in jail.\n\n\n-----\n\nSuch was the case with one of the Iranians who spoke to Reuters. A retired Iranian official,\nhe had recently started a travel agency when he flew to Abu Dhabi with his wife in 2011 in\norder to visit the U.S. embassy there. The travel agent had just won the U.S. green card\nlottery and believed this huge stroke of luck would allow him to expand his tourism business.\n\nThe entrepreneur was at first excited to be invited to a series of interviews over the course of\nseveral trips to Abu Dhabi. He said he met inside and outside the embassy with a U.S.\nconsular officer who said his name was Steve. Beyond offering to help complete the\nimmigration screening process, the American official said he could help smooth the way for\nthe man’s Iranian customers to receive visas to the United States.\n\nBut over time, their conversations pivoted from the travel agent’s future in the United States\nto requests by Steve for sensitive information about Iran’s aviation and defense sectors, the\nIranian said.\n\nRecognizing the potential danger he was now in if Iranian authorities found out, he said he\ncut his contact with Steve, likely a pseudonym, and gave up on his dream to reside in the\nUnited States. But he was arrested in 2015 in Iran by the intelligence officials who somehow\nhad learned of the liaison. Would he work for Tehran as a double agent, his Iranian\ninterrogators asked, to learn more about how the CIA recruits spies?\n\nHe declined the offer and was sentenced to 10 years in prison, serving seven years before\nobtaining early release in 2022. “We feel as if we had been played with by both sides,” his\nwife told Reuters.\n\nThe man never recovered his travel business and has struggled to find work in Iran since his\nrelease in 2021. Even ridesharing apps rejected his applications to become a driver, likely\nbecause of his conviction, the former travel agent said.\n\nReuters could not independently confirm the Iranian’s interactions with the CIA. The man\nprovided travel records and correspondence with the embassy to support his story. Reuters\nindependently contacted another former prisoner who said he had met the travel agent while\nboth were in the same jail. He said the entrepreneur at the time had given him an identical\naccount of the CIA’s recruitment attempt.\n\nThe CIA declined to comment on the travel agent case. The five former U.S. national security\nofficials, however, confirmed details of how the visa ploy is used to gather Iranian\nintelligence.\n\nLeft in the cold\n\nWhen Hosseini, the engineer, next met with the CIA in 2009, he readied for the most\nmomentous meeting yet. He had spent months gathering secret data on vulnerable points in\nIran’s national power grid. He said he had ridden his motorcycle through the desert gathering\n\n\n-----\n\nphotos and GPS coordinates of main electric poles and stations he believed could be\ntargeted by missiles or saboteurs to cause massive blackouts.\n\nBut when he arrived in Malaysia, he was met by a sole CIA agent.\n\n“Things have changed,” the officer said.\n\nThe CIA was no longer interested in the information he collected on electrical grid\nvulnerabilities, Hosseini said the officer told him.\n\nHosseini was floored. He had taken such risks to deliver for his handlers. “But now they just\nweren’t interested,” he said.\n\nGoing forward, he said, the officer wanted him to dig deeper into plans at the Fordow nuclear\nfacility, where Hosseini said his company had recently won a contract.\n\nThat plant, located inside a mountain near the holy city of Qom, had remained hidden from\nUnited Nations nuclear inspectors until Iran confirmed its existence in 2009. At the time, the\nadministration of U.S. President Barack Obama used revelations of the site’s existence to try\nto win leverage as it began diplomatic talks aimed at curbing Iran’s nuclear ambitions.\n\nHosseini said the CIA requested more granular information on Fordow, which he believed\nWashington wanted to help it with its negotiations. Hosseini interpreted his handlers’ pivot as\nreflecting the new Obama administration’s desire to move towards a diplomatic solution with\nIran.\n\nFormer CIA officers say shifts in intelligence priorities are common when a new president\ntakes power. Still, they said, the redirecting of informants is almost always done for more\nmundane, tactical reasons, never fully explained to the spy.\n\nHosseini said he continued to provide information to the CIA for another year. At one point\nhis CIA handler raised the idea of meeting his family, an offer Hosseini hoped would presage\nthe possibility of eventual resettlement in the United States.\n\nResettlement, however, is a rare reward. Washington allots the CIA only around 100 visas a\nyear to offer as a carrot to its spies throughout the world, three former intelligence officers\nsaid.\n\n“This involves enormous resources and operational planning and will be reserved for the star\nof the star sources,” said Pillar, the former CIA intelligence analyst.\n\nHosseini spent almost 10 years at Evin prison in Tehran, a lockup known for housing political\nprisoners and accused spies. Many face torture and execution, according to former\ndetainees and human rights groups.\n\n\n-----\n\nAlmost a decade there took its toll, Hosseini said. Years of confinement and extended torture\n– beatings, electrical shocks and isolation in rooms lighted around the clock – damaged his\nability to communicate, even with family, he said\n\n“When they ask me a question, I feel like I’m back in the interrogation room,” he said.\n\nIran’s government did not respond to requests for comment on the treatment of detainees.\n\nOut of prison for three years now, Hosseini, now 47, has lost his affluent lifestyle and many\nof his friends, whom he fears cooperated with Iranian security forces in his prosecution.\n\nOf the six former spies interviewed by Reuters, four remained in Iran after being released\nfrom jail, and two others are living as refugees, one in Turkey, the other in Switzerland. All\nsay they have been unable to obtain assistance from the United States as they struggle to\nrebuild their lives.\n\nMost haven’t been able to find a way to ask.\n\n“At the end of the day, we have to hope that they and their family are thrilled to be\nalive.”\n\nHosseini said the CIA did provide him two ways to reach out for help if he got into trouble.\nOne method was to dial a secret U.S.-based number from somewhere outside of Iran, giving\na passcode to an operator. The second was to contact a regional security officer at a\nconsulate anywhere in the world and ask for help. Reuters confirmed these are two methods\nthe CIA offers to informants to reach out for assistance.\n\nBy the time Hosseini left prison in 2019, he no longer remembered the secret number. And\nhe feared repercussions if Iranian intelligence discovered him walking into a U.S. consulate\nto reinitiate contact following his espionage conviction.\n\nAll six former spies interviewed by Reuters said that, given their sacrifices, they had hoped\nthe U.S. government would find a way to contact them and offer help building new lives in\nAmerica or another country. Years after release, they are still waiting.\n\n\n-----\n\nA view of the main entrance of CIA headquarters in Langley, Virginia. Sloppy tradecraft has\nendangered the agency’s mission, as dozens of agents in countries including Iran, China and\nRussia have been exposed in recent years. REUTERS/Kevin Lamarque\nBut from the CIA’s perspective, there’s often enormous risk and little upside in reconnecting\nwith a captured spy in Iran, former U.S. intelligence officials said. Detainees lucky enough to\nescape execution, they said, could emerge from prison as double agents. Those that aren’t\nwould likely be monitored closely by Iranian authorities for any potential missteps.\n\n“We have to ask, what is the best way to keep this guy alive, and sometimes the best answer\nis to leave them alone,” said a former senior intelligence officer who was involved in the CIA’s\nresponse to the compromise of its spies in Iran. “At the end of the day, we have to hope that\nthey and their family are thrilled to be alive.”\n\nHosseini feels differently. He now supports his family on less than $250 a month, one-tenth\nhis old earnings, cobbled together from part-time information technology support work. Some\nengineering firms initially hired Hosseini, he said, only to fire him days later, upon completion\nof his background screening.\n\nOnce fiercely opinionated, he is now careful to censor his views around friends, fearful that\nhe will be reported. Many mornings he wakes up gripped with anxiety at the prospect of\nrearrest.\n\n“I can’t imagine any future,” he said.\n\n**America’s Throwaway Spies**\n\n\n-----\n\nBy Joel Schectman and Bozorgmehr Sharafedin\n\nPhoto editing: Corinne Perkins\n\nGraphics and art direction: John Emerson\n\nEdited by Marla Dickerson, Ronnie Greene and Kieran Murray\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-29 - America’s Throwaway Spies How the CIA failed Iranian informants in its secret war with Tehran.pdf"
    ],
    "report_names": [
        "2022-09-29 - America’s Throwaway Spies How the CIA failed Iranian informants in its secret war with Tehran.pdf"
    ],
    "threat_actors": [
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535773,
    "ts_updated_at": 1743041296,
    "ts_creation_date": 1664713609,
    "ts_modification_date": 1664713609,
    "files": {
        "pdf": "https://archive.orkl.eu/9e82d219245c51fae819d31f86e2c68e20dc0f60.pdf",
        "text": "https://archive.orkl.eu/9e82d219245c51fae819d31f86e2c68e20dc0f60.txt",
        "img": "https://archive.orkl.eu/9e82d219245c51fae819d31f86e2c68e20dc0f60.jpg"
    }
}