{
    "id": "c4b33c73-4ff7-42cd-bbb0-c548b0309e86",
    "created_at": "2022-12-10T18:58:38.635509Z",
    "updated_at": "2025-03-27T02:05:53.933286Z",
    "deleted_at": null,
    "sha1_hash": "ec576eb1d0dced61e61f2fe91700d2be3f1a7a2b",
    "title": "PFD-20-027-Visa Security Alert-Baka JavaScript Skimmer",
    "authors": "",
    "file_creation_date": "2020-08-27T09:22:12Z",
    "file_modification_date": "2020-09-18T11:25:42Z",
    "file_size": 925172,
    "plain_text": "Visa Payment Fraud Disruption\n\n# Visa Security Alert AUGUST 2020\n\n ‘Baka’ JavaScript Skimmer Identified\n\n**Distribution: Public**\n\n# Summary\n\nIn February 2020, Visa Payment Fraud Disruption (PFD), using the [eCommerce Threat Disruption](https://usa.visa.com/dam/VCOM/regional/na/us/run-your-business/documents/ecommerce-threat-disruption-case-study-final.pdf) (eTD)\ncapability, identified a previously unknown ecommerce skimmer, and named the skimmer ‘Baka’. PFD\nmade the discovery while analyzing a command and control (C2) server that was previously observed\nhosting the ImageID skimmer variant. PFD’s investigation revealed seven C2 servers hosting the Baka\nskimming kit. While the skimmer itself is basic\nand contains the expected features offered by\nmany ecommerce skimming kits (e.g. data _A skimming kit consists of an_\nexfiltration using image requests and _administration panel, exfiltration gateway,_\nconfigurable target form fields), the Baka _skimming script generator._\nskimming kit’s advanced design indicates it\nwas created by a skilled developer.\n\nThe most compelling components of this kit are the unique loader and obfuscation method. The skimmer\nloads dynamically to avoid static malware scanners and uses unique encryption parameters for each victim\nto obfuscate the malicious code. PFD assesses that this skimmer variant avoids detection and analysis by\nremoving itself from memory when it detects the possibility of dynamic analysis with Developer Tools or\nwhen data has been successfully exfiltrated.\n\nPFD identified this unique skimmer on several merchant websites across multiple global regions using\nVisa’s eTD capability, which analyzes and detects threats targeting eCommerce merchants.\n\nPFD-20-027 Visa Public 1\n\n\n## A skimming kit consists of an administration panel, exfiltration gateway, skimming script generator.\n\n\n-----\n\nVisa Payment Fraud Disruption\n\n# Malware Loader\n\nThe Baka loader works by dynamically adding a script tag to the current page (Figure 1). The new script tag\nloads a remote JavaScript file, the URL of which is stored encrypted in the loader script (Figure 2). The\nattacker can change the URL for each victim.\n\n_Figure 1 - Malicious loader decrypts and executes the JavaScript loaded from the attacker’s server_\n\n_Figure 2 - Function to load JavaScript on a page_\n\nPFD-20-027 Visa Public 2\n\n\n_Figure 2 - Function to load JavaScript on a page_\n\n\n-----\n\nVisa Payment Fraud Disruption\n\nWhen a customer visits the merchant’s checkout page, the loader executes the following steps to retrieve\nand execute the malicious skimming code:\n\n1. Decrypt the hardcoded C2 URL (Figure 3) using a hardcoded key (Figure 4).\n\n_Figure 3 - Encrypted C2 URL_\n\n_Figure 4 - C2 URL Decryption Key_\n\n2. Generate a random number to send to the C2 URL for skimming code (e.g.\nhttps://example[.]com/skimmer.js?q=0.123456890 where https://example[.]com/skimmer.js is the C2\nURL and “123456890” is the random number. The string “?q=0.” is hardcoded in the loader).\n\n3. The skimmer C2 returns a small piece of JavaScript that sets a variable named _scriptCallback to the\nencrypted C2 URL that receives the request (i.e. [https://example[.]com/skimmer.js?q=0.123456890).](https://example%5B.%5Dcom/skimmer.js?q=0.123456890)\nThis return value is decrypted and loads a second time. The C2 server responds to the second request\nwith the encrypted skimming code (Figure 5).\n\n_Figure 5 - Encrypted Skimming Code_\n\n4. The loader then decrypts the skimming code and executes it in memory. The skimming code is never\npresent on the merchant’s server or saved to the customer’s computer.\n\nPFD-20-027 Visa Public 3\n\n\n-----\n\nVisa Payment Fraud Disruption\n\n# Skimming Malware\n\nThe skimming payload decrypts to JavaScript written to resemble code that would be used to render pages\ndynamically. The same encryption method as seen with the loader is used for the payload. Once executed,\nthe skimmer captures the payment data from the checkout form. When the skimmer is first loaded, it runs an\ninitialization function that schedules five operations to run:\n\n1. Generate a decryption function to decrypt the list of fields from which the skimmer will steal data\n(Figure 6).\n\n_Figure 6 - Skimmer Initialization_\n\n2. Skim the targeted fields every 100 milliseconds. When the attacker generates the skimming script\nfor a victim, they specify which fields are targeted (Figure 7). This list of field names decrypts\non-demand every 100ms when the skimmer runs. This function sets a flag called ‘this.rendered’ to\nindicate that data has been captured and stored in memory for exfiltration.\n\n3. Check if the skimmer found data (e.g. ‘this.rendered’ is True) every 100 milliseconds. This function\nthen calls for data exfiltration and sets a flag called ‘this.load’ indicating the skimmer successfully\nexfiltrated data.\n\n_Figure 7 - Encrypted list of field names for the skimmer to target_\n\n4. Check if the script should send data to the exfiltration gateway every 3 seconds. If the captured\ndata flag is set, the exfiltration gateway URL is decrypted using the current victim merchant’s\ndomain name as the key. The script then encodes the skimmed data into the GET parameters of the\nexfiltration URL. This URL resembles a link to an image, but no image exists at the location. The\nmalware then adds an image tag that links the exfiltration URL to the merchant’s webpage\nresulting in a request being sent to the malicious URL with the stolen data attached and removes it\nafter 3 seconds to avoid detection (Figure 8).\n\nPFD-20-027 Visa Public 4\n\n\n_Figure 6 - Skimmer Initialization_\n\n\n-----\n\nVisa Payment Fraud Disruption\n\n_Figure 7 - Exfiltration code_\n\n5. The last operation that is scheduled is a clean-up function. If data is exfiltrated, the clean-up\nfunction removes the entire skimming code from memory to avoid detection (Figure 9).\n\n_Figure 8 - Clean-up Function_\n\nPFD-20-027 Visa Public 5\n\n\n_Figure 8 - Clean-up Function_\n\n\n-----\n\nVisa Payment Fraud Disruption\n\n# Unique Obfuscation\n\nTo further prevent detection, Baka uses an XOR cipher to encrypt hard-coded values and obfuscate the\nskimming code delivered by the C2. While the use of an XOR cipher is not new, this is the first time Visa\nhas observed its use in JavaScript skimming malware. The developer of this malware kit uses the same\ncipher function in the loader and the skimmer. Figure 10 shows the decryption function from one of the\nskimmer payloads. The displayed code creates a decryption function primed with a supplied key. The\nmalware uses various values throughout, including the current domain the malware is running on, the\nrandom number generated in the loader, and the hardcoded value, “preProcessingPage”. The returned\ndecryption function expects a hexadecimal string as input and works as follows:\n\n1. The decryption function splits the string into a list of two character strings\n2. The function then parses each two character string as a hexadecimal number and\nconverts it into an integer\n3. The resulting integers are decrypted using the key supplied when creating the\ndecryption function\n\n4. Finally, the function converts the integers to characters, resulting in the original\nplaintext\n\n_Figure 9 – XOR Cipher_\n\n# Indicators of Compromise\n\nVisa observed the following domain names hosting the Baka skimmer.\n\n**Domain Names** jquery-cycle[.]com\n\nb-metric[.]com\n\napienclave[.]com\n\nquicdn[.]com\n\napisquere[.]com\n\nordercheck[.]online\n\npridecdn[.]com\n\nPFD-20-027 Visa Public 6\n\n\n-----\n\nVisa Payment Fraud Disruption\n\n# Best practices and mitigation measures\n\n    - **Institute recurring checks in eCommerce environments for communications with the C2s.**\n\n    - **Ensure familiarity and vigilance with code integrated into eCommerce environments via**\nservice providers.\n\n    - **Closely vet utilized Content Delivery Networks (CDN) and other third-party resources.**\n\n    - **Regularly scan and test eCommerce sites for vulnerabilities or malware. Hire a trusted**\nprofessional or service provider with a reputation of security to secure the eCommerce\nenvironment. Ask questions and require a thorough report. Trust, but verify the steps taken\nby the company you hire.\n\n    - **Regularly ensure shopping cart, other services, and all software are upgraded or patched**\nto the latest versions to keep attackers out. Set up a Web Application Firewall to block\nsuspicious and malicious requests from reaching the website. There are options that are\nfree, simple to use, and practical for small merchants.\n\n    - **Limit access to the administrative portal and accounts to those who need them.**\n\n    - **Require strong administrative passwords (use a password manager for best results) and**\nenable two-factor authentication.\n\n    - **Consider using a fully hosted checkout solution where customers enter their payment**\ndetails on another webpage hosted by that checkout solution, separate from the merchant’s\nsite. This is the most secure way to protect the merchant and their customers from\neCommerce skimming malware.\n\n    - **Implement Best Practices for Securing eCommerce as outlined by the** [PCI Security](https://www.pcisecuritystandards.org/pdfs/best_practices_securing_ecommerce.pdf)\n[Standards Council.](https://www.pcisecuritystandards.org/pdfs/best_practices_securing_ecommerce.pdf)\n\n    - **Refer to Visa’s** [What to do if Compromised (WTDIC) document,](https://usa.visa.com/dam/VCOM/download/merchants/cisp-what-to-do-if-compromised.pdf) published October 2019.\n\n**_Disclaimer:_**\n_This report is intended for informational purposes only and should not be relied upon for operational, marketing, legal,_\n_technical, tax, financial or other advice. Visa is not responsible for your use of the information contained in this report_\n_(including errors, omissions, or non-timeliness of any kind) or any assumptions or conclusions you may draw from it._\n_All Visa Payment Fraud Disruption Situational Intelligence Assessment content is provided for the intended recipient_\n_only, and on a need-to-know basis. PFD reporting and intelligence are intended solely for the internal use of the_\n_individual and organization to which they are addressed. Dissemination or redistribution of PFD products without_\n_express permission is strictly prohibited._\n\nPFD-20-027 Visa Public 7\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://usa.visa.com/content/dam/VCOM/global/support-legal/documents/visa-security-alert-baka-javascript-skimmer.pdf",
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-20 - ‘Baka’ JavaScript Skimmer Identified.pdf"
    ],
    "report_names": [
        "visa-security-alert-baka-javascript-skimmer.pdf",
        "2020-08-20 - ‘Baka’ JavaScript Skimmer Identified.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1670698718,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1598520132,
    "ts_modification_date": 1600428342,
    "files": {
        "pdf": "https://archive.orkl.eu/ec576eb1d0dced61e61f2fe91700d2be3f1a7a2b.pdf",
        "text": "https://archive.orkl.eu/ec576eb1d0dced61e61f2fe91700d2be3f1a7a2b.txt",
        "img": "https://archive.orkl.eu/ec576eb1d0dced61e61f2fe91700d2be3f1a7a2b.jpg"
    }
}