{
    "id": "c4e31ab4-4852-4885-af98-c99ea530acf2",
    "created_at": "2023-01-12T14:59:50.923516Z",
    "updated_at": "2025-03-27T02:06:09.712313Z",
    "deleted_at": null,
    "sha1_hash": "8cdfd35777d54a0b1e1f5b5958d819aa292fea11",
    "title": "2020-01-22 - WannaMine - Même les cybercriminels veulent avoir leur mot à dire sur le Brexit !",
    "authors": "",
    "file_creation_date": "2022-05-28T00:46:13Z",
    "file_modification_date": "2022-05-28T00:46:13Z",
    "file_size": 312235,
    "plain_text": "# WannaMine : Même les cybercriminels veulent avoir leur mot à dire sur le Brexit !\n\n**[news.sophos.com/fr-fr/2020/01/22/wannamine-meme-cybercriminels-veulent-avoir-mot-a-dire-sur-brexit/](https://news.sophos.com/fr-fr/2020/01/22/wannamine-meme-cybercriminels-veulent-avoir-mot-a-dire-sur-brexit/)**\n\nSophos France January 22, 2020\n\nEt il semble que bien plus de personnes que l’on ne pourrait s’imaginer soient fascinées ou\naient des idées bien arrêtées sur le Brexit !\n\nEn effet, les créateurs de malwares semblent vouloir se faire entendre à ce sujet …\n\n[A une époque bien révolue où les cybercriminels ne savaient pas encore comment faire](https://news.sophos.com/fr-fr/cybercriminalite/)\nvéritablement de l’argent avec les malwares, ils avaient tendance à laisser les virus se\ndéchaîner pour diverses raisons, à des fins politiques, pour encourager leurs équipes\npréférées, pour causer de sérieux dégâts au sein de la société, pour se vanter auprès d’amis\nimaginaires, pour célébrer des évènements et des anniversaires et, dans un cas tristement\n[célèbre, pour nous dire à tous : “Beer and tequila forever!“.](https://nakedsecurity.sophos.com/2015/07/31/beer-and-tequila-forever-sophosretroweek-looks-at-old-school-malware/?cmp=701j0000001YAKMAA4&utm_source=SophosFrance&utm_medium=BlogLink&utm_campaign=BlogFrance)\n\nParfois, les messages étaient évidents, tels que des boîtes contextuelles qui apparaissaient,\nla lecture de fichiers audio, des fichiers mis à la poubelle à des jours bien précis.\n\nEt parfois, ils étaient cachés, enfouis comme un trésor dans le code du malware lui-même,\nde sorte que si vous ne saviez pas où ni comment les chercher, vous n’aviez aucune chance\nde percer leur secret.\n\nEh bien, l’art du commentaire politique caché dans les malwares n’est pas mort !\n\n\n-----\n\nDans un certain nombre d attaques récentes, les SophosLabs ont rencontré une variante de\n**la famille de malware WannaMine qui était suffisamment similaire aux autres échantillons**\nde cette même famille pour deviner ces intentions, mais avec un changement sournois et\ninattendu juste à la fin du script principal de ce dernier.\n\n## La famille de malware WannaMine\n\nVous vous souvenez peut-être de WannaMine quand il est apparu pour la première fois : il\n[doit son nom au fait qu’il était capable de se propager de manière virale comme le faisait le](https://nakedsecurity.sophos.com/2018/01/31/what-are-wannamine-attacks-and-how-do-i-avoid-them/?cmp=701j0000001YAKMAA4&utm_source=SophosFrance&utm_medium=BlogLink&utm_campaign=BlogFrance)\n_ransomware WannaCry, ce qui lui a donné la partie Wanna au début, mais au lieu de_\ndiffuser un ransomware, il vous proposait un logiciel de minage de cryptomonnaie à la place,\nd’où le suffixe -Mine dans le nom.\n\nEn fait, la famille de malware WannaMine fait bien plus que du simple cryptojacking, bien\nque ce soit effectivement le code de minage qui accélère votre CPU, ralentit votre ordinateur,\nutilise massivement votre électricité, fait chauffer le système et garde les cryptocoins pour\nlui, ce qui ne devrait pas manquer d’attirer votre attention.\n\nContrairement aux ransomwares, qui veulent que vous sachiez qu’ils sont bien là pour que\nvous puissiez vous concentrer sur le paiement de la rançon afin de récupérer vos fichiers,\nles mineurs préfèrent rester inaperçus, car les sommes d’argent gagnées par les escrocs\nsont directement proportionnelles à leur durée de vie dans votre système.\n\nMais le coinmining est, en général, une tâche très gourmande en CPU qui a un réel impact\nsur votre système, par exemple au niveau de la batterie de votre ordinateur portable, de la\ntempérature de votre CPU, de votre consommation d’électricité et de la vitesse avec laquelle\ntous vos autres logiciels fonctionnent.\n\nNéanmoins, pendant qu’il est occupé, certaines variantes du malware WannaMine essaient\ntout de même de faire un tas d’autres choses en arrière-plan, telles que :\n\nSe faufiler dans la mémoire à la recherche d’identifiants pour accéder à des comptes\ndéjà connectés.\nCracker les mots de passe d’autres ordinateurs du réseau pour permettre de se\npropager davantage.\nRechercher des ordinateurs sur le réseau qui peuvent être compromis en utilisant\nl’exploit ETERNALBLUE.\nDésactiver les paramètres de sécurité de Windows.\nLancer des attaques DoS (déni de service).\nRechercher des mises à jour pour pouvoir récupérer la dernière version du malware.\n\n## Prêt pour attaquer\n\n\n-----\n\nLes dernières lignes du script principal configurent la partie centrale de l attaque, comme suit\n:\n```\n$mimi = ([WmiClass] 'root\\default:Window_Core_Flush_Cach').Properties['mimi'].Value\n$a, $NTLM= Get-creds $mimi $mimi\n$ipsu = ([WmiClass] 'root\\default:Window_Core_Flush_Cach').Properties['ipsu'].Value\n$i17 = ([WmiClass] 'root\\default:Window_Core_Flush_Cach').Properties['i17'].Value\n$scba= ([WmiClass] 'root\\default:Window_Core_Flush_Cach').Properties['sc'].Value\n[byte[]]$sc=[System.Convert]::FromBase64String($scba)\n\n```\nLe code PowerShell ci-dessus crée de nombreuses variables de données qui incluent un\nmélange de données et de code.\n\nPar exemple, la variable `$mimi possède une copie en mémoire du célèbre programme`\n_Mimikatz, un outil de récupération et de craquage de mot de passe couramment utilisé par_\nles cybercriminels une fois qu’ils sont à l’intérieur de votre réseau.\n\nLa variable `$scba est un outil de téléchargement qui peut être utilisé pour récupérer de`\nnouveaux fichiers; ba fait référence à “codé en base64“, car le contenu de `$scba est`\nimmédiatement décodé en base64 pour produire `$sc, une autre copie en mémoire d’un`\nprogramme qui, dans un monde conventionnel, serait enregistré sur le disque en tant que\nfichier .EXE standard.\n\nVous remarquerez également que les données sont extraites à l’aide de WMI, abréviation de\n_Windows Management Instrumentation, signifiant ainsi que le code et les données utilisés_\npar ce malware sont enfouis dans la base de données Windows WBEM (abréviation de\n_Web-Based Enterprise Management)._\n\nEn d’autres termes, même si les composants malveillants sont, à proprement parler,\nenregistrés sur le disque, ils ne sont pas visibles en tant que fichiers standards qu’un\nprogramme normal pourrait lire et analyser : la base de données WBEM est très similaire au\nregistre Windows, bien que complètement différente.\n\nNB : Au cas où, sachez que vos fichiers de base de données WMI locaux se situent\ngénéralement dans un répertoire appelé `C:\\Windows\\System32\\Wbem\\Repository, mais`\nsoyez très prudent si vous prévoyez de les manipuler manuellement !\n\n## Montrez-moi le Brexit !\n\nAlors, où est le Brexit ?\n\nDans la dernière ligne du script du malware, le créateur du virus appelle sa fonction\nprincipale “do-the-bad-stuff“.\n\nPlus tôt dans le code, ils étaient plutôt ennuyeux, avec des noms de fonction tels que :\n\n\n-----\n\n```\nRunDDOS\nKillBot\n\n```\nMais la dernière salve dans celui-ci est une fonction appelée comme suit :\n```\nInvoke-Brexit -scccccc $sc -ipsu $ipsu -i17 $i17 -nic $nic -a $a -NTLM $NTLM\n\n```\nCe que nous ne pouvons pas vous dire précisément, c’est si le créateur du virus a incorporé\nun message secret pour laisser entendre que le Brexit était une bonne chose, et si nous\ndevrions continuer…\n\n… ou bien s’il voulait que ce code soit une métaphore pour nous inviter à en déduire que\n_l’invocation du Brexit est quelque chose qu’il valait mieux éviter._\n\nNous n’allons pas nous lancer dans l’expression d’une opinion publique sur le Brexit, mais\nnous pouvons vous dire par contre que le Brexit du créateur du virus n’est certainement pas\ncelui que vous souhaitez !\n\n[Billet inspiré de Brexit – even cybercriminals want to have their say…, sur Sophos](https://nakedsecurity.sophos.com/2019/12/12/brexit-even-cybercriminals-want-to-have-their-say/?cmp=701j0000001YAKMAA4&utm_source=SophosFrance&utm_medium=BlogLink&utm_campaign=BlogFrance)\nnakedsecurity.\n\n\n-----",
    "language": "FR",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-22 - WannaMine - Même les cybercriminels veulent avoir leur mot à dire sur le Brexit !.pdf"
    ],
    "report_names": [
        "2020-01-22 - WannaMine - Même les cybercriminels veulent avoir leur mot à dire sur le Brexit !.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535590,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653698773,
    "ts_modification_date": 1653698773,
    "files": {
        "pdf": "https://archive.orkl.eu/8cdfd35777d54a0b1e1f5b5958d819aa292fea11.pdf",
        "text": "https://archive.orkl.eu/8cdfd35777d54a0b1e1f5b5958d819aa292fea11.txt",
        "img": "https://archive.orkl.eu/8cdfd35777d54a0b1e1f5b5958d819aa292fea11.jpg"
    }
}