{
    "id": "c5bc25d5-27bf-4216-8e3d-93c81a49fc20",
    "created_at": "2023-01-12T15:06:29.547185Z",
    "updated_at": "2025-03-27T02:05:52.152486Z",
    "deleted_at": null,
    "sha1_hash": "8bd56781197a1b1e91481396bdae709803918e08",
    "title": "2018-01-12 - Sonja Analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T17:37:26Z",
    "file_modification_date": "2022-05-28T17:37:26Z",
    "file_size": 862918,
    "plain_text": "# Snojan Analysis\n\n**[medium.com/@jacob16682/snojan-analysis-bb3982fb1bb9](https://medium.com/@jacob16682/snojan-analysis-bb3982fb1bb9)**\n\nJacob Pimental May 11, 2019\n\n[Jacob Pimental](https://medium.com/?source=post_page-----bb3982fb1bb9--------------------------------)\n\nJan 11, 2018\n\n\n7 min read\n\nSo this is my analysis on the snojan malware. My goal for my articles is to write about\ndifferent malware samples that I collect in my honeypot. I hate finding a sample and looking\nup analyses on it only to find that nobody has taken the time to really look at it, so this is my\nremedy for that.\n\nI collected this sample from my Dionaea Honeypot server. If you don’t know what Dionaea\nHoneypot is, it is essentially a server that mimics vulnerable processes and applications in\nhopes of catching malware. It mainly catches internet worms that target random IP\naddresses, recently it has gotten a lot of Wannacry ransomware samples.\n\n[The first thing I do when analyzing a new malware sample is give it to VirusTotal in order to](https://www.virustotal.com/#/file/1c678ac8a1b77966c948ed5c988baaf47dd5a983d5c4e0f8befffe8c45f51a95/details)\nsee what it may be and some basic information on it. Some of the vendors marked it as\n“snojan” so that’s the name I refer to it as. VirusTotal also tells us that the creation time was\nMay 5th 2017, but that could easily be spoofed. If it is true, then this is not the newest\nmalware out there, but still interesting nonetheless.\n\nThe next thing I do is use rabin2, which comes with radare2, to see what type of file this is. If\n[you don’t know what radare2 or rabin2 are you can read my other articles where I explain](https://medium.com/@jacob16682/reverse-engineering-using-radare2-588775ea38d5)\nwhat they are and how to use them.\n```\n$ rabin2 -I 867e7c4917795399040f367575550ae4 arch   x86binsz  13315bintype \npebits   32canary  falseclass  PE32cmp.csum 0x00006b4dcompiled Fri May 5\n07:02:08 2017crypto  falseendian  littlehavecode truehdr.csum 0x0000b009linenum \ntruelsyms  truemachine i386maxopsz 16minopsz 1nx    falseos   \nwindowsoverlay truepcalign 0pic   falserelocs  falsesigned  falsestatic \nfalsestripped falsesubsys  Windows CUIva    true$\n\n```\nFrom this we can see that this is a Windows Portable Executable (PE) file that is 32 bits\n(PE32) and uses a Command Line Interface (CUI) rather than a graphical interface (GUI). If\nwe run the file command in linux then we can see more specifically what type of file this is.\n\n\n-----\n\n```\n$ file 867e7c4917795399040f367575550ae4 867e7c4917795399040f367575550ae4: PE32\nexecutable (DLL) (console) Intel 80386 (stripped to external PDB), for MS Windows$\n\n```\nWe can see that this is a Windows DLL file. This means it must have some exports that it\nwants us to run it with. Rabin2 can help us identify these exports.\n```\n$ rabin2 -E 867e7c4917795399040f367575550ae4 [Exports]vaddr=0x6d981760\npaddr=0x00000b60 ord=000 fwd=NONE sz=0 bind=GLOBAL type=FUNC name=aaa.dll_DllMain@121\nexports$\n\n```\nSo this dll exports the function DllMain@12. We can assume that the dll is probably called\nusing the windows rundll command and uses this function as a parameter. We can also\nassume that the name of the file is aaa.dll rather than the md5sum\n867e7c4917795399040f367575550ae4.\n\nNow that we have some basic information about the file, we can pop it into Radare2 and see\nwhat the assembly code looks like. I like to use the “afll” command after having radare2\nanalyze the binary because that shows all of the functions in a colored graph. We can see an\ninteresting function at 0x6d981760.\n\nThis is the same function as the export we saw earlier. We should probably investigate what\nit is doing.\n\n\n-----\n\nSo it looks like it compares an argument to the number 1, if the statement is false then we\nreturn and most likely exit the program. If the statement is true, however, then we call the\n[CreateThread function with fcn.6d981710 as a parameter. This would create a thread that](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682453(v=vs.85).aspx)\nwould run whatever fcn.6d981710 does. It then calls that mystery function and exits. The\nnext step would be to check out that mystery function and see what it does.\n\n\n-----\n\n[This function calls the WSAStartup function which starts the processes necessary to use the](https://msdn.microsoft.com/en-us/library/windows/desktop/ms742213(v=vs.85).aspx)\nSocket library for Windows. This tells us that the dll must be connecting to some server via\nan open port. If WSAStartup fails, it pushes the message “WSAStartup failed: %d\\n” along\nwith the return value of WSAStartup to the stack and calls the function fcn.6d982600. If we\nevaluate this function we can see that it is a pointer to printf. Sometimes radare2 and other\ndisassemblers can’t identify basic functions like printf. It is standard and is not really\nimportant right now. If we wanted to change the name of the function, we would just seek to\nthe address and use the command\n```\nafn printf\n\n```\nIf the process succeeds then it calls the function fcn.6d9814c0.\n\n\n-----\n\nWe can see that this function creates a socket. If it succeeded in the creation of the socket\nthen it gives it the ip address 62.210.204.58 and the port 443 and connects. If not then an\nerror is outputted via printf again and the program exits. We would be able to use this ip\naddress and port as a network-based identifier to detect this malware.\n\n\n-----\n\nIf our socket is able to connect to the server then it will create a new file called 3165616.exe\non the C: drive of the infected computer, which could be used as a host-based identifier of\nthis malware. If it fails to connect then we get another error. After this the program loops\nthrough the data sent back to it by the server and puts that into the executable file that was\ncreated. It then goes ahead and runs that executable.\n\nMinigraph illustrating the loop that populates the executable file with data\n\nMinigraph illustrating the call to WinExec on the created executable\nWe can assume that this dll is just a dropper for the real trojan that will be installed on the\nsystem. At the time of my initial analysis I was able to retrieve the dropped executable from\nthe server with a curl command, as of the date of writing it seems the malware author has\nchanged servers or shut it down altogether. I was able to run the program in a windows\nenvironment before the server went down to analyze the events.\n\n\n-----\n\nFirst you can see the packet that was returned from the server at 62.210.204.58, which\nconfirms our suspicion that it dropped a windows binary. For those unfamiliar with Magic in\nbinaries, the first MZ that is highlighted in the packet capture means that this is a Windows\nBinary. We can further confirm this by the string “This program cannot be run in DOS mode”\nwhich is common in Windows applications. We can also see PE which means “Portable\nExecutable”.\n\nAfter this executable is downloaded and ran it reaches out to 3click.click/install/start which\ngave the executable commands. It created wininit.exe, which was located in the folder\nC:\\WINDOWS\\Fonts (which I found interesting). The process would retrieve data from the\nsite icanhazip.com in order to get my public ip address, it would then report this to the\nmalware author.\n\nPacket Capture showing the conversation between icanhazip.com and my computer\n\n\n-----\n\nIt would also close out of process explorer if it found it open. On top of that it would connect\nto the 3click.click/report.lua file which was a reporting system for the malware to\ncommunicate with the author about my computer. I didn’t take too much time analyzing the\ndropped binary. It is a basic trojan that makes it very obvious that it is in the system by\nclosing out of applications and displaying command prompts as it goes.\n\nOverall, this is a very basic dropper and the first “real” malware sample that I have analyzed\nso if I missed anything or there was a better way to go about analyzing then please feel free\nto reach out to me at my [Twitter or my](https://twitter.com/Jacob_Pimental) [LinkedIn.](https://www.linkedin.com/in/jacobpimental/)\n\n[Here is also the Hybrid-Analysis of this file. It gives a lot of info as well. Although for this](https://www.reverse.it/sample/1c678ac8a1b77966c948ed5c988baaf47dd5a983d5c4e0f8befffe8c45f51a95?environmentId=100)\narticle I ran the malware myself on a Windows XP VM.\n\nIf you like this article you can view more on my updated blog at\n[https://goggleheadedhacker.com/1](https://goggleheadedhacker.com/1)\n\nThanks for reading and happy reversing!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-12 - Sonja Analysis.pdf"
    ],
    "report_names": [
        "2018-01-12 - Sonja Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535989,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653759446,
    "ts_modification_date": 1653759446,
    "files": {
        "pdf": "https://archive.orkl.eu/8bd56781197a1b1e91481396bdae709803918e08.pdf",
        "text": "https://archive.orkl.eu/8bd56781197a1b1e91481396bdae709803918e08.txt",
        "img": "https://archive.orkl.eu/8bd56781197a1b1e91481396bdae709803918e08.jpg"
    }
}