{
    "id": "c5c011d3-cbab-446f-909b-6c6fe20d0631",
    "created_at": "2023-01-12T15:08:35.942486Z",
    "updated_at": "2025-03-27T02:16:26.254024Z",
    "deleted_at": null,
    "sha1_hash": "b6b81ac0d51fa69c10a42482fa5264e7ccb660c7",
    "title": "2015-11-02 - Shifu – the rise of a self-destructive banking trojan",
    "authors": "",
    "file_creation_date": "2022-05-28T03:38:20Z",
    "file_modification_date": "2022-05-28T03:38:20Z",
    "file_size": 2127939,
    "plain_text": "# Shifu – the rise of a self-destructive banking trojan\n\n**[virusbulletin.com/virusbulletin/2015/11/shifu-rise-self-destructive-banking-trojan](https://www.virusbulletin.com/virusbulletin/2015/11/shifu-rise-self-destructive-banking-trojan)**\n\n2015-11-02\n\n### Floser Bacurio Jr\n\nFortinet, Singapore\n\n### Wayne Low\n\nFortinet, Singapore Editor: Martijn Grooten\n**Abstract**\n\nThe banking trojan Shifu appears to inherit some of its features from several other well-known banking trojans. Floser Bacurio\nand Wayne Low decided to take a close look at one of its droppers.\n\nFollowing takedown operations against various notorious banking trojans, including Zeus, Dridex and Gozi, a freshly brewed\nbanking trojan, Shifu, has recently made the news; we believe it inherits some features from the earlier well-known banking\ntrojans. We decided to dive deeper into one of its droppers (MD5: E60F72FFA76386079F2645BE2ED84E53; SHA1:\n963BFC778F94FE190FDD1DD66284E9BC9DD2BED6). A number of features caught our eye when looking at its underlying\ncode.\n\n## Dropper\n\n### Exploiting CVE-2015-0003\n\nOn our first look at the dropper, we observed that the dropper code is not heavily obfuscated, although most of the strings are\nencoded; it turns out that the strings can easily be decoded using a simple XOR operation.\n\nAt the entry point, we can immediately tell that Shifu attempts to exploit a local privilege escalation vulnerability. The\nvulnerability was assigned the CVE number CVE-2015-0003 in February 2015 and can be used to elevate the privilege of a\nprocess to system privilege on Windows 7 and above. The exploit code can easily be found on the Internet, so it is not\nsurprising that the malware attempts to exploit this (patched) vulnerability. This means that the malware may not execute\nproperly without sufficient privileges and also serves as a reminder that Windows users should always install the latest\n_Windows updates._\n\nAfter performing the local privilege escalation routine, we arrive at the code where the malware will extract the payloads\nembedded in its binary. The payloads consist of two aPLib compressed blobs for 32-bit and 64-bit platforms, which is a very\ncommon technique used by malware nowadays. The use of the aPLib compressor suggests that Shifu might have adopted\nsome of the techniques used by malware like Zeus (aka Zbot) or Rovnix (and thus Carberp), for which the source code has\nbeen leaked.\n\n### Malware don’t like HIPS\n\nOne of the most notable things observed in the code injection routine is an attempt to obfuscate the MZPE header by\noverwriting random bytes in it. This action does not affect the execution of the payload since the payload code will be injected\ninto the memory of the remote process and will be executed directly in the context of the remote process via an asynchronous\nthread. The purpose of overwriting bytes in the MZPE header is to defeat behavioural analysis systems and HIPS technology\n– with a corrupted MZPE header, the sample does not look like a legitimate binary file and could thus bypass some trivial PE\nsignature checks.\n\n\n-----\n\n**Figure 1. Corrupting the MZPE header.**\n\n### Code obscuring\n\nAnalysing the decompressed buffer directly might result in an incorrect AddressOfEntryPoint as Shifu’s author has\nintentionally obfuscated the entry point address by XORing with a widely used XOR key, 0x31337, throughout the program\nregardless of the dropper or payload. Shifu will first try injecting the payload code into explorer.exe. When the code injection\ninto explorer.exe fails, to play it safe, Shifu’s author implements an additional routine which will create or spawn a random\n_Windows process found in C:\\Windows\\system32, or in C:\\Windows\\syswow64 if it is a 64-bit platform. Under normal_\ncircumstances, most Windows executable files (for instance svchost.exe) can be executed, but will quit immediately when\ncalled by non-Windows services. In order to circumvent this behaviour, Shifu first creates a suspended Windows process and\nthen injects an infinite sleep, Sleep(-1), routine and executes it in the memory of the suspended process. After that, the\nsuspended process will be resumed and continue execution, but it will not quit immediately unless it is forced to exit explicitly.\nOnce the targeted process has been determined, Shifu will carry out another code injection routine to execute the payload via\nCreateRemoteThread or RtlCreateUserThread (Figure 2).\n\n\n-----\n\n**Figure 2. Remote code execution using CreateRemoteThread/RtlCreateUserThread.**\n\n### Anti-sandbox and anti-VM\n\nThere are many anti-sandbox and anti-VM detection techniques in the dropper, as is common in mal-ware nowadays. Some of\nthese checks have been documented in a McAfee blog post [1], so Table 1 lists some of the process names, as well as their\nhashes (computed by checking well-known process names using the Windows API function RtlComputeCrc32) that are\n‘blacklisted’ by Shifu. Shifu checks a list of active processes running on the machine, as well as the sample’s file name,\nagainst hard-coded CRC32 hashes in order to avoid the malware being analysed by a sandbox or by virtual machines that are\nbuilt to perform dynamic analysis of malware samples.\n\n**Process name** **CRC32 hash**\n\nvmwareuser.exe 0x99DD4432\n\nvmwaretray.exe 0x1F413C1F\n\nvboxservice.exe 0x64340DCE\n\nvboxtray.exe 0x63C54474\n\nwireshark.exe 0x77AE10F7\n\nprocmon.exe 0x5BA9B1FE\n\nprocexp.exe 0x3CE2BEF3\n\nfortitracer.exe 0x332FD095\n\nollydbg.exe 0xAF2015F2\n\npython.exe 0xD2EFC6C4\n\n\n-----\n\n**Process name** **CRC32 hash**\n\nsysanalyzer.exe 0x4231F0AD\n\nsniff_hit.exe 0xD20981E0\n\njoeboxserver.exe 0x2AAA273B\n\njoeboxcontrol.exe 0x777BE06C\n\n**Table 1. Process names that are ‘blacklisted’ by Shifu.**\n\nIt also employs a check against the file names shown in Table 2.\n\n**Dropper’s file name** **CRC32 hash**\n\nsample.exe 0xE84126B8\n\nmalware.exe 0x3C164BED\n\ntest.exe 0xC19DADCE\n\n**Table 2. File names that are checked.**\n\n## Payload\n\nOn analysing the decompressed payload using a disassembler, it turns out that we have landed at an invalid code entry point,\nas mentioned in the previous section, and the disassembler will complain that the import address table is corrupted. The\npayload cannot be analysed in a disassembler directly without first ‘fixing’ the file. We later realized that, besides the code\nentry point obfuscation, Shifu’s author has also deployed some other trivial tricks to the payload to mislead analysts:\n\nObfuscating the import table address – the original import table address can be restored by XORing with the key\n0x31337.\n\n\n-----\n\nObfuscating import function names (Figure 3 and Figure 4) the function names are encoded using the static XOR key\n0xFF. (In the Appendix, we provide a simple IDAPython script to fix the function names under IDA Pro.)\n\n\n-----\n\n**Figure 3. Obfuscated import function names.**\n\n\n-----\n\n**Figure 4. Shifu deobfuscating the import table address before loading the DLL by name.**\n\n[(Click here to view a larger version of Figure 4.)](https://www.virusbulletin.com/uploads/images/figures/2015/11/Shifu-4-large.jpg)\n\nShifu’s author also utilized multi-threading to add complexity to the malware and make dynamic analysis more challenging. On\nthe other hand, from a static analysis perspective, the malware’s encoding/encryption routine is insignificant and most of the\nstrings in the binary can trivially be decoded and fixed within IDA Pro with a few lines of code (Figure 5). However, some of the\nstrings, such as the command-and-control server name, are encrypted using RC4.\n\n**Figure 5. A simple script to decode the encoded string.**\n\n[(Click here to view a larger version of Figure 5.)](https://www.virusbulletin.com/uploads/images/figures/2015/11/Shifu-5-large.jpg)\n\n### Multiple process code injection\n\nBefore Shifu is able to carry out its wide range of information-stealing activities, it needs to make sure its payload code will be\ninjected into the relevant processes. When the payload is injected by the dropper, the very first thing it will do is traverse the\nrunning processes and transfer its code into any process that does not already contain it. In other words, all the active\nprocesses apart from the system processes will contain a copy of the payload code whenever the machine is infected.\n\nAfterwards, a named pipe will be created in order to allow communication between the payloads in different processes.\n\n### Comprehensive data theft features\n\n**Keylogger and screenshot capture**\n\nLooking into Shifu’s data theft features, we could see that the malware is equipped with some of the keylogging features found\nin traditional keyloggers, as well as having the ability to steal numerous banking credentials from the victim. Shifu also uses\nthe Windows API-hooking technique in order to steal other credentials. Table 3 shows a short summary of the hooked\n_Windows APIs along with their respective purposes._\n\n**Hooked Windows API** **Purpose**\n\nUser32!GetClipboardData Captures the ASCII and UNICODE text currently saved in the clipboard\nwindow\n\nUser32!TranslateMessage Captures the keyboard’s keystrokes\n\nUser32!GetMessageA/User32!GetMessageW The hook’s handler performs the same thing as the\nuser32!TranslateMessage hook’s handler\n\n**Table 3 Hooked Windows APIs and their purposes**\n\n\n-----\n\nUnder normal circumstances, these Windows API hooks should be able to capture the keystrokes on an infected machine.\nHowever, Shifu also tries to capture virtual keyboards, which are commonly used in Internet banking, by taking screenshots of\nthe infected machine whenever the malware detects a mouse click. It is also noteworthy that the virtual keyboard screen will\nonly be grabbed when the malware detects an opened screen with one of the following titles, all of which are used by Italian\nInternet banking websites:\n\nPassword\n\nTelemaco\n\nScelta e Login dispositivo\n\nTLQ Web\n\ndb Corporate Banking Web\n\nSecureStoreCSP - enter PIN\n\n**Certificate capture**\n\nShifu manipulates Windows API hooks in order to intercept the certificate password when a certificate is being imported to the\ncertificate store. All the certificate blob data and passwords found in the Crypt32!PFXImportCertStore API will be intercepted,\nunless the process contains the string ‘torrent’.\n\nThe imported public keys on the infected machine will also be captured. This is possible, using the Windows\nCrypt32!CertEnumSystemStore API, without having access to the private key.\n\nThese hooks may be useful to the attackers when the victim imports certificates using a Windows PGP client like Gpg4win;\nthe hook handlers could intercept the private key and certificate and save it to Shifu’s specified log directory as\n‘randomhexavalue_cert.pfx’. Furthermore, it could be useful if the attackers want to access the cryptocurrency wallet\ndownloaded from the victim machine, which is encrypted using an RSA key pair.\n\nShifu’s author and its operators will be able to abuse the stolen certificates for nefarious purposes.\n\n**Other data thefts**\n\nIn line with the current cryptocurrency hype, Shifu also targets Bitcoin and Litecoin wallet files found on the victim’s machine.\nShifu tries to steal VPN and VNC login credentials by checking the command line of running executables. If a remote desktop\nprotocol (RDP or VNC) or VPN process is found with the configuration file name specified in the command line, Shifu attempts\nto save a copy of the configuration file.\n\nIt appears that this trojan steals far more information than a typical banking trojan would: from keylogging, screenshot capture,\ncertificate capture and cryptocurrency wallet grabbing, to FTP and POP3 credentials grabbing. The malware also appears to\ntarget point-of-sale terminals for payment card data as well as some financial institutions themselves. It scans the machines if\none of the following strings is found in the path of the executable file of the current process:\n\ntellerplus\n\nbancline\n\nfidelity\n\nmicrsolv\n\nbankman\n\nvanity\n\nepisys\n\njack henry\n\ncruisenet\n\n\n-----\n\ngplusmain\n\nsilverlake\n\nv48d0250s1\n\nWhen a potential POS machine is found, the malware will send a flag, ‘ETC’, back to its C&C server. Based on the malware\ncode, there is no immediate action after the machine has been recognized as a POS system; perhaps a memory-scrapping\nmodule will be deployed by the botnet operators to this machine at a later time.\n\n### Stealthy banking trojan stays under the radar?\n\nWhen analysing Shifu’s Windows API-hooking mechanisms, we also discovered that the malware tries to remain hidden from\nthe victim. The malware conceals its presence from the running processes by hijacking the Windows\nntdll!ZwQuerySystemInformation API, which is called whenever a user-mode program attempts to enumerate a list of active\nprocesses using one of various process enumeration APIs. However, this is a well-known technique and is defeated by all\nmodern security tools. Apparently, the purpose of this trick is to remain concealed from non-tech-savvy users, however what\nconfused us is that the malware also hijacks Windows API calls used for DNS resolution, such as ws2_32!gethostbyname,\nws2_32!getaddrinfo and ws2_32!GetAddrInfoExW, to redirect URLs that contain the pattern ‘secure\\..*\\.moz\\..*’ to\n‘google.com’. Essentially, this seems to dismiss the idea of the malware being stealthy, as hijacking a website is often a clear\nsign of infection.\n\n### Home sweet home\n\nWhen a new machine is infected, the malware will report the new victim to the command-and-control (C&C) server by\nconnecting to a domain that is hard-coded in the code, using the path ‘/news/userlogin.php’. The following is the information\non the machine that will be stored in the botnet’s control panel (also see Figure 6):\n\nbotid – username and computer name\n\nver – botnet version\n\nup – uptime of the infected machine\n\nos – operating system identifier of the infected machine\n\nltime – local timestamp of the infected machine\n\ntoken – existence of smart card information\n\ncn – unknown\n\nav – name of the security solution installed\n\ndmn – domain name of the workstation\n\n**Figure 6. Machine information sent back to the C&C control panel.**\n\nAll the data sent and received is obfuscated to prevent direct exposure by a packet sniffer program. The data is encoded and\ndecoded using the RC4 algorithm with the key ‘a7zoSTHljZylEx4o3mJ2eqIdsEguKC15KnyQdfx4RTc5sjH’.\n\nWhen information is collected on the machine, it is immediately sent back to the C&C server via the path\n‘/news/userpanel.php’. A fake HTTP referrer, ‘www1.google.com’, is used throughout the C&C communications.\n\n\n-----\n\nWhen there is a need to generate a random domain name via a domain generation algorithm (DGA), the malware contacts the\nmaster C&C server first to retrieve some configuration data via the path ‘/news/users.php’.\n\nIn the payload of the most recently distributed Shifu, with a compilation date of 06 Oct 2015, we have noticed a subtle update:\nit no longer connects to the C&C server on machines that are found to have Man-in-the-Middle (MitM) interception for HTTPS\nconnections. It makes this check by comparing the certificate’s MD5 fingerprint with those of some well-known websites (see\nFigure 7):\n\nmicrosoft.com\n\ndropbox.com\n\ntwitter.com\n\nsendspace.com\n\netrade.com\n\nfacebook.com\n\ninstagram.com\n\ngithub.com\n\nicloud.com\n\npython.org\n\n\n-----\n\n**Figure 7. Checking the existence of MitM interception on HTTPS.**\n\nThe purpose for this update is believed to be to avoid the malware’s SSL traffic being intercepted and analysed by\nresearchers and by intrusion detection systems that typically have SSL traffic inspection capabilities.\n\n### One browser plug-in kills them all\n\nIt seems that Shifu’s author feels nostalgic about the PhishWall anti-phishing solution from SecureBrain. All third-party\nbrowser plug-ins will be disabled immediately via a single registry value, ‘Enable Browser Extensions’, located in\nHKCU\\Software\\Microsoft\\Internet Explorer\\Main, if PhishWall is found to be installed as an Internet Explorer plug-in. This\nmakes sense, given that Shifu was first found to be actively spread in Japan, as SecureBrain is a Japanese security provider.\nMoreover, it appears that Shifu’s author is cautious with the SecureBrain solution and does not want to create obvious noise –\nfor example by disabling all browser plug-ins – that could easily alert non-tech-savvy victims.\n\nIn addition to disabling third-party IE plug-ins, it also disables the pop-up blocker in IE through a registry key:\n```\nHKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\Zones\\3\n\"1406\" = 0\n\n```\n\n-----\n\n### Botnet like banking trojan\n\nLast but not least, Shifu also allows the botnet operator to download and execute additional modules, hence it supports a\nlimited set of commands. The following is a list of commands currently supported by the malware:\n\n**webinject**\n\nWebinjection to the targeted Internet banking sites is carried out through a local Apache server installed silently by Shifu. In\nthe underlying code, we realized that the botnet operators issue mitm_mod and mitm_script commands to download a copy of\nthe Apache web server software as well as the webinjection script and its associated configuration file, config.xml. When\nthese files are in place on the infected machine, the malware will first modify and make sure the Apache server is properly\nconfigured by setting the server’s address to localhost (127.0.0.1) using a random port for both HTTP and HTTPS. After the\nserver’s configuration file is set, the server’s process will be started and its status will be monitored periodically through an\nasynchronous thread every second to make sure it keeps running.\n\nWebinjection through the local HTTP server won’t work without setting up a hook on the browser process. However, the hook\nimplementation is simpler than that of traditional banking trojans. Table 4 shows a summary of the hooks on the Winsock API.\nBesides hooking the Winsock API, it also hijacks the SSL verification API used by the browser process so that the verification\nis always successful regardless of whether the presented SSL certificates are valid.\n\n**Hook Windows API** **Purpose**\n\nws2_32!connect ws2_32!connectEx Redirect all the HTTP/HTTPS traffic to a local HTTP\nserver to carry out man-in-the-middle operation\n\n\ncrypt32!CertVerifyCertificateChainPolicy\nnss3.dll!SSL_AuthCertificateHook\nnspr4.dll!SSL_AuthCertificateHook\n\n\nAlways return success when the browser’s SSL\nverification process takes place\n\n\n**Table 4. Hooks on the Winsock API.**\n\n**wipe_cookies**\n\nIt is assumed that Shifu is mainly distributed via Flash-based exploit kits. This module allows the botherder to make the botnet\nclean up Flash cookies found in the %APPDATA%\\Macromedia folder to cover the presence of the exploited Flash files.\n\n**update**\n\nLike most software, the botnet also supports automatic updates. As the malware uses a trivial protection method to prevent\nthe removal of the malware file – through an opened file handle – it must first close the file handle before being able to replace\nthe new binary file.\n\n**load**\n\nThis allows for the execution of arbitrary executables downloaded from the C&C server.\n\n**kill_os**\n\nThe real reason why the botnet supports the self-destruction feature (which destroys both the malware and the operating\nsystem) is still a mystery to us. But based on the nature of the botnet – it copies lots of ideas and codes from different\nnotorious malware – and the fact that it tries to evade analysis by both auto-analysis systems and manual analysis, we can\nsafely assume that the self-destruction routine will be executed when it is found to be executing on an unwilling platform.\n\nThe self-destruction routine (see Figure 8) is pretty straightforward:\n\nRemove all the files attached to removable drives, for instance thumb drives.\n\nCorrupt the filesystem (e.g. NTFS/FAT) by overwriting its boot sector.\n\nShut down the machine.\n\nIn case the shutdown operation is not successful, it terminates itself.\n\n\n-----\n\n**Figure 8. Shifu’s self-destruction routine.**\n\n## Conclusion\n\nIn conclusion, Shifu is an enhanced or improved piece of banking malware that has borrowed a lot of techniques from its\npredecessors; it rectified and refined the weaknesses possibly found in other renowned competitors. The author clearly has a\ngood understanding of how to deal with thread synchronization in multi-threaded applications – which could indicate that\nhe/she is an experienced programmer. However, the use of some old-school techniques in Shifu can be easily spotted and\nblocked by many security products.\n\n### Bibliography\n\n[1] Japanese Banking Trojan Shifu Combines Malware Tools. https://blogs.mcafee.com/mcafee-labs/japanese-banking-trojanshifu-combines-malware-tools/.\n\n[2] Shifu: ‘Masterful’ New Banking Trojan Is Attacking 14 Japanese Banks. https://securityintelligence.com/shifu-masterfulnew-banking-trojan-is-attacking-14-japanese-banks/.\n\n## Appendix\n\nTable A1 shows the sample SHA1 used in the analysis.\n\n**Compilation**\n**timestamp** **Dropper’s SHA1** **X86 Payload’s SHA1**\n\n\n18 August\n2015\n\n\n963BFC778F94FE190FDD1DD66284E9BC9DD2BED6 16E4476146511F6B9D8DDF4B232D896D7EC91F50\n\n\n-----\n\n**Compilation**\n**timestamp** **Dropper’s SHA1** **X86 Payload’s SHA1**\n\n\n06 October\n2015\n\n\nB4ED692D6E8C35F3C611084E6785972CCAE8DCDC 8FC58220FD84F3A59F20D52F4A07F07657474467\n\n\n**Table 5. Sample SHA1 used in the analysis.**\n\n\n-----\n\n```\n        py\nimport idaapi\nimport idautils\n# Global variables\nIMG_BASE = idaapi.get_imagebase()\nlist_seg = []\nfor seg in idautils.Segments():\n list_seg.append(seg)\nIMG_END = idc.SegEnd(list_seg[len(list_seg)-1])\ndef decrypt(ea, key):\n # Virtual address to IMAGE_IMPORT_DESCRIPTOR->FirstThunk\n va_iat = 0\n # Virtual address to IMAGE_IMPORT_DESCRIPTOR->OriginalFirstThunk\n va_int = 0\n tmp_ea = ea\n # Back-tracing to locate the IMAGE_IMPORT_DESCRIPTOR from import address table passed from the callback\n for xref in idautils.XrefsTo(ea, 0):\n if XrefTypeName(xref.type) == ‘Data_Offset’:\n  va_iat = xref.frm - 0x10\n if va_iat != 0:\n print “Import Name Table->%08x” % (idaapi.get_long(va_iat) + IMG_BASE)\n va_int = idaapi.get_long(va_iat) + IMG_BASE\n else:\n return\n if va_int != 0:\n va_itd = idaapi.get_long(va_int)\n # Enumerate array of IMAGE_THUNK_DATA\n while va_itd != 0:\n  va_itd = va_itd + IMG_BASE\n  if va_itd > IMG_BASE and va_itd <= IMG_END:\n  print «Image thunk data->%08x» % va_itd\n  va_ibn = va_itd + 2\n  ch = idaapi.get_byte(va_ibn)\n  str = ‘’\n  while ch != 0 and ch != 255:\n  str += chr(ch ^ key)\n  va_ibn += 1\n  ch = idaapi.get_byte(va_ibn)\n  # Save the decoded import name\n  print «IMAGE_IMPORT_BY_NAME->Name (%08x): %s» % (va_itd+2, str)\n  idc.MakeName(tmp_ea, str)\n  tmp_ea += 4\n # Next IMAGE_THUNK_DATA\n va_int += 4\n va_itd = idaapi.get_long(va_int)\n else:\n return\ndef imp_cb(ea, name, ord):\n if not name:\n print «%08x: ord#%d» % (ea, ord)\n else:\n print «%08x: %s (ord#%d)» % (ea, name, ord)\n # The decrypt function will be responsible to enumerate IMPORT_DESCRIPTOR_TABLE to decode all the function name\n decrypt(ea, 0xFF)\n # We only want to callback once for every imported DLL\n return False\n# Main\nnimps = idaapi.get_import_module_qty()\nfor i in xrange(0, nimps):\n name = idaapi.get_import_module_name(i)\n if t\n\n```\n\n-----\n\n```\n p g p\n continue\n print «Walking-> %s» % name\n idaapi.enum_import_names(i, imp_cb)\nprint «All done...»\n\n## Latest articles:\n\n### Cryptojacking on the fly: TeamTNT using NVIDIA drivers to mine cryptocurrency\n\n```\nTeamTNT is known for attacking insecure and vulnerable Kubernetes deployments in order to infiltrate organizations’\ndedicated environments and transform them into attack launchpads. In this article Aditya Sood presents a new module\nintroduced by…\n\n### Collector-stealer: a Russian origin credential and information extractor\n\nCollector-stealer, a piece of malware of Russian origin, is heavily used on the Internet to exfiltrate sensitive data from end-user\nsystems and store it in its C&C panels. In this article, researchers Aditya K Sood and Rohit Chaturvedi present a 360…\n\n### Fighting Fire with Fire\n\nIn 1989, Joe Wells encountered his first virus: Jerusalem. He disassembled the virus, and from that moment onward, was\nintrigued by the properties of these small pieces of self-replicating code. Joe Wells was an expert on computer viruses, was\npartly…\n\n### Run your malicious VBA macros anywhere!\n\nKurt Natvig wanted to understand whether it’s possible to recompile VBA macros to another language, which could then easily\nbe ‘run’ on any gateway, thus revealing a sample’s true nature in a safe manner. In this article he explains how he\nrecompiled…\n\n### Dissecting the design and vulnerabilities in AZORult C&C panels\n\nAditya K Sood looks at the command-and-control (C&C) design of the AZORult malware, discussing his team's findings\nrelated to the C&C design and some security issues they identified during the research.\n\n[Bulletin Archive](https://www.virusbulletin.com/virusbulletin/archive)\n\n_Copyright © 2015 Virus Bulletin_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-11-02 - Shifu – the rise of a self-destructive banking trojan.pdf"
    ],
    "report_names": [
        "2015-11-02 - Shifu – the rise of a self-destructive banking trojan.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536115,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653709100,
    "ts_modification_date": 1653709100,
    "files": {
        "pdf": "https://archive.orkl.eu/b6b81ac0d51fa69c10a42482fa5264e7ccb660c7.pdf",
        "text": "https://archive.orkl.eu/b6b81ac0d51fa69c10a42482fa5264e7ccb660c7.txt",
        "img": "https://archive.orkl.eu/b6b81ac0d51fa69c10a42482fa5264e7ccb660c7.jpg"
    }
}