{
    "id": "c5ded1e7-b38e-4d3a-9b2b-30d179d98334",
    "created_at": "2022-10-25T16:48:17.749523Z",
    "updated_at": "2025-03-27T02:17:11.513168Z",
    "deleted_at": null,
    "sha1_hash": "64b4473af2ffaf520043f90f688735a53e8860b7",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-02-21T08:43:08Z",
    "file_modification_date": "2018-02-21T08:43:08Z",
    "file_size": 1009309,
    "plain_text": "# Activity\n\n##### By GReAT on February 20, 2018. 2:00 pm\n\nSofacy, also known as APT28, Fancy Bear, and Tsar Team, is a highly active\n\nand prolific APT. From their high volume 0day deployment to their\n\ninnovative and broad malware set, Sofacy is one of the top groups that we\n\nmonitor, report, and protect against. 2017 was not any different in this\n\nregard. Our private reports subscription customers receive a steady\n\nstream of YARA, IOC, and reports on Sofacy, our most reported APT for\n\nthe year.\n\nThis high level of cyber-espionage activity goes back years. In 2011-2012,\n\nthe group used a relatively tiny implant (known as “Sofacy” or SOURFACE)\n\nas their first stage malware, which at the time had similarities with the old\n\nMiniduke implants. This made us believe the two groups were connected,\n\nalthough it looks they split ways at a certain point, with the original\n\nMiniduke group switching to the CosmicDuke implant in 2014. The\n\ndivision in malware was consistent and definitive at that point.\n\nIn 2013, the Sofacy group expanded their arsenal and added more\n\nbackdoors and tools, including CORESHELL, SPLM (aka Xagent, aka\n\nCHOPSTICK), JHUHUGIT (which is built with code from the Carberp\n\nsources), AZZY (aka ADVSTORESHELL, NETUI, EVILTOSS, and spans across\n\n4-5 generations) and a few others. We’ve seen quite a few versions of\n\nthese implants, which were relatively widespread at some point or still\n\n[are. In 2015 we noticed another wave of attacks which took advantage of](https://securelist.com/sofacy-apt-hits-high-profile-targets-with-updated-toolset/72924/)\n\na new release of the AZZY implant, largely undetected by antivirus\n\nproducts. The new wave of attacks included a new generation of USB\n\nstealers deployed by Sofacy, with initial versions dating to February 2015.\n\nIt appeared to be geared exclusively towards high profile targets.\n\nSofacy’s reported presence in the DNC network alongside APT29 brought\n\npossibly the highest level of public attention to the group’s activities in\n\n2016, especially when data from the compromise was leaked and\n\n“weaponized”. And later 2016, their focus turned towards the Olympics’\n\nand the World Anti-Doping Agency (WADA) and Court of Arbitration for\n\nSports (CAS), when individuals and servers in these organizations were\n\nphished and compromised. In a similar vein with past CyberBerkut\n\nactivity, attackers hid behind anonymous activist groups like\n\n“anonpoland”, and data from victimized organizations were similarly\n\nleaked and “weaponized”.\n\nThis write-up will survey notables in the past year of 2017 Sofacy activity,\n\nincluding their targeting, technology, and notes on their infrastructure.\n\n\n-----\n\n[style activity in Europe and Dealer’s Choice spearphishing are of interest.](https://www.fireeye.com/blog/threat-research/2017/08/apt28-targets-hospitality-sector.html)\n\nFrom where we sit, 2017 Sofacy activity starts with a heavy focus on NATO\n\nand Ukrainian partners, coinciding with lighter interest in Central Asian\n\ntargets, and finishing the second half of the year with a heavy focus on\n\nCentral Asian targets and some shift further East.\n\n## Dealer’s Choice\n\nThe beginning of 2017 began with a slow cleanup following the Dealer’s\n\nChoice campaign, with technical characteristics documented by our\n\ncolleagues at Palo Alto in several stages at the end of 2016. The group\n\nspearphished targets in several waves with Flash exploits leading to their\n\ncarberp based JHUHUGIT downloaders and further stages of malware. It\n\nseems that many folks did not log in and pull down their emails until Jan\n\n2017 to retrieve the Dealer’s Choice spearphish. Throughout these waves,\n\nwe observed that the targets provided connection, even tangential, to\n\nUkraine and NATO military and diplomatic interests.\n\nIn multiple cases, Sofacy spoofs the identity of a target, and emails a\n\nspearphish to other targets of interest. Often these are military or military\ntechnology and manufacturing related, and here, the DealersChoice\n\nspearphish is again NATO related:\n\n\n-----\n\nThe global reach that coincided with this focus on NATO and the Ukraine\n\ncouldn’t be overstated. Our KSN data showed spearphishing targets\n\ngeolocated across the globe into 2017.\n\nAM, AZ, FR, DE, IQ, IT, KG, MA, CH, UA, US, VN\n\nDealersChoice emails, like the one above, that we were able to recover\n\nfrom third party sources provided additional targeting insight, and\n\nconfirmed some of the targeting within our KSN data:\n\nTR, PL, BA, AZ, KR, LV, GE, LV, AU, SE, BE\n\n## 0day Deployment(s)\n\nSofacy kicked off the year deploying two 0day in a spearphish document,\n\nboth a Microsoft Office encapsulated postscript type confusion exploit\n\n[(abusing CVE-2017-0262) and an escalation of privilege use-after-free](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0262)\n\n[exploit (abusing CVE-2017-0263). The group attempted to deploy this](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0263)\n\nspearphish attachment to push a small 30kb backdoor known as\n\nGAMEFISH to targets in Europe at the beginning of 2017. They took\n\nadvantage of the Syrian military conflict for thematic content and file\n\nnaming “Trump’s_Attack_on_Syria_English.docx”. Again, this deployment\n\nwas likely a part of their focus on NATO targets.\n\n## Light SPLM deployment in Central Asia and Consistent Infrastructure\n\nMeanwhile in early-to-mid 2017, SPLM/CHOPSTICK/XAgent detections in\n\nCentral Asia provided a glimpse into ongoing focus on ex-Soviet republics\n\nin Central Asia. These particular detections are interesting because they\n\nindicate an attempted selective 2nd stage deployment of a backdoor\n\n\n-----\n\ndidn’t match previous reports on SPLM/XAgent while other similarities\n\nwere maintained. SPLM 64-bit modules already appeared to be at version\n\n4 of the software by May of the year. Targeting profiles included defense\n\nrelated commercial and military organizations, and telecommunications.\n\nTargeting included TR, KZ, AM, KG, JO, UK, UZ\n\n## Heavy Zebrocy deployments\n\nSince mid-November 2015, the threat actor referred to as “Sofacy” or\n\n“APT28” has been utilizing a unique payload and delivery mechanism\n\nwritten in Delphi and AutoIT. We collectively refer to this package and\n\nrelated activity as “Zebrocy” and had written a few reports on its usage\n\nand development by June 2017 – Sofacy developers modified and\n\nredeployed incremented versions of the malware. The Zebrocy chain\n\nfollows a pattern: spearphish attachment -> compiled Autoit script\n\n(downloader) -> Zebrocy payload. In some deployments, we observed\n\nSofacy actively developing and deploying a new package to a much\n\nsmaller, specific subset of targets within the broader set.\n\nTargeting profiles, spearphish filenames, and lures carry thematic content\n\nrelated to visa applications and scanned images, border control\n\nadministration, and various administrative notes. Targeting appears to be\n\nwidely spread across the Middle East, Europe, and Asia:</p style=”margin\nbottom:0!important”>\n\nBusiness accounting practices and standards\n\nScience and engineering centers\n\nIndustrial and hydrochemical engineering and standards/certification\n\nMinistry of foreign affairs\n\nEmbassies and consulates\n\n\n-----\n\nPress services\n\nTranslation services\n\nNGO – family and social service\n\nMinistry of energy and industry\n\nWe identified new MSIL components deployed by Zebrocy. While recent\n\nZebrocy versioning was 7.1, some of the related Zebrocy modules that\n\ndrop file-stealing MSIL modules we call Covfacy were v7.0. The\n\ncomponents were an unexpected inclusion in this particular toolset. For\n\nexample, one sent out to a handful of countries identifies network drives\n\nwhen they are added to target systems, and then RC4-like-encrypts and\n\nwrites certain file metadata and contents to a local path for later\n\nexfiltration. The stealer searches for files 60mb and less with these\n\nextensions:</p style=”margin-bottom:0!important”>\n\n.doc\n\n.docx\n\n.xls\n\n.xlsx\n\n.ppt\n\n.pptx\n\n.exe\n\n.zip\n\n.rar\n\nAt execution, it installs an application-defined Windows hook. The hook\n\ngets windows messages indicating when a network drive has been\n\nattached. Upon adding a network drive, the hook calls its “RecordToFile”\n\nfile stealer method.\n\nZebrocy spearphishing targets:\n\n\n-----\n\nUZ\n\n## SPLM deployment in Central Asia\n\nSPLM/CHOPSTICK components deployed throughout 2017 were native\n\n64-bit modular C++ Windows COM backdoors supporting http over fully\n\nencrypted TLSv1 and TLSv1.2 communications, mostly deployed in the\n\nsecond half of 2017 by Sofacy. Earlier SPLM activity deployed 32-bit\n\nmodules over unencrypted http (and sometimes smtp) sessions. In 2016\n\nwe saw fully functional, very large SPLM/X-Agent modules supporting OS\n\nX.\n\nThe executable module continues to be part of a framework supporting\n\nvarious internal and external components communicating over internal\n\nand external channels, maintaining slightly morphed encryption and\n\nfunctionality per deployment. Sofacy selectively used SPLM/CHOPSTICK\n\nmodules as second stage implants to high interest targets for years now.\n\nIn a change from previous compilations, the module was structured and\n\nused to inject remote shell, keylogger, and filesystem add-ons into\n\nprocesses running on victim systems and maintaining functionality that\n\nwas originally present within the main module.\n\nThe newer SPLM modules are deployed mostly to Central Asian based\n\ntargets that may have a tie to NATO in some form. These targets include\n\nforeign affairs government organizations both localized and abroad, and\n\ndefense organizations’ presence localized, located in Europe and also\n\nlocated in Afghanistan. One outlier SPLM target profile within our visibility\n\nincludes an audit and consulting firm in Bosnia and Herzegovina.\n\nMinor changes and updates to the code were released with these\n\ndeployments, including a new mutex format and the exclusive use of\n\nencrypted HTTP communications over TLS. The compiled code itself\n\nalready is altered per deployment in multiple subtle ways, in order to\n\nstymie identification and automated analysis and accommodate targeted\n\nenvironments. Strings (c2 domains and functionality, error messages, etc)\n\nare custom encrypted per deployment.\n\nTargets: TR, KZ, BA, TM, AF, DE, LT, NL\n\n## SPLM/CHOPSTICK/XAgent Modularity and Infrastructure\n\n\n-----\n\nthat take us into 2018, to be discussed in further detail at SAS 2018. The\n\ngroup demonstrates malleability and innovation in maintaining and\n\nproducing familiar SPLM functionality, but the pragmatic and systematic\n\napproach towards producing undetected or difficult-to-detect malware\n\ncontinues. Changes in the second stage SPLM backdoor are refined,\n\nmaking the code reliably modular.\n\n## Infrastructure Notes\n\nSofacy set up and maintained multiple servers and c2 for varying\n\ndurations, registering fairly recognizable domains with privacy services,\n\nregistrars that accept bitcoin, fake phone numbers, phony individual\n\nnames, and 1 to 1 email address to domain registration relationships.\n\nSome of this activity and patterns were publicly disclosed, so we expect to\n\nsee more change in their process in 2018. Also, throughout the year and\n\nin previous years, researchers began to comment publicly on Sofacy’s\n\nfairly consistent infrastructure setup.\n\nAs always, attackers make mistakes and give away hints about what\n\nproviders and registrars they prefer. It’s interesting to note that this\n\nversion of SPLM implements communications that are fully encrypted\n\nover HTTPS. As an example, we might see extraneous data in their\n\nSSL/TLS certificates that give away information about their provider or\n\nresources. Leading up to summer 2017, infrastructure mostly was created\n\nwith PDR and Internet Domain Service BS Corp, and their resellers.\n\nHosting mostly was provided at Fast Serv Inc and resellers, in all likelihood\n\nrelated to bitcoin payment processing.\n\nAccordingly, the server side certificates appear to be generated locally on\n\nVPS hosts that exclusively are paid for at providers with bitcoin merchant\n\nprocessing. One certificate was generated locally on what appeared to be\n\na HP-UX box, and another was generated on\n\n“8569985.securefastserver[.]com” with an email address\n\n“root@8569985.securefastserver[.]com”, as seen here for their\n\nnethostnet[.]com domain. This certificate configuration is ignored by the\n\nmalware.\n\n\n-----\n\nhttps://www.qhoster[.]com was a VPS hosting reseller of choice at the\n\ntime. It should be noted that the reseller accepted Alfa Click, PayPal,\n\nPayza, Neteller, Skrill, WebMoney, Perfect Money, Bitcoin, Litecoin,\n\nSolidTrust Pay, CashU, Ukash, OKPAY, EgoPay, paysafecard, Alipay, MG,\n\nWestern Union, SOFORT Banking, QIWI, Bank transfer for payment.\n\n## Conclusion\n\nSofacy, one of the most active APT we monitor, continues to spearphish\n\ntheir way into targets, reportedly widely phishes for credentials, and\n\ninfrequently participates in server side activity (including host\n\n[compromise with BeEF deployment, for example). KSN visibility and](https://www.youtube.com/watch?v=yQ0zZ6Anb64&feature=youtu.be)\n\ndetections suggests a shift from their early 2017 high volume NATO\n\nspearphish targeting towards the middle east and Central Asia, and finally\n\nmoving their focus further east into late 2017. Their operational security is\n\ngood. Their campaigns appear to have broken out into subsets of activity\n\nand malware involving GAMEFISH, Zebrocy, and SPLM, to name a few.\n\nTheir evolving and modified SPLM/CHOPSTICK/XAgent code is a long\nstanding part of Sofacy activity, however much of it is changing. We’ll\n\ncover more recent 2018 change in their targeting and the malware itself\n\n[at SAS 2018.](https://sas.kaspersky.com/)\n\nWith a group like Sofacy, once their attention is detected on a network, it\n\nis important to review logins and unusual administrator access on\n\nsystems, thoroughly scan and sandbox incoming attachments, and\n\nmaintain two factor authentication for services like email and vpn access.\n\nIn order to identify their presence, not only can you gain valuable insight\n\ninto their targeting from intelligence reports and gain powerful means of\n\ndetections with hunting tools like YARA, but out-of-band processing with\n\na solution like KATA is important.\n\n## Technical Appendix\n\n### Related md5\n\n8f9f697aa6697acee70336f66f295837\n\n1a4b9a6b321da199aa6d10180e889313\n\n842454b48f5f800029946b1555fba7fc\n\nd4a5d44184333442f5015699c2b8af28\n\n1421419d1be31f1f9ea60e8ed87277db\n\nb1d1a2c64474d2f6e7a5db71ccbafa31\n\n953c7321c4959655fdd53302550ce02d\n\n57601d717fcf358220340675f8d63c8a\n\n02b79c468c38c4312429a499fa4f6c81\n\n\n-----\n\n66b4fb539806ce27be184b6735584339\n\ne8e1fcf757fe06be13bead43eaa1338c\n\n953c7321c4959655fdd53302550ce02d\n\naa2aac4606405d61c7e53140d35d7671\n\n85cd38f9e2c9397a18013a8921841a04\n\n57601d717fcf358220340675f8d63c8a\n\n16e1ca26bc66e30bfa52f8a08846613d\n\nf8e92d8b5488ea76c40601c8f1a08790\n\nb137c809e3bf11f2f5d867a6f4215f95\n\n237e6dcbc6af50ef5f5211818522c463\n\n88009adca35560810ec220544e4fb6aa\n\n2163a33330ae5786d3e984db09b2d9d2\n\n02b79c468c38c4312429a499fa4f6c81\n\n842454b48f5f800029946b1555fba7fc\n\nd4a5d44184333442f5015699c2b8af28\n\nb88633376fbb144971dcb503f72fd192\n\n8f9f697aa6697acee70336f66f295837\n\nb6f77273cbde76896a36e32b0c0540e1\n\n1a4b9a6b321da199aa6d10180e889313\n\n1421419d1be31f1f9ea60e8ed87277db\n\n1a4b9a6b321da199aa6d10180e889313\n\n9b10685b774a783eabfecdb6119a8aa3\n\naa34fb2e5849bff4144a1c98a8158970\n\naced5525ba0d4f44ffd01c4db2730a34\n\nb1d1a2c64474d2f6e7a5db71ccbafa31\n\nb924ff83d9120d934bb49a7a2e3c4292\n\ncdb58c2999eeda58a9d0c70f910d1195\n\nd4a5d44184333442f5015699c2b8af28\n\nd6f2bf2066e053e58fe8bcd39cb2e9ad\n\n34dc9a69f33ba93e631cd5048d9f2624\n\n1c6f8eba504f2f429abf362626545c79\n\n139c9ac0776804714ebe8b8d35a04641\n\ne228cd74103dc069663bb87d4f22d7d5\n\nbed5bc0a8aae2662ea5d2484f80c1760\n\n8c3f5f1fff999bc783062dd50357be79\n\n5882a8dd4446abd137c05d2451b85fea\n\n296c956fe429cedd1b64b78e66797122\n\n82f06d7157dd28a75f1fbb47728aea25\n\n9a975e0ddd32c0deef1318c485358b20\n\n529424eae07677834a770aaa431e6c54\n\n4cafde8fa7d9e67194d4edd4f2adb92b\n\nf6b2ef4daf1b78802548d3e6d4de7ba7\n\nede5d82bb6775a9b1659dccb699fadcb\n\n116d2fc1665ce7524826a624be0ded1c\n\n20ff290b8393f006eaf4358f09f13e99\n\n4b02dfdfd44df3 88b0 8 2327843 4\n\n\n-----\n\n0b32e65caf653d77cab2a866ee2d9dbc\n\n27faa10d1bec1a25f66e88645c695016\n\n647edddf61954822ddb7ab3341f9a6c5\n\n2f04b8eb993ca4a3d98607824a10acfb\n\n9fe3a0fb3304d749aeed2c3e2e5787eb\n\n62deab0e5d61d6bf9e0ba83d9e1d7e2b\n\n86b607fe63c76b3d808f84969cb1a781\n\nf62182cf0ab94b3c97b0261547dfc6cf\n\n504182aaa5575bb38bf584839beb6d51\n\nd79a21970cad03e22440ea66bd85931f\n\n### Related domains\n\nnethostnet[.]com\n\nhostsvcnet[.]com\n\netcrem[.]net\n\nmovieultimate[.]com\n\nnewfilmts[.]com\n\nfastdataexchange[.]org\n\nliveweatherview[.]com\n\nanalyticsbar[.]org\n\nanalyticstest[.]net\n\nlifeofmentalservice[.]com\n\nmeteost[.]com\n\nrighttopregnantpower[.]com\n\nkiteim[.]org\n\nadobe-flash-updates[.]org\n\ngeneralsecurityscan[.]com\n\nglobalresearching[.]org\n\nlvueton[.]com\n\naudiwheel[.]com\n\nonline-reggi[.]com\n\nfsportal[.]net\n\nnetcorpscanprotect[.]com\n\nmvband[.]net\n\nmvtband[.]net\n\nviters[.]org\n\ntreepastwillingmoment[.]com\n\nsendmevideo[.]org\n\nsatellitedeluxpanorama[.]com\n\nppcodecs[.]com\n\nencoder-info[.]tk\n\nwmdmediacodecs[.]com\n\npostlkwarn[.]com\n\nshcserv[.]com\n\n\n-----\n\nmiropc[.]org\n\nsecurityprotectingcorp[.]com\n\nuniquecorpind[.]com\n\nappexsrv[.]net\n\nadobeupgradeflash[.]com\n\n[APT](https://securelist.com/all?tag=538) [BACKDOOR](https://securelist.com/all?tag=568) [CAMPAIGNS](https://securelist.com/all?tag=44) [CYBER ESPIONAGE](https://securelist.com/all?tag=185)\n\n[NATION STATE SPONSORED ESPIONAGE](https://securelist.com/all?tag=587) [SOFACY](https://securelist.com/all?tag=736)\n\n[TARGETED ATTACKS](https://securelist.com/all?tag=53) [VULNERABILITIES AND EXPLOITS](https://securelist.com/all?tag=41)\n\n\nShare post on:\n\n####   \n\n\n[ZERO-DAY VULNERABILITIES](https://securelist.com/all?tag=54)\n\n\n### Related Posts\n\n\n##### Zero-day vulnerability in Telegram\n\n\n##### Gas is too expensive? Let’s make it cheap!\n\n\n##### Denis and Co.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.02.20.a-slice-of-2017-sofacy-activity/A%20Slice%20of%202017%20Sofacy%20Activity%20-%20Securelist.pdf"
    ],
    "report_names": [
        "A Slice of 2017 Sofacy Activity - Securelist"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1519202588,
    "ts_modification_date": 1519202588,
    "files": {
        "pdf": "https://archive.orkl.eu/64b4473af2ffaf520043f90f688735a53e8860b7.pdf",
        "text": "https://archive.orkl.eu/64b4473af2ffaf520043f90f688735a53e8860b7.txt",
        "img": "https://archive.orkl.eu/64b4473af2ffaf520043f90f688735a53e8860b7.jpg"
    }
}