{
    "id": "c6116e7c-1848-4580-aa02-52d9a6d2fbfd",
    "created_at": "2023-01-12T15:05:40.756927Z",
    "updated_at": "2025-03-27T02:05:34.491888Z",
    "deleted_at": null,
    "sha1_hash": "a60f43feb81139e619e8989cacdf7afbdd8ee588",
    "title": "2021-07-21 - This Chat is Being Recorded- Egregor Ransomware Negotiations Uncovered",
    "authors": "",
    "file_creation_date": "2022-05-27T22:14:18Z",
    "file_modification_date": "2022-05-27T22:14:18Z",
    "file_size": 1771481,
    "plain_text": "# This Chat is Being Recorded: Egregor Ransomware Negotiations Uncovered\n\n**[securityintelligence.com/posts/egregor-ransomware-negotiations-uncovered/](https://securityintelligence.com/posts/egregor-ransomware-negotiations-uncovered/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Incident Response](https://securityintelligence.com/category/topics/incident-response/)\nThis Chat is Being Recorded: Egregor Ransomware Negotiations Uncovered\n\n[Incident Response July 21, 2021](https://securityintelligence.com/category/topics/incident-response/)\n\n\n-----\n\nBy [Chris Caridi co-authored by Allison Wikoff 8 min read](https://securityintelligence.com/author/chris-caridi/)\nRansomware attacks are topping the charts as the most common attack type to target\norganizations with a constant drumbeat of attacks impacting industries across the board. In\nfact, IBM Security X-Force has seen a more than 10% increase in ransomware incident\nresponse requests compared to this time last year.\n\nRansomware is well on its way toward becoming a global billion-dollar enterprise – one that\nvictims are funding. Attackers are operating like a well-oiled business industry, yielding high\nprofits in a year that most businesses struggled. Why? The new ransomware business model\nis relentless, extortive and paying off.\n\n[IBM Security X-Force Threat Intelligence analysts, together with Cylera, an IoT and medical](http://www.cylera.com/)\ndevice security intelligence company that works with IBM Security to deliver IoMT solutions,\nhave obtained and analyzed hours of chat correspondence and negotiations that occurred in\n[December 2020 between the notorious Egregor ransomware actors, responsible for upwards](https://exchange.xforce.ibmcloud.com/search/%23egregor)\nof $80 million dollars in losses globally. The chat correspondence had negotiations with\n[approximately 40 victim organizations they chatted with. The activity uncovered in these chat](https://www.nbcnews.com/nightly-news/video/fbi-investigating-ransomware-attacks-114350661771)\ntranscripts provides valuable insight into how some ransomware actors operate – from how\nthey conduct ransom payment negotiations, to the strategies and operational structure they\nused.\n\n[Although law enforcement took action against Egregor operations in February 2021, this](https://www.franceinter.fr/amp/justice/cybersecurite-des-pirates-egregor-a-l-origine-de-l-attaque-contre-ouest-france-interpelles-en-ukraine)\ndiscovery provides the following insightful takeaways:\n\n**Defining the Ransom Demand – Initial ransom amounts ranged from $100,000 to $35**\nmillion. The average initial ransom demanded was $5 million. During one negotiation,\nthe threat actors indicated that their initial ransom demand is 5-10% of the potential\nestimated loss associated with a data leak.\n**Ransom Negotiations – Several factors played a role in determining the final**\nnegotiated ransom amount or data leak outcome, including the operators’ perception of\nthe victim’s ability and willingness to pay as well as the victim’s negotiation strategies\nsuch as attempting to buy time and delay the payment.\n**Operational Structure – The chats reveal a highly sophisticated organized crime**\ngroup was behind Egregor operations. Numerous roles or teams were mentioned\nincluding the financial department, data manager, attackers/IT specialists, PR manager,\npublications manager and decryption tool master-maker.\n**Compassion with a Catch – X-Force researchers maintain the operators of**\nransomware like Egregor are nefarious actors. However, the chat logs revealed a few\nglimpses of what could be perceived as empathy or practical consideration. During one\nnegotiation, Egregor offered to provide the decryption key, in exchange for the\norganization publicly announcing that the group does not intentionally target hospitals\nor charities. In a chat with another victim, the threat actors discuss the hardships of\nCOVID-19, even wishing the victim happy holidays.\n\n\n-----\n\n## What is Egregor ?\n\n[The Egregor ransomware was first reported publicly in mid-2020, making it a relatively new](https://exchange.xforce.ibmcloud.com/collection/An-Egregor-Ransomware-Profile-8f9fc650f03b7a7ffa706725dfb7fc82)\nentry into the criminal economy. Egregor operators work through an affiliate model, meaning\na small group of actors run and maintain the Egregor code base and other actors purchase\naccess to Egregor and use the malware on systems they infect. This model is best known as\nRansomware as A Service (RaaS).\n\nMany security analysts speculated that Egregor was the follow-up to the Maze ransomware,\n[pointing to significant technical overlap between the two ransomware families after Maze’s](https://news.sophos.com/en-us/2020/12/08/egregor-ransomware-mazes-heir-apparent/)\nthreat actors [declared retirement in November 2020. Egregor gained significant recognition](https://cisomag.eccouncil.org/maze-ransomware-retires)\nin 2021 as affiliates [shifted from Maze to using this new ransomware family and leaked](https://www.bleepingcomputer.com/news/security/maze-ransomware-is-shutting-down-its-cybercrime-operation/)\nstolen information from impacted organizations, extorting them in efforts to collect a ransom.\n\nThe [impact of Egregor ransomware has been felt worldwide with an estimated $80 million](https://www.scmagazine.com/home/security-news/ransomware/the-egregor-takedown-new-tactics-to-take-down-ransomware-groups-show-promise/)\ndollars in profit through their operations against at least 150 organizations. Regarding\n[victims, the highest number of reported cases was in the United States with infections](https://www.upguard.com/blog/what-is-egregor-ransomware)\nclustered primarily within the manufacturing and retail industries. Some of the larger targets\nhave included Barnes and Noble, Randstad, French logistics firm Gefco and video game\ncompanies Ubisoft and Crytek.\n\nIn February 2021, a joint French and Ukrainian law enforcement operation disrupted\nEgregor’s infrastructure and arrested multiple Egregor associates. As of the time of this\npublication, X-Force researchers are not aware of active Egregor intrusions.\n\n## What’s in a Ransom?\n\nAfter reviewing elaborate chat logs between Egregor actors and representatives from\nvictimized organizations, we obtained interesting insights about how the ransom amount was\nfixed and the overall negotiation process. In a common flow of events, upon initial contact\nwith victims, X-Force and Cylera analysts observed Egregor ransomware actors making an\ninitial demand for a ransom payment that depended on the victim and their perceived ability\nto pay.\n\nAnalysis of approximately 50 ransom negotiations in Egregor chat logs from December 2020\nshows that ransom demands varied wildly.\n\nAverage initial ransom demand $5,024,000\n\nAverage ransom payment $387,700\n\nHighest initial ransom demand $35,000,000\n\n\n-----\n\nLowest initial ransom demand $100,000\n\nSum of all ransom demands $226,080,000\n\n_Figure 1: Egregor ransom demands and average ransom payment, in U.S. dollars,_\n_December 2020 (Source: IBM X-Force/Cylera)_\n\nHow each ransom amount was determined was likely a judgment call based on a\ncombination of publicly available information about the victim along with what the operators\nperceived the victim could afford to pay.\n\nUltimately, researchers observed that the threat actors appeared to strike a balance between\na victim’s ability and willingness to pay while considering multiple additional factors. In one\nnegotiation, Egregor actors gave the victim organization an initial ransom demand of $1.7\nmillion. Through some negotiating by the victim, explaining they were a small company,\nEgregor operators decreased the ransom to $1 million.\n\nIn another example, Egregor operators alluded to using an analyst associated with Egregor\noperations to estimate a victim’s total loss if they were to forego paying the ransom and\ninstead suffer a data leak. The attacker’s comments indicate that the initial ransom demand\nis 5-10% of that estimated loss.\n\nIn another example, a victim pleads with the attackers for a lower ransom price due to the\ninability to pay as a result of COVID-19 pandemic-related hardships. The Egregor actors\ndemanded proof from the victim that they were experiencing financial hardships, even going\nas far as requesting information from the IRS.\n\n\n-----\n\n## Buying Time: A Victim’s Strategy\n\nDeciding whether to pay and negotiating with the attackers is a hotly contested endeavor in\nthe security community. Both paying a ransom or deciding not to pay carry consequences.\nWe encourage organizations to review X-Force’s [Definitive Guide to Ransomware, which](https://www.ibm.com/account/reg/us-en/signup?formid=mrs-form-2195)\nlists the main topics companies should consider when the question arises as to whether they\nshould pay a ransom.\n\nOur review of the Egregor chat logs provides some insight into what mitigation or ransom\nreduction techniques could be effective if one is ever faced with a ransomware incident:\n\n**Using company size to discount the ransom: In some cases, victims explained the**\nsize of their business with Egregor actors, which resulted in lower ransom demands.\n**Getting money and cryptocurrency takes time: In other instances, analysts**\nobserved victims explaining the process for acquiring money to pay the ransom, which\nextended the time before the actors leaked information about the compromised\norganization.\n\n\n-----\n\n## Well-Organized Cybercrime\n\nWhile parsing through multiple conversations, X-Force and Cylera analysts noticed a variety\nof roles the threat actors alluded to during the negotiation process.\n\n\n-----\n\nEgregor negotiators referred to themselves as members of the support team who only get a\nfixed salary and fear being fired. During discussions, they referred to other teams, including\nthe financial department, data manager, attackers/IT specialists, PR manager, publications\nmanager, and decryption tool master-maker.\n\n## Operators with a Heart?\n\nDespite the intention of stealing millions of dollars from victims, the attackers have backed off\nfrom their demands in some circumstances if they believed they could receive positive press\nfor doing so.\n\n\n-----\n\nIn one instance, X-Force and Cylera analysts observed negotiations between Egregor and a\ncharity. After a long conversation between the victim organization and Egregor operators,\nEgregor offered to provide the decryption key, asking that the organization publicly announce\nthat the group does not intentionally target hospitals or charities.\n\nIn another ransom negotiation, the victim, a small U.S. dental practice, and Egregor support\nare discussing the hardships of 2020, specifically COVID-19.\n\n## Key Takeaways\n\nDespite the holiday wishes and reduced ransom in some instances, the December 2020 chat\nlogs obtained by X-Force and Cylera demonstrate that many Egregor attacks were a\nsuccessful, ruthless criminal operation. Although the threat actors have ceased from using\nthe Egregor ransomware family specifically, and only since the law enforcement activity in\nFebruary 2021, X-Force analysts believe that a new infrastructure can be mounted and the\nsame code can be used again in its original form or as modified code. Moreover, with these\nattacks yielding extremely high profits for those residing in less prosperous parts of the\nworld, new ransomware families and gangs will continue to emerge and may take Egregor’s\nplace in the near future.\n\n[Ransomware attacks continue to be the top threat to organizations globally as this threat](https://www.ibm.com/downloads/cas/M1X3B7QG)\ngrows and expands its reach year over year. Yet, even in the face of sophisticated threats,\nthere are actions companies can take that can help mitigate risks and minimize damage:\n\n\n-----\n\n**Establish and drill an incident response team. Whether in-house or as a retained**\nservice, the formation of an incident response team and drilling the most relevant\nattack scenarios to your organization can make a big difference in attack outcomes and\n[costs.](https://www.ibm.com/security/data-breach/threat-intelligence)\n**Establish and maintain offline backups. Ensure you have files safely stored from**\nattacker accessibility with read-only access. Also consider the use of offsite/cold\nstorage solutions. The availability of backup files is a significant differentiator for\norganizations that can help recover from a ransomware attack.\n**Implement a strategy to prevent unauthorized data theft, especially as it applies to**\nuploading large amounts of data to legitimate cloud storage platforms that attackers\ncan abuse. Consider blocking outbound traffic to unapproved cloud hosting services.\n**Employ user and entity behavior analytics to identify potential security incidents.**\nWhen triggered, assume a breach has taken place. Audit, monitor and quickly act on\nsuspected abuse related to privileged accounts and groups.\n**Deploy** **[multifactor authentication on all remote access points into an enterprise](https://securityintelligence.com/posts/multifactor-authentication-the-next-battleground/)**\nnetwork — with particular care given to secure or disable remote desktop protocol\n(RDP) access. Multiple ransomware attacks have been known to exploit weak RDP\naccess to gain initial entry into a targeted network.\n**[Use penetration testing to identify weak points in enterprise networks and](https://www.ibm.com/security/services/offensive-security-services)**\nvulnerabilities that should be prioritized for patching. In particular, we recommend\n[implementing mitigations for CVE-2019-19781, which multiple threat actors have used](https://nvd.nist.gov/vuln/detail/CVE-2019-19781)\nto gain initial entry into enterprises in 2020 and 2021 — including for ransomware\nattacks.\n**Consider prioritizing the immediate remediation, as applicable, of the following**\nfrequently exploited software vulnerabilities:\n\nCVE-2019-2725\nCVE-2020-2021\nCVE-2020-5902\nCVE-2018-8453\n\nVPN-related CVEs\n\nCVE-2019-11510\nCVE-2019-11539\nCVE-2018-13379\nCVE-2019-18935\nCVE-2021-22893\n\nRDP\n\n\n-----\n\nRestrict port access on TCP port 3389\nApply multifactor authentication to remote access logins\nRemediate RDP vulnerabilities such as Windows RDP CVE-2019-0708\n(BlueKeep)\nCVE-2020-3427\nCVE-2020-0610\nCVE-2020-0609\n**Segment networks according to the data they host.**\n**Encrypt the data most likely to be stolen in an attack.**\n**Consider adopting a** **[Zero Trust approach and framework to better control what](https://www.ibm.com/security/zero-trust)**\nusers can access and potentially halt an attack in its tracks.\n\nIf you are experiencing cybersecurity issues or an incident, contact X-Force to help: U.S.\nHotline: 1-888-241-9812 | Global Hotline: +(001) 312-212-8034. Learn more about X-Force’s\n[threat intelligence and](https://www.ibm.com/security/services/threat-intelligence) [incident response services.](https://www.ibm.com/security/services/incident-response-services)\n\n[Chris Caridi](https://securityintelligence.com/author/chris-caridi/)\nStrategic Cyber Threat Analyst, IBM X-Force IRIS\n\nChris Caridi is a cyber threat intelligence analyst with IBM X-Force Incident Response and\nIntelligence Services (IRIS). Chris brings 9 years of experience w...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-21 - This Chat is Being Recorded- Egregor Ransomware Negotiations Uncovered.pdf"
    ],
    "report_names": [
        "2021-07-21 - This Chat is Being Recorded- Egregor Ransomware Negotiations Uncovered.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535940,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653689658,
    "ts_modification_date": 1653689658,
    "files": {
        "pdf": "https://archive.orkl.eu/a60f43feb81139e619e8989cacdf7afbdd8ee588.pdf",
        "text": "https://archive.orkl.eu/a60f43feb81139e619e8989cacdf7afbdd8ee588.txt",
        "img": "https://archive.orkl.eu/a60f43feb81139e619e8989cacdf7afbdd8ee588.jpg"
    }
}