{
    "id": "c61993fe-df17-42e5-b58b-b0cd409daef5",
    "created_at": "2023-01-12T15:04:37.454639Z",
    "updated_at": "2025-03-27T02:14:05.272175Z",
    "deleted_at": null,
    "sha1_hash": "4ab8ce5abdafce86053c0980b2d0a0df646f1ac2",
    "title": "2022-02-25 - CrowdStrike Falcon Protects from New Wiper Malware Used in Ukraine Cyberattacks",
    "authors": "",
    "file_creation_date": "2022-05-28T23:37:26Z",
    "file_modification_date": "2022-05-28T23:37:26Z",
    "file_size": 1547019,
    "plain_text": "# CrowdStrike Protects from Wiper Malware Used in Ukraine Attacks\n\n**[crowdstrike.com/blog/how-crowdstrike-falcon-protects-against-wiper-malware-used-in-ukraine-attacks/](https://www.crowdstrike.com/blog/how-crowdstrike-falcon-protects-against-wiper-malware-used-in-ukraine-attacks/)**\n\nFebruary 25, 2022\n\n## CrowdStrike Falcon Protects from New Wiper Malware Used in Ukraine Cyberattacks\n\nFebruary 25, 2022\n\n[William Thomas - Adrian Liviu Arsene - Farid Hendi](https://www.crowdstrike.com/blog/author/william-thomas-adrian-liviu-arsene-farid-hendi/) [Endpoint & Cloud Security](https://www.crowdstrike.com/blog/category/endpoint-protection/)\n\nOn Feb. 23, 2022, a new wiper malware was reported targeting Ukraine systems\nThe wiper destroys files on infected Windows devices by corrupting specific elements of\nconnected hard drives\nCrowdStrike Intelligence refers to this destructive malware as DriveSlayer\nDriveSlayer is the second recent destructive malware targeting Ukraine, following WhisperGate\nThe CrowdStrike Falcon® platform provides continuous protection from DriveSlayer and wiperstyle threats by offering real-time visibility across workloads\n\nOn Feb. 23, 2022, a new wiper malware was reported publicly as affecting Ukrainian-based\nsystems. Following a series of denial-of-service attacks and website defacements, the new\ndestructive malware corrupts the master boot record (MBR), partition and file system of all available\n\n\n-----\n\nphysical drives on Windows machines.\n\nCrowdStrike Intelligence refers to this new destructive malware as DriveSlayer, and it’s the second\nwiper to affect [Ukraine following the recent WhisperGate. DriveSlayer is digitally signed using a valid](https://www.crowdstrike.com/blog/lessons-from-past-cyber-operations-against-ukraine/)\ncertificate and also abuses a legitimate EaseUS Partition Master driver to gain raw disk access and\nmanipulate the disk to make the system inoperable.\n\nThe [CrowdStrike Falcon platform provides continuous protection against DriveSlayer and wiper-style](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)\nthreats by delivering real-time visibility across workloads to protect customers.\n\n## Technical Analysis\n\nUnlike WhisperGate, which uses higher-level API calls, DriveSlayer uses raw disk access to destroy\ndata.\n\nUpon initialization, two optional command-line parameters may be used to specify how long the\nmalware will sleep before destruction begins and the system is restarted. If none are specified it will\ndefault to 20 and 35 minutes, respectively.\n\nNext, the malware will ensure it has the proper privileges to perform its actions. It uses the API\n```\nAdjustTokenPrivileges to give itself the following privileges: SeShutdownPrivilege,\nSeBackupPrivilege and SeLoadDriverPrivilege .\n\n```\n**Privilege Name** **Description**\n\nSeShutdownPrivilege Provides the ability to shut down a local system\n\nSeBackupPrivilege Provides the ability to perform system backup operations\n\nSeLoadDriverPrivilege Provides the ability to load or unload a device driver\n\nDifferent drivers will be loaded based on the system version. The malware uses `IsWow64Process`\nto determine which driver version to load. These drivers are stored in the resource section of the\nbinary and are compressed with the Lempel-Ziv algorithm. The driver file is written to\nsystem32\\drivers with a 4-character, pseudo-randomly generated name. This file is then\ndecompressed using LZCopy to a new file with a “.sys” extension.\n\n**Example File Name** **Description**\n\nC:\\Windows\\System32\\drivers\\bpdr Lempel-Ziv compressed driver\n\nC:\\Windows\\System32\\drivers\\bpdr.sys Decompressed driver\n\nBefore the driver is loaded, the malware disables crash dump by setting the following registry key:\n\n**Registry** **Value** **Description**\n\nHKLM:\\SYSTEM\\CurrentControlSet\\Control\\CrashControl\\CrashDumpEnabled 0 Disables\ncrash dump\n\n\n-----\n\nTo load the driver, a new service is created using the API `CreateServiceW . The name and display`\nname for this service is the 4-character name used for the file name. Next, `StartServiceW is`\ncalled in a loop five times to ensure the driver is loaded. Immediately after the driver is loaded, the\nservice is removed by deleting the entire registry key.\n\nAfter the driver is loaded, the VSS service is disabled using the Control Service Manager. Following\nthis, a number of additional threads are created. A thread is created to handle the system reboot. It\nwill sleep for the time specified by a command line parameter of 35 minutes, at which point the\nsystem will be restarted by an API call to `InitializeSystemShutdownExW .`\n\nAnother thread disables features in the UI that could alert the user of suspicious activity occurring on\nthe system before iterating through attached drives.\n\n**Registry** **Value** **Description**\n\n\nHKU\\Software\\Microsoft\\Windows\\CurrentVersion\\\nExplorer\\Advanced\\ShowCompColor\n\nHKU\\Software\\Microsoft\\Windows\\CurrentVersion\\\nExplorer\\Advanced\\ShowInfoTip\n\n\n0 Disables colors for compressed and\nencrypted NTFS files\n\n0 Disables pop-up information about\nfolders and desktop items\n\n\nFinally, the malware begins its destructive routine by spawning multiple additional threads that\noverwrite the files on disk and destroy the partition tables. Once the system is rebooted, the user will\nsee a blank screen with the words “Missing operating system.”\n\n## The Falcon Platform’s Continuous Monitoring and Visibility Stop Destructive Malware\n\nThe Falcon platform takes a layered approach to protect workloads. Using on-sensor and cloud[based machine learning, behavior-based detection using indicators of attack (IOAs), and intelligence](https://www.crowdstrike.com/cybersecurity-101/indicators-of-compromise/ioa-vs-ioc/)\nrelated to tactics, techniques and procedures (TTPs) employed by threats and threat actors, the\nFalcon platform enables visibility, threat detection and continuous monitoring for any environment,\nreducing time to detect and mitigate threats including destructive malware.\n\nAs shown in Figure 1, the Falcon platform uses cloud-based machine learning to detect DriveSlayer\nand prevent the malware from performing additional malicious actions, such as loading additional\ncomponents.\n\n\n-----\n\nFigure 1. The Falcon platform’s cloud-based machine learning detects DriveSlayer wiper (Click to enlarge)\n\nThe Falcon platform’s behavior-based IOAs can detect and prevent suspicious processes from\nexecuting or loading additional components, as well as other behaviors that indicate malicious intent.\nFor example, Falcon detects and prevents DriveSlayer behavior such as tampering with specific\nregistry keys. The behavior-based detection is further layered with a traditional indicator of\ncompromise (IOC)-based hash detection (see Figure 2).\n\nFigure 2. CrowdStrike Falcon detects and prevents DriveSlayer destructive behavior (Click to enlarge)\n\nBecause DriveSlayer has no built-in propagation methods for spreading across infrastructures, and\nbecause reports of it being used to target Ukraine have so far been limited, the risk of organizations\nencountering this data-wiping threat may be low at present. CrowdStrike will continue to monitor and\nreport on the situation as it unfolds.\n\nCrowdStrike Falcon customers can proactively monitor their environments by using hunting queries\n[to reveal indicators of DriveSlayer’s presence. Read our summary on DriveSlayer, and how to hunt](https://supportportal.crowdstrike.com/s/article/ka16T000000wxeZQAQ)\nfor it in our Support Portal.\n\n\n-----\n\nCompanies facing cyber incident risks, including data-wiping threats, are encouraged to take steps\nto increase their operational resilience. Security solutions that can protect them from malware and\nother threats must provide visibility into their environments and intelligent monitoring of cloud\nresources to help detect and respond to potential threats — including destructive threats — and limit\npotential damages.\n\n_Note: More detailed intelligence and technical information about DriveSlayer is available to_\n_[CrowdStrike customers through the Falcon console and Support Portal.](https://supportportal.crowdstrike.com/s/article/Trending-Threats-Vulnerabilities-New-Wiper-Ukraine)_\n\n## Indicators of Compromise (IOCs)\n\n**File** **SHA256**\n\nDriveSlayer 1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\n\n**Additional Resources**\n\n_Read more about successive use of offensive cyber operations against Ukraine: Lessons_\n_[Learned From Successive Use of Offensive Cyber Operations Against Ukraine and What May](https://www.crowdstrike.com/blog/lessons-from-past-cyber-operations-against-ukraine/)_\n_Be Next._\n_Learn more about WhisperGate in this CrowdStrike Intelligence blog: Technical Analysis of the_\n_WhisperGate Malicious Bootloader._\n_Learn more about the powerful, cloud-native CrowdStrike Falcon platform by visiting the_\n_product webpage._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent to see for yourself how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n_Follow all related content in Trending Threats & Vulnerabilities: New Wiper used in Ukraine_\n_Cyberattacks._\n\nRelated Content\n\n\n-----\n\nPROPHET SPIDER Exploits Citrix ShareFile Remote Code Execution Vulnerability CVE-2021-22941 to Deliver\nWebshell\n\nAt the start of 2022, CrowdStrike Intelligence and CrowdStrike Services investigated an incident in\nwhich PROPHET SPIDER exploited CVE-2021-22941 — a remote code execution (RCE)\nvulnerability impacting Citrix ShareFile Storage Zones Controller — to compromise a Microsoft\nInternet Information Services (IIS) web server. The adversary exploited the vulnerability to deploy a\nwebshell that enabled the […]\n\n\n-----\n\nDecryptable PartyTicket Ransomware Reportedly Targeting Ukrainian Entities\n\nSummary On Feb. 23, 2022, destructive attacks were conducted against Ukrainian entities. Industry\nreporting has claimed the Go-based ransomware dubbed PartyTicket (or HermeticRansom) was\nidentified at several organizations affected by the attack,1 among other families including a\nsophisticated wiper CrowdStrike Intelligence tracks as DriveSlayer (HermeticWiper). Analysis of the\nPartyTicket ransomware indicates it superficially encrypts files […]\n\n\n-----\n\nAccess Brokers: Who Are the Targets, and What Are They Worth?\n\nAccess brokers have become a key component of the eCrime threat landscape, selling access to\nthreat actors and facilitating myriad criminal activities. Many have established relationships with big\ngame hunting (BGH) ransomware operators and affiliates of prolific ransomware-as-a-Service\n(RaaS) programs. The CrowdStrike Intelligence team analyzed the multitude of access brokers’\nadvertisements posted since 2019 and […]\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-25 - CrowdStrike Falcon Protects from New Wiper Malware Used in Ukraine Cyberattacks.pdf"
    ],
    "report_names": [
        "2022-02-25 - CrowdStrike Falcon Protects from New Wiper Malware Used in Ukraine Cyberattacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535877,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1653781046,
    "ts_modification_date": 1653781046,
    "files": {
        "pdf": "https://archive.orkl.eu/4ab8ce5abdafce86053c0980b2d0a0df646f1ac2.pdf",
        "text": "https://archive.orkl.eu/4ab8ce5abdafce86053c0980b2d0a0df646f1ac2.txt",
        "img": "https://archive.orkl.eu/4ab8ce5abdafce86053c0980b2d0a0df646f1ac2.jpg"
    }
}