{
    "id": "c61d1a88-b3e9-4566-ac25-c0b0f95ff948",
    "created_at": "2023-01-12T15:09:41.812036Z",
    "updated_at": "2025-03-27T02:05:35.921079Z",
    "deleted_at": null,
    "sha1_hash": "7d3df93dc1cfc59dba1c2d60dedcd5871b54d8e4",
    "title": "2021-12-23 - Elastic Security uncovers BLISTER malware campaign",
    "authors": "",
    "file_creation_date": "2022-05-27T23:18:25Z",
    "file_modification_date": "2022-05-27T23:18:25Z",
    "file_size": 815075,
    "plain_text": "# BLISTER malware campaign discovered | Elastic Blog\n\n**[elastic.co/blog/elastic-security-uncovers-blister-malware-campaign](https://www.elastic.co/blog/elastic-security-uncovers-blister-malware-campaign)**\n\n## Elastic Security uncovers BLISTER malware campaign\n\n Key takeaways:\n\nElastic Security uncovered a stealthy malware campaign that leverages valid code signing\ncertificates to evade detection\nA novel malware loader, BLISTER was used to execute second stage malware payloads inmemory and maintain persistence\nThe identified malware samples have very low or no detections on VirusTotal\nElastic provided layered prevention coverage from this threat out of the box\n\n## Overview\n\nThe Elastic Security team identified a noteworthy cluster of malicious activity after reviewing our\nthreat prevention telemetry. A valid code signing certificate is used to sign malware to help the\nattackers remain under the radar of the security community. We also discovered a novel malware\n\n\n-----\n\nloader used in the campaign, which we ve named BLISTER. The majority of the malware samples\n[observed have very low, or no, detections in VirusTotal. The infection vector and goals of the](https://www.virustotal.com/)\nattackers remain unknown at this time.\n\nElastic’s layered approach to preventing attacks protects from this and similar threats.\n\nIn one prevented attack, our malicious behavior prevention triggered multiple high-confidence alerts\nfor Execution via Renamed Signed Binary Proxy, Windows Error Manager/Reporting Masquerading,\nand Suspicious PowerShell Execution via Windows Scripts. Further, our memory threat prevention\nidentified and stopped BLISTER from injecting its embedded payload to target processes.\n\n[Finally, we have additional coverage from our open source detection engine rules [1] [2]. To ensure](https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_masquerading_werfault.toml)\ncoverage for the entire community, we are including YARA rules and IoCs to help defenders identify\nimpacted systems.\n\n## Details\n\n**Certificate abuse**\n\n[A key aspect of this campaign is the use of a valid code signing certificate issued by Sectigo.](https://sectigo.com/ssl-certificates-tls/code-signing)\nAdversaries can either steal legitimate code-signing certificates or purchase them from a certificate\nauthority directly or through front companies. Executables with valid code signing certificates are\noften scrutinized to a lesser degree than unsigned executables. Their use allows attackers to remain\nunder the radar and evade detection for a longer period of time.\n\nWe responsibly disclosed the activity to Sectigo so they could take action and revoke the abused\ncertificates. Below shows details about the compromised certificate. We have observed malware\nsigned with this certificate as early as September 15, 2021.\n\nIssuer: Sectigo Public Code Signing CA R36\n\nIssued to: Blist LLC\n\nSerial number: 2f4a25d52b16eb4c9dfe71ebbd8121bb\n\nValid from: Monday, August 23, 2021 4:00:00 PM\n\nValid to: Wednesday, August 24, 2022 3:59:59 PM\n\n\n-----\n\n**BLISTER malware loader**\n\nAnother interesting aspect of this campaign is what appears to be a novel malware loader with limited\ndetections in VirusTotal. We refer to it as the BLISTER loader. The loader is spliced into legitimate\n[libraries such as colorui.dll, likely to ensure the majority of the on-disk footprint has known-good code](https://www.virustotal.com/gui/file/bf356c43e4f9fd1fa4e00fe276cedcba4b08905051c2c621276f36ba332bff1d/detection)\n[and metadata. The loader can be initially written to disk from simple dropper executables. One such](https://www.virustotal.com/gui/file/ed241c92f9bc969a160da2c4c0b006581fa54f9615646dd46467d24fe5526c7a)\ndropper writes a signed BLISTER loader to %temp%\\Framwork\\axsssig.dll and executes it with\n_rundll32. LaunchColorCpl is a common DLL export and entry point name used by BLISTER as seen_\nin the command line parameters:\n```\nRundll32.exe C:\\Users\\user\\AppData\\Local\\Temp\\Framwork\\axsssig.dll,LaunchColorCpl\n\n```\nOnce executed, BLISTER decodes bootstrapping code stored in the resource section with a simple 4byte XOR routine shown below:\n\nThe bootstrapping code is heavily obfuscated and initially sleeps for 10 minutes. This is likely an\nattempt to evade sandbox analysis. After the delay, it decrypts the embedded malware payload. We\nhave observed CobaltStrike and BitRat as embedded malware payloads. Once decrypted, the\nembedded payload is loaded into the current process or injected into a newly spawned WerFault.exe\nprocess.\n\nFinally, BLISTER establishes persistence by copying itself to the C:\\ProgramData folder, along with a\nre-named local copy of rundll32.exe. A link is created in the current user’s Startup folder to launch the\nmalware at logon as a child of explorer.exe.\n\n\n-----\n\n## YARA\n\nWe have created a YARA rule to identify this BLISTER activity:\n```\nrule Windows_Trojan_Blister{\n  meta:\n    author = “Elastic Security”\n    creation_date = \"2021-12-20\"\n    last_modified = \"2021-12-20\"\n    os = \"Windows\"\n    category_type = \"Trojan\"\n    family = \"Blister\"\n    threat_name = \"Windows.Trojan.Blister\"\n    reference_sample = \"0a7778cf6f9a1bd894e89f282f2e40f9d6c9cd4b72be97328e681fe32a1b1a00\"\n  strings:\n    $a1 = {8D 45 DC 89 5D EC 50 6A 04 8D 45 F0 50 8D 45 EC 50 6A FF FF D7}\n    $a2 = {75 F7 39 4D FC 0F 85 F3 00 00 00 64 A1 30 00 00 00 53 57 89 75}      \ncondition:\n    any of them\n}Read more\n\n## Defensive recommendations\n\n### Elastic Endpoint Alerts\n\n```\nElastic [Endpoint Security provides deep coverage for this threat by stopping the in-memory thread](https://www.elastic.co/endpoint-security/)\nexecution and preventing malicious behaviors.\n\n**Memory Threat Detection Alert: Shellcode Injection**\n\n**Malicious Behavior Detection Alert: Execution via Renamed Signed Binary Proxy**\n\n\n-----\n\n## Hunting queries\n\nThese queries can be used in Kibana's Security -> Timelines -> Create new timeline -> Correlation\nquery editor. While these queries will identify this intrusion set, they can also identify other events of\nnote that, once investigated, could lead to other malicious activities.\n\n**Proxy Execution via Renamed Rundll32**\n\nHunt for renamed instances of rundll32.exe\n```\nprocess where event.action == \"start\" and\nprocess.name != null and\n(process.pe.original_file_name == \"RUNDLL32.EXE\" and not process.name : \"RUNDLL32.EXE\")\n\n```\n**Masquerading as WerFault**\n\nHunt for potential rogue instances of WerFault.exe (Windows Errors Reporting) in an attempt to\nmasquerade as a legitimate system process that is often excluded from behavior-based detection as\na known frequent false positive:\n```\nprocess where event.action == \"start\" and \n process.executable : \n  (\"?:\\\\Windows\\\\Syswow64\\\\WerFault.exe\",\"?:\\\\Windows\\\\System32\\\\WerFault.exe\") and\n  /* \n   legit WerFault will have more than one argument in process.command_line\n  */\n process.args_count == 1\n\n```\n\n-----\n\nEvasion via Masquerading as WerFault and Renamed Rundll32\n**Persistence via Registry Run Keys / Startup Folder**\n\nMalware creates a new run key for persistence:\n```\nregistry where registry.data.strings != null and\n registry.path : (\n /* Machine Hive */   \"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*\", \n\"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run\\\\*\", \n\"HKLM\\\\Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Shell\\\\*\",  \n /* Users Hive */\n\"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*\", \n\"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run\\\\*\",\n\"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Shell\\\\*\"\n   )\n\n```\nPersistence via Run key\n**Suspicious Startup Shell Folder Modification**\n\nModify the default Startup value in the registry via COM (dllhost.exe) and then write a shortcut file for\npersistence in the new modified Startup folder:\n\n\n-----\n\n```\nsequence by host.id with maxspan 1m\n [registry where\n /* Modify User default Startup Folder */\n registry.path : (\n   \"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\User Shell\nFolders\\\\Common Startup\",\n   \"HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Shell Folders\\\\Common\nStartup\",\n   \"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\User Shell\nFolders\\\\Startup\",\n   \"HKEY_USERS\\\\*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Shell\nFolders\\\\Startup\"\n   ) ]\n /* Write File to Modified Startup Folder */\n  [file where event.type : (\"creation\", \"change\") and file.path :\n\"?:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\*\"]Read more\n\n```\nPersistence via Modified Startup\n\n**Elastic Detection Engine Rules**\n\nThe following existing public detection rules can also be used to detect some of the employed\ntechniques:\n\n[Potential Windows Error Manager Masquerading](https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_masquerading_werfault.toml)\n\n[Windows Defender Exclusions Added via PowerShell](https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_defender_exclusion_via_powershell.toml)\n\n[Startup or Run Key Registry Modification](https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_run_key_and_startup_broad.toml)\n\n[Shortcut File Written or Modified for Persistence](https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_startup_folder_file_written_by_suspicious_process.toml)\n\n[Suspicious Startup Shell Folder Modification](https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_evasion_registry_startup_shell_folder_modified.toml)\n\n## MITRE ATT&CK\n\n[T1218.011 - Signed Binary Proxy Execution: Rundll32](https://attack.mitre.org/techniques/T1218/011/)\n\n[T1055 - Process Injection](https://attack.mitre.org/techniques/T1055/)\n\n[T1547.001 - Registry Run Keys / Startup Folder](https://attack.mitre.org/techniques/T1547/001/)\n\n\n-----\n\n[T1036 - Masquerading](https://attack.mitre.org/techniques/T1036/)\n\n## Summary\n\nThe BLISTER loader has several tricks which has allowed it to fly under the radar of the security\ncommunity for months. This includes leveraging valid code signing certificates, infecting legitimate\nlibraries to fool machine learning models, and executing payloads in-memory. However, the depth of\nprotection offered with Elastic Security meant we were still able to identify and stop in-the-wild\nattacks.\n\nExisting Elastic Security can access these capabilities within the product. If you’re new to Elastic\nSecurity, take a look at our [Quick Start guides (bite-sized training videos to get you started quickly) or](https://www.elastic.co/training/free#quick-starts)\nour [free fundamentals training courses. You can always get started with a free 14-day trial of Elastic](https://www.elastic.co/training/free#fundamentals)\nCloud.\n\n## Indicators\n\n**Indicator** **Type** **Note**\n\nF3503970C2B5D57687EC9E31BB232A76B624C838 SHA1 Codesigning\ncertificate\nthumbprint\n\n\nmoduleloader.s3.eu-west-2.amazonaws[.]com\ndiscountshadesdirect[].com\nbimelectrical[.]com\nclippershipintl[.]com\n\n188.68.221[.]203\n93.115.18[.]248\n52.95.148[.]162\n84.38.183[.]174\n80.249.145[.]212\n185.170.213[.]186\n\ned6910fd51d6373065a2f1d3580ad645f443bf0badc398aa77185324b0284db8\ncb949ebe87c55c0ba6cf0525161e2e6670c1ae186ab83ce46047446e9753a926\n7b9091c41525f1721b12dcef601117737ea990cee17a8eecf81dcfb25ccb5a8f\n84a67f191a93ee827c4829498d2cb1d27bdd9e47e136dc6652a5414dab440b74\ncc31c124fc39025f5c3a410ed4108a56bb7c6e90b5819167a06800d02ef1f028\n9472d4cb393256a62a466f6601014e5cb04a71f115499c320dc615245c7594d4\n4fe551bcea5e07879ec84a7f1cea1036cfd0a3b03151403542cab6bd8541f8e5\n1a10a07413115c254cb7a5c4f63ff525e64adfe8bb60acef946bb7656b7a2b3d\n9bccc1862e3e5a6c89524f2d76144d121d0ee95b1b8ba5d0ffcaa23025318a60\n8a414a40419e32282d33af3273ff73a596a7ac8738e9cdca6e7db0e41c1a7658\n923b2f90749da76b997e1c7870ae3402aba875fdbdd64f79cbeba2f928884129\ned241c92f9bc969a160da2c4c0b006581fa54f9615646dd46467d24fe5526c7a\n294c710f4074b37ade714c83b6b7bf722a46aef61c02ba6543de5d59edc97b60\n\n\nDomain\nname\n\nIP\nAddress\n\n\nMalware\nc2\n\nMalware\nc2\n\n\nsha256 Signed\nDroppers\n\n\n-----\n\ndf8142e5cf897af65972041024ebe74c7915df0e18c6364c5fb9b2943426ed1a\n2d049f7658a8dccd930f7010b32ed1bc9a5cc0f8109b511ca2a77a2104301369\n696f6274af4b9e8db4727269d43c83c350694bd1ef4bd5ccdc0806b1f014568a\na34821b50aadee0dd85c382c43f44dae1e5fef0febf2f7aed6abf3f3e21f7994\n7cd03b30cfeea07b5ea4c8976e6456cb65e09f6b8e7dcc68884379925681b1c4\n81edf3a3b295b0189e54f79387e7df61250cc8eab4f1e8f42eb5042102df8f1f\n44e5770751679f178f90ef7bd57e8e4ccfb6051767d8e906708c52184bf27f32\n0a7778cf6f9a1bd894e89f282f2e40f9d6c9cd4b72be97328e681fe32a1b1a00\na486e836026e184f7d3f30eaa4308e2f0c381c070af1f525118a484a987827c1\n359ffa33784cb357ddabc42be1dcb9854ddb113fd8d6caf3bf0391380f9d640a\n863228efa55b54a8d03a87bb602a2e418856e0028ae409357454a6303b128224\nd0f934fd5d63a1524616bc13b51ce274539a8ead9b072e7f7fe1a14bb8b927a6\nc0f3b27ae4f7db457a86a38244225cca35aa0960eb6a685ed350e99a36c32b61\n216cb4f2caeaf59f297f72f7f271b084637e5087d59411ac77ddd3b87e7a90aa\n00eb2f75822abeb2e222d007bdec464bfbc3934b8be12983cc898b37c6ace081\n25a0d6a839c4dc708dcdd1ef9395570cc86d54d4725b7daf56964017f66be3c1\n3c7480998ade344b74e956f7d3a3f1a989aaf43446163a62f0a8ed34b0c010d0\n5651e8a8e6f9c63c4c1162efadfcb4cdd9ad634c5e00a5ab03259fcdeaa225ac\nba3a50930e7a144637faf88a98f2990a27532bfd20a93dc160eb2db4fbc17b58\nfa885e9ea1293552cb45a89e740426fa9c313225ff77ad1980dfea83b6c4a91c\nbee3210360c5d0939c5d38b7b9f0c232cf9fbf93b46a19e53930a1606bda28a5\n56ca9ea3f7870561ed3c6387daf495404ed3827f212472501d2541d5ccf8b941\nc61d2ba1e001c137533cd7fb6b38fe71fee489d61dbcfea45c37c5ec1bcf845c\n17ea84d547e97a030d2b02ac2eaa9763ffb4f96f6c54659533a23e17268aabab\nca09d9cd2f3cfcc06b33eff91d55602cb33a66ab3fd4f540b9212fce5ddae54a\n6c6f808f9b19e1fab1c1b83dc99386f0ceee8593ddfd461ac047eae812df8733\n\nafb77617a4ca637614c429440c78da438e190dd1ca24dc78483aa731d80832c2\n516cac58a6bfec5b9c214b6bba0b724961148199d32fb42c01b12ac31f6a6099\n8ae2c205220c95f0f7e1f67030a9027822cc18e941b669e2a52a5dbb5af74bc9\nfe7357d48906b68f094a81d19cc0ff93f56cc40454ac5f00e2e2d9c8ccdbc388\naf555d61becfcf0c13d4bc8ea7ab97dcdc6591f8c6bb892290898d28ebce1c5d\n96bf7bd5f405d3b4c9a71bcd1060395f28f2466fdb91cafc6e261a31d41eb37a\nf5104d0ead2f178711b1e23db3c16846de7d1a3ac04dbe09bacebb847775d76d\n8e22cf159345852be585bc5a8e9af476b00bc91cdda98fd6a3244219a90ac9d9\nd54dfedda0efa36ed445d501845b61ab73c2102786be710ac19f697fc8d4ca5c\n\nLauncher V7.3.13.exe\nGuiFramwork.exe\nffxivsetup.exe\nPredictor V8.21 - Copy.exe\nPredictor Release v5.9.rar\nPredictorGUI.exe\nReadhelper.exe\ndxpo8umrzrr1w6gm.exe\nPers.exe\nrazer.exe\nAmlidiag.exe\nModern.exe\niuyi.exe\nCleandevicehelper.exe\ninstaller.exe\n\n\nsha256 Unsigned\nBLISTER\nLoader\nDLL\n\nsha256 Signed\nBLISTER\nLoader\nDLL\n\n\nFile\nname\n\n\nDropper\nNames\n\n\n-----\n\nHolorui.dll\nColorui.dll\nPasade.dll\nAxsssig.dll\nHelper.CC.dll\nHeav.dll\nPasadeis.dll\nTermmgr.dll\nTermService.dll\nrdpencom.dll\nlibcef.dll\ntnt.dll\n\n**We're hiring**\n\n\nFile\nname\n\n\nBLISTER\nDLL\nNames\n\n\nWork for a global, distributed team where finding someone like you is just a Zoom meeting\naway. Flexible work with impact? Development opportunities from the start?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-23 - Elastic Security uncovers BLISTER malware campaign.pdf"
    ],
    "report_names": [
        "2021-12-23 - Elastic Security uncovers BLISTER malware campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536181,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653693505,
    "ts_modification_date": 1653693505,
    "files": {
        "pdf": "https://archive.orkl.eu/7d3df93dc1cfc59dba1c2d60dedcd5871b54d8e4.pdf",
        "text": "https://archive.orkl.eu/7d3df93dc1cfc59dba1c2d60dedcd5871b54d8e4.txt",
        "img": "https://archive.orkl.eu/7d3df93dc1cfc59dba1c2d60dedcd5871b54d8e4.jpg"
    }
}