{
    "id": "c6634960-6eae-4160-b6d1-70c88a924b46",
    "created_at": "2023-01-12T15:00:32.926772Z",
    "updated_at": "2025-03-27T02:05:18.634157Z",
    "deleted_at": null,
    "sha1_hash": "a3f4e0ba37b27bf365c7fe1d62c65332ae0cb05b",
    "title": "2021-01-16 - Babuk Ransomware v3",
    "authors": "",
    "file_creation_date": "2022-05-27T23:23:44Z",
    "file_modification_date": "2022-05-27T23:23:44Z",
    "file_size": 584479,
    "plain_text": "# Babuk Ransomware v3\n\n**[chuongdong.com/reverse engineering/2021/01/16/BabukRansomware-v3/](https://chuongdong.com/reverse%20engineering/2021/01/16/BabukRansomware-v3/)**\n\nChuong Dong January 16, 2021\n\n[Reverse Engineering · 16 Jan 2021](https://chuongdong.com/categories/#reverse%20engineering)\n\n## Overview\n\nThis is a short report for the latest Babuk ransomware sample. This sample is marked as version 3 based\non the run-once mutex string.\n\nFor this new version, the malware author keeps most of the old functionalities the same except for the\nencryption scheme and the multithreading approach.\n\n[Since I have covered Babuk old sample here, I will only discuss the new changes in this report.](http://chuongdong.com/reverse%20engineering/2021/01/03/BabukRansomware/)\n\nFor encryption, Babuk uses ChaCha20 encryption, but the Elliptic-curve Diffie–Hellman (ECDH) key\ngeneration and exchange algorithm is changed from NIST K-571 to [Curve25519, one of the fastest ECDH](https://en.wikipedia.org/wiki/Curve25519)\ncurves.\n\n## IOCS\n\nBabuk v3 comes in the form of a 32-bit .exe file.\n\n**MD5: 8b9a0b44b738c7884e6a14f4cb18afff**\n\n**SHA256: 704a0fa7de19564bc743fb68aa0652e38bf86e8ab694bc079b15f945c85f4320**\n\n**Sample:**\nhttps://bazaar.abuse.ch/sample/704a0fa7de19564bc743fb68aa0652e38bf86e8ab694bc079b15f945c85f4320/\n\n\n-----\n\n_Figure 1: VirusTotal result for Babuk v3_\n\n## Ransom Note\n\n_Figure 2: Babuk’s new ransom note_\n\n## New Changes\n\n### Run-Once Mutex\n\n\n-----\n\nIn the beginning, Babuk checks if a mutex with the name **babuk_v3 exists through the call to**\n**OpenMutexA. If it already exists, the malware exits immediately.**\n\nThis is commonly used by malware to prevent themselves from having multiple instances running at once.\n\n_Figure 3: Babuk checking for mutex_\n\n### Command-line Arguments\n\nBabuk can work with or without command line parameters.\n\nThe new command line parameters are “lanfirst”, “nolan”, and “shares”.\n\n\n-----\n\n_Figure 4: Babuk checking for mutex_\n\nIf a parameter is given, it will process these arguments upon execution and behave accordingly.\n\n**CMD Args** **Functionality**\n\n-lanfirst Encrypting other drives on LAN and locally\n\n-nolan Encrypting locally\n\nshares Encrypting shared drives and locally\n\n### Multithreading\n\nThe multithreading implementation has been changed a lot since the first version. I guess they really tried\nto improve it after reading what I had to say in the last blog post\n\n_Figure 5: Babuk team’s friendly response to my analysis!_\n\nThe steps taken to improve the ransomware’s threading functionalities are in the right direction since they\ndo increase the encryption speed by quite a bit.\n\nBabuk uses a structure similar to a circular queue (Ring Buffer) backed by an array to store file names to\nencrypt. The queue size is double the number of processors on the system, which is the same amount of\nchild threads being spawned.\n\n_Figure 6: Queue initialization_\n\n\n-----\n\nThis queue is shared and used by child threads.\n\nThe parent thread will recursively crawl through directories and enqueue the file names it finds to the head\nof the queue. The child threads will start dequeuing them at the tail of the queue to begin encryption.\n\n_Figure 7: Babuk’s circular queue illustration_\n\nFirst, Babuk will spawn child threads. The number of threads being spawned is double the number of\n[processors. This is clearly not a good amount so I have no idea why they still use it similar to the previous](https://docs.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-createthread#remarks)\nversion.\n\n_Figure 8: Spawning child threads_\n\nThe Babuk parent thread then proceeds to traverse through an entire drive by checking whether it has\nencountered a directory or a file.\n\nUpon finding a directory, it will call that function again and go down another layer to recursively traverse\nthat directory.\n\n\n-----\n\nUpon finding a file, it will enqueue that file to the head of the queue and move on.\n\n_Figure 9: Babuk parent thread traversing through directories and enqueuing files_\n\nEach child thread will dequeue a file at the tail of the queue and encrypt it.\n\n\n-----\n\n_Figure 10: Babuk child threads dequeuing and encrypting files_\n\nHere is the implementation for enqueuing and dequeuing files.\n\n_Figure 11: Function to enqueue files_\n\n\n-----\n\n_Figure 12: Function to dequeue files_\n\nAs we can see, Babuk uses a file queue backed by an array. By keeping track of the head and tail indices,\nadding and removing file names from the queue take a constant time and are really fast.\n\nWith all of these new changes to the implementation, this new version of Babuk is much faster than the\noriginal one. Unfortunately, there is still a lot more room for improvement since it is nowhere near Conti\nand other ransomware in terms of speed and efficiency.\n\nWith an array-backed queue, space is limited. As we can see in the enqueue function, there is no check to\nsee if the queue is full before adding more files onto it. In the theoretical case where all the threads are\nbusy encrypting files and the queue is full, the parent thread will continue adding more files. Since this is a\ncircular queue, this will result in files being overwritten with new ones before the child threads have a\nchance to encrypt them if the parent thread is fast enough.\n\nMoreover, the malware author still sticks with the old recursive approach to traversing files. With only the\nparent thread traversing entire drives, there will be an extreme amount of overhead from the stack frame\nsince there will be too many recursion layers. This essentially makes the total encryption time dependent\non the time it takes for one thread to traverse the entire system.\n\n### Encryption\n\nEncryption scheme remains the same from the original version. However, there is a slight change in the\nChaCha20 key generation.\n\nFor every file, a random buffer of 32 bytes is generated using CryptGenRandom.\n\n\n-----\n\n_Figure 13: Generating random buffer_\n\n[Next, using the this exact piece of Curve25519 implementation, Babuk will generate a public key for the](https://github.com/agl/curve25519-donna/blob/master/curve25519-donna.c)\nvictim from the random buffer using ECDH.\n\nIt will also generate a shared secret using its hard-coded public key and the random buffer. This shared\nsecret is eventually used as the ChaCha20 key to encrypt the file.\n\n\n-----\n\n_Figure 14: Public key and shared secret generation_\n\nFinally, the victim’s public key is then written to the end of the file to be used for decryption if the victim\ndecides to pay.\n\n_Figure 15: Victim’s public key being written to the end of file_\n\nNot sure if this was intended, but I believe the Babuk group has messed up the public key generation\nphase.\n\nAccording to [Dan Bernstein who was the author of this Diffie-Hellman function, here is the procedure of](https://cr.yp.to/djb.html)\ngenerating a public key using Curve25519.\n\n_Figure 16: Curve25519 Public Key Generation_\n\nInstead of using 9 followed by all zeroes, Babuk uses an array of all 9 values.\n\n_Figure 17: Babuk’s basepoint constant_\n\nUnless the malware author has modified the math in the Curve25519 source code to accommodate for\nthis (which is unlikely), this basepoint constant might not generate a correct public key.\n\nWith an incorrect public key, it’s impossible for the malware author to generate the correct shared secret to\ndecrypt files.\n\n## Key Findings\n\nThe new version of Babuk has been improved to encrypt files at a much faster rate using a better\nmultithreading approach. Despite still having a lot to improve, Babuk has been really effective in attacking\nmany corporations using ChaCha20 encryption as well as Elliptic-curve Diffie–Hellman algorithm.\n\nAs suspected, the Babuk team probably uses spear phishing attacks, VPN 0-days, and vulnerable RDP\nsetup to target certain companies. They have dropped this sample specifically targeting a mechanical\ncontractor in Austria according to the ransom note and the conversation with the victim on their website.\n\n\n-----\n\n_Figure 18: Babuk team asking the victim to provide their company email_\n\n## Message to newer victims\n\nI recently notice I’m getting a lot more traffic from Europe on this page, which I’m assuming newer victims\nare viewing this to better their understanding of the ransomware.\n\nThis blog post is really out of date because Babuk has evolved a lot, and the malware is drastically\ndifferent from what I talk about here.\n\nIf recent Babuk victims are interested in getting more information about the newer version of this\nransomware or require any assistance with analyzing any sample, feel free to reach out to me through my\nemail cdong49@gatech or Twitter!\n\n## YARA Rule\n```\nrule BabukRansomwareV3 {\n  meta:\n    description = \"YARA rule for Babuk Ransomware v3\"\n    reference = \"http://chuongdong.com/reverse%20engineering/2021/01/16/BabukRansomware-v3/\"\n    author = \"@cPeterr\"\n    date = \"2021-01-16\"\n    rule_version = \"v3\"\n    malware_type = \"ransomware\"\n    tlp = \"white\"\n  strings:\n    $lanstr1 = \"-lanfirst\"\n    $lanstr2 = \"-nolan\"\n    $lanstr3 = \"shares\"\n    $str1 = \"BABUK LOCKER\"\n    $str2 = \"babukq4e2p4wu4iq.onion\"\n    $str3 = \"How To Restore Your Files.txt\" wide\n    $str4 = \"babuk_v3\"\n    $str5 = \".babyk\" wide\n  condition:\n    all of ($str*) and all of ($lanstr*)\n}\n\n References\n\n```\nhttps://twitter.com/Sebdraven/status/1350025347690098689\n\nhttp://chuongdong com/reverse%20engineering/2021/01/03/BabukRansomware/\n\n\n-----\n\nhttps://cr.yp.to/ecdh.html\n\nhttps://github.com/agl/curve25519-donna/blob/master/curve25519-donna.c\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-16 - Babuk Ransomware v3.pdf"
    ],
    "report_names": [
        "2021-01-16 - Babuk Ransomware v3.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535632,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653693824,
    "ts_modification_date": 1653693824,
    "files": {
        "pdf": "https://archive.orkl.eu/a3f4e0ba37b27bf365c7fe1d62c65332ae0cb05b.pdf",
        "text": "https://archive.orkl.eu/a3f4e0ba37b27bf365c7fe1d62c65332ae0cb05b.txt",
        "img": "https://archive.orkl.eu/a3f4e0ba37b27bf365c7fe1d62c65332ae0cb05b.jpg"
    }
}