{
    "id": "c6b650de-c16f-4c72-b527-984bce814810",
    "created_at": "2023-01-12T15:08:20.535419Z",
    "updated_at": "2025-03-27T02:13:34.621588Z",
    "deleted_at": null,
    "sha1_hash": "7005b4a87c2f3706634dece88d13a6220ab5d533",
    "title": "2021-12-01 - Toss a Coin to your Helper (Part 2 of 2)",
    "authors": "",
    "file_creation_date": "2022-05-28T18:58:02Z",
    "file_modification_date": "2022-05-28T18:58:02Z",
    "file_size": 3331962,
    "plain_text": "# Toss a Coin to your Helper (Part 2 of 2)\n\n**decoded.avast.io/janrubin/toss-a-coin-to-your-helper**\n\nby [Jan Rubín and Jakub KaločDecember 1, 202133 min read](https://decoded.avast.io/janrubin/toss-a-coin-to-your-helper)\n\n\nDecember 1, 2021\n\n\nIn the first [posting of this series, we looked at a clipboard stealer belonging to the MyKings botnet.](https://decoded.avast.io/janrubin/the-king-is-dead-long-live-mykings/)\nIn this second part of the blog series, we will discuss in detail a very prevalent malware family of\nAutoIt droppers, that we call CoinHelper, used in a massive coinmining campaign. Since the\nbeginning of 2021, Avast has protected more than 125,000 users worldwide from this threat.\nCoinHelper is mostly bundled with cracked software installers such as WinRAR and game cheats.\n\nRegarding game cheats, we’ve seen this bundling with some of the most popular and famous\ngames out there including (but not limited to): Extrim and Anxious (Counter-Strike Global Offensive\ncheats), Cyberpunk 2077 Trainer (Cyberpunk 2077 cheat), PUBG and CoD cheats, and Minecraft.\nWe’ve also found this threat inside a Windows 11 ISO image from unofficial sources (as we\n[indicated on Twitter). We have even seen this threat bundled with clean software such as Logitech](https://twitter.com/AvastThreatLabs/status/1458442805357867015)\ndrivers for webcams. All in all, we have seen CoinHelper bundled with more than 2,700 different\nsoftware so far, including games, game cheats, security software, utilities, clean and malware\napplications alike.\n\nOur research brought us to this because we have seen a spread of these droppers via MyKings’\n[clipboard stealer payload as well, as described in our previous part of the blog post series.](https://decoded.avast.io/janrubin/the-king-is-dead-long-live-mykings/)\nNevertheless we can’t attribute CoinHelper to MyKings botnet, on the contrary based on the\nnumber of different sources of infection, we believe that CoinHelper used MyKings’ clipboard\nstealer as an additional system of malware delivery.\n\nWe have found some mentions of these AutoIt droppers in other blog posts from last year. One of\n[the most notable instances was detailed by Trend Micro, describing a sample of the AutoIt dropper](https://www.trendmicro.com/en_us/research/20/d/zoomed-in-a-look-into-a-coinminer-bundled-with-zoom-installer.html)\n\n\n-----\n\nbundled with Zoom communicator (downloaded from an unofficial source) which happened in the\nearly days of the COVID-19 pandemic when millions of new users were flocking to Zoom. Another\ninstance is in a post from [Cybereason mentioning a new dropper for XMRig miners.](https://www.cybereason.com/blog/the-hole-in-the-bucket-attackers-abuse-bitbucket-to-deliver-an-arsenal-of-malware)\n\nIn this blog post, we analyze the latest version of CoinHelper in detail, discuss the malware\ncampaign, describe all its components as well as research into what applications are most often\nbundled with the malware and show how the malware spreads. We also outline some of the data\nharvesting that it performs on infected systems to map the infected victims.\n\n## Campaign overview\n\nSince the beginning of 2020, we have seen more than 220,000 attempts to infect our users with\nCoinHelper, most of them being in Russia (83,000). The second most targeted country is Ukraine\nwith more than 42,000 attacked users.\n\nMap illustrating the targeted countries since the beginning of 2020\n\n## Monetary gain\n\nOne of the primary goals of CoinHelper is to drop a crypto miner on the infected machine and use\nthe resources (electricity and computing power) of the victim’s computer to generate money for the\nattackers through mining.\n\nEven though we observed that multiple crypto currencies, including Ethereum or Bitcoin, were\nmined, there was one particular that stood out – Monero. From the total of 377 crypto wallet\naddresses we extracted from the malware, 311 of them mined Monero through crypto mining pools.\nThe reasons for criminals to choose Monero are quite obvious. Firstly, this cryptocurrency was\n\n\n-----\n\ncreated and designed to be private and anonymous. This means that tracing the transactions,\nowners of the accounts or even amounts of money that were stolen and/or mined can be quite\ndifficult. Secondly, this cryptocurrency has a good value at this time – you can exchange 1 XMR\nfor ~$240 USD (as of 2021-11-29)\n\nEven though Monero is designed to be anonymous, thanks to the wrong usage of addresses and\nthe mechanics of how mining pools work, we were able to look more into the Monero mining\noperation of the malware authors and find out more about how much money they were able to\ngain.\n\nTo ensure more regular income, the miners were configured to use Monero mining pools. Mining\npools are often used by miners to create one big and powerful node of computing power that works\ntogether to find a suitable hash and collect a reward for it. Because the search for the suitable hash\nis random, the more guesses you make, the bigger your chance to be successful. In the end, when\nthe pool receives a reward, the money is split between the members of the pool depending on their\nshare of work. Usage of the pools is very convenient for malware authors, specifically because\npools work with a limited time. This is helpful for malware authors because it gives them a greater\nchance to successfully mine cryptocurrency in the limited time they have before their miners are\ndiscovered and eradicated.\n\nIn total we registered 311 Monero addresses used in the configuration of miners dropped by the\nAutoIts. These addresses were used in more than 15 different Monero mining pools whereas our\ndata and research confirm that the mining campaign is even bigger and a lot of the addresses were\nused across multiple pools. After diving more into the data that the pools offer, we are able to\nconfirm that as of 2021-11-29 the authors gained more than 1,216 XMR solely by crypto mining,\nwhich translates into over $290,000 USD.\n\nApart from the Monero addresses, we also registered 54 Bitcoin addresses and 5 Ethereum\naddresses. After looking at these addresses we can conclude that these addresses received\nfollowing amounts of money:\n\n**Cryptocurrency** **Earnings in USD** **Earnings in cryptocurrency** **Number of wallets**\n\nMonero $292,006.08 1,216.692 [XMR] 311\n\nBitcoin $46,245.37 0.796 [BTC] 54\n\nEthereum $1,443.41 0.327 [ETH] 5\n\nTable with monetary gain (data refreshed 2021-11-29)\nThis makes total monetary gain of this malware 339,694.86 USD as of 2021-11-29. The amounts\nfrom the table above are total incomes of the Bitcoin and Ethereum wallets, so we can’t exclude\nthe possibility that some part of money comes from other activities than mining, but we assume\nthat even those activities would be malicious. As can be seen from the data we collected, the major\nfocus of this campaign is on mining Monero, where attackers used ~5 times more wallet addresses\nand gained ~6 times more money.\n\n## Technical analysis\n\n\n-----\n\n## Dropping the payload\n\nLet’s continue straight away where we left off in the [previous part. As we learned, the clipboard](https://decoded.avast.io/janrubin/the-king-is-dead-long-live-mykings/)\nstealer could swap copy+pasted wallet addresses in the victim’s clipboard, as well as swap other\nlinks and information depending on the malware’s configuration. One of these links was\n```\nhttps://yadi[.]sk/d/cQrSKI0591KwOg .\n\n```\nAfter downloading and unpacking the archive (with a password `gh2018 ), a new sample`\n```\nLauncher.exe is dropped\n\n```\n( c1a4565052f27a8191676afc9db9bfb79881d0a5111f75f68b35c4da5be1f385 ). Note that this\napproach is very specific for the MyKings clipboard stealer and requires user’s interaction. In other,\nand most common, cases the user obtains a whole bundled installer from the internet,\nunintentionally executing the AutoIt during the installation of the expected software.\n\nThis sample is the first stage of a compiled AutoIt script, a dropper that we call CoinHelper, which\nprovides all necessary persistence, injections, checking for security software along the way, and of\ncourse downloading additional malware onto the infected machine.\n\nAlthough this sample contains almost all of the latest functionality of these AutoIt droppers, it is not\nthe latest version and some of their features are missing. For that reason, we decided to take a\nnewer (but very similar) version of the dropper with a SHA\n```\n83a64c598d9a10f3a19eabed41e58f0be407ecbd19bb4c560796a10ec5fccdbf instead and\n\n```\ndescribe thoroughly all of the functionalities in one place.\n\n\n-----\n\n## Overview of the infection chain\n\n\n-----\n\n-----\n\n## Exploring the first stage\n\nLet’s dive into the newer sample. This one is usually downloaded with a name `start.exe on`\nusers’ machines and holds a Google Chrome icon. Upon a closer look, it is apparent that this is a\ncompiled AutoIt binary.\n\nAfter extracting the AutoIt script from the sample we can see additional components:\n```\n   asacpiex.dll\n   CL_Debug_Log.txt\n   glue\\ChromeSetup.exe\nCL_Debug_Log.txt is a clean standalone executable of 7zip and asacpiex.dll is a damaged\n\n```\n(modified) 7zip archive carrying the second stage of the malware. Soon, we will fix this archive and\nlook inside as well, but first, let’s focus on the extracted AutoIt script. The last binary from the list\nabove, placed in the `glue folder, is one of the many possibilities of the bundled apps inside`\nCoinHelper. In this case, we witness a clean setup installer of the Chrome browser. If you are\ninterested in seeing what other applications are usually bundled with CoinHelper, see Bundled\napps overview for details.\n\n### Rude welcome\n\nThe AutoIt script is actually very readable. Well, perhaps even too much, looking at the vulgarity in\nthe beginning. Note that `Region /` `EndRegion is SciTE text editor’s feature to mark code`\nregions. In this case, however, the script starts with the `EndRegion clausule and some well`\n\n\n-----\n\nknown AutoIt decompilers, such as Exe2Aut (v0.10), struggle very much with this and are unable to\ndecompile the script, effectively displaying just the rude welcome. Note that myAut2Exe (v2.12) for\nexample has no issues with the decompilation.\n\nWe can also see here the beginning of the malware’s configuration, first checking for the existence\nof a mutex `QPRZ3bWvXh (function called` `_singleton ), followed by scheduled task configuration.`\nAs shown in the code above, the `SystemCheck scheduled task presents itself as a` `Helper.exe`\napplication from Microsoft. However, Microsoft doesn’t provide any tool with such a name. The\nscheduled task is used for executing the malware, persistently.\n\nThe modification of the `asacpiex.dll archive was done by nulling out the first five bytes of the`\nfile which can be easily restored to reflect the usual 7zip archive header: `37 7A BC AF 27 . The`\nscript is replacing even more bytes, but that is not necessary.\n\nBefore we dive into the contents extracted from the archive (a keen eye already spotted that the\npassword is `JDQJndnqwdnqw2139dn21n3b312idDQDB ), let’s focus on the rest of this script. We will`\ncontinue with the unpacking of `asacpiex.dll in the` Exploring the second stage section.\n\n\n-----\n\nIn the code above, we also see that `ChromeSetup.exe is placed into the glue folder. This folder`\n(sometimes called differently, e.g. `new ) contains the original application with which the malware`\nwas bundled together. In our analysis we are showing here, this is a clean installer of the Chrome\nbrowser that is also executed at this stage to preserve the expected behavior of the whole bundle.\n\nWe encountered many different applications bundled with CoinHelper. Research regarding these\nbundles is provided in a standalone subsection Bundled apps overview.\n\n### Mapping the victims\n\nIn addition to fixing the damaged archive, executing the second stage, and ensuring persistence,\nthe first stage holds one additional functionality that is quite simple, but effective.\n\nThe malware uses public services, such as IP loggers, to aggregate information about victims. The\nIP loggers are basically URL shorteners that usually provide comprehensive telemetry statistics\nover the users clicking on the shortened link.\n\nAdditionally, as we will see further in this blogpost, the attacker harvests information about victims,\nfocusing on the victim’s OS, amount of RAM installed, the CPU and video card information, as well\nas the security solutions present on the system. All the collected information is formatted and\nconcatenated to a single string.\n\nThis string is then sent to a hardcoded URL address in the form of a user-agent via GET request.\nIn our sample, the hardcoded URL looks like `https://2no[.]co/1wbYc7 .`\n\nNote that URLs such as these are sometimes also used in the second stage of CoinHelper as well.\nFrom our dataset, we have found 675 different URLs where the malware sends data.\n\nBecause the attackers often use public services without authentication, we can actually peek inside\nand figure out the figures from their perspective. The bottom line is that they are making a\nstatistical evaluation of their various infection vectors (bundled installers from unofficial software\nsources, torrents, MyKings botnet, and more) across the infected user base, effectively trying to\nfocus on people with higher-end machines as well as getting to know which regions in the world\nuse what antivirus and/or security solutions.\n\nAs an example, we can see information available on one of the many still-active links containing a\ndate and time of the click, IP address (anonymized) and ISP, corresponding geolocation, used web\nbrowser and of course, the user-agent string with the harvested data.\n\n\n-----\n\nAttacker’s view on the infected victims (black squares are anonymized IP addresses)\nThe attacker also has access to the geographic location of the victims in a map view.\n\n\n-----\n\nAttacker’s view on the geographic information of the infected victims\nIn the sections below, the reader can find further details of how the information is obtained in the\nfirst stage of the malware, along with further details about the harvested data.\n\n### Checking the CPU\n\nThe malware executes one of the two variants of shellcodes (x86 and x64), present in hexadecimal\nform:\n```\n   0x5589E5538B45088B4D0C31DB31D20FA28B6D10894500895D04894D0889550C5B5DC3\n   0x5389C889D131DB31D20FA26741890067418958046741894808674189500C5BC3\n\n```\nWhen we disassemble the shellcodes, we can see common `cpuid checks, returning all its values`\n(registers `EAX,` `EBX,` `ECX,` `EDX ). Thus, the malware effectively harvests all the information of`\nthe currently present processor of the victim, its model and features.\n\n\n-----\n\nx86\n\nCPUID check\n\nx64 CPUID check\nAll the information is parsed and particular features are extracted. Actually, the feature lists in the\n[malware are identical to the CPUID Wikipedia page, exactly pointing out where the attacker was](https://en.wikipedia.org/wiki/CPUID)\ninspired.\n\nEven though all the information is harvested, only the AES instruction set bit is actually checked –\nif the processor supports this instruction set and it is x64, only then it will install the x64 bit version\nof the final stage (coinminer). In the other case, the x86 version is used.\n\nAs we mentioned, the rest of the information is collected, but it is actually not used anywhere in the\ncode.\n\n### CPU and video card information\n\nThe cpuid check is not the only one that performs HW checks on the victim’s system. Two\nadditional WMI queries are used to obtain the names of the victim’s processor and video card:\n\n```\nSELECT * FROM Win32_Processor\n\n```\n```\nSELECT * FROM Win32_VideoController\n\n```\n\n-----\n\nFurthermore, the malware uses `GetSystemInfo to collect the` `SYSTEM_INFO structure to check`\nthe number of cores the victim’s CPU has.\n\n### AV checks\n\nThe script also checks for running processes, searching for security solutions present on the\nmachine. This information is once again “just” logged and sent to the IP logging server – no other\naction is done with this information (e.g. altering malware’s functionality).\n\nThe complete list of all the checked AV / Security solutions by their processes, as presented in the\nmalware, can be found in Appendix.\n\n## Exploring the second stage – asacpiex.dll\n\nNow, let’s dive into the second stage of the malware. After the `asacpiex.dll archive is fixed, it is`\nsaved as `CR_Debug_Log.txt to the` `Temp folder.`\n\nTo unpack the archive, the malware uses a password `JDQJndnqwdnqw2139dn21n3b312idDQDB .`\nThis is the most common password for these AutoIt droppers. However, it is not the only one and\nso far, we counted two additional passwords:\n```\n   dkwqdqw9324328NDQDN@@!)(#($%&^!ND21\n   jDWQJkdqkwdqo2m@mdwmsxPAS,sq%\n\n```\nUnpacking reveals two additional files:\n```\n   32.exe\n   64.exe\n\n```\nDepending on the architecture of the OS and whether the AES instruction set is available, one of\nthese files is copied into\n\n```\nC:\\Users\\<username>\\AppData\\Roaming\\Microsoft\\Windows\\Helper.exe\n\n```\n\nand executed (via a scheduled task).\n\nBoth of these files are once again compiled AutoIt scripts, carrying functionality to distribute further\npayloads, in the form of coinminers, to victims via Tor network.\n\nAfter the decompilation of the files, we can see that both of the output scripts are very similar. The\nonly difference is that the x64 version tries to also utilize the user’s graphic card as well if possible\nfor coinmining, not just the CPU. In the text below, we will focus on the x64 version since it contains\nmore functionality.\n\nAlthough `Helper.exe is the most common name of the malware by far, it is not the only`\npossibility. Other options we’ve seen in the wild are for example:\n\n```\nSystem.exe\n\n```\n\n-----\n\n```\nsystem32.exe\n\n```\n\n### Helper.exe\n\nAs we already mentioned, the primary goal of the `Helper.exe dropper is to drop an XMRig`\ncoinminer onto the victim’s system via Tor network. The coinminer is executed with a hardcoded\nconfiguration present in the script.\n```\nHelper.exe holds a variety of other functionalities as well, such as performing several system\n\n```\nchecks on the victim’s PC, injecting itself into `%WINDIR%\\System32\\attrib.exe system binary,`\nchecking the “idleness” of the system to intensify the mining, and more. Let’s now have a look at\nhow all these functionalities work.\n\n**Downloading coinminers via Tor network**\n\nThe main purpose of the dropper is to download a payload, in our case a coinminer, onto the\ninfected system. To do so, the malware performs several preparatory actions to set up the\nenvironment to its needs.\n\nFirst and foremost, the malware contains two additional files in hexadecimal form. The first is once\nagain a clean 7zip binary (but different than `CL_Debug_Log.txt ) and the second one is a 7zip`\narchive containing a clean Tor binary and belonging libraries:\n```\n   libcrypto-1_1-x64.dll\n   libevent-2-1-7.dll\n   libevent_core-2-1-7.dll\n   libevent_extra-2-1-7.dll\n   libgcc_s_seh-1.dll\n   libssl-1_1-x64.dll\n   libssp-0.dll\n   libwinpthread-1.dll\n   tor.exe\n   zlib1.dll\n\n```\nTo be able to unpack Tor, a password `DxSqsNKKOxqPrM4Y3xeK is required. This password is also`\nrequired for unpacking every downloaded coinminer as well, but we will get to that later.\n\nAfter Tor is executed, it listens on port `9303 on localhost ( 127.0.0.1 ) and waits for requests. To`\nprevent confusion at this point, note that this execution is hidden by default because `tor.exe`\nshould not be mistaken for a Tor browser. `tor.exe is a process providing Tor routing (without a`\nGUI). In a common Tor browser installation, it can be usually found in `\\<Tor browser root`\n```\nfolder>\\Browser\\TorBrowser\\Tor\\tor.exe .\n\n```\nThe script further contains a few Base64 encoded Tor addresses of the C&C servers and tries\nwhich one is alive. This is done by initializing SOCKS4 communication via a crafted request (in the\nhexadecimal form):\n\n\n-----\n\n```\n04 01 00 50 00 00 00 FF 00 $host 00\n\n```\nwhere `$host is the demanded server address.`\n\nThe malware expects one of the standard protocol responses and only if the response contains\n```\n0x5A byte, the malware will further proceed to communicate with the server.\n\n```\n**Byte** **Meaning**\n\n0x5A Request granted\n\n0x5B Request rejected or failed\n\n0x5C Request failed because client is not running identd (or not reachable from server)\n\n0x5D Request failed because client’s identd could not confirm the user ID in the request\n\nSource: [https://en.wikipedia.org/wiki/SOCKS](https://en.wikipedia.org/wiki/SOCKS)\n\n\n-----\n\nThe lists of Tor addresses differ quite a bit across multiple samples. So far we ve seen 24 unique\n[C&C servers (see our IoC repository for the complete list). However, at the time of writing, only two](https://github.com/avast/ioc/tree/master/CoinHelper/network.txt)\nof all the servers were still active:\n```\n   2qepteituvpy42gggxxqaaeozppjagsu5xz2zdsbugt3425t2mbjvbad[.]onion\n   jbadd74iobimuuuvsgm5xdshpzk4vxuh35egd7c3ivll3wj5lc6tjxqd[.]onion\n\n```\nIf we access the server using e.g. Tor browser, we can see a default Windows Server landing page,\nillustrated in figure below. Note that this is a very common landing page for MyKings C&Cs.\nHowever, this single fact is not sufficient for attributing CoinHelper to MyKings.\n\nDefault Windows Server landing page. The same image is also commonly present on MyKings\nC&C servers, but that is not sufficient for attribution.\nThe malware is capable of downloading four files in total from an active server, present in a “public”\nsubfolder:\n```\n   public/upd.txt\n   public/64/64.txt (or public/32/32.txt if the “32 bit variant” of the script is used)\n   public/vc/amd.txt\n   public/vc/nvidia.txt\n\n```\nThe files `64.txt ( 32.txt ),` `amd.txt, and` `nvidia.txt are all XMRig coinminers (encoded`\nand compressed), both for CPU or an according GPU card.\n\nThe `upd.txt file is a plaintext file containing a version number bounded by` `_ and` `! symbols,`\nfor example `_!1!_ . The malware asks the server what’s the version and if the version is newer,`\nall coinminers are updated (downloaded again).\n\n\n-----\n\nThe miners are downloaded as a hexadecimal string from the C&C, ending with a constant string\n```\n_!END!_ . After the end stub is removed and the string decoded, we get a 7zip archive. Once\n\n```\nagain, we can use the `DxSqsNKKOxqPrM4Y3xeK password to unpack it.`\n\nAfter the unpacking, we can get these files:\n```\n   SysBackup.txt – for CPU miners (both 32 and 64 bit)\n   SysBackupA.txt – when there is also AMD GPU detected\n   SysBackupN.txt – when there is also NVIDIA GPU detected\n\n```\nThese files are once again present in a hexadecimal form, this time starting with `0x prefix and`\nwithout the end stub.\n\nFurthermore, a few additional files can be found with the “ SysBackup ” files for ensuring the\nmining functionality and optimal mining, when appropriate (for example `xmrig-cuda.dll for`\nNVIDIA cards).\n\nThe download process can be seen in the following visualisation:\n\n\n-----\n\n-----\n\n**Coinmining**\n\nThe coinmining (and the 7zip unpacking) is executed via process injection. The CPU coinmining is\nperformed by injecting into a newly created and suspended process of\n```\n%WINDIR%\\System32\\attrib.exe .\n\n```\nExecution of all the other components, such as GPU mining or unpacking of the coinminer\npayloads downloaded from Tor, is done by injecting into itself, meaning a new suspended instance\nof `Helper.exe is used for the injection. When there is coinmining on GPU supported, both CPU`\nand GPU are executed in parallel.\n\nNote that the injection is done by a publicly available AutoIt injector, so the author chose the\ncopy+paste way without reinventing the wheel.\n\nFrom our research, we’ve only seen XMRig to be deployed as the final coinmining payload. The\nmalware executes it with common parameters, with one approach worth mentioning – a parameter\nsetting the password for the mining server “ -p ”. In standard situations, the password doesn’t\nreally matter so the malware authors usually use “ x ” for the password. In this case, however, the\nmalware generates a GUID of the victim and appends it to the usual “ x ”.\n\nThe GUID is created by concatenating values from one of the WMI queries listed below:\n\n```\nSELECT * FROM Win32_ComputerSystemProduct\n\n```\n```\nSELECT * FROM Win32_BIOS\n\n```\n\nWhich query should be used is defined in the configuration of the AutoIt script. The GUID is\ncreated by hashing the obtained information using MD5 and formatted as a standard GUID string:\n\n```\n/\\{[0-9A-F]{8}-[0-9A-F]{4}-[0-9A-F]{4}-[0-9A-F]{4}-[0-9A-F]{12}\\}/\n\n```\n\nWith this approach, the malware author is in fact able to calculate the exact number of infected\nusers who are actually mining, because all the mining will be performed via a unique password,\npassing it as an ID of the “worker” (= victim) to the pool.\n\n**Persistence**\n\nSimilarly to the first stage, at the beginning of the second stage, particular mutexes are checked\nand created if necessary:\n```\n   QPRZ1bWvXh\n   QPRZ1bWvXh2\n\n```\nAs we can see, only the number in the middle of the mutex is changed compared to the first stage\n( QPRZ3bWvXh ). The second mutex has an appended `2 as a constant. We have also seen`\n```\nQPRZ2bWvXh used as well, once again changing the middle number.\n\n```\n\n-----\n\nFor the sake of staying hidden for the longest time possible, the malware checks several processes\nusing a native AutoIt `ProcessExists function for any running system monitoring and analysis`\ntools:\n```\n   aida64.exe\n   AnVir.exe\n   anvir64.exe\n   GPU-Z.exe\n   HWiNFO32.exe\n   HWiNFO64.exe\n   i7RealTempGT.exe\n   OpenHardwareMonitor.exe\n   pchunter64.exe\n   perfmon.exe\n   ProcessHacker.exe\n   ProcessLasso.exe\n   procexp.exe\n   procexp64.exe\n   RealTemp.exe\n   RealTempGT.exe\n   speedfan.exe\n   SystemExplorer.exe\n   taskmgr.exe\n   VirusTotalUpload2.exe\n\n```\nWhen the tool is spotted, the malware temporarily disables the mining. The information about\nrunning coinminers is stored in two files:\n```\n   mn.pid\n   gmn.pid\n\n```\nAs their names might disclose, a particular PID of the running (GPU) coinminer is written there.\n\nThe malware also monitors whether the victim actually uses their PC at the moment. If the user is\nidle for a while, in our particular case for 3 minutes, the current coinmining is terminated and a new\ncoinmining process is executed and set to leverage 100% of the CPU on all threads. This\ninformation (PID) is stored in a file called `mn.ld . When the PC is actively used, the mining is set`\nto 50% of the available performance. On the other hand, GPU mining is performed only when the\nuser is not actively using their PC (for 2 minutes).\n\nThe malware also lists all console windows present on the system and finds out those that have\nvisibility set to hidden. If such a window is found and it doesn’t belong to CoinHelper, the malware\nconsiders it as a competing miner and kills the process.\n\n**Data harvesting and AV checks**\n\nSimilarly to the previous AutoIt stage, `Helper.exe collects information about the infected system,`\ntoo, as shown in the table below:\n\n\n-----\n\n**Information** **Purpose**\n\n\nNumber of available\nCPU threads\n\n\nIf the victim’s system is idle, the malware leverages all CPU threads\n\n\nVideo card type What kind of card is used – for Nvidia or AMD optimized coinmining\n\nCPU type **Not used (*see below)**\n\nSecurity solution **Not used (*see below)**\n\nHW ID hashed by MD5 Appended to XMRig password, resulting in a parameter `-p xMD5`\n(see Coinmining for details)\n\nAs we could see (*) in the table above, the code actually contains functions for the harvesting of\nsome information that is not actually executed. This means that while it could gather this\ninformation, it doesn’t. Due to similarities with the first stage, we suppose that the authors have\nforgotten some artifacts of previous versions due to shifts of functionality between the first AutoIt\nstage and the `Helper.exe stage.`\n\nThe malware recognizes which graphic card is available on the infected system. These cards are\ndetected using the WMI query on `Win32_VideoController . You can find all the cards, as`\npresented in the malware, in the table below:\n\n**AMD Series** **AMD Model**\n\nRX 460, 470, 480, 540, 550, 560, 570, 580, 590, 640, 5500, 5600, 5700, 6800, 6900\n\nR5 230\n\nR7 240\n\nW4300\n\nVEGA 56, 64\n\nRadeon 520, 530, 535, 540, 550, 610, 620, 625, 630, VII\n\nWX 3100, 5100\n\n**Nvidia Series** **Nvidia Model**\n\nP104-100\n\nP106-090\n\nGTX 750, 970, 980, 980, 1050, 1060, 1070, 1080, 1650, 1660, TITAN\n\nRTX 2050, 2060, 2070, 2080, 3060, 3070, 3080, 3090\n\nGT 710, 720, 730, 740, 1030\n\nQuadro K1000, K1200, P400, P620, P1000, P2000, P2200, P5000\n\n\n-----\n\nIf any card from above is detected and also the video adapter name matches either `Advanced`\n```\nMicro Devices, Inc. ” or “ NVIDIA ”, the malware uses XMRig to leverage GPU for coinmining.\n\n```\nFrom the list of graphic cards, it is apparent that the malware doesn’t hesitate to leverage the\nnewest models of graphic cards.\n\n## Bundled apps overview\n\nAfter looking at the software that the infected victims originally wanted to install, we can conclude\nthat CoinHelper can be bundled with practically anything. So far, we’ve seen over 2,700 different\napps bundled with CoinHelper (differentiating by unique SHA256 hashes). The majority of the\nsoftware consists of clean installers, cracked software, cracked games or game cheats like\n```\nChromeSetup, Photoshop, MinecraftSetup, Assassin’s Creed Valhalla, CyberPunk\n2077 Trainer or AmongUs cheats . With repertoire like this, the authors of CoinHelper are able\n\n```\nto reach out to almost any type of audience ensuring successful spread of the malware.\n\nPersuading someone to download supposedly clean software, which is in reality bundled with\nmalware, is easier than persuading someone to willingly download malware which is secretly\nbundled with another malware. Authors of CoinHelper are not afraid of this challenge as we\nobserved CoinHelper to be also bundled with samples of malware like `888 RAT or` `njRAT . We`\nassume that with this approach, the target group of people gets extended by “script kiddies” and\ninexperienced people with an interest in malware. As this group of people is very specific, there are\nonly a few samples of malware in comparison with the amount of other software. Graphical\noverview of this proportion can be seen also in the image below.\n\n\n-----\n\n## Origin of the bundled apps\n\nApart from the Yandex Disk storage from where we started our investigation, we can confirm that\nanother considerable method of spreading CoinHelper is via malicious torrents placed on internet\nforums focused on cracked software.\n\n### Forums overview\n\nThe authors of the malware successfully made it easy for people to stumble upon the malicious\ntorrents. During our research, we found CoinHelper bundled with software on Russian internet\nforums focusing on cracked software:\n```\n   windows-program[.]com\n   softmania[.]net\n\n```\nEven though we were able to find information about the number of downloads of the malware from\nthese forums (more about this later), it wasn’t nearly enough to explain the number of hits from our\nuser base. Because of this, we have to assume that there are tens of forums like the ones\nmentioned above, spreading malware through cracked software.\n\n### More about the forums\n\n\n-----\n\nLet s focus on the first forum `windows-program[.]com, as the other one is very similar. Between`\nthe thousands and thousands of articles, we found the samples we were looking for. As it turns out,\nregistered user `Alex4 created 29 different articles mostly containing torrents for cracked software`\nincluding:\n\n**Advertised software** **Description & functionality**\n\n\nAbleton Live Suite 9.7.3 + Crack +\nторрент\n\nDr.Web Security Space 11.0.0.11162 x86\nx64 + ключ + торрент\n\nESET NOD32 Smart Security 10.1.219.1 +\nключи + торрент\n\nAvast Premier 11.2.2260 + ключ +\nторрент\n\nAdobe Photoshop CC 2017.1.1 + Portable\n+ торрент\n\nFraps 3.5.99 на русском + crack +\nторрент\n\n\nAudio workstation and music production software\nwith current price 599 €\n\nAnti-virus solution\n\nAnti-virus solution\n\nAnti-virus solution\n\nPhoto and image editing software\n\nScreen capture and screen recording utility,\npopular to videocapture games\n\n\nAs can be seen in the table above, CoinHelper can be also found bundled with multiple well-known\nAV solutions. Let’s take a closer look at a post about Avast AV for the sake of awareness about\nthreats that come with downloading AV from sources like this.\n\nFirst thing to notice is that the post is from 2020-11-06. It also contains some screenshots of the\npromised program, but it can be seen that it is a very old version of our AV from 2016. After\nlaunching the installation, users get to choose between installing the old version or updating AV to\nthe newest version. Unfortunately, the installer was manipulated and neither of the options work\nand the no-update variant crashes the system. As a result, the output from this download for users\nis that they don’t get AV protection, they might crash their system and they also get infected with\nCoinHelper. Because of this we highly recommend downloading only signed software from verified\nand trustworthy sources and if possible verify hashes or checksums of installers.\n\nAs a matter of fact, neither of the AV installers worked. After launching an installer, CoinHelper\nwould install itself and installation would fail because of various reasons. It makes sense that\nauthors of the malware would choose malfunctioning these installers, because there is no reason\nto give victims a tool that kills and removes their freshly dropped malware from the system.\n\n\n-----\n\nIn the post, it is possible to download three different things:\n\nA torrent file with which it is possible to download the advertised program with CoinHelper\nA zip archive protected with a password “ 123 ” containing the advertised program with\nCoinHelper\n\n\n-----\n\nAfter choosing between a zip archive or torrent, the page opens a new tab with information about\nthe file to be downloaded. On the image below it is possible to see the date when the file was\nadded to the page. Surprisingly it is 2021-07-12 and not 2020-11-06, so the file is much newer than\nthe post referencing it. Because we have seen multiple versions of the malicious AutoIt scripts, we\nsuppose that authors of the malware are updating these files with new versions of CoinHelper.\n\nAdditional information that can be noticed on the image above is that the torrent file was\ndownloaded 549 times and after adding the 508 downloads of the zip archive, we can conclude\nthat more than 1,000 people may have got infected just from this one post on this forum. After\n\n\n-----\n\nchecking all the forum posts and files uploaded by the user `Alex4 we can confirm that the total`\nnumber of downloads is more than 45,000 by the 2021-11-02. We consider this number to be quite\nalarming considering it is the spread of malware only from a single internet forum.\n\nThe second forum ( softmania[.]net ) is quite similar. In this case, the user from whose account\nthe malware is spreading is `WebGid4 . This user has 56 publications on the forum among which`\nyou can find posts about following software:\n\n**Advertised software** **Description & functionality**\n\nWindows 11 64bit Pro-Home v.21 торрент Windows 11 ISO image\n\n\nAdobe Photoshop Lightroom Classic 2021 v10.0 +\nторрен\n\nMicrosoft Office 2016 Professional Plus\n16.0.7571.2075 + Ключ + Torrent\n\n\nPhoto and image editing software\n\nMS Office package\n\n\nVMware Workstation 12 Pro 12.5.4 Software that creates and runs virtual\nmachines\n\nSteinberg Cubase Pro 10.0.50 2020 + торрент Software for composing, recording, mixing\nand editing music\n\nThe first thing that caught our eyes was the ISO image of the brand new OS Windows 11. The\nofficial Windows 11 release date was 2021-10-05, which was only a few weeks before the release\nof this blogpost. This means that the attackers are really keeping the pace with the current trends\nand they try very hard to have interesting software to infect as many victims as they can.\n\nAfter downloading the torrent named “Windows 11 64bit Pro-Home v.21 торрент” victims would\ndownload through the torrent client an ISO file named\n“ windows_11_CLIENT_CONSUMER_x64FRE_en-us.iso ”. This is a working ISO image of Windows\n\n\n-----\n\n11, which installs a brand new operating system, but as a bonus it deploys CoinHelper that is\ninside the ISO image. After unpacking the ISO file, there is an executable called\n```\n\\sources\\setup.exe present that contains bundled CoinHelper.\n\n```\nIf the victims were more careful, a hint that something is sketchy could be seen after clicking on the\ndownload torrent link and opening a download page in the new tab. The torrent was added 202107-10, only 17 days after the official announcement of Windows 11 and ~3 months before the\nofficial release. This already raised many flags, and as we later found out, it is a Windows 11\ndeveloper version that was leaked in June 2021. This ISO image is able to successfully upgrade\nexisting Windows OS to the new Windows 11 also with CoinHelper in it.\n\n### Seeding source\n\nWe’ve seen these malicious files being downloaded through torrents which are seeded from seed\nboxes. A seed box is a remote server used for storing and seeding files through the P2P network\nthat can be rented as a service. Seed boxes serve as a layer of anonymity for attackers because\ninstead of exposing their IP address, only the IP address of the seed box can be seen. They also\nensure high availability of the content, because the seed box is supposed to be running 24/7\n(unlike regular PCs). Furthermore, companies renting seed boxes also offer different bandwidths to\nbe able to support even higher download rates.\n\nWhen we looked into the malicious torrents from the `Alex4 on` `windows-program[.]com forum,`\nwe saw that the malicious content is downloaded from the server with IP `88.204.193[.]34 on`\nport `56000 (apart from others probably already infected seeders). After taking a closer look at this`\nIP address, we’ve found out that the IP address is located in Kazakhstan and it is connected to the\nservice named megaseed ( megaseed.kz ).\n\n## Conclusion\n\nIn this blog post, we presented a detailed technical analysis of CoinHelper, a family of AutoIt\ndroppers, which provides a massive coinmining campaign affecting hundreds of thousands of\nusers worldwide. The malware is being spread in a form of a bundle with another software, being it\ngame cheats, cracked software, or even clean installers such as Google Chrome or AV products,\nas well as hiding in Windows 11 ISO image, and many others.\n\nFurthermore, we explained how the malware maps the victims of the campaign using public IP\nlogging services to better understand the effectiveness of the chosen infection vectors in certain\nregions. Using these services, the malware also harvests information about victims’ security\nsolutions and available computational power.\n\nWe explained how the malware can hide literally in any software from unofficial sources. The scope\nof the spreading is also supported by seeding the bundled apps via torrents, further abusing the\nunofficial way of downloading software.\n\n## Indicators of Compromise (IoC)\n\nRepository: [https://github.com/avast/ioc/tree/master/CoinHelper/](https://github.com/avast/ioc/tree/master/CoinHelper/)\n\n\n-----\n\n**SHA256** **File name**\n\n83a64c598d9a10f3a19eabed41e58f0be407ecbd19bb4c560796a10ec5fccdbf start.exe\n\ncc36bb34332e2bc505da46ca2f17206a8ae3e4f667d9bdfbc500a09e77bab09c asacpiex.dll\n\nea308c76a2f927b160a143d94072b0dce232e04b751f0c6432a94e05164e716d CL_Debug_Log.txt\n\n126d8e9e03d7b656290f5f1db42ee776113061dbd308db79c302bc79a5f439d3 32.exe\n\n7a3ad620b117b53faa19f395b9532d3db239a1d6b46432033cc0ef6a8d2377cd 64.exe\n\n7387e57e5ecfdba01f0ad25eeb49abf52fa0b1c66db0b67e382d3b9c057f51a8 32.txt\n\nff5aa6390ed05c887cd2db588a54e6da94351eca6f43a181f1db1f9872242868 64.txt\n\n6753d1a408e085e4b6243bfd5e8b44685e8930a81ec27795ccd61f8d54643c4e amd.txt\n\n93dd8ef915ca39f2a016581d36c0361958d004760a32e9ee62ff5440d1eee494 nvidia.txt\n\n**Mutex**\n\nQPRZ1bWvXh\n\nQPRZ1bWvXh2\n\nQPRZ2bWvXh\n\nQPRZ3bWvXh\n\n**Logging services**\n\nhttps://2no[.]co/1wbYc7\n\n## Appendix\n\n List of checked security solutions\n\n**AV / Security solution** **Checked processes**\n\nAvast AvastUI.exe, AvastSvc.exe\n\nNOD egui.exe, ekrn.exe\n\nKaspersky avp.exe, avpui.exe\n\nAVG avguix.exe, AVGUI.exe\n\nDr.web dwengine.exe\n\nAd-Aware AdAwareTray.exe, AdAwareDesktop.exe\n\n\n-----\n\nSecureAPlus SecureAPlus.exe, SecureAPlusUI.exe\n\nArcabit arcabit.exe, arcamenu.exe\n\nBitdefender seccenter.exe, bdagent.exe, bdwtxag.exe, agentcontroller.exe\n\nCAT-QuickHeal ONLINENT.exe, SCANNER.exe\n\nComodo cis.exe, vkise.exe\n\nCybereason CybereasonRansomFree.exe\n\nEmsisoft a2guard.exe, a2start.exe\n\neScan escanmon.exe, TRAYICOS.exe, escanpro.exe\n\nF-Prot FProtTray.exe, FPWin.exe\n\nGData AVKTray.exe, GDKBFltExe32.exe, GDSC.exe\n\nikarus guardxkickoff.exe, virusutilities.exe\n\nK7AntiVirus K7TSecurity.exe, K7TSMain.exe, K7TAlert.exe\n\nMaxSecure Gadget.exe, MaxProcSCN.exe, MaxSDTray.exe, MaxSDUI.exe,\nMaxUSBProc.exe\n\nMcAfee McDiReg.exe, McPvTray.exe, McUICnt.exe, mcuicnt.exe,\nMpfAlert.exe, ModuleCoreService.exe, uihost.exe, delegate.exe\n\nMicrosoftSecurityEssentials msseces.exe\n\nPanda PSUAConsole.exe, PSUAMain.exe\n\nTrendMicro PtSessionAgent.exe, uiSeAgnt.exe, uiWinMgr.exe\n\nTrendMicro-HouseCall HousecallLauncher.exe, housecall.bin, HouseCallX.exe\n\nVIPRE SBAMTray.exe, VIPREUI.exe\n\nWebroot WRSA.exe\n\nZoneAlarm zatray.exe\n\nAhnLab-V3 ASDCli.exe, ASDUp.exe, MUdate.exe, V3UPUI.exe, V3UI.exe\n\nAvira avgnt.exe, Avira.Systray.exe, ngen.exe, Avira.VPN.Notifier.exe,\nmsiexec.exe\n\nBkav BkavHome.exe\n\nBkavPro Bka.exe, BkavSystemServer.exe, BLuPro.exe\n\nF-Secure fshoster32.exe\n\nJiangmin KVMonXP.kxp, KVPreScan.exe, KVXp.kxp\n\n\n-----\n\nKingsoft kislive.exe, kxetray.exe\n\nNANO-Antivirus nanoav.exe\n\nQihoo-360 efutil.exe, DesktopPlus.exe, PopWndLog.exe, PromoUtil.exe,\nQHSafeMain.exe, QHSafeTray.exe, SoftMgrLite.exe\n\nRising popwndexe.exe, rsmain.exe, RsTray.exe\n\nSUPERAntiSpyware SUPERAntiSpyware.exe\n\nTencent QQPCTray.exe, QQPCUpdateAVLib.exe, Tencentdl.exe,\nTpkUpdate.exe\n\nVBA32 vba32ldrgui.exe, VbaScheluder.exe, BavPro_Setup_Mini_C1.exe\n\nViRobot hVrSetup.exe, hVrTray.exe, hVrScan.exe, hVrContain.exe\n\nZillya ZTS.exe\n\nDefender MSASCui.exe, MSASCuiL.exe\n\nSmartScreen smartscreen.exe\n\n[Tagged asanalysis,](https://decoded.avast.io/tag/analysis/) [cryptocurrency,](https://decoded.avast.io/tag/cryptocurrency/) [cryptomining,](https://decoded.avast.io/tag/cryptomining/) [malware,](https://decoded.avast.io/tag/malware/) [series](https://decoded.avast.io/tag/series/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-01 - Toss a Coin to your Helper (Part 2 of 2).pdf"
    ],
    "report_names": [
        "2021-12-01 - Toss a Coin to your Helper (Part 2 of 2).pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536100,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653764282,
    "ts_modification_date": 1653764282,
    "files": {
        "pdf": "https://archive.orkl.eu/7005b4a87c2f3706634dece88d13a6220ab5d533.pdf",
        "text": "https://archive.orkl.eu/7005b4a87c2f3706634dece88d13a6220ab5d533.txt",
        "img": "https://archive.orkl.eu/7005b4a87c2f3706634dece88d13a6220ab5d533.jpg"
    }
}