{
    "id": "c6cc342e-2825-4c1e-b39e-41c64b251cd7",
    "created_at": "2023-01-12T15:04:58.736061Z",
    "updated_at": "2025-03-27T02:05:34.655004Z",
    "deleted_at": null,
    "sha1_hash": "57fff7da1fd28fc50e310a15eea89272ffa33925",
    "title": "2021-07-05 - Quick review of Babuk ransomware builder",
    "authors": "",
    "file_creation_date": "2022-05-28T23:35:23Z",
    "file_modification_date": "2022-05-28T23:35:23Z",
    "file_size": 778573,
    "plain_text": "# Quick review of Babuk ransomware builder\n\n**lab52.io/blog/quick-review-of-babuk-ransomware-builder/**\n\nLast week, the builder for the Babuk ransomware family was leaked online. Lab52 has\nobtained and analyzed this builder sample determining that it is very likely to be authentic.\n\nAfter their recent official move from Ransomware as a Service to data leaks extortions,\n[someone uploaded to virusTotal the ransomware builder for unknown reasons, and it was](https://www.virustotal.com/gui/file/82e560a078cd7bb4472d5af832a04c4bc8f1001bac97b1574efe9863d3f66550)\n[soon identified as such by British researcher Kevin Beaumont.](https://twitter.com/GossiTheDog/status/1409121823376117772)\n\nContent\n\nof Babuk builder leak\nWhat we first find is builder.exe, along with 2 other Windows executable files with .bin\nextension, 4 different Unix executables, and note.txt. At a first test, we could see how we\nhave to tell builder.exe the output folder as an argument, and we noticed that the files\ngenerated were similar to the builder folder files.\n\nBabuk builder\n\nusage\n\n\n-----\n\nBabuk builder output\nAfter the successful execution, we get the two eliptic curve keys generated for encryption, 3\nencryption executables for Windows, ARM-based NAS decives, and VMWare ESXi servers\nrespectively, together with its corresponding decryption executables.\n\nOne interesting thing that we found after these firsts test was that builder.exe would look for\nits files in the folder from where it is called, causing an error in case we want to execute\nbuilder.exe with an absolute path from a different location, which could be considered a bug\nor, at least, a not so much elegant implementation.\n\nBabuk builder\n\npath bug\nWe decided to compare the Windows crypter executable with real samples uploaded to\npublic sandboxes, and we could first see useful information that was already suggesting that\nthe builder could indeed be authentic.\n\n\n-----\n\nComparison between real Babuk sample and built sample\nWe also compared the encryption timing between two samples, getting similar times, which\nwould be a reinforcement about its authenticity since Babuk is Top 3 fastest ransomware\nencryption speed since they updated their efficiency “flaws” identified by Chuong Dong\n[during his great analysis of the three versions of Babuk. We were also able to also identify](https://chuongdong.com/reverse%20engineering/2021/01/16/BabukRansomware-v3/)\nthat this was a builder for their last version.\n\nAs the final comparison to ensure the authenticity of the sample, we compared the assembly\ncode of both files using a plugin for IDA pro named Diaphora, and resulting to be almost\nidentical.\n\nNot matching functions between real Babuk\n\nsample and built sample\n\nPartial matching\n\nfunctions real Babuk sample vs. built sample\n\n\n-----\n\nPerfect matching\n\nfunction from real Babuk sample vs. built sample\nAs it could be expected, the builder would take the content of note.txt and use it as the\nransomware note that it would be dropped in the infected machines. Since Babuk decided\nnot to use any packing mechanism, we could also spot in clear text the ransom note and the\nrest of the space reserved for the ransomware note inside the built binaries.\n\nStrings of built sample\n\nHex content of built sample\n\n\n-----\n\nAfter this, we decided to take a deeper look into the actual builder executable, and we found\nout that we could pass as a second argument an actual eliptic curve encyption key, instead\nof letting the builder generate it for us, allowing the ransomware operator to use the same\ndecryption executable for different builds. Furthermore, it has been observed that, if no\nencyption key is specified as an argument, the key would be generated randomly.\n\nArgument parsing of Babuk builder\nIt could also be predictable that the builder would use the binary files as templates, and we\ncould identify this operations within the assembly code, where it would first read the\n“template” file, modify it, and finally write the modification as a new file in the specified folder.\n\n\n-----\n\nbinary files as Templates\n\n\nBabuk builder read of\n\nBabuk builder write of\n\n\noutput binary files\nSince Babuk binaries did not use any packer, anyone having these files and a deep\nknowledge about them, could have written this builder. However, according to the\ncompilation dates which seem legit, we do not think this is the actual scenario.\n\nAbout the decrypter, we have not analyzed its code, but during the tests we realized that it\ndoes not contain the eliptic curve keys hardcoded, therefore it needs to be run from a\ncommand prompt located in the same folder than these generated keys. We could also\nidentify that it works, but it takes a ridiculous amount of time to decrypt go through the whole\ndisk and decrypt all the files.\n\nThis could be considered important since new ransomware gangs could try to take\nadvantage of this leak for their own Raas “startup”. However, it is also valuable for\nresearchers since it will allow us to generate better detection rules, or even track new\nunofficial variations of the ransomware family.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-05 - Quick review of Babuk ransomware builder.pdf"
    ],
    "report_names": [
        "2021-07-05 - Quick review of Babuk ransomware builder.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535898,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653780923,
    "ts_modification_date": 1653780923,
    "files": {
        "pdf": "https://archive.orkl.eu/57fff7da1fd28fc50e310a15eea89272ffa33925.pdf",
        "text": "https://archive.orkl.eu/57fff7da1fd28fc50e310a15eea89272ffa33925.txt",
        "img": "https://archive.orkl.eu/57fff7da1fd28fc50e310a15eea89272ffa33925.jpg"
    }
}