{
    "id": "c6dfe879-0354-49d3-9293-7000aed3a2df",
    "created_at": "2022-10-25T16:48:15.683278Z",
    "updated_at": "2025-03-27T02:16:53.171658Z",
    "deleted_at": null,
    "sha1_hash": "db15d399006eb4b59465463484b85071881a89f6",
    "title": "Heading 1",
    "authors": "",
    "file_creation_date": "2011-06-23T21:13:17Z",
    "file_modification_date": "2011-06-23T21:13:17Z",
    "file_size": 341048,
    "plain_text": "# China’s Cyber Warfare Capabilities\n\n## Desmond Ball\n\nChina has the most extensive and most practised cyber-warfare capabilities in Asia. This article\ndescribes the development of these capabilities since the mid-1990s, the intelligence and\nmilitary organisations involved, and the particular capabilities that have been demonstrated in\ndefence exercises and in attacks on computer systems and networks in other countries. It\nnotes that it is often very difficult to determine whether these attacks have originated with official\nagencies or private „Netizens‟. It argues that China‟s own computer systems and networks are\nreplete with vulnerabilities, of which Chinese officials are well aware. It concludes that this\nappreciation of China‟s deficiencies and vulnerabilities has led to the adoption of a pre-emptive\nstrategy, as practiced in People‟s Liberation Army exercises, in which China‟s very destructive\nbut relatively unsophisticated cyber-warfare capabilities are unleashed at the very outset of\nprospective conflicts.\n\nChina has the most extensive and most practiced cyber-warfare capabilities\nin Asia, although the technical expertise is very uneven. China began to\nimplement an Information Warfare (IW) plan in 1995, and since 1997 has\nconducted numerous exercises in which computer viruses have been used\nto interrupt military communications and public broadcasting systems. In\nApril 1997, a 100-member elite corps was set up by the Central Military\nCommission to devise “ways of planting disabling computer viruses into\nAmerican and other Western command and control defence systems”.[1] In\n2000, China established a strategic IW unit (which US observers have called\n„Net Force‟) designed to “wage combat through computer networks to\nmanipulate enemy information systems spanning spare parts deliveries to\nfire control and guidance systems”.[2] The People‟s Liberation Army (PLA)\nannounced on 20 July 2010 that it had established an „Information Protection\nBase‟ under the General Staff Department. This is probably a „computer\nnetwork defence‟ or „computer security operations‟ centre.[3]\n\nChinese cyber-warfare units have been very active, although it is often very\ndifficult to attribute activities originating in China to official agencies or private\n„Netizens‟ („WangMin‟). Since 1999, there have been periodic rounds of\nattacks against official Web-sites in Taiwan, Japan and the United States.\nThese have typically involved fairly basic penetrations, allowing Web-sites to\n\n1 Ivo Dawnay, „Beijing Launches Computer Virus War on the West‟, The Age (Melbourne), 16\nJune 1997, p. 8.\n2 Jason Sherman, „Report: China Developing Force to Tackle Information Warfare‟, Defense\n_News, 27 November 2000, pp. 1, 19._\n3 „The People‟s Liberation Army‟s First Force on Strategic Information Support and Protection is\nEstablished‟, China Review News, 20 July 2010,\n<http://www.chinareviewnews.com/doc/1013/8/7/2/101387269.html?coluid=7&kindid=0&docid=\n101387269&mdate=0720090536> [Accessed 18 May 2011].\n\n\n-----\n\n_Desmond Ball_\n\nbe defaced or servers to be crashed by „Denial-of-Service‟ (DOS) programs.\nMore sophisticated „Trojan Horse‟ programs were used in 2002 to penetrate\nand steal information from the Dalai Lama‟s computer network.[4] More\nrecently, Trojan Horse programs camouflaged as Microsoft Word and\nPowerPoint documents have been inserted in computers in government\noffices in many countries around the world.[5] Portable, large-capacity hard\ndiscs, often used by government agencies, have been found to carry Trojan\nHorses that automatically upload to Beijing Web-sites everything that the\ncomputer user saves on the hard disc.[6] From the late 1990s until 2005, the\nPLA conducted more than 100 military exercises involving some aspect of\nIW, although the practice generally exposed substantial short-falls.[7] A\nsimilar number was probably conducted in the period from 2005 to 2010.\n\nAny critique of China‟s cyber-warfare capabilities must necessarily include\nsome assessment of its cyber-intelligence operations. As a report prepared\nfor the US-China Economic and Security Review Commission in October\n2009 noted:\n\nUltimately, the only distinction between computer network exploitation and\nattack is the intent of the operator at the keyboard. The skill sets needed to\npenetrate a network for intelligence gathering purposes in peacetime are the\nsame skills necessary to penetrate that network for offensive action during\nwartime.[8]\n\nAnd as Admiral Robert Willard, the Commander-in-Chief of the US Pacific\nCommand (CINCPAC) told the Congress on 13 January 2010, “U.S. military\nand government networks and computer systems continue to be the target of\nintrusions that appear to have originated from within [the People‟s Republic\nof China]”, and “although most intrusions focus on exfiltrating data, the skills\n\n4 Christopher Bodeen, „Mainland Asks Taiwan to Stop Interference‟, The Washington Times, 26\nSeptember 2002; Doug Nairne, „State Hackers Spying On Us, Say Chinese Dissidents‟, South\n_China Morning Post, 18 September 2002._\n5\nSee, for example, „Outrage in Berlin Over Chinese Cyber Attacks‟, Weekly Standard, 31\nAugust 2007, <http://www.weeklystandard.com/weblogs/TWSFP/2007/08/\noutrage_in_berlin_over_chinese.asp> [Accessed 18 May 2011].\n6\nYang Kuo-wen, Lin Ching-chuan and Rich Chang, „Bureau Warns on Tainted Discs‟, Taipei\n_Times, 11 November 2007, <http://www.taipeitimes.com/News/taiwan/archives/_\n2007/11/11/2003387202> [Accessed 18 May 2011], p. 2.\n7\nI-Ling Tseng, „Chinese Information Warfare (IW): Theory Versus Practice in Military Exercises\n(1996-2005)‟, MA Sub-thesis, Graduate Studies in Strategy and Defence, Strategic and Defence\nStudies Centre, Australian National University, Canberra, March 2005.\n8\nBryan Krekel, „Capability of the People‟s Republic of China to Conduct Cyber Warfare and\nComputer Network Exploitation‟, Northrop Grumman Corporation, McLean, Virginia, 9 October\n2009, <http://www.uscc.gov/researchpapers/2009/NorthropGrumman_PRC_Cyber_Paper_\nFINAL_Approved%20Report_16Oct2009.pdf> [Accessed 18 May 2011], pp. 8-9.\n\n\n-----\n\n_China and Cyber Warfare_\n\nbeing demonstrated would also apply to wartime computer network\nattacks”.[9]\n\nOrganisationally, the PLA has consolidated the computer and network attack\nmissions together with Electronic Warfare into an „Integrated Network\nElectronic Warfare‟ (INEW) activity under the General Staff Department‟s 4[th]\n(Electronic Countermeasures) Department. Computer network defence has\napparently been included with cyber-espionage in the 3[rd] (Signals\nIntelligence) Department. Specialised IW militia units also share some\naspects of these missions.[10]\n\nIn addition, the Chinese military and intelligence agencies are able to readily\nutilise the corporate sector, including not only state-owned\ntelecommunications carriers such as China Telecom Corporation but also\nso-called „private‟ companies which provide telecommunications and\ninformation technologies and services. For example, Huawei Technologies\nCompany, one of the biggest suppliers of telecom equipment in the world,\nhas been effectively blocked from business in the United States because of\naccusations by US officials that it is “linked to the Chinese military”.[11]\nChinese manufacturers of electronic gadgets, such as iPods, digital picture\nframes, and navigation gear, have also been found to have installed viruses\nin their products that subsequently send information back to Beijing.[12] And\nthe Chinese authorities have access to the large community of patriotic\n„Netizens‟ which is highly skilled in the design and implantation of Trojan\nHorse programs and other forms of malicious software („malware‟). (Table 1\nis a selected list of some of the worst viruses and worms propagated from\n1994 to 2011.)\n\n9\nJohn T. Bennett, „Chinese Buildup of Cyber, Space Tools Worries U.S.‟, Defense News, 13\nJanuary 2010, <http://www.defensenews.com/story.php?i=4452407> [Accessed 18 May 2011].\n10 Krekel, „Capability of the People‟s Republic of China to Conduct Cyber Warfare and\nComputer Network Exploitation‟, pp. 6-7; Desmond Ball, „China and Information Warfare:\nSignals Intelligence, Electronic Warfare and Cyber Warfare‟, in K. Santhanam and Srikauth\nKondapalli (eds), Asian Security and China, 2000-2010, (New Delhi: Shipra Publications, 2004),\npp. 115-41.\n11 Michael Kan, „China‟s Huawei to Reverse Controversial Deal for 3Leaf‟, ITWorld, 19 February\n2011, <http://www.itworld.com/node/137654> [Accessed 18 May 2011]; John Bussey, „In\nHuawei‟s Bid to Crack Market, U.S. Sees a Threat From China Inc.‟, Wall Street Journal, 28\nFebruary 2011, <http://dailyme.com/story/2011022700010554> [Accessed 18 May 2011]; John\nMarkoff and David Barboza, „Huawei, A Chinese Trojan Horse?‟, Chinh’s News, 28 October\n2010, <http://chinhdangvu.blogspot.com/2010/10/huawei-chinese-trojan-horse.html> [Accessed\n18 May 2011]; and Krekel, „Capability of the People‟s Republic of China to Conduct Cyber\nWarfare and Computer Network Exploitation‟, p. 49.\n12 „Computer Viruses: China‟s Electronic Gadgets are the Latest Sources‟, Information\nTechnology Consulting, 27 February 2011,\n<http://informationtechnologyconsulting.yuiin.com/computer-viruses-chinas-electronic-gadgetsare-the-latest-sources/> [Accessed 18 May 2011].\n\n\n-----\n\n_Desmond Ball_\n\n## Cyber-warfare Activities\n\nPLA IW units have reportedly developed „detailed procedures‟ for Internet\nwarfare, including software for network scanning, obtaining passwords and\nbreaking codes, and stealing data; information-paralysing software,\ninformation-blocking software, information-deception software, and other\nmalware; and software for effecting counter-measures. These procedures\nhave been tested in field exercises since about 2000. For example, 500\nsoldiers took part in a network-warfare exercise in Hubei province in 2000 in\nwhich simulated cyber-attacks were conducted against Taiwan, India, Japan\nand South Korea. In another exercise in Xian, ten cyber-warfare missions\nwere rehearsed, including planting (dis)information mines; conducting\ninformation reconnaissance; changing network data; releasing information\nbombs; dumping information garbage; releasing clone information;\norganising information defence; and establishing „network spy stations‟.[13] In\nDatong, forty PLA specialists were reported in 2001 to be “preparing\nmethods of seizing control of communications networks of Taiwan, India,\nJapan and South Korea”.[14] In October 2000, an exercise presided over by\nthe PLA Chief of Staff simulated cyber-warfare and EW “with countries south\nand west of [the] Gobi desert”.[15] As the US Secretary of Defense reported to\nCongress in May 2007, “the PLA sees CNO [computer network operations]\nas critical to achieving „electromagnetic dominance‟ early in a conflict”. It\nhas incorporated “offensive CNO into its exercises, primarily in first strikes\nagainst enemy networks”.[16]\n\nThe PLA has reportedly established at least twelve facilities for INEW\ntraining at unit levels in computer network attack and defence operations,\njamming and other forms of electronic warfare, and other IW activities. The\n„flagship‟ facility is evidently located at Zhurihe in the Beijing Military Region,\nand features an “informationalised Blue Force” for „opposed force‟ exercises.\nDuring an exercise in the Beijing Military Region in June 2004, for example,\nthe „Blue Force‟ used network attacks to seize control of the „Red Force‟\ncommand network “within minutes of the start of the exercise, consistent with\nthe INEW strategy‟s emphasis on attacking enemy C2 [command and\ncontrol] information systems at the start of combat”.[17] An „opposed force‟ IW\nexercise in the Lanzhou Military Region in February 2009 also included\ncomputer network attack and defence scenarios.[18]\n\n13 InfoSec News, „Battle of the Mouse‟, Security Focus.com, 20 March 2001,\n<http://www.infosecnews.org/hypermail/0103/3751.html> [Accessed 18 May 2011].\n14 Ibid.\n15 Ibid.\n16 Office of the Secretary of Defense, Annual Report to Congress: Military Power of the People’s\n_Republic of China 2007, 23 May 2007, <http://www.defense.gov/pubs/pdfs/070523-china-_\nmilitary-power-final.pdf> [Accessed 18 May 2011], p. 22.\n17 Krekel, „Capability of the People‟s Republic of China to Conduct Cyber Warfare and\nComputer Network Exploitation‟, pp. 16-7.\n18 Ibid, p. 17.\n\n\n-----\n\n_China and Cyber Warfare_\n\nCyber-warfare activities go beyond intelligence collection operations in at\nleast two quite different respects. First, they include a large group of\nactivities designed to damage or destroy network elements, such as Websites, hard drives, operating systems and servers, as well as infrastructure\ndependent upon those elements, such as communications systems, financial\nservices, power grids, air traffic control systems, etc. The simplest of these\nactivities involve Denial-of-Service attacks which overwhelm network devices\n(especially servers and routers), of which there have been innumerable\ninstances targeting Web-sites in the United States, Japan, South Korea and\nTaiwan.\n\nViruses have been produced that only attack Japanese-language operating\nsystems. For example, the Win32/KillDPT „intelligent‟ virus, after reading the\nregistry keys and judging the type of operating system and determining that\nit uses Japanese language, will destroy the hard disc by filling it with\ngarbage data and then restarting the system, completely paralysing the\ncomputer. Another virus which only attacked Japanese operating systems,\nW32.Welchia.B, was launched in 2008 and was called the „patriotic virus‟ or\nthe „anti-Japan virus‟.[19]\n\nSecond, cyber-warfare activities place a premium on „sleeper‟ Trojan Horses\nwhich are installed during peacetime and which, when activated, can either\ndamage or destroy systems, or begin to exfiltrate confidential information\nback to Beijing. For example, a worm called Worm.Downad.E (an advanced\nvariant of the Conficker worm), released on 1 April 2009, and which infects\nMicrosoft operating systems, can remain dormant in the system until a\nspecially crafted RPC (Remote Procedure Call) request is received; its\ncreators can then take control of the compromised computers.[20] It was\nreported in April 2009 that “hackers believed to be backed by the Chinese\ncommunist regime” had infiltrated computers critical to the functioning of the\nUS electric power grid and deposited software that would allow them to\n“catastrophically disrupt service” when ordered.[21]\n\nOn 17 November 2008, the US Department of Defense (DoD) banned USB\nstorage devices across the whole US military. The ban on portable digital\nmedia was imposed throughout the Defense Department‟s Global\n\n19\nZhang Dongfeng, „Can a Computer Virus be “Patriotic?”‟, China Digital Times, 6 April 2011,\n<http://chinadigitaltimes.net/2007/10/can-a-computer-virus-be-patriotic-zhang-dongfeng/>\n\n[Accessed 18 May 2011].\n20\nJoshua Philipp, „Conficker Computer Virus Poses New Threat‟, The Epoch Times, 10 April\n2009, <http://www.theepochtimes.com/n2/content/view/15101/> [Accessed 18 May 2011], p. A4;\nand Phillip Porras, Hassen Saidi and Vinod Yegneswaran, „An Analysis of Conficker‟s Logic and\nRendezvous Points‟, SRI International Technical Report, Menlo Park, California, 4 February\n2009, <http://mtc.sri.com/Conficker/> [Accessed 18 May 2011].\n21\nSuman Srinivasan, „Chinese Hackers Penetrate U.S. Electric Power Grid‟, The Epoch Times,\n10 April 2009, <http://www.theepochtimes.com/n2/content/view/15058/> [Accessed 18 May\n2011], pp. A1, A4.\n\n\n-----\n\n_Desmond Ball_\n\nInformation Grid, which includes more than 17,000 local- and regional-area\nnetworks and approximately seven million individual computers, and covered\n“memory sticks, thumb drives and camera flash memory cards”. The ban\nfollowed reports that a worm virus known as „Agent.btz‟ had been found to\nhave infected some DoD networks. „Agent.btz‟, which was believed to have\noriginated in China, was described as:\n\na variation of an older worm that copies itself to removable USB drives from\ninfected computers and then spreads itself to whatever new systems it is\nconnected to through USB ports.[22]\n\nIndian computer systems and networks have also been hit by Chinese\nattackers. For example, India‟s INSAT 4B communications satellite suffered\na malfunction in July 2010. It used Siemens software that was the targeted\nby a Stuxnet worm that apparently entered the satellite through its control\nsystem software. It has been speculated that Chinese hackers disabled the\nIndian satellite for commercial advantage, in an exercise of „higher\nstatecraft‟.[23]\n\nOn 10 June 2010, South Korea claimed that a government Web-site was\nattacked the previous day from Internet addresses in China. The intrusions\ninvolved a Distributed Denial-of-Service attack, and were launched from 120\nIP addresses. The targeted Web-site reportedly provided “information on\nadministrative services and government policies”. The attacks were similar\nto those made against the Web-sites of the Office of the Presidency and the\nMinistry of Defence in Seoul in July 2009.[24]\n\nOn 4 March 2011, South Korea‟s National Cyber Security Center said that\nabout forty South Korean government and private Web-sites had been\n\n22 William H. McMichael and Bruce Rolfsen, „DoD Confirms Computer Virus in Networks‟, Air\n_Force Times, 21 November 2008, <http://www.airforcetimes.com/news/2008/11/_\nmilitary_thumbdrives_computerworm_112108w/> [Accessed 18 May 2011]; Jennifer H. Svan\nand David Allen, „DOD Bans the Use of Removable, Flash-type Drives on All Government\nComputers‟, Stars and Stripes, 21 November 2008, <http://www.stripes.com/news/ dod-bansthe-use-of-removable-flash-type-drives-on-all-government-computers-1.85514> [Accessed 18\nMay 2011].\n23 Jeffrey Carr, „Did the Stuxnet Worm Kill India‟s INSAT-4B Satellite?‟, Forbes.com, 29\nSeptember 2010, <http://blogs.forbes.com/firewall/2010/09/29/did-the-stuxnet-worm-kill-indiasinsat-4b-satellite/> [Accessed 18 May 2011]; Peter J. Brown, „Lost Asian Satellites Send\nPowerful Signals‟, Asia Times Online, 9 October 2010, <http://www.atimes.com/atimes/\nChina/LJ09Ad01.html> [Accessed 18 May 2011]; Abhishek Shah, „Was Iranian Nuclear Plant\nComputer Virus Made in China to Disable Indian Communications Satellite‟, Green World\nInvestor, 11 October 2010, <http://greenworldinvestor.com/2010/10/11/was-iranian-nuclearplant-computer-virus-made-in-china-to-disable-indian-communications-satellite/> [Accessed 18\nMay 2011].\n24 Saeromi Shin and Ben Richardson, „South Korea Says Cyber Attacks Came From China\nSites‟, Bloomberg Businessweek, 10 June 2010, <http://www.businessweek.com/news/201006-10/south-korea-says-cyber-attacks-came-from-china-sites-update1-.html> [Accessed 18 May\n2011]; „A Computer Attack from China Blocks South Korean Government Site‟, Technology\n_News, 10 June 2010, <http://www.technoinfonews.info/2010/06/computer-attack-from-china-_\nblocks-south.html> [Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\nattacked the previous day, including those of “the presidential office, the\nForeign Ministry, the National Intelligence Service, U.S. Forces Korea, and\nfinancial institutions”, and that these attacks originated in China. The attacks\ninvolved a more sophisticated form of Denial-of-Service operation, in which\ntwo peer-to-peer file-sharing Web-sites were initially infected with malware,\nfrom which up to 11,000 PCs were then taken over and used in the DOS\nattack.[25]\n\nTaiwan has been subjected to regular attacks on government Web-sites\nsince the late 1990s, although these can mainly be attributed to private\nNetizens. However, some have undoubtedly been generated by Chinese\ngovernment agencies, particularly those involving attacks on the Web-sites\nand networks of Taiwan‟s Ministry of National Defense (MND) and\nintelligence organisations. In July 2004, Chinese hackers attacked Websites of the MND in an attempt to disrupt its annual _Han Kuang-20 (Han_\nGlory-20) defence exercise.[26] In July 2006, the Ministry included its “firstever anti-hacker drill” in its _Han Kuang-22 exercise as “a way of raising_\nawareness of the dangers of „careless leaks‟ of classified information via the\nInternet”.[27] The Web-site of Taiwan‟s National Security Bureau (NSB) was\nreportedly attacked from China about 590,000 times from January to\nOctober 2010, or an average of about 2000 times a day.[28]\n\nThe Taiwanese media have reported that some Chinese hackers utilise\nTaiwan to practice their skills. Others route their attacks through Taiwanese\nservers, mainly because of the common language. For example, six Internet\naddresses in Taiwan were used in attacks on Google in January 2010.[29]\n\n## Cyber-intelligence Operations\n\nChina is credibly reported to have conducted cyber-intelligence operations\nagainst numerous countries, including the United States, the United\n\n25 Clive Webster, „South Korea Cyber-attacked‟, Bit-Tech, 4 March 2011, <http://www.bittech.net/news/bits/2011/03/04/south-korea-cyber-attacked/1> [Accessed 18 May 2011]; Steve\nRagan, „S. Korea Says China Targeted Global Hawk Purchase Plans‟, The Tech Herald, 8\nMarch 2011, <http://www.thetechherald.com/article.php/201110/6913/S-Korea-says-Chinatargeted-Global-Hawk-purchase-plans> [Accessed 18 May 2011].\n26 „Taiwan Shows Force on Beach Facing Chinese Mainland‟, Free Republic, 28 July 2004,\n<http://www.freerepublic.com/focus/f-news/1179921/posts> [Accessed 18 May 2011].\n27 Jimmy Chuang, „Military Stages First-ever Anti-hacker Drill‟, Taipei Times, 15 July 2006,\n<http://www.taipeitimes.com/News/taiwan/archives/2006/07/15/2003318858> [Accessed 18\nMay 2011].\n28 Rich Chang, „National Security Bureau Says that Its Computer System was Not Hacked‟,\n_Taipei Times, 28 March 2011, <http://www.taipeitimes.com/News/taiwan/archives/2011/03/28/_\n2003499317> [Accessed 18 May 2011].\n29 Vincent Y. Chao, „Google Attacks Used Addresses Based in Taiwan‟, Taipei Times, 16\nJanuary 2010, <http://www.taipeitimes.com/News/front/archives/2010/01/16/2003463643>\n\n[Accessed 18 May 2011]; Ku Shu-jen, „Chinese Hackers Practice Their Skills in Taiwan‟,\n_Commonwealth, no. 454 (August 2010), <http://www.cw.com.tw/article/print.jsp?id=41619>_\n\n[Accessed 7 April 2011].\n\n\n-----\n\n_Desmond Ball_\n\nKingdom, Australia, New Zealand, Canada, Germany, France, the\nNetherlands, Portugal, Japan, South Korea, Taiwan, India, Pakistan, Iran,\nThailand, the Philippines and Indonesia.\n\nWith respect to the United States, a computer security company,\nSolutionary, reported in March 2009 that it had detected 128 “acts of\ncyberagression” per minute coming from Internet addresses in China. The\nDepartment of Defense was the main target of the attacks.[30] The US Air\nForce estimated in 2007 that China had “successfully exfiltrated at least 10\nto 20 terabytes” of sensitive data from US Government computers.[31] The\namount obtained from US defence industry networks would be much greater.\nA State Department cable in 2008 revealed that:\n\nsince 2002, cyber intruders involved in what is referred to as the Byzantine\nCandor (BC) attack, believed to originate from China, have exploited the\nvulnerabilities of Windows to steal log-in credentials and gain access to\nhundreds of US government and cleared defence contractor systems over\nthe years.\n\nIt stated that:\n\nIn the US, the majority of the systems BC actors have targeted belong to the\nUS Army, but targets also include other Department of Defense services as\nwell as Department of State, Department of Energy, additional US\ngovernment entities, and commercial systems and networks.[32]\n\nUS officials involved in talks with China at the Copenhagen climate change\nsummit in 2009 were “subject to a cyber attack containing the „poison ivy‟\nremote access tool intended to give hackers almost complete control over\nthe victim‟s system”. According to a State Department cable:\n\nThe message had the subject line „China and Climate Change‟ and was\nspoofed to appear as if it were from a legitimate international economics\ncolumnist at the National Journal.[33]\n\nIn November 2010, a US Congressional advisory group reported that a\nChinese state-owned telecommunications company had hijacked US\nInternet traffic. The incident occurred on 8 April 2010 and lasted for 18\nminutes, during which time traffic was re-routed by China Telecom from\nmajor US Government and military Web-sites (including those of the US\nSenate and the Office of the Secretary of Defense) to China, where Chinese\n\n30 Bill Gertz, „China Blocks U.S. From Cyber Warfare‟, Washington Times, 12 May 2009,\n<http://www.washingtontimes.com/news/2009/may/12/china-bolsters-for-cyber-arms-race-withus/print/> [Accessed 18 May 2011].\n31 Krekel, „Capability of the People‟s Republic of China to Conduct Cyber Warfare and\nComputer Network Exploitation‟,, p. 51.\n32 Robert Booth, „WikiLeaks Cables Reveal Fears Over Chinese Cyber Warfare‟, The Guardian,\n4 December 2010, <http://www.guardian.co.uk/world/2010/dec/04/wikileaks-cables-china-cyberwarfare> [Accessed 18 May 2011].\n33 Ibid.\n\n\n-----\n\n_China and Cyber Warfare_\n\nofficials were able to monitor the traffic. The re-routed traffic amounted to\nabout 15 percent of global Internet traffic.[34]\n\nIn November 2007, the Director-General of MI5 in Britain took the\n“unprecedented step” of openly accusing China of carrying out “statesponsored espionage against vital parts of Britain‟s economy, including the\ncomputer systems of big banks and financial services firms”. In a\nconfidential letter to 300 chief executives and security chiefs at banks,\naccountants and legal firms, he warned them that they were under attack\nfrom “Chinese state organisations”, and that “British companies doing\nbusiness in China are being targeted by the Chinese Army, which is using\nthe Internet to steal confidential commercial information”, and provided “a list\nof known „signatures‟ that can be used to identify Chinese Trojans and a list\nof Internet addresses known to have been used to launch attacks”.[35]\n\nWith respect to Australia, it was reported in September 2007 that China had\n“allegedly tried to hack into highly classified government computer networks\nin Australia … as part of a broader international operation to glean military\nsecrets from Western nations”.[36] According to media reports in February\n2008, Chinese „cyber espionage‟ activities have been conducted against\n“key Australian Government agencies”, “Chinese computer hackers have\nlaunched targeted attacks on classified Australian Government computer\nnetworks”, and China was “believed to be seeking information on subjects\nsuch as military secrets and the prices Australian companies will seek for\nresources such as coal and iron ore”. The Chinese activities reportedly\nprompted an official review of IT security.[37] In March 2011, it was reported\nthat the “parliamentary computers” of a least ten Federal Ministers had been\nhacked into by Chinese intelligence agencies in February, including those of\nPrime Minister Julia Gillard, Foreign Minister Kevin Rudd and Defence\nMinister Stephen Smith, and that “several thousand emails may have been\naccessed”.[38]\n\n34 Caroline Alphonso, „China‟s “Hijacking” of U.S. Data Flow Stokes Fear of Cyberespionage‟,\n_The Globe and Mail, 18 November 2010, <http://www.theglobeandmail.com/news/technology/_\nchinas-hijacking-of-us-data-flow-stokes-fear-of-cyberespionage/article1805319/> [Accessed 18\nMay 2011].\n35 Rhys Blakely, Jonathan Richards, James Rossiter and Richard Beeston, „MI5 Alert on China‟s\nCyberspace Spy Threat‟, The Sunday Times, 1 December 2007, <http://business.\ntimesonline.co.uk/tol/business/industry_sectors/technology/article2980250.ece> [Accessed 18\nMay 2011].\n36 Patrick Walters, „China “Hacked Australian Government Computers”‟, The Australian, 12\nSeptember 2007, <http://www.news.com.au/china-hacked-australian-governmentcomputers/story-e6frfkp9-1111114397676> [Accessed 18 May 2011].\n37 „Chinese Cyber Espionage “Routine” in Australia‟, Canberra Times, 11 February 2008, p. 5.\n38 Simon Benson, „China Spies Suspected of Hacking Julia Gillard‟s Emails‟, The Daily\n_Telegraph, 29 March 2011, <http://www.dailytelegraph.com.au/federal-ministers-emails-_\nsuspected-of-being-hacked/story-fn5h1vlf-1226029713668> [Accessed 18 May 2011]; Joshua\nPhilipp, „Chinese Cyberwar Attacks Canadian and Australian Governments‟, The Epoch Times,\n\n\n-----\n\n_Desmond Ball_\n\nIt was reported in February 2007 that Chinese hackers had also attempted to\npenetrate “highly classified government computer networks” in New Zealand,\nalthough Prime Minister Helen Clark said that she had been assured by New\nZealand‟s intelligence agencies that “no classified information” had been\ntaken.[39]\n\nIn February 2011, Canadian media reported that “Chinese government\nhackers” had penetrated the computers of the Finance and Defense\nDepartments and the Treasury Board in Canada in January. They reportedly\n“also infiltrated computers in the offices of senior government officials in a\nbid to steal passwords providing access to key government data”. A\nChinese government spokesman denied involvement by Beijing in the\nattacks, and stated that “the allegation that the Chinese government\nsupports Internet hacking is groundless”.[40]\n\nWith respect to Germany, China‟s intelligence services were accused in\nAugust 2007 of hacking into Chancellor Angela Merkel‟s office and three\nother German government ministries. Germany‟s domestic intelligence\nservice, the Office for the Protection of the Constitution, reportedly\ndiscovered the hacking operation in May, and “German security officials\nmanaged to stop the theft of 160 gigabytes of data which were in the\nprocess of being siphoned off German government computers”. The\nGerman press reports said that Trojan Horse programs had been “concealed\nin Microsoft Word documents and PowerPoint files which infected IT\ninstallations when opened”, that “information was taken from German\ncomputers in this way on a daily basis by hackers based in the north-western\nprovince of Lanzhou, Canton province and Beijing”, and that “German\nofficials believe the hackers were being directed by the People‟s Liberation\nArmy”.[41]\n\nIn the case of France, the chief of the Network Security Agency stated in\nMarch 2011 that a cyber attack occurred in France in November-December\n2010 in which around 150 computers in the Finance Ministry were\npenetrated and documents relating to the G-20 were accessed by sources\nbelieved to have originated in China. A further 10,000 computers had to be\n\n30 March 2011, <http://www.theepochtimes.com/n2/china/chinese-cyberwar-attacks-canadianand-australian-governments-53878.html> [Accessed 18 May 2011].\n39 Walters, „China “Hacked Australian Government Computers”‟.\n40 „China Denies Canada Hacking Involvement‟, C114, 18 February 2011, <http://www.cnc114.net/583/a581917.html> [Accessed 18 May 2011]; and Philipp, „Chinese Cyberwar Attacks\nCanadian and Australian Governments‟.\n41 „Espionage Report: Merkel‟s China Visit Marred by Hacking Allegations‟, Spiegel, 27 August\n2007, <http://www.spiegel.de/international/world/0,1518,502169,00.html> [Accessed 18 May\n2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\ntaken off-line in March 2011 and “inspected for traces of the Trojan Horse\nresponsible, which was apparently introduced via an email attachment”.[42]\n\nSouth Korean officials claimed in March 2011 that China targeted Seoul‟s\nplans for acquisition of _Global Hawk unmanned aerial vehicles. Chinese_\nofficials flatly denied the claims. Wang Mingzhi, a military strategist at the\nPeople‟s Liberation Army Air Force Command College stated that “South\nKorea‟s news is groundless”.[43]\n\nTaiwan‟s Ministry of National Defense announced in April 2007 that Chinese\nNet Force hackers had used Trojan Horses to obtain information on two\nparticularly sensitive matters, the _Po Sheng („Broad Victory‟) project_\n(involving cooperation with the United States on C4ISR—command, control,\ncommunications, computers, intelligence, surveillance and reconnaissance)\nand the _Han Kuang-23 („Han Glory-23‟) defence exercise.[44] In the case of_\nthe Han Kuang-23 material, an officer working on the exercise planning staff\nhad taken confidential information home in his laptop in order to “do more\nwork after hours”, but his laptop was penetrated by an unidentified Chinese\nhacker and the information stolen. In the case of the Po Sheng data, it had\nbeen copied by another officer onto a USB which was later found to have\ncontained a Trojan Horse designed to send its contents back to Beijing.[45]\n\nIn the case of India, officials said in May 2008 that over the previous one and\na half years, China had “mounted almost daily attacks on Indian computer\nnetworks, both government and private”. The officials said that “the Chinese\nare constantly scanning and mapping India‟s official networks”, and that “this\ngives them a very good idea of not only the content but also of how to\ndisable the networks or distract them during a conflict”. Attacks that were\n“sourced to China” during the first few months of 2008 included “an attack on\nthe NIC (National Infomatics Centre), which was aimed at the National\n\n42 „Hackers Target French Finance Ministry, G-20 Plans‟, Hacking Mania, 8 March 2011,\n<http://hackingmania.com/Blog/hackers-target-french-finance-ministry-g-20-plans> [Accessed\n18 May 2011]; Daniel Flynn and Laure Bretton, „France‟s G20 Plans Targeted in Cyber Attack:\nMinister‟, Reuters, 7 March 2011, <http://www.reuters.com/article/2011/03/07/us-g20-franceespionage-idUSTRE72619F20110307> [Accessed 18 May 2011]; Michael Cosgrove, „Op-Ed:\nThe Massive Network Hacking of French Ministries and the Elysée‟, Digital Journal, 9 March\n2011, <http://www.digitaljournal.com/article/304457> [Accessed 18 May 2011].\n43 Ragan, „S. Korea Says China Targeted Global Hawk Purchase Plans‟.\n44 Military News Agency of the Ministry of National Defense, „The Ministry of National Defense\nReinforces its Control on Information Security to Preclude the Leak of Information‟, 9 April 2007,\n<http://mna.gpwb.gov.tw/mnanew/internet/NewsDetail.aspx?GUID=32436> [Accessed 18 May\n2011].\n45 „Taiwan on High Alert after Military Leak‟, 9 April 2007,\n<http://newsgroups.derkeiler.com/Archive/Soc/soc.culture.taiwan/2007-04/msg00007.html>\n\n[Accessed 18 May 2011]; Jimmy Chuang, „More Military Exercise Details Leaked‟, Taipei Times,\n1 May 2007, <http://newsgroups.derkeiler.com/Archive/Soc/soc.culture.taiwan/200705/msg00000.html> [Accessed 18 May 2011].\n\n\n-----\n\n_Desmond Ball_\n\nSecurity Council”, and an attack on the Ministry of External Affairs.[46] In\nJanuary 2010, India‟s National Security Advisor, M. K. Narayanan, asserted\nthat Chinese hackers had attempted to penetrate computers in some of\nIndia‟s most sensitive government officers, including his own, on 15\nFebruary 2009.[47]\n\nTwo reports issued in March 2009 documented “Chinese cyber spying\nagainst Tibetan institutions”. A Canadian investigation revealed a network\nwhich it called „GhostNet‟ which had infected more than 1295 hosts in 103\ncountries, and included “computers located at ministries of foreign affairs,\nembassies, international organizations, news media, and NGOs”. It found\nthat Tibetan computers “were conclusively compromised by multiple\ninfections that gave attackers unprecedented access to potentially sensitive\ninformation”.[48] Bugged computers were detected “in the foreign ministries of\nseveral countries, including Iran and Indonesia, and in the embassies of\nIndia, South Korea, Taiwan, Portugal, Germany and Pakistan”. Investigators\ntracked the virus to “a group of servers on Hainan Island”, and to “other\nservers … based in China‟s Xinjiang Uyghur autonomous region, where\nintelligence units dealing with Tibetan independence groups are based”.[49]\n\nChinese hackers have evidently also targeted multinational energy\ncompanies. In February 2011, for example, the computer security firm\nMcAfee alleged that Chinese attackers had made “coordinated, covert and\ntargeted” intrusions into the systems of five major oil and gas firms to steal\nproprietary information. It reported that “the hackers could be traced back to\nChina via a server leasing company in Shandong province that hosted the\nmalware”, as well as to Beijing IP (Internet Protocol) addresses, and that the\nattacks, which it called Operation _Night Dragon, “focused on financial data_\nrelated to oil and gasfield exploration and bidding contracts”. It also claimed\nthat the hackers had “copied proprietary industrial processes”.[50]\n\n46 Indrani Bagchi, „China Mounts Cyber Attacks on Indian Sites‟, The Times of India, 5 May\n2008, <http://articles.timesofindia.indiatimes.com/2008-05-05/india/27760718_1_cyber-warfaregovernment-networks-china> [Accessed 18 May 2011].\n47 „China Behind Hacking of Indian Computers, Says Narayanan‟, The Siasat Daily, 18 January\n2010, <http://article.wn.com/view/2010/01/18/China_behind_hacking_of_Indian_computers_\nsays_Narayanan/> [Accessed 18 May 2011].\n48 Citizen Lab, „Tracking GhostNet: Investigating a Cyber Espionage Network‟, Information\n_Warfare Monitor, 29 March 2009, <http://www.scribd.com/doc/13731776/Tracking-GhostNet-_\nInvestigating-a-Cyber-Espionage-Network> [Accessed 18 May 2011].\n49 Dan Glaister, „China Accused Over Global Computer Spy Ring‟, The Guardian, 30 March\n2009, <http://www.guardian.co.uk/world/2009/mar/30/china-dalai-lama-spying-computers>\n\n[Accessed 18 May 2011]; Shishir Nagaraja and Ross Anderson, „The Snooping Dragon: SocialMalware Surveillance of the Tibetan Movement‟, University of Cambridge Technical Laboratory,\nTechnical Report No. 746, March 2009, <http://www.cl.cam.ac.uk/techreports/UCAM-CL-TR746.html> [Accessed 18 May 2011].\n50 Tania Branigan, „Chinese Hackers Targeted Energy Multinationals, Claims McAfee‟, The\n_Guardian, 11 February 2011, <http://www.guardian.co.uk/world/2011/feb/11/chinese-hackers-_\ntargeted-energy-multinationals> [Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\nFrom mid-2009 to January 2010, a cyber attack originating in China was\nlaunched against Google and more than twenty other companies. According\nto a diplomatic cable from the US Embassy in Beijing, a Chinese source\nreported that the intrusions were directed by the Politburo. The cable\nsuggested that the hacking was part of a coordinated campaign executed by\n“government operatives, public security experts and Internet outlaws\nrecruited by the Chinese government”. Called Operation _Aurora, a specific_\npurpose of the attack on Google was reportedly to access the Gmail\naccounts of Chinese dissidents and human rights activists. More generally,\nthe goal was to gain access to and potentially modify source code\nrepositories at some twenty to thirty-four high tech, security and defence\ncontractor companies. The attackers exploited a vulnerability in the Adobe\nPDF format used in Microsoft‟s Internet Explorer browser to open a back\ndoor, through which the intruder performed reconnaissance and gained\ncontrol over the source codes.[51]\n\nIn March 2011, a Denial-of-Service attack originating in China hit the blogpublishing site WordPress, interfering with the company's three data centres\nin Chicago, San Antonio and Dallas. The attacks directed “multiple Gigabits\nper second and tens of millions of packets per second”.[52] And in April, an\non-line petitioning platform, Change.org, which had hosted a petition urging\nChinese authorities to release artist Ai Weiwei from custody, was also hit by\na Denial-of-Service attack coming from China.[53]\n\nChinese intelligence agencies also monitor the computer files and e-mails of\nselected individuals. Monitoring the personal e-mails of officials can provide\ninformation that can be used for blackmail or coercion, such as a person‟s\ninterest in money or sex.\n\n## China’s Netizens\n\nBy 2001, when China had some 60 million Internet users (the second largest\nnumber after the United States),[54] it already had the largest number of active\n\n51 Bobbie Johnson, „Chinese Hackers Used Microsoft Browser to Launch Google Strike‟, The\n_Guardian, 15 January 2010, <http://www.guardian.co.uk/technology/2010/jan/15/microsoft-_\nchina-google> [Accessed 18 May 2011]; „Operation Aurora‟, Wikipedia, <http://en.wikipedia.org/\nwiki/Operation_Aurora> [Accessed 18 May 2011]; Marzieh Ghiasi, „Google vs. China:\nCyberwarfare in a Brave New World‟, 13 January 2010, <http://ghiasi.org/2010/01/google-vschina-cyberwarfare-in-a-brave-new-world/> [Accessed 18 May 2011]; Jim Finkle, „Google China\nHackers Stole Source Code‟, Chinh’s News, 4 March 2010, <http://chinhdangvu.blogspot.com/\n2010/03/google-china-hackers-stole-source-code.html> [Accessed 18 May 2011].\n52 Michael Kan, „WordPress: DDOS Attacks Came From China‟, PCWorld, 7 March 2011,\n<http://www.pcworld.com/businesscenter/article/221467/wordpress_ddos_attacks_came_from_\nchina.html> [Accessed 18 May 2011].\n53 Ibid.\n54 „U.S. Has 33% Share of Internet Users Worldwide Year-end 2000‟, Computer Industry\n_Almanac Inc., Press Release, 24 April 2001, <http://www.c-i-a.com/pr0401.htm> [Accessed 18_\nMay 2011]; „China Climbs to Second Spot With 59m Net Users‟, The Nation (Bangkok), 20\nJanuary 2003, p. 9A.\n\n\n-----\n\n_Desmond Ball_\n\nnon-governmental cyber-warriors in Asia. It surpassed the United States in\nInternet users in mid-2008, when it reached an estimated 253 million.[55] It\nreached 457 million by the end of 2010, an increase of 19 percent (or 73\nmillion users) over 2009. Its Internet penetration rate of 34.3 percent is still\nrelatively low compared to that of developed countries, although it is higher\nthan the world average.[56]\n\nMany of these non-governmental cyber-warriors are motivated by nationalist\ncauses. Attacks on Taiwanese Web-sites began in 1996, when Chinese\nhackers defaced and damaged Web-sites during the Presidential election.[57]\nIn August 1999, there was a spate of cross-Strait attacks against computer\nnetworks and official Web-sites in Taiwan, which were launched by Netizens\nreacting to then-President Lee Tung-hui‟s statement in June that relations\nbetween the PRC and Taiwan should be characterised as “special State-toState” relations. These attacks involved more than 160 penetrations into\nTaiwanese computer networks. The hackers even invaded the Web-site of\nthe American Institute in Taiwan, the unofficial US Embassy (and the\nlocation of the National Security Agency‟s Liaison Office in Taipei), and\ncrashed its server with a bombardment of 45,000 simultaneous e-mails.[58] In\nanother spate, between November 2001 and July 2002, “hackers based in\nChina broke into 216 computers at 42 government institutions via a back-up\ncomputer processing unit at Chungwa Telecom”, in what Taiwanese\ntelecommunications officials said was “the most systematic and large-scale\nhijacker break-in of its kind in Taiwan”.[59] In June 2004, Chinese hackers\nattacked the site of Taiwan President Chen Shui-bian‟s pro-independence\nDemocratic Progressive Party.[60]\n\nIn January 2000, there was an intense spate of attacks on Japanese\ngovernment Web-sites, probably triggered by denials by right-wing Japanese\nthat Japanese troops had massacred Chinese civilians when they seized\nNanjing in 1937. The Web-sites of at least twenty government departments\nwere attacked, including those of the Japan Defense Agency (JDA) and the\nForeign Ministry. On some sites, the hackers posted slogans criticising\n\n55 David Barboza, „China Surpasses U.S. in Number of Internet Users‟, New York Times, 26\nJuly 2008.\n56 Michael Kan, „China‟s Internet Users Reach 457 Million‟, PCWorld, 19 January 2011,\n<http://www.pcworld.com/businesscenter/article/216979/chinas_internet_users_reach_457_milli\non.html> [Accessed 18 May 2011].\n57 Elizabeth Becker, „F.B.I. Warns That Chinese May Disrupt U.S. Web Sites‟, New York Times,\n28 April 2001.\n58 Damon Bristow, „Cyber-Warfare Rages Across Taiwan Strait‟, Jane’s Intelligence Review,\nFebruary 2000, pp. 40-1.\n59 „Taiwan Not Helping Falun Gong Hack Into China TV Signals: Official‟, Taiwan Headlines, 26\nSeptember 2002, <http://www.taiwanheadlines.gov.tw/20020926/20020926s1.html> [Accessed\n7 April 2011]; „Taiwan Downplays China TV Hacking‟, CNN.Com, 26 September 2002,\n<http://asia.cnn.com/ 2002/WORLD/asiapcf/east/09/25/taiwan. Falungong/> [Accessed 18 May\n2011].\n60 „Taiwan Shows Force on Beach Facing Chinese Mainland‟, Free Republic, 28 July 2004,\n<http://www.freerepublic.com/focus/f-news/1179921/posts> [Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\nJapan‟s war-time acts; important data was erased from one site. Twelve of\nthe attacks were routed through ISPs (internet service providers) in the PRC,\nbut some had probably also come through ISPs in South Korea, where there\nis also widespread resentment at Japan‟s past militarism.[61]\n\nAnother round of coordinated assaults on Japanese Web-sites occurred in\nearly 2005, when Japan‟s Education Ministry approved new textbooks that\ncritics argued „whitewashed‟ the history of Japanese aggression in the\nregion. Web-sites of the Japanese Embassy in Beijing, the National Police\nAgency, the Self-Defense Forces and the Defense and Foreign ministries\nwere repeatedly taken down by Denial-of-Service attacks. The servers for\nthe Web-site for Tokyo‟s Yasukuni Shrine were clogged by millions of „ping‟\nstrikes.[62] And in September 2010, when tensions between China and Japan\nincreased amid the territorial dispute over the Senkaku (or Diaoyu) Islands in\nthe East China Sea, the Web-sites of both the Defense Ministry and the\nNational Police Agency were bombarded in Denial-of-Service attacks by\nChinese hackers.[63]\n\nDuring the NATO air war against Yugoslavia in March-June 1999, Chinese\nhackers attacked hundreds of government and military Web-sites and other\ninformation systems in the United States, the United Kingdom, and other\nNATO countries. „Ping‟ attacks were launched to crash NATO Web servers.\nThe attacks became especially virulent following the US bombing of the\nChinese Embassy in Belgrade on 7 May. In the United States, computer\nsystems at the White House, the Pentagon and the State Department were\nattacked. More than 100 government Web-sites in the United States\nreceived virus-infected e-mails. Hackers also penetrated the Web-site of the\nUS Embassy in Beijing.[64] In May 2001, in the aftermath of the EP-3E\nincident (and the second anniversary of the US bombing of the Chinese\nEmbassy in Belgrade), Chinese hackers attacked “a few hundred” US Websites.[65] The official White House home page suffered a Denial-of-Service\nattack for more than two hours on 4 May.[66]\n\n61 „Japan Crime: Cyber-terror Task Force Established‟, Bangkok Post, 27 January 2000, p. 6;\nChester Dawson, „Cyber Attack‟, Far Eastern Economic Review, 10 February 2000, p. 21.\n62 Anthony Faiola, „Cyber Warfare: China vs Japan‟, 11 May 2005, <http://www.crimeresearch.org/news/11.05.2005/1227/> [Accessed 18 May 2011].\n63 „Japan Suspects Cyber Attacks Amid China Row: Media‟, Space Daily, 17 September 2010,\n<http://www.spacedaily.com/reports/Japan_suspects_cyber_attacks_amid_China_row_media_9\n99.html> [Accessed 18 May 2011].\n64 John Parker, Total Surveillance: Investigating the Big Brother World of E-Spies,\n_Eavesdroppers and CCTV (London: Piatkus, 2000), p. 280; Bill Gertz, „Chinese Hackers Raid_\nU.S. Computers‟, The Washington Times, 16 May 1999.\n65 Ron Chepesiuk, „Get Ready for Cyberwars‟, New California Media, 23 August 2001,\n<http://www.ncmonline.com/content/ncm/2001/aug/0823cyberwars.html> [Accessed 7 April\n2011].\n66 „White House Website Attacked‟, Cosmiverse.com, 7 May 2001,\n<http://www.cosmiverse.com/tech05070102.html> [Accessed 18 May 2011].\n\n\n-----\n\n_Desmond Ball_\n\nIn September 2002, it was reported that since late April Chinese hackers had\nbeen trying to penetrate the Dalai Lama‟s computer network. The manager\nof the Tibetan Computer Resource Centre in Dharamsala, in India, said that\n“Chinese hackers had designed a virus to plug into the network and steal\ninformation”.[67] The attacks came in hundreds of e-mails using false\naddresses appearing to be friendly sources, and included Trojan Horse\nprograms designed to seek out files and attempt to e-mail them to an\naddress in China, and programs designed to open „back doors‟ to allow the\nhackers to take control of target computers through Internet connections.\nAccording to dissident groups, who were sometimes able to trace the source\nof the attacks, the hacking was officially sponsored: “They are Chinese\nhackers employed by a State-owned industry operating on the State‟s\ntime”.[68]\n\nThere is no doubt that the Chinese authorities exercise some degree of\ncontrol over some of these hackers. In May 2002, for example, when the US\nDepartment of Defense reportedly braced itself for an onslaught of cyber\nattacks, they never materialised because (according to the Deputy\nCommander of the Pentagon‟s Joint Task Force on Computer Network\nOperations), “actually the government of China asked them not to do that”.[69]\n\nIt was reported in November 2008 that the largest US military base in\nAfghanistan, at Bagram, was hit by a computer virus that affected nearly\nthree-quarters of the computers on the base. This was not the first such\ncyber-attack. Officials stated that “earlier incarnations of the virus had\nexported information such as convoy and troop movements”. It could not be\ndetermined “whether the viruses were part of a covert Chinese government\neffort or the work of private hackers”, although US military spokesmen did\nsay that the Chinese “learn a lot from these attacks, like how our logistics\nand other systems work”.[70]\n\nIn a secret cable in June 2009, the US State Department noted that Chinese\nauthorities were working with private companies that were known to have\nrecruited infamous hackers. It stated that “there is a strong possibility the\nPRC is harvesting the talents of its private sector in order to bolster offensive\nand defensive computer network operations capabilities”, warned that the\n“potential linkages of China‟s top companies with the PRC illustrate the\ngovernment‟s use of its private sector in support of information warfare\n\n67 Bodeen, „Mainland Asks Taiwan to Stop Interference‟.\n68 Doug Nairne, „State Hackers Spying On Us, Say Chinese Dissidents‟, South China Morning\n_Post, 18 September 2002._\n69 Cited in Pamela Hess, „China Prevented Repeat Cyber Attack on US‟, InfoSecNews.org, 29\nOctober 2002, <http://www.infosecnews.org/hypermail/0210/6714.html> [Accessed 18 May\n2011].\n70 Anna Mulrine, „Computer Virus Hits U.S. Military Base in Afghanistan‟, U.S. News and World\n_Report, 28 November 2008, <http://www.usnews.com/news/iraq/articles/2008/11/28/computer-_\nvirus-hits-us-military-base-in-afghanistan> [Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\nobjectives”, and gave two examples of hacker recruitment. One was Lin\nYong (also known as „LION‟), who founded the Honkers Union of China\n(HUC) which attacked US and Japanese networks around 2001, and the\nother was the XFocus group which produced the Blaster worm in 2003.[71]\n\nIn July 2008, CNN reporters met with members of a hacking group that\noperated from an apartment on the island of Zhoushan, just south of\nShanghai, and who claimed that they had “hacked into the Pentagon and\ndownloaded information”. They also claimed that they had been “paid by the\nChinese government”.[72]\n\nPentagon officials told a Congressional hearing in Washington in March\n2008 that computer networks in the United States, Germany, Britain and\nFrance had been hit by “multiple intrusions” originating from China during\n2007, but were generally cautious about attributing these to the Chinese\nmilitary or government authorities as opposed to private Netizens. However,\nDavid Sedney, the Deputy Assistant Secretary of Defense for East Asia,\ntestified that: “The way these intrusions are conducted are certainly\nconsistent with what you would need if you were going to actually carry out\ncyber warfare”.[73]\n\nOn the other hand, several factors militate against the PLA‟s incorporation of\nNetizen or „hacktivist‟ activities in its plans for computer network operations\nin war-time. Guiding and directing these activities would be very difficult.\nHacktivist activities have the potential to interfere with and “inadvertently\ndisrupt” the PLA‟s own attacks. They also:\n\nrisk shutting down the lines of communication in use for intelligence\ncollection or accidentally overwhelm channels the PLA is using as feedback\nloops to monitor the effectiveness of [its] network attacks.[74]\n\n## China’s Vulnerabilities\n\nChinese officials have pointed out that “China is the biggest victim country\nof hacking”.[75] Official data showed that “more than one million IP addresses\nwere under control by overseas sources”, and that more than 42,000 Websites were “tampered by hackers” in 2009.[76] According to the National\n\n71 Booth, „WikiLeaks Cables Reveal Fears Over Chinese Cyber Warfare‟.\n72 John Vause, „Red Chinese Hackers: No Site is Safe‟, CNN.com, 11 March 2008,\n<http://edition.cnn.com/2008/TECH/03/07/china.hackers/index.html> [Accessed 18 May 2011].\n73 Julian E. Barnes, „Chinese Hacking Worries Pentagon‟, Los Angeles Times, 4 March 2008,\n<http://articles.latimes.com/2008/mar/04/world/fg-uschina4> [Accessed 18 May 2011]; Vause,\n„Red Chinese Hackers: No Site is Safe‟.\n74 Bryan Krekel, „Capability of the People‟s Republic of China to Conduct Cyber Warfare and\nComputer Network Exploitation‟, p. 40.\n75 „Accusation of Chinese Government‟s Participation in Cyber Attack “Groundless”: Ministry‟,\n_Xinhua, 25 January 2010, <http://news.xinhuanet.com/english2010/china/2010-_\n01/25/c_13149276.htm> [Accessed 18 May 2011].\n76 Ibid.\n\n\n-----\n\n_Desmond Ball_\n\nComputer Network Emergency Response Technical Coordination Centre in\nBeijing in a report released in March 2011, more than 4600 Chinese\ngovernment Web-sites had their content modified by hackers in 2010, an\nincrease of 68 percent over the previous year.[77]\n\nA two-month survey conducted in mid-2003 by officials of the Ministry of\nPublic Security showed that 85 percent of computers in China were infected\nwith a computer virus. The officials noted that “the main reason for the\nspread of the viruses was increasing use of the internet and e-mail”.[78] The\nproportion increased to 88 percent in 2004, but then dropped to about 80\npercent in 2005.[79] A Chinese Internet security company reported in July\n2007 that more than 35 million computers in China had been attacked by\nviruses in the first half of that year. It estimated that 68.71 percent of the\nviruses were Trojan Horses, of which 76.04 percent were “phishing-related\nviruses”.[80] A study covering January-November 2008 found that the number\ninfected had increased by 12.16 percent compared to the previous year, and\nthat 64 percent were Trojans, 20 percent back door viruses, 12 percent other\nviruses and four percent worms. The majority were being used by hackers\nto steal virtual property.[81]\n\nA list of the top 100 viruses infecting computers world-wide at the beginning\nof 2011 showed that in every single case China was the country “most\naffected”.[82] Moreover, nearly all these viruses originated in China. The top\n10 in 2008 all originated in China: Trojan.PSW.Win32.GameOL, which\nopens up firewalls and collects confidential information such as personal\nfinancial information; Trojan.Win32.Undef, similar to PSW.Win32.GameOL;\nRootKit.Win32.Mnless, which obtains root privileges and uses them to\nmodify the operating system, extract passwords and other confidential\ninformation, and, if so directed, destroy the host computer; Hack.Exploit.Swf,\nfirst detected in July 2008, which is transmitted from infected Web-sites and\nwhich affects Windows NT, 2000, XP and 2003; Trojan.PSW.SunOnline, a\nTrojan which installs itself on PCs and destroys data and files on those PCs;\n\n77 Mark Lee, „China Reports 68% Jump in Cyber Attacks on Government Websites‟, Bloomberg,\n10 March 2011, <http://www.bloomberg.com/news/2011-03-10/china-reports-68-jump-inhacking-attacks-on-government-websites-in-2010.html> [Accessed 18 May 2011].\n78 „Computer Viruses Rampant in China‟, BBC News, 21 October 2003,\n<http://news.bbc.co.uk/2/hi/technology/3210086.stm> [Accessed 18 May 2011].\n79 „Computer Virus Infection Rate Down in China‟, Icrontic, 18 November 2005,\n<http://icrontic.com/forum/showthread.php?t=39565> [Accessed 18 May 2011].\n80 „Report: China Suffers Most From Computer Viruses‟, China Tech News.com, 30 July 2007,\n<http://www.chinatechnews.com/2007/07/30/5691-report-china-suffers-the-most-from-computervirus> [Accessed 18 May 2011]; „Kingsoft Releases Computer Virus Security Report‟, China\nTech News.com, 6 July 2007, <http://www.chinatechnews.com/2007/07/06/5605-kingsoftreleases-computer-virus-security-report> [Accessed 18 May 2011].\n81 Heike, „China‟s Computer Virus Epidemic Shows 12% Increase‟, The Dark Visitor, 18\nNovember 2008, <http://www.thedarkvisitor.com/2008/11/chinas-computer-virus-epidemicshows-12-increase/> [Accessed 18 May 2011].\n82 „Top 100 Virus Threats‟, PC1News.com, <http://www.pc1news.com/virus/top100.html>\n\n[Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\nRootKit.Win32.Undef, which is similar to RootKit.Win32.Mnless;\nTrojan.PSW.Win32.XYOnline, which is similar to the first two viruses;\nTrojan.Clicker.Win32.Pophot, also similar; Worm.Win32.Agent, released on\n6 July 2006, which affects the Windows PE EXE file; and\nTrojan.PSW.Win32.QQPass, released on 24 September 2006, which also\naffects the Windows PE EXE file and which is designed to steal user\npasswords.[83]\n\nAccording to Chinese sources, China has over thirty active Internet virus\ngroups. Ten virus-producing groups account for 80 percent of viruses in the\ncountry: these are known as the Huangfei Hu, HYC, HY, Old Serpent, 192,\nGZWZ, CL, Zhang Feng, WG, and Anne Groups.[84] These virus groups differ\nfrom hackers in that they do not directly steal money. Rather, they use a\nvariety of techniques to re-direct computer users to selected Web-sites,\nincluding “tampering with pop-up advertisements, creating website links on\npeople‟s desktops, changing the computer‟s homepage or changing icons on\nthe bookmarks bar”. A Chinese cyber security expert has noted that:\n\nit is extremely difficult to destroy these groups. The virus group Huangfeihu,\nfor example, changed its IP address over 500 times within one year and is\nvigilant to the extreme. But what‟s even more key in the situation is that\nmany of these groups set up their servers abroad, hence making them\nimpossible to trace.[85]\n\nThe Chinese regime has attempted to impose greater control over internal\nnetworks, both to suppress domestic opposition and to block penetration\nfrom outside the country. It has surrounded the country with a Great\nFirewall, also referred as the Golden Shield Project, which is an Internet\ncensorship and surveillance project operated by the Ministry of Public\nSecurity (MPS). It was initiated in 1998, following approval by the State\nCouncil of the „Computer Information Network and Internet Security,\nProtection, and Management Regulations‟ on 11 December 1997, when\nInternet usage was becoming popular in China, and took operational effect in\nNovember 2003. It is estimated that between 30,000 and 50,000 Internet\npolice are employed in this project.[86] New laws were enacted in April 2010\nwhich require Internet and mobile phone operators “to inform the authorities\n\n83 Heike, „China‟s Computer Virus Epidemic Shows 12% Increase‟. See also Kaspersky.com,\n„Virus Watch‟, <http://www. kaspersky.com/viruswatchlite?search_virus=TrojanDownloader.Win32.Bagle&hour_offset =6&x=15&y=7> [Accessed 18 May 2011].\n84 „China‟s Top Ten Virus Secret Groups Exposed and Their Five Means of Illegal Profits‟, 6\nMarch 2011, <http://www.pcwarn.com/chinas-top-ten-virus-exposure-secret-group-means-ofthe-five-illegal-profits/> [Accessed 18 May 2011].\n85 „Computer Viruses: A Highly Lucrative Market in China‟, eChinacities.com, 6 March 2011,\n<http://www.echinacities.com/china-media/why-computer-viruses-are-a-highly-lucrative-marketin-china.html> [Accessed 18 May 2011].\n86 Amnesty International, „What is Internet Censorship?‟, 28 March 2008,\n<http://www.amnesty.org.au/china/comments/10926/> [Accessed 18 May 2011].\n\n\n-----\n\n_Desmond Ball_\n\nof any illegal information being transmitted on their systems”, i.e., any\ninformation that might affect political stability.[87]\n\nSince the beginning of the 2000s, Beijing has been pushing both\ngovernment agencies and the business sector to use Unix and Linux\noperating systems. More recently, it has mandated the use of Kylin, a highly\nsecure, Unix-based operating system, apparently much more secure than\nMicrosoft server software, which China‟s University of Science and\nTechnology for National Defence developed, and installation of which began\non government and military systems in 2009, with the intention of making\nBeijing‟s networks “impenetrable to U.S. military and intelligence agencies”.[88]\n\nIt is clear that there are at least as many Netizens concerned with breaching\nthe Great Firewall (a practice known as _fanqiang, or „scaling the wall‟) as_\nthere are with attacking foreign networks.[89] Several techniques are used\nwhich evade blocking by using third party sites that are not filtered, including\nVPN (virtual private network) services, such as GPass or Hotspot Shield;\nblocking-resistant tools, such as Freegate or Ultrasurf; secure shell (SSH)\naccess tools; proxy servers; and anonymity software such as Tor, which is\nalso an effective circumvention tool.[90]\n\nJames Lewis, the cyber-warfare expert at the Center for Strategic and\nInternational Studies (CSIS) in Washington, D.C., has argued that Beijing‟s\nneed to secure China‟s computers and networks against internal dissent and\nopposition actually comprises an „asymmetric handicap‟. He has pointed out\nthat: “For all the effort the Chinese put into cyber competition, external\nefforts”—against a potential foe like the United States—“are second priority.\nThe primary priority is domestic control and regime survival. The external\npart is a side benefit”.[91]\n\n87 Nigel Inkster, „China in Cyberspace‟, Survival, vol. 52, no. 4 (August-September 2010), pp.\n55-66.\n88 Gertz, „China Blocks U.S. From Cyber Warfare‟; „China Turns Unix Into a Weapon‟, Strategy\n_Page, 14 May 2009, <http://www.strategypage.com/htmw/htiw/articles/20090514.aspx>_\n\n[Accessed 18 May 2011].\n89 Aida Shelton, „Scaling the Firewall: How Chinese Netizens Take the Internet Into Their Own\nHands‟, eChinacities.com, 23 September 2010, <http://www.echinacities.com/expatcorner/scaling-the-firewall-how-chinese-netizens-take-the.html> [Accessed 18 May 2011].\n90Hal Roberts, Ethan Zuckerman, Jillian York, Robert Faris and John Palfrey, „2010\nCircumvention Tool Usage Report‟, The Berkman Center for Internet & Society, Harvard\nUniversity, October 2010, <http://cyber.law.harvard.edu/sites/cyber.law.harvard.edu/files/\n2010_Circumvention_Tool_Usage_Report.pdf> [Accessed 18 May 2011]; Chen Chen, „Netizens\nBypassing the Great China Firewall‟, China Decoded, 26 July 2010, <http://www.chinadecoded.\ncom/2010/07/26/netizens-bypassing-the-great-china-firewall/> [Accessed 18 May 2011].\n91 Cited in James Fallows, „Cyber Warriors‟, The Atlantic, March 2010,\n<http://www.theatlantic.com/magazine/archive/2010/03/cyber-warriors/7917/2/> [Accessed 18\nMay 2011]. See also James A. Lewis, „The Architecture of Control: Internet Surveillance in\nChina‟, Center for Strategic and International Studies, Washington, D.C., July 2006,\n<http://csis.org/files/media/csis/pubs/0706_cn_surveillance_and_information_technology.pdf>\n\n[Accessed 18 May 2011].\n\n\n-----\n\n_China and Cyber Warfare_\n\n## Conclusions\n\nChinese strategists are quite aware of their own deficiencies and\nvulnerabilities with respect to cyber-warfare. In June 2000, “a series of hightechnology combat exercises” being conducted by the PLA “had to be\nsuspended” when they were attacked by “a computer hacker”.[92] China‟s\ntelecommunications technicians were impotent against the intermittent\nhijacking of the Sinosat-1 national communications satellite by Falun Gong\n„practitioners‟ in the early 2000s. China‟s demonstrated offensive cyberwarfare capabilities are fairly rudimentary. Chinese hackers have been able\nto easily orchestrate sufficient simultaneous „pings‟ to crash selected Web\nservers (i.e., Denial-of-Service attacks). They have been able to penetrate\nWeb-sites and deface them, erase data from them, and post different\ninformation on them (such as propaganda slogans). And they have\ndeveloped various fairly simple viruses for spreading by e-mails to disable\ntargeted computer systems, as well as Trojan Horse programs insertible by\ne-mails to steal information from them. However, they have evinced little\nproficiency with more sophisticated hacking techniques. The viruses and\nTrojan Horses they have used have been fairly easy to detect and remove\nbefore any damage has been done or data stolen. There is no evidence that\nChina‟s cyber-warriors can penetrate highly secure networks or covertly\nsteal or falsify critical data. They would be unable to systematically cripple\nselected command and control, air defence and intelligence networks and\ndatabases of advanced adversaries, or to conduct deception operations by\nsecretly manipulating the data in these networks. The gap between the\nsophistication of the anti-virus and network security programs available to\nChina‟s cyber-warriors as compared to those of their counterparts in the\nmore open, advanced IT societies, is immense. China‟s cyber-warfare\nauthorities must despair at the breadth and depth of modern digital\ninformation and communications systems and technical expertise available\nto their adversaries.\n\nChina is condemned to inferiority in IW capabilities for probably several\ndecades. At best, it can employ asymmetric strategies designed to exploit\nthe (perhaps relatively greater) dependence on IT by their potential\nadversaries—both the C[3]ISREW elements of adversary military forces and\nthe vital telecommunications and computer systems in the adversary's\nhomelands. In particular, attacks on US information systems relating to\nmilitary command and control, transportation and logistics could “possibly\ndegrade or delay U.S. force mobilisation in a time-dependent scenario”, such\nas US intervention in a military conflict in the Taiwan Straits.[93] China‟s\ncyber-warfare capabilities are very destructive, but could not compete in\n\n92„Asian Infowar: The Top Ten‟, Jane's Foreign Report, No. 2617 (16 November 2000), p. 5;\nDamon Bristow, „Asia: Grasping Information Warfare?‟, Jane's Intelligence Review, December\n2000, p. 33.\n93 Mulvenon, „The PLA and Information Warfare‟, pp. 175, 176, 184-5.\n\n\n-----\n\n_Desmond Ball_\n\nextended scenarios of sophisticated IW operations. In other words, they\nfunction best when used pre-emptively, as the PLA now practices in its\nexercises.[94] In sum, the extensive Chinese IW capabilities, and the\npossibilities for asymmetric strategies, are only potent if employed first.\n\n**Table 1: Selected Chinese Computer Virus and Worm Designs**\n\nTypical boot sector virus, infects master boot sectors on hard disks\n\n**AntiCMOS** and boot sectors on diskettes. Stays resident in memory.\n\nOriginated in Hong Kong in 1994.\n\nSimple non-resident virus for overwriting COM/EXE files. 3072\n**Changsha**\nbytes.\n\nAlso called Gene. Stays resident in memory and infects EXE files\n\n**Dalian** when they are listed with the DIR command. 1366 bytes. Produced\n\nin China in July 1997.\n\nNetwork worm which infects Windows machines with weak\npasswords to the Administrator account. Installs VNC [Virtual\n\n**Deloder**\n\nNetwork Computer] remote access server and IRC [Internet Relay\nChat] backdoor files. 745,984 bytes. Found 9 March 2003.\n\nResident COM/EXE-files virus, contains the text: „Democracy‟.\n**Democracy**\n3806 bytes.\n\nAlso called Mao. Resident COM/EXE-files. Activated on 26\nDecember or 9 September, the birth and death dates of Mao Tse\n**Little Red**\n\ntung, playing Chinese songs from the PC speaker. 1465 bytes.\nCommon in 1994-95.\n**Mange-tout** Resident COM/EXE-files virus. 1099 bytes. 1994.\n\nInfects EXE files and tries to disable the serial port of the machine.\n**Quartz**\n1345 bytes.\n\nCommon boot sector virus containing the text: „Welcome to BUPT\n**Welcomb**\n9146, Beijing!‟\n\nAffected LINUX operating systems. Created by „LION‟, founder of\nthe hacker group called the Honkers Union of China (HUC).\nCreated to protest Japanese textbooks that said the Japanese\noccupation of China and Korea was justified and beneficial to the\noccupied countries. Infected LINUX machines through TSIG\n\n**Lion** [Transaction Signature] vulnerabilities in BIND [Berkeley Internet\n\nName Domain] DNS [Domain Name System] servers. Installed\nhacker toolkit called „tOrn rootkit‟, as well as Trojan horses.\nPasswords and network information sent to huckit@china.com,\nliOnip@china.com, liOnsniffer@china.com, and liOnkit@china.com.\nMarch-April 2001.\n\nAlso called the „Red Worm‟. Affected LINUX operating systems.\nVariant of LION. Password and system configuration files e-mailed\nto two addresses in China (adore9000@china.com and\n\n**Adore**\n\nadore9001@china.com). Created by the HUC group in retaliation\nfor the death of a Chinese fighter pilot in a collision with a US EP-3E\naircraft near Hainan Island on 1 April 2001.\n\n94 Office of the Secretary of Defense, Annual Report to Congress: Military Power of the People’s\n_Republic of China 2007, p. 22._\n\n|AntiCMOS|Typical boot sector virus, infects master boot sectors on hard disks and boot sectors on diskettes. Stays resident in memory. Originated in Hong Kong in 1994.|\n|---|---|\n|Changsha|Simple non-resident virus for overwriting COM/EXE files. 3072 bytes.|\n|Dalian|Also called Gene. Stays resident in memory and infects EXE files when they are listed with the DIR command. 1366 bytes. Produced in China in July 1997.|\n|Deloder|Network worm which infects Windows machines with weak passwords to the Administrator account. Installs VNC [Virtual Network Computer] remote access server and IRC [Internet Relay Chat] backdoor files. 745,984 bytes. Found 9 March 2003.|\n|Democracy|Resident COM/EXE-files virus, contains the text: „Democracy‟. 3806 bytes.|\n|Little Red|Also called Mao. Resident COM/EXE-files. Activated on 26 December or 9 September, the birth and death dates of Mao Tse- tung, playing Chinese songs from the PC speaker. 1465 bytes. Common in 1994-95.|\n|Mange-tout|Resident COM/EXE-files virus. 1099 bytes. 1994.|\n|Quartz|Infects EXE files and tries to disable the serial port of the machine. 1345 bytes.|\n|Welcomb|Common boot sector virus containing the text: „Welcome to BUPT 9146, Beijing!‟|\n|Lion|Affected LINUX operating systems. Created by „LION‟, founder of the hacker group called the Honkers Union of China (HUC). Created to protest Japanese textbooks that said the Japanese occupation of China and Korea was justified and beneficial to the occupied countries. Infected LINUX machines through TSIG [Transaction Signature] vulnerabilities in BIND [Berkeley Internet Name Domain] DNS [Domain Name System] servers. Installed hacker toolkit called „tOrn rootkit‟, as well as Trojan horses. Passwords and network information sent to huckit@china.com, liOnip@china.com, liOnsniffer@china.com, and liOnkit@china.com. March-April 2001.|\n|Adore|Also called the „Red Worm‟. Affected LINUX operating systems. Variant of LION. Password and system configuration files e-mailed to two addresses in China (adore9000@china.com and adore9001@china.com). Created by the HUC group in retaliation for the death of a Chinese fighter pilot in a collision with a US EP-3E aircraft near Hainan Island on 1 April 2001.|\n\n\n-----\n\n_China and Cyber Warfare_\n\nInfected machines using Microsoft IIS [Internet Information\nServices] Web server software, exploiting „buffer overflow‟\nvulnerability. Combined defacement of Web sites with DDOS\n\n[Distributed Denial-of-Service] attacks. White House Website\n\n**Code Red** bombarded on 19 July 2001. More than a million servers infected\n\nworld-wide. Caused US$2.6 billion damage. Originated at a\ncomputer at the University of Foshan in Guandong. The Code Red\nII worm, a complete re-write of Code Red, was released on 4\nAugust 2001.\n\n(Admin backwards). Also called W32/Nimda.A-mm. Mass-mailing\nand network worm that infected both PC Windows and Microsoft IIS\n\n**Nimda** Web servers. Could infiltrate LANs and create user accounts with\n\naccess to files and e-mail. Developed by same authors as Code\nRed. September 2001.\n\nAlso called Supnot. A mass-mailing and network worm. Has a\nbackdoor component allowing the attacker to perform designated\n\n**Lovgate** actions on the infected machine. The worm has its own SMTP\n\n[Simple Mail Transfer Protocol] engine and connects the host to two\naddresses at a Chinese Web portal (163.com). March-June 2003.\n\nWorm produced by XFocus, and released in August 2003. Infected\n**Blaster**\ncomputers using Windows XP and Windows 2000.\n\n„Panda Burning Joss Sticks‟. Began spreading through the Internet\n\n**Xiongmao** in December 2006. Steals the account names and passwords of\n**Shaoxiang** on-line game players and popular chat sites. Described as “the\n\nworst computer virus” in China in 2006.\n\nAttaches itself to all .exe files. „More vicious‟ than Xiongmao\n**Hao**\nShaoxiang. Appeared in August 2007.\n\nRecognises and blocks anti-virus protection software. The first\n\n**Mocmex** computer virus on a digital photo frame. First detected on 17\n\nFebruary 2008.\n\nFound in August 2008. Uses a worm to infect peer systems and\n**Wecorl**\nload Distributed Denial-of-Service programs.\n\nAppeared in 2008. Only attacked Japanese-language operating\n**W32.Welchia.B**\nsystems. Called the „patriotic virus‟ or the „anti-Japan virus‟.\n\nA worm that copies itself to removable USB drives from infected\ncomputers and then spreads itself to whatever new systems it is\n\n**Agent.btz**\n\nconnected to through USB ports. Discovered in US DoD networks\nin November 2008.\n\nFirst detected on 21 November 2008. Five main variants, A (21\nNovember 2008), B (29 December 2008), C (20 February 2009), D\n\n**Conficker** (4 March 2009) and E (7 April 2009). Closely related to Nimda.\n\nInfected from 9 to 15 million Microsoft server systems running\neverything from Windows 2000 to the Windows 7 Beta.\n\nAn update of Conficker, also known as W32/Confick-D (Sophos).\nInitiated on 1 April 2009. Infects Microsoft operating systems, and\n\n**Worm_Downad.E**\n\nremains dormant in the system until a specially crafted RPC\n(Remote Procedure Call) request is received.\n\nAppeared in early 2011. Only attacks Japanese-language operating\n**Win32/KillDPT**\nsystems.\n\n_Desmond Ball is a Professor in the Strategic and Defence Studies Centre at the Australian_\n_National University, Canberra. He was Head of the Centre from 1984 to 1991._\ndesmond.ball@anu.edu.au.\n\n|Code Red|Infected machines using Microsoft IIS [Internet Information Services] Web server software, exploiting „buffer overflow‟ vulnerability. Combined defacement of Web sites with DDOS [Distributed Denial-of-Service] attacks. White House Website bombarded on 19 July 2001. More than a million servers infected world-wide. Caused US$2.6 billion damage. Originated at a computer at the University of Foshan in Guandong. The Code Red II worm, a complete re-write of Code Red, was released on 4 August 2001.|\n|---|---|\n|Nimda|(Admin backwards). Also called W32/Nimda.A-mm. Mass-mailing and network worm that infected both PC Windows and Microsoft IIS Web servers. Could infiltrate LANs and create user accounts with access to files and e-mail. Developed by same authors as Code Red. September 2001.|\n|Lovgate|Also called Supnot. A mass-mailing and network worm. Has a backdoor component allowing the attacker to perform designated actions on the infected machine. The worm has its own SMTP [Simple Mail Transfer Protocol] engine and connects the host to two addresses at a Chinese Web portal (163.com). March-June 2003.|\n|Blaster|Worm produced by XFocus, and released in August 2003. Infected computers using Windows XP and Windows 2000.|\n|Xiongmao Shaoxiang|„Panda Burning Joss Sticks‟. Began spreading through the Internet in December 2006. Steals the account names and passwords of on-line game players and popular chat sites. Described as “the worst computer virus” in China in 2006.|\n|Hao|Attaches itself to all .exe files. „More vicious‟ than Xiongmao Shaoxiang. Appeared in August 2007.|\n|Mocmex|Recognises and blocks anti-virus protection software. The first computer virus on a digital photo frame. First detected on 17 February 2008.|\n|Wecorl|Found in August 2008. Uses a worm to infect peer systems and load Distributed Denial-of-Service programs.|\n|W32.Welchia.B|Appeared in 2008. Only attacked Japanese-language operating systems. Called the „patriotic virus‟ or the „anti-Japan virus‟.|\n|Agent.btz|A worm that copies itself to removable USB drives from infected computers and then spreads itself to whatever new systems it is connected to through USB ports. Discovered in US DoD networks in November 2008.|\n|Conficker|First detected on 21 November 2008. Five main variants, A (21 November 2008), B (29 December 2008), C (20 February 2009), D (4 March 2009) and E (7 April 2009). Closely related to Nimda. Infected from 9 to 15 million Microsoft server systems running everything from Windows 2000 to the Windows 7 Beta.|\n|Worm_Downad.E|An update of Conficker, also known as W32/Confick-D (Sophos). Initiated on 1 April 2009. Infects Microsoft operating systems, and remains dormant in the system until a specially crafted RPC (Remote Procedure Call) request is received.|\n|Win32/KillDPT|Appeared in early 2011. Only attacks Japanese-language operating systems.|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/historical/2011/vol7no2Ball.pdf"
    ],
    "report_names": [
        "vol7no2Ball"
    ],
    "threat_actors": [
        {
            "id": "ea844ee6-eb12-42c0-8426-11395fe81e6f",
            "created_at": "2022-10-25T15:50:23.300796Z",
            "updated_at": "2025-03-27T02:00:55.434471Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "Night Dragon"
            ],
            "source_name": "MITRE:Night Dragon",
            "tools": [
                "at",
                "gsecdump",
                "zwShell",
                "PsExec",
                "ASPXSpy",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "09a8f8fe-e907-47b4-8709-a97717dde3cc",
            "created_at": "2022-10-25T16:07:23.90252Z",
            "updated_at": "2025-03-27T02:02:10.020919Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [],
            "source_name": "ETDA:Night Dragon",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Cain & Abel",
                "gsecdump",
                "zwShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "020794ec-7315-47de-818c-2032c362fd15",
            "created_at": "2023-01-06T13:46:38.306576Z",
            "updated_at": "2025-03-27T02:00:02.800515Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "G0014"
            ],
            "source_name": "MISPGALAXY:Night Dragon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "86fd71d3-06dc-4b73-b038-cedea7b83bac",
            "created_at": "2022-10-25T16:07:23.330793Z",
            "updated_at": "2025-03-27T02:02:09.740703Z",
            "deleted_at": null,
            "main_name": "APT 17",
            "aliases": [
                "APT 17",
                "ATK 2",
                "Beijing Group",
                "Bronze Keystone",
                "Deputy Dog",
                "Elderwood",
                "Elderwood Gang",
                "Operation Aurora",
                "Operation DeputyDog",
                "Operation Ephemeral Hydra",
                "Operation RAT Cook",
                "SIG22",
                "Sneaky Panda",
                "TEMP.Avengers",
                "TG-8153",
                "Tailgater Team"
            ],
            "source_name": "ETDA:APT 17",
            "tools": [
                "9002 RAT",
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "Briba",
                "Chymine",
                "Comfoo",
                "Comfoo RAT",
                "Darkmoon",
                "DeputyDog",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Jumpall",
                "Kaba",
                "Korplug",
                "Linfo",
                "MCRAT.A",
                "McRAT",
                "MdmBot",
                "Mdmbot.E",
                "Moudour",
                "Mydoor",
                "Naid",
                "Nerex",
                "PCRat",
                "PNGRAT",
                "Pasam",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Naid",
                "Vasport",
                "Wiarp",
                "Xamtrav",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1308863597,
    "ts_modification_date": 1308863597,
    "files": {
        "pdf": "https://archive.orkl.eu/db15d399006eb4b59465463484b85071881a89f6.pdf",
        "text": "https://archive.orkl.eu/db15d399006eb4b59465463484b85071881a89f6.txt",
        "img": "https://archive.orkl.eu/db15d399006eb4b59465463484b85071881a89f6.jpg"
    }
}