{
    "id": "c6df888e-2e67-41ca-a4dd-863ec0ce4f08",
    "created_at": "2023-01-12T15:03:45.3115Z",
    "updated_at": "2025-03-27T02:05:40.142892Z",
    "deleted_at": null,
    "sha1_hash": "16ebfb4e0bd87867dc9378b6ed89b769958119cb",
    "title": "2013-12-18 - Qadars – a banking Trojan with the Netherlands in its sights",
    "authors": "",
    "file_creation_date": "2022-05-27T21:48:50Z",
    "file_modification_date": "2022-05-27T21:48:50Z",
    "file_size": 1406218,
    "plain_text": "# Qadars – a banking Trojan with the Netherlands in its sights\n\n**[welivesecurity.com/2013/12/18/qadars-a-banking-trojan-with-the-netherlands-in-its-sights/](https://www.welivesecurity.com/2013/12/18/qadars-a-banking-trojan-with-the-netherlands-in-its-sights/)**\n\nDecember 18, 2013\n\nThe first sign we saw of this malware was in mid-May 2013, but it is still very active, and\nuses Android to bypass two-factor authentication systems. It clearly seeks to infect Dutch\ncomputers - 75% of detections come from this region.\n\n18 Dec 2013 - 12:40PM\n\nThe first sign we saw of this malware was in mid-May 2013, but it is still very active, and\nuses Android to bypass two-factor authentication systems. It clearly seeks to infect Dutch\ncomputers – 75% of detections come from this region.\n\n## Introduction\n\n\n-----\n\n[A new banking Trojan has been making its round in the past few months. First publicly](http://www.virusradar.com/en/glossary/trojan-horse)\n[discussed by LEXSI, this banking Trojan has been very active, infecting users throughout](http://www.lexsi-leblog.com/cert-en/qadars-new-banking-malware-with-fraudulent-mobile-application-component.html)\nthe world. Its modus operandi is banking fraud through web injection. While this approach\nhas been present for a long time in various banking Trojan families, it is still effective.\n[Win32/Qadars uses a wide variety of webinjects, some with Android mobile components,](http://www.virusradar.com/en/Win32_Qadars/detail)\nused to bypass online banking security and to gain access to user’s bank account. Usually,\nbanking Trojans either target a broad array of financial institutions or focus on a much\nsmaller subset, usually institutions of which the user base is geographically close.\nWin32/Qadars fall in the second category: it pinpoints users in specific regions and uses\nwebinject configuration files tailored to the banks most commonly used by the victims. As\nwe have been monitoring its evolution, we have seen six main countries affected by\nWin32/Qadars:\n\nNetherlands\n\nFrance\n\nCanada\n\nIndia\n\nAustralia\n\nItaly\n\nWhile most of the attacks directed to users in these countries were launched in waves,\nusers in the Netherlands were targeted throughout the monitoring period. This threat caught\nour attention because:\n\nIt is still very active after six months and is continuously updated\n\nIt targets very specific regions of the world\n\nIt uses a wide range of webinjects, some of which were also used by another banking\nTrojan family in a completely unrelated campaign\n\nIt uses [Android/Perkele to bypass mobile based two-factor authentication systems](http://www.virusradar.com/en/Android_Perkele/detail)\n\n## Historical Perspective\n\nThe first sign we saw of this malware was in mid-May 2013. The following graph shows the\ndaily detection for Win32/Qadars.\n\n\n-----\n\nFigure 1 : Win32/Qadars Daily Detections\n\nAlthough the first detections occurred in May, the first true wave of infections occurred in\nlate June. Interestingly, the authors seem to have been through a testing phase since the\nnext detection spike was seen weeks later with barely any detections in between. Also,\nItalian users were mainly targeted in the first wave while the subsequent campaign mainly\ntargeted Dutch users. We believe that this kit is either kept private or being sold only to\nselected people. We have seen a handful of different campaigns, but most of the infections\nwe’ve analyzed are from the same campaign and thus share the same command and\ncontrol (C&C) servers.\n\nWe can track the evolution of the malware through the build number that is embedded in\nthe executable. The first version we saw was 1.0.0.0 and the latest one is 1.0.2.7. The\nsteady release of new versions indicates that this malware is in constant maintenance and\ndevelopment. The following graphs shows the date each version was first seen by our\ntelemetry data.\n\n\n-----\n\nFigure 2 : Build Number Evolution Throughout the Monitoring Period\n\n## Technical Analysis\n\nWin32/Qadars uses a Man-in-the-Browser (MitB) scheme to perform financial fraud. Just\n[like Win32/Spy.Zbot, Win32/Qadars injects itself into browser processes to hook selected](http://www.virusradar.com/en/Win32_Spy.Zbot/detail)\nAPIs. Using these hooks, it is able to inject content into pages viewed by the user. This\ninjected content can be anything, but is usually a form intended to harvest user credentials\nor JavaScript designed to attempt automatic money transfers without the user’s knowledge\nor consent. Webinject configuration files are downloaded from the C&C server and contain\nthe URL for the target webpage, the content that should be injected into the webpage and\nfinally where it should be injected. This configuration file format is very similar to all the\nother banking Trojans out there. Once downloaded, the configuration is kept AES-encrypted\nin the computer’s registry keys. Currently, Win32/Qadars is able to hook two different\nbrowsers so as to perform content injection: Firefox and Internet Explorer. There is some\nstub for Chrome in the code, so we might see support for this browser in the future.\n\nOnce the malware is installed on a machine, the bot herder can control his bots through\ndifferent commands, most of which are listed in the table below.\n\n\n-----\n\nTable 1: Commands and Description\n\nOne addition that was made in version 1.0.2.7 is an FTP credential stealer. It supports a\nwide array of FTP clients and tries to open up their configuration files and steal the user’s\ncredentials. Interestingly, in order to steal user credentials, it integrates some known static\npasswords that some of these FTP clients use by default to encrypt their configuration file.\n[This behavior is not new and has already been seen in Win32/PSW.Fareit (Pony](http://www.virusradar.com/en/Win32_PSW.Fareit/detail) [Loader),](https://www.welivesecurity.com/2013/07/02/the-home-campaign-overstaying-its-welcome/)\nfor example.\n\n## Network Communications\n\nWin32/Qadars uses AES in ECB mode to encrypt its network communications. Before\nsending a message, the client will generate a random string of nine (9) characters and will\nuse its MD5 hash as the AES key to encrypt it. It will also generate another random string\nwhich it will embed in the message sent to the server. This key will be used by the server to\nencrypt its response. To securely transfer the AES key used to encrypt the message to the\nserver, the client will further encrypt it, two characters at a time, and append it to the\nmessage. Finally, the overall message is encoded using base64 and sent to the server. The\nfollowing figure depicts this process and lists the different fields present in the messages\nsent to the server.\n\n\n-----\n\nFigure 3 : Client-to-Server Communication\n\nThe server response is encrypted using the server key embedded in the client request. It\nalso appends the MD5 digest of the message as an error detection mechanism. The\nfollowing figure shows the structure of the server response.\n\nFigure 4 : Server-to-Client Communication\n\nExamining the different message IDs used by Win32/Qadars tells us more about its\nfunctionalities. The table below lists most of the different message IDs and their description.\n\n\n-----\n\nTable 2 : Message IDs and Description\n\nKnowing the network protocol used by Win32/Qadars greatly enhanced our ability to track\nthe botnet and study its behavior.\n\n## Infection Vector\n\nWin32/Qadars’ webinject configuration file changes frequently and targets specific\ninstitutions. To maximize their success with these webinjects, the malware authors try to\ninfect users in specific regions of the world. In the following section, we will show which\ncountries were the most targeted, but let’s first take a look at the infection vectors the\nmalware author chose so as to target specific countries. From May to October, it is not clear\nhow the malware was spreading. Through our telemetry system, we found several hints that\nthey might have bought compromised hosts in the countries they were interested in. We\ndraw this conclusion because all of the compromised computers we analyzed also had\n[Trojan downloaders and other infamous Pay-per-Install (PPI) malware such as Win32/Virut.](http://www.virusradar.com/en/Win32_Virut/detail)\n\nBeginning in November, we saw that Win32/Qadars is now also being distributed through\nthe [Nuclear Exploit Kit. Below are a couple of URLs that were used to distribute it at the](https://www.welivesecurity.com/2012/04/05/blackhole-exploit-kit-plays-with-smart-redirection/)\nbeginning of November. The Nuclear Exploit Kit pattern used at the time is clearly visible:\n\n_hxxp://nb7wazsx[.]briefthink[.]biz:34412/f/1383738240/3447064450/5_\n\n_hxxp://o3xzf[.]checkimagine[.]biz:34412/f/1383770160/1055461891/2_\n\n_hxxp://pfsb77j2[.]examinevisionary[.]biz:34412/f/1383780180/1659253748/5_\n\n\n-----\n\nBoth of these infection vectors allow the bot masters to choose where the computers they\ncompromise are located.\n\n## Regional Targets\n\nWin32/Qadars has focused mainly on six countries up until now: the Netherlands, France,\nCanada, Australia, India and Italy. The following graph shows the geographical distribution\nof the detection in the period May 2013 to November 2013.\n\nFigure 5 : Detection Distribution\n\nWin32/Qadars clearly seeks to infect Dutch computers as 75% of detections come from this\nregion. Analysis of the times when it was detected show that there were several infection\nwaves.\n\n\n-----\n\nFigure 6: Win32/Qadars Daily Detections by Countries\n\nDetections in the Netherlands always show the highest prevalence, followed by detections\nreported in France. The case of Canada is particularly interesting as all of the detections in\nthis country occurred in the last fifteen (15) days of October. Of course, the webinject\nconfiguration file downloaded by the bots at this time contains code that targeted the main\nCanadian financial institutions.\n\nThe webinject downloaded by the bots targets financial institutions in the 6 countries\nmentioned above with varying degree of sophistication. Some webinjects will just collect\nextra information whenever a user tries to login to his bank’s secure website. This is done\nthrough the injection of an extra form or elements asking the user for private information\nwhenever he logs into his bank. An example form is shown below.\n\n\n-----\n\nFigure 7 : Phishing-like Webinject\n\nOther webinjects are much more complicated and can perform transactions automatically\nand bypass the two-factor authentication systems implemented by banks.\n\n## Webinjects\n\nThe webinjects used by banking Trojans can be obtained in several different ways. They\ncan be directly coded by the cybercriminals who operate the botnet, or they can be bought.\nThere are several coders offering to sell public webinjects or to produce them tailored to the\ncustomer’s wishes. There are many such offers and some will even ask for a different price\n[depending on the features needed. When analyzing webinjects used by Win32/Qadars, it is](http://www.trusteer.com/blog/la-carte-criminals-charging-feature-custom-webinjects)\nclear that they were not all written by the same people as the techniques and coding styles\nare quite different. In fact, we believe that they were all bought on various underground\nforums. One webinject platform they use has a distinctive way of fetching external content\nsuch as scripts and images. The URL in the injected JavaScript will look something like this:\n\n_hxxp://domain.com/gate.php?_\n_data=cHJvamVjdD1tb2ItaW5nbmwtZmFuZCZhY3Rpb249ZmlsZSZpZD1jc3M=_\n\nThe “data=” portion of the URL is base64 encoded. When decoded, this string reads\n_“project=mob-ingnl-fand&action=file&id=css”, which clearly gives away the target as well as_\nwhich file it is trying to retrieve. Interestingly, we found the exact same kind of syntax in\n[webinjects used by a campaign targeting Czech banks and using Win32/Yebot (alias Tilon)](http://www.virusradar.com/en/Win32_Yebot/detail)\nas the banking Trojan. Although we found no trace of this particular webinject platform in\nthe underground forums we looked at, we did find several other offerings.\n\n### Automatic Transfer System (ATS)\n\n[ATS, now commonly used in banking Trojans, is a term applied to webinjects that aim to](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp_automating_online_banking_fraud.pdf)\ninitiate an automatic transfer once a user accesses his bank account through a\ncompromised computer. It will usually contain code to automatically find the account with\nthe highest amount and initiate a transfer to an attacker/money mule controlled account.\nThe code will usually contain some tricks (read social engineering) to defeat two-factor\nauthentication systems that are sometimes imposed by banks when performing transfers.\nWe have found several coders in underground forums selling public or private ATS for\nseveral banks around the world. In the underground forums, a “public” webinject is one that\nis sold to anyone by the vendor while a “private” one is customized to the buyer’s need and\nis usually not resold by the coder. In general, buyers of private webinjects will get the\nsource code and the rights to redistribute it to others. We know that Win32/Qadars authors\nare buying some webinjects because we found one public ATS that they had integrated into\ntheir webinject configuration file. Like many other offerings, this coder sells, along with the\nwebinject, an administrator panel (shown below) to let the cyber criminals control several\naspects of how the automatic transfer should be carried out.\n\n\n-----\n\nFigure 8 : ATS Webinject Administration Panel\n\nThis particular offering is targeting a French bank and the coder claims that it can bypass\nthe SMS two-factor authentication system put in place by the bank to prevent fraudulent\ntransfers.\n\n### Perkele\n\nIn several ATS we have analyzed, like the one described above, the malware must intercept\nan SMS so to make the transfer go through. This is necessary because the bank sends a\ntransaction authorization number (TAN) to the user’s mobile whenever he initiates a money\ntransfer. The user must input this TAN in his browser before the transfer is authorized. The\nusage of a mobile component by a banking Trojan is not new. Zeus-in-the-mobile, or ZitMo,\nand others have been around for quite some time. What is particularly interesting in this\ncase is that several webinject coders are actually bundling such mobile malware with their\nwebinjects. This means that a bot master can now buy very complex webinjects that are not\nonly JavaScript code, but also contain an administration panel and some mobile malware\ncustomized to the targeted bank.\n\nIn the case of Win32/Qadars, the mobile component we’ve seen bundled with the webinject\nis Android/Perkele, mobile malware that can intercept SMS messages and forward them to\n[the cybercriminals. This kit has already been profiled by Brian Krebs. The webinject takes](http://krebsonsecurity.com/2013/08/a-closer-look-perkele-android-malware-kit/)\ncare of everything in this case: when the user logs into his bank account, content is injected\ninto his browser asking him to specify his mobile brand and to download a “security”\napplication onto his mobile phone. Since the user sees this content while he is accessing\nhis account, he is more likely to believe that this message is genuine and that the\napplication truly comes from his bank. In one sample we analyzed, once the banking\napplication is installed on the phone, it sends an SMS message to a phone number in the\nUkraine.\n\n\n-----\n\nFigure 9 : Screenshot of Android/Perkele Targeting a French Banking Institution\n\nAndroid/Perkele supports the Android, Blackberry and Symbian operating systems, but we\nhave seen only the Android component used in conjunction with Win32/Qadars. Once the\napplication is installed on the user’s phone, the automatic transfer can be attempted, since\nthe SMS containing the required TAN can be obtained by the fraudster. This webinject\noffering is a good example of malware commoditization. The botnet master can now buy a\ncomplete solution that will allow him to conduct automatic transfers and bypass two-factor\nauthentication systems in a totally automated fashion. All he needs to provide is a way to\ninject content into the user’s browser. This functionality is implemented in all modern\nbanking Trojans.\n\nThe mobile malware Android/Perkele, once installed on a user mobile, is used by fraudster\nto intercept SMS messages and hide them from the user. It is interesting to see that Google\nis taking a proactive stance in order to defeat this kind of threat. The newest Android OS,\n[dubbed KitKat, has changed how the applications on the phone can receive SMS](http://www.cert.pl/news/7741/langswitch_lang/en)\nmessages and hide them from the user. It will now be much more complicated to hide SMS\nbecause there is only one application that will be able to do that, and by default that is the\nsystem messaging application. Thus, users infected by threats like Android/Perkele will\nhave a much better chance of spotting the infection if they are running the latest android\nOS.\n\n## Conclusion\n\n\n-----\n\nWe have seen lately a resurgence of new banking Trojans being spread in the wild.\n[Win32/Napolar,](https://www.welivesecurity.com/2013/09/25/win32napolar-a-new-bot-on-the-block/) [Win32/Hesperbot and Win32/Qadars have all appeared in the last few](https://www.welivesecurity.com/2013/09/04/hesperbot-a-new-advanced-banking-trojan-in-the-wild/)\nmonths. It is probably no coincidence that there is now a plethora of banking Trojan source\n[code available following the leaks of Win32/Zbot and Win32/Carberp source code. Another](https://www.welivesecurity.com/2013/06/26/carberp-code-leak-could-lead-to-new-wave-of-attacks/)\ninteresting development to watch for is the thriving webinject coder scene. These people\nare offering ever more sophisticated pieces of code that can bypass a wide range of twofactor authentication systems. It will be interesting to see whether at some point the market\nmatures enough for us to see the emergence of popular webinject kits, in much the same\nway as happened in the exploit kit scene.\n\n_Special thanks to Hugo Magalhães for his contribution to this analysis._\n\n**SHA1 hashes**\n\n_Win32/Qadars (Nuclear Pack):  F31BF806920C97D9CA8418C9893052754DF2EB4D_\n_Win32/Qadars (1.0.2.3):     DAC7065529E59AE6FC366E23C470435B0FA6EBBE_\n_Android/Perkele:      B2C70CA7112D3FD3E0A88D2D38647318E68f836F_\n\n18 Dec 2013 - 12:40PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-12-18 - Qadars – a banking Trojan with the Netherlands in its sights.pdf"
    ],
    "report_names": [
        "2013-12-18 - Qadars – a banking Trojan with the Netherlands in its sights.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535825,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653688130,
    "ts_modification_date": 1653688130,
    "files": {
        "pdf": "https://archive.orkl.eu/16ebfb4e0bd87867dc9378b6ed89b769958119cb.pdf",
        "text": "https://archive.orkl.eu/16ebfb4e0bd87867dc9378b6ed89b769958119cb.txt",
        "img": "https://archive.orkl.eu/16ebfb4e0bd87867dc9378b6ed89b769958119cb.jpg"
    }
}