{
    "id": "c6e12cb0-f617-4390-bfdd-54ddebbf5143",
    "created_at": "2023-01-12T15:04:09.886511Z",
    "updated_at": "2025-03-27T02:13:01.60574Z",
    "deleted_at": null,
    "sha1_hash": "3b03f1aad210506ea27938979fc45debccd9af64",
    "title": "2016-06-29 - Apocalypse- Ransomware which targets companies through insecure RDP",
    "authors": "",
    "file_creation_date": "2011-08-15T09:06:44Z",
    "file_modification_date": "2011-08-15T09:07:13Z",
    "file_size": 656868,
    "plain_text": "# Caution: Malware Ahead\n\n#### An analysis of emerging risks in automotive system security\n\n\n-----\n\n##### Caution: Malware Ahead CONTENTS\n\nIntroduction **3**\n\nEmbedded Devices in Automobiles **4**\n\nCar Hacks Exposed **6**\n\nInfotainment and Networking Systems **8**\n\nConsumer Considerations **9**\n\nContributors **10**\n\n\n-----\n\n## Introduction\n\n### We are living in a world of incredible modern conveniences.  Computer chips, embedded in all aspects of our daily lives, have made it possible to have access to all kinds of information when and where we need it. Through Internet protocols, these once dumb devices can now communicate with you and with each  other in amazing, unprecedented ways.\n\nAccording to Ericsson, there will be 50 billion IP-connected devices by 2020, up from 1 billion\njust a year ago. These are not just the omnipresent gadgets everyone is familiar with. The bulk of the\n50 billion IP devices expected by later this decade will be embedded devices. These are often singlepurpose devices such as cash registers, airport check-in kiosks, medical devices, access card readers,\nmanufacturing equipment, programmable logic controllers, industrial control systems, and much more\nthat is now being connected. As history has proven, security is an afterthought for most manufacturers.\nAll these devices need proper security and management that is built in from day one.\n\nPreviously, embedded devices were essentially a one-way information feed—data was sent from the\ndevice from a purely diagnostic perspective (all almost universally out-of-band), but there was no pushing of data in-band. Additionally, these devices typically did very little to influence our lives. Now, policies\nand tasks can be pushed onto the device and data captured and reported back to one central console.\nAnd embedded systems have become a part of the very quality of our lives in automobile electronics,\nappliances, water and power systems, and the like. This phenomenon has exploded the threat scope for\nthese devices, and security technologies, such as whitelisting and configuration control, combined with\nglobal threat intelligence gathered from millions of nodes, are becoming more than a nice to have—\nthey are becoming a “must.” These solutions are the first step toward providing complete security\non embedded systems.\n\nAs embedded devices get on the network, security administrators want to know if they have the appropriate level of security. They want to control different policies on those devices through the same console\nthat they use to control computers.\n\nAt McAfee, we are committed to securing embedded devices and the world beyond PCs. As such, we’re\npartnering with Wind River and content experts in a variety of fields to analyze the security of embedded\nsystems and provide sector-specific recommendations for securing these systems and keeping customers,\nas well as the general public, safe. This report focuses on embedded systems in automobiles and is the\nfirst in a series of reports on embedded device security. We hope you find it informative and useful.\n\n**Stuart McClure**\n_Senior Vice President_\n_and General Manager_\n_McAfee_\n\n\n-----\n\n## Embedded Devices in Automobiles\n\n#### The automobile industry is continually adding features and packages that add more conveniences and the ability to personalize the driving experience. Consumers want to be continually connected, even in their cars, which is motivating automobile manufacturers to add more integration between cars and personalized devices such as smartphones and tablets.\n\n\nNew cars have the ability to be remotely started\nby a mobile phone, using a connection from the\ncar and a request to start it from the key holder,\nthrough cellular network services or the Internet.\nThis is just one example of how cars have become\nincreasingly computerized and connected, both\nin the engine compartment and the dashboard\nconsole. As the popularity of these personalized\nconnected systems increases, so does the need\nfor security.\n\nConvenience that was once measured by features\nlike the dual-passenger climate control, heated\nseats, or the number of cup holders is now being\n\n\ndelivered not only through good design, but also\nthrough specialized embedded technology. Personalized systems such as Bluetooth, GPS navigation systems, in-vehicle infotainment (IVI), and\nonline help systems have become commonplace.\nAutomakers distinguish their models through\nelectronics, and the trend of introducing embedded\nmicrocontrollers and communication capabilities\nis on the rise.\n\nThese embedded devices are used in almost\nall areas of vehicles, including airbags, the radio,\npower seats, anti-lock braking system, electronic\nstability control, autonomous cruise control, communication system, and in-vehicle communication.\n\n\n-----\n\nNumerous automakers offer cell phone-based\ncommunication, for example, GM’s OnStar, Ford’s\nSYNC, BMW’s Assist, Lexus’ Enform, Toyota’s\nSafety Connect, and Mercedes’ mbrace. Some\ncar makers are also including Wi-Fi hot spots in\ntheir vehicles that provide Internet access to the\npassengers’ devices.\n\nWhat’s interesting is that many of these embedded systems may also coordinate communication\namong themselves to bring the next level of\npersonalization. These include:\n\n- Unlocking the vehicle with a specific remote key\nwill automatically adjust the power seats and\nmirrors for a given driver\n\n- When traveling at higher speeds, the volume\nof an automobile’s sound system automatically\nincreases so the passenger can continue to\nlisten clearly\n\n- Based on a specific driver, the automobile can\nbe throttled to keep the vehicle from driving\nover a set speed limit\n\n\n###### Automakers distinguish their models through electronics, and the trend of  introducing embedded microcontrollers  and communication capabilities is on  the rise.\n\nToday, we’re seeing bold new experiments, including Google’s autopiloted cars and smart roads\nwith sensors that report on traffic conditions and\nvehicle speeds. Experiments like these show the\nongoing possibilities with coordinated, connected\ncommunication from all of the multifaceted systems within the automobile.\n\nBut there is a concern that as the industry advances,\nthere has been little done to ensure the security\nof these systems. The first remote keyless entry\nsystems did not implement any security and were\neasily compromised: a regular learning universal\nremote control for consumer electronics was able\nto record the key signal and replay it at a later time.\nAnd here’s another security lesson from the past—\nin the early 1980s, car theft reached a high as car\nthieves bypassed the ignition lock by shorting the\nelectric link to start the engine and drive the car\naway. By the late 1980s, cryptographic mechanisms\nwere implemented to prevent such attacks.\n\n\n-----\n\n## Car Hacks Exposed\n\n#### As more and more digital technology is introduced into automobiles, the  threat of malicious software and hardware manipulation increases. There are many examples of research-based hacks that show the potential threats and depth of compromise that expose the consumer.\n\n\nLast year, researchers of the University of California,\nSan Diego, and the University of Washington demonstrated that critical safety components of a vehicle can be hacked if physical access to the vehicle’s\nelectronic components inside the passenger cabin\nis available. The proof-of-concept software, which\nthey dubbed “CarShark,” was developed using\nhomemade software and a standard computer\nport. The scientists figured out how to hack into\na modern car using a laptop. Recently, the same\nresearch team extended the scenario to remotely\nmount attacks via Bluetooth. This demonstration\nsupports the need to consider the future security\nimplications of embedded devices in cars and\nconveniences such as mobile phones, GPS,\nand Bluetooth.\n\nAnother attack was presented by researchers\nof the University of South Carolina and Rutgers\nUniversity. Modern vehicles are mandatorily\nequipped with a tire pressure monitoring system.\n\n\nRadio frequency identification (RFID) tags are\nused within the tires to provide sensor data over\nwireless short-distance communication to the\nvehicle. The researchers showed that an attack\ncan be mounted to track a vehicle and compromise passengers’ privacy by tracking the RFID tags\nusing powerful long-distance readers at around\n40 meters. While no actual exploit in the field is\nknown, and it is not yet understood if and to what\nextent this attack poses a threat for passengers’\nprivacy, it is something that should be monitored.\n\nGoing one step further is to combine the CarShark\nattack and weaknesses of Bluetooth implementation in cars. Once the attacker guesses the Bluetooth PIN, the attacker could mount the CarShark\nattack. Other wireless devices like web-based vehicle-immobilization systems that can remotely disable a car could be manipulated in these situations\nas well. The immobilization system is meant to be\na theft deterrent but could be used maliciously to\ndisable cars belonging to unsuspecting owners.[1]\n\n\n-----\n\n###### “ Making automotive services more secure than comparable Internet services is really a challenge but is necessary. The automotive world will also have to harmonize the lifecycles of IT-security and automotive security components in the car.”\n\n—Winfried Stephan, Senior Consultant\n\nT-Systems ICT Security Consulting and Engineering\n\n\nThere was another recent situation in Texas where\nit was reported that 100 vehicles were disabled\nfrom a remote disable system.[2] The system had\nbeen installed by the car dealership, however, was\nmaliciously manipulated by a disgruntled former\nemployee who remotely disabled the cars and\nwreaked havoc by setting off the car horns.\n\nSecurity concerns stem from embedded systems\nintegrated into these automobiles and also extend\nto aftermarket solutions. Recently, a provider of\naftermarket GPS navigation systems was recording\ndriver behavior and selling it to Dutch police to use\nthe data to target speeding vehicles.[3]\n\nThere are also new tools, like Viper Smart Security,\nthat use Internet mapping capabilities so owners can track their cars’ whereabouts as well as a\nFacebook function that can be configured to send\nout instant updates on the car’s activity. This could\neasily be used to gain access to the passengers’\nwhereabouts, schedule, and routine. The security\nconcern here is not with the automobile itself, but\nthe correlation between tracking and social media\nthat opens the question of consumer privacy.\nBased on gathering this information via Facebook\nupdates, the details could be sold or used for\nother malicious activity against the individual.\n\n\nSecurity testing and white hat hacking are ways\nto better understand the possible threat vectors\nand emerging exploits. One penetration tester,\nhired by a US-based municipal government, determined that several IP addresses used by the city’s\npolice department connected directly into a Linux\ndevice carried in police cruisers. Using little more\nthan FTP and telnet commands, he then tapped\ninto a digital video recorder (DVR) used to record\nand stream audio and video captured from gear\nmounted on the vehicle’s dashboard. He was able\nnot only to tap the live feeds coming from the two\nseparate cameras mounted on the cruiser, but also\nto control the hard drive of the DVR.\n\nUsing default passwords that were hardcoded into\nthe DVR’s FTP server and disclosed in the support\nmanuals he found with an Internet search, he was\neasily able to upload, download, and delete files\nthat stored months’ worth of video feeds.[4] In this\nsituation, basic security could have prevented\nthese results. Gathering the knowledge to hack\ninto the recording system is one flaw but not\nensuring that strong unique passwords were\nchanged allowed the ability to manipulate and\ndelete valuable evidence.\n\n\n-----\n\n###### “ Vehicles of all price segments are equipped with  several electronic units, which in the near future, will boast dramatically increased computing performance and interfaces. Each interface serves as a motivator and means for an attacker to access the vehicle. We can expect new challenges to protecting the changing interface of embedded systems in cars. Vehicle makers have to solve  the conflict of implementing security mechanism without losing customers acceptance. I expect a new chapter  of car security in the next two car generations.”\n\n—Stefan Goss, Professor of Automative Technology\n\nOstfalia University of Applied Sciences\n\n\n## Infotainment and Networking Systems\n\n#### The infotainment system is attractive for attackers, as it promises to be an  area that closely integrates with an individual’s personalized preferences or data. When that happens, there is the opportunity for financial gain for the right information at the right time. Infotainment systems often run standard software for embedded devices that is widely available, whereas other embedded units  in a vehicle run mainly proprietary or specialized software.\n\n\nApplication stores, Internet access, or remote\nconnected consumer devices could allow malware\nto be downloaded on the in-vehicle infotainment\n(IVI) system. IVI software platforms developed for\nworldwide use and standards such as GENIVI,[5]\ninfluence the architectures for better compatibility\nand integration. When these software standards\nare followed, it becomes increasingly important to\nprotect against attacks and manipulation. Infotainment systems and cellular connection networks\nneed to have security designed and incorporated\ninto the development process.\n\nAs the growth of embedded systems and amount\nof code continues to grow to support the consumer demand for these systems, manufacturers\nnow have a model that lets them upgrade or\nprovide premium functions more readily.\n\n\nFrost and Sullivan estimates that cars will require\n200 million to 300 million lines of software code\nin the near future. The increasing feature set,\ninterconnectedness with other embedded systems,\nand cellular networking or Internet connectivity\ncan also introduce security flaws that may\nbecome exploitable.\n\nA June 2011 article in the San Jose Mercury News\nexamined the many ways that manufacturers are\nusing electronics to increase comfort and safety\nand to gain a competitive edge. From luxury cars\nlike BMWs to high-end electric cars like Tesla to\neveryday, affordable Fords, automobiles increasingly are coming with Internet-connected features\nto inform, entertain, and protect the driver.\n\n\n-----\n\n#### Consumer Considerations\n\n- Which systems connect to the Internet or\ncellular network, and how are they secured?\n\n- Is there a connection between the navigation system, GPS, and the car’s critical\nelectric systems?\n\n- How is the Bluetooth system secured?\n\n- What amount of personal data is uploaded\nto GPS, and is it being stored somewhere?\n\n- Is there reporting via diagnostics on\nthe system available to ascertain if it has\nbeen tampered with?\n\n- Is there any local storage that saves\nor pulls information from my connected\n“smart” devices?\n\n- In the event of a resell of the automobile,\nis there a way to reset all of the infotainment\nand integrated communication systems back\nto factory settings to ensure the removal\nof personalized settings or data?\n\n- What is the manufacturer or cellular\nnetwork provider’s responsibility in the\nevent that secured communications have\nbeen compromised?\n\n\n###### “ Security will soon become an enabling technology for  almost all innovations in cars. Most people would rather have malicious software running on their laptop than inside their car braking system. Thus, incorporating strong security  solutions will give manufacturers a competitive advantage.”\n\n­—Professor Christof Paar, University of Bochum,\n\nGermany, and University of Massachusetts Amherst, US\n\n## The New Rules of the Road\n\nThe future is not as far away as we think. In June\n2011, the Nevada legislature passed a law authorizing executives at the state’s department of motor\nvehicles to begin coming up with a set of rules of\nthe road for autonomous, or self-driving, vehicles.[6]\nImagine taking a taxi in Las Vegas, and there is no\ndriver—just a computer at the wheel. This may\nbe the first step toward getting autonomous cars\non the nation’s roads.\n\nLong gone are the days when the moving parts\nwere just mechanical. We are now in the age of\ncomputer chips and systems that provide greater\nefficiencies in today’s vehicles. Expanding beyond\nengine performance, the ever-growing number\nof embedded systems and integrated communications in modern automobiles have provided the\nconvenience and personalization that consumers\ncrave. But 10 years from now, will these same\nsystems continue to hold consumer confidence,\nor will they quickly become another avenue for\nmalware and breach of privacy data?\n\n\n-----\n\n## Contributors\n\n**Stuart McClure, Senior Vice President and General Manager, McAfee**\n\nStuart McClure oversees the McAfee Risk and Compliance product line, including sales, engineering,\nproduct management, product marketing, strategy, quality assurance, and customer support. Prior to\nMcAfee, McClure was executive director of security services for Kaiser Permanente, a $34-billion healthcare organization. He later served as senior vice president of global threats and research at McAfee,\nwhere he led an elite global security threats team and was founder, president, and chief technology\nofficer of Foundstone, Inc. (now McAfee Foundstone).\n\nWidely recognized for his extensive and in-depth knowledge of security, McClure is today one of the\nindustry’s leading authorities in information security. He co-authored Hacking Exposed: Network Security\n_Secrets & Solutions, which has been translated into more than 30 languages and is considered one of_\nthe definitive computer security books. A widely published and acclaimed security visionary, McClure has\nmore than 22 years of technology and executive leadership with profound technical, operational, and\nfinancial experience.\n\n**André Weimerskirch, Ph.D., Chief Executive Officer and President, ESCRYPT Inc.**\n\nAndre Weimerskirch, Ph.D., is chief executive officer (CEO), and president of US-based ESCRYPT Inc.\nand is in charge of the company’s international activities. From 2004 to 2007, he held the position of\nchief technology officer (CTO) of ESCRYPT GmbH. He studied business information technology and\nmathematics at Darmstadt Technical University before receiving his Master of Science degree in computer science at Worcester Polytechnic Institute, US. He then received his Ph.D. from Ruhr-University\nof Bochum in applied data security. Since then, Weimerskirch has been involved in numerous industry\nprojects focused on embedded data security and privacy, both in the US and Europe. He has published\nnumerous articles in academic and industrial workshops and has contributed to several industry standards in the field of automotive data security. He is one of the main players in defining the security and\nprivacy mechanisms for inter-vehicle communication in the US and Europe.\n\n\n-----\n\n**Marko Wolf, Ph.D., ESCRYPT GmbH, Germany**\n\nMarko Wolf, Ph.D., is senior security engineer at ESCRYPT GmbH, where he is focused primarily on\nembedded security and automotive security. He studied electrical engineering and computer engineering\nat the University of Bochum (Germany) and at Purdue University. After receiving his Master’s of Science\ndegree in 2003, he started his Ph.D. in trusted computing and vehicular IT security. Wolf completed his\nPh.D. in 2008, with the first comprehensive work about vehicular IT security engineering. He is editor/\nauthor of the books Embedded Security in Cars (Springer, 2006) and Security Engineering for Vehicular\n_IT Systems (Vieweg+Teubner, 2009), serves as program chair of the international “Embedded Security_\nin Cars (ESCAR)” workshop series, and has published more than 30 IT security articles.\n\n**Professor Christof Paar, University of Bochum, Germany,**\n**and University of Massachusetts Amherst, US**\n\nChristof Paar is the Chair for Embedded Security at the electrical engineering department of the\nUniversity of Bochum and is adjunct professor at the University of Massachusetts at Amherst. He is one\nof the leading international experts in industrial IT security. From 1994 to 2001 Paar led the Cryptography\nand Information Security Labs at Worcester Polytechnic Institute, US. He co-founded the Cryptographic\nHardware and Embedded Systems (CHES) conference, the leading global event for applied IT security.\nPaar has extensive research and development experience with European and US companies. He is a\nboard and advisory board member of several security companies and has rich experience with technology start-ups. Paar published more than 150 peer-reviewed publications in applied IT security and holds\nseveral patents.\n\n**Winfried Stephan, Senior Consultant, T-Systems ICT Security Consulting and Engineering**\n\nWinfried Stephan has been working in the field of security analysis and consulting for 15 years with\nT-Systems ICT Security Consulting and Engineering. He has spent 37 years in cryptography applications.\nHe has spent the last 15 working on projects for the development and implementation of an immobilizer system and other automotive services.\n\n**Stefan Goss, Ph.D., Ostfalia University of Applied Sciences**\n\nStefan Goss, Ph.D., has worked in the field of automotive electronics for 25 years. He was global head\nof development for telematics and instrumentations at Volkswagen from 2002 to 2007 and then global\nhead of development automotive on-board diagnoses from 2007 to 2011 before becoming professor\nof automotive technology at Ostfalia University of Applied Sciences 2011.\n\n\n-----\n\nMcAfee\n2821 Mission College Blvd.\nSanta Clara, CA 95054\n888 847 8766\nwww.mcafee.com\n\n\n**About McAfee**\n\nMcAfee, a wholly owned subsidiary of Intel Corporation (NASDAQ:INTC), is the world’s largest\ndedicated security technology company. McAfee delivers proactive and proven solutions and\nservices that help secure systems, networks, and mobile devices around the world, allowing\nusers to safely connect to the Internet, browse, and shop the web more securely. Backed by its\nunrivaled global threat intelligence, McAfee creates innovative products that empower home\nusers, businesses, the public sector, and service providers by enabling them to prove compliance\nwith regulations, protect data, prevent disruptions, identify vulnerabilities, and continuously\nmonitor and improve their security. McAfee is relentlessly focused on constantly finding new\nways to keep our customers safe.\n\nhttp://www.mcafee.com\n\nMcAfee and the McAfee logo are registered trademarks or trademarks of McAfee, Inc. or its subsidiaries in the United States and other\ncountries. Other marks and brands may be claimed as the property of others. The product plans, specifications and descriptions herein are\nprovided for information only and subject to change without notice, and are provided without warranty of any kind, express or implied.\nCopyright © 2011 McAfee, Inc. 31607rpt_malware-ahead_0811\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/Caution Malware Ahead - Emerging Risks in Automation System Security.pdf"
    ],
    "report_names": [
        "Caution Malware Ahead - Emerging Risks in Automation System Security.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3f42c8f4-2cf1-4555-abff-b19852033aec",
            "created_at": "2023-11-08T02:00:07.099084Z",
            "updated_at": "2025-03-27T02:00:03.180517Z",
            "deleted_at": null,
            "main_name": "TA499",
            "aliases": [
                "Lexus",
                "Vovan"
            ],
            "source_name": "MISPGALAXY:TA499",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535849,
    "ts_updated_at": 1743041581,
    "ts_creation_date": 1313399204,
    "ts_modification_date": 1313399233,
    "files": {
        "pdf": "https://archive.orkl.eu/3b03f1aad210506ea27938979fc45debccd9af64.pdf",
        "text": "https://archive.orkl.eu/3b03f1aad210506ea27938979fc45debccd9af64.txt",
        "img": "https://archive.orkl.eu/3b03f1aad210506ea27938979fc45debccd9af64.jpg"
    }
}