{
    "id": "c6ea5b65-944d-4746-835e-a2271eaedb80",
    "created_at": "2023-01-12T15:09:46.583651Z",
    "updated_at": "2025-03-27T02:15:49.300587Z",
    "deleted_at": null,
    "sha1_hash": "054fbc412c9874ac62ccccbbaaa7af5bcb0b8d55",
    "title": "2021-06-08 - From QBot...with REvil Ransomware- Initial Attack Exposure of JBS",
    "authors": "",
    "file_creation_date": "2022-05-28T04:44:55Z",
    "file_modification_date": "2022-05-28T04:44:55Z",
    "file_size": 1324010,
    "plain_text": "# From QBot...with REvil Ransomware: Initial Attack Exposure of JBS\n\n**[advanced-intel.com/post/from-qbot-with-revil-ransomware-initial-attack-exposure-of-jbs](https://www.advanced-intel.com/post/from-qbot-with-revil-ransomware-initial-attack-exposure-of-jbs)**\n\nAdvIntel June 7, 2021\n\nJun 7, 2021\n\n4 min read\n\n_Vitali Kremez & Yelisey Boguslavskiy_\n\nAt Advanced Intelligence, LLC we focus on providing *only* primary source proactive\nintelligence which supports our dual mission of providing threat prevention and loss\navoidance solutions to our customer base.\n\n\n-----\n\n**Introduction**\n\nDuring the first week of June 2021, two major corporations were attacked by a ransomware\ngroup. JBS, the largest meat producer in the world, was hit on May 30, with the attack\ntargeting the North American and Australian IT systems. Fujifilm, a Japanese multinational\nconglomerate was likely hit between June 1 and June second. Even though the two attacks\nand their victims, as well as jurisdictions, are radically different, a strong commonality\nsuggests the same pattern and perpetrator - REvil gang possibly using the QBot malware to\nperform the initial infection operation.\n\nOn June 2, 2021, immediately after the first impact of both incidents became evident,\nAdvIntel has uniquely discovered the indicators which may suggest the likely attack pattern\n\n- deployment of ransomware payload with or through the use of a botnet infection - in this\ncase - the strain of QBot.\n\n_AdvIntel Andariel OMNI search reveals indicators of QBot presence prior to the attack for the_\n_Fujifilm incident_\n\nAdvIntel’s Andariel unique OMNI Search feature that enables a holistic cross-platform and\ncross-source search across different underground domains, including botnets and vetted\ncriminal infrastructures revealed the QBot IOCs for the fujifilm[.]com environments. Through\nthis unique visibility into the threat actor infrastructures, we were able to observe advanced\nprocesses taking place in the networks of crime groups - REvil and QBot including an\nindication of QBot presence in Fujifilm networks for May 2021. Specifically, we have\nidentified the QBot installation date as April 23, 2021.\n\n\n-----\n\n_The same results were seen for the JBS - a QBot infection present at least since April 15,_\n_2021._\n\nQBot initially started as banking malware. Currently, the botnet has evolved into a\nsophisticated modular malware that possesses the ability to compromise sensitive\ninformation. The mechanics of the botnet includes the exploitation of hijacked email threads\nto begin the spread of infection. Well-designed email spam campaigns are then utilized to\nmass-distribute the infection in the victim networks; behavior also associated with Emotet.\nQBot group is considered a structured organization that is financially motivated. The group is\nassigned expert-level sophistication by AdvIntel’s specialists. A network infection attributed\nto QBot automatically results in risks associated with future ransomware attacks, including\nREvil attacks.\n\n\n-----\n\n_QBot's Task Scheduler Flow_\n\nWe assess with a moderate-to-high level of confidence, that REvil and QBot closely\ncooperate and have joined efforts to target JBS and Fujifilm (JBS attack attribution to REvil\nhas been already confirmed by the FBI and REvil themselves). The assessment is based on\nthree indicators.\n\nFirst, we have previously seen attacks in which QBot infection timing correlated with REvil\nattack timing. In other words, REvil’s attack - most often data leak followed the specific\npattern of time after the initial QBot infection. For a sophisticated attack against a large\ntarget, it takes REvil two-to-three weeks to remain in the network. This exact timeframe\nbetween QBot infection and the REvil breach has been observed by AdvIntel while\ninvestigating REvil-related incidents.\n\nSecond, our advanced underground community engagements and communication with\nthreat actors directly related to REvil and QBot demonstrated certain evidence of cooperation\nbetween the two groups. Specifically, in the context of DarkSide - a known competitor of\nREvil succeeding in performing major cyberattacks initiated via botnet partnership with\nZloader. The competition with DarkSide naturally leads to REvil’s agenda of building an elite\nbotnet partnership.\n\n**...[i]t was a matter of time, when QBot loader group engages with REvil**\n**ransomware...**\n\n\n-----\n\nThird, the TTPs and operational models of the two crime groups make this cooperation\nlogical and natural. On the one hand, QBot as a botnet is known to build its business by\nengaging with as many top-tier ransomware groups as possible. A usual botnet group will\nhave one partnership with a RaaS gang, sometimes two partnerships, but QBot differs from\nthis pattern, as from the very beginning they were aiming at massive partnership expansions.\n\nIn other words, when other botnets only had one liaison on the ransomware side, QBot had\nmany. For instance - Dridex had DopplePaymer; TrickBot botnet had Ryuk, Zloader had\nDarkSide, etc. At the same time, QBot had Egregor, ProLock, LockerGoga, Mount Locker,\nand other ransomware collectives. Therefore, it was a matter of time, when they engage with\nREvil.\n\nAt the same time, REvil, unlike other ransomware groups is known to diversify its attack\ntools. Usually, each ransomware group has its preferred tool, for instance, one infrastructural\nvulnerability, or one specific botnet. However, REvil aimed at covering as many attack\nsurfaces as possible. Like many groups, they started with RDP exploitation, but they never\nstopped there. 2021 became REvil’s year of rapid diversification. They announced\ninvestments in specialists in BlueKeep vulnerability, PulseVPN exploitation, Fortigate VPN\nexploitation. They have clearly expressed their interest in the novel Microsoft server CVEs,\nthen in TrickBot malware, and then, finally, in a direct purchase of network access from\nunderground.\n\n\n-----\n\nWith such a pattern of two groups both aiming at approaching as many partners as possible\nand achieving the highest levels of diversification, it was a matter of time, when REvil and\nQBot would start cooperating. And of course, after the ransomware partnerships were\nbanned on most of the underground forums, making it harder for them to communicate with\nthe criminal community securing a partnership with another crime group becomes a priority\nfor syndicates like REvil.\n\n2021-07-06-AdvIntel-QBot-IOCs\n\n.csv\n\nDownload CSV • 12KB\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-08 - From QBot...with REvil Ransomware- Initial Attack Exposure of JBS.pdf"
    ],
    "report_names": [
        "2021-06-08 - From QBot...with REvil Ransomware- Initial Attack Exposure of JBS.pdf"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536186,
    "ts_updated_at": 1743041749,
    "ts_creation_date": 1653713095,
    "ts_modification_date": 1653713095,
    "files": {
        "pdf": "https://archive.orkl.eu/054fbc412c9874ac62ccccbbaaa7af5bcb0b8d55.pdf",
        "text": "https://archive.orkl.eu/054fbc412c9874ac62ccccbbaaa7af5bcb0b8d55.txt",
        "img": "https://archive.orkl.eu/054fbc412c9874ac62ccccbbaaa7af5bcb0b8d55.jpg"
    }
}