{
    "id": "c7301c06-554b-41c6-be48-2aebb7292e12",
    "created_at": "2023-01-12T15:04:16.523998Z",
    "updated_at": "2025-03-27T02:09:29.25459Z",
    "deleted_at": null,
    "sha1_hash": "5c7e009112f2268ec69d4f28bc5d57c949c07adb",
    "title": "2021-06-11 - Relentless REvil, revealed- RaaS as variable as the criminals who use it",
    "authors": "",
    "file_creation_date": "2022-05-27T21:51:50Z",
    "file_modification_date": "2022-05-27T21:51:50Z",
    "file_size": 1455652,
    "plain_text": "# Relentless REvil, revealed: RaaS as variable as the criminals who use it\n\n**[news.sophos.com/en-us/2021/06/11/relentless-revil-revealed/](https://news.sophos.com/en-us/2021/06/11/relentless-revil-revealed/)**\n\nAndrew Brandt June 11, 2021\n\nThe transition to a service model of doing business transformed ransomware, giving its\ndevelopers the ability to focus on features, and leaving the harder part – the break-in and\ndeployment to the target’s computers – to its customers, threat actors who employ a wide\nrange of attack styles, software, and expertise to the task.\n\nOne of the ransomware-as-a-service (RaaS) we encounter most frequently, known\nalternately as Sodinokibi or REvil, is as conventional a ransomware as we’ve seen: Its\nroutines, configuration, and behavior what we’ve come to expect from a mature family that’s,\nobviously, well used in the criminal underground.\n\n\n-----\n\nUnsurprisingly, Sophos has devoted significant effort to combat this everyday menace. In\naddition to tamper protection features that prevent a script from disabling endpoint protection\nfeatures, we use behavioral detection rules that identify the core activities ransomware must\nengage in, and a feature called CryptoGuard that prevents the ransomware from encrypting\ndata.\n\nAs attacks involving RaaS malware, including REvil, increasingly have generated public\nattention and news coverage, SophosLabs wanted to pull together a common body of our\nknowledge about the ransomware itself, and the variety we observe in attack methods\nemployed by the criminals who lease the software and handle the break-ins.\n\nIn addition, we reviewed reports produced by Sophos Rapid Response about attacks\ninvolving Sodinokibi/REvil where the MTR team were hired to provide incident response and\ncleanup. From these detailed analyses, we were able to develop a picture of a common\nmalware being deployed in myriad ways by a large base of criminal customers.\n\n## Signs of an impending attack\n\nThe deployment of ransomware usually happens at the very end of a much larger, and more\nelaborate, set of precursor actions that a criminal attacker will take during what might be a\nsignificantly long time before anyone in a targeted organization logs on to find a ransom note\non their desktop. So while we will discuss the internals and typical characteristics\nof Sodinokibi/REvil, it makes more sense to describe these precursor actions first. If a\ndefender or network owner can discover and quickly act on these behaviors while the\nattacker is still laying the groundwork for the final ransomware payload, it’s possible to cut off\nthe attackers’ access before any harm comes to the target’s computers.\n\nAttackers themselves appear to use a combination of scripting (sometimes hosted on file\nrepositories like Github or Pastebin) and manual control (sometimes via the console, other\ntimes through Windows Remote Desktop or commercial remote access tools).\n\n\n-----\n\nOne REvil attacker used scripts taken directly from a repository of penetration tester tools on\nGithub\nWe’ve broken a typical attack into the following phases: Penetration and initial access;\nCredential harvesting and privilege escalation; Tilling the field; and deployment of the\nransomware. Often (but not always, because it is attacker-dependent), there’s a phase\nwhere the attackers use their newfound credentials to hunt for and exfiltrate sensitive\norganizational data in the hours-to-weeks before delivering the payload.\n\n### Penetrating the network\n\nBreaking in is, perhaps unsurprisingly, not all that hard to do if it’s what you do, all day long.\nBut it’s possible to boil down the initial access methods employed by a variety of criminals\nwho attacked using Sodinokibi/REvil into a few types: Brute-force attacks against known\ninternet-facing services like VPNs, RDP, desktop remote management tools like VNC, and\neven some cloud-based management systems; The abuse of previously-obtained credentials\nor access (either retrieved from other malware or phishing) of legitimate accounts that didn’t\nrequire the use of multi-factor authentication; or, in some cases, piggybacking as a payload\nfrom other malware present on the target’s network.\n\n\n-----\n\nBrute-force attacks are, unfortunately, a large part of the traffic that almost any internet-facing\nservice sees on an hour-to-hour basis. The attacks cost so little to the attackers it pays just\nto throw the kitchen sink at a login screen, which is why multi-factor authentication is so\nincredibly important (though not necessarily a panacea). Attackers are just as able to use\ntools like Shodan or Censys, which reveal open ports leading to common services, as\ndefenders.\n\nIn one of the recent attacks, the organization logged a massive volume of failed inbound\nRDP login attempts targeting the server which eventually became a point of access for the\nattackers. On a typical server, the log that stores failed attempts to login to services like RDP\nrolls over, overwriting the oldest data, over a period of from several days to weeks depending\non how many failed attempts were made. In this attack, the volume of failed RDP login\nevents caused the log files to completely overwrite themselves with new entries every five\nminutes. The data collected from that server showed approximately 35,000 failed login\nattempts over a five minute period, originating from 349 unique IP addresses around the\nworld.\n\nAmong the 35,000 brute\nforce login attempts made every five minutes, these were the most common usernames the\nattackers tried to use\nRDP was implicated as one of the most common methods of breaching a network in cases\nwe were called in to investigate, which is why shutting off the outside world’s access to RDP\nis one of the most effective defenses an IT admin can take. But RDP was not the only culprit:\nattackers also gained initial access through other internet-facing services they were able to\nbrute-force or to launch an exploit against a known vulnerability that gave them some\naccess. In one case, the attacker targeted a bug in a specific VPN server software to gain\ninitial access, then exploited a bug on a five-year-old version of Apache Tomcat on the same\nserver that let the attacker create a new admin account on the server.\n\n\n-----\n\nIn at least two different cases involving different target organizations, the initial point of\naccess was something left in place by some other threat actor, who we later discovered had\npreviously struck those organizations with ransomware weeks to months prior to our\ninvolvement, victimizing them twice.\n\nIn one of those cases, we discovered a remnant of Cobalt Strike, a commercial penetration\ntesting toolset frequently abused by criminals to provide themselves with remote access to a\ncomputer. The Cobalt Strike artifact had been left in place by a (presumably, different) threat\nactor who deployed a ransomware called Le Chiffre.\n\nIn another, the attacker appeared to have brute-forced RDP on a machine that had been\npreviously implicated as the initial foothold of an attack by a different type of ransomware just\nthree weeks prior to the REvil attack.\n\nThe MITRE ATT&CK techniques used in one of the REvil ransomware attacks we\ninvestigated\n\n### Credential harvesting and privilege escalation\n\nRansomware threat actors prefer to use internal tools like Domain Controllers to deploy the\npayload; If they haven’t bought a stolen or phished credential, they’ll often quietly monitor the\nnetwork where the computer on which they gained an initial foothold is located. The\nattackers may use freely-available, not-inherently-malicious utilities to extract saved\npasswords from the hard drive, and/or more advanced tools such as Mimikatz to obtain the\ncredentials of a domain administrator account. This takes a lot of patience on the part of the\nattacker, because there’s no guarantee they’ll pick up a credential in any given set of time.\nBut once they have what they need, they act fast.\n\n### Tilling the field: Laying the groundwork for the attack\n\nPreparing an enterprise network for a ransomware attack takes a surprising amount of work.\nThe attackers need to establish a list of internal targets, give themselves domain admin\nprivileges, and use those privileges to shut down or otherwise hobble anything that might\nimpede their attack: Windows Defender is usually the first to go, but often the attackers will\nspend some time trying to determine what endpoint protection tools are running on the\ncomputers, and may run one or more customized scripts that combine an attempt to kill any\nrunning protection process or services, and also to remove any persistence those processes\nor services might have.\n\n\n-----\n\nOne REvil attacker built a customized script to terminate Sophos services and processes\nand even tries to uninstall the software. The attempt was prevented by tamper protection\nfeatures in the product.\nIn a at least one case involving Sodinokibi, the attackers went so far as to determine that the\ntarget’s network was using a Sophos firewall and managing their endpoint protection through\n[Sophos Central. The attacker diligently worked at obtaining the credentials of IT staff and](https://www.sophos.com/en-us/products/sophos-central.aspx)\nmethodically tried those credentials until they found one with permissions to access the\nSophos Central control panel, where they used that access to shut down any features that\nwould have blocked the ransomware from executing.\n\n\n-----\n\nDeleting the Volume\n\nShadow Copy has become a time-honored ransomware tradition at this point.\nRoutinely, we encounter PowerShell scripts, batch files, or other “laying the groundwork”\ncode attackers deploy to disable a variety of protective features. One example is the Volume\nShadow Copy, which attackers typically delete as the Volume Shadow could assist in the\nrecovery of deleted or encrypted data.\n\nThe number of different commands they can use to execute the same tasks is somewhat\nlimited, but the sequence and thoroughness varies greatly from threat actor to threat actor.\nWe also discovered that some threat actors simply number their scripts sequentially, or give\nthem benign-looking names, others have used files with profane or hateful references in the\nfilenames, sometimes in combination with the word Sophos.\n\n### Large uploads of stolen data (exfil)\n\nIn only about half of the incidents involving Sodinokibi/REvil analyzed for this report did the\nattackers conduct an exfiltration of significant volumes of private, sensitive, or valuable data\nfrom the target organizations. In theory, these types of uploads should be detectable, but in\npractice, that never happened in the cases we investigated.\n\n\n-----\n\nPractically speaking, once they had obtained the permissions they needed, the attackers\ntypically spent a few days looking through file servers, collecting large amounts of\ndocuments and bundling them into one or more compressed files on a machine inside the\nnetwork. Once they had collected everything they wanted to steal in one place, they would\nbegin an upload that, depending on the network speed and the amount of data, could\ntake from hours to more than a day to complete.\n\nThreat actors have used a variety of cloud storage services to hold this stuff in the past, but\nappear to prefer a few over others. Mega.nz, the cloud storage provider, seems to be in favor\namong some criminals who engage in ransomware attacks we’ve investigated. Among the\nincidents where Sodinokibi was eventually deployed after a large exfiltration and an\nattempted extortion, roughly three-quarters used Mega.nz as a (temporary) repository for\nthat stolen data.\n\nMega uses its own client application to speed uploads, which were found left behind by the\nattackers in cases where they didn’t clean up after themselves. A small number of attackers\nused other methods, such as installing a portable copy of the FTP client FileZilla that they\nused to upload data to a staging server outside the target’s network perimeter.\n\nConventional wisdom about how to respond to data leak extortion attempts has shifted away\nfrom advice to make the payment. The criminals claim they will delete their copies of the data\nif you pay the ransom demands, but that’s widely viewed as an unreliable promise. There’s\nno assurance other than the word of people who are extorting you that they’ll hold up their\nend of the bargain.\n\n### The final insult: deployment\n\nAttackers have launched the ransomware payload using a wide variety of methods. They\nmay push out copies to individual machines from a domain controller, or use administrative\ncommands with WMIC or PsExec to run the malware directly from another server or\nworkstation they control over the internal network of the target organization.\n\nSodinokibi/REvil has a few additional options that its operators may take advantage of by\nlaunching the malware with special command flags. One of the ways we’ve observed\nransomware attempt to work around endpoint protection tools is to reboot the computer into\nSafe Mode, and then begin the encryption operation. A computer in Safe Mode boots to a\ndiagnostic form of Windows in which third-party drivers and services are not running, but the\nransomware adds itself to the (very short) list of applications that run in Safe Mode. REvil\nhas a Safe Mode flag attackers could use.\n\nIn one instance, we observed a threat actor attempt to bypass security software by delivering\nand installing a full copy of VirtualBox and a virtual disk file, running the ransomware within a\nWindows 10 virtual machine guest copied to the targeted host computer, executing the\nencryption commands from the guest to target the host.\n\n\n-----\n\nThe long, encoded command string that requires you to know a lot about the machine in\norder to decode it\nIn others, we’ve observed the threat actor using WMI to create service entries on the\nmachines they target for encryption. The entries contain a long, encoded command string\nthat is impossible to decode unless you know the specific variables it was looking for. These\nvariables included information such as the machine name, IP address, domain, and\nusername. If you didn’t know all of these for the computer the service had been installed on,\nthen decoding the final layers was impossible.\n\n## How the ransomware, itself, works\n\nSodinokibi arrives as a packed, encrypted executable that has several anti-analysis features\ndesigned to frustrate researchers. The binary files are compiled with the unique configuration\nand ransom note text hardcoded into the application.\n\nA subroutine for deleting the Windows Defender definitions file in REvil\nWhen first executed, the malware profiles the target machine, enumerates a list of the\nrunning processes, and deletes the Volume Shadow Copy, the virus definition database used\nby Windows Defender, and temporary or backup files used by a number of different thirdparty programs that may be installed on the machine.\n\n\n-----\n\nFiles ignored by REvil\n\nIt searches the list of running processes for any matches to a list of process names encoded\ninto the configuration, and then attempts to kill those processes. Among the 30-odd process\nnames are included various database services, office applications, email clients, backup\nutilities, and the Firefox browser (but, oddly, no others).\n\n\n-----\n\nPart of the list of processes REvil tries to kill\n\nbefore it begins encrypting\nIt then enumerates the list of installed services and, at least in the case of some of the\nsamples we received, it attempts to disable the Sophos service (these attempts routinely fail,\ndue to tamper protection) as well as those of seven other commercial software tools.\n\n\n-----\n\nThe\n\nREvil ransom note, decrypted inside of the ransomware binary\nNext, the ransomware decodes and writes out the ransom note to the root of the C: drive.\nThe note lists a Tor website address and includes instructions on how to contact the\nattackers using either the Tor Browser, or with a a conventional browser on a Tor gateway\nwebsite, as well as a long key that the attackers use in the decryption utility.\n\nThe ransom note notification banner\nEmbedded within the configuration is an encoded .bmp image file, which the ransomware\nwrites to the %AppData%\\Local\\Temp folder and sets as the desktop image on the infected\ncomputer. The graphic says “All of your files are encrypted! Find [name of the ransom note]\n_for more instuctions.“ The ransom note filename starts with the same eight-random-character_\nstring the ransomware appends to the filename of every file it encrypts.\n\nHow the Salsa20 algorithm is used\n\n[Sodinokibi/REvil uses the curve25519/salsa20 algorithm to encrypt files. The built](https://en.wikipedia.org/wiki/Curve25519)\nin configuration contains a long list of folders, file types, and specific filenames that it won’t\nencrypt (to maintain stability of the affected computer) rather than a list of targeted filetypes.\n\n\n-----\n\nA\n\npartially encrypted file example showing how Salsa20 “steps” through a file (note the position\nof “expand 32-byte k”)\nThe ransomware does some housekeeping tasks while running. The embedded\nconfiguration contains a list of internet domain names; It sends statistics about the infection\nprocess back to the operators of the ransomware at one or more of these domains. These\ndomains serve as strong indicators of compromise.\n\nREvil/Sodinokibi also has switched to using the Monero cryptocurrency as its exclusive\npayment method. As Monero has additional privacy features that Bitcoin does not have, it’s\nunlikely that we’ll see a recovery of the ransom paid to a threat actor who deployed this\nransomware, as the FBI was able to accomplish with the DarkSide ransomware attack\nagainst Colonial Pipeline.\n\n## Guidance for IT professionals\n\nSophos products detect various forms of Sodinokibi/REvil as Troj/Sodino-*, Mem/Sodino-*,\nand HPMal/Sodino-A.\n\nWhile not an exhaustive list, these recommendations are more important than ever.\n\n**Monitor and respond to alerts – Ensure the appropriate tools, processes, and**\nresources (people) are available to monitor and respond to threats seen in the\nenvironment. It is crucial to ensure that, when a security alert or event happens,\nsomeone investigates and responds in a timely manner. Ransomware attackers may\ntime their strike during off-peak hours, weekends, or holidays, working on the\nassumption that few or no staff are watching.\n**Strong passwords – Strong passwords serve as one of the first lines of defense. As a**\nminimum use a complex password of at least twelve characters. Password managers\nwill help users maintain complex passwords that are unique to individual accounts.\nDon’t reuse passwords anywhere.\n\n\n-----\n\n**Multi Factor Authentication (MFA) – Even strong passwords can be compromised. At**\na minimum, any form of multifactor authentication is better than none for securing\naccess to critical resources such as e-mail, remote management tools, and network\nassets. [TOTP MFA apps on smartphones may be safer than email or SMS-based MFA](https://en.wikipedia.org/wiki/Time-based_One-Time_Password)\nsystems in the long run; In a situation where the attacker is already on the network,\nemail may already be compromised, and SIM swapping, while rare, could compromise\ntext message MFA codes. But don’t let the perfect be the enemy of the good. MFA of\nany kind can save your bacon.\n**Lock down accessible services – Perform scans of your organization’s network from**\noutside the network, and identify and lock down the ports commonly used by VNC,\nRDP, or other remote access tools. If a machine needs to be reachable using a remote\nmanagement tool, put access to that tool behind a VPN that uses MFA as part of its\nlogin and segmented into its own VLAN away from other machines.\n**Segmentation and Zero-Trust – At the very minimum, separate critical servers from**\neach other and from workstations by putting them into separate VLANs as you\n[work towards a zero-trust network model.](https://home.sophos.com/en-us/security-news/2021/what-is-zero-trust.aspx)\n**Inventory your assets and accounts – Unprotected and unpatched devices in the**\nnetwork increase risk, and create a situation where malicious activities could pass\nunnoticed. It is vital to protect every device on your network, and the only way to do\nthat is to have a current inventory of all connected computers and IOT devices. Use\nnetwork scans and physical checks to locate and catalog them.\n**Product configuration – Ensure that security products are configured following best**\npractices guidance. Check policy configurations and exclusions on a regular basis.\nNew features may not be enabled automatically.\n**Active Directory (AD) – Conduct regular audits on all accounts in AD, ensuring that no**\naccounts have more access than is needed for their purpose. Disable accounts for\ndeparting employees as soon as they leave the company.\n**Patch everything – keep Windows and other software up to date. Validate that**\npatches have been installed for critical systems like internet-facing machines or domain\ncontrollers.\n\nUsers of [Sophos LiveDiscover can run SQL queries like the ones in this table to interrogate](https://docs.sophos.com/central/Customer/help/en-us/central/Customer/learningContents/LiveDiscover.html)\ntelemetry from devices on their managed network, and hunt for unusual or unexpected\nbehavior on their managed devices.\n\n\n-----\n\n## Acknowledgments\n\nSophosLabs researchers Anand Ajjan, Hajnalka Kope, and Mark Loman and Rapid\nResponse manager Peter Mackenzie contributed to our understanding of REvil attacks and\nthe malware’s behavior.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-11 - Relentless REvil, revealed- RaaS as variable as the criminals who use it.pdf"
    ],
    "report_names": [
        "2021-06-11 - Relentless REvil, revealed- RaaS as variable as the criminals who use it.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535856,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653688310,
    "ts_modification_date": 1653688310,
    "files": {
        "pdf": "https://archive.orkl.eu/5c7e009112f2268ec69d4f28bc5d57c949c07adb.pdf",
        "text": "https://archive.orkl.eu/5c7e009112f2268ec69d4f28bc5d57c949c07adb.txt",
        "img": "https://archive.orkl.eu/5c7e009112f2268ec69d4f28bc5d57c949c07adb.jpg"
    }
}