{
    "id": "c75fb968-263e-4bb6-a465-44b8498a0604",
    "created_at": "2023-01-12T15:02:52.695001Z",
    "updated_at": "2025-03-27T02:15:26.235394Z",
    "deleted_at": null,
    "sha1_hash": "cafcb5784a139d6bdb2d37de71f8183096b0fedb",
    "title": "2016-12-09 - -Proof of Concept- CryptoWire Ransomware Spawns Lomix and UltraLocker Families",
    "authors": "",
    "file_creation_date": "2022-05-27T22:38:36Z",
    "file_modification_date": "2022-05-27T22:38:36Z",
    "file_size": 503899,
    "plain_text": "# \"Proof of Concept\" CryptoWire Ransomware Spawns Lomix and UltraLocker Families\n\n**bleepingcomputer.com/news/security/-proof-of-concept-cryptowire-ransomware-spawns-lomix-and-ultralocker-**\nfamilies/\n\nCatalin Cimpanu\n\nBy\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nDecember 9, 2016\n02:31 PM\n5\n\nA new open-source ransomware project uploaded on GitHub as a \"proof of concept,\" has\nnow spawned three new ransomware families that are infecting users in real-life.\n\n\n-----\n\nThe original CryptoWire project was uploaded to GitHub by an anonymous user this past\nMay.\n\nThe project, still available for download, contains a ZIP archive, with the ransomware's\nsource code, and a README file advertising CryptoWire's capabilities.\n\nContents of the CryptoWire package\nAccording to its author, the ransomware is written in the AutoIt scripting language and locks\nfiles stored on network drives, network shares, USB drives, external disks, internal disks,\nand cloud storage apps running on the machine such as Onedrive, Dropbox, Google Drive,\nand Steam.\n\nCryptoWire uses the AES-256 algorithm for the encryption operations, which will encrypt all\nfiles smaller than 30MB (adjustable limit). The README file might have been outdated, as\nthe ransomware's source code included file extension filters (pictured below).\n\n\n-----\n\nThe README claims the encryption process makes a copy of the targeted files, encrypts\nthe copy, overwrites the original file ten times, and then permanently deletes its.\n\nAfter the encryption process ends, CryptoWire will delete all shadow volume copies, and\noverwrite the content of the RecycleBin ten times and permanently delete it.\n\nWhen displaying the ransom note, CryptoWire will check if the infected target is part of a\ndomain and multiply the ransom demand by 10 (adjustable value).\n\nCryptoWire's author said it shipped the ransomware without a backend panel \"to prevent\nskids from abusing it.\" Unfortunately, skids abused it.\n\n## Real-life CryptoWire spawns\n\nThe first CryptoWire spawn was detected at the end of October by GData malware analyst\n[Karsten Hahn, using the same name: CryptoWire.](https://twitter.com/struppigel)\n\nThis version appears to have been under development, as one crucial button for the\ndecryption process was missing from its interface.\n\n\n-----\n\nCryptoWire variant, October 2016\n[A month later, security researcher S!Ri discovered the Lomix ransomware, pictured below.](https://twitter.com/siri_urz)\n\n\n-----\n\nLomix ransomware, November 2016\nToday, the same Karsten Hahn has come across another CryptoWire variant that goes by\nthe name of UltraLocker and spreads a spam campaign delivering malicious Word files.\n\n\n-----\n\nUltraLocker ransomware, December 2016\nThe problem of open-source and so-called \"educational\" ransomware has been discussed\nin the past numerous times. Previous open-source ransomware families included Hidden\nTear, EDA2, [CryptoTrooper, and](http://news.softpedia.com/news/new-open-source-linux-ransomware-shows-infosec-community-divide-508669.shtml) [Heimdall.](https://www.bleepingcomputer.com/news/security/heimdall-open-source-php-ransomware-targets-web-servers/)\n\nIn all cases, the authors of these projects have hidden from any responsibility and damage\ntheir code would have caused just by using words as \"educational\" and \"proof of concept,\"\nnot realizing that real-life malware coders don't care.\n\nMost crooks look at open-source ransomware as free work, and hours of work they don't\nhave to put in designing, documenting, and writing their own code. How about we stop\ngiving crooks a helping hand, shall we?\n\n### Related Articles:\n\n[BlackCat/ALPHV ransomware asks $5 million to unlock Austrian state](https://www.bleepingcomputer.com/news/security/blackcat-alphv-ransomware-asks-5-million-to-unlock-austrian-state/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n\n-----\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[Hacker says hijacking libraries, stealing AWS keys was ethical research](https://www.bleepingcomputer.com/news/security/hacker-says-hijacking-libraries-stealing-aws-keys-was-ethical-research/)\n\n[CryptoWire](https://www.bleepingcomputer.com/tag/cryptowire/)\n[Lomix](https://www.bleepingcomputer.com/tag/lomix/)\n[Open Source](https://www.bleepingcomputer.com/tag/open-source/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n[UltraLocker](https://www.bleepingcomputer.com/tag/ultralocker/)\n\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nCatalin Cimpanu is the Security News Editor for Bleeping Computer, where he covers topics\nsuch as malware, breaches, vulnerabilities, exploits, hacking news, the Dark Web, and a\nfew more. Catalin previously covered Web & Security news for Softpedia between May\n2015 and October 2016. The easiest way to reach Catalin is via his XMPP/Jabber address\nat campuscodi@xmpp.is. For other contact methods, please visit Catalin's author page.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/new-exo-android-trojan-sold-on-hacking-forums-dark-web/)\n[Next Article](https://www.bleepingcomputer.com/news/software/chrome-56-to-show-warnings-on-http-pages-with-payment-and-password-forms/)\n\n### Comments\n\n\n-----\n\n[Uselesslight - 5 years ago](https://www.bleepingcomputer.com/forums/u/876055/uselesslight/)\n\nOr alternatively Catalin, why don't we not stop \"helping\" crooks? I see the points\nyou're making, and they are concise and accurate, but on the other hand: Do you not\nfeel that the masses need education, on all topics? Understandable that so-called\ncrooks are going to try and repurpose these types of software, why would they not?\nHowever, this is a byproduct of education, we have schools that teach people about\nbombs, why do they not get told to stop helping the crooks? People can utilize this\nknowledge for very good purposes, like all things. I strongly feel that these open\nsource ransomware's popping up periodically could turn out being more beneficial, if\nmore people familiarize themselves with the concepts, two things could potentially\nhappen. 1) People are going to garnish more awareness on security issues such as\nthese and having a working proof-of-concept will make it easier to educate people\nwho are misinformed. 2) More knowledge of ransomware in general is made possible\nby this. Would it not be great, if encryption as it is became a common understanding\nand the issues like ransomware would go away? Think of the possibilities if everyone\nwas capable of decrypting their files following a ransomware infection? Also, the socalled crooks utilizing open-source software, are DEFINITELY not the ones that are\ngoing to be causing serious damages... Of course though, I do see your point on the\nmatter, but this is just another take on that.\n\n\n-----\n\n[Struppigel - 5 years ago](https://www.bleepingcomputer.com/forums/u/976061/struppigel/)\n\n\"Also, the so-called crooks utilizing open-source software, are DEFINITELY not the\nones that are going to be causing serious damages...\"\nHave you ever had a look at the forums for the help request to all the\nHiddenTear/EDA2 variants? They are causing major damage to people and\norganizations.\n\nMe and some of my colleagues have written articles about that matter, because it is\ndiscussed a lot lately. If you are interested in our reasoning, you might want to read\nthat: https://blog.gdatasoftware.com/2016/11/29289-it-s-educational-on-the-no-1argument-for-open-source-ransomware\n\n[Uselesslight - 5 years ago](https://www.bleepingcomputer.com/forums/u/876055/uselesslight/)\n\nCertainly I will have a read through your publication. Don't get me wrong, I'm not trying\nto say \"my way or the highway\". I just see the value in learning this kind of stuff.\n\n\n-----\n\n[Amigo-A - 5 years ago](https://www.bleepingcomputer.com/forums/u/998576/amigo-a/)\n\nHiddenTear/EDA2 or CryptoWire...\nIt's like, what produce grenades, bombs and deadly weapons, and then cry out for\nmercy.\nIf you made a bombshell, If put it in the wrong hands - it will fly and explode, what to\ncause injury and death.\n\n[Uselesslight - 5 years ago](https://www.bleepingcomputer.com/forums/u/876055/uselesslight/)\n\nThat is kind of my point Amigo-A, everything that has ever been created, ever has the\npotential of being misused. It's going to exist one or another though, there is nothing\nwe can do, at this point the lesser of two evils is to embrace it and learn as much as\nwe can. The only hope we have against ransomware it seems is education now.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-12-09 - -Proof of Concept- CryptoWire Ransomware Spawns Lomix and UltraLocker Families.pdf"
    ],
    "report_names": [
        "2016-12-09 - -Proof of Concept- CryptoWire Ransomware Spawns Lomix and UltraLocker Families.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535772,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653691116,
    "ts_modification_date": 1653691116,
    "files": {
        "pdf": "https://archive.orkl.eu/cafcb5784a139d6bdb2d37de71f8183096b0fedb.pdf",
        "text": "https://archive.orkl.eu/cafcb5784a139d6bdb2d37de71f8183096b0fedb.txt",
        "img": "https://archive.orkl.eu/cafcb5784a139d6bdb2d37de71f8183096b0fedb.jpg"
    }
}