{
    "id": "c7d9168d-be21-4d2b-95fa-b5df40e91589",
    "created_at": "2023-01-12T15:09:15.663407Z",
    "updated_at": "2025-03-27T02:17:11.320424Z",
    "deleted_at": null,
    "sha1_hash": "7eb96b007ade10219561caa0ac0733f05144cf62",
    "title": "2022-02-22 - Cyberthreats during Russian-Ukrainian tensions- what can we learn from history to be prepared-",
    "authors": "",
    "file_creation_date": "2022-05-29T01:31:32Z",
    "file_modification_date": "2022-05-29T01:31:32Z",
    "file_size": 195796,
    "plain_text": "# Cyberthreats during Russian-Ukrainian tensions: what can we learn from history to be prepared?\n\n**news.sophos.com/en-us/2022/02/22/cyberthreats-during-russian-ukrainian-tensions-what-can-we-learn-from-history-**\nto-be-prepared/\n\nChester Wisniewski February 23, 2022\n\nWith Russian troops targeting Ukraine and distributed denial of service (DDoS) attacks\nsporadically disrupting Ukrainian government websites and financial service providers, there\nis much talk about being prepared for cyber conflict.\n\nWhile all organizations should always be prepared for an attack from any direction, it can be\nhelpful to know what to look for when the risk of attack increases. I decided to review the\nhistory of known or suspected Russian state activities in the cyber realm to assess what\ntypes of activities to expect and how organizations can be prepared.\n\n## Destabilizing denial of service attacks\n\nThe earliest known activity dates to April 26, 2007, when the Estonian government moved a\nstatue commemorating the Soviet Union’s liberation of Estonia from the Nazis to a less\nprominent location. This action infuriated Estonia’s Russian speaking population and\ndestabilized relations with Moscow. Soon after there were riots in the streets, protests\noutside of the Estonian embassy in Moscow and a wave of debilitating DDoS attacks on\nEstonian government and financial services websites.\n\n\n-----\n\nFully prepared tools and instructions on how to participate in DDoS attacks appeared on\nRussian forums almost immediately after the moving of the statue. These attacks targeted\nwebsites belonging to the President, Parliament, police, political parties, and major media\noutlets.\n\nWhile calling on fellow “Russian patriots” to help punish Estonia, this was unlikely to have\nbeen a grassroots movement that sprung from zero with tools and a list of targets at the\n[ready. The same tactics were later deployed by Anonymous in defense of Wikileaks, using a](https://nakedsecurity.sophos.com/2010/12/09/low-orbit-ion-cannon-the-tool-used-in-anonops-ddos-attacks/)\ntool called the low orbit ion canon (LOIC).\n\nOn May 4, 2007, the attacks intensified and additionally began targeting banks. Exactly\nseven days later the attacks ceased at midnight, as abruptly as they had begun.\n\nEveryone immediately implicated Russia, but attributing distributed denial of service attacks\nis near impossible, by design. It is now widely believed these DDoS attacks were the work of\nthe [Russian Business Network (RBN), a notorious organized crime group in Russia with ties](https://nakedsecurity.sophos.com/2007/10/16/bulletproof-hosting/)\nto spamming, botnets and pharmaceutical affiliate schemes. Their services appear to have\nbeen “procured” for precisely a week to conduct these attacks.\n\nOn July 19, 2008, a new wave of DDoS attacks began targeting news and government\nwebsites in Georgia. These attacks mysteriously intensified dramatically on August 8, 2008,\nas Russian troops invaded the separatist province of South Ossetia. Initially they targeted\nGeorgian news and government sites before moving on to include financial institutions,\nbusinesses, education, Western media, and a Georgian hacker website.\n\nLike the earlier attacks on Estonia, a website appeared featuring a list of targets as well as a\nset of tools with instructions for using them. This ruse also attempted to attribute the attacks\nto “patriots” defending against Georgian aggression, yet most of the actual attack traffic\noriginated from a known large botnet believed to be controlled by RBN.\n\n## Digital defacement and spam\n\nThe attacks on Georgia also included website defacements and massive spam campaigns\ndesigned to clog Georgian’s inboxes. All of this appeared to be designed to inspire a lack of\nconfidence in the ability of Georgia to defend and govern itself and to prevent the\ngovernment from effectively communicating with its citizens and the outside world.\n\nLess than a year later, a further series of DDoS attacks began in Kyrgyzstan in January\n2009. This happened to coincide with a decision-making process the Kyrgyzstani\n[government was entering into to decide whether to renew a lease on a US air base in their](https://www.researchgate.net/publication/345883552_Comparative_analysis_of_cyberattacks_on_Estonia_Georgia_and_Kyrgyzstan)\nterritory. Coincidence? It appeared to be conducted by the RBN once again, but this time no\nruse of “patriots” expressing their digital opinions.\n\nThis brings us to the most recent kinetic conflict, the invasion of Crimea in 2014.\n\n\n-----\n\n## Disinformation and isolation\n\nLow-level information warfare has been ongoing against Ukraine since 2009, with many\nattacks coinciding with events that could be interpreted as threatening to Russian interests\nsuch as a NATO summit and negotiations between Ukraine and the EU for an Association\nAgreement.\n\nIn March 2014, the New York Times reported that “Snake” malware had infiltrated the\nUkraine Prime Minister’s Office and several remote embassies at the same time as antigovernment protests began in Ukraine. Near the end of 2013 and into 2014, ESET also\npublished research documenting attacks against military targets and media outlets dubbed\n[“Operation Potao Express.”](https://www.welivesecurity.com/wp-content/uploads/2015/07/Operation-Potao-Express_final_v2.pdf)\n\nAs before a homegrown cyber group known as “Cyber Berkut” executed DDoS attacks and\nweb defacements, without causing much actual harm. It did, however, create a lot of\nconfusion and that alone has an impact during times of conflict.\n\nEarly in the conflict soldiers without insignias seized control of Crimea’s telecommunications\nnetworks and the only internet exchange in the region, causing an information blackout. The\nattackers abused their access to the mobile phone network to identify anti-Russian\nprotesters and send them SMS messages saying, “Dear subscriber, you are registered as a\nparticipant in a mass disturbance.”\n\nAfter isolating Crimea’s ability to communicate, the attackers also tampered with the mobile\nphones of members of the Ukrainian Parliament, preventing them from effectively reacting to\n[the invasion. As noted in Military Cyber Affairs, disinformation campaigns kicked into full](https://digitalcommons.usf.edu/cgi/viewcontent.cgi?article=1001&context=mca)\nswing:\n\n_“In one case, Russia paid a single person to hold multiple different web identities. One actor_\n_in St. Petersburg conveyed that she was acting as three different bloggers with ten blogs,_\n_while also commenting on other sites. Another individual was employed to simply comment_\n_on news and social media 126 times every twelve hours.”_\n\n## Paralyzing power supplies\n\nOn December 23, 2015, the power was abruptly turned off for about half of the residents of\nIvano-Frankivsk, Ukraine. This is widely believed to have been the work of state-sponsored\n[Russian hackers. The initial attacks began more than 6 months before the power blinked out](https://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/)\nwhen employees at three power distribution centers opened a malicious Microsoft Office\ndocument with a macro designed to install malware called BlackEnergy.\n\nThe attackers were able to acquire remote access credentials to the Supervisory Control and\nData Acquisition (SCADA) network and take control of the substation controls to begin\nopening circuit breakers. The attackers then proceeded to brick those remote controls to\nprevent the breakers from being closed remotely to restore power. Additionally, the attackers\n\n\n-----\n\ndeployed a wiper to brick the computers used to control the grid and simultaneously\nconducted a telephone denial of service (TDoS) attack by clogging the customer service\nnumbers, frustrating customers trying to report the outages.\n\nNearly one year later, on December 17, 2016, the lights blinked out once again in Kyiv.\nCoincidence? Likely not.\n\nThis time the malware responsible was called Industroyer/CrashOverride and it was\n[immensely more sophisticated. The malware was designed with modular components that](https://www.dragos.com/wp-content/uploads/CrashOverride-01.pdf)\ncould scan the network to find SCADA controllers and it also spoke their language. It also\nhad a wiper component to erase the system. The attack didn’t appear related to BlackEnergy\nor the known wiper tool, KillDisk, but there was no doubt who was behind it.\n\n## Email exposure\n\nIn June 2016, during a close Presidential election campaign between Hillary Clinton and\n[Donald Trump, a new character named Guccifer 2.0 appeared on the scene claiming to have](https://guccifer2.wordpress.com/page/2/)\nhacked the Democratic National Committee and proceeded to hand over their emails to\nWikileaks. While not officially attributed to Russia, this appeared alongside other\n[disinformation campaigns during the 2016 election and is widely believed to be the work of](http://www.csmonitor.com/World/Passcode/2016/0615/%20Meet-Fancy-Bear-and-Cozy-Bear-Russian-groups-blamed-for-DNC-hack)\nthe Kremlin.\n\n## Supply chain attacks: NotPetya\n\nRussia’s persistent attacks against Ukraine weren’t over and they turned up the heat on June\n27, 2017, when they unleashed a new piece of malware now dubbed NotPetya.\n\nNotPetya was disguised as a new strain of ransomware and deployed through a hacked\nsupply chain of a Ukrainian accounting software provider. In fact, it was not really\nransomware at all. Although it would encrypt a computer, it was impossible to decrypt,\neffectively wiping the device and making it useless.\n\nThe victims [weren’t limited to Ukrainian companies. The malware spread around the world](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)\nwithin hours, mostly impacting organizations that had operations in Ukraine where the\nbooby-trapped accounting software was used.\n\nNotPetya is estimated to have caused at least $10 billion USD in damage worldwide.\n\n## False Flags\n\nAs the Winter Olympic games opened in PyeongChang on February 9, 2018, another attack\nwas about to be unleashed on the world. The malware attack disabled every domain\ncontroller across the entire Olympic network, preventing everything from Wi-Fi to ticket gates\n\n\n-----\n\nfrom working properly. Miraculously, the IT team was able to isolate the network, rebuild and\nremove the malware from the systems and have everything up and running for the next\nmorning, barely skipping a beat.\n\nThen it was time to conduct the malware analysis to attempt to determine who would want to\nattack and disable the entire Olympic network? Malware attribution is hard, but there were\nsome clues left behind that might help, or they could be false flags trying to point the finger at\nan uninvolved third party.\n\nThe “evidence” appeared to point at North Korea and China, yet it was almost too obvious to\nattempt to blame North Korea. In the end, some brilliant detective work by Igor Soumenkov\nof Kaspersky Lab [found a smoking gun that pointed directly at Moscow.](https://www.wired.com/story/untold-story-2018-olympics-destroyer-cyberattack/)\n\nA few years later, just before the festive holidays in late 2020, word spread of a supply chain\nattack targeting the SolarWinds Orion software used to manage networking infrastructure for\nlarge and mid-size organizations around the globe, including many US Federal Government\nagencies. The software update mechanisms had been hijacked and used to deploy a\nbackdoor.\n\nThe high-profile nature of the victims, combined with the access afforded through the\nstealthily deployed backdoor may make this attack one of the largest and most damaging\ncyberespionage attacks in modern history.\n\nThe U.S. Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security\nAgency (CISA), the Office of Director of National Intelligence (ODNI), and the National\n[Security Agency (NSA) released a joint statement saying their investigation indicated that:](https://www.cisa.gov/news/2021/01/05/joint-statement-federal-bureau-investigation-fbi-cybersecurity-and-infrastructure)\n\n_“…an Advanced Persistent Threat actor, likely Russian in origin, is responsible for most or all_\n_of the recently discovered, ongoing cyber compromises of both government and non-_\n_governmental networks. At this time, we believe this was, and continues to be, an_\n_intelligence gathering effort.”_\n\n## Russian cyberconflict in 2022\n\nIn 2022, as political tensions escalated in advance of the war, numerous Ukrainian\ngovernment websites were defaced, and systems were infected with malware disguised as a\nransomware attack.\n\nMultiple components of these attacks echoed the past. The malware was not actually\n[ransomware, it was simply a sophisticated wiper, as was seen in the NotPetya attacks.](https://blog.talosintelligence.com/2022/01/ukraine-campaign-delivers-defacement.html)\nAdditionally, there were many false flags left behind implying it might be the work of\nUkrainian dissidents or Polish partisans.\n\nAs the conflict moved into February, it became clear that the standard Russian conflict\nplaybook was in action: distract, confuse, deny, and attempt to divide.\n\n\n-----\n\nOn Tuesday February 15, 2022, a series of debilitating DDoS attacks were unleashed\nagainst Ukrainian government and military websites, as well as against three of Ukraine’s\nlargest banks. In an unprecedented move the White House has already declassified some\nintelligence and pinned the attacks on the Russian GRU.\n\n[The war began on February 24, 2022. Sophos is maintaining a rolling summary of](https://news.sophos.com/en-us/2022/03/21/russia-ukraine-war-related-cyberattack-developments/)\ncyberattack developments as they unfold.\n\n## The Russian playbook for cyberwarfare\n\nWhat now? Regardless of whether things continue to escalate, cyberoperations are sure to\ncontinue. Ukraine has been under a constant barrage of attacks with varying degrees of\npeaks and troughs since Viktor Yanukovych was deposed in 2014.\n\nRussia’s official “The Military Doctrine of the Russian Federation” from 2010 states:\n\n_“the prior implementation of measures of information warfare in order to achieve political_\n_[objectives without the utilization of military force and, subsequently, in the interest of shaping](https://www.cna.org/CNA_files/PDF/DOP-2016-U-014231-1Rev.pdf)_\n_a favourable response from the world community to the utilization of military force.”_\n\nThis suggests a continuance of previous behaviors before a conflict, and makes DDoS\nattacks a potential sign of an imminent kinetic response.\n\nInformation warfare is how the Kremlin can try to control the rest of the world’s response to\nactions in Ukraine or any other target of attack.\n\nFalse flags, misattribution, disrupted communications, and social media manipulation are all\nkey components of Russia’s information warfare playbook. They don’t need to create a\npermanent cover for activities on the ground and elsewhere, they simply need to cause\nenough delay, confusion and contradiction to enable other simultaneous operations to\naccomplish their objectives.\n\n## Prepare and protect\n\nInterestingly, the United States and United Kingdom are trying to preempt some of the\nmisinformation campaigns, and this could limit their effectiveness. However, we shouldn’t\nassume the attackers will stop trying, so we need to remain prepared and vigilant.\n\nFor example, organizations in countries surrounding Ukraine should be prepared to be drawn\ninto any online mischief, even if they are not operating directly inside Ukraine. Previous\nattacks and misinformation have leaked over into Estonia, Poland, and other bordering\nstates, even if only as collateral damage.\n\nFrom a global perspective, we should expect a range of “patriotic” freelancers in Russia, by\nwhich I mean ransomware criminals, phish writers and botnet operators, to lash out with\neven more fervor than normal at targets perceived to be against the Motherland\n\n\n-----\n\n[It is unlikely Russia would directly attack NATO members and risk invocation of Article V.](https://www.nato.int/cps/en/natohq/search.htm?query=article+V&submitSearch=)\nHowever, its recent gestures toward reining in criminals operating from the Russian\nFederation and their Commonwealth of Independent States (CIS) partners will probably\ncome to an end, and instead we will see the threats multiply.\n\n[While defense-in-depth security should be the normal thing to strive for at the best of times, it](https://www.cisa.gov/uscert/ncas/alerts/aa22-047a)\nis especially important if we can expect an increase in the frequency and severity of attacks.\nThe misinformation and propaganda will soon reach a fever pitch, but we must keep our\n[nose to the ground, batten down the hatches and monitor for anything unusual on our](https://news.sophos.com/en-us/2022/02/25/keep-calm-and-carry-on-five-tips-to-better-protect-yourself-during-the-current-russia-ukraine-crisis/)\nnetworks as the conflict cycles ebb and flow and even when/if they end soon. Because as we\nall know, it could take months for evidence of digital intrusions due to this Russian-Ukrainian\nconflict to surface.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-22 - Cyberthreats during Russian-Ukrainian tensions- what can we learn from history to be prepared-.pdf"
    ],
    "report_names": [
        "2022-02-22 - Cyberthreats during Russian-Ukrainian tensions- what can we learn from history to be prepared-.pdf"
    ],
    "threat_actors": [
        {
            "id": "059b16f8-d4e0-4399-9add-18101a2fd298",
            "created_at": "2022-10-25T15:50:23.29434Z",
            "updated_at": "2025-03-27T02:00:55.431907Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Evilnum"
            ],
            "source_name": "MITRE:Evilnum",
            "tools": [
                "More_eggs",
                "EVILNUM",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "39ea99fb-1704-445d-b5cd-81e7c99d6012",
            "created_at": "2022-10-25T16:07:23.601894Z",
            "updated_at": "2025-03-27T02:02:09.882982Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "Jointworm",
                "Operation Phantom in the [Command] Shell",
                "TA4563"
            ],
            "source_name": "ETDA:Evilnum",
            "tools": [
                "Bypass-UAC",
                "Cardinal RAT",
                "ChromeCookiesView",
                "EVILNUM",
                "Evilnum",
                "IronPython",
                "LaZagne",
                "MailPassView",
                "More_eggs",
                "ProduKey",
                "PyVil",
                "PyVil RAT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraPreter",
                "TerraStealer",
                "TerraTV"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a892faf-3d4d-4615-b7b6-cdbc2ce42d8d",
            "created_at": "2022-10-25T16:07:23.99045Z",
            "updated_at": "2025-03-27T02:02:10.06504Z",
            "deleted_at": null,
            "main_name": "Operation Potao Express",
            "aliases": [],
            "source_name": "ETDA:Operation Potao Express",
            "tools": [
                "FakeTC",
                "Patao"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8ce861d7-7fbd-4d9c-a211-367c118bfdbd",
            "created_at": "2023-01-06T13:46:39.153487Z",
            "updated_at": "2025-03-27T02:00:03.009422Z",
            "deleted_at": null,
            "main_name": "Evilnum",
            "aliases": [
                "TA4563",
                "EvilNum",
                "Jointworm",
                "KNOCKOUT SPIDER",
                "DeathStalker"
            ],
            "source_name": "MISPGALAXY:Evilnum",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536155,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653787892,
    "ts_modification_date": 1653787892,
    "files": {
        "pdf": "https://archive.orkl.eu/7eb96b007ade10219561caa0ac0733f05144cf62.pdf",
        "text": "https://archive.orkl.eu/7eb96b007ade10219561caa0ac0733f05144cf62.txt",
        "img": "https://archive.orkl.eu/7eb96b007ade10219561caa0ac0733f05144cf62.jpg"
    }
}