{
    "id": "c7d9126f-4326-4d72-8b07-857e0aae1f6a",
    "created_at": "2023-01-12T15:05:44.966246Z",
    "updated_at": "2025-03-27T02:09:18.110213Z",
    "deleted_at": null,
    "sha1_hash": "b2e8ed523765fc41fe05c54bec3e7bf2ab5e5b0c",
    "title": "2022-11-03 - Cobalt Strike Analysis and Tutorial- Identifying Beacon Team Servers in the Wild",
    "authors": "",
    "file_creation_date": "2022-11-28T18:59:08Z",
    "file_modification_date": "2022-11-28T18:59:08Z",
    "file_size": 8118000,
    "plain_text": "# Cobalt Strike Analysis and Tutorial: Identifying Beacon Team Servers in the Wild\n\n**unit42.paloaltonetworks.com/cobalt-strike-team-server/**\n\nDurgesh Sangvikar, Chris Navarrete, Matthew Tennis, Yanhui Jia, Yu Fu, Siddhart Shibiraj November 3, 2022\n\nBy [Durgesh Sangvikar,](https://unit42.paloaltonetworks.com/author/durgesh-sangvikar/) [Chris Navarrete,](https://unit42.paloaltonetworks.com/author/chris-navarrete/) [Matthew Tennis,](https://unit42.paloaltonetworks.com/author/matthew-tennis/) [Yanhui Jia,](https://unit42.paloaltonetworks.com/author/yanhui-jia/) [Yu Fu and](https://unit42.paloaltonetworks.com/author/yu-fu/) Siddhart\nShibiraj\n\nNovember 3, 2022 at 6:00 AM\n\n[Category: Tutorial](https://unit42.paloaltonetworks.com/category/tutorial/)\n\nTags: [C2,](https://unit42.paloaltonetworks.com/tag/c2/) [Cobalt Strike,](https://unit42.paloaltonetworks.com/tag/cobalt-strike/) [Cobalt Strike Series,](https://unit42.paloaltonetworks.com/tag/cobalt-strike-series/) [Cortex,](https://unit42.paloaltonetworks.com/tag/cortex/) [Cortex XDR,](https://unit42.paloaltonetworks.com/tag/cortex-xdr/) [Cortex XSOAR,](https://unit42.paloaltonetworks.com/tag/cortex-xsoar/)\n[Evasion,](https://unit42.paloaltonetworks.com/tag/evasion/) [incident response,](https://unit42.paloaltonetworks.com/tag/incident-response/) [next-generation firewall,](https://unit42.paloaltonetworks.com/tag/next-generation-firewall/) [post-exploitation,](https://unit42.paloaltonetworks.com/tag/post-exploitation/) [Team Server,](https://unit42.paloaltonetworks.com/tag/team-server/) threat\nprevention, [URL filtering,](https://unit42.paloaltonetworks.com/tag/url-filtering/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/cobalt-strike-team-server/)\n\n## Executive Summary\n\nAs Cobalt Strike remains a premier post-exploitation tool for malicious actors trying to evade\nthreat detection, new techniques are needed to identify its Team Servers. To this end, we\npresent new techniques that leverage active probing and network fingerprint technology. This\nis a fundamental change from previous passive traffic detection approaches.\n\n\n-----\n\nOver the course of our [Unit 42 blog series covering the adversary framework tool Cobalt](https://unit42.paloaltonetworks.com/tag/cobalt-strike-series/)\nStrike, we document the encoding and encryption techniques of its HTTP transactions.\nSpecifically, we analyzed the advanced, flexible traffic profiles used by Cobalt Strike’s\nBeacon command-and-control (C2) communication to evade detection by defenders.\n\nBeacon implants communicate to an attacker-controlled application called Team Server.\nTeam Server and the Beacon’s C2 traffic allow adversaries to easily and effectively cloak\nmalicious traffic as normal, benign traffic. This is made possible by a modular, extensible\n[domain-specific language called Malleable C2.](https://unit42.paloaltonetworks.com/cobalt-strike-malleable-c2-profile/)\n\nSanctioned adversaries (such as Red/Blue team members, pentesters and ethical hackers)\nas well as malicious actors can use premade or custom Malleable C2 profiles. These profiles\ncan be exceedingly difficult to continually develop traditional defenses against, such as\nconventional firewall threat prevention.\n\nIn previous approaches, Team Server detections could only be made after a Beacon binary\nwas implanted on a victim’s system and attempted to “phone home” to an attacker-controlled\nserver. Our new techniques can proactively detect Team Servers in the wild before an active\nC2 connection from a victim’s system has been initialized.\n\nWe will also demonstrate the following:\n\nHow Team Servers behave when they receive specially-crafted HTTP requests\nWhat kind of network fingerprint can be inferred and with what confidence\nDetails of some real-life malicious C2 between Beacon and Team Server in the wild\n\nPalo Alto Networks customers receive protections from and mitigations for Cobalt Strike\nBeacon and Team Server C2 communication in the following ways:\n\n[Next-Generation Firewalls with a](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Threat Prevention subscription can identify and block](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\nCobalt Strike HTTP C2 requests as well as responses that are masked with the base64\nencoding settings of the default profile (signatures 86445 and 86446).\n[Next-Generation Firewalls with an](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Advanced Threat Prevention subscription can](https://docs.paloaltonetworks.com/pan-os/10-2/pan-os-admin/threat-prevention/about-threat-prevention/advanced-threat-prevention)\nidentify and block Cobalt Strike HTTP C2 requests generated by custom profiles.\n[WildFire and Cortex XDR can identify and block Cobalt Strike Beacon binaries.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nCortex XSOAR response pack and playbook can automate the mitigation process.\nCortex XDR will report related exploitation attempts.\n[Malicious URLs and IPs have been added to Advanced URL Filtering.](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\nIf you think you may have been compromised or have an urgent matter, the Unit 42\nIncident Response team can provide personalized assistance.\n\n**Related Unit 42 Topics** **[Cobalt Strike,](https://unit42.paloaltonetworks.com/tag/cobalt-strike/)** **[C2,](https://unit42.paloaltonetworks.com/tag/C2/)** **[Tutorials](https://unit42.paloaltonetworks.com/tag/wireshark-tutorial/)**\n\n\n-----\n\n## Table of Contents\n\nProbing and Fingerprint Identification Technology\n\nTeam Server Found in the Wild\n\nConclusion\n\nIndicators of Compromise\n\nCS Samples\nCS Beacon Samples\nCS Team Server IP addresses\n\nAdditional Resources\n\n## Probing and Fingerprint Identification Technology\n\nThe Cobalt Strike Team Server, also known as CS Team Server, is the centralized C2\napplication for a Beacon and its operator(s). It accepts client connections, orchestrates\nremote commands to Beacon implants, provides UI management, and various other\nfunctions.\n\nDuring our research and development of Advanced Threat Prevention’s [inline deep learning](https://www.paloaltonetworks.com/blog/2022/02/inline-deep-learning/)\ndetection for Cobalt Strike traffic, we began experimenting with forging C2 requests to\nsuspected malicious Team Servers on the Internet. Through our analysis of attackercontrolled server responses, we developed a variety of techniques to classify previously\nundetected Cobalt Strike Team Servers before an attack can occur.\n\nIn the following sections, we share our findings on the following identification techniques:\n\nActive Probing Over HTTP\nActive Probing Over DNS\n\n### Active Probing Over HTTP HTTP/S OPTIONS Request and Response Fingerprint\n\nThe Team Server is a Linux program running an HTTP server configured to respond to a\nvariety of HTTP requests. When the server receives requests with the HTTP OPTIONS\nmethod, the server will return HTTP status code 200 and Content-Length: 0.\n\nFigure 1 shows an HTTP request and response to a Team Server. The URI provided in an\nHTTP OPTIONS request is disregarded as the same response is returned regardless of URI.\n\n\n-----\n\nFigure 1. HTTP OPTIONS request with HTTP 200 response.\n\n**HTTP/HTTPs GET Request and Response Fingerprint**\n\nWhen a Team Server starts, the HTTP server exposes certain URIs. Figure 2 shows the list\nof URIs.\n\nThe URLs stager and stager64 are masked if the profile has the set host_stage \"false\";\noption set. The HTTP server will return HTTP status code 404 if the URI begins with a\nforward slash (/).\n\nFigure 2. List of the URIs from the Team Server.\nRequest to Stager URI\n\nWhen a user sends the following HTTP request to a Team Server, the server will return the\n32-bit Beacon binary to the client. Figure 3 shows the HTTP request and response. Note the\nlack of a forward slash (/) at the beginning of the URI path.\n\n\n-----\n\nFigure 3. HTTP GET request and response for a 32-bit Beacon payload.\nRequest to Stager64 URI\n\nTo receive a 64-bit Beacon payload, a user must send an HTTP GET request to the URI\nstager64. Figure 4 shows the HTTP request and response for a 64-bit Beacon payload.\n\nFigure 4. HTTP GET request and response for a 64-bit Beacon payload.\nRequest to Beacon.http-get URI\n\nCertain preset URI paths can be configured in the Malleable C2 profile to serve static data. If\na user sends a GET request to the URI beacon.http-get, the Team Server responds with the\ndata that has been specified in its profile. Specifically, it sends the output section within the\nserver tag of the http-get configuration.\n\nIf the output section only contains the command print;, the server responds with HTTP status\ncode 200 and Content-Length: 0. Figure 5 shows the HTTP request and response with the\ndefault profile.\n\n\n-----\n\nFigure 5. HTTP request and response with default profile.\nIf Team Server initializes with the Malleable C2 Gmail profile, the server responds with static\ndata presented as described above. In this profile, GET requests to beacon.http-get result in\na response containing a JavaScript payload.\n\nFigure 6 shows the HTTP request and response generated by a Beacon session preset with\nthe Gmail Malleable C2 profile.\n\nFigure 6. HTTP request and response configured with the Gmail Malleable C2 Gmail profile.\nRequest to Beacon.http-post URI\n\nTeam Server’s behavior is the same for a GET request to the URI beacon.http-post as it is\nfor the URI beacon.http-get. Figure 7 shows the HTTP request and response for a Team\nServer instance that initializes with the default Malleable C2 profile.\n\n\n-----\n\nFigure 7. HTTP request and response configured with the default Malleable C2 profile.\nFigure 8 shows an HTTP transaction when a GET request for beacon.http-post is sent to a\nTeam Server instance that has initialized with the Gmail Malleable C2 profile.\n\nFigure 8. HTTP request and response configured with the Malleable C2 Gmail profile.\nURI Checksum\n\nTeam Server utilizes a custom one-byte checksum of the request URI as a condition to serve\nthe 32-bit or 64-bit version of the Beacon binary. A simple checksum algorithm implemented\nin Java named checksum8 is used to calculate the checksum of the request URI.\n\nAs shown in Figure 9, for 32-bit payloads, the code compares the URI checksum result to the\nliteral integer 92L (where the L suffix is Java syntax for integer type long). For 64-bit payload\nrequests, the algorithm compares the checksum to 93L.\n\n\n-----\n\nFigure 9. Code to check the URI checksum.\nWhen a user sends a GET request to a Team Server, the URI is passed to checksum8 and is\ncompared to both integer values 92L and 93L. If the checksum satisfies one of the\nconditions, the server will respond with the raw bytes of the appropriate Beacon binary.\n\nFigure 10 details an example of a URI that computes to a value that satisfies the checksum8\ncondition, as well as the Team Server’s response with the Beacon binary payload. This\ninformation was extracted from Beacon configuration scripts, which continue to provide\nthreat intelligence that is useful for preventing Cobalt Strike connections.\n\nFigure 10. HTTP GET request and response with a URI that satisfies checksum8.\nRandom URI\n\nIf a user sends a randomized URI path, the Team Server will respond with HTTP status code\n404 with Content-Length: 0. Figure 11 shows the HTTP response from a Team Server when\na user sends a GET request with the URI randomURI.\n\n\n-----\n\nFigure 11. HTTP GET request and response for a randomURI path.\n\n### Active Probing Over DNS\n\nCobalt Strike’s DNS listener enables Beacon implants to covertly utilize the DNS protocol to\ncommunicate with the Team Server. The DNS-based Beacon uses the DNS TXT, AAAA, and\nA records for task monitoring and other related functions. The configuration is set by data\nchannel mode in the Malleable C2 profile.\n\nFigure 12 shows a DNS request originating from a Beacon querying the TXT record for the\ndomain aaa.stage[.]xx.\n\nFigure 12. Beacon DNS request for TXT record.Once the request is received, the Team\nServer responds with the base64-encoded Beacon binary in the TXT record response, as\nshown in Figure 13 below:\n\n\n-----\n\nFigure 13. Beacon DNS Listener response (base64-encoded data).\n\n## Team Server Found in the wild\n\nBased on the fingerprints and signals discovered, we utilized open source threat intelligence\nfeeds including ZoomEye, Shodan and Censys to scour the internet in search of undetected\nCobalt Strike Team Servers in the wild.\n\nThe following table details IP/port and URI indicators of compromise (IoCs) related to live\nTeam Server instances we discovered in the wild in September 2022. We utilized Shodan’s\nfeed service to collect IP addresses of potential Team Servers before sending 32-bit stager\nprobes to test the daemon for positive indicators. Once a candidate returns the expected\nCobalt Strike response, we initialize a TCP connection with netcat to test, verify and extract\nthe served stager bytes as shown in Figure 14.\n\nFigure 14. Successful HTTP/S probing for Team Server via stager check.\n\n\nIP Address:Port Payload Type GETURI\n\n\nPOST-URI\n\n\n43[.]129[.]7[.]189:8080 windows-beacon_httpreverse_http\n\n117[.]50[.]37[.]182:80 windows-beacon_httpreverse_http\n\n\n/updates /aircanada/dark.php\n\n/api/x /api/y\n\n\n-----\n\n42[.]192[.]206[.]174:80 windows-beacon_httpreverse_http\n\n194[.]37[.]97[.]160:80 windows-beacon_httpreverse_http\n\n92[.]222[.]172[.]39:80 windows-beacon_httpreverse_http\n\n79[.]141[.]169[.]220:443 windows-beacon_httpreverse_http\n\n\n/dpixel /submit.php\n\n/cx /submit.php\n\n/ptj /submit.php\n\n/pixel.gif /submit.php\n\n\n_Table 1. IP/port and URI IoCs related to live Team Server instances._\n\n## Conclusion\n\nCobalt Strike is a potent post-exploitation adversary emulator that continues to evade\nconventional next-generation solutions, including signature-based network detection.\nHowever, Advanced Threat Prevention’s inline deep-learning models and heuristic\ntechniques provide defenses against Cobalt Strike Beacon and Team Server C2\ncommunication before they occur.\n\nThe probing and fingerprint technology detailed in this publication is very efficient and\nreliable in identifying Cobalt Strike instances in the wild with a very high degree of certainty.\nA single modern network security appliance is not sufficient to provide comprehensive\ncoverage against complex malicious tools such as Cobalt Strike. Only a combination of\nsecurity solutions including firewalls, sandboxes, endpoint agents and cloud-based machine\nlearning can integrate the required data to prevent advanced adversaries from mounting\nsuccessful cyberattacks from end to end.\n\nPalo Alto Networks customers receive protection from this kind of attack by the following:\n\n[Next-Generation Firewalls (NGFWs) with](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Threat Prevention signatures 86445 and](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\n86446 can identify HTTP C2 requests with the base64 metadata encoding in default\nprofiles.\n[Next-Generation Firewalls with](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Advanced Threat Prevention subscription can identify](https://docs.paloaltonetworks.com/pan-os/10-2/pan-os-admin/threat-prevention/about-threat-prevention/advanced-threat-prevention)\nand block the Cobalt Strike HTTP C2 request in non default profiles.\n[WildFire, an NGFW security subscription, and](https://www.paloaltonetworks.com/products/secure-the-network/wildfire) [Cortex XDR identify and block Cobalt](https://www.paloaltonetworks.com/cortex/cortex-xdr)\nStrike Beacon.\n[Cortex XSOAR response pack and playbook can automate the mitigation process.](https://xsoar.pan.dev/docs/playbooks/playbooks-overview)\nCortex XDR will report related exploitation attempts.\n[Malicious URLs and IPs have been added to Advanced URL Filtering.](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\n\nIf you think you may have been compromised or have an urgent matter, get in touch with the\n[Unit 42 Incident Response team or call:](http://start.paloaltonetworks.com/contact-unit42.html)\n\n\n-----\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\n## Indicators of Compromise\n\n### CS Samples\n\n50ea11254f184450a7351d407fbb53c54686ce1e62e99c0a41ee7ee3e505d60c\n\n### CS Beacon Samples\n\n/lNj8\n\nSHA256 hash:\n\ne712d670382ad6f837feeb5a66adb2d0f133481b5db854de0dd4636d7e906a8e\n\n### CS Teamserver IP addresses\n\n92[.]255[.]85[.]93\n43[.]129[.]7[.]189\n117[.]50[.]37[.]182\n42[.]192[.]206[.]174\n194[.]37[.]97[.]160\n92[.]222[.]172[.]39\n79[.]141[.]169[.]220\n\n## Additional Resources\n\n[Cobalt Strike Training](https://www.cobaltstrike.com/training)\n\n[Cobalt Strike Malleable C2 Profile](https://www.cobaltstrike.com/help-malleable-c2)\n\n[Cobalt Strike Decryption with Known Private Key](https://blog.nviso.eu/2021/10/21/cobalt-strike-using-known-private-keys-to-decrypt-traffic-part-1/)\n\nCobalt Strike Analysis and Tutorial: How Malleable C2 Profiles Make Cobalt Strike Difficult to\nDetect\n\n[Cobalt Strike Analysis and Tutorial: CS Metadata Encoding and Decoding](https://unit42.paloaltonetworks.com/cobalt-strike-metadata-encoding-decoding/)\n\n[Cobalt Strike Analysis and Tutorial: CS Metadata Encryption and Decryption](https://unit42.paloaltonetworks.com/cobalt-strike-metadata-encryption-decryption/)\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n\n-----\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-03 - Cobalt Strike Analysis and Tutorial- Identifying Beacon Team Servers in the Wild.pdf"
    ],
    "report_names": [
        "2022-11-03 - Cobalt Strike Analysis and Tutorial- Identifying Beacon Team Servers in the Wild.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535944,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1669661948,
    "ts_modification_date": 1669661948,
    "files": {
        "pdf": "https://archive.orkl.eu/b2e8ed523765fc41fe05c54bec3e7bf2ab5e5b0c.pdf",
        "text": "https://archive.orkl.eu/b2e8ed523765fc41fe05c54bec3e7bf2ab5e5b0c.txt",
        "img": "https://archive.orkl.eu/b2e8ed523765fc41fe05c54bec3e7bf2ab5e5b0c.jpg"
    }
}