{
    "id": "c870f6ad-72cc-4ad9-be1f-652f24b6accd",
    "created_at": "2023-01-12T15:08:48.631807Z",
    "updated_at": "2025-03-27T02:05:48.93971Z",
    "deleted_at": null,
    "sha1_hash": "e5955672a0e5a4bfe322fb5457d934056cfb06fa",
    "title": "2018-01-24 - New HNS IoT Botnet Has Already Amassed 14K Bots",
    "authors": "",
    "file_creation_date": "2022-05-27T22:39:08Z",
    "file_modification_date": "2022-05-27T22:39:08Z",
    "file_size": 185746,
    "plain_text": "# New HNS IoT Botnet Has Already Amassed 14K Bots\n\n**[bleepingcomputer.com/news/security/new-hns-iot-botnet-has-already-amassed-14k-bots/](https://www.bleepingcomputer.com/news/security/new-hns-iot-botnet-has-already-amassed-14k-bots/)**\n\nCatalin Cimpanu\n\nBy\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nJanuary 24, 2018\n12:22 PM\n1\n\nA new botnet is growing around the world, feeding off unsecured IoT devices, mainly IP\ncameras, and getting ready to do some harm.\n\nDiscovered by security researchers from Bitdefender, the new botnet is called Hide 'N Seek\n(HNS), and according to experts, the botnet first appeared on January 10, died off for a few\ndays, and came back strong over the weekend, on January 20.\n\nIn all this time, the botnet grew from an initial list of 12 compromised devices to over 14,000\nbots, as of writing.\n\n## Not Mirai related\n\nUnlike all the Internet of Things (IoT) botnets that have appeared in recent weeks, HNS is\nnot another modification of the Mirai IoT malware source code that was leaked online last\nyear.\n\nIn fact, according to Bogdan Botezatu, Bitdefender senior e-threat analyst, the HNS botnet\nis more similar to Hajime rather than Mirai.\n\n\n-----\n\nIt is the second known IoT botnet to date, after the notorious Hajime botnet, that has a\ndecentralized, peer-to-peer architecture,\" Botezatu says. \"However, if in the case of Hajime,\nthe P2P functionality was based on the BitTorrent protocol, here we have a custom-built\nP2P communication mechanism.\"\n\n[According to an analysis Botezatu authored today, each bot contains a list of IPs of other](https://labs.bitdefender.com/2018/01/new-hide-n-seek-iot-botnet-using-custom-built-peer-to-peer-communication-spotted-in-the-wild/)\ninfected bots, a list that can be updated in real-time, as the botnet grows and bots are lost\nor gained.\n\nHNS bots relay instructions and commands from one another, similar to the basics of the\nP2P protocol. Botezatu says an HNS bot can receive and execute several types of\ncommands, such as \"data exfiltration, code execution and interference with a device’s\noperation.\"\n\n## No DDoS function (yet)\n\nSurprisingly, Bitdefender experts did not find a DDoS function, meaning the botnet is\nintended to be deployed as a proxy network, similar to how most IoT botnets have been\nweaponized in the past year after DDoS functions drew too much attention and led to the\ndownfall of many aggressive botnets.\n\nThe botnet spreads via dictionary brute-force attacks against devices with open Telnet\nports. Just like its unique P2P bot management protocol, this spreading mechanism is also\nheavily customized. Botezatu explains below:\n\nThe bot features a worm-like spreading mechanism that randomly generates a list of IP\naddresses to get potential targets. It then initiates a raw socket SYN connection to each\nhost in the list and continues communication with those that answer the request on specific\ndestination ports (23 2323, 80, 8080). Once the connection has been established, the bot\nlooks for a specific banner (“buildroot login:”) presented by the victim. If it gets this login\nbanner, it attempts to log in with a set of predefined credentials. If that fails, the botnet\nattempts a dictionary attack using a hardcoded list.\n\nOnce a session is established with a new victim, the sample will run through a “state\nmachine” to properly identify the target device and select the most suitable compromise\nmethod. For example, if the victim has the same LAN as the bot, the bot sets up TFTP\nserver to allow the victim to download the sample from the bot. If the victim is located on the\ninternet, the bot will attempt a specific remote payload delivery method to get the victim to\ndownload and run the malware sample. These exploitation techniques are preconfigured\nand are located in a memory location that is digitally signed to prevent tampering. This list\ncan be updated remotely and propagated among infected hosts.\nThe good news is that just like all IoT malware, HNS cannot establish persistence on\ninfected devices, meaning the malware is automatically removed with every device reboot.\n\n\n-----\n\nThis makes managing the HNS botnet a 24-hour job, with the botnet needing constant\nsupervision from its creator in order to ensure the botnet continues to add new bots before\nthe old ones die off.\n\n## HNS still under development\n\nIn addition, because it's a new arrival on the IoT malware scene, HNS is also in a state of\nconstant change, as its operator(s) explores new spreading and bot management\ntechniques.\n\nAs many of these \"new\" botnets have had a tendency to disappear after a few weeks, let's\nhope HNS' author gets bored and abandons his \"experiment.\"\n\n[A 14K botnet is nothing to ignore. If we learned anything from the ProxyM botnet is that you](https://www.bleepingcomputer.com/news/security/proxym-botnet-used-as-relay-point-for-sqli-xss-lfi-attacks/)\ndon't need tens of thousands of infected devices to run a profitable botnet. Four-five\nthousands are enough.\n\n### Related Articles:\n\n[Microsoft detects massive surge in Linux XorDDoS malware activity](https://www.bleepingcomputer.com/news/security/microsoft-detects-massive-surge-in-linux-xorddos-malware-activity/)\n\n[Microsoft: Sysrv botnet targets Windows, Linux servers with new exploits](https://www.bleepingcomputer.com/news/security/microsoft-sysrv-botnet-targets-windows-linux-servers-with-new-exploits/)\n\n[New cryptomining malware builds an army of Windows, Linux bots](https://www.bleepingcomputer.com/news/security/new-cryptomining-malware-builds-an-army-of-windows-linux-bots/)\n\n[Emotet botnet switches to 64-bit modules, increases activity](https://www.bleepingcomputer.com/news/security/emotet-botnet-switches-to-64-bit-modules-increases-activity/)\n\n[New stealthy BotenaGo malware variant targets DVR devices](https://www.bleepingcomputer.com/news/security/new-stealthy-botenago-malware-variant-targets-dvr-devices/)\n\n[Botnet](https://www.bleepingcomputer.com/tag/botnet/)\n[IoT](https://www.bleepingcomputer.com/tag/iot/)\n[Malware](https://www.bleepingcomputer.com/tag/malware/)\n\n[Catalin Cimpanu](https://www.bleepingcomputer.com/author/catalin-cimpanu/)\n\nCatalin Cimpanu is the Security News Editor for Bleeping Computer, where he covers topics\nsuch as malware, breaches, vulnerabilities, exploits, hacking news, the Dark Web, and a\nfew more. Catalin previously covered Web & Security news for Softpedia between May\n2015 and October 2016. The easiest way to reach Catalin is via his XMPP/Jabber address\nat campuscodi@xmpp.is. For other contact methods, please visit Catalin's author page.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/software-framework-flaw-affects-apps-from-skype-signal-slack-twitch-others/)\n[Next Article](https://www.bleepingcomputer.com/news/microsoft/microsoft-will-soon-let-users-see-what-telemetry-windows-10-collects/)\n\n### Comments\n\n\n-----\n\n[C0bra - 4 years ago](https://www.bleepingcomputer.com/forums/u/1080699/c0bra/)\n\n14K bots in 2 weeks. Wow. I really hope he gets bored indeed.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-24 - New HNS IoT Botnet Has Already Amassed 14K Bots.pdf"
    ],
    "report_names": [
        "2018-01-24 - New HNS IoT Botnet Has Already Amassed 14K Bots.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653691148,
    "ts_modification_date": 1653691148,
    "files": {
        "pdf": "https://archive.orkl.eu/e5955672a0e5a4bfe322fb5457d934056cfb06fa.pdf",
        "text": "https://archive.orkl.eu/e5955672a0e5a4bfe322fb5457d934056cfb06fa.txt",
        "img": "https://archive.orkl.eu/e5955672a0e5a4bfe322fb5457d934056cfb06fa.jpg"
    }
}