{
    "id": "c87e3fae-97b7-44cd-b66f-9ed99c4e4093",
    "created_at": "2023-01-12T15:03:49.75934Z",
    "updated_at": "2025-03-27T02:16:25.90088Z",
    "deleted_at": null,
    "sha1_hash": "2283b3398282a785bf9de2b70cf202166807b21b",
    "title": "2021-02-26 - New Advanced Android Malware Posing as “System Update”",
    "authors": "",
    "file_creation_date": "2022-05-29T01:37:24Z",
    "file_modification_date": "2022-05-29T01:37:24Z",
    "file_size": 4015131,
    "plain_text": "# New Advanced Android Malware Posing as “System Update”\n\n**[blog.zimperium.com/new-advanced-android-malware-posing-as-system-update/](https://blog.zimperium.com/new-advanced-android-malware-posing-as-system-update/)**\n\nMarch 26, 2021\n\n[March 26, 2021 Aazim Yaswant](https://blog.zimperium.com/author/aazim-bill-se-yaswant/)\n\nAnother week, and another major mobile security risk. A few weeks ago, Zimperium zLabs\nresearchers disclosed unsecured cloud configurations exposing information in thousands of\n[legitimate iOS and Android apps (you can read more about it in our blog). This week, zLabs](https://blog.zimperium.com/unsecured-cloud-configurations-exposing-information-in-thousands-of-mobile-apps/)\nis warning Android users about a sophisticated new malicious app.\n\nThe new malware disguises itself as a System Update application, and is stealing data,\nmessages, images and taking control of Android phones. Once in control, hackers can\nrecord audio and phone calls, take photos, review browser history, access WhatsApp\nmessages, and more (a complete list is below).\n\nThe “System Update” app was identified by zLabs researchers who noticed an Android\n[application being detected by the z9 malware engine powering zIPS on-device detection.](https://www.zimperium.com/zips-mobile-ips)\nFollowing an investigation, we discovered it to be a sophisticated spyware campaign with\ncomplex capabilities. We also confirmed with Google that the app was not and has never\nbeen on Google Play.\n\nIn this blog, we will:\n\n\n-----\n\nCover the capabilities of the spyware;\nDiscuss the techniques used to collect and store data; and\nShow the communication with the C&C server to exfiltrate stolen data.\n\n## What can the malware do?\n\nThe mobile application poses a threat to Android devices by functioning as a Remote\nAccess Trojan (RAT) that receives and executes commands to collect and exfiltrate a wide\nrange of data and perform a wide range of malicious actions, such as:\n\nStealing instant messenger messages;\nStealing instant messenger database files (if root is available);\nInspecting the default browser’s bookmarks and searches;\nInspecting the bookmark and search history from Google Chrome, Mozilla Firefox,\nand Samsung Internet Browser;\nSearching for files with specific extensions (including .pdf, .doc, .docx, and .xls, .xlsx);\nInspecting the clipboard data;\nInspecting the content of the notifications;\nRecording audio;\nRecording phone calls;\nPeriodically take pictures (either through the front or back cameras);\nListing of the installed applications;\nStealing images and videos;\nMonitoring the GPS location;\nStealing SMS messages;\nStealing phone contacts;\nStealing call logs;\nExfiltrating device information (e.g., installed applications, device name, storage\nstats); and\nConcealing its presence by hiding the icon from the device’s drawer/menu.\n\n## How does the malware work?\n\nUpon installation (from a third party store, not Google Play Store), the device gets\nregistered with the Firebase Command and Control (C&C) with details such as the\npresence or absence of WhatsApp, battery percentage, storage stats, the token received\nfrom the Firebase messaging service, and the type of internet connection.\n\nOptions to update the mentioned device information exist as “update” and “refreshAllData,”\nthe difference being, in “update,” the device information alone is being collected and sent to\nC&C, whereas in “refreshAllData,” a new Firebase token is also generated and exfiltrated.\n\n\n-----\n\nThe spyware s functionality and data exfiltration are triggered under multiple conditions,\nsuch as a new contact added, new SMS received or, a new application installed by making\nuse of Android’s contentObserver and Broadcast receivers.\n\nCommands received through the Firebase messaging service initiate actions such as\nrecording of audio from the microphone and exfiltration of data such as SMS messages.\nThe Firebase communication is only used to issue the commands, and a dedicated C&C\nserver is used to collect the stolen data by using a POST request.\n\n\n-----\n\nFigure 1: Code to parse and execute the commands from Firebase C&C (refer to IOCs)\nThe spyware is looking for any activity of interest, such as a phone call, to immediately\nrecord the conversation, collect the updated call log, and then upload the contents to the\nC&C server as an encrypted ZIP file. Determined to leave no traces of its malicious actions,\nthe spyware deletes the files as soon as it receives a “success” response from the C&C\nserver on successfully receiving the uploaded files.\n\nFigure 2: Broadcast receiver declaration in AndroidManifest.xml\nThe collected data is organized into several folders inside the spyware’s private storage,\nlocated at: “/data/data/com.update.system.important/files/files/system/FOLDER_NAME”\nwhere the “FOLDER_NAME” is specified as shown in the following image.\n\n\n-----\n\nFigure 3: Names of folders for storing stolen data in the app’s private directory\nAlong with the command “re” for recording the audio from the microphone, the parameters\nreceived are “from_time” and “to_time,” which is used to schedule an\n_OneTimeWorkRequest job to perform the intended malicious activity. Such usage of job_\nscheduling can be affected by battery optimizations applied on applications by the Android\nOS, due to which, the spyware requests permission to ignore battery optimizations and\nfunction unhindered.\n\nFigure 4: Scheduling a job using parameters from the Firebase C&C\n\n\n-----\n\nFigure 5: Code to prevent battery optimizations on the spyware application\nBeing very concerned about the freshness of the data, the spyware doesn’t use data\ncollected before a fixed period.\n\nFor example, location data is collected either from the GPS or the network (whichever is the\nmore recent) and if this most recent value is more than 5 minutes in the past, it decides to\ncollect and store the location data all over again. The same applies to photos taken using\nthe device’s camera, and the value is set to 40 minutes.\n\nFigure 6: Code to capture a picture using the camera if last taken is at least 40 mins ago\nThe spyware abuses the device’s Accessibility Services (gained from social engineering by\nasking users to enable accessibility services) to collect conversations and message details\nfrom WhatsApp by scraping the content on the screen after detecting the package name of\nthe top window matches WhatsApp (“com.whatsapp”). The collected data is stored within\nan SQLite database with a model, as seen in the images below.\n\nFigures 7: The database models for storing data from Whatsapp\nIn addition to collecting the messages using the Accessibility Services, if root access is\navailable, the spyware steals the WhatsApp database files by copying them from\nWhatsApp’s private storage.\n\nFigure 8: The six files that get copied from the WhatsApp database if root is available\n\n\n-----\n\nThe spyware actively steals the clipboard data by registering clipboard listeners in just the\nsame way as it spies on SMS, GPS location, contacts, call logs, and notifications. The\nlisteners, observers, and broadcasted intents are used to trigger actions such as recording\na phone call and collecting the thumbnails of newly captured images/videos by the victim.\n\nFigure 9: Code to steal data from the clipboard\nThe Android device’s storage is searched for files smaller than 30MB and having file\nextensions from the list of “interesting” types (.pdf, .doc, .docx, .xls, .xlsx, .ppt, .pptx) to be\ncopied to the private directory of the application and encrypted as a folder before exfiltration\nto the C&C server.\n\nFigure 10: Code to search for files with specific extension and size less than 30MB\nAn aggressive capability of the spyware is to access and steal the contents cached and\nstored in the external storage. In an attempt to not exfiltrate all the images/videos, which\ncan usually be quite large, the spyware steals the thumbnails which are much smaller in\nsize. This would also significantly reduce the bandwidth consumption and avoid showing\nany sign of data exfiltration over the internet (assisting in evading detection). When the\nvictim is using Wi-Fi, all the stolen data from all the folders are sent to the C&C, whereas\nwhen the victim is using a mobile data connection, only a specific set of data is sent to\nC&C, as seen in Figure 12.\n\n\n-----\n\nFigure 11, 12: The code to collect thumbnails, and make a list of folders to upload from a\nmobile data connection\nApart from the various types of personal data stolen from the victim, the spyware wants\nmore private data such as the victim’s bookmarks and search history from popular browsers\nlike Google Chrome, Mozilla Firefox, and the Samsung Internet Browser.\n\nFigure 13: The content providers to query bookmarks and searches made by the victim\nTo identify the victim’s device name, the spyware tries to compare the information collected\nfrom the device’s “Build.DEVICE” and “Build.MODEL” with a list of hardcoded values\namounting to a total of 112 device names such as seen below.\n\n\n-----\n\nFigure 14: Snippet of code to identify the device by matching with a list of 112 devices\nThe spyware creates a notification if the device’s screen is off when it receives a command\nusing the Firebase messaging service, as shown in the below images. The “Searching for\n**update..” is not a legitimate notification from the operating system, but the spyware.**\n\nFigure 15, 16: The Fake notification and communication with the C&C server\nThe spyware is capable of performing a wide range of malicious activities to spy on the\nvictim while posing as a “System Update” application. It exhibits a rarely seen before\nfeature, stealing thumbnails of videos and images, in addition to the usage of a combination\nof Firebase and a dedicated Command & Control server for receiving commands and\nexfiltrate data.\n\n\n-----\n\n## IOCs\n\n### Spyware applications:\n\n96de80ed5ff6ac9faa1b3a2b0d67cee8259fda9f6ad79841c341b1c3087e4c92\n\n6301e2673e7495ebdfd34fe51792e97c0ac01221a53219424973d851e7a2ac93\n\n### C&C servers:\n\nhxxps://mypro-b3435.firebaseio.com\n\nhxxps://licences.website/backendNew/public/api/\n\n## To learn more\n\nTo learn more about how Zimperium detects and prevents malware from disrupting\nenterprises globally, [contact us.](https://www.zimperium.com/contact-us)\n\nZimperium [zIPS, powered by Zimperium’s machine learning-based engine, z9, detects this](https://www.zimperium.com/zips-mobile-ips)\nmalware. Additionally, [zIPS with Samsung Knox enables immediate and automated](https://www.zimperium.com/partners/samsung)\nmitigation capabilities.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-26 - New Advanced Android Malware Posing as “System Update”.pdf"
    ],
    "report_names": [
        "2021-02-26 - New Advanced Android Malware Posing as “System Update”.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535829,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653788244,
    "ts_modification_date": 1653788244,
    "files": {
        "pdf": "https://archive.orkl.eu/2283b3398282a785bf9de2b70cf202166807b21b.pdf",
        "text": "https://archive.orkl.eu/2283b3398282a785bf9de2b70cf202166807b21b.txt",
        "img": "https://archive.orkl.eu/2283b3398282a785bf9de2b70cf202166807b21b.jpg"
    }
}