{
    "id": "c8b97b55-8eea-493e-931d-a8a9f70b836c",
    "created_at": "2023-01-12T15:01:31.394132Z",
    "updated_at": "2025-03-27T02:09:07.304614Z",
    "deleted_at": null,
    "sha1_hash": "a1bcd1ca39adcab7ca3ca139666eaee66f771bfa",
    "title": "2022-12-01 - From Macros to No Macros- Continuous Malware Improvements by QakBot",
    "authors": "",
    "file_creation_date": "2022-12-29T00:24:42Z",
    "file_modification_date": "2022-12-29T00:24:42Z",
    "file_size": 6238759,
    "plain_text": "# From Macros to No Macros: Continuous Malware Improvements by QakBot\n\n**[splunk.com/en_us/blog/security/from-macros-to-no-macros-continuous-malware-improvements-by-qakbot.html](https://www.splunk.com/en_us/blog/security/from-macros-to-no-macros-continuous-malware-improvements-by-qakbot.html)**\n\nDecember 1, 2022\n\nBy [Splunk Threat Research Team December](https://www.splunk.com/en_us/blog/author/secmrkt-research.html)\n\n01, 2022\nIn 2007 we saw the initial beginnings and rise of QakBot, the same year when Windows XP\nand Windows Server 2003 were still the primary operating systems in the enterprise.\nQakBot, or QuackBot, made its presence known as a banking trojan and a loader. Over\ntime, it continually developed and became a standard in malicious software circles. Today,\nwe see QakBot used by a varied group of adversaries in a variety of ways, such as\ndeploying ransomware, persistence, and stealing credentials. Before an adversary has\naccess to an endpoint or the ability to move laterally, they have to gain initial access. That\ninitial access vector continues to evolve and keep pace with operating systems, browsers,\nand antivirus vendors to ensure the deliverability of malicious payloads.\n\nIn this blog, the Splunk Threat Research Team (STRT) showcases a year's evolution of\nQakBot. We also dive into a recent change in tradecraft meant to evade security controls.\nLast, we reverse engineered the QakBot loader to showcase some of its functions.\n\n## Introduction\n\nIn [February 2022 Microsoft pushed an update to disable macros by default in Office](https://www.bleepingcomputer.com/news/microsoft/microsoft-starts-blocking-office-macros-by-default-once-again/)\nproducts. A huge win within the industry is to prevent the vast amount of initial access\nvectors into an organization. It wasn’t long before adversaries began to update their\n\n\n-----\n\ntradecraft to use everything except macros. Similar to what was mentioned by Bleeping\n[Computer in February, DarkReading mentioned in this article, the change went to HTML](https://www.darkreading.com/endpoint/post-macro-world-container-files-distribute-malware-replacement)\nApplications (.hta) and was very successful. Over time, we began to hear of Mark-of-theWeb (MOTW) bypasses. Windows MOTW is a simple feature in the OS that labels items\n[and scrutinizes them as they are downloaded. As outlined by Outflank in 2020, the role of](https://outflank.nl/blog/2020/03/30/mark-of-the-web-from-a-red-teams-perspective/)\nMOTW in security measures is used by Windows SmartScreen, and Protected view\nsandbox in Excel and Word, to name a few. How does an adversary bypass these controls?\nSome downloaded files do not get scrutinized, therefore evading MOTW and allowing for\nprocess execution. One popular format that we see today includes the delivery of ISO files\nwithin an HTML file. Most containers, like ISO or VHDX, are not scrutinized by MOTW.\n\n_Want to simulate Mark of the Web Bypasses? Check out Atomic Red Team_ _[T1553.005.](https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.005/T1553.005.md)_\n\nBelow is a timeline of changes from June to October. Proxylife monitors and tracks QakBot\ncampaigns and daily shares the indicators for each campaign. We began looking at how\nQakBot operated in June, four months after Microsoft disabled macros, and we can see the\npattern of using .html files with embedded zip, and img files.\n\nThe simple flow chart below shows the basic infection flow of this QakBot sample.\n\nTo follow this evolution we monitor Proxylife as well as other sources (Proxylife monitors\nQakbot’s evolution and shares campaign indicators).\n\nBased on this and other sources, below is a timeline of changes from June to October\ncaptured by Proxylife updates. We began looking at how QakBot operated in June, four\nmonths after Microsoft disabled macros, and we can see the pattern of using .html files with\nembedded zip and img files.\n\n\n-----\n\nImmediately following, we see that on June 13, 2022 the campaign changed to using HTML\nsmuggling with an embedded ZIP+.LNK file. Adversaries change their tradecraft frequently\nwhen attempting to see what sticks as far as evasion goes, and this is a great view into that.\n\n_Reference_ _[tweet](https://twitter.com/pr0xylife/status/1536386977863442432?s=20&t=fSjHaanAd6CHJhqB3g2mFw)_\n\nJumping forward three months, we can see the more widespread use of HTML smuggling\nwith ZIP and ISO attachments. In this particular sample, the .LNK will execute a javascript\nfile that loads the .cmd (batch script) to continue on.\n\n_Reference_ _[tweet](https://twitter.com/pr0xylife/status/1575165550254526465?s=20&t=fSjHaanAd6CHJhqB3g2mFw)_\n\nWhile reviewing the QakBot samples outlined above, we found a particularly distinct sample\nthat was being utilized. Once we began digging into the HTML we noticed that it had\nevasive techniques built in that piqued our interest. We found that [ProxyLife had shared this](https://twitter.com/pr0xylife/status/1585364758836150272?s=20&t=qi-rUq0r5uLI9QhEXCNPWQ)\nsample on Twitter, along with the other campaigns that utilized HTML smuggling, along with\na password-protected zip that contained the ISO.\n\n\n-----\n\n-----\n\n_Reference_ _[tweet](https://twitter.com/pr0xylife/status/1585364758836150272?s=20&t=qi-rUq0r5uLI9QhEXCNPWQ)_\n\nWhat we don’t see here is the functionality being used to evade controls. It’s easy to say\n“HTML smuggling” or “ISO containers”, but what is the core behavior underneath it all that is\nmaking each of these different?\n\nReverse Base64 html file (2nd stage)\n2nd stage contained embedded password protected zip file\nISO file contained within Zip, including LNK and QakBot loader\n\nWe will explore this sample and showcase everything in more detail.\n\n### HTML smuggling\n\nThis has become the de facto standard for the delivery of malicious payloads as of late.\nWhat is HTML smuggling? As defined by MITRE ATT&CK [T1027.006, “HTML documents](https://attack.mitre.org/techniques/T1027/006/)\ncan store large binary objects known as JavaScript blobs (immutable data that represents\nraw bytes) that can later be constructed into file-like objects. Data may also be stored in\nData URLs, which enable embedding media type or MIME files inline of HTML documents.”\n\nBelow we showcase two ways to view these campaigns, one from the victim perspective\nand the other from within the code.\n\n**Victim Perspective**\n\n\n-----\n\nFor the end user, this particular sample requires the downloading and opening of the HTML\nfile. Once opened, the attachment.zip saves to disk, and the end user must now enter the\npassword to decrypt the contents. Once decrypted, mount the ISO (by double-clicking) and\nfinally click the A.LNK file.\n\n**View Within Code**\n\n\n-----\n\n_[(For a larger resolution of this diagram visit this link)](https://imgur.com/a/Bl7esEB)_\n\n**Stage 1 HTML**\n\nThis HTML file contains a reversed base64 encoded string initialized in div id =\n**“MS860aTc” which contains the stage 2 javascript. To be able to execute this stage 2**\njavascript, it creates an HTML element with the tag “embed” that will be appended to the\ncode body of this HTML using “document.body.appendChild(element)”. The width and\nheight frame properties of the “embed” element are also hidden (value = 1) to hide the\nstage 2 javascript execution from the user.\n\nFigure 1 is the screenshot of the main code of the stage 1 HTML file with annotations\n\n\n-----\n\n_Figure 1_\n\n**Stage2 HTML File**\n\nThe stage 2 HTML contains javascript that will decode a base64 encoded (password\nprotected) zip file initialized in variable “gdhpoIyu”. After decoding, it will try to convert the\ndecoded base64 data into an unsigned integer byte array that will be used to create a blob\n[file object as a ZIP file. Then it will use a javascript static method URL.CreateObjectURL](https://developer.mozilla.org/en-US/docs/Web/API/URL/createObjectURL)\nwith the new blob file object as a parameter that will be loaded using the\n[windows.location.assign() method.](https://developer.mozilla.org/en-US/docs/Web/API/Location/assign)\n\nFigure 2 shows the stage 2 HTML javascript code and the portion of the base64 encoded\nzip file that contains the malicious ISO file.\n\n\n-----\n\n_Figure 2_\n\nFigure 3 shows the effect of the stage 2 HTML file as you run the main HTML (stage 1).\nNotice that it automatically dropped the zip file in the compromised host.\n\n_Figure 3_\n\n**ISO File**\n\n\n-----\n\nOnce the ZIP is extracted and decrypted using the password PG1, we will be able to get\nthe “A7490.iso” that contains an A.LNK file and a hidden tools folder.\n\nHidden Folder Contents\n\nWithin the hidden tools folder is protracted.cmd (bat file) and the malicious bucketfuls.dat\n(.dll) that will be loaded.\n\n**LNK and Batch Script**\n\nTo the victim, the .LNK will be the only thing inside the ISO as the tools directory is hidden.\n\nBelow is the breakdown of the two files which showcases how the adversary attempts to\nevade detection.\n\nLNK\n\nWithin the LNK it gives away the .cmd file that will run from within the hidden tools directory\n```\n C:\\Windows\\System32\\cmd.exe /c tools\\protracted.cmd re\n gs v\n\n```\n\n-----\n\nNote the re gs and v arguments, at first glance it doesn’t make sense and seems out of\nplace until we look at the .cmd file.\n\n_Figure 4_\n\nThe .cmd file uses a few tricks to evade controls. First, lines 4-7 are using set, which will\n_set_ environment variables for the different strings. On line 6 we see the % symbols, which\nare passed in from the LNK file (re gs v) to complete the regsvr32.exe process name.\n\nLine 9 will set “copy” as a variable. The final call on line 16 will now look like this:\n```\n copy %systemroot%\\system32\\regsvr32.exe\n %temp%\\envelopingConcussion.com\n\n\n```\nThis will copy regsvr32.exe from system32 to the \\appdata\\local\\temp directory and rename\nregsvr32.exe to envelopingConcussion.com.\n\nNow, envelopingConcussion.com will run tools\\bucketfuls.dat.\n\nIn Splunk:\n\n_Figure 5_\n\nNow we will switch gears and dive into the different QakBot capabilities found within the\nDLL that gets loaded.\n\n\n-----\n\n### System Owner/User Discovery\n\nFigure 6 is a screenshot of QakBot code that will execute several Windows commands to\ncollect system and network information that will be sent to the remote C2 server.\n\n_Figure 6_\n\nThe table below is the complete list of the Windows commands that it will execute on the\ncompromised host.\n\n### Table 1\n\n**Command** **Description**\n\nipconfig /all List all TCP/IP network configuration\n\n\nnslookup -querytype=ALL timeout=12\n_ldap._tcp.dc._msdcs.%s\n\n\nQuery SRV records of the domain from the main DNS\nrecord of the compromised host (%s is the domain\nname)\n\n\n-----\n\nnltest /domain_trusts /all_trusts Enumerate domain trusts\n\nnet localgroup Get local groups information\n\nqwinsta Displays information about sessions on a Remote\nDesktop Session Host server.\n\nroute print Get route information\n\narp -a Get ARP information\n\ncmd /c set Get environment variables\n\nwhoami /all Get user, group, and privilege information of the\ncompromised host\n\nnetstat -nao Get the active network connections in the compromised\nhost\n\nnet view Displays a list of domains, computers, or resources that\nare being shared by the specified computer.\n\nnet share Displays information about all of the resources that are\nshared on the local computer\n\nThis event can be seen using the Sysmon event logs in Splunk. Figure 7 shows how the\nQakBot malware injected in the wermgr.exe process executes the following Windows\nnative commands that we’ve listed in the above table.\n\n\n-----\n\n_Figure 7_\n\nAs part of this Tactic, it will also execute several WMI query commands to gain more system\ninformation about the compromised host. Table 2 shows the list of WMI classes it uses in its\nWMI query to collect more information.\n\n### Table 2\n\n**WMI Class** **Description**\n\nWin32_ComputerSystem System Information (AdminPasswordStatus, Model, Name,\nManufacturer and many more)\n\nWin32_Bios BIOS information (e.g BIOSVersion, PrimaryBIOS,\nserialNumber)\n\nWin32_Product Product and software information\n\n\n-----\n\nWin32_PhysicalMemory Physical RAM information\n\nWin32_DiskDrive Hard disk information like the partition, free size, model.\n\nWin32_Processor CPU processor information\n\nWin32_OperatingSystem OS information\n\n\nSELECT * FROM\nantivirusProduct\n\n\nList all antivirus Products Installed in Windows OS.\n\n\nAdditionally, it will also make Windows API calls to get the computer name, system metrics,\nActive Directory domain status, system info, all processes and its modules, windows\narchitecture (x32/x64), and OS version.\n\nFigure 8 shows a code snippet of how it gets the computer name and the volume\ninformation of the compromised host.\n\n_Figure 8_\n\n\n-----\n\nFigure 9 shows the short code snippet of how it sets up and executes the WMI command\nlisted in the table above to perform system discovery on the compromised host.\n\n_Figure 9_\n\n### Persistence\n\nQakBot will also create a registry run key entry or Scheduled Task to execute itself upon the\nreboot of the compromised host. Figure 10 shows the code snippet of this sample that\ncreates scheduled tasks or creates registry run keys.\n\n\n-----\n\n_Figure 10_\n\nWe also saw a function in its code capable of creating services for its malicious code to gain\nprivileges or persist on the target host machine. Unfortunately, this TTP was not triggered\nduring our testing. Figure 11 is a screenshot of how it registers a service control handler for\nits file.\n\n_Figure 11_\n\n### Execution\n\nThis QakBot sample can execute the dropped .DLL copy of itself or a .DLL plugin\ndownloaded from its Command and Control (C2) server using several techniques available\nin Windows Operating System such as Living on The Land Application (LOLBIN) or\n\n\n-----\n\nthrough scripts.\n\nFigure 12 shows how it uses the WMI command in .VBScript to copy files.\n\n_Figure 12_\n\nBelow is a short table of commands we saw during our analysis for its Execution Tactics\n\n### Table 3\n\n**Command** **Description**\n\nRegsvr32.exe <dll_file_path> Execute dropped randomly\ngenerated DLL file name using\nregsvr32.exe.\n\nRundll32.exe <dll_file_path> Execute dropped randomly\ngenerated DLL file name using\nrundll32.exe.\n\n\n-----\n\nSet objWMIService = GetObject(\"winmgmts:\" & \"\n{impersonationLevel=impersonate}!\\\\.\\%coot\\cimv2\")\n\nSet objProcess =\nGetObject(\"winmgmts:root\\cimv2:Win32_Process\")\n\nerrReturn = objProcess.Create(\"%s\", null, nul, nul)\n\n\nExecute a process using a WMI\nobject in VBScript.\n\n\n“runas” Shellexecute a command line with\n“runas “ parameter to gain admin\nprivileges in its execution\n\nPowershell.exe -encodedCommand Execute a base64 encoded\nPowerShell script\n\n\nWmic process call create expand <lolbin>\n<dll_file_path>\n\n\nExecute its dropped DLL copy of\nitself or .dll component using\nWMIC in a batch script.\n\nE.g Wmic process call creates\nexpand regsvr32.exe\n<dll_file_path>\n\n\n### Defense Evasion, Privilege Escalation - Process Injection\n\nWhen The .DLL stager or the .DLL loader is executed by the .batch script inside the .ISO\nfile using regsvr32.exe, It will inject its malicious code to a legitimate Windows OS process\nto perform defense evasion.\n\nFigure 13 shows the code and how it creates a suspended process (the wermgr.exe) as the\nfirst step of the [process hollowing technique.](https://attack.mitre.org/techniques/T1055/012/)\n\n_Figure 13_\n\nAfter creating a suspended process, it will create a new section on that process that can fit\nits QakBot .DLL code. Then, it will map and allocate memory pages on that section and\nwrite its malicious code on that mapped section using WriteProcessMemory() API. Figure\n\n\n-----\n\n13.1 is the code snippet of this process.\n\n_Figure 13.1_\n\nBelow is the list of possible processes where it can inject the QakBot core .DLL during its\nexecutions:\n\n%SystemRoot%\\SysWOW64\\OneDriveSetup.exe\n%SystemRoot%\\SysWOW64\\dxdiag.exe\n%SystemRoot%\\SysWOW64\\explorer.exe\n%SystemRoot%\\SysWOW64\\mobsync.exe\n%SystemRoot%\\SysWOW64\\msra.exe\n%SystemRoot%\\SysWOW64\\wermgr.exe\n%SystemRoot%\\SysWOW64\\xwizard.exe\n%SystemRoot%\\System32\\OneDriveSetup.exe\n%SystemRoot%\\System32\\dxdiag.exe\n%SystemRoot%\\System32\\mobsync.exe\n%SystemRoot%\\System32\\msra.exe\n%SystemRoot%\\System32\\wermgr.exe\n%SystemRoot%\\System32\\xwizard.exe\n%SystemRoot%\\explorer.exe\n\n\n-----\n\n### Anti-Analysis and Anti-Debugging\n\nAside from Process Injections, it also has several functions that check if it is being\ndebugged, being run in a sandbox, or being analyzed in a research lab.\n\nThis QakBot variant has 2 conditions that serve as a killswitch for its execution.\n\n1. It checks if the file “C:\\INTERNAL\\__empty” exists. This file can be used to check the\n\nexistence of Windows Defender emulation. If this file exists it will right away return 0\nthat will exit its code execution.\n2. The second one is checking the environment variable “SELF_TEST_1”. If this\n\nenvironment variable exists it will exit the process.\n\nFigure 14 shows the screenshots of its code that checks the following killswitch\n\n_Figure 14_\n\nFigure 15 shows its code snippet and how it checks if its code is being debugged using the\n[Process Environment Block Structure. If the BeingDebugged flag is True, it will xor encrypt](https://en.wikipedia.org/wiki/Process_Environment_Block#:~:text=In%20computing%20the%20Process%20Environment,other%20than%20the%20operating%20system.)\nthe 2 decryption key tables in addresses 0x1001E16B0 and 0x1001E050 then exit its\nprocess.\n\n_Figure 15_\n\nIt also enumerates all the running processes on the compromised host and checks if one of\nthose processes is on the list below (Table 4) which is related to security, malware analysis\ntools, and sandbox.\n\n\n-----\n\n### Table 4\n\nfrida-winjector-helper-32.exe\nfrida-winjector-helper-64.exe\ntcpdump.exe\nwindump.exe\nethereal.exe\nwireshark.exe\nettercap.exe\nrtsniff.exe\npacketcapture.exe\ncapturenet.exe\nResourceHacker.exe\nsniff_hit.exe\n\n\nqak_proxy\ndumpcap.exe\nCFF Explorer.exe\nnot_rundll32.exe\nProcessHacker.exe\ntcpview.exe\nfilemon.exe\nprocmon.exe\nidaq64.exe\nloaddll32.exe\n\n\nPETools.exe\nImportREC.exe\nLordPE.exe\nSysInspector.exe\nproc_analyzer.exe\nsysAnalyzer.exe\nsniff_hit.exe\njoeboxcontrol.exe\njoeboxserver.exe\nx64dbg.exe\nFiddler.exe\nsysAnalyzer.exe\n\n\nIt also has a list of processes it checks (Table 5) related to antivirus products such as AVG,\nDr. Web, Fortinet, TrendMicro, F-Secure, ByteFence Anti-Malware, BitDefender, Avast,\nWindows Defender, Comodo Internet Security and ESET.\n\n### Table 5\n\n\navgcsrvx.exe\navgsvcx.exe\navgcsrva.exe\ndwengine.exe\ndwarkdaemon.exe\ndwwatcher.exe\nfmon.exe\ncoreServiceShell.exe\nPccNTMon.exe\nNTRTScan.exe\nbdagent.exe\n\n\nvsserv.exe\nvsservppl.exe\nAvastSvc.exe\nmcshield.exe\nMsMpEng.exe\nvkise.exe\nisesrv.exe\ncmdagent.exe\negui.exe\nekrn.exe\nfshoster32.exe\nByteFence.exe\n\n\nIt also checks antivirus .DLL’s component if it is loaded on the compromised host. Figure 16\nshows the function that checks if the Avast module (awshooka.dll and aswhookx.dll) is\ninstalled or running on the compromised host.\n\n\n-----\n\n_Figure 16_\n\n### Command and Control (C2)\n\nThis malware is capable of communicating to its C2 server to send the collected data in the\ncompromised Windows OS and also to download configuration files, plugins, or other\nmalware.\n\nFigure 17 shows the code snippet that contains a function renamed as\n“mw_internet_crack_send_request” that will send a request to its C2 using\n[HttpSendRequestA() API. Then it will be followed by another function that will read the reply](https://learn.microsoft.com/en-us/windows/win32/api/wininet/nf-wininet-httpsendrequesta)\nfrom the HTTP Request and save it to a file that could be either a configuration file or other\nmalware to be executed in the target or compromised host.\n\n\n-----\n\n_Figure 17_\n\nThis malware also uses a named pipe to communicate to its other process running on the\ncompromised host. Figure 18 is a code snippet showing how it creates named pipes and\nreads data or files sent or transferred on that randomly generated named pipe.\n\n_Figure 18_\n\nFigure 19 shows how Sysmon Event=17, 18 (CreateNamedPipe And ConnectNamedPipe)\ncaptured the creation and connection of the injected QakBot in legitimate wermgr.exe\nprocess to its randomly generated named pipe.\n\n\n-----\n\n```\n sysmon EventCode IN (17, 18) Image  \\\\wermgr.exe EventType IN ( CreatePipe,\n\"ConnectPipe\")\n\n| stats min(_time) as firstTime max(_time) as lastTime count by Image EventType\nProcessGuid ProcessId PipeName SecurityID EventCode Computer UserID\n\n| `security_content_ctime(firstTime)`\n\n| `security_content_ctime(lastTime)`\n\n```\n_Figure 19_\n\nIn addition to all this, we are also sharing the decrypted data section of this QakBot variant\nthat contains more TTPs.\n\n[https://gist.github.com/tccontre/360dbda059562b67b983d58ae70ac371](https://gist.github.com/tccontre/360dbda059562b67b983d58ae70ac371)\n\nAs defenders, it doesn’t end here. QakBot and other frameworks will continue to improve,\nevading next-generation controls in place. We must continue to dissolve these loaders into\ntheir smallest form and share with the greater security community their tradecraft to help\neveryone defend their organization.\n\n## Automate with Splunk SOAR Playbooks\n\nAll of the previously listed detections create entries in the risk index by default, and can be\n[used seamlessly with risk notables and the Risk Notable Playbook Pack. The community](https://docs.splunk.com/Documentation/ESSOC/3.52.0/user/Useplaybookpack)\nSplunk SOAR playbooks below can be used in conjunction with some of the previously\ndescribed analytics:\n\n**Playbook** **Description**\n\n\nInternal\nHost\nWinRM\nInvestigate\n\n\nThis playbook performs a general investigation on key aspects of a windows\ndevice using windows remote management. Important files related to the\nendpoint are generated, bundled into a zip, and copied to the container\nvault.\n\n\n-----\n\nBlock\nIndicators\n\nInternal\nHost\nWinRM\nResponse\n\n## Detection\n\n\nThis playbook retrieves IP addresses, domains, and file hashes, blocks\nthem on various services, and adds them to specific blocklists as custom\nlists.\n\nThis playbook accepts a list of hosts and filenames to remediate on the\nendpoint. If filenames are provided, the endpoints will be searched and then\nthe user can approve deletion. Then the user is prompted to quarantine the\nendpoint.\n\n\nSplunk Threat Research Team has curated new and old analytics and tagged them to the\n[QakBot Analytic Story to help security analysts detect adversaries leveraging the QakBot](https://research.splunk.com/stories/qakbot/)\nmalware. This analytic story introduces 43 detections across MITRE ATT&CK techniques.\n\nFor this release, we used and considered the relevant data endpoint telemetry sources\nsuch as:\n\nProcess Execution & Command Line Logging\nWindows Security Event Id 4688, Sysmon, or any Common Information Model\ncompliant EDR technology.\nWindows Security Event Log\nWindows System Event Log\n\n## Why Should You Care?\n\nWith this article the Splunk Threat Research Team (STRT) enables security analysts, blue\n[teamers and Splunk customers to identify one of the CISA TOP malware strains . This](https://www.cisa.gov/uscert/ncas/alerts/aa22-216a)\narticle helps the community discover QakBot tactics, techniques and procedures. By\nunderstanding QakBot behaviors, we were able to generate telemetry and datasets to\ndevelop and test Splunk detection analytics designed to defend and respond against this\nthreat.\n\n## Learn More\n\n[You can find the latest content about security analytic stories on GitHub and in Splunkbase.](https://github.com/splunk/security-content/releases/tag/v3.12.0)\n[Splunk Security Essentials also has all of these detections available now.](https://splunkbase.splunk.com/app/3435/)\n\nFor a full list of security content, check out the [release notes on](https://docs.splunk.com/Documentation/ESSOC/3.21.0/RN/Enhancements) [Splunk Docs.](https://docs.splunk.com/Documentation/ESSOC)\n\n## Feedback\n\n\n-----\n\nAny feedback or requests? Feel free to put in an issue on GitHub and we ll follow up.\nAlternatively, join us on the [Slack channel #security-research. Follow these instructions if](https://splunk-usergroups.slack.com/)\nyou need an invitation to our Splunk user groups on Slack.\n\n## Contributors\n\n_[We would like to thank the authors Teoderick Contreras,](https://twitter.com/tccontre18)_ _[Michael Haag and collaborators](https://twitter.com/M_haggis)_\n_Lou Stella, Mauricio Velazco, Rod Soto, Jose Hernandez, Patrick Bareiss, Bhavin Patel,_\n_and Eric McGinnis for their contributions to this post._\n\n_[We would like to extend a huge thank you to @proxylife for sharing his research and this](https://twitter.com/pr0xylife)_\n_malware sample that helped the STRT produce this analysis._\n\nPosted by\n\n**[Splunk Threat Research Team](https://www.splunk.com/en_us/blog/author/secmrkt-research.html)**\n\nThe Splunk Threat Research Team is an active part of a customer’s overall defense\nstrategy by enhancing Splunk security offerings with verified research and security content\nsuch as use cases, detection searches, and playbooks. We help security teams around the\nglobe strengthen operations by providing tactical guidance and insights to detect,\ninvestigate and respond against the latest threats. The Splunk Threat Research Team\nfocuses on understanding how threats, actors, and vulnerabilities work, and the team\n[replicates attacks which are stored as datasets in the Attack Data repository.](https://github.com/splunk/attack_data/)\n\nOur goal is to provide security teams with research they can leverage in their day to day\noperations and to become the industry standard for SIEM detections. We are a team of\n\n\n-----\n\nindustry-recognized experts who are encouraged to improve the security industry by\nsharing our work with the community via conference talks, open-sourcing projects, and\nwriting white papers or blogs. You will also find us presenting our research at conferences\nsuch as Defcon, Blackhat, RSA, and many more.\n\n[Read more Splunk Security Content.](https://github.com/splunk/security_content)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-01 - From Macros to No Macros- Continuous Malware Improvements by QakBot.pdf"
    ],
    "report_names": [
        "2022-12-01 - From Macros to No Macros- Continuous Malware Improvements by QakBot.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535691,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1672273482,
    "ts_modification_date": 1672273482,
    "files": {
        "pdf": "https://archive.orkl.eu/a1bcd1ca39adcab7ca3ca139666eaee66f771bfa.pdf",
        "text": "https://archive.orkl.eu/a1bcd1ca39adcab7ca3ca139666eaee66f771bfa.txt",
        "img": "https://archive.orkl.eu/a1bcd1ca39adcab7ca3ca139666eaee66f771bfa.jpg"
    }
}