{
    "id": "c8c6914b-5bb6-4291-8acd-97d91913d1bb",
    "created_at": "2023-01-12T15:04:48.319096Z",
    "updated_at": "2025-03-27T02:13:25.950774Z",
    "deleted_at": null,
    "sha1_hash": "bfe5c70c764e5b163b86608894f8c50ce21666da",
    "title": "2022-02-25 - Disruptive HermeticWiper Attacks Targeting Ukrainian Organizations",
    "authors": "",
    "file_creation_date": "2022-05-28T18:17:28Z",
    "file_modification_date": "2022-05-28T18:17:28Z",
    "file_size": 903731,
    "plain_text": "# Disruptive HermeticWiper Attacks Targeting Ukrainian Organizations\n\n**[secureworks.com/blog/disruptive-hermeticwiper-attacks-targeting-ukrainian-organizations](https://www.secureworks.com/blog/disruptive-hermeticwiper-attacks-targeting-ukrainian-organizations)**\n\nCounter Threat Unit Research Team\n\n_Prior to the Russian military invasion, Ukrainian government and financial organizations were_\n_impacted by distributed denial of service and wiper attacks. Friday, February 25, 2022 By:_\n_Counter Threat Unit Research Team_\n\n\n-----\n\nSecureworks® Counter Threat Unit™ (CTU) researchers are investigating reports of\ndisruptive activity that began targeting organizations in Ukraine on February 23, 2022. This\nactivity mirrors attacks that occurred on January 13 and 14, 2022. Distributed denial of\n[service (DDoS) attacks on February 23 reportedly caused intermittent loss of access to](https://twitter.com/netblocks/status/1496498930925940738)\ngovernment websites belonging to the Ukrainian Ministry of Foreign Affairs, Ministry of\nDefense, Security Service, Ministry of Internal Affairs, and Cabinet of Ministers. PrivatBank\n[and Oschadbank, which were targeted in DDoS attacks on February 15, were again](https://twitter.com/netblocks/status/1496507307756339206)\nsubjected to DDoS activity on February 23.\n\nAt approximately the same time as the DDoS attacks, threat actors deployed a novel wiper to\na small number of government and financial organizations in Ukraine. An antivirus vendor\n[observed the first samples in its telemetry at 14:52 UTC (16:52 local time in Ukraine). These](https://twitter.com/ESETresearch/status/1496581904916754435)\ndisruptive events preceded the February 24 Russian military invasion of Ukraine. The wiper's\n[primary function is data destruction.](https://attack.mitre.org/techniques/T1485/)\n\n[The wiper has been dubbed HermeticWiper based on the \"Hermetica Digital Ltd\" company](https://twitter.com/ESETresearch/status/1496614321442459655)\nname used in the malware's signing certificate (see Figure 1). It is unclear how the threat\nactors obtained this certificate.\n\n_Figure 1. HermeticWiper signed with valid 'Hermetic Digital Ltd' code-signing certificate._\n_(Source: Secureworks)_\n\nHermeticWiper abuses a legitimate EaseUS partition management driver. This approach is\nsimilar to the Iranian Shamoon and North Korean DarkSeoul wipers, which abused the ElDos\nRaw Disk driver to obtain access to low-level disk functions.\n\nBefore starting the EaseUS driver, HermeticWiper modifies several registry keys. One\nmodification disables crash dumps by setting\nHKLM\\SYSTEM\\ControlSet001\\Control\\CrashControl\\CrashDumpEnabled to 0. This change\nis likely to reduce forensic artifacts if the malware causes the system to stop unexpectedly.\n\n\n-----\n\nHermeticWiper deploys a signed driver with the internal filename empntdrv.sys to the\ninfected system. This benign driver is signed by a certificate issued to CHENG DU YIWO\nTech Development Co., Ltd. (see Figure 2). This Chinese company develops the EaseUS\nPartition Master software and specializes in data backup and security.\n\n_Figure 2. Legitimate signed driver deployed by HermeticWiper. (Source: Secureworks)_\n\nThe malware contains driver copies for multiple operating system versions and architecture\nas ms-compressed resources. Most of the 114KB HermeticWiper binary is consumed by\nthese resource files. The malware deploys the appropriate driver depending on the system\nbeing infected.\n\nHermeticWiper installs the EaseUS driver using a four-character filename. This filename is\ngenerated using the current process ID, which results in a pseudorandom string (e.g.,\nC:\\Windows\\sysnative\\drivers\\njdr.sys). The malware disables the volume shadow copy\nservice to hinder recovery attempts. This tactic is commonly used by ransomware\ndevelopers.\n\nHermeticWiper corrupts the master boot record (MBR), overwrites files in specific system\nlocations, and modifies partition information. To corrupt the MBR, it enumerates each of the\nphysical disks, iterating through \\??\\PhysicalDrive0 to \\??\\PhysicalDrive100, and then\noverwrites the first 512 bytes. These bytes contain the MBR.\n\n[The malware uses the EaseUS driver to perform destructive operations, opening a handle to](https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntifs/nf-ntifs-ntcreatefile)\nthe physical disk before overwriting it with randomly generated data. The handle is obtained\nvia \\\\EPMNTDRV\\%u, where %u is replaced with the physical disk number. SetFilePointerEx\nis then used to locate the data to be overwritten, and WriteFile is used to overwrite the\ncontent with randomly generated data (see Figure 3).\n\n\n-----\n\n_Figure 3. HermeticWiper routine overwrites data. (Source: Secureworks)_\n\nThe malware also overwrites files under the following paths:\n\nC:\\Documents and Settings\\\nC:\\System Volume Information\\\nC:\\Windows\\SYSVOL\\\nC:\\Windows\\System32\\winevt\\Logs\n\n[Finally, it determines if the partition's file system is File Allocation Table (FAT) or New](https://en.wikipedia.org/wiki/File_Allocation_Table)\n[Technology File System (NTFS) and attempts to corrupt the partition using a method](https://en.wikipedia.org/wiki/NTFS)\nappropriate for that type. Once execution is complete, the system is forced to shut down.\n\nHermeticWiper generates random data to overwrite files and partition tables (e.g., the MBR)\n[but does not appear to encrypt files. Unlike WhisperGate, HermeticWiper does not attempt to](https://www.secureworks.com/blog/whispergate-not-notpetya)\nmasquerade as ransomware and does not display a fake ransom note when the system is\nbooted. CTU™ analysis did not reveal a network-based command and control (C2) or\npropagation mechanism within the binary.\n\nWhile the DDoS and wiper attacks were being conducted, additional disruptive cyber activity\nwas occurring in Ukraine. On February 23, CTU researchers observed website defacements\naffecting at least 13 Ukrainian government entities, most of them under Ukraine's Ministry of\nSocial Policy. The defacement image is nearly identical to the ransomware-like image used\nduring the January 14 attacks impacting a range of Ukrainian government sites. Both images\ninclude anti-Ukrainian icons, warn readers of data destruction, and describe leaks of\n\n\n-----\n\npersonal data (see Figure 4). Unlike the January defacement image, the February image file\ndoes not contain geolocation or timestamp metadata that CTU researchers believe were\nfalse flags intended to confuse attribution.\n\n_Figure 4. February 23 defacement closely resembles January 14 image. (Source:_\n_Secureworks)_\n\nThe February 23 image includes links to a Tor site operated by \"Free Civilian,\" a group\noffering to sell sets of stolen personal data belonging to Ukrainian citizens (see Figure 5).\nCTU researchers are unable to confirm if this group possesses citizens' data or if any sales\nhave occurred. The \"*NEW* New leaks\" section of the Free Civilian site lists fifty Ukrainian\ngovernment websites from which confidential data has purportedly been taken and will be\npublished. On February 23, thirteen of the sites in the list displayed the latest defacement\nimage. As of February 24, only one website was still defaced.\n\n\n-----\n\n_Figure 5. 'Free Civilian' Tor site claiming leaks of Ukrainian citizens' personal data. (Source:_\n_Secureworks)_\n\nA \"FreeCivilian\" account created on the RaidForums underground forum in late January\nclaimed to have a database of sensitive personal information for over two million Ukrainian\ncitizens. This list was purportedly obtained from the Ministry of Digital Transformation of\nUkraine (DIIA), a government portal that handles passports, driver's licenses, and military\ncards. The Tox messaging ID in that post and on the \"Free Civilian\" website are identical.\nUkrainian officials dismissed FreeCivilian's claim as a scam designed to undermine trust in\nthe Ukrainian government. The \"FreeCivilian\" RaidForums account has since been banned.\n\nOn February 18, the Computer Emergency Response Team of Ukraine (CERT-UA) warned\nof possible cyberattacks on February 22 based on threats posted to RaidForums by another\npersona named \"Carzita.\" As of this publication, it is unclear if the Carzita and FreeCivilian\nRaidForums accounts are associated. However, it is likely that the February website\ndefacements and threats of data leaks were intended to cause panic and coincide with the\nDDoS and wiper attacks.\n\nCTU researchers do not expect widespread repeated use of HermeticWiper outside of\nUkraine. However, due to the invasion of Ukraine by Russian forces on February 24,\ncyberattacks will likely continue to play a significant supporting role to conventional military\nattacks.\n\nTo mitigate exposure to this malware, CTU researchers recommend that organizations use\navailable controls to review and restrict access using the indicators listed in Table 1.\n\n**Indicator** **Type** **Context**\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n84ba0197920fd3e2b7dfa719fee09d2f MD5 hash HermeticWiper\nmalware\n\n912342f1c840a42f6b74132f8a7c4ffe7d40fb77 SHA1 hash HermeticWiper\nmalware\n\n\n0385eeab00e946a302b24a91dea4187c1210597b\n8e17cd9e2230450f5ece21da\n\n\nSHA256\nhash\n\n\nHermeticWiper\nmalware\n\n\n3f4a16b29f2f0532b7ce3e7656799125 MD5 hash HermeticWiper\nmalware\n\n61b25d11392172e587d8da3045812a66c3385451 SHA1 hash HermeticWiper\nmalware\n\n\n1bc44eef75779e3ca1eefb8ff5a64807dbc942b1\ne4a2672d77b9f6928d292591\n\n_Table 1. Indicators for this threat._\n\n\nSHA256\nhash\n\n\nHermeticWiper\nmalware\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-25 - Disruptive HermeticWiper Attacks Targeting Ukrainian Organizations.pdf"
    ],
    "report_names": [
        "2022-02-25 - Disruptive HermeticWiper Attacks Targeting Ukrainian Organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "68cc6e37-f16d-4995-a75b-5e8e2a6cbb3d",
            "created_at": "2024-05-01T02:03:07.943593Z",
            "updated_at": "2025-03-27T02:05:17.259709Z",
            "deleted_at": null,
            "main_name": "BRONZE EDISON",
            "aliases": [
                "DarkSeoul",
                "Maverick Panda ",
                "Sykipot ",
                "TG-0623 ",
                "getkys",
                "APT4 "
            ],
            "source_name": "Secureworks:BRONZE EDISON",
            "tools": [
                " Wkysol",
                " ZxPortMap",
                "Gh0st RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535888,
    "ts_updated_at": 1743041605,
    "ts_creation_date": 1653761848,
    "ts_modification_date": 1653761848,
    "files": {
        "pdf": "https://archive.orkl.eu/bfe5c70c764e5b163b86608894f8c50ce21666da.pdf",
        "text": "https://archive.orkl.eu/bfe5c70c764e5b163b86608894f8c50ce21666da.txt",
        "img": "https://archive.orkl.eu/bfe5c70c764e5b163b86608894f8c50ce21666da.jpg"
    }
}