{
    "id": "c8f6ed52-b041-4611-b029-1653ce48f48a",
    "created_at": "2023-01-12T15:04:29.304398Z",
    "updated_at": "2025-03-27T02:09:55.00969Z",
    "deleted_at": null,
    "sha1_hash": "e4c8115a5db082bd6b82fcc26982a5d1e7c88bcb",
    "title": "2014-02-10 - The Careto-Mask APT- Frequently Asked Questions",
    "authors": "",
    "file_creation_date": "2022-05-28T02:00:16Z",
    "file_modification_date": "2022-05-28T02:00:16Z",
    "file_size": 468855,
    "plain_text": "# The Careto/Mask APT: Frequently Asked Questions\n\n**[securelist.com/the-caretomask-apt-frequently-asked-questions/58254/](https://securelist.com/the-caretomask-apt-frequently-asked-questions/58254/)**\n\nAuthors\n\nGReAT\n\n\n-----\n\n## What exactly is Careto / “The Mask”?\n\nThe Mask is an advanced threat actor that has been involved in cyber-espionage operations since at\nleast 2007.\n\nWhat makes The Mask special is the complexity of the toolset used by the attackers. This includes\nan extremely sophisticated piece of malware, a rootkit, a bootkit, Mac OS X and Linux versions and\npossibly versions for Android and iPad/iPhone (iOS).\n\nThe Mask also uses a customized attack against older Kaspersky Lab products in order to hide in the\nsystem. This puts it above [Duqu in terms of sophistication, making The Mask one of the most](http://www.kaspersky.com/about/press/major_malware_outbreaks/duqu)\nadvanced threats at the current time. This and several other factors make us believe this could be a\nstate-sponsored operation.\n\n## Why do you call it The Mask?\n\nThe name “Mask” comes from the Spanish slang word “Careto” (“Mask” or “Ugly Face”) that the\nauthors included in some of the malware modules.\n\n\n-----\n\n## Who are the victims? / What can you say about the targets of the attacks?\n\nThe main targets of Careto fall into the following categories:\n\nGovernment institutions\nDiplomatic offices and embassies\nEnergy, oil and gas companies\nResearch institutions\nPrivate equity firms\nActivists\n\n## Do we know the total number of victims?\n\nAlthough the exact number of victims is unknown, we observed victims at more than 1000 IP\naddresses in 31 countries. Infections have been observed in: Algeria, Argentina, Belgium, Bolivia,\nBrazil, China, Colombia, Costa Rica, Cuba, Egypt, France, Germany, Gibraltar, Guatemala, Iran,\nIraq, Libya, Malaysia, Mexico, Morocco, Norway, Pakistan, Poland, South Africa, Spain, Switzerland,\nTunisia, Turkey, United Kingdom, United States and Venezuela.\n\nBased on an identification algorithm we developed, we counted over 380 unique victims between\nover 1000+ IPs.\n\n\n-----\n\nHowever, considering that victim information has been collected only for some command-and-control\nservers and sinkholed hosts, the total number of affected countries and unique victims can be much\nhigher.\n\n## What does Careto do? What happens after a target machine is infected?\n\nFor the victims, an infection with Careto is disastrous. The malware intercepts all the communication\nchannels and collects the most vital information from the infected system. Detection is extremely\ndifficult because of stealth rootkit capabilities. In addition to built-in functionalities, the operators of\nCareto can upload additional modules which can perform any malicious task. Given the nature of the\nknown victims, the impact is potentially very high.\n\n## How does Careto infect computers?\n\nThe Mask campaign we discovered relies on spear-phishing e-mails with links to a malicious\nwebsite. The malicious website contains a number of exploits designed to infect the visitor,\ndepending on his system configuration. Upon successful infection, the malicious website redirects\nthe user to the benign website referenced in the e-mail, which can be a YouTube movie or a news\nportal.\n\nIt’s important to note the exploit websites do not automatically infect visitors; instead, the attackers\nhost the exploits at specific folders on the website, which are not directly referenced anywhere,\nexcept in malicious e-mails. Sometimes, the attackers use sub-domains on the exploit websites, to\n\n\n-----\n\nmake them seem more legitimate. These sub-domains simulate sub-sections of the main\nnewspapers in Spain plus some international ones like the Guardian and the Washington Post.\n\n## Are the attackers using any zero-day vulnerabilities?\n\nSo far, we observed attacks using multiple vectors. These include at least one Adobe Flash Player\nexploit (CVE-2012-0773). The exploit was designed for Flash Player versions prior to 10.3 and 11.2.\n\nThe [CVE-2012-0773 was originally discovered by VUPEN and has an interesting story. This was the](http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0773)\nfirst exploit to break the Chrome sandbox and was used to win the CanSecWest Pwn2Own contest in\n2012. The exploit caused a bit of a controversy because the VUPEN team refused to reveal how they\nescaped the sandbox, claiming they were planning to sell the exploit to their customers. It is possible\n[that the Careto threat actor purchased this exploit from VUPEN.(See story by Ryan Naraine)](http://www.zdnet.com/blog/security/pwn2own-2012-google-chrome-browser-sandbox-first-to-fall/10588)\n\nOther vectors used include social engineering, asking the user to download and execute a\nJavaUpdate.jar file or to install a Chrome browser plugin. We suspect other exploits exist as well, but\nwe haven-t been able to retrieve them from the attack server.\n\n## Is this a Windows-only threat? Which versions of Windows are targeted? Are there Mac OS X or Linux variants?\n\nSo far, we observed Trojans for Microsoft Windows and Mac OS X. Some of the exploit server paths\ncontain modules that appear to have been designed to infect Linux computers, but we have not yet\nlocated the Linux backdoor. Additionally, some of the C&C artifacts (logs) indicate that backdoors for\nAndroid and Apple iOS may also exist.\n\n## Have you seen any evidence of a mobile component – iOS, Android or BlackBerry?\n\nWe suspect an iOS backdoor exists but we haven’t been able to locate it yet. The suspicion is based\non a debug log from one of the C&C servers where a victim in Argentina is identified and logged as\nhaving a user agent of “Mozilla/5.0 (iPad; CPU OS 6_1_3 like Mac OS X) AppleWebKit/536.26\n(KHTML, like Gecko) Mobile/10B329”. This appears to indicate it is an iPad, although without a\nsample, it’s hard to be sure.\n\nIn addition to this, we also suspect the existence of an Android implant. This is based on a unique\nversion identifier sent to the C&C which is “AND1.0.0.0”. Communications with this unique identifier\nhave been observed over 3G links, indicating a possible mobile device.\n\n## How is this different from any other APT attack?\n\nWhat makes The Mask special is the complexity of the toolset used by the attackers. This includes\nextremely sophisticated malware, a rootkit, a bootkit, Mac and Linux versions and possibly versions\nfor Android and iPad/iPhone (Apple iOS).\n\nAlso, The Mask uses a customized attack against older Kaspersky products in order to hide in the\nsystem. This puts it above Duqu in terms of sophistication, making The Mask one of the most\nadvanced APTs at the current time This and several other factors make us believe this could be a\n\n\n-----\n\nstate-sponsored operation.\n\n## How did you become aware of this threat? Who reported it?\n\nWe initially became aware of Careto when we observed attempts to exploit a vulnerability in our\nproducts to make the malware “invisible” in the system.\n\nOf course, this raised our interest and our research team decided to investigate further. In other\nwords, the attackers attracted our attention by attempting to exploit Kaspersky Lab products.\n\nAlthough the vulnerability in the products was discovered and fixed five years ago, there is still a\npossibility that there are users out there who haven’t updated the product. In such cases the exploit\ncan still be active, although it will not prevent us from removing the malware and cleaning the\nsystem.\n\n## Are there multiple variants of Careto? Are there any major differences in the variants?\n\nCareto is a highly modular system; it supports plugins and configuration files which allow it to perform\na large number of functions.\n\nVariants of Careto have different compilation timestamps going back to 2007. Most modules were\ncreated in 2012.\n\n## Is the command-and-control server used by Careto still active? Have you been able to sinkhole any of the C&Cs?\n\nAt the moment, all known Careto C&C servers are offline. The attackers began taking them offline in\nJanuary 2014. We were also able to sinkhole several C&C servers, which allowed us to gather\nstatistics on the operation.\n\n## What exactly is being stolen from the target machines?\n\n\n-----\n\nThe malware collects a large list of documents from the infected system, including encryption keys,\nVPN configurations, SSH keys and RDP files. There are also several unknown extensions being\nmonitored that we have not been able to identify and could be related to custom military/governmentlevel encryption tools.\n\nHere’s the full list of collected files from the configurations we analyzed:\n\n***.AKF,*.ASC,*.AXX,*.CFD,*.CFE,*.CRT,*.DOC,*.DOCX,*.EML,*.ENC,*.GMG,*.GPG,*.HSE,*.KEY,**\n\n***.M15,*.M2F,*.M2O,*.M2R,*.MLS,*.OCFS,*.OCU,*.ODS,*.ODT,*.OVPN,*.P7C,*.P7M,*.P7Z,*.PAB,*.PDF,**\n***.PGP,*.PKR,*.PPK,*.PSW,*.PXL,*.RDP,*.RTF,*.SDC,*.SDW,*.SKR,*.SSH,*.SXC,*.SXW,*.VSD,**\n\n***.WAB,*.WPD,*.WPS,*.WRD,*.XLS,*.XLSX**\n\n## Is this a state-sponsored attack?\n\nThe Mask uses a customized attack against older Kaspersky Lab products in order to hide in the\nsystem. In addition, it includes a rootkit, a bootkit, Linux/Mac versions and possibly a version for\nApple iOS. This puts it above [Duqu in terms of sophistication, making The Mask one of the most](https://securelist.com/duqu-faq-33/32463/)\nadvanced APTs at the current time.\n\nAlso, we observed a very high degree of professionalism in the operational procedures of the group\nbehind this attack, including monitoring of their infrastructure, shutdown of the operation, avoiding\ncurious eyes through access rules, using wiping instead of deletion for log files, etc. This level of\noperational security is not normal for cybercriminal groups.\n\nhis and several other factors make us believe this could be a state-sponsored campaign.\n\n## Who is responsible?\n\nAttribution is a difficult task. On the internet, it is extremely difficult to make a solid attribution due to\nthe volatile nature of the way it was built.\n\nSome clues such as the use of the Spanish language are weak, as it is spoken in many countries,\nincluding Latin America, Mexico or the United States (for instance in Miami, where a strong Spanishspeaking community exists).\n\nWe should also keep in mind the possibility of false flag attacks before making any solid assumption\non the identity of who is responsible without very solid proof.\n\n## How long have the attackers been active?\n\nSome Careto samples were compiled as far back as 2007. The campaign was active until January\n2014, but during our investigations the C&C servers were shut down.\n\nThat’s at least five years. We cannot rule out the possibility of the attackers resurrecting the\ncampaign at some point in the future.\n\n## Did the attackers use any interesting/advanced technologies?\n\n\n-----\n\nThe Windows backdoor is extremely sophisticated, and the attackers used a number of techniques in\norder to try to make the attack stealthier. These include injection into system libraries and attempting\nto exploit older Kaspersky Lab products to avoid detection.\n\nAdditionally, the exploits cover all potential target systems, including Mac OS X and Linux. Also, the\ncommunication between different exploit shellcode modules is done through cookies, which is quite\nan unusual technique.\n\n## Does Kaspersky Lab detect all variants of this malware?\n\nYes. Our products detect and remove all known versions of the malware used by the attackers.\nDetection names:\n\nTrojan.Win32/Win64.Careto.*\nTrojan.OSX.Careto\n\n## Are there Indicators of Compromise (IOCs) to help victims identify the intrusion?\n\nYes, IOC information has been included in our detailed technical research paper.\n\nYou can read our full report here.\n\n[[Click to download]](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/20133638/unveilingthemask_v1.0.pdf)\n\n[APT](https://securelist.com/tag/apt/)\n[Cyber espionage](https://securelist.com/tag/cyber-espionage/)\n[Keyloggers](https://securelist.com/tag/keyloggers/)\n[Rootkits](https://securelist.com/tag/rootkits/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Zero-day vulnerabilities](https://securelist.com/tag/zero-day-vulnerabilities/)\n\nAuthors\n\n\n-----\n\nGReAT\n\nThe Careto/Mask APT: Frequently Asked Questions\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-02-10 - The Careto-Mask APT- Frequently Asked Questions.pdf"
    ],
    "report_names": [
        "2014-02-10 - The Careto-Mask APT- Frequently Asked Questions.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535869,
    "ts_updated_at": 1743041395,
    "ts_creation_date": 1653703216,
    "ts_modification_date": 1653703216,
    "files": {
        "pdf": "https://archive.orkl.eu/e4c8115a5db082bd6b82fcc26982a5d1e7c88bcb.pdf",
        "text": "https://archive.orkl.eu/e4c8115a5db082bd6b82fcc26982a5d1e7c88bcb.txt",
        "img": "https://archive.orkl.eu/e4c8115a5db082bd6b82fcc26982a5d1e7c88bcb.jpg"
    }
}