{
    "id": "c909e0ec-b733-4315-92f8-586d85a9b2bf",
    "created_at": "2023-01-12T15:03:42.46813Z",
    "updated_at": "2025-03-27T02:05:32.064676Z",
    "deleted_at": null,
    "sha1_hash": "69b16c30c097b0435aa5c0135bfaebaf11dbf2d1",
    "title": "2022-02-16 - DDoS Attack Campaign Targeting Multiple Organizations in Ukraine",
    "authors": "",
    "file_creation_date": "2022-05-27T23:21:14Z",
    "file_modification_date": "2022-05-27T23:21:14Z",
    "file_size": 149414,
    "plain_text": "# The Anatomy of the DDoS Attack Campaign Targeting Organizations in Ukraine\n\n**[netscout.com/blog/asert/ddos-attack-campaign-targeting-multiple-organizations-ukraine](https://www.netscout.com/blog/asert/ddos-attack-campaign-targeting-multiple-organizations-ukraine)**\n\nby [ASERT Team on February 17th, 2022](https://www.netscout.com/blog/asert/asert-team)\n\n\n-----\n\n## Overview\n\nBeginning on 13 February 2022, multiple governmental, military, and financial organizations\nwithin Ukraine reported that their public-facing Web sites, applications, and ancillary\nsupporting infrastructure were being targeted in an orchestrated DDoS attack campaign.\nSignificant direct impact to these organizations and their direct constituents and customers,\nalong with collateral impact to other organizations such as associated Web hosting\noperators, was noted.\n\nReports indicate that public access to online governmental services, online Web and mobile\nbanking applications, and automated teller machines (ATMs) was disrupted by these attacks.\nThe use of VPNs to connect ATMs across the public Internet to their affiliated networks is\ncommonplace; when the associated financial network infrastructure is negatively impacted\nby DDoS attacks, bank patrons are often prevented from accessing funds, checking balance\ninformation, and performing other routine operations via ATMs.\n\nNETSCOUT Arbor’s ASERT team confirmed these reports, observing multiple direct-path\n(non-spoofed) SYN-flooding and UDP-flooding DDoS attacks targeting these organizations,\nalong with a smaller number of NTP reflection/amplification DDoS attacks. Observed SYNflood attack throughput reached a maximum of ~1.2 million packets-per-second (mpps),\nwhile large-packet UDP flooding attacks reached a maximum of ~5.3 Gbps. By way of\ncomparison, the largest DDoS attacks reported in 2021 were ~674 Mpps and 3.47 Tbps,\nrespectively.\n\n[The characteristics of all observed DDoS vectors utilized in these attacks to date were well](https://www.netscout.com/threatreport/ddos-attack-vectors/)\n[within established norms and a trend we've observed over the course of 2021 for increases](https://www.netscout.com/blog/asert/what-happened-second-half-2021)\nin botnet attacks; analysis of the attack dynamics indicates that standard DDoS-capable\nbotnets were used in this attack campaign. Both DDoS-for-hire and privately-operated\nbotnets are often used to generate DDoS attacks of the observed scale, scope, and types.\n\nThe brief spate of NTP reflection/amplification attacks observed at the beginning of the\nattack campaign, along with the direct-path UDP flooding observed throughout, are out of\nprofile for the targeted networks/servers/services/applications, largely directed towards\ndestination port UDP/443. The observed SYN-floods were primarily targeting destination\nports TCP/80 and TCP/443, which is consistent with standard Web servers.\n\nASERT observed botnet nodes (bots) participating in these attacks located in Ukraine,\nRussia, Portugal, the United Kingdom, the United States, and New Zealand. Researchers at\n[360 Netlab reported that a Mirai botnet was used for the attacks with its command-and-](https://twitter.com/360Netlab/status/1493797519725367302)\ncontrol (C2) node located in the Netherlands. Analysis of the DDoS vectors utilized in this\nattack campaign are consistent with capabilities typically exhibited by Mirai botnets.\n\n\n-----\n\nThe number of observed sources utilized in this DDoS attack campaign to date are relatively\nlow. This is consistent with the use of direct-path DDoS vectors and those utilized in these\nattacks, along with the reported attack volumes. Observed attack characteristics imply that\nany spoofing of source IPs which took place during these attacks was limited in scope, which\ncomports with reports that the botnet in question was a typical Mirai botnet, with most of its\nconstituent bots located on broadband access networks likely to enforce source-address\nvalidation (SAV; e.g., anti-spoofing).\n\n## Collateral Impact\n\nSuccessful DDoS attacks against Web hosting and VPS operators can significantly impact\norganizations which are not the direct targets of DDoS attacks, but which share the same\nnetwork/service/application/content-delivery infrastructure.\n\nDisruption of online applications and services provided by governmental organizations can\nresult in the inability to deliver critical services to their constituents.\n\nDisruption of online financial services can result in delays in payroll deposits, bill payments,\nonline and in-person electronic retail payments, ready access to cash, etc.\n\nThe collateral impact of reflection/amplification DDoS attacks is potentially quite high for\norganizations and individuals whose misconfigured servers/services are abused as\nreflectors/amplifiers. This may include partial or full interruption of mission-critical\napplications and services, as well as additional service disruption due to transit capacity\nconsumption, state-table exhaustion of stateful firewalls and load-balancers, etc.\n\nIndividuals and organizations who’s general-purpose and/or Internet-of-Things (IoT) devices\nhave been subsumed into botnets can be negatively impacted when these compromised\nsystems are utilized to launch outbound DDoS attacks. As with reflection/amplification\nattacks, this may include partial or full interruption of mission-critical applications and\nservices, as well as additional service disruption due to transit capacity consumption, statetable exhaustion of stateful firewalls and load-balancers, etc.\n\n## Mitigating Factors\n\nDDoS attack traffic can be mitigated via the implementation of industry-standard best current\npractices (BCPs) such as situationally appropriate network access control policies; network\ninfrastructure-based reaction mechanisms such as flowspec; and intelligent DDoS mitigation\nsystems (IDMSes) such as NETSCOUT Arbor Sightline, TMS, and AED.\n\nCollateral impact to misconfigured, abusable computers/IoT devices/servers/services\nleveraged as bots or reflectors/amplifiers by attackers to launch DDoS attacks can motivate\nnetwork operators and/or end-customers to remove or remediate affected systems.\n\n\n-----\n\nTraceback of spoofed DDoS attack traffic to its ingress points by network operators and\nsubsequent implementation of source-address validation (SAV) can prevent attackers from\nlaunching both reflection/amplification and spoofed direct-path DDoS attacks.\n\n## Recommended Actions\n\nOrganizations with business-critical public-facing internet properties should ensure that all\nrelevant network infrastructure, architectural and operational Best Current Practices (BCPs)\nhave been implemented, including situationally specific network access policies which only\npermit Internet traffic via required IP protocols and ports. Internet access network traffic\nto/from internal organizational personnel should be deconflated from internet traffic to/from\npublic-facing internet properties and served via separate upstream internet transit links.\n\nDDoS defenses for all public-facing Internet properties and supporting infrastructure should\nbe implemented in a situationally appropriate manner, including periodic testing to ensure\nthat any changes to organization’s servers/services/applications are incorporated into its\nDDoS defense plan. Organic, on-site intelligent DDoS mitigation capabilities should be\ncombined with cloud- or transit-based upstream DDoS mitigation services to ensure maximal\nresponsiveness and flexibility during an attack.\nIt is imperative that organizations operating mission-critical public-facing internet properties\nand/or infrastructure ensure that all servers/services/application/datastores/infrastructure\nelements are protected against DDoS attack, and are included in periodic, realistic tests of\nthe organization’s DDoS mitigation plan. In many instances, we have encountered situations\nin which obvious elements such as public-facing Web servers were adequately protected,\nbut authoritative DNS servers, application servers, and other critical service delivery\nelements were neglected, thus leaving them vulnerable to attack.\n\nSpecifics of countermeasure selection, tuning, and deployment will vary based upon the\nparticulars of individual networks/resources; the relevant NETSCOUT Arbor account teams\nand/or ATAC may be consulted with regards to optimal countermeasure selection and\nemployment.\n\nflowspec can be used by network operators to mitigate UDP reflection/amplification DDoS\nattacks; direct-path UDP flooding DDoS attacks; and, in some circumstances, SYN-flood\nattacks, although intelligent DDoS mitigation systems (IDMSes) such as NETSCOUT Arbor\n[TMS and AED provide a higher degree of mitigation granularity and interactive source](https://www.netscout.com/product/netscout-aed)\nevaluation when defending against SYN-floods. It is important to ensure that reaction\naccess-control list (ACL) stanzas propagated via flowspec are configured in such a way to\nminimize the risk of overblocking.\n\nAIF Templates providing examples DDoS countermeasure provisioning for standard server\ntypes are available to AIF-entitled Sightline/TMS operators. AIF Filter Lists of abusable\nreflectors/amplifiers are also available to AIF-entitled Sightline/TMS customers.\n\n\n-----\n\nAll potential DDoS attack mitigation measures described in this Summary MUST be tested\nand customized in a situationally appropriate manner prior to deployment on production\nnetworks.\n\nApplicable NETSCOUT Arbor Solutions: NETSCOUT [Arbor Sightline,](https://www.netscout.com/product/arbor-sightline) [TMS, and](https://www.netscout.com/product/arbor-threat-mitigation-system) [AED.](https://www.netscout.com/product/netscout-aed)\n\n## Additional References\n\n[https://edition.cnn.com/2022/02/16/europe/ukraine-cyber-attack-denial-service-intl/index.html](https://edition.cnn.com/2022/02/16/europe/ukraine-cyber-attack-denial-service-intl/index.html)\n\n[https://twitter.com/DougMadory/status/1493680334965297159](https://twitter.com/DougMadory/status/1493680334965297159)\n\nPosted In\n\nAttacks and DDoS Attacks\n\n## Subscribe\n\n_Sign up now to receive the latest notifications and updates from NETSCOUT's ASERT._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-16 - DDoS Attack Campaign Targeting Multiple Organizations in Ukraine.pdf"
    ],
    "report_names": [
        "2022-02-16 - DDoS Attack Campaign Targeting Multiple Organizations in Ukraine.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535822,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653693674,
    "ts_modification_date": 1653693674,
    "files": {
        "pdf": "https://archive.orkl.eu/69b16c30c097b0435aa5c0135bfaebaf11dbf2d1.pdf",
        "text": "https://archive.orkl.eu/69b16c30c097b0435aa5c0135bfaebaf11dbf2d1.txt",
        "img": "https://archive.orkl.eu/69b16c30c097b0435aa5c0135bfaebaf11dbf2d1.jpg"
    }
}