{
    "id": "c954f822-9556-4437-958e-390a9241b094",
    "created_at": "2023-01-12T15:08:42.183564Z",
    "updated_at": "2025-03-27T02:05:38.078198Z",
    "deleted_at": null,
    "sha1_hash": "d980f0d1f67c3d70239a5c4e2cd513a1a7f733b8",
    "title": "2020-12-21 - Advice for incident responders on recovery from systemic identity compromises",
    "authors": "",
    "file_creation_date": "2022-05-27T23:12:24Z",
    "file_modification_date": "2022-05-27T23:12:24Z",
    "file_size": 17008853,
    "plain_text": "# Advice for incident responders on recovery from systemic identity compromises\n\n**microsoft.com/security/blog/2020/12/21/advice-for-incident-responders-on-recovery-from-systemic-identity-**\ncompromises/\n\nDecember 21, 2020\n\nAs Microsoft alongside our industry partners and the security community continues to\ninvestigate the extent of the Solorigate attack, our goal is to provide the latest threat\nintelligence including IOCs and guidance across our products and solutions to help the\ncommunity fight back against, harden your infrastructure, and begin to recover from this\nattack of unprecedented scale. As new information becomes available, we will make updates\nto [this article.](https://aka.ms/solorigate)\n\nThis blog will outline lessons learned from this and other incident response to date in onpremises and cloud environments. This latest guidance is for customers looking to reestablish trusted identities for credentials that are suspected of compromise by Solorigate\nmalware.\n\nThis article is intended to give experienced incident responders some advice on techniques\nto consider when helping an organization respond to a suspected systemic identity\ncompromise like we’re seeing in some victims of the Solorigate malware based on our\n\n\n-----\n\nexperience in the field in similar scenarios. Re-establishing trust in the organization s onpremises and cloud environments with minimal business impact requires in-depth\ninvestigation and an understanding of potential methods of persistence. While not meant to\ncover every possible scenario, this guidance is intended to summarize our experience with\nsimilar customer breaches and will be updated if we learn of new information that would help\nwith successful recovery. Please review the resources referenced at the end of this article for\nadditional information. This information is provided as-is and constitutes generalized\n**_guidance; the ultimate determination about how to apply this guidance to your IT_**\n**_environment and tenant(s) must consider your unique environment and needs, which_**\n**_each Customer is in the best position to determine._**\n\nThe Solorigate investigation referenced in this guidance is ongoing at the time of publication\nand our teams continue to act as first responders to these attacks. As new information\nbecomes available, we will make updates through our Microsoft Security Response Center\n(MSRC) blog.\n\n## Overview of the intrusion\n\n[As described in this Microsoft blog post, the hallmarks of this actor’s activity include, but are](https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/)\nnot limited to, the following techniques that are likely to result in systemic identity\ncompromise:\n\nAn intrusion through malicious code in the SolarWinds Orion product. This results in\nthe attacker gaining a foothold in the network, which the attacker can use to gain\n[elevated credentials. Microsoft Defender now has detections for these files. Read our](https://www.microsoft.com/security/blog/2020/12/15/ensuring-customers-are-protected-from-solorigate/)\n[in-depth technical analysis of the Solorigate malware.](https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/)\nAn intruder using administrative permissions (acquired through an on-premises\ncompromise) to gain access to an organization’s trusted SAML token-signing\ncertificate. This enables them to forge SAML tokens to impersonate any of the\norganization’s existing users and accounts, including highly privileged accounts.\nAnomalous logins using the SAML tokens signed with a compromised token-signing\ncertificate, which can be used against any on-premises resources (regardless of\nidentity system or vendor) as well as against any cloud environment (regardless of\nvendor) because they have been configured to trust the certificate. An organization\nmay miss the use of illegitimate SAML tokens because they are signed with a\nlegitimate certificate.\nThe use of highly privileged accounts (acquired through the technique above or other\nmeans) to add illegitimate credentials to existing application service principals, enabling\nthe attacker to call APIs with the permission assigned to that application.\n\n## Overview of response objectives\n\n\n-----\n\nOrganizations that have experienced systemic identity compromise need to start recovery by\nre-establishing trustworthy communications. This will enable effective triage and coordination\nof business operations recovery.\n\nMany organizations have complex internal and external interdependencies. Core business\nprocesses and applications in an organization are likely to be temporarily impacted during\nrecovery efforts until trust within your environment is re-established. Microsoft recommends\nthat Incident Responders establish secure communications with key organizational\npersonnel as the first step toward organizational recovery. If your investigation indicates that\nthe attacker has used techniques outside of identity compromise at lower levels of your\norganizations’ infrastructure, such as hardware or firmware attacks, you will need to address\nthose threats to reduce the risk of re-compromise.\n\nResponse objectives in approximate order:\n\n1. Establish secure communications for personnel key to the investigation and\n\nresponse effort.\n2. Investigate the environment for persistence and initial access point, while establishing\n\ncontinuous monitoring operations during recovery efforts.\n3. Regain and retain administrative control of your environment and remediate or\n\nblock possible persistence techniques and initial access exploits.\n4. Improve posture by enabling security features and capabilities following best practice\n\nrecommendations.\n\nWe recommend that incident responders review and digest the entirety of this guidance\nbefore taking action, as the specific order of actions taken to achieve the response objectives\nis very situational and depends heavily on the results (and completeness) of investigation\nand the business constraints of the specific organization. The following sections describe the\nincident Response techniques we recommend you consider for each of the above objectives.\n\n## Establish secure communications and productivity\n\nSuccessful response requires being able to communicate without the attacker eavesdropping\non your communications. Until you have achieved assurance in the privacy of your\ncommunications on your current infrastructure, use completely isolated identities and\ncommunication resources to coordinate your response and discuss topics that could\npotentially tip off the attacker to your investigation. Until your investigation has achieved\nassurance in actor eviction, we strongly recommend that you keep all incident-related\ncomms isolated to enable you to have the element of surprise when taking remediation\nactions.\n\nInitial one-on-one and group communications can be achieved through phone (PSTN)\ncalling, conference bridges not connected to the corporate infrastructure, and end-toend encrypted messaging solutions.\n\n\n-----\n\nOne way that many customers have established secure productivity and collaboration\nis to create a new Office 365 tenant which is completely isolated from the\norganization’s production tenant and create accounts only for the key personnel\nneeded, and any incident response vendors or partners who need to be part of the\nresponse.\n\nMake sure to follow best practices for securing this tenant, especially\nadministrative accounts and rights by default. The new tenant should be limited\non Administrative rights along with no trusts with outside applications or vendors.\nIf you need further assistance or want information on hardening Microsoft 365,\n[you can review the guidance here.](https://www.microsoft.com/security/blog/2019/01/10/best-practices-for-securely-using-microsoft-365-the-cis-microsoft-365-foundations-benchmark-now-available/)\n\n## Investigate your environment\n\nOnce your incident responders and key personnel have a secure place to collaborate, the\nnext step is to investigate the suspected compromised environment. Successful investigation\nwill be a balance between getting to the bottom of every anomalous behavior to fully scope\nthe extent of attacker activity and persistence and taking action quickly to stop any further\nactivity on objectives by the attacker. Successful remediation requires as complete an\nunderstanding of the initial method of entry and persistence mechanisms controlled by the\nattacker as possible. Any persistence mechanisms missed could result in continued access\nby the attacker and potential for re-compromise.\n\nInvestigate and review cloud environment logs for suspicious actions and attacker\nIOCs, including:\n\nUnified Audit Logs (UAL).\nAzure Active Directory (Azure AD) logs.\nActive Directory logs.\nExchange on-prem logs.\nVPN logs.\nEngineering systems logging.\nAntivirus and endpoint detection logging.\nReview endpoint audit logs for changes from on-premises for actions including, but not\nlimited to, the following:\n\nGroup membership changes.\nNew user account creation.\nDelegations within Active Directory.\nAlong with other typical signs of compromise or activity.\n\n\n-----\n\nReview Administrative rights in your environments\n\nReview privileged access in the cloud and remove any unnecessary\npermissions. Implement Privileged Identity Management (PIM); setup Conditional\nAccess policies to limit administrative access during hardening.\nReview privileged access on-premise and remove unnecessary permissions.\nReduce membership of built-in groups, verify Active Directory delegations,\nharden Tier 0 environment, and limit who has access to Tier 0 assets.\nReview all Enterprise Applications for delegated permissions and consent grants\n[that allow (sample script to assist):](https://aka.ms/getazureadpermissions)\n\nModification of privileged users and roles.\nReading or accessing all mailboxes.\nSending or forwarding email on behalf of other users.\nAccessing all OneDrive or SharePoint sites content.\nAdding service principals that can read/write to the Directory.\nReview access and configuration settings for the following Office 365 products:\n\nSharePoint Online Sharing\nTeams\nPowerApps\nOneDrive for Business\nReview user accounts\n\nReview and remove guest users that are no longer needed.\n[Review email configurations using Hawk or something similar.](https://github.com/T0pCyber/hawk)\n\nDelegates\nMailbox folder permissions\nActiveSync mobile device registrations\n[Inbox Rules](https://docs.microsoft.com/en-us/office365/securitycompliance/detect-and-remediate-outlook-rules-forms-attack)\nOutlook on the Web Options\nValidate that both MFA and self-service password reset (SSPR) contact\ninformation for all users is correct.\n\nYou may find that one or more of the logging sources above are data sources that the\norganization does not currently include in its security program. Some of them, especially the\nlogging available in the cloud, are available only if configured and we recommend that you\nconfigure them as soon as possible to enable both the detections in the next section and\nforensics review of logs going forward. Make sure to configure your log retention to support\nyour organization’s investigation goals going forward and retain evidence, if needed for legal,\nregulatory, or insurance purposes.\n\n## Establish continuous monitoring\n\nThere are many ways to detect activity associated with this campaign. Exactly how your\norganization will detect attacker behavior depends on which security tools you have\navailable, or choose to deploy in response. Microsoft has provided examples publicly for\n\n\n-----\n\nsome of the core security products and services that we offer and are continually updating\nthose documents as new threat intelligence is identified related to this attacker. If you use\nother vendor’s products, review your vendor’s recommendations, and review the Microsoft\ndocumentation below to understand the detection techniques if you need to implement\nanalogous detections in your environment on your own.\n\nFor readers using Azure Sentinel in their environments, review SolarWinds PostCompromise Hunting guidance.\n\n[For readers using Microsoft Defender for Endpoint, review our guidance here, and review](https://www.microsoft.com/security/blog/2020/12/15/ensuring-customers-are-protected-from-solorigate/)\n[Microsoft Defender Antivirus guidance.](https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/)\n\n**Azure Active Directory sign-ins**\n\nYou can view this information from the Azure Active Directory Sign-in blade by selecting an\nappropriate time window and then downloading the report as either a CSV or JSON file.\nNOTE: You can download interactive, as well as non-interactive, sign-in reports via this\ninterface. Once you have downloaded the results, look for the value “MFA requirement\nsatisfied by claim in the token” in the “MFA result” field.\n\n[You can also use the Get-AzureADAuditSignInLogs cmdlet (see the details here) and filter](https://docs.microsoft.com/en-us/powershell/module/azuread/get-azureadauditsigninlogs?view=azureadps-2.0-preview#parameters)\nthe results to only return entries that match this field value, as seen in this example:\n```\nGet-AzureADAuditSignInLogs -All:$true -Filter \"createdDateTime gt <startdate> and\ncreatedDateTime lt <enddate>\" | where {$_.Status.AdditionalDetails -eq \"MFA\nrequirement satisfied by claim in the token\"} | select-object CreatedDateTime,\nIpAddress,UserAgent, ResourceDisplayName, CorrelationId, RequestId, UserPrincipalName\n-ExpandProperty Status\n\n```\nIf your ADFS environment is configured to send a claim for MFA being satisfied, this may not\nbe a strong signal. However, for many organizations using ADFS, and this claim is not\nincluded per your configuration; in those cases, the presence of this claim may be a strong\nindicator of attacker activity. You may also wish to add additional filters or conditions in the\nwhere clause to further improve your signal to noise ratio, such as only surfacing results from\ndomains that are federated.\n\nIf suspicious sign-ins are detected, you can further pivot your investigation based on IP\naddresses identified, user accounts identified, and/or other indicators such as the UserAgent\nstring and client operating system observed, if based on your knowledge of your environment\nthese appear to be strong indicators.\n\n**Analysis of risky sign-in events**\n\nIn some cases, Azure Active Directory and its Identity Protection platform will generate risk\nevents associated with the use of attacker generated SAML tokens. These can be labeled as\n“unfamiliar properties”, “anonymous IP address”, “impossible travel” and the other risk events\n[as described here](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks)\n\n\n-----\n\nClosely analyze all risk events associated with accounts that have administrative privileges.\nIt is also important to analyze events that have been dismissed or remediated as some of\nthese actions are done automatically. For example, a risk event for an anonymous IP\naddress can be automatically remediated because the user passed MFA.\n\n**Detection of domain authentication properties**\n\nThe attacker may attempt to manipulate the domain authentication policies which are\nrecorded in the Azure Active Directory Audit Logs and reflected in the Unified Audit Log. An\nattacker who has gained access with Global Administrator privileges can modify the domains\nthat are federated and/or trusted. Review any events associated with “Set domain\nauthentication” in either the Unified Audit Log, Azure AD Audit Logs, and/or your SIEM\nenvironment. Verify that all activities were expected and planned.\n\nThe sample command below returns the entries from the Unified Audit Log which were\nassociated with manipulation of domain authentication settings.\n```\nSearch-UnifiedAuditLog -StartDate <startdate> -EndDate <enddate> -ResultSize 5000 Operations \"Set domain authentication\"\n\n```\n**Detection of credentials to a service principal associated with an OAuth application**\n\nIf the attacker has gained control of a credential with sufficient privileges, the attack pattern\nincludes locating an application that has been granted the ability to access any user’s e-mail\nin the organization and adding attacker controlled credentials to that application. In some\ncases, the attacker has modified these applications granting them additional rights such as\naccess to all e-mail in the organization.\n\nThe following are operations that would be consistent with attacker behavior:\n\nAdd service principal credentials.\nUpdate application- certificates and secrets management.\nUpdate service principal.\nAdd app role assignment to service principal.\nAdd app role assignment grant to user.\nAdd OAuth2PermissionGrant.\n\n### Detection e-mail access by applications\n\nDetection of access to e-mail by applications can be achieved using the Advanced Auditing\ncapabilities of Office 365. Access to messages inside of Office 365 is audited via the\nMailItemsAccessed capability.\n\nAnalyze events in the Unified Audit Log for the Operation of MailItemsAccessed.\n\n### Detection of non-interactive sign-ins to service principals\n\n\n-----\n\n[Azure Active Directory in the Sign-In reports provides reporting of non-interactive sign-ins](https://docs.microsoft.com/en-us/microsoft-365/compliance/advanced-audit?view=o365-worldwide)\nusing credentials issued to service principals (as was observed in this attack). Analyzing the\nsign-ins for service principals reports can provide valuable data such as the IP Address the\nattacker was using to access the applications for e-mail access.\n\nIf there is evidence found that uncovers administrative permissions acquired through the onpremises compromise to gain access to your organization’s global administrator account\nand/or trusted SAML token signing certificate, Microsoft recommends taking the following\nimmediate actions:\n\n## Remediate and retain administrative control\n\n### Regaining and retaining administrative control of your environment\n\nIf your investigation has identified that the attacker has administrative control in the\norganization’s cloud environment and/or on-prem, it’s critical to regain control in such a way\nas to ensure that the attacker isn’t persistent. Exactly which steps you will take depend both\non what persistence you discovered in your investigation, and your level of confidence in the\ncompleteness of that investigation and discovery of all possible methods of entry and\npersistence. While it is possible to regain control with high confidence, even in the face of an\nincomplete investigation, doing so requires significant impact to business operations, so\nmost organizations choose to remediate based on the results of the investigation in our\nexperience.\n\nWe recommend you consider the following steps when building your administrative control\nrecovery plan, but the exact order and timing should be planned based on the results of your\ninvestigation and understanding of adversary owned administrative assets and methods of\npersistence.\n\nEnsure that any actions described here are performed from a trusted device built from\na [clean source, such as a privileged access workstation.](https://docs.microsoft.com/en-us/windows-server/identity/securing-privileged-access/securing-privileged-access-reference-material#clean-source-principle)\nIf the organization has lost control of its token signing certificates or federated trust the\nhighest assurance approach is to remove trust and switch to cloud mastered identity\nwhile remediating on-prem. A detailed plan for doing so is beyond the scope of this\ndocument and requires careful planning and understanding of the business operations\n[impacts of isolating identity. Review the Azure Active Directory guidance or key](https://aka.ms/protectm365)\nconsiderations.\nShould your organization choose not to break trust while recovering administrative\ncontrol on-prem, you’ll need to rotate your SAML token signing certificate once you\nhave regained administrative control on-prem and blocked the attacker’s ability to\naccess the signing certificate again. It’s critical that your organization follow the\ncertificate rotation instructions below to ensure that the attacker doesn’t maintain the\nability to forge tokens for your domain.\n\n\n-----\n\n### Rotation of ADFS token signing certificate\n\nFor a compromised or potentially compromised ADFS Token Signing certificate, rotating the\nToken Signing certificate a single time would still allow the previous Token Signing certificate\nto work. The rationale for this is to permit a grace period to update your Relying Party Trusts\nprior to expiration of the certificate during normal rotation of the signing certificate.\n\nNOTE: Conducting the below steps in the ADFS environment will create both a primary and\nsecondary certificate and will automatically promote the secondary certificate to primary after\na default period of five days. If you have Relying Party trusts, this could cause impacts five\ndays after the initial ADFS environment change and should be accounted for within your\nprocess. You can resolve this by replacing the primary certificate a third time with “-Urgent”\nand removing the secondary certificate or turning off automatic certificate rotation.\n\nIf instead of rolling the Token Signing Certificate your organization feels the need to replace\nthe ADFS servers with known clean systems, you can follow steps to remove the existing\nADFS from your environment and build a new one.\n\n[Delete Azure AD Cloud Provisioning agent configuration.](https://docs.microsoft.com/en-us/azure/active-directory/cloud-provisioning/how-to-configure#remove-a-configuration)\n\nShould your organization decide to rotate the certificate on your current ADFS servers, follow\nthese steps in the below order, from the ADFS server:\n\n1. Check to make sure that your AutoCertificateRollover is set to True.\n```\n   Get-AdfsProperties | FL AutoCert*, Certificate*\n\n```\nIf it is not, you can set it with this command:\n```\n      Set-ADFSProperties -AutoCertificateRollover $true\n\n```\n2. Connect to the Microsoft Online Service\n```\n   Connect-MsolService\n\n```\n\n-----\n\n3. Document both your on-premise and cloud Token Signing Certificate thumbprint and\n\nexpiration dates.\n```\n Get-MsolFederationProperty -DomainName <domain>\n\n```\n4. Replace the primary Token Signing certificate using the -Urgent switch to cause ADFS\n\nto replace the primary certificate immediately without making it a Secondary certificate.\n```\n Update-AdfsCertificate -CertificateType Token-Signing -Urgent\n\n```\n\n-----\n\n5. Create a secondary Token Signing certificate without using the -Urgent switch to allow\n\nfor two on-premise Token Signing certificates, before syncing with Azure cloud.\n```\n Update-AdfsCertificate -CertificateType Token-Signing\n\n```\n6. Update the cloud environment with both the primary and secondary certificates on\npremise to immediately remove the cloud published token signing certificate. If this step\nis not completed using this method you leave the potential for the old token signing\ncertificate to still authenticate users.\n```\n Update-MsolFederatedDomain -DomainName <domain>\n\n```\n7. Verification that you completed the above steps and removed the certificate that was\n\ndisplayed in Step 3 above.\n```\n Get-MsolFederationProperty -DomainName <domain>\n\n```\n\n-----\n\n[8. Revoke refresh tokens via PowerShell, information can be found here and you can also](https://docs.microsoft.com/en-us/powershell/module/azuread/revoke-azureaduserallrefreshtoken?view=azureadps-2.0)\n\n[reference how to “Revoke user access in Azure Active Directory.”](https://docs.microsoft.com/en-us/azure/active-directory/enterprise-users/users-revoke-access)\n\n**Note: This will log users out of their phone, current webmail sessions,**\n**along with other items that are using Tokens and Refresh Tokens.**\n\n### Additional cloud remediation activities to complete\n\n[Reset passwords on any break-glass accounts and reduce the number of break-glass](https://docs.microsoft.com/en-us/azure/active-directory/roles/security-emergency-access)\naccounts to the absolute minimum required.\nWe recommend that service and user accounts with Privileged access should be Cloud\nOnly accounts and not use on-premise accounts synced or federated to Azure Active\nDirectory.\nEnforce Multi-Factor Authentication (MFA) across all elevated users in the tenant. We\nrecommend enforcing MFA across all users in the tenant.\n[Implement Privileged Identity Management (PIM) and conditional access to limit](https://docs.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-configure)\nadministrative access.\n\n[For Office 365 users, implement Privileged Access Management (PAM) to limit](https://techcommunity.microsoft.com/t5/microsoft-security-and/privileged-access-management-in-office-365-is-now-generally/ba-p/261751#:~:text=A%3A%20Azure%20AD%20Privileged%20Identity%20Management%20%28PIM%29%20and,ensure%20protection%20across%20Office%20365%20and%20Azure%20clouds.)\naccess to sensitive capabilities (including eDiscovery, Global Admin, Account\nAdministration, and more).\n[Review and reduce all Enterprise Applications delegated permissions or](https://aka.ms/getazureadpermissions) [consent grants](https://docs.microsoft.com/en-us/graph/auth-limit-mailbox-access?context=graph%2Fapi%2F1.0&view=graph-rest-1.0)\nthat allow such as:\n\nModification of privileged users and roles.\nReading, sending email, or accessing all mailboxes.\nAccessing OneDrive, Teams, or SharePoint content.\nAdding of Service Principals that can read/write to the Directory.\nApplication Permissions versus Delegated Access.\n\n### Additional on-premises remediation activities to complete\n\nRebuild systems that were identified as compromised by the attacker during your\ninvestigation.\nRemove unnecessary members from Domain Admins, Backup Operators, and\nEnterprise Admin groups. Reference Microsoft’s [Securing Privileged Access.](https://docs.microsoft.com/en-us/security/compass/overview)\nReset passwords of all privileged accounts in the environment.\n\nPrivilege accounts are not limited to Built-In groups but can also be groups that\nare delegated access to Server Administration / Workstation Administration and\nother aspects of your environment.\n[Reset the krbtgt account using this script twice.](https://github.com/microsoft/New-KrbtgtKeys.ps1/blob/master/New-KrbtgtKeys.ps1)\n\nNote: If you are using Read-Only Domain Controllers, you will need to run the\nscript for Read-Write Domain Controllers and Read-Only Domain Controllers.\nAfter you validate that no persistence mechanisms created by the attacker exist or\nremain on your system, schedule a restart. This can assist with removing memory\nresident malware.\n\n\n-----\n\nReset each domain controller s DSRM (Directory Services Restore Mode) password to\nsomething unique and complex.\n\n### Remediate or block persistence discovered during investigation\n\nRemediate the persistence techniques identified in your investigation stage earlier.\nInvestigation is an iterative process and you’ll need to balance the organizational desire to\nremediate as you identify anomalies and the chance that remediation will alert the attacker of\nyour detection and cause them to react by changing techniques or creating additional\npersistence. For Office 365 accounts, automatically remediate known persistence\ntechniques, if any are discovered, using the scripts described\n\n**Remediate user and service account access**\n\nSome of the user-level actions we recommend were described above already, specifically in\nterms of ensuring that MFA is enabled and running specific remediation scripts to clean up\nknown persistence techniques. Here are some additional steps you should consider taking to\nremediate and restore user accounts:\n\nEnforce conditional access based on trusted device.\n\nIf possible, enforce location-based conditional access that suits your\norganizational requirements.\nFor any user accounts suspected of being compromised, immediately reset passwords\nafter eviction; make sure you also implement a mid-term plan to reset credentials for all\naccounts in your directory.\nAfter credential rotation, use PowerShell to revoke refresh tokens immediately. More\n[information can be found here and additional resources can be found at Revoke user](https://docs.microsoft.com/en-us/powershell/module/azuread/revoke-azureaduserallrefreshtoken?view=azureadps-2.0)\naccess in an emergency in Azure Active Directory | Microsoft Docs.\n\n## Improve security posture\n\nAfter a security event is a good time for organizations to reflect on their security strategy and\npriorities. Incident Responders are often asked to provide recommendations after an event\non what investments the organization should prioritize now that it’s been faced with new\nthreats. In addition to the recommendations documented earlier, we recommend you\nconsider these areas of focus for your post-incident review recommendations that are\nresponsive to the post-exploitation techniques used by this attacker and the common\nsecurity posture gaps that enable them.\n\n### General security posture\n\n[Review Microsoft Secure Score for security fundamentals recommendations](https://docs.microsoft.com/en-us/microsoft-365/security/mtp/microsoft-secure-score?view=o365-worldwide)\ncustomized for the Microsoft products and services you consume.\nEnsure that your organization has EDR and SIEM solutions in place.\n[Review Microsoft’s Enterprise access model](https://aka.ms/tier0)\n\n\n-----\n\n### Identity\n\n[1. Review Five steps to securing your identity infrastructure and prioritize steps as](https://docs.microsoft.com/en-us/azure/security/fundamentals/steps-secure-identity)\n\nappropriate for your Identity architecture.\n2. Consider migrating to Azure AD Security Defaults for your authentication policy- details\n\ncan be found here.\n3. Eliminate your organization’s use of legacy authentication, if systems or applications\n\n[still require it- review the guidance here.](https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/block-legacy-authentication)\n\nAs announced last year, the Exchange Team is planning to disable Basic\nAuthentication for the EAS, EWS, POP, IMAP, and RPS protocols in the second\nhalf of 2021. As a point of clarity, Security Defaults and Authentication Policies\nare separate but provide complementary features. We recommend that\ncustomers use Authentication Policies to turn off Basic Authentication for a subset\nof Exchange Online protocols or to gradually turn off Basic Authentication across\na large organization. While more details will come in future announcements, as\nmentioned in April, we plan to begin disabling Basic Authentication in existing\ntenants with no recorded usage as early as October 2020. We will provide\nnotifications via Message Center posts before we disable Basic Authentication for\nany tenant.\n4. In order to help protect your ADFS/Azure AD Connect systems, beyond the ADFS\n\nguidance located, we recommend that you consider the following actions:\n\nTreat your ADFS infrastructure and AD Connect infrastructure as a Tier 0 asset.\nRestrict local administrative access to the system, including the account that is\nused to run the ADFS service.\n\nThe least privilege necessary for the account running ADFS is the Log on\nas a Service User Right Assignment.\nRestrict administrative access to limited users and from limited IP address ranges\n[by leveraging Windows Firewall policies for Remote Desktop.](https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-firewall/best-practices-configuring)\n\nIt is recommended to set up a Tier 0 jump box or equivalent system.\nBlock all inbound SMB access to the systems from anywhere in the environment.\nSee [this resource for further details.](https://techcommunity.microsoft.com/t5/itops-talk-blog/beyond-the-edge-how-to-secure-smb-traffic-in-windows/ba-p/1447159)\n\nGet the Windows Firewall logs to a SIEM for historical and proactive\nmonitoring.\nIf you are using a Service Account and your environment supports it, migrate\nfrom a Service Account to a [group Managed Service Account (gMSA). If you](https://docs.microsoft.com/en-us/windows-server/security/group-managed-service-accounts/group-managed-service-accounts-overview)\ncannot move to a gMSA, rotate the password on the Service Account to a\ncomplex password.\nEnsure Verbose logging is enabled on your ADFS systems by executing the\nfollowing commands:\n\n\n-----\n\n```\nSet AdfsProperties AuditLevel verbose\nRestart-Service -Name adfssrv\nAuditpol.exe /set /subcategory:”Application Generated” /failure:enable\n/success:enable\n\n```\n[Implement Sysmon in the environment using a configuration found here.](https://github.com/SwiftOnSecurity/sysmon-config)\n\n_Contributors: We thank the team at FireEye for their contributions and review._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-21 - Advice for incident responders on recovery from systemic identity compromises.pdf"
    ],
    "report_names": [
        "2020-12-21 - Advice for incident responders on recovery from systemic identity compromises.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536122,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653693144,
    "ts_modification_date": 1653693144,
    "files": {
        "pdf": "https://archive.orkl.eu/d980f0d1f67c3d70239a5c4e2cd513a1a7f733b8.pdf",
        "text": "https://archive.orkl.eu/d980f0d1f67c3d70239a5c4e2cd513a1a7f733b8.txt",
        "img": "https://archive.orkl.eu/d980f0d1f67c3d70239a5c4e2cd513a1a7f733b8.jpg"
    }
}