{
    "id": "c9adbc82-a79a-492e-bf4d-189590205e4c",
    "created_at": "2023-01-12T15:07:47.896181Z",
    "updated_at": "2025-03-27T02:15:38.038626Z",
    "deleted_at": null,
    "sha1_hash": "0a9bc283491133c45faefd486f2332e80423f35d",
    "title": "2020-11-16 - TA505- A Brief History Of Their Time",
    "authors": "",
    "file_creation_date": "2022-05-28T23:34:34Z",
    "file_modification_date": "2022-05-28T23:34:34Z",
    "file_size": 1501580,
    "plain_text": "# TA505: A Brief History Of Their Time\n\n**[blog.fox-it.com/2020/11/16/ta505-a-brief-history-of-their-time/](https://blog.fox-it.com/2020/11/16/ta505-a-brief-history-of-their-time/)**\n\n**[Threat Intel Analyst: Antonis Terefos (@Tera0017)](https://twitter.com/Tera0017)**\n\n**[Data Scientist: Anne Postma (@A_Postma)](https://twitter.com/A_Postma)**\n\n\nNovember 16, 2020\n\n\n-----\n\n**1. Introduction**\n\n**_TA505 is a sophisticated and innovative threat actor, with plenty of cybercrime experience,_**\nthat engages in targeted attacks across multiple sectors and geographies for financial gain.\nOver time, TA505 evolved from a lesser partner to a mature, self-subsisting and versatile\ncrime operation with a broad spectrum of targets. Throughout the years the group heavily\nrelied on third party services and tooling to support its fraudulent activities, however, the\ngroup now mostly operates independently from initial infection until monetization.\n\nThroughout 2019, TA505 changed tactics and adopted a proven simple, although effective,\nattack strategy: encrypt a corporate network with ransomware, more specifically the Clop\nransomware strain, and demand a ransom in Bitcoin to obtain the decryption key. Targets are\nselected in an opportunistic fashion and TA505 currently operates a broad attack arsenal of\nboth in-house developed and publicly available tooling to exploit its victims. In the\nNetherlands, TA505 is notorious for their involvement on the Maastricht University incident in\nDecember 2019.\n\nTo obtain a foothold within targeted networks, TA505 heavily relies on two pieces of malware:\n_Get2/GetandGo and SDBbot. Get2/GetandGo functions as a simple loader responsible for_\ngathering system information, C&C beaconing and command execution. SDBbot is the main\nremote access tool, written in C++ and downloaded by Get2/GetandGo, composed of three\ncomponents: an installer, a loader and the RAT.\n\nDuring the period March to June 2020, Fox-IT didn’t spot as many campaigns in which\nTA505 distributed their proven first stage malware. In early June 2020 however, TA505\ncontinued to push their flavored GetandGo-SDBbot campaigns thereby slightly adjusting\ntheir chain of infection, now leveraging HTML redirects. In the meantime – and in line with\nother targeted ransomware gangs – TA505 started to operate a data leak platform dubbed\n_“CL0P^_- LEAKS” on which stolen corporate data of non-paying victims is publicly disclosed._\n\nThe research outlined in this blog is focused around obtained Get2/GetandGo and SDBbot\nsamples. We unpacked the captured samples and organized them within their related\ncampaign. This resulted in providing us an accurate view on the working schedule of the\nTA505 group during the past year.\n\n**2. Infection Chain and Tooling**\n\nAs mentioned above, the Threat Actor uses private as well as public tooling to get access,\ninfect the network and drop Clop ransomware.\n\n**2.1. Email – XLS – GetandGo**\n\n\n-----\n\nFigure 1. Initial Infection\n\n1. The victim receives an HTML attachment. This file contains a link to a malicious website.\nOnce the file is opened in a browser, it redirects to this compromised URL.\n\n2. This compromised URL redirects again to the XLS file download page, which is operated\nby the actor.\n\n3. From this URL the victim downloads the XLS file, frequently the language of the website\ncan indicate the country targeted.\n\n4. Once the XLS is downloaded and triggered, GetandGo is executed, communicates with\nthe C&C and downloads SDBbot.\n\n**2.2. SDBbot Infection Process**\n\n\n-----\n\nFigure 2. SDBbot infection\n\nprocess\n\n1. GetandGo executes the “ReflectiveLoader” export of SDBbot.\n\n2. SDBbot contains of three modules. The Installer, Loader, RAT module.\n\n3.Initially the Installer module is executed, creates a Registry BLOB containing the Loader\ncode and the RAT module.\n\n4. The Loader module is dropped into disk and persistence is maintained via this module.\n\n\n-----\n\n5. The Loader module, reads the Registry Blob and loads the Loader code. This loader code\nis executed and Loads the RAT module which is again executed in memory.\n\n6. The RAT module communicates with the C&C and awaits commands from the\nadministrator.\n\n**2.3. TA505 Infection Chain**\n\n\n-----\n\nFigure 3. TA505 Infection Chain\nOnce SDBbot has obtained persistence, the actor uses this RAT in order to grab information\nfrom the machine, prepare the environment and download the next payloads. At this stage,\nalso the operator might kill the bot if it is determined that the victim is not interesting to them.\n\nFor further infection of victims and access of administrator accounts, FOX-IT has also\nobserved Tinymet and Cobalt Strike frequently being used.\n\n**3. TA505 Packer**\n\nTo evade antivirus security products and frustrate malware reverse engineering, malware\noperators leverage encryption and compression via executable packing to protect their\nmalicious code. Malware packers are essentially software programs that either encrypt or\ncompress the original malware binary, thus making it unreadable until it’s placed in memory.\n\nIn general, malware packers consist of two components:\n\n- A packed buffer, the actual malicious code\n\n- An “unpacking stub” responsible for unpacking and executing the packed buffer\n\nTA505 also works with a custom packer, however their packer contains two buffers. The\ninitial stub decrypts the first buffer which acts as another unpacking stub. The second\nunpacking stub subsequently unpacks the second buffer that contains the malicious\nexecutable. In addition to their custom packer, TA505 often packs their malware with a\nsecond or even a third layer of UPX (a publicly available open-source executable packer).\n\n\n-----\n\nBelow we represent an overview of the TA505 packing routines seen by Fox-IT. In total we\ncan differentiate four different packing routines based on the packing layers and the number\nof observed samples.\n\n**X64** **X86**\n\n1 UPX(TA505 Custom Packer(UPX(Malicious Binary))) 0% 0.5%\n\n2 UPX(TA505 Custom Packer(Malicious Binary)) 13.7% 0%\n\n3 TA505 Custom Packer(UPX(Malicious Binary)) 0% 98.64%\n\n4 TA505 Custom Packer(Malicious Binary) 86.3% 0.86%\n\nTA505 Packing Routines\nTo aid our research, a Fox-IT analyst wrote a program dubbed “TAFOF Unpacker” to\nstatically unpack samples packed with the custom TA505 packer.\n\nWe observed that the TA505 packed samples had a different Compilation Timestamp than\nthe unpacked samples, and they were correlating correctly with the Campaign Timestamp.\nFurthermore, samples belonging to the same campaign used the same XOR-Key to unpack\nthe actual malware.\n\n**4. Data Research**\n\nOver the course of approximately a year, Fox-IT was able to collect TA505 initial XLS\nsamples. Each XLS file contained two embedded DLLs: a x64 and a x86 version of the\nGet2/GetandGo loader.\n\nBoth DLLs are packed with the same packer. However, the XOR-key to decrypt the buffer is\ndifferent. We have “named” the campaigns we identified based on the combination of those\nXOR-Keys: x86-XOR-Key:x64-XOR-Key (e.g. campaign 0X50F1:0X1218). All of the\ntimestamps related to the captured samples were converted to UTC. For hashes that existed\non VirusTotal we used those timestamps as first seen; for the remainder, the Fox-IT Malware\nLab was used.\n\nFind below an overview on the descriptive statistics of both datasets:\n\n\n-----\n\nFigure 4. Datasets Statistics\n**4.1. Dataset 1, Working Hours and Workflow routine**\n\nDuring this period, we collected all the XLS files matching our TA505-GetandGo Yara rule\nand we unpacked them with TAFOF Unpacker. We observed that the compilation timestamps\nof the packed samples were different from the unpacked ones. Furthermore, the unpacked\none was clearly indicating the malspam campaign date.\n\nFor the Dataset 1, we used the VirusTotal first seen timestamp as an estimation of when the\ncampaign took place.\n\nIn the following graph we plotted all 81 campaigns (XOR-key combinations), and ordered\nthem chronologically based on the C&C domain registration time.\n\nWhat we noticed was, that we see relatively short orange/yellow/light green patches:\nmeaning that the domain was registered shortly before they compiled the malware, and a\nfew hours/days the first sample of this campaign was found on VirusTotal.\n\n\n-----\n\nFigure 5. Dataset 1, Campaigns overview\nAs seen by the graph, it seems clear the workflow followed most of the times by the group:\nRegistering the C&C, compiling the malware and shortly after, releasing the malspam\ncampaign.\n\nAs seen on the 37% of the campaigns, the first seen sample and compilation timestamp are\nobserved within 12 hours, while 79% of the campaigns are discovered after 1 day of the\ncompilation timestamp and 91.3% within 2 days.\n\nWe can also observe the long vacations taken during the Christmas/New Year period (20th\n_December 2019 until 13th of January 2020), another indication of Russian Cybercrime_\ngroups.\n\n\n-----\n\nFigure 6. Dataset 1, Compilation Timestamps UTC\nThe group mostly works on Mondays, Wednesdays and Thursdays, less frequently\nTuesdays, Fridays and Sundays (mostly preparing for Monday campaign). As for the time,\nearliest is usually 6 AM UTC and latest 10 PM UTC. Those time schedules give us once\nagain a small indication about the time zone where the actor is operating from.\n\n**4.2. Dataset 2, Working Hours and Workflow routine**\n\nFor the Dataset 2, we used as a source the first seen date of the InTELL Malware Lab. This\ndataset contains samples obtained after their time off. In this research we combined SDBbot\ndata as well, which is the next stage payload of Get2. Furthermore, for this second dataset\nwe managed to collect TA505 malspam emails from actual targets/victims indicating the\ncountry targeted from the email’s language.\n\n\n-----\n\nFigure 7. Dataset 2, Campaigns overview\nFrom the above graph we can clearly behold, that multiple GetandGo campaigns were\ndownloading the “same SDBbot” (same C&C). This information makes even more clear the\nactual use of the short lifespan of a GetandGo C&C, which is to miss the link with the\nSDBbot C&C (as happened for this research on the 24 of June). This allows the group for ath\nlonger lifespan of the SDBbot C&C, avoiding being easily detected.\n\nFigure 8. Dataset 2, GetandGo Compilation Timestamps UTC\nThe working days are the same since they restarted after their long time off, although now\nwe see a small difference on the working hours, starting as early as 5 AM UTC until 11 PM\nUTC. This small 1 hour difference from the earliest working time might indicate that the group\nstarted “working from home” like the rest of the world during these pandemic times. However\n\n\n-----\n\nas both periods are in respectively winter and summer time, it could also be related to\ndaylight savings time. This combined with the prior knowledge that the group is\ncommunicating in Russian language this points specifically to Ukraine being the only majority\nRussian speaking country with DST, but this would be speculation by itself.\n\nThe time information does point however to a likely Eastern European presence of the group,\nand not all members have to be necessarily in one country.\n\nFigure 9. Dataset 2, GetandGo and SDBbot Compilation Timestamps UTC\nWhen we plotted also the SDBbot compilation timestamps we observed that GetandGo is\nmore of a morning/day work for the group as they need to target victims during their working\nschedule, but SDBbot is performed mostly during the evening, as they don’t need to hurry as\nmuch in this case.\n\n**5. Dransom Time**\n\n_“Dransom time, is the period from when a malicious attack enters the network until the_\n_ransomware is released.”_\n\nOnce the initial access is achieved, the group is getting its hands on SDBbot and starts\nmoving laterally in order to obtain root/admin access to the victim company/organization.\nThis process can vary from target to target as well as the duration from initial access\n(GetandGo) to ransomware (Clop).\n\n\n-----\n\nFigure 10. Dransom Time 69 days\n\nFigure 11. Dransom Time 3 days\n\nFigure 12. Dransom Time 32 days\nThe differences on the Dransom time manifests that the group is capable of staying\nundetected for long periods of time (more than 2 months), as well as getting root access as\nfast as their time allows (3 days).\n\n- There are definitely more extreme Dransom times accomplished by this group, but the\nabove are some of the ones we encountered and managed to obtain.\n\n**6. Working Schedule**\n\nWith the above data at hand, we were able to accurately estimate the work focus of the\ngroup at specific days and times during the past year.\n\nThe below week dates are some examples of this data, plotted in a weekly schedule (time in\nUTC).\n\n- Each color represents a different campaign.\n\n**6.1. Week 42, 14-20 of October 2019**\n\n\n-----\n\nFigure 13. TA505 Weekly Schedule, week 42 2019\nDuring this week, the group released six different campaigns targeting various geographical\nregions. We observe the group preparing two Monday campaigns on Sunday. And as for\nTuesday, they managed to achieve the initial infection at Maastricht University.\n\nOn Wednesday, the group performed two campaigns targeting different regions, although\nthis time they used the same C&C domain and the only difference was the URL path\n(f1610/f1611).\n\n**6.2. Week 43, 21-27 of October 2019**\n\n\n-----\n\nFigure 14. TA505 Weekly Schedule, week 43 2019\nThroughout week 43, the group performed three campaigns. First campaign was released on\nMonday and was partially prepared on Sunday.\n\nAs for Wednesday, the group prepared and released a campaign on the same day, which\nresulted on the initial infection of Antwerp University. For the next three to four days, the\ngroup managed to get administrator access, and released Clop ransomware on Saturday of\nthe same week.\n\n**6.3. Week 51, 16-22 of December 2019**\n\n\n-----\n\nFigure 15. TA505 Weekly Schedule, week 51 2019\nWeek 51 was the last week before their ~20 days “vacation” period where Fox-IT didn’t\nobserve any new campaigns. Last campaign of this week was observed on Thursday.\n\nDuring those days of “vacations”, the group was mainly off, although they were spotted\nactivating Clop ransomware at Maastricht University and encrypting their network after more\nthan two months since the initial access (week 42).\n\n**6.4. Week 2, 6-12 of January 2020**\n\n\n-----\n\nFigure 16. TA505 Weekly Schedule, week 2 2020\nWhile on week 2 the group didn’t release any campaigns, they were observed preparing the\nfirst campaign since their “vacations” on late Sunday, to be later released on Monday of the\n3 week.rd\n\n**7. Conclusion**\n\nThe extreme Dransom times demonstrate a highly sophisticated and capable threat actor,\nable to stay under the radar for long periods of time, as well as quickly achieving\nadministrator access when possible. Their working schedule manifests a well-organized and\nwell-structured group with high motivation, working in a criminal enterprise full days starting\nearly and finishing late at night when needed. The hourly timing information does suggest\nthat the actors are in Eastern Europe and mostly working along a fairly set schedule, with a\nreasonable possibility that the group resides in Ukraine as the only majority Russian\nspeaking country observing daylight savings time. Since their MO switched after the\nintroduction of Clop ransomware in early 2019, TA505 has been an important threat to all\nkind of organizations in various sectors across the world.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-16 - TA505- A Brief History Of Their Time.pdf"
    ],
    "report_names": [
        "2020-11-16 - TA505- A Brief History Of Their Time.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536067,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653780874,
    "ts_modification_date": 1653780874,
    "files": {
        "pdf": "https://archive.orkl.eu/0a9bc283491133c45faefd486f2332e80423f35d.pdf",
        "text": "https://archive.orkl.eu/0a9bc283491133c45faefd486f2332e80423f35d.txt",
        "img": "https://archive.orkl.eu/0a9bc283491133c45faefd486f2332e80423f35d.jpg"
    }
}