{
    "id": "c9b29e83-71a6-4d5a-9aa5-bcc2e41345fe",
    "created_at": "2023-01-12T15:10:44.810828Z",
    "updated_at": "2025-03-27T02:05:30.603034Z",
    "deleted_at": null,
    "sha1_hash": "9091d148dc2e2e9f69a62024bee96c71046b7237",
    "title": "2021-12-03 - TrickBot Leverages Zoom Work from Home Interview Malspam, Heaven’s Gate and… Spamhaus-",
    "authors": "",
    "file_creation_date": "2022-05-28T05:01:52Z",
    "file_modification_date": "2022-05-28T05:01:52Z",
    "file_size": 1565185,
    "plain_text": "# TrickBot Leverages Zoom Work from Home Interview Malspam, Heaven’s Gate and… Spamhaus?\n\n**[gosecure.net/blog/2021/12/03/trickbot-leverages-zoom-work-from-home-interview-malspam-heavens-gate-and-spamhaus/](https://www.gosecure.net/blog/2021/12/03/trickbot-leverages-zoom-work-from-home-interview-malspam-heavens-gate-and-spamhaus/)**\n\nGoSecure Titan Labs December 3, 2021\n\nThe team of expert analysts at GoSecure Titan labs have reverse-engineered a new TrickBot cleverly hidden in a Zoom job interview\nemail through a sample obtained from GoSecure Titan Inbox Detection and Response (IDR). The email message contained a shortcut\n(LNK) file entitled Interview_details.lnk and that LNK file downloads a loader which will be examined in this blog. GoSecure Titan Labs\nnamed the loader TrickGate because it uses the Heaven’s Gate technique to load TrickBot, one of the world’s most prevalent botnets.\n\n## Analysis\n\n**Infection Chain**\n\nThe initial infection vector is via malspam. The email (906379938be59269713995cf29058f42), shown in Figure 1, is entitled FINAL\n_interview – September 3 and congratulates the user on passing an internal interview. It provides a link purporting to be zoom details for a_\nfinal interview. The link downloads an LNK file (6e49d82395b641a449c85bfa37dbbbc2) from\nhxxps://workdrive[.]zohoexternal[.]com/file/6c8ha295582e90c3e4655b87b82bb100f011b.\n\n_Figure 1: Zoom Interview Malspam_\n\n\n-----\n\nOnce executed, the LNK file, displayed in Figure 2, opens Notepad as a decoy, then uses curl silent to download TrickGate, a 32 bit\nC/C++ compiled portable executable (PE), from hxxp://185[.]14[.]31[.]112/images/moonfrontmars[.]png. The LNK file then saves\nTrickGate (442f1e3d2825d51810bf9929f46439d2) in the %TEMP% directory as tmp.exe and executes it using the start command.\n\n_Figure 2: LNK Contents_\n\n**TrickGate**\n\nIn TrickGate’s .rsrc section, the file HTML/DATA contains over 255 KB of encrypted shellcode. The shellcode is decrypted directly in the\n_.rsrc section using the decryption key planbetufernasoberpalade. It should be noted that the decryption key varies from sample to_\nsample. The decryption routine is depicted in Figure 3.\n\nFigure 3: TrickGate’s Initial Decryption Routine\n\nOnce decrypted, the shellcode (87dc309108bbf70e3e67efbf9d4c09da) is copied to memory and executed there. Besides executable\ncode, the shellcode also contains an encrypted 64-bit portable executable. Figure 4 shows the PE in the process of being decrypted. As\ncan be observed from the decryption routine, the decryption simply involves XORing a byte from the decryption key with a byte from the\nencrypted PE. The decrypted PE (8da11d870336c1c32ba521fd62e6f55b) only contains headers and a .text section, which is later written\nt t th ti f\n\n\n-----\n\n_Figure 4: 64-bit PE Decryption Routine_\n\nNext, the shellcode calls kernel32.CreateProcessInternalW, as depicted in Figure 5. Since the second parameter, lpApplicationName, is\nnull, the process to be created is specified by the third parameter, lpCommandLine, which contains a pointer to the path for Windows\nError Reporting Manager (wermgr.exe). The seventh parameter, dwCreationFlags, which specifies flags that define options for the\ncreated process, contains the value 0x800000C. This value corresponds to the flags CREATE_NO_WINDOW, DETACHED_PROCESS,\nand CREATE_SUSPENDED. Thus, wermgr.exe will be created in a suspended state, without a console window. This is the beginning of\nprocess hollowing, a technique used to inject and execute malware in a legitimate process.\n\n_Figure 5: Create Suspended wermgr.exe Process_\n\nAt this point, we expected to simply continue stepping through the disassembled code and observe the remaining process hollowing\nsteps. However, as displayed in Figure 6, the shellcode makes a far call to 0x33:2F60011, which in turn, makes a call to 0x10001000,\nwhich is where the 64-bit code from the decrypted PE’s .text section is located. Also displayed in Figure 6, on the left, is Process Hacker,\nwhich shows the process wermgr.exe outlined in black, signifying that it is suspended. When we try to step into the far call, instead of\nstepping into the instructions at address 0x2F60011, the debugger executes for a few moments, then the instruction pointer returns to the\nprevious function. Afterwards, wermgr.exe is no longer outlined in black, meaning that something has resumed the process, but we could\nnot observe it being resumed or whether code was injected into it before it was resumed. Furthermore, setting breakpoints on API calls\nassociated with process hollowing did not cause the debugger to pause. So, what just happened? Enter Heaven’s Gate.\n\n\n-----\n\n_Figure 6: Far Call_\n\n**Heaven’s Gate**\n\nHeaven’s Gate, first introduced in 2009, is a technique used to execute 64-bit code from a 32-bit process by using a far call, far return, or\nfar jump. Unlike regular calls, jumps, and returns, which only specify the memory address, far ones also specify the code segment,\nallowing them to call, jump, or return to a different code segment. 0x23 specifies a 32-bit code segment whereas 0x33 specifies a 64-bit\ncode segment. Thus, when 0x33 is specified with a far call within a 32-bit process, it switches the context of the 32-bit process to that of a\n64-bit process. Since we are analyzing the sample with x32dbg, which can only analyze 32-bit code, the debugger is not capable of\nhandling the process after it switches to 64-bit, and we only regain control of the process when it returns from the far call and reverts\nback to 32-bit. Most debuggers will behave in the same manner, except for WinDbg, a debugger created by Microsoft that can debug\nboth 32-bit and 64-bit code. Using WinDbg, we can step seamlessly through Heaven’s Gate and analyze the 64-bit code being executed.\n_Figure 7 displays the disassembly in WinDbg before and after crossing Heaven’s Gate. We can see that the registers before the call_\npertain to a 32-bit architecture whereas 64-bit registers are being used after the call. Moreover, the code segment (CS) register now\nholds the value 0x33.\n\n_Figure 7: Stepping Through Heaven’s Gate_\n\nEven though WinDbg can handle the context switch, it is still confused in regard to breakpoints on API calls. This fact is illustrated in\n_Figure 8. When a breakpoint is set for ntdll.NtWriteVirtualMemory, WinDbg sets it for the 32-bit ntdll.dll, as revealed by the x86 identifier_\nand ntdll.dll’s address, 0x77912d70, which falls in the 32-bit address space. However, the actual version of ntdll.NtWriteVirtualMemory\nbeing called by TrickGate is 64 bit as its address 0x7ff8’570ed4a0 lies in the 64 bit address space Therefore the debugger will not\n\n\n-----\n\npause at the requested breakpoint unless it is manually set at the appropriate address. This exemplifies just how pernicious Heaven s\nGate can be. By hiding API calls, it makes malware detection and analysis very difficult. This is why Heaven’s Gate was initially used by\nmany malware authors. However, the use of Heaven’s Gate has greatly declined since Microsoft introduced Control Flow Guard (CFG) in\nWindows 8.1. CFG places restrictions on addresses called by executing code and, as such, can mitigate Heaven’s Gate. There has been\nsome malware in recent years, such as HawkEye Reborn Keylogger and Remcos RAT, abusing Heaven’s Gate to avoid detection.\nPublications on the topic state that malware still using Heaven’s Gate does so to target legacy machines, since CFG should terminate the\nexecution on modern systems. However, we at GoSecure Titan Labs ran TrickGate on a Windows 10 machine with CFG enabled, and it\nfully executed.\n\n_Figure 8: Call to ntdll.NtWriteVirtualMemory_\n\nAs anticipated, the 64-bit shellcode in Heaven’s Gate completes the process hollowing that begin in the 32-bit shellcode. Looking once\nagain at Figure 8, we see that the value in rdx is 0x7ff7a77a650. This is the second argument passed to ntdll.NtWriteVirtualMemory and\nit specifies the base address to where data should be written. Also displayed in Figure 8 is the memory map view in x64dbg, which we\nhad opened at this point and attached the suspended wermgr.exe process to. It can be seen that the base address to be written to falls\nwithin the .text section of wermgr.exe. r8 contains an address to the buffer containing the bytes to be written and r9 contains the number\nof bytes to be written, which is 0x10, or 16 in decimal. The memory window in the top right corner displays the data stored at the address\nin r8. Therefore, the call to ntdll.NtWriteVirtualMemory writes the bytes 48 b8 00 10 6f 9d d0 01 00 00 40 0b c0 50 c3 00 to the .text\nsection of wermgr.exe. The 64-bit shellcode then calls ntdll.NtResumeThread to resume the execution of wermgr.exe, completing the\nprocess hollowing. Before wermgr.exe was resumed, we placed a breakpoint on the address in wermgr.exe where the bytes were written.\nAs displayed in Figure 9, these bytes replace the return address of the current function with the address 0x1D09D6f1000 and then\nreturns, passing execution to that address.\n\n_Figure 9: Injected Code in wermgr.exe_\n\nSo, what exactly is stored at this address? Back in Trickgate’s 64-bit shellcode, another call to ntdll.NtWriteVirtualMemory was made\nbefore resuming wermgr.exe. As can be observed from Figure 10, 0x28bd4 bytes, which is a little over 166 KB, was written to memory\nbeginning at address 0x1D09D6f0000. This written shellcode is TrickBot (8da11d870336c1c32ba521fd62e6f55b), the entry point to which\nis at address 0x1D09D6f1000. Thus, TrickGate’s 64-bit shellcode injected code into wermgr.exe so that it would execute a section of\nmemory containing TrickBot. Therefore, TrickBot is executed disguised as Microsoft’s Windows Error Reporting Manager.\n\n\n-----\n\n_Figure 10: ntdll.NtWriteVirtualMemory Writing TrickBot To Memory_\n\n**TrickBot’s Latest Variant**\n\nAs TrickBot is very well-known malware, discussed in many publications, we will only focus on interesting aspects of the current TrickBot\nvariant. It creates a folder in the C:\\Users\\<username>AppData\\Roaming\\ directory. The folder’s name is UniLiteGames with 4 characters\nappended to it, such as UniLiteGames5UIH. It then copies the original PE, TrickGate, and an obfuscated batch file, named command.bat\nto this folder. The batch file, shown in Figure 11, is obfuscated with simple string replacements. Once deobfuscated, the file contains the\ncommand start C:\\Users\\<username>\\AppData\\Roaming\\UniLiteGames<4-characters>\\<trickgate-pe-name>.\n\n_Figure 11: Obfuscated Batch File_\n\nTrickBot then creates a COM object for an interface of Task Scheduler, which it uses to create a scheduled task to run command.bat\nevery time the user logs on, as depicted in Figure 12. The name of the scheduled task is UniGamesSoft followed by the same 4\ncharacters used when creating the aforementioned folder, and the Author is UniGamesSoft.\n\n\n-----\n\n_Figure 12: TrickGate Scheduled To Execute at Logon_\n\nTrickBot contains 18 command and control (C2) IP addresses, listed in the IoCs section below. All C2 communication occurs over HTTPS\nand uses Windows HTTP Services (WinHTTP), as can be seen in Figure 13, which displays the initial check-in. The third argument\npassed to winhttp.HttpOpenRequest, which creates the HTTP request handle, is\n_/rob128/<computer_name>_W10019077.19D16C537142D197E33B9D65DF03B33E/5/file/, which specifies the path on the target server._\nAll following information sent to the C2 server is sent in similar GET requests. For example, information pertaining to the victim machine’s\nnetwork address translation (NAT) status is sent as\n_/rob128/<computer_name>_W10019077.33A1A5DD03BBFF0FD7BA9BB14F9FBCDF/14/NAT%20status/client%20is%20behind%20NAT/0/._\nAs this demonstrates, the data sent to and from the C2 server is not encrypted or obfuscated in any way, presumably since TrickBot is\nusing HTTPS to encrypt communication.\n\n_Figure 13: TrickBot’s Check-in Request_\n\nThe C2 URL path follows the same format observed in previous variants of TrickBot. rob128 follows TrickBot’s convention of using\nalphabetic characters followed by a decimal value at the beginning of the path. rob128 was observed in all other samples of the current\ncampaign. Next is the computer name of the compromised machine, followed by _W, which is hardcoded in all TrickBot samples we have\nencountered. A decimal number always follows the _W. Next is a decimal followed by a hexidecimal string 32 characters long. This string\nis created based on system time and involves using the function kernel32.GetTickCount and the instruction RDTSC, which is a time\nstamp counter. The next value in the path appears to signify the type of request being made and corresponds to values used in a switch\nstatement that controls the flow of requests, displayed in Figure 14. For example, the initial check-in, which was created in case 5, has\nthe value 5 for this part of its path. Likewise, the URL containing the NAT status uses the value 14, as it was created in the function\ncorresponding to case 14\n\n\n-----\n\n_Figure 14: C2 Communication Switch Statement_\n\nAn interesting feature observed in this variant is that after TrickBot obtains the public IP address of the victim machine, it will query IP\nblacklist services to determine the reputation of the IP address. As we can see in Figure 15, TrickBot calls ws2_32.getaddrinfo, which\nqueries information about a specified IP. The value passed to its first parameter is .zen.spamhaus.org. zen.spamhaus.org is a domain\nname system blacklist (DNSBL) service. Prepended to this is the victim machine’s IP address in reverse order. TrickBot also uses other\nDNSBL services to check the victim machine’s IP address. These include cbl.abuseat.org, b.barracudacentral.org, dnsbl_1.uceprotect.net, and spam.dnsbl.sorbs.net._\n\n_Figure 15: IP Reputation Check_\n\nTrickBot will then send a request to its C2 server stating the results of the reputation checks. As displayed in Figure 16, an example of the\nURL path generated for such requests is rob128/<computer_name>_W10019077.33A1A5DD03BBFF0FD\n_7BA9BB14F9FBCDF/14/DNSBL/not%20listed/0/. Of course, if any of the DNSBL services report the IP as blacklisted, not%20listed will_\nbe changed to listed in the URL path.\n\n_Figure 16: Reporting DNSBL Status to C2 Server_\n\n## Conclusion\n\n\n-----\n\nThe notorious botnet and information stealer, TrickBot, has remained active since 2016 and continues to live up to its name, as it\nregularly incorporates new tricks into its already long list of abilities. TrickGate Loader is the latest addition to those tricks, and a very\nimpressive one at that, since its use of Heaven’s Gate allows it to effectively conceal API calls used to load TrickBot.\n\nThrough close monitoring, analyzing, and reverse engineering, GoSecure Titan Labs, as part of our GoSecure Titan Managed Detection\nand Response offering, have created signatures to detect the emerging threats discussed in this report. One such signature, listed below\nin the Detection section, is a file detection signature for the TrickBot shellcode entitled malware_trickbot_4, which was created using\n[binlex, an opensource genetic binary trait lexer library and utility. By unpacking TrickBot shellcode from numerous samples of TrickGate,](https://github.com/c3rb3ru5d3d53c/binlex)\n[we were able to utilize binlex to extract the common traits and thus, to create an effective signature.](https://github.com/c3rb3ru5d3d53c/binlex)\n\nIncreased work from home and remote work have led to a rise in these types of threats for users. Tools like GoSecure Titan IDR, which\ncan be installed in desktop, mobile and web applications, allow users to send suspicious emails for expert analysis. This can help identify\nand remove potentially harmful threats from the environment before they spread—while also delivering samples to experts for\ndocumentation and reverse-engineering.\n\n_Malware Analyst: Sean Mahoney_\n\n## Indicators of Compromise\n```\n+======+==================================+============================+\n| type | indicator            | decription         |\n+======+==================================+============================+\n| md5 | 906379938be59269713995cf29058f42 | Malspam Email       |\n+------+----------------------------------+----------------------------+\n| md5 | 6e49d82395b641a449c85bfa37dbbbc2 | LNK Downloader       |\n+------+----------------------------------+----------------------------+\n| md5 | 442f1e3d2825d51810bf9929f46439d2 | TrickGate Loader      |\n+------+----------------------------------+----------------------------+\n| md5 | 87dc309108bbf70e3e67efbf9d4c09da | TrickGate Loader Shellcode |\n+------+----------------------------------+----------------------------+\n| md5 | 8da11d870336c1c32ba521fd62e6f55b | 64-bit PE         |\n+------+----------------------------------+----------------------------+\n| md5 | 0d9febdee78018daea87101c0d1a5362 | Trickbot Shellcode     |\n+------+----------------------------------+----------------------------+\n| ip  | 97[.]83[.]40[.]67        | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 46[.]99[.]175[.]217       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 46[.]99[.]175[.]149       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 128[.]201[.]76[.]252       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 103[.]105[.]254[.]17       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 179[.]189[.]229[.]254      | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 24[.]162[.]214[.]166       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 65[.]152[.]201[.]203       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 62[.]99[.]76[.]213        | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 216[.]166[.]148[.]187      | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 184[.]74[.]99[.]214       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 185[.]56[.]175[.]122       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 181[.]129[.]167[.]82       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 60[.]51[.]47[.]65        | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 46[.]99[.]188[.]223       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 82[.]159[.]149[.]52       | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 45[.]36[.]99[.]184        | TrickBot C2        |\n+------+----------------------------------+----------------------------+\n| ip  | 62[.]99[.]79[.]77        | TrickBot C2        |\n+======+==================================+============================+\n\n Detection\n\n```\n\n-----\n\nGoSecure Titan Labs are providing the following signatures to help the community in detecting and identifying the threats discussed in\nthis report.\n\n\n-----\n\n```\n  meta:\n   author   = \"Titan Labs\"\n   company   = \"GoSecure\"\n   description = \"LNK downloading and executing a file\"\n   hash    = \"6e49d82395b641a449c85bfa37dbbbc2\"\n   created   = \"2021-10-14\"\n   tlp     = \"white\"\n   os     = \"windows\"\n   type    = \"other\"\n   rev     = 1\n  strings:\n   $lnk    = { 4C 00 00 00 01 14 02 00 }\n   $file_1   = \".exe\" ascii wide nocase\n   $file_2   = \".dll\" ascii wide nocase\n   $file_3   = \".scr\" ascii wide nocase\n   $file_4   = \".pif\" ascii wide nocase\n   $file_5   = \"This program\" ascii wide nocase\n   $file_6   = \"TVqQAA\" ascii wide nocase \n   $execute_1 = \"cmd.exe\" ascii wide nocase\n   $execute_2 = \"/c echo\" ascii wide nocase\n   $execute_3 = \"/c start\" ascii wide nocase\n   $execute_4 = \"/c set\" ascii wide nocase\n   $execute_5 = \"%COMSPEC%\" ascii wide nocase\n   $execute_6 = \"rundll32.exe\" ascii wide nocase\n   $execute_7 = \"regsvr32.exe\" ascii wide nocase\n   $execute_8 = \"Assembly.Load\" ascii wide nocase\n   $execute_9 = \"[Reflection.Assembly]::Load\" ascii wide nocase\n   $execute_10 = \"process call\" ascii wide nocase\n   $download_1 = \"bitsadmin\" ascii wide nocase\n   $download_2 = \"certutil\" ascii wide nocase\n   $download_3 = \"ServerXMLHTTP\" ascii wide nocase\n   $download_4 = \"http\" ascii wide nocase \n   $download_5 = \"ftp\" ascii wide nocase\n   $download_6 = \".url\" ascii wide nocase \n   $download_7 = \"curl\" ascii wide nocase\n  condition:\n   $lnk at 0 and \n   any of ($file_*) and\n   any of ($execute_*) and\n   any of ($download_*)\n}\nrule malware_trick_gate_loader_0 {\n  meta:\n    author   = \"Titan Labs\"\n    company   = \"GoSecure\"\n    description = \"Tickbot Loader using Heaven's Gate\"\n    hash    = \"442f1e3d2825d51810bf9929f46439d2\"\n    created   = \"2021-11-04\"\n    os     = \"windows\"\n    type    = \"malware.loader\"\n    tlp     = \"white\"\n    rev     = 1\n  strings:  \n    $get_base_address = { \n      55 8b ec 83 ec 14 89 4? ?? 8b 4? ?? 8b 4? ?? 89 \n      48 08 6a 40 8b 5? ?? 8b 42 08 50 ff 15 ?? ?? ??\n      ?? 85 c0 74 ?? 8b 4? ?? c7 01 00 00 00 00 8b 5? \n      ?? c7 42 04 00 00 00 00 e9 ?? ?? ?? ?? 8b 4? ?? \n      8b 4? ?? 8b 51 08 89 10 8b 4? ?? 8b 08 8b 51 3c \n      89 5? ?? 8b 4? ?? 83 78 08 00 74 ?? 83 7? ?? 00 \n      74 ?? 8b 4? ?? 8b 51 08 03 5? ?? 89 5? ?? eb ?? \n      eb 07 c7 4? ?? 00 00 00 00 68 f8 00 00 00 8b 4? \n      ?? 50 ff 15 ?? ?? ?? ?? 85 c0 74 ?? 8b 4? ?? c7 \n      41 04 00 00 00 00 eb ?? 8b 5? ?? 8b 02 8b 48 3c \n      89 4? ?? 8b 5? ?? 83 7a 08 00 74 ?? 83 7? ?? 00 \n      74 ?? 8b 4? ?? 8b 48 08 03 4? ?? 89 4? ?? eb ?? \n      eb 07 c7 4? ?? 00 00 00 00 8b 5? ?? 8b 4? ?? 89 \n      42 04 8b 4? ?? 8b e5 5d c2 04 00} \n    $resolve_api_call = { \n      55 8b ec 6a ff 68 ?? ?? ?? ?? 64 a1 00 00 00 00 \n      50 64 89 25 00 00 00 00 81 ec 94 00 00 00 89 8? \n      ?? ?? ?? ?? 8b 4? ?? 50 8b 8? ?? ?? ?? ?? e8 ?? \n      ?? ?? ?? c7 4? ?? 00 00 00 00 8b 4? ?? 8b 11 8b \n      42 04 8b 4? ?? 8b 54 01 0c 89 5? ?? 33 c0 83 7? \n      ?? 00 0f 94 ?? 0f b6 c8 85 c9 74 ?? 8b 5? ?? 8b \n      02 8b 48 04 8b 5? ?? 8b 44 0a 3c 89 4? ?? 83 7? \n      ?? 00 74 ?? 8b 4? ?? 8b 11 8b 42 04 8b 4? ?? 8b \n      54 01 3c 89 5? ?? 8b 4? ?? e8 ?? ?? ?? ?? 8b 4? \n       ?? 8b 08 8b 51 04 8b 4? ?? 8b 4c 10 0c 89 8? ??\n\n```\n\n-----\n\n```\n      8? ?? ?? ?? ?? 88 50 04 c7 4? ?? ff ff ff ff 8b \n      8? ?? ?? ?? ?? 8b 4? ?? 64 89 0d 00 00 00 00 8b \n      e5 5d c2 04 00}     \n    $heap_writing_function = { \n      5? 8b ?? 6a ?? 68 ?? ?? ?? ?? 64 a1 ?? ?? ?? ?? \n      5? 64 89 ?? ?? ?? ?? ?? 5? 81 e? ?? ?? ?? ?? 5? \n      5? 5? 89 ?? ?? c7 4? ?? ?? ?? ?? ?? 8b ?? ?? 89 \n      ?? ?? ?? ?? ?? 8b ?? ?? ?? ?? ?? 83 c? ?? 89 ?? \n      ?? ?? ?? ?? 8b ?? ?? ?? ?? ?? 8a ?? 88 ?? ?? ?? \n      ?? ?? 83 8? ?? ?? ?? ?? ?? 80 b? ?? ?? ?? ?? ?? \n      75 ?? 8b ?? ?? ?? ?? ?? 2b ?? ?? ?? ?? ?? 89 ?? \n      ?? ?? ?? ?? 8b ?? ?? ?? ?? ?? 33 ?? 89 ?? ?? 89 \n      ?? ?? 8b ?? ?? 8b ?? 8b ?? ?? 8b ?? ?? 8b ?? ?? \n      ?? 89 ?? ?? 8b ?? ?? ?? 89 ?? ?? 83 7? ?? ?? 7c \n      ?? 7f ?? 83 7? ?? ?? 76 ?? 8b ?? ?? 8b ?? 8b ?? \n      ?? 8b ?? ?? 8b ?? ?? ?? 89 ?? ?? 8b ?? ?? ?? 89 \n      ?? ?? 8b ?? ?? 3b ?? ?? 7c ?? 7f ?? 8b ?? ?? 3b \n      ?? ?? 76 ?? 8b ?? ?? 8b ?? 8b ?? ?? 8b ?? ?? 8b \n      ?? ?? ?? 89 ?? ?? 8b ?? ?? ?? 89 ?? ?? 8b ?? ?? \n      2b ?? ?? 8b ?? ?? 1b ?? ?? 89 ?? ?? ?? ?? ?? 89 \n      ?? ?? ?? ?? ?? eb ?? c7 8? ?? ?? ?? ?? ?? ?? ?? \n      ?? c7 8? ?? ?? ?? ?? ?? ?? ?? ?? 8b ?? ?? ?? ?? \n      ?? 89 ?? ?? 8b ?? ?? ?? ?? ?? 89 ?? ?? 8b ?? ?? \n      5? 8d ?? ?? e8 ?? ?? ?? ?? c7 4? ?? ?? ?? ?? ?? \n      0f b6 ?? ?? f7 d? 1b ?? f7 d? 83 e? ?? 83 f? ?? \n      75 ?? 8b ?? ?? 83 c? ?? 89 ?? ?? e9 ?? ?? ?? ??} \n  condition:\n    uint16(0) == 0x5a4d and\n    uint32(uint32(0x3c)) == 0x00004550 and\n    all of them\n}\nrule malware_trick_gate_loader_shellcode_0 {\n  meta:\n    author   = \"Titan Labs\"\n    company   = \"GoSecure\"\n    description = \"Shellcode decrypted from TrickGate's resource section\"\n    hash    = \"87dc309108bbf70e3e67efbf9d4c09da\"\n    created   = \"2021-11-04\"\n    os     = \"windows\"\n    type    = \"malware.loader\"\n    tlp     = \"white\"\n    rev     = 1\n  strings:  \n    $decryption_routine = { \n      5? 4? 75 ?? 5? 8b ?? 8b ?? 05 ?? ?? ?? ?? 68 ??\n      ?? ?? ?? 89 ?? ?? 5? 8b ?? 4? 8b ?? 4? 8b ?? 66 \n      ad 85 ?? 74 ?? 3b ?? 77 ?? 2b ?? c1 e? ?? 5? 8b \n      ?? 03 ?? 81 c? ?? ?? ?? ?? 8b ?? 5? 03 ?? 5? eb \n      ?? 89 ?? ?? b? ?? ?? ?? ?? 03 ?? 8b ?? 2b ?? 2b \n      ?? 8b ?? 89 ?? ?? 8b ?? 83 e? ?? 8b ?? c7 4? ?? \n      ?? ?? ?? ?? 89 ?? 5? ff d?}\n  condition:\n    $decryption_routine\n}\nrule malware_trickbot_4 {\n  meta:\n    author   = \"Titan Labs\"\n    company   = \"GoSecure\"\n    description = \"Unpacked Trickbot Shellcode\"\n    created   = \"2021-11-26\"\n    type    = \"malware.botnet\"\n    os     = \"windows\"\n    tlp     = \"white\"\n    hash    = \"0d9febdee78018daea87101c0d1a5362\"\n    rev     = 1\n  strings:\n    $heap_write   = {\n      90 90 90 90 90 90 90 90 90 90 90 90 90 0f b6 1a\n      88 18 0f b6 5a ?? 88 58 ?? 0f b6 5a ?? 88 58 ??\n      0f b6 5a ?? 88 58 ?? 0f b6 5a ?? 88 58 ?? 0f b6\n      5a ?? 88 58 ?? 0f b6 5a ?? 88 58 ?? 49 83 c0 f8\n      0f b6 5a ?? 48 8d 52 ?? 88 58 ?? 48 8d 40 ?? 75\n      bc}\n    $requestOptions = {\n      c7 44 24 ?? 00 33 ?? ?? 4c 8d 44 24 ?? ba 1f ??\n      ?? ?? 41 b9 04 ?? ?? ?? 48 8b c8 ff 15 ?? ?? ??\n       ?? 85 c0 0f 84 96}\n\n```\n\n-----\n\n```\n      c7 44 24 ?? 68 ?? ?? ?? 48 8b ce ff 15 ?? ?? ??\n      ?? 48 8b 8c 24 ?? ?? ?? ?? ?? 89 7c 24 48 48 89\n      74 24 ?? 48 c7 44 24 ?? ?? ?? ?? ?? 48 c7 44 24\n      ?? ?? ?? ?? ?? c7 44 24 ?? ?? ?? ?? ?? c7 44 24\n      ?? ?? ?? ?? ?? 33 d2 45 33 c0 45 33 c9 ff 15 ??\n      ?? ?? ?? 85 c0 74 68}\n    $get_path    = {\n      33 db 48 8d 8c 24 ?? ?? ?? ?? ba 05 01 ?? ?? 45\n      33 c9 4c 8b c6 ff 15 ?? ?? ?? ?? 85 c0 48 8b fe\n      48 0f 44 fb 48 85 ff 75 0a}\n    $incrementVars = {\n      33 ff 48 8d 6c 24 ?? 90 90 90 90 90 90 90 90 90\n      90 ff c7 66 83 7d ?? ?? 48 8d 6d ?? 75 f3}\n    $readFile_1   = {\n      48 c7 44 24 ?? ?? ?? ?? ?? 4c 8d 4c 24 ?? 48 8b\n      cb 49 8b d4 44 8b c5 ff 15 ?? ?? ?? ?? 33 ff 85\n      c0 0f 95 c0 74 08}\n    $readFile_2   = {\n      4c 8b 25 ?? ?? ?? ?? 33 f6 33 d2 45 33 c0 41 b9\n      02 ?? ?? ?? 48 8b cb 41 ff d4 8b e8 89 6c 24 ??\n      33 d2 45 33 c0 45 33 c9 48 8b cb 41 ff d4 85 ed\n      74 58}\n    $query_headers = {\n      48 8b 4f ?? 48 8d 44 24 ?? 48 89 44 24 ?? 48 c7\n      44 24 ?? ?? ?? ?? ?? 4c 8d 4c 24 ?? ba 13 00 00\n      20 45 33 c0 ff 15 ?? ?? ?? ?? 8b c8 b8 01 ?? ??\n      ?? 85 c9 75 38}\n    $return_static = {\n      55 48 8b ec 48 83 e4 f8 48 8d 0d ?? ?? ff ff 48\n      8d 05 ?? ff ff ff 48 2b c1 48 8b e5 5d c3}\n    $logic_1    = {\n      44 89 5c 24 ?? 4c 89 7c 24 ?? 48 89 54 24 ?? 48\n      8b 44 24 ?? 48 8b 6c 24 ?? 48 3b e8 bd 4a c7 43\n      0a 41 0f 42 ee 48 8b 44 24 ?? 81 fd af b7 12 f5\n      7f 43}\n    $logic_2    = {\n      48 83 7c 24 ?? ?? b8 95 6a 7d b9 b9 9f f8 cd a9\n      0f 45 c1 e9 73 fb ff ff}\n    $logic_3    = {\n      48 89 9c 24 ?? ?? ?? ?? 89 74 24 ?? 48 8b 84 24\n      ?? ?? ?? ?? 80 38 ?? b8 0d 1a 75 84 b9 e1 21 8b\n      44 0f 45 c1 e9 6f fa ff ff}\n    $logic_4    = {\n      48 8b 44 24 ?? 48 89 44 24 ?? 48 8b 84 24 ?? ??\n      ?? ?? 48 89 84 24 ?? ?? ?? ?? 48 8b 84 24 ?? ??\n      ?? ?? 48 89 84 24 00 ?? ?? ?? 48 8b 84 24 ?? ??\n      ?? ?? 48 89 84 24 ?? ?? ?? ?? 48 8b 84 24 ?? ??\n      ?? ?? 48 89 84 24 ?? ?? ?? ?? 49 8b 07 0f b7 08\n      89 4c ?? 24 48 83 c0 02 49 89 07 48 89 84 24 ??\n      ?? ?? ?? 83 7c ?? 24 ?? b8 6b 7f a2 a5 b9 96 d1\n      66 15 0f 45 c1 e9 a0 fc ff ff}\n    $logic_5    = {\n      48 8b 44 24 ?? 8a ?? 48 8b 6c 24 ?? 88 45 ?? 48\n      8b 44 24 ?? 80 38 ?? bd 9e 58 3a b3 41 0f 44 e9\n      48 8b 44 24 ?? eb b5}\n    $logic_6    = {\n      48 8b 6c 24 ?? 48 ff c5 48 89 6c 24 ?? 48 8b 6c\n      24 ?? 48 ff c5 48 89 6c 24 ?? 48 8b 6c 24 ?? 8a\n      5d ?? 88 5c 24 ?? 80 7c 24 ?? ?? bd 64 55 26 9d\n      41 0f 45 ea e9 33 ff ff ff}\n    $logic_7    = {\n      48 8b 84 24 ?? ?? ?? ?? 8b ?? 48 8b 4c 24 ?? 48\n      8d 14 01 48 89 94 24 ?? ?? ?? ?? 8b 54 01 ?? 4c\n      8b c3 8b df 44 8b ce 48 8b 74 24 ?? 48 03 f2 48\n      89 b4 24 ?? ?? ?? ?? 49 8b d8 8b 54 01 ?? 48 8b\n      74 24 ?? 48 03 f2 48 89 b4 24 ?? ?? ?? ?? 41 8b\n      f1 8b 44 01 ?? 48 03 44 24 ?? 48 89 84 24 ?? ??\n      ?? ?? b8 f7 db c4 c5 49 8b cd 48 89 4c 24 ?? e9\n      96 f9 ff ff}\n    $logic_8    = {\n      49 63 45 ?? 4c 89 6c 24 ?? 48 8b 4c 24 ?? 48 8d\n      84 01 ?? ?? ?? ?? 48 89 84 24 ?? ?? ?? ?? 48 8b\n      84 24 ?? ?? ?? ?? 48 89 84 24 ?? ?? ?? ?? 48 8b\n      84 24 ?? ?? ?? ?? 83 38 ?? b8 4d 1d f8 fb b9 c3\n      f8 ec ?? 0f 45 c1 e9 05 f7 ff ff}\n    $logic_9    = {\n      49 8b 07 0f b7 08 89 4c 24 ?? 48 83 c0 02 48 89\n      84 24 ?? ?? ?? ?? 48 8b 84 24 ?? ?? ?? ?? 49 89\n       07 83 7c 24 ?? ?? b8 18 ab 0a 99 b9 28 86 7a 7a\n\n```\n\n-----\n\n```\n    $logic_10    = {\n      83 7c 24 ?? ?? b8 79 5c ba 4b b9 a9 a6 56 b9 0f\n      4f c1 8b 4c 24 ?? 89 4c 24 ?? e9 50 fa ff ff}\n    $logic_11    = {\n      8b 44 24 ?? 48 89 84 24 ?? ?? ?? ?? 48 8b 84 24\n      ?? ?? ?? ?? 48 8b 8c 24 ?? ?? ?? ?? 48 8d 04 88\n      48 89 84 24 ?? ?? ?? ?? 48 8b 84 24 ?? ?? ?? ??\n      8b ?? 89 44 24 ?? 83 7c 24 ?? ?? b8 38 55 90 88\n      b9 29 a5 0e be 0f 45 c1 e9 12 fe ff ff}\n    $logic_12    = {\n      8b 44 24 ?? 48 89 84 24 ?? ?? ?? ?? 48 8b 84 24\n      ?? ?? ?? ?? 48 8b 8c 24 ?? ?? ?? ?? 8b 04 81 48\n      03 44 24 ?? 48 89 84 24 ?? ?? ?? ?? b8 b9 23 c7\n      33 33 f6 48 8b 9c 24 ?? ?? ?? ?? e9 96 fe ff ff\n      }\n    $logic_13    = {\n      8b 44 24 ?? 89 44 24 ?? 48 8b 84 24 ?? ?? ?? ??\n      48 83 c0 18 48 89 84 24 ?? ?? ?? ?? 48 8b 84 24\n      ?? ?? ?? ?? 8b 4c 24 ?? 3b 08 b8 5c b1 a7 79 b9\n      26 e6 ba 02 0f 42 c1 e9 21 fb ff ff}\n    $logic_14    = {\n      8b 44 24 ?? 89 44 24 ?? 8b 44 ?? 24 8b 4c 24 ??\n      3b c8 b8 d0 78 7a 87 b9 07 2b 67 eb 0f 42 c1 c7\n      44 24 ?? ?? ?? ?? ?? e9 58 f9 ff ff}\n    $logic_15    = {\n      8b 44 ?? 24 8b 4c 24 ?? 3b c8 b8 65 79 3f 9a b9\n      3c 26 ab 78 0f 44 c1 8b 4c 24 ?? 89 4c 24 ?? e9\n      ff f7 ff ff}\n    $logic_16    = {\n      8b 44 24 ?? 8b c8 f7 d1 81 e1 4d 5e 9b 89 25 b2\n      a1 64 76 0b c1 35 dc fe ed bc 89 84 24 ?? ?? ??\n      ?? b8 e1 65 b5 e3 33 ff e9 85 f7 ff ff}\n    $logic_17    = {\n      8b 74 24 ?? f7 de bf 01 ?? ?? ?? 2b fe 48 8b 74\n      24 ?? 8a 5c 24 ?? 88 1e 48 8b 74 24 ?? 48 ff c6\n      bd f3 dc 32 70 eb 2a}\n    $logic_18    = {\n      f6 44 24 ?? 01 b8 5d ff b5 c1 b9 7a 22 79 97 0f\n      45 c1 e9 0d ff ff ff}\n  condition:\n    filesize < 328KB and 10 of them\n}\nalert http any any -> $EXTERNAL_NET any (\n msg:\"GS MALWARE Trickbot C2 Communication\"; \n content:\"_W\"; http_uri; fast_pattern; \n pcre:\"/^\\/\\w+\\d+\\/[^\\/]+_W\\d+\\.[A-F0-9]{32}\\/\\d+\\//U\"; \n flow:to_server, established; \n metadata:created 2019-06-06, updated 2021-11-25, type malware.botnet, os windows, tlp white, id 3; \n classtype:trojan-activity; \n sid:300000464; \n rev:3;\n)\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-03 - TrickBot Leverages Zoom Work from Home Interview Malspam, Heaven’s Gate and… Spamhaus-.pdf"
    ],
    "report_names": [
        "2021-12-03 - TrickBot Leverages Zoom Work from Home Interview Malspam, Heaven’s Gate and… Spamhaus-.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536244,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653714112,
    "ts_modification_date": 1653714112,
    "files": {
        "pdf": "https://archive.orkl.eu/9091d148dc2e2e9f69a62024bee96c71046b7237.pdf",
        "text": "https://archive.orkl.eu/9091d148dc2e2e9f69a62024bee96c71046b7237.txt",
        "img": "https://archive.orkl.eu/9091d148dc2e2e9f69a62024bee96c71046b7237.jpg"
    }
}