{
    "id": "ca35d93c-145c-40cc-9082-617d53833e2b",
    "created_at": "2023-01-12T15:06:44.64416Z",
    "updated_at": "2025-03-27T02:17:02.410113Z",
    "deleted_at": null,
    "sha1_hash": "16698adc2b07e41507c3ff81400bd6bf753aed62",
    "title": "2022-05-17 - A peek behind the BPFDoor",
    "authors": "",
    "file_creation_date": "2022-05-25T20:30:45Z",
    "file_modification_date": "2022-05-25T20:30:45Z",
    "file_size": 2280106,
    "plain_text": "# A peek behind the BPFDoor\n\n**[elastic.github.io/security-research/intelligence/2022/05/04.bpfdoor/article](https://elastic.github.io/security-research/intelligence/2022/05/04.bpfdoor/article/#)**\n\n[BPFDoor Malware Red Menshen](https://elastic.github.io/security-research/tags/#bpfdoor)\n\n2022-05-17\n\n## Preamble¶\n\n[BPFDoor is a backdoor payload specifically crafted for Linux. Its purpose is for long-term persistence in order to](https://doublepulsar.com/bpfdoor-an-active-chinese-global-surveillance-tool-54b078f1a896)\ngain re-entry into a previously or actively compromised target environment. It notably utilizes BPF along with a\nnumber of other techniques to achieve this goal, taking great care to be as efficient and stealthy as possible. PWC\nresearchers discovered this very interesting piece of malware in 2021. PWC attributes this back door to a specific\ngroup from China, Red Menshen, and detailed a number of interesting components in a high-level threat research\n[post released last week.](https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/cyber-year-in-retrospect/yir-cyber-threats-report-download.pdf)\n\nPWC’s findings indicated that  Red Menshen had focused their efforts on targeting specific Telecommunications,\nGovernment, Logistics, and Education groups across the Middle East and Asia. This activity has been across a\nMonday-to-Friday working period, between 01:00 UTC and 10:00 UTC, indicating that the operators of the\nmalware were consistent in their attacks, and operation during a working week.\n\nPerhaps most concerningly, the payload itself has been observed across the last 5 years in various phases of\ndevelopment and complexity, indicating that the threat actor responsible for operating the malware has been at it\nfor some time, undetected in many environments.\n\nBPFDoor Tools\n\nThe Elastic Security Team has created a few tools that will aid researchers in analyzing the BPFDoor malware.\n\nThe BPFDoor scanner will allow you to scan for hosts infected with the BPFDoor malware and the BPFDoor\nconfiguration extractor will allow you to extrapolate the malware’s configuration or hardcoded values which can\nlead to additional observations you can use for further analysis, developing additional signatures or connecting to\nthe backdoor utilizing our client.\n\n## General Analysis¶\n\nRed Menshen has leveraged a network of VPS servers to act as a controller network and access these systems via\ncompromised routers based out of Taiwan. The routers act as a VPN network for the adversarial groups via a\n[sequence of specifically crafted packets sent to an infected host. Researchers have indicated that this payload is](https://doublepulsar.com/bpfdoor-an-active-chinese-global-surveillance-tool-54b078f1a896)\npervasive and that compromised hosts have been observed across the US, South Korea, Hong Kong, Turkey, India,\nVietnam, and Myanmar.\n\nBPF-based malware payloads, while ultimately uncommon, serve a specific purpose on Linux-based hosts where\n[stealthy and performant operations are critical for success. Tools such as BPFDoor are not alone. Recently, Pangu](https://doublepulsar.com/bpfdoor-an-active-chinese-global-surveillance-tool-54b078f1a896)\n[Labs discovered a payload by the name of Bvp47, a sensor that used stealthy BPF-based telemetry to acquire](https://www.pangulab.cn/en/post/the_bvp47_a_top-tier_backdoor_of_us_nsa_equation_group/)\ndetailed information about the workloads running on infected hosts.\n\n[eBPF (Extended Berkeley Packet Filters), a new evolution of BPF used increasingly today, is gaining popularity](https://ebpf.io/)\namongst system operators given its efficiency and proven, powerful capabilities leveraged often for system\nperformance, network, and security telemetry collection. Adversaries are taking note and it is our assumption that\nmalware targeting cloud systems will increasingly leverage these methods in the future.\n\n## Attack Lifecycle¶\n\n\n-----\n\nThis inherently passive backdoor payload is built to be a form of persistence a method to regain access if the first\nor second stage payloads are lost. It is built for and intended to be installed on high-uptime servers or appliances,\nIoT/SCADA, or cloud systems with access to the Internet. The backdoor usually sits in temporary storage so if a\nserver were to be rebooted or shut down, the backdoor would be lost.\n\nIt should be assumed that if this malware is found on a system the initial-access (1st stage) or post-exploitation\n(2nd stage) payloads are still most likely present and possibly active elsewhere in the environment. This backdoor\nexcels at stealth, taking every opportunity to blend in and remain undetected.\n\nIn the below steps, we will break BPFDoor’s actions down according to the vast majority of the samples available.\n\n1. When executed the binary copies itself into `/dev/shm/ . A temporary filesystem` `/dev/shm stands for`\n\nshared memory and is a temporary file storage facility serving as an efficient means of inter-process\ncommunication\n2. Renames its process to `kdmtmpflush, a hardcoded process name`\n3. Initializes itself with the `-init flag and forks itself. Forking in Linux means creating a new process by`\n\nduplicating the calling process\n4. Deletes itself by removing the original binary invoked. The forked process continues to run\n\n[5. Alters the forked processes’ creation and modification time values, also known as timestomping](https://attack.mitre.org/techniques/T1070/006/)\n6. Creates a new process environment for itself and removes the old one setting (spoofing) a new process name.\n\nIt changes the way it appears on the system akin to wearing a mask. The process is still `kdmtmpflush but if`\nyou were to run a ps you would see whatever value it set\n7. Creates a process ID (PID) file in `/var/run . PID files are text files containing the process of the associated`\n\nprogram meant for preventing multiple starts, marking residency, and used by the program to stop itself.\nThis file resides in `/var/run, another temporary file storage facility`\n8. Creates a raw network socket. On Linux, a socket is an endpoint for network communication that allows you\n\nto specify in detail every section of a packet allowing a user to implement their own transport layer protocol\nabove the internet (IP) level\n[9. Sets BPF filters on the raw socket. BPF allows a user-space program to attach a filter onto any socket and](https://www.kernel.org/doc/html/v5.12/networking/filter.html)\n\nallow or disallow certain types of data to come through the socket\n10. Observes incoming packets\n\n11. If a packet is observed that matches the BPF filters and contains the required data it is passed to the backdoor\n\nfor processing\n12. It forks the current process again\n13. Changes the forked processes working directory to `/`\n14. Changes (spoofs) the name of the forked process to a hardcoded value\n15. Based on the password or existence of a password sent in the “magic packet” the backdoor provides a reverse\n\nshell, establishes a bind shell, or sends back a ping\n\nAtypical BPFDoor sample\n\n[Of note there is one sample we have come across that does not seem to exhibit steps 1 - 4. It doesn’t alter its initial](https://www.virustotal.com/gui/file/07ecb1f2d9ffbd20a46cd36cd06b022db3cc8e45b1ecab62cd11f9ca7a26ab6d/detection)\nname to a hardcoded value and simply executes from its placed location, otherwise, it models the same behavior.\n\nBelow you can see visual representations of the BPFDoor process tree, utilizing Elastic’s Analyzer View. The first\nimage displays the tree prior to active use of the backdoor (i.e reverse shell, bind shell, or pingback) and the second\nimage after a reverse shell has connected and performed post-exploitation activities.\n\n\n-----\n\nElastic Analyzer View of the BPFDoor initial invocation process tree\n\nElastic Analyzer View of BPFDoor following a reverse shell connection and post exploitation actions\n\n## Defense Evasion Insights¶\n\nBPFDoor is interesting given the anti-forensics, and obfuscation tactics used. Astute readers will observe slight\ndifferences in the PID tree visible when running a `ps ajxf on an infected host when compared to executed data`\nwithin the Analyzer View inside of Elastic. This is due to the process name spoofing mentioned in step 6 (above) of\nthe attack lifecycle above. The image below is taken from a system running BPFDoor with an active reverse shell\nconnection established:\n\nAn observed running process created by the BPFDoor reverse shell\n\nThe difference lies in the fact that `kdmtmpflush and` `sh are run prior to spoofing, and are captured at runtime`\nby Elastic Endpoint. This is an accurate representation of the processes active on the host, further confirming the\nimportance of appropriate observation software for Linux hosts - you can’t always trust what you see on the local\nsystem:\n\n\n-----\n\nElastic Analyzer View of BPFDoor demonstrating real process capture.\n\nBPFDoor also holds in its repertoire the ability to subvert the traditional Linux socket client - server architecture in\norder to hide its malicious traffic. The methods which it utilizes to achieve this are both unusual and intriguing.\n\nThe sockets interface is almost synonmous with TCP/IP communication. This simple interface has endured for\nover 40 years - predating both Linux and Windows implementations.\n\n\n-----\n\nExample of how TCP/IP and socket interfaces function\n\n\n-----\n\nBPFDoor uses a raw socket (as opposed to cooked ones that handle IP/TCP/UDP headers transparently) to\nobserve every packet arriving at the machine, ethernet frame headers and all. While this might sound like a\nstealthy way to intercept traffic, it’s actually not – on any machine with a significant amount of network traffic the\nCPU usage will be consistently high.\n\nThat’s where BPF comes in - an extremely efficient, kernel-level packet filter is the perfect tool to allow the implant\nto ignore 99% of network traffic and only become activated when a special pattern is encountered. This implant\nlooks for a so-called magic packet in every TCP, UDP and ICMP packet received on the system.\n\nOnce activated, a typical reverse shell - which this back door also supports - creates an outbound connection to a\nlistener set up by the attacker. This has the advantage of bypassing firewalls watching inbound traffic only. This\nmethod is well-understood by defenders, however. The sneakiest way to get a shell connected would be to reuse an\nexisting packet flow, redirected to a separate process.\n\nIn this attack, the initial TCP handshake is done between the attacker and a completely legitimate process – for\nexample nginx or sshd. These handshake packets happen to be also delivered to the backdoor (like every packet on\nthe system) but are filtered out by BPF. Once the connection is established, however, BPFDoor sends a magic\npacket to the legitimate service. The implant receives it and makes a note of the originating IP and port the attacker\nis using, and it opens a new listening socket on an inconspicuous port (42391 - 43391).\n\nThe implant then reconfigures the firewall to temporarily redirect all traffic from the attacker’s IP/port\ncombination to the new listening socket. The attacker initiates a second TCP handshake on the same legitimate\nport as before, only now iptables forwards those packets to the listening socket owned by the implant. . This\nestablishes the communication channel between attacker and implant that will be used for command and control.\nThe implant then covers its tracks by removing the iptables firewall rules that redirected the traffic.\n\nDespite the firewall rule being removed, traffic on the legitimate port will continue to be forwarded to the implant\ndue to how Linux statefully tracks connections. No visible traffic will be addressed to the implant port (although it\nwill be delivered there).\n\nA diagram representing the aforementioned network flows\n\n## BPF Filters¶\n\n\n-----\n\n[As stated in step 9 (above), BPF or Berkeley Packet Filters is a technology from the early 90s that allows a user](https://www.kernel.org/doc/html/v5.12/networking/filter.html)\nspace program to attach a network filter onto any socket and allow or disallow certain types of data to come\nthrough the socket. These filters are made up of bytecode that runs on an abstract virtual machine in the Linux\nkernel. The BPF virtual machine has functionality to inspect all parts of incoming packets and make an allow/drop\ndecision based on what it sees. . You can see in the image example below what this looks like within the BPFDoor\nsource code:\n\nBPFDoor source code BPF Filters\n\nWe took this BPF code, converted it, and wrote it up as pseudo code in an effort to aid our research and craft\npackets able to successfully get through these filters in order to activate the backdoor.\n\n\n-----\n\nBPFDoor source code BPF Filter Pseudocode\n\nThe above capabilities allow BPFDoor to attach a filter onto any socket and allow or disallow certain types of data\nto come through the socket - used carefully by the adversary to invoke a series of different functions within the\npayload.\n\n## Historical Analysis¶\n\nWe wanted to see over time, between BPFDoor payloads, what, if anything, the threat actors modified. A number of\n[samples were detonated and analyzed ranging from the uploaded source code to a sample uploaded last month. We](https://www.virustotal.com/gui/file/599ae527f10ddb4625687748b7d3734ee51673b664f2e5d0346e64f85e185683/detection)\nfound that the behavior over time did not change a great deal. It maintained the same relative attack lifecycle with\n\n\n-----\n\na few variations with the hardcoded values such as passwords, process names, and files this is not uncommon\nwhen compared to other malware samples that look to evade detection or leverage payloads across a variety of\nvictims.\n\nWe posture that the threat group would change passwords and update process or file names in an effort to improve\noperational security and remain hidden. It also makes sense that the general functionality of the backdoor would\nnot change in any great way. As the saying goes “If it’s not broken, don’t fix it”. Our malware analysis and reverse\n[engineering team compared the source code (uploaded to VirusTotal and found on Pastebin) to a recently uploaded](https://www.virustotal.com/gui/file/8b9db0bc9152628bdacc32dab01590211bee9f27d58e0f66f6a1e26aea7552a6/detection)\nsample highlighting some of the notable changes within the main function of the malware in the images below.\n\nA side by side comparison of the main functions for the Pastebin source code and a sample uploaded to VT last month focusing on\n\nthe hardcoded string values for the passwords, process names and file name\n\n[As we mentioned earlier, one recent sample we have come across that does not seem to exhibit some of the tactics](https://www.virustotal.com/gui/file/07ecb1f2d9ffbd20a46cd36cd06b022db3cc8e45b1ecab62cd11f9ca7a26ab6d/detection)\nof prior payloads has been observed - It doesn’t alter its initial name to a hardcoded value and simply executes\nfrom its placed location, otherwise, it models relatively the same behavior.\n\n## Linux Malware Sophistication¶\n\nA trend we have had the privilege of observing at Elastic, is the threat landscape of Linux targeted attacks - these\nbeing focused often on cloud workloads, or systems that typically have less observational technology configured in\nmany of the environments we see. The trend of complex, well-designed payloads is something that is often simply\noverlooked, and specifically in the case of BPFDoor, remained hidden for years.\n\nIt is important to consider these workloads a critical component of your security posture: A lack of visibility within\ncloud workloads will eventually lead to large gaps in security controls - adversarial groups are further growing to\nunderstand these trends, and act accordingly. Best practices state that endpoint defenses should be consistent\nacross the fleet of systems under management, and conform to a least privilege architecture.\n\n## Detection of BPFDoor¶\n\nAfter researching this malware it became apparent as to why the backdoor remained in use and hidden for so long.\nIf you aren’t intimately familiar with Linux process abnormalities or weren’t looking for it you would generally not\ndetect it. Even though it takes advantage of Linux capabilities in a stealthy manner to evade detection, there are\nstill opportunities for both behavioral and signature-based detections.\n\n\n-----\n\nThe first area of opportunity we witnessed while testing was the behavior we observed during the initial execution\nof the malware, specifically its working directory, in a shared memory location `/dev/shm . This is a native`\ntemporary filesystem location in Linux that uses RAM for storage, and a binary executing from it let alone\ngenerating network connections is fairly uncommon in practice.\n\nDuring execution, BPFDoor removes existing files from `/dev/shm and copies itself there prior to initialization. A`\ndetection for this would be any execution of a binary from this directory as root (you have to be root to write to and\nread from this directory).\n\nThis was verified by detonating the binary in a VM while our Elastic Agent was installed and observing the\nsequence of events. You can see an image of this detection on the Kibana Security Alerts page below. This rule is\n[publicly available as an Elastic SIEM detection rule - Binary Executed from Shared Memory Directory:](https://github.com/elastic/detection-rules/blob/main/rules/linux/execution_process_started_in_shared_memory_directory.toml)\n\nElastic Alert in Kibana - Binary Executed from Shared Memory Directory\n\nThe second opportunity we noticed, for detection, was a specific PID file being created in `/var/run . We noticed`\n[the dropped PID file was completely empty while doing a quick query via the Osquery integration to the](https://docs.elastic.co/en/integrations/osquery_manager)\n```\n/var/run directory. While this is not inherently malicious, it is unusual for the file size of a PID to be 0 or above\n10 bytes and thus we created an additional rule centered around detecting this unusual behavior.\n\n```\nOur [Abnormal Process ID or Lock File Created rule identifies the creation of a PID file in the main directory of](https://github.com/elastic/detection-rules/blob/main/rules/linux/execution_abnormal_process_id_file_created.toml)\n```\n/var/run with no subdirectory, ignoring common PID files to be expected:\n\n```\n\n-----\n\nElastic Alert in Kibana - Abnormal Process ID or Lock File Created\n\nThe third area we wanted to look at was the network connections tied to two of the three capabilities (reverse shell\nand bind shell) the backdoor possesses. We wanted to see if there were any suspicious network connections tied to\nprocess or user abnormalities we could sequence together based off of the way BPFDoor handles establishing a\nreverse or bind shell.\n\nThe reverse shell was the first capability focused on. Taking a deep look at the process tree in and around the\nreverse shell establishment allowed us to key in on what would be considered a strange or even abnormal sequence\nof events leading to and involving an outbound network connection.\n\nWe developed a hunt rule sequence that identifies an outbound network connection attempt followed by a session\nid change as the root user by the same process entity. The reason we developed these network focused hunt rules is\ndue to possible performance issues caused if running these continually.\n\nThe bind shell was the last capability we honed in on. Identifying an abnormal sequence of events surrounding the\nbind shell connection was difficult due to the way it forks then accepts the connection and kills the accepting\nprocess post established connection. Therefore we had to focus on the sequence of events within the process entity\nid directly involving the network connection and subsequent killing of the accepting process.\n\nAfter developing the 2 detection rules along with the 2 hunt rules listed below and in addition to the 6 YARA\nsignatures deployed we were able to detect BPFDoor in a myriad of different ways and within different stages of its\nlife cycle. As stated earlier though, if you detect this malware in your environment it should be the least of your\nconcerns given the threat actor will most likely have already successfully compromised your network via other\nmeans.\n\nElastic Detection Summary of complete BPFDoor attack lifecycle\n\n### Existing Detection Rules¶\n\nThe following Elastic Detection Rules will identify BPFDoor activity:\n\n\n-----\n\n[Abnormal Process ID or Lock File Created](https://github.com/elastic/detection-rules/blob/main/rules/linux/execution_abnormal_process_id_file_created.toml)\n[Binary Executed from Shared Memory Directory](https://github.com/elastic/detection-rules/blob/main/rules/linux/execution_process_started_in_shared_memory_directory.toml)\n\n### Hunting Queries¶\n\nThis EQL rule can be used to successfully identify BPFDoor reverse shell connections having been established\nwithin your environment:\n\nEQL BPFDoor reverse shell hunt query\n```\nsequence by process.entity_id with maxspan=1m\n[network where event.type == \"start\" and event.action == \"connection_attempted\" and user.id == \"0\" and\nnot process.executable : (\"/bin/ssh\", \"/sbin/ssh\", \"/usr/lib/systemd/systemd\")]\n[process where event.action == \"session_id_change\" and user.id == \"0\"]\n\n```\nElastic Alert in Kibana - Suspicious Network Connection Attempt by Root\n\nThe hunt rule we created here identifies a sequence of events beginning with a session id change, followed by a\nnetwork connection accepted, in correlation with ptmx file creation and a deletion of the process responsible for\naccepting the network connection. This EQL rule can be used to successfully identify BPFDoor bind shell\nconnections within your environment:\n\nEQL BPFDoor bind shell hunt query\n```\nsequence by process.entity_id with maxspan=1m\n[process where event.type == \"change\" and event.action == \"session_id_change\" and user.id == 0 and not\nprocess.executable : (\"/bin/ssh\", \"/sbin/ssh\", \"/usr/lib/systemd/systemd\")]\n[network where event.type == \"start\" and event.action == \"connection_accepted\" and user.id == 0]\n[file where event.action == \"creation\" and user.id == 0 and file.path == \"/dev/ptmx\"]\n[process where event.action == \"end\" and user.id == 0 and not process.executable : (\"/bin/ssh\",\n\"/sbin/ssh\", \"/usr/lib/systemd/systemd\")]\n\n```\n\n-----\n\nElastic Alert in Kibana - Suspicious Network Connection Accept by Root\n\n### YARA Rules¶\n\nIn addition to behavioral detection rules in the Elastic Endpoint, we are releasing a set of BPFDoor Yara signatures\nfor the community.\n\nBPFDoor YARA rule\n\n\n-----\n\n```\n      _ j _ _ {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"144526d30ae747982079d5d340d1ff116a7963aba2e3ed589e7ebc297ba0c1b3\"\n  strings:\n    $a1 = \"hald-addon-acpi: listening on acpi kernel interface /proc/acpi/event\" ascii fullword\n    $a2 = \"/sbin/iptables -t nat -D PREROUTING -p tcp -s %s --dport %d -j REDIRECT --to-ports %d\"\nascii fullword\n    $a3 = \"avahi-daemon: chroot helper\" ascii fullword\n    $a4 = \"/sbin/mingetty /dev/tty6\" ascii fullword\n    $a5 = \"ttcompat\" ascii fullword\n  condition:\n    all of them\n}\nrule Linux_Trojan_BPFDoor_2 {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"3a1b174f0c19c28f71e1babde01982c56d38d3672ea14d47c35ae3062e49b155\"\n  strings:\n    $a1 = \"hald-addon-acpi: listening on acpi kernel interface /proc/acpi/event\" ascii fullword\n    $a2 = \"/sbin/mingetty /dev/tty7\" ascii fullword\n    $a3 = \"pickup -l -t fifo -u\" ascii fullword\n    $a4 = \"kdmtmpflush\" ascii fullword\n    $a5 = \"avahi-daemon: chroot helper\" ascii fullword\n    $a6 = \"/sbin/auditd -n\" ascii fullword\n  condition:\n    all of them\n}\nrule Linux_Trojan_BPFDoor_3 {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"591198c234416c6ccbcea6967963ca2ca0f17050be7eed1602198308d9127c78\"\n  strings:\n    $a1 = \"[-] Spawn shell failed.\" ascii fullword\n    $a2 = \"[+] Packet Successfuly Sending %d Size.\" ascii fullword\n    $a3 = \"[+] Monitor packet send.\" ascii fullword\n    $a4 = \"[+] Using port %d\"\n    $a5 = \"decrypt_ctx\" ascii fullword\n    $a6 = \"getshell\" ascii fullword\n    $a7 = \"getpassw\" ascii fullword\n\n```\n\n-----\n\n```\n          p\n  condition:\n    all of them\n}\nrule Linux_Trojan_BPFDoor_4 {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"591198c234416c6ccbcea6967963ca2ca0f17050be7eed1602198308d9127c78\"\n  strings:\n    $a1 = { 45 D8 0F B6 10 0F B6 45 FF 48 03 45 F0 0F B6 00 8D 04 02 00 }\n  condition:\n    all of them\n}\nrule Linux_Trojan_BPFDoor_5 {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"76bf736b25d5c9aaf6a84edd4e615796fffc338a893b49c120c0b4941ce37925\"\n  strings:\n    $a1 = \"getshell\" ascii fullword\n    $a2 = \"/sbin/agetty --noclear tty1 linux\" ascii fullword\n    $a3 = \"packet_loop\" ascii fullword\n    $a4 = \"godpid\" ascii fullword\n    $a5 = \"ttcompat\" ascii fullword\n    $a6 = \"decrypt_ctx\" ascii fullword\n    $a7 = \"rc4_init\" ascii fullword\n    $b1 = { D0 48 89 45 F8 48 8B 45 F8 0F B6 40 0C C0 E8 04 0F B6 C0 C1 }\n  condition:\n    all of ($a*) or 1 of ($b*)\n}\nrule Linux_Trojan_BPFDoor_6 {\n  meta:\n    Author = \"Elastic Security\"\n    creation_date = \"2022-05-10\"\n    last_modified = \"2022-05-10\"\n    os = \"Linux\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"BPFDoor\"\n    threat_name = \"Linux.Trojan.BPFDoor\"\n    description = \"Detects BPFDoor malware.\"\n    reference_sample = \"dc8346bf443b7b453f062740d8ae8d8d7ce879672810f4296158f90359dcae3a\"\n  strings:\n    $a1 = \"getpassw\" ascii fullword\n    $a2 = \"(udp[8:2]=0x7255) or (icmp[8:2]=0x7255) or (tcp[((tcp[12]&0xf0)>>2):2]=0x5293)\" ascii\nfullword\n    $a3 = \"/var/run/haldrund.pid\" ascii fullword\n    $a4 = \"Couldn't install filter %s: %s\" ascii fullword\n    $a5 = \"godpid\" ascii fullword\n\n```\n\n-----\n\n```\n    all of them\n}\n\n## Interacting with BPFDoor¶\n\n```\nThe Elastic Security Team has released several tools that can aid in further research regarding BPFDoor to include\na network scanner used to identify infected hosts, a BPFDoor malware configuration extractor, and a BPFDoor\nclient binary that can be used to actively interact with a sample.\n\n### BPFDoor Scanner¶\n\n[The Elastic Security Team has released a Python script that can identify if you have BPFDoor infected hosts.](https://elastic.github.io/security-research/tools/bpfdoor-scanner/)\n\nThe scanner sends a packet to a defined IP address using the default target port ( 68/UDP )and default interface. It\nlistens to return traffic on port `53/UDP .`\n\nBPFDoor scanner tool\n\n### BPFDoor Configuration Extractor¶\n\nThis tool will allow you to extract configurations from any BPFDoor malware you may have collected. This will\nallow you to develop additional signatures and further analysis of the malware as well as your environment.\n\n[The BPFDoor configuration extractor can be downloaded here.](https://elastic.github.io/security-research/tools/bpfdoor-config-extractor/)\n\n\n-----\n\nBPFDoor configuration extractor\n\n### BPFDoor Client POC¶\n\nQuickly after beginning our research into this malware we realized we would also need to actively interact with\nBPFDoor in order to observe the full extent of the capabilities that it possesses and monitor what these capabilities\nwould look like from a host and SIEM level.\n\nIn order to do this, we had to break down the BPF filters in the BPFDoor source code so we could craft packets for\n[the different protocols. To do this, we used Scapy, a packet manipulation program, to ensure we could pass the](https://scapy.net/)\nfilters for the purpose of activating the backdoor. Once we ensured we could pass the filters, Rhys Rustad-Elliott,\nan engineer at Elastic built a BPFDoor client that accepts a password, IP address, and port allowing you to connect\nto a BPFDoor sample and interact if you possess the sample’s hardcoded passwords.\n\nDepending on the password or lack of password provided, BPFDoor will behave exactly the same way it would in\nthe wild. You can invoke a reverse shell, establish a bind shell, or connect to it with no supplied password to receive\na ping-back confirming its installation.\n\n\n-----\n\nA preview of the BPFDoor Client developed by Elastic Security to assist in research\n\n[Researchers looking to use BPFDoor can reach out to Elastic Security for access to the BPFDoor client POC. Please](mailto:threat-notification@elastic.co)\nnote that these tools will be shared at our discretion with those in the trusted security community looking to\nimprove the detection of this vulnerability.\n\n## Impact¶\n\nThe following MITRE ATT&CK Tactic, Techniques, and Sub-techniques have been observed with the BPFDoor\nmalware.\n\n### Tactics¶\n\nTactics represent the “why” of an ATT&CK technique or sub-technique. It is the adversary’s tactical goal: the\nreason for performing an action.\n\n[Execution](https://attack.mitre.org/tactics/TA0002/)\n\n### Techniques (sub-techniques)¶\n\nTechniques (and sub-techniques) represent ‘how’ an adversary achieves a tactical goal by performing an action.\n\n## Source Pseudocode¶\n\n[To clearly articulate the details of this malware, we’ve created two diagrams that outline the specific pseudocode](https://elastic.github.io/security-research/intelligence/2022/05/04.bpfdoor/media/bpfdoor_pseudocode.pdf)\nfor BPFDoor based on the source code uploaded to VT and found on Pastebin. While this contains a lot of detail, it\nis simple to understand if researchers choose to further this research.\n\n## Summary¶\n\nWhile threat groups continue to increase in maturity, we expect this kind of mature, well designed and hidden\nthreat will continue to be found within Linux environments. These kinds of findings reiterate the importance of\ncomprehensive security controls across the entirety of a fleet, rather than simply focusing on user endpoints.\n\nBPFDoor demonstrates a perfect example of how important monitoring workloads within Linux environments can\nbe. Payloads such as this are near-on impossible to observe and detect without sufficient controls, and should be\nconsidered a moving trend within the general adversarial landscape.\n\n## Observables¶\n\n\n-----\n\n**ObservableObservable** **TypeType** **ReferenceReference** **NoteNote**\n\n\n`/dev/shm/kdmtmpflush` process\nname\n\n`/var/run/haldrund.pid` file\nname\n\n`/var/run/kdevrund.pid` file\nname\n\n`/var/run/xinetd.lock` file\nname\n\n`74ef6cc38f5a1a80148752b63c117e6846984debd2af806c65887195a8eccc56` SHA256\n\n`07ecb1f2d9ffbd20a46cd36cd06b022db3cc8e45b1ecab62cd11f9ca7a26ab6d` SHA256\n\n`76bf736b25d5c9aaf6a84edd4e615796fffc338a893b49c120c0b4941ce37925` SHA256\n\n`93f4262fce8c6b4f8e239c35a0679fbbbb722141b95a5f2af53a2bcafe4edd1c` SHA256\n\n`96e906128095dead57fdc9ce8688bb889166b67c9a1b8fdb93d7cff7f3836bb9` SHA256\n\n`599ae527f10ddb4625687748b7d3734ee51673b664f2e5d0346e64f85e185683` SHA256\n\n`2e0aa3da45a0360d051359e1a038beff8551b957698f21756cfc6ed5539e4bdb` SHA256\n\n`f47de978da1dbfc5e0f195745e3368d3ceef034e964817c66ba01396a1953d72` SHA256\n\n`fd1b20ee5bd429046d3c04e9c675c41e9095bea70e0329bd32d7edd17ebaf68a` SHA256\n\n`5faab159397964e630c4156f8852bcc6ee46df1cdd8be2a8d3f3d8e5980f3bb3` SHA256\n\n`f8a5e735d6e79eb587954a371515a82a15883cf2eda9d7ddb8938b86e714ea27` SHA256\n\n`5b2a079690efb5f4e0944353dd883303ffd6bab4aad1f0c88b49a76ddcb28ee9` SHA256\n\n`97a546c7d08ad34dfab74c9c8a96986c54768c592a8dae521ddcf612a84fb8cc` SHA256\n\n`c80bd1c4a796b4d3944a097e96f384c85687daeedcdcf05cc885c8c9b279b09c` SHA256\n\n`4c5cf8f977fc7c368a8e095700a44be36c8332462c0b1e41bff03238b2bf2a2d` SHA256\n\n\nBPFDoor\nprocess\nname\n\nBPFDoor\nfile name\n\nBPFDoor\nfile name\n\nBPFDoor\nfile name\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\nBPFDoor\nmalware\n\n\nObserved\nprocess\nname of\nBPFDoor\n\nObserved\nBPFDoor\nPID file\n\nObserved\nBPFDoor\nPID file\n\nObserved\nBPFDoor\nlock file\n\n\n-----\n\n## References¶\n\nhttps://doublepulsar.com/bpfdoor-an-active-chinese-global-surveillance-tool-54b078f1a896\nhttps://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/cyber-year-in-retrospect/yircyber-threats-report-download.pdf\nhttps://www.pangulab.cn/en/post/the_bvp47_a_top-tier_backdoor_of_us_nsa_equation_group\nhttps://www.pangulab.cn/en/post/the_bvp47_a_top-tier_backdoor_of_us_nsa_equation_group\n\n## Artifacts¶\n\nArtifacts are also available for download in both ECS and STIX format in a combined zip bundle.\n\n[Download indicators.zip](https://elastic.github.io/security-research/intelligence/2022/05/04.bpfdoor/indicators.zip)\n\nLast update: May 24, 2022\nCreated: May 24, 2022\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-17 - A peek behind the BPFDoor.pdf"
    ],
    "report_names": [
        "2022-05-17 - A peek behind the BPFDoor.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c8a7541-1ce3-450a-9e41-494bc7af11a4",
            "created_at": "2023-01-06T13:46:39.358343Z",
            "updated_at": "2025-03-27T02:00:03.06082Z",
            "deleted_at": null,
            "main_name": "Red Menshen",
            "aliases": [
                "Red Dev 18"
            ],
            "source_name": "MISPGALAXY:Red Menshen",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536004,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1653510645,
    "ts_modification_date": 1653510645,
    "files": {
        "pdf": "https://archive.orkl.eu/16698adc2b07e41507c3ff81400bd6bf753aed62.pdf",
        "text": "https://archive.orkl.eu/16698adc2b07e41507c3ff81400bd6bf753aed62.txt",
        "img": "https://archive.orkl.eu/16698adc2b07e41507c3ff81400bd6bf753aed62.jpg"
    }
}