{
    "id": "ca5f5676-3aa6-4326-9807-246e5baab15e",
    "created_at": "2023-01-12T14:58:55.596731Z",
    "updated_at": "2025-03-27T02:09:18.290098Z",
    "deleted_at": null,
    "sha1_hash": "685bc63979f3e3fc48fddee53829996c3c4fb1c0",
    "title": "2021-09-13 - Vermilion Strike- Linux and Windows Re-implementation of Cobalt Strike",
    "authors": "",
    "file_creation_date": "2022-05-28T15:52:13Z",
    "file_modification_date": "2022-05-28T15:52:13Z",
    "file_size": 4102716,
    "plain_text": "# Vermilion Strike: Linux and Windows Re-implementation of Cobalt Strike\n\n**[intezer.com/blog/malware-analysis/vermilionstrike-reimplementation-cobaltstrike/](https://www.intezer.com/blog/malware-analysis/vermilionstrike-reimplementation-cobaltstrike/)**\n\nSeptember 13, 2021\n\nWritten by [Avigayil Mechtinger,](https://www.intezer.com/author/avigayil/) [Ryan Robinson and](https://www.intezer.com/author/ryanrobinson/) [Joakim Kennedy - 13 September 2021](https://www.intezer.com/author/jkennedy/)\n\n### Get Free Account\n\nJoin Now\n\n### Top Blogs\n\n**[Detecting Phishing Emails with Email Headers, Attachments, and URLs](https://www.intezer.com/blog/incident-response/automate-analysis-phishing-email-files/)**\n\nEmails were created as a method to pass messages between users, and now they are...\n[Read more](https://www.intezer.com/blog/incident-response/automate-analysis-phishing-email-files/)\n\n**[Automating Alert Triage and Threat Hunting with Intezer + SentinelOne](https://www.intezer.com/blog/alert-triage/automating-edr-alert-triage-threat-hunting-sentinelone-integration/)**\n\nOne of the biggest pain points of cyber security teams is alert fatigue – trying... [Read more](https://www.intezer.com/blog/alert-triage/automating-edr-alert-triage-threat-hunting-sentinelone-integration/)\n\n**[Top Cyber Threats to the Telecom Industry](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)**\n\nIn our interconnected society, the telecom industry is responsible for keeping the world\nconnected 24/7.... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)\n\n\n-----\n\n## Key Findings\n\nDiscovered Linux & Windows re-implementation of Cobalt Strike Beacon written from\nscratch\nLinux malware is fully undetected by vendors\nHas IoC and technical overlaps with previously discovered Windows DLL files\nHighly targeted with victims including telecommunications, government and finance\n\n[Cobalt Strike is a popular red team tool for Windows which is also heavily used by threat](https://www.intezer.com/blog/malware-analysis/cobalt-strike-detect-this-persistent-threat/)\nactors. At the time of this writing, there is no official [Cobalt Strike version for Linux.](https://blog.cobaltstrike.com/2016/03/23/linux-left-out-in-the-cold/)\n\n[In August 2021, we at Intezer discovered a fully undetected ELF implementation of Cobalt](https://analyze.intezer.com/files/294b8db1f2702b60fb2e42fdc50c2cee6a5046112da9a5703a548a4fa50477bc)\nStrike’s [beacon, which we named Vermilion Strike. The stealthy sample uses Cobalt](https://www.cobaltstrike.com/help-beacon)\nStrike’s Command and Control (C2) protocol when communicating to the C2 server and has\nRemote Access capabilities such as uploading files, running shell commands and writing to\nfiles. The malware is fully undetected in VirusTotal at the time of this writing and was\nuploaded from Malaysia.\n\nBased on telemetry with collaboration from our partners at McAfee Enterprise ATR, this\nLinux threat has been active in the wild since August targeting telecom companies,\n**government agencies, IT companies, financial institutions and advisory companies**\naround the world. Targeting has been limited in scope, suggesting that this malware is used\nin specific attacks rather than mass spreading.\n\nAfter further analysis, we found Windows samples that use the same C2. The samples are\nre-implementations of Cobalt Strike Beacon. The Windows and ELF samples share the\nsame functionalities.\n\nThe sophistication of this threat, its intent to conduct espionage, and the fact that the code\nhasn’t been seen before in other attacks, together with the fact that it targets specific\nentities in the wild, leads us to believe that this threat was developed by a skilled threat\nactor.\n\nIn this post we will provide a technical analysis of the samples and explain how you can\ndetect and respond to this threat.\n\n## Technical Analysis\n\n Linux File\n\nThe file was uploaded to VirusTotal from Malaysia and has no detections in VirusTotal at the\ntime of this writing.\n\n\n-----\n\n_294b8db1f2702b60fb2e42fdc50c2cee6a5046112da9a5703a548a4fa50477bc in VirusTotal_\n\n[Vermilion Strike analysis in Intezer Analyze.](https://analyze.intezer.com/files/294b8db1f2702b60fb2e42fdc50c2cee6a5046112da9a5703a548a4fa50477bc)\n\nThe file shares strings with previously seen Cobalt Strike samples and triggers a number of\n[YARA rules that detect encoded Cobalt Strike configurations. The ELF file is built on a Red](https://www.intezer.com/blog/research/executable-linkable-format-101-part1-sections-segments/)\nHat Linux distribution. It uses OpenSSL via dynamic linking. The shared object names for\nOpenSSL on Red Hat-based distributions are different from other Linux distributions.\nBecause of this, it can only run on machines with Linux distribution based on Red Hat’s\ncode base.\n\n## Initialization\n\n\n-----\n\nThe sample starts by forcing itself to run in the background using daemon. It will decrypt the\nconfiguration, using the XOR key 0x69, shown in the screenshot below. The key 0x69 is a\ncommon value used by Cobalt Strike’s encrypted configuration too. Vermilion Strike’s\nconfiguration format is the same as Cobalt Strike. Tools used for extracting Cobalt Strike\nconfigurations can also be used to extract Vermilion Strike configuration. The Windows\ncomponents of the configuration are ignored for this Linux version.\n\n\n-----\n\nDecoded configuration of the beacon.\n\nFurther decryption is performed in a heap with decoded strings, keys, and values required\nby the beacon for its operation. The beacon will then generate a SHA256 hash sourced\nfrom a random number seeded from the thread ID. This value will be used later in DNS\nbeaconing. Next, a public RSA key will be imported for later use.\n\nImporting of public RSA key to encrypt machine fingerprint.\n\nThe beacon will begin fingerprinting the machine. A random number will be generated and\nthe process ID will be fetched. It will grab the kernel version of the machine using uname.\nNext, the beacon will fingerprint network information through the getifaddrs function. It will\nloop through the interfaces looking for IPv4 addresses. It will gather the interface with an\naddress not equal to “127.0.0.1” and stage the IPv4 address.\n\n\n-----\n\nNetwork interface fingerprinting.\n\nNext, the beacon will fingerprint the entry in the local password database for information\nabout the current effective user ID of the process.\n\nFingerprinting of local password database.\n\nThe beacon will then fingerprint the hostname of the machine. The collected information will\nbe formatted into a string, encrypted with the public RSA key, and base64 encoded, as is\nstandard for communication with a Cobalt Strike server. The stages are shown below.\n\nStages of formatting the machine fingerprint.\n\nPrepended to the fingerprint string is the value “1.0.1.LR”. This appears to be an internal\nversion string. A similar string, “W1.0.1,” was found in a newly discovered Windows sample\nof Vermilion Strike that shares the same C2 and malware functionality.\n\nThe encrypted data is sent to the C2 server in a similar way that the metadata is sent from a\nCobalt Strike beacon to the C2 server. The payload that is encrypted starts with the marker\n**0xbeef. The same marker is used by the legitimate Cobalt Strike beacon.**\n\n## Command and Control\n\nCommand and Control is primarily performed over DNS but also available over HTTP. This\nDNS-based approach for communications can help avoid traditional defenses that monitor\nHTTP traffic. Commands are received via DNS Address (A) and Text (TXT) records. The\nbeacon first makes DNS requests out to hardcoded subdomains and gets an IP address\nreturned. Normally, DNS requests on hostnames are intended to be translated into an IP\naddress for which to visit. In this case, the IP address returned is not used as an IP address\nbut for triggers to change the beacon behavior.\n\n\n-----\n\nOnce the beacon gets the signal to download a task, it will perform a DNS TXT query to the\ndomain’s nameservers, as shown below.\n\nPacket capture of C2 communication.\n\nThe result of the TXT query is a base64 encoded and AES encrypted struct containing task\ninformation. An example of a returned task is shown below.\n\nA DNS TXT query result for a task.\n\nA decrypted task is shown below.\n\nDecrypted command.\n\nTasks that the beacon can perform are:\n\nChange working directory\nGet current working directory\nAppend/write to file\nUpload file to C2\nExecute command via popen\nGet disk partitions\nList files\n\nThe malware uses a separate thread to execute the tasks. The tasks are scheduled as jobs\nvia a semaphore to ensure not too many jobs are executed at once. Vermilion Strike has a\nthird way of communicating with the C2 server via ICMP ping messages. The malware adds\nthe current pid to the offset 0x4 in the header and the encrypted payload is sent as data in\nthe ICMP packet. The data size for an ICMP packet is limited to 65,507 bytes but the\nmalware uses a size limit of 64,000 bytes for the payload. The code for sending and\n\n\n-----\n\nprocessing ICMP messages exists in the malware but the code for enabling it via the\nconfiguration is not present. This means it has the capability but can’t be configured to use\nit. This suggests it may be a new feature that hasn’t been fully developed yet.\n\n## Links to Windows Files\n\nWhen investigating this Linux file, we discovered related Windows samples. The first\nsample we noticed was:\n**3ad119d4f2f1d8ce3851181120a292f41189e4417ad20a6c86b6f45f6a9fbcfc. This is a 32-**\nbit EXE sample that shares a C2 IP address (160.202.163[.]100). This is a stager that will\nfetch a DLL from the C2 over HTTP and execute it in-memory.\n\nAn example of the next stage DLL is\n**7129434afc1fec276525acfeee5bb08923ccd9b32269638a54c7b452f5493492. This**\n[sample, first noticed in 2019 by Silas Cutler, is the Windows DLL equivalent of the ELF file.](https://twitter.com/silascutler/status/1153696870499119104)\nThe functionality is almost exactly the same, except for the Windows environment. A sideby-side comparison of the configuration decoding function for the ELF and DLL beacons is\nshown below.\n\nConfiguration decryption function comparison.\n\nThe DLL has the same domains as the ELF for C2, as well as an additional configured\ndomain “amazon.hksupd[.]com”.\n\nUsing the stager we managed to get a new payload from the server\n[(e40370f463b4a4feb2d515a3fb64af1573523f03917b2fd9e7a9d0a741ef89a5). It has a lot of](https://analyze.intezer.com/files/e40370f463b4a4feb2d515a3fb64af1573523f03917b2fd9e7a9d0a741ef89a5)\nshared code with the sample from 2019. This sample and another Windows version of\nVermilion Strike\n(c49631db0b2e41125ccade68a0fe7fb70939315f1c580510e40e5b30ead868f5) includes a\nsimilar version string as the ELF version. The version string in these samples is “W1.0.1”.\n\n\n-----\n\nInternal version string in recent Windows versions.\n\n## Conclusion\n\nVermilion Strike and other Linux threats remain a constant threat. The predominance of\nLinux servers in the cloud and its continued rise invites APTs to modify their toolsets in\norder to navigate the existing environment. Linux threats often have low detection rates\ncompared to their Windows counterparts due to reasons discussed in Why we Should be\nPaying More Attention to Linux Threats.\n\nVermilion Strike is not the only Linux port of Cobalt Strike’s Beacon. Another example is the\n[open-source project geacon, a Go-based implementation. Vermilion Strike may not be the](https://github.com/darkr4y/geacon)\nlast Linux implementation of Beacon.\n\n## Detection and Response\n\nIntezer Analyze can detect both Linux and Windows variants of Vermilion Strike, based on\ncode reuse, TTPs, and strings. Shown below are the verdicts for both versions.\n\nIntezer Analyze [verdict of Windows version of Vermilion Strike.](https://analyze.intezer.com/files/07b815cee2b85a41820cd8157a68f35aa1ed0aa5f4093b8cb79a1d645a16273f)\n\n\n-----\n\nIntezer Analyze [verdict of Linux version of Vermilion Strike.](https://analyze.intezer.com/files/294b8db1f2702b60fb2e42fdc50c2cee6a5046112da9a5703a548a4fa50477bc)\n\n## Detect if a Machine in Your Network Has Been Compromised\n\n**Get full runtime visibility over your code**\n\n[For Linux-based systems, use Intezer Protect to get alerted on any malicious or](http://protect.intezer.com/)\n[unauthorized code executed in runtime. Protect 10 hosts, nodes or machines for free](https://protect.intezer.com/signup)\n\n[For Windows-based systems, use the Intezer Analyze Endpoint Scanner to scan the entire](https://analyze.intezer.com/?tab=endpoint)\nmemory of your machines to find any traces of malicious code running on them.\n\nWe also recommend using the IoCs section below to ensure that the Vermilion Strike\nprocess does not exist anywhere on your system.\n\n## Response\n\nIf you are a victim of this operation, take the following steps:\n\n1. Kill the process and delete all files related to the malware.\n2. Make sure that your machine is clean and running only trusted code using a runtime\n\n[security platform like Intezer Protect, or use Intezer Analyze Endpoint Scanner for](http://protect.intezer.com/)\nWindows systems.\n3. Make sure that your software is up-to-date with the latest versions and security\n\npatches and configured to security best practices.\n\n\n-----\n\n## IoCs\n\n ELF\n\n294b8db1f2702b60fb2e42fdc50c2cee6a5046112da9a5703a548a4fa50477bc\n\n## PE\n\n**Stager**\n\n3ad119d4f2f1d8ce3851181120a292f41189e4417ad20a6c86b6f45f6a9fbcfc\n\n**Beacon**\n\n7129434afc1fec276525acfeee5bb08923ccd9b32269638a54c7b452f5493492\n\nc49631db0b2e41125ccade68a0fe7fb70939315f1c580510e40e5b30ead868f5\n\n07b815cee2b85a41820cd8157a68f35aa1ed0aa5f4093b8cb79a1d645a16273f\n\ne40370f463b4a4feb2d515a3fb64af1573523f03917b2fd9e7a9d0a741ef89a5\n\n## C2\n\n160.202.163.100\n\nupdate.microsofthk[.]com\n\nupdate.microsoftkernel[.]com\n\namazon.hksupd[.]com\n\n**Intezer would like to thank McAfee ATR for their help during the research process.**\n\n**Avigayil Mechtinger**\nAvigayil is a product manager at Intezer, leading Intezer Analyze product lifecycle. Prior to\nthis role, Avigayil was part of Intezer's research team and specialized in malware analysis\nand threat hunting. During her time at Intezer, she has uncovered and documented different\nmalware targeting both Linux and Windows platforms.\n\n\n-----\n\n**Ryan Robinson**\nRyan is a security researcher analyzing malware and scripts. Formerly, he was a researcher\non Anomali's Threat Research Team.\n\n**Joakim Kennedy**\nDr. Joakim Kennedy is a Security Researcher analyzing malware and tracking threat actors\non a daily basis. For the last few years, Joakim has been researching malware written in\nGo. To make the analysis easier he has written the Go Reverse Engineering Toolkit\n(github.com/goretk), an open-source toolkit for analysis of Go binaries.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-13 - Vermilion Strike- Linux and Windows Re-implementation of Cobalt Strike.pdf"
    ],
    "report_names": [
        "2021-09-13 - Vermilion Strike- Linux and Windows Re-implementation of Cobalt Strike.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535535,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653753133,
    "ts_modification_date": 1653753133,
    "files": {
        "pdf": "https://archive.orkl.eu/685bc63979f3e3fc48fddee53829996c3c4fb1c0.pdf",
        "text": "https://archive.orkl.eu/685bc63979f3e3fc48fddee53829996c3c4fb1c0.txt",
        "img": "https://archive.orkl.eu/685bc63979f3e3fc48fddee53829996c3c4fb1c0.jpg"
    }
}