{
    "id": "ca6b7843-533d-44db-9909-08ab4d41e19c",
    "created_at": "2023-01-12T15:00:13.537839Z",
    "updated_at": "2025-03-27T02:16:42.981793Z",
    "deleted_at": null,
    "sha1_hash": "ba6563e1c01e8819b649129da95854e5314605bc",
    "title": "2016-01-22 - New Attacks Linked to C0d0so0 Group",
    "authors": "",
    "file_creation_date": "2022-05-28T02:12:39Z",
    "file_modification_date": "2022-05-28T02:12:39Z",
    "file_size": 887987,
    "plain_text": "# New Attacks Linked to C0d0so0 Group\n\n**[researchcenter.paloaltonetworks.com/2016/01/new-attacks-linked-to-c0d0s0-group/](http://researchcenter.paloaltonetworks.com/2016/01/new-attacks-linked-to-c0d0s0-group/)**\n\nJosh Grunzweig, Bryan Lee January 22, 2016\n\nBy [Josh Grunzweig and](https://unit42.paloaltonetworks.com/author/joshgruznweig/) [Bryan Lee](https://unit42.paloaltonetworks.com/author/bryanlee/)\n\nJanuary 22, 2016 at 4:30 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Adobe Flash,](https://unit42.paloaltonetworks.com/tag/adobe-flash/) [AutoFocus,](https://unit42.paloaltonetworks.com/tag/autofocus/) [C0d0so0,](https://unit42.paloaltonetworks.com/tag/c0d0so0/) [Codoso,](https://unit42.paloaltonetworks.com/tag/codoso/) [IDAPython,](https://unit42.paloaltonetworks.com/tag/idapython/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nWhile recently researching unknown malware and attack campaigns using the AutoFocus\nthreat intelligence platform, Unit 42 discovered new activity that appears related to an\nadversary group previously called “C0d0so0” or “Codoso”. This group is well known for a\nwidely publicized attack involving the compromise of Forbes.com, in which the site was used\nto compromise selected targets via a watering hole to a zero-day Adobe Flash exploit.\nCompared to other adversary groups, C0d0so0 has shown the use of more sophisticated\ntactics and tools and has been linked to leveraging zero-day exploits on numerous occasions\nin combination with watering hole and spear phishing attacks.\n\nIn the newly discovered attack campaign, Unit 42 identified attacks targeting organizations\nwithin the telecommunications, high tech, education, manufacturing, and legal services\nindustries. The attacks likely were initially delivered via spear-phishing e-mails, or as\ndemonstrated by C0d0so0 in the past, legitimate websites that had been previously\ncompromised then used as watering holes for the selected victims.\n\nIn such situations, the victims would then be redirected to another set of compromised\n[websites. These websites hosted malware that would be side-loaded with a legitimate signed](https://attack.mitre.org/wiki/DLL_side-loading)\nexecutable. These tactics are becoming increasingly common by malware authors in order to\nevade security products and controls. Two variants of the malware employed by C0d0so0\nwere discovered—one that used HTTP for command and control (C2) communications, and\none that used a custom network protocol over port 22.\n\nIn these newly discovered C0d0so0 attacks, several of the targeted hosts were identified as\nserver systems, instead of user endpoints, suggesting the possibility that these specific\ntargets will be used in future attacks as additional watering holes. Both of the malware\nvariants encoded and compressed the underlying network traffic to bypass any networkbased security controls that were implemented.\n\n\n-----\n\nThe malware variants in question do not appear to belong to any known malware family,\nalthough the structure of the network communication does bear a resemblance to the\nDerusbi malware family, which has shown to be unique to Chinese cyber espionage\noperators. Past observations of Derusbi in various attack campaigns indicate the version\nused was compiled specifically for that campaign. Derusbi has had both the client and server\nvariants deployed, using different combinations of configurations and modules. The newly\ndiscovered activity is consistent with this procedure, with compile times only a few days prior\nto the observed attacks.\n\n## Infrastructure\n\nFigure 1: Attacker infrastructure\n\n(Click to view full size.)\n\nThe following primary C2 servers for the malware variants were identified:\n\njbossas[.]org\nsupermanbox[.]org\nmicrosoft-cache[.]com\n\n\n-----\n\nThe jbossas and supermanbox domains were found to resolve to the same Hong Kong\nbased IP address, 121.54.168.230. A total of three unique samples were identified\ncommunicating with these two domains using the raw network protocol communicating over\nport 22. They used what appeared to be three separate legitimate websites that looked to be\ncompromised for malware distribution.\n\nThe ‘microsoft-cache’ domain was used by the malware variant that communicated over\nHTTP. We found four unique samples communicating with this domain, which resolved to the\nsame Hong Kong-based IP address used by the first two domains.\n\n## Malware Analysis – HTTP Variant\n\nThis variant was disguised as a serial number generator for the popular AVG anti-virus\nproduct. When executed, the binary will drop and run the serial generator for AVG.\n\nFigure 2: AVG serial generator\n\nIt will also drop the following two files:\n\n% LOCALAPPDATA %\\dbgeng.dll\n\n% LOCALAPPDATA %\\fakerx86.exe\n\nThe dropped DLL in question is sideloaded with the legitimate fakerx86.exe executable,\nwhich is the symbolic debugger for Microsoft Windows.\n\n\n-----\n\nUpon loading the malicious DLL, a number of encrypted blobs are decrypted using singlebyte XOR keys. Strings are separated by five bytes of junk data, which is consistent across\nall samples witnessed.\n\nFigure 3: Decrypted strings\n\nThe following IDAPython script can be used to both decrypt and parse these encrypted\nblobs:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n\n\ndef xor(size, key, buff):\nfor index in range(0,size):\ncur_addr = buff + index\ntemp = idc.Byte(cur_addr) ^ key\nidc.PatchByte(cur_addr, temp)\n\ndef parse_config(size, buff):\nlast_string = buff\nwhile last_string < buff+size:\nnext_string = last_string+5\nidaapi.make_ascii_string(next_string, 0, ASCSTR_C)\nstring = GetString(next_string, -1, ASCSTR_C)\nprint \"Found string:\", string\nlast_string = next_string+len(string)+1\n\ndef decrypt_and_parse(size, key, buff):\nxor(size, key, buff)\nparse_config(size, buff)\n\n\nAfter various data is decrypted, the malware will ensure that it is not running within the\ncontext of the rundll32.exe executable. This simple check acts as a simple anti-reversing\nmechanism, and ensures it is not running in either an analyst environment or a sandbox.\n\nIt continues to ensure persistent execution by setting the following registry key:\n\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Windows Debug Tools –_\n_%LOCALAPPDATA%\\fakerx86.exe_\n\n\n-----\n\nThe malware variant continues to spawn new threads that are responsible for network\ncommunication and other malicious activities. It then gathers information about the victim\nmachine, including the following:\n\nMAC Address\nIP Address\nUsername\nHostname\nCPU Information\n\nThis information will eventually be exfiltrated via a HTTP POST request, as seen below. The\ndata sent is base64-encoded.\n\nFigure 4: Malware exfiltrating victim information\n\nAll network communication for this malware variant takes places over HTTP. The server will\nrespond with data similar to the following:\n\n\n-----\n\nFigure 5: C2 server response\n\nThe malware will parse the ‘background-color’ parameter in the C2 response to determine\nwhat offset it will read. In the above example, the ‘028300’ is converted to an integer and\ndivided by 100 to produce a result of 283. The malware proceeds to read in data at offset\n283. The first four bytes of this data represent the total length. The remaining data is base64decoded and parsed. This base64-decoded data has the following data structure:\n\nFigure 6: Network data structure\n\nThe server will respond with a DLL file that has the following exports:\n\nStartWorker\nStopWorker\nWorkerRun\nDllEntryPoint\n\nWhen loaded, this DLL attempts to download further plugins from the remote server. At the\ntime of analysis, no plugins were available as the command and control server was no longer\nactive.\n\n\n-----\n\n## Malware Analysis – Port 22 Variant\n\nThis variant, which appears to be more recent than the HTTP variant, is delivered via the\nfilename of ‘McAltLib.dll’ and is configured to be side-loaded with the legitimate McAfee\nmcs.exe executable.\n\nFigure 7: Malware side-loaded with mcs.exe executable\n\nWhen initially loaded, the malware will register itself as a service with the following\nparameters:\n\n_Service Name: Dncp_\n_Display Name: Dncp Client_\n_Binary Path: %SystemRoot%\\System32\\svchost.exe -k netsvcs_\n_Startup Type: SERVICE_AUTO_START_\n_Account: LocalSystem_\n\nAdditionally, the following registry keys are set or modified:\n\n_HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\\netsvcs : Appends_\n_‘Dncp’_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\Dncp\\Description: “Registers and updates IP_\n_addresses and DNS records for this computer.If this service is stopped, this computer will not_\n_receive dynamic IP addresses and DNS updates.If this service is disabled, any services that_\n_explicitly depend on it will fail to start”_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\Dncp\\Parameters\\ServiceDll : Path to_\n_McAltLib.dll_\n\nThese modifications configure the McAltLib.dll to execute in the context of a service and to\nbe run automatically when the machine is rebooted. When the malware is initially executed, it\nwill open and start the ‘Dncp’ service after the service is created. When run in the context of\na service, the malware will spawn two threads.\n\n\n-----\n\nThroughout execution of this variant, it will call a function responsible for decrypting\nsubsequent instructions. After the instructions have completed executing, another function is\ncalled that will re-obfuscate the previously executed instructions. This acts as an antireversing technique by the author.\n\nFigure 8: Anti-reversing technique used by the malware\n\nOne of the threads is responsible for deleting the original McAfee mcs.exe executable. It will\nenter a loop attempting to delete the mcs.exe executable that is located in the same directory\nas McAltLib.dll.\n\nThe other thread is responsible for collecting victim information, communicating with a\nremote host, and downloading/loading further malware. It begins by generating and parsing a\nconfiguration string. The following configuration string is used in this particular instance of the\nmalware:\n\n_/s www.supermanbox[.]org /p 22 /st 60 /rt 60_\n\nIn the above example, the first parameter is the remote hostname and the second parameter\nis the port over which communication occurs. The remaining parameters are most likely used\nas sleep timers.\n\nIt proceeds to collect the following information from the victim:\n\nMAC Address\nIP Address\nUsername\nHostname\nCPU Information\n\n\n-----\n\nDefault Internet Explorer User-Agent\n\nThis information is exfiltrated in a newly spawned thread with a randomly chosen delay timer\nof 1-3 minutes in between attempts.\n\nThe malware then proceeds to send an initial beacon to the hostname/port that is configured\nwithin the binary. This data contains victim information that was previously collected and the\nserver responds with an acknowledgement. The malware proceeds to send a packet\ncontaining the victims MAC address. These packets have the following structure:\n\nIn the above example, only the first byte of the XOR key (0x84) is used for decryption. After\nthe data is decrypted using this single-byte XOR key, it will then be decompressed using the\nLZO algorithm. The data represented above becomes the following after decryption and\ndecompression takes place:\n\n_00000000: 2D 30 30 30 30 30 31 39 32 36 36 38 39 37 39 32 -000001926689792_\n\n_00000010: 36 00 00                     6.._\n\nThis string is generated via the MAC address of the victim machine. The MAC address is\nconverted from its original hexadecimal representation to an integer and formatted via a call\nto printf. It is most likely used as a unique identifier for the victim. Finally, the malware sends\na similar request, only with a packet type of ’00 07 02 00’. The server responds with a DLL\nfile that has the following exports:\n\nStartWorker\nStopWorker\nWorkerRun\nDllEntryPoint\n\nWhen loaded, this DLL attempts to download further plugins from the remote server. At the\ntime of analysis, no plugins were available as the command and control server was no longer\nactive.\n\n## Similarities with Forbes.com Breach\n\n\n-----\n\nWhen Forbes.com was compromised in November 2014, victims were infected with malware\n[that loaded a file named wuservice.dll. Reverse-engineering this file indicates that the](https://www.virustotal.com/en/file/6f14491b81a7e49b84c625ee212f8f15008a12ab4352dcb1a8afeced149a5e4b/analysis/)\nMcAltLib.dll file identified in this attack is most likely a newer variant of the malware found in\nthe forbes.com attack.\n\nOf particular note, both samples use a single-byte XOR obfuscation routine where a large\nbuffer is decrypted. Strings are separated by five bytes of garbage, as seen below.\n\nFigure 9: Comparison of string encryption between samples\n\nAs seen in the above screenshot, there is a large overlap in unique strings in both samples.\nThe original sample involved in the forbes.com breach used HTTP, which is consistent with\nthe original variant discussed in this blog post. It should be noted that while the newest\nvariant that uses direct network communication over port 22 no longer uses HTTP,\nreferences to the HTTP strings are still found within the sample itself. This is most likely due\nto code re-used by the attackers.\n\nOverall capabilities between the forbes.com sample and the newest variants discussed are\nconsistent. All samples execute the same overall capabilities, gathering and uploading victim\ninformation and attempting to download a secondary DLL then calling that DLL’s\n‘StartWorker’ exported function.\n\n## Conclusion\n\nThe tactics, techniques, and procedures (TTPs) used by C0d0so0 appear to be more\nsophisticated than many other adversary groups with multiple layers of obfuscation in use, as\nwell as specific victim targeting in what appears to be an attempt at creating a staging area\nfor additional attack.\n\n\n-----\n\nUnit 42 will continue observation and research on this group s activity, as it appears this may\nbe the beginning of the campaign. At this time, the following protections are in place for Palo\nAlto Networks customers:\n\nWildFire properly identifies samples as malicious\n[AutoFocus tag created](https://autofocus.paloaltonetworks.com/#/tag/Unit42.C0d0so0)\nDomains flagged as malicious\n\n## Appendix\n\nMD5: CD8C2BB644496D46BF1E91AD8A8F882B\n\nSHA1: CC6EBEEA48A12B396C5FA797E595A0C3B96942DE\n\nSHA256:\n3EA6B2B51050FE7C07E2CF9FA232DE6A602AA5EFF66A2E997B25785F7CF50DAA\n\nSize: 137728 Bytes\n\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\nCompile Time: 2015-11-18 15:03:50\n\nC2: www.supermanbox[.]org:22\n\nMD5: 26E863F917DA0B3F7A48304EB6D1B1D3\n\nSHA1: F7984427093BA1FC08412F8594944CEFE2D86CBF\n\nSHA256:\n3577845D71AE995762D4A8F43B21ADA49D809F95C127B770AFF00AE0B64264A3\n\nSize: 138752 Bytes\n\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\nCompile Time: 2015-11-19 16:57:29\n\nC2: www.jbossas[.]org:22\n\nMD5: B06A3A9744E9D4C059422E7AD729EF90\n\nSHA1: 9BA2249F0A8108503820E2D9C8CBFF941089CB2D\n\nSHA256:\nEA67D76E9D2E9CE3A8E5F80FF9BE8F17B2CD5B1212153FDF36833497D9C060C0\n\nSize: 136704 Bytes\n\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\nCompile Time: 2015-11-16 16:21:22\n\nC2: supermanbox[.]org:22\n\nMD5: 1CB673679F37B6A3F482BB59B52423AB\n\nSHA1: B630B7A8FE065E1A6F51EE74869B3938DC411126\n\nSHA256:\nB690394540CAB9B7F8CC6C98FD95B4522B84D1A5203B19C4974B58829889DA4C\n\nSize: 126976 Bytes\n\n\n-----\n\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\nCompile Time: 2015-07-15 09:38:15\nC2: www.microsoft-cache[.]com\n\nMD5: 39A95C4CBF28EAA534C8F4FC311FE558\nSHA1: F6AEE373F2517F2FB686284C27A84A20999A15A5\nSHA256:\nCCF87057A4AB02E53BFF5828D779A6E704B040AEF863F66E8F571638D7D50CD2\nSize: 1973747 Bytes\nFile Type: PE32 executable (GUI) Intel 80386, for MS Windows\nCompile Time: 2013-06-21 06:26:37\nC2: www.microsoft-cache[.]com\n\nMD5: 8AFECC8E61FE3805FDD41D4591710976\nSHA1: 615B022A56E2473B92C22EFA9198A2210F21BDC3\nSHA256:\nDE33DFCE8143F9F929ABDA910632F7536FFA809603EC027A4193D5E57880B292\nSize: 126980 Bytes\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\nCompile Time: 2015-07-15 09:38:15\nC2: www.microsoft-cache[.]com\n\nMD5: 2161C859B21C1B4B430774DF0837DA9D\nSHA1: 380FB5278907FAF3FCA61910F7ED9394B2337EDA\nSHA256:\nDE984EDA2DC962FDE75093D876EC3FE525119DE841A96D90DC032BFB993DBDAC\nSize: 117248 Bytes\nFile Type: PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\nCompile Time: 2015-07-08 13:18:55\nC2: www.microsoft-cache[.]com\n\n## IOCs\n\n### Hashes\n\n3ea6b2b51050fe7c07e2cf9fa232de6a602aa5eff66a2e997b25785f7cf50daa\n3577845d71ae995762d4a8f43b21ada49d809f95c127b770aff00ae0b64264a3\n\nea67d76e9d2e9ce3a8e5f80ff9be8f17b2cd5b1212153fdf36833497d9c060c0\n\nde33dfce8143f9f929abda910632f7536ffa809603ec027a4193d5e57880b292\n\nb690394540cab9b7f8cc6c98fd95b4522b84d1a5203b19c4974b58829889da4c\n\nde984eda2dc962fde75093d876ec3fe525119de841a96d90dc032bfb993dbdac\n\nccf87057a4ab02e53bff5828d779a6e704b040aef863f66e8f571638d7d50cd2\n\n\n-----\n\n### Domains\n\nwww.jbossas[.]org\n\nsupermanbox[.]org\n\nwww.supermanbox[.]org\n\nwww.microsoft-cache[.]com\n\n### IPs\n\n121.54.168.230\n\n218.54.139.20\n\n210.181.184.64\n\n42.200.18.194\n\n### URLs\n\n218.54.139.20/example/McAltLib.dll\n\n210.181.184.64/example/McAltLib.dll\n\n42.200.18.194/example/McAltLib.dll\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-01-22 - New Attacks Linked to C0d0so0 Group.pdf"
    ],
    "report_names": [
        "2016-01-22 - New Attacks Linked to C0d0so0 Group.pdf"
    ],
    "threat_actors": [
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535613,
    "ts_updated_at": 1743041802,
    "ts_creation_date": 1653703959,
    "ts_modification_date": 1653703959,
    "files": {
        "pdf": "https://archive.orkl.eu/ba6563e1c01e8819b649129da95854e5314605bc.pdf",
        "text": "https://archive.orkl.eu/ba6563e1c01e8819b649129da95854e5314605bc.txt",
        "img": "https://archive.orkl.eu/ba6563e1c01e8819b649129da95854e5314605bc.jpg"
    }
}