{
    "id": "ca7bde55-413b-4cfd-bfb8-f5ce4dbc15c4",
    "created_at": "2023-01-12T15:02:12.284702Z",
    "updated_at": "2025-03-27T02:06:10.28661Z",
    "deleted_at": null,
    "sha1_hash": "e1d2545c99c579ba65958afcb45cc7f6ff38dad8",
    "title": "2014-12-18 - Alina POS malware 'sparks' off a new variant",
    "authors": "",
    "file_creation_date": "2022-05-28T15:57:14Z",
    "file_modification_date": "2022-05-28T15:57:14Z",
    "file_size": 646690,
    "plain_text": "# Alina POS malware 'sparks' off a new variant\n\n**[trustwave.com/Resources/SpiderLabs-Blog/Alina-POS-malware--sparks--off-a-new-variant/](https://www.trustwave.com/Resources/SpiderLabs-Blog/Alina-POS-malware--sparks--off-a-new-variant/)**\n\nLoading...\n\nBlogs & Stories\n\n## SpiderLabs Blog\n\nAttracting more than a half-million annual readers, this is the security community's go-to\ndestination for technical breakdowns of the latest threats, critical vulnerability disclosures\nand cutting-edge research.\n\nAlina is a well-documented family of malware used to scrape Credit Card (CC) data from\nPoint of Sale (POS) software. We published a series of in-depth write-ups on the\n[capabilities Alina possesses as well as the progression of the versions. Xylitol has a nice](http://blog.spiderlabs.com/2013/05/alina-shedding-some-light-on-this-malware-family.html)\n[write-up on the Command and Control (C&C) aspects of Alina.](http://www.xylibox.com/2013/10/inside-malware-campaign-alina-dexter.html)\n\nIn this blog post I'd like to discuss a variant that first cropped up in late 2013 and has been\nseen in the wild as recent as a month ago. Some anti-virus companies have identified\nsimilar samples as JackPOS, but there are several interesting behavior differences that\nhaven't been posted about in any other write-ups. It is clear that Alina, [JackPOS, and this](http://blog.spiderlabs.com/2014/02/jackpos-the-house-always-wins.html)\n\n\n-----\n\nvariant all bear close resemblances to each other, but there are behavioral differences that\ndistinguish this version from the others which I have not seen detailed elsewhere. For the\npurposes of this write-up I will be referring to this variant as Spark.\n\n**AutoIt Staged Loader**\n\nThe first and most interesting difference between Alina and Spark is that several of the\nsamples have been found embedded in a compiled AutoIt script, which then loads the\nmalware into memory. Both Security Affairs and Security Intelligence posted about a similar\ntype of AutoIt compiled script being used as a loader with a JackPOS binary instead of\nSpark [here and](http://securityaffairs.co/wordpress/22121/malware/jackpos-pos-malware.html) [here, but did not provide many details. We will take a closer look at how the](http://securityintelligence.com/trusteer-apex-preempts-new-point-of-sale-malware-jackpos/#.VItdf2TF9WY)\nloader works.\n\nAutoIt \"is a freeware BASIC-like scripting language designed for automating the Windows\nGUI and general scripting\". This AutoIt script contains functions to allocate space in\nmemory, map a binary into that memory, fix the relocations and Import Address Table, and\nexecute the binary. A malicious binary is concatenated into a variable 4,000 bytes at a time\nand the script's functions are used to load and execute it. The script is converted into a\nwindows executable by running the utility Aut2Exe, which produces a new binary with the\nmalware inside it.\n\nFigure 1: Compiling an AutoIt Script\n\nConverting a script into an executable is a normal and useful part of AutoIt's functionality. I\n[used a third party utility called Exe2Aut to recover the original script and retrieve the binary.](https://exe2aut.com/)\n\n\n-----\n\nFigure 2: Decompiling an AutoIt Script\n\nThe use of AutoIt as a loader is an interesting tactic. We typically see malware authors\nwriting a script to execute another binary on the system or perform some function needed to\naccomplish the dastardly deed the author set out to do. This script is then compiled using\nAut2exe for AutoIt, py2exe for python, or perl2exe for perl. These programs include their\nrespective interpreters in the compiled binary for executing the script and are generally\nconsidered to be unsophisticated malware. In this case, however, the script has a binary in\na variable that is loaded into dynamic memory and fixes up all the addresses required for\nexecution. This is a much more advanced technique and is reusable with different\nembedded binaries. Like all such loaders, the binary is initially obfuscated artifacts such as\nstrings and import tables from the malicious binary.\n\n**Startup**\n\nPrevious versions of Alina picked a name from a list of legitimate sounding executable\nnames and copied itself into the oh-so-common %APPDATA% folder under the chosen\nname. Instead, Spark creates a sub-folder in (surprise) %APPDATA% called \"Install\" and\nstores its malicious goodies in there. These malicious goodies include copying the original\nexecutable to %APPDATA%/Install/hkcmd.exeand writing a file called ntfs.dat. Spark will\nalways copy itself as hkcmd.exe as opposed to previous Alina versions that selected from a\nlist of varying names.\n\n\n-----\n\nFigure 3: Spark Install Directory\n\nAt startup, the malware builds the path to %APPDATA%/Install/ntfs.datand checks to see if\nthe file exists. If the file does not exist, it uses the systems volume serial id and overwrites\nthe first 6 digits with random upper and/or lower case characters. The result of this\noperation is written to ntfs.dat and is used as the unique ID for the bot. Here is an example:\n\nVolume ID => \"602C0256\"\n\nRandom chars => \"mRtyfo\"\n\nUnique ID => \"mRtyfo56\"\n\nFigure 4: Random Character Generation\n\nThis differs from earlier variants, which just used the volume serial id to identify the bot. If\nthe ntfs.dat does exist, the identifier is read into memory. This unique identifier is included in\nthe POST message for all communication with the C&C server.\n\nLike all the other versions of Alina, Spark also adds itself to the commonly used\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\hkcmdkey in order to maintain_\npersistence through reboot.\n\nSpark uses a named pipe to synchronize moving the malware from its original execution\nfolder to the %APPDATA%/Install directory. The pipe name is generated as\n_\\\\.\\pipe\\spark<uniqueID> where <uniqueID> is the same as what is generated above. Using_\nour previous example the pipe name would be\\\\.pipe\\sparkmRtyfo56.\n\n**Black List**\n\nAlina includes a black list of processes that are not scraped for CC data. Spark takes the\nsame black list as before and adds additional applications to the list:\n\n\n-----\n\nFigure 5: Black List Differences\n\nSince the author is looking for CC data, the choice to add additional processes is an easy\none since these applications are highly unlikely to contain the data they are seeking. The\nmajority of the additions are system and common processes.\n\n**Spark Execution Flow**\n\nHere is a general picture overview of Spark's execution flow:\n\n\n-----\n\nFigure 6: Spark\n\nExecution Flow\n\n**Communication**\n\nThe final two differences in this variant have to do with communication to the C&C server.\nWhere previous versions used \"Alina vx.x\" as the User-Agent, Spark now uses something\nthat is supposed to look legitimate.\n\nFigure 7: Spark\n\nPOST Example\n\n\n-----\n\nAs you can see, in their attempts to look legitimate, the author still includes the bot version\nbut forgets to include the closing parenthesis. Here is an IDS signature that has been used\nto detect Spark.\n\nalert tcp $HOME_NET any -> $EXTERNAL_NET $HTTP_PORTS (msg:\"ET TROJAN\nJackPOS Checkin\"; flow:established,to_server; content:\"POST\"; http_method;\ncontent:\".php\"; http_uri; content:\"User-Agent|3a 20|Mozilla/4.0 (compatible|3b| MSIE 7.0|3b|\nWindows NT 5.1|3b| InfoPath.1 Spark v1.1|0d 0a|\"; http_header; fast_pattern:66,20;\ncontent:!\"Referer|3a|\"; http_header; pcre:\"/\\.php$/U\";\nreference:md5,3959fb5b5909d9c6fb9c9a408d35f67a; reference:url,trendmicro.com/cloudcontent/us/pdfs/security-intelligence/white-papers/wp-pos-ram-scraper-malware.pdf;\nclasstype: slr-et; sid:4004777; rev:1;)\n\nThis signature refers to the sample as JackPOS, but I think this sample falls somewhere in\nthe spectrum of malware between Alina and JackPOS.\n\nAs you can see the Spark name has come up several times, both in the POST\ncommunication and the named pipe used by the malware. The usage of a version number\nsuggests that the malware author had intentions to produce additional versions.\n\nThe POST data communication with the C&C server retains the same structure as Alina\nfrom v5.2 on, however, Spark chose to reverse the order of the XOR scheme used.\n\nFigure 8: XOR'd POST Data\n\nTo recover the clear text message, bytes 18 through 35 (red) are used as a running XOR\nkey for bytes 76 (green) to the end of the data and then the entire message is XOR'd with\n0xAA. This will decrypt the entire message. The yellow section (including the red bytes)\ncontains the header information, while the green is the dynamic data. Earlier variants would\nfirst XOR the entire message with 0xAA and then grab bytes 18-35 to decode bytes from 76\nto the end. A minor change, but sufficient in that it breaks any tools made to decode any\nprior communications. I've written a ruby script that decodes and parses the traffic and can\n[be found at spark.rb.](https://github.com/SpiderLabs/malware-analysis/blob/master/Ruby/Alina/spark.rb)\n\n\n-----\n\n**JackPOS**\n\nSpark and JackPOS have several similar techniques that relate them. The use of the AutoIt\ncompiled script as a loader is a technique that we have not seen very much and its use with\nboth JackPOS and Spark is a very interesting link. Both use similar blacklist approaches as\nwell as custom functions for finding CC data. However, JackPOS almost exclusively\nattempts to masquerade as java or a java utility. It also either copies itself directly into the\n%APPDATA% directory or into a java based sub-directory inside %APPDATA%. JackPOS\nuses the MAC address as a bot ID and base64 encodes the CC data found on the system\n[in order to obfuscate the exfiltration. In case you missed the link above, here is SpiderLabs'](http://blog.spiderlabs.com/2014/02/jackpos-the-house-always-wins.html)\ndetailed write-up on JackPOS. It seems fairly clear that these are two different variants. So\nwhile these two samples appear to be related, Spark bears a much stronger resemblance to\nAlina than JackPOS.\n\n**Conclusion**\n\nThere have been rumors and conjecture about Alina source code being sold off as well as\nJackPOS being a successor to the Alina code base. While I don't have a pony in the race,\nthe Spark variant shows that someone has been updating the Alina source code recently.\nThe Spark string that shows up in both the named pipe and the POST communication\nshows an obvious distinction from previous Alina versions. The use of AutoIt as a loader for\nboth Spark and JackPOS variants indicate that it could have potentially been a version\nbetween the transition from Alina to JackPOS.\n\nI believe it was Shakespeare who said, \"Malware by any other name will still steal your\ncredit card data\", or something to that affect. Regardless of what you call these variants, the\nimportant part is to understand the details of this threat and how to keep your data secure.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-12-18 - Alina POS malware 'sparks' off a new variant.pdf"
    ],
    "report_names": [
        "2014-12-18 - Alina POS malware 'sparks' off a new variant.pdf"
    ],
    "threat_actors": [
        {
            "id": "86fd71d3-06dc-4b73-b038-cedea7b83bac",
            "created_at": "2022-10-25T16:07:23.330793Z",
            "updated_at": "2025-03-27T02:02:09.740703Z",
            "deleted_at": null,
            "main_name": "APT 17",
            "aliases": [
                "APT 17",
                "ATK 2",
                "Beijing Group",
                "Bronze Keystone",
                "Deputy Dog",
                "Elderwood",
                "Elderwood Gang",
                "Operation Aurora",
                "Operation DeputyDog",
                "Operation Ephemeral Hydra",
                "Operation RAT Cook",
                "SIG22",
                "Sneaky Panda",
                "TEMP.Avengers",
                "TG-8153",
                "Tailgater Team"
            ],
            "source_name": "ETDA:APT 17",
            "tools": [
                "9002 RAT",
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "Briba",
                "Chymine",
                "Comfoo",
                "Comfoo RAT",
                "Darkmoon",
                "DeputyDog",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Jumpall",
                "Kaba",
                "Korplug",
                "Linfo",
                "MCRAT.A",
                "McRAT",
                "MdmBot",
                "Mdmbot.E",
                "Moudour",
                "Mydoor",
                "Naid",
                "Nerex",
                "PCRat",
                "PNGRAT",
                "Pasam",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Naid",
                "Vasport",
                "Wiarp",
                "Xamtrav",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535732,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653753434,
    "ts_modification_date": 1653753434,
    "files": {
        "pdf": "https://archive.orkl.eu/e1d2545c99c579ba65958afcb45cc7f6ff38dad8.pdf",
        "text": "https://archive.orkl.eu/e1d2545c99c579ba65958afcb45cc7f6ff38dad8.txt",
        "img": "https://archive.orkl.eu/e1d2545c99c579ba65958afcb45cc7f6ff38dad8.jpg"
    }
}