{
    "id": "ca8d7c31-898f-41ac-a889-f6fa6e250436",
    "created_at": "2023-01-12T15:08:44.69386Z",
    "updated_at": "2025-03-27T02:13:08.22226Z",
    "deleted_at": null,
    "sha1_hash": "40da994a586f21649bc1b2fe8686fe44ceec8e00",
    "title": "2021-04-15 - BazarLoader deploys a pair of novel spam vectors",
    "authors": "",
    "file_creation_date": "2022-05-27T21:51:40Z",
    "file_modification_date": "2022-05-27T21:51:40Z",
    "file_size": 3291269,
    "plain_text": "# BazarLoader deploys a pair of novel spam vectors\n\n**[news.sophos.com/en-us/2021/04/15/bazarloader-deploys-a-pair-of-novel-spam-vectors](https://news.sophos.com/en-us/2021/04/15/bazarloader-deploys-a-pair-of-novel-spam-vectors)**\n\nAndrew Brandt April 15, 2021\n\nSeveral waves of a spam-driven malware campaign that began in January leveraged the\nname recognition of remote-work collaboration tools like Slack and BaseCamp in links to\nmalware payloads hosted on the cloud storage those services provide. The emails also\ninserted the names of both the recipient and their employer into the messages, in an attempt\nto convince their enterprise recipients to download and execute the Trojan payloads\ntemporarily hosted in those legitimate websites.\n\nThe malware, known as BazarLoader, has employed a number of business-centric social\nengineering tricks to convince its targets – employees of large organizations – that the\nmessages contain important information relating to payroll, contracts, invoices, or customer\nservice inquiries. One spam sample even attempted to disguise itself as a notification that\nthe employee had been laid off from their job.\n\n\n-----\n\nWhen a target was convinced to open the documents tied to the spam email, their computer\nquickly became infected with BazarLoader, which itself acts primarily as a delivery\nmechanism for other malware. With a focus on targets in large enterprises, BazarLoader\ncould potentially be used to mount a subsequent ransomware attack.\n\n\n-----\n\nAn example of a BazarCall spam, with no link, attachment, or outward sign of maliciousness\nBut the threat actors behind this attack, widely suspected to be the same as those behind\nmalware known as Trickbot, deployed a very different spam campaign beginning in February.\nIn the newer campaign, referred to as BazarCall, the spam message contained no personal\ninformation of any kind, no link, and no file attachment. In fact, all the message claims is that\na free trial for an online service the recipient purportedly is currently using will expire in the\nfollowing day or two, and embeds a telephone number the recipient needs to call in order to\nopt-out of an expensive, paid renewal.\n\nIn this later form of attack, only people who called the telephone number were given a URL,\nand instructed to visit the website where they could unsubscribe from these notifications. The\nwell-designed and professional looking websites bury an “unsubscribe” button in a page of\nfrequently asked questions. Clicking that button delivers a malicious Office document (either\na Word doc or an Excel spreadsheet) that, when opened, infects the computer with the same\nBazarLoader malware.\n\n\n-----\n\nTo learn this, we did find it necessary to speak to the people on the other end of that phone\nnumber, who (very pleasantly) guide the caller into a malware trap.\n\n### The bizarre Bazar email tease\n\nBazarLoader has employed a range of social engineering tropes and gimmicks, and cycled\nthrough a variety of delivery methods over the past several months. The email messages\nmay have an attached office document, or a link to one hosted elsewhere. Launching the\noffice document triggers the download of an executable payload, but the email does not\nalways use that infection vector. Sometimes, the message body contains a link for the target\nto download the malware executable itself.\n\nThis BazarLoader spam used the recipient’s name, department, and employer in the\nheaders, body and signature\nThe messages in the business-focused spam campaign often appear as terse requests to\nreview a work-related document, and the message content usually contains the name of both\nthe targeted organization and the recipient – though not always particularly convincingly. In\none such message sent to the employee of a bank, the sender wrote “I am a new employee\nin [bank name]. I attempted to contact you 2 times today. I have to ask, what about our client\nclaim request #[string of numbers]” followed by the words “Online preview in PDF” hotlinked\nto the download site.\n\n\n-----\n\nThis\n\nBazarLoader email experimented with a link shortener\n\nThe service quickly shut down the malicious link\nIn another example, the email with a subject line of “I am unable to call you” said in the\nmessage body “Hi, [target’s name]! In addition to our appointment of 1st of february, I\napologize to substantiate that your employment with [name of business] is closed with effect\nfrom [date]/2021. Here is a copy of your Report (preview in PDF). It comes with your\nsettlement.”\n\nNot everyone received bad news, however. Some targets received messages that claimed\nthey had received a merit-related bonus or pay increase. “I could not catch you at the\n\n[company name] office. Because Annual Bonus Report No.43-2/5/21 of the head office has\n\n\n-----\n\nbeen processed (preview in PDF). You have additionally credited 1,936 to your payroll\naccount.”\n\nIn the subsequent BazarCall campaign, which began in late February, the messages initially\nclaimed to originate from a company called Medical Reminder Service, Inc. and include a\ntelephone number in the message body, as well as a street address for a real office building\nlocated in Los Angeles. The From: address in the messages was forged, but most of the\nmessages were identifiable by the subject line, which take a form like “Your free period (long\nnumber) has come to end” (sic) or “Thank you for using your free trial (long number).”\n\n\n-----\n\nThe front page of\n\none of several variations on the “Medical Reminder Service” website, set up by the attackers\nto deliver a malicious payload\nRecipients of these messages were warned that their credit cards would be charged within a\nday or two if they did not unsubscribe from a trial of this service they were purportedly\nsubscribed to. The only way to find out how to unsubscribe was to call the telephone number\nin the message body, which gives the caller a URL they needed to visit. We tried calling\ndozens of the numbers embedded in the messages and only rarely were able to connect\nsuccessfully and obtain the URL.\n\nThe “BookPoint” website and spam variation appeared in mid-April\n\n\n-----\n\nBy mid-April, the BazarCall messages adopted a new trope, that of a paid online lending\nlibrary library of sorts that calls itself BookPoint, BooksPoint, or World Book Point. Like the\nMedical Reminder Service messages, the body of these emails have no link or attachment,\nbut includes a telephone number and a real street address in Los Angeles. The subject lines\nalso reference a long number or code, which is relevant to the next phase of the attack.\n\nTransitioning from spoofed domains….\n\n…\n\nto domains that reference the spam trope in use by the threat actors.\nPerhaps realizing that the faked From address was a dead giveaway, the attackers made\nsome subtle changes to the book-themed spam. The most important of these is that, instead\nof originating from a forged From: address, these messages have a From: address whose\ndomain is thematically connected to the spam trope.\n\n### BazarCall unsubscribe delivers a maldoc\n\nBy this point in the attack, recipients of the BazarCall emails have, so far, been coerced to\ncall a telephone number to obtain a URL where they can “unsubscribe” from the premium\nservice they’re allegedly about to have to pay for. This is one of the most bizarre parts of the\nattack, since it leads to an otherwise legitimate-looking website (created by the threat actors)\nthat does not make it easy to find how to unsubscribe from the service.\n\nIn fact, it takes a bit of hunting around on these websites in order to find the unsubscribe\nbutton or link. Eventually, after a lot of hunting around, we discovered that the unsubscribe\nlink appears on the “frequently asked questions” (or FAQ) page on the website. There’s\n\n\n-----\n\nanother link on the subscribe page.\n\nThis variation on the “medical reminder” website uses the same text in the first FAQ\nquestion…\n\nas in the second, and…\n\n\n…\n\n\n-----\n\n…\n\n\nalso in the third item, but the cancellation “answer” includes an unsubscribe button.\nMost of the text on this page appears to come from a boilerplate; all of the answers to\nvarious questions displayed on the pages are identical and completely irrelevant to the\nquestion shown on the page. However, there is always a question that is labeled along the\nlines of “how do I unsubscribe from the service” that has a link beneath it.\n\nThere may be no magic formula to write perfect ad copy, but it doesn’t require consultation\nwith a potions master to realize this is bogus.\n\nCall the number, speak to the person on the other end of the phone, and download your\nmalicious Excel spreadsheet.\n\n\n-----\n\nThese links then lead to a different page (or sometimes, a completely different website)\nwhere the visitor is asked to enter that long number that was listed in the email’s Subject line\ninto a text entry box on the website in order to “unsubscribe.” If you successfully put the right\nnumber into this box (and if the stars are correctly aligned in the universe), the page delivers\na malicious Excel or Word document.\n\nAfter experimenting with calling the call center and speaking with a representative, we\nsuspect that the web page only delivers a malicious document if the threat actors activate the\n“customer number” you provide during the call. If (after finding out the domain used for the\nunsubscribe link) we entered a different number from a different message that was part of\nthe same campaign into the website, it delivered a zero-byte file, or a file filled with garbage\ndata.\n\nThe very helpful person on the other end of the call gently guides you to the section of the\nwebsite where you enter your number, and then instructs you to download and open the\nmalicious Excel spreadsheet or Word document, then to disable anti-scripting security\nmeasures that are enabled by default in most installations of Microsoft Office.\n\nThe most jarring aspect of the call was that they were so pleasant about it.\n\n### Rapid, low-key infection\n\nIn the examples where the malware was hosted on the work-collaboration websites, we most\noften saw a link point directly to a digitally signed executable with an Adobe PDF graphic as\nits icon. These files’ names were part of the ruse: for example, presentation-document.exe,\n_preview-document-[number].exe or annualreport.exe._\n\nThese executable files, when\n\nrun, inject a DLL payload into a legitimate process, such as the Windows command shell,\n_cmd.exe. The malware, only running in memory, cannot be detected by an endpoint_\nprotection tool’s scans of the filesystem, as it never gets written to the filesystem. The files\nthemselves don’t even use a legitimate .dll file suffix because Windows doesn’t seem to care\nthat they have one; The OS runs the files regardless.\n\nThe attackers further extended the social engineering aspect of the attack by creating\nsacrificial accounts on remote-work collaboration platforms, such as BaseCamp or Slack,\nwhich the attackers used to host (temporarily, until the companies received a report) the\n\n\n-----\n\npayload executable. The attackers prominently displayed the URL pointing to one of these\nwell-known legitimate websites in the body of the document, lending it a veneer of credibility.\nThe URL might then be further obfuscated through the use of a URL shortening service, to\nmake it less obvious the link points to a file with an .exe extension.\n\nThe spreadsheet’s malicious scripts drop several files into the %PUBLIC% (C:\\Users\\Public)\nfolder; Excel runs a command to decode one of them into a DLL and launch it.\nIn an attack that leveraged a social engineering trope of a magazine subscription invoice, the\nattachment was an Excel spreadsheet whose macros triggered PowerShell to retrieve, then\nlaunch, a pair of payload DLLs, each compiled for a specific CPU architecture (32-bit or 64bit) the target’s computer might be using. The payload for the incorrect architecture would\nthen sacrificially self-delete, leaving only the correct type running.\n\nIn the BazarCall campaigns, the attackers deliver weaponized Microsoft Office documents\nthat invoke commands to drop and execute one or more payload DLLs.\n\nBefore you enable active content, the spreadsheet looks like this…\n\n\n-----\n\nThe infection process runs the DLLs by invoking the rundll32.exe command with an\ninitialization function. That triggers the system to spawn an instance of a legitimate Windows\ncomponent (either cmd.exe, explorer.exe, or svchost.exe) and injects the malware DLL into\nthat process’ memory space. None of these programs would appear unusual to a casual\nobserver of the target’s Task Manager window.\n\nAfter the script runs, it drops this benign spreadsheet in %PUBLIC% to make it appear you\nhave opened some type of form you need to fill out in order to unsubscribe. By the time you\nsee this, your computer is already infected.\nWhile early versions of the malware were not obfuscated, more recent samples appear to\nencrypt the strings that might reveal the malware’s intended use. BazarLoader appears to be\nin an early stage of development and isn’t as sophisticated as more mature families like\nTrickbot, but does seem to share some intriguing details in common.\n\n\n-----\n\nThe Mitre ATT&CK framework techniques used by the Excel .xlsb payloads\n\n### Bot’s behavior, command and control\n\nThe malware itself comes in two flavors: a “loader” (which the attackers use as a malware\ndelivery mechanism) or a backdoor. We’ve observed the loader version deliver a variety of\npayloads the nature of which is beyond the scope of this article.\n\nAs mentioned above, BazarLoader’s main loader module persists as a memory-only\nmalware by running injected into a system process. The malware survives a reboot and\ncommunicates with one or more command-and-control servers over TLS both to the\nstandard port 443 and, occasionally, to an alternate port, such as 8443.\n\nIn an attempt to disguise its function and intent, the malware doesn’t use API system calls\ntied to an import table. Instead, every time BazarLoader calls a system API, it resolves the\ncorrect API call address by looking up a DWORD hash in a lookup table. That complexity\nconfers an advantage to the malware against some behavioral tools, because the malware\ngenerates the hash on the fly the first time it’s run, and there’s no way for any endpoint\nprotection tools to be able to anticipate what the hash value would be that signifies any given\nfunction.\n\n\n-----\n\nIf\n\nyour computer is set up for use in Russia, BazarLoader self-terminates.\nAfter creating a unique lookup table for the API calls, BazarLoader then checks to see\nwhether the system is set to the Russian locale in language settings. If the infected system is\nconfigured to use the Russian language, it quits.\n\nThe malware initially connects to its C2 server and performs an HTTPS HEAD request to a\nspecific URL that is known to be not valid: www.microsoft.com/update/service.exe. It\nfollows that by making an HTTPS GET request to the path /stat/var/upd on one of its C2\nservers. The server returns a file that’s larger than 200kb.\n\nImmediately, the bot begins beaconing to its C2 server by making a series of HTTPS GET\nrequests, followed by HTTPS POST requests, uploading a few bytes of meaningful data.\nBazarLoader uses a command and control scheme that looks like the following:\n```\nGET https://x.x.x.x/[32-byte-unique-identifier]/[command]/\nPOST https://x.x.x.x/[32-byte-unique-identifier]/[command]/\n\n```\nThe [command] used in these requests is always a number between 1 and 100. Most\ncommonly, the malware gets into a rhythm where it beacons a check-in request (command\n**2), then POSTS a few bytes of data (command 3).**\n```\nGET https://x.x.x.x/[32-byte-unique-identifier]/2/\nPOST https://x.x.x.x/[32-byte-unique-identifier]/3/\n\n```\nThe numbers signify the command being invoked. The /2/ command is a query to the C2 for\nnew commands, and the /3/ uploads new information to the C2 server.\n\nIn addition to these commands, there are a few others:\n\n**/1/ triggers the bot to collect a wide range of system profiling information;**\n\n\n-----\n\n**/10/ downloads a payload, given a URL, and executes it by injecting it into**\nNotepad.exe, Explorer.exe, Svchost.exe, or cmd.exe;\n**/11/ downloads a DLL and executes it using rundll32;**\n**/12/ downloads and runs a batch script;**\n**/13/ executes a PowerShell script;**\n**/15/ triggers BazarLoader to quit;**\n**/100/ triggers it to delete itself completely, then quit.**\n\nWe have collected a significant amount of traffic between BazarLoader bots and their C2\nservers. The malware communicates with most of its C2 servers directly by contacting the IP\naddress of the C2, but the TLS certificate on the C2 server seems to be consistently one that\nappears to be assigned to a nonexistent domain, amadeamadey.at. At least one IP address\nused frequently by BazarLoader is assigned to the internet space used by Amazon Web\nServices, giving the malware operators a high-availability C2 from which to operate.\n\nLike the presence of Cobalt Strike, the\n\npresence of BazarLoader can signify the start of a highly dangerous infection, since it can\nbring down other payloads. Its method of injecting those payloads into running processes is\nimplemented in a very similar way to the Trickbot module “injectDLL” as well.\n\n### Blockchain DNS usage\n\nThe threat actors behind Trickbot have been well known to experiment with a wide variety of\nnew technologies, adopting short-lived experiments which they sometimes abandon if proven\nto be ineffective. For instance, several years back Trickbot experimented with an\n\n\n-----\n\nanonymizing tool called i2p, which is (practically speaking) similar in purpose to Tor. This\nbehavior also characterizes BazarLoader, which appears to be experimenting with a\ntechnology called Blockchain DNS (B-DNS).\n\nEmercoin manages the blockchain that also can be used as a DNS resolver for the .bazar\nTLD.\nIn the course of reverse-engineering the BazarLoader payloads, we often came across\nembedded, hardcoded IP addresses as well as domain names that use a non-standard toplevel domain (TLD) of .bazar. As it turns out, domain names that use the .bazar TLD do not\nneed to be registered in the traditional way that most other domain names do, with the help\nof a domain registrar.\n\nA cryptocurrency company called Emercoin permits anyone to assign themselves ownership\nof any domain name under the B-DNS TLDs simply by recording its use on a blockchain the\n[company oversees The OpenNIC network peers the B-DNS TLDs for Emercoin and other](https://wiki.opennic.org/opennic/dot?redirect=1#peered_top-level_domains)\n\n\n-----\n\norganizations, but doesn t manage them. Once ownership propagates into the blockchain,\nthe domain is yours.\n\nThe decentralized management structure of this arrangement confers certain advantages of\nparticular interest to criminal groups: Domains registered on the B-DNS system as it exists\ntoday cannot be altered, seized by law enforcement, or revoked or shut down by a domain\nregistrar or other authority, such as ICANN. Only the person in possession of the domain’s\nblockchain private key is able to transfer the registration to someone else (or shut it down),\nremoving a single point of failure that particularly impacts malware operators.\n\nThere are also some weaknesses to the B-DNS system. Unlike the Tor “dark web,” the BDNS system does not provide anonymity to the host IP address that could be used as a\ncommand-and-control server. Also, domains registered under the B-DNS TLDs (which in\naddition to .bazar include .coin, .emc, and .lib) will not resolve normally through the\ntraditional DNS architecture.\n\n[Instead, the B-DNS system operators have set up a number of other methods for domain](https://github.com/B-DNS/Resolver)\nresolution. One method involves a set of web domains (registered in the conventional way)\nthat can be used as a sort of B-DNS lookup mechanism . But the malware doesn’t care\nabout that; Its creators can look up domains in any way they see fit. Emercoin wallets contain\na sort of DNS server that allows users of those wallets to resolve the domains registered in\n[B-DNS space. There are also browser plugins that will resolve B-DNS domains in the](https://addons.mozilla.org/en-US/firefox/addon/b-dns/)\nbackground as you surf.\n\nThe BazarLoader payloads also have a hardcoded C2 server address that the malware\nattempts to contact first, but if the bot is unable to reach its main C2, it attempts to resolve\nthe B-DNS domains using OpenNIC, over UDP. Some BazarLoader payloads also include a\ndomain generating algorithm, which they may deploy if they can’t reach one of the\nhardcoded C2 addresses using either the conventional or B-DNS method.\n\n### Connection to Trickbot\n\nIt was not obvious at first, but BazarLoader actually shares another similarity with Trickbot:\nThey use some of the same infrastructure for command and control. I discovered this in a\nquite surprising way.\n\nDuring the course of doing the research for this story, I received an unexpected visit at my\nhome by an FBI agent. The agent, who said they were in town on other business, dropped\nby to perform what they described as a victim notification. They gave me several sheets of\npaper containing various characteristics of the malware infection I was studying, including\nindicators of compromise; The descriptions and other indicators matched what I was looking\nat, but there was one catch.\n\nThe agent handed me a piece of paper that said the malware running on my lab network was\n“associated with Trickbot actors ”\n\n\n-----\n\nIt was the first concrete indication I had ever received of a more than coincidental connection\nbetween Trickbot and BazarLoader. From what we could tell, the malware binaries running in\nthe lab network bear no resemblance to Trickbot. But they did communicate with an IP\naddress that has been used in common, historically, by both malware families. Of course, a\nlot of people [have studied](https://www.cybereason.com/threat-alert-new-trickbot-variants) [this connection in the past. This was not the first time I had heard](https://cyware.com/news/links-discovered-between-bazar-and-trickbot-2909546d)\nit.\n\nBut it was the first time, in a long career in cybersecurity, in which for years I have habitually\npermitted malware to run for extended periods of time on a lab network based out of my\nhome, that the FBI had ever decided to drop by, personally, to let me know there was\nmalware on my network — and even bring me a report with IOCs.\n\nNow that’s what I call service!\n\n## Detections\n\nBazarLoader may be detected by the definitions Evade_18a or HPmal/Crushr-BJ, or may\nbe blocked from operating by behavioral or network protection rules.\n\n[Indicators of compromise for BazarLoader have been published to the SophosLabs Github.](https://github.com/sophoslabs/IoCs/blob/master/Troj-BazarLd.csv)\n\nAcknowledgments\n\n[SophosLabs wishes to acknowledge the contributions of Sivagnanam Gn to a better](https://news.sophos.com/en-us/author/sivagnanam-gn/)\n[understanding of BazarLoader’s internals and C2 commands; of Johannes Bader for his](https://twitter.com/viql)\n[work on BazarLoader’s domain generation algorithms; Cyberreason Nocturnus for their](https://johannesbader.ch/blog/next-version-of-the-bazarloader-dga/)\ndiscovery of the similarities between Trickbot and BazarLoader; a small army of\npseudonymous researchers on Twitter who regularly publish BazarLoader/BazarCall IOCs\n(you know who you are); and of the special agents of the FBI for sharing their BazarLoader\nindicators of compromise and trying to defend small businesses from these relentless threat\nactors.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-15 - BazarLoader deploys a pair of novel spam vectors.pdf"
    ],
    "report_names": [
        "2021-04-15 - BazarLoader deploys a pair of novel spam vectors.pdf"
    ],
    "threat_actors": [
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536124,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653688300,
    "ts_modification_date": 1653688300,
    "files": {
        "pdf": "https://archive.orkl.eu/40da994a586f21649bc1b2fe8686fe44ceec8e00.pdf",
        "text": "https://archive.orkl.eu/40da994a586f21649bc1b2fe8686fe44ceec8e00.txt",
        "img": "https://archive.orkl.eu/40da994a586f21649bc1b2fe8686fe44ceec8e00.jpg"
    }
}