{
    "id": "cab02c49-dac8-4a08-9a39-486dd484369e",
    "created_at": "2023-01-12T15:09:53.569727Z",
    "updated_at": "2025-03-27T02:05:51.504705Z",
    "deleted_at": null,
    "sha1_hash": "733ef61e5932bef31f74a3120fe5248bca294299",
    "title": "2015-09-14 - The Shade Encryptor- a Double Threat",
    "authors": "",
    "file_creation_date": "2022-05-27T19:01:38Z",
    "file_modification_date": "2022-05-27T19:01:38Z",
    "file_size": 450910,
    "plain_text": "# The Shade Encryptor: a Double Threat\n\n**[securelist.com/the-shade-encryptor-a-double-threat/72087/](https://securelist.com/the-shade-encryptor-a-double-threat/72087/)**\n\nAuthors\n\nVictor Alyushin\n\nFedor Sinitsyn\n\nA family of ransomware Trojans that encrypts files and adds the extensions “.xtbl” and “.ytbl”\nemerged in late 2014/early 2015, and quickly established itself among the top three most\nwidespread encryptors in Russia (along with Trojan-Ransom.Win32.Cryakl and TrojanRansom.BAT.Scatter). This threat has been assigned the verdict TrojanRansom.Win32.Shade according to Kaspersky Lab’s classification. The original name given\nto the encryptor by its creator is not known; other security vendors detect it as\nTrojan.Encoder.858, Ransom:Win32/Troldesh.\n\nThere has been no appreciable evolution of this Trojan over time – only the format of the\nencrypted file’s name, the C&C server addresses and the RSA keys have been changing.\n\n\n-----\n\nThere are two main methods used to deliver the malware to victims computers: spam\nmessages and exploit kits (in particular, NuclearEK).\n\nWhen delivered via spam, the user receives a letter with a malicious file attached. The\nsystem is infected when the user attempts to open the attachment. The following file names\nhave been used when spreading Trojan-Ransom.Win32.Shade:\n\ndoc_dlea podpisi.com\ndoc_dlea podpisi.rar\ndocumenti_589965465_documenti.com\ndocumenti_589965465_documenti.rar\ndocumenti_589965465_doc.scr\ndoc_dlea podpisi.rar\nнеподтвержден 308853.scr\ndocumenti dlea podpisi 05.08.2015.scr.exe\nakt sverki za 17082015.scr\n\nIt should be noted that the file name changes for each mass mailing campaign, so the\npotential file names are not limited to those listed above.\n\nThe second delivery mechanism – via exploit kit – is more dangerous because the infection\noccurs when the victim unwittingly visits a compromised website. It may be a site belonging\nto cybercriminals, or a legitimate resource that has been hacked. In most cases, the user is\ncompletely unaware of the danger the website poses. Malicious code on the website exploits\na vulnerability in the browser or a plugin, and the Trojan is then covertly installed in the\nsystem. Unlike the spam delivery method, the victim doesn’t even have to run an executable\nfile.\n\nAfter Trojan-Ransom.Win32.Shade ends up in the system, it connects to a C&C server\nlocated in the Tor network, reports the infection and requests a public RSA-3072 key that is\nsubsequently used to encrypt files (as discussed below). Should the connection attempt fail,\nthe Trojan chooses one of the 100 public keys that are stored within its body for just such an\neventuality.\n\nThe Trojan then starts encrypting files. While scanning for objects to encrypt, it uses the\nstatic list of extensions shown in the screenshot below.\n\n\n-----\n\nWhen encryption is complete, a menacing image is set as the desktop background:\n\nThe Trojan leaves ransom demands in the files README1.txt, …, README10.txt. The\ncontents of these files are always the same:\n\n\n-----\n\nHowever, unlike most other encryptors, Trojan-Ransom.Win32.Shade doesn’t stop there. It\ndoesn’t terminate its process, but instead starts an infinite loop in which it requests a list from\nthe C&C server containing the URLs of additional malware. It then downloads that malware\nand installs it in the system. This sort of activity is typical of download bots. We have spotted\nmalware from the following families being downloaded:\n\nTrojan.Win32.CMSBrute (a more detailed description is provided below).\nTrojan.Win32.Muref\nTrojan.Win32.Kovter\nTrojan-Downloader.Win32.Zemot\n\nBelow is the code for the download and listening loop:\n\nIt is therefore very important to run a complete anti-malware scan of the computer if the\nShade encryptor (or the .xtbl, .ytbl files it creates) is detected. If left untreated, the system will\nmost probably remain infected with several malicious programs downloaded by the\nencryptor.\n\n## Common features of Shade family Trojans\n\n\n-----\n\nWritten in C++ using STL and its own classes.\nStatically linked with Tor client.\nUses boost (threads), curl, OpenSSL libraries.\nEach sample has the URL of a C&C server hardcoded in it. A total of 10 C&C server\naddresses were identified in various samples, eight of which are currently active. All the\nC&C servers are located in the Tor network.\nAll strings (including the names of imported functions) are AES encrypted. They are\ndecrypted when the program starts, then the import table is dynamically populated.\nPrior to setting the new desktop background, the old one is saved in the registry.\nTypically packed with UPX and an extra packer. Once unpacked, it is 1817 KB in size.\nCreates 10 identical files named README1.txt, …README10.txt on the victim\ncomputer, containing ransom demands in Russian and English.\nA unique 256-bit AES key is generated to encrypt the contents and the name of each\nfile. The encryption is done in CBC mode with a zero initialization vector.\nContains 100 public RSA-3072 keys with the public exponent 65537 (A total of 300\ndifferent public keys were detected in various samples).\nHas the capability of downloading and launching malware.\n\n## The cryptographic scheme\n\n### Generating an infected computer ID\n\n1. The Trojan obtains the computer name (comp_name) with the help of API function\n\nGetComputerName, and the number of processes (num_cpu) with the help of API\nfunction GetSystemInfo;\n2. Using the serial number of the system volume, it calculates a 32-bit constant and\n\nconverts it into a HEX string (vol_const);\n3. Obtains data about the OS version (os_version) divided with the symbol “;” (e.g.\n\n“5;1;2600;1;Service Pack 3”);\n4. Creates the string comp_namenum_cpuvol_constos_version;\n5. Calculates the MD5 hash of this string;\n6. Converts the MD5 hash into a HEX string and uses its first 20 characters as the\n\ncomputer’s ID.\n\n### Receiving key data\n\nWhen the computer ID has been generated, the Trojan attempts to connect to the C&C\nserver located in the Tor network, sends the computer ID to it and receives the public RSA\nkey in return. If the connection attempt fails, one of the 100 public RSA keys hardcoded in\nthe Trojan body is selected.\n\n### Encrypting files\n\n\n-----\n\nThe algorithm AES 256 in CBC mode is used to encrypt files. For each encrypted file, two\nrandom 256-bit AES keys are generated: one is used to encrypt the file’s contents, while the\nother is used to encrypt the file name. These keys are placed in the utility structure key_data,\nwhich is then encrypted with the selected RSA key (so it takes up 384 bytes after encryption)\nand placed at the end of the encrypted file:\n\nIn C syntax, this stricture can be written as follows:\n\nThe Trojan attempts to rename the encrypted file using the result of the calculation\n**Base64(AES_encrypt(original file name)).xtbl (e.g. ArSxrr+acw970LFQw.xtbl). Failing**\nthis, it simply adds the extension .ytbl to the original file name. In later versions, the Trojan\nadds the infected computer’s ID and then the extension .xtbl to the file name, e.g.\n**ArSxrr+acw970LFQw.043C17E72A1E91C6AE29.xtbl.**\n\n## Communication with a C&C server\n\nThe address of one C&C server is contained in the Trojan’s body. The servers are located in\nthe Tor network and communication is established using a Tor client that is statically linked to\nthe Trojan.\n\nThe sample sends the following requests to the C&C server:\n\n1. Request for a new public RSA key:\n\nGET http://<server>.onion/reg.php?i=ID&b=build&v=version&ss=stage\n\n**ID – the ID of the infected computer;**\n\n**build – the ID of the specific Trojan sample;**\n\n**version – the Trojan’s version (we encountered versions 1 and 2);**\n\n**stage – the stage of encryption – request for a new public key or a message about**\ncompleting file encryption.\n\n\n-----\n\n2. Error message:\n\nGET http://<server>.onion/err.php?i=ID&b=build&v=version&err=error\n**error – a base64-coded message about an error during encryption.**\n3. Report about the encryptor’s current stage:\n\nGET http://<server>.onion/prog.php?\ni=ID&b=build&v=version&ss=stage&c=count&f=finish\n**count – the current count of encrypted files;**\n**finish – the flag showing that encryption has completed.**\n4. Information about the system:\n\nPOSThttp://<server>.onion/sys.php?\ni=ID&b=build&v=version&ss=stage&c=count&k=key_number&si=info\n**key_number – the number of the selected RSA key (if the key was not received from**\nthe server, but selected from the keys contained in the Trojan’s body);\n**info – information collected from the infected computer:**\n\nComputer name\nUser name\nIP address\nComputer domain\nList of logical drives\nWindows version\nList of installed software\n5. Request for a list of URL addresses from which additional malware needs to be\n\ndownloaded and launched:\nGET http://<server>.onion/cmd.php?i=ID&b=build&v=version\n\n## Propagation of the encryptor\n\n### Partnership program\n\nThe code that the user is prompted to email to the cybercriminals can have the form ID|0 if\nthe public code was received from the C&C server, or ID|key_number|build|version if one\nof the public RSA keys hardcoded in the Trojan’s body was selected, with the corresponding\nnumber used for the value key_number. ID is the identity of the infected computer, build\nand version are numeric values that denote respectively the ID of the specific Trojan sample\nand the encryptor’s version.\n\nWhile analyzing the Trojan’s samples, we detected several combinations of the ‘build’ value,\nemail addresses used to communicate with the cybercriminals, and C&C addresses.\nDifferent ‘build’ values are associated with different email addresses, although the same\nC&C can serve several different samples of the Trojan:\n\n**build** **C&C** **email**\n\n\n-----\n\n2 a4yhexpmth2ldj3v.onion files1147@gmail.com\n\npost100023@gmail.com\n\n2 a4yhexpmth2ldj3v.onion decode0987@gmail.com\n\ndecode098@gmail.com\n\n4 a4yhexpmth2ldj3v.onion decodefile001@gmail.com\n\ndecodefile002@gmail.com\n\n6 a4yhexpmth2ldj3v.onion files08880@gmail.com\n\nfiles08881@gmail.com\n\n2 e4aibjtrguqlyaow.onion decodefiles1@gmail.com\n\ndecodefiles@india.com\n\n15 e4aibjtrguqlyaow.onion post8881@gmail.com\n\npost24932@gmail.com\n\n12 gxyvmhc55s4fss2q.onion decode00001@gmail.com\n\ndecode00002@gmail.com\n\n14 gxyvmhc55s4fss2q.onion decode010@gmail.com\n\ndecode1110@gmail.com\n\n4 gxyvmhc55s4fss2q.onion deshifrovka01@gmail.com\n\ndeshifrovka@india.com\n\nWe observed the propagation of different samples from the encryptor’s two versions. For\neach specific sample of the same version of the Trojan there existed a unique combination of\n‘build’ (ID of the specific sample) and the email address (for communication with the\ncybercriminals).\n\nAlthough we found no partnership notices, based on the data we can assume the Trojan is\ndistributed, and the ransom collected, via a partnership network. Possibly, the malware\nsample IDs (the ‘build‘ value) and the different email addresses are associated with various\npartners responsible for distributing this malicious program.\n\n## Geography\n\nMost of the Trojan infections occur in Russia, Ukraine and Germany. According to KSN data,\nthe distribution of Trojan-Ransom.Win32.Shade is as follows.\n\n\n-----\n\nRussia 70,88%\n\nGermany 8.42%\n\nUkraine 6.48%\n\nAustria 3.91%\n\nSwitzerland 2.98%\n\nPoland 1.45%\n\nKazakhstan 1.20%\n\nBelarus 1.07%\n\nBrazil 0.55%\n\n## Downloaded malware: Trojan for brute forcing website passwords\n\nAmong the malicious programs downloaded by Trojan-Ransom.Win32.Shade is a trojan\nused for brute forcing website passwords. The internal organization of the brute forcer is very\nsimilar to that of the encryptor Trojan itself – it was most probably created by the same team\nof cybercriminals. This downloaded brute forcer Trojan has been assigned the verdict\nTrojan.Win32.CMSBrute.\n\n### Common features of the CMSBrute family\n\n\n-----\n\nWritten in C++ using STL and its own classes.\nStatically linked with the Tor client.\nUses boost (threads), curl, OpenSSL libraries.\nEach sample has a hardwired URL to one C&C server. A total of three C&C server\naddresses were detected in different samples. All the C&Cs are located in the Tor\nnetwork and are different from the addresses encountered in the TrojanRansom.Win32.Shade samples.\nAll strings (along with the names of imported functions) are AES encrypted. When the\nprogram launches, they are decrypted and the import table is then dynamically\npopulated.\nTypically UPX packed. Once unpacked, it is 2080-2083 KB in size.\nCopies itself to one of the C drive folders with the name csrss.exe.\nDownloads additional DLL plugins. The plugins contain code that determines the\ncontent management system (CMS) installed on the targeted site, searches for the\nadministration console and cracks passwords. We have detected plugins for websites\n[based on Joomla,](http://www.joomla.org/) [WordPress and](https://wordpress.com/) [DataLifeEngine.](http://dle-news.com/)\n\n### Communication with the C&C server\n\nEach sample of Trojan.Win32.CMSBrute contains the address of one C&C server. The\nservers are located in the Tor network and communication with them is established using the\nTor client that is statically linked to the Trojan.\n\nThe sample sends the following requests to the C&C server:\n\n1. Register new bot:\n\nGET http://<server>.onion/reg.php?n=ID&b=build&v=version&sf=stage\n\n**ID – the ID of the infected computer. It is calculated using a slightly different algorithm**\nthan the one used for the Shade encryptor;\n\n**build – the ID of the specific sample of the malicious program. We have encountered**\n**build1 only;**\n**version – the version of the malicious program. We have encountered version 1 only;**\n**stage – the stage of the Trojan’s operation.**\n2. A request to receive URL addresses for downloading/updating DLL plugins.\n\nGET http://<server>.onion/upd.php?n=ID&b=build&v=version&p=plugins\n3. Request for a task to determine the CMS on the website and to check the login\n\ncredentials:\n\nGET http://<server>.onion/task.php?n=ID&b=build&v=version&p=plugins\n\n**plugins – the versions of installed DLL plugins.**\n\nThe server’s response comes in the JSON format and contains URLs of the websites\nto be attacked and a dictionary for breaking passwords.\n\n\n-----\n\n4. Send a brute force report:\n\nPOST http://<server>.onion/rep.php?n=ID&b=build&v=version&rep=report\n**report – a JSON string containing a report about the CMS found on the website, as**\nwell as broken login credentials to the administration console.\n\n## Recommendations\n\nIn the case of Trojan-Ransom.Win32.Shade, all advice that was previously given on how to\ncounteract encryptors is still relevant. Detailed instructions are available at:\n\n[https://support.kaspersky.com/10952](https://support.kaspersky.com/10952)\n\nIf your computer has already suffered an attack by this Trojan, it is extremely important that\nyou run a full scan and treat it with an anti-malware solution. Remember that TrojanRansom.Win32.Shade downloads and installs malware belonging to several various families,\nas stated at the beginning of this article.\n\n## Appendix\n\nThe following samples were used while writing this article:\n\n**Verdict** **MD5**\n\nTrojan-Ransom.Win32.Shade.ub 21723762c841b2377e06472dd9691da2\n\nTrojan-Ransom.Win32.Shade.ui bb159b6fe30e3c914feac5d4e1b85a61\n\nTrojan.Win32.CMSBrute.a 543d1620ce976cb13fec190ccc1bc83a\n\n[Encryption](https://securelist.com/tag/encryption/)\n[Malicious spam](https://securelist.com/tag/malicious-spam/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\nVictor Alyushin\n\n\n-----\n\nFedor Sinitsyn\n\nThe Shade Encryptor: a Double Threat\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-09-14 - The Shade Encryptor- a Double Threat.pdf"
    ],
    "report_names": [
        "2015-09-14 - The Shade Encryptor- a Double Threat.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536193,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653678098,
    "ts_modification_date": 1653678098,
    "files": {
        "pdf": "https://archive.orkl.eu/733ef61e5932bef31f74a3120fe5248bca294299.pdf",
        "text": "https://archive.orkl.eu/733ef61e5932bef31f74a3120fe5248bca294299.txt",
        "img": "https://archive.orkl.eu/733ef61e5932bef31f74a3120fe5248bca294299.jpg"
    }
}