{
    "id": "caee4fbf-5769-4a82-b9ce-9a8baa008592",
    "created_at": "2023-05-06T02:08:39.592261Z",
    "updated_at": "2025-03-27T02:10:19.856939Z",
    "deleted_at": null,
    "sha1_hash": "8760ca1913867312fac5efb030c4e2f043e46242",
    "title": "2023-03-15 - QBot- Laying the Foundations for Black Basta Ransomware Activity",
    "authors": "",
    "file_creation_date": "2023-05-05T01:59:02Z",
    "file_modification_date": "2023-05-05T01:59:02Z",
    "file_size": 978641,
    "plain_text": "# QBot: Laying the Foundations for Black Basta Ransomware Activity\n\n**reliaquest.com/blog/qbot-black-basta-ransomware/**\n\n### Table of Contents\n\n\nMarch 15, 2023\n\n\nToward the latter half of Q4 2022, ReliaQuest discovered a security incident unfolding in a\ncustomer’s environment. A threat actor gained initial network access, rapidly escalated their\nprivileges, and moved laterally, quickly establishing a foothold in 77 minutes.\n\nWe severed the foothold the adversary established and worked alongside the impacted\ncustomer to remediate the implications of the intrusion, but some valuable lessons should be\ntaken away: many of the attackers’ actions were assisted by an accepted risk that, if\navoided, could have prevented—or at least slowed—their advances.\n\nThe threat actors’ techniques—notably the use of “QBot” for initial access—suggested they\nare an affiliate of the “Black Basta” ransomware-as-a-service (RaaS) program. Ransomware\nremains, arguably, the most [pernicious threat that businesses face in 2023. Let’s go over](https://www.reliaquest.com/i/blog/ransomware-q4-2022/)\nsome simple changes that can often mean the difference between remediation and\ncatastrophe.\n\n**[Download the Q1 2023 Ransomware Report >](https://www.reliaquest.com/resources/white-papers/ransomware-report-q1-2023/?)**\n\n\n-----\n\n### What Is QBot?\n\nAlso known as Qakbot, QuackBot, and Pinkslipbot, QBot is a banking trojan that was first\nobserved in 2007. As observed with other prominent banking trojans, like “Emotet,” QBot\nhas come to acquire many new functions and is consistently being developed to incorporate\nnew techniques and capabilities. In addition to stealing financial details and personally\nidentifiable information (PII), QBot can be used for lateral movement, detection evasion and\ndebugging, and installing additional malware on compromised machines.\n\n## Attack Overview: Stealth and Swiftness\n\nOn September 29, 2022, we detected malicious activity after the deployment of Cobalt Strike\nBeacon and remote management software in a customer’s environment. The attacker\nachieved initial access via a phishing email delivered to end-user inboxes—having slipped\npast an overly permissive security solution.\n\nThis phishing email led to the deployment of the QBot malware and gave the attacker an\ninitial foothold in the environment. They obtained valid service account credentials that were\npart of a domain administrator group, smoothing the path to move laterally and deploy other\nCobalt Strike beacons.\n\nThe timeline of initial QBot execution to lateral movement, commonly known as the breakout\ntime, was 77 minutes. (See Figure 1 for a timeline.) This is ​​far quicker than most cases of\n[this kind, which usually have a breakout time of around 2 hours.](https://www.crowdstrike.com/cybersecurity-101/lateral-movement/#:~:text=Breakout%20Time%20and%20the%201%2D10%2D60%20Rule&text=This%20means%20an%20organization%20has,your%20critical%20data%20and%20assets.)\n\nThe attacker’s actions had the whiff of a Black Basta affiliate, with Qbot activity widely\n[reported as being a cornerstone of Black Basta intrusions. Black Basta is a splinter group](https://www.reliaquest.com/blog/ransomware-in-q3-2022/)\nthat emerged after the “Conti” ransomware syndicate was quelled; its members moved on to\nalternative ransomware programs. The Black Basta group operates a ransomware-as-aservice (RaaS) program.\n\n\n-----\n\n## Kill Chain Details: Where Did It All Go Wrong?\n\n\n-----\n\n### Initial Access\n\nThe phishing email that granted initial access was delivered on 26 Sep 2022. The\nattachment to the message was named REF#6547_SEP_28.HTML, which was rightly\ndetected by Office 365 management as malicious: It was smuggling a ZIP file onto the\ntargeted network, to deliver a QBot implant. The email’s content prompted the recipient to\nlook at the attached file and approve its content.\n\n### Execution\n\n[Execution was achieved by HTML smuggling. Upon opening the HTML file in an email client,](https://www.reliaquest.com/blog/email-html-smuggling/?)\nthe screen pictured in Figure 2 was shown and the user was asked to download it locally.\nAfter they did so and opened the HTML file in a browser, an encoded JavaScript binary large\nobject (BLOB) surfaced. The BLOB then constructed and automatically downloaded a ZIP\nfile to the user’s disk.\n\n\n-----\n\nFigure 2: Fake Adobe Acrobat update\n\n\n-----\n\nThe ZIP file was protected by the password that then appeared on the screen: abc333. Once\nopened, an ISO image was found within the zipped archive; if double-clicked, the ISO was\nmounted to disk. Within the new drive—which is created when the ISO is mounted—was a\nLNK file, which pointed at a JS file which in turn invokes script STICKLERBLOWN.CMD. Of\ncourse, this all starts with the user clicking on that LNK file.\n\nThis concluded the current QBot delivery chain, with QBot acting as both trojan and malware\ndropper to enable an initial foothold onto a target’s environment. Fake Adobe Acrobat\nupdates have long been synonymous with the spread of malware, so nothing new here, but\nit continues to be effective as the software is free and widely used.\n\nIn this case, the attacker used the initial QBot foothold to deliver a Cobalt Strike beacon to\nthe beachhead. Cobalt Strike and post-exploitation tools are typical follow-on payloads\nresulting from these infections. Often, commodity malware is used before moving on to a\ncommand-and-control (C2) implant of the attacker’s choosing to solidify their foothold on the\nnetwork.\n\n### Command-and-Control\n\nAt this point, the threat actor pivoted from the QBot C2 channel to their newly established C2\nchannel provided by the Cobalt Strike beacon. It was an HTTPS beacon that communicated\nwith its team server located at 194.165.16[.]95, similar to in other QBot campaigns of RaaS\naffiliates and initial access brokers (IABs). (We’ve written before about the increasing role of\nIABs in facilitating cybercrime.)\n\n\n-----\n\nThe attacker also used alternative HTTPs channels to communicate and maintain their\nfoothold. They deployed and configured remote-access software AnyDesk, Atera, and\nSplashtop, which use the HTTPS protocol.\n\nThe use of commercial remote access software is common. Threat actors associated with\nConti ransomware’s affiliate program often use Atera and AnyDesk. In this case, AnyDesk\nwas installed following the identification and containment of Atera agents, which had been\ndeployed to multiple compromised hosts. These agents were linked to email address\n**UQUISKISESHLM[at]GMAIL[.]COM, which appears to be a random mix of letters; this was**\nmost likely conducted for OPSEC purposes.\n\n### Credential Access\n\nCredential access was achieved after the threat actor used the Data Protection Application\nProgramming Interface (DPAPI) to interact with a credential key for an account; DPAPI is\nused to protect personal data on the local system, including user credentials. This is a\ncommon target for credential harvesting, and in this case, it resulted in the account being\ncompromised. Some of the most common tools—including Mimikatz which was also used\nduring the incident—provide ways to interact with DPAPI to access credentials; Mimikatz is\nan open-source malware program used by hackers and penetration testers to gather\ncredentials on Windows computers\n\n### Privilege Escalation and Persistence\n\n\n-----\n\nDuring the intrusion, the attacker primarily made use of a service account with domain\nadministrator privileges. It freed them to carry out objectives until the account was disabled,\nat which point the attacker pivoted to another valid account that was also a member of the\ndomain administrators’ group. This quick pivot upon disabling their primary account was\nnotable.\n\nWe were also able to identify another operation which highlights on the theme that the\nattacker liked to have several available options. We identified that the threat actor attempted\nto add an account named OLDADMINISTRATOR to the Local Administrators group, on\nhosts where a local account named ADMINN had been previously created. We never\nidentified a further account creation for the account OLDADMINISTRATOR, which appeared\nodd. In the Conti affiliate manual, the affiliate is told to create the account\n**OLDADMINISTRATOR with the password qc69t4B#Z0kE3 and then add that account to**\nthe Local Administrators group. What the actor did in this case is mistakenly attempted to\nadd the account they were supposed to add to the Local Administrators group. Since the\n**OLDADMINISTRATOR had not been created, this was ultimately unsuccessful.**\n\nOf all the details we uncovered, this was perhaps the most comical. Even with a playbook,\nhuman error is still inevitable. It was also somewhat surprising that Conti’s affiliates clearly\nfollow the step-by-step rulebook to a T, even using predesignated passwords.\n\n\n-----\n\n### Discovery\n\n\n-----\n\nWindows binaries were used for network discovery including NET, ARP, ROUTE, NETSTAT,\nIPCONFIG, and WHOAMI; these were also seen as children processes of WERMGR.EXE.\nIn this case, the Qbot infection was responsible for these discovery operations as the Qbot\npayload was being run in a memory space of the wermgr.exe process.\n\nWe also identified the attacker making use of a networking scanning tool later during this\nintrusion. The attacker was seen using the tool NETSCAN.EXE, which can scan hosts within\n[the network for accessible network shares—another tool known to be used by Conti](https://blogs.blackberry.com/en/2022/09/the-curious-case-of-monti-ransomware-a-real-world-doppelganger)\naffiliates.\n\n\n-----\n\n### Lateral Movement\n\n\n-----\n\nTo move laterally, the attacker established remote desktop protocol (RDP) connections,\nincluding hijacking active RDP sessions on targeted hosts. They did this by using\n**QUSER.EXE: a binary that can enumerate active RDP sessions on devices and identify new**\nusers in an environment. Some hijacking attempts failed, and some were successful.\n\n\n-----\n\nBy investigating events surrounding the failed RDP connections, we saw that the threat actor\nwas accessing administrative shares; admin shares give system administrators remote\naccess to every disk volume on a network-connected system. These shares included the\nIPC$ network share, which was likely used to establish a remote procedure call (RPC) or\nserver message block (SMB) session. Again, this move was probably made to enable lateral\nmovement.\n\n### Collection and Exfiltration\n\nFor collection, the threat actor used QBot to start the process ESENTUTL.EXE, which is a\n[Living off the Land binary (LOLBin) that provides copy functionality. QBot is known to](https://www.reliaquest.com/blog/threat-actors-living-off-the-land/)\nharvest email data, but whether it did in this case isn’t known: A lack of command-line\narguments in the host’s Windows event logs meant verification wasn’t possible.\n\n\n-----\n\nAlthough ransomware operators are known to prioritize data exfiltration during intrusions, we\ndidn’t find any evidence that this attacker stole data. We did find outbound connections to\nCobalt Strike infrastructure (IP address 194.165.16[.]95), but they were likely for typical C2\ntraffic, rather than being conduits for exfiltrating data. No other tools commonly used for data\nexfiltration turned up during our investigation.\n\n### Defense Evasion\n\nThroughout the event, this attacker used several defense evasion techniques including\ncompressing an email payload, overpass the hash, and process injection. The threat actor\narchived the QBot payload into a disk image (ISO) file, and then compressed the disk image\n\n\n-----\n\ninto a password-encrypted ZIP file to evade email security and Mark of the Web (MotW)\ncontrols implemented by Microsoft. They managed this by compressing the payload into a\nZIP file-ISO image combination.\n\nThis threat actor also performed a sub-technique of pass the hash, known as overpass the\nhash: passing a targeted account’s New Technology LAN Manager (NTLM) hash to the\nKerberos authentication provider, resulting in a successful Kerberos authentication.\n\nProcess injection was used by both the initial QBot payload (into WERMGR.EXE) and the\nsubsequent deployment of Cobalt Strike (into WERFAULT.EXE).\n\nProcess Injection inserts arbitrary code into the address space of another process, giving the\nappearance that the injected (malicious) code was performed by a normal system process.\nThis evades static detection and application control solutions.\n\n## Black Basta’s Conti-Linked Heritage\n\nAfter emerging in 2019, the Conti ransomware group became a top-tier ransomware group\nbefore collapsing in May 2022. The demise likely stemmed from a series of operational\nerrors that led to a compromise of Conti’s infrastructure.\n\nChat logs taken from Conti were a treasure trove of intelligence for law enforcers and\nsecurity researchers alike. (You might remember our previous blog exploring five lessons\nfrom the Conti breach.) The release of the chat logs also coincided with several other highprofile faux-pas by the group. These included supporting the Russian state during the onset\nof the war with Ukraine, and also revealed major attacks against the Costa Rican\ngovernment.\n\n### Conti Splinters, Members Move On\n\nAs part of Conti’s splintering, many members unsurprisingly sought new employment in\nother ransomware groups. LockBit—which now accounts, overwhelmingly, for the largest\nmarket share of ransomware activity—was among the groups that probably welcomed a new\nintake of members from Conti. Several other groups have also reportedly splintered from\nConti, notably the “Karakurt Hacking Team,” the “Royal” ransomware group, and Black\nBasta—those infamous actors attributed to this security incident.\n\nBlack Basta first emerged in April 2022, a month before Conti folded. As most major\nransomware groups do, Black Basta uses double-extortion to solicit ransom payments,\nposting stolen data to its Basta News data-leak site if payment is not received within seven\ndays. Black Basta is known to target a wide variety regions and sectors, but mainly\nconstruction and industrial goods and services in the US and Germany.\n\n\n-----\n\n### Black Basta Forecast: Stormy Weather\n\nWhat’s the future for Black Basta and similar splinter groups? Well it’s likely that they’ll\nencounter increasing scrutiny from governments and law enforcement agencies. On 02 Feb\n2023, the UK National Crime Agency and the US Department of the Treasury’s Office of\n[Foreign Assets Control sanctioned seven individuals allegedly involved with Conti and](https://www.nationalcrimeagency.gov.uk/news/ransomware-criminals-sanctioned-in-joint-uk-us-crackdown-on-international-cyber-crime)\n“TrickBot” malware activity. Their real names, birthdates, email addresses, and photos were\nmade public and their lives restricted. This is the first time the UK has sanctioned individuals\ninvolved with ransomware, and it’s not likely to be the last.\n\n\n-----\n\nThose sanctions are part of a wider campaign, portending more arrests, disruptions, and\ninfrastructure take-downs by international law enforcement in the next one to three months.\nIt’s unlikely to have any direct impact on ransomware operations, but it’s the kind of scrutiny\nthat often leads to the closure of threat groups—and the ever-predictable “whack-a-mole”\neffort to tackle ransomware. (Once a group goes down, you just know they’ll return in some\nfashion.) If Black Basta members are named and shamed in future sanctions or arrests, we\nmight see another round of ransomware rebranding.\n\n## MITRE TTPs\n\nDuring the course of our investigation, we identified the threat actor using the following\nTTPs.\n\n**Kill Chain Phase** **MITRE TTP**\n\nInitial Access Phishing (T1566)\n\nExecution User Execution: Malicious Image (T1204.003 )\n\nExecution System Services: Service Execution (T1569.002)\n\n\nCommand and\nControl\n\nCommand and\nControl\n\nCommand and\nControl\n\nCommand and\nControl\n\n\nIngress Tool Transfer (T1105)\n\nApplication Layer Protocol: Web Protocols (T1071.001)\n\nProtocol Tunnelling (T1572)\n\nRemote Access Software (T1219)\n\n\nCredential Access Credentials From Password Stores (T1555)\n\nPrivilege Escalation Valid Accounts (T1078)\n\nPersistence Create Accounts: Local Account (T1136.001)\n\nDiscovery System Network Connections Discovery (T1049)\n\nDiscovery Network Share Discovery (T1018)\n\nLateral Movement Remote Services: remote Desktop Protocl (T1021.001)\n\nLateral Movement Remote Services: SMB/Windows Admin Shares (T1021.002)\n\nLateral Movement Remote Service Session Hijacking: RDP Hijacking (T1536.002)\n\nCollection Data From Local System (T1005)\n\n\n-----\n\nDefense Evasion Subvert Trust Controls: Mark-of-the-Web Bypass (T1553.005)\n\nDefense Evasion Use Alternate Authentication Material: Pass the Hash\n(T1550.002)\n\nDefense Evasion Process Injection (T1055)\n\n## Retaining Ransomware Resilience\n\n[Visibility is one of the key ways organizations can minimize the risks posed by the abundant](https://www.reliaquest.com/i/resource/research-report/tackling-the-visibility-gap-in-information-security/)\nactive cyber threats in 2023. You can’t secure what’s invisible to your incident responders,\nso ensuring effective logging coverings your assets is essential to detecting and responding\nto threats. The lack of logs forwarded to the SIEM meant ReliaQuest needed forensics\nimages and event log exports to fill in most of the events in this incident. We’ve written\n[before about the importance of maximizing business insights by improving logging activities.](https://www.reliaquest.com/i/resource/white-paper/top-5-log-sources-you-should-be-ingesting-but-probably-arent/)\n\nOther steps you can take to avoid being impacted by QBot or ransomware activity are as\nfollows.\n\nHarden perimeter security to restrict company assets from making arbitrary\nconnections to the internet. This may be accomplished through firewall or proxy\nconfigurations. This will minimize malware and command-and-control (C2) activity.\nLimit use of remote-access software. This software is one of the most common\nmethods for cybercriminals—notably initial access brokers (IABs) and ransomware\noperators—to gain access to targeted networks. Consider minimizing the use of such\nsoftware unless absolutely required for an individual for their jobs. The use of such\ntechnology should also be placed under enhanced monitoring to detect any misuse.\nDisable ISO mounting. ISO Mounting is increasingly being used as a method of\nbypassing anti-virus and endpoint detection tools. Consider disabling ISO mounting by\nadding the registry key referenced below, which removes the context menu for users\nwhen right clicking. This can also be added to your Group Policy to provide protection\nto all users, while still allowing administrators to mount drives with PowerShell and the\nMount-DiskImage command. HKEY_CLASSES_ROOT\\Windows.IsoFile\\shell\\mount\n```\n   called ProgrammaticAccessOnly\n\n```\nEnsure the security of backups and regularly test them for reliability. The “3-2-1” rule is\none of the most tried and tested rules for backups, this guideline states that\norganizations should keep three backup copies, across two different mediums, with\none stored off-site. Many businesses may use a combination of the cloud and physical\nstorage to facilitate this requirement. This is also arguably the most secure way to back\nup data and avoids the risk of backups that are stored on NAS or other networkstorage devices being corrupted during a ransomware attack.\n\n\n-----\n\nReliaQuest provides a detection-in-depth approach to attack coverage, which relies on\nproper logging being in place. This can be achieved by engaging with our GreyMatter\n[platform, which provides a unified detection-investigation-response process, greatly](https://www.reliaquest.com/platform/detection-investigation-response/)\nincreasing visibility of the various threats across your attack surface. Having better visibility\ninto threats reduces complexity and helps efficiently manage risk for your business.\n\nThe Q1 2023 Ransomware Report\n\nThis report looks at the most important ransomware-related events during Q1 2023: key\nevents, metrics of ransomware groups, and what steps organizations can take to protect\nthemselves from these threats.\n\n[Get the Report](https://www.reliaquest.com/resources/white-papers/ransomware-report-q1-2023/?)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-15 - QBot- Laying the Foundations for Black Basta Ransomware Activity.pdf"
    ],
    "report_names": [
        "2023-03-15 - QBot- Laying the Foundations for Black Basta Ransomware Activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338919,
    "ts_updated_at": 1743041419,
    "ts_creation_date": 1683251942,
    "ts_modification_date": 1683251942,
    "files": {
        "pdf": "https://archive.orkl.eu/8760ca1913867312fac5efb030c4e2f043e46242.pdf",
        "text": "https://archive.orkl.eu/8760ca1913867312fac5efb030c4e2f043e46242.txt",
        "img": "https://archive.orkl.eu/8760ca1913867312fac5efb030c4e2f043e46242.jpg"
    }
}