{
    "id": "caef9868-2a19-4f27-8c0c-8d23a7cc0034",
    "created_at": "2023-01-12T15:07:25.759291Z",
    "updated_at": "2025-03-27T02:15:13.911795Z",
    "deleted_at": null,
    "sha1_hash": "7577f2094266a03334d308d2c61118f8d0d2552d",
    "title": "2019-04-05 - Pick-Six- Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:50:00Z",
    "file_modification_date": "2022-05-28T15:50:00Z",
    "file_size": 87219,
    "plain_text": "# Pick-Six: Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware\n\n**[fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html](https://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html)**\n\n## Breadcrumb\n\nThreat Research\n\nBrendan McKeague, Van Ta, Ben Fedore, Geoff Ackerman, Alex Pennino, Andrew\nThompson, Douglas Bienstock\n\nApr 05, 2019\n\n8 mins read\n\nRansomware\n\nThreat Research\n\n\n-----\n\n### Summary\n\nRecently, FireEye Managed Defense detected and responded to a FIN6 intrusion at a\ncustomer within the engineering industry, which seemed out of character due to FIN6’s\nhistorical targeting of payment card data. The intent of the intrusion was initially unclear\nbecause the customer did not have or process payment card data. Fortunately, every\ninvestigation conducted by Managed Defense or Mandiant includes analysts from our\nFireEye Advanced Practices team who help correlate activity observed in our hundreds of\ninvestigations and voluminous threat intelligence holdings. Our team quickly linked this\nactivity with some recent Mandiant investigations and enabled us to determine that FIN6 has\nexpanded their criminal enterprise to deploy ransomware in an attempt to further monetize\ntheir access to compromised entities.\n\nThis blog post details the latest FIN6 tactics, techniques, and procedures (TTPs), including\nties to the use of LockerGoga and Ryuk ransomware families. It also highlights how early\ndetection and response combined with threat intelligence gives Managed Defense customers\na decisive advantage in stopping intruders before their goals manifest. In this instance,\nManaged Defense thwarted a potentially destructive attack that could have cost our\ncustomer millions of dollars due to business disruption.\n\n### Detection and Response\n\nManaged Defense worked in tandem with the customer’s security team to acquire relevant\nlog data, share findings from system analysis, and answer critical investigative questions.\nThe customer was also undergoing a penetration test, so additional scrutiny was required in\norder to delineate between authorized testing activity and unauthorized activity attributed to\nFIN6. Our customer provided valuable insight into the role and importance of affected\nsystems in preparation for entering Rapid Response. Rapid Response is a service offering\nthat delivers incident response support to Managed Defense customers. As with any incident\nresponse service, the primary goal is to scope of the nature of the identified malicious activity\nand to assist our customers with a successful eradication event to eliminate the presence of\nadversaries.\n\nManaged Defense, utilizing FireEye Endpoint Security technology, detected and responded\nto the threat activity identified within the customer’s environment. The subsequent\ninvestigation revealed FIN6 was in the initial phase of an intrusion using stolen credentials,\nCobalt Strike, Metasploit, and publicly available tools such as Adfind and 7-Zip to conduct\ninternal reconnaissance, compress data, and aid their overall mission.\n\nManaged Defense investigated activity on two systems initially detected as compromised by\nFireEye Endpoint Security, the industry leading endpoint security solution that was ranked as\nthe [most effective endpoint detection and response (EDR) solution. The activity was](https://www.fireeye.com/blog/products-and-services/2019/02/mitre-evaluation-validates-fireeye-endpoint-security-as-most-effective-edr-solution.html)\ndetected by comprehensive real time methodology signatures designed to identify the most\nevasive adversary techniques. Pivoting from these initial leads, analysts identified suspicious\n\n\n-----\n\nSMB connections and Windows Registry artifacts that indicated the attacker had installed\nmalicious Windows services to execute PowerShell commands on remote systems.\nWindows Event Log entries revealed the user account details responsible for the service\ninstallation and provided additional IOCs (Indicators of Compromise) to assist Managed\nDefense in scoping the compromise and identifying other systems accessed by FIN6.\nManaged Defense utilized Windows Registry Shellbag entries to reconstruct FIN6’s actions\non compromised systems that were consistent with lateral movement.\n\n### Attack Lifecycle\n\nInitial Compromise, Establish Foothold, and Escalate Privileges\n\nTo initially gain access to the environment, Managed Defense analysts identified that FIN6\ncompromised an internet facing system. Following the compromise of this system, analysts\nidentified FIN6 leveraged stolen credentials to move laterally within the environment using\nthe Windows’ Remote Desktop Protocol (RDP).\n\nFollowing the RDP connection to systems, FIN6 used two different techniques to establish a\nfoothold:\n\nFirst technique: FIN6 used PowerShell to execute an encoded command. The command\nconsisted of a byte array containing a base64 encoded payload shown in Figure 1.\n\nBase64 encoded command\n\nFigure 1: Base64 encoded command\n\nThe encoded payload was a Cobalt Strike httpsstager that was injected into the PowerShell\nprocess that ran the command. The Cobalt Strike httpsstager was configured to download a\nsecond payload from hxxps://176.126.85[.]207:443/7sJh. FireEye retrieved this resource and\ndetermined it was a shellcode payload configured to download a third payload from\nhxxps://176.126.85[.]207/ca. FireEye was unable to determine the final payload due to it no\nlonger being hosted at the time of analysis.\n\nSecond technique: FIN6 also leveraged the creation of Windows services (named with a\nrandom 16-character string such as IXiCDtPbtGWnrAGQ) to execute encoded PowerShell\ncommands. The randomly named service is a by-product of using Metasploit, which creates\nthe 16-character service by default. The encoded command contained a Metasploit reverse\nHTTP shellcode payload stored in a byte-array like the first technique. The Metasploit\nreverse HTTP payload was configured to communicate with the command and control (C2)\nIP address 176.126.85[.]207 with a randomly named resource such as\n“/ilX9zObq6LleAF8BBdsdHwRjapd8_1Tl4Y9Rc6hMbPXHPgVTWTtb0xfb7BpIyC1Lia31F5gCN_btvkad7aR2JF5ySRLZmTtY” over TCP\nport 443. This C2 URL contained shellcode that would make an HTTPS request for an\nadditional download.\n\n\n-----\n\nTo achieve privilege escalation within the environment, FIN6 utilized a named pipe\nimpersonation technique included within the Metasploit framework that allows for SYSTEMlevel privilege escalation.\n\nInternal Reconnaissance and Lateral Movement\n\nFIN6 conducted internal reconnaissance with a Windows batch file leveraging Adfind to\nquery Active Directory, then 7-zip to compress the results for exfiltration:\n\nadfind.exe -f (objectcategory=person) > ad_users.txt\nadfind.exe -f objectcategory=computer > ad_computers.txt\nadfind.exe -f (objectcategory=organizationalUnit) > ad_ous.txt\nadfind.exe -subnets -f (objectCategory=subnet) > ad_subnets.txt\nadfind.exe -f \"(objectcategory=group)\" > ad_group.txt\nadfind.exe -gcb -sc trustdmp > ad_trustdmp.txt\n7.exe a -mx3 ad.7z ad_*\n\nThe outputs of the batch file included Active Directory users, computers, organizational units,\nsubnets, groups, and trusts. With these outputs, FIN6 was able to identify user accounts that\ncould access additional hosts in the domain. For lateral movement, FIN6 used another set of\ncompromised credentials with membership to additional groups in the domain to RDP to\nother hosts.\n\nMaintain Presence\n\nWithin two hours of the initial detection, the systems were contained using FireEye Endpoint\nSecurity. Through containment, attacker access to the systems was denied while valuable\nforensic evidence remained intact for remote analysis. Due to Managed Defense’s Rapid\nResponse and containment, FIN6 was unable to maintain presence or achieve their\nobjective.\n\nThrough separate Mandiant Incident Response investigations, FireEye has observed FIN6\nconducting intrusions to deploy either Ryuk or LockerGoga ransomware.The investigations\nobserved FIN6 using similar tools, tactics, and procedures that were observed by FireEye\nManaged Defense during the earlier phases of the attack lifecycle. Mandiant observed\nadditional indicators from the later attack lifecycle phases.\n\nLateral Movement\n\nFIN6 used encoded PowerShell commands to install Cobalt Strike on compromised systems.\nThe attacker made use of Cobalt Strike’s “psexec” lateral movement command to create a\nWindows service named with a random 16-character string on the target system and execute\nencoded PowerShell. In some cases, the encoded PowerShell commands were used to\ndownload and execute content hosted on the paste site hxxps://pastebin[.]com.\n\nComplete Mission\n\n\n-----\n\nFIN6 also moved laterally to servers in the environment using RDP and configured them as\nmalware “distribution” servers. The distribution servers were used to stage the LockerGoga\nransomware, additional utilities, and deployment scripts to automate installation of the\nransomware. Mandiant identified a utility script named kill.bat that was run on systems in the\nenvironment. This script contained a series of anti-forensics and other commands intended\nto disable antivirus and destabilize the operating system. FIN6 automated the deployment of\nkill.bat and the LockerGoga ransomware using batch script files. FIN6 created a number of\nBAT files on the malware distribution servers with the naming convention xaa.bat, xab.bat,\nxac.bat, etc. These BAT files contained psexec commands to connect to remote systems and\ndeploy kill.bat along with LockerGoga. FIN6 renamed the psexec service name to “mstdc” in\norder to masquerade as the legitimate Windows executable “msdtc.” Example strings from\nthe deployment BAT files are shown in Figure 2. To ensure a high success rate, the attacker\nused compromised domain administrator credentials. Domain administrators have complete\ncontrol over Windows systems in an Active Directory environment.\n\nstart copy svchost.exe \\\\10.1.1.1\\c$\\windows\\temp\\start psexec.exe \\\\10.1.1.1 -u\ndomain\\domainadmin -p \"password\" -d -h -r mstdc -s -accepteula -nobanner\nc:\\windows\\temp\\svchost.exe\n\nFigure 2: Strings from deployment BAT files\n\n### Ransomware\n\nRyuk is a ransomware that uses a combination of public and symmetric-key cryptography to\nencrypt files on the host computer. LockerGoga is ransomware that uses 1024-bit RSA and\n128-bit AES encryption to encrypt files and leaves ransom notes in the root directory and\nshared desktop directory. Additional information about Ryuk and LockerGoga is available on\n[the FireEye Intelligence portal: 18-00015730 and](https://intelligence.fireeye.com/reports/18-00015730) [19-00002005](https://intelligence.fireeye.com/reports/19-00002005)\n\n### Attribution\n\nFIN6 has traditionally conducted intrusions targeting payment card data from Point-of-Sale\n(POS) or eCommerce systems. This incident’s targeting of the engineering industry would be\ninconsistent with that objective. However, we have recently identified multiple targeted Ryuk\nand LockerGoga ransomware incidents showing ties to FIN6, through both Mandiant incident\nresponse investigations and FireEye Intelligence research into threats impacting other\norganizations. We have traced these intrusions back to July 2018, and they have reportedly\ncost victims tens of millions of dollars. As the frequency of these intrusions deploying\nransomware have increased, the cadence of activity traditionally attributed to FIN6—\nintrusions targeting point-of-sale (POS) environments, deploying TRINITY malware and\nsharing other key characteristics—has declined. Given that, FIN6 may have evolved as a\nwhole to focus on these extortive intrusions. However, based on tactical differences between\nthese ransomware incidents and historical FIN6 activity, it is also possible that some FIN6\noperators have been carrying out ransomware deployment intrusions independently of the\n\n\n-----\n\ngroup s payment card breaches. Which of those scenarios is happening would influence how\npressing a threat the group’s card data breach tactics continue to be. Criminal operations\nand relationships are highly adaptable, so we commonly encounter such attribution\nchallenges in regards to criminal activity. Given that these intrusions have been sustained for\nalmost a year, we expect that continued research into further intrusion attempts may enable\nus to more fully answer these questions regarding FIN6’s current status.\n\n### Indicators\n\nType Indicator\n\nNetwork 31.220.45[.]151\n\n46.166.173[.]109\n\n62.210.136[.]65\n\n89.105.194[.]236\n\n93.115.26[.]171\n\n103.73.65[.]116\n\n176.126.85[.]207\n\n185.202.174[.]31\n\n185.202.174[.]41\n\n185.202.174[.]44\n\n185.202.174[.]80\n\n185.202.174[.]84\n\n185.202.174[.]91\n\n185.222.211[.]98\n\nhxxps://176.126.85[.]207:443/7sJh\n\nhxxps://176.126.85[.]207/ca\n\nhxxps://176.126.85[.]207:443/ilX9zObq6LleAF8BBdsdHwRjapd8_1Tl4Y9Rc6hMbPXHPgVTWTtb0xfb7BpIyC1Lia31F5gCN_btvkad7aR2JF5ySRLZmTtY\n\nhxxps://pastebin[.]com/raw/0v6RiYEY\n\nhxxps://pastebin[.]com/raw/YAm4QnE7\n\nhxxps://pastebin[.]com/raw/p5U9siCD\n\nhxxps://pastebin[.]com/raw/BKVLHWa0\n\nhxxps://pastebin[.]com/raw/HPpvY00Q\n\nhxxps://pastebin[.]com/raw/L4LQQfXE\n\nhxxps://pastebin[.]com/raw/YAm4QnE7\n\nhxxps://pastebin[.]com/raw/p5U9siCD\n\nhxxps://pastebin[.]com/raw/tDAbbY52\n\nhxxps://pastebin[.]com/raw/u9yYjTr7\n\nhxxps://pastebin[.]com/raw/wrehJuGp\n\nhxxps://pastebin[.]com/raw/tDAbbY52\n\nhxxps://pastebin[.]com/raw/wrehJuGp\n\nhxxps://pastebin[.]com/raw/Bber9jae\n\n\n-----\n\nHost 031dd207c8276bcc5b41825f0a3e31b0\n\n0f9931210bde86753d0f4a9abc5611fd\n\n12597de0e709e44442418e89721b9140\n\n32ea267296c8694c0b5f5baeacf34b0e\n\n395d52f738eb75852fe501df13231c8d\n\n39b7c130f1a02665fd72d65f4f9cb634\n\n3c5575ce80e0847360cd2306c64b51a0\n\n46d781620afc536afa25381504059612\n\n4ec86a35f6982e6545b771376a6f65bb\n\n73e7ddd6b49cdaa982ea8cb578f3af15\n\n8452d52034d3b2cb612dbc59ed609163\n\n8c099a15a19b6e5b29a3794abf8a5878\n\n9d3fdb1e370c0ee6315b4625ecf2ac55\n\nd2f9335a305440d91702c803b6d046b6\n\n34187a34d0a3c5d63016c26346371b54\n\nad_users.txt\n\nad_trustdmp.txt\n\nad_subnets.txt\n\nad_ous.txt\n\nad_group.txt\n\nad_computers.txt\n\n7.exe\n\nKill.bat\n\nSvchost.exe\n\nMstdc.exe\n\n### Detecting the Techniques\n\nThe following table contains several specific detection names, including methodology\ndetections for several tools and techniques that applied to the initial infection activity as well\nas additional detection names for the ransomware used by FIN6.\n\nPlatform Signature Name\n\nEndpoint Security METASPLOIT A (METHODOLOGY)\n\nSUSPICIOUS POWERSHELL USAGE\n(METHODOLOGY)\n\nBEACON A (FAMILY)\n\nSYSNATIVE ALIAS RUNDLL32.EXE\n(METHODOLOGY)\n\n\n-----\n\nNetwork Security and Email\nSecurity\n\n\nFE_Ransomware_Win64_Ryuk_1\n\nFE_Ransomware_Win_LOCKERGOGA_1\n\nFE_Ransomware_Win_LOCKERGOGA_2\n\nFE_Ransomware_Win32_LOCKERGOGA_1\nFE_Ransomware_Win32_LOCKERGOGA_2\nFE_Ransomware_Win64_LOCKERGOGA_1\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-05 - Pick-Six- Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware.pdf"
    ],
    "report_names": [
        "2019-04-05 - Pick-Six- Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536045,
    "ts_updated_at": 1743041713,
    "ts_creation_date": 1653753000,
    "ts_modification_date": 1653753000,
    "files": {
        "pdf": "https://archive.orkl.eu/7577f2094266a03334d308d2c61118f8d0d2552d.pdf",
        "text": "https://archive.orkl.eu/7577f2094266a03334d308d2c61118f8d0d2552d.txt",
        "img": "https://archive.orkl.eu/7577f2094266a03334d308d2c61118f8d0d2552d.jpg"
    }
}