{
    "id": "caf99df9-e317-49c8-bc5b-5257bcafac99",
    "created_at": "2023-01-12T15:04:26.325943Z",
    "updated_at": "2025-03-27T02:15:35.608425Z",
    "deleted_at": null,
    "sha1_hash": "2e14fbe806de89f500f0e5d657a43081973d01ae",
    "title": "2020-10-19 - New Vizom Malware Discovered Targets Brazilian Bank Customers with Remote Overlay Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T16:49:56Z",
    "file_modification_date": "2022-05-28T16:49:56Z",
    "file_size": 3750064,
    "plain_text": "# New Vizom Malware Discovered Targeting Brazilian Bank Customers with Remote Overlay Attacks\n\n**[securityintelligence.com/posts/vizom-malware-targets-brazilian-bank-customers-remote-overlay/](https://securityintelligence.com/posts/vizom-malware-targets-brazilian-bank-customers-remote-overlay/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nNew Vizom Malware Discovered Targets Brazilian Bank Customers with Remote Overlay\nAttacks\n\n\n-----\n\n[Banking & Finance October 19, 2020](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nBy [Chen Nahman co-authored by Ofir Ozer,](https://securityintelligence.com/author/chen-nahman/) [Limor Kessem 11 min read](https://securityintelligence.com/author/limor-kessem/)\nIBM Security Trusteer researchers have discovered a new malware code and active\ncampaign targeting online banking users in Brazil. The malware, coined “Vizom” by the team,\nuses familiar remote overlay attack tactics to take over user devices in real time, as the\nintended victim logs in, and then initiates fraudulent transactions from their bank account.\n\nWhat we found interesting about Vizom, is the way it infects and deploys on user devices. It\nuses ‘DLL hijacking’ to sneak into legitimate directories on Windows-based machines,\nmasked as a legitimate, popular video conferencing software, and tricks the operating\nsystem’s inherent logic to load its malicious Dynamic Link Libraries (DLLs) before it loads the\nlegitimate ones that belong in that address space. It uses similar tactics to operate the\nattack.\n\nIn this blog post we will provide further information about Vizom, going over the technical\ndetails of its components and how it achieves the attacker’s objectives to steal money from\nonline banking users. It’s important to keep in mind that while Vizom currently operates in\nBrazil, it can be adapted to target any other country in LATAM and in other parts of the world.\n\n## Recent Trends in Banking Malware\n\nThe COVID-19 pandemic has changed the world in many ways and has especially affected\n[the ways we work. Since so many people have shifted to working from home, and almost](https://securityintelligence.com/articles/vendor-management-remote-work/)\neveryone is using videoconferencing software to replace in-person meetings with both\nfriends and colleagues, Vizom uses the binaries of a popular videoconferencing software to\npave its way into new devices.\n\nTo operate the attack, Vizom uses the files of yet another legitimate software, this time the\nInternet browser Vivaldi, which helps to disguise the malware’s activity and avoid detection\nfrom operating system controls and anti-virus software.\n\n## Vizom’s Creative Way In\n\nA bird’s eye view of how Vizom operates shows the main components of the attack:\n\n\n-----\n\n_Figure 1: Vizom’s infection flow and fraud method_\n\n## Vizom’s DLL Hijacking\n\nTypically delivered by spam, once Vizom is downloaded by an unwitting user, it finds its way\ninto the AppData directory and launches the infection process. The following file list shows\nwhat Vizom’s dropper unpacks after it initially reaches a new device. These files come\npacked into a .zip archive, which is deleted after the files are extracted to the %temp% folder\non the target system.\n\nFile Path Purpose\n\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\zCrashReport.dll\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\zTscoder.exe\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\86970492.vbs\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\a2start.old\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\Cmmlib.dll\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\DuiLib.dll\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\libeay32.dll\n\n\n“Crash Handling Module”\n\nLegitimate videoconferencing\nsoftware’s video recording\nconverter\n\nMalware script to obtain statistics\non infections\n\nEncrypted malware string\ndictionary\n\nMalicious DLL (downloads\nsecond payload)\n\nVideoconferencing software DLL\n\n“OpenSSL Shared Library”\n\n\n-----\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\reslib.dll\n\nC:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\ssleay32.dll\n\n\nVideoconferencing software DLL\n\n“OpenSSL Shared Library”\n\n\nThe above file list contains a mix of legitimate files and the malware’s own resources. What\nVizom aims to do is have the main, and legitimate binary, load its malicious DLLs. It does\nthat by naming its own Delphi-based DLLs with DLL names the legitimate software expects\nto find in its directory. By doing that, Vizom tricks the operating system into running malware\nas the child process of a benign, videoconferencing file.\n\nHow can that take place? By relying on known Windows mechanisms.\n\n## How Vizom Piggybacks on Windows\n\nThe Windows operating system (OS) works in certain ways when it comes to loading files\nfrom its various directories. When an application or service is called to start running, the OS\nlooks for applicable DLLs in a given order. Many times, DLLs are called without a fully\nqualified file path, which makes Windows search for the correct location. It does that by\nlooking in a few places in the following order:\n\n1. It searches the directory from which that application was called and/or loaded.\n2. It searches in C:\\Windows\\System32.\n3. Searches in C:\\Windows\\System.\n4. Goes up and searches in C:\\Windows.\n5. Searches the current working directory.\n6. Searches directories in the entire system’s PATH environment variable.\n7. Finally, it searches directories in that user’s PATH environment variable.\n\nIn our case, Vizom’s malicious DLL was saved in the same directory of the executable that\nloaded it and Windows allowed it to load via the main executable. In this case, the malicious\nDLL’s name was taken from a popular videoconferencing software: “Cmmlib.dll.”\n\nTo make sure that the malicious code is executed from “Cmmlib.dll,” the malware’s author\ncopied the real export list of that legitimate DLL but made sure to modify it and have all the\nfunctions direct to the same address – the malicious code’s address space.\n\n\n-----\n\n_Figure 2: Cmmlib.dll export list showing the same address for all functions_\n\n## Vizom Misuses Binaries to Gain a Foothold\n\nThe next step for the dropper is to execute another legitimate binary, this time it’s\n“zTscoder.exe” via the command line prompt. This file will load the malicious DLL charged\nwith downloading the second payload.\n\n“C:\\Windows\\SysWOW64\\cmd.exe” /k cd “C:\\Users\\<USERNAME>\\AppData\\Local\\Temp\\”\n&& zTscoder.exe && exit\n\nAt this point, Vizom downloads the second payload, another .zip archive, from a remote\nserver that happens to be hosted on a public cloud bucket. These addresses can change\nevery campaign.\n\nhxxps://galinhaborabora[.]s3[.]amazonaws.com/felicidadeviver[.]zip\n\nThis archive contains a legitimate browser application called Vivaldi; a browser program\nbased on Chromium. Once again here, after extracting all files from the archive, Vizom then\ndeletes it.\n\n%USERPROFILE%\\AppData\\Local\\Vivaldi\n\n\n-----\n\nVivaldi is dropped to the target system alongside the malware s malicious DLLs and will be\nused as part of operating the attack. The first step is loading Vizom’s DLL from the main\nVivaldi folder:\n\nC:\\Users\\User\\AppData\\Local\\Vivaldi\\vivaldi_elf.dll\n\n_Figure 3: vivaldi_elf.dll is loaded to the “Vivaldi” process_\n\n## Vizom’s Persistence Mechanism\n\nTo create a persistence mechanism that will allow it to keep being loaded by an unwitting\nuser, Vizom modifies browser shortcuts so that they will all lead to its own executables and\nkeep it running in the background no matter what browser the user attempted to run.\n\n**Application opened** **Vivaldi File Name**\n\nMozilla Firefox vivaldi_2.6.1566.40.exe\n\nGoogle Chrome vivaldi_2.6.1566.41.exe\n\nInternet Explorer vivaldi_2.6.1566.42.exe\n\nOpera vivaldi_2.6.1566.43.exe\n\nBank-specific secure browser (1) vivaldi_2.6.1566.44.exe\n\nBank-specific secure browser (2) vivaldi_2.6.1566.45.exe\n\nMicrosoft Edge vivaldi_2.6.1566.46.exe\n\n\n-----\n\nIn the following image we show an example of a modified .LNK shortcut file that sets Vivaldi s\npoisoned file to open instead of Google Chrome.\n\n_Figure 4: Chrome Link file used by Vizom for persistence_\n\nThis does not mean that the victim will not see the intended browser open. The\ncorresponding browser program will be launched by the malicious Vivaldi process as a child\nprocess and the user will not have reason to suspect that something is amiss.\n\n_Figure 5: Vivaldi launches Chrome as a child process_\n\n\n-----\n\nIn the background, Vizom, disguised as a Vivaldi process, continues to run, monitoring the\nuser’s browsing and waiting for them to access their bank account. If the window title’s name\nmatches Vizom’s target list, it will go into action and alert the fraudster to connect remotely to\nthat victim’s device.\n\n## Dropping the Banking Malware Payload\n\nVizom is based on four major components that allow it to operate the fraud cycle after it is\ninstalled. Those components are:\n\n1. Browser monitoring\n2. Communication with the attackers’ (C2) server in real-time\n3. Remote access Trojan\n4. Malicious overlay screens module\n\nTo get some statistics on the botnet’s size, Vizom runs the following script:\n\nDim o\nSet o = CreateObject(“MSXML2.XMLHTTP”)\n\no.open “GET”, “http://sstatic1.histats.com/0.gif?4390758&101”, False\n\no.send\n\n## Vizom Starts Watching the Browser\n\nAfter it begins fully running on an infected device, Vizom, like other overlay malware,\nmonitors the user’s online browsing, waiting for a match for its target list. Since Vizom does\nnot hook the browser like other, more sophisticated malware typically does, it monitors\nactivity by comparing the window title the user is accessing to key target strings the attacker\nis interested in. This comparison happens continually in a loop.\n\nIn the image below, Vizom uses the function TwBuilding_obtainLines to decrypt the bank\nnames it targets. The decrypted string is compared to the active browser window title the\nuser is viewing.\n\n\n-----\n\n_Figure 6: Vizom window tab monitoring and string comparison_\n\nThe windows title acquisition is enabled by using the function GetWindowText:\n\n_Figure 7: Vizom’s window title acquisition function_\n\nUpon finding a bank name match, Vizom moves to the next stage and informs the attacker\nthat an infected device is accessing a targeted bank’s website.\n\n## Banking Malware Communicates With Attacker’s C2 Server\n\nTo alert the attacker to an opening banking session, Vizom uses a TCP socket and connects\nto the attacker’s server. The communication with the C2 server is a reverse shell where the\ninfected machine communicates back to the attacking server where a listener port receives\nthe connection.\n\n\n-----\n\nIn Vizom s case, the connection is based on Delphi s TClientSocket object. This object gets\nthe obvious address and port in order to connect. In addition to do that, the object also\nreceives three functions that handle different aspects of the connection:\n\n_Connect is used for the first message, which is “openconn.”_\n_Error is for error handling, and it’s the standard “terminate socket” function._\n_Read is the command list function — it processes every command received from the_\nC2 server and executes the desired action.\n\n_Figure 8: Socket creation function initiated_\n\nVizom’s communication with the C2 server is encrypted with AES256 using Delphi’s\nTCryptographicLibrary. In this library the decryption flow is different from regular AES\ndecryption:\n\nThe encrypted data is also Base64 encoded, so first we need to decode it to get the\nAES encrypted buffer.\nThe Delphi TCryptographicLibrary doesn’t have key restrictions like a normal AES\nencryption (32 bytes for AES256 for example) because it generates a key per a given\nstring.\n\n\n-----\n\nThe key generation process is as follows:\n\nVizom uses a SHA-1 hash on the given string it wants to encrypt\nIt adjusts the length of the key to match the AES key restriction. In Vizom’s case\nwe’d need a 32-byte key because it uses AES256 encryption. To adjust the\nlength, the key generation function shown below cuts the hash to the requested\nlength when it’s longer than the required length, and if it’s short, it appends bytes\nto the beginning of the hash until the required length is achieved.\n\nThe decryption takes place per the normal AES process, using the buffer and generated key.\nThe Python code snippet shown below demonstrates that:\n\n_Figure 9: Python decryption code using Python’s secure message HashLib module and_\n_Crypto.Cipher_\n\nEach message sent between the banking malware on the infected device and the attacker’s\nC2 server contains the encrypted data and the key set apart by a semi-colon (;). The\nmalware holds a hardcoded key — TjH^/nu%+.SiOfKR”Bo. One example is shown below:\n\n**C2 server sends message**\n\nIYtuBnJ8ZUXYVD2UmPxhHg==;TjH^/nu%+.SiOfKR”Bo\n\n**Malware actions**\n\nThe malware will use TjH^/nu%+.SiOfKR”Bo as the key, then apply SHA-1 to the key and\nnormalize the key length. Since SHA-1 produces a 20-byte hash value, 12 first bytes will\nbe added for the key to make it 32 byte long.\n\n\n-----\n\n**Next step**\n\nThe encrypted text IYtuBnJ8ZUXYVD2UmPxhHg== would be decoded by Base64 and\nthen further decrypted using AES256 with the key generated.\n\n**Result**\n\nIn the example we provided here, the malware would receive the “framewinc” command\nwhich instructs it to deploy overlay screens.\n\n## How Vizom Uses Remote Access and Control (RAT)\n\nThe central component of any remote overlay malware is the ability it lends its operator to\ntake control of the infected device without the user’s consent. After gaining access remotely,\nthe attacker can use overlay screen to manipulate the user, keep them unable to control the\nonline session they initiated, and trick them into providing additional details that can help the\nattacker complete fraudulent transactions from their bank account.\n\nVizom’s remote control capabilities rely on Windows API functions. For example, the Vizom\ncommand “movesys” moves the mouse cursor and emulates clicks by using the\nSetCursorPos and Windows’ mouse_event APIs.\n\n\n-----\n\n_Figure 10: Mouse movement and clicks in Vizom_\n\nTo add keyboard control, Vizom uses the “inputkb” command and launches keyboard\nkeystrokes using the keybd_event API.\n\n\n-----\n\n_Figure 11: Keyboard keystrokes via keybd_event API_\n\n## Banking Malware Grabs Screenshots From an Infected Device\n\nFor capturing screenshots from the infected device, Vizom uses two different tactics:\n\nThe default option is the PrintWindow API function which is the common way to take\nscreenshots on Windows machines.\nThe second option used here is the “settypebit” command which initializes the\nWindows magnification library. This library is normally used for magnifying portions of\nthe screen and it is manipulated by Vizom as a screen capturing tool, most likely to\nbypass some security controls that can block suspicious screen capture through\nstandard API functions. To return to the default method, the attacker would use the\n“settypefull” command. Both functions change a Boolean global variable which is\nchecked every time the screenshot function is called.\n\n_Figure 12: The settypefull command – changes the global Var_\n\n## Overlay Screen Module Gives Banking Malware Control\n\nThe last component, the overlay screen module uses a mechanism that’s somewhat different\nfrom what is commonly used by similar malware codes.\n\nTo plaster full screen overlays on the infected user’s desktop, Vizom generates an HTML file\nfrom encrypted strings, then opens it with the “Vivaldi” browser in application mode. This\nmode allows the application to be executed on a single web page without the typical\nbrowser’s user interface, preventing the infected victim from taking on-screen actions. This is\nprobably one of the reasons the attacker picked this specific browser’s files.\n\n\n-----\n\n_Figure 13: Overlay HTML file_\n\nThe images Vizom uses are retrieved from a public cloud storage bucket from an account\nthat is either compromised or set up for temporary use by the attackers.\n\n## Vizom Activates a Keylogger\n\nTo grab passwords and information from the infected device, Vizom also features a\nkeylogging module called “activeanalitycs” – yes, there is a typo in the module name. This\nfunction uses GetAsyncKeyState function to get keyboard data and send the information to\nthe attacker’s C2 server. This takes place repeatedly in 10 second intervals.\n\nThe keylogging operation is being handled by 2 Delphi Timers. Delphi Timers gives the\nprogrammer the ability to use sequential functions that will occur on a set time cycles. For\ninstance, the Windows title scanning mentioned earlier is not in a “While True” loop – it is\nbeing operated by a Delphi timer.\n\n## How Vizom Watches Keystrokes\n\nThe first timer, called “TwBuilding_L5pingT”, is the logger’s timer. It is executed every\nmillisecond and uses the GetAsyncKeyState Windows function to find which key is being hit.\nThe results are logged to a global variable string – every keystroke being added to the string.\n\n\n-----\n\n_Figure 14: Snippet from logger timer – adding the key pressed to the global variable_\n\nThe second timer is called “TwBuilding_L4pingT” and is the data send timer. Every 10\nseconds, the timer function executes, reads the global variable string, encrypts it and sends\nit to the C2 server. After that the global variable string clears and is ready for the next\nmessage.\n\n_Figure 15: Sending Timer snippet – the explained steps are highlighted_\n\n\n-----\n\n## Vizom Joins Cybercrime Action in LATAM\n\nThe Remote Overlay malware class has gained tremendous momentum in the Latin\nAmerican cybercrime arena through the past decade making it the top offender in the region.\nThese malicious programs are spread widely to large numbers of users through malspam\nand phishing campaigns. Once a potential victim is tricked into downloading the camouflaged\nmalware dropper, and executes it, the malware starts the deployment process all while\nattempting to stay under the radar and not be blocked by security software and operating\nsystem controls. This is not to say that this type of malware is very sophisticated, what it can\nbe, is quite creative.\n\nVizom hides inside legitimate executable, ensuring that the operating system would run its\nmalicious DLLs without questioning them.\n\nAt this time, Vizom focuses on large Brazilian banks, however, the same tactics are known to\nbe used against users across South America and has already been observed targeting\nbanks in Europe as well.\n\n## Vizom Indicators Of Compromise\n\n### Hashes\n\n808ed13b13d31e116244e1db46082015 (Dropper EXE)\n\na555654f89aaf0d90a36c17e16014300 (Malicious DLL#1 – videoconferencing software)\n\n1cd5806c5d6f9302d245ac0e5b453076 (Malicious DLL#2 – Vivaldi browser file)\n\n### C2 Server\n\n18.234.42.30\n\n_Want to learn more about protection from new malware in 2020 like Vizom? Browse the IBM_\n_Trusteer page on fraud protection._\n\n[Advanced Malware |](https://securityintelligence.com/tag/advanced-malware/) [Banking Malware](https://securityintelligence.com/tag/banking-malware/)\n[Chen Nahman](https://securityintelligence.com/author/chen-nahman/)\nSecurity Threat Researcher, IBM Security (Trusteer)\n\nChen Nahman is a Security Threat Researcher at IBM Security (Trusteer). Chen is\nexperienced in malware analysis and advanced threat research. Prior to that C...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-19 - New Vizom Malware Discovered Targets Brazilian Bank Customers with Remote Overlay Attacks.pdf"
    ],
    "report_names": [
        "2020-10-19 - New Vizom Malware Discovered Targets Brazilian Bank Customers with Remote Overlay Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535866,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653756596,
    "ts_modification_date": 1653756596,
    "files": {
        "pdf": "https://archive.orkl.eu/2e14fbe806de89f500f0e5d657a43081973d01ae.pdf",
        "text": "https://archive.orkl.eu/2e14fbe806de89f500f0e5d657a43081973d01ae.txt",
        "img": "https://archive.orkl.eu/2e14fbe806de89f500f0e5d657a43081973d01ae.jpg"
    }
}