{
    "id": "cb059e6a-7e3e-4542-b0f8-ef99da7aa599",
    "created_at": "2023-01-12T15:10:03.623953Z",
    "updated_at": "2025-03-27T02:05:43.293214Z",
    "deleted_at": null,
    "sha1_hash": "869df0a4208e654c86e51dbac6fff0747f0eb84f",
    "title": "2022-05-24 - Janicab Series- First Steps in the Infection Chain",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:34Z",
    "file_modification_date": "2022-06-01T12:23:34Z",
    "file_size": 174539,
    "plain_text": "# Janicab Series: First Steps in the Infection Chain\n\n**[malwarology.com/2022/05/janicab-series-first-steps-in-the-infection-chain/](https://www.malwarology.com/2022/05/janicab-series-first-steps-in-the-infection-chain/)**\n\n2022-05-24\n\n\nMay 24, 2022\n\n\n[Malware Analysis,](https://www.malwarology.com/categories/malware-analysis) [Janicab](https://www.malwarology.com/categories/janicab)\nIn late April 2022, I was requested to analyze a software artifact. It was an instance of\nJanicab, a software with infostealing and spying capabilities known since 2013. Differently to\nother analyses I do as part of my job, in this particular case I can disclose parts of it with you\nreaders. I’m addressing those parts in a post series. Here, I’ll discuss about the first stages\n[of a Janicab infection on Microsoft Windows targets, based on this specific sample.](https://www.virustotal.com/gui/file/20026af8c1bd95d4a39c2d1d1c2909ed133a5d2efac2d6c6b87cbc4d2782fef0)\n\n## SMPT-error.txt.lnk\n\nThe infection chain starts with a Shell Link Binary file (LNK) called SMPT-error.txt.lnk. This\nfile is suspicious for several reasons. First, it tries to mask itself as an innocent text file since\nthe last extension (.lnk) gets hidden by default setting in Microsoft Windows. A user could\njust see SMPT-error.txt once it was downloaded. Second, the file size is considerably big for\na LNK file: 3.25 MB. Third, as you can see from Figure 1, it targets the command prompt\nexecutable.\n\n**Figure 1**\n\n\n-----\n\nSMPT-error.txt.lnk targets the command prompt executable\n\n**Figure 2**\n\nSMTP-error.txt.lnk hidden arguments\n\nBy parsing the LNK structure for SMPT-error.txt.lnk, and more precisely the\n[COMMAND_LINE_ARGUMENTS structure included into the StringData set, I was able to](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-shllink/16cb4ca1-9339-4d0c-a68d-bf1d6cc0f943)\nobtain the arguments intended to be passed to the command prompt when triggering the\nexecution of the link. As Figure 2 may prove, the arguments form a command prompt script.\nSuch a script is decomposable in the following consecutive steps:\n\n1. Copy SMPT-error.txt.lnk into the temporary files directory. The “SMP*.txt.lnk” glob\n\nexpression will likely match just that file. The temporary files directory is that directory\nreferenced by the %TMP% environment variable.\n2. Move to the temporary files directory by issuing the CD command.\n3. Add read permissions (+r) to any file having .lnk extension into the temporary files\n\ndirectory. This is achieved by issuing the ATTRIB command.\n\n\n-----\n\n4. For each system file (/s argument of DIR command)having the .lnk extensions and\n\nlocated into the current directory, take the filename (/b argument of DIR command) and:\n\nRead the file content by issuing the TYPE command. Notice that the loop iteration\nvariable %a contains a file name and the prefix $~f points to the absolute path.\nWithin the file, find any line containing the pattern ”#@~^”. This is achieved with\nthe command FIND.\nRedirect those lines matching the pattern to a file called .vba and stored into the\ntemporary files directory.\nExecute the .vba file with the CSCRIPT command. This evidence suggests that\nthe content of .vba should be some script accepting the path to SMTP-error.txt.lnk\nas an argument.\n\n**Figure 3**\n\nSMPT-error.txt.lnk embeds an obfuscated script\n\nBased on what reported, I conclude this section by considering SMPT-error.txt.lnk as a\ndropper for a second stage artifact along the infection chain. Indeed, such a second stage is\noriginally embedded into the LNK file and stored on disk only after the user having double\nclicked on the link. Figure 3 shows the script as it can be found in the LNK file with the FIND\ncommand. The next section discusses that script with greater detail.\n\n## .vbe\n\nAs already pointed out in the previous section, I know that what shown in Figure 3 is a script.\nIt gets executed by issuing the CSCRIPT command and it expects a single argument\nconsisting of the absolute path to the SMTP-error.txt.lnk file. The script is encoded with the\nWindows Script Encoder, a tool originally developed and distributed by Microsoft to provide\nfor a shallow protection for various forms of scripts such as VBScript, JavaScript, and more.\nI’m sure about the encoding because the marker ”#@~^”, used to find the .vbe script within\nthe is SMTP-error.txt.lnk, is a well-known opening tag for the scripts encoded with the\n[Windows Script Encoder.](http://web.archive.org/web/20050605234251/http:/www.klaphek.nl/nr6/scrdec.html)\n\n\n-----\n\n**Figure 4**\n\n.vbe script content as it appears after the decoding\n\nBy knowing the encoding algorithm, I was able to decode the script. The full content is\nshowed in Figure 4. As you may notice from that listing, the goal of .vbe consists of\nextracting a further chunk of SMTP-error.txt.lnk, store that chunk on disk, and eventually\nexecute the chunk by using CScript.exe. Therefore, I need to consider .vbe as a dropper for\na further script along the infection chain. I close this section with a few annotations about the\nlisting of Figure 4:\n\nThe dropped script is stored in the same directory where .vba is located, namely the\ntemporary files directory (%TMP%), with filename 2.vbe.\nI know that 2.vbe is a script because it is executed with Cscript.exe (line 10).\nThe dropped script lies at the char offset 3644 of SMTP-error.txt.lnk and it is 5042\nchars long. Those are the values passed to the MID function at line 20 as start and\nlength, respectively. Those values are set at line 6 and line 7.\nThe dropped script is prefixed with the already mentioned ”#@~^” marker, before being\nstored on disk as 2.vbe. From that evidence, I may suppose that 2.vba contains a\nfurther encoded script.\nThe execution of 2.vbe is attempted at line 10. This shell execution will not show any\nwindow because the intWindowStyle argument of WScript.Shell.Run is forced to 0\n(corresponding to the hide setting).\nSimilarly to what I have observed for .vbe, the absolute path of SMTP-error.txt.lnk is\npassed as a parameter to 2.vbe when the latter gets executed.\n\n\n-----\n\nAfter having launched 2.vbe, .vbe kills any process running the command prompt or\npowershell. That is the purpose of the function killRunningCmdInstances, called two\ntimes at line 11 and line 12 with “cmd.exe” and “powershell.exe” as its argument,\nrespectively.\nkillRunningCmdInstances searches the processes by name with the Windows\nManagement Instrumentation (WMI) API for VBScript (lines 28-31).\n\nThe next post of this series will push the analysis further along the infection chain, by starting\nfrom 2.vbe. As always, if you want to share comments or feedbacks (rigorously in broken\nItalian or broken English) do not esitate to drop me a message at\n**admin[@]malwarology.com.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-24 - Janicab Series- First Steps in the Infection Chain.pdf"
    ],
    "report_names": [
        "2022-05-24 - Janicab Series- First Steps in the Infection Chain.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536203,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1654086214,
    "ts_modification_date": 1654086214,
    "files": {
        "pdf": "https://archive.orkl.eu/869df0a4208e654c86e51dbac6fff0747f0eb84f.pdf",
        "text": "https://archive.orkl.eu/869df0a4208e654c86e51dbac6fff0747f0eb84f.txt",
        "img": "https://archive.orkl.eu/869df0a4208e654c86e51dbac6fff0747f0eb84f.jpg"
    }
}