{
    "id": "cb135d4f-2c6a-4e05-a6aa-a9395d46df0b",
    "created_at": "2023-01-12T15:05:13.17528Z",
    "updated_at": "2025-03-27T02:05:27.070159Z",
    "deleted_at": null,
    "sha1_hash": "42a0484f4d93a6cf166d28885f64545bb7fdaaf0",
    "title": "2022-03-08 - New RURansom Wiper Targets Russia",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:20Z",
    "file_modification_date": "2022-05-28T02:43:20Z",
    "file_size": 291109,
    "plain_text": "# New RURansom Wiper Targets Russia\n\n**[trendmicro.com/en_us/research/22/c/new-ruransom-wiper-targets-russia.html](https://www.trendmicro.com/en_us/research/22/c/new-ruransom-wiper-targets-russia.html)**\n\nMarch 8, 2022\n\nA conflict in cyberspace is unfolding parallel to the conflict between Russia and Ukraine on the ground.\n[Cyberattacks are being lobbed against both Russian and Ukrainian sides, with a new wiper directed against](https://www.trendmicro.com/en_us/research/22/c/cyberattacks-are-prominent-in-the-russia-ukraine-conflict.html)\nRussia joining the fray.\n\nOn March 1, a [tweet from MalwareHunterTeam about a possible ransomware variant caught our attention and set](https://twitter.com/malwrhunterteam/status/1498678603613155343)\nour immediate analysis into motion. We found several additional samples of this malware, which has been dubbed\nas “RURansom” by its developer. Despite its name, analysis has revealed it to be a wiper and not a ransomware\nvariant because of its irreversible destruction of encrypted files.\n\n## Targeting Russia\n\nBased on our telemetry, we have not yet observed active targets for this malware family. One possible reason for\nthis is that the wiper has only targeted a few entries in Russia so far.\n\nRURansom’s code, however, makes its author’s motives clear. Figure 1 shows the code variable responsible for\nthe malware’s ransom note.\n\nFigure 1. Code snippet of what will be written in the ransom note file\nThe note reads in English as follows:\n\nOn February 24, President Vladimir Putin declared war on Ukraine.\", \"To counter this, I, the creator of\nRU_Ransom, created this malware to harm Russia. You bought this for yourself, Mr. President.\", \"There is no way\nto decrypt your files. No payment, only damage. And yes, this is \\\"peacekeeping\\\" like Vladi Papa does, killing\ninnocent civilians\", \"And yes, it was translated from Bangla into Russian using Google Translate... (This is a direct\ntranslation.)\n\n\n-----\n\nWe detected different versions of the malware between February 26 and March 2, 2022. Upon further analysis, we\nhave learned more details about its capabilities.\n\nRURansom: A new wiper\n\nThe malware is written in .NET programming language and spreads as a worm by copying itself under the file\nname \"Россия-Украина_Война-Обновление.doc.exe\" to all removable disks and mapped network shares.\nTranslated into English, the file name reads as “Russia-Ukraine_War-Update.doc.exe.”\n\nFigure 2.\n\nCode snippet showing RURansom’s spreading mechanism\nAfter successfully spreading, the malware then begins encryption. If the assigned disk letter is “C:\\,” for example,\nthe files in the folder “C:\\\\Users\\\\<UserName>\" are encrypted. For other removable and mapped network drives, all\nfiles that recursively branch from the root directory are encrypted.\n\nEncryption is applied to all file extensions except for “.bak” files, which are deleted. The files are encrypted with a\nrandomly generated key with length equal to base64 (\"FullScaleCyberInvasion + \" + MachineName).\n\nFigure 3. Code showing the length of\nthe randomly generated key for encryption, with an extra “+,” which is likely a typo\nThe encryption algorithm is AES-CBC using a hard-coded salt. The keys are unique for each encrypted file and\nare not stored anywhere, making the encryption irreversible and marking the malware as a wiper rather than a\nransomware variant.\n\nThe “ransom” note, which is the file “Полномасштабное_кибервторжение.txt” (translated as “Full-blown_cyberinvasion.txt”), is then dropped into each directory. However, it is more accurate to say that this is a wiper note.\n\nAs seen in the code in Figure 1, the note states its developer’s sentiments and also reveals that the author used\nGoogle Translate to convey their message in Russian from the original Bangla.\n\nStill in development\n\nWe have discovered several versions of RURansom. Some of these versions check if the IP address where the\nsoftware is launched is in Russia. In cases where the software is launched outside of Russia, these versions will\nstop execution, showing a conscious effort to target only Russian-based computers. While most samples were\n[unobfuscated, we found one version using ConfuserEx for obfuscation.](https://yck1509.github.io/ConfuserEx/)\n\nFigure 4. Code snippet where the malware tests if it is being run from\n\nRussia\nOther versions also attempt to start the process with elevated privileges. These different versions and\nmodifications might indicate that the malware was still undergoing development at the time of writing.\n\nOther activities from the same author\n\nAside from RURansom, the developer appears to have been working on another “wiper” dubbed as “dnWipe.” Its\npayload is executed every Tuesday.\n\nWe analyzed dnWipe and found that it simply encodes content in base64 for the following file extensions: .doc,\n.docx, .png, .gif, .jpeg, .jpg, .mp4, .txt, .flv, .mp3, .ppt, .pptx, .xls, and .xlsx. Therefore, just as RURansom is not\nreally a ransomware variant, dnWipe also cannot be classified as an example of a wiper malware because its\n\n\n-----\n\nencoding can be decoded easily.\n\nOther binaries that we can attribute with high confidence to the same developer indicate their other interests. For\none, they have also compiled a downloader for an XMRig binary, showing an inclination for cryptocurrency mining.\n\nConclusion\n\nNo one can be indifferent to the conflict between Ukraine and Russia. People all over the world are actively taking\nsides, and malware developers are no exception.\n\n[As this blog entry shows, the exchange of attacks in cyberspace is reflective of this conflict: Leaks have exposed](https://www.reuters.com/technology/details-another-big-ransomware-group-trickbot-leak-online-experts-say-2022-03-04/)\n[Russian-based cybercriminal groups behind Conti and TrickBot, while a destructive wiper has attacked](https://www.cisa.gov/uscert/ncas/alerts/aa22-057a)\norganizations in Ukraine. Now, the RURansom wiper is seeking out Russian targets.\n\nWe see RURansom as just one attempt among a growing list of attacks that aim to support a position espoused\nstrongly by an individual or a group. While we have not yet found any victims of this malware, seeing the evolution\nin its code leads us believe that its developer will keep updating their malware in an effort to deal some form of\ndamage on Russia.\n\nIn general, the tense geopolitical situation has added an edge to cyberattacks. Ultimately, keeping defenses up,\nstaying vigilant against misinformation, and monitoring the situation is essential in order to navigate this uncertain\nstate of affairs.\n\n[For more guidance on managing today’s cyber risks, please see our earlier blog post here.](https://www.trendmicro.com/en_us/research/22/b/ukraine-cyberattack-2022.html)\n\nIndicators of Compromise (IOCs)\n\n**SHA256** **Detection name**\n\n107da216ad99b7c0171745fe7f826e51b27b1812d435b55c3ddb801e23137d8f Ransom.MSIL.RUCRYPT.YXCCD\n\n1f36898228197ee30c7b0ec0e48e804caa6edec33e3a91eeaf7aa2c5bbb9c6e0 Ransom.MSIL.RUCRYPT.YXCCD\n\n610ec163e7b34abd5587616db8dac7e34b1aef68d0260510854d6b3912fb0008 Ransom.MSIL.RUCRYPT.YXCCD\n\n696b6b9f43e53387f7cef14c5da9b6c02b6bf4095849885d36479f8996e7e473 Ransom.MSIL.RUCRYPT.YXCCD\n\n8f2ea18ed82085574888a03547a020b7009e05ae0ecbf4e9e0b8fe8502059aae Ransom.MSIL.RUCRYPT.YXCCD\n\n979f9d1e019d9172af73428a1b3cbdff8aec8fdbe0f67cba48971a36f5001da9 Ransom.MSIL.RUCRYPT.YXCCD\n\nCyber Threats\n\nWe analyze RURansom, a malware variant discovered to be targeting Russia. Originally suspected to be a\nransomware because of its name, analysis reveals RURansom to be a wiper.\n\nBy: Jaromir Horejsi, Cedric Pernet March 08, 2022 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-08 - New RURansom Wiper Targets Russia.pdf"
    ],
    "report_names": [
        "2022-03-08 - New RURansom Wiper Targets Russia.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535913,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 1653705800,
    "ts_modification_date": 1653705800,
    "files": {
        "pdf": "https://archive.orkl.eu/42a0484f4d93a6cf166d28885f64545bb7fdaaf0.pdf",
        "text": "https://archive.orkl.eu/42a0484f4d93a6cf166d28885f64545bb7fdaaf0.txt",
        "img": "https://archive.orkl.eu/42a0484f4d93a6cf166d28885f64545bb7fdaaf0.jpg"
    }
}