{
    "id": "cb70f1a2-fc1d-4d11-8a87-eb2a90ff232a",
    "created_at": "2023-01-07T02:06:35.059676Z",
    "updated_at": "2025-03-18T19:56:56.137175Z",
    "deleted_at": null,
    "sha1_hash": "a7c41390a40b1eed0b3e907d3ada7aae643fdba7",
    "title": "Threat Horizons - February 2022",
    "authors": "Google's Cybersecurity Action Team (GCAT)",
    "file_creation_date": "2022-03-16T15:05:07Z",
    "file_modification_date": "2022-03-16T15:05:07Z",
    "file_size": 1705883,
    "plain_text": "Threat Horizons\nCloud Threat Intelligence\nFebruary 2022. Issue 2 (revised)\n\nProviding threat intelligence to those in the Cloud\nPa of o ering a secure cloud computing pla orm is providing cloud customers with cybersecurity\nthreat intelligence so they can be er con gure their environments and defenses in ways most speci c\nto their needs. Google's Cybersecurity Action Team is pleased to release Issue 2 of the Threat Horizons\nrepo . The repo is based on threat intelligence observations from the Threat Analysis Group (TAG),\nGoogle Cloud Threat Intelligence for Chronicle, Trust and Safety, and other internal teams. It provides\nactionable intelligence that enables organizations to ensure their cloud environments are best\nprotected against ever evolving threats.\n\n___\nSummary of Observations\nAdversaries and researchers alike are continuing to scour the web looking for vulnerable instances\nof Log4j. As a result, service providers have been and continue to work with their cloud customers to\nensure the infrastructure is secure as well as check the status of customer-installed tools and\nthird-pa y dependencies in their environments to see if they are a ected. While adversaries\ncontinue to knock on this door, observations have shown that they are opting to use known\nopen-source tools, native Cloud services, and previously established domains for persistence in their\na acks.\nGoogle Cloud was proactive in assuring the security of the pla orm and we pa nered extensively with\ncustomers to provide tooling and suppo to help them mitigate and remediate Log4j risks. This\nincluded threat intelligence-driven updates to Cloud Armor, Cloud IDS, Security Command Center, and\nEvent/Container Threat Detection and we were pleased to see many customers proactively respond to\nthis event and use these capabilities to defend themselves and their customers. Google Cloud\ncustomers also used a variety of scanners and fuzzers to help identify the presence of Log4j in Cloud\ninstances and their dependencies.\n\n01\n\n02\n\n03\n\n04\n\n05\n\nVulnerable\ninstances of\nApache Log4j\nstill sought by\na ackers\n\nAdversaries using\nan open-source\npla orm to\nmaintain\nnetwork\npersistence\n\nCloud Shell used\nfor reverse SSH\ntunneling a er\ninitial compromise\nvector\n\nDomain previously\nidenti ed by TAG\nused in ongoing\na acks against\nresearchers\n\nLessons\nLearned\n\nThreat actors\nabuse Cloud Shell\nto initiate reverse\nSSH tunnels from\ncompromised\nenvironments to\navoid detection.\n\nA No h Korean\nsponsored actor\nappears to have\nre-used a domain\nidenti ed by TAG\nin an intrusion\ncampaign involving\nmanipulated IDA Pro.\n\nAs Google Cloud\npa ners with its\ncustomers in a shared\nfate security model,\nsome valuable trends\nand lessonslearned emerge.\n\nDespite patching, A er compromising\na ackers are\na network, a ackers\ncontinuing to scan are using Sliver to\npublic-facing sites maintain access.\nfor those that have\nnot been properly\npatched.\n\nFor more information visit gcat.google.com\n\nDetailed Observations\nVulnerable instances of Apache Log4j 2 still sought by a ackers\nThreat Description / TTPs\nSho ly a er the December 9, 2021 public disclosure of the Apache Log4j vulnerability (with a criticality\nrating of 10/10), Google Cloud Threat Intelligence and Google Trust and Safety sta ed observing\nscanning for vulnerable instances of Log4j on the same day. The activity increased over the following\nweeks as shown in Figure 1.\nFigure 1: Log4j A ack Signal Detected\n\nGoogle Cloud is seeing ongoing scans for vulnerable Log4j instances by a ackers and security\nresearchers and we recommend continued vigilance to ensure available patches and mitigations\nare applied and sustained. During the month following the vulnerability’s disclosure there was\nextensive scanning across the Internet. Google Cloud and other providers had a unique vantage point\nover this and used this to good e ect to help customers identify vulnerabilities as well as watch for the\nevolution of a empted exploitation to rapidly assure mitigations were e ective for cloud infrastructure\nand customers. Google Cloud is continuing to see scanning (400K times a day) and expects similar, if\nnot more scanning levels against all providers, and so we recommend continued vigilance in ensuring\npatching is e ective. Threat actors are predominantly seeking to target po s 80 and 443 with scanners\nsending payloads to many other po s with a ack payloads largely using Lightweight Directory Access\nProtocol (LDAP) servers listening mostly on TCP po s 389 and 1389. Additionally, threat actors have\nbeen continually re ning ways of obfuscating the log4j format string, sta ing with “jndi:ldap://” and\nmoving more di cult to parse strings.\n\nFor more information visit gcat.google.com\n\nStrategic Signi cance\nA ackers will continue scanning for vulnerable instances of Log4j as long as exploitation is\neasy to pe orm and vulnerable Log4j instances are found. Google Cloud has seen many\ncustomers proactively scan in-depth for a ected packages that may embed Log4j. Observations are\nrevealing that mitigation strategies for so ware dependencies will need to be mapped prior to\npatching as exploits were occurring within hours of the original vulnerability noti cation. Google Cloud\nrecommends continued vigilance in looking for such dependency risks including evaluating the\nso ware supply chain, engaging in an ongoing dialog with so ware vendors and using tools such as\ndeps.dev.\nGoogle Cloud Speci c Mitigations\nThose operating in Google Cloud can continue to protect themselves by using various tools and\ntechniques as described in the following:\n●\n●\n\n●\n\n●\n\n●\n\n●\n●\n\n●\n●\n\nThe recommendations described in the blog post on investigating and responding to the\nApache “Log4j 2” vulnerability.\nGoogle Cloud customers have Implemented Cloud Armor to mitigate threats for applications or\nservices behind external HTTP(S) load balancers. Cloud Armor customers can now deploy a new\npre-con gured rule that will help detect and, optionally, block commonly a empted exploits of\nthe Log4j vulnerabilities.\nThe Java scanning feature of Google Cloud On-Demand Scanning can be used to help identify\nLinux-based container images that use an impacted version of Log4j. Identifying vulnerable\nimages can help prevent them from being deployed in production. This functionality can be\nused either on a locally stored container image or one stored in A ifact Registry or Google\nContainer Registry.\nChronicle is Google’s threat hunting tool that provides extended event collection across Google\nCloud and in on-premise environments. Those using Chronicle for log ingestion/SIEM and have\nhistorical event data can detect and respond to Apache Log4j.\nGoogle Cloud customers deployed Cloud IDS, which was updated to help detect common types\nof Log4j exploit a empts. These were enabled by default for any existing or newly added\ndeployments of Cloud IDS as described in this blog.\nGoogle Cloud customers used Security Command Center (SCC) Premium to actively scan DNS\ncalls to known malicious sites associated with Log4j vulnerability abuse.\nGoogle Cloud customers leveraged Cloud Logging to detect Log4j 2 vulnerability exploits by\nquerying logs that have already been ingested and are also within the user-speci ed retention\nlimits. Enable logging across your environment to expand visibility and querying across the\nenvironment.\nThe Google Open Source Security Team pa ners with the security company Code Intelligence\nto provide continuous fuzzing for Log4j as pa of OSS-Fuzz.\nGoogle Cloud customers leveraged resources from the Open Source Security Foundation to\nsecure their environments to include joining workgroups and taking training to be er develop\nso ware with well cra ed requirements, design, and re-use to limit exposures.\n\nFor more information visit gcat.google.com\n\nAdversaries using an open-source pla orm to maintain network persistence\nThreat Description / TTPs\nGoogle Cloud Threat Intelligence has observed from across the Internet that Sliver is being\nused by adversaries post initial compromise in a empts to ensure they maintain access to\nnetworks. Recent observations as listed in Figure 2, show a ackers using Sliver as the second stage\nmalware to compromise organizations, moving the possibility of a ackers using Sliver for malicious\nactions from a hypothetical to a reality. Sliver is an open-source, cross-pla orm adversary emulation\nframework that allows adversaries to deploy and control implants on victims’ Windows, Mac, or Linux\ncomputers from a central coordinating server. The framework is an open-source alternative to Cobalt\nStrike, is freely available on Github, and is included in the package repository for Kali Linux, a popular\nopen source Debian-based Linux distribution.\nFigure 2: Sliver Timeline\n\nStrategic Signi cance\nAdversaries without signi cant sophistication now have easy access to an adversary emulation\nframework which gives them tools similar to Cobalt Strike. Additionally, Sliver has very li le presence\non a victim’s computer outside of its implants’ sizes, which makes detecting the behavioral aspects of\nSliver di cult. Network communication is heavily encrypted and the transpo s are designed to blend\ninto normal tra c. Cloud customers would likely need to pe orm speci c threat hunting to identify this\nmalicious activity as it may not be obvious when con gured.\nNetwork detection is possible whenever an implant uses the HTTP transpo to observe the\ninitialization session, such as with the “out-of-the-box” implementation of Sliver; however, when\ncustomized, it will be more di cult to detect. Similarly, it is possible to detect the server's periodic\npolling and response communication from a Sliver implant.\n\nFor more information visit gcat.google.com\n\nGoogle Cloud Speci c Mitigations\nChronicle has developed YARA rules to detect “out-of-the-box” Sliver implants for any operating system\non i386 or x64 CPUs, which can be used by Google Cloud customers to protect themselves. These YARA\nrules can be downloaded and compatible with open source tools and pla orms. These are:\n1.\n2.\n\nh ps://github.com/chronicle/detection-rules/tree/main/yara/malware/Sliver__Implant_32bit.yara\nh ps://github.com/chronicle/detection-rules/tree/main/yara/malware/Sliver__Implant_64bit.yara\n\nCloud Shell used for reverse SSH tunneling a er initial compromise vector (revised\non 3/15)\nThreat Description / TTPs\nAlready compromised systems use outbound Cloud Shell to establish reverse SSH tunneling.\nAdditionally, Google Trust and Safety has observed activity pe aining to SSH tunnels available for rent\nand trade, which suppo s the argument that this abuse is being monetized. Google Cloud allows users\nto create a free sandboxed environment of the Linux system (“Cloud Shell”) outside customer projects\nor networks, with the ability to execute commands using a provided shell. While Cloud Shell inbound\nconnections are restricted, the outbound connections are not. The availability of outbound\nconnections to conduct a reverse SSH tunneling from Cloud Shell to any public endpoint is serving as a\nmeans for threat actors to distribute malicious campaigns or pe orm harmful activity. This is described\nin Figure 3. Customers who may be concerned should enable a VPC service perimeter to limit access to\nservices and users inside their perimeter.\n\nFigure 3: Cloud Shell enabling SSH Tunneling\n\nFor more information visit gcat.google.com\n\nIn the process described, a er a threat actor has access to a Google Cloud Shell instance, for\nexample, through the exploitation of leaked credentials, the actor then creates a reverse shell SSH\ntunnel to an SSH server. The threat actor then connects to the SSH server through an SSH tunnel. A\nSOCKS5 proxy is then used to connect to the Google Cloud Shell before connecting to the endpoint.\nThis results in an obfuscation of the threat actor’s origin.\nBecause Cloud Shell doesn’t allow inbound connections, it cannot be used as a proxy server by\ndefault. By creating a reverse SSH tunnel to other endpoints, the “Cloud Shell” can pe orm po\nforwarding, allowing the endpoint to connect to any po of the “Cloud Shell,” meaning that the\nendpoint can use the Cloud Shell as a proxy server.\nStrategic Signi cance\nAs your strategic cloud provider, we want to make sure that customers are using our products safely and\nensure no abuse is happening inside their environments. Threat actors can abuse the proxy capabilities\nto pe orm an action on behalf of a compromised Cloud Shell instance without revealing their identity.\nAs pa of their proactive monitoring and con guration reviews, it is recommended that Google Cloud\ncustomers review account and security se ings to limit the potential for initial credential compromise\nenabling this abuse vector.\nGoogle Cloud Speci c Mitigations\nIn order to protect the initial compromise of credentials, which can then lead to the scenario of Cloud\nShell abuse, Google in general strongly recommends that customers implement 2-step veri cation and\nwhere possible implement it in the form of hardware-based tokens. Additionally, customers can use\nVPC Service Controls to prevent data ex ltration from their production environments.\n\nFor more information visit gcat.google.com\n\nIn addition to the 2-step veri cation and VPC Service Controls, Google Cloud customers have\nadditional resources including:\n● A variety of access control options within Compute Engine including using service accounts to\nauthenticate apps instead of using user credentials along with options for 2-step veri cation.\n● Policy Intelligence tools to help understand and manage policies to proactively improve security\ncon gurations.\n● Best practices for handling compromised credentials\nAs general best practices, Google Cloud customers can also use Container Analysis to pe orm\nvulnerability scanning of metadata storage for containers and the Web Security Scanner in the\nSecurity Command Center to identify security vulnerabilities in their App Engine, Google Kubernetes\nEngine, and Compute Engine web applications that could lead to an initial compromise. The Web\nSecurity scanner will crawl applications, following all links within the scope of the sta ing URL and\na empt to exercise as many user input and event handlers as possible.\n\nDomain previously identi ed by TAG used in ongoing a acks against researchers\nThreat Description / TTPs\nA domain previously identi ed by Google’s Threat Analysis Group (TAG) was associated with\nintrusions launched by a No h Korean government-backed entity against security and\nvulnerability researchers. These intrusions originated from a trojanized version of IDA Pro as\ndiscovered by ESET Research. The actor presumably shared the modi ed installer for IDA Pro, a\ndisassembler popular among security researchers, in order to replace a speci c DLL within the installer\npackage. When executed, it would a empt to download and install a backdoor from a No h Korean\ncontrolled domain.\nOver the past 12+ months, the actor has launched multiple campaigns against the security and\nvulnerability research community including the following techniques:\n●\n●\n●\n●\n\nDeveloping fake social media pro les and submi ing real bugs to bug bounty programs in\norder to build credibility.\nCreating fake exploit broker companies with websites, accounts, etc.\nTrojanizing exploit proof of concepts and other so ware packages commonly shared among\nresearchers.\nSuspected of using 0-days, which were stolen from some of their victims.\n\nStrategic Signi cance\nBased on TAG’s analysis, these targets are not restricted to one region. They include numerous\nresearchers and companies including some in China. Google Cloud customers, who engage in security\nand vulnerability research have the potential for being included in those targeted.\nGoogle Cloud Speci c Mitigations\nCode downloaded by clients should undergo hashing authentication. It is a common practice for\nclients to download updates and code from various Internet sources, raising concern that unauthorized\n\nFor more information visit gcat.google.com\n\ncode may be downloaded in the process. Meddler in the Middle (MITM) a acks may cause\nunauthorized source code to be pulled into production. By hashing and verifying all downloads, the\nintegrity of the so ware supply chain can be preserved and an e ective chain of custody can be\nestablished.\n\nRecommendations\nGoogle Cloud continues to operate within a \"shared fate\" model that exempli es a true pa nership\nwith its customers. This pa nership includes providing trends and lessons learned from recent\nincidents or close-calls in the wild with which Google assisted. The following is a summary of Google\nCloud’s recommendations based upon customer incidents across various pla orms that we helped\naddress:\nWhen securing an environment and ensuring ex ltration has not occurred a er an incident, customers\nshould review logs associated with le sharing and domain-wide Takeout in addition to looking\nfor implanted malware. Threat actors have been known to use tools native to the Cloud environment\nrather than downloading custom malware or scripts to avoid detection. This “living o the land”\ntechnique has been used extensively in on-premise compromises and is being adopted in Cloud\nenvironments.\nIn the situations where it is necessary to respond to a security incident, where there was an\nexploitation of third-pa y so ware in the Cloud instance, customers should review logs to\ndetermine the point of initial compromise as well as determining if additional unauthorized\nso ware was installed a er the initial compromise or if unauthorized con gurations were\nmade. Adversaries have been known to close doors behind themselves, i.e., patch the vulnerability\nwhich grants initial access, and then pivot to new so ware, malware, or reverse shells to maintain\npresence.\nCode downloaded by clients should undergo hashing authentication. It is a common practice for\nclients to download updates and code from various Internet sources, raising concern that unauthorized\ncode may be downloaded in the process. Meddler in the Middle (MITM) a acks may cause\nunauthorized source code to be pulled into production. By hashing and verifying all downloads, the\nintegrity of the so ware supply chain can be preserved and an e ective chain of custody can be\nestablished.\nTable 1: Observed risks and countermeasures\nRisk\n\nInstance\nvulnerabilities\n\nCountermeasures\nFollow password best practices and best practices for con guring Cloud\nenvironments.\nUpdate third-pa y so ware prior to a Cloud instance being exposed to the\nweb.\nAvoid publishing credentials in GitHub projects.\n\nFor more information visit gcat.google.com\n\nUse Container Analysis to pe orm vulnerability scanning and metadata\nstorage.\nLeverage Web Security Scanner in the Security Command\nCenter to identify security vulnerabilities in App Engine,\nGoogle Kubernetes Engine, and Compute Engine.\nUse service accounts with Compute Engine to authenticate apps instead of\nusing user credentials.\nImplement Policy Intelligence tools to help understand and manage policies.\nUse prede ned con gurations through Assured Workloads to reduce\nmiscon gurations.\nSet up conditional ale s in the Cloud Console to send ale s upon high\nresource consumption.\nEnforce and monitor password requirements for users through the Google\nAdmin console.\nDownloading\nso ware updates\n\nEstablish a strong chain of custody by hashing and verifying downloads.\n\nUsing public code\nrepositories\n\nAudit projects published on GitHub and other sites to ensure credentials and\nce i cates were not included.\n\nFor additional information about Google’s Cybersecurity Action Team and best practices, please visit\ngcat.google.com.\n\nFor more information visit gcat.google.com",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/gcat_threathorizons_full_feb2022.pdf"
    ],
    "report_names": [
        "gcat_threathorizons_full_feb2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673057195,
    "ts_updated_at": 1742327816,
    "ts_creation_date": 1647443107,
    "ts_modification_date": 1647443107,
    "files": {
        "pdf": "https://archive.orkl.eu/a7c41390a40b1eed0b3e907d3ada7aae643fdba7.pdf",
        "text": "https://archive.orkl.eu/a7c41390a40b1eed0b3e907d3ada7aae643fdba7.txt",
        "img": "https://archive.orkl.eu/a7c41390a40b1eed0b3e907d3ada7aae643fdba7.jpg"
    }
}