{
    "id": "cb7fcb69-4410-4c60-8924-e05e4ce966e4",
    "created_at": "2023-01-12T15:06:44.926288Z",
    "updated_at": "2025-03-27T02:06:00.711802Z",
    "deleted_at": null,
    "sha1_hash": "4e8ca24189c0e84fd80997540d0b463133e47cf2",
    "title": "2020-05-04 - Kaiji- New Chinese Linux malware turning to Golang",
    "authors": "",
    "file_creation_date": "2022-05-28T15:16:53Z",
    "file_modification_date": "2022-05-28T15:16:53Z",
    "file_size": 690868,
    "plain_text": "# Kaiji: New Chinese Linux malware turning to Golang\n\n**[intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/](https://intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/)**\n\nMay 4, 2020\n\nWritten by Paul Litvak - 4 May 2020\n\n## Get Free Account\n\nJoin Now\n\nIt is not often that you see a botnet’s tooling written from scratch. The Internet of things (IoT)\nbotnet ecosystem is relatively well-documented by security specialists. New threat actors\nare generally discovered quickly due to the inherent noise caused by DDoS operations,\nboth in terms of infecting new machines and conducting operations. Simply, it is difficult to\nhide such overt activities. Most DDoS actors do not invest resources in creating custom\ntooling, unless they require specific capabilities, and resort to using well-known botnet\nimplants (e.g. Mirai, BillGates).\n\nIn late April we identified a new botnet campaign with definitive Chinese origins,targeting\nservers and IoT devices via SSH brute forcing. While most attackers derive their implants\nfrom popular and well-tested sources such as open source (e.g., Mirai) or blackmarket\ntoolsets (e.g., BillGates), this botnet utilizes its own custom implant, which\n\n\n-----\n\n[MalwareMustDie named Kaiji based on one of the function names. The botnet was built](https://twitter.com/malwaremustd1e/status/1256977666084761602)\n[from scratch using the Golang programming language, which is rare in the IoT botnet](https://www.intezer.com/blog/genetic-malware-analysis/genetic-malware-analysis-for-golang/)\nlandscape.\n\n**Technical Analysis**\n\nKaiji spreads exclusively via SSH brute forcing by targeting the root user only. Accessing\nroot is important to its operation since some DDoS attacks are only available via crafting\ncustom network packets. In Linux, custom network packets are only given to a privileged\nuser such as root.\n\nOnce a SSH connection is established, a bash script is executed which sets up the\nenvironment for the malware:\n\nA /usr/bin/lib directory is created and then Kaiji is installed under the filename ‘netstat’, ‘ps’,\n‘ls’, or some other system tool name.\n\nKaiji has simple features. It consists of an arsenal of multiple DDoS attacks such as\nipspoof and synack attacks, an ssh bruteforcer module to continue the spread, and another\nssh spreader which relies on hijacking local SSH keys to infect known hosts which the\nserver has connected to in the past.\n\nDespite the Kaiji file being stripped, we were able to restore function names using\n[IDAGolangHelper. This technique works by retrieving function definitions embedded within](https://github.com/sibears/IDAGolangHelper)\nthe Golang binary which are not removed by the strip command.\n\nOnce the malware is executed, it copies itself to /tmp/seeintlog and launches a second\ninstance which commences its malicious operations. Each operation is implemented within\nits own goroutine:\n\n\n-----\n\nThere exist 13 central goroutines which are important for the implant’s operation. Many of\nthese functions are named in an English representation of Chinese words. We have\nhighlighted the most interesting functions and added a translation from Chinese to relevant\nfunctions:\n\ndoLink routine:\n\nDecrypt C2 addresses, register the newly infected server to one of the command servers\nand launch the doTask and RotKit goroutines.\n\nIncidentally, some of the C2 addresses are decrypted through a chain of three encryption\nschemes, while another C2 address is simply encoded in base64:\n\n\n-----\n\n_On the left, C2 base64 decoding. On the right, C2 decryption._\n\nThe binary contained four command server hostnames, two of which were resolved to\nlocalhost since they were registered. The only hostname which worked was operational for\ntwo weeks before failing to respond.\n\nmain_doTask:\nFetches commands from the C2. These include:\n\n- DDoS instructions\n\n- SSH bruteforce instructions, including host range and a password to attempt login\n\n- Run shell command\n\n- Replace C2 servers\n\n- Delete itself and remove all persistence\n\nFor DDoS operations, a target and an attack technique are retrieved.\n\nAttacks include:\n\n- Two TCPFlood implementations (one with raw sockets)\n\n- Two UDPFlood implementations (one with raw sockets)\n\n- IPSpoof attack\n\n- SYNACK attack\n\n- SYN attack\n\n- ACK attack\n\n\n-----\n\nddos_Rotkit:\nTries to connect to known hosts through existing SSH RSA keys or IPs found in bash\nhistory:\n\nmain_runkshell:\nInstall persistence through rc.d and Systemd services:\n\nSystemd (/etc/systemd/system/linux.service):\n\nrc.d (/etc/rc.d/init.d/linux_kill):\n\n\n-----\n\nmain_runghost: Install persistence through /etc/profile.d (/etc/profile.d/linux.sh)\n\nmain_rundingshi (漢字: run timing): Install persistence through crontab\n\nmain_runganran (漢字: run infection): Another persistence technique, backdoor the SSH init\nscript /etc/init.d/ssh to call the rootkit on startup\n\nmain_runshouhu (漢字: run surgery): Copy the rootkit to /etc/32679 and run it every 30\nseconds\n\nmain_runkaiji (漢字: run boot): Install more persistence init.d files, e.g.: /etc/init.d/boot.local\n\nddos_rdemokill: Check the CPU usage machine periodically and kill if CPU usage exceeds\n85%. This can inadvertently kill unrelated processes. Interestingly, this function refers to the\nrootkit as a demo\n\nIn our own sandbox we observed that the rootkit tends to invoke itself too many times,\nleaving the machine gasping for memory:\n\nThis, together with the fact that the C2 was operational only temporarily, and the\npresence of a ‘demo’ string, led us to believe that this is an early version still in testing.\n\n\n-----\n\n**Conclusion**\n\nIt is rare to see a botnet written from scratch, considering the tools readily available to\nattackers in blackmarket forums and open source projects. In this post we have uncovered\na new DDoS operation in its early stages that was written from scratch. This is another\n[confirmation of an interesting trajectory noted by vendors such as Palo Alto that malware](https://unit42.paloaltonetworks.com/the-gopher-in-the-room-analysis-of-golang-malware-in-the-wild/)\ndevelopers are turning to modern languages such as Golang for their operations.\n\n[The Kaiji samples are now indexed in Intezer Analyze. Powered by our new Golang cross](https://analyze.intezer.com/files/9f090a241eec74a69e06a5ffed876c7a37a2ff31e171924673b6bb5f1552814c)\nplatform code connections, users will be able to easily spot if this threat actor switches to\nWindows.\n\n**_Protect your Linux and cloud servers_**\n\n**_Threats targeting Linux are on the rise._** **_[Learn more about our runtime solution that](https://www.intezer.com//intezer-protect/)_**\n**_protects your Linux cloud servers against cyber attacks._**\n\n**IOCs**\n\n4e8d4338cd3b20cb027a8daf108c654c10843e549c3f3da6646ac2bb8ffbe24d\n\n9198853b8713560503a4b76d9b854722183a94f6e9b2a46c06cd2865ced329f7\n\n98aee62701d3a8a75aa19028437bc2d1156eb9bfc08661c25db5c2e26e364dca\n\n0ed0a9b9ce741934f8c7368cdf3499b2b60d866f7cc7669f65d0783f3d7e98f7\n\nf4a64ab3ffc0b4a94fd07a55565f24915b7a1aaec58454df5e47d8f8a2eec22a\n9f090a241eec74a69e06a5ffed876c7a37a2ff31e171924673b6bb5f1552814c\n\n370efd28a8c7ca50275957b47774d753aabb6d7c504f0b81a90c7f96c591ae97\n\n357acbacdb9069b8484f4fdead1aa946e2eb4a505583058f91f40903569fe3f3\n\ncu.versiondat[.]xyz\n\n\n-----\n\n1.versionday[.]xyz\nwww.aresboot[.]xyz\nwww.6×66[.]com\nwww.2s11[.]com\n\n**Paul Litvak**\nPaul is a malware analyst and reverse engineer at Intezer. He previously served as a\ndeveloper in the Israel Defense Force (IDF) Intelligence Corps for three years.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-04 - Kaiji- New Chinese Linux malware turning to Golang.pdf"
    ],
    "report_names": [
        "2020-05-04 - Kaiji- New Chinese Linux malware turning to Golang.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536004,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653751013,
    "ts_modification_date": 1653751013,
    "files": {
        "pdf": "https://archive.orkl.eu/4e8ca24189c0e84fd80997540d0b463133e47cf2.pdf",
        "text": "https://archive.orkl.eu/4e8ca24189c0e84fd80997540d0b463133e47cf2.txt",
        "img": "https://archive.orkl.eu/4e8ca24189c0e84fd80997540d0b463133e47cf2.jpg"
    }
}