{
    "id": "cb8c76b7-7238-48e0-b98d-c9fb221ebb97",
    "created_at": "2023-01-12T14:59:13.571692Z",
    "updated_at": "2025-03-27T02:05:38.207567Z",
    "deleted_at": null,
    "sha1_hash": "0913c0eaed8c1b2cfa31b9c718a6d38eb17368df",
    "title": "2016-06-29 - Apocalypse- Ransomware which targets companies through insecure RDP",
    "authors": "",
    "file_creation_date": "2022-10-15T00:24:03Z",
    "file_modification_date": "2022-10-15T00:24:03Z",
    "file_size": 2497624,
    "plain_text": "#### claroty.com /team82/research/the-race-to-native-code-execution-in-plcs-using-rce-to-uncover-siemens-simatic-s7-1200-1500-hardcoded-cry…\n\n# The Race to Native Code Execution in PLCs: Using RCE to Uncover Siemens SIMATIC S7-1200/1500 Hardcoded Cryptographic Keys\n\nTeam82 Research\n\nOctober 11th, 2022\n\n## Executive Summary\n\nTeam82 has developed a new, innovative method to extract heavily guarded, hardcoded, global private\n\ncryptographic keys embedded within the Siemens SIMATIC S7-1200/1500 PLC and TIA Portal product lines.\n\nAn attacker can use these keys to perform multiple advanced attacks against Siemens SIMATIC devices and\n\nthe related TIA Portal, while bypassing all four of its access level protections.\n\nA malicious actor could use this secret information to compromise the entire SIMATIC S7-1200/1500 product\n\nline in an irreparable way.\n\nAll technical information was disclosed to Siemens, which released new versions of the affected PLCs and\n\nengineering workstation that address this vulnerability.\n\n[CVE-2022-38465 has been assigned, and a CVSS v3 score of 9.3 was assessed.](https://claroty.com/team82/disclosure-dashboard/cve-2022-38465)\n\nIn addition, an attacker can develop an independent Siemens SIMATIC client (without requiring the TIA Portal)\nand perform full upload/download procedures, conduct man-in-the-middle attacks, and intercept and decrypt\n\npassive OMS+ network traffic.\n\n[This work is an extension of our previous research into Siemens SIMATIC PLCs.](https://claroty.com/team82/research/the-race-to-native-code-execution-in-plcs)\n\nSiemens has updated both the S7-1200 and S7-1500 PLCs and the TIA Portal, and urges users to move to\ncurrent versions.\n\n[This disclosure has led to the introduction of a new TLS management system in TIA Portal v17, ensuring that](https://support.industry.siemens.com/cs/document/109799540/questions-and-answers-about-the-new-security-features-in-tia-portal-v17?dti=0&lc=en-WW)\nconfiguration data and communications between Siemens PLCs and engineering workstations is encrypted and\n\nconfidential.\n\n\n-----\n\n[Siemens advisory can be found here. Siemens has also published a bulletin with remarks regarding its key](https://cert-portal.siemens.com/productcert/html/ssa-568427.html)\n\n[protection update. Read it here.](https://cert-portal.siemens.com/productcert/html/ssb-898115.html)\n\n## Introduction\n\nClose to 10 years ago, Siemens introduced asymmetric cryptography into the integrated security architecture of its\n\nTIA Portal v12 and SIMATIC S7-1200/1500 PLC CPU firmware families. This was done to ensure the integrity and\nconfidentiality of devices and user programs, as well as for the protection of device communication within industrial\n\nenvironments.\n\nDynamic key management and distribution did not exist then for industrial control systems, largely because of the\n\noperational burden that key management systems would put on integrators and users. Siemens decided at the time\ninstead to rely on fixed cryptographic keys to secure programming and communications between its PLCs and the\n\nTIA portal.\n\nSince then, however, advances in technology, security research, and a swiftly changing threat landscape have\n\nrendered such hardcoded crypto keys an unacceptable risk. A malicious actor who is able to extract a global,\nhardcoded key, could compromise the entire device product line security in an irreparable way.\n\nTeam82 has to date conducted extensive research into PLC security, working closely with leading vendors to\n\neradicate such practices as hardcoded keys, demonstrate the risk they pose to users’ systems, and improve the\noverall security of the industrial automation ecosystem.\n\n[Our latest work—an extension of previous research conducted on Siemens SIMATIC S7-1200 and S7-1500 PLCs, as](https://claroty.com/team82/research/the-race-to-native-code-execution-in-plcs)\n[well as Rockwell Automation’s Logix controllers and Studio 5000 Logix Designer—continues on that path.](https://claroty.com/team82/research/critical-authentication-bypass-in-rockwell-software)\n\nWe uncovered and disclosed to Siemens a new and innovative technique targeting SIMATIC S7-1200 and S7-1500\n[PLC CPUs that enabled our researchers to recover a global hardcoded cryptographic key (CVE-2022-38465) used by](https://claroty.com/team82/disclosure-dashboard/cve-2022-38465)\n\neach Siemens affected product line. The key, if extracted by an attacker, would give them full control over every PLC\nper affected Siemens product line.\n\nUsing a vulnerability uncovered in previous research (CVE-2020-15782) on Siemens PLCs that enabled us to bypass\nnative memory protections on the PLC and gain read and write privileges in order to remotely execute code, we were\n\nable to extract the internal, heavily guarded private key used across the Siemens product lines. This new knowledge\nallowed us to implement the full protocol stack, encrypt and decrypt protected communication, and configurations.\n\nSiemens’ response to this private disclosure led to an overhaul of the cryptographic schemes protecting its flagship\n[PLC lines, as well as its TIA Portal engineering workstation application. Siemens acknowledged in a security advisory](https://cert-portal.siemens.com/productcert/html/ssa-568427.html)\n\nthat existing protections around its hardcoded key are no longer sufficient, and invested the resources and time\nnecessary to introduce a dynamic public-key infrastructure (PKI) that eliminates the use of hardcoded keys.\n\nSiemens recommends users immediately update SIMATIC S7-1200 and S7-1500 PLCs and corresponding versions\n\n[of the TIA Portal project to the latest versions. TIA Portal V17 and related CPU firmware versions include the new PKI](https://support.industry.siemens.com/cs/document/109799540/questions-and-answers-about-the-new-security-features-in-tia-portal-v17?dti=0&lc=en-WW)\nsystem protecting confidential configuration data based on individual passwords per device and TLS-protected\n\nPG/PC and HMI communication, Siemens said in its advisory.\n\n## Technical Details\n\n### Siemens Access Restriction Mechanisms\n\n\n-----\n\nA prominent security feature of Siemens PLCs is an access level restriction mechanism that is enforced with\n\npassword protection. A password is configured within the project that is downloaded to the PLC along with a desired\nprotection level. Those levels are:\n\nLevel 1: Full read and write access to any configuration and logic block\n\nLevel 2: Write protection:\n\nCan read everything\n\nCan change PLC modes\n\nLevel 3: Limited read access:\n\nCan read HMI data (values etc.)\n\nCan read diagnostic data\n\nLevel 4: Full protection\n\nCannot communicate with the PLC without password\n\n\n-----\n\nSiemens S7 1200/1500 Access Levels (Source: Siemens)\n\nAll four levels use the same security mechanism to grant permissions to the user. The only difference between them\nis the extent of permissions granted with or without authentication. A password is requested upon any connection to\n\nthe PLC.\n\n### Understanding S7-1200, S7-1500 Encryption\n\nThe asymmetric encryption procedures on the Siemens flagship PLCs has two principal purposes:\n\nAuthentication: a shared derived session key that authenticates a user when communicating with a PLC.\n\nConfidentiality: encrypting data during portions of said communication, i.e., downloaded logic.\n\nWe were able to understand the encryption algorithm, which was based on Elliptic Curve asymmetric encryption. We\n\nfound the curve parameters as well as an added complication: the use of a “configuration key” to further obfuscate\nand complicate the elliptical multiplication process.\n\nEventually we were able to uncover all the relevant keys involved in the encryption process:\n\nConnection Key: Used for packet integrity verification and authentication.\n\nCPU Key: A “per-model/firmware” (e.g S7-1518, S7-1517) key used to encrypt configurations, code, and\nmaintain code integrity.\n\nFamily Key: A “per-family” (e.g S7-1200, S7-1500) used for the same purposes as the CPU key, when the CPU\nkey is not known.\n\nAn illustration of the keys used in Siemens PLC encryption process.\n\n### Gaining Code Execution on the PLC\n\nAfter reverse engineering one of Siemens SIMATIC .upd firmware S7-1200 which were unencrypted, we learned that\n\nthe private key does not reside within the firmware files, therefore we would have to extract it somehow directly from\nthe PLC.\n\nIn order to retrieve the private key from the PLC, we needed direct memory access (DA) to be able to search for it. To\nbe able to perform DA actions, we searched and found a remote code execution vulnerability on both the 1200/1500\n\n\n-----\n\nPLC series. The vulnerability (CVE-2020-15782) was triggered through a specific MC7+ function code containing our\n\nown crafted shellcode bytecode.\n\nOur CVE-2020-15782 sandbox escape exploit.\n\nThe vulnerability logic for CVE-2020-15782 works as follows:\n\nUse [REDACTED] opcode, which has no security memory region checks, to copy an internal struct containing a\n\nnative pointer to a valid memory area to a writable memory area\n\nChange the pointer inside this struct to our desired address\n\nRecalculate the CRC that was used to verify this struct (using the CRC32 opcode)\n\nCopy the struct back to its original location, now pointing to our desired address, using the [REDACTED]\n\nopcode\n\nAt this point, we may use indirect access to the new address in our crafted struct.\n\n\n-----\n\nMC7+ [REDACTED] opcode implementation function; since it missed the security memory memory\n\nregion check it was possible to exploit it and achieve RCE (CVE-2020-15782).\n\nWe could now read or write from any memory address in the PLC. Using this capability, we could override native\n\ncode and execute any desired native logic.\n\nWe gave a detailed technical presentation about this vulnerability at the S4x22 Conference, below:\n\nhttps://youtu.be/r-dmxU1gEl0\n\n### Using the RCE to Obtain the Hidden Private Key\n\nUsing the DA read permission we obtained, we were able to extract the entire encrypted PLC firmware (SIMATIC S71500) and map its functions. During the mapping process we found a function that read the private key on the PLC.\n\n\n-----\n\nThe PoC we used to dump SIMATIC S7-1500 firmware from memory.\n\nOnce we had the function address, we rewrote the functionality of specific MC7+ opcodes with our shell code, forcing\n\nthem to call the native function that reads the private key. We then copied the key to a known memory address and\nread it from there. Executing the overwritten function gave us the full private key of the PLC.\n\nWe later discovered that these keys are shared across each Siemens SIMATIC S7 product line, and immediately\n[started a coordinated disclosure process with Siemens. This resulted in a new advisory and CVE-2022-38465.](https://claroty.com/team82/disclosure-dashboard/cve-2022-38465)\n\nUsing the same methodology, we were able to extract the configuration key from the CPU.\n\nCombining the private key, with the configuration key, and knowledge of the algorithm, allowed us to implement the\n\nfull protocol stack, encrypt/decrypt protected communication, and configurations.\n\nDemonstrating the vulnerability chain used to extract the private, global key.\n\n\n-----\n\n## Attack Flows: Gaining Control over a PLC and Process\n\nUsing the private key we were able to extract, an attacker may gain full control over a PLC.\n\n### Attacks on the Password\n\nThe attacks described below allow an attacker with knowledge of the PLC’s private key and encryption algorithm, to\n\nretrieve the configured password on the PLC, thus gaining full control regardless of the protection level configured on\nthe device.\n\nObtain the Configuration and decrypt the password hash (reading configurations from the PLC): If the PLC is in\na protection level lower than 3, An attacker can retrieve the configuration from the PLC (Upload procedure) with\n\nno special permission required. Once uploaded, the attacker has the PLC configuration and can use the private\nkey to decrypt the password hash from the uploaded configuration. Using the decrypted password hash the\n\nattacker can authenticate to the PLC and gain higher privileges.\n\nMan in the Middle: An attacker with knowledge of the encryption mechanism of the traffic, as well as access to\n\nthe private key, can impersonate the PLC in a connection. The man in the middle attack is performed in the\nfollowing steps:\n\nThe client (victim) connects to the attacker’s phony PLC and sends an encrypted connection key.\n\nThe attacker decrypts the connection key and uses the decrypted key to connect to the real PLC. Once\n\nconnected, the attacker receives a password-based challenge.\n\nThe attacker forwards the real PLC’s challenge to the client and receives a valid challenge response.\n\nThe attacker then forwards the challenge response to the real PLC to set up an authenticated connection.\nThis session will be a fully privileged session. At this point, the attacker may change any configuration or\n\nblocks on the PLC, or read the configuration. This access includes the ability to read the encrypted\npassword hash from the PLC and decrypt it.\n\nPassive Traffic Interception: An attacker with passive access to capture traffic to a given PLC on the network\ncan intercept configuration reads/writes from the PLC. Using the private key, the attacker can decrypt the\n\nconfiguration and extract the password hash. With the password hash the attacker can authenticate to the\ncontroller and write a new configuration.\n\n## Summary\n\n[This attack (CVE-2022-38465) was made possible due to the ability to execute native code on S7 PLCs we achieved](https://claroty.com/team82/disclosure-dashboard/cve-2022-38465)\n\n[with our previous research CVE-2020-15782. Using native code execution, we were able to read the raw memory](https://claroty.com/team82/research/the-race-to-native-code-execution-in-plcs)\nregion protecting the private key and eventually fully recover the key.\n\nBy extracting the PLC’s hardcoded private key, we were able to demonstrate multiple attack scenarios including\ndecryption of all communication between S7 PLCs and an EWS, decryption of the configured password hash on the\n\nPLC, which we could use to gain full access to the PLC, conduct man-in-the-middle attacks, and more.\n\nUsers should update to current versions of the S7-1200 and S7-1500 PLC families, as well as TIA Portal v17, as\n\nadvised by Siemens. TIA Portal v17 introduces a TLS management system in order to encrypt communication.\nSiemens also introduced a preactivated PLC configuration password requirement, that ensures all confidential PLC\n\nconfiguration data are protected by default as well as predefined secure PG/HMI communication, which prevents\nunsecured communication with other partners, and preactivated PLC access protection, that prevents any type of\n\naccess to the controller unless explicitly configured.\n\n\n-----\n\n### The Vulnerability\n\n**[CVE-2022-38465](https://claroty.com/team82/disclosure-dashboard/cve-2022-38465)**\n\n**CWE-522 Insufficiently Protected Credentials**\n\n**CVSS v3 score: 9.3**\n\n**Description: SIMATIC S7-1200, S7-1500 CPUs and related products protect the built-in global private key in a way**\n\nthat cannot be considered sufficient any longer. The key is used for the legacy protection of confidential configuration\ndata and the legacy PG/PC and HMI communication. This could allow attackers to discover the private key of a CPU\n\nproduct family by an offline attack against a single CPU of the family. Attackers could then use this knowledge to\nextract confidential configuration data from projects that are protected by that key or to perform attacks against legacy\n\nPG/PC and HMI communication.\n\n### Acknowledgment\n\n_Team82 would like to thank Siemens for its coordination in working through this disclosure, and for its swift response_\n\n_in confirming our findings and patching these vulnerabilities._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/Claroty - The Race to Native Code Execution in PLCs Using RCE to Uncover Siemens SIMATIC S7-12001500 Hardcoded.pdf"
    ],
    "report_names": [
        "Claroty - The Race to Native Code Execution in PLCs Using RCE to Uncover Siemens SIMATIC S7-12001500 Hardcoded.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535553,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1665793443,
    "ts_modification_date": 1665793443,
    "files": {
        "pdf": "https://archive.orkl.eu/0913c0eaed8c1b2cfa31b9c718a6d38eb17368df.pdf",
        "text": "https://archive.orkl.eu/0913c0eaed8c1b2cfa31b9c718a6d38eb17368df.txt",
        "img": "https://archive.orkl.eu/0913c0eaed8c1b2cfa31b9c718a6d38eb17368df.jpg"
    }
}