{
    "id": "cba8d0e0-829d-4797-98c6-5618d843fbe1",
    "created_at": "2023-01-12T15:00:15.52571Z",
    "updated_at": "2025-03-27T02:05:47.356532Z",
    "deleted_at": null,
    "sha1_hash": "6715fdcf9f00337db7c75022ac81d4561a50fbba",
    "title": "2014-04-09 - BackDoor.Gootkit.112—a new multi-purpose backdoor",
    "authors": "",
    "file_creation_date": "2022-05-27T23:26:37Z",
    "file_modification_date": "2022-05-27T23:26:37Z",
    "file_size": 761301,
    "plain_text": "# BackDoor.Gootkit.112—a new multi-purpose backdoor\n\n**news.drweb.com/show/**\n\nDoctor Web\n\n[Back to news](https://news.drweb.com/list/?p=0&lng=en&c=5)\n\n**April 9, 2014**\n\n**Complex multi-component Trojans with backdoor features, i.e., those capable of**\n**executing a remote server’s commands on an infected computer, are rarities in the**\n**wild. Doctor Web's analysts recently examined one such program that has been**\n**named** **[BackDoor.Gootkit.112. This review provides information about this malicious](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\n**program’s design and operation.**\n\nApparently, the module responsible for installing the backdoor into the system and for its\n[bootkit features was borrowed by BackDoor.Gootkit.112’s developers from the](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nTrojan.Mayachok family of programs. However, the virus writers introduced a number of\nsignificant changes into the source code. The original Trojan.Mayachok generated a unique\nVBR code which was used to create another build of the malware. In the case of\n**[BackDoor.Gootkit.112, all the functions have been grouped in the dropper, which alters the](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\nVolume Boot Record (VBR) code during the infection process. The driver, to which control is\ntransferred by the VBR code prior to system initialisation, was also taken from the\nTrojan.Mayachok source code, but the code was partially rewritten, so most of the pointers\n\n\n-----\n\n(the shell-code to perform injections, and various tables) have been changed for reasons\nunknown. However, some pointers remained intact. In particular, one of them refers to the\nHomer Simpson quotation \"Just pick a dead end and chill out till you die\", which is output in\nthe debugger after the loader's initialisation. It is noteworthy that similar strings (mostly\nHomer Simpson quotations) were displayed in the debugger by TDSS Trojans (starting with\nBackDoor.Tdss.565 (TDL3) and older versions). The name Gootkit can be found in both the\nloader and the payload module code.\n\nIn addition, all the driver components responsible for its interaction with other components\noperating in the user mode were also removed—in particular, the driver that enables them to\nuse VFS. However, **[BackDoor.Gootkit.112 has features responsible for VFS initialisation](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\nand protection.\n\n[Information about the payload module BackDoor.Gootkit.112 is stored in the Windows](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nregistry branch HKLMSOFTWARECXSW as binaryImage32 or binaryImage64, depending\non the OS platform (32- or 64-bit).\n\n[To retrieve the payload, BackDoor.Gootkit.112 injects special shell code into the processes](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nSERVICES.EXE, EXPLORER.EXE, IEXPLORE.EXE, FIREFOX.EXE, OPERA.EXE, and\nCHROME.EXE. Very few malicious programs inject their code by creating a new user mode\nthread involving CSRSS.EXE.\n\nThe main objective of the injected shell code is to download the payload module from the\nsystem registry or from a remote server on the Internet. Payload binary files are compressed\nand encrypted.\n\n[To bypass the UAC and elevate its privileges in an infected system, BackDoor.Gootkit.112](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nemploys a shim (Microsoft Windows Application Compatibility Infrastructure). The Trojan\nemploys the SQL Server Client Network Utility (cliconfg.exe) whose manifest file has the\n\n\n-----\n\nattribute AutoElevate set to true, so Windows elevates the privileges of such applications\nwithout involving the UAC.\n\n**[BackDoor.Gootkit.112 uses the file apphelp.dll to create a fix database. The Trojan](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\ngenerates the database’s name and the value of the Application parameter randomly. To load\nthe Trojan code, it uses the routine RedirectEXE, which lets one executable be run instead of\n[another one. BackDoor.Gootkit.112 uses RedirectEXE parameters to specify the path to its](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nexecutable and a link to the created database.\n\nAfter that, the fix database (shim) is installed in the system by means of sdbinst.exe whose\nmanifest also has the parameter AutoElevate set to true, so it runs on Windows with special\nprivileges. Overall, the UAC bypass scheme looks as follows:\n\n1. The Trojan creates and installs a new fix database (shim);\n2. It then launches cliconfg.exe with elevated privileges;\n3. The shim unloads the original process and uses RedirectEXE to launch the Trojan.\n\n**[BackDoor.Gootkit.112's payload is implemented in a large, five megabyte executable](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\nwritten in C++. Most of this file is a JavaScript interpreter known as Node.JS. The executable\nfile contains more than 70 pieces of JavaScript code. A significant portion of them constitutes\nthe Node.JS core which provides an easily accessible interface to work with native objects.\nSome scripts incorporate the Trojan's payload: they enable the backdoor to execute\ncommands from a remote server and download additional modules stored in the Windows\n[registry, similarly to the main module of BackDoor.Gootkit.112. The Trojan can execute the](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\nfollowing commands:\n\nIntercept http traffic;\nInject code into other processes;\nBlock specific URLs;\n\n\n-----\n\nTake screenshots;\nAcquire the list of running processes;\nAcquire the list of local users and groups;\nEnd specified processes;\nExecute shell commands;\nLaunch executables;\nAuto update.\n\nand some other.\n\nAs mentioned above, the program uses a rare method for injecting code into running\nprocesses. A similar algorithm was described on the forum wasm.ru by a user with the alias\nGreat:\n\nHis description contained exit statuses which were similar to those found in the\n[disassembled code of BackDoor.Gootkit.112:](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)\n\n\n-----\n\nOne would assume that the virus writer simply borrowed code from the public source, but the\ncode posted on the forum also described the object called\n**DRIVER_TO_SHELLCODE_PARAMETERS. An object with the same name was also**\ndiscovered in a personal blog of another user who provided a detailed description of the\ninjection method and claimed that he developed it in cooperation with Ilya Great:\n\nThe blogger also expressed his great interest in Node.JS whose features are used\nextensively in the Trojan's code. Moreover, the person also published a post entitled\n\"NoteJS\\C++: Native extension for the Registry\" in which he described a method for working\nwith the Windows registry branch SOFTWARE\\CXS:\n\n\n-----\n\nAnother post of his, entitled \"NodeJS: Spyware in Javascript?\", contains a reference to\n**SpywareModule whose methods incorporate the prefix 'Sp'.**\n\n**[BackDoor.Gootkit.112 incorporates similar code.](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\n\n\n-----\n\nIn this regard, one can make assumptions regarding the actual person behind the backdoor\nwith a high degree of certainty.\n\n**[BackDoor.Gootkit.112’s signature has been added to the Dr.Web virus database, and,](https://vms.drweb.com/search/?q=BackDoor.Gootkit.112&lng=en)**\ntherefore, the Trojan poses no threat to computers protected with Dr.Web.\n\n[What is the benefit of having an account?](https://www.drweb.com/user/advantages/?lng=en)\n\n## Tell us what you think\n\nTo ask Doctor Web’s site administration about a news item, enter @admin at the beginning\nof your comment. If your question is for the author of one of the comments, put @ before\ntheir names.\n\n### Other comments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-04-09 - BackDoor.Gootkit.112—a new multi-purpose backdoor.pdf"
    ],
    "report_names": [
        "2014-04-09 - BackDoor.Gootkit.112—a new multi-purpose backdoor.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535615,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653693997,
    "ts_modification_date": 1653693997,
    "files": {
        "pdf": "https://archive.orkl.eu/6715fdcf9f00337db7c75022ac81d4561a50fbba.pdf",
        "text": "https://archive.orkl.eu/6715fdcf9f00337db7c75022ac81d4561a50fbba.txt",
        "img": "https://archive.orkl.eu/6715fdcf9f00337db7c75022ac81d4561a50fbba.jpg"
    }
}