{
    "id": "cc2ad0f0-a22b-4d3c-9ddf-a650fe08df11",
    "created_at": "2023-01-12T15:07:51.086585Z",
    "updated_at": "2025-03-27T02:05:45.56628Z",
    "deleted_at": null,
    "sha1_hash": "12247aea62802f8ae33e7ac6db72e650ffed3f7a",
    "title": "2022-02-28 - Trellix Global Defenders- Analysis and Protections for RagnarLocker Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:36Z",
    "file_modification_date": "2022-05-28T16:16:36Z",
    "file_size": 878225,
    "plain_text": "# Trellix Global Defenders: Analysis and Protections for RagnarLocker Ransomware\n\n**[trellix.com/en-us/about/newsroom/stories/threat-labs/analysis-and-protections-for-ragnarlocker-ransomware.html](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/analysis-and-protections-for-ragnarlocker-ransomware.html)**\n\n## Stories\n\nThe latest cybersecurity trends, best practices,\n\nsecurity vulnerabilities, and more\n\nBy [Taylor Mullins · February 28, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/taylor-mullins.html)\n\n\n-----\n\nThe United States Federal Bureau of Investigation (FBI) has released a Flash Alert warning\nthat the RagnarLocker ransomware gang has breached the networks of at least fifty-two\norganizations from multiple critical infrastructure sectors across the United States. This is\nthe second FBI alert released for the RagnarLocker Ransomware variant, the last alert was\nreleased in November 2020.\n\nThe following FBI flash alerts will focus on providing indicators of compromise (IOCs) that\norganizations can use to detect and block RagnarLocker ransomware attacks.\n\n[March 2022 FBI Alert (PDF) - RagnarLocker Ransomware Indicators of Compromise](https://www.ic3.gov/Media/News/2022/220307.pdf)\n\n[November 2020 FBI Alert (PDF) - RagnarLocker Ransomware Indicators of Compromise](https://www.waterisac.org/system/files/articles/FLASH-MU-000140-MW.pdf)\n\nRagnarLocker ransomware first appeared in the wild at the end of December 2019 as part\nof a campaign against compromised networks targeted by its operators. The actors behind\nRagnarLocker will perform reconnaissance on the targeted network, exfiltrate sensitive\ninformation, encrypt files, and then notify the victim the stolen files will be released to the\npublic if the ransom is not paid. The threat actor behind the malware is known in previous\nattacks to ask for millions of dollars in payment and creates a ransom note that includes the\ncompany name. The ransomware enumerates all running services on the infected host and\nstops services that contain a specific string. Ragnar is small compared to other malware\nand is written in the C/C++ programming language.\n\n\n-----\n\n**Figure 1. Global Detections and Observed Sectors for RagnarLocker Ransomware.**\n**Source: MVISION Insights**\n\n**Figure 2. Last 60 days of detections for RagnarLocker Ransomware. Source: Trellix**\n**APG Team**\n\n\n-----\n\n## Recommended Steps to Prevent Initial Access\n\nThe threat actors behind the RagnarLocker attacks often gain entry by compromising the\ncompany’s network via the RDP service, using brute force attacks to guess weak\npasswords or with stolen credentials purchased on the Dark Web.\n\n[After gaining access the exploitation of CVE-2017-0213 is used to elevate privileges,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0213)\npatching of this CVE is critical.\nReviewing the CVEs for all Public Facing Systems – CISA regularly updates and\nmaintains a full list of CVEs that are known to be exploited: CISA: KNOWN\nEXPLOITED VULNERABILITIES CATALOG\nOver 90% of successful cyber-attacks begin with a phishing email and has been a\ntechnique used by RagnarLocker, it is critical to continually monitor for spearphishing\ncampaigns with malicious attachments and links.\n\nCommunication – Along with monitoring, educating end users on what they\ncould be receiving in their email can help them spot phishing campaigns before\nthey click or download.\nReview Indicators of Compromise in FBI alerts and block the malicious IP addresses\nobserved in previous attacks.\n\n## Trellix Protections and Global Detections\n\nTrellix Global Threat Intelligence (GTI) is currently detecting all known analyzed indicators\nfor this campaign across their products that use the GTI threat feed.\n\n**Figure 3. Trellix**\n\n**Products detecting this threat globally. Source: MVISION Insights**\n\n## Blocking RagnarLocker Attacks with Endpoint Security\n\n\n-----\n\nTrellix ENS is currently detecting RagnarLocker Indicators of Compromise (IOCs) with\nsignature detections and the malware behavior associated with RagnarLocker Ransomware\nattacks. The following Adaptive Threat Protection Rules in ENS have shown success in\nstopping the techniques associated with RagnarLocker. Trellix always recommends testing\nin Report Only Mode before blocking to confirm no false positives are detected by this\nbehavioral rule.\n\n**Coverage**\nMinimum AMCore Content: 4217\n\n**Adaptive Threat Protection Rule ID 239: Identify suspicious command parameter**\n**execution (Mitre-T1059: Identifies the suspicious execution of an application through**\n**command line parameters).**\n\n**Adaptive Threat Protection Rule ID 341: Identify and block patterns being used in**\n**Ransomware attacks in security rule group assignments.**\n\n**Figure 4. Story Graph and Adaptive Threat Protection Detection for Rule ID 239 in**\n**ePolicy Orchestrator/MVISION ePO**\n\n\n-----\n\n**Figure 5. Story Graph and Adaptive Threat Protection Detection for Rule ID 341 in**\n**ePolicy Orchestrator/MVISION ePO**\n\n**Figure 6. Threat detections for RagnarLocker Ransomware shown in MVISION**\n**Insights**\n\n## RagnarLocker Threat Intelligence from the Trellix Advanced Threat Research Team and MVISION Insights\n\nMVISION Insights will provide the current threat intelligence and known indicators for\nRagnarLocker Ransomware. MVISION Insights will alert to detections and Process Traces\nthat have been observed and systems that require additional attention to prevent\nwidespread infection. MVISION Insights will also include Hunting Rules for threat hunting\nand further intelligence gathering of the threat activity and adversary\n\n\n-----\n\n**Figure 7. Campaign Details, Analyzed Indicators of Compromise, and Detections**\n\n**Figure 8. Process Trace for RagnarLocker Ransomware activity in MVISION Insights**\n\n\n-----\n\n**Figure 9. Hunting Rules for RagnarLocker Ransomware in MVISION Insights**\n\n## Detecting Malicious Activity with MVISION EDR\n\nMVISION EDR is currently monitoring for the activity associated with RagnarLocker\nRansomware and will note the MITRE techniques and any suspicious indicators related to\nthe adversarial activity. Analysis of RagnarLocker malware samples note the usage of\nnative Windows APIs, Microsoft Connection Manager Profile Installer (CMSTP.exe), and the\ndeletion of Shadow Copy to inhibit system recovery.\n\n**Figure 10. Interaction with the native OS application programming interface (API) to**\n**execute behaviors.**\n\n\n-----\n\n**Figure 11. T1218.003 – Adversaries may abuse CMSTP to proxy execution of**\n**malicious code. The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a**\n**command-line program used to install Connection Manager service profiles.**\n\n**Figure 12. Native Windows utilities utilized by adversaries to disable or delete system**\n**recovery.**\n\n## Additional Resources\n\n[Trellix Labs: RagnarLocker Ransomware Threatens to Release Confidential Information](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/ragnarlocker-ransomware-threatens-to-release-confidential-information/)\n\n[McAfee KB92601 - MVISION Insights: RagnarLocker ransomware](https://kc.mcafee.com/corporate/index?page=content&id=KB92601&locale=en_US)\n\n[McAfee Labs Threat Advisory - Ransom-Ragnar](https://kc.mcafee.com/resources/sites/MCAFEE/content/live/CORP_KNOWLEDGEBASE/92000/KB92742/en_US/ThreatAdvisory-RAGNAR.pdf)\n\n### Featured Content\n\nPERSPECTIVES\n\n### Our CEO On Living Security\n\n[By Bryan Palma · January 19 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/bryan-palma.html)\n\n\n-----\n\nTrellix CEO, Bryan Palma, explains the critical need for security that s always learning.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/perspectives/our-ceo-on-living-security.html)\n\nXDR\n\n### Time to Drive Change by Challenging the Challengers\n\nBy [Michelle Salvado · January 19, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/michelle-salvado.html)\n\nDynamic threats call for dynamic security – the path to resiliency lies in XDR.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/xdr/time-to-drive-change-by-challenging-the-challengers.html)\n\nTHREAT LABS\n\n### 2022 Threat Predictions\n\nBy Trellix · January 19, 2022\n\nWhat cyber security threats should enterprises look out for in 2022?\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/2022-threat-predictions.html)\n\n## Get the latest\n\nWe’re no strangers to cybersecurity. But we are a new company.\n\nStay up to date as we evolve.\n\nPlease enter a valid email address.\n\nZero spam. Unsubscribe at any time.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - Trellix Global Defenders- Analysis and Protections for RagnarLocker Ransomware.pdf"
    ],
    "report_names": [
        "2022-02-28 - Trellix Global Defenders- Analysis and Protections for RagnarLocker Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536071,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653754596,
    "ts_modification_date": 1653754596,
    "files": {
        "pdf": "https://archive.orkl.eu/12247aea62802f8ae33e7ac6db72e650ffed3f7a.pdf",
        "text": "https://archive.orkl.eu/12247aea62802f8ae33e7ac6db72e650ffed3f7a.txt",
        "img": "https://archive.orkl.eu/12247aea62802f8ae33e7ac6db72e650ffed3f7a.jpg"
    }
}