{
    "id": "ccb847c8-abe5-4b7b-b798-039285432899",
    "created_at": "2023-01-12T15:05:04.997743Z",
    "updated_at": "2025-03-27T02:06:13.730661Z",
    "deleted_at": null,
    "sha1_hash": "c05efcb0705dcdb3bea6f1309be45a97db0e88b5",
    "title": "2018-04-18 - Stresspaint Malware Campaign Targeting Facebook Credentials",
    "authors": "",
    "file_creation_date": "2022-05-28T17:51:35Z",
    "file_modification_date": "2022-05-28T17:51:35Z",
    "file_size": 1105236,
    "plain_text": "# Stresspaint Malware Campaign Targeting Facebook Credentials\n\n**[blog.radware.com/security/2018/04/stresspaint-malware-campaign-targeting-facebook-credentials/](https://blog.radware.com/security/2018/04/stresspaint-malware-campaign-targeting-facebook-credentials/)**\n\nApril 18, 2018\n\n[Security](https://blog.radware.com/security/)\n[Attack Types & Vectors](https://blog.radware.com/security/attack-types-and-vectors/)\n\nBy\n\n[Adi Raff](https://blog.radware.com/author/adir/)\n\nApril 18, 2018\n[0](https://blog.radware.com/security/2018/04/stresspaint-malware-campaign-targeting-facebook-credentials/#respond)\n11602\n\nOn April 12, 2018, Radware’s threat research group detected malicious activity via internal\nfeeds of a group collecting user credentials and payment methods from Facebook users\nacross the globe The group manipulates victims via phishing emails to download a painting\n\n\n-----\n\napplication called Relieve Stress Paint. While benign in appearance, it runs a malware\ndubbed ‘Stresspaint’ in the background. Within a few days, the group had infected over\n40,000 users, stealing tens of thousands Facebook user credentials/cookies. This rapid\ndistribution and high infection rate indicates this malware was developed professionally. The\ngroup is specifically interested in users who own Facebook pages and that contain stored\npayment methods. We suspect that the group’s next target is Amazon as they have a\ndedicated section for it in the attack control panel. Radware will continue to analyze the\ncampaign and monitor the group’s activity. Prior to publication of this alert, Radware has\ndetected another variant of the malware and saw indication of this new version in the control\npanel.\n\nFigure 1 & 2: Breakdown of malware by infections and geographies\n\n## Infection Process\n\nRadware suspects the infection campaign is via phishing emails or directly on Facebook\nitself (Radware has not yet received one). Recipients are led to believe they are going to\nlegitimate sites (i.e. AOL) to download a legitimate application, however the site is really a\nUnicode domain of the AOL site.\n\n\n-----\n\nFigure 3: The phony website\nThe site advertises an application called “Relieve Stress Paint” and contains a download link.\n\nWhile the application or website are not yet visible by search engines, specific strings in the\nsite led Radware to a site on Google called ‘aol.net.’ This is not really ‘aol.net’ but rather a\nUnicode representation of aol.net and its true address is ‘xn--80a2a18a.net.’\n\nFigure 4: The malicious website as indexed by Google\n\n**_[You might also like: Why Cyber-Security Is Critical to The Loyalty of Your Most_**\n**_Valued Customers]_**\n\n## The Malware\n\nOnce the file is downloaded and executed, a window is opened showing the “legitimate\nprogram” to the user. This is a paint program that changes colors and line size for each click.\n\n\n-----\n\nFigure 5: Screenshot of paint program\nIn the background, the malware immediately starts running and dropping files on the system.\n\n_Temp\\\\DX.exe – the main module of the malware that remains persistent on the system_\n_Temp\\\\updata.dll – possibly used later on for credential/cookie stealing purposes_\n_Desktop\\RelieveStressPaint.lnk – a desktop link to run the original downloaded_\nexecutable. Supports the legitimacy of the program.\n_AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data11111_\n_AppData\\Local\\Google\\Chrome\\User Data\\Default\\Cookies11111_\n\nBoth are copies of the original files that are stored on the chrome folder and are used for\ncookies/saved password stealing and are immediately deleted\n\nNext, a number of registry keys are also created/modified.\n\n_HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Updata – with the_\nvalue of DX.exe [parameter]. We have seen two different parameters which may\nindicate two different infection campaigns that the author wants to track. This is also\nrepresented in the control panel.\n_HKCU\\Software\\Classes\\VirtualStore\\MACHINE\\SOFTWARE\\RelieveStressPaint\\guid-_\nwith the value of user GUID. This is saved in the following format [5 random\nletters/numbers]HHMMSSYYYYMMDD.\n\n\n-----\n\nAfterwards, a connectivity check is done to a specific Instagram profile. Radware believes\nthis is done to receive instructions or updates (this matter is still under investigation).\n\n## Facebook Data Theft\n\nInformation is stolen when the malware is run for the first time, if the user runs the application\nagain (using the .lnk on his desktop), and every restart of the computer. It is done by copying\nthe content of Chrome browser cookies and login data files to a new location and querying\nthe data from there. Once saved login credentials (username + password) or Facebook\ncookies are found, they are sent encrypted to the C2 in the following format:\n\n_{\\”fid\\”:\\”%s\\”,\\”fpwd\\”:\\”%s\\”,\\”cookies\\”:\\”%s\\”,%s}_\n\nFigure 6: Exfiltration of compromised user credentials to the C&C server\nOn other requests, general information on the infected machine is sent in the following\nformat:\n\n_{\\”guid\\”:\\”%s\\”,\\”os\\”:\\”%s\\”,\\”agent\\”:\\”%s\\”,\\”Auto\\”:%s,\\”flag\\”:%s,\\”data\\”:%s,\\”seller\\”:\\”%s\\”}_\n\nOnce the credentials are validated and access is granted, additional data is collected, such\nas number of friends, whether the account manages a page or not, and if the payment\nmethod is configured for the account. This is done by accessing several predefined\nFacebook URLs which return this information. All requests are accomplished using the hard\ncoded User agent:\n\n\n-----\n\n_Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko)_\n_Chrome/55.0.2883.87 Safari/537.36_\n\n## Stealth\n\nThe malware authors decided to leverage a specific data theft method to stay hidden on the\nsystem as long as they can.\n\nNo general credential stealing is done which might raise some flags by security\nvendors\nThe cookies and saved password theft is only accomplished from querying copies of\nthe original cookies/login data files\nThe process that is in charge of the credential theft resides on the system for less than\na minute each time\n\nSince they are interested only in Facebook access at this stage, they get it either from the\nfirst infection saved login/cookies or when the computer is restarted.\n\n## Control Panel\n\nThe operators of this botnet decided to use an open source Chinese CMS called\n[Layuicms2.0. They have customized it to show information of the botnet outbreak such as](https://github.com/BrotherMa/layuicms2.0)\nstolen credentials and cookies, but also other metrics and the ability to export Facebook\ndata. The panel also features a section for Amazon, but it is not yet functional. Radware\nbelieves that this implies that the group’s next target will be Amazon.\n\nFigure 7: Control panel (translated from Chinese by Google Chrome)\n\n\n-----\n\nFigure 8: Users’ data\n\n## Possible Impact\n\nSince the group is at the data collection phase, Radware can only speculate what the\noperators of this botnet do with the stolen credentials.\n\n**Monetization – simply selling stolen credentials to malicious actors and cyber-**\ncriminals. Online identities have been traded over the dark web for some time.\n**Ransom – extort victims by threating them to reveal personal information like photos**\netc.\n**Espionage – take advantage of the possessed credentials to track specific people’s**\nactivity, network and conversations\n**Profit – use the stolen credentials and payment information to shop on eCommerce**\nsites and services\n**Identity Theft – reuse the credentials to log-in into other accounts or services via**\nFacebook.\n\nHowever, the fact that this group is looking specifically for accounts with pages, and\nmembers with large networks, lead us to consider a couple of additional options.\n\n**Malvertising – with the stolen credentials, access to web pages and payment details,**\nthe group can launch malicious advertisement campaigns, whether to make profit or\nspread more malwares. They can use small amounts from each user without raising\nsuspicion and collect a critical mass to launch any activity.\n**Propaganda – with the same information, instead of advertising a product or a service,**\nthey can run a campaign to promote their agenda and reveal people/personal identities\n\n**_[[You might also like: Can Security Be Efficient Without Expertise or Intelligence?]](https://blog.radware.com/security/2018/04/security-efficiency-expertise-intelligence/)_**\n\n\n-----\n\n## Steps to Protect From Data Harvesting Malwares\n\nDetect new zero-day malware using cutting-edge machine learning algorithms\nBlock new threats by integrating with existing protection mechanisms and defense\nlayers\nReport on malware infection attempts in your network\nAudit defenses against new exploits and see where you are vulnerable\n\nAs this malware rapidly expands, the group will certainly continue to try to find new ways to\nutilize the stolen assets. Such groups continuously create new malware and mutations to\nbypass security controls. Radware recommends individuals and organizations to update their\ncurrent password and only download applications from trusted sources. Radware’s Malware\nResearch Group will keep monitoring and analyzing new threats to provide protection to its\ncustomers.\n\n## Disclosure\n\nWe have brought our research findings to the Facebook information security team, including\nall the stolen credentials of the accounts. Facebook is investigating this operation and has\nprovided the following statement.\n\nWe encourage people to check the mails they receive for trusted domains.\n[Facebookmail.com is a common domain that Facebook uses to send notifications](http://facebookmail.com/)\nwhen we detect an attempt to log in to your account or change a password. If you’re\nunsure if an email you received was from Facebook, you can check its legitimacy by\nvisiting [facebook.com/settings to view a list of security-related emails that have been](https://facebook.com/settings)\nrecently sent. We are investigating these malware findings and we are taking steps to\nhelp protect and notify those who are impacted.\n\n“We maintain a number of automated systems to help stop harmful links and files from\nappearing on Facebook and in Messenger. If we suspect your computer is infected\nwith malware, we will provide you with a free anti-virus scan from our trusted partners.\nWe share tips on how to stay secure and links to these scanners\non [facebook.com/help.” – Pete Voss, Facebook communications manager](http://facebook.com/help)\n\nRadware also reached out to the domain registrar to cease and decease this activity but as\nof time of publication received no response.\n\n[To download the alert, click here: Radware Threat Alert: Stresspaint](https://security.radware.com/malware/stresspaint-malware-targeting-facebook-credentials/)\n\n\n-----\n\n### Read “2017-2018 Global Application & Network Security Report” to learn more.\n\n[Download Now](https://www.radware.com/social/ert-report-2017/?utm_source=RadwareBlog&utm_campaign=FixedCTA&utm_term=8048)\n\n### LEAVE A REPLY\n\nPlease enter your comment!\n\nPlease enter your name here\n\nYou have entered an incorrect email address!\n\nPlease enter your email address here\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-04-18 - Stresspaint Malware Campaign Targeting Facebook Credentials.pdf"
    ],
    "report_names": [
        "2018-04-18 - Stresspaint Malware Campaign Targeting Facebook Credentials.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535904,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1653760295,
    "ts_modification_date": 1653760295,
    "files": {
        "pdf": "https://archive.orkl.eu/c05efcb0705dcdb3bea6f1309be45a97db0e88b5.pdf",
        "text": "https://archive.orkl.eu/c05efcb0705dcdb3bea6f1309be45a97db0e88b5.txt",
        "img": "https://archive.orkl.eu/c05efcb0705dcdb3bea6f1309be45a97db0e88b5.jpg"
    }
}