{
    "id": "ccd0f221-fde4-481f-9e09-d3fafbb14cb6",
    "created_at": "2022-10-25T16:48:17.342756Z",
    "updated_at": "2025-03-27T02:05:55.537814Z",
    "deleted_at": null,
    "sha1_hash": "1f89e8ba75a9e4d5d957fadc71074bfe1d53b2a9",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-01-07T07:55:44Z",
    "file_modification_date": "2021-01-07T07:55:44Z",
    "file_size": 64128,
    "plain_text": "# Press Release | Press | United States Commitee on Armed Services\n\n**armed-services.senate.gov/press-releases/sasc-investigation-finds-chinese-intrusions-into-key-defense-**\ncontractors\n\n## SASC investigation finds Chinese intrusions into key defense contractors\n\n Report describes threats to transportation systems, gaps in reporting requirements\n\nWednesday, September 17, 2014\nWASHINGTON – Hackers associated with the Chinese government successfully\npenetrated the computer systems of U.S. Transportation Command contractors at least\n20 times in a single year, intrusions that show vulnerabilities in the military’s system to\ndeploy troops and equipment in a crisis, a Senate Armed Services Committee\ninvestigation has found.\n\nThe year-long investigation found that TRANSCOM, which is responsible for global\nmovement of U.S. troops and equipment, was only aware of two of those intrusions. It\nalso found gaps in reporting requirements and a lack of information sharing among\ngovernment entities that left the command largely unaware of computer compromises by\nChina of contractors that are key to the mobilization and deployment of military forces.\n\nThese and other findings are included in a report, “Inquiry into Cyber Intrusions\nAffecting U.S. Transportation Command Contractors,” that the committee approved\nunanimously this spring. The committee released an unclassified version of the report\ntoday.\n\n“These peacetime intrusions into the networks of key defense contractors are more\nevidence of China’s aggressive actions in cyberspace,” said Sen. Carl Levin, D-Mich., the\ncommittee’s chairman. “Our findings are a warning that we must do much more to\nprotect strategically significant systems from attack and to share information about\nintrusions when they do occur.”\n\n\"We must ensure that cyber intrusions cannot disrupt our mission readiness\" said\nSenator Jim Inhofe, R-OK, the committee's ranking member. \"It is essential that we put\ninto place a central clearinghouse that makes it easy for critical contractors, particular\nthose that are small businesses, to report suspicious cyber activity without adding a\nburden to their mission support operations.\"\n\n\n-----\n\nThe committee investigation focused on a little-recognized but vital U.S. military asset:\nthe ability to tap civilian air, shipping and other transportation assets to rapidly deploy\nU.S. forces in times of crisis. Through programs such as the Civil Reserve Air Fleet,\ncommercial transportation companies, some of whom do little or no CRAF-related\nbusiness in peacetime, become key elements of TRANSCOM’s plans for moving troops\nand equipment around the world.\n\nThe committee found that in a 12-month period beginning June 1, 2012, there were\nabout 50 intrusions or other cyber events into the computer networks of TRANSCOM\ncontractors. At least 20 of those were successful intrusions attributed to an “advanced\npersistent threat,” a term used to designate sophisticated threats commonly associated\nwith governments. All of those intrusions were attributed to China. Among the\ninvestigation’s findings:\n\nA Chinese military intrusion into a TRANSCOM contractor between 2008 and\n2010 that compromised emails, documents, user passwords and computer code.\n\nA 2010 intrusion by the Chinese military into the network of a CRAF contractor in\nwhich documents, flight details, credentials and passwords for encrypted email\nwere stolen.\n\nA 2012 Chinese military intrusion into multiple systems onboard a commercial\nship contracted by TRANSCOM.\n\nThe investigation found significant gaps in information sharing regarding cyber\nintrusions. A committee survey of a small subset of TRANSCOM contractors discovered\n11 intrusions by China into contractor networks. The investigation also found that the\nFBI or DoD were aware of at least nine other successful intrusions by China into\nTRANSCOM contractors. Of those 20 intrusions, TRANSCOM was only made aware of\ntwo.\n\nThat gap was in part a result of contractors and TRANSCOM lacking a common\nunderstanding of what intrusions ought to be reported to TRANSCOM. Also, DoD\nagencies lack a clear understanding as to what information about cyber intrusions can\nand should be shared with TRANSCOM and other agencies within the Department.\n\nThe committee also found that cyber intrusion reporting requirements are focused on\nintrusions that affect DoD data. Some TRANSCOM contractors, such as several CRAF\nairlines, however, may do little or no business with the military until called upon in a\ncrisis. Peacetime intrusions at those companies may not involve immediate loss of\nmilitary information, but could leave those companies vulnerable to loss of information\nor disruption of operations when they are activated to support military operations.\n\nIn response to the investigation’s findings, the committee included a provision in its\nversion of the National Defense Authorization Act for Fiscal Year 2015 directed at\naddressing reporting gaps and improving the way in which the Department disseminates\ninformation about cyber intrusions into the computer networks of operationally critical\ncontractors\n\n\n-----\n\nSpecifically, the provision directs the Secretary of Defense to establish procedures for\ndesignating companies as ‘‘operationally critical contractors’’ and tightening\nrequirements that those contractors report successful cyber penetrations by known or\nsuspected government actors. It also requires DoD to establish new procedures to assist\ncontractors in detecting and mitigating cyber threats while ensuring protections for trade\nsecrets, commercial or financial information.\n\nThe provision requires the Secretary to assess existing reporting requirements and DoD\npolicies and systems for sharing information on cyber intrusions. It also requires the\nSecretary to designate a single DoD component to receive intrusion reports from\ncontractors and other government agencies and to issue guidance ensuring that\nintrusion-related information is shared with appropriate DoD components.\n\n###\n\n## Related Files\n\n[Adobe Acrobat document.SASC_Cyberreport_09-17-14](https://www.armed-services.senate.gov/download/sasc_cyberreport_09-17-14)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.09.17.Chinese_APT_defense_contractors/armed-services.senate.gov-Press%20Release%20%20Press%20%20United%20States%20Commitee%20on%20Armed%20Services.pdf"
    ],
    "report_names": [
        "armed-services.senate.gov-Press Release  Press  United States Commitee on Armed Services"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1610006144,
    "ts_modification_date": 1610006144,
    "files": {
        "pdf": "https://archive.orkl.eu/1f89e8ba75a9e4d5d957fadc71074bfe1d53b2a9.pdf",
        "text": "https://archive.orkl.eu/1f89e8ba75a9e4d5d957fadc71074bfe1d53b2a9.txt",
        "img": "https://archive.orkl.eu/1f89e8ba75a9e4d5d957fadc71074bfe1d53b2a9.jpg"
    }
}