{
    "id": "ccf09662-666e-4f6a-abce-63bb066bb58d",
    "created_at": "2023-01-12T15:02:30.827945Z",
    "updated_at": "2025-03-27T02:16:43.031196Z",
    "deleted_at": null,
    "sha1_hash": "4d5a7d86225ae0aa899e7631a90798cee5054c11",
    "title": "2016-09-27 - New Voldemort-Nagini Ransomware Virus Infection",
    "authors": "",
    "file_creation_date": "2017-04-25T17:17:50Z",
    "file_modification_date": "2017-04-25T17:17:51Z",
    "file_size": 372378,
    "plain_text": "# The Definitive Guide to  Sharing Threat Intelligence\n\n\nThreat intelligence is becoming a more ubiquitous\nfeature in information security programs. Whether\norganizations have a full threat intelligence team,\ningest threat feeds, or simply leverage threat intelligence features found in common security tools, they\nare now benefiting from threat intelligence in one way\n[or another. The 2016 Ponemon Study, The Value of](https://www.anomali.com/resources/whitepapers/value-of-threat-intelligence-ponemon-study)\n[Threat Intelligence, indicates that 78% of organiza-](https://www.anomali.com/resources/whitepapers/value-of-threat-intelligence-ponemon-study)\ntions consider threat intelligence critical to achieving a\nstrong security posture.\n\nCommensurate with the increase in the use of threat\nintelligence has been an increase in sharing threat\nintelligence between organizations. Industry-centric\nsharing initiatives like Information Sharing and Analysis Centers (ISACs), Information Sharing and Analysis\nOrganizations (ISAOs), and other industry sharing\norganizations have led to a dramatic increase in the\nsharing of threat intelligence. Additionally, government-led initiatives from the Department of Homeland\nSecurity (DHS), like the Automated Indicator Sharing\n(AIS) program and the Cyber Information Sharing and\nCollaboration Program (CISCP), and the United Kingdom’s Cyber-security Information Sharing Partnership\n(CiSP), have all encouraged sharing partnerships\n\n\nbetween governments and private organizations.\n\nDespite the relative popularity of these sharing initiatives, member organizations are still mostly focused\non consuming what is shared instead of adding their\nown contributions. There are a number of reasons for\nthis. Not all organizations have the resources to stand\nup full-blown threat intelligence practices capable of\nproducing their own intelligence. While this is not a\nrequirement for sharing indicators or other types of\nintelligence, it is still a primary reason that organizations feel they have nothing of value to contribute.\n\nPrivacy concerns are another major barrier to organizations contributing to threat intelligence sharing\ninitiatives. It’s not a hard sell to consume shared data\nfrom other organizations, but there are still fears\naround sharing internal threat data that might be\nconsidered sensitive. These concerns are valid but not\ninsurmountable hurdles to getting more organizations\ninvolved in sharing.\n\nThere are many quite significant benefits to sharing —\nperhaps some that haven’t yet been realized. Included\nhere are several points for consideration in regards to\nsharing threat intelligence.\n\n\n-----\n\n## Unidirectional vs. bidirectional sharing\n\nSharing threat intelligence comes in many flavors.\nThe more common version is unidirectional threat\n_intelligence sharing, where one entity produces and_\nshares threat intelligence that others consume. Those\nconsuming the intelligence do not contribute in return,\noften because a mechanism does not exist for “pushing” information back. Examples of unidirectional\nthreat intelligence sharing include:\n\n- Open-source intelligence, which might involve\ndownloading a publicly available report covering a\nrecent attack that contains indicators and methods\nused, or ingesting an open source intelligence feed.\n\n- Closed-source reports and feeds\n\nThe other option for organizations is to engage in\n_bidirectional threat intelligence sharing. For most_\norganizations, their initial experience with this kind of\nsharing likely came when joining their industry ISAC\nor government sharing program. In these situations\nintelligence isn’t just sent down to be consumed but\ncan also be ingested from member organizations.\nAlthough sharing is allowed and encouraged in these\nprograms, there is no guarantee that every organization will share anything as previously noted. They are\nconsumers but not sharers of threat intelligence.\n\n## Concerns around sharing intelligence\n\nThe desire to consume available threat intelligence\n\n\nis a no-brainer. Whether or not specific sources of\nthreat intelligence should be consumed by a particular\norganization, or if it has the ability to properly utilize\nthose sources, is a separate question outside the\nscope of this discussion. Hint: These questions should\nbe answered by intelligence requirements, fidelity,\n[availability of resources, and so on. See also: Anomali](https://www.anomali.com/platform/threatstream)\n[ThreatStream. Overall, the decision to consume some](https://www.anomali.com/platform/threatstream)\nsource of intelligence is generally not a hard sell if it\nis deemed to be required for generating actionable\nintelligence in an organization.\n\nAsking an organization to actively share indicators or\nproduced-intelligence is another question altogether.\nEven contributing additional details or context to\nintelligence shared from other organizations can\nbe a tall order. Below is a list of common concerns\npreventing organizations from engaging in sharing\nthreat intelligence:\n\n**1. Privacy & liability concerns**\n\n  - Scrubbing data for private information or\nsensitive corporate information before sharing\nis a good idea regardless of the type of sharing\ninvolved. This is most problematic with\nautomated sharing as the scrubbing must be\ndone before the information is shared.\n\n  - The Cybersecurity Information Sharing Act of\n2015 (CISA) has provisions to address common\nconcerns around privacy and liability. Some\nof these protections are contingent on certain\nstipulations being met. As always, proper legal\nadvice is highly recommended to understand\n\n\n-----\n\nhow CISA may apply to specific situations[1].\n\n  - The fact that so many organizations are engaging\nin sharing initiatives within their industry or with\nthe government is proof that privacy and liability\nconcerns can be overcome — either through\nmore accurate perception of sharing intelligence,\nprotective clauses in legal agreements, recent\nlegislation, or care in what is being shared. Regardless of the underlying reason, it is a promising trend for the future of shared intelligence.\n\n**2. “There is nothing of value to contribute.”**\n\nOrganizations with smaller information security teams and smaller budgets may feel like they\ndon’t have anything to contribute that isn’t already\nbeing covered by larger organizations or those with\nbigger budgets. This shouldn’t preclude them from\nstepping in where possible. There are often at least\nsome additional details that can be added to the\nintelligence already shared. For example, no organization sees every possible attack or all possible\nvariants of a particular wave of phishing emails.\nThere are always be opportunities for organizations\nto get involved and share something, regardless\nhow insignificant it may seem. These details can\naid in visibility and help produce more fully sourced\nintelligence analysis.\n\n**3. Lack of expertise**\n\nNot having trained intelligence analysts on staff can\nbe a hindrance to contributing to shared intelligence. While it is true that lack of trained analysts\nis an issue, it shouldn’t curtail the notion of sharing\naltogether. By simply adding whatever context,\nobserved attack details, and if possible, analysis\ndeveloped by those on staff, value can still be added\nto the community.\n\n**4. Fear of revealing an organization has been**\n**hacked**\n\nThe fear of sharing breach details more broadly\nthan with the entities absolutely necessary is common. What if the analysis details of some interesting traffic shared in the morning turned out to be\nevidence of a month-long breach discovered after\n\n\nfurther analysis? Going even further, the idea of de_liberately sharing breach details quickly with shar-_\ning partners is probably a foreign concept in most\norganizations. This topic is addressed more fully\nlater in the document in the section titled, “Where\nto start or expand intelligence sharing” under item\nnumber six.\n\n## Sharing intelligence outside of industry verticals\n\n### Connecting to other verticals\n\nIndustry verticals are naturally a great place for\norganizations to share threat intelligence. The\nshared business understanding, (sometimes) similar\ncultures, and industry-specific attack surface create\nthe perfect environment for sharing intelligence.\nISACs, ISAOs, and other industry-specific information\nsharing organizations provide the legal frameworks\nto facilitate sharing intelligence among member\norganizations. These are probably the most likely\nplaces that active intelligence sharing occurs for most\norganizations.\n\nWe shouldn’t stop at joining our friendly neighborhood\nISAC, however. Gaining insights from organizations\noutside our industry echo chamber can be an\nimportant element of visibility. There are other\nvariables to consider as well.\n\nIndustries develop muscle memory around specific\nthreats that are commonly seen, and attacks from\ncertain actors or groups become easily recognizable.\nWhat happens when one of these groups or actors\nsuddenly moves into a new industry, though? Chances\nare that little may be known about them in that new\nindustry. Some information can be carried forward\nthrough third party threat intelligence services but\nlikely not the full breadth of knowledge that the\nprevious industry has built around that actor or group\n(this touches on the need for sharing with vendors but\nwe’ll table that discussion until later in the document).\nThe result is that the new industry is caught with little\nknowledge of the adversary and insufficient means of\nprotecting themselves.\n\nHere is a theoretical example that hopefully clarifies\n\n\n1. For more information on CISA:\ncorpgov.law.harvard.edu/2016/03/03/federal-guidance-on-the-cybersecurity-information-sharing-act-of-2015/\n\n\n-----\n\nthis point. In 2015, it became public that giant healthcare provider, Anthem, had been breached and a\nmassive amount of patient data was suspected to have\nbeen stolen[2]. It was later surmised that a group known\nas Deep Panda (using Crowdstrike’s vernacular) was\nlikely behind the attack. Supposing this attribution was\naccurate, and supposing other attacks associated with\nthis group were also accurate, it’s likely that Anthem\nhad no reason to believe that this group would target\nthem. Prior to the attack, public reporting about this\ngroup noted that they had been involved in several sectors such as defense, financial institutions, and government agencies — nothing relating to healthcare[3].\nHad entities within the defense and healthcare industries shared intelligence, there might have been some\ntransfer of knowledge about these actors that could\nhave bolstered Anthem’s defenses, potentially leading\nto an earlier detection or prevention of the breach.\n\nThis is obviously heavy speculation, as Anthem still\nwould not have had any reason to assume this group\nwas shifting to healthcare. Regardless, intelligence\nsharing between these industries certainly wouldn’t\nhave hurt. The benefits go both ways as actors and\ngroups shift tools and tactics between and across\nindustries.\n\n### Localized intelligence sharing\n\nFinding partners local to your organization’s physical\nlocation also has benefits. Not all attacks are remote\nin nature. Physical breaches, WiFi attacks, USB drive\ndrops, and hybrid trespassing/information security\nattacks may indicate local actors with physical access\nto entities in the local area. Additionally, localized\nevents such as weather, terrorist attacks, accidents,\netc. would benefit from localized sharing of intelligence\nthat is not dependant upon an industry vertical. In the\n[United States, DHS Fusion Centers are a great place to](https://www.dhs.gov/state-and-major-urban-area-fusion-centers)\nstart with localized, cross-industry sharing. Networking at local security events is a great place to find good\nintelligence sharing partners as well.\n\n### Sharing intelligence with smaller orga- nizations\n\nSharing with smaller organizations can also be beneficial because they see tactics that bigger organiza\n\ntions may not. They can represent low-hanging fruit\nto attackers because they often don’t have the budget\nfor the comprehensive security tools and security staff\nthat larger organizations have. Sharing with smaller\norganizations has benefits that can go both ways —\nsmaller firms can benefit from the deeper expertise of\nthe larger ones and larger organizations benefit from\nthe broader visibility smaller firms can provide into\ncurrent threat tactics. This encourages both organizations to impart knowledge of intelligence practices\nand other important skills. Resources in these smaller\norganizations will hopefully become regular contributors to intelligence sharing and become just as\nvaluable as resources from larger organizations.\n\n## Targeted or not\n\nSharing intelligence about specific campaigns or\nattacks can bring additional context back in return.\nKnowing whether or not other organizations were\naffected by a specific campaign is enough to indicate\nthat it wasn’t targeted only to your organization.\nGranted there are often a variety of ways to gain\nvisibility into whether or not an attack was targeted\nonly to your organization, such as a quick check on\nVirusTotal. But what about those times when there\nare no signs of the attack across those resources, how\ncan you tell for sure? Broadly sharing intelligence with\nnumerous partners can help add some visibility to this\nquestion. Such sharing is beneficial because it provides additional context about attacks from organizations that actually experienced it. Knowing the attack\nwas aimed specifically at your industry or perhaps\naimed at businesses sponsoring a specific event is\nvaluable information.\n\nBut what if it was targeted only to my organization,\nand and I’ve just informed the other organizations of\nthe details? They could accidentally share that information with an antivirus vendor and discern that you\nare tracking the attack when their malware is caught.\nThis is a legitimate concern that highlights the need\nfor all of us to be good sharing partners. We all need\nto be very cautious with information shared in confi[dence. Honoring the Traffic Light Protocol (TLP) or any](https://www.us-cert.gov/tlp)\nother guidelines agreed to when we enter into sharing\nagreements with other organizations is paramount\n\n\n2. krebsonsecurity.com/2015/02/anthem-breach-may-have-started-in-april-2014/\n3. www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks\n\n\n-----\n\nto successful intelligence sharing. Holding others\naccountable in these agreements is also important to\nmaintain a culture of integrity and help ensure proper\nstewardship of shared intelligence amongst all parties\ninvolved. Ultimately, the rewards still far outweigh\nthe risks in sharing even sensitive information about\nattacks, campaigns, attackers, or other intelligence.\n\n## Diversified security and expertise\n\nOrganizations all have varied security tools and different expertise in their security programs. This is a\nbit of a common sense point to make that is generally\nunderstood without having to point it out. However,\nthis fact has implications in the world of threat intelligence. The collective set of security tools, intelligence\ncollection mechanisms, and available expertise an\norganization has represents its threat intelligence\nvisibility. This gives the organization a unique pointof-view when it comes to knowledge gleaned about\nparticular pieces of malware, campaigns, and depending on the maturity of their threat intelligence\nprogram, even of threat actors and the like. In a\nsharing collective, having access to organizations\nwith different security tools and experts with different backgrounds can mean different insights applied\nto threat intelligence questions. This translates into\nbroader collective knowledge when all these resources are brought to bear on a particular topic, campaign,\nor other intelligence question. Organizations going it\nalone don’t get this expanded view into threats or other topics of interest. Of course, these benefits are also\ncontingent on participation from the various organizations involved as well.\n\n## Sharing with... <gasp> vendors\n\nVendors engaged in collecting threat intelligence\nhave several benefits to offer that can augment threat\nintelligence programs. They often employ human\nintelligence collection (HUMINT) as well as technical\ncollection methods not performed by most organizations (crawlers, specialized honeypots, etc.).\nThis results in broader visibility and enrichment to\nexisting intelligence collection mechanisms inside\norganizations. These intelligence vendors often do not\nhave much visibility into what is actually seen inside\norganizations unless they happen to have a part of\ntheir business that deals with incident response. Post\n\n\nbreach forensic details provide a rich connector to externally collected intelligence with what is seen inside\nan organization after a breach. Intelligence created on\na day-to-day basis from inside organizations is often\nnot something intelligence vendors have access to.\nThe result is that organizations themselves have to\nbe the connector between externally gathered intelligence and what they collect from their own networks.\nThis works — but further value might be gained if\ncertain intel were shared back to these vendors so\ntheir analysts could correlate what they know with\nobserved intelligence from inside organizations.\n\nThis is usually a contentious suggestion. Generally\nspeaking, organizations aren’t keen on letting third\nparty vendors have access to internally generated\nintelligence. Especially if those vendors are viewed as\n“turning a profit” on freely divulged information.\n\nThese concerns aren’t off-base but when I was at my\nprevious job, I had a different perspective on this matter. I realized that there was a problem with visibility\non both sides of the equation. Working inside a corporate security program, I didn’t have the resources to\nstaff up and start doing human intelligence collection\neverywhere I had adversaries. I didn’t have the resources to try and stand up all the technical collection\napparatus I wanted to either. Paying for third-party intelligence was a way to fill-in these gaps. This helped\nin my opinion but I realized the intelligence providers\ndidn’t always have the data curated in a way that was\ncontextualized specifically to my environment. Outside of looking for intelligence relevant to my industry\nor my company’s name, how would they even know\nwhat I was seeing on a daily basis to give me relevant intelligence on that level? It was up to me or my\nanalysts to sift through what they had available and\nfind connections to stuff we observed or had interest\nin. Even then, sometimes it was difficult to find substantially useful intelligence to what we were seeing.\nSometimes it was and sometimes it wasn’t. Requests\nfor Information (RFIs) certainly help fill this gap but I\ndidn’t want to rely on these on a daily basis.\n\nThere had to be a more efficient way to collaborate\nwith them. If they could see what we were seeing\ninternally, in theory they could direct their collection\nefforts more accurately to my observed threats and\naugment my intelligence in a much more meaningful\nmanner. Wishful thinking perhaps, but probably not\n\n\n-----\n\noutside the realm of reason.\n\nIn a previous role, I reached out to two of our vendors where I felt we had a strong enough relationship\nwith to test this out. Interestingly, one was a traditional threat intelligence vendor and the other was\nin a slightly different space in information security. I\ntrusted their researchers and the overall integrity of\ntheir leadership and I felt they would be able to turn\nour internally-generated intelligence into something\nuseful back. I changed positions not long after these\ndiscussions so I was never able to see these efforts\nfulfilled. It’s hard to say what would have happened.\nDespite that, I’m still a firm believer that some sharing\nback to vendors could be a very beneficial effort.\n\nGeneral thoughts on this:\n\n**1. Careful selection of vendors to partner with in**\n**this manner**\n\n  - What will I get back for sharing with them?\n\n  - Who inside their organization will see the data?\nWhat are their roles?\n\n  - What will they do with the data?\n\n  - Do I trust them?\n\n**2. Carefully scrub anything shared with them**\n\n - What is the minimum amount of information I can\nprovide to see results?\n\n  - No private info or sensitive company info\n\n**3. Ensure a legal framework is in place to protect**\n**both sides**\n\n  - Ensure the data is used as expected and not sold\nto other parties, etc.\n\n - Work with lawyers to make sure proper protections are in place\n\n**4. Shouldn’t be limited to just “threat**\n**intelligence” vendors**\n\n  - Who does my organization have a relationship\nwith that might benefit from this data and help\nbetter protect my org as a result?\n\n## Where to start or expand intelligence sharing\n\nWhether your organization is already actively sharing\nintelligence or hasn’t begun doing so yet, here are\n\n\nsome tips on where to get started or ways to enhance\nsharing that is already happening:\n\n### 1. Tools and communities\n\nBegin with choosing appropriate tools to share threat\nintelligence. Email is the easiest place to start but\nfocus on moving into more formal methods of sharing\nthrough available tools possibly leveraging standards\nsuch as STIX and TAXII. ISACs and other industry organizations are perfect communities to get started with\nintelligence sharing and normally have mechanisms in\nplace for doing so. Ad hoc sharing with local entities\nor partners in other industries may start out less\nformal at first but work to leverage standard tools and\nsharing mechanisms with these as well. From a tools\n[perspective Anomali STAXX is a free solution offered](https://www.anomali.com/platform/staxx)\nby Anomali that supports sharing indicators through\n[STIX and TAXII. Anomali ThreatStream users already](https://www.anomali.com/platform/threatstream)\nhave a very robust solution to share indicators and\nother intelligence with other organizations or create\ntheir own sharing communities.\n\n### 2. Share and contribute\n\nMake sure to contribute to sharing once sharing\npartnerships are in place. Also contribute where\nyour team can add additional context to intelligence\nshared from other parties. Sharing observed adversary behaviors, attacks seen, or details from incident\nresponse are great places to start. Don’t worry if\nthere isn’t much in the way of analysis added to what\nis shared initially. Watch for sharing things that have\nalready been shared. If the phishing attack you were\nabout to share has already been shared by someone\nelse, look through what they provided and see if there\nis additional context you or your team can add. Try to\ngauge the value of what is being shared in your community and tune what gets shared out accordingly.\nDon’t forget about historical context. Being able to tie\nthis morning’s phishing barrage to a similar barrage 3\ndays or a week ago helps to identify a specific actor’s\nactivities. Being able to eventually identify several\nattack campaigns that seem to be associated with the\nsame actor or group helps to build a profile of what\nthat actor likes to do and how they like to do it. This\nprocess is much easier when looking at actor activities broadly across several organizations and tying\nthem together along with historical details and other\ncontextual enrichments.\n\n\n-----\n\n### 3. Share outside your vertical\n\nLook for opportunities to share with organizations\noutside of your vertical. This includes localized entities\nsuch as Fusion Centers as well as other organizations\ndeemed to be a good fit for sharing intelligence. The\nidea of sharing with outside entities is becoming more\naccepted in organizations thanks to ISACs, legislation, and government initiatives around this subject.\nLeveraging this acceptance to build trust and sharing\nrelationships with entities outside of the industry vertical and government should garner some success. As\nalways, working closely with legal teams/lawyers to\ndraw up appropriate agreements to facilitate sharing\nbetween the entities is really a requirement.\n\n### 4. Consider sharing with vendors\n\nThis suggestion probably isn’t for everybody, but if\nthe section on sharing with vendors resonated with\nyou, consider some potential vendors who might be\nbeneficial to share intelligence with and reach out to\nthem. Chances are they will not necessarily have a\nmechanism in place to ingest intelligence from your\norganization but see what makes sense to start with if\na sharing agreement can be reached.\n\n### 5. Share hunting & defense techniques\n\nWhile the focus of this document has centered around\nsharing intelligence, consider other items to share\nas well. Threat hunting details such as searches that\nhave proved valuable, specific log entries that are\nuseful, and other related details can turn into shortcuts in other organizations’ hunting efforts. Hopefully\nthey return the favor and it becomes a force multiplier\nin threat hunting. Also, sharing any successful defense\ntechniques or rules such as YARA rules, snort signatures, Bro rules, scripts, and anything else that can\neasily be replicated between organizations. The more\nwe share with each other, the harder it will become for\nthe bad guys.\n\n### 6. Share breach details\n\nBreaches can be sticky subjects inside organizations.\nThe usual reaction to a full-blown information security\n\n\nbreach is to engage the authorities, employ a thirdparty incident response organization to help clean\nthings up, notify whoever is required to notify, and\nrelease as little detail outside of those efforts as\npossible. While this strategy works in some ways,\nit falls short of what is truly possible in providing a\nbetter response. Depending on the legal framework\nin place that facilitates intelligence sharing, ample\nprotections around disclosure could already exist\nto ensure protection for sharing breach details with\nsharing partners (consult legal advice pertinent\nto your specific agreements to be sure). What this\nbrings is a variety of potential benefits for all parties\ninvolved. Pushing out breach details quickly could\nmean the difference in someone else being breached\nand being able to stop it quickly. Also, it could bring\nlots of assistance in terms of additional intelligence\nand quicker answers to incident response challenges\nthanks to the additional resources from other\norganizations adding their skills and expertise to the\nevent. The other organizations are going to find out\nabout the event one way or another, why not leverage\ntheir help while it’s still going on?\n\n## Conclusion\n\nSharing threat intelligence is gradually becoming an\naccepted component in information security defense. There are still a number of ways we can gain\nmore through sharing threat intelligence, however. By engaging more actively and more broadly in\nsharing, we pass information more quickly; we can\nmake better judgements; and we can deliver more\ninsightful analysis to stakeholders and intelligence\nconsumers. Changes to malware, infrastructure, new\ntools, new techniques, actor behaviors, campaigns,\nand other intelligence-related details can all become\nquickly known across a multitude of organizations.\nUltimately, the bad guys may be trying to compromise\nsingle organizations but are battling a collective in the\nprocess.\n\n_Travis Farral, Director of Security Strategy at Anomali_\n_travis@anomali.com_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Anomali - Definitive Guide to Sharing Threat Intelligence.pdf"
    ],
    "report_names": [
        "Anomali - Definitive Guide to Sharing Threat Intelligence.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535750,
    "ts_updated_at": 1743041803,
    "ts_creation_date": 1493140670,
    "ts_modification_date": 1493140671,
    "files": {
        "pdf": "https://archive.orkl.eu/4d5a7d86225ae0aa899e7631a90798cee5054c11.pdf",
        "text": "https://archive.orkl.eu/4d5a7d86225ae0aa899e7631a90798cee5054c11.txt",
        "img": "https://archive.orkl.eu/4d5a7d86225ae0aa899e7631a90798cee5054c11.jpg"
    }
}