{
    "id": "cd2c4dee-f0c9-4849-bc83-5afb45170cf2",
    "created_at": "2023-01-12T15:08:22.876394Z",
    "updated_at": "2025-03-27T02:06:07.951532Z",
    "deleted_at": null,
    "sha1_hash": "c6a161938d3f41aff692deabba19de77848be5ba",
    "title": "2020-11-26 - Using similarity to expand context and map out threat campaigns",
    "authors": "",
    "file_creation_date": "2022-05-28T15:42:53Z",
    "file_modification_date": "2022-05-28T15:42:53Z",
    "file_size": 1520695,
    "plain_text": "# Using similarity to expand context and map out threat campaigns\n\n**[blog.virustotal.com/2020/11/using-similarity-to-expand-context-and.html](https://blog.virustotal.com/2020/11/using-similarity-to-expand-context-and.html)**\n\n**TL;DR: VirusTotal allows you to search for similar files according to different**\n**orthogonal notions (structure, visual layout, icons, execution behaviour, etc.). File**\n**similarity can be combined with the “have:” search modifier in order to gain more**\n**context about threats, e.g. what are the emails or URLs that distribute them.**\n\n_[This is the second blog post in our similarity series, the first article focused on how to trigger](https://blog.virustotal.com/2020/11/why-is-similarity-so-relevant-when.html)_\n_file similarity searches and the different similarity vectors at your disposal. In the context of_\n_[this series we have also done a webinar that can be viewed on-demand, it focuses on using](https://www.brighttalk.com/webcast/18282/452440?utm_source=Google+Cloud+Security&utm_medium=brighttalk&utm_campaign=452440)_\n_similarity to automatically produce optimal YARA rules to detect a given malware_\n_[framework/family/campaign via VTDIFF.](https://support.virustotal.com/hc/en-us/articles/360010904818-VTDIFF-Automatic-YARA-rules)_\n\nThis situation might sound familiar. As a SOC analyst or Incident Responder you are often\nconfronted with files you know nothing about. Your SIEM describes their internal sightings\nand actions but fails to transmit the bigger picture. You are constrained by the narrow\nvisibility of your corporate logs. Context is king and the problem is that you are fighting threat\nactors that operate globally with just a piece of the puzzle, your local data.\n\nWhat is this file? Who is behind it? What is their modus operandi? How did it get there? Are\nthere other related components? What does it do? Are there other variants that could have\nimpacted my organization in the past? Any that could impact us in the future? How do I\ncontain it? Your SIEM, case management system, EDR, firewall, IDS etc. don’t answer these\nquestions. You are missing a necessary layer in your defense-in-depth security strategy.\n\nVirusTotal is your saving grace. You jump into VT ENTERPRISE and look up the hash: threat\nreputation is useful, but you need further context. Your task is to identify IoCs that can be\nused for remediation, e.g. by blocking a command-and-control domain in the network\nperimeter, as well as artefacts that can be used for proactive threat hunting purposes, to\ndetermine whether there has been a breach and what is its scope. The issue is that\nsometimes VirusTotal does not have full context for a specific individual file in terms of\nsandbox reports, in-the-wild sightings, relationships, etc. and so your investigation might end\nhere.\n\n## How to do it better\n\nIsolated hashes are of limited value. Many times they are unique per victim or campaign, so\na better idea would be finding the cluster/family/campaign they belong to in order to unearth\nremediation IoCs and threat hunting patterns. Most importantly, you need to leverage those\n\n\n-----\n\ngroupings in order to surface command-and-control domains, dropzones, distribution URLs,\nphishing emails, etc. that can be used for mitigation and containment, and, to build proper\nunderstanding and situational awareness.\n\nSimilarity and the “have” search modifier to the rescue. Let’s imagine the initial hash that\n[popped up as an alert in our environment was a first stage EMOTET dropper, i.e. a](https://www.virustotal.com/gui/file/aa9631cdb98dbe55b81b029660a0589039561664b34f249207dc0d83e273a030/detection)\ndocument that delivers a malicious payload through macros.\n\nThreat reputation allows you to perform an immediate first assessment (alert triage), but\nother than that there is little context in terms of remediation IoCs and hunting artifacts. We\nstill know nothing about how this file gets distributed, i.e. its delivery vector. Similarly, we fully\nignore whether this is something spear phished exclusively against our organization or part\nof a larger campaign. What about the threat network infrastructure? Does it download\nadditional payloads? Does it communicate with a command-and-control?\n\nThe next step in an incident response engagement - and this is what most analysts fail to\n**do - is to jump into the file’s cluster (its family/framework/campaign) in order to expand**\ncontext and surface IoCs. This is just one click away:\n\n\n-----\n\nFor documents there is a limited number of approaches to find similar files (other file formats\nwill expose more), this said, they are very rich because they are fully orthogonal: structural\nfeatures, visual layout, local sensitive fuzzy hashing, execution behaviour similarity. Let’s\njump to other similar files based on the document’s visual layout by clicking on “Similar by\nicon/thumbnail” or on the thumbnail itself, located in the top right:\n[main_icon_dhash:23232b2b00010000.](https://www.virustotal.com/gui/search/main_icon_dhash%253A23232b2b00010000/files)\n\nThere are too many matches, we would have to iterate over every single one in order to\nsurface particular patterns that may allow us to understand the campaign.\n\n## Finding phishing emails that distribute the threat\n\nWe can narrow down the search above to match exclusively those files that have been seen\nas an attachment in some email uploaded to VirusTotal:\n\n[main_icon_dhash:23232b2b00010000 AND have:email_parents](https://www.virustotal.com/gui/search/main_icon_dhash%253A23232b2b00010000%2520AND%2520have%253Aemail_parents/files)\n\n(Note that you can also use tag:attachment instead of have:email_parents)\n\n[We can now run through the matching files, open up their Relations tab and jump into the](https://www.virustotal.com/gui/file/b269785cdb8cddfbeb1e29850757483c8b6c922351f2da8be01184b9bb4ce3cb/relations)\npertinent email parent, so as to understand the deception techniques being used in the\ncampaign:\n\n\n-----\n\nThis particular instance poses as some kind of World Health Organization report on COVID.\nIt is important to inspect all the other emails because not only will they tell us more about the\nlures, it will also allow us to identify targeted industries, geographical spread, activity time\nspans, etc. For instance, there could be other localized variants that could be targeting some\nother corporate branches. Access to these emails will not only give us greater insight into the\nattacker, it is also something we can leverage tactically in order to improve filtering in our\nemail gateways.\n\n## Discovering URLs that distribute this threat\n\nWe want to see if this campaign is also being distributed via download URLs. If that´s the\ncase we can block them in our network perimeter or use them to search across web proxy\nlogs. Let’s ask VirusTotal whether any of the files in the cluster have associated in-the-wild\nURLs:\n\n[main_icon_dhash:23232b2b00010000 AND have:itw](https://www.virustotal.com/gui/search/main_icon_dhash%253A23232b2b00010000%2520AND%2520have%253Aitw/files)\n\n[We can now jump into the Relations tab in order to export these additional IoCs:](https://www.virustotal.com/gui/file/c201dc04bed84411f216935bcad9296fdb3e99daa909ead17006846758dc8346/relations)\n\nThere are over 3K files with in-the-wild URLs, note that we can automate all of this via the\nAPI.\n\n\n-----\n\n## Identifying command-and-control/exfiltration infrastructure\n\nThe next step is to understand whether any of the machines in our corporate fleet are\nbeaconing out to infrastructure tied to this campaign. At the same time, we will probably want\nto block the CnC and exfiltration points in order to mitigate the impact of historical undetected\nbreaches. Let’s filter down the search to focus exclusively on those files that exhibited\nnetwork communications when executed in a dynamic analysis sandbox:\n\n[main_icon_dhash:23232b2b00010000 AND have:behaviour_network](https://www.virustotal.com/gui/search/main_icon_dhash%253A23232b2b00010000%2520AND%2520have%253Abehaviour_network)\n\nMost of the matching files have been analysed by several sandboxes participating in our\n[multi-sandbox effort. This gives us unparalleled visibility into the campaign. For an attacker it](https://blog.virustotal.com/search/label/multisandbox)\nis easy to evade a single sandbox, it is far more complex to do so for 17+ of them at the\nsame time. Each one of them set up in a different geographical region, going out to the\ninternet through a different IP address, running different OS versions, with different software\nand language packages installed, etc. As a result, we now have very interesting sightings in\nterms of infrastructure:\n\n\n-----\n\nThese communication points can be very easily triaged. Remember that VirusTotal also\n[characterizes domains, IP addresses and URLs. Threat reputation for these domains further](https://www.virustotal.com/gui/domain/morrobaydrugandgift.com/detection)\nconfirms that they are accurate IoCs:\n\nThe [domain relationships (in-the-wild sightings) tell the same story:](https://www.virustotal.com/gui/domain/morrobaydrugandgift.com/relations)\n\n\n-----\n\nWe now have additional IoCs that we can feed into our stack in order to proactively defend\nour organization from other variants. As a bonus point, pivoting to other campaign files that\nhave sandbox behaviour reports allows us to shed more light into other TTPs that we might\nbe tracking via MITRE ATT&CK (e.g. installation, actions on objectives, etc.).\n\n## Gaining context through the community\n\nFurthering on the use of the “have” search modifier, we can also leverage it to find files on\nwhich some VT Community user has placed a comment providing more context:\n\n[main_icon_dhash:23232b2b00010000 AND have:comments](https://www.virustotal.com/gui/search/main_icon_dhash%253A23232b2b00010000%2520AND%2520have%253Acomments)\n\nCommunity comments often give us interesting details in terms of in-the-wild observations,\nmalware capabilities, reverse engineering reports, attribution, etc. For example, in this\nparticular case we learn about additional distribution URLs:\n\n\n-----\n\n[This other case helps us understand that this first stage is EMOTET and allows us to jump](https://www.virustotal.com/gui/file/e22adb293242bbe12e653ae5f927e75dccbeffda728053fc11b830c8197aa330/community)\ninto a [pastebin dump with further context about the campaign in terms of related hashes and](https://pastebin.com/SgcKe9LK)\nnetwork infrastructure:\n\n## Additional context\n\nThe “have” modifier accepts many other values, some of the more representative ones are:\n\ncompressed_parents: the files were seen inside a compressed file uploaded to\nVirusTotal.\npcap_parents: the files were seen in a network traffic recording uploaded to VirusTotal.\nembedded_(urls/domains/ips): a URL/domain/IP address pattern was extracted from\nthe binary bodies of the files.\nbehaviour: the files managed to execute in at least one sandbox and produced the\npertinent dynamic analysis report.\nbehaviour_registry: the files executed in a sandbox and interacted with the Windows\nRegistry.\ncrowdsource_yara_rule: the files match some YARA rule coming from open source\ncommunity repositories, these rules often provide additional references and\ndescriptions about a threat.\n\n\n-----\n\n## Summing up\n\nVirusTotal aggregates orthogonal means to cluster together groups of related files. Files\nwhich may belong to the same malware family/framework/campaign/actor. These file\nsimilarity vectors range from structural features to dynamic analysis observations.\n\nWe started off with a single IoC for which we had little context, neither did VirusTotal, beyond\nbasic threat reputation. By leveraging file similarity we managed to find thousands of other\nfiles related to the campaign/malware framework. Through the “have” search modifier we\nthen narrowed down our searches to identify phishing emails used by the attackers,\ndistribution URLs, additional network infrastructure such as CnCs and context shared by\nother threat researchers.\n\nAll of this is tactical intelligence that can be fed into network perimeter defenses, but also\ncontext that can be operationalized and digested into TTPs in order to characterize threat\nactors. Finally, this blog post presented an incident response scenario but the very same\nlogic can be applied to threat actor tracking or campaign monitoring use cases.\n_[This post was authored by Emiliano Martinez.](https://twitter.com/zenitrame)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-26 - Using similarity to expand context and map out threat campaigns.pdf"
    ],
    "report_names": [
        "2020-11-26 - Using similarity to expand context and map out threat campaigns.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536102,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653752573,
    "ts_modification_date": 1653752573,
    "files": {
        "pdf": "https://archive.orkl.eu/c6a161938d3f41aff692deabba19de77848be5ba.pdf",
        "text": "https://archive.orkl.eu/c6a161938d3f41aff692deabba19de77848be5ba.txt",
        "img": "https://archive.orkl.eu/c6a161938d3f41aff692deabba19de77848be5ba.jpg"
    }
}