{
    "id": "cd3be87b-7c03-4323-ae78-c9e883670642",
    "created_at": "2023-01-12T14:59:31.012938Z",
    "updated_at": "2025-03-27T02:05:33.860307Z",
    "deleted_at": null,
    "sha1_hash": "674e7a399192b8e46a4db76e987a2f854290f4e8",
    "title": "2016-03-31 - The evolution of Brazilian Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:41:48Z",
    "file_modification_date": "2022-05-28T15:41:48Z",
    "file_size": 4945580,
    "plain_text": "# The evolution of Brazilian Malware\n\n**securelist.com/the-evolution-of-brazilian-malware/74325/**\n\nAuthors\n\n[Thiago Marques](https://securelist.com/author/thiagomarques/)\n\n## Introduction\n\nBrazilian malware continues to evolve day by day, making it increasingly sophisticated. If you\nwant to know how the various malicious programs work nowadays, you can jump to the\ncorresponding section here. Meanwhile, before that, we would like to show how the\ntechniques used by Brazilian cybercriminals have changed, becoming more advanced and\nincreasingly complex.\n\nTaking a look at the wider picture we can see that the authors are improving their techniques\nin order to increase malware lifetime as well as their profits.\n\nSome time ago, analyzing and detecting Brazilian malware was something that could be\ndone pretty fast due to no obfuscation, no anti-debugging technique, no encryption, plain-text\nonly communication, etc. The code itself used to be written in Delphi and Visual Basic 6, with\na lot of big images inside making it a huge file, as well as poor exception handling where the\nprocess would regularly crash\n\n\n-----\n\nNowadays, the scenario is not the same; the attackers are investing time and money to\ndevelop solutions where the malicious payload is completely hidden under a lot of\nobfuscation and code protection. They do still use Delphi and VB, but have also adopted\nother languages like .NET and the code quality is much better than before, making it clear to\nus that they have moved to a new level.\n\nLet’s walk through some samples showing the difference between what we used to find a few\nyears ago and the threats being delivered today.\n\n## What we used to find\n\n### Keylogger\n\nIn the beginning, the first samples used to steal banking information from customers were\nsimple keyloggers, most of them using code publicly available with some minor\ncustomizations in order to log only specific situations. At the time it was sufficient since\nbanking websites were not using any kind of protection against this threat.\n\n_Public keylogger source code_\n\n\n-----\n\n_Code implemented on malicious binary_\n\nThe code was pretty simple; it just used the function GetAsyncKeyState in order to check the\nstate of each key and then logged it as necessary. Most of the keyloggers were not using\nany obfuscation to hide the targets, helping in the identification of such attacks.\n\n_Plaintext strings used to detect navigation_\n\n### Phishing Trojan\n\n\n-----\n\nAfter the banks introduced virtual keyboard to their systems, the use of keyloggers was no\nlonger effective. To bypass these protections, the Brazilian bad guys started developing\nmouselogger malware and later Phishing Trojans.\n\nThis type of malware was using DDE (Dynamic Data Exchange) in order to get the current\nURL opened in the browser; this method still works nowadays, but most of these malicious\nprograms have updated their code to use OLE Automation instead of DDE because it\nprovides more advanced options.\n\n_Code using DDE to get URL information_\n\nAfter getting the current URL the malware just checks if the URL is in the target list. If found,\nthe malware would show a phishing screen asking for banking information.\n\n\n-----\n\n_Phishing Trojan being shown inside Internet Explorer_\n\nAt this time the malware was not using any kind of encryption or encoding – all strings were\nplaintext making the analysis easier.\n\n\n-----\n\n_Malware strings without any encryption/encoding_\n\nThe stolen information is then sent to the attacker by email.\n\n\n-----\n\n_Email containing the stolen information_\n\n### Hosts\n\nIn order to steal information without making it easy to identify a phishing Trojan they started\nredirecting users to malicious web pages by changing the hosts file to resolve the banking\ndomain names to hardcoded servers. In this way, after infection it would be more transparent\nto the user increasing the chances of a successful attack.\n\n_Data written to the hosts file in order to redirect access_\n\n\n-----\n\n_Code used to write data to host file_\n\nThese types of attack were very effective at the time, while not all anti-malware vendors were\nable to identify and block them. We can still see some samples using host modifications, but\nthey are not so effective anymore.\n\n### Anti-rootkit\n\nAt this stage they realized that anti-malware solutions and internet banking security plugins\nwere making their work more difficult. They then started to focus their efforts on removing\nsecurity solutions before running the malicious payload in order to increase the chances of a\nsuccessful execution and to keep running on the infected machine for much longer.\n\nNothing could be better than using well known command line tools that already have this\ncapability –and most of them are already allowlisted.\n\nRegRun Partizan\n\nThis tool is a Native Executable which runs on system startup before the Win32 subsystem\nstarts up. It is able to delete files and registry keys even if they are protected by Kernel mode\ndrivers, since it is executed before the drivers are loaded to the system. The commands to\nbe executed are specified on the .RRI file as shown below.\n\n\n-----\n\n_Partizan RRI script containing the list of files to remove_\n\nThe Avenger\n\nA Windows driver designed to remove persistent files and registry keys. The commands to\nbe executed on the system are written to a script that will be read by the driver once it starts.\n\n\n-----\n\n_The Avenger GUI and script to delete security solutions_\n\nGmer\n\nGmer is a well-known rootkit detector and remover with lots of functions to detect rootkit\nactivities on the system as well as delete files by using its own device driver. As it has a\ncommand-line interface, it is easy to remove protected files.\n\n\n-----\n\n_BAT file using GMER s killfile function to remove security solution_\n\nMore details about banking Trojans using GMER to uninstall security software can be found\n[in a separate blogpost.](https://securelist.com/friendly-fire/30568/)\n\n### Malicious Bootloader\n\nAfter using anti-rootkits Brazil’s cybercriminals went deeper and started to develop their own\n[bootloaders, tailored exclusively to remove the security solutions from user’s machine. The](https://securelist.com/malicious-boot-loaders/31798/)\ndownloader is in charge of installing the malicious files and then rebooting the machine. After\nreboot the malicious bootloader can remove the desired files from the system.\n\nBasically, the malware replaces the original NTLDR, the bootloader for Windows NT-based\nsystems up to Windows XP, to a modified version of GRUB.\n\n_Modified GRUB loader acting as NTLDR_\n\nThis loader will read the menu.lst file that points to the malicious files already installed on the\nsystem xp-msantivirus and xp-msclean.\n\n_Menu.lst file containing the parameters to execute malicious commands_\n\nWhen executed the malware will remove files related to security solutions and then restore\nthe original NTLDR files that were previously renamed to NTLDR.old.\n\n\n-----\n\n_Commands executed to remove security modules and restore the original NTLDR_\n\n## What we have nowadays\n\n### Automation\n\nMost banks were using machine identification to prevent unauthorized attempts to perform\noperations using the stolen information. To bypass this the bad guys started performing the\nmalicious operations from the infected machine, by using Internet Explorer Automation\n(formerly OLE automation) to interact with the page content.\n\nThe first samples using this type of attack were Browser Helper Objects (BHOs) that could\ndetect a transfer transaction and then change the destination account, sending the money to\nthe attacker instead of the real destination.\n\n[Later, the same method was heavily used in Boleto attacks, where they were using](https://securelist.com/attacks-against-boletos/66591/)\nautomation to get the inputted barcode and then replace it with the fraudulent one.\n\nSince this method only works for Internet Explorer, the malware needs to force the user to\naccess internet banking via that browser. Therefore, it implements a timer which checks if\nFirefox or Chrome is being used and then kills the process.\n\n\n-----\n\n_Code to avoid use of Chrome and Firefox_\n\nWhen an instance of IE is found, the malware will search for a tab instance in order to be\nable to read the window text and then to know which URL is being accessed.\n\n\n-----\n\n-----\n\n_Finding the tab handle and obtaining the URL being accessed_\n\n_Search for target’s specific titles_\n\nAs the automation will process the page structure, it needs to know if the victim is on the\npage to input the Boleto information. It installs a handle to the event OnDocumentComplete\nin order to collect the full URL as soon as it is loaded and then checks if the user is on the\ntarget page.\n\n_Search for target’s specific pages_\n\n\n-----\n\nAfter confirming that the user is on the target page, the malware will process the page\nstructure and install a handler to the submit button, then it can take control of the execution\nright after the user has submitted the page and then process the inputted content.\n\n\n-----\n\n-----\n\n_Search for a specific textbox and get the inputted data_\n\nAfter collecting the inputted data, it can be processed and then changed to the malicious\ncontent before submitting the page.\n\nFor those samples we could find, string obfuscation, debugger detection and virtual machine\ndetection as well as this method mean they are not as easy to detect as other attacks\ninvolving phishing Trojans and hosts.\n\n### Code Obfuscation and RunPE\n\nLooking for new ways to bypass detection, Brazilian criminals started using obfuscation in\norder to hide the parts of code that perform their main operations.\n\nIn the code below the coder has encrypted the original code of the function used to download\nthe malicious payload; on a static analysis you cannot figure out what the purpose of this\nfunction is.\n\n_Encrypted downloader function_\n\nIn runtime the malware will call the function to decrypt this code prior to executing it.\n\n\n-----\n\n_Decrypt code call_\n\n_Decryption routine_\n\nAs we can see in the code above, the decryption is a simple sub operation using the key\n0x42 on the encrypted byte – a simple and fast way to hide parts of code.\n\n_Decrypted downloader function_\n\n\n-----\n\nIn order to avoid detection by a network firewall, the downloaded file is encrypted using its\nown encryption function.\n\n_Encrypted file_\n\n_Decrypted file_\n\nThe encryption function is also hidden by using the same method used in the download\nfunction – after decrypting the code we can find a XOR-based encryption combined with a\nshift-right operation on the XOR key.\n\n\n-----\n\nAfter decrypting the file, it will not be executed using the normal methods usually found in\nmalicious code. To hide the process on the machine the malware uses a trick known as\nRunPE where the code will execute a clean process (like iexplorer.exe or explorer.exe) in a\nsuspended state and then modify its memory content to the malicious code and execute.\n\n_Code launching clean process as suspended state_\n\nAfter creating the process in a suspended state the code will write the new code to the\nmemory space, set the new EIP for execution and then resume the thread.\n\n_Writing malicious code and resuming the thread_\n\n\n-----\n\n_Internet explorer process hosting the malicious file_\n\nSince the malicious code is running on the memory space allocated to Internet Explorer,\nusing tools like Process Explorer to verify the publisher signature does not work because\nthey check the signature of the process on the disk.\n\nIt was clear that they had moved on completely from using beginner’s code to a much more\nprofessional development and we realized it was time to update the analysis process for\nBrazilian malware. We are sure most of this evolution happened due to contact and the\nexchange of knowledge with other malware scenes, mostly those in Eastern Europe, which\n[we described in this article.](https://securelist.com/beaches-carnivals-and-cybercrime-a-look-inside-the-brazilian-underground/72652/)\n\n### AutoIt Crypto\n\n\n-----\n\nAutoIt is now often used as a downloader and crypto for the final payload in order to bypass\ndetection. After being compiled the AutoIt script is encrypted and embedded to the generated\nbinary which makes it necessary to extract the original script before analyzing its code.\n\nLooking for a better way to hide the final payload, the Brazilian cybercriminals have\ndeveloped a new crypto using AutoIt language where the decrypted payload is executed by\nusing a RunPE technique.\n\n_AutoIt Crypto execution flow_\n\nThe crypto uses two different methods to store the encrypted file: the first one is by using the\nFileInstall function that already exists on AutoIt, and the other one is embedding the file at\nthe end of the binary.\n\nWhen using the second method the crypto writes a key which is used to mark where the\nencrypted payload content starts and is then able to find the content to decrypt. On the\nsample below, the key used is a short version of “Sei que ganharei 20K” which means “I\nknow that I will win R$ 20,000”.\n\n\n-----\n\n_Key used to mark where the encrypted payload starts_\n\n_AutoIt Crypto main code_\n\nAfter reading the encrypted payload it decrypts the content using the decryption key\n“VENCIVINICI” and then executes the malicious payload using RunPE.\n\nThe decryption function code is not written in AutoIt – it is written in C language. After being\ncompiled the bytes are included in the code as a string and then mapped to memory and\nexecuted by using CallWindowProc API.\n\n_Decryption function implementation_\n\nWe found the following algorithms being implemented as the encryption/compression\nmethod for this crypto:\n\nRC4\nXXTEA\nAES\nLZMA\nZLIB\n\nThe use of AutoIt for malware development is not something new, but in the middle of 2014\nwe saw a wave of attacks using AutoIt in Brazil, as we can see on the graph below.\n\n\n-----\n\n_Trojan.Win32.Autoit: number of users attacked in Brazil_\n\n### MSIL Database\n\nAnother type of malware that emerged recently was malware developed in .NET instead of\n[Visual Basic 6.0 and Delphi, following a trend we saw worldwide. It is not hard to find a](https://securelist.com/the-rise-of-net-and-powershell-malware/72417/)\ndownloader written in .NET. Anyway, some samples of Trojan-Banker.MSIL.Lanima grabbed\nour attention when we found some of them were not using functions commonly used to\ndownload the payload.\n\n\n-----\n\n_Download function_\n\nAs we can see in the picture above this samples does not use any download function\nbecause it uses SQL Server to host the binary content and then just uses an SQL command\nto retrieve the content and save to disk.\n\nThe strings are encoded with base64 and encrypted with Triple DES algorithm in order to\nhide the text related to the main actions of the malware.\n\n\n-----\n\n_Decrypt function_\n\nThis family of malware is very prevalent in Brazil and China:\n\n### MSIL Crypto\n\nFollowing the same method used by AutoIt Crypto the bad guys developed another crypto,\nthis time using .NET language. The process to extract the real executable is almost the same\nas AutoIt Crypto but it has an intermediate module which is responsible for extracting the\n\n\n-----\n\nfinal payload.\n\nLooking at the main module we have a .NET code and the main function of this main module\nis to extract and load the embedded DLL.\n\n_.NET Crypto execution flow_\n\n_Crypto main function_\n\nAs we can see, the function above will split the binary content by using the separator string\n“cdpapxalZZZsssAAA” and use the second block which contains the encrypted code of the\nLoader DLL.\n\n\n-----\n\n_Loader DLL encrypted content_\n\nThen it is time to decrypt it by calling the function named “fantasma” (or “ghost” in English),\nthe official name used for this crypto in the forums is PolyRevDecrypt which is basically an\nXOR operation between the encrypted byte, the last byte of the encrypted buffer and one\nbyte of the password provided to the function.\n\n_Decryption function_\n\n\n-----\n\nAfter being decrypted, the code will be loaded and executed by the function docinho (or\n“candy” in English).\n\n_Function to load and execute the DLL_\n\nThe code of the library is almost the same as the main executable except that now it will use\nthe second block of the split content.\n\n_Loader DLL main function_\n\n### RAT\n\nIn a bid to reduce the losses related to cyber attacks, banks implemented two-factor\nauthentication using a hardware token and SMS token for online banking transactions in\naddition to the solutions already in place like machine identification. To solve this problem the\ncybercriminals have created a remote administration tool specially developed to request the\ninformation required to process internet banking transactions.\n\n\n-----\n\n_RAT execution flow_\n\nThe browser watcher will monitor the user browser and see if any of the target banks are\naccessed; if they are, it will decompress and execute the RAT Client and notify the C&C\nabout the new infection.\n\n\n-----\n\n_Internet banking access monitoring_\n\nThe strings used by this malware are encrypted using their own encryption routine. After\ndecrypting it we are able to identify the targets as well as the important parts of the code.\n\n_Decrypted strings_\n\nFor this type of infection it is common for the bad guys to create a way to manage the\nattacks. Here we can see the number of computers infected on the same day, keeping in\nmind that this number means the amount of users that have accessed internet banking while\nthe malware was running on their computer.\n\n\n-----\n\n_C&C panel showing the list of infected users_\n\nThe RAT Client will connect to the server to alert the attacker that a new victim is accessing\nthe internet banking system. It is then possible to execute the attack in real time.\n\n\n-----\n\n_RAT Server showing a new victim is connected_\n\nAt this stage the attacker just needs to wait for the user to login and then proceed with the\nattack. When the user is already logged in, the attacker can see the user screen, lock it and\ncontrol the execution as well as ask for specific information that will help him to steal the\naccount, like:\n\nToken\nAccess card code\nDate of birth\nAccount password\nInternet banking password\nElectronic signature\n\nTo prevent the user from seeing that the computer is being remotely controlled, this RAT has\na function that simulates an update for the bank security plugin showing a progress bar and\ndisabling all user interactions. Meanwhile, the attacker can perform the banking operations\nby using the active browser section because the overlay screen is not shown to the attacker.\n\n_Lock screen simulating an update_\n\n\n-----\n\nIf some information is requested to confirm the transaction, e.g. SMS token, the attacker can\nask the victim who will think the information is necessary in order to proceed with the update\nprocess.\n\n_Screen asking for token code_\n\nAs soon as the user provides the information, the attacker can enter it on the internet\nbanking screen, bypassing the 2FA used in the transaction.\n\n_Information received from the victim_\n\n\n-----\n\n### Ransomware\n\nBrazilian cybercriminals not only work with banking malware – they are also exploring other\n[types of attacks involving ransomware. Some years ago, we found TorLocker which contains](https://securelist.com/a-flawed-ransomware-encryptor/69481/)\ndetails inside the malware code suggesting that the developer is from Brazil.\n\n_Code containing some strings suggesting the author is from Brazil_\n\nAs we can see in the image above, we found the sentence highlighted in blue: “Filho de\nUmbanda não cai!” (“Umbanda’s son never falls down”). Umbanda is an unorthodox religion\nin Brazil. The name marked in red is the nickname of the author and it also uses the\nextension .d74 for the encrypted files. This user is very active on underground forums\nlooking for malicious services in Brazil.\n\nWe also found other references, like the use of a service in Brazil to get the victim IP in order\nto notify about an infection.\n\n_Request to a Brazilian service to obtain the victim IP_\n\n\n-----\n\nSome months ago, we found another ransomware program based on the Hidden Tear\nsource code that was modified to target Brazilian users, differing from the initial program that\nwas found targeting English- and Japanese-speaking users.\n\n_Victim’s machine showing messages in Portuguese, asking to pay in order to receive the files_\n\n## Why they evolve\n\nWe have sufficient evidence that Brazilian criminals are cooperating with the Eastern\nEuropean gangs involved with ZeuS, SpyEye and other malware created in the region. This\ncollaboration directly affects the quality and threat level of local Brazilian malware, as its\nauthors are adding new techniques to their creations and getting inspiration to copy some of\nthe features used in the malware originating from Eastern Europe. Brazilian cybercriminals\nare not only developing the quality of their code but also using the cybercrime infrastructure\nfrom abroad.\n\nWe saw the first sign of this ‘partnership’ in the development of malware using malicious PAC\nscripts. This technique was heavily exploited by Brazilian malware starting in 2011 and was\n[later adopted by Russian banking Trojan Capper. This cooperation continued as Brazilian](https://securelist.ru/tochechnyj-banker/22068/)\ncriminals started to use the infrastructure of banking Trojans from Eastern Europe – the\n**Trojan-Downloader.Win32.Crishi was the first to use DGA domains hosted at bulletproof**\n[companies from Ukraine. Also the Boleto malware adopted the massive usage of fast flux](https://securelist.com/attacks-against-boletos/66591/)\ndomains, aiming to avoid the takedown of C2s – we saw that with the “bagaça” (bagasse in\nPortuguese) domains, registered using anonymous services, which hosted crimeware and\nboleto stuff and was resolving different IPs for every request.\n\n\n-----\n\n_The “bagaça” domains: fast flux and bulletproof from Eastern Europe_\n\nOther strong signs of their cooperation are the constant presence of Brazilian cybercriminals\non Russian or Eastern European underground forums. It’s not unusual to find Brazilian\ncriminals on Russian underground forums looking for samples, buying new crimeware and\nATM/PoS malware, or negotiating and offering their services. The results of this cooperation\ncan be seen in the development of new techniques adopted in Brazilian malware.\n\n\n-----\n\n_The Brazilian malicious author of TorLocker negotiating in a Russian underground forum_\n\nThese facts show how Brazilian cybercriminals are adopting new techniques as a result of\ncollaboration with their European counterparts. We believe this is only the tip of the iceberg,\nas this kind of exchange tends to increase over the years as Brazilian crime develops and\nlooks for new ways to attack businesses and regular people.\n\n## Conclusion\n\nCybercrime in Brazil has changed drastically in the last few years, as it shifted from simple\nkeyloggers built from public source code to tailored remote administration tools that can run\na complete attack by using the victim machine.\n\nMalware that used to show a phishing screen as soon as it was executed is now completely\nreactive and waits for a valid session in order to start the job.\n\nThat means that the criminals are investing much more money and time in order to develop\ntheir malicious code, enhancing anti-debugging techniques and then running the malware\nundetected for much longer.\n\n\n-----\n\nAs we know, they are in touch with cybercriminals from Eastern Europe, mainly Russians,\nwhere they exchange information, malware source code and services that will be used in\nBrazilian attacks. We can see that many of the attacks used in Brazil were first seen in\nRussian malware as well as Brazilian techniques later being used in Russian attacks.\n\nBased on that, we can expect to find Brazilian malware with enhanced code obfuscations,\nanti-debugging tricks, encryption algorithms and secure communications making our work\nmuch harder than now.\n\n[Brazil](https://securelist.com/tag/brazil/)\n[Cryptocurrencies](https://securelist.com/tag/cryptocurrencies/)\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Internet Banking](https://securelist.com/tag/internet-banking/)\n[Keyloggers](https://securelist.com/tag/keyloggers/)\n[Malware](https://securelist.com/tag/malware/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Obfuscation](https://securelist.com/tag/obfuscation/)\n[Phishing](https://securelist.com/tag/phishing/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[RAT Trojan](https://securelist.com/tag/rat-trojan/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\n[Thiago Marques](https://securelist.com/author/thiagomarques/)\n\nThe evolution of Brazilian Malware\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-03-31 - The evolution of Brazilian Malware.pdf"
    ],
    "report_names": [
        "2016-03-31 - The evolution of Brazilian Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535571,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653752508,
    "ts_modification_date": 1653752508,
    "files": {
        "pdf": "https://archive.orkl.eu/674e7a399192b8e46a4db76e987a2f854290f4e8.pdf",
        "text": "https://archive.orkl.eu/674e7a399192b8e46a4db76e987a2f854290f4e8.txt",
        "img": "https://archive.orkl.eu/674e7a399192b8e46a4db76e987a2f854290f4e8.jpg"
    }
}