{
    "id": "cd5eb9f2-a7ec-470a-8554-3aa30bc2d8b2",
    "created_at": "2023-01-12T15:01:07.037311Z",
    "updated_at": "2025-03-27T02:09:07.271204Z",
    "deleted_at": null,
    "sha1_hash": "f8e70684e9c433f03fb59dadb41a65be27c57551",
    "title": "2019-07-22 - Who is Mr Zeng-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:23:30Z",
    "file_modification_date": "2022-05-28T03:23:30Z",
    "file_size": 1689153,
    "plain_text": "# Who is Mr Zeng?\n\n**[intrusiontruth.wordpress.com/2019/07/22/who-is-mr-zeng/](https://intrusiontruth.wordpress.com/2019/07/22/who-is-mr-zeng/)**\n\nintrusiontruth July 22, 2019\n\nIn previous articles we identified Jinan Quanxin Fangyuan Technology Co. Ltd. (济南全欣方\n沅科技有限公司), Jinan Anchuang Information Technology Co. Ltd. (济南安创信息科技有限公\n司) and Jinan Fanglang Information Technology Co. Ltd. (济南方朗信息科技有限公司) as\ncompanies associated with Guo Lin (郭林), a [likely MSS Officer in Jinan. We also identified](https://intrusiontruth.wordpress.com/2019/07/17/who-is-mr-guo/)\nan IT Security expert from Jinan, Wang Qingwei (王庆卫), as the representative of the Jinan\nFanglang company. Another, potentially separate, individual goes by the name ‘iamjx’.\n\nThe identification of further individual in Jinan requires us to follow the trail from what we\nbelieve to be a fourth front company.\n\n**RealSOI Computer Network Technology Company**\n\nA different analyst providing information to this blog identified RealSOI Computer Network\nTechnology Company (瑞索计算机网络科技有限公司) as a company closely related to Jinan\nQuanxin, Jinan Anchuang and Jinan Fanglang. Our team spent some time researching links\nbetween the companies and identifying staff linked to RealSOI who were associated with\nhacking activity.\n\nInformation in open source on RealSOI is limited, but Chinese recruitment websites indicate\nthat RealSOI operates from 66, Shanda South Road, Lixia District, Jinan. Our analysts also\n[identified a website (realsoi[.]com) archived on archive.org, showing the company claiming to](https://web.archive.org/web/20161005032410/http://realsoi.com/)\noffer research in areas such as Computer Criminal Forensics, High-Performance Computing\nand Social Operating Systems\n\n\n-----\n\nArchived copy of realsoi[.]comenvymask\n[Our open source investigation identified a single PGP key associated with the realsoi[.]com](https://peegeepee.com/FD268635FB67C652DD3EADB3030EC96FE5088847)\ndomain in the name ‘envymask’.\n\nPGP key associated with envymask and RealSOI\nenvymask is a well-known member of Chinese hacking circles and is a member of the\n[ph4nt0m group. In this post, using e-mail account 13[at]21cn.com, he promotes the](https://blog.csdn.net/freexploit/article/details/153210)\n20cn[.]org security group for discussion of hacking topics in China. He appears to have a\nsenior role within the group as joint author of the post with ‘PsKey’.\n\n\n-----\n\nenvymask and PsKey on CSDN\n[envymask had his own website back in 2002, a copy of which was captured by archive.org.](http://envymask.3322.org/)\nHe doesn’t give his name on the site, but he does give some of his biographical background,\nincluding a date of birth in 1980 in Sichuan province and details of studies at the Nanjing\nScience and Engineering University in 1999. Nanjing, of course, is where likely MSS Officer\nGuo Lin studied, and from where he published his IT Security paper, detailed in an earlier\narticle.\n\nenvymask’s biography on his personal website\n**Zeng Xiaoyong (曾小勇)**\n\nAs you’ve no doubt guessed, envymask has a real name. He is Zeng Xiaoyong (曾小\n勇). According to information provided to us by a source with access to information in China,\nZeng Xiaoyong was born on 22 November 1980 and worked at RealSOI in the mid-2000s.\n\n**MS08-067**\n\n\n-----\n\nenvymask isn t just any mediocre Chinese hacker. In this [online post, in which he also uses](https://www.e365.info/?p=11523)\nthe name ‘EMM’, he claims to be the author of the MS08-067 exploit for Chinese operating\nsystems. Presumably this means he ported it to the Chinese version of Windows. The\ngeneric version of MS08-067 is a well-known exploit used in multiple attacks including the\nConficker worm.\n\nenvymask, EMM, as author of MS08-067\n**So, does Zeng Xiaoyong know Wang Qingwei?**\n\nThe answer to that is yes. The images below are from a training plan associated with Jinan\nFanglang. Those with a keen eye will spot that ‘EMM’, listed as responsible for the MS08067 exploit, is one of the trainers. Who else is listed on the course as a trainer? ‘Phoenix’,\nwhich you will remember was a name used by Wang Qingwei when recruiting for Jinan\nFanglang.\n\n\n-----\n\nJinan Fanglang training plan showing ‘EMM’ and ‘phoenix’ as trainers\n**The Phreaker (耗子)**\n\nThe second trainer listed at the end of the training document, between EMM and Pheonix, is\n耗子 (Haozi). 耗子 translates literally into English as ‘rat’ or ‘mouse’, but you will recognise\nthe format of the name from the ‘reservoir dogs’ [QQ names used in the Antorsoft group. 耗 is](https://intrusiontruth.wordpress.com/2019/07/17/who-is-mr-guo/)\nChinese for ‘consumption’ and 耗子 is used as a shortened version of ‘电话耗子’ (telephone\nmouse). The English translation is ‘phreaker’, a form of hacker in the 1980s that found ways\nto use dial up connections for free, effectively stealing telephone company resources.\n\n\n-----\n\nExplanation of ‘phreaker’ in Chinese telecommunications textbook\n**In summary, Zeng Xiaoyong, a well-known Chinese hacker using the handles**\n**‘envymask’ and ‘EMM’ worked for RealSOI. RealSOI was closely associated with the**\n**MSS front companies identified in previous articles and Zeng knew Wang Qingwei,**\n**having worked as an InfoSec trainer with him.**\n\n**#youknowwherethisleads**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-22 - Who is Mr Zeng-.pdf"
    ],
    "report_names": [
        "2019-07-22 - Who is Mr Zeng-.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535667,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1653708210,
    "ts_modification_date": 1653708210,
    "files": {
        "pdf": "https://archive.orkl.eu/f8e70684e9c433f03fb59dadb41a65be27c57551.pdf",
        "text": "https://archive.orkl.eu/f8e70684e9c433f03fb59dadb41a65be27c57551.txt",
        "img": "https://archive.orkl.eu/f8e70684e9c433f03fb59dadb41a65be27c57551.jpg"
    }
}