{
    "id": "cd5e9ac8-8594-4963-9667-dddbce44dcb2",
    "created_at": "2022-10-25T16:48:24.247067Z",
    "updated_at": "2025-03-27T02:17:05.515592Z",
    "deleted_at": null,
    "sha1_hash": "362dc8dce2e5f54302893c8245f5d74ac05de4a4",
    "title": "Dark Covenant: Connections Between the Russian State and Criminal Actors",
    "authors": "",
    "file_creation_date": "2021-09-08T19:26:11Z",
    "file_modification_date": "2021-09-08T19:28:37Z",
    "file_size": 2268354,
    "plain_text": "#### CYBER\n\n THREAT\n\n ANALYSIS By Insikt Group®\n\n**RUSSIA**\n\nSeptember 9, 2021\n\n# Dark Covenant: Connections Between the Russian\n\n\n-----\n\n##### Key Judgments\n\n                                            - Based on historical activity, it is highly likely\n\nthat Russian intelligence services and law\nenforcement have a longstanding, tacit\nunderstanding with criminal threat actors;\nin some cases, it is almost certain that the\nintelligence services maintain an established\nand systematic relationship with criminal threat\n\n_This report examines the unspoken connections between the_ actors, either through association or recruitment.\n_Russian Federation (in the form of Russian intelligence services or the_\n_Kremlin) and cybercriminals in Russia and Eastern Europe. Sources_            - Precedent suggests that such activities and\n_include the Recorded Future® Platform as well as other dark web and_ associations will almost certainly continue for the\n_open sources. The report will be of interest to threat researchers, as well_\n_as law enforcement, government, and defense organizations._ foreseeable future; however, these associations\n\nwill likely adapt to provide greater plausible\ndeniability and fewer overt, direct links between\n\n##### Executive Summary\n\nboth groups.\n\n​The intersection of individuals in the Russian\n\n                                     - The open assertion made by US President Joe\n\ncybercriminal world and officials in the Russian\n\nBiden that Russian cybercriminals are protected\n\ngovernment, typically from the domestic law enforcement\n\nby the Russian government has placed Russian\n\nor intelligence services, is well established yet highly\n\nPresident Vladimir Putin on the defensive,\n\ndiffuse. The relationships in this ecosystem are based\n\nforcing Russian domestic law enforcement to\n\non spoken and unspoken agreements and comprise fluid\n\ndemonstrate that they are cracking down on\n\nassociations.\n\nransomware operators.\n\nRecorded Future identified 3 types of links between            - Following the disappearance of ransomware\nthe Russian intelligence services and the Russian operators like REvil, we see other groups\ncriminal underground based on historical activity and emerging in their stead and publicly committing\nassociations, as well as recent ransomware attacks: to reforming their operations, including the\ndirect links, indirect affiliations, and tacit agreement. refusal to attack critical infrastructure targets,\n\nwhich may be seen as a preliminary sign that the\n\nEven in cases with discernible, direct links between\n\nBiden administration’s ultimatum to Russia has\n\ncybercriminal threat actors and the Russian state,\n\nbeen successful, but it is still too early to gauge\n\nindirect affiliations suggest collaboration, and a lack of\n\nhow great its long-term effect will be.\n\nmeaningful punitive actions shows either a tolerance for,\nor tacit approval of, these efforts. This assessment takes           - If the Biden administration can persuade the\ninto account that the Russian government possesses Kremlin that bringing cybercriminal activity under\na robust surveillance apparatus and interfaces with some form of control is in their best interest — by\ncybercriminal elements and therefore has visibility into, granting sanctions relief, increased collaboration,\nif not control over, many of the resources used by these or economic agreements — these immediate\nthreat actors and can shut them down if they so desire. reforms may be substantive and long-lasting.\n\n\n-----\n\n### Table of Contents\n\n##### Executive Summary ................................................................................................................. 1\n\n Key Judgments ....................................................................................................................... 1\n\n Background ............................................................................................................................ 3\n###### Methodology .............................................................................................................................. 3\n\n##### Threat Analysis ...................................................................................................................... 4\n###### Direct Links ................................................................................................................................ 4 Dmitry Dokuchaev .............................................................................................................. 4 Konstantin Kozlovsky ......................................................................................................... 5 Maksim Yakubets and Evil Corp ......................................................................................... 5 Pavel Vrublevsky ............................................................................................................... 6 Roman Seleznev ................................................................................................................ 6 Alexey Stroganov ............................................................................................................... 7\n\n Indirect Affiliations .................................................................................................................... 8 Evgeny Nikulin ................................................................................................................... 9 Pyotr Levashov ................................................................................................................. 10 Evgeniy Bogachev ............................................................................................................. 11 BLACKENERGY ................................................................................................................. 12 Alexander Vinnik .............................................................................................................. 13\n\n Tacit Agreement ....................................................................................................................... 13 Malware That Looks Like Ransomware  13\n\n##### Outlook ................................................................................................................................. 15\n\n Appendix A: Additional Information on Direct and Indirect Links ........................................... 16\n\n###### Dmitry Dokuchaev .................................................................................................................... 16 Konstantin Kozlovsky ............................................................................................................... 17 Pavel Vrublevsky ...................................................................................................................... 18 Roman Seleznev ....................................................................................................................... 18 Alexey Stroganov ..................................................................................................................... 18 Evgeny Nikulin .......................................................................................................................... 19 Pyotr Levashov ......................................................................................................................... 19 Evgeniy Bogachev .................................................................................................................... 20\n\n##### Appendix B: Additional Sources ............................................................................................ 21\n\n\n-----\n\n##### Background\n\nThe Russian intelligence services’ recruitment of highly\nskilled computer programmers, network specialists, and other\ntechnologically savvy personnel dates back to at least the 1990s\nand has even been reported in open-source publications like the\nRussian-language magazine “Hacker”.[1] In one example from this\npublication in February 2002, an individual identified as “UFO”\n(ufobject@mail[.]ru) claimed that following his arrest for writing\nmalware called “Dragon”, which would enable any user to harvest\npasswords, he was approached by an individual with links to\nthe Russian special services called “Sidorov”. Sidorov claimed to\nhave seen an expert examination of his case and was impressed\nwith UFO’s work. At a meeting in a Moscow restaurant, Sidorov\ntold UFO that he needed an employee like UFO to search for\nvulnerabilities — work for which he would be well-compensated\n— and UFO accepted the position.\n\nSuch recruitment efforts continued through the 2010s. In his\n[2019 book “Intrusion: A Brief History of Russian Hackers”, Daniil](https://www.worldcat.org/title/vtorenie-kratkaja-istorija-russkich-chakerov/oclc/1125189608)\nTurovsky quoted an unnamed Russian hacker who provided an\naccount of the associations between the criminal underground\nand the Russian intelligence services. According[2] to the hacker,\nthe Center for Information Security at the Russian Federal Security\nService (CIB FSB) had limited technical staff, so it often brought\nin outside specialists, reportedly going so far as to hide some\n[hackers in safe houses. On December 12, 2019, a Meduza report](https://meduza.io/en/feature/2019/12/12/the-fsb-s-personal-hackers)\nappeared to corroborate this account, suggesting that the FSB\nhad been engaging in hacker recruitment efforts since at least\nthe 1990s. The article also quoted an FSB officer as suggesting\nthat as soon as hackers achieve a certain level of success they\nare targeted for recruitment. According to Meduza, “In [the FSB\nofficer’s] words, as soon as “the first technical college student\nfrom a humble background brought a Ferrari out onto the streets\nof Moscow”, FSB agents started recruiting — both getting the\ncybercrime business under control and making it their own”.\nIn the early 2010s, in a conversation with a Recorded Future\nsource, Sergei Mikhailov, who served as deputy head of the CIB\nFSB, confirmed that the FSB had visibility into some Russianlanguage criminal forums, though he claimed that they did not\nhave their own operatives directly on the forums, instead relying\non confidential informants. Mikhailov also stated that at the time,\nthe FSB did not have enough technical experts and frequently\nworked with the Ministry of Internal Affairs’ (MVD) Department K.\n\nAndrei Soldatov, a Russian investigative journalist and coauthor of “The Red Web”, a book about the Kremlin’s online\nactivities, [said that while the Russian government’s tactic of](https://www.buzzfeednews.com/article/sheerafrenkel/inside-the-hunt-for-russias-hackers)\n\n1 The following contains a PDF: http[:]//web.archive[.]org/web/20210720233033/\nhttps[:]//xakep[.]ru/pdf/xa/038/\n\n2 http[:]//web.archive[.]org/web/20210720234233/https[:]//www.rulit[.]me/books/\nvtorzhenie-kratkaya-istoriya-russkih-hakerov-read-586355-49.html\n\n\noutsourcing cyber operations to various groups helps distance\nthemselves (and ultimately provides deniability), it also left them\nvulnerable to hackers running amok. In response to this, the\nRussian government engaged in limited cooperative agreements\nwith foreign governments, like the US, to keep cybercrime under\ncontrol. Russian and American federal law enforcement agencies\nmaintained cooperative engagements in online crime during the\n2000s via bilateral meetings and shared investigations. However,\nby the mid-2010s, such collaborative efforts were curtailed\ndue to a lack of confidence from American law enforcement in\nRussian agents’ abilities to execute their missions. [According](https://www.buzzfeednews.com/article/sheerafrenkel/inside-the-hunt-for-russias-hackers)\nto former chief technology officer of the US Federal Bureau of\nInvestigation’s (FBI) cyber division Milan Patel, “We would tip\nthem off about a person we were looking for, and they would\nmysteriously disappear, only to appear later on working for\nthe Russian government. We basically helped the FSB identify\ntalent and recruit by telling them who we were after”. In another\nconversation with the Recorded Future source, Mikhailov opined\nthat there were still quite a few “cold warriors” in the Kremlin\nwho did not approve of the FSB’s collaboration with US law\nenforcement and he was not at all certain that it would continue\nfor much longer. His words appear to have been prescient.\n\n###### Methodology\n\nBased on an understanding of this historical context and\nconsidering the current cybercriminal and Russian government\nlandscape, Recorded Future has classified the activity observed\nin this ecosystem into 3 major categories:\n\n  - Direct associations are identified by precise links\n\nbetween state institutions and criminal underground\noperators; an example of this is Dmitry Dokuchaev, a\nmajor in the Russian Federal Security Service who was\nrecruited after working as a cybercriminal.\n\n  - Indirect affiliations occur in cases where a direct link\n\ncannot be established but there are clear indications\nthat the Russian government is leveraging resources\nor personnel for their benefit; an example of this is the\nRussian government’s likely use of the GameOver Zeus\nbotnet for espionage or DDoS attacks by “patriotic\nhackers” during military conflicts.\n\n  - Tacit agreement is defined as the overlaps in\n\ncybercriminal activity, including targeting and timing, that\nbenefit Russian state interests or strategic goals; such\nactivity is conducted without direct or indirect links to\nthe state but is allowed by the Kremlin, which looks the\nother way when such activity is conducted.\n\n\n-----\n\n_[Figure 1: Header for Dmitry Dokuchaev’s personal website (Source: Internet Archive)](https://web.archive.org/web/20050410043421/http://kamensk.net.ru/forb/info/common/my.html)_\n\n##### Threat Analysis\n\n###### Direct Links\n\nThe worlds of cybercrime and the Russian special services\nintersect directly, either through coercive or willing recruitment.\nWilling recruitment occurs when individuals interested in\nsupporting Russian government interests voluntarily seek to\nengage in efforts that support the state. Coercive recruitment\noccurs when the Russian government observes a skilled and\nsuccessful malware coder on underground forums, arrests\nthem for their activities, and presents them with 2 alternatives:\nprosecution and jail time or cooperation and a paycheck.\n\nAnother example of direct association occurs in cases in\nwhich the Russian intelligence services establish underground\nforums by which they can recruit participation from criminal\nthreat actors ad hoc, which enables the Kremlin to surge effort\nfor specific purposes. Some forums may take the form of overt\ncriminal forums, which also allows intelligence services to\nspot talent for recruitment. Recorded Future sensitive source\nreporting indicates that around the time of Russia’s conflict\nwith Georgia in the late 2000s, Russian intelligence agencies\n[attempted to create a new Russian-language hacking forum](https://meduza.io/en/feature/2018/08/07/it-s-our-time-to-serve-the-motherland)\nfor “patriotic” hackers who would then target Georgia with\nDDoS and other cyberattacks. While the forum itself was not\nvery active, Russian intelligence agencies attempted to lure\nRussian-speaking cybercriminals into the forum to destabilize\nthe Georgian government with cyberattacks during the conflict.\n\nThe individuals outlined in this section have been reported\nas engaging in cybercriminal or financially motivated activity for\npersonal gain and also have what we believe to be direct links\nto the Russian state, either through politicians, the Kremlin, or\nRussian intelligence services. More details on their histories and\ncases can be found in Appendix A.\n\n\n###### Dmitry Dokuchaev\n\nOne of the most direct links between the cybercriminal\ncommunity and the Russian intelligence community is former\nFSB employee Major Dmitry Dokuchaev. In the early 2000s,\nDokuchaev was also [known in underground communities by](https://web.archive.org/web/20050410043421/http://kamensk.net.ru/forb/info/common/my.html)\nthe nicknames “forbik” and “FORB”, reportedly shorthand for\n[“Forbidden”. Dokuchaev claimed in a 2004 open-source interview](https://www.vedomosti.ru/newspaper/articles/2004/11/02/licom-k-licu-s-hakerom)\nthat his interest in hacking initially manifested in intrusions\nagainst small local networks to freely access information.\nDokuchaev also discussed making money by hacking and stated\nthat “carding” (the practice of stealing and trafficking stolen\npayment card information) was the most financially profitable\ntype of cybercrime.\n\nDokuchaev (like Evgeniy Bogachev, who is discussed\nin the Indirect Affiliations section) is [described as a former](https://www.rbc.ru/technology_and_media/16/12/2017/5a33a1a29a79475a0be7cc6a)\nmember of high-profile carding platforms and likely engaged\nin spamming activities that would have drawn the attention of\nRussian law enforcement or intelligence services like the FSB.\n[Sensitive sources appear to confirm that the FSB became aware](https://www.rbc.ru/technology_and_media/16/12/2017/5a33a1a29a79475a0be7cc6a)\nof Dokuchaev due to his criminal activity, namely in carding.\n[Dokuchaev reportedly was recruited by the FSB under threat of](https://thebell.io/what-the-arrest-of-the-fsb-s-top-cyber-crime-expert-has-to-do-with-american-elections)\n[criminal prosecution; separate reporting indicates this approach](https://www.rbc.ru/technology_and_media/16/12/2017/5a33a1a29a79475a0be7cc6a)\nis a common practice and suggests several employees of the\nCIS FSB have links to, or were members of, financially motivated\ntargeted intrusion forums at some point in their careers. Despite\nthe criminal activity or more likely because of it, Dokuchaev was\nhired by the CIS FSB, also known as Center 18. According to\n[information from the FBI, he is believed to have been operating](https://www.fbi.gov/wanted/cyber/dmitry-aleksandrovich-dokuchaev/@@download.pdf)\non behalf of this organization from at least January 2014 through\nDecember 2016, though open sources [suggest that he began](https://www.nytimes.com/2017/03/16/world/europe/russian-hacker-fsb-agent-dmitry-dokuchaev.html)\nhis work there as early as 2010. During his time at Center 18,\nDokuchaev engaged in financially motivated cyber activity and\nalso facilitated state-sponsored targeted intrusion activities.\n[Dokuchaev and other personnel from Center 18 were reported to](https://www.rbc.ru/technology_and_media/16/12/2017/5a33a1a29a79475a0be7cc6a)\nhave “created and used the international hacker forum Mazafaka,\naimed at hacking foreign financial institutions”.\n\n\n-----\n\n_[Figure 2: Dokuchaev (Source: FBI)](https://www.fbi.gov/wanted/cyber/dmitry-aleksandrovich-dokuchaev)_\n\n[A February 2017 US Department of Justice (DoJ) indictment](https://www.justice.gov/usao-ndca/page/file/1021226/download)\nnamed Dokuchaev, as well as co-conspirators, for conducting\nintrusions and an expansive data theft operation targeting Yahoo\nin 2014, which sought to obtain information for use in espionage\noperations to benefit the Russian government. According to an\nFBI press [release, “from at least January of 2014, continuing](https://www.fbi.gov/wanted/cyber/dmitry-aleksandrovich-dokuchaev)\nthrough December of 2016, Dmitry Aleksandrovich Dokuchaev\nis alleged to have conspired with, among others, known and\n[unknown FSB officers, including Igor Sushchin, to protect, direct,](https://www.fbi.gov/wanted/cyber/igor-anatolyevich-sushchin)\nfacilitate, and pay criminal hackers, including [Alexsey Belan”.](https://www.fbi.gov/wanted/cyber/alexsey-belan)\nDokuchaev and his conspirators allegedly gained unauthorized\naccess to the computer networks and user accounts hosted at\nmajor companies providing worldwide webmail and internetrelated services in the Northern District of California and\nelsewhere.\n\n###### Konstantin Kozlovsky\n\nAnother significant cybercriminal with purported connections\nto the Russian intelligence community is Konstantin Kozlovsky,\n[known as the leader of the Lurk cybercriminal group and creator](https://novayagazeta.ru/articles/2021/03/20/na-vzlomannom-angliiskom)\n[of the Lurk malware. Kozlovsky, who was arrested in 2016, has](https://novayagazeta.ru/articles/2021/03/20/na-vzlomannom-angliiskom)\nsince made several claims about working for the FSB under the\nguidance of Dokuchaev, and possibly others. Unlike most major\ncybercrime groups, Lurk primarily targeted victims inside Russia,\ncausing speculation about why they felt safe doing so. According\n[to Novaya Gazeta, a Russian independent news outlet, Kozlovsky](https://novayagazeta.ru/news/2019/11/13/156883-haker-iz-gruppirovki-lurk-rasskazal-v-sude-o-predlozhenii-ofitsera-fsb-ukrast-dengi-konkorda-prigozhina)\nclaimed that Dokuchaev had ordered Lurk to target entities\nwithin Russia, such as entities owned by Evgeny Prigozhin, a\nclose associate of Vladimir Putin and reported founder of Russian\ntroll farms and the private military company Wagner. Kozlovsky\nsuggested that such activity would benefit the FSB and enable\nthem to conduct arrests and gain greater authority; however,\nsuch claims have not been confirmed.\n\n\nIn 2017, while incarcerated in Russia, Kozlovsky himself\n[claimed that while he worked for FSB, specifically under Dmitry](https://tvrain.ru/teleshow/notes/konstantin_kozlovskij-453138/)\nDokuchaev, he was responsible for the 2016 hack and leak\noperation that targeted the Democratic National Committee\n(DNC) in the US. Furthermore, Kozlovsky stated that hackers\nsupervised by the FSB used a new method of spreading\nransomware, which consisted of “infecting one computer on\nthe corporate network, raising privileges, gaining administrator\naccess to the domain and stopping the activities of a company\nof any size with one button.”\n\n###### Maksim Yakubets and Evil Corp\n\nOn December 5, 2019, the US Department of Treasury\n(DoT) levied [sanctions against a cybercriminal team operating](https://home.treasury.gov/news/press-releases/sm845)\nout of Russia called Evil Corp, as well as Maksim Yakubets\nand Igor Turashev, the group’s leaders. A DoT press release\ndetailing the sanctions indicated that in addition to “managing\nand supervising the group’s malicious cyber activities” from at\nleast 2015, Yakubets was also “directly associated with Evgeniy\nBogachev …[and was] responsible for recruiting and managing a\nnetwork of individuals responsible for facilitating the movement\nof money illicitly gained through the efforts spearheaded by\nEvgeniy Bogachev”.\n\nAt approximately the same time the sanctions were\nannounced, the Russian-language investigative media outlet\n[Meduza reported that Yakubets and Evil Corp maintained close](https://meduza.io/en/feature/2019/12/12/the-fsb-s-personal-hackers)\nassociations with the FSB, stating that “Evil Corp’s hackers\nbelong to the families of high-ranking Russian state bureaucrats\nand security officials”. Meduza, citing the Washington Post,\nsuggested that Yakubets had been active in conducting intrusions\nsince at least 2009 when the crew he was working with had\nreportedly stolen “$415,000 from the treasury of Bullitt County in\nfar western Kentucky”. The report indicated that by at least 2019,\nYakubets was managing the group. In addition to conducting\n[intrusions for personal gain, the DoT also indicated that Yakubets](https://home.treasury.gov/news/press-releases/sm845)\nworked directly in support of FSB interests, stating,\n\n_Yakubets has also provided direct assistance to_\n_the Russian government. As of 2017, Yakubets was_\n_working for the Russian FSB, one of Russia’s leading_\n_intelligence organizations. … As of April 2018,_\n_Yakubets was in the process of obtaining a license_\n_to work with Russian classified information from_\n_the FSB … Additionally, as of 2017, Yakubets was_\n_tasked to work on projects for the Russian state,_\n_including acquiring confidential documents through_\n_cyber-enabled means and conducting cyber-enabled_\n_operations on its behalf._\n\n\n-----\n\nEvil Corp is operated by Maksim Yakubets and Igor\nTurashev and is known to use the following malware variants:\nWastedLocker ransomware, BitPaymer ransomware, and the\nDridex banking trojan. The preferred attack vectors used by Evil\nCorp are phishing and malicious code injection. According to\nRecorded Future data, Evil Corp has been in operation since at\nleast 2011 and has targeted over 150 public and private sector\nentities in at least 25 countries, including organizations in the\nbanking, automotive, government, information technology, law\nenforcement, retail, ICS/SCADA, manufacturing, and software\ndevelopment industries.\n\n###### Pavel Vrublevsky\n\nAccording to a 2014 Russian-language article[3] in Forbes,\nVrublevsky engaged in cybercriminal affairs and also “maneuvered\nbetween the Ministry of Internal Affairs and the FSB for many\nyears, making acquaintances with high-ranking officials from\nthe special services and in power, but the risky game ultimately\nled him to jail”. Vrublevsky was similarly involved[4] in a 2007\ninvestigation[5] as a witness to criminal activity. During the case,\nthe investigator said the following:\n\n_Maltsev, who was involved in the criminal case,_\n_resigned from the Ministry of Internal Affairs and got_\n_a job in the security service at Chronopay. And when_\n_Vrublevsky ended up at Lefortovo [a high-security_\n_prison in Moscow], it was Maltsev, who by that time_\n_had received the status of a lawyer, [who] became_\n_one of the official defenders of the Chronopay CEO._\n\nWhen interviewed [6] by Russian-language media outlet\nNovaya Gazeta about whether Vrublevsky had been recruited\nby the FSB, Russian State Duma Deputy Ilya Ponomarev stated,\n\n_I have no such information. But Vrublevsky is a very_\n_large player in the payment system market. And this_\n_market cannot exist without the strong support of_\n_senior officials in the intelligence services. If you do_\n_not have cover either from the Ministry of Internal_\n_Affairs or from the FSB, you will not be able to work_\n_in this market. But protection is one thing, and the_\n_agents are another, they are different things._\n\n3 https://www.forbes[.]ru/forbes/issue/2014-11/270967-sex-drugs-and-rock-n-roll\n\n4 https://novayagazeta[.]ru/articles/2012/11/30/52573-kiberprestupnik-8470-1pavel-vrublevskiy-superagent-ili-zhertva-fsb\n\n5 https://krebsonsecurity.com/wp-content/uploads/2010/05/ivptrans.pdf\n\n6 https://novayagazeta[.]ru/articles/2012/11/30/52573-kiberprestupnik-8470-1pavel-vrublevskiy-superagent-ili-zhertva-fsb\n\n\nVrublevsky also featured prominently in a recent treason trial\nin Russia. During Vrublevsky’s 2013 trial, the former chief of the\ncybercrime department at Russia’s FSB security service, Colonel\n[Sergei Mikhailov, testified against Vrublevsky. After Vrublevsky’s](https://www.rferl.org/a/russia-hacker-mikhailov-stoyanov-fsb-scandal-for-russian-security-agency/29794092.html)\n[release, according to a report by Radio Free Europe/Radio Liberty,](https://www.rferl.org/a/russia-hacker-mikhailov-stoyanov-fsb-scandal-for-russian-security-agency/29794092.html)\n“Russian prosecutors accused Mikhailov and Stoyanov [a former\nresearcher at the Russia-based cybersecurity firm Kaspersky\nLabs] of passing classified information about Vrublevsky to the\nFBI. Russian press reports, citing unnamed officials, alleged that\nMikhailov was paid $10 million for the information”. After a closed\ntrial in 2019, Mikhailov was sentenced to 22 years in prison, and\nStoyanov to 14 years.\n\n###### Roman Seleznev\n\nRoman Seleznev was born in 1984 in Vladivostok, Russia. The\nson of Valery Seleznev, a member of the Russian State Duma,\n[Seleznev started his hacker career at the age of 18 in 2002. In his](https://www.documentcloud.org/documents/3675046-Seleznev-Letter.html)\nearly career, Seleznev operated under the usernames “nCux” (a\ntransliteration of пСих, meaning “psycho”), “Track2”, and “Bulba”,\nbecoming one of the largest carders in the Russian hacker scene.\nInitially, nCux would break into databases to steal personally\nidentifiable information (PII) and later moved on to stealing\npayment card information and selling it in underground carding\n[forums. He primarily targeted databases of small businesses in](https://krebsonsecurity.com/wp-content/uploads/2014/07/Seleznev-Indictment-CR11-0070RAJ-1.pdf)\nthe US, mainly due to low-security protocols used by many small\nbusinesses.\n\nSeleznev attracted the [attention of the US Secret Service](https://www.secretservice.gov/press/releases/2016/08/russian-cyber-criminal-convicted-38-count-indictment-following-10-year)\n(USSS) in 2005, and in 2009, USSS and FBI agents [traveled](https://habr.com/ru/post/403425/)\nto Moscow as part of a joint investigation with the FSB. The\nUS agencies provided the FSB with information on Seleznev’s\nunderground identity and his activities. But a month after\nthe meeting, Seleznev announced his retirement and deleted\nhis profiles from underground carding forums. US indictment\n[documents against Seleznev note that he was likely tipped off](https://s3.documentcloud.org/documents/3673513/Seleznev-US-Atty-Sentencing-Memo.pdf)\nabout the US investigation by the FSB. This theory is supported\nby a conversation Seleznev had with one of his associates,\nVladislav Horohorin, in which Seleznev noted that he enjoys\n[FSB protection and has ties to agents working for CIB. However,](http://rferl.org/a/cyber-crime-us-russia-cooperation-mess/28459178.html)\ninstead of retiring after deleting his online profiles, Seleznev\n[quickly created several new usernames and expanded his carding](https://krebsonsecurity.com/wp-content/uploads/2014/07/Seleznev-Indictment-CR11-0070RAJ-1.pdf)\noperations. Operating under the usernames “Track2” and “Bulba”,\n[Seleznev created an online marketplace for carders, simplifying](https://s3.documentcloud.org/documents/3673535/Seleznev-Letter.pdf)\nthe purchase of stolen information.\n\n\n-----\n\n[Seleznev was arrested by the USSS while vacationing in the](https://krebsonsecurity.com/2014/07/feds-charge-carding-kingpin-in-retail-hacks/)\n[Maldives in 2014. In April 2017, he was sentenced to 27 years in](https://www.justice.gov/opa/pr/russian-cyber-criminal-sentenced-27-years-prison-hacking-and-credit-card-fraud-scheme)\nprison for “computer hacking” that caused more than $169 million\n[in damages. In September 2017, Seleznev was sentenced to 14](https://www.justice.gov/opa/pr/russian-cyber-criminal-sentenced-14-years-prison-role-organized-cybercrime-ring-responsible)\nyears (concurrent) in jail under similar charges. In the aftermath\nof his arrest, Russia publicly and vociferously [objected to his](https://www.nbcnews.com/news/us-news/russian-hacker-roman-selezny-gets-27-years-u-s-cyberattacks-n749531)\narrest; a social media post from the Russian Embassy in the US\nstated that the “[a]rrest of [Russian] citizen Roman Seleznev\nwho de facto was kidnapped in a 3rd country [sic] is unlawful”.\nMore details on Seleznev’s history and case can be found in\nAppendix A: Additional Information on Direct and Indirect Links,\nRoman Seleznev.\n\n###### Alexey Stroganov\n\nAlexey Stroganov, also known as “flint24”, a moderator of\nthe “Carder” (carder[.]org) underground forum and the head\nof the criminal online shop “Real Plastic” (realplastic[.]org), is\nconsidered by many to be the most senior carder in all of Russia.\nHis criminal record dates back to 2003, when he was arrested\nby Russian law enforcement due to his association with carding\n[operations. According to Russian news sources, however, by the](https://iz.ru/news/279225)\ntime of his arrest, Stroganov had already been wanted by the\npolice for 9 years for unspecified fraudulent activity.\n\nIn addition to his criminal activities, Stroganov also\noperated multiple legal businesses in the Russian Federation\nand supported multiple charity causes as well as a non-profit\n“cybercrime-fighting” organization dubbed [Kibalchish. Its](https://www.rusprofile.ru/id/10522072)\nofficial website, kibalchish[.]org, now defunct, claimed that the\norganization helped educate about and combat cybercrime such\n\n\nas carding and phishing. Additionally, it appears that Kibalchish\n[was involved in combating the illegal sale of tickets during the](https://compromata.net/kiberplohish-flint24-aleksey-stroganov)\n2018 World Cup in Russia.\n\nThrough these non-profits, Stroganov built ties with political\nfigures. Ultimately Stroganov built a close friendship with Vadim\nDengin, a Russian politician serving as the deputy of the State\nDuma of the Russian Federation, and a member of the Liberal\nDemocratic Party of Russia. Importantly, Dengin is the First\nDeputy Chairman of the Committee on Informational Policy,\nInformation Technology, and Communications, which oversees\npassing laws concerning RUNet (a general term for the Russian\ninternet) and cybercrime. Beyond his ties with Dengen were\n[indications that his attorneys used awards provided by both](https://pasmi.ru/archive/272878/)\nVladimir Putin and FSB director Alexander Bortnikov to protect\nhim from prosecution.\n\n[As Gemini Advisory points out, “In Russia, it is widely known](https://geminiadvisory.io/fsb-arrests-targeted-flint24/)\nthat acquiring political ties comes with a level of immunity. One\nof the key elements in making those connections is finding\npoliticians willing to accept bribes, which requires either knowing\nsomeone in political circles or knowing the politician directly.”\n\n\n_Figure 3: Image of Stroganov (right) receiving a Russian government award from the Governor of St Petersburg Alexander Beglov (Source: Facebook)_\n\n\n-----\n\n_Figure 4: Graphical representation of the direct and indirect links between Russian Intelligence Services and individuals in the Russian criminal underground_\n_(Source: Recorded Future)_\n\n\nWhile the cybercriminals outlined in the figure above\nhave been linked in various ways with Russian politicians, law\nenforcement, and intelligence agencies, they are by no means\nthe only individuals whose activities appear to have benefitted\nmembers of Russian circles of power.\n\n###### Indirect Affiliations\n\nIn other cases, the state may not directly employ\nindividuals from the criminal hacking ecosystem but may use\ntheir infrastructure to further Russian government interests.\nAdditionally, “patriotic hackers” may conduct actions that benefit\nthe state but are not directly linked to any Russian government\nor intelligence service entity. In these cases, the associations\nbetween cybercriminals and the state are much more diffuse, but\nthe effects still support Russian government goals.\n\n\nA similar effort, falling under the indirect category of activity,\noccurred between April and May 2007 when DDoS attacks targeted\nEstonia’s government, news, banking, and telecommunications\n[online resources. The activity was described by the independent](https://www.cna.org/cna_files/pdf/DOP-2016-U-014231-1Rev.pdf)\nresearch organization CNA as “the first large-scale coordinated\nuse of cyber by Russia to affect a strategic outcome in a\nneighboring state” but also tactically unsuccessful, given that\nit did not affect the root cause of the conflict, the relocation of\na Soviet-era monument. An unidentified Estonian government\nofficial [told the BBC that the attack “was orchestrated by the](https://www.bbc.com/news/39655415)\nKremlin, and malicious gangs then seized the opportunity to join\nin and do their own bit to attack Estonia”.\n\n\n-----\n\n_Figure 5: Post describing how to conduct DDoS attacks found on Russian-language sites_\n_[(Source: CCDCOE)](https://ccdcoe.org/uploads/2018/10/Ottis2008_AnalysisOf2007FromTheInformationWarfarePerspective.pdf)_\n_Figure 8: Evgeny Nikulin posing for a photo in front of St. Basil’s Cathedral in Moscow’s Red Square_\n_[(Source: Gazeta)](https://www.gazeta.ru/social/2016/10/24/10267649.shtml)_\n\n\nSome of the ways that these criminal efforts have benefited\nKremlin interests include targeting Kremlin opponents with\nmalicious activities against Estonia, Georgia, Ukraine, and\nWestern countries as well as providing tools, infrastructure, and\naccess to the Russian government and intelligence agencies\nboth wittingly and unwittingly. Russian intelligence agencies\nhave used criminal commodity malware to obfuscate their\nactivities and make attribution more difficult. They have used\ncriminal money laundering networks and bulletproof hosting to\nobfuscate the movement of funds and sponsorship of disruptive\nactivities. They have also used networks compromised for\ncriminal purposes to search for sensitive data and credentials\nto advance espionage activities and targeting against both\ndomestic opposition and Western entities and governments. The\nfollowing sections outline some of the individuals involved in\nactivities and operations that we believe were either sanctioned\nor co-opted in some way by the Russian state.\n\n\n###### Evgeny Nikulin\n\nEvgeny Nikulin has been active since at least 2012 when,\n[according to a charging document from the US District Court of](https://s3.documentcloud.org/documents/6793888/Nikulin-pre-trial-filing-alleging-Ieremenko.pdf)\nthe Northern District of California, he “engaged in a sustained\ncampaign to steal user account credentials from major US\ncompanies’’ including LinkedIn, DropBox, and Formspring.\nNikulin obtained LinkedIn user credentials by gaining access\nto a personal computer used by a LinkedIn employee who\nsubsequently used the same computer to log in to LinkedIn\ncompany network resources via a virtual private network (VPN).\nAlthough the initial intrusion vector was not specified in the\ncharging document, the court documentation indicated that a\nDropBox employee was targeted similarly via a spearphishing\nattack from the email addresses chinabig01[@]gmail[.]com and\nR00talka[@]gmail[.]com, which an FBI investigation linked to\nNikulin as well as to the LinkedIn and Formspring activity. After\ngaining access to the user data from the targeted companies,\nNikulin monetized the access by either posting the encrypted\nmaterial to forums or negotiating the sale of the material to other\nRussian hackers. Beyond the value the information holds for sale\nto other Russian hackers on the black market, we assess that the\nvalue of this information to Russian intelligence services is also\nhigh; however, it is not publicly known whether Nikulin attempted\nto broker such a sale of these datasets to government agents.\n\n\n-----\n\n_Figure 7: Images in which Nikulin demonstrates his associations with United Russia-affiliated personnel as well as his interest in luxury goods_\n_[(Sources: Gazeta and Currenttime TV)](https://www.gazeta.ru/social/2016/10/24/10267649.shtml)_\n\n\nNikulin was [detained in the Czech Republic on October 5,](https://www.justice.gov/usao-ndca/pr/yevgeniy-nikulin-appears-us-court-following-extradition)\n2016, and, following a court battle between the US and Russian\ngovernments about which state would obtain Nikulin, he was\neventually extradited to the US in 2018, where he was charged\nfor his role in the LinkedIn, DropBox, and Formspring intrusions.\nIn the wake of his arrest and extradition, open-source media\nreports identified Nikulin’s social media accounts, which revealed\nhis associations to individuals like Maria Roshchina, affiliated\nwith the pro-Kremlin United Russia party, as well as his lavish\nlifestyle in which he flaunted his interest in luxury goods. The\ncase has also drawn some attention in Russia, where reporters\nhave unearthed photos of the self-described “used car salesman”\ndriving lavish cars and taking photos with the Russian elite.\nNikulin’s social media pages had [included snaps with both the](https://www.themoscowtimes.com/2017/05/11/russian-hacker-claims-us-agents-pressured-him-to-confess-to-clinton-cyberattack-a57965)\ndaughter of Defense Minister Sergei Shoigu and Kremlin press\nsecretary President Dmitry Peskov; however, it appears that\nthese photos have been scrubbed from his social media at the\ntime of writing.\n\n\n###### Pyotr Levashov\n\nAnother particularly colorful figure on the Russian dark\nweb is Pyotr Levashov. Also known by the alias “Severa”, he\nis responsible primarily for distributing spam via the Storm\nWorm, Waledac, and Kelihos botnets; given how prolific he\nwas, some identify Levashov as the “king of spam”. A July\n13, 2021 sentencing document indicated that “Levashov used\nthe knowledge that he obtained working with Storm Worm to\ndevelop, and to pay others to develop the Waledac botnet”.\nWaledac exceeded Storm in its distribution of spam, sending\nmore than 1.5 billion spam messages a day. The Waledac botnet\nwas taken down by Microsoft in March 2010. Levashov then built\nthe Kelihos botnet, which again exceeded the spam volume of\nits predecessor, sending more than 4 billion spam messages a\nday. In addition to his involvement in developing these botnets,\nLevshov is charged with engaging in credential harvesting and\ndenial-of-service attacks. The Kelihos botnet was [taken down](https://www.justice.gov/opa/pr/justice-department-announces-actions-dismantle-kelihos-botnet-0)\nin April 2017.\n\n\n-----\n\n_[Figure 10: Photos of Bogachev engaging in his hobbies of exotic cat ownership and boating (Source: New York Times)](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)_\n\n\nAfter the Microsoft takedown of Waledac, on April 1, 2012,\nLevashov created a lengthy post on Russian-language forums\nstating that he was officially quitting cybercrime and moving\nto Microsoft to head up their new cybercrime fighting team.\nWhile the April Fools joke elicited some confusion, it was the\npost that Levashov crafted on April 1, 2013, on several Russianlanguage dark web forums that drew substantial attention. This\n[time the post suggested that he was entering into an affiliation](https://web.archive.org/web/20190516181941/https://antichat.com//threads/378719/)\n[with the Russian intelligence services; specifically, he appeared](https://www.bbc.com/russian/features-39572461)\nto attempt to recruit individuals on the forum to work for a new\norganization that he claimed to lead in the FSB, identified as the\nSeparate Special Information Security Battalion. Although the\npost was likely a joke, it did elicit some lively conversation on\nthe forums, including some interest in the forum from individuals\nwho appeared to be taking the post seriously and indicated an\ninterest in working for the new organization. This April Fools\njoke could have easily helped the Russian intelligence services\nto identify potential recruits among the threat actors who took\nthe post seriously. After Levashov’s arrest and extradition to the\nUS, Levashov’s wife claimed that he was being questioned about\npotential links to Russian nation-state activity.\n\n\n###### Evgeniy Bogachev\n\nPerhaps the most effective cybercriminal of all time and\none who has held the top spot on the FBI’s list of most-wanted\n[cybercriminals is “slavik”. According to a US DoJ indictment filed](https://www.justice.gov/sites/default/files/opa/legacy/2014/06/02/pittsburgh-indictment.pdf)\nin May 2014, Evgeniy Mikhailovich Bogachev, also known by his\nonline pseudonyms “lucky12345”, “slavik”, and “Pollingsoon”,\n[created and employed a vast network of computers consisting](https://krebsonsecurity.com/2014/06/operation-tovar-targets-gameover-zeus-botnet-cryptolocker-scourge/)\nof “an estimated 500,000 to 1 million compromised systems\nglobally”, known as the GameOver Zeus Botnet, to obtain personal\nand financial information from infected hosts. The indictment\nindicated that “Zeus is malware specifically designed to automate\nthe theft of confidential personal and financial information, such\nas online banking credentials, from infected computers through\nthe use of keystroke logging and web injects”. This feature of\nthe malware, in conjunction with the number of infected hosts,\nwas likely of interest to the Russian government, as open-source\n[reporting suggests that the Russian intelligence services sought](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)\nto use GameOver Zeus in “attempts to gain access to sensitive\nmilitary and intelligence information on infected computers in\nthe United States, often consisting of searches for documents\ncontaining the words ‘top secret’ or ‘Department of Defense’”.\n\n\n-----\n\n_[Figure 11: Sample of the type of espionage-related content observed with GameOverZeus Botnet activity (Source: GameOver Zeus – Bad Guys and Backends)](https://www.blackhat.com/docs/us-15/materials/us-15-Peterson-GameOver-Zeus-Badguys-And-Backends.pdf)_\n\n\nOpen-source [reporting, which cites information from the](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)\nUkrainian Interior Ministry, suggests that Bogachev had been\n“working under the supervision of a special unit of the FSB”. A\nformer assistant special agent in charge of cyber investigations\nfor the FBI, Austin Berglas, supported this assessment,\nsuggesting that Bogachev was “doing the bidding of Russian\nintelligence services, whether economic espionage or straightup espionage”.\n\nThe same [reporting, which cites FBI data, states that](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)\nBogachev “used to sell malicious software on a site called Carding\nWorld, where thieves buy and sell stolen credit card numbers and\nhacking kits”. His activity on this website likely drew the attention\nof Russian intelligence security professionals present on these\nforums and may have resulted in his recruitment by the Russian\ngovernment. Indeed, Zeus and the slavik moniker were made\nknown to the FSB by US law enforcement representatives as\npart of the joint counter-cybercrime collaboration efforts and\naccording to sensitive sources Russia may have initially been\n[involved in Operation Tovar, a multinational effort to take down](https://krebsonsecurity.com/2014/06/operation-tovar-targets-gameover-zeus-botnet-cryptolocker-scourge/)\nthe GameOver Zeus network in 2014, before pulling out at the\nlast minute. It is not currently possible to validate that connection\nbetween Bogachev and the Russian government definitively.\n\n\nNevertheless, there are indications that Bogachev has, at a\nminimum, enjoyed protection from Russian law enforcement as\nhe lives a luxurious life freely on the Black Sea city of Anapa,\nRussia. Additionally, unnamed officials [suggest that Bogachev](https://www.nytimes.com/2017/03/12/world/europe/russia-hacker-evgeniy-bogachev.html)\nowned a luxury yacht and “had three Russian passports with\ndifferent aliases allowing him to travel undercover”. A Recorded\nFuture source also claimed that Bogachev was involved in acting\nas a go-between for Vladislav Surkov, Putin’s close advisor, and\npaying for Russian disinformation campaigns run by independent\ndisinformation as a service actor targeting the West.\n\n###### BLACKENERGY \n\nDisruptive attacks aimed at the Ukrainian energy grid in\nDecember 2015 relied, in part, on a backdoor called BlackEnergy3\nto facilitate access to the targeted systems. BlackEnergy3 is a\nspecialized variant of an older, similarly named cybercriminal\n[tool called BlackEnergy. BlackEnergy, and a later variant called](https://web.archive.org/web/20200221013253/http://atlas-public.ec2.arbor.net/docs/BlackEnergy+DDoS+Bot+Analysis.pdf)\n[BlackEnergy2, trace their origins to a developer named Dmytro](https://www.darkreading.com/vulnerabilities---threats/new-blackenergy-trojan-targeting-russian-ukrainian-banks/d/d-id/1133120?)\n[Oleksiuk (also known online as “Cr4sh”), who initially designed](https://github.com/Cr4sh)\nthe malware to conduct DDoS attacks, distribute spam email,\nand steal personal or financial information from targeted hosts.\nA separate open-source [report corroborates the link between](https://www.vice.com/en/article/wnx5yz/the-malware-that-led-to-the-ukrainian-blackout)\nCr4sh and BlackEnergy, noting the author’s name in a “screenshot\nof the software’s point-and-click panel”.\n\n\n-----\n\n_Figure 12: Initial BlackEnergy panel showing the name “Crash” as the author_\n_[(Source: BlackBerry ThreatVector Blog)](https://blogs.blackberry.com/en/2016/01/blackenergy-and-the-ukraine-signals-vs-noise)_\n\n[According to open-source reporting, “Around 2007, Oleksiuk](https://www.vanityfair.com/news/2019/10/the-discovery-of-sandworm-the-worlds-most-dangerous-hackers)\nhad sold BlackEnergy on Russian-language hacker forums,\n[priced at around $40”. Separate, public reporting indicated that](https://www.wired.com/2014/10/russian-sandworm-hack-isight/)\n“though Dmytro has always denied involvement in developing\nlater versions of the tool ... The Sandworm team [a Russian APT\nassociated with Unit 74455 of the Main Intelligence Directorate]\nappears to be using the malware to collect intelligence. The\nresearchers say their use of BlackEnergy indicates a link\nbetween the attackers and the criminal underground, although\ntheir campaign is more sophisticated”.\n\n###### Alexander Vinnik \n\n[In July 2017, the DoJ issued an indictment against Alexander](https://www.justice.gov/usao-ndca/pr/russian-national-and-bitcoin-exchange-charged-21-count-indictment-operating-alleged)\nVinnik, claiming that BTC-e, a cryptocurrency exchange that\nhe established in 2011 and maintained access to, facilitated\n“numerous ransomware and other cybercriminal activity”.\n[Reporting indicates that BTC-e was run out of several locations,](https://www.rferl.org/a/how-much-did-russian-spy-agencies-rely-on-bitcoin-new-hints-in-leaked-recordings-/30297083.html)\nincluding Bulgaria, Cyprus, and Seychelles and was “heavily\nreliant on the criminal underworld and people and entities\ninterested in anonymity or hard-to-trace transactions”. Vinnik\nwas arrested by authorities in Greece in conjunction with the\nindictment in the US. Additionally, the DoJ indicated that they\n[had seized BTC-e infrastructure citing its links to cybercriminal](https://www.theverge.com/2017/7/29/16060344/btce-bitcoin-exchange-takedown-mt-gox-theft-law-enforcement)\nactivity as well as the allegation that Vinnik received funds from\n[the 2014 intrusion of the cryptocurrency exchange Mt. Gox.](https://www.wired.com/2014/03/bitcoin-exchange/)\n\n\nVinnik and BTC-e are of relevance to the Russian intelligence\nservices given that bitcoin analysis firm Elliptic [traced the use](https://www.elliptic.co/blog/doj-indictment-russian-hackers-blockchain-analysis)\nof bitcoin by GRU-linked advanced persistent threat (APT)\ngroup APT28 “to a number of sources including BTC-e”. APT28\nemployed cryptocurrency to purchase infrastructure, such as\ndomains, lease servers, and VPN accounts that were then used\nin targeted intrusion operations, such as the one which impacted\nthe Democratic National Committee (DNC) in 2016, according to a\n[2018 DoJ indictment. Bolstering the likelihood of this connection,](https://www.justice.gov/file/1080281/download)\nthe Russian government put up an extensive legal effort to fight\nthe US request for extradition, going as far as quickly opening\na case against Vinnik in Russia and requesting his extradition\nthere to stand trial.\n\n###### Tacit Agreement\n\nUltimately, whether or not there are connections between\nRussian authorities and cybercriminals becomes a moot point.\nCybercriminals are widely known both inside Russia and abroad,\nand aside from pursuing the few individuals who have targeted\nentities inside Russia or who have crossed some sort of political\nline, Russian authorities have done little to try to disrupt the\nRussian-language criminal ecosystem. The Kremlin’s muted\nresponse to cybercriminal activities originating from within Russia\nhas nurtured an environment where cybercriminal organizations\nare well-organized enterprises. Until the Russian government\ndecides to investigate and prosecute cybercriminals operating\nin Russia, it will continue to be a safe haven.\n\nTacit agreements occur when the Russian criminal hacking\necosystem conducts activity independent of any directive by\nthe state. This type of activity, and its timing, are consistent\nwith Russian government strategic goals; although, there are\nno direct or indirect links within these efforts. The Russian\ngovernment forms a tacit agreement between the individuals\nconducting the attacks by not prosecuting them so long as they\ntarget “the right” entities and do not harm Kremlin interests.\n\n###### Malware That Looks Like Ransomware \n\nTacit links also occur when state-sponsored activity\nemploys malware that looks like ransomware to provide plausible\ndeniability, or complicate attribution, for cyber operations that\nbenefit the state. These are not direct links as it is not clear\nwhether the individuals employing this malware are members\nof the cybercriminal ecosystem, but the malware itself certainly\ntakes its appearance or code framework from cybercriminal\nsources. It is not indirect as it is not the sharing of a criminal\nresource for state benefit. Rather, this tactic is emblematic of the\nstate’s tacit approval of the cybercriminal ecosystem.\n\n\n-----\n\nThe use of commodity malware by Russian intelligence\nservices almost certainly allows the Russian government to\nmaintain plausible deniability[7] in targeted intrusions, especially\nwhen nuances between the details of specific variants of malware\nare used. In addition to modifying and using commodity malware\nlike BlackEnergy, Sandworm has also been linked to other\nintrusions which employed modified versions of ransomware in\norder to conduct disruptive and destructive intrusions. The most\n[widely known examples of this type of activity include a series of](https://www.databreachtoday.com/ukraine-power-supplier-hit-by-wannacry-lookalike-a-10071)\nattacks against systems in Ukraine in 2017 designed to look like\nransomware; these attacks employed XData, FakeCry, PSCrypt,\nand NotPetya malware. The discovery of these tools as part of\na likely state-sponsored operation, as opposed to a financially\n[motivated one, was realized when researchers discovered that](https://web.archive.org/web/20210209050831/https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)\npayments for advertised decryption tools associated with these\nattacks were either impossible to complete or had no effect.\n\n[7 In a June 14, 2021 interview with NBC News, Russian president Vladimir Putin](https://www.nbcnews.com/news/world/putin-talks-hacking-navalny-capitol-riot-ahead-biden-summit-n1270640)\ncontradicted the claim that Russia engaged in cyber attacks against US targets,\nstating “We have been accused of all kinds of things … Election interference,\ncyberattacks and so on and so forth. And not once, not once, not one time,\ndid they bother to produce any kind of evidence or proof. Just unfounded\naccusations”.\n\n\n-----\n\n##### Outlook\n\nBased on the longstanding relationship between the Russian\nintelligence services and the Russian cybercriminal ecosystem,\nit is almost certain that these connections will persist for the\nforeseeable future, and very likely continue to facilitate Russian\nintelligence service operations. As long as cybercriminals remain\nprotected from domestic prosecution, are allowed to profit from\ntheir operations, and the Russian government maintains plausible\ndeniability in their operations, there is no indication that such\nactivity will stop, and malware procurement and infrastructure\nuse via these relationships will continue. However, if the Russian\ngovernment determines that the cost of protecting or ignoring\ncybercrime is higher than the benefit, we believe they can\nsignificantly reduce Russian cybercriminal activity.\n\nThe high-profile ransomware attacks against [Colonial](https://therecord.media/fbi-colonial-pipeline-was-hit-with-darkside-ransomware/)\n[Pipeline,](https://therecord.media/fbi-colonial-pipeline-was-hit-with-darkside-ransomware/) [JBS, and](https://therecord.media/fbi-jbs-ransomware-attack-was-carried-out-by-revil/) [Kaseya, have increased pressure on the](https://therecord.media/revil-ransomware-executes-supply-chain-attack-via-malicious-kaseya-update/)\nRussian government to take action against the cybercriminal\ngroups behind this activity. It is widely known that the groups\nbehind these attacks are located in Russia; the lack of action by\nthe Russian government only highlights the apparent complicity\nof the Kremlin in these efforts. This pressure already appears\nto have yielded statements that indicate a potential change\nin relation to ransomware operations, such as the recent\nBlackMatter ransomware gang’s pronouncements that it will not\ntarget critical infrastructure.\n\nBut irrespective of the costs and incentives, the current\nRussian government is not likely to crack down on cybercrime\nin the near future beyond potentially taking some limited steps\nto appease international demands. In addition to these actions,\nthe threat actors themselves will likely improve or increase\ntheir operations security (OPSEC). Furthermore, the Russian\ncybercriminal and intelligence services will likely obfuscate their\naffiliations and collaboration or compartmentalize duties in order\nto reduce the likelihood of discovery or detection.\n\nWe have seen a shift in calculus following recent highprofile ransomware attacks and subsequent intergovernmental\nconsultations between the US and Russia. In terms of ransomware\noperations, the administrators of 2 major Russian-language\nforums, Exploit and XSS, quickly banned ransomware topics on\ntheir criminal underground platforms. Moreover, DarkSide, REvil,\n[and Avaddon ransomware families halted](https://therecord.media/darkside-gang-estimated-to-have-made-over-90-million-from-ransomware-attacks/) [extortionist](https://therecord.media/kaseya-obtains-revil-decryptor-starts-customer-data-recovery-operations/) [activities](https://therecord.media/avaddon-ransomware-operation-shuts-down-and-releases-decryption-keys/)\nright before or days after the first meeting between Presidents\nBiden and Putin.\n\nPresidents Biden and Putin met for the first [time on June](https://www.usatoday.com/story/news/politics/2021/06/16/joe-biden-set-putin-summit-geneva-after-g-7-nato-meetings/7700426002/)\n16, 2021, in Geneva, Switzerland. One of the major topics of the\nmeeting was reported to have been a request for the Russian\ngovernment to address domestic ransomware and cybercrime.\n\n\nThe prioritization of this issue reveals an awareness of the\nconnections between the ransomware decision-makers and the\nRussian state. Although President Putin has publicly denied any\nRussian government involvement in these incidents, there has\nbeen a shift in the policies of ransomware operators in the days\nfollowing the summit.\n\nIn an exclusive [interview conducted by Recorded Future](https://therecord.media/an-interview-with-blackmatter-a-new-ransomware-group-thats-learning-from-the-mistakes-of-darkside-and-revil/)\nanalysts with BlackMatter ransomware operators, the group said\nsome industries were off-limits: It would not extort healthcare,\ncritical infrastructure, oil and gas, defense, non-profit, and\ngovernment organizations. The White House deputy national\nsecurity adviser for cyber and emerging technology, Anne\nNeuberger, issued a statement at the Aspen Security Forum on\nAugust 4, 2021, which suggested that the interview is a positive\nsign of compliance by the Russian government of requests\nmade by the Biden Administration to bring Russian domestic\ncybercrime under control. In her statements, reported by\nRecorded Future’s Record Media, Neuberger stated the following:\n\n_We think we’re seeing a commitment, and we will look_\n_to see the actions that follow on that commitment..._\n_As we looked at that interview, we took it as_\n_evidence, or perhaps as a sign, that the message_\n_regarding the disruptive ransomware activity against_\n_critical infrastructure is unacceptable … We’re looking_\n_to see the changes and addressing disruptive cyber_\n_activity over time._\n\n\n-----\n\n##### Appendix A: Additional Information on Direct and Indirect Links\n\n###### Dmitry Dokuchaev\n\nDokuchaev was born in Kamensk-Uralskiy, Russia in 1984 and developed his interest and skills in computer programming\nand network systems administration until eventually specializing in computer and network intrusions. In early 2006, Dokuchaev\n[served as an editor at the Russian technology magazine “Hacker” under the supervision of Nikita Kislitsin.[8] Dokuchaev, who is](https://xakep.ru/2007/12/04/x-history-1999-2007/)\nreported to have engaged in carding, admitted that such activity was not without its risks, claiming that authorities in Russia were\ncracking down mercilessly on those engaging in this type of criminal activity domestically. Although Dokuchaev did not say when\nhe conducted those initial intrusions against small local networks, what is known is that Dokuchaev later graduated to statesponsored attacks to deliver malware to targeted hosts abroad, including in the US and other Western countries.\n\n[“ВЧК-ОГПУ”, a Russian-speaking Telegram channel with 162,000 subscribers and website rucriminal[.]info, explained to their](https://t.me/vchkogpu)\nreaders details of Dokuchaev’s case:\n\n_To understand the story of how Dmitry Dokuchaev, an employee of the Information Security Center of the FSB_\n_[of the Russian Federation, was immediately accused of treason in Russia and at the same time of cybercrime in the](https://t.me/vchkogpu/9556)_\n_United States, one must carefully study the indictments. But only not the one in the United States, although there are_\n_interesting moments there, but to carefully study the indictments of hackers whom the FBI arrested after the arrest of_\n_Dokuchaev in Moscow. And also to study the documents of the trial of the hacker Kozlovsky in Yekaterinburg and the_\n_confrontation around the stolen money of the WEX crypto exchange and the programmer Vinnik. All these cases are_\n_connected with each other by one person - Dokuchaev._\n\n_From the documents of the United States it becomes clear that Dokuchaev had a small army of hackers, and with_\n_many he became close friends even before he got into the FSB. This army made obscene money (hundreds of millions_\n_of dollars) from cybercrime both outside Russia and in Russia. Members of this army and hackers Nikulin, Kislitsyn,_\n_and, for example, two Ukrainian hackers, who were put on the wanted list by the United States a week ago. This army_\n_rallied back in Yekaterinburg, its members from there moved together to Moscow. From the American documents on_\n_Kislitsyn and Nikulin, it is clear that another member of their inner circle was Oleg Tolstykh. This person subsequently_\n_pelted the Web with documents of strange content and then went into the shadows. Konstantin Kozlovsky and his_\n_Lurk gang were from the same army. He just did not go to Moscow, stayed to work, and specialized in hacking non-_\n_Western and Russian banks. There were at least six bands like Lurk. And they all cleaned out the banks. And at the_\n_head of the army was Dokuchaev._\n\n_Kozlovsky, unlike other army men, was initially more independent, although he was also Dokuchaev’s connection._\n_Kozlovsky has an interesting point in the case - the real hacker (MEG), who broke Sberbank and other banks, turned_\n_out to be an agent of the TsIB (CIB) of the FSB of the Russian Federation. The activities of Lurk became a reason for_\n_Sberbank to invest a billion dollars under the leadership of the head of the Central Information Security Service of_\n_the FSB Sergei Mikhailov in the creation of BiZone (protection against cyber threats and testing of the bank’s security_\n_systems)._\n\n_This entire army is members of a number of famous online cyber crime forums - exploit.in, MAZA.la and Zloy. These_\n_forums grew on the foundation of the Carder Planet forum of Ukrainian Dmitry Golubev (Script, leader of the Internet_\n_party of Ukraine) after the closure of his project. Therefore, the army was originally Russian-Ukrainian. Controlling_\n_the forums means controlling all cybercrime to some degree. And these forums were under the control of the CIB,_\n_Dokuchaev answered specifically. The forums were in the shadows - because it was beneficial for the CIB to keep_\n_them in the shadows._\n\n8 [Kislitsin was indicted by the Department of Justice in 2014 for trafficking hacked data.](https://www.cyberscoop.com/group-ib-nikita-kislitsin-indicted-formspring-nikulin/)\n\n\n-----\n\nRuslan Stoyanov, a former MVD and “Kaspersky Lab” employee, who was [convicted for treason charges together with](https://habr.com/ru/news/t/440968/)\n[Dokuchaev and Mikhailov, made a public statement after his conviction:](https://tvrain.ru/teleshow/notes/zavtra_kleptokraticheskaja_ugroza_buduschemu_rossii-431983/)\n\n_There is a huge temptation for “decision makers” to use ready-made solutions to Russian cybercrime in order to influence_\n_geopolitics._\n\n_The worst scenario is to give cybercriminals immunity from retaliation for stealing money in other countries in exchange_\n_for intelligence. If this happens, a whole layer of “patriotic thieves” will appear, violating the principles of the rule of law and_\n_the inevitability of punishment._\n\n_The appearance of such people will immediately give rise to a new subculture. Through underground forums, the_\n_phenomenon will be romanticized and generate a wave of followers almost uncontrolled by the state and by nature inclined_\n_towards anonymity._\n\n_It is difficult to steal from international financial organizations, and our talents, having failed there, will turn their attention_\n_to where everything is in Russian, throwing away all the patriotic fervor. We will get a new wave of crimes in Russia. That is,_\n_everything that we have fought for over the past 5 years will pass to dust._\n\nIn late 2016, Major Dmitry Dokuchaev, by this point a senior officer of the FSB’s Second Operational Management Department\n[of Center for Information Security, was arrested by Russian law enforcement and subsequently convicted of high treason. The](https://www.rbc.ru/rbcfreenews/5891c7f29a79470f1bab6942)\ntreason charges stemmed from claims that Dokuchaev, along with other suspects, transferred data about an individual engaging\nin financially motivated threat activity to US intelligence officials. In April 2018, Dokuchaev signed a pre-trial agreement accepting\na conditional guilty plea in relation to charges relating to the transfer of data about financially motivated intrusion actors and was\n[sentenced to 6 years in prison on high treason. On May 13, 2021, the Lefortovo Court of Moscow released Dokuchaev on parole.](https://www.rbc.ru/politics/13/05/2021/609d3f8a9a7947936b467649)\n\n###### Konstantin Kozlovsky\n\nA first-person account, by Kozolvsky, of activity he conducted on behalf of the FSB via the Russian-language publication\n[The Insider:](https://theins.ru/confession/84096)\n\n“Being engaged in computer technology, I communicated on numerous Internet forums. In 2008, I entered into a dialogue\n_about vulnerabilities in email services. During the discussion, I started a dispute for $ 500. as a result of which I demonstrated_\n_the vulnerability using the example of one email, having posted the password for public viewing in the forum. Then I demanded_\n_money from the disputant, offering to meet. In the established place, 2 people approached me. Having determined that I am_\n_the person who hacked the mail, they showed me an FSB officer’s ID and persistently asked me to get into the car._\n\n_I was brought, as I later found out, to the courtyard of the FSB headquarters in the Sverdlovsk region (Yekaterinburg). I_\n_spent two days in a room 3 by 3 meters. No food was given. Only 2 times water in an aluminum bowl. A bucket was brought in_\n_to cope. FSB officers gave a choice: work with them or send them to prisons for hacking mail. I agreed by signing the paper._\n\n_Over the years of cooperation, I have completed many assignments. Ilya is my curator (later at the trial he will indicate_\n_that he meant FSB officer Dmitry Dokuchaev. - editor’s note) gave tasks and supervised me, supplied me with hardware and_\n_software. patronized in matters with law enforcement._\n\n_In recent years, the focus has been on the servers in America and the EU. The instructions for hacking the National_\n_Committee of the Democratic Party of the United States, Hillary Clinton’s correspondence, I successfully completed, transferring_\nthe data on the hard drive to the FSB officer Ilya (850 GB compressed with videos of the hacking).”\n\n[According to Kozlovsky, he worked for Dokuchaev and the FSB since 2008, when he was apprehended by the FSB for gaining](https://thebell.io/ya-byl-zaverbovan-haker-iz-ekaterinburga-vzyal-na-sebya-otvetstvennost-za-vzlomy-v-ssha)\nunauthorized access to an email account, and that since 2008, he had performed numerous tasks for the agency. Kozlovsky also\n[claims that the creation of the Lurk and WannaCry viruses were supervised by employees of FSB and that Dokuchaev and others](https://tvrain.ru/teleshow/notes/konstantin_kozlovskij-453138/)\n[with access to the viruses “could independently work with infected targets”. Such a statement appears to undermine Kozlovsky’s](https://tvrain.ru/teleshow/notes/konstantin_kozlovskij-453138/)\n[credibility or understanding of Russian state-sponsored operations, given that WannaCry is publicly attributed to North Korean](https://www.justice.gov/opa/pr/north-korean-regime-backed-programmer-charged-conspiracy-conduct-multiple-cyber-attacks-and)\nnation-state threat actors.\n\n\n-----\n\n[In October 2020, Kozlovsky was released from the Matrosskaya Tishina prison in Moscow, though some of his activities, such](https://novayagazeta.ru/articles/2021/03/20/na-vzlomannom-angliiskom)\nas using internet and phone services, were restricted. Following his release, Kozlovsky traveled to Moscow, but on March 18, 2021,\n[the Kirov District Court of Ekaterinburg repealed the decision and sent Kozlovsky back to the pre-trial detention center claiming](https://echo.msk.ru/blog/zoya_svetova/2813982-echo/)\n[that Kozlovsky is a flight risk. On March 29, 2021, during a court hearing Kozlovsky gave his wife a note which said that he is under](https://lenta.ru/news/2021/03/29/kozlovsky/)\n“immense psychological pressure” and that he does not wish to commit suicide. A similar note was given to Kozlovsky’s mother\nwhich noted he wants to live but might be killed. After Kozlovsky shared the notes with his family, he was [transferred to the](https://www.znak.com/2021-04-09/glavnogo_figuranta_dela_hakerskoy_gruppy_lurk_ostavili_pod_arestom_po_materialam_fsb)\nmedical building of the pre-trial detention center for an evaluation. The results of the medical examination were not made public.\n\n###### Pavel Vrublevsky\n\n[Pavel Vrublevsky (who also operated under the sobriquet “RedEye”), rose to prominence in the early 2000s as the co-creator](https://krebsonsecurity.com/2011/08/pharma-wars-part-ii/)\n[of the online payment service ChronoPay. According to Vrublevsky in an interview with Recorded Future’s The Record, ChronoPay](http://chronopay)\nwas initially created to act as a payment gateway for several of his unspecified “entertainment projects”, and later grew to include\nsuch partners[9] as “state-owned Rostelecom, Mosenergo, the Russian telecom operator MTS, and the Russian airline Transaero”.\nBoth Forbes and Russian-language media outlet TAdvisor[10] state that Vrublevsky worked closely with Leonid Terekhov, an alleged\nformer member of the Russian military intelligence apparatus, the GRU (Main Intelligence Directorate).\n\n[In 2013, Vrublevsky was sentenced to 2 and a half years in prison for soliciting operators of a botnet to conduct a DDoS attack](https://krebsonsecurity.com/2013/08/pavel-vrublevsky-sentenced-to-2-5-years/)\nagainst a major ChronoPay competitor, Assist. The attack resulted in serious service disruption, preventing the Russian state-run\n[airline, Aeroflot, from selling tickets “for several days, costing the company millions of dollars”. Vrublevsky is also accused of having](https://krebsonsecurity.com/2012/02/whos-behind-the-worlds-largest-spam-botnet/)\nrun a large spam botnet, Rx-Promotion, based on leaked ChronoPay emails “showing ChronoPay executives passing credentials\nto Rx-Promotion’s administrative back end database”.\n\n[Pavel Vrublevsky openly criticized Dokuchaev and his supervisor, Sergei Mikhailov, for harboring cybercriminals: “the whole](https://www.facebook.com/rnp01/posts/3169200963129587)\ncrowd of hackers, including their curators, all together were essentially forum guys from the same forums: Exploit, Maza, and\n[Zloy, which in turn seem to be stupidly owned by Dokuchaev.” Pavel Vrublevsky continues: “Historically, not the smartest guys in](https://t.me/nekolomychenko/154)\nuniform who earned money from these “themes” originate in the same forums and in the same communities that were supervised\nby Major Dokuchaev from the FSB CIB: Maza, Verified, Exploit.”\n\n###### Roman Seleznev\n\n[Seleznev operated carding forums, such as bulba[.]cc and Track2[.]name, until 2011, when he was a victim of a terrorist attack](https://krebsonsecurity.com/wp-content/uploads/2014/07/Seleznev-Indictment-CR11-0070RAJ-1.pdf)\nin Marrakesh, Morocco. The attack left Seleznev in a coma from which he recovered towards the end of 2012. The marketplace\nstopped operating a few months after Seleznev fell into a coma, citing a lack of new stolen material.\n\n[After recovering, Seleznev returned to carding, operating under the username “2Pac”. He created another carder marketplace,](https://s3.documentcloud.org/documents/3673535/Seleznev-Letter.pdf)\nthis time allowing for other hackers to sell information on his platforms. He has also created a website, called POS Dumps, with\nthe intention of teaching carding to new hackers. The website offered a step-by-step guide on how to commit credit card fraud,\nproviding links for necessary tools.\n\n###### Alexey Stroganov\n\nIn the 2003 arrest of the criminal ring, Stroganov was one of 3 key players, along with the ringleader Artur Lyashenko “Bigbuyer”\n[and manager Gerasim Selivanov “Gabrik”. Although Stroganov was sentenced to 6 years in prison in 2006, flint24 continued his](https://biography.wikireading.ru/124060)\ncriminal activities from behind bars and upon release in 2008, Stroganov had established a criminal distribution network for\ncompromised credit card data.\n\n[While Stroganov appears to have maintained ties with government figures like Dengin for years without backlash, his public](https://compromata.net/kiberplohish-flint24-aleksey-stroganov)\naffiliation with President Putin’s judo gym likely crossed a line. The motives and decision-making process behind Stroganov’s\n[second arrest are not public, but the timing of his award as a Turbostroitel board member followed by the FSB’s unusual, high-](https://rucompromat.com/articles/haker_stroganov_voshel_v_piterskuyu_elitu_cherez_dzyudo)\nprofile cybercrime arrests on Stroganov’s birthday indicates that his political overreach triggered a severe backlash from those\nclose to the Russian president, resulting in Stroganov’s second arrest.\n\n9 https://www.forbes[.]ru/forbes/issue/2014-11/270967-sex-drugs-and-rock-n-roll\n\n10 https://tadviser[ ]com/index php/Person:Vrublevsky Pavel Olegovich\n\n\n-----\n\n[In March 2020, the FSB arrested 30 members of a hacker ring. These members were scattered across 11 regions of Russia and](https://tvzvezda.ru/news/vstrane_i_mire/content/2020324943-i7KCz.html)\nincluded citizens of Ukraine and Lithuania. According to the Russian media, the hackers specialized in selling compromised debit\nand credit cards stolen from both Russian and foreign citizens. During the arrest, authorities uncovered over $1 million USD, 3\nmillion rubles, gold bars, computers, servers that were used to host dark web marketplaces, counterfeit ID cards (including Russian\npassports and government IDs), and weapons. Alexey Stroganov was among the arrested hackers and was associated with the\n[GoldenShop and BuyBest credit card shops. Stroganov’s arrest has been officially confirmed by the Moscow General Judicial Court.](https://mos-gorsud.ru/rs/tverskoj/services/cases/criminal-materials/details/b10673db-5554-458d-8e29-0958e9002b0e)\n\n“My opinion is that there are only two options as to why they could have been taken now. First, they worked on Russian targets.\nPerhaps, they could not resist something “tasty” or did not control their partners, and as a result, working on .ru became a fact\nunpleasant for them. The second option - they violated an agreement with the FSB or refused to perform some important tasks,\nor the task, in general, went too far. These are all guesses, but I see no other reason”, an unidentified hacker is quoted as saying\n[in a conversation with Meduza.](https://meduza.io/feature/2020/06/17/poznakomtes-s-hakerom-flint24)\n\n###### Evgeny Nikulin\n\nOpen-source, Russian-language reporting cited Yegor Krasnoborov, 1 of Nikulin’s purported associates, as suggesting that\n[Nikulin was always interested in technology and computers. Krasnoborov claimed that the Russian government would be able to](https://web.archive.org/web/20170720033215if_/https://www.gazeta.ru/social/2016/10/24/10267649.shtml#page2)\nsomehow rescue Nikulin, suggesting that the charges against the hacker are geopolitically motivated and that despite Nikulin\nbeing a highly skilled hacker capable of committing the intrusions, he was “not a member of any hacker groups and acted alone”.\n\n[Yevgeniy Nikulin was convicted in July 2020 for the intrusions against LinkedIn, Formspring, and Dropbox. Later, on September](https://therecord.media/russian-hacker-nikulin-sentenced-to-over-7-years-in-prison-for-tech-industry-breaches/)\n[29, 2020, Nikulin was sentenced to 88 months in prison for breaching several technology firms, capping a drawn-out legal battle](https://therecord.media/russian-hacker-nikulin-sentenced-to-over-7-years-in-prison-for-tech-industry-breaches/)\nthat has involved competing extradition attempts, luxury sports cars, and delays due to the coronavirus outbreak. According to\nthe US Attorney for the Northern District of California David Anderson, “Nikulin’s conviction is a warning to would-be hackers,\nwherever they may be. Computer hacking is not just a crime, it is a direct threat to the security and privacy of Americans. American\nlaw enforcement will respond to that threat regardless of where it originates”.\n\n###### Pyotr Levashov\n\nDespite the seeming tongue-in-cheek postings in underground forums, Levashov was also known to align himself with, or\n[openly support, Kremlin interests. In his 2019 book “Intrusion: A Brief History of Russian Hackers”, Danil Turovsky indicated that](https://it.wikireading.ru/hp0cyGqRzT)\nin 2012, Levashov engaged in a campaign of harassment surrounding Russian presidential candidate Mikhail Prokhorov and in\n2014, as the Russian government supported the conflict in Ukraine, Levashov offered 30% discounts to send spam to “Ukraine,\nthe USA, nations in the EU and ‘others who imposed sanctions’” on Russia.\n\n[In early April 2017, Levashov was arrested in Barcelona, Spain and the Kelihos botnet was seized. Levashov was subsequently](https://www.bbc.com/news/technology-39553250)\n[indicted by the US District of Connecticut District Court. According to the DoJ, in September 2018, “Levashov entered into a guilty](https://www.justice.gov/usao-ct/page/file/1120591/download)\n[plea, thus admitting in open court to his criminal conduct and avoiding the need for a trial”. Later in December 2018, the DoJ](https://www.justice.gov/usao-ct/page/file/1120596/download)\ncharged Levashov with “one count of causing intentional damage to a protected computer, one count of conspiracy, one count of\naccessing protected computers in furtherance of fraud, one count of wire fraud, one count of threatening to damage a protected\ncomputer, two counts of fraud in connection with email and one count of aggravated identity theft”. During his extradition process\nfrom Spain, Levashov’s wife Maria made claims that US law enforcement was questioning Levashov about his involvement with\nRussian nation-state cyber efforts against the West.\n\nOn July 20, 2021, a US judge sentenced Peter Levashov to 33 months, time served, and 3 years of supervised release for\ncreating and operating Kelihos, 1 of the largest spam botnets that ever existed. The judge also ordered that Levashov would have\nhis computer monitored during the supervised release to prevent the former malware coder from engaging in new illegal activities.\n\n\n-----\n\n###### Evgeniy Bogachev\n\nThe GameOver Zeus activity was not the only financially motivated activity conducted by Bogachev. According to a 2014\n[DoJ indictment, he also operated Cryptolocker ransomware, which “infected more than 234,000 computers, with approximately](https://www.justice.gov/opa/pr/us-leads-multi-national-action-against-gameover-zeus-botnet-and-cryptolocker-ransomware)\nhalf of those in the United States. One estimate indicates that more than $27 million in ransom payments were made in just the\nfirst two months since Cryptolocker emerged”. As of this writing, it is unclear if Bogachev remains active in conducting financially\nmotivated intrusion activity or what type of relationship, if any, he may maintain with the Russian government. At least 1 sensitive\nsource has claimed Bogachev has been involved in financing Kremlin-backed disinformation efforts against the West.\n\n\n-----\n\n##### Appendix B: Additional Sources\n\n[• September 27, 2016: Open-source reporting from The New York Times (NYT) suggesting that the Russian intelligence](https://www.nytimes.com/2016/09/28/world/europe/russia-hacker-vladimir-fomenko-king-servers.html)\n\nservices employ Russian domestic infrastructure for hire in order to conduct targeted intrusions for espionage\n\n[• September 29, 2020: Report in The Record about Evgeny Nikulin’s sentencing](https://therecord.media/russian-hacker-nikulin-sentenced-to-over-7-years-in-prison-for-tech-industry-breaches/)\n\n[• October 5, 2020: Interview on The Record with Pavel Vrublevsky](https://therecord.media/be-careful-who-you-bite-an-interview-with-the-businessman-at-the-center-of-one-of-russias-biggest-treason-scandals/)\n\n[• May 5, 2021: Open-source reporting from TruSec further discussing the overlap between the Russian intelligence services](https://blog.truesec.com/2021/05/05/are-the-notorious-cyber-criminals-evil-corp-actually-russian-spies/)\n\nand the cyber criminal ecosystem\n\n[• May 19, 2021: Open-source reporting from Meduza revealing that OPSEC errors in activity reveal links between](https://meduza.io/en/feature/2021/05/19/your-name-is-on-some-fsb-officer-s-list)\n\ncybercriminal elements and the Russian government\n\n[• August 4, 2021: Report in The Record discussing White House response to a BlackMatter interview conducted by](https://therecord.media/white-house-sees-sign-in-new-ransomware-groups-pledge/)\n\nRecorded Future analysts\n\n\n-----\n\n##### Recorded Future Threat Activity Group and Malware Taxonomy\n\nRecorded Future’s research group, Insikt, tracks threat\nactors and their activity, focusing on state actors from China,\nIran, Russia, and North Korea, as well as cybercriminals —\nindividuals and groups — from Russia, CIS states, China,\nIran, and Brazil. We emphasize tracking activity groups and\nwhere possible, attributing them to nation state government,\norganizations, or affiliate institutions.\n\nOur coverage includes:\n\n\n**ADVERSARY**\n\n\n\n   - Government organizations and intelligence\nagencies, their associated laboratories, partners,\nindustry collaborators, proxy entities, and\nindividual threat actors\n\n   - Recorded Future-identified, suspected nationstate activity groups, such as RedAlpha,\nRedBravo, Red Delta, and BlueAlpha and many\nother industry established groups\n\n   - Cybercriminal individuals and groups established\nand named by Recorded Future\n\n   - Newly emerging malware, as well as prolific,\npersistent commodity malware\n\nInsikt Group publicly names a new threat activity group\nor campaign, such as RedFoxtrot, when analysts typically\nhave data corresponding to at least three points on the\nDiamond Model of Intrusion Analysis with at least medium\nconfidence. We will occasionally report on significant activity\nusing a temporary activity clustering name such as TAG-21\nwhere the activity is new and significant but doesn't map\nto existing groupings and hasn't yet graduated or merged\ninto an established activity group. We tie this to a threat\nactor only when we can point to a handle, persona, person,\nor organization responsible. We will write about the activity\nas a campaign in the absence of this level of adversary\ndata. We use the most widely used or recognized name for a\nparticular group when the public body of empirical evidence\nis clear the activity corresponds to a known group.\n\nInsikt Group uses a simple color and phonetic alphabet\nnaming convention for new nation-state threat actor groups\nor campaigns. The color generally corresponds to that\nnation’s flag colors, with more color/nation pairings to be\nadded as we identify and attribute new threat actor groups\nassociated with new nations.\n\nFor newly identified cybercriminal groups, Insikt\nGroup uses a naming convention corresponding to the\nGreek alphabet. Where we have identified a criminal entity\nconnected to a particular country, we will use the appropriate\ncountry color, and where that group may be tied to a specific\ngovernment organization, tie it to that entity specifically.\n\nInsikt Group uses mathematical terms when naming\nnewly identified malware.\n\n\n**INFRASTRUCTURE** **CAPABILITY**\n\n**VICTIM**\n\n\n-----\n\nAbout Recorded Future\n\nRecorded Future is the world’s largest provider of intelligence for enterprise\n\nsecurity. By combining persistent and pervasive automated data collection and analytics\n\nwith human analysis, Recorded Future delivers intelligence that is timely, accurate,\n\nand actionable. In a world of ever-increasing chaos and uncertainty, Recorded Future\n\nempowers organizations with the visibility they need to identify and detect threats\n\nfaster; take proactive action to disrupt adversaries; and protect their people, systems,\n\nand assets, so business can be conducted with confidence. Recorded Future is trusted\n\nby more than 1,000 businesses and government organizations around the world.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2021-0909.pdf",
        "https://papers.vx-underground.org/papers/ICS SCADA/GreyEnergy and BlackEnergy/Connections Between the Russian .pdf"
    ],
    "report_names": [
        "cta-2021-0909.pdf",
        "Connections Between the Russian .pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b5449533-0ff1-4048-999d-7d4bfd8e6da6",
            "created_at": "2022-10-25T16:07:24.114365Z",
            "updated_at": "2025-03-27T02:02:10.111256Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [
                "Operation Dianxun",
                "TA416"
            ],
            "source_name": "ETDA:RedDelta",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Chymine",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3c3ca3f2-9a6a-463e-869c-e9bf02d398d7",
            "created_at": "2022-10-25T16:07:24.59432Z",
            "updated_at": "2025-03-27T02:02:10.29433Z",
            "deleted_at": null,
            "main_name": "Zombie Spider",
            "aliases": [],
            "source_name": "ETDA:Zombie Spider",
            "tools": [
                "Hlux",
                "Kelihos",
                "Waledac"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d9cdc7f-72d6-4e17-89d8-f6323bfcaebb",
            "created_at": "2023-01-06T13:46:38.82716Z",
            "updated_at": "2025-03-27T02:00:02.928984Z",
            "deleted_at": null,
            "main_name": "GreyEnergy",
            "aliases": [],
            "source_name": "MISPGALAXY:GreyEnergy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa90ad17-8852-4732-9dba-72ffb64db493",
            "created_at": "2023-07-11T02:00:10.067957Z",
            "updated_at": "2025-03-27T02:00:03.134199Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [],
            "source_name": "MISPGALAXY:RedDelta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9381a9dc-8d8e-453a-9fe5-301136ff0f83",
            "created_at": "2023-01-06T13:46:38.775762Z",
            "updated_at": "2025-03-27T02:00:02.915732Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "MISPGALAXY:RedAlpha",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "25a38dea-d23b-479b-9548-024e955b8964",
            "created_at": "2022-10-25T16:07:23.305911Z",
            "updated_at": "2025-03-27T02:02:09.729131Z",
            "deleted_at": null,
            "main_name": "Anchor Panda",
            "aliases": [
                "APT 14",
                "Anchor Panda",
                "QAZTeam"
            ],
            "source_name": "ETDA:Anchor Panda",
            "tools": [
                "AngryRebel",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Torn RAT",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cc8271a3-471f-4b8c-9da6-7d50f8ccabaa",
            "created_at": "2022-10-25T16:07:24.107066Z",
            "updated_at": "2025-03-27T02:02:10.109521Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "ETDA:RedAlpha",
            "tools": [
                "AngryRebel",
                "Bladabindi",
                "FF-RAT",
                "Farfli",
                "FormerFirstRAT",
                "Gh0st RAT",
                "Ghost RAT",
                "Jorik",
                "Moudour",
                "Mydoor",
                "NetHelp Infostealer",
                "NetHelp Striker",
                "PCRat",
                "RedAlpha",
                "ffrat",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbb1ee4e-bbe9-44de-8f46-8e7fec09f695",
            "created_at": "2022-10-25T16:07:24.120424Z",
            "updated_at": "2025-03-27T02:02:10.112981Z",
            "deleted_at": null,
            "main_name": "RedFoxtrot",
            "aliases": [
                "Moshen Dragon",
                "Nomad Panda",
                "TEMP.Trident"
            ],
            "source_name": "ETDA:RedFoxtrot",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Fucobha",
                "GUNTERS",
                "Gen:Trojan.Heur.PT",
                "Icefog",
                "Impacket",
                "Kaba",
                "Korplug",
                "PCShare",
                "POISONPLUG.SHADOW",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "XShellGhost",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1631129171,
    "ts_modification_date": 1631129317,
    "files": {
        "pdf": "https://archive.orkl.eu/362dc8dce2e5f54302893c8245f5d74ac05de4a4.pdf",
        "text": "https://archive.orkl.eu/362dc8dce2e5f54302893c8245f5d74ac05de4a4.txt",
        "img": "https://archive.orkl.eu/362dc8dce2e5f54302893c8245f5d74ac05de4a4.jpg"
    }
}