{
    "id": "cd649a6e-38f8-4d37-b61d-03afa21ecd45",
    "created_at": "2023-01-12T15:07:18.275933Z",
    "updated_at": "2025-03-27T02:15:38.183826Z",
    "deleted_at": null,
    "sha1_hash": "ad415631435d2946eeff4610371c028973150d43",
    "title": "2017-09-27 - Threat Actor Profile- TA505, From Dridex to GlobeImposter",
    "authors": "",
    "file_creation_date": "2022-05-28T19:50:36Z",
    "file_modification_date": "2022-05-28T19:50:36Z",
    "file_size": 1312155,
    "plain_text": "# Threat Actor Profile: TA505, From Dridex to GlobeImposter\n\n**[proofpoint.com/us/threat-insight/post/threat-actor-profile-ta505-dridex-globeimposter](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta505-dridex-globeimposter)**\n\n\nSeptember 27, 2017\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nThreat Actor Profile: TA505, From Dridex to GlobeImposter\n\n\n-----\n\nSeptember 27, 2017 Proofpoint Staff\n\n**Overview**\n\nProofpoint researchers track a wide range of threat actors involved in both financially\nmotivated cybercrime and state-sponsored actions. One of the more prolific actors that we\ntrack - referred to as TA505 - is responsible for the largest malicious spam campaigns we\nhave ever observed, distributing instances of the Dridex banking Trojan, Locky [ransomware,](https://www.proofpoint.com/us/threat-reference/ransomware)\nJaff ransomware, The Trick banking Trojan, and several others in very high volumes.\n\nBecause TA505 is such a significant part of the email threat landscape, this blog provides a\n[retrospective on the shifting malware, payloads, and campaigns associated with this actor.](https://www.proofpoint.com/us/threat-reference/malware)\nWe examine their use malware such as Jaff, Bart, and Rockloader that appear to be\nexclusive to this group as well as more widely distributed malware like Dridex and Pony.\nWhere possible, we detail the affiliate models with which they are involved and outline the\ncurrent state of TA505 campaigns.\n\nThe infographic in Figure 1 traces the earliest known dates on which TA505 began\ndistributing particular malware strains, beginning with Dridex in 2014 and most recently when\nthey elevated GlobeImposter and Philadelphia from small, regionally targeted ransomware\nvariants to global threats.\n\n\n-----\n\n-----\n\n-----\n\n_Figure 1: Timeline of TA505 malware introductions_\n\nOf note is TA505’s use of the [Necurs botnet [1] to drive their massive spam campaigns. As](https://www.proofpoint.com/us/threat-insight/post/necurs-botnet-outage-crimps-dridex-and-locky-distribution)\nwe saw in both 2016 and 2017, disruptions to Necurs went hand-in-hand with quiet periods\n[from TA505. When the botnet came back online, TA505 campaigns quickly returned [2],](https://www.proofpoint.com/us/threat-insight/post/necurs-botnet-returns-with-updated-locky-ransomware-in-tow)\nusually at even greater scale than before the disruption.\n\nThe following is a more detailed description of the malware and notable campaign attributes\nassociated with TA505.\n\n**Dridex**\n\nThe now infamous Dridex banking Trojan can trace much of its DNA to [Cridex and Bugat [3].](https://www.secureworks.com/research/dridex-bugat-v5-botnet-takeover-operation)\nDridex itself appeared shortly after the Zeus banking Trojan was taken down. It was originally\n[documented [4] on July 25, 2014 (or June 22, 2014, according to Kaspersky [5]) and the first](https://securelist.com/dridex-a-history-of-evolution/78531/)\ncampaign we observed in which TA505 distributed Dridex occurred three days later on July\n28. Although a number of actors have distributed Dridex, TA505 operates multiple affiliate\nIDs, including what appears to be the earliest recorded affiliate, botnet ID 125. These early\ncampaigns were distributed via the Lerspeng downloader while later campaigns occasionally\nused Pony or Andromeda as intermediate loaders to distribute various instances of Dridex.\n\nAlthough TA505 initially distributed Dridex botnet ID 125, they were observed using botnet ID\n220 in March 2015 and botnet ID 223 in December of that year. Later, they were also\nassociated with botnet IDs 7200 and 7500. These botnets generally target the following\nregions:\n\n125: UK, US, and Canada\n220: UK and Australia\n223: Germany\n7200: UK\n7500: Australia\n\nThe group has routinely distributed the malware in larger campaigns than any other actor,\nregularly spamming millions of recipients.\n\n\n-----\n\n_Figure 2: Indexed Dridex message volume since TA505 began distributing the banking_\n_Trojan in 2014_\n\nTA505 continued distributing Dridex through early June 2017 using a range of email\nattachments. Most recently these included PDF attachments with embedded Microsoft Word\ndocuments bearing malicious macros that call PowerShell commands that install Dridex.\nHowever, because of the length of time for which the group has been distributing Dridex,\ndistribution mechanisms trace the state of the art for the last two years of email campaigns\nwith techniques ranging from straight macro documents to a variety of zipped scripts.\n\n**Shifu**\n\nIn October 2015, we observed several campaigns in which TA505 targeted Japanese and\n[UK organizations with the Shifu banking Trojan [6]. Shifu is relatively common in Japan but](https://www.proofpoint.com/us/threat-insight/post/Not-Yet-Dead)\nwas a new addition to TA505’s toolbox. It appears that they introduced Shifu after high-profile\nlaw enforcement actions impacted Dridex distribution. However, TA505 was also among the\nfirst actors to return to high-volume Dridex distribution this same month, even as they\ndemonstrated their ability to diversify and deliver threats beyond Dridex.\n\nAs with many of their other campaigns, TA505 delivered Shifu through macro-laden Microsoft\nOffice document attachments.\n\n**Locky**\n\n\n-----\n\nTA505 [introduced Locky [7] ransomware in February 2016. After alternating for over four](https://www.proofpoint.com/us/threat-insight/post/Dridex-Actors-Get-In-the-Ransomware-Game-With-Locky)\nmonths with Dridex, Locky became the payload of choice for TA505, eclipsing earlier\ncampaigns in terms of volume and reach. TA505 stopped distributing Dridex in July 2016,\nrelying almost exclusively on Locky through December of that year. Like Dridex, Locky is\nalso distributed in an affiliate model; TA505 exclusively distributes Locky Affid=3.\n\n_Figure 3: Indexed Locky message volume since TA505 began distributing the ransomware in_\n_early 2016_\n\nFigure 4 shows the evolution of Dridex and Locky campaigns over the course of over two\nyears:\n\nLow-volume campaigns distributed Dridex during much of 2015\nModerate volumes of Dridex appeared from the end of 2015 through February 2016; it\nis worth noting that these “moderate volume” campaigns were, at the time, the largest\ncampaigns ever observed.\nAlternating Dridex and Locky campaigns of varying volumes appeared through May\n2016.\n\n\n-----\n\nA lull in [June 2016 [1] associated with a disruption in the Necurs botnet; TA505 is](https://www.proofpoint.com/us/threat-insight/post/necurs-botnet-outage-crimps-dridex-and-locky-distribution)\nheavily reliant on this massive botnet to send out high-volume malicious spam\ncampaigns and disappearances of TA505 activity frequently accompany disruptions in\nNecurs.\nExtremely high-volume campaigns distributing Locky exclusively in July 2016,\nconsistently delivering tens of millions of messages.\nAnother lull in November 2016 saw the complete absence of Locky and Dridex, while\nhigh-volume campaigns reappeared in December, albeit at lower volumes than during\nthe Q3 2016 peak.\nAn expected break following the 2016-2017 winter holidays turned into an unexplained\nthree-month hiatus [8] for TA505.\nLarge-scale Dridex and Locky campaigns returned in Q2 2017, although none reached\nthe volumes we observed in mid-2016.\nLater campaigns saw new attachment types, even as Dridex and Locky payloads\nremained largely unchanged.\nLocky distribution ceased in June and July but returned in August with volumes rivaling\nthe peaks of 2016.\nTA505 turned to URLs in early August 2017 to distribute Locky, finally eschewing the\ndocument or zipped-script attachments that have characterized the majority of their\nLocky campaigns since February 2016; most of these URLs linked to malicious\ndocuments and scripts.\nBy later August, TA505 had turned back to large attachment campaigns, primarily\ndistributing various zipped scripts that downloaded Locky. The group continued this\npattern with occasional URL campaigns and attached HTML files bearing malicious\nlinks.\n\n\n-----\n\n_Figure 4: Indexed Dridex vs. Locky message volume since TA505 began distributing Dridex_\n_in early 2015_\n\n**Rockloader**\n\n[TA505 first introduced Rockloader [9] in April 2016 as an intermediate loader for Locky. At](https://www.proofpoint.com/us/threat-insight/post/Locky-Ransomware-Cybercriminals-Introduce-New-RockLoader-Malware)\nthat time, Rockloader was the initial payload downloaded by malicious attached JavaScript\nfiles. Once Rockloader was installed, it downloaded Locky and, in some cases, Pony and\nKegotip. Pony is another loader with information stealing capabilities while Kegotip is an\ncredential and email address harvesting malware strain that would appear in a small number\nof TA505 campaigns the following year as the primary payload.\n\n**Bart**\n\n[Bart ransomware [10] appeared for exactly one day on June 24, 2016. It was a secondary](https://www.proofpoint.com/us/threat-insight/post/New-Bart-Ransomware-from-Threat-Actors-Spreading-Dridex-and-Locky)\npayload downloaded by Rockloader, the initial payload in a large email campaign using\nzipped JavaScript attachments. The Bart ransom screen was visually similar to Locky’s but\nBart had one important distinction: it could encrypt files without contacting a command and\ncontrol server. However, we have not seen Bart since, suggesting that this was either an\nexperiment or that the ransomware did not function as expected for TA505.\n\n**Kegotip**\n\nTA505 briefly distributed the Kegotip information stealer in April 2017. Across two campaigns\nof several million messages each, the actor used both macro-laden Microsoft Word\ndocuments and zipped VBScript attachments to install the Trojan on potential victim PCs.\nKegotip is an infostealer (credentials and email addresses) used to facilitate other crimeware\nactivities. It steals credentials from various FTP clients, Outlook, and Internet Explorer. It also\nwill gather email addresses scraped from files stored on the computer. This information can\nbe used to facilitate future spam campaigns by the perpetrator or may be sold to other\nactors.\n\n**Jaff**\n\nTA505 [introduced Jaff ransomware [11] in May 2017. Jaff was not dramatically different from](https://www.proofpoint.com/us/threat-insight/post/jaff-new-ransomware-from-actors-behind-distribution-of-dridex-locky-bart)\nother ransomware strains. The payment portal was initially similar to the one used by Locky\nand Bart. It was primarily notable for its high-volume campaigns and its association with\nTA505, given the actor’s propensity for massive campaigns and ability to dominate the email\nlandscape. Jaff appeared in multi-million message campaigns for roughly a month and then\npromptly disappeared as soon as a decryptor was released in mid-June 2017.\n\n**The Trick**\n\n\n-----\n\nThe Trick, also known as Trickbot, is another banking Trojan that TA505 first began\ndistributing in June of 2017, although we have observed The Trick in the wild since fall 2016,\nusually in regionally targeted campaigns. It is generally considered a descendant of the\nDyreza banking Trojan and features mutliple modules. The main bot is responsible for\npersistence, the downloading of additional modules, loading affiliate payloads, and loading\nupdates for the malware.\n\nAs with much of the malware distributed by TA505, The Trick has appeared in frequent, highvolume campaigns. The campaigns used a mix of attached zipped scripts (WSF, VBS),\nmalicious Microsoft Office documents (Word, Excel), HTML attachments, passwordprotected Microsoft Word documents, links to malicious JavaScript, and other vectors. The\nlast TA505 campaigns featuring The Trick appeared in mid-September 2017 with payloads\nalternating between Locky and The Trick.\n\n**Philadelphia**\n\nPhiladelphia ransomware has been circulating since September 2016. It first attracted our\nattention in [April of this year [12] when we observed an actor customizing the malware for](https://www.proofpoint.com/us/threat-insight/post/philadelphia-ransomware-customization-commodity-malware)\nuse in highly targeted campaigns. In a brief stint, TA505 distributed it in one large campaign\nin July, but we have not seen them use it since.\n\n**GlobeImposter**\n\nGlobeImposter is another ransomware strain that saw relatively small-scale distribution until\nTA505 began including it in malicious spam campaigns at the end of July 2017. TA505\nprimarily distributed GlobeImposter in zipped script attachments through the beginning of\nSeptember 2017. Again, GlobeImposter is not particularly innovative but TA505 elevated the\nransomware from a regional variant to a major landscape feature during roughly six weeks of\nlarge campaigns.\n\n**Conclusion**\n\nTA505 is arguably one of the most significant financially motivated threat actors because of\nthe extraordinary volumes of messages they send. The variety of malware delivered by the\ngroup also demonstrates their deep connections to the underground malware scene. At the\ntime of writing, Locky ransomware remains their malware of choice, even as the group\ncontinues to experiment with a variety of additional malware.\n\nThe history of TA505 is instructive because they\n\nHave proven to be highly adaptable, shifting techniques and malware frequently to\n“follow the money”, while largely sticking to successful strategies where possible\nAre flexible, using largely interchangeable components, innovating where necessary on\nthe malware front and using off-the-shelf malware where possible\n\n\n-----\n\nOperate at massive scale, consistently driving global trends in malware distribution and\nmessage volume.\n\nEach of these elements makes TA505 a magnifying lens through which to consider the\nframework employed by many modern threat actors. Such a framework typically consists of\nfive elements:\n\n1. Actor: The attacker organization; real humans driven by various motivations -- In the\n\ncase of TA505, the motivations are financial.\n2. Vector: The delivery mechanism; email via attacker-controlled or leased spam botnet -\nNecurs for TA505 -- remains a dominant vector, and certainly the vector of choice for\nthis actor.\n3. Hoster: The sites hosting malware; if malware is not directly attached to email, then\n\nmacro-enabled documents, malicious scripts, or exploit kits will pull payloads from\nthese servers. TA505 almost exclusively hosts malware in this way, although they vary\nthe means of installing their final payloads on victim machines.\n4. Payload: The malware; software that will enable the attacker to make use of (control,\n\nexfiltrate data from, or download more software to) the target computer. For TA505, the\npayloads have shifted over the years and months of their activity, but their sending and\nhosting infrastructure make these changes relatively simple to implement.\n5. C&C: The command and control channel that serves to relay commands between the\n\ninstalled malware and attackers. TA505 operates a variety of C&C servers, allowing it\nto be resilient in the case of takedowns, sinkholes, and other defensive operations.\n\nThis framework enables attackers to operate in robust, horizontally segmented ecosystems,\nspecializing in developing certain parts of the framework, and selling or leasing to others;\nsuch frameworks are resistant to takedowns and individual component failures. But such\nframeworks also increase attackers' detection surface, that is, their susceptibility to\ndiscovery. In the case of TA505, while most elements of the framework are well-developed,\ntheir reliance on the Necurs botnet for the sending high-volume malicious spam - a key\ncomponent of the Vector element above - appears to be their Achilles heel.\n\nBy tracking each of these elements, defenders can infer other elements and take the\nappropriate defensive measures. We will continue to track this actor, which, despite\nsignificant occasional disruptions to their sending infrastructure, appears to be on track to\ncontinue driving the majority of malicious email in the months to come.\n\n**References**\n\n[1] https://www.proofpoint.com/us/threat-insight/post/necurs-botnet-outage-crimps-dridexand-locky-distribution\n\n[2] https://www.proofpoint.com/us/threat-insight/post/necurs-botnet-returns-with-updatedlocky-ransomware-in-tow\n\n\n-----\n\n[3] [https://www.secureworks.com/research/dridex-bugat-v5-botnet-takeover-operation](https://www.secureworks.com/research/dridex-bugat-v5-botnet-takeover-operation)\n\n[4] [https://www.s21sec.com/en/blog/2014/07/new-feodo-variant-follows-geodo-steps/](https://www.s21sec.com/en/blog/2014/07/new-feodo-variant-follows-geodo-steps/)\n\n[5] [https://securelist.com/dridex-a-history-of-evolution/78531/](https://securelist.com/dridex-a-history-of-evolution/78531/)\n\n[6] [https://www.proofpoint.com/us/threat-insight/post/Not-Yet-Dead](https://securelist.com/dridex-a-history-of-evolution/78531/)\n\n[7] https://www.proofpoint.com/us/threat-insight/post/Dridex-Actors-Get-In-the-RansomwareGame-With-Locky\n\n[8] [https://www.proofpoint.com/us/threat-insight/post/2017-q1-threat-report-findings](https://www.proofpoint.com/us/threat-insight/post/Dridex-Actors-Get-In-the-Ransomware-Game-With-Locky)\n\n[9] https://www.proofpoint.com/us/threat-insight/post/Locky-Ransomware-CybercriminalsIntroduce-New-RockLoader-Malware\n\n[10] https://www.proofpoint.com/us/threat-insight/post/New-Bart-Ransomware-from-ThreatActors-Spreading-Dridex-and-Locky\n\n[11] https://www.proofpoint.com/us/threat-insight/post/jaff-new-ransomware-from-actorsbehind-distribution-of-dridex-locky-bart\n\n[12] https://www.proofpoint.com/us/threat-insight/post/philadelphia-ransomwarecustomization-commodity-malware\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-09-27 - Threat Actor Profile- TA505, From Dridex to GlobeImposter.pdf"
    ],
    "report_names": [
        "2017-09-27 - Threat Actor Profile- TA505, From Dridex to GlobeImposter.pdf"
    ],
    "threat_actors": [
        {
            "id": "f276b8a6-73c9-494a-8ab2-13e2f1da4c53",
            "created_at": "2022-10-25T16:07:24.441133Z",
            "updated_at": "2025-03-27T02:02:10.231958Z",
            "deleted_at": null,
            "main_name": "Achilles",
            "aliases": [],
            "source_name": "ETDA:Achilles",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536038,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653767436,
    "ts_modification_date": 1653767436,
    "files": {
        "pdf": "https://archive.orkl.eu/ad415631435d2946eeff4610371c028973150d43.pdf",
        "text": "https://archive.orkl.eu/ad415631435d2946eeff4610371c028973150d43.txt",
        "img": "https://archive.orkl.eu/ad415631435d2946eeff4610371c028973150d43.jpg"
    }
}