{
    "id": "cd86230d-89a7-4bdd-b713-ad47185da54e",
    "created_at": "2023-01-12T15:07:38.064568Z",
    "updated_at": "2025-03-27T02:16:11.678773Z",
    "deleted_at": null,
    "sha1_hash": "f3a2749777e2f5f767eff491b94ab4d334338bf6",
    "title": "2020-01-30 - Fake Interview- The New Activity of Charming Kitten",
    "authors": "",
    "file_creation_date": "2022-05-28T04:51:14Z",
    "file_modification_date": "2022-05-28T04:51:14Z",
    "file_size": 103362,
    "plain_text": "# Fake Interview: The New Activity of Charming Kitten\n\n**[blog.certfa.com/posts/fake-interview-the-new-activity-of-charming-kitten/](https://blog.certfa.com/posts/fake-interview-the-new-activity-of-charming-kitten/)**\n\n**The novel phishing campaign to steal email accounts of public figures around the**\n**world**\n\nCertfa Lab · 2020.1.30\n\nFake Interview: The New Activity of Charming Kitten\n\n## Introduction\n\nCertfa Lab has identified a new series of phishing attacks from the Charming Kitten,1 the\nIranian hacking group who has a close relationship with Iran’s state and Intelligence\nservices. According to our investigation, these new attacks have targeted journalists, political\nand human rights activists. These phishing attacks are in line with the previous activities of\nthe group that companies like ClearSky2 and Microsoft3 have reported in detail in September\nand October 2019.\n\n\nAs we previously reported the activities of the Charming Kitten in 2018,4 our research\nindicates the Charming Kitten is still trying to target private and government institutions, think\ntanks and academic institutions, organizations with ties to the Baha’i community, and many\nothers in European countries, the United States, United Kingdom, Saudi Arabia, to extract\ninformation from them.\n\nOur findings show that these new attacks by Charming Kitten are focused on stealing email\naccount information of the victims and finding information about their contacts/networks.\nAlso, our research shows that the group has recently participated in designing a malware for\nWindows machines but the spectrum and the number of its targets is still not clear for us.\n\n## Phishing via Fake Interviews\n\nPhishing is one of the main tactics that has been used by the Charming Kitten, and social\nengineering and fake emails are the usual methods of executing it. In this campaign, the\nCharming Kitten has used the identity of a former Wall Street Journal (WSJ) journalist and\ncreated a fake interview scenario to target their victims. It must be noted that in the recent\nmonths, the group has used scenarios like “Invitation to a Deutsche Welle Webinar” and\n“CNN Interview” with the related topics of Iran and international affairs in order to trick their\ntargets.\n\n\n-----\n\n**Step 1 - Gaining Trust: In one of the cases, the hackers forged the New York Times**\njournalist Farnaz Fassihi’s identity as a Wall Street Journal reporter - where she used to work\n\n- to send interview request emails to victims and guide them to their phishing websites. In the\nfirst step of the fake interview, emails were sent from farnaz.fassihi [at] gmail [dot] com to\ngain the victims’ trust. The below image is a sample of the content.\n\nA sample of the fake interview request via an email\nFigure 1. A sample of the fake interview request via an email\n\n**Translation:**\nHello *** ***** ******\n_My name is Farnaz Fasihi. I am a journalist at the Wall Street Journal newspaper._\n_The Middle East team of the WSJ intends to introduce successful non-local individuals_\nin developed countries. Your activities in the fields of research and philosophy of\nscience led me to introduce you as a successful Iranian. The director of the Middle\nEast team asked us to set up an interview with you and share some of your important\nachievements with our audience. This interview could motivate the youth of our\nbeloved country to discover their talents and move toward success.\nNeedless to say, this interview is a great honor for me personally, and I urge you to\naccept my invitation for the interview.\nThe questions are designed professionally by a group of my colleagues and the\nresulting interview will be published in the Weekly Interview section of the WSJ. I will\nsend you the questions and requirements of the interview as soon as you accept.\n*Footnote: Non-local refers to people who were born in other countries.\nThank you for your kindness and attention.\nFarnaz Fasihi\n\nIn these emails, all the links in the footnotes (Figure 2), including social media links, WSJ\nand Dow Jones websites, are all in the short URL format. As a result, by clicking on them,\nthe hackers can guide the victim to legitimate addresses while getting basic information\nabout the victim’s device such as IP address, the type of Operating System, and the browser.\nThis is a common method of gathering information by hackers in order to prepare for the\nmain attacks based on the victims’ devices.\n\nDetails of short URL that allows hackers to collect basic information about the target\nFigure 2. Details of short URL that allows hackers to collect basic information about the target5\n\n**Step 2, The Main Attack: After communication and relative trust are established through the**\ninitial email, hackers send their victim an exclusive link as a file that contains the interview\nquestions. According to our samples, the Charming Kitten has been using a page that is\nhosted on Google Sites (Figure 3). This method is a relatively new tactic that has been\n\n\n-----\n\nwidely used in phishing attacks by hackers in the past year in order to make the targets trust\nthe destination domain, for example this URL: hxxps://sites.google[.]com/view/the-wallstreet/xxxx. By using this tactic, the hacker can evade the spam detections.\n\nA sample of fake WSJ page that is hosted on Google Site.\nFigure 3. A sample of fake WSJ page that is hosted on Google Site.\n\nAfter clicking the download button on the Google Site page (Figure 3), the target is sent to\nanother fake page in two-step-checkup[.]site domain where login credential details of his/her\nemail such as the password and two factor authentication (2FA) code are requested by\nphishing kits.\n\nThe structure of the phishing page is listed below:\n\nhxxps://two-step-checkup[.]site/securemail/secureLogin/challenge/url?ucode=xxxxxxxx&service=mailservice&type=password\nhxxps://two-step-checkup[.]site/securemail/secureLogin/challenge/url?ucode=xxxxxxxx&service=mailservice&type=smscode\nhxxps://two-step-checkup[.]site/ymail/secureLogin/challenge/url?ucode=xxxxxxxx&service=mailservice&type=password\nhxxps://two-step-checkup[.]site/ymail/secureLogin/challenge/url?ucode=xxxxxxxx&service=mailservice&type=smscode\n\nUsing phishing kits such as Modlishka7 to steal passwords and two factor authentication\ncodes is an important step in targeted attacks, which has been widely used by hackers in the\npast year and many reports have been written about them .8 As mentioned, Certfa Lab\npublished an extended report in 2018 about the Charming Kitten and their use of this\nmethod. Figure 4 is a sample of the phishing page that was used to steal the SMS\nauthentication code.\n\n\nA sample of a phishing attack to steal 2FA code via SMS\nFigure 4. A sample of a phishing attack to steal 2FA code via SMS\n\n## Malware Development\n\nOne important point that caught our attention in this campaign was using “pdfreader.exe”, a\npiece of malware with a backdoor feature. Our investigation shows this file was first uploaded\nin VirusTotal by an anonymous user on 3 October 2019 .9\n\nThe technical assessment of the malware’s function shows that the developers of malware\nare directly in contact with the people behind the recent phishing attacks, and it could be\ninterpreted as all these malicious activities being done by one group, which we believe to be\nthe Charming Kitten.\n\n\n-----\n\n**pdfReader.exe Function: This malware, which is identified as a Win32/Backdoor by**\nantiviruses, is a mid-level piece of malware - due to lack of design sophistication - with\nvarious harmful capabilities. Our assessment shows the malware causes changes in the\nWindows’ Firewall and Registry settings in order to run automatically itself and gathers\ninformation from the victim’s device and sends it to its developer. This feature allows the\nhackers to run new malware and spyware remotely on the victim’s target. Figure 5 shows the\nprocess graph of this malware.\n\nThe process graph of pdfReader.exe\nFigure 5. The process graph of pdfReader.exe\n\n**pdfReader.exe Connections: A noteworthy point about this malware is its connection and**\ninteraction with 51.89.237.234 on port 80. Before its original version was uploaded on\nVirusTotal on 03 October 2019 11:00:25GMT, pdfreader.exe was submitted on VirusTotal as\na pdfreader.zip four hours earlier, on 3 October 2019 07:14:22GMT, which can be seen in the\nIP history 51.89.237.233 (Figure 6). Also, the server with IP address of 51.89.237.234 is\nused to host “software-updating-managers[.]site” and “malcolmrifkind[.]site”.\n\nIP history of 51.89.237.233 on VirusTotal\nFigure 6. IP history of 51.89.237.233 on VirusTotal\n\n## Charming Kitten’s Footprints\n\nOur research on the history of phishing websites in recent attacks, such as two-stepcheckup[.]site, shows the attackers use “ns11025.ztomy[.]com” and “ns21025.ztomy[.]com”\nas the Name Servers (NS) on 14 October 2019. These servers were previously used for\nother phishing websites by the Charming Kitten.\n\nThe similarities between the method of managing and sending HTTP requests in “two-stepcheckup[.]site” server with the latest techniques used by this group is further evidence of\nCharming Kitten’s connection to these attacks. In this technique, if sent requests to the host\nserver of the phishing kit are denied, the user is directed to a legitimate website like Google,\nYahoo!, or Outlook by “301 Moved Permanently” and “Found redirect 302” responses. As a\nresult, this method makes it harder for different pages and sections of phishing websites to\nbe exposed to the public.\n\nFigure 7 is a sample of public requests from “two-step-checkup[.]site” that has been\nredirected to outlook.live.com. In this scenario, the user does not have a valid request\naccording the phishing kit, therefore, the real webpage - not the phishing one - is shown to\nthe target.\n\nManagement and redirecting invalid request on two-step-checkup[.]site\nFigure 7. Management and redirecting invalid request on two-step-checkup[.]site[10]\n\n\n-----\n\nAnother noteworthy point about the footprints of the Charming Kitten in this campaign is the\nsimilar settings that have been used for servers. Our research shows that in the second half\nof 2019, most servers used by the Charming Kitten were based on Windows machines and\nOpenSSL, PHP, Apache, and Microsoft-HTTP API or similar versions. Although this point is\nnot enough to prove this claim, the default settings in response to HTTP requests can be the\ngroup’s footprint. A few examples are listed below.\n\nCharming Kitten similar servers settings\n\n## The Range of Attacks\n\nAssessments of the network infrastructure that was used in these attacks shows the\nCharming Kitten uses a variety of servers and domains to trap its targets. Some of these\nservers and domains are related to the recent attacks and some occurred during the second\nhalf of 2019. Table 1 lists the latest domains and IPs of the Charming Kitten and Table 2 lists\nthe related domains and IPs.\n\nList of latest domains and IPs of the Charming Kitten\nTable 1. List of latest domains and IPs of the Charming Kitten\n\nList of related domains and IPs of the Charming Kitten\nTable 2. List of related domains and IPs of the Charming Kitten11\n\n## Conclusion\n\nThis new series of phishing attacks by the Charming Kitten are in line with previous activities\nseen from their group. For example, we identified similar settings for the servers used in this\nattack with their previous campaigns.\n\nThe main focus of this phishing campaign was stealing email account information of the\nvictims, and finding information about their contacts/networks. One example detailed in this\nreport is there impersonation of public figures such as a WSJ reporter.\n\nThe Charming Kitten used Google Sites for their phishing attack, and Certfa believes that\nthey work on the development of a series of malware for their future phishing attack\ncampaign.\n\n### IOCs\n\n51.38.87[.]199\n51 89 237[ ]235\n\n\n-----\n\n51.89.237[.]233\n51.89.237[.]234\n51.255.157[.]110\n185.141.63[.]8\n185.141.63[.]135\n185.141.63[.]156\n185.141.63[.]157\n185.141.63[.]160\n185.141.63[.]161\n185.141.63[.]162\n185.141.63[.]170\n185.141.63[.]172\nfinance-usbnc[.]info\nservice-activity-checkup[.]site\ntwo-step-checkup[.]site\nservice-issues[.]site\nphonechallenges-submit[.]site\nmalcolmrifkind[.]site\nsoftware-updating-managers[.]site\ncustomers-service.ddns[.]net\nyah00[.]site\ncpanel-services[.]site\ninstagram-com[.]site\nrecovery-options[.]site\nskynevvs[.]com\nleslettrespersanes[.]net\ninztaqram[.]ga\nniaconucil[.]org\ndrive-accounts[.]com\nunirsd[.]com\nisis-online[.]net\naccounts-drive[.]com\nw3-schools[.]org\nseisolarpros[.]org\nbahaius[.]info\nacconut-verify[.]com\ncustomers-activities[.]site\nsystem-services[.]site\n3d67ce57aab4f7f917cf87c724ed7dab\n542128ab98bda5ea139b169200a50bce\n\n## Footnotes:\n\n\n-----\n\n[1. Mitre, “Charming Kitten”. Accessed December 17, 2019. https://s.certfa.com/pccOGX](https://s.certfa.com/pccOGX)\n\n↩\n\n2. ClearSky Cyber Security (2019), “The Kittens Are Back in Town Charming Kitten –\n\nCampaign Against Academic Researchers”. Accessed December 10, 2019.\n[https://s.certfa.com/JPUSoz](https://s.certfa.com/JPUSoz)\n\nClearSky Cyber Security (2019), “The Kittens Are Back in Town 2 – Charming Kitten\nCampaign Keeps Going on, Using New Impersonation Methods”. Accessed December\n[10, 2019. https://s.certfa.com/z0NdFI](https://s.certfa.com/z0NdFI) ↩\n\n3. Microsoft (2019), “Recent cyberattacks require us all to be vigilant”. Accessed\n\n[December 16, 2019. https://s.certfa.com/Il3VLH](https://s.certfa.com/Il3VLH) ↩\n\n4. Certfa Lab (2019). “The Return of The Charming Kitten”. Accessed December 12,\n\n[2019. https://s.certfa.com/i8Ad16](https://s.certfa.com/i8Ad16) ↩\n\n5. URLScan.io, “A Shorten link sample to collect basic info of victims”. Accessed\n\n[December 16, 2019. https://s.certfa.com/x8IsaI](https://s.certfa.com/x8IsaI) ↩\n\n6. Certfa Lab (2019). “Weaponizing of Google Cloud Storage for phishing attacks”.\n\n[Accessed December 16, 2019. https://s.certfa.com/5myHcV](https://s.certfa.com/5myHcV) ↩\n\n7. Latest Hacking News (2019). “Modlishka – The Tool That Can Bypass Two-Factor\n\n[Authentication Via Phishing”. Accessed December 17, 2019. https://s.certfa.com/iIJQbl](https://s.certfa.com/iIJQbl)\n↩\n\n8. Certfa Lab (2019). “The Return of The Charming Kitten”. Accessed December 12,\n\n[2019. https://s.certfa.com/i8Ad16](https://s.certfa.com/i8Ad16) ↩\n\n9. First Submission of the sample on VirusTotal on 3 October 2019 at 11:00 GMT.\n\n[Accessed December 12, 2019. https://s.certfa.com/hZxpoH](https://s.certfa.com/hZxpoH) ↩\n\n10. URLScan.io, “Redirecting invalid request on two-step-checkup[.]site”. Accessed\n\n[December 16, 2019. https://s.certfa.com/oPa1mY](https://s.certfa.com/oPa1mY) ↩\n\n11. ClearSky Cyber Security (2019), “The Kittens Are Back in Town Charming Kitten –\n\nCampaign Against Academic Researchers”. Accessed December 10, 2019.\n[https://s.certfa.com/JPUSoz](https://s.certfa.com/JPUSoz)\n\nClearSky Cyber Security (2019), “The Kittens Are Back in Town 2 – Charming Kitten\nCampaign Keeps Going on, Using New Impersonation Methods”. Accessed December\n[10, 2019. https://s.certfa.com/z0NdFI](https://s.certfa.com/z0NdFI) ↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-30 - Fake Interview- The New Activity of Charming Kitten.pdf"
    ],
    "report_names": [
        "2020-01-30 - Fake Interview- The New Activity of Charming Kitten.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536058,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1653713474,
    "ts_modification_date": 1653713474,
    "files": {
        "pdf": "https://archive.orkl.eu/f3a2749777e2f5f767eff491b94ab4d334338bf6.pdf",
        "text": "https://archive.orkl.eu/f3a2749777e2f5f767eff491b94ab4d334338bf6.txt",
        "img": "https://archive.orkl.eu/f3a2749777e2f5f767eff491b94ab4d334338bf6.jpg"
    }
}