{
    "id": "cdd81022-a43d-492c-8792-b862fd33a218",
    "created_at": "2022-10-25T16:48:20.385378Z",
    "updated_at": "2025-03-27T02:05:27.907719Z",
    "deleted_at": null,
    "sha1_hash": "fbb18bcb00080008184c6e99c378a8da721b43bf",
    "title": "",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 240659,
    "plain_text": "# Day Before Zero Blog\n\n\n## Damballa discovers new toolset linked to Destover Attacker’s arsenal helps them to broaden attack surface\n\nNovember 18, 2015\n\nTags: [Destover,](https://www.damballa.com/tag/destover/) [malware,](https://www.damballa.com/tag/malware/) [trojan](https://www.damballa.com/tag/trojan/)\n\nDestover\n\nis best\n\nknown as\n\nthe\n\nmalware\n\nused in\n\nthe\n\nattack on\n\nSony\n\nPictures\n\n\n-----\n\nrelationship based on its wiping technique with the\n\n[Shamoon malware used in the attack on Saudi Aramco in](http://money.cnn.com/2015/08/05/technology/aramco-hack/index.html)\n\n2012. The Destover trojan is a wiper that deletes files off of\n\nan infected system, rendering it useless.\n\nUnlike most malware, the goal of Destover and other wiping\n\nmalware is to cause damage for ideological and political\n\nreasons not for financial gain. For example, at Sony,\n\nattackers wiped files off of workstations making them\n\ncompletely inoperative for unclear political goals of the\n\nattackers. The Saudi Aramco attack using Shamoon was so\n\ndestructive it temporarily drove up the price of hard drives\n\n[because an estimated 50,000 were needed to help Saudi](http://www.darkreading.com/attacks-breaches/inside-the-aftermath-of-the-saudi-aramco-breach/d/d-id/1321676)\n\nAramco recover, also for unclear ideological and political\n\n[motives against the Al-Saud royal family.](http://pastebin.com/HqAgaQRj)\n\nMuch was revealed In the weeks and months following these\n\nbreaches, except for how attackers were able to stay\n\nundetected within the network long enough to expand their\n\npresence and exfiltrate Terabytes of sensitive information.\n\nWhile researching a newer sample of Destover, we came\n\nacross two files that were identified by one antivirus product\n\nat the time under a generic signature. After analyzing\n\nfurther, we found two utilities closely related to Destover.\n\nBoth utilities would be used during an attack to evade\n\ndetection while moving laterally through a network to\n\nbroaden the attack surface. Both utilities had usage\n\nstatements and were named as setMFT and afset.\n\n#### What is setMFT?\n\nsetMFT is used to copy the timestamp settings from a source\n\nfile on disk to a destination file, also called timestomping.\n\nTimestomping combined with similar file naming enables a\n\nfile to blend in with legitimate files in the same directory.\n\nThis can conceal a file’s existence from security personnel\n\nlooking for malicious files or scans of files created after a\n\ncertain date. Timestomping can get past a cursory check for\n\nmalicious files. A thorough forensic examination will reveal\n\nthat a file has been timestomped based on conflicting record\n\ndates and possibly log files.\n\nThe sample discovered by Damballa requires the presence\n\nof the file ‘usbdrv3.sys’ in the same directory. It turns out to\n\nbe the renamed Eldos RawDisk driver used by Destover to\n\ngain direct access to disk Either the driver is meant to be\n\n\n-----\n\nDestover itself. Destover and setMFT are related via the\n\nlengthy license key used with the Eldos driver:\n\n99E2428CCA4309C68AAF8C616EF3306582A64513E55C786A864BC83DAFE0C78585B692047273\n\nB0E55275102C664C5217E76B8E67F35FCE385E4328EE1AD139EA6AA26345C4F93000DBBC7EF1579D4F\n\nAnother feature is that this utility interacts with the attacker\n\nthrough on the command line rather than being delivered\n\nand executed by a dropper without interaction. setMFT\n\ncomes with an English usage statement in case the attacker\n\nforgets the placement of arguments:\n\n#### What is afset?\n\nafset, like setMFT is also used to timestomp files plus clean\n\nMicrosoft Windows logs based on criteria (id, time) from the\n\nuser. It also changes the PE build time and checksum. afset\n\nprovides more granular functionality to allow the user to set\n\nonly certain timestamps on a file (sia, fna or both). To\n\nachieve the timestomping and log cleaning functions, afset\n\nuses the RawDisk driver with the same lengthy license key.\n\nThe afset sample we obtained appeared to be incomplete or\n\na partial development version. The sample attempted to\n\nwrite a randomly named file with a .sys extension to the\n\nlocal directory with the contents of the “ICONS” resource\n\nwhich is supposed to be the encoded RawDisk driver.\n\nHowever, it failed to decode on execution. If the driver write\n\nhad completed it would have registered as a service using\n\nthe same random driver name. Plus, it would have been\n\nused to obtain a handle to write the MFT record for the\n\ntarget file to match either a user supplied file or by default\n\nthe file “%SYSTEMROOT%\\system32\\tapi32.dll”.\n\nAccording to the handy usage statement, conditional log\n\ncleaning is only available on 32-bit systems. From our\n\ndynamic testing, it appears to clear the event log and then\n\nrewrite it without the offending entries. A full reversing of\n\nthe log cleaning feature was not performed and dynamic\n\nanalysis failed due to errors in the driver extraction routine\n\nfrom the resources. Fortunately, the usage statement gives\n\ninsight to the full functionality of the tool:\n\n\n-----\n\nAfset is used interactively on the target system. It allows the\n\nattacker to remain stealthy and erase their tracks as they\n\nmove through the network. A full forensic analysis of a\n\nsystem would reveal the presence of afset and missing log\n\nactivity but it’s likely this activity would go undetected\n\ninitially creating high-risk infection dwell time.\n\nFor enterprise security teams, the utility of setMFT and afset\n\nmeans that many of the tools and methods they use to\n\nidentify the presence of attackers would be thwarted. If the\n\nadversary gains access to corporate servers and can clean\n\nand redirect log files, they can prevent any evidence of their\n\nactivity from reaching a SIEM or log analysis solution.\n\nThese tools appear to have limited distribution, which\n\nmeans that newer versions of the tools could go undetected\n\nby standard AV for an extended length of time. Also, as\n\nmentioned, the ability to have the tools blend with legitimate\n\nsystem files allows the attacker to evade detection during a\n\ncursory glance by personnel. These capabilities, when used\n\ntogether with tools that enable attackers to obtain network\n\ncredentials and disable defenses, allows them to permeate\n\nthe network undetected for an extended period of time.\n\n#### Conclusion\n\nThe attackers behind large and long-lasting attacks are very\n\nwell organized, patient and determined. Toolsets like\n\nDestover, afset and setMFT are part of an arsenal used\n\nduring a cyber attack. These tools are mainly used to help\n\nthe attackers remain under the radar for months or longer.\n\nGaining a foothold inside the victim’s network is a top\n\npriority. History tells us that in most of the high-profile hacks\n\nmaking news headlines, the attackers were able to spend\n\nmonths hidden inside the victim’s network exfiltrating\n\nTerabytes of data.\n\nAttack modus-operandi:\n\n\n-----\n\n|STEPS|TOOLS|\n|---|---|\n|Reconnaissance|Scanners, Open source intelligence gathering|\n|Breach|Vulns, Exploits,|\n|Foothold|afset, setMFT, RATs, credential theft|\n|Move laterally|Stolen administrative credentials and RATs|\n|Exfiltrate|VPN accounts, RATs, out of band comms|\n|Delete tracks|afset, setMFT, Destover / Shamoon|\n|Exit|Publish stolen data, clean with Destover / Shamoon|\n\n\nThe table above, represents the different steps attackers\n\nwould go through to penetrate a network and where they\n\ncould use the new afset and setMFT utilities. They are used\n\nfor different purposes and at different steps. There is no\n\ndoubt that attackers are using these tools right now and are\n\ncontinuing to develop their capabilities.\n\n#### IOCs\n\nafset\n\nMD5: b5ddd6ed3bd16c6f438b3bc95a2b49a8\n\nSHA256:\n\n38c87a92694b597e5d402342ab4a9ff88b5b81beb2791405637bdca2b8384eac\n\nsetMFT\n\nMD5: f83f9d1797f5dbd419dfa86987790153\n\nSHA256:\n\nfe30da9e47010d3522d30ff90fb10d6c30302e8d16001c1a12c149b508888ab8\n\nYARA\n\nrule Destover\n\n{\n\nmeta:\n\ndescription = “Rule to detect Destover trojan and\n\nassociated tools by license key”\n\nauthor = “Willis McDonald”\n\n\n-----\n\nreference = “not set”\n\ndate = “2015/10/30”\n\n###### Leave a message \n\nstrings:\n\n$key =\n\n“99E2428CCA4309C68AAF8C616EF3306582A64513E55C786A864BC83DAFE0C\n\n78585B692047273B0E55275102C664C5217E76B8E67F35FCE385E4328EE1AD139EA6AA2634\n\n5C4F93000DBBC7EF1579D4F”\n\n$MZ = “MZ”\n\ncondition:\n\n$key and $MZ at 0\n\n}\n\n**Willis McDonald**\n\nSr. Threat Researcher\n\n**Loucif Kharouni**\n\nSr. Threat Researcher\n\n##### Share this:\n\n######     \n\n##### You might also like\n\n||||||\n|---|---|---|---|---|\n\n\n**Stolen**\n\nThe SpyEye\n\n**information**\n\nCompetitiveusing\n\n**Corebot**\n\nLandscape\n\n**sold on**\n**Btcshop.cc?**\n\n\nStolen\n\ninformation\n\nusing\n\nCorebot\n\nsold on\n\nBtcshop.cc?\n\n|The SpyEye Competitive Landscape|Stolen The SpyEye information Cuosminpgetitive Corebot Landscape sold on|\n|---|---|\n|||\n\n\n**Detecting**\n**Mobile**\n**Malware**\n**Threats**\n\n\nDetecting\n\nMobile\n\nMalware\n\nThreats\n\n|Commercial Intrusion. FinFisher|D CommerciaMl M Intrusion. Th FinFisher|\n|---|---|\n\n\n-----\n\n**The**\n**Problem**\n**with**\n**Disclosure**\n\n\n**Big**\n\nThe **Data**\n\n**is Not**\n\nProblem\n\n**Magic.**\n\nwith\n\nDisclosure\n\n\nBig\n\nData\n\nis Not\n\nMagic.\n\n\nThe\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.11.18.Destover/Damballa%20discovers%20new%20toolset%20linked%20to%20Destover.pdf"
    ],
    "report_names": [
        "Damballa discovers new toolset linked to Destover"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/fbb18bcb00080008184c6e99c378a8da721b43bf.pdf",
        "text": "https://archive.orkl.eu/fbb18bcb00080008184c6e99c378a8da721b43bf.txt",
        "img": "https://archive.orkl.eu/fbb18bcb00080008184c6e99c378a8da721b43bf.jpg"
    }
}