{
    "id": "ce1e5712-8278-4161-b81a-0dea3dfd5bb0",
    "created_at": "2023-01-12T15:06:35.559112Z",
    "updated_at": "2025-03-27T02:16:39.974918Z",
    "deleted_at": null,
    "sha1_hash": "e4a0735f525253a44c5558f8a0db356dda8ff61a",
    "title": "2021-05-24 - Tracking StrongPity with Yara",
    "authors": "",
    "file_creation_date": "2022-05-28T18:23:36Z",
    "file_modification_date": "2022-05-28T18:23:36Z",
    "file_size": 954719,
    "plain_text": "# Tracking StrongPity with Yara\n\n**[anchorednarratives.substack.com/p/tracking-strongpity-with-yara](https://anchorednarratives.substack.com/p/tracking-strongpity-with-yara)**\n\nRJM\n\n### Alleged Turkish nation-state actor keeps infecting victims with trojanized software\n\n**Disclaimer: The views, methods, and opinions expressed at Anchored Narratives are those**\nof the author and do not necessarily reflect the official policy or position of my employer.\n\n\n-----\n\nCover: Turkish delight\n\n\n-----\n\n## Introduction\n\nHere’s the latest Anchored Narrative with a follow-up story on the alleged Turkish nationstate actor StrongPity. Thanks for being a subscriber, and welcome to the new subscribers.\nAs always, if you have any tips, comments, or great examples of disputed threat intelligence\nnarratives for me, send them to robertjanm@anchorednarratives.com. Anchored Narratives\nis now also on Twitter @AnchoredNarrat1.\n\nIn the previous [article about StrongPity, their history of used malware and their preferred](https://anchorednarratives.substack.com/p/recover-your-files-with-strongpity)\nmalware infection method were covered. This article will outline how you can track a nation[state actor by leveraging the power of Yara. Yara is called the pattern matching Swiss army](https://virustotal.github.io/yara/)\nknife for malware researchers and is under constant development providing new features.\nAfter the last article in April 2021 on StrongPity, I developed a custom Yara signature (rule) to\ndetermine if it could track new campaigns or activity used by this nation-state actor. In this\narticle, I will cover the creation of custom Yara rules with the well-known IDA disassembler,\n[test them, implement them on VirusTotal Intelligence or](https://www.virustotal.com/gui/home/search) [Malpedia and perform a retrohunt. I](https://malpedia.caad.fkie.fraunhofer.de/library)\nwill not cover the basics of Yara or how basic rules are constructed. Let’s go!\n\n## VirusTotal Intelligence\n\n[As explained in one of the first articles on Anchored Narratives is that you can implement](https://anchorednarratives.substack.com/p/hunting-for-geopolitical-tensions)\nthreat intelligence on many different sources. One of these sources is newly submitted\nmalware samples on VirusTotal or Malpedia that are matched against custom Yara rules\nimplemented by malware or threat analysts that track ransomware or nation-state actors.\nVirusTotal Intelligence (hereafter: VTI) is a paid service. The platform provides access to a\nlarge corpus of submitted malware or viruses by users or companies. The samples are\nstored for a longer period of time. VTI is being used by security researchers for threat\nhunting or finding similar files or known exploits. Researchers can basically implement\n_alarms with Yara rules on known exploits, ransomware, or malware used by nation-state_\nactors.\n\nSo after a period of StrongPity silence since the end of April 2021, last week, I received an\nalert on a new sample that matched my custom, Yara rule. The details of the malware\nsample can be seen in the figure below.\n\nFigure 1: Screenshot VirusTotal Intelligence on StrongPity\n\n\n-----\n\n```\nSHA256:debf8937623397e35359cd8e758283857eb0e161a5038f3637f496838ddeadd0 \nC2: https://informationserviceslab.com/parse_ini_file.php IP:45.153.243.141\n\n```\nThis time the malware sample reached out to the command and control server\n” https://informationserviceslab.com ”, which was not known by me yet. But what\ntriggered the Yara rule, and how was the rule built? VirusTotal provides functionality that\nhighlights the matched context of the Yara rule. As you might recall from the last article, the\nStrongPity malware has quite some interesting ‘strings’ that could be leveraged in a Yara rule\nand XOR routines to decrypt the encoded domain name, etc. Figure 2 highlights a specific\nhex pattern below that starts with “66 31 BC 45”, reflecting such a routine. The Yara rule was\ntriggered because of the three matching elements in the rule.\n\nFigure 2: Screenshot of the matched context with the XOR-routine 66 31 BC 45\nThe Yara rule was triggered because of the three matching elements in the rule. But how\nwas this high-fidelity Yara rule build? Let’s dive into that.\n\n## Building the Yara rule\n\nAs mentioned earlier, VirusTotal Intelligence provides powerful functionality to search for\nsimilar samples. Based on earlier StrongPity reporting by ESET and CitizenLab, multiple\nsamples were downloaded with the intent to track StrongPity.\n\nIn an in-company Yara training delivered by well-known security researcher Andreas\nSchuster many years ago, his advice was to focus on custom implementations of algorithms\nor routines by actors as a way to track adversaries. He demonstrated great examples back\nthen to track specific Chinese nation-state actors. With that advice in mind, I started building\nthe Yara rule to see if there was an additional way to track them. One way to assess these\n\n\n-----\n\ndiscriminating artifacts is by leveraging IDA in this example. Before we start, make sure you\nenabled the amount of opcodes bytes (machine code) displayed in IDA7 (free). This is a\nmethod to highlight potential repetitive or certain uniqueness in relevant malware samples.\n\nFigure 3:\n\nScreenshot of the Options tab in IDA\nIn this article, only several of the many StrongPity samples are covered and explained below.\n```\nStrongpity:b9f9fb303bc605410bc1a7095da6f77d5880a1a233f849375c1aa652f9d52e1a\n\n```\nStrongPity usually holds several XOR-routines with different XOR values to decode different\n[information stored in each sample. This was covered in the earlier piece on StrongPity. So](https://anchorednarratives.substack.com/p/recover-your-files-with-strongpity)\nopen the malware sample in IDA and determine if you could distinguish a unique routine\nfrom the actor. One of the XOR decoding routines is highlighted below.\n\nFigure 4: Screenshot XOR decoding routine\nCould we make a Yara pattern of this routine? In the screenshot above, you can see an\nopcode byte pattern that starts with “66 83 B4 45 FC FE” and ends with the bytes “72 F1”.\nLet’s examine the next sample.\n```\nStrongPity:8a7c9c4e80292bed56980d0d0fdf7c0e9693e05e3051392d5820f5037fd8f02c\n\n```\n\n-----\n\nFigure 5: Screenshot another XOR decoding routine\nIn this different sample, you notice a similar sequence of opcode byte patterns. After this, I\nexamined some other samples and came up with the following Yara patterns to match\nStrongPity samples.\n```\n$opcodexor1 = {66 31 ?? ?5 ?? F? FF FF 4? 83 F? ?? 72 F?}  $opcodexor2 = {66 83\nB4 ?5 ?? F? FF FF [2-5] 72 F?}\n\n```\nWithin [Yara, you can match on strings “text” or patterns in its hexadecimal form. So with the](https://yara.readthedocs.io/en/v4.1.0/writingrules.html#)\nabove instructions, Yara will match against the routine found in the StrongPity malware\nsamples. The “??” values are a wildcard and match any value. The values between the\nsquare brackets separated by a hyphen [-], are seen as a jump and match an arbitrary\nsequence from 4 to 5 bytes. By themselves, only those XOR patterns would trigger too many\nfalse positives. So, normally you would also leverage some telling strings found in malware\nsamples to strengthen the Yara rule and really zoom in on a certain actor. This will reduce\nthe number of false positives or false negatives. The StrongPity samples that I analyzed hold\n[many of those telling strings. A very nice tool developed by Florian Roth called YarGen was](https://github.com/Neo23x0/yarGen)\nleveraged to find those patterns automatically. After a bit of testing, the following StrongPity\nYara rule was created, listed below, and implemented on VTI.\n```\nrule log_strongpity {\n  meta:\n   description = \"Strongpity - xor routine.txt\"\n   author = \"RJM\"\n   date = \"2021-04-20\"\n  strings:\n   $s1 = \"Content-Disposition: form-data; name=\\\"file\\\"; \" fullword ascii\n   $s2 = \"Content-Type: multipart/form-data; boundary=----Boundary%08X\" fullword\nwide\n   $s3 = \"SecurityHost.exe\" fullword wide\n   $s4 = \"-CreateMutexW\" fullword ascii\n   $s5 =\n\"name=%ls&delete=WinHttpWriteDataWinHttpQueryHeadWinHttpCloseHandWinHttpReceiveReWinHt\n ascii\n   $s6 = \"Windows Security Host\" fullword wide\n   $opcodexor1 = {66 31 ?? ?5 ?? F? FF FF 4? 83 F? ?? 72 F?} \n   $opcodexor2 = {66 83 B4 ?5 ?? F? FF FF [2-5] 72 F?}\n  condition:\n   ( uint16(0) == 0x5a4d and filesize < 200KB and ( 3 of them )\n   ) or ( all of them )\n}\n\n## Testing the StrongPity Yara rule\n\n```\n\n-----\n\nAs I wrote earlier, I downloaded 29 StrongPity samples previously via the similarity search\nfunctionality in VirusTotal Intelligence. So let’s test if the rule is reliable enough to detect the\nsamples. All the samples are stored in different directories underneath the\n“apt/Turkey/Strongpity” folder.\n\nFigure 5: Screenshot of matching opcodes in StrongPity samples\nFigure 5 highlights Yara matches on the decoding routines found in the IDA disassembler.\nNow let’s see how many samples are detected with the manually created Yara rule.\n\nFigure 6: Screenshot all the malware samples\nThe StrongPity Yara rule matched exactly 29 samples. After testing it on other malware\nsamples, the rule seems solid and did not produce any false positives. So basically, the next\nstep is to implement the Yara rule as a live hunt rule in VirusTotal Intelligence. This resulted\nin the match of a brand new StrongPity sample covered in the introduction of this article. The\nreason for implementing it first as a live hunt rule is to assess if it generates false positives or\nfalse negatives on that platform. I have made many mistakes in the past where I deployed a\ntoo generic rule. So testing and validating are very important.\n\n## Retrohunting StrongPity\n\nFor paid subscribers or researchers, VirusTotal Intelligence provides a capability to search\nacross multiple samples. For regular users, the corpus of malware samples that are\nsearched is 3 months. If you are a pro user, you can search the entire corpus for the past 12\n\n\n-----\n\nmonths. Retrohunts are usually limited and expensive searches. Similar searches can be\nconducted on Malpedia or other platforms supporting Yara rules and storing historical\nmalware samples.\n\nSo after I verified the rule, the StrongPity retrohunt was executed. After a while, the rule\nmatched 127 StrongPity samples in the past 12 months. Only 9 in the past 3 months.\n\nFigure 7: Screenshot of the StongPity Retrohunt and hits\nUpon inspection, none of the 9 samples that matched were false positives. Maybe someone\nwith VTI pro access can run the StrongPity retrohunt to obtain the full results for further\nassessment? Reach out if you were able to obtain all samples and if there were any false\npositives.\n\n## Conclusion\n\nYara is a good way to distinguish between malware of a given family and other files based on\nknown patterns and obtain intelligence on relevant nation-state actors or ransomware actors.\nIn this article, I outlined a method to build a discriminating Yara rule that was leveraged to\ntrack a known nation-state adversary, in this case, the alleged Turkish actor group\nStrongPity. The rule was also used to perform a successful retrohunt. With the StrongPity\nYara rule, we can track new malware samples of the actor and collect many historical\nsamples for the past year(s). There could also be other routines leveraged by StrongPity that\ndiscriminate and provide even better insights into how big their spyware campaigns are. That\nsaid, finding 127 malware samples submitted to VirusTotal in the past 12 months with a\ncustom build Yara rule indicates the rule has high fidelity and that the actors behind\nStrongPity must be collecting massive amounts of personal data. I’m curious about how this\ndata collected from different victims in countries around the globe is processed.\n\nThe StrongPity actor remains very active and obtains new infrastructure per campaign, it\nseems. The next threat actor that will be covered as an Anchored Narrative is from the AsiaPacific region. Until next time and reach out if you want to share different or additional\ninsights or feedback.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-24 - Tracking StrongPity with Yara.pdf"
    ],
    "report_names": [
        "2021-05-24 - Tracking StrongPity with Yara.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535995,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1653762216,
    "ts_modification_date": 1653762216,
    "files": {
        "pdf": "https://archive.orkl.eu/e4a0735f525253a44c5558f8a0db356dda8ff61a.pdf",
        "text": "https://archive.orkl.eu/e4a0735f525253a44c5558f8a0db356dda8ff61a.txt",
        "img": "https://archive.orkl.eu/e4a0735f525253a44c5558f8a0db356dda8ff61a.jpg"
    }
}