{
    "id": "ce8e098b-b8e7-4bab-9e08-88dd630a3ee5",
    "created_at": "2022-10-25T16:48:19.572396Z",
    "updated_at": "2025-03-27T02:06:04.276435Z",
    "deleted_at": null,
    "sha1_hash": "b94a7ff4a0564a59e314c8b9a55c0af0534673a8",
    "title": "Initial Access Brokers Are Key to Rise in Ransomware Attacks",
    "authors": "",
    "file_creation_date": "2022-08-02T10:32:10Z",
    "file_modification_date": "2022-08-02T10:35:04Z",
    "file_size": 1708935,
    "plain_text": "### CYBER\n\n THREAT\n\n ANALYSIS\n\n## By Insikt Group®\n\nAugust 2, 2022\n\n# Initial Access Brokers  Are Key to Rise in\n\n\n-----\n\n_This report provides an overview of the tactics, techniques, and procedures_ **Background**\n_(TTPs) used by cybercriminals on dark web and special-access sources to_\n_compromise networks, deploy infostealer malware, and obtain valid credentials._\n\nThreat actors require remote access to compromised\n\n_These threat actors, dubbed “initial access brokers”, represent a specialized_\n_industry within the cybercriminal underground that enables a significant majority_ networks to conduct successful attacks, such as malware\n_of ransomware attacks. This report includes information gathered using the_ loader deployment, data exfiltration, or espionage campaigns.\n_Recorded Future​®​ Platform, dark web sources, and open-source intelligence_\n_(OSINT) techniques. This is a high-level summary of the chain of events that_ These compromised access methods, often sold on dark web\n_enable a ransomware attack. It is intended to provide an overview for cybersecurity_ and special-access forums, are the work of specialized threat\n_professionals with non-technical backgrounds or roles._\n\nactors colloquially referred to as “initial access brokers” (IAB).\nIABs use several tools and TTPs to obtain such access, including\n\n#### Executive Summary\n\nobtaining valid credential pairs and session cookies from the\n\nThreat actors can gain initial access to networks through successful deployment of infostealer malware, the purchase\ninfostealer malware infections, initial access brokerage services of infostealer “logs” or “bots” on dark web shops, credential\non dark web and special-access forums, or the purchase of stuffing, adversary-in-the-middle attacks, phishing, remote\ninfostealer logs from dark web shops and marketplaces. Other desktop protocol (RDP) “brute force guessing”, and more.\nattack vectors, such as phishing, spearphishing, and code\n\nThe most common credential pairs that appear for sale or\n\ninjection, are also common on dark web and special-access\n\nauction on top-tier dark web and special-access sources, such\n\nforums, but their immediate effects are often much less public\n\nas Exploit and XSS, are for corporate virtual private networks\n\nand visible than the sale of compromised credentials. Using\n\n(VPNs), RDP services, Citrix gateways, web applications and\n\nBlackMatter and Conti as examples, we examine the role of\n\ncontent management systems (CMS), and corporate webmail\n\ncredential access in the execution of the attack, from initial\n\nservers (business email compromise, or BEC). Less common,\n\naccess to ransomware deployment. We provide mitigations\n\nbut more sought-after, are ESXi root and Active Directory (AD)\n\nfor credential breaches, infostealer malware infections, and\n\naccess methods, zero-day and n-day vulnerabilities, code\n\nransomware attacks, as well as our assessment of the future of\n\ninjection points (HTML, SQL), and others. This report will outline\n\nthese tools and the larger ransomware threat landscape.\n\nthe typical process by which an initial access broker obtains\ncompromised access methods and sells them on dark web and\n\n#### Key Judgments special-access sources, and the use of such methods to conduct\n\na successful ransomware attack.\n\n    - To conduct a successful ransomware attack, threat\n\nactors require remote access to compromised networks.\nThe most common method by which threat actors\nobtain access is through the use of compromised valid\ncredential pairs, which are often obtained via infostealer\nmalware and sold on dark web and special-access\nsources.\n\n   - Compromised credentials are often sold on dark web\n\nand special-access forums and shops to ransomware\naffiliates, who use such access to move laterally through\nsystems, escalate privileges, and use malware loaders to\ndeploy ransomware.\n\n\n-----\n\n#### Threat Analysis\n\nOne of the most effective ways for ransomware operators to\ngain access to victim networks is by either deploying infostealer\nmalware or obtaining logs exfiltrated by an infostealer on a\ndark web or special-access source. This malware is deployed\nthrough the use of acquired or compromised botnets, phishing,\nthe successful deployment of an obfuscated malware loader or\ndropper, or through the purchase of compromised credentials\non dark web and special access sources.\n\n##### Compromised Valid Credentials\n\nTo easily obtain bulk compromised valid credentials and\nsession cookies, threat actors often rent access to a licensed\naccount for an infostealer malware. These licenses come in many\nforms, but most often as web panels, source code, builders,\nor standalone clients. Infostealers are often marketed directly\nby their developers as a malware-as-a-service (MaaS) offering\non top-tier dark web and special-access sources, messaging\nplatforms (such as Telegram), and social media. The information\nharvested from infostealers, colloquially referred to as “logs” or\n“bots”, is then sold on dark web shops, such as Genesis Store,\nRussian Market, the now-defunct Amigos Market, and 2easy\nShop. The most common infostealers that appear on dark web\nand special-access sources are RedLine, Vidar, FickerStealer,\nTaurus, AZORult, and the now-defunct Raccoon.\n\n\n##### Deploying Stealers\n\nInfostealers, generally considered to be a subgroup of\nthe banking or remote access trojan (RAT) malware category,\ncan capture a great amount of compromised information from\nan infected device, including keystrokes and peripheral input\ncaptures, session cookies, usernames and passwords from\nbrowser stores, screen and video captures, local data, browser\nhistory and bookmarks, clipboard data, and more. The most\ncommon attack vectors by which infostealers spread is through\nspam campaigns or phishing. Less commonly, but as evidenced\nby the rapid spread of Mars Stealer in Q1 2022, infostealers can\nspread via malicious Google Ads and pop-ups. These infostealer\npayloads can be disguised within Microsoft Office documents\nthrough the use of malicious macros; a dropper that encrypts\nthe payload as extra data; or a loader that communicates with\nits command and control (C2) infrastructure over a web protocol\nand uses a built-in command and scripting interpreter to remotely\nexecute code. Once an infostealer successfully infects a victim\ndevice, it begins to log activities and collect compromised\ninformation. These logs are then manually examined by the\ninfostealer operator for credentials that might be profitable (for\nexample, credentials for tools or platforms like RDP, VPNs, or\nWordPress) on dark web or special-access sources. At this point,\nan infostealer operator could become an initial access broker for\nransomware and data leak groups on dark web forums.\n\n\n_Figure 1: Examples of web panel dashboards for infostealer malware including Mars (left) and RedLine (right) (Source: Recorded Future)_\n\n\n-----\n\n##### Initial Access Brokers\n\nStolen credentials are often sold to ransomware affiliates\non dark web and special-access forums by specialized\ncybercriminals called initial access brokers (IABs). While most\nhigh-profile accesses are brokered on top-tier Russian-language\nforums, such as Exploit, XSS, or RAMP, it is still possible to\nencounter IABs on low-tier or mid-tier English-speaking forums,\nsuch as BreachForums or the now-defunct Raid Forums. IABs\ncommonly operate in multiple languages on different forums,\noften under different monikers (for example, “FuckerZ” connects\nto “Tokugaw4”, “tokugawa”, “xssisownz”, and “Str0ng3r”), to\navoid detection, tracking, and arrest. Many English-language\ncybercriminal forums, such as Cracked or Nulled, have banned\nIAB services and ransomware discussions outright, as the risk\nof law enforcement attention on the forum increases with such\nactivity. Less commonly, ransomware operators and affiliates will\nwork directly with a designated group of IABs that will conduct\nbusiness off of the forums and in private messaging channels,\nsuch as Tox or XMPP (Jabber).\n\n\nIAB advertisements follow a similar pattern on dark web\nand special-access forums. The template is loosely as follows:\n“victim country”, “annual revenue”, “industry”, “type of access”,\n“rights”, “data to be exfiltrated”, and “devices on local network”.\nAdditional useful information includes the type of antivirus\nsoftware, IP address ranges, and other details. On top-tier\nforums, sellers are typically required by the forum’s rules to\nprovide a sale price in the initial advertisement. As many of these\ndeals are negotiable, with price ranges varying widely depending\non multiple factors, the most common form of advertisement is\nthe “auction” format. IABs will provide an acceptable starting\nprice (“start”), the minimum price of bid hikes (“step”), and the\nfull or “buy now” price if a threat actor is interested in purchasing\nimmediately (“blitz”). This is often followed by a time range in\nwhich the posting will close, which is generally between 4 and 8\nhours. The IAB will often indicate if a sale is made in the thread\n(“sold”, продано), asking the forum’s moderation staff to then\nclose the thread for new replies. IABs, especially those who\nare working with unknown or low-reputation threat actors on\nthe forums, will often request the use of escrow or middleman\nservices to facilitate transactions.\n\nBelow are 3 examples of advertisements from high-credibility\nIABs“ :inthematrix1“,”nei,”and“ zirochka:”\n\n\n-----\n\n_Figure 3: Sample of listings on the dark web shop Russian Market (Source: Russian Market)_\n\n##### Dark Web Shops and Marketplaces\n\nDark web shops and marketplaces are common sources for\nthreat actors to obtain compromised valid credentials, browser\nand session cookies, RDP and VPN keys, and more. Dark web\nshops are typically a low-cost method for threat actors to\npurchase infostealer logs or bots which affect specific domains,\nIP address ranges, entities, or internet service providers (ISPs).\nHowever, one of the drawbacks of dark web shops is that it is\ndifficult to obtain credentials with administrator-level privileges\nin a single purchase. Threat actors often have to purchase\ncompromised credentials in bulk, expending much more money,\ntime, and energy than working directly with an IAB. Regardless,\ndark web shops and marketplaces remain a common method\nby which IABs or ransomware affiliates gain initial access to\nan entity’s network. It is also a common method by which IABs\ncan turn a profit on dark web and special-access forums, via\n“flipping” low-cost credentials, often purchased for less than\n$10, to ransomware affiliates for potentially thousands of dollars.\nThe most prevalent dark web shops are Russian Market, Genesis\nStore, and 2easy Shop.\n\n\n##### Russian Market\n\nRussian Market is a criminal shop operated by the threat\nactor “RussianMarket” that sells database dumps, RDP and\nSSH accesses, infostealer logs, compromised payment cards,\nand PayPal accounts. Infostealer logs are primarily harvested\nfrom victims infected with popular infostealers, such as Vidar,\nAZORult, Raccoon Stealer, RedLine, or Taurus. Russian Market\nis one of the most prevalent dark web shops, offering millions\nof infostealer logs affecting entities around the world. It is a\ncommon destination for threat actors seeking to purchase\ncompromised information related to specific entities, domains,\nor subdomains, which can then be used for initial access, lateral\nmovement, and privilege escalation.\n\n##### Genesis Store\n\nGenesis Store is a criminal shop likely created by the threat\nactor “GenesisStore” in 2018. The store is advertised across\nmultiple Russian- and English-language dark web forums.\nGenesis Store sells packages (“bots”) of compromised account\ncredentials and associated user data designed to allow threat\nactors to bypass anti-fraud solutions.\n\n\n-----\n\n_Figure 4: Import cookies with the Chrome browser plugin “Genesis Security” (Source: Genesis Store)_\n\nVictim data is sold in a single package referred to as a bot\nor log, which includes account credentials, IP address, browser\nfingerprint (system information), and cookies. After a bot is\npurchased by a threat actor, victim data can be imported into\na browser plugin called Genesis Security, as shown in Figure\n4 below. This feature allows the attacker to masquerade as\nthe victim and perform account takeover and session hijacking\nattacks. The price for each bot varies depending on the number\nof account credentials, types of accounts, and geographical\nlocation of the victim.\n\n##### 2easy Shop\n\n2easy Shop is a Russian and English-language dark web shop\nthat has been in operation since at least 2021 and was founded\nby the threat actor “2easy”. The shop sells logs harvested from\nunspecified infostealers, but likely Vidar, RedLine, and Raccoon\nStealer, among others. The prices for logs range between $3\nand $200 per listing and include compromised user logs and\naccounts from hundreds of organizations around the world. The\nprice point for victim data on the shop varies depending on the\ncontent and date of the listing.\n\nWhen compromised data is purchased on 2easy Shop,\na buyer typically receives a victim’s browser cookie data,\nbrowser history, screenshots, general system information about\ncompromised machines, and other data. The compromised\naccount credentials and associated user data is commonly used\nby threat actors to bypass targeted organizations’ defenses and\nanti-fraud solutions, which can be used for initial access, lateral\nmovement, or privilege escalation.\n\n\n##### Using Access/Credentials to Deploy Ransomware\n\n Case Study: BlackMatter Ransomware\n\nFigure 5 below shows “BlackMatter”, a user representing the\nBlackMatter ransomware affiliate program, looking for targets\nlocated in specific countries, excluding medical and government\nentities, with revenues at a certain profit threshold. This gives\ninsight into the way that ransomware groups get access to\nnetworks and how they recruit affiliates, and it suggests that\nfinancial gain is a primary motivator.\n\n_FIgure 5: BlackMatter representative advertisement looking for target networks (Source: Exploit)_\n\n\n-----\n\nOnce access to a compromised network or domain is obtained,\nthreat actors then leverage several tools and TTPs to move\nlaterally in a system, escalate privileges, exfiltrate or destroy\ndata, and deploy ransomware. [According to the FBI, affiliates](https://www.ic3.gov/Media/News/2022/220420.pdf)\nassociated with the BlackMatter ransomware-as-a-service\n(RaaS) group have used previously compromised user credentials\nas an initial access vector to compromise organizations. After\ngaining access, threat actors compromise Active Directory to\ngain additional user and administrator privileges, then modify\nGroup Policy Objects (GPOs) to deploy ransomware.\n\n##### Case Study: Conti Ransomware\n\nLike the threat actors associated with BlackMatter, Conti\nGang, the operators of Conti Ransomware, and their affiliates also\ntypically begin compromising a network using stolen credentials.\n[According to CISA, Conti affiliates use a variety of initial access](https://www.cisa.gov/uscert/sites/default/files/publications/AA21-265A-Conti_Ransomware_TLP_WHITE.pdf)\nvectors including phishing, compromised credentials, malware\ndistribution, and exploiting vulnerabilities. CISA and the FBI\nhave observed Conti’s operators using Router Scan, a tool to\nscan and brute-force network devices. The attackers would\nalso use kerberoasting to discover and crack administrator\nhashes. Once they successfully achieve Domain Administrator\nrights, they begin exfiltrating sensitive data using Rclone and\nmega[.]nz. When the threat actors are satisfied with the data\nthey captured and the network defenses have been removed,\nthey begin preparing the network to deploy the ransomware.\nAs we saw with the BlackMatter case study, Conti will place the\nransomware executable in a location such as SYSVOL on the\nDomain Controller and then set up a domain-wide scheduled\ntask to execute the ransomware under the highest privileges\nachieved.\n\n\n#### Mitigations\n\n##### Credential Leaks\n\nCredential leaks and email exposure amplify the risks\nassociated with ransomware attacks, as the data can be used\nto devise tailored spearphishing lures and serve as initial points\nof compromise via credential stuffing and account takeover.\nRecorded Future clients can surface exposed credentials in the\nRecorded Future Platform and should force password resets for\nthose users whose leaked credentials are still active.\n\n##### Infostealer Malware\n\nGiven the role that infostealers play in underground\nmarketplaces and in enabling ransomware attacks, mitigation\nstrategies against infostealer malware should be incorporated:\n\n  - Keep all systems current with the latest security patches\n\nand updates.\n\n  - Invest in a solution that offers patch posture reporting.\n\nThis type of solution can provide insight into the\nvulnerabilities that have received remediation measures\nas well as the machines that have received those\npatches.\n\n  - Install an antivirus solution, schedule signature updates,\n\nand monitor the antivirus status on all equipment.\n\n  - Configure intrusion detection systems (IDS), intrusion\n\nprevention systems (IPS), or any network defense\nmechanisms in place to alert on any malicious activity.\n\n  - Deploy a spam filter used to detect indicators of\n\nphishing, such as viruses, blank senders, and keyword\ntext triggers.\n\n  - Deploy a web filter to block malicious websites.\n\n  - Monitor for suspicious changes to system file drives and\n\nRegistry that focus on the interception of keystrokes.\n\n  - Educate your employees and conduct training sessions\n\nwith mock phishing scenarios.\n\n  - Develop a password security policy that includes but is\n\nnot limited to password expiration and complexity.\n\n  - Require encryption for employees, especially employees\n\nworking remotely. This includes whole-disc, such as 256bit AES, and network encryption via SSL or TLS.\n\n  - For enterprises, Recorded Future can monitor for\n\npotential typosquat domains weaponized in phishing\nattacks. This includes not only the domains belonging to\none organization, but third-party partners and vendors\nwith enterprise network access.\n\n\n-----\n\n  - The Recorded Future Platform can also assist with\n\n[the detection of compromised credential information](https://www.recordedfuture.com/leaked-credentials-risk/)\nlinked to valid accounts to assist in providing context\nsurrounding suspicious user behavior that may include\nkeylogging activity. Recorded Future Platform users can\ncontinue to monitor underground sources to identify the\nspyware and keylogging tools that are likely to be the\nmost harmful to their immediate infrastructure or supply\nchain.\n\n##### Ransomware\n\nMaintain offline backups of your organization’s data and\nensure that these backups stay up to date to prevent data loss\nin the event of a ransomware infection. Additionally, Recorded\nFuture recommends the following mitigations to reduce overall\nrisk:\n\n  - Ransomware often follows a specific pattern of behavior\n\nthat can be detected with a robust threat intelligence\nsystem, integrated with SIEM platforms.\n\n     - Implement YARA rules like the ones found in\n\nRecorded Future Hunting Packages to identify\nmalware via signature-based detection or SNORT\nrules for endpoint-based detections.\n\n     - The IOCs provided throughout this report can be\n\nused to proactively query or scan environments\nfor items such as file hashes, registry keys, and IP\ntraffic associated with ransomware.\n\n  - Network segmentation can halt the propagation of\n\nransomware through an organization’s network. This\nsolution involves splitting the larger network into\nsmaller network segments and can be accomplished\nthrough firewalls, virtual local area networks, and other\nseparation techniques.\n\n  - If remote access solutions are crucial to daily operations,\n\nall remote access services and protocols, such as Citrix\nand RDP, should be implemented with two-factor or\nmulti-factor authentication.\n\n     - Exposed Remote Desktop Protocol (RDP) servers\n\nare also abused by threat actors to gain initial\naccess into a target’s network. Threat actors will\nlook for networks that have internet-facing servers\nrunning RDP and then exploit vulnerabilities\nin those servers or use brute-force password\nattacks. Once inside the network, the threat actors\nmove laterally and install ransomware on target\nmachines, often disabling backups and other\nprotections.\n\n\n\n- Through the use of process monitoring, monitor for the\n\nexecution and command of binaries involved in data\ndestruction activity, such as vssadmin, wbadmin, and\nbcdedit.\n\n- Monitor for the creation of suspicious file modification\n\nactivity, particularly large quantities of file modifications\nin user directories.\n\n- Consider keeping sensitive client information on systems\n\ndisconnected from the internet or segmented from the\nrest of the corporate network. Since ransomware will\nencrypt all files on a victim system and often will search\nfor directories on the network (such as networked file\nshares) to also encrypt, moving highly sensitive customer\ndata to a system with no internet access or access to the\nrest of the network will minimize the access ransomware\nwould have to those files.\n\n\n-----\n\n#### Outlook\n\nInfostealer malware and exfiltrated logs will remain popular\namong threat actors as a means to obtain credentials to gain\naccess to victim networks. While some infostealer variants,\nsuch as RedLine, FickerStealer, and AZORult have endured, new\nvariants like Mars Stealer, MetaStealer, and Eternity will continue\nto emerge. Dark web shops and marketplaces will also remain an\nattractive source of infostealer logs for threat actors. However,\nthe most effective method by which a ransomware affiliate can\ngain initial access to a compromised network is through the use\nof an IAB on dark web and special-access forums. Other attack\nvectors by which initial access is gained is through the use of\na RAT, phishing, spearphishing, and other social engineering\nattacks. The process by which ransomware operators and\naffiliates infect networks following initial access can be very\nquick and often undetectable.\n\n\n-----\n\n#### Appendix A :MITRE ATT&CK\n\n|RESOURCE DEVELOPMENT|Col2|Col3|\n|---|---|---|\n|Enterprise|T1584|Compromise Infrastructure|\n|Enterprise|T1587|Develop Capabilities|\n|INITIAL ACCESS|||\n|Enterprise|T1566|Phishing|\n|Enterprise|T1078|Valid Accounts|\n|Enterprise|T1190|Exploit Public-Facing Application|\n|Enterprise|T1189|Drive-by Compromise|\n|EXECUTION|||\n|Enterprise|T1059|Command and Scripting Interpreter|\n|Enterprise|T1204|User Execution|\n|PERSISTENCE|||\n|Enterprise|T1133|External Remote Service|\n|Enterprise|T1137|Office Application Startup|\n|PRIVILEGE ESCALATION|||\n|Enterprise|T1055|Process Injection|\n|DEFENSE EVASION|||\n|Enterprise|T1027|Obfuscated Files or Information|\n|CREDENTIAL ACCESS|||\n|Enterprise|T1557|Adversary-in-the-Middle|\n|Enterprise|T1110|Brute Force|\n|Enterprise|T1555|Credentials From Password Stores|\n|Enterprise|T1056|Input Capture|\n|Enterprise|T1539|Steal Web Session Cookie|\n|DISCOVERY|||\n|Enterprise|T1217|Browser Bookmark Discovery|\n|LATERAL MOVEMENT|||\n|Enterprise|T1021|Remote Services|\n|COLLECTION|||\n|Enterprise|T1115|Clipboard Data|\n|Enterprise|T1005|Data From Local System|\n|Enterprise|T1114|Email Collection|\n|Enterprise|T1113|Screen Capture|\n|Enterprise|T1125|Video Capture|\n\n\n-----\n\n|COMMAND AND CONTROL|Col2|Col3|\n|---|---|---|\n|Enterprise|T1071|Application Layer Protocol|\n|EXFILTRATION|||\n|Enterprise|T1041|Exfiltration Over C2 Channel|\n|IMPACT|||\n|Enterprise|T1485|Data Destruction|\n|Enterprise|T1486|Data Encrypted For Impact|\n\n\n-----\n\nAbout Insikt Group[®]\n\nInsikt Group is Recorded Future’s threat research division, comprising analysts and\n\nsecurity researchers with deep government, law enforcement, military, and intelligence\n\nagency experience. Their mission is to produce intelligence on a range of cyber and\n\ngeopolitical threats that reduces risk for clients, enables tangible outcomes, and prevents\n\nbusiness disruption. Coverage areas include research on state-sponsored threat groups;\n\nfinancially-motivated threat actors on the darknet and criminal underground; newly\n\nemerging malware and attacker infrastructure; strategic geopolitics; and influence\n\noperations.\n\nAbout Recorded Future[®]\n\nRecorded Future is the world’s largest intelligence company. Recorded Future’s\n\ncloud-based Intelligence Platform provides the most complete coverage across\n\nadversaries, infrastructure, and targets. By combining persistent and pervasive\n\nautomated data collection and analytics with human analysis, Recorded Future provides\n\nreal-time visibility into the vast digital landscape and empowers clients to take proactive\n\naction to disrupt adversaries and keep their people, systems, and infrastructure safe.\n\nHeadquartered in Boston with offices and employees around the world, Recorded\n\nFuture works with more than 1,400 businesses and government organizations across\n\nmore than 60 countries.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2022-0802.pdf"
    ],
    "report_names": [
        "cta-2022-0802.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1659436330,
    "ts_modification_date": 1659436504,
    "files": {
        "pdf": "https://archive.orkl.eu/b94a7ff4a0564a59e314c8b9a55c0af0534673a8.pdf",
        "text": "https://archive.orkl.eu/b94a7ff4a0564a59e314c8b9a55c0af0534673a8.txt",
        "img": "https://archive.orkl.eu/b94a7ff4a0564a59e314c8b9a55c0af0534673a8.jpg"
    }
}