{
    "id": "ce9432a7-fa3d-45af-9c34-e07ab35b7976",
    "created_at": "2023-03-03T02:05:58.291698Z",
    "updated_at": "2025-03-27T02:08:33.372701Z",
    "deleted_at": null,
    "sha1_hash": "566f65f08b04087ae96afed90ff2ae2f86d5105e",
    "title": "2023-02-08 - AsyncRAT- Analysing the Three Stages of Execution",
    "authors": "",
    "file_creation_date": "2023-03-01T09:13:22Z",
    "file_modification_date": "2023-03-01T09:13:22Z",
    "file_size": 238825,
    "plain_text": "# AsyncRAT: Analysing the Three Stages of Execution\n\n**[medium.com/@hcksyd/asyncrat-analysing-the-three-stages-of-execution-378b343216bf](https://medium.com/@hcksyd/asyncrat-analysing-the-three-stages-of-execution-378b343216bf)**\n\nHack Sydney February 8, 2023\n\nHack Sydney\n\nFeb 8\n\n\n8 min read\n\n[Michael Elford](https://www.linkedin.com/in/michael-elford-2a342b8a/)\n```\nMichael is a cybersecurity professional that is passionate about malware analysis and\nreverse engineering.\n\n```\n_In the second half of 2022, I led an investigation that involved a suspicious registry key,_\n_comprising a value that would run a potentially malicious executable file._\n\n_Further analysis of the executable file resulted in confirmation of the file being malicious._\n\n_In this blog post, I aim to share the findings from the investigation, with the goal of making_\n_the audience aware of the techniques that can be used to effectively analyse malware in_\n_general and specifically analyse ASyncRAT._\n\n## ASyncRAT Analysis\n```\nNote: All malware analysis should be carried out in a sandboxed environment.\n\n Tools used\n\n```\nThis is the list of tools that were used for this analysis:\n\n\n-----\n\n## Stage One\n\nStarting the analysis of Stage One of the malware, the first step was to check the executable\n[in PEStudio, which confirmed that we were dealing with a .NET file. Furthermore, we](https://dotnet.microsoft.com/en-us/learn/dotnet/what-is-dotnet)\n[interpreted the fairly high entropy as indicative of malware packing, where malware adds](https://practicalsecurityanalytics.com/file-entropy/)\ncomplexity to stay undetected by security solutions.\n\nPEstudio file overview\nOur next step was to peruse the strings of the malware, and take note of anything strange\nwe may want to look into a little bit deeper later on.\n\nPEstudio file overview\nExamining the strings, we immediately identified some strings that appear to be obfuscated.\n[As a note to ourselves, we highlighted that we may need to deploy a ‘find and replace’ later](https://gchq.github.io/CyberChef/#recipe=Find_/_Replace(%7B'option':'Regex','string':''%7D,'',true,false,true,false))\non.\n\n## Going Further\n\nAfter determining that the file was written in .NET and making note of the obfuscated strings,\nwe then turned to [dnSpy, a .NET debugger.](https://github.com/dnSpy/dnSpy)\n\nOne of the first things we noticed was a naming discrepancy. The name of the executable on\nthe host and the name of the executable shown in dnSpy are completely different. The\nreason as to why the executable having a completely different name is of interest is due to\nmany threat actors that use malware rename them so that they do not draw as much\nattention and can be hidden on the host and quietly run in the background so that even if the\nuser does notice the something strange is going on with their system, they will skip over the\nfile thinking that it is normal and doesn’t raise any alarms with the user and their AV.\n\nLooking through the code, there is a replace function for a string we had noted earlier. Now\nthat we are certain about what is replacing the obfuscation pattern, we can check what those\nstrings are, which could possibly give us a clue as to what is happening.\n\nExecutable name and replace function\n\n## Pulling on the Thread\n\nFor analysing the obfuscated strings, we used CyberChef. In CyberChef, we used the\n`Find/Replace` feature to perform the replace function found in the code. This enabled us to\nsee the clear text of what was obfuscated which resulted in getting a clearer understanding\nof what was going on within the code.\n\n\n-----\n\nThe end-result of the above exercise gave us the de-obfuscated version of strings which\ncontained “Load” and “Invoke”. This showed that something was going to be loaded and\nexecuted (“invoked”) by the code contained within the executable.\n\n_If at any time you are unsure what actions these methods perform, the best thing to do is_\n_Google around and find some docs. It may be time consuming at first but it is an important_\n_part of analysing malware._\n\nDe-obfuscated strings\nAt this stage of the analysis, we had accumulated enough findings to start sketching out the\ntrajectory of the malware’s execution flow. We had identified the malware was loading and\nexecuting something, and that the malware was packed and contained executable data that\nwe would see in the next stage of analysis.\n\n## Hunting for the Hidden\n\nThe tool Garbage Man is used for heap analysis — a technique that allows analysts to\nintervene and observe as the .NET malware is unraveling itself.\n\nAnalysing the malware in Garbage Man aided in extraction of hidden data that composed the\n_second executable within the first executable._\n\nIn order to further analyse the malware, we executed the original malware found on the host\nin Garbage Man. To get started, we added in a delay of 300ms with 10 snapshots taken at\n100ms intervals.\n\nWe added in the delay to allow time for the process to start running and added the extra\nsnapshots and intervals so that we can compare the difference between the intervals if we\nneed to.\n\nOnce Garbage Man had executed the file, we had these options:\n\nSift through the heap manually, and look at the strings and values that are contained\nwithin the executable\nUse the search function to look through all the snapshots. Specifically looking for bytes\nthat start with the value of — which is the for executables and dll files, and then order\nthem by size in descending order. The search function gives us a list of results, and we\ncan save the binaries with MZ headers and save them for further analysis.\n\nUsing Garbage Man to search for executables and save the binary for analysis\nWhen saving the executable, we chose an executable with the large size value and due to us\nlooking through all the snapshots we were getting repeats of the same executable, we could\nthen save it as “stage2.exe”. We then pivoted back to PEstudio to check the file. On\nexamination, our second hidden executable yet again turned out to be a .NET file.\n\n\n-----\n\nPEstudio of stage2.exe\n\n## Stage Two\n\nDelving into our stage2.exe, we found that checking its strings highlighted some noteworthy\n[Win32 APIs that malware leverages. Some APIs that jumped out were connected with](https://malapi.io/)\n[manipulating processes [T1055], specifically in this case, process hollowing [T1055.012] —](https://attack.mitre.org/techniques/T1055/)\nan adversarial technique to create a paused, legitimate process then swap out its memory\nwith malicious contents.\n\nSome of the APIs and Strings that could indicate Process Hollowing\nAs our stage two was in the .NET world again, we used dnSpy to dig a little deeper. When\nopening up the executable, we were met with a lot of information we had to get through. Like\nthe first stage, the second stage’s naming convention was also suspicious.\n\nStage 2 dnSpy\nExamining dnSpy’s output, we discovered a section completely different to the other parts of\nthe code due to it being obfuscated, and seemingly performing a function in memory — both\n[of which are techniques used to evade detection [T1140].](https://attack.mitre.org/techniques/T1140/)\n\nObfuscated section in Stage 2\nWe used Garbage Man once again to sneakily observe how the malware unraveled itself.\nHowever, if you want an alternate technique to de-obfuscating this part of the code, you can\nuse [de4dot which may also lay it out in an easier to read format.](https://github.com/de4dot/de4dot)\n\nNext, in Garbage Man the objective was to retrieve the hidden stage. Our prior technique\ncould be deployed here again, executing the binary and searching for the MZ headers.\n\nWe found an executable and saved it as “stage3.exe”. We then packaged this up and\nshipped it to PEstudio (There is also information for procexp.sys contained in this but we are\nnot going to focus on that at this time).\n\nSearching for MZ header in stage2.exe\n\n## Stage Three\n\nWhen checking the third stage executable in PEstudio we observed it to be a .NET file and\nthat it contained strings and APIs that suggested it was trying to make a network connection\nto an external source — like the API . This was a big hint that this was a Remote Access\n[Trojan; I smell a RAT [​TA0011]!](https://attack.mitre.org/tactics/TA0011/)\n\nAPIs showing stage3 trying to connect to external sources\n\n\n-----\n\nAfter we had a quick look at stage three s strings through PEstudio, we hopped back over to\nol’ reliable dnSpy. Trawling through stage three, we identified that AES encryption was used\nto encode the port and IP/domain that made up the adversary’s command-and-control (C2).\nWe were for sure dealing with a RAT, and we wanted to gather the IoCs associated with this\nencryption.\n\nAES encryption\nWe set a breakpoint in dnSpy where the AES decryption was performed, and then run the\ndebugger for this to find the decrypted string. Using a ‘stop-start’ technique with breakpoints\nin a debugger allows a malware analyst to halt the malware at opportune moments as it\ndecodes or decrypts itself. This allows us to understand what the malware is doing as it is\ndoing it.\n\ndnSpy breakpoint\nWhen we got to our breakpoint it paused the malware’s execution. Now, we gingerly allowed\nthe malware to progress one step at a time by using the step over button. We did this until\neventually the malware began its decryption phase, and we were first gifted the ports used\nby this RAT.\n\nPorts decrypted in dnSpy\nWhen we stepped over the different sections we were able to see that for this RAT it was\nusing ports “6606, 7707, 8808” and, eventually we unraveled the RAT until it delivered us the\nadversarial server it reported back to: “109.206.241[.]84”.\n\n## Defending against RATs\n\nOur remediations will vary, but the first step is to recommend blocking this public IPv4 at the\norganisation firewall level so the RAT can no longer beacon out.\n\nThe advice for defending against RATs is really advice for malware overall:\n\nChief advice is to train staff to check what they are downloading. Whether it’s from an\nemail attachment, or a site that promises to make their computer run faster if they run\nsomething, is the best and first layer of defense we’d advise you prioritise.\nLeverage network telemetry to try and monitor for unexpected activity. Whether this is\nVPN, firewall, or more security-focused netflow, keeping an eye on in- and outbound\ntraffic will help spot anomalous behaviour. Moreover, cultivating a well-maintained\ndeny-list for can only be a good thing.\nGood security tools are the perfect enemy of our adversaries. Deploy what works for\nyour organisation, just please deploy . A machine without any security solutions is a\nmachine that presents an unmanageable, unacceptable risk to your business.\n\n\n-----\n\n```\nBig thanks to and for help and guidance. Hopefully this writeup has helped show\nexamples of some good tools and techniques that can be used to help decrypt and\nunderstand what is going on with other .NET executables in the future.\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-08 - AsyncRAT- Analysing the Three Stages of Execution.pdf"
    ],
    "report_names": [
        "2023-02-08 - AsyncRAT- Analysing the Three Stages of Execution.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677809158,
    "ts_updated_at": 1743041313,
    "ts_creation_date": 1677662002,
    "ts_modification_date": 1677662002,
    "files": {
        "pdf": "https://archive.orkl.eu/566f65f08b04087ae96afed90ff2ae2f86d5105e.pdf",
        "text": "https://archive.orkl.eu/566f65f08b04087ae96afed90ff2ae2f86d5105e.txt",
        "img": "https://archive.orkl.eu/566f65f08b04087ae96afed90ff2ae2f86d5105e.jpg"
    }
}