{
    "id": "ce97f85b-bbc4-48bf-be00-2a6d994694f1",
    "created_at": "2023-01-12T15:05:47.292092Z",
    "updated_at": "2025-03-27T02:05:24.321528Z",
    "deleted_at": null,
    "sha1_hash": "86257b8fd37a3d20b141bb1f3524d100c0b0a6f2",
    "title": "2022-07-07 - Notable Droppers Emerge in Recent Threat Campaigns",
    "authors": "",
    "file_creation_date": "2022-07-18T18:27:00Z",
    "file_modification_date": "2022-07-18T18:27:00Z",
    "file_size": 258866,
    "plain_text": "# Notable Droppers Emerge in Recent Threat Campaigns\n\n**[fortinet.com/blog/threat-research/notable-droppers-emerge-in-recent-threat-campaigns](https://www.fortinet.com/blog/threat-research/notable-droppers-emerge-in-recent-threat-campaigns)**\n\nJuly 7, 2022\n\nDroppers are malicious files that deploy malware payloads to a victim's device, and are used\nin many threat campaigns. During the second quarter of 2022, FortiGuard Labs observed\nsome active droppers, including Microsoft Excel files, as well as Windows shortcut files and\nISO image files. We captured these samples from phishing emails that were combined with\nsocial engineering to trick victims into loading the malware onto their devices. Recently, we\nfound common malware families involving these samples to be Emotet, Qbot, and Icedid. In\naddition, a malware called Bumblebee, a previously rarely observed malware loader, was\nalso found in some ISO files.\n\nThis blog reveals how droppers are delivered to a victim's device and how they drop malware\npayloads onto the victim's local disk.\n\n\n-----\n\n**Affected Platforms: Microsoft Windows**\n**Impacted Users: Windows users**\n\n**Impact: Controls victim's device and collects sensitive information, plus delivers other**\nmalware\n\n**Severity Level: Critical**\n\n## Malicious Files Delivered Via Phishing Email\n\nThe droppers are spread through phishing emails in three ways. An email may:\n\nContain the dropper or a password-protected ZIP as an attachment\nContain an HTML file attachment that extracts a dropper when opened\nHave a link to download the dropper in the body of the email\n\nEach way delivers the malicious file to victims and tricks them into opening it. See the\nexamples below.\n\nFigure 1: Email with a password-protected ZIP archive attachment\n\nFigure 2: Email with an HTML file attachment\n\nFigure 3: Email with a malicious download link\n\nWe observed the attached HTML file and the webpage of the download link use a technique\ncalled HTML smuggling, which leverages legitimate HTML5 and JavaScript features to\nencode the malicious data. As shown in Figure 4, The HTML smuggling file converts the blob\ndata into a dropper when opened in the web browser.\n\nFigure 4: HTML smuggling file\n\nThe first observation was in May. The download link in the email pointed to a web page\ncontaining HTML smuggling. By June, the HTML smuggling file was sent directly to victims\nas an HTML attachment.\n\n## Analyzing the Droppers and Their Behaviors\n\nThis quarter, we captured three different samples active in the threat campaign. The first\nsample is an Excel file with Excel 4.0 macros. The second is an LNK file (Windows shortcut\nfile). The third sample is an ISO file (optical disk image).\n\n### Excel file with Excel 4.0 macros\n\nThis Excel sample is not new. It has been heavily used in Emotet campaigns since last year,\n[as mentioned in the previous blog. Some sheets of this sample are hidden, as shown in](https://www.fortinet.com/blog/threat-research/Trends-in-the-recent-emotet-maldoc-outbreak?utm_source=blog&utm_medium=blog&utm_campaign=Trends-in-the-recent-emotet-maldoc-outbreak)\nFigure 5, including an Excel 4.0 macro sheet \"IJEIGOPSAGHSPHP\" that contains the\n\n\n-----\n\nmalicious formulas. Cell A1 in this macro sheet is named\n\"Auto_Open9939689536899569357795948589489469636486898953895396378943986\"\nand includes a built-in macro that automatically runs the formula from that cell once the file is\nopened.\n\nThis macro sheet includes formulas that call the API \"URLDownloadToFileA\" to download the\nmalware payloads from several different URLs. The malware payloads are actually DLL files\nand executed using \"regsvr32.exe\".\n\nFigure 5: The malicious formulas in the hidden macro sheet\n\n### LNK file\n\nA Windows shortcut file (commonly referred to as LNK) is created to point to a specific\ntarget. Double-clicking on the shortcut file will execute the target.\n\nAs shown in Figure 6, this sample includes a PowerShell code snippet in its target field. The\nPowerShell code converts a base64 string into a script that contains multiple URLs to\ndownload the malware payload. Next, it attempts to download the malware payload from\neach URL and execute it with \"Regsvr32.exe\" until it succeeds.\n\nFigure 6: The target of the shortcut file\n\nWe also captured other samples containing different malicious code in their target field. As\nshown in Figure 7, there is a command line to download a malware payload from a URL and\nexecute it with \"Regsvr32.exe\".\n\nFigure 7: The malicious code in the target field of captured sample\n\nFigure 8 shows another malicious PowerShell code in the target field. The data is decoded to\na .hta URL and executed using \"mshta.exe\". Next, the VBScript code in the web page of the\n.hta URL extracts a PowerShell code that includes encrypted data. In the end, the encrypted\ndata is transformed into script code to get the payload URL and download malware.\n\nFigure 8: The malicious code in the target field of a captured sample\n\nAll three examples above download and execute a malware payload, despite the differences.\n\n### ISO file\n\nAn ISO file (often called an ISO image), is an archive file that stores the contents of a\nphysical disk. In Windows 10, opening an ISO file by double-clicking it mounts the file on a\nvirtual optical disc drive. Once mounted, the contents of an ISO file can be accessed in File\nExplorer.\n\n\n-----\n\nThreat actors store a malware DLL file and a malicious LNK file in the ISO file. As shown in\nFigure 9, the DLL file is set to a hidden attribute, so it is not visible in File Explorer by default.\nOn the other hand, the shortcut file is used to execute the DLL file using \"Rundll32.exe\".\n\nFigure 9: The malware DLL file and malicious LNK file are stored in the ISO file\n\n## Conclusion\n\nIn recent threat campaigns, all droppers mentioned in the previous section are very active\nand used by more than one malware family. Below is the malware payload of each captured\ndropper.\n\n**Malware Dropper** **Payload**\n\nExcel file Emotet and Qbot\n\nLNK file Emotet, Qbot, and Icedid\n\nISO file Qbot, Icedid, and Bumblebee\n\nFigure 10 shows the notable malware activities during the past three-month period. In early\nApril, Microsoft Excel files were the only file type used to spread malware. We then captured\na shortcut file with the Emotet malware payload, which first appeared on April 23. This new\nmalware attack technique was soon followed by Qbot and Icedid, spreading using shortcut\nfiles as well in early May. Later, ISO files for droppers began appearing in the middle of May,\nand the malware families involved included Qbot, Icedid, and Bumblebee. Next, HTML\nsmuggling attacks emerged in late May and June, including web pages and HTML file\nattachments. This builds malware locally instead of delivering malicious files directly through\nthe network to bypass the firewall.\n\nFigure 10: Timeline of dropper usage in recent threat campaigns\n\nMicrosoft Office files have been a favorite vehicle for threat actors because of the macros.\nHowever, things seem to be changing as Microsoft has added more security controls in\n[Office files with macros. In July of 2021, Microsoft disabled Excel 4.0 macros by default when](https://techcommunity.microsoft.com/t5/excel-blog/excel-4-0-xlm-macros-now-restricted-by-default-for-customer/ba-p/3057905)\nopening an Excel file. In early April 2022, Microsoft created another setting to block VBA\nmacros in files from the internet by default. With more restrictions on the use of macros for\nMicrosoft Office files, threat actors turn to other types of files to increase compromise rates.\nAt this point, shortcut files provide a solid option due to double-click execution. ISO files can\nbe automatically mounted and opened on modern versions of Windows with just a double\nclick. In addition, ISO files take advantage of bypassing the Mark-of-the-Web trust control,\n\n\n-----\n\nmaking them easier to evade antivirus detection than other archive files. The HTML\nsmuggling technique creates malicious files locally to bypass the restrictions on receiving\nfiles from the internet and emails. This explains the proliferation of shortcut files and ISO\nfiles, as well as HTML smuggling used for malware deployment at this time.\n\n## Fortinet Protections\n\nFortinet customers are protected from this malware by FortiGuard’s Web Filtering, Antivirus,\nFortiMail, FortiClient, FortiEDR, and Content Disarm & Reconstruction (CDR) services as\nfollows.\n\nThe phishing email with its attached malicious file can be disarmed by the FortiGuard CDR\nservice.\n\nFortiEDR detects the Excel, shortcut, ISO, and malware payload DLL files as malicious\nbased on their behavior.\n\nFortinet customers are protected from these malicious files and malware by FortiGuard\nAntivirus, which is included in FortiMail. It detects all malicious macro file types, including\nExcel 4.0 macro samples.\n\nAll malicious samples described in this report are detected by FortiGuard Antivirus as\nfollows:\n\nXF/CoinMiner.Z!tr\n\nLNK/Agent.APX!tr\n\nLNK/Agent.PE!tr\n\nLNK/Agent.VPIX!tr.dldr\n\nLNK/PSRunner.VPHQ!tr\n\nJS/Agent.BLOB!tr.dldr\n\nThe malware payloads are detected by FortiGuard Antivirus as follows:\n\nW64/GenKryptik.FWMO!tr\n\nW32/Emotet.C!tr\n\nW32/Qbot.D!tr\n\nW64/GenKryptik.FWBH!tr\n\nW64/GenKryptik.FVFR!tr\n\nW64/Bumblebee.E!tr\n\nW64/IcedID.HG!tr\n\nIn addition, Fortinet has multiple solutions designed to train users on how to understand and\ndetect phishing threats:\n\n\n-----\n\nThe [FortiPhish Phishing Simulation Service uses real-world simulations to help organizations](https://www.fortinet.com/products/phishing-simulation)\ntest user awareness and vigilance to phishing threats and to train and reinforce proper\npractices when users encounter targeted phishing attacks.\n\nWe also suggest that organizations have their end users go through our FREE NSE\ntraining: [NSE 1 – Information Security Awareness. It includes a module on internet threats to](https://training.fortinet.com/local/staticpage/view.php?page=nse_1&utm_source=blog&utm_campaign=nse-1)\ntrain end users on how to identify and protect themselves from phishing attacks.\n\n## IOCs\n\n### Malicious sample (SHA256):\n\n2fe44042cfc6602b43204e38bcbc2773d1e4f87be6aa16073625bc1b33af6877\n\n8fda14f91e27afec5c1b1f71d708775c9b6e2af31e8331bbf26751bc0583dc7e\n\n262f963f949671f429ba3c4233f493a064c08e1361d0c0689f7d3de205d5f7b1\n\n2abfb434d9f16888332ecb2d6eb7660b28e544ad67130d0050330bdb104502c3\n\nadf8cb3421c726efbadff60e97a07f6df6de98818e0978382ec388e7d32a2128\n\n4b582f38e3376346cb066e36ff8dfa32b268154bb2de13870702e8bbf366a023\n\n467bc7ff93d75009d3ba7633662dc9109297ac0f64abb078fd9c8e181abe6cca\n\n### Malware payload (SHA256):\n\n00dcc4642d488643856259cd3c576d9e24045b48783fc21ebdccd5fb4de66f8c\n\n71c9cc11c107b0716eff86de98b3fbd77add1e35ceadf86519eb84b473cb862d\n\n9d4bf3e9577884295102e5dd673b81065d21d348da8ba5a3249e8f5f4c40d5d6\n\n424815ec0a4c06cb7e063c3540919f8f4b1ee369f977448b7eeaa248ef187431\n\n9eea56f945cc00c5216b3250326f8b79d3d2cac5165b250b606729e72bd2647c\n\n90576eb6754dd1c38fb4cea4bf3f029535900436a02caee891c057c01ca84941\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-07 - Notable Droppers Emerge in Recent Threat Campaigns.pdf"
    ],
    "report_names": [
        "2022-07-07 - Notable Droppers Emerge in Recent Threat Campaigns.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535947,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1658168820,
    "ts_modification_date": 1658168820,
    "files": {
        "pdf": "https://archive.orkl.eu/86257b8fd37a3d20b141bb1f3524d100c0b0a6f2.pdf",
        "text": "https://archive.orkl.eu/86257b8fd37a3d20b141bb1f3524d100c0b0a6f2.txt",
        "img": "https://archive.orkl.eu/86257b8fd37a3d20b141bb1f3524d100c0b0a6f2.jpg"
    }
}