{
    "id": "cea3921d-aeb1-47c8-be8b-bb7d54495ed4",
    "created_at": "2023-01-12T15:02:20.716837Z",
    "updated_at": "2025-03-27T02:16:57.970686Z",
    "deleted_at": null,
    "sha1_hash": "48bf2b44d28663e676b93aaf235f727f5df930a0",
    "title": "2022-04-13 - Dismantling ZLoader- How malicious ads led to disabled security tools and ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:24:45Z",
    "file_modification_date": "2022-05-28T23:24:45Z",
    "file_size": 1441887,
    "plain_text": "# Dismantling ZLoader: How malicious ads led to disabled security tools and ransomware\n\n**[microsoft.com/security/blog/2022/04/13/dismantling-zloader-how-malicious-ads-led-to-disabled-security-tools-and-ransomware/](https://www.microsoft.com/security/blog/2022/04/13/dismantling-zloader-how-malicious-ads-led-to-disabled-security-tools-and-ransomware/)**\n\nApril 13, 2022\n\nAs announced today, Microsoft [took action against the ZLoader trojan by working with telecommunications providers around](https://blogs.microsoft.com/on-the-issues/?p=65141)\nthe world to disrupt key ZLoader infrastructure. We used our research into this threat to enrich our protection technologies\nand ensure this infrastructure could no longer be leveraged by operators to distribute the trojan or activate deployed\npayloads like ransomware. Moreover, we are sharing this intelligence to emphasize the importance of collaboration\nthroughout the larger security community. Below, we will detail the various aspects for identifying a ZLoader campaign.\n\nDerived from the Zeus banking trojan first discovered in 2007, ZLoader is a malware family notable for its ability to evolve\nand change from campaign to campaign, having undergone much development since its inception. ZLoader has remained\nrelevant as attackers’ tool of choice by including defense evasion capabilities, like disabling security and antivirus tools, and\nselling access-as-a-service to other affiliate groups, such as ransomware operators. Its capabilities include capturing\nscreenshots, collecting cookies, stealing credentials and banking data, performing reconnaissance, launching persistence\nmechanisms, misusing legitimate security tools, and providing remote access to attackers.\n\nZLoader campaign operators evolved the malware from a basic banking trojan to a more sophisticated piece of malware\ncapable of monetizing compromised devices by selling access to other affiliate groups. By leveraging and misusing\nlegitimate tools like Cobalt Strike and Splashtop, affiliates gain hands-on-keyboard access to affected devices, which can be\nfurther misused for other malicious activities like credential theft or downloading additional payloads, including ransomware.\nZLoader has previously been linked to ransomware infections such as Ryuk, DarkSide, and BlackMatter.\n\nZLoader attacks have affected nations around the world, with the majority targeting the US, China, western Europe, and\nJapan. Due to the modular nature of some of ZLoader’s capabilities and its constant shifts in techniques, different ZLoader\ncampaigns may look nothing alike. Previous campaigns have been fairly simple, with the malware delivered via malicious\nOffice macros attached to emails and then used to deploy modules for capabilities. Other, more recent campaigns are\nnotably complex–injecting malicious code into legitimate processes, disabling antivirus solutions, and ultimately culminating\nin ransomware.\n\n\n-----\n\nFigure 1.\n\nHeat map of nations affected by ZLoader attacks\nZLoader operators have also updated their methodology to frequently deliver the malware through targeted malicious\nGoogle Ads. The use of ad fraud is a stealthy way to target end users as it bypasses typical security solutions that can be\nfound in email and surfaces itself in normal browser activities instead.\n\n[Microsoft Defender for Endpoint detects malicious behaviors related to this campaign. Enabling cloud protection and](https://www.microsoft.com/security/business/threat-protection/endpoint-defender)\nautomatic sample submission for Microsoft Defender Antivirus aids users and organizations in remaining protected on new\n[and emerging threats. Moreover, standardizing the use of the Microsoft Edge browser across all corporate devices and](https://www.microsoft.com/edge)\n[enabling Microsoft Defender SmartScreen protection blocks malicious sites, such as those connected to ZLoader](https://docs.microsoft.com/deployedge/microsoft-edge-security-smartscreen)\ncampaigns.\n\nIn this blog post, we characterize the various methods by which a ZLoader campaign might be identified, along with detailing\ndetection and mitigation information that can help users reduce the impact of this threat.\n\n## ZLoader attack chains\n\nZLoader is a malware variant that has evolved over the years and is used for multiple objectives, meaning that two\ncampaigns which both use ZLoader may appear completely different. For example, an individual who has experience\nresponding to a ZLoader campaign that originated from email and dropped the payload via a malicious Office macro, may be\nshocked at the complexity of a second ZLoader campaign that uses numerous malicious files for reconnaissance and\nantivirus tampering, before finally dropping the actual malware payload.\n\nThe following diagram identifies the most common ways the ZLoader trojan has been observed moving through the delivery,\ninstallation, payload, malware activity, and follow-on activity phases of an attack. This diagram is high-level and may not\ndepict every step or file dropped in some of ZLoader’s more complex campaigns.\n\n\n-----\n\nFigure 2.\n\nZLoader attack flow diagram\n\n### Delivery\n\nZLoader malware has been observed being delivered in multiple ways. Two of the most prominent methods include\nmalicious search engine ads and malicious emails.\n\n**Malicious advertisement delivery**\n\nIn more recent campaigns, ZLoader has shifted away from using email as a means of delivery and instead used malicious\nads on search engines such as Google to trick users into visiting malicious sites.\n\nEach wave of these campaigns impersonated a specific company or product, such as Java, Zoom, TeamViewer, and\nDiscord. For the delivery stage of the attack, the actors would purchase Google Ads for key terms associated with those\nproducts, such as “zoom videoconference.” Users who performed Google searches for those terms during a specific time\nwould be presented with an advertisement that led to the form grabbing malicious domains.\n\nIn each instance of this campaign, the actors would compromise legitimate domains that appeared to be owned by\nindividuals or small businesses, such as personal blogs. They would then set up subdomains on them that were associated\nwith the product they were impersonating during that time. The product-specific subdomain was the second subdomain on\nthe domain, while the first subdomain was an extremely long set of words. For example:\n\n_zoomdownload[.]linkforbusinessandpersonalusersofourserviceinseptember[.]jumpingonwater[.]com_\n_zoomonline[.]forusersinourservicewithbusinessandpersonalcustomers[.]fineanddandiwithrandi[.]com_\n_zoomdownload[.]onlinestartserviceforyourworkstudymeeting[.]indyflat-tax[.]com_\n_zoomdownloadlink[.]zoomdownload[.]onlinesoftwareforpersonalandbusinessusersinseptember[.]lifeintrainingpodcast[.]com_\n_teamviewerdownload[.]fastserviceworkonlinelinkjoininaugustseptermber[.]greenlinefood[.]net_\n_teamviewerdownload[.]directserviceforonlinepersonalandbusinessusersofourservice[.]wahatalrabeeh[.]co_\n_teamviewerstart[.]linkforpersonalandbusinessusersinourservicestartnow[.]ellisclinic[.]com_\n\nIn at least one instance of this activity, the compromised webpage was set up to appear as though it was associated with the\ncompany Get VoIP, a legitimate service that provides comparisons between various VoIP providers. The attackers did not\ncompromise the GetVoIP website or service, rather, they designed the webpage to impersonate the real GetVoIP site.\n\n\n-----\n\nFigure 3.\n\nThe compromised domain designed to look like the GetVoIP website\nFrom these compromised domains, the users will attempt to download the product being impersonated, which redirects them\nto an attacker-owned domain. These domains also pretend to be associated with the legitimate product being impersonated,\nand frequently use the .site TLD.\n\nOne example of the chain of redirected domains associated with this activity is:\n\n1. https://adservice.google[.]com, redirects to:\n2. zoomdownload.linkforbusinessandpersonalusersofourserviceinseptember.jumpingonwater[.]com, redirects to:\n3. zoomvideo[.]site\n\nThe ZLoader operators have tended to use REG.RU, LLC as the registrar for these final .site domains. Additionally, many of\nthe domains used within a single campaign have the registrant contact email in common with each other, making it easy to\npivot and find other potentially related domains.\n\nThe final website in this chain downloads the initial malicious .msi file.\n\n**Email delivery**\n\nAs with many other malware variants, prior ZLoader campaigns have also been known to use malicious emails to deliver\nOffice documents containing malicious macros that download the payload. The ZLoader operators do not have a preferred\nmethod of delivering these Office documents and have been observed using both links and attachments in various\ncampaigns. Some observed means by which a ZLoader email was associated with a malicious document include:\n\nAttached macro-enabled Microsoft Office document\nAttached Excel 4.0 document that contained Hidden Sheets and Very Hidden Sheets to host macros\nAttached PDF with link to a macro-enabled Office document\nAttached ZIP file that contained a macro-enabled Office document or executable\nLink to a Google Docs page with links to a macro-enabled Office document\n\nThe emails have used a variety of lures, which typically convey a sense of urgency. Some of the campaigns used lures\nbased on currents events at the time of the campaign, such COVID-19, or generic lures, such as overdue invoice payments\nand fake resumes or CVs. Additionally, most of these emails have been sent from consumer email services—\nnotably AOL.com. There have also been campaigns that used domains that are associated with the lure theme; for example,\nsome emails were sent from a COVID-themed sender domain.\n\n\n-----\n\nFigure 4. A\n\nscreenshot of a sample email associated with the ZLoader campaign posing as a request for an overdue invoice.\nRegardless of how the operator chooses to deliver the Office document, once the user opens it, they are prompted to enable\nmacros to view the content. In various known cases, the malicious macros either directly started to download subsequent\npayloads or they dropped a VBS file that in turn performed the download.\n\nIn general, a connection was made to a compromised WordPress instance hosting the PHP code used by the ZLoader kit.\nAt this stage, the ZLoader payload was downloaded as a DLL masquerading as an HTML file that is then launched\nusing rundll32.exe.\n\n### Installation\n\nLess complex ZLoader campaigns go straight from the delivery phase to dropping the malicious payload. In more complex\n[ZLoader campaigns, the next phase of the attack shifts to using a legitimate process such as msiexec.exe to download](https://docs.microsoft.com/windows-server/administration/windows-commands/msiexec)\nseveral additional files, including many non-malicious .dll files that are legitimate pieces of whatever software is being\nimpersonated at the time. A malicious .bat file is hidden in those .dll files.\n\nIn several instances, these files were added to a folder pretending to be associated with legitimate software, such as Oracle\nJava or Brave Browser, using the following pattern as an example: C:\\Program Files (x86)\\Sun Technology Network\\Oracle\n_Java SE\\[malicious file]._\n\nThe .bat file launches PowerShell to reach out to a download domain to drop the ZLoader payload. Examples of these\ndomains include:\n\nquickbooks[.]pw\nsweepcakesoffers[.]com\nDatalystoy[.]com\nTeamworks455[.]com\nClouds222[.]com\n\nIn some campaigns, the attackers used a script to run various discovery commands prior to downloading the ZLoader\npayload, including:\n\nipconfig /all\nnet config workstation\nnet view /all\nnet view /all /domain\n\n\n-----\n\nnltest /domain_trusts\nnltest /domain_trusts /all_trusts\n\n### Payload\n\nOnce the ZLoader payload is on the device, it may drop various modules that provide it with additional functionality, such as:\n\nCapturing screenshots\nCollecting cookies\nStealing banking passwords\nProviding VNC access to attackers\n\nOperators can choose which of these modules to deliver based on how the malware is configured. In most campaigns, the\nmodule files are dropped in subfolders in the AppData folder. Although operators are free to give the subfolders and files\narbitrary names, the names Microsoft researchers have actually observed exhibit two patterns:\n\nSets of characters that appear random\nConcatenated dictionary words\n\nIn several campaigns, attackers opted not to use these modules and instead used the payload to download an additional\nmalicious file. This file was launched and then called back out to the same download domain that the ZLoader payload was\ndownloaded from, to download a PowerShell script. The downloaded script checked if the device was workgroup- or domainconnected. The PowerShell script then reached out to the command and control (C2) domain and downloaded two malicious\nfiles—typically an .exe and a .dll. The script used _[regsvr32.exe to launch the DLL and run a command to time out for 200](https://docs.microsoft.com/windows-server/administration/windows-commands/regsvr32)_\nseconds. After this, _[cmd.exe was used to launch an additional malicious file, which downloads a VBS file that is loaded by](https://docs.microsoft.com/windows-server/administration/windows-commands/cmd)_\nwscript.\n\n\n-----\n\nFigure 5.\n\n\nScript used for workgroup-joined devices\n\n\n-----\n\nFigure 6.\n\nScript used for domain-joined devices\nThese files were used to tamper with security solutions and to grant attackers hands-on-keyboard access.\n\n### Browser credential theft\n\nOne of the main functionalities of ZLoader malware is to steal online credentials targeting banks and financial institutions, as\nwell as other credentials, via client-side web injection and form grabbing attacks. Web injection allows the attacker to alter\ncontent of the websites displayed to the victim, while form grabbing captures credentials from the browser windows. To\naccomplish those actions, the malware implements an Adversary-in-the-browser (AiTB) attack.\n\nZLoader’s main process, msiexec.exe, spawns several threads running at the same time to perform different tasks. Each of\nthese threads communicate with one another using shared data stored in the global memory, system registry, and encrypted\nfiles. Threads are spawned that execute functions to install a fake certificate and run a local proxy, while another thread is\ninjected and executed inside the loaded browser process, which is responsible for redirecting traffic via proxy.\n\nA thread runs to traverse the list of running processes and inject codes to target browser processes discovered. ZLoader\ntargets the following browser processes:\n\niexplore.exe\nfirefox.exe\nchrome.exe\nmsedge.exe (Microsoft Edge)\n\nThe hook API TranslateMessage is the key malware functionality that performs the form grabbing, keylogging, and\nscreenshotting of users’ desktops.\n\nFor the target browser processes, the following APIs are hooked for tracking, redirecting network activities, and controlling\nthe certificate verification. The ZwDeviceIoControlFile hooks allow HTTP/HTTPs responses containing web pages codes\nfrom the target to be redirected to the proxy server to be modified. Moreover, any certificate will be tagged as valid.\n\nntdll.dll – ZwDeviceIoControlFile\ncrypt32.dll – CertGetCertificateChain, CertVerifyCertificateChainPolicy\n\nAnother thread is responsible for checking instructions and configurations from the C2 servers every 10 minutes. Included in\nthe configuration are the list of target banks, financial institutions, and online companies, and the instruction on how to\nperform the web injection.\n\nOne of ZLoader’s targets is the Microsoft online sign-in page at https://login.microsoftonline[.]com. Several of Microsoft’s\nmain websites, such as office[.]com, redirect users to this Microsoft online page when they try to sign into their Microsoft\naccount. When users load their favorite web browser, such as Microsoft Edge, then visit and try to sign into their Microsoft\n\n\n-----\n\naccount, ZLoader will match the URL to the list of targets. In this case it will match to the first one above and perform the\nweb injection by inserting malicious JavaScript codes after the string “</head>” and then rendering to the browser\napplication.\n\nFigure 7. A\n\nscreenshot of the fake Microsoft sign-in screen\nThe codes injected will insert fake web controls and/or additional JavaScript codes that are responsible for capturing the\ncredentials such as usernames, passwords, and others. This captured information is encrypted and sent to the main bot and\nthen to the C2 server. With these stolen credentials, the ZLoader operators can potentially gain access to users’ Microsoft\nonline account to perform further illicit activities. As the malicious activities occurred in the background, even “tech savvy”\nusers may not be aware that their browser was tampered with, and credentials were stolen.\n\n### Defense evasion\n\nZLoader has used various methods of defense evasion, focused on attempting to appear more legitimate or by disabling\nsecurity tools. In multiple campaigns associated with malicious ads, the ZLoader operators would sign malicious files used in\ntheir attack chain. Signing these files is intended to make them appear to be legitimate, non-malicious files used by real\nsoftware, rather than malicious files used by malware.\n\nThe first method ZLoader has used to sign files is by creating fictitious companies. In certain campaigns, the .msi files that\nare installed on the device after the user visits a malicious ad are signed by a fictitious company created by the operator for\nthe purpose of the campaign. The malware operators created multiple fraudulent companies, such as Flyintellect Inc, and\n_Datalyst Oy, in several campaigns. Due to the way .msi files are designed, the registry keys that are added by this activity_\nlater in the attack chain are also published by the same company name.\n\nAnother method operators have used to evade detection is a set of techniques that utilize validly-signed files to hide\nmalicious scripts through vulnerabilities like CVE-2020-1599, CVE-2013-3900, and CVE-2012-0151.\n\nZLoader operators have also attempted to perform defense evasion by disabling security tools. In many instances, ZLoader\nwill drop a file, frequently a .bat file, that then uses PowerShell to turn off and alter security settings, such as excluding all .dll\nand .exe files and regsvr32.exe from being scanned.\n\n\n-----\n\nFigure 8.\n\nSome examples of PowerShell commands run during this phase of the attack\n\n### Persistence\n\nZLoader has used various persistence methods across separate campaigns. The first method observed by Microsoft\nSecurity Researchers involves the ZLoader DLL using rundll32.exe to register itself. In other documented cases, it also\ncreates the following persistence mechanisms for itself or its modules:\n\nRegistry entries under HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nFiles in the Startup folder\n\nIn more recent campaigns, the attackers maliciously used Atera, a legitimate remote monitoring software. While Atera was\nnot compromised, attackers leveraged its built-in Splashtop Remote Access capabilities to achieve persistence on the\ncompromised device.\n\n### Objectives\n\nAfter establishing persistence, the campaign operators behind ZLoader infections monetize their access to domain-joined\ndevices by selling access-as-a-service to other groups, including ransomware affiliates. These groups can then use this\n[access for their own goals, including installations of Cobalt Strike, which enables hands-on keyboard activities by the actors.](https://securitycenter.windows.com/threatanalytics3/afa23673-5c90-4048-af1e-eb80e464ed9f/overview)\n\nIn one instance, the VBS downloaded a batch script which connected to a Cobalt Strike C2 via a DLL beacon dropped on\nthe device by PowerShell. It was launched via rundll32.exe, with the known Cobalt Strike flag StartW. Reconnaissance\nqueries were then run on domain-joined devices, performing actions such as searching for all domain trusts on the network.\n\nWith the use of Cobalt Strike and Splashtop, attackers have hands-on-keyboard access to affected devices that can be\nleveraged for subsequent objectives, including credential theft or deployment of additional payloads such as ransomware.\n\n[In the past, ZLoader has been tied to ransomware infections such as Ryuk. We’ve also seen ZLoader operators provide](https://securitycenter.windows.com/threatanalytics3/787be29b-aaa6-4970-8c86-222c36ce2313/overview)\naccess to [ELBRUS actors who deployed DarkSide ransomware (earlier in 2021). Those that were more recently observed](https://securitycenter.windows.com/threatanalytics3/77c60fe4-03a8-4e81-ac29-bdc2ab14d40e/overview)\n[had been deploying BlackMatter ransomware. Given such history, the Cobalt Strike payloads might indicate pre-ransomware](https://securitycenter.windows.com/threatanalytics3/78124732-0ead-425b-ad95-17b8013395e3/overview)\nactivities that prefigure a real threat of ransomware attacks.\n\n## Defending against ZLoader attacks\n\nThe take down effort against ZLoader is just one of the ways in which Microsoft provides real-world protection against\nthreats. This action will result in protection for a wide range of organizations around the world from malware, affiliates with\nhands-on-keyboard access, and additional payloads delivered via ZLoader’s infrastructure.\n\n\n-----\n\nLike many modern malware variants, getting ZLoader onto a device is oftentimes just the first step in what ends up being a\nlarger attack. The trojan further exemplifies the trend of common malware increasingly harboring more dangerous threats, a\npattern also observed in other platforms. ZLoader operators frequently monetize access from infections by selling it to other\naffiliate groups, who then use the purchased access to carry out their own malicious objectives. Affiliates may further misuse\nlegitimate tools like Cobalt Strike or Splashtop to gain full hands-on-keyboard access to target devices, enabling attackers to\nperform additional discovery, find high-value targets on the network, move laterally, and drop additional payloads, such as\nransomware variants.\n\nThe best advice for preventing ZLoader infections is to simply avoid downloading attachments contained in emails from\nunknown senders as well as clicking on sponsored ads and links in search engine results, instead opting for unsponsored\nresults from verified, trusted sources. Good credential hygiene, network segmentation, and similar best practices increase\nthe “cost” to attackers, helping disrupt their activities before they reach their target.\n\nDefenders can take the following mitigation steps to defend against this threat:\n\n[Encourage users to use Microsoft Edge and other web browsers that support Microsoft Defender SmartScreen, which](https://www.microsoft.com/edge)\nidentifies and blocks malicious websites, including phishing sites, scam sites, and sites that contain exploits and host\nmalware. SmartScreen removes the reputation information for the certificates leveraged during these attacks. Binaries\nsigned with those certificates will trigger a warning about an “unrecognized app.”\nUse [Windows Defender Application Control, AppLocker, or other application control technologies to prevent end users](https://docs.microsoft.com/mem/configmgr/protect/deploy-use/use-device-guard-with-configuration-manager)\nfrom running unapproved software on their computers.\nRun the latest version of your operating systems and applications. Deploy the latest security updates as soon as they\nbecome available.\nUse only official, trustworthy websites and direct download links.\n\nZLoader’s prevalence in the threat landscape demands comprehensive protection capable of detecting and stopping this\n[malware, its components, and other similar threats at every stage of the attack chain. Microsoft Defender for Endpoint](https://www.microsoft.com/security/business/threat-protection/endpoint-defender)\nprovides next-generation protection that reinforces network security perimeters and incorporates antimalware capabilities to\ncatch emerging threats, including ZLoader, Cobalt Strike, additional payloads such as ransomware, and subsequent attacker\nbehaviors. Moreover, our [endpoint detection and response (EDR) capabilities detect ZLoader’s malicious files, behaviors,](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/overview-endpoint-detection-response?view=o365-worldwide)\ndomain connections, and other related events before and after execution.\n\nDefenders can further apply the following mitigations to reduce the environmental attack surface and mitigate the impact of\nthis threat and its payloads:\n\n[Configure Microsoft Defender for Office 365 to recheck links on click. Safe Links provides URL scanning and rewriting](https://docs.microsoft.com/office365/securitycompliance/atp-safe-links)\nof inbound email messages in mail flow, and time-of-click verification of URLs and links in email messages and other\n[locations. Safe Links scanning occurs in addition to the regular anti-spam and anti-malware protection in inbound email](https://docs.microsoft.com/microsoft-365/security/office-365-security/anti-spam-and-anti-malware-protection?view=o365-worldwide)\nmessages in Exchange Online Protection (EOP). Safe Links scanning can help protect your organization from\nmalicious links that are used in phishing and other attacks.\n[Configure Microsoft Defender for Office 365 to detonate file attachments via Safe Attachments. Safe Attachments](https://docs.microsoft.com/microsoft-365/security/office-365-security/safe-attachments)\nprovides an additional layer of protection for email attachments by verifying a file in a virtual environment prior to\ndelivering to the inbox.\nCheck your [Office 365 antispam policy and your mail flow rules for allowed senders, domains and IP addresses. Apply](https://docs.microsoft.com/microsoft-365/security/office-365-security/configure-your-spam-filter-policies)\nextra caution when using these settings to bypass antispam filters, even if the allowed sender addresses are\nassociated with trusted organizations—Office 365 will honor these settings and can let potentially harmful messages\npass through. [Review system overrides in threat explorer to determine why attack messages have reached recipient](https://docs.microsoft.com/microsoft-365/security/office-365-security/threat-explorer#system-overrides)\nmailboxes.\n[Configure Exchange Online to enable zero-hour auto purge (ZAP) in response to newly acquired threat intelligence.](https://docs.microsoft.com/office365/securitycompliance/zero-hour-auto-purge)\nZAP retroactively detects and neutralizes malicious phishing, spam, or malware messages that have already been\ndelivered to mailboxes.\nTurn on [network protection to block connections to malicious domains and IP addresses.](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/enable-network-protection)\nTurn on [tamper protection features to prevent attackers from stopping security services.](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-antivirus/prevent-changes-to-security-settings-with-tamper-protection)\nTurn on [cloud-delivered protection and automatic sample submission on Microsoft Defender Antivirus. These](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-antivirus/enable-cloud-protection-microsoft-defender-antivirus)\ncapabilities use artificial intelligence and machine learning to quickly identify and stop new and unknown threats.\n\n\n-----\n\n[Turn on the following attack surface reduction rules to block or audit activity associated with this threat:](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction)\n\nBlock executable files from running unless they meet a prevalence, age, or trusted list criterion\nBlock all Office applications from creating child processes\nBlock Office applications from creating executable content\nBlock executable content from email client and webmail\nBlock Office applications from injecting code into other processes\nBlock credential stealing from the Windows local security authority subsystem (lsass.exe)\nBlock process creations originating from PsExec and WMI commands\nUse advanced protection against ransomware\nBlock JavaScript or VBScript from launching downloaded executable content\nBlock execution of potentially obfuscated scripts\n\n## Appendix\n\n### Microsoft 365 Defender detections\n\n**Microsoft Defender Antivirus**\n\nMicrosoft Defender Antivirus detects threat components as the following malware:\n\nTrojan:Win64/ZLoader\n[Trojan:Win32/ZLoader](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/Zloader&threatId=-2147200136)\n\n**Shared malware and generic detections**\n\nMicrosoft Defender Antivirus incorporates next-generation antivirus capabilities, including machine learning and behavioral\ndetection. This can result in overlapping detections, particularly of first-seen components and polymorphic variants. The\ndetection names are listed here for reference, but related alerts are not actively monitored.\n\nInstances of Cobalt Strike use can be detected as the following:\n\nBynoco – Cobalt Strike\nAtosev – Cobalt Strike\nCosipor – Cobalt Strike\n\n**Microsoft Defender for Endpoint EDR**\n\nAlerts with the following titles in the security center can indicate threat activity on your network:\n\nSuspicious behavior associated with ZLoader\nFile associated with ZLoader\nConnection to a domain associated with ZLoader\n\nThe following alerts might also indicate activity associated with this threat. However, unrelated threat activity can trigger\nthese alerts.\n\nMicrosoft Defender Antivirus protection turned off\nSuspicious Microsoft Defender Antivirus exclusion\nZLoader’ malware was detected\nSuspicious behavior by cmd.exe was observed\nSuspicious PowerShell command line\nSuspicious Remote System Discovery\nSuspicious Domain Trust Discovery\n\n**Microsoft Defender for Office 365**\n\nSignals from Microsoft Defender for Office 365 inform Microsoft 365 Defender, which correlates cross-domain threat\nintelligence to deliver coordinated defense, that ZLoader has been detected when a document is delivered via email when\ndetonation is enabled. These alerts, however, can also be triggered by unrelated threat activity.\n\n\n-----\n\nA potentially malicious URL click was detected\nEmail messages containing malicious file removed after delivery\nEmail messages containing malicious URL removed after delivery\nEmail messages containing malware removed after delivery\nEmail messages removed after delivery\nMalware campaign detected after delivery\nMalware campaign detected and blocked\nMalware not zapped because ZAP is disabled\n\n### Hunting queries\n\n**Microsoft 365 Defender**\n\nTo locate possible exploitation activity, run the following queries:\n\n**ZLoader alert activity**\n\nSurface devices with ZLoader alerts and related malicious activity.\n```\n// Get any devices with ZLoader related Alert Activity\nlet DeviceAlerts = AlertInfo\n| where Title in~('Suspicious behavior associated with ZLoader',\n'File associated with ZLoader',\n'Connection to a domain associated with ZLoader')\n// Join in evidence information\n| join AlertEvidence on AlertId\n| where DeviceId != \"\"\n| summarize by DeviceId, Title;\n// Get additional alert activity for each device\nAlertEvidence\n| where DeviceId in(DeviceAlerts)\n// Add additional info\n| join kind=leftouter AlertInfo on AlertId\n| summarize DeviceAlerts = make_set(Title), AlertIDs = make_set(AlertId) by DeviceId, bin(Timestamp, 1d)\n\n```\n**MSHTA-loading DLLs**\n\nLook for instances of MSHTA loading suspicious DLL files.\n```\nDeviceProcessEvents\n| where not(FileName has_any(\"certutil\", \"certutil32\")) and FileName endswith \".exe\" and\nProcessVersionInfoFileDescription =~ \"certutil.exe\"\n| where not(FolderPath has_any(\"installer\", \"program files\"))\n\n```\n**Suspicious registry keys**\n\nLook for registry keys created by the fraudulent, attacker-created companies used in this campaign.\n```\nDeviceRegistryEvents\n| where RegistryValueData in('Flyintellect Inc.', 'Datalyst ou')\n\n```\n**Malicious .bat file created in fake Oracle Java SE folder path**\n\nLook for .bat files created in the Oracle Java SE file path associated with this activity.\n```\nDeviceFileEvents\n| where FileName endswith '.bat'\n  and FolderPath has @'Program Files (x86)\\Sun Technology Network\\Oracle Java SE'\n\n```\n**Tim.exe payload delivery**\n\nLook for the Tim.exe payload being downloaded onto an affected device.\n```\nDeviceNetworkEvents\n| where InitiatingProcessFileName =~ 'powershell.exe'\n  and InitiatingProcessCommandLine has('Invoke-WebRequest') and InitiatingProcessCommandLine endswith '-OutFile\ntim.EXE'\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-13 - Dismantling ZLoader- How malicious ads led to disabled security tools and ransomware.pdf"
    ],
    "report_names": [
        "2022-04-13 - Dismantling ZLoader- How malicious ads led to disabled security tools and ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535740,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653780285,
    "ts_modification_date": 1653780285,
    "files": {
        "pdf": "https://archive.orkl.eu/48bf2b44d28663e676b93aaf235f727f5df930a0.pdf",
        "text": "https://archive.orkl.eu/48bf2b44d28663e676b93aaf235f727f5df930a0.txt",
        "img": "https://archive.orkl.eu/48bf2b44d28663e676b93aaf235f727f5df930a0.jpg"
    }
}