{
    "id": "cf21b362-2390-44f4-af2e-377ee2b07157",
    "created_at": "2023-01-12T15:00:33.121963Z",
    "updated_at": "2025-03-27T02:16:39.939459Z",
    "deleted_at": null,
    "sha1_hash": "0c2c898034586ed0bfb055fafa332086b07a3679",
    "title": "2022-07-12 - From cookie theft to BEC- Attackers use AiTM phishing sites as entry point to further financial fraud",
    "authors": "",
    "file_creation_date": "2022-07-18T18:27:10Z",
    "file_modification_date": "2022-07-18T18:27:10Z",
    "file_size": 1470255,
    "plain_text": "# From cookie theft to BEC: Attackers use AiTM phishing sites as entry point to further financial fraud\n\n**microsoft.com/security/blog/2022/07/12/from-cookie-theft-to-bec-attackers-use-aitm-phishing-sites-as-entry-point-to-**\nfurther-financial-fraud/\n\nJuly 12, 2022\n\nA large-scale phishing campaign that used adversary-in-the-middle (AiTM) phishing sites\nstole passwords, hijacked a user’s sign-in session, and skipped the authentication process\neven if the user had enabled multifactor authentication (MFA). The attackers then used the\nstolen credentials and session cookies to access affected users’ mailboxes and perform\n[follow-on business email compromise (BEC) campaigns against other targets. Based on our](https://www.microsoft.com/security/blog/2021/05/06/business-email-compromise-how-microsoft-is-combating-this-costly-threat/)\nthreat data, the AiTM phishing campaign attempted to target more than 10,000 organizations\nsince September 2021.\n\n\n-----\n\nFigure 1. Overview of AiTM phishing campaign and follow-on BEC\nPhishing remains to be one of the most common techniques attackers use in their attempts\nto gain initial access to organizations. According to the 2021 Microsoft Digital Defense\nReport, reports of phishing attacks doubled in 2020, and phishing is the most common type\nof malicious email observed in our threat signals. MFA provides an added security layer\nagainst credential theft, and it is expected that more organizations will adopt it, especially in\n[countries and regions where even governments are mandating it. Unfortunately, attackers](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/)\nare also finding new ways to circumvent this security measure.\n\nIn AiTM phishing, attackers deploy a proxy server between a target user and the website the\nuser wishes to visit (that is, the site the attacker wishes to impersonate). Such a setup allows\nthe attacker to steal and intercept the target’s password and the session cookie that proves\ntheir ongoing and authenticated session with the website. Note that this is not a vulnerability\nin MFA; since AiTM phishing steals the session cookie, the attacker gets authenticated to a\nsession on the user’s behalf, regardless of the sign-in method the latter uses.\n\n[Microsoft 365 Defender detects suspicious activities related to AiTM phishing attacks and](https://www.microsoft.com/security/business/threat-protection/microsoft-365-defender)\ntheir follow-on activities,such as session cookie theft and attempts to use the stolen cookie to\nsign into Exchange Online. However, to further protect themselves from similar attacks,\norganizations should also consider complementing MFA with [conditional access policies,](https://docs.microsoft.com/azure/active-directory/conditional-access/overview)\nwhere sign-in requests are evaluated using additional identity-driven signals like user or\ngroup membership, IP location information, and device status, among others.\n\nWhile AiTM phishing isn’t new, our investigation allowed us to observe and analyze the\nfollow-on activities stemming from the campaign—including cloud-based attack attempts—\nthrough cross-domain threat data from Microsoft 365 Defender These observations also let\n\n\n-----\n\nus improve and enrich our solutions protection capabilities. This campaign thus also\nhighlights the importance of building a comprehensive defense strategy. As the threat\nlandscape evolves, organizations need to assume breach and understand their network and\nthreat data to gain complete visibility and insight into complex end-to-end attack chains.\n\nIn this blog, we’ll share our technical analysis of this phishing campaign and the succeeding\npayment fraud attempted by the attackers. We’ll also provide guidance for defenders on\nprotecting organizations from this threat and how Microsoft security technologies detect it.\n\n## How AiTM phishing works\n\nEvery modern web service implements a session with a user after successful authentication\nso that the user doesn’t have to be authenticated at every new page they visit. This session\nfunctionality is implemented through a session cookie provided by an authentication service\nafter initial authentication. The session cookie is proof for the web server that the user has\nbeen authenticated and has an ongoing session on the website. In AiTM phishing, an\nattacker attempts to obtain a target user’s session cookie so they can skip the whole\nauthentication process and act on the latter’s behalf.\n\nTo do this, the attacker deploys a webserver that proxies HTTP packets from the user that\nvisits the phishing site to the target server the attacker wishes to impersonate and the other\nway around. This way, the phishing site is visually identical to the original website (as every\nHTTP is proxied to and from the original website). The attacker also doesn’t need to craft\ntheir own phishing site like how it’s done in conventional phishing campaigns. The URL is the\nonly visible difference between the phishing site and the actual one.\n\nFigure 2 below illustrates the AiTM phishing process:\n\n\n-----\n\nFigure 2. AiTM phishing website intercepting the authentication process\nThe phishing page has two different Transport Layer Security (TLS) sessions—one with the\ntarget and another with the actual website the target wants to access. These sessions mean\nthat the phishing page practically functions as an AiTM agent, intercepting the whole\nauthentication process and extracting valuable data from the HTTP requests such as\npasswords and, more importantly, session cookies. Once the attacker obtains the\nsession cookie, they can inject it into their browser to skip the authentication process, even if\nthe target’s MFA is enabled.\n\nThe AiTM phishing process can currently be automated using open-source phishing toolkits\nand other online resources. Among the widely-used kits include\n[Evilginx2,](https://github.com/kgretzky/evilginx2) [Modlishka, and](https://github.com/drk1wi/Modlishka) [Muraena.](https://github.com/muraenateam/muraena)\n\n## Tracking an AiTM phishing campaign\n\nUsing Microsoft 365 Defender threat data, we detected multiple iterations of an AiTM\nphishing campaign that attempted to target more than 10,000 organizations since September\n2021. These runs appear to be linked together and target Office 365 users by spoofing the\nOffice online authentication page.\n\nBased on our analysis, these campaign iterations use the Evilginx2 phishing kit as their AiTM\ninfrastructure. We also uncovered similarities in their post-breach activities, including\nsensitive data enumeration in the target’s mailbox and payment frauds.\n\n### Initial access\n\n\n-----\n\nIn one of the runs we ve observed, the attacker sent emails with an HTML file attachment to\nmultiple recipients in different organizations. The email message informed the target\nrecipients that they had a voice message.\n\nFigure 3. Sample phishing email with HTML file attachment\nWhen a recipient opened the attached HTML file, it was loaded in the user’s browser and\ndisplayed a page informing the user that the voice message was being downloaded. Note,\nhowever, that the download progress bar was hardcoded in the HTML file, so no MP3 file\nwas being fetched.\n\n\n-----\n\nFigure 4. HTML file attachment loaded in the target’s browser\n\nFigure 5. Source code of the HTML attachment\nInstead, the page redirected the user to a redirector site:\n\nFigure 6. Screenshot of the redirector site\nThis redirector acted as a gatekeeper to ensure the target user was coming from the original\nHTML attachment. To do this, it first validated if the expected fragment value in the URL—in\nthis case, the user’s email address encoded in Base64—exists. If the said value existed, this\n\n\n-----\n\npage concatenated the value on the phishing site s landing page, which was also encoded in\nBase64 and saved in the “link” variable (see Figure 7 below).\n\nFigure 7. A redirection logic included in the <script> tag of the redirector site\nBy combining the two values, the succeeding phishing landing page automatically filled out\nthe sign-in page with the user’s email address, thus enhancing its social engineering lure.\nThis technique was also the campaign’s attempt to prevent conventional anti-phishing\nsolutions from directly accessing phishing URLs.\n\nNote that on other instances, we observed that the redirector page used the following URL\nformat:\n```\nhxxp://[username].[wildcard domain].[tld]/#[user email encoded in Base64]\n\n```\nIn this format, the target’s username was used as part of an infinite subdomains technique,\n[which we have previously discussed in](https://www.microsoft.com/security/blog/2021/09/21/catching-the-big-fish-analyzing-a-large-scale-phishing-as-a-service-operation/) [other phishing campaigns.](https://www.microsoft.com/security/blog/2021/10/21/franken-phish-todayzoo-built-from-other-phishing-kits/)\n\n\n-----\n\nFigure 8. Evasive redirector site loaded on the target’s browser\nAfter the redirection, the user finally landed on an Evilginx2 phishing site with their username\nas a fragment value. For example:\n```\nhxxp://login[.]nmmnvvx[.]xyz/yamRSmFG#[username]@[organizationname].[tld]\n\n```\n\n-----\n\nFigure 9. Sample phishing landing page\nThe phishing site proxied the organization’s [Azure Active Directory (Azure AD) sign-in page,](https://azure.microsoft.com/services/active-directory/)\nwhich is typically login.microsoftonline.com. If the organization had configured their Azure AD\nto include their branding, the phishing site’s landing page also contained the same branding\nelements.\n\n\n-----\n\nFigure 10. A mockup of a phishing landing page that retrieves the Azure AD branding of an\norganization\nOnce the target entered their credentials and got authenticated, they were redirected to the\nlegitimate office.com page. However, in the background, the attacker intercepted the said\ncredentials and got authenticated on the user’s behalf. This allowed the attacker to perform\nfollow-on activities—in this case, payment fraud—from within the organization.\n\n### Post-breach BEC\n\nPayment fraud is a scheme wherein an attacker tricks a fraud target into transferring\npayments to attacker-owned accounts. It can be achieved by hijacking and replying to\nongoing finance-related email threads in the compromised account’s mailbox and luring the\nfraud target to send money through fake invoices, among others.\n\nBased on our analysis of Microsoft 365 Defender threat data and our investigation of related\nthreat alerts from our customers, we discovered that it took as little time as five minutes after\ncredential and session theft for an attacker to launch their follow-on payment fraud. From our\nobservation, after a compromised account signed into the phishing site for the first time, the\nattacker used the stolen session cookie to authenticate to Outlook online\n(outlook.office.com). In multiple cases, the cookies had an MFA claim, which means that\neven if the organization had an MFA policy, the attacker used the session cookie to gain\naccess on behalf of the compromised account.\n\n**Finding a target**\n\nThe following days after the cookie theft, the attacker accessed finance-related emails and\nfile attachments files every few hours. They also searched for ongoing email threads where\npayment fraud would be feasible. In addition, the attacker deleted from the compromised\n\n\n-----\n\naccount s Inbox folder the original phishing email they sent to hide traces of their initial\naccess.\n\nThese activities suggest the attacker attempted to commit payment fraud manually. They\nalso did this in the cloud—they used Outlook Web Access (OWA) on a Chrome browser and\nperformed the abovementioned activities while using the compromised account’s stolen\nsession cookie.\n\nOnce the attacker found a relevant email thread, they proceeded with their evasion\ntechniques. Because they didn’t want the compromised account’s user to notice any\nsuspicious mailbox activities, the attacker created an Inbox rule with the following logic to\nhide any future replies from the fraud target:\n\n_“For every incoming email where sender address contains [domain name of the fraud target],_\n_move the mail to “Archive” folder and mark it as read.”_\n\n**Conducting payment fraud**\n\nRight after the rule was set, the attacker proceeded to reply to ongoing email threads related\nto payments and invoices between the target and employees from other organizations, as\nindicated in the created Inbox rule. The attacker then deleted their replies from the\ncompromised account’s Sent Items and Deleted Items folders.\n\nSeveral hours after the initial fraud attempt was performed, the attacker signed in once every\nfew hours to check if the fraud target replied to their email. In multiple instances, the attacker\ncommunicated with the target through emails for a few days. After sending back responses,\nthey deleted the target’s replies from the Archive folder. They also deleted their emails from\nthe Sent Items folder.\n\nOn one occasion, the attacker conducted multiple fraud attempts simultaneously from the\nsame compromised mailbox. Every time the attacker found a new fraud target, they updated\nthe Inbox rule they created to include these new targets’ organization domains.\n\nBelow is a summary of the campaign’s end-to-end attack chain based on threat data from\nMicrosoft 365 Defender:\n\n\n-----\n\nFigure 11. AiTM phishing campaign and follow-on BEC in the context of Microsoft 365\nDefender threat data\n\n## Defending against AiTM phishing and BEC\n\nThis AiTM phishing campaign is another example of how threats continue to evolve in\nresponse to the security measures and policies organizations put in place to defend\nthemselves against potential attacks. And since credential phishing was leveraged in many\nof the most damaging attacks last year, we expect [similar attempts to grow in scale and](https://www.microsoft.com/security/blog/2022/01/26/evolved-phishing-device-registration-trick-adds-to-phishers-toolbox-for-victims-without-mfa/)\nsophistication.\n\nWhile AiTM phishing attempts to circumvent MFA, it’s important to underscore that MFA\nimplementation remains an essential pillar in identity security. MFA is still very effective at\nstopping a wide variety of threats; its effectiveness is why AiTM phishing emerged in the first\nplace. Organizations can thus make their MFA implementation “phish-resistant” by using\n[solutions that support](https://docs.microsoft.com/windows/security/identity-protection/hello-for-business/hello-overview) [Fast ID Online (FIDO) v2.0 and certificate-based authentication.](https://go.microsoft.com/fwlink/p/?LinkId=533889)\n\nDefenders can also complement MFA with the following solutions and best practices to\nfurther protect their organizations from such types of attacks:\n\n**Enable conditional access policies.** [Conditional access policies are evaluated and](https://docs.microsoft.com/azure/active-directory/conditional-access/overview)\nenforced every time an attacker attempts to use a stolen session cookie. Organizations\ncan protect themselves from attacks that leverage stolen credentials by enabling\npolicies such as compliant devices or trusted IP address requirements.\n**Invest in advanced anti-phishing solutions thatmonitor and scan incoming emails**\nand visited websites. For example, organizations can leverage web browsers that can\n[automatically identify and block malicious websites, including those used in this](https://docs.microsoft.com/deployedge/microsoft-edge-security-smartscreen)\nphishing campaign.\n\n\n-----\n\n**Continuously monitor for suspicious or anomalous activities:**\n\nHunt for sign-in attempts with suspicious characteristics (for example, location,\nISP, user agent, use of anonymizer services).\nHunt for unusual mailbox activities such as the creation of Inbox rules with\nsuspicious purposes or unusual amounts of mail item access events by untrusted\nIP addresses or devices.\n\n### Coordinated threat defense with Microsoft 365 Defender\n\n[Microsoft 365 Defender provides comprehensive protection against this AiTM phishing](https://www.microsoft.com/security/business/threat-protection/microsoft-365-defender)\ncampaign by correlating threat data from various domains. It also coordinates threat defense\n[against the end-to-end attack chain using multiple solutions and has advanced hunting](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/advanced-hunting-overview?view=o365-worldwide)\ncapabilities that allow analysts to inspect their environments further and surface this threat.\n\nLeveraging its cross-signal capabilities, Microsoft 365 Defender alerts customers using\nMicrosoft Edge when a session cookie gets stolen through AiTM phishing and when an\nattacker attempts to replay the stolen session cookie to access Exchange Online:\n\nFigure 12. Microsoft 365 Defender detecting an attempt to use a stolen session cookie to\nsign into Exchange Online\nMicrosoft 365 Defender’s [unique incident correlation technology also lets defenders see all](https://www.microsoft.com/security/blog/2020/07/29/inside-microsoft-threat-protection-solving-cross-domain-security-incidents-through-the-power-of-correlation-analytics/)\nthe relevant alerts related to an AiTM phishing attack pieced together into a single\ncomprehensive view, thus allowing them to respond to such incidents more efficiently:\n\n\n-----\n\nFigure 13. Microsoft 365 Defender incident page correlating all relevant alerts related to an\nAiTM phishing attempt\n[Microsoft 365 Defender is backed by threat experts who continuously monitor the computing](https://www.microsoft.com/security/business/services)\nlandscape for new attacker tools and techniques. Their expert monitoring not only helps alert\ncustomers of a possible incident (such as a potential cookie theft during an authentication\nsession), their research on the constantly evolving phishing techniques also enriches the\nthreat intelligence that feeds into the abovementioned protection technologies.\n\n[Microsoft Defender for Office 365 detects threat activity associated with this phishing](https://www.microsoft.com/security/business/threat-protection/office-365-defender)\ncampaign through the following email security alerts. Note, however, that these alerts may\nalso be triggered by unrelated threat activity. We’re listing them here because we\nrecommend that these alerts be investigated and remediated immediately.\n\n\n-----\n\n**Email messages containing malicious file removed after delivery​. This alert is**\ngenerated when any messages containing a malicious file are delivered to mailboxes in\nan organization. Microsoft removes the infected messages from Exchange Online\n[mailboxes using zero-hour auto purge (ZAP) if this event occurs.](https://docs.microsoft.com/microsoft-365/security/office-365-security/zero-hour-auto-purge?view=o365-worldwide)\n**Email messages from a campaign removed after delivery​. This alert is generated**\n[when any messages associated with a campaign are delivered to mailboxes in an](https://docs.microsoft.com/microsoft-365/security/office-365-security/campaigns?view=o365-worldwide)\norganization. Microsoft removes the infected messages from Exchange Online\nmailboxes using ZAP if this event occurs.\n\n[Microsoft Defender for Cloud Apps detects this AiTM phishing and BEC campaigns through](https://www.microsoft.com/security/business/cloud-apps-defender)\nthe following alerts:\n\n**Suspicious inbox manipulation rule. The attackers set an Inbox rule to hide their**\nmalicious activities. Defender for Cloud Apps identifies such suspicious rules and alerts\nusers when detected.\n**Impossible travel activity. The attackers used multiple proxies or virtual private**\nnetworks (VPNs) from various countries or regions. Sometimes, their attack attempts\nhappen at the same time the actual user is signed in, thus raising impossible travel\nalerts.\n**Activity from infrequent country. Because the attackers used multiple proxies or**\nVPNs, on certain occasions, the egress endpoints of these VPN and proxy servers are\nuncommon for the user, thus raising this alert.\n\n[Azure AD Identity Protection automatically detects and remediates identity-based risks. It](https://docs.microsoft.com/azure/active-directory/identity-protection/overview-identity-protection)\ndetects suspicious sign-in attempts and raises any of the following alerts:\n\n**Anomalous Token. This alert flags a token’s unusual characteristics, such as its token**\nlifetime or played from an unfamiliar location.\n**Unfamiliar sign-in properties. In this phishing campaign, the attackers used multiple**\nproxies or VPNs originating from various countries or regions unfamiliar to the target\nuser.\n**Unfamiliar sign-in properties for session cookies. This alert flags anomalies in the**\ntoken claims, token age, and other authentication attributes.\n**Anonymous IP address. This alert flags sign-in attempts from anonymous IP**\naddresses (for example, Tor browser or anonymous VPN).\n\nIn addition, [Continuous Access evaluation (CAE) revokes access in real time when changes](https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/concept-continuous-access-evaluation)\nin user conditions trigger risks, such as when a user is terminated or moves to an untrusted\nlocation.\n\nLearn how you can stop attacks through automated, cross-domain security with Microsoft\n365 Defender.\n\n**_Microsoft 365 Defender Research Team_**\n\n\n-----\n\n**_Microsoft Threat Intelligence Center (MSTIC)_**\n\n## Appendix\n\n### Indicators of compromise (IOCs)\n\n**Redirector domains**\n\n32sssaawervvvv[.]biz\nadminmmi[.]biz\nauth2022[.]live\ncleanifl[.]com\ndocpmsi[.]us\nvrtlsrvmapp[.]biz\nvrtofcvm[.]live\n\n**Phishing site domains**\n\nlogin[.]actionspsort[.]cam\nlogin[.]akasmisoft[.]xyz\nlogin[.]aueuth11[.]live\nlogin[.]auth009[.]xyz\nlogin[.]auth2022[.]live\nlogin[.]auth83kl[.]live\nlogin[.]bittermann-hh[.]co\nlogin[.]cbhbanlc[.]com\nlogin[.]cleanifl[.]com\nlogin[.]clfonl365[.]xyz\nlogin[.]gddss36[.]live\nlogin[.]grodno-pl[.]com\nlogin[.]hfs923[.]shop\nlogin[.]karlandpearson[.]com\nlogin[.]klm2136[.]click\nlogin[.]login-micro[.]mcrsfts-passwdupdate[.]com\nlogin[.]mcrosfts-updata[.]live\nlogin[.]mcrosfts-update[.]cloud\nlogin[.]mcrosfts-update[.]digital\nlogin[.]mcrosftts-update[.]cloud\nlogin[.]mcrsft-audio[.]xyz\nlogin[.]mcrsfts-cloud[.]live\nlogin[.]mcrsfts-passwd[.]cloud\nlogin[.]mcrsfts-passwd[.]digital\nlogin[ ]mcrsfts-passwdupdate[ ]com\n\n\n-----\n\nlogin[.]mcrsfts-update[.]cloud\nlogin[.]mcrsfts-update[.]digital\nlogin[.]mcrsfts-virtualofficevm[.]com\nlogin[.]mcrsftsvm-app[.]digital\nlogin[.]mcrsftsvm-app[.]live\nlogin[.]mcrsfts-voiceapp[.]digital\nlogin[.]mcrsftsvoice-mail[.]cloud\nlogin[.]microsecurity[.]us\nlogin[.]microstoff[.]xyz\nlogin[.]mljs365[.]xyz\nlogin[.]mwhhncndn[.]xyz\nlogin[.]mycrsfts-passwd[.]live\nlogin[.]qwwxthn[.]xyz\nlogin[.]seafoodsconnection[.]com\nlogin[.]sunmarks[.]co[.]uk\nlogin[.]tfosorcimonline[.]xyz\nlogin[.]whitmanlab[.]uk\nlogin[.]yi087011[.]xyz\n\n### Advanced hunting queries \n\nWhen an attacker uses a stolen session cookie, the “SessionId” attribute in the\n_AADSignInEventBeta table will be identical to the SessionId value used in the authentication_\nprocess against the phishing site. Use this query to search for cookies that were first seen\nafter OfficeHome application authentication (as seen when the user authenticated to the\nAiTM phishing site) and then seen being used in other applications in other countries:\n```\nlet OfficeHomeSessionIds =\n\nAADSignInEventsBeta\n\n| where Timestamp > ago(1d)\n\n| where ErrorCode == 0\n\n| where ApplicationId == \"4765445b-32c6-49b0-83e6-1d93765276ca\" //OfficeHome application\n\n| where ClientAppUsed == \"Browser\"\n\n| where LogonType has \"interactiveUser\"\n\n| summarize arg_min(Timestamp, Country) by SessionId;\n\nAADSignInEventsBeta\n\n| where Timestamp > ago(1d)\n\n| where ApplicationId != \"4765445b-32c6-49b0-83e6-1d93765276ca\"\n\n| where ClientAppUsed == \"Browser\"\n\n| project OtherTimestamp = Timestamp, Application, ApplicationId, AccountObjectId,\nAccountDisplayName, OtherCountry = Country, SessionId\n\n| join OfficeHomeSessionIds on SessionId\n\n| where OtherTimestamp > Timestamp and OtherCountry != Country\n\n```\nUse this query to summarize for each user the countries that authenticated to the\nOfficeHome application and find uncommon or untrusted ones:\n\n\n-----\n\n```\nAADSignInEventsBeta\n\n| where Timestamp > ago(7d)\n\n| where ApplicationId == \"4765445b-32c6-49b0-83e6-1d93765276ca\" //OfficeHome application\n\n| where ClientAppUsed == \"Browser\"\n\n| where LogonType has \"interactiveUser\"\n\n| summarize Countries = make_set(Country) by AccountObjectId, AccountDisplayName\n\n```\nUse this query to find new email Inbox rules created during a suspicious sign-in session:\n```\n//Find suspicious tokens tagged by AAD \"Anomalous Token\" alert\n\nlet suspiciousSessionIds = materialize(\n\nAlertInfo\n\n| where Timestamp > ago(7d)\n\n| where Title == \"Anomalous Token\"\n\n| join (AlertEvidence | where Timestamp > ago(7d) | where EntityType ==\n\"CloudLogonSession\") on AlertId\n\n| project sessionId = todynamic(AdditionalFields).SessionId);\n\n//Find Inbox rules created during a session that used the anomalous token\n\nlet hasSuspiciousSessionIds = isnotempty(toscalar(suspiciousSessionIds));\n\nCloudAppEvents\n\n| where hasSuspiciousSessionIds\n\n| where Timestamp > ago(21d)\n\n| where ActionType == \"New-InboxRule\"\n\n| where RawEventData.SessionId in (suspiciousSessionIds)\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-12 - From cookie theft to BEC- Attackers use AiTM phishing sites as entry point to further financial fraud.pdf"
    ],
    "report_names": [
        "2022-07-12 - From cookie theft to BEC- Attackers use AiTM phishing sites as entry point to further financial fraud.pdf"
    ],
    "threat_actors": [
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535633,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1658168830,
    "ts_modification_date": 1658168830,
    "files": {
        "pdf": "https://archive.orkl.eu/0c2c898034586ed0bfb055fafa332086b07a3679.pdf",
        "text": "https://archive.orkl.eu/0c2c898034586ed0bfb055fafa332086b07a3679.txt",
        "img": "https://archive.orkl.eu/0c2c898034586ed0bfb055fafa332086b07a3679.jpg"
    }
}