{
    "id": "cf7be779-9cb5-442b-b6f3-547b0d0a2016",
    "created_at": "2023-01-12T14:59:28.319466Z",
    "updated_at": "2025-03-27T02:16:26.386406Z",
    "deleted_at": null,
    "sha1_hash": "76ab635a2acbe9b37cd30bd52fd5830ca9b8a43e",
    "title": "2021-01-12 - New Android spyware targets users in Pakistan",
    "authors": "",
    "file_creation_date": "2022-05-28T04:02:28Z",
    "file_modification_date": "2022-05-28T04:02:28Z",
    "file_size": 4827731,
    "plain_text": "# New Android spyware targets users in Pakistan\n\n**[news.sophos.com/en-us/2021/01/12/new-android-spyware-targets-users-in-pakistan/](https://news.sophos.com/en-us/2021/01/12/new-android-spyware-targets-users-in-pakistan/)**\n\nJanuary 12, 2021\n\nSophosLabs has discovered a small cluster of Trojanized versions of Android apps, mainly\nmarketed to people who live in Pakistan. Someone has modified these otherwise legitimate\napps (clean versions are available for download on the Google Play Store) to add malicious\nfeatures that seem completely focused on covert surveillance and espionage.\n\nThe modified apps look identical to their legitimate counterparts, and even perform their\nnormal functions, but are designed to, initially, profile the phone, and then download a\npayload in the form of an Android Dalvik executable (DEX) file. The DEX payload contains\nmost of the malicious features, which include the ability to covertly exfiltrate sensitive data\nlike the user’s contact list and the full contents of SMS messages. The app then sends this\ninformation to one of a small number of command-and-control websites hosted on servers\nlocated in eastern Europe.\n\nThe selection of apps is highly peculiar, as they are neither the most popular, nor particularly\nunique, apps. There’s no indication that the publishers of the original apps are aware that\nthese Trojanized versions even exist. The highest-profile app Trojanized in this way is the\nPakistan Citizen Portal app, published by the government of Pakistan, but the Trojanized\nversion never appeared in any legitimate market, as far as we know. (SophosLabs made\nmultiple attempts to disclose this information to the government of Pakistan, the publisher of\nthe app, prior to publication.)\n\n\n-----\n\nWe\n\nfound several maliciously modified versions of the official Pakistan Citizen Portal app, whose\nGoogle Play listing is shown here.\n[Virustotal records indicated that at least one of the malware samples had been hosted at the](https://www.virustotal.com/gui/file/0785e57d59fe9651ac7452ec9c4b04dec2185dfcefad10ce9b0fa077c4aaac02/relations)\nwebsite pmdu.info, a domain registered for the first time in early August of this year. A TLS\ncertificate was issued to the site on August 9th. The site appears to be a very good mimicry\nof a Google Play Store page blended with elements from the real Pakistan Citizen Portal\npage hosted by the Pakistani government. It isn’t perfect, though: its banner image at the top\nof the page is broken, cutting off the right edge of some text.\n\n\n-----\n\nAnd the website has an interesting take on copyright.\n\nThe Pakistan Citizen Portal\n\napp was created in 2019 by a government agency called the PMDU, but its real website falls\nunder the .gov.pk domain, hosted on its own territory. This site was hosted on the IP address\n5.2.78.240, an IP address that geolocates to the Netherlands.\n\n\n-----\n\nThe .info page has two buttons, labeled Google Play and Download App, but the source\ncode for the site reveals that no matter which link you click, you get the same APK file hosted\n[on the .info domain – the malicious version.](https://www.virustotal.com/gui/file/0785e57d59fe9651ac7452ec9c4b04dec2185dfcefad10ce9b0fa077c4aaac02/detection)\n\nWhile digging around for links to the .info version of the domain, we stumbled upon a\nreference to the domain hosting the malware in a surprising location: Atop the page for an\nofficial Pakistani governmental department, the Trading Corporation of Pakistan (or TCP).\n\nThis banner appeared atop the TCP website for several weeks.\n\nThe text of the domain name\n\nhosting the malicious Android app was prominently displayed in one of a series of rotating\nbanners atop the web page for this division of the country’s Ministry of Commerce. The link\nwas not clickable, as the entire thing is one large static image.\n\n\n-----\n\nTargets of the malware may have received links via SMS messages or email instructing them\nto download the app from the fake Pakistan Citizen Portal webpage. Why someone would\nthen deface a web page to add the bogus domain is harder to understand.\n\nComplicating matters, on January 10, 2021, as we prepared to publish this story, the TCP\nwebpage was replaced with just a single line of text: Hacked by 9bandz\n\nA cursory search for this name\n\nrevealed at least 93 websites that have been identically defaced, their contents replaced with\na similar message since October, 2020. A user of a crimeware forum with a user with the\nsame name also posted this advertisement for “selling government web shells with full\naccess to directories and files” in December.\n\nWhile there’s no evidence tying this action to the person who claimed the defacement, it’s\nhard to ignore the correlation.\n\n## More Trojanized apps\n\n\n-----\n\n[In addition to the official Pakistan Citizen Portal (com.govpk.citizensportal) app, we also](https://play.google.com/store/apps/details?id=com.govpk.citizensportal&hl=en_US&gl=US)\nfound modified versions of a muslim prayer-clock app called Pakistan Salat Time\n[(com.tos.salattime.pakistan); an app used to price-compare mobile phone plans called](https://play.google.com/store/apps/details?id=com.tos.salattime.pakistan&hl=en_US&gl=US)\n[Mobile Packages Pakistan (com.blogspot.istcpublishers.mobilepackagespakistan); a utility](https://play.google.com/store/apps/details?id=com.blogspot.istcpublishers.mobilepackagespakistan&hl=en_US&gl=US)\nthat can check a phone’s SIM card for validity called Registered SIMs Checker\n[(com.siminformation.checker), and a maliciously modified version of the app published by](https://play.google.com/store/apps/details?id=com.siminformation.checker&hl=en_US&gl=US)\n[TPL Insurance (com.tpl.insuranceapp), a company that describes itself as “the first insurance](https://play.google.com/store/apps/details?id=com.tpl.insuranceapp&hl=en_US&gl=US)\ncompany in Pakistan to sell general insurance products directly to the consumer.”\n\nOne anomalous app we could find no specific benign analogue of called itself Pakistan Chat\n(com.PakistanChatMessenger). This app appears to leverage the API of an otherwise\nlegitimate chat service called ChatGum, and connects to a ChatGum server, but also\nconducts covert surveillance and exfiltration of data from the user’s phone.\n\nThe malicious insurance app requires\n\nusers to give the app virtually full control over any sensitive data stored on the device The\n\n\n-----\n\nbenign version of the app does not request the same permissions.\nThe apps all feature, as their primary set of functions, code that appears to be focused on\nespionage and covert data exfiltration: When run, the apps initially send the device’s unique\nIMEI identifier and a timestamp along with a username and password combination (a# and\n**def, respectively), to a command-and-control (C2) server by means of an HTTP POST**\nrequest to the server.\n\n[Immediately after submitting this information, the app retrieves a DEX payload, then begins](https://source.android.com/devices/tech/dalvik/dex-format)\nin earnest to HTTP POST a series of data bursts. In most cases the payload was named\n**class.dex, but the Trojanized TPL Insurance app, retrieves a payload named class_tpl.dex.**\n\nAfter the app loads the DEX file payload, it begins a series of uploads of data to its C2. The\nmalware sends detailed profile information about the phone, location information, the user’s\nfull contact list, the contents of text messages, call logs, and the full directory listing of any\ninternal or SD card storage on the device.\n\nWe left the Pakistan Salat Time running on a test device for several days, but did not interact\nwith the phone during that time; Four days after installing the app, when we unlocked the\nphone, the app began exfiltrating at a rapid pace, transmitting not only the contents of\nmessages, but every one of a directory full of screenshots created in the course of this\nresearch.\n\nThe Pakistan Citizen Portal app prompts the user to enter their national ID credentials, such\nas their national identity card (CNIC) number, their passport details, and the username and\npassword for Facebook and other accounts. In tests, this information was exfiltrated along\nwith the rest.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\nIn each sample we ran, when we first installed the spyware, it hints at its intentions by\nrequesting some fairly privacy-invasive permissions, such as the ability to read SMS\nmessages and contact lists, that allow it to read the relevant data on a victim’s device.\n\nThe Pakistan\n\nSalat Time app was caught exfiltrating the contents of SMS text messages, and all the\nphotos on the infected phone, to its C2 server\nWhile a few of these permissions might be appropriate under limited circumstances,\ndepending on the app, the sheer number of them in apps that seemingly have no reason to\nask for them — for instance, in the Salat Time (muslim prayer clock) app shown below —\nmay tip the threat actor’s hand and make it easier for an attentive user to notice the\nexcessive permissions requests, and cancel the installation.\n\n\n-----\n\nThe intrusive permissions requested by the malicious versions of the apps hinted at the\napps’ intentions. By comparison, the benign (left) version of Pakistan Salat Time requires no\nspecial permissions at installation in order to work.\n\n## Under the hood\n\nThe AndroidManifest.xml file in an app declares things like the names of services and\nreceivers. In these spyware apps, the manifest file listed several additional services and\nreceivers that appear to reference a section of the malicious code that we couldn’t find. We\nsuspect these might be reserved for features that have yet to be implemented. The service\nnames “SoundRecordService” and “CallRecordService” seem to be in character with the\nespionage focus of the app.\n\nAdditional services and\n\nreceiver in AndroidManifest.xml\nIn the course of uploading the data from a phone, the malware received a JSON-format\nconfiguration in plain text that references these features.\n\n\n-----\n\nThe spyware components take the form of one of two additional packages compiled into the\nfinal app. In the malicious apps, these are named com.android.volley or\n**com.android.update. This may be an attempt to disguise the contents of the libraries;**\n[there’s a completely benign HTTP library package named com.android.volley made by](https://developer.android.com/training/volley)\nGoogle and, well, the presence of an Android update package comes across as completely\ninnocuous, unless you look under the hood.\n\nThe android.valley library\n\nThe android.update library\n\n## Designed for stealth\n\n\n-----\n\nThe creators of this app are fixated on concealment and stealth; Not only do they mimic\nlegitimate apps, and disguise their malicious code as legitimate libraries, but they also\nencrypt sensitive strings using AES and a hardcoded key. The strings include the commandand-control (C2) server addresses, and the URL paths used by the spyware to exfiltrate data\nand request instructions.\n\nThe plaintext C2\n\naddresses and paths the bot uses have been encrypted using AES and a key hardcoded into\nthe malware\nTo remain stealthy, many of the samples contained minimal spying functionality initially. That\ncomes later, when the malware APK quietly downloads and runs a compiled .dex Android\nbinary hosted on the C2 server. This .dex file contains most of the spying and exfiltration\ncode the malware uses, which means this code doesn’t get swept up in initial scans of the\napps. This downloadable .dex method also enables the author(s) to seamlessly update the\nfunctionalities in the spyware.\n\nThe malware\n\nencodes the exfiltrated data (highlighted in blue) before upload\n\n\n-----\n\nIn keeping with the stealthy theme, the spyware XORs most of the data it transmits back to\nthe C2 server. Upon exfiltrating the collected data, the apps may display a dialog box or\nwarning message that says something like “The system is under necessary maintenance,\nplease try later.”\n\nSpyware exfiltrating the SD card directory listing (in the form of an HTTP POST submission\nin clear text, in this case)\n\n\n-----\n\nThe operators of this malicious network also registered domain names that seem to correlate\nwith the apps they mimic. The Pakistan Chat app (as well as a few others) connect to the\ndomain pakchat.online, hosted on a server in Latvia, while the fake TPL Insurance app\nuploads its stolen data to, and retrieves the DEX file from, the domain tplinsurance.xyz,\nhosted on a server in Bulgaria. The Pakistan Salat Time app, unusually, used a hostname\nfrom a dynamic DNS service, kv33.zapto.org, as its C2. That domain resolved to an IP\naddress based in the USA.\n\nURLs used\n\nfor payload delivery and data exfiltration, and the IP addresses they use.\n\n## Watch where you get your apps\n\nThis spyware is under active development. In the course of pursuing this research,\nSophosLabs also found what appeared to be test versions of the spyware, presumably used\nby the malware author(s) to test before they merged the code with clean apps.\n\nIn the current Android ecosystem, apps are cryptographically signed as a way to certify the\ncode originates with a legitimate source, tying the app to its developer. However, Android\ndoesn’t do a good job exposing to the end user when a signed app’s certificate isn’t\nlegitimate or doesn’t validate. As such, users have no easy way of knowing if an app was\nindeed published by its genuine developer.\n\nThis allows threat actors to develop and publish fake versions of popular apps. The\nexistence of a large number of app stores, and the freedom of users to install an app from\npractically anywhere makes it even harder to combat such threats\n\n\n-----\n\nTo avoid falling prey to such malicious apps, users should only install apps from trusted\nsources such as Google Play. Developers of popular apps often have a web site, which\ndirects the users to the genuine app. Users should verify if the app was developed by its\ngenuine developer. We also advise users to consider installing an antivirus app on their\nmobile device such as Sophos Intercept X for Mobile that defends their device and data from\nsuch threats.\n\nSophos Intercept X for Mobile detects this spyware as Andr/Spy-BDD. SophosLabs has\n[published indicators of compromise on its Github page.](https://github.com/sophoslabs/IoCs/blob/master/Android-pakchat.csv)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-12 - New Android spyware targets users in Pakistan.pdf"
    ],
    "report_names": [
        "2021-01-12 - New Android spyware targets users in Pakistan.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535568,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653710548,
    "ts_modification_date": 1653710548,
    "files": {
        "pdf": "https://archive.orkl.eu/76ab635a2acbe9b37cd30bd52fd5830ca9b8a43e.pdf",
        "text": "https://archive.orkl.eu/76ab635a2acbe9b37cd30bd52fd5830ca9b8a43e.txt",
        "img": "https://archive.orkl.eu/76ab635a2acbe9b37cd30bd52fd5830ca9b8a43e.jpg"
    }
}