{
    "id": "cfa3871b-47d3-4c6a-a69f-1da6203935a6",
    "created_at": "2023-01-12T14:59:35.712325Z",
    "updated_at": "2025-03-27T02:05:36.282358Z",
    "deleted_at": null,
    "sha1_hash": "37e727fe3459ab81d10866f7b609c76ea827a9ac",
    "title": "2017-05-02 - Covert Channels and Poor Decisions- The Tale of DNSMessenger",
    "authors": "",
    "file_creation_date": "2022-05-27T21:57:41Z",
    "file_modification_date": "2022-05-27T21:57:41Z",
    "file_size": 1477058,
    "plain_text": "# Covert Channels and Poor Decisions: The Tale of DNSMessenger\n\n**blog.talosintelligence.com/2017/03/dnsmessenger.html**\n\n## Executive Summary\n\nThe Domain Name System (DNS) is one of the most commonly used Internet application\nprotocols on corporate networks. It is responsible for providing name resolution so that\nnetwork resources can be accessed by name, rather than requiring users to memorize IP\naddresses. While many organizations implement strict egress filtering as it pertains to web\ntraffic, firewall rules, etc. many have less stringent controls in place to protect against DNS\nbased threats. Attackers have recognized this and commonly encapsulate different network\nprotocols within DNS to evade security devices.\n\nTypically this use of DNS is related to the exfiltration of information. Talos recently analyzed\nan interesting malware sample that made use of DNS TXT record queries and responses to\ncreate a bidirectional Command and Control (C2) channel. This allows the attacker to use\nDNS communications to submit new commands to be run on infected machines and return\nthe results of the command execution to the attacker. This is an extremely uncommon and\nevasive way of administering a RAT. The use of multiple stages of Powershell with various\nstages being completely fileless indicates an attacker who has taken significant measures to\navoid detection.\n\n\n-----\n\nIronically, the author of the malware called SourceFire out in the malware code itself shortly\nafter we released Cisco Umbrella, a security product specifically designed to protect\n[organizations from DNS and web based threats as described here.](https://umbrella.cisco.com/products/features)\n\n## Details\n\n[What initially drew our interest to this particular malware sample was a tweet published by](https://twitter.com/Simpo13/status/835139608153362433)\nsecurity researcher on Twitter (thanks [simpo!) regarding a Powershell script that he was](https://twitter.com/simpo13)\nanalyzing that contained the base64 encoded string 'SourceFireSux'. Interestingly enough,\nSourcefire was the only security vendor directly referenced in the Powershell script. We\nsearched for the base64 encoded value 'UwBvAHUAcgBjAGUARgBpAHIAZQBTAHUAeAA='\nwhich was referenced in the tweet, and were able to identify a sample that had been\n[uploaded to the public malware analysis sandbox, Hybrid Analysis. Additionally, when we](https://www.hybrid-analysis.com/sample/f9e54609f1f4136da71dbab8f57c2e68e84bcdc32a58cc12ad5f86334ac0eacf?environmentId%3D100)\nsearched for the decoded string value we found a single search engine result that pointed to\na Pastebin [page. The hash listed in the Pastebin led us to a malicious Word document that](https://pastebin.com/idy8yeW8)\nhad also been uploaded to a public sandbox. The Word document initiated the same\nmultiple-stage infection process as the file from the Hybrid Analysis report we previously\ndiscovered and allowed us to reconstruct a more complete infection process. Analyzing our\ntelemetry data, we were ultimately able to identify additional samples, which are listed in the\nIndicators of Compromise section of this post.\n\nAs a security vendor, we know that we are doing something right when malware authors\nbegin to specifically reference us within their malware. Naturally we decided to take a closer\nlook at this particular sample.\n\n\n-----\n\nIn this particular case, we began by analyzing the Powershell file that had been incorrectly\nsubmitted to the public sandbox as a VBScript file, which we are now referring to as 'Stage\n3'. It turns out the string referenced earlier is used as a mutex, as you can see in the\ndeobfuscated Powershell below in Figure 1.\n\n**Figure 1: Mutex Creation**\n\n\n-----\n\n### Stage 1 Malicious Word Document\n\nAs previously mentioned, we identified the source of this infection chain, which was a\nmalicious Microsoft Word document that was delivered to the victim via a phishing email\nmessage. Interestingly, the Word document was made to appear as if it were associated with\na secure email service that is secured by McAfee. This is likely an effective way to increase\nthe odds of the victim opening the file and enabling macros as McAfee is a well known\nsecurity vendor and likely immediately trusted by the victim. The document informs the user\nthat it is secured and instructs the user to enable content.\n\n**Figure 2: Malicious Word Document**\n\nThe document uses the Document_Open() function to call another VBA function. The called\nfunction sets a long string that defines a Powershell command and includes the code to be\nexecuted. The command is then executed using the Windows Management Interface (WMI)\nWin32_Process object using the Create method.\n\nThe code that is passed to Powershell via the command line is mostly Base64 encoded and\ncompressed using gzip, with a small portion at the end that is not encoded which is then\nused to unpack the code and pass it to the Invoke-Expression Powershell cmdlet (IEX) for\nexecution. This allows the code to be executed without ever requiring it to be written to the\n\n\n-----\n\nfilesystem of the infected system. Overall, this is pretty typical for malicious Word documents\nthat we see being distributed in the wild. We noted that while there is a VBA stream that\nreferences a download from Pastebin, the samples we analyzed did not appear to make use\nof this functionality.\n\nWe also observed that the AV detection on this particular sample was fairly low (6/54) and\nthat ClamAV was able to successfully detect this particular sample.\n\n**Figure 3: VirusTotal Results**\n\n### Stage 2 Powershell\n\nThe execution of the Powershell that is passed to IEX by the Stage 1 Word document is\nwhere we begin to observe several interesting activities occurring on an infected system. A\nfunction at the end of the Powershell script described in Stage 1 defines the actions for\nStage 2 as well as characteristics related to Stage 3.The code in Stage 2 has been\nobfuscated, and we will refer to the main function used by this stage as 'pre_logic' as the\nmain function used by Stage 3 is referenced as 'logic'.\n\nThe 'pre_logic' function present in this stage supports two switches. One is used to\ndetermine whether or not to achieve persistence for the next stage of the infection process\non the target system. If persistence is selected the other switch defines whether or not the\nStage 3 code should be executed once it is staged.\n\n\n-----\n\n**Figure 4: Deobfuscated 'pre-logic' Function**\n\nIn addition to these two switches, the 'pre_logic' function also supports four parameters\nwhich are subsequently passed to the 'logic' function in the next stage of the infection\nprocess. These parameters are used to determine what subdomains to use when sending\nDNS TXT record queries in the next stage of the infection process.\n\nThe function then unpacks the Powershell that will be used during the next (Stage 3) stage\nfrom a base64 encoded blob located within the Powershell script itself. It also defines some\nof the code which will be used later, including the function call and parameters to use when\nexecuting the next stage of the infection.\n\nIf the option to achieve persistence was selected when the 'pre_logic' function was called,\nthe function will then query the infected system to determine how to best achieve\npersistence. Depending on the access rights of the user account within which the malware is\noperating, the malware will then query registry paths that are commonly used by malware to\nachieve persistence.\n\nIf operating under an account with Administrator access to the system the script will query\nand set:\n\n$reg_win_path: \"HKLM:Software\\Microsoft\\Windows\\CurrentVersion\"\n$reg_run_path: \"HKLM:Software\\Microsoft\\Windows\\CurrentVersion\\Run\\\"\n\nIf operating under a normal user account, the script will query and set:\n\n$reg_win_path: \"HKCU:Software\\Microsoft\\Windows\"\n$reg_run_path: \"HKCU:Software\\Microsoft\\Windows\\CurrentVersion\\Run\\\"\n\n**Figure 5: Registry Activity**\n\n\n-----\n\nThe script then determines the version of Powershell that is being used on the infected\nsystem. If the infected system is using Powershell 3.0 or later, the decoded Stage 3 payload\nis written to an Alternate Data Stream (ADS) located at '%PROGRAMDATA%\\Windows\\' and\nnamed 'kernel32.dll'.\n\nIf the system is running an earlier version of Powershell, the Stage 3 payload is encoded and\nwritten to the registry location dictated by the assignment of $reg_win_path earlier with the\nkey name of 'kernel32'. The code to unpack and execute the Stage 3 payload is also later\nwritten to the registry location of $reg_win_path with the key name of 'Part'.\n\n**Figure 6: PS Check & Persistence**\n\nOnce this has completed, the script will again check to determine the access level of the user\nrunning the malware. If the malware has been executed with Administrator permissions, the\nWMI event subscriptions for '_eventFilter', 'CommandLineEventConsumer', and\n'_filtertoconsumerbinding' will be removed from the infected system. The malware then\nestablishes its own permanent WMI event subscription, filtered for 'Win32_LogonSession'\nevents and tied to 'CommandLineEventConsumer'. This is what is used to read and execute\nthe Stage 3 payload that was previously stored in the ADS whenever a new logon session is\ncreated on the infected system. This is essentially the WMI equivalent of a registry-based run\nkey from a persistence perspective. The Stage 3 malware is by default set to run 'onidle'\nafter 30 minutes. If the switch associated with the execution of Stage 3 was passed to the\n'pre_logic' function at the beginning of this stage, the Stage 3 payload will then be executed\nimmediately.\n\n**Figure 7: Persistence Mechanism**\n\nAs seen above, the malware also creates a Scheduled Task on the infected system named\n\"kernel32\" which is associated with the Stage 3 payload that was stored in the ADS or\nregistry depending on the version of powershell running on the infected system. In analyzing\n\n\n-----\n\nother samples associated with this campaign, we observed that the scheduled task may\nchange across samples.\n\n### Stage 3 Powershell\n\nThe Stage 3 powershell that is executed by Stage 2 of this infection process was obfuscated\nprimarily through the use of obtuse function and variable names (e.g.\n${script:/==\\/\\/\\/==\\__/==} instead of $domains). Base64 string encoding was also present\nthroughout the script. Once we deobfuscated it, we found that the script contained a large\narray of hard coded domain names, with one of them being randomly selected and used for\nsubsequent DNS queries. It is important to note that while the Powershell scripts for stages 3\nand 4 contain two arrays of domains, the first array is only used if a failure condition is\nreached while the sample is using the second array.\n\n**Figure 8: Stage 3 Domain List**\n\nThe 'logic' function present within this Powershell script randomly selects a C2 domain from\nthe second array in the script and uses this domain to perform an initial lookup. If the result\nof the initial DNS TXT record request is empty or in the case the lookup fails, the 'do_lookup'\nfunction is then called and randomly selects a domain from the first array in the script.\nInterestingly, the domains used by the 'do_lookup' function did not appear to have active\n'www' or 'mail' TXT records.\n\nThe script also uses specific subdomains which are combined with the domains and used for\nthe initial DNS TXT record queries performed by the malware. The malware uses the\ncontents of the TXT record in the response to these queries to determine what action to take\nnext. For instance, the first subdomain is 'www' and a query response with a TXT record\ncontaining 'www' will instruct the script to proceed. Other actions that may be taken are 'idle'\nand 'stop'.\n\n\n-----\n\n**Figure 9: Stage 3 Command Processing**\n\nOnce the initial DNS response is received by the malware, it then iterates to the next\nsubdomain which is 'mail'. The malware uses this domain in another DNS TXT record query\nto attempt to retrieve the Stage 4 payload associated with this infection process. The\nresponse to this DNS request results in the transmission of the fourth stage malware, stored\nwithin the TXT record as displayed in Figures 10 and 11. Due to the size of the Stage 4\npayload, DNS makes use of TCP for this transaction.\n\n**Figure 10: Response Containing Stage 4 Payload**\n\n\n-----\n\nAnother view showing the Wireshark interpretation of the DNS protocol and packet payload\nis below.\n\n**Figure 11: Alternate View of Stage 4 Payload**\n\nThe code associated with this fourth stage is then cleaned and passed into the InvokeExpression Powershell cmdlet (IEX) and executed within the context of the third stage\nprocess. The fourth stage payload is not autonomous and simply attempting to execute the\nfourth payload itself will fail, as it relies upon a decode function present within the third stage\nPowershell script.\n\n**Figure 12: Stage 3 Decode Function**\n\nThis function is responsible for a couple of different operations. It takes the code received in\nthe DNS query response and defines a string variable which contains the code. It then calls\nthe decode function from the third stage and passes the decoded string into IEX to further\nextend the Powershell environment. Once this is complete, it then calls a function in the\nnewly extended environment to execute the fourth stage code along with specific\nparameters. These parameters include the fourth stage C2 domain to use as well as the\nprogram to execute which in this case is the Windows Command Line Processor (cmd.exe).\nThis is interesting because it results in the fourth stage payload never actually being written\nto the filesystem of the infected system.\n\n### Stage 4 Powershell\n\nAs described above, the Stage 4 Powershell payload is decoded by the 'dec' function\n\n\n-----\n\npresent within Stage 3. At the end of the Stage 4 payload is a call to the cotte function,\npresent in the decoded Stage 4 code, which provides additional parameters including the C2\ndomain to use as well as the program to execute (cmd.exe). When the function executes\ncmd.exe it redirects STDIN, STDOUT, and STDERR to allow the payload to read from and\nwrite to the command line processor.\n\nThe domain provided to the function call is then used to generate the DNS queries used for\nthe main C2 operations. Just like in the Stage 3 Powershell script, the Stage 4 payload also\ncontains two arrays of hard coded domains, but this stage only appears to make use of the\nsecond array.\n\n**Figure 13: Stage 4 Domain List**\n\nEvery 301st DNS response from main C2 server, the sample sends a separate DNS TXT\nresolution request to a domain taken from the array described above using the Get-Random\ncmdlet. This secondary C2 request is to determine whether the malware should continue to\nrun on the infected system. Similar to what we saw with the Stage 3 Powershell script, this\nrequest is made to the 'web' subdomain of the secondary C2 domain.\n\n**Figure 14: Stage 4 Secondary C2 Domain Generation**\n\nIf the secondary C2 server returns a TXT record that contains the string 'stop', the malware\nwill cease operations.\n\n**Figure 15: Stage 4 Stop Command**\n\nThe main C2 channel itself is established through the transmission of a \"SYN\" message from\nthe infected system to the main C2 server.\n\n\n-----\n\n**Figure 16: Example Stage 4 'SYN' Message Response**\n\nOnce this is completed, the STDOUT and STDERR output that was captured from the\nWindows Command Line processor earlier in Stage 4 is transmitted using a \"MSG\"\nmessage. This allows the attacker to send commands to be executed directly by the\nCommand Processor and receive the output of those commands all using DNS TXT\nrequests and responses. This communication is described in greater detail in the following\nsection. Below is the DNS analysis and contents of the query request send from an infected\nsystem to the C2 server.\n\n\n-----\n\n**Figure 17: Example 'MSG' Message**\n\nThe query domain structure is obfuscated. If we take the DNS request query and run it\nthrough a decoding function, we can clearly see that it is the output of the Windows\nCommand Line Processor being sent to the C2 server.\n\n**Figure 18: Decoded TXT Request**\n\nThis clearly illustrates the establishment of an interactive C2 channel that can be used to\nexecute system commands as well as receive the output of those commands.\n\n### Command and Control (C2) Communications\n\nThe C2 domains associated with the infection chain from the malicious Word document were\ninitially registered on 2017-02-08. The domains associated with the Powershell sample that\nwe analyzed from Hybrid Analysis were initially registered on 2017-02-18. Several of the\ndomains were registered by a registrant account using the following email address:\n\nvaleriy[.]pagosyan[@]yandex[.]com\n\nThe remaining domains were registered using the NameCheap proxy registration service.\n\nAccording to data available within Umbrella, the majority of DNS activity related to the\ndomains used by the powershell sample appears to have occurred between 2017-02-22 and\n2017-02-25. There was less activity associated with the other identified sample, with most\noccurring on 2017-02-11.\n\n\n-----\n\n**Figure 19: Sample DNS Traffic Graph**\n\nAll C2 communications associated with this malware are performed using DNS TXT queries\nand responses. The interactive 'MSG' queries require the successful establishment of a C2\ncommunications channel via the use of the prerequisite 'SYN' query. The messages consist\nof the following elements:\n\n$session_id - A four digit number that is initially generated by infected machines. It never\nchanges and is included in all subsequent DNS queries and responses.\n\n$sequence_num - A four digit number that is initially generated by infected machines. It\nchanges periodically during C2 communications and the new value must be included in the\nnext query.\n\n$acknowledgement_num - A four digit number that is set by the response to the 'SYN'\nmessage. This value does not appear to change and must be included in all subsequent\n'MSG' queries.\n\nBytes 5 and 6 of the DNS queries and responses determine the message type and can be\nany of the following values:\n\n00 - 'SYN' message\n\n01 - 'MSG' message\n\n02 - 'FIN' message\n\nThe 'MSG' queries which are used to send commands to execute and return the output of\nthe executed commands are hex-encoded and use a dot separator after every 30 bytes.\n\nThe following diagram illustrates the overall flow of the C2 communications. Note that during\nC2, there may be several 'MSG' queries and responses depending on what the attacker is\nattempting to execute on an infected host.\n\n\n-----\n\n**Figure 20: C2 Traffic Flow**\n\nBelow is a diagram illustrating how the different messages and associated responses are\nformed.\n\n**Figure 21: C2 Message Structure**\n\n## Conclusion\n\nThis malware sample is a great example of the length attackers are willing to go to stay\nundetected while operating within the environments that they are targeting It also illustrates\n\n\n-----\n\nthe importance that in addition to inspecting and filtering network protocols such as\nHTTP/HTTPS, SMTP/POP3, etc. DNS traffic within corporate networks should also be\nconsidered a channel that an attacker can use to implement a fully functional, bidirectional\n[C2 infrastructure. Cisco Umbrella is a product that can be used specifically for this purpose.](https://umbrella.cisco.com/)\nIn addition to stopping this particular attack, DNS monitoring and filtering can also disrupt a\nlarge portion of overall malware infections, as the over 90% of malware makes use of the\nDNS network protocol at some stage of the infection or post-infection process.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/support/security/amp-firepower-software-license/tsd-products-support-series-home.html)\nmalware used by these threat actors.\n\n[CWS orWSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[The Network Security protection ofIPS andNGFW have up-to-date signatures to detect](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nmalicious network activity by threat actors.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella prevents DNS resolution of the domains associated with malicious activity.](https://umbrella.cisco.com/)\n\n## Indicators of Compromise (IOC)\n\nBelow are indicators of compromise that can be used to identify the attack described in this\npost.\n\n\n-----\n\n### Hashes:\n\nf9e54609f1f4136da71dbab8f57c2e68e84bcdc32a58cc12ad5f86334ac0eacf (SHA256)\n\nf82baa39ba44d9b356eb5d904917ad36446083f29dced8c5b34454955da89174 (SHA256)\n\n340795d1f2c2bdab1f2382188a7b5c838e0a79d3f059d2db9eb274b0205f6981 (SHA256)\n\n7f0a314f15a6f20ca6dced545fbc9ef8c1634f9ff8eb736deab73e46ae131458 (SHA256)\n\nbe5f4bfa35fc1b350d38d8ddc8e88d2dd357b84f254318b1f3b07160c3900750 (SHA256)\n\n9b955d9d7f62d405da9cf05425c9b6dd3738ce09160c8a75d396a6de229d9dd7 (SHA256)\n\nfd6e7fc11a325c498d73cf683ecbe90ddbf0e1ae1d540b811012bd6980eed882 (SHA256)\n\n6bf9d311ed16e059f9538b4c24c836cf421cf5c0c1f756fdfdeb9e1792ada8ba (SHA256)\n\n### C2 Domains:\n\nalgew[.]me\n\naloqd[.]pw\n\nbpee[.]pw\n\nbvyv[.]club\n\nbwuk[.]club\n\ncgqy[.]us\n\ncihr[.]site\n\nckwl[.]pw\n\ncnmah[.]pw\n\ncoec[.]club\n\ncuuo[.]us\n\ndaskd[.]me\n\ndbxa[.]pw\n\ndlex[.]pw\n\ndoof[.]pw\n\ndtxf[.]pw\n\ndvso[.]pw\n\ndyiud[.]com\n\neady[.]club\n\nenuv[.]club\n\neter[.]pw\n\nfbjz[.]pw\n\nfhyi[.]club\n\nfuth[.]pw\n\ngjcu[.]pw\n\ngjuc[.]pw\n\ngnoa[.]pw\n\ngrij[.]us\n\ngxhp[.]top\n\n\n-----\n\nhvzr[.]info\nidjb[.]us\nihrs[.]pw\njimw[.]club\njomp[.]site\njxhv[.]site\nkjke[.]pw\nkshv[.]site\nkwoe[.]us\nldzp[.]pw\nlhlv[.]club\nlnoy[.]site\nlvrm[.]pw\nlvxf[.]pw\nmewt[.]us\nmfka[.]pw\nmjet[.]pw\nmjut[.]pw\nmvze[.]pw\nmxfg[.]pw\nnroq[.]pw\nnwrr[.]pw\nnxpu[.]site\noaax[.]site\nodwf[.]pw\nodyr[.]us\nokiq[.]pw\noknz[.]club\nooep[.]pw\nooyh[.]us\notzd[.]pw\noxrp[.]info\noyaw[.]club\npafk[.]us\npalj[.]us\npbbk[.]us\nppdx[.]pw\npvze[.]club\nqefg[.]info\nqlpa[.]club\nqznm[.]pw\nreld[.]info\n\n\n-----\n\nrnkj[.]pw\nrzzc[.]pw\nsgvt[.]pw\nsoru[.]pw\nswio[.]pw\ntijm[.]pw\ntsrs[.]pw\nturp[.]pw\nueox[.]club\nufyb[.]club\nutca[.]site\nvdfe[.]site\nvjro[.]club\nvkpo[.]us\nvpua[.]pw\nvqba[.]info\nvwcq[.]us\nvxqt[.]us\nvxwy[.]pw\nwfsv[.]us\nwqiy[.]info\nwvzu[.]pw\nxhqd[.]pw\nyamd[.]pw\nyedq[.]pw\nyqox[.]pw\nysxy[.]pw\nzcnt[.]pw\nzdqp[.]pw\nzjav[.]us\nzjvz[.]pw\nzmyo[.]club\nzody[.]pw\nzugh[.]us\ncspg[.]pw\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-02 - Covert Channels and Poor Decisions- The Tale of DNSMessenger.pdf"
    ],
    "report_names": [
        "2017-05-02 - Covert Channels and Poor Decisions- The Tale of DNSMessenger.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535575,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653688661,
    "ts_modification_date": 1653688661,
    "files": {
        "pdf": "https://archive.orkl.eu/37e727fe3459ab81d10866f7b609c76ea827a9ac.pdf",
        "text": "https://archive.orkl.eu/37e727fe3459ab81d10866f7b609c76ea827a9ac.txt",
        "img": "https://archive.orkl.eu/37e727fe3459ab81d10866f7b609c76ea827a9ac.jpg"
    }
}