{
    "id": "cfb5872d-60da-47fa-b01b-2b08cfcf102c",
    "created_at": "2022-10-25T16:48:20.720299Z",
    "updated_at": "2025-03-27T02:16:59.13857Z",
    "deleted_at": null,
    "sha1_hash": "69bab8b48e8dd94f8f65104226a74ae010ec2f65",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-12-18T18:05:20Z",
    "file_modification_date": "2017-12-18T18:05:20Z",
    "file_size": 1619049,
    "plain_text": "## Cyberespionage Campaign Sphinx Goes Mobile With AnubisSpy Technical BriefTrendLabs Security Intelligence BlogEcular Xuand Grey GuoMobile Threat Response TeamDecember2017\n\n\n-----\n\n# Table of Contents\n\nCampaign Analysis ....................................................................................................................................... 2\n\nCorrelation ..................................................................................................................................................... 6\n\nAnubisSpy’s Capabilities .............................................................................................................................. 8\n\nAnubisSpy’s Modules ................................................................................................................................... 9\n\nInit Module ................................................................................................................................................................. 9\n\nPatch Module .......................................................................................................................................................... 12\n\nComm Module ......................................................................................................................................................... 13\n\nDBDump Module ..................................................................................................................................................... 15\n\nPosition Module ....................................................................................................................................................... 18\n\nScreenshot Module ................................................................................................................................................. 19\n\nCMD Module ........................................................................................................................................................... 20\n\nAudio Record, Calls, and VoIP Modules .................................................................................................................. 22\n\nDestruction Module ................................................................................................................................................. 25\n\nDec Module ............................................................................................................................................................. 25\n\nEnc Module.............................................................................................................................................................. 26\n\nFormat Module ........................................................................................................................................................ 27\n\nUploader Module ..................................................................................................................................................... 28\n\nIndicators of Compromise (IoCs) ................................................................................................................ 30\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information and educational purposes only. It is not intended and should not be construed to constitute legal\nadvice. The information contained herein may not be applicable to all situations and may not reflect the most current situation. Nothing contained herein should\nbe relied on or acted upon without the benefit of legal advice based on the particular facts and circumstances presented and nothing herein should be construed\notherwise. Trend Micro reserves the right to modify the contents of this document at any time without prior notice.\n\nTranslations of any material into other languages are intended solely as a convenience. Translation accuracy is not guaranteed nor implied. If any questions arise\nrelated to the accuracy of a translation, please refer to the original language official version of the document. Any discrepancies or differences created in the\ntranslation are not binding and have no legal effect for compliance or enforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include accurate and up-to-date information herein, Trend Micro makes no warranties or representations of any\nkind as to its accuracy, currency, or completeness. You agree that access to and use of and reliance on this document and the content thereof is at your own\nrisk. Trend Micro disclaims all warranties of any kind, express or implied. Neither Trend Micro nor any party involved in creating, producing, or delivering this\ndocument shall be liable for any consequence, loss, or damage, including direct, indirect, special, consequential, loss of business profits, or special damages,\nwhatsoever arising out of access to, use of, or inability to use, or in connection with the use of this document, or any errors or omissions in the content thereof.\nUse of this information constitutes acceptance for use in an “as is” condition.\n\n\n-----\n\n[Android malware like ransomware exemplify how the platform can be lucrative for cybercriminals. But](http://blog.trendmicro.com/trendlabs-security-intelligence/android-mobile-ransomware-evolution/)\nthere are also other threats stirring up as of late: attacks that spy on and steal data from specific targets.\nMore than the malware involved, these also demonstrate how attackers are crossing over between\ndesktops and their mobile counterparts.\n\nTake for instance several malicious apps we came across with cyberespionage capabilities, targeting\nArabic-speaking users or Middle Eastern countries. These were published on Google Play — but have\nsince been taken down — and third-party app marketplaces.\n\nWe named these malicious apps AnubisSpy (ANDROIDOS_ANUBISSPY) as all the malware’s payload is\na package called watchdog. We construe AnubisSpy to be linked to the cyberespionage campaign\n[Sphinx (APT-C-15)](http://b.360.cn/assets/doc/apt_report/en/Sphinx-Targeted%20cyber-attack%20in%20the%20Middle%20East.pdf) based on shared file structures and command-and-control (C&C) server as well as\ntargets. It’s also possible that while AnubisSpy’s operators may also be Sphinx’s, they could be running\nseparate but similar campaigns.\n\nWe disclosed our findings to Google and worked with them to take down the apps on Google Play.\nUpdates were also made to [Google Play Protect to take appropriate action against those apps that have](https://www.android.com/play-protect/)\nbeen verified as in violation of Google Play policy. This technical brief provides an in-depth analysis of\nAnubisSpy, along with indicators of compromise (IoCs).\n\nCampaign Analysis\n\nThere were at least seven apps signed with the same fake Google certificate. We found two more apps\nmade by the same developer, but they had no espionage-related codes. Based on hardcoded strings in\nthe Agent Version, the malicious apps were created as early as April 2015. Timestamps indicate that the\nearliest sample was signed on June 2015 while the latest variant was signed on May 2017.\n\nFigure 1: Agent Version of one of the AnubisSpy variants (top) and timestamps of when they were signed (bottom)\n\nAnubisSpy wasn’t only published on Google Play; variants of it were also in third-party app\nmarketplaces. An AnubisSpy variant, named م ت ضام نون مع ال س ي سي, which translates to “In Solidarity with\nSisi,” poses as a promotional app (SisiFans) targeting the supporters of a political figure. It had 150\ninstalls before it was taken off Google Play after our disclosure.\n\nThe developer’s handle, ss4mDEV, also appears in other app marketplaces. The Google Play-hosted\nAnubisSpy was developed by TVDEV, whom we encountered in other marketplaces. We reported our\n[findings to Google, and Google Play Protect accordingly detected and pulled the Google Play-hosted](https://www.android.com/play-protect/)\napps developed by TVDEV.\n\n\n-----\n\nSisiFans is also on another third-party app story we saw uploaded last February 27. ss4mDEV also\nuploaded another AnubisSpy version in the form of a healthcare-related app called SwiftClinic. Both\napps share the same certificate. SwiftClinic, touting multilingual support, masqueraded as a patient\nregistration application for dental clinics. It was also shortly published on Google Play, but was promptly\ntaken down.\n\nFigure 2: AnubisSpy disguising as a healthcare-related app\n\nFigure 3: Properties of AnubisSpy as SwiftClinic\n\n\n-----\n\nAnubisSpy was also in another third-party app marketplace in the form of apps with the package name\nnms.sabayaElkher.\n\nWe also found apps developed by TVDEV. One posed as an aggregator of news covering Egypt’s\ngovernment and politics. While it had no espionage functionalities (it had a different certificate, too), we\nthink this was an experimental project considering it was released back in 2016, before the latest\nversions of AnubisSpy made their way to Google Play and third-party app marketplaces. TVDEV also\ndeveloped and uploaded a similar app named officialsabayaelkheer on March 14, 2017. It poses as an\napp for “Sabaya El Kheir,” a TV program in Egypt. officialsabayaelkheer may just be a Potentially\nUnwanted Application (PUA) with no espionage functions, but it has the same nms.sabayaElkher label,\nwhich it shares with AnubisSpy-laden apps. We think these seemingly innocuous apps and versions of\nAnubisSpy were created during the same period so the latter can better camouflage and hide from\nantivirus (AV) detection.\n\nFigure 4: Screenshot of an app posing as an aggregator for news in Egypt\n\n\n-----\n\nFigure 5: AnubisSpy on a Spanish third-party app marketplace\n\nFigure 6: Screenshots of the app TVDEV developed, which posed as the official app of an Egypt-based TV program\n\n\n-----\n\n[Sphinx reportedly uses the watering hole technique via social media sites to deliver its payloads —](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-attack/137/watering-hole-101)\n[mainly a customized version of njRAT. The Sphinx campaign operators cloaked their malware with Word,](http://blog.trendmicro.com/trendlabs-security-intelligence/new-rats-emerge-from-leaked-njw0rm-source-code/)\nPDF, image, and application (i.e., Flash) icons to dupe recipients into clicking them. Sphinx was active\nbetween June 2014 and November 2015, but timestamps of the malware indicate the attacks started as\nearly as 2011.\n\nA WHOIS query of the C&C server showed that it abused a legitimate managed hosting service provider\nbased in Belize. We correlated these AnubisSpy variants to Sphinx’s desktop/PC-targeting malware\ngiven these commonalities:\n\n  - They share the same C&C server IP address, 86[.]105[.]18[.]107\n\n  - They share the technique of decrypting JSON files; the file structures of AnubisSpy and Sphinx’s\nmalware are similar\n\n  - Their targets are highly concentrated in the Middle East\n\nFigure 7: Comparison of file structure in Sphinx’s desktop/PC-targeting malware (left) and AnubisSpy (right)\n\nThe apps mainly used Middle East-based news and sociopolitical themes as social engineering hooks,\nand abused social media to further proliferate. For instance, an app developed by TVDEV\n(nms.sabayaElkher) went to great lengths to feign as a legitimate app. It had three additional\ntabs/screens, each of which pointed to its Facebook, Twitter, and Google Play pages.\n\nThe apps were all written in Arabic and, in one way or another, related to something in Egypt (i.e.,\nspoofing an Egypt-based TV program and using news/stories in the Middle East) regardless of the labels\nand objects within the apps. Our coordination with Google also revealed that these apps were installed\nacross a handful of countries in the Middle East.\n\n\n-----\n\nFigure 8: An app developed by TVDEV (nms.sabayaElkher) posing as a legitimate app; note the screens and icons\n\nfor its Facebook and Twitter pages\n\n\n-----\n\nThe malicious modules of all the AnubisSpy samples are almost the same. Our analyses are from a\nsample with the package name cc.solidaritycc (SHA256:\nd627f9d0e2711d59cc2571a11d16c950adadba55d95fd4c55638af6a97d32b23).\n\nAnubisSpy can steal messages (SMS), photos, videos, contacts, email accounts, calendar events, and\nbrowser histories (i.e., Chrome and Samsung Internet Browser). It can also take screenshots and record\naudio, including calls. It can monitor the victim through apps installed on the device, such as Skype,\nWhatsApp, Facebook, and Twitter, among others.\n\nAfter the data are collected, they are encrypted and sent to the (C&C) server. AnubisSpy can also selfdestruct to cover its tracks. It can run commands and delete files on the device, as well as install and\nuninstall Android Application Packages (APKs).\n\nAnubisSpy’s code is well constructed, indicating at least the attackers’ know-how. Below is a\nvisualization of the modules:\n\nFigure 9: Structure of AnubisSpy’s modules\n\n\n-----\n\nThe Init Module initiates all the other spyware modules and prepares the running environment. It sleeps\nfor 60 seconds, then calls the Dec Module to decrypt two JavaScript Object Notation (JSON) files and a\nZIP file from the assets folder.\n\nSleep 60s\n\nDecrypt rule file\n\nDecrypt configure file\n\nDecrypt supers-related files\n\nFigure 10: Init Module’s routine\n\nThe first JSON file has \"Agent configuration.\" All modules are initiated based on this configuration file. It\nhas two main parts: “core” and “plugins.” The former contains detailed spyware and global\nconfigurations, while the latter mainly has configurations about communication, such as the C&C\naddress used for initiating the Comm Module. The second JSON file is a so-called dbrule file. Each item\nwithin it has extensive rules for stealing sensitive information. “uri” indicates the Universal Resource\nIdentifier (URI) of Android SMS; “sort_order” and “selection” are for querying the database.\n\nIn short, the first configuration file specifies what to do, while the dbrule file specifies how to do it. The\ndecrypted ZIP file is used as Patch Module.\n\n\nSleep 60s\n\nDecrypt rule file\n\nDecrypt configure file\n\nDecrypt supers-related files\n\n\n-----\n\nFigure 11: dbrule file’s rule for stealing SMS messages (left) and the list of apps AnubisSpy monitors (right)\n\nInit CMD Module\n\nInit DBdump Module\n\nInit Screenshots Module\nInit Position Module\n\nInit Uploader Module\nInit Comm Module\nInit APK Manipulate Module\n\nFigure 12: Code snippets showing how the Init Module initiates the spying-related modules after getting the\n\nconfiguration file\n\n\nInit CMD Module\n\nInit DBdump Module\n\nInit Screenshots Module\nInit Position Module\n\n\nInit CMD Module\n\n\n-----\n\n[Figure 13: Code snippet showing how Init Module uses ContentObserver](https://developer.android.com/reference/android/database/ContentObserver.html)\n\n[The Init Module initiates serials of ContentObserver (used for tracking changes in the device’s data),](https://developer.android.com/reference/android/database/ContentObserver.html)\nbased on the configuration file. This includes SMS, calendar events, emails, browsing histories in\nChrome and Samsung Internet Browser, photos, and videos. If any of the device content changes, a\nspecific module will be invoked to process the new/updated data.\n\nFigure 14: Code snapshot showing how new/changed data is processed\n\nBased on the configuration and device-rooted status, it will call the Android Application Package (APK)\nManipulate Module to install itself as a system application then install an embedded APK decrypted from\nassets. In one of the samples we analyzed though, there was no embedded APK in the assets folder.\n\nDecrypt embedded APK\n\nInstall embedded APK\n\nInstall itself into /system/app\n\nFigure 15: Code snapshot showing the Manipulate Module\n\n\nDecrypt embedded APK\n\nInstall embedded APK\n\nInstall itself into /system/app\n\n\n-----\n\nSome of the spying-related modules need root permission. The Patch Module is for rooted devices,\ndeploying root-related functionalities and granting the malware root permission without user knowledge.\n\nThe Init Module first checks the device’s root status. Based on the \"no_supersu_patch\" configuration\n(True or False), a file (ZIP) is decrypted.\n\nFigure 16: Init Module checking the root status (top); configuration code checking if a ZIP file should be decrypted\n\n(center); and the ZIP file’s structure (bottom)\n\nA series of commands is performed to deploy files on the device, and is carried out by a bash script\nnamed “update-binary.” It will patch/change the superSU configuration file, if existing, to grant itself root\npermission and ensure no notifications, logs, and re-authentication are made.\n\n\n-----\n\nFigure 17: update-binary deploying files on the device (top) and how Patch Module grants root permission (bottom)\n\nComm Module\n\nThe Comm Module plays the middleman between the agent and the C&C server. It is initiated based on\nthe configuration file, with the C&C server address and service path as the key parameters.\n\nAll communications are performed through HTTP/HTTPS POST method using multipart/form-data\nrequests. It has these main types of communications: sending and retrieving a file to and from the server,\nas well as getting commands from the server.\n\n\n-----\n\nFigure 18: Snapshot of the Comm Module\n\nKeywords replacement\n\nFigure 19: Code snippets showing how the Comm Module works\n\n\nKeywords replacement\n\n\n-----\n\nTo evade traffic inspection, all keywords in the request body are replaced based on protocol_strings\nspecified in the configuration file:\n\nOriginal Keyword Replaced Keyword\nrequest choux\ntype lobotomize\nput whispered\nget hillo\nip idolizers\nlist deliberate\ndel luff\nevent damageable\ncommand telescopes\ntimestamp carillon\nfile chevins\nfilename triggered\nfilelist hurras\nstatus snuffler\nchunknum debriefs\n\nTable 1: Keywords based on protocol_strings DBDump Module\n\nThe DBDump Module consists of two parts: DUMP_DATABASES_EXACT_TIME and\nDUMP_DATABASES_INTERVAL, which are initiated by separate configurations.\nDUMP_DATABASES_EXACT_TIME dumps specific databases at an exact time. Its configuration\ncontains a time and dump list. In this case, it’s supposed to dump the device’s contact information at a\ncertain time. This function though is disabled as there’s no value for the “time.” However, it still can be\nenabled through a configuration update from the C&C server. Some of the routines specified in the code\nneed root permission.\n\nFigure 20: Code snapshots showing the DBDump Module’s DUMP_DATABASES_EXACT_TIME\n\n|:|Col2|\n|---|---|\n|Original Keyword|Replaced Keyword|\n|request|choux|\n|type|lobotomize|\n|put|whispered|\n|get|hillo|\n|ip|idolizers|\n|list|deliberate|\n|del|luff|\n|event|damageable|\n|command|telescopes|\n|timestamp|carillon|\n|file|chevins|\n|filename|triggered|\n|filelist|hurras|\n|status|snuffler|\n|chunknum|debriefs|\n\n\n-----\n\nDUMP_DATABASES_INTERVAL dumps specific databases at intervals. Its configuration contains the\ninterval time and specified databases. In this case, the following are configured:\n\nTime Interval dbItem\n\ndevice/sms\n\n10 minutes device/calls\n\ndevice/calendar_events\nfacebook/messages\nfacebook/notifications\nlinkedin/messages\ntwitter/tweets\ngplus/activities\nviber/messages\nviber/calls\nwhatsapp/messages\nhangout-gtalk/messages\nskype/messages\nskype/calls\ngmail/emails\nsystem_email/emails\ndevice/browser_history_chrome\ndevice/browser_history_samsung\ndevice/browser_history\ndevice/photo\ndevice/video\n\ngoogle_play_service_security/*\n\n72 hours system_email/accounts\n\nsystem_users_security/*\ndevice/contacts\ngplus/contacts\nviber/contacts\nskype/contacts\nwhatsapp/contacts\nfacebook/contacts\nlinkedin/profiles\nlinkedin/connections\ntwitter/following\n\nTable 2: Database items dumped by the DBDump Module\n\nThe DBDump Module dumps databases only when the screen is off to evade users’ awareness. For\nevery item above, it will look into the dbrule file to get the corresponding rule.\n\n|Time Interval|dbItem|\n|---|---|\n|10 minutes|device/sms|\n||device/calls|\n||device/calendar_events|\n||facebook/messages|\n||facebook/notifications|\n||linkedin/messages|\n||twitter/tweets|\n||gplus/activities|\n||viber/messages|\n||viber/calls|\n||whatsapp/messages|\n||hangout-gtalk/messages|\n||skype/messages|\n||skype/calls|\n||gmail/emails|\n||system_email/emails|\n||device/browser_history_chrome|\n||device/browser_history_samsung|\n||device/browser_history|\n||device/photo|\n||device/video|\n|72 hours|google_play_service_security/*|\n||system_email/accounts|\n||system_users_security/*|\n||device/contacts|\n||gplus/contacts|\n||viber/contacts|\n||skype/contacts|\n||whatsapp/contacts|\n||facebook/contacts|\n||linkedin/profiles|\n||linkedin/connections|\n||twitter/following|\n\n\n-----\n\nBelow is an example rule for facebook/messages. It tells the DBDump Module Facebook’s root directory\nand asks for database location and file name, SQL query statement, and other field titles for further\nresult formatting.\n\nFigure 21: Rule used by the DBDump Module for facebook/messages\n\nIt then gets and parses rules then queries db and sends the information to the Format Module:\n\nFigure 22: DBDump Module parsing the rules (top), and querying the db (bottom)\n\n\n-----\n\nThe Position Module retrieves the device’s location data and uploads it to the C&C server. A parameter\nof position_interval in the configuration file is sent to the Position Module when initiating. It indicates the\nintervals for when location data (position) is stolen each time. In a sample we analyzed (shown below),\nthe value is 600 — that is, the Position Module collects and uploads this information every 10 minutes.\n\nFigure 23: Position Module indicating the interval time for stealing location data\n\nEach time that it collects the data, if there’s a position/location, it selects a specific Position Provider via\nGPS, network or passive (last known location), whether the device’s screen is on or off. If\nforce_location_services_enabled is configured, it will try to enable the GPS and network provider. The\ndevice’s location/position data is sent to the Format Module, then processed as a JSON file with value\nof key “type” as “gis.”\n\nFigure 24: How the Position Module selects the Position Provider (top), enables GPS and network provider (center),\n\nand passes the information to the Format Module (bottom)\n\n\n-----\n\nThe Screenshot Module takes screenshots and uploads them to the C&C server. It reads related\nconfigurations from the configuration file first before initiating. Apart from time intervals, there’s also a\npackage list in the configuration set that the Screenshot Module uses when taking screenshots. The\nScreenshot Module works only on rooted devices.\n\nFigure 25: Screenshot Module’s intervals for taking screenshots (top) and how it checks whether the device is\n\nrooted or not (bottom)\n\nIt first gets the device’s current, overlaying activity. It takes a screenshot of it if its package name is in\nthe list from its configuration file. If it fails to get the activity or if the package list is empty, it will just take\na screenshot of current screen regardless of the activities running on top. A screenshot is taken by\nrunning screencap. After it is compressed, it is sent to the Format Module and processed as a JSON file\nwhose value key “type” is “image,” and accompanied with other image attributes.\n\nThe package names listed in the configuration file include:\n\n  - com.skype.raider\n\n  - com.facebook.katana\n\n  - com.facebook.orca\n\n  - com.whatsapp\n\n  - com.viber.voip\n\n  - com.google.android.talk\n\n  - com.sec.android.app.sbrowser\n\n  - com.android.chrome\n\n  - mobi.mgeek.TunnyBrowser\n\n\n-----\n\nFigure 26: Code snippet showing how screenshots are taken (top, center) and how they are processed (bottom)\n\n## CMD Module\n\nThe CMD Module retrieves commands from the C&C server and processes them. The parameter\ncheckcmd_interval in the configuration file is sent to the CMD Module when initiating. It indicates the\ninterval for checking/awaiting commands (CMD checking) from the C&C server. As shown below, the\nvalue is 600 — that is, the CMD Module checks for commands from the C&C server every 10 minutes.\n\nFigure 27: CMD Module’s interval for checking commands\n\n\n-----\n\nFigure 28: CMD Module calling the Destruction Module (top) and encryption of commands (bottom)\n\nBefore sending a CMD request to the C&C server, it checks if the current date reached the\n\"expiry_date,\" which is read from the configuration file. If it has, it will call the Destruction Module to\nremove itself from the device; otherwise, it proceeds to do CMD checking. Getting the command from\nthe C&C server is performed through the Comm Module. The commands are sent in JSON format then\nencrypted. After getting the raw data, the CMD Module calls the Dec Module to decrypt it then parse it\nas a JSON file.\n\nThe JSON file’s contents have these commands:\n\nCommand Comments\nuninstall_agent Destruct itself\ninstall_package Install an APK, which is sent from the C&C server and encoded in command\nJSON file\nuninstall_package Uninstall a specific package\nupdate_config Update the configuration file\nupdate_dbrules Update the dbrule file\nget_databases Dump a specific db\nget_file Get and upload specific files on the device\nrecv_file Retrieve a file from the C&C server and put it in a certain location on the device\nexec_cmdline Run command line on the device\ndelete_file Delete a specific file from the device\nget_dirtree Get and upload a specific directory tree structure\nget_sysinfo Call the Device Info Module to get system information\nstart_av_bug Start audio recording through Audio Record Module\nstop_av_bug Stop audio recording through Audio Record Module\n\nTable 3: Commands from the C&C server\n\n|Command|Comments|\n|---|---|\n|uninstall_agent|Destruct itself|\n|install_package|Install an APK, which is sent from the C&C server and encoded in command JSON file|\n|uninstall_package|Uninstall a specific package|\n|update_config|Update the configuration file|\n|update_dbrules|Update the dbrule file|\n|get_databases|Dump a specific db|\n|get_file|Get and upload specific files on the device|\n|recv_file|Retrieve a file from the C&C server and put it in a certain location on the device|\n|exec_cmdline|Run command line on the device|\n|delete_file|Delete a specific file from the device|\n|get_dirtree|Get and upload a specific directory tree structure|\n|get_sysinfo|Call the Device Info Module to get system information|\n|start_av_bug|Start audio recording through Audio Record Module|\n|stop_av_bug|Stop audio recording through Audio Record Module|\n\n\n-----\n\nThe Audio Record Module records audio, mainly used by the CMD Module, and calls-related modules. It\nis referred to in the configuration file via the strings media_chunk_size and audio_hq. After it records the\naudio, it is sent as a pass result file (along with other information such as Location and DialNumber) to\nthe Format Module.\n\nThe Calls Module monitors and records the device’s incoming and outgoing call actions. The\nconfiguration file refers to it via the strings call_info, call_audio, audio_hq, and media_chunk_size.\n\nFigure 29: Code snippets showing the Audio Record (top) and Calls modules (center, bottom)\n\nWhen a call action occurs, the Calls Module determines the phoneNumber and action type (outgoing or\nincoming), and invokes the Audio Record Module. The captured audio record file is sent to the Format\nModule along with information such as call type, phoneNumber, phoneNumber displayName, Location,\nand currentTime.\n\n\n-----\n\nFigure 30: How the captured audio is processed (top) and code snippets showing how the VoIP Module works\n\n(center, bottom)\n\nThe VoIP Module monitors calls done on Voice over Internet Protocol (VoIP) by registering\nandroid.service.notification.NotificationListenerService. When receiving a Notification Action, it checks if\nthe notification is specified in a list of packages in the configurations file. If it finds a match, it is further\nprocessed (i.e., invoking the Audio Record Module).\n\n\n-----\n\nThe Device Info Module collects the following information on the device’s operating system (OS), build,\nand phone information, and the device’s root status and apps:\n\nroot status\n\narch\n\nOS INFO osname\n\nosversion\n\nboard\n\nBUILD INFO bootloader\n\nbranch\ncpu abi\ndevice\ndisplay\nfingerprint\nhardware\nhost\nid\nmanufacturer\nmodel\nproduct\nradio\nserial\ntags\ntime\nType\nuser\n\ndevice_memory\n\nPHONE INFO media_storage_totalspace\n\nmedia_storage_freespace\nlocal_time\ncurrent_position\nimei\nimsi\nsw_version\nline_number\nvoicemail_number\nnetwork_country_iso\nnetwork_operator\ndevice_type\nnetwork_type\nsim_country_iso\nsim_operator\nsim_serial_number\nsim_state\ninstalled_app_list\n\nTable 4: Information that Device Info Module collects\n\n|Col1|root status|\n|---|---|\n|OS INFO|arch|\n||osname|\n||osversion|\n|BUILD INFO|board|\n||bootloader|\n||branch|\n||cpu abi|\n||device|\n||display|\n||fingerprint|\n||hardware|\n||host|\n||id|\n||manufacturer|\n||model|\n||product|\n||radio|\n||serial|\n||tags|\n||time|\n||Type|\n||user|\n|PHONE INFO|device_memory|\n||media_storage_totalspace|\n||media_storage_freespace|\n||local_time|\n||current_position|\n||imei|\n||imsi|\n||sw_version|\n||line_number|\n||voicemail_number|\n||network_country_iso|\n||network_operator|\n||device_type|\n||network_type|\n||sim_country_iso|\n||sim_operator|\n||sim_serial_number|\n||sim_state|\n||installed_app_list|\n\n\n-----\n\nThis module is for when expire_time is reached, or if executing a self-destruct command. First, it tries to\nremove its device-admin permission, stops the spying-related modules’ schedule, and unregisters\nContentObservers. It then removes itself from the device.\n\nFigure 31: How the Destruction Module works (top) and how it removes itself from the device (bottom)\n\nDec Module\n\nThe Dec Module is for decrypting encrypted assets and data from the C&C server using the Advanced\nEncryption Standard (AES) algorithm. The following keys, which are hardcoded, are used for decryption:\n\n  - SecretKey —\n001234ABDE9217910000DEC4FEDB120003243BC00221296470103FE000AAB201\n\n  - IvParameter — 001234abde9217910000dec4fedb1200\n\nWhen decrypting data from the C&C server, it reads SecretKey, which is \"cipher_key\" in the\nconfiguration file. To get IvParameter, it reads the first 32 bytes of data and decrypts them using the\ntable keys. Both SecretKey and IvParameter are used to decrypt the rest of the data.\n\n\n-----\n\nFigure 32: Dec Module using AES to decrypt assets Enc Module\n\nAll data are processed by the Enc Module before they are uploaded to the C&C server. Like Dec Module,\nit uses AES. SecretKey is read from the configuration file (cipher_key), but the IvParameter here is\ngenerated randomly. Data are encrypted into two parts (bodyPart, headPart) via different parameters.\nbodyPart is encrypted through cipher_key and a randomly generated IvParameter, which is headPart’s\ndata. IvParameter is encrypted via the default SecretKey and IvParameter. It is combined as one file and\nsent to the Uploader Module.\n\nFigure 33: How the Enc Module works\n\n\n-----\n\nThe outputs of AnubisSpy’s modules vary, which makes the Format Module very complex and diverse.\nBut amid the complexity, there are common denominators. All data are processed into JSON files by the\nFormat Module. AnubisSpy’s modules have two data types:\n\n  - String — Device information, SMS messages, etc.\n\n  - Binary — Images, audio files, etc.\n\nFor String data, the Format Module will process it to a JSON file based on the module. It will retrieve\nrules and items from the configuration file’s dbruleFile to construct the JSON file.\n\nFigure 34: Code snippets showing the rules being retrieved (top), as well as column value and field title\n\nreplacements for the DBDump Module\n\n\n-----\n\nFor Binary data, the same process is carried out, but more file attribution such as file path, size,\ntimestamp, etc., are added. The binary data is base64-encoded with the key binary_data.\n\nFigure 35: Binary data base64-encoded (top); sample information written in the resulting JSON file for captured\n\naudio (center) and image (bottom)\n\nUploader Module\n\nAnubisSpy’s modules send their outputs into one specific folder after they are encrypted. The Uploader\nModule is responsible for checking, uploading, and deleting them. There are two configurations that tell\nthe Uploader Module when to work: when there’s a Wi-Fi connection, and when the device’s battery is\nbeing charged. File traverse in the cache folder, sent, then removed. It sleeps from 3-5 seconds when it\nprocesses a file.\n\n\n-----\n\nFigure 36: Uploader Module works only as specified in the configuration file What does AnubisSpy mean to the mobile landscape?\n\nPersistent and furtive spyware is an underrated problem for the mobile platform. While cyberespionage\ncampaigns on mobile devices may be few and far between compared to ones for desktops or PCs,\nAnubisSpy proves that they do indeed occur, and may have been more active than initially thought. Will\nmobile become cyberespionage’s main frontier? It won’t be a surprise given the mobile platform’s\n[increasing ubiquity, especially in workplaces.](https://www.gartner.com/newsroom/id/3725117)\n\n[Beyond its impact, AnubisSpy also highlights the significance of proactively securing mobile devices,](https://www.trendmicro.com/vinfo/us/security/news/mobile-safety/best-practices-securing-your-mobile-device)\n[particularly if they’re on BYOD programs and used to access sensitive data. Enforcing the principle of](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/-infosec-guide-bring-your-own-device-byod)\nleast privilege and implementing an app reputation system are just some of the best practices that can\nhelp mitigate threats.\n\nWe disclosed our findings to Google and worked with them to take down the apps on Google Play.\nUpdates were also made to [Google Play Protect to take appropriate action against those apps that have](https://www.android.com/play-protect/)\nbeen verified as in violation of Google Play policy.\n\n\n-----\n\nIndicators of Compromise (IoCs)Hashes detected as ANDROIDOS_ANUBISSPY(SHA256):\n\nHash\n\n627f9d0e2711d59cc2571a11d16c950adadba55d95fd4c55638af6a97d32b23 صبايا الخير\n\ne00655d06a07f6eb8e1a4b1bd82eefe310cde10ca11af4688e32c11d7b193d95 SwiftClinic\n\n06cb3f69ba0dd3a2a7fa21cdc1d8b36b36c2a32187013598d3d51cfddc829f49 ALTOR\n\n0cab88bb37fee06cf354d257ec5f27b0714e914b8199c03ae87987f6fa807efc\n\n7eeadfe1aa5f6bb827f9cb921c63571e263e5c6b20b2e27ccc64a04eba51ca7a C.Sinai\n\n0714b516ac824a324726550b45684ca1f4396aa7f372db6cc51b06c97ea24dfd C.Sinai\n\nad5babecf3a21dd51eee455031ab96f326a9dd43a456ce6e8b351d7c4347330f Tsina C&C servers linked to AnubisSpy:\n\nC&C Server\nhxxp://86[.]105[.]18[.]107/2dodo/loriots[.]php\n\nhxxp:// 86[.]105[.]18[.]107/111fash7/synectics[.]php\n\nhxxp:// 86[.]105[.]18[.]107/3hood/spelled[.]php\n\nhxxp:// 86[.]105[.]18[.]107/1swiftclinic/entires[.]php\n\nhxxp:// 86[.]105[.]18[.]107/7ram/olefiant[.]php\n\nhxxp:// 86[.]105[.]18[.]107/sinai/freakiest[.]php\n\n|Hash|App Label|\n|---|---|\n|627f9d0e2711d59cc2571a11d16c950adadba55d95fd4c55638af6a97d32b23|ريخلا ايابص|\n|e00655d06a07f6eb8e1a4b1bd82eefe310cde10ca11af4688e32c11d7b193d95|SwiftClinic|\n|06cb3f69ba0dd3a2a7fa21cdc1d8b36b36c2a32187013598d3d51cfddc829f49|ALTOR|\n|0cab88bb37fee06cf354d257ec5f27b0714e914b8199c03ae87987f6fa807efc|يسيسلا عم نونماضتم|\n|7eeadfe1aa5f6bb827f9cb921c63571e263e5c6b20b2e27ccc64a04eba51ca7a|C.Sinai|\n|0714b516ac824a324726550b45684ca1f4396aa7f372db6cc51b06c97ea24dfd|C.Sinai|\n|ad5babecf3a21dd51eee455031ab96f326a9dd43a456ce6e8b351d7c4347330f|Tsina C&C servers linked to AnubisSpy:|\n\n\n-----\n\nTrend Micro Incorporated, a global leader in security software, strives to make the\nworld safe for exchanging digital information. Our innovative solutions for consumers,\nbusinesses and governments provide layered content security to protect information\non mobile devices, endpoints, gateways, servers and the cloud. All of our solutions\nare powered by cloud-based global threat intelligence, the Trend Micro™ Smart\nProtection Network™, and are supported by over 1,200 threat experts around the\nglobe. For more information, visit www.trendmicro.com.\n\n©2017 by Trend Micro, Incorporated. All rights reserved. Trend Micro and the Trend\nMicro t-ball logo are trademarks or registered trademarks of Trend Micro,\nIncorporated. All other product or company names may be trademarks or registered\ntrademarks of their owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/tech-brief-cyberespionage-campaign-sphinx-goes-mobile-with-anubisspy.pdf"
    ],
    "report_names": [
        "tech-brief-cyberespionage-campaign-sphinx-goes-mobile-with-anubisspy.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1513620320,
    "ts_modification_date": 1513620320,
    "files": {
        "pdf": "https://archive.orkl.eu/69bab8b48e8dd94f8f65104226a74ae010ec2f65.pdf",
        "text": "https://archive.orkl.eu/69bab8b48e8dd94f8f65104226a74ae010ec2f65.txt",
        "img": "https://archive.orkl.eu/69bab8b48e8dd94f8f65104226a74ae010ec2f65.jpg"
    }
}