{
    "id": "cfd594d0-bbb3-41cb-8c2b-18d0889a04e4",
    "created_at": "2023-01-12T15:04:20.306177Z",
    "updated_at": "2025-03-27T02:09:29.68355Z",
    "deleted_at": null,
    "sha1_hash": "739ecedb469c887769e17fcf795f5f357ad74e50",
    "title": "2019-11-05 - Buran Ransomware; the Evolution of VegaLocker",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:56Z",
    "file_modification_date": "2022-05-28T16:16:56Z",
    "file_size": 1362268,
    "plain_text": "# Buran Ransomware; the Evolution of VegaLocker\n\n**[mcafee.com/blogs/other-blogs/mcafee-labs/buran-ransomware-the-evolution-of-vegalocker/](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/buran-ransomware-the-evolution-of-vegalocker/)**\n\nNovember 5, 2019\n\nMcAfee’s Advanced Threat Research Team observed how a new ransomware family named\n‘Buran’ appeared in May 2019. Buran works as a RaaS model like other ransomware\nfamilies such as REVil, GandCrab (now defunct), Phobos, etc. The author(s) take 25% of the\nincome earned by affiliates, instead of the 30% – 40%, numbers from notorious malware\nfamilies like GandCrab, and they are willing to negotiate that rate with anyone who can\nguarantee an impressive level of infection with Buran. They announced in their ads that all\nthe affiliates will have a personal arrangement with them.\n\nFor this analysis we present, we will focus on one of the Buran hashes:\n\nWe will highlight the most important observations when researching the malware and will\nshare protection rules for the endpoint, IOCs and a YARA rule to detect this malware.\n\n## Buran Ransomware Advertisement\n\n\n-----\n\nThis ransomware was announced in a well-known Russian forum with the following\nmessage:\n\n**_Buran is a stable offline cryptoclocker, with flexible functionality and support 24/7._**\n**Functional:**\n\nReliable cryptographic algorithm using global and session keys + random file keys;\nScan all local drives and all available network paths;\nHigh speed: a separate stream works for each disk and network path;\nSkipping Windows system directories and browser directories;\nDecryptor generation based on an encrypted file;\nCorrect work on all OSs from Windows XP, Server 2003 to the latest;\nThe locker has no dependencies, does not use third-party libraries, only mathematics and\nvinapi;\n\nThe completion of some processes to free open files (optional, negotiated);\nThe ability to encrypt files without changing extensions (optional);\nRemoving recovery points + cleaning logs on a dedicated server (optional);\nStandard options: tapping, startup, self-deletion (optional);\nInstalled protection against launch in the CIS segment.\n\n**Conditions:**\n\nThey are negotiated individually for each advert depending on volumes and material.\n\nStart earning with us!\n\nThe announcement says that Buran is compatible with all versions of the Windows OS’s (but\nduring our analysis we found how, in old systems like Windows XP, the analyzed version did\nnot work) and Windows Server and, also, that they will not infect any region inside the CIS\nsegment. Note: The CIS segment belongs to ten former Soviet Republics: Armenia, Belarus,\nKazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Ukraine, and\nUzbekistan.\n\n## Rig Exploit Kit as an Entry Vector\n\nBased upon the investigation we performed, as well as research by “nao_sec” highlighted in\nJune 2019, we discovered how Buran ransomware was delivered through the Rig Exploit Kit.\nIt is important to note how the Rig Exploit Kit is the preferred EK used to deliver the latest\nransomware campaigns.\n\n\n-----\n\nFIGURE 1. EXPLOIT KIT\n\nThe Rig Exploit Kit was using CVE-2018-8174 (Microsoft Internet Explorer VBScript Engine,\nArbitrary Code Execution) to exploit in the client-side. After successful exploitation this\nvulnerability will deliver Buran ransomware in the system.\n\n## Static Analysis\n\nThe main packer and the malware were written in Delphi to make analysis of the sample\nmore complicated. The malware sample is a 32-bit binary.\n\nFIGURE 2. BURAN STATIC INFORMATION\n\nIn our analysis we detected two different versions of Buran, the second with improvements\ncompared to the first one released.\n\n\n-----\n\nFIGURE 3. BURAN STATIC INFORMATION\n\nThe goal of the packer is to decrypt the malware making a RunPE technique to run it from\nmemory. To obtain a cleaner version of the sample we proceed to dump the malware from\nthe memory, obtaining an unpacked version.\n\n## Country Protection\n\nChecking locales has become quite popular in RaaS ransomware as authors want to ensure\nthey do not encrypt data in certain countries. Normally we would expect to see more former\nCIS countries but, in this case, only three are verified.\n\nFIGURE 4. GETTING THE COUNTRY OF THE VICTIM SYSTEM\n\nThis function gets the system country and compares it with 3 possible results:\n\n0x7 -> RUSSIAN FEDERATION\n\n\n-----\n\n0x177 -> BELARUS\n0x17C -> UKRAINE\n\nIt is important to note here that the advertising of the malware in the forums said it does not\naffect CIS countries but, with there being 10 nations in the region, that is obviously not\nentirely accurate.\n\nIf the system is determined to be in the Russian Federation, Belarus or Ukraine the malware\nwill finish with an “ExitProcess”.\n\nThe next action is to calculate a hash based on its own path and name in the machine. With\nthe hash value of 32-bits it will make a concat with the extension “.buran”. Immediately after,\nit will create this file in the temp folder of the victim machine. Importantly, if the malware\ncannot create or write the file in the TEMP folder it will finish the execution; the check will be\ndone extracting the date of the file.\n\nFIGURE 5. BURAN CHECKS IN THE TEMP FOLDER\n\n\n-----\n\nIf the file exists after the check performed by the malware, the temporary file will be erased\nthrough the API “DeleteFileW”.\n\nFIGURE 6. CHECK WHETHER A TEMP FILE CAN BE CREATED\n\nThis function can be used as a kill switch to avoid infection by Buran.\n\nBuran ransomware could accept special arguments in execution. If it is executed without any\nspecial argument, it will create a copy of Buran with the name “ctfmon.exe” in the Microsoft\nAPPDATA folder and will launch it using ShellExecute, with the verb as “runas”. This verb is\nnot in the official Microsoft SDK but, if we follow the MSDN documentation to learn how it\nworks, we can deduce that the program will ignore its own manifest and prompt the UAC to\nthe user if the protection is enabled.\n\nThis behavior could change depending on the compilation options chosen by the authors and\ndelivered to the affiliates.\n\nAccording to the documentation, the function “CreateProcess” checks the manifest, however\nin Buran, this is avoided due to that function:\n\nFIGURE 7. LAUNCH OF THE NEW INSTANCE OF ITSELF\n\nBuran in execution will create a registry key in the Run subkey section pointing to the new\ninstance of the ransomware with a suffix of ‘*’. The meaning of this value is that Buran will\nrun in safe mode too:\n\n\n-----\n\nFIGURE 8. PERSISTENCE IN THE RUN SUBKEY IN THE REGISTRY\n\nThe writing operation in the registry is done using the “reg” utility, using a one-liner and\nconcatenating different options with the “&” symbol. This method through “reg.exe” avoids a\nbreakpoint in the main binary.\n\nFIGURE 9. WRITE OF PERSISTENCE IN THE REGISTRY\n\nBuran implements this technique with the objective of making analysis of the sample\ncomplicated for malware analysts looking at reverse engineering profiles. After these\noperations, the old instance of the ransomware will die using “Exit Process”.\n\nAnalysis of the Delphi code show that the 2nd version of Buran will identify the victim using\nrandom values.\n\n\n-----\n\nFIGURE 10. GENERATE RANDOM VALUES\n\nAfter that it will decrypt a registry subkey called “Software\\Buran\\Knock” in the\nHKEY_CURRENT_USER hive. For the mentioned key it will check the actual data of it and,\nif the key does not exist, it will add the value 0x29A (666) to it. Interestingly, we discovered\nthat GandCrab used the same value to generate the ransom id of the victim. If the value and\nsubkey exists the malware will continue in the normal flow; if not, it will decrypt a URL\n,“iplogger.ru”, and make a connection to this domain using a special user agent:\n\nFIGURE 11. SPECIAL USER AGENT BURAN\n\n\n-----\n\nAs mentioned, the referrer will be the victim identifier infected with Buran.\n\nThe result of this operation is the writing of the subkey previously checked with the value\n0x29A, to avoid repeating the same operation.\n\nAfter this action the malware will enumerate all network shares with the functions :\n\nWNetOpenEnumA,\nWNetEnumResourceA\nWNetCloseEnum\n\nThis call is made in a recursive way, to get and save all discovered shared networks in a list.\nThis process is necessary if Buran wants to encrypt all the network shares as an addition to\nthe logical drives. Buran will avoid enumerating optical drives and other non-mounted\nvolumes. The result of those operations will be saved for Buran to use later in the encryption\nprocess.\n\nThe ransom note is crypted inside the binary and will be dumped in execution to the victim’s\nmachine. Inside this ransom note, the user will find their victim identifier extracted with the\nrandom Delphi function mentioned earlier. This identification is necessary to track their\ninfected users to affiliates to deliver the decryptor after the payment is made.\n\n\n-----\n\nIn the analysis of Buran, we found how this ransomware blacklists certain files and folders.\nThis is usually a mechanism to ensure that the ransomware does not break its functionality\nor performance.\n\n**Blacklisted folders in Buran:**\n\n**Blacklisted files in Buran:**\n\nThe encryption process will start with special folders in the system like the Desktop folder.\nBuran can use threads to encrypt files and during the process will encrypt the drive letters\nand folders grabbed before in the recognition process.\n\nThe ransom note will be written to disk with the name “!!! YOUR FILES ARE ENCRYPTED\n!!!” with the following content:\n\n\n-----\n\nFIGURE 12. AN EXAMPLE RANSOM NOTE\n\nEach file crypted is renamed to the same name as before but with the new extension of the\nrandom values too.\n\nFor example: “rsa.bin.4C516831-800A-6ED2-260F-2EAEDC4A8C45”.\n\nAll the files encrypted by Buran will contain a specific filemarker:\n\n\n-----\n\nFIGURE 13. CRYPTED FILE\n\nIn terms of encryption performance, we found Buran slower compared to other RaaS\nfamilies. According to the authors’ advertisement in the underground forums, they are\ncontinually improving their piece of ransomware.\n\n## Buran Version 1 vs Buran Version 2\n\nIn our research we identified two different versions of Buran. The main differences between\nthem are:\n\n**Shadow copies delete process:**\n\nIn the 2nd version of Buran one of the main things added is the deletion of the shadow copies\nusing WMI.\n\n\n-----\n\n**Backup catalog deletion:**\n\nAnother feature added in the new version is the backup catalog deletion. It is possible to use\nthe Catalog Recovery Wizard to recover a local backup catalog.\n\n**System state backup deletion:**\n\nIn the same line of system destruction, we observed how Buran deletes in execution the\nsystem state backup in the system:\n\n**Ping used as a sleep method:**\n\nAs a poor anti-evasion technique, Buran will use ping through a ‘for loop’ in order to ensure\nthe file deletion system.\n\nThe ransom note changed between versions:\n\n## VegaLocker, Jumper and Now Buran Ransomware\n\n\n-----\n\nDespite the file marker used, based on the behavior, TTPs and artifacts in the system we\ncould identify that Buran is an evolution of the Jumper ransomware. VegaLocker is the origin\nfor this malware family.\n\nMalware authors evolve their malware code to improve it and make it more professional.\nTrying to be stealthy to confuse security researchers and AV companies could be one reason\nfor changing its name between revisions.\n\nThis is the timeline of this malware family:\n\n## Similarities in Behavior:\n\nFiles stored in the temp folder:\n\n**VegaLocker:**\n\n**Jumper:**\n\n**Buran:**\n\nRegistry changes:\n\n**VegaLocker:**\n\n**Buran:**\n\n\n-----\n\nExtension overlapping:\n\nIn one of the variants (Jumper) it is possible to spot some samples using both extensions:\n\n.vega\n.jamper\n\n**Shadow copies, backup catalog and systembackup:**\n\nIn the analyzed samples we saw how VegaLocker used the same methods to delete the\nshadow copies, backup catalog and the systembackup.\n\n## Coverage\n\nRDN/Ransom\nRansomware-GOS!E60E767E33AC\nRansom\nRDN/Ransom\nRDN/Generic.cf\nRansom-Buran!\n\n## Expert Rule:\n\n\n-----\n\n## Indicators of Compromise\n\n MITRE\n\n\n-----\n\nThe sample uses the following MITRE ATT&CK™ techniques:\n\nDisabling Security Tools\nEmail Collection\nFile and Directory Discovery\nFile Deletion\nHooking\nKernel Modules and Extensions\nMasquerading\nModify Registry\nNetwork Service Scanning\nPeripheral Device Discovery\nProcess Injection\nQuery Registry\nRegistry Run Keys / Start Folder\nRemote Desktop Protocol\nRemote System Discovery\nService Execution\nSystem Time Discovery\nWindows Management Instrumentation\n\n## YARA Rule\n\nWe created a YARA rule to detect Buran ransomware samples and the rule is available in\nour GitHub repository\n\n## Conclusion\n\nBuran represents an evolution of a well-known player in the ransomware landscape.\nVegaLocker had a history of infections in companies and end-users and the malware\ndevelopers behind it are still working on new features, as well as new brands, as they\ncontinue to generate profits from those actions. We observed new versions of Buran with just\na few months between them in terms of development, so we expect more variants from the\nauthors in the future and, perhaps, more brand name changes if the security industry puts\ntoo much focus on them. We are observing an increase in ransomware families in 2019, as\nwell as old players in the market releasing new versions based on their own creations.\n\nFor the binaries, all of them appeared with a custom packer and already came with\ninteresting features to avoid detection or to ensure the user must pay due to the difficulty of\nretrieving the files. It mimics some features from the big players and we expect the inclusion\nof more features in future developments.\n\nBuran is slower than other ransomware families we observed, and samples are coded in\nDelphi which makes reverse engineering difficult.\n\n\n-----\n\n[Alexandre Mundo](https://www.mcafee.com/blogs/author/alexandre-mundo/)\nAlexandre Mundo, Senior Malware Analyst is part of Mcafee's Advanced Threat Research\nteam. He reverses the new threads in advanced attacks and make research of them in a\ndaily basis....\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-05 - Buran Ransomware; the Evolution of VegaLocker.pdf"
    ],
    "report_names": [
        "2019-11-05 - Buran Ransomware; the Evolution of VegaLocker.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535860,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653754616,
    "ts_modification_date": 1653754616,
    "files": {
        "pdf": "https://archive.orkl.eu/739ecedb469c887769e17fcf795f5f357ad74e50.pdf",
        "text": "https://archive.orkl.eu/739ecedb469c887769e17fcf795f5f357ad74e50.txt",
        "img": "https://archive.orkl.eu/739ecedb469c887769e17fcf795f5f357ad74e50.jpg"
    }
}