{
    "id": "d00dd761-3f86-4ffa-bc93-0c4b046e3402",
    "created_at": "2023-05-26T02:07:43.514651Z",
    "updated_at": "2025-03-27T02:09:29.223338Z",
    "deleted_at": null,
    "sha1_hash": "12929758dc1049b094f1efb2d05365fdad99795c",
    "title": "2006-06-26 - Blackmailer - the story of Gpcode",
    "authors": "",
    "file_creation_date": "2023-05-23T02:47:27Z",
    "file_modification_date": "2023-05-23T02:47:27Z",
    "file_size": 260218,
    "plain_text": "# Blackmailer: the story of Gpcode\n\n**securelist.com/blackmailer-the-story-of-gpcode/36089**\n\nAuthors\n\n[Denis Nazarov](https://securelist.com/author/denisnazarov/)\n\n[Olga Emelyanova](https://securelist.com/author/emelyanova/)\n\nOn June 7th, 2006, breaking news appeared on Analyst’s Diary, the Kaspersky Lab weblog:\n[“New Gpcode with a 660 bit key…cracked by Kaspersky Lab! And we’ve contacted the](https://threats.kaspersky.com/en/threat/Gpcode)\nhosting company – the virus file’s been removed from the site.”\n\nAnalysts at Kaspersky Lab had successfully cracked a 660 bit RSA encryption key. This was\nthe latest victory against a cyber blackmailer that had been plaguing users in Russia for over\na year and a half.\n\n## Blackmail is as easy as 1, 2, 3\n\n_Virus.Win32.Gpcode marked the beginning of a new era in cyber crime. This new approach_\n_is reminiscent of a hostage/ ransom situation. An avalanche of emails from users in Russia,_\n_and a significantly smaller number from users in the rest of the world, shows that blackmail_\n_and racketeering are becoming widespread on the Internet._\n\nAlexander Gostev, Malware Evolution: April – June 2005\n\n\n-----\n\nIt is easy to imagine how upset a user would be when they wake up on a sunny June\nmorning and discover that their files are unusable: either they can’t be opened or, in the case\nof .txt files, they contain garbage. And it’s not only MS Office documents – over 80 different\ntypes of file are affected.\n\nHowever, a few text files do open – files with suspiciously simple names such as readme.txt.\nBut the text these files contain isn’t going to make the victims happy: it makes it clear to the\nvictims that there’s an easy way to recover their data – simply buy a decoder program that\nwill unlock ‘certain files’, i.e. those which have been encrypted using the RSA encryption\nalgorithm.\n\nUnfortunately, this wasn’t a scene from a movie about cyber crime, but something that’s been\nhappening for over a year. Moreover, until recently it was unclear how victim machines\nbecame infected in the first place.\n\nThanks to some detective work by Kaspersky Lab virus analysts we do finally know how\nGpcode has been spreading – at least the wave of new variants that hit Russia in early June.\n\nThe email shown below (originally in Russian) was mass mailed using spammer\ntechnologies, and was the first step in the infection process:\n\nHello !We are writing to you regarding the resume you have posted on the job.ru website. I\nhave a vacancy that is suitable for you. ADC Marketing LTD (UK) is opening an office in\nMoscow and I am searching for appropriate candidates. I will soon be asking you to come in\nfor an interview at a mutually convenient time.\n\nIf you are interested in my offer, please fill out the attached form related to compensation\nissues and email the results to me.\nSincerely,\n\nViktor Pavlov\n\nHR manager\n\nThe email had an MS word .doc file called anketa.doc attached. (Anketa is the Russian for\napplication form). This file actually contained a malicious program called TrojanDropper.MSWord.Tored.a. When the recipient opens the attachment, a malicious macro\n[installs another Trojan – Trojan-Downloader.Win32.Small.crb – on the victim machine. This](https://threats.kaspersky.com/en/threat/Trojan-Downloader.Win32.Small.crb)\nTrojan then downloaded Gpcode from [skip].msk.ru/services.txt and installed it to the victim\nmachine.\n\nGpcode then scans all accessible directories and encrypts files with certain extensions such\nas .txt, .xls, .rar, .doc, .html, .pdf etc. It also encrypts mail client databases.\n\nGpcode and the Trojans used to install it then self-destruct, leaving a file called readme.txt in\nevery folder which contain encrypted files. This text file provides information on how to\ncontact the virus writer:\n\n\n-----\n\nSome files are coded by RSA method.\nTo buy decoder mail: k47674@mail.ru\nwith subject: REPLY\n\nGpcode’s author regularly changed the version of the virus placed on the website. S/he also\nchanged the email address contained in the ‘readme.txt’ file. When a victim contacted the\nauthor, s/he offered to provide a decoder program. But naturally, this came at a price. The\nmoney was to be deposited in a Yandex account (Yandex is a major Russian web portal,\nwhich provides a payment system similar to PayPal.)\n\nThe infection and blackmail process is now clear, but this was far from the case when the\nfirst encrypted files were received in late 2004.\n\n## The first step is the hardest\n\n_In December 2004 we received the first samples of a number of files which were encrypted_\n_by an unknown encryption program. There was no hint that in six months time, such files_\n_would become so common that we would be receiving several dozen a day. Nor was there_\n_any clue that in the space of a single week in June, the different encryption methods used_\n_would exceed two dozen._\n\nAlexander Gostev, Malware Evolution: April – June 2005\n\nKaspersky Lab virus analysts first encountered Gpcode in December 2004. Users reported\nthat their files had been encrypted and no one could establish which program had been used\nto encrypt them. The only trace left by the virus (apart from encrypted files) was a text file\ncalled !_Vnimanie_!.txt (‘vnimanie’ is the Russian word for ‘attention’). This file pointed to the\nRussian origin of the virus; the file name and text it contained were in Russian, and some\nencrypted files were of a format almost exclusively found in Russia.\n\nThe first wave of Gpcode hit mostly business users: Russian banks, advertising and real\nestate agencies, and other organizations using a large number of documents. Only a few\ncompanies outside Russia were affected.\n\nThe virus writer tried to trick users and analysts by placing a reference to PGP – “PGPcoder”\nin the headers of encrypted files. Thankfully, Gpcode’s author initially used an encryption\nalgorithm of his/ her own, which was easy for Kaspersky Lab analysts to crack.\n\nThe second wave of Gpcode infections hit in June 2005 and again, only Russian users were\ntargeted. The encryption algorithm used was more complex than the one implemented in\nDecember 2004, but still relatively simple for Kaspersky Lab analysts to crack – after all,\nwe’d seen over 25 variants of the first version of Gpcode. Best of all, this time we were able\nto get some samples of the program which was used to encrypt data.\n\n\n-----\n\nSo far so good. But one question remained unanswered – how did the virus actually get onto\nvictim machines? As it turned out, this wasn’t the only puzzle our analysts would have to\nsolve.\n\n## A little learning can be a dangerous thing\n\n_Internet rackets are becoming more and more popular with virus writers. This is a very_\n_dangerous trend, which is intensifying with each passing month. However crude it may_\n_seem, this is a separate type of cyber crime._\n\nAlexander Gostev, Malware Evolution: October – December 2005\n\nThe creator of Gpcode seemed to decide that blackmail was an easy way to make a living,\nand that his/ her creation needed some improvement. S/he spent almost 6 months studying\nencryption, and in early 2006 decided to test his/ her newfound strength.\n\nOn 26th January 2006, we intercepted yet another variant, Gpcode.ac, which was the first to\nuse RSA encryption algorithms. RSA is one of the best known and most secure public\nencryption algorithms. The proud blackmailer even created a website; effectively ‘RSA for\ndummies’.\n\nThe use of RSA encryption was a major leap forward from the simple encryption techniques\nthe blackmailer had used previously. We were able to cope with this, but another Gpcode\nversion, released in April, clearly showed that the author was continuing to hone his/ her\nencryption skills. This latest variant partially used the RSA algorithm, as had previous\nversions, but this time the encryption key was 67 bits, rather than 56 bits. Not a huge jump,\nbut a sign of things to come.\n\nNew variants were used to launch a mass attack on Russian internet users at the beginning\nof June 2006.\n\n## The final round?\n\n_Since the beginning of 2006, the authors of such programs have attempted to radically alter_\n_the encryption methods used, in order to hinder the abilities of the antivirus industry to_\n_decrypt encrypted data. Previously, the author had used his own encryption algorithms, but_\n_with GpCode.ac, clearly decided to bring in the heavy guns_\n\nAlexander Gostev “Malware Evolution January – March 2006\n\nIn early June 3 variants of Gpcode appeared in the space of 5 days. Each variant used a\nlonger encryption key: the first variant, Gpcode.ae had a 260 bit RSA key, while Gpcode.af\nalready had 330 bit key. The longer the key, the more difficult it would be for antivirus\ncompanies to crack the encryption algorithm.\n\n\n-----\n\nThe situation was challenging. It took us 10 hours of manpower and some serious computing\npower to break the 330 bit key used by Gpcode.af. We added decryption routines to our\ndatabases and heaved a sigh of relief.\n\nHowever, our relief was premature – the next day brought Gpcode.ag – with a 660 bit key.\nCurrently, the longest factorized key on the RSA website is 640 bits. Even using a computer\nwith a 2.2 GHz processor it would take 30 years to break such a key. We released detection\nand decryption routines on the day that Gpcode.ag was detected.\n\nHow did we do this? Well, that’s a trade secret. And what does the future hold? That’s not an\neasy or a pleasant question.\n\n## For a fistful of roubles\n\n_In order for our law enforcement agencies to take action (e.g. open a criminal case in_\n_accordance with section 273 of the Russian Criminal Code) at least one victim has to make_\n_an official complaint to the police._\n\nAlexander Gostev, Kaspersky Lab weblog\n\nOne should never underestimate one’s opponent – even if they lose. The Gpcode author\nplanned the attacks carefully, using social engineering methods to spread the virus.\n\nSpam containing malware was sent to email addresses harvested from job.ru – one of\nRussia’s main recruitment websites. People who left their contact information received email\nwhich appeared to be from a major Western company. Naturally, they clicked on the\nattachment which supposedly contained details of the financial package. Given the\ncircumstances, it would be hard to see how anyone could resist.\n\nOpening the attachment didn’t appear to trigger any malicious payload. But a Trojan was\ninstalled on the victim machine, and this Trojan then downloaded Gpcode soon after. This\nmeant that very few people connected the recruitment email with their files becoming\nencrypted, and made it very difficult to determine the original infection vector.\n\nIt’s a real shame that so much energy was expended for criminal purposes. Moreover, the\nfact that the author continued to create more variants is surprising given the financial\nrewards: s/he asked 2,000 rubles (approx $70) to decrypt the files. At the beginning, in\nDecember 2004, the asking price was 1000 rubles, though messages posted on the Internet\nshowed that s/he was willing to accept as little as 500 rubles (approx $20).\n\nObviously, the Gpcode author is interested in volume, not individual sums. S/he was clearly\ncounting on the fact that victims would find it easier to part with a relatively small sum of\nmoney rather than contact an antivirus company or a law enforcement agency.\n\n\n-----\n\nSuccess clearly spurred the blackmailer (or blackmailers) to repeat the crime. According to\nRussian law, the police cannot open a case until a victim files an official complaint.\nUnfortunately, most victims are either unaware of this or have personal reasons for\nconcealing their plight. A great shame, as this means that cyber criminals such as the author\nof Gpcode continue to go unpunished.\n\n## Protect your data\n\n_I think that a computer which is connected to the Internet is rather like sex – it can be safe, or_\n_it can be unsafe._\n\nEugene Kaspersky “The contemporary antivirus industry and its problems”\n\nOne of the most surprising aspects of the Gpcode story is that a large percentage of the\nvictims who contacted Kaspersky Lab during the June attacks had Kaspersky Anti-Virus\ninstalled. It’s surprising because Kaspersky Anti-Virus blocks the attacks 3 times. First, the\ninfected attachment is detected as Trojan-Dropper.MSWord.Tored.a. Next, the downloader\nthat loaded Gpcode was detected as Trojan-Downloader.Win32.Small.crb. Finally, Gpcode\nitself was detected. Even users whose antivirus databases were not up to date should have\nbeen protected, as detection for most Gpcode modifications has been available since\nJanuary 2006.\n\nObviously, the victims had either turned their antivirus solution off, or chose to ignore the\nwarnings it showed. Kaspersky Lab virus analysts did issue decryption and disinfection along\nwith antivirus database updates. We even created special tools for restoring mail databases\nwhich were damaged when mail clients were unable to recognize the format of encrypted\nfiles. However, some users did lose critical data.\n\nIn the course of the past few years, antivirus companies have come across other malicious\ncode which is used to blackmail users. Two examples are Cryzip and MayArchive, which in\n2006 infected users in the USA and Great Britain. Both these programs archive files using an\nunknown password, and cracking the password is as difficult as cracking Gpcode’s\nencryption algorithms.\n\nThese programs demonstrate that using malicious code to blackmail users is not a purely\nRussian phenomenon. They also demonstrate that it’s essential to back up your data\nregularly. Why make life easy for cyber criminals?\n\nThe history of Gpcode highlights several points. Firstly, you never know where the next threat\nis coming from or what it will do to your computer. Secondly, under no circumstances should\nmoney be paid to the author of such malicious programs; users should contact an antivirus\ncompany instead, which will be able to help. And finally, although it might be boring, and it\nmight slow your computer down a fraction, antivirus protection, regularly updated, is a must if\nyou care about your data.\n\n\n-----\n\n[Gpcode](https://securelist.com/tag/gpcode/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n\nBlackmailer: the story of Gpcode\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2003 - 2009/2006-06-26 - Blackmailer - the story of Gpcode.pdf"
    ],
    "report_names": [
        "2006-06-26 - Blackmailer - the story of Gpcode.pdf"
    ],
    "threat_actors": [
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1685066863,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1684810047,
    "ts_modification_date": 1684810047,
    "files": {
        "pdf": "https://archive.orkl.eu/12929758dc1049b094f1efb2d05365fdad99795c.pdf",
        "text": "https://archive.orkl.eu/12929758dc1049b094f1efb2d05365fdad99795c.txt",
        "img": "https://archive.orkl.eu/12929758dc1049b094f1efb2d05365fdad99795c.jpg"
    }
}