{
    "id": "d05020ff-7da3-489d-8afb-1401dadb5667",
    "created_at": "2022-10-25T16:48:23.711602Z",
    "updated_at": "2025-03-27T02:17:14.561243Z",
    "deleted_at": null,
    "sha1_hash": "4af9052cde27fa68791ba498e8ca4b2d8632933b",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-08-20T06:39:52Z",
    "file_modification_date": "2020-08-20T06:39:52Z",
    "file_size": 3136185,
    "plain_text": "# TA410: The Group Behind LookBack Attacks Against U.S. Utilities Sector Returns with New Malware\n\n**[proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new](https://www.proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new?utm_source=dlvr.it&utm_medium=twitter)**\n\nJune 5, 2020\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nTA410: The Group Behind LookBack Attacks Against U.S. Utilities Sector Returns with\nNew Malware\n\n\n-----\n\nJune 08, 2020 Michael Raggi, Dennis Schwarz, and Georgi Mladenov with the Proofpoint\nThreat Research Team\n\n[In August 2019, Proofpoint researchers reported that LookBack malware was targeting](https://www.proofpoint.com/us/threat-insight/post/lookback-malware-targets-united-states-utilities-sector-phishing-attacks)\n[the United States (U.S.) utilities sector between July and August 2019. We then continued](https://www.proofpoint.com/us/threat-insight/post/lookback-forges-ahead-continued-targeting-united-states-utilities-sector-reveals)\nour analysis into additional LookBack campaigns that unfolded between August 21-29,\n2019. These campaigns utilized malicious macro-laden documents in order to deliver\nmodular malware to targeted utility providers across the U.S. At the same time as the\nLookBack campaigns, Proofpoint researchers identified a new, additional malware family\nnamed FlowCloud that was also being delivered to U.S. utilities providers.\n\nFlowCloud malware, like LookBack, gives attackers complete control over a compromised\nsystem. Its remote access trojan (RAT) functionality includes the ability to access\ninstalled applications, the keyboard, mouse, screen, files, services, and processes with the\nability to exfiltrate information via command and control.\n\nWe analyzed phishing campaigns between July-November 2019 and have determined\nthat both LookBack and FlowCloud malware can be attributed to a single threat actor we\nare calling TA410. This conclusion is based on the threat actor’s use of shared attachment\nmacros, malware installation techniques, and overlapping delivery infrastructure.\n\nIn addition, our analysis found similarities between TA410 and TA429 (APT10) delivery\ntactics. Specifically, we have seen attachment macros that are common to both actors.\nTA410 campaigns detected in November 2019 included TA429 (APT10)-related\ninfrastructure used in phishing attachment delivery macros. However, Proofpoint\nanalysts believe that intentional reuse of well-publicized TA429 (APT10) techniques and\ninfrastructure may be an attempt by threat actors to create a false flag. For this reason,\nwhile research is ongoing, we do not attribute LookBack and FlowCloud campaigns to\nTA429 (APT10). Proofpoint currently tracks TA429 (APT10) independently of TA410\ncampaigns.\n\nFigure 1 below shows a timeline of the identified LookBack and FlowCloud campaigns.\n\n\n-----\n\n_Figure 1 LookBack and FlowCloud Campaign Timeline_\n\n**Delivery**\n\nProofpoint researchers observed phishing campaigns beginning on July 10, 2019 that\ntargeted utility providers across the United States with portable executable (PE)\nattachments and used subject lines such as “PowerSafe energy educational courses (30days trial)”. These campaigns continued through September 2019.\n\nOur analysis of these phishing campaigns determined that the PE attachments delivered a\nmodular malware which the developers referred to in program data base (“PDB”) paths as\n“FlowCloud”. We therefore refer to these campaigns as “FlowCloud” based on the\nmalware family they delivered. It’s notable that these FlowCloud campaigns were\noccurring at the same time as the LookBack campaigns that Proofpoint has previously\ndocumented. Both the FlowCloud and LookBack campaigns targeted utility providers in\nthe United States. Both used training and certification-themed lures. And both used\nthreat actor-controlled domains for delivery. In some cases, both FlowCloud and\nLookBack campaigns targeted not only the same companies but also the same recipients.\n\nThe senders of the emails that delivered FlowCloud malware utilized threat actorcontrolled domains for delivery which impersonated energy sector training services, as\nwell as utilized subdomains which contained the word “engineer”.\n\nWe observed a distinct change in FlowCloud delivery tactics beginning with attacks\ncarried out in November 2019. The targeting of US utilities companies remained\nconstant, but the threat actors shifted from PE attachments to malicious macro laden\nMicrosoft Word documents that closely resembled the same delivery and installation\nmacros used in LookBack malware campaigns.\n\nAdditionally, in November threat actors began to utilize the sender domain asce[.]email\nto deliver these attachments. This domain was first observed in June 2019 registered to\nthe IP 103.253.41[.]75 which was used as a staging and reconnaissance IP in previous\nLookBack campaigns. On October 29, 2019, the domain resolved to the IP\n134.209.99[.]169 which also hosted several energy certification and education themed\ndomains. A number of these domains also shared an SSL certificate with delivery domains\n\n\n-----\n\npreviously observed in the July and August 2019 FlowCloud phishing campaigns. The\ndata from this SSL Certificate has been displayed in Figure 2. This figure demonstrates\nthe actor’s use of a single SSL certificate for multiple energy and training themed\ndomains. The actor listed the domains that were signed by the certificate in the\nAlternative Names field allowing for the identification of additional related infrastructure.\nA number of these domains were used in FlowCloud campaigns.\n\n_Figure 2 Passive Total SSL Certificate data for powersafetrainings[.]org and related_\n_energy themed domains._\n\nThe table below shows the TA410 staging IPs, when they were first observed, the\nregistered domains associated with them, and the malware delivered by emails\noriginating from these domains.\n\n\n**IP** **First**\n**Observed**\n\n\n**Registered Domains** **Malware**\n**Delivered**\n\n\n-----\n\n103.253.41[.]75 06/23/2019 **_Delivery Domain:_**\n\nNceess[.]com\n\nGlobalenergycertification[.]com\n\n**_Registered Domain:_**\n\nNerc[.]email\n\nAsce[.]email\n\n134.209.99[.]169 10/29/2019 **_Delivery Domain:_**\n\nAsce[.]email\n\n**_Registered Domain:_**\n\nPowersafetraining[.]net\n\n**_Domains Related by SSL Certificate:_**\n\nmails.energysemi[.]com\n\npowersafetrainings[.]org\n\nwww.mails.energysemi[.]com\n\nwww.powersafetraining[.]net\nwww.powersafetrainings[.]org\n\n101.99.74[.]234 07/02/2019 **_Delivery Domain_**\n\nwww.powersafetrainings[.]org\n\n\nLookBack\n\nFlowCloud\n\nFlowCloud\n\n\nThe content of the emails in the November 2019 campaigns impersonated the American\nSociety of Civil Engineers and masqueraded as the legitimate domain asce[.]org. The\nstructure of this email is very similar to the LookBack delivery emails constructed to\nimpersonate the NCEES and Global Energy Certification in July 2019. Examples of the\nemails are included in Figure 3 and Figure 4.\n\n\n-----\n\n_Figure 3 ASCE-themed phishing email delivering FlowCloud malware November 2019_\n\n\n-----\n\n_Figure 4 NCEES-themed phishing email delivering LookBack malware July 2019_\n\n**Exploitation - Installation Macros**\n\nAs noted above, after an extended period of using PE attachments to deliver FlowCloud in\ncampaigns, the threat actors behind FlowCloud switched to using Microsoft Word\ndocuments with malicious macros at the beginning of November 2019. The Word\ndocument attachments and macros delivering FlowCloud had key similarities with the\nWord document attachments and macros we identified that delivered LookBack in July\nand August 2019.\n\nIdentical to the methodology used with LookBack, the FlowCloud macro used privacy\nenhanced mail (“.pem”) files which were subsequently renamed to the text file\n“pense1.txt”. This file is next saved as a portable executable file named “gup.exe” and\nexecuted using a version of the certutil.exe tool named “Temptcm.tmp”.\n\n\n-----\n\nFor comparison, Figure 5 November 2019 macro used to install FlowCloud malware\nshows the macro used to install FlowCloud while Figure 6 August 2019 macro used to\ninstall LookBack malware shows the macro used to install LookBack.\n\n_Figure 5 November 2019 macro used to install FlowCloud malware_\n\n_Figure 6 August 2019 macro used to install LookBack malware_\n\nThe “Exploitation” section in our blog LookBack Malware Targets the United States\nUtilities Sector with Phishing Attacks Impersonating Engineering Licensing Boards has a\nmore in-depth explanation of this method used by LookBack. FlowCloud uses this same\nmethod exactly including identical macro concatenation code.\n\nWhile we found the ultimate execution method for both the LookBack Gup proxy tool and\nFlowCloud malware were the same across both macro versions, we found that the\nFlowCloud macro introduced a new method for the delivery of the malware.\n\nThe earlier LookBack versions of the macro included the payload in numerous privacy\nenhanced email (“.pem”) files that were dropped when the attachment file is executed by\nthe user. The FlowCloud version of the macro utilized a previously unobserved macro\nsection to download the payload from a DropBox URL. Once the payload was\n\n\n-----\n\ndownloaded, a FlowCloud malware PE in the form of a .pem file was saved as the variable\n“Pense1.txt”. Figure 7 FlowCloud Malware Macro delivery code shows the FlowCloud\nmacro with the delivery section in question called out.\n\n_Figure 7 FlowCloud Malware Macro delivery code_\n\nThe FlowCloud macro also contained a strange try… catch statement which initially\nattempts to download the FlowCloud payload from the DropBox URL as part of the try\nstatement. However, if it was unable to retrieve the payload from that resource, a catch\nstatement which was nearly identical to the try statement attempted to retrieve a malware\nresource from the URL http://ffca.caibi379[.]com/rwjh/qtinfo.txt”.”. Figure 8 FlowCloud\nMalware Catch statement macro code shows the catch statement in question.\n\n_Figure 8 FlowCloud Malware Catch statement macro code_\n\nThis try…catch sequence is significant because the URL in the catch statement and\nmalware resource was previously mentioned in a May 2019 blog by enSilo entitled\n[“Uncovering New Activity by APT10”. The blog claims that this URL delivered a modified](https://blog.ensilo.com/uncovering-new-activity-by-apt10)\nQuasar RAT payload which included the addition of SharpSploit, an opensource postexploitation tool. When analyzed on the same date of FlowCloud campaign delivery this\nURL and resource was unavailable, while the DropBox URL successfully delivered the\nFlowCloud .pem file. While Proofpoint has not independently verified these attribution\nclaims made by other researchers regarding the referenced Quasar RAT sample, the use\nof this URL represents a previously undisclosed overlap with publicly reported indicators\nof compromise attributed to TA429 (APT10). While on the surface this domain may imply\nlinks to TA429 (APT10), we have identified several aberrations regarding the domain\nregistration information and inactive nature of the URL and will discuss them at length at\nlength later in this blog.\n\n\n-----\n\n**FlowCloud Malware**\n\nOur analysis of the FlowCloud malware determined that it is a multi-stage payload\ncomprised of a large code base written in C++. The code demonstrates a level of\ncomplexity including numerous components, extensive object-oriented programming,\nand use of legitimate and imitation QQ files for initial and later stage execution. We found\nfurther imitation of QQ components in several modules used throughout FlowCloud\nexecution. The malware name “FlowCloud” was taken from distinctive PDB paths\nobserved in numerous malware components. These values have been included in the IOCs\nsection at the end of this blog.\n\nFlowCloud malware is capable of RAT functionalities based on its available commands\nincluding accessing the clipboard, installed applications, keyboard, mouse, screen, files,\nservices, and processes with the ability to exfiltrate information via command and\ncontrol. Additionally, the malware variants analyzed have several distinct characteristics\nthat indicate the malware may have been active in the threat landscape since at least July\n2016.\n\nIn addition to components built to target updated Windows versions, FlowCloud samples\nhave dropped a 32-bit module that was only compatible with Windows versions 6\n(Windows Vista) and below. The dated nature of this binary coupled with the extensible\nnature of the malware code suggests that the FlowCloud code base has been under\n[development for numerous years. Public reports around FlowCloud malware components](https://www.bleepingcomputer.com/forums/t/644821/computer-restart-every-1-2-minutes-and-bsod/)\nand related installation directory paths suggest that versions of this malware may have\nbeen observed in the wild as early as July 2016. Additionally, development of this\nmalware around legitimate QQ files and the identification of malware samples uploaded\nto VirusTotal from Japan in December 2018 and earlier this year from Taiwan indicate\nthat the malware may have been active for some time in Asia prior to its appearance\ntargeting the US utilities sector.\n\nFigure 9 Flowchart of FlowCloud Loader Functionality below outlines FlowCloud’s loader\nfunctionality.\n\n\n-----\n\n_Figure 9 Flowchart of FlowCloud Loader Functionality_\n\nThe malware begins with the execution of Gup.exe by the malicious macro which in\nturn executes the file EhStorAuthn.exe.\n\n\n-----\n\nEhStorAuthn.exe extracts the subsequent payload file components and installs them\nto the directory C:\\Windows\\Media\\SystemPCAXD\\ado\\fc. This file also sets\nregistry key values that store the keylogger drivers and the malware configuration as\nthe value “KEY_LOCAL_MACHINE\\SYSTEM\\Setup\\PrintResponsor\\<2-4>”.\nEhStorAuthn.exe is a legitimate portable executable file used by QQ with the initial\nname QQSetupEx.exe. This file is used to load the file dlcore.dll as part of its natural\ndownloader routine.\nDlcore.dll is a DLL crafted by the threat actors that functions as a shellcode injector\npulling the shellcode from a file named rebare.dat. This file imitates a legitimate QQ\ncomponent.\nWhen the shellcode within rebare.dat is executed it in turn executes a RAT installer\nfile named rescure.dat.\nRescure.dat is an XOR encrypted DLL file that installs the RAT based application\nresponsor.dat which installs the keylogger driver and manages the RAT\nfunctionality.\nResponsor.dat unpacks several modules (rescure86.dat or rescure64.dat) to the\nregistry %TEMP%\\{0d47c9bc-7b04-4d81-9ad8-b2e00681de8e}\" and installs the\nunpacked file as a service named “FSFilter Activity Monitor” or “FltMgr”.\nFinally, Responsor.dat starts the RAT when the rescure.dat function “startModule”\nis called.\nSeveral legitimate Microsoft Windows files were also used by the malware for\nthread injection.\nEhStorAuthn_shadow.exe (hhw.exe) a Microsoft HTML Help Workshop file was\nused as a placeholder for thread injection.\nHha.dll is a component of Microsoft HTML Help Workshop and is required to run\nEhStorAuthn_shadow.exe.\n\nThe malware stores its configuration in the registry alongside drivers utilized by the\nmalware’s keylogger components. Several additional distinct registry keys are generated\nwhich indicate the malware’s current execution stage on the host. Some of these keys are\nincluded in the table below.\n\n\n**Registry Key** **Originating**\n**Component**\n\n\n**Description**\n\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\Print\n\nResponsor\\2\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\Print\n\nResponsor\\3\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\Print\n\nResponsor\\4\n\n\nGup.exe 32bit Driver,\n\nKeylogger\n\nGup.exe 64bit Driver,\n\nKeylogger\n\nGup.exe RAT config\n\n\n-----\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\{2D\nB80286-1784-48b5-A751-B6ED1F490303}\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\\n{804423C2-F490-4ac3-BFA5-13DEDE63A71A}\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\\n{A5124AF5-DF23-49bf-B0ED-A18ED3DEA027}\n\n**FlowCloud Configuration**\n\n\nDlcore.dll Execution Stage Ex\necuting dlcore.dll\n\nrescure.dat Execution Stage Install keylogger driver\n\nrescure.dat Execution Stage\n\nRAT fully installed.\n\n\nThe FlowCloud loader component EhStorAuthn.exe stores the malware configuration in\nthe registry early in the installation chain and is represented in the table above. The\nRegistry data is composed of multiple encrypted headers (using XORs and RORs) and\ndata is encrypted using a modified (or broken) AES algorithm. The plaintext data is\ncompressed with ZLIB and serialized using Google’s Protocol Buffers. Figure 10 shows an\nexample of a configuration as displayed by FlowCloud’s debug logging:\n\n_Figure 10 Example of a configuration as displayed by debug logging_\n\n\n-----\n\n**Command and Control**\n\nFlowCloud malware handles configuration updates, file exfiltration, and commands as\nindependent threads utilizing a custom binary C2 protocol. We identified these\nindependent threads as part of an extensive command handling functionality with\ndistinct command managers existing for each command. The sample we analyzed utilized\nport 55555 for file exfiltration and port 55556 for all other data. We identified FlowCloud\ncommunication with the IP 188.131.233[.]27. The requests and responses are composed\nof multiple encrypted headers (using XORs and RORs) and TEA encrypted data using a\nkey generation scheme involving a hardcoded string of random characters and MD5\nhashing. The plaintext data is compressed using ZLIB and serialized using Google’s\nProtocol Buffers. An example parsing of an initial beacon is demonstrated in Figure 11\nExample of FlowCloud parsing an initial C2 beacon:\n\n\n-----\n\n_Figure 11 Example of FlowCloud parsing an initial C2 beacon_\n\n**Comparing Public TA429 (APT10) Indicators with TA410 Campaigns**\n\n\n-----\n\n[Publications by FireEye and EnSilo regarding TA429 (APT10) campaigns contain](https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html)\nindicators that later appeared in TA410 campaigns. In our retrospective analysis of that\nresearch, we determined that TA429 (APT10) used phishing macros that were later seen\nbeing used by LookBack and FlowCloud malware. Additionally, we identified the Quasar\nRAT delivery URL hxxp://ffca.caibi379[.]com/rwjh/qtinfo.txt used by FlowCloud macros\nin November, which was published in the enSilo report prior to observable weaponization\nfor TA410 campaigns.\n\nInterestingly, the compilation date of several LookBack malware modules used in July\n2019 were September 14, 2018. This includes the SodomMain and SodomNormal\nmodules covered in previous Proofpoint blogs on LookBack malware. That date is just one\nday after FireEye released their initial analysis of similar TA429 (APT10) macros utilized\nin Japan on September 13, 2018.\n\nWhile LookBack malware samples were not observed in the wild until June 2019, this\nSeptember 2018 compilation date demonstrates a large lag time between compilation and\ndelivery. This possibly suggests manipulation of compilation times by threat actors but\nhas not been conclusively determined.\n\nThe first identified server installation by TA410 on actor-controlled infrastructure\noccurred in December 2018. Most of the domain registration (weaponization) for\nLookBack and FlowCloud campaigns began in May and June 2019 respectively. These\nevents were after FireEye’s initial publication in September 2018.\n\nAdditionally, enSilo’s publication on potentially TA429 (APT10) related Quasar RAT\nsamples was published on May 24, 2019. It was not until the second week of November\n2019 when the inactive URL was incorporated into a phishing macro as part of a\nFlowCloud campaign targeting US utilities. WHOIS records and passive DNS information\nfor ffca.caibi379[.]com indicate that the registrant email and address fields for the\ndomain were updated on June 7, 2019. The A record for the domain was updated on\nSeptember 9, 2019 at which time it resolved to the IP 34.80.27[.]200 contained within an\nASN owned by Google. For the prior eight months beginning on January 2, 2019 and\nencompassing the period of activity discussed by enSilo, the domain was hosted on\nseveral IP’s in an ASN owned by APNIC Hostmaster. The shift away from IP\ninfrastructure owned by APNIC represents a departure in threat actor infrastructure\nhosting tactics well after the publication by enSilo and within the weaponization period\nfor TA410’s campaign targeting US utilities. While this research is not conclusive, it\ndemonstrates that all observed TA429 (APT10) similarities and indicators of compromise\nwere available publicly prior to the start of TA410 campaigns. Therefore, while not\nconclusive from current analysis, the possibility remains that these overlaps represent\nfalse flag activity by the TA410 threat actor. Based on this analysis Proofpoint analysts\ntrack TA410 as a distinct threat actor from TA429 (APT10) at this time.\n\n**Conclusion**\n\n\n-----\n\nThe convergence of LookBack and FlowCloud malware campaigns in November 2019\ndemonstrates the capabilities of TA410 actors to distinctly utilize multiple tools as part of\na single ongoing campaign against US utilities providers. Both malware families\ndemonstrate a level of sophistication in their conception and development while the\nextensible code base of FlowCloud malware suggests that this group may have been\noperating as early as 2016. TA410 operators demonstrate a willingness to dynamically\nevolve phishing tactics to increase the effectiveness of their campaigns and a keen eye\ntowards plausible social engineering within a very select targeted sector. It remains\nunclear if the nature of the tactics and indicators that are shared with TA429 (APT10)\nwere developed by this group or culled from readily available technical reporting that predated these campaigns. The possibility remains that these overlaps represent intentional\nfalse flag efforts to cloak the identity of these perpetrators while they targeted a critical\nand geo-politically sensitive sector of energy providers in the US. Regardless of the actor’s\nintention, TA410 has established itself as a motivated actor with mature toolsets carrying\nout long term campaigns against highly important and geographically concentrated target\nsets.\n\n**Indicators of Compromise (IOCs)**\n\n**IOC** **IOC**\n**Type**\n\nfaa80e0692ba120e38924ccd46f6be3c25b8edf7cddaa8960fe9ea632dc4a045 SHA256\n\nb7960d1f40b727bbea18a0e5c62bafcb54c9ec73be3e69e787b7ddafd2aae364 SHA256\n\n26eb8a1f0bdde626601d039ea0f2c92a7921152371bafe5e811c6a1831f071ce SHA256\n\ncd8f877c9a1c31179b633fd74bd5050e4d48eda29244230348c6f84878d0c33c SHA256\n\ne4ad5d3213425c58778d8a0244df4cd99c748f58852d8ac71b46326efd5b3220 SHA256\n\n\n589229e2bd93100049909edf9825dce24ff963a0c465d969027db34e2eb878b4\n\n\nSHA256\n\n\n-----\n\n1334c742f2aec7e8412d76ba228b99935a49d\nc96a1e8e1f3446d9f61247ae47e\n\n\nSHA256\n\n\nde30929ef958211f9315e27a7aa45ef061726a76990ddc6b9d9f189b9fbdd45a SHA256\n\n\n0b013ccd9e10d7589994629aed18ffe2388cbd745b5b28ab39c07835295a1\nca9\n\n\nSHA256\n\n\n479954b9e7d5c5f7086a2a1ff1dba99de2eab2e1b1bc75ad8f3b211088eb4ee9 SHA256\n\n\nd5191327a984fab990bfb0e811688e65e9aaa751c3d93\nfa92487e8a95cb2eea8\n\n\nSHA256\n\n\n0701cc7eb1af616294e90cbb35c99fa2b29d2aada9fcbdcdaf578b3fcf9b56c7 SHA256\n\n27f5df1d35744cf283702fce384ce8cfb2f240bae5d725335ca1b90d6128bd40 SHA256\n\n13e761f459c87c921dfb985cbc6489060eb86b4200c4dd99692d6936de8df5ba SHA256\n\n2481fd08abac0bfefe8d8b1fa3beb70f8f9424a1601aa08e195c0c14e1547c27 SHA256\n\n188.131.233[.]27 IP\n\n118.25.97[.]43 IP\n\n34.80.27[.]200 IP\n\n134.209.99[.]169 IP\n\n101.99.74[.]234 IP\n\nAsce[.]email Domain\n\npowersafetrainings[ ]org Domain\n\n\n-----\n\nmails.daveengineer[.]com Domain\n\npowersafetraining[.]net Domain\n\nmails.energysemi[.]com Domain\n\nwww.mails.energysemi[.]com Domain\n\nwww.powersafetraining[.]net Domain\n\nwww.powersafetrainings[.]org Domain\n\nffca.caibi379[.]com Domain\n\nhttp://ffca.caibi379[.]com/rwjh/qtinfo.txt URL\n\nhttps://www.dropbox[.]com:443/s/ddgifm4ityqwx60/Cert.pem?dl=1 URL\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\PrintResponsor\\2 Registry\n\nKey\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\PrintResponsor\\3 Registry\n\nKey\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\PrintResponsor\\4 Registry\n\nKey\n\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\{2DB80286-1784-48b5-A751\nB6ED1F490303}\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\{804423C2-F490-4ac3-BFA5\n13DEDE63A71A}\n\n\nRegistry\n\nKey\n\nRegistry\n\nKey\n\n\n-----\n\nHKEY_LOCAL_MACHINE\\HARDWARE\\{A5124AF5-DF23-49bf-B0ED\nA18ED3DEA027}\n\n\nRegistry\n\nKey\n\n\nG:\\FlowCloud\\trunk\\Dev\\src\\fcClient\\Release\\QQSetupEx_func.pdb File\nPath\n\ng:\\FlowCloud\\trunk\\Dev\\src\\fcClient\\Release\\fcClientDll.pdb File\nPath\n\nF:\\FlowCloud\\trunk\\Dev\\src\\fcClient\\kmspy\\Driver\\Release\\Driver.pdb File\nPath\n\nF:\\FlowCloud\\trunk\\Dev\\src\\fcClient\\kmspy\\Driver\\x64\\Release\\Driver.pdb File\nPath\n\n**ET and ETPRO Suricata/SNORT Signatures**\n\n2837783 ETPRO TROJAN Win32/LookBack CnC Activity\n\n[© 2020. All rights reserved. Terms and conditions Privacy Policy Sitemap](https://www.proofpoint.com/us/license)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.07.08.TA410/TA410.pdf"
    ],
    "report_names": [
        "TA410"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9ffcbb0c-7a0f-419f-a174-f18a02ce47f1",
            "created_at": "2023-01-06T13:46:39.059774Z",
            "updated_at": "2025-03-27T02:00:02.98747Z",
            "deleted_at": null,
            "main_name": "TA410",
            "aliases": [],
            "source_name": "MISPGALAXY:TA410",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1597905592,
    "ts_modification_date": 1597905592,
    "files": {
        "pdf": "https://archive.orkl.eu/4af9052cde27fa68791ba498e8ca4b2d8632933b.pdf",
        "text": "https://archive.orkl.eu/4af9052cde27fa68791ba498e8ca4b2d8632933b.txt",
        "img": "https://archive.orkl.eu/4af9052cde27fa68791ba498e8ca4b2d8632933b.jpg"
    }
}