{
    "id": "d0747d60-b88e-4211-a374-572415ec2288",
    "created_at": "2022-11-18T11:39:52.664101Z",
    "updated_at": "2025-03-27T02:05:56.624834Z",
    "deleted_at": null,
    "sha1_hash": "67b242344e4bf9af9865b57b582757c8cd422049",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-08-24T13:15:43Z",
    "file_modification_date": "2021-08-24T13:15:55Z",
    "file_size": 4160377,
    "plain_text": "# VIRLOCK\n\n## BCSC-MALWARE-VIRLOCK\n\n TLP:WHITE\n\n### www.basquecybersecurity.eus\n\n Agosto 2021\n\n\nTLP: WHITE Pág\n\n\n# VIRLOCK\n\n## BCSC-MALWARE-VIRLOCK\n\n TLP:WHITE\n\n### www.basquecybersecurity.eus\n\n Agosto 2021\n\n\n-----\n\n### TABLA DE CONTENIDO\n\nSobre el BCSC ................................................................................................... 2\n\n1. Resumen ejecutivo ...................................................................................... 3\n\n2. Análisis técnico ............................................................................................... 4\n\n2.1. Flujo de infección ..................................................................................... 4\n\n2.2. Análisis técnico ........................................................................................ 5\n\n2.2. Técnicas MITRE ATT&CK ..................................................................... 13\n\n3. Mitigación ..................................................................................................... 14\n\n3.1. Medidas a nivel de endpoint .................................................................. 14\n\n3.2. Medidas a nivel de red ........................................................................... 14\n\n3.3. Medidas y consideraciones adicionales ................................................. 14\n\n4. Indicadores de compromiso ......................................................................... 15\n\n4.1. Red ........................................................................................................ 15\n\n4.2. Hashes ................................................................................................... 15\n\n4.3. YARA rules ............................................................................................ 15\n\n5. Referencias adicionales ............................................................................... 16\n\nApéndice A: Mapa de técnicas MITRE ATT&CK .............................................. 17\n\n#### Cláusula de exención de responsabilidad\n\nEl presente documento se proporciona con el objeto de divulgar las alertas que\nel BCSC considera necesarias en favor de la seguridad de las organizaciones y\nde la ciudadanía interesada. En ningún caso el BCSC puede ser considerado\nresponsable de posibles daños que, de forma directa o indirecta, de manera\nfortuita o extraordinaria pueda ocasionar el uso de la información revelada, así\ncomo de las tecnologías a las que se haga referencia tanto de la web de BCSC\ncomo de información externa a la que se acceda mediante enlaces a páginas\nwebs externas, a redes sociales, a productos de software o a cualquier otra\ninformación que pueda aparecer en la alerta o en la web de BCSC. En todo caso,\nlos contenidos de la alerta y las contestaciones que pudieran darse a través de\nlos diferentes correos electrónicos son opiniones y recomendaciones acorde a\nlos términos aquí recogidos no pudiendo derivarse efecto jurídico vinculante\nderivado de la información comunicada.\n\n#### Cláusula de prohibición de venta\n\nQueda terminantemente prohibida la venta u obtención de cualquier beneficio\neconómico, sin perjuicio de la posibilidad de copia, distribución, difusión o\ndivulgación del presente documento.\n\n\nVIRLOCK TLP: WHITE Página 1 de 18\n\n\n-----\n\n### SOBRE EL BCSC\n\nEl Centro Vasco de Ciberseguridad (Basque Cybersecurity Centre, BCSC) es la\nentidad designada por el Gobierno Vasco para elevar el nivel de madurez de la\nciberseguridad en Euskadi.\n\nEs una iniciativa transversal que se enmarca en la Agencia Vasca de Desarrollo\nEmpresarial (SPRI), sociedad dependiente del Departamento de Desarrollo\nEconómico, Sostenibilidad y Medio Ambiente del Gobierno Vasco. Así mismo,\ninvolucra a otros tres Departamentos del Gobierno Vasco: el de Seguridad, el de\nGobernanza Pública y Autogobierno, y el de Educación, y a cuatro agentes de la\nRed Vasca de Ciencia, Tecnología e Innovación: Tecnalia, Vicomtech, Ikerlan y\nBCAM.\n\nEl BCSC es la entidad de referencia para el desarrollo de la ciberseguridad y de\nla confianza digital de ciudadanos, empresas e instituciones públicas en Euskadi,\nespecialmente para los sectores estratégicos de la economía de la región.\n\nLa misión del BCSC es por tanto promover y desarrollar la ciberseguridad en la\nsociedad vasca, dinamizar la actividad empresarial de Euskadi y posibilitar la\ncreación de un sector profesional que sea referente. En este contexto se impulsa\nla ejecución de proyectos de colaboración entre actores complementarios en los\námbitos de innovación tecnológica, investigación y transferencia tecnológica a la\nindustria de fabricación avanzada y otros sectores.\n\nAsí mismo, ofrece diferentes servicios en su rol como Equipo de Repuesta a\nIncidentes (en adelante CERT, por sus siglas en inglés “Computer Emergency\nResponse Team”) y trabaja en el ámbito de la Comunidad Autónoma del País\nVasco para aumentar la capacidad de detección y alerta temprana de nuevas\namenazas, la respuesta y análisis de incidentes de seguridad de la información,\ny el diseño de medidas preventivas para atender a las necesidades de la\nsociedad vasca. Con el fin de alcanzar estos objetivos forma parte de diferentes\niniciativas orientadas a la gestión de incidentes de ciberseguridad:\n\n\nVIRLOCK TLP: WHITE Página 2 de 18\n\n\n-----\n\n### 1. RESUMEN EJECUTIVO\n\n_Virlock es una familia de virus informático con capacidades de_ _screenlocker y_\n_ransomware que fue descubierto por primera vez en 2014. El malware posee_\nuna naturaleza polimórfica, lo que quiere decir que cada instancia generada es\ndiferente desde una perspectiva heurística. Una estrategia pensada para evitar\ndetecciones de soluciones antivirus basados en firmas y cuya ejecución genera\ntres instancias de sí mismo, donde cada una es diferente y que, además, llevan\na cabo funcionalidades diferentes, todo con el fin de evadir los sistemas de\ndetección implantados en el equipo.\n\nA diferencia del resto de ransomware, Virlock no solo cifra los ficheros de la\nvíctima, sino que también los convierte en la propia amenaza, incrustando su\ncódigo en cada uno de dichos ficheros de forma que cualquier usuario que abra\nun archivo infectado también se infecte, cifrando así todos los archivos de este\nusuario también.\n\nPor tanto, aunque Virlock puede ser propagado por sus autores, al igual que el\nresto del malware, el verdadero potencial de esta amenaza está en esta\nfuncionalidad de virus y, con el paso de los años se han observado diferentes\nversiones del malware, lo que demuestra también un desarrollo activo por parte\nde sus creadores.\n\nLa forma en que esta amenaza está programada denota un alto nivel de\nconocimiento técnico por parte de sus creadores. Sin embargo, parte de su\nfuncionalidad también parece carecer de lógica e incluso existen algunos errores\nde programación que podrían llevar a considerar a esta amenaza como un\nexperimento malicioso.\n\n\nVIRLOCK TLP: WHITE Página 3 de 18\n\n\n-----\n\n### 2. ANÁLISIS TÉCNICO\n\n#### 2.1. Flujo de infección\n\nDada sus características de virus, Virlock infecta archivos para propagarse y\nconseguir que otros usuarios se infecten en caso de abrir alguno de los ficheros\ninfectados. No obstante, al igual que otras amenazas, este virus también puede\ntratar de ser ejecutado por parte de sus autores, aunque no se conocen métodos\nespecíficos utilizados para ello.\n\n1. La victima ejecuta 2. Se descifra y 3. Creación y\nel malware desde ejecuta el fichero modificación de\nuna memoria externa malicioso claves de registro\no archivo descargado\n\nde internet.\n\n7. Se cifran los 6. Se revisa 4. Tres instancias del\nficheros y se geolocalización para malware se alojan en\nbloquea la pantalla adaptar mensaje de tres localizaciones\n\nsolicitando el pago rescate distintas\n\nUna vez ejecutado, Virlock descifra y abre el fichero original que hubiera\ninfectado, pero paralelamente, infecta la máquina víctima mediante la ejecución\nde tres instancias del propio virus que es copiado a tres localizaciones diferentes\nde forma que, cada una de las copias, se encarga de una tarea diferente en el\nflujo de infección: una se encarga de buscar ficheros a infectar en el equipo, otra\nse encarga de bloquear la pantalla y, la última, establece persistencia en el\nequipo.\n\n\nVIRLOCK TLP: WHITE Página 4 de 18\n\n\n-----\n\n#### 2.2. Análisis técnico\n\nEl análisis está basado en una muestra cuya firma SHA-256 es:\n\n**f4ab5cc881c1438afc149dcbeb8d60c0d9d58c6776616f291f7b4880d440796f**\n\nSe trata de un ejecutable para plataformas Windows de 32 bits con únicamente\ndos secciones y compilado directamente desde código ensamblador con el\ncompilador MASM.\n\nTras iniciar su análisis se ha comprobado que la muestra se encuentra altamente\nofuscada, lo que dificulta la tarea de ingeniería inversa.\n\n2.1.1. Packer y algoritmos metamórfico y polimórfico\n\nEl binario analizado se encuentra altamente ofuscado e incluye diversas técnicas\nde anti-debugging como la comprobación del flag “BeingDebugged” mediante el\nPEB, técnicas que se pueden saltar mediante el uso de plugins como ScyllaHide.\n\nAdemás, tras comparar diferentes muestras de la familia se puede observar que,\naunque el código puede parecer similar, varía en función de la copia gracias a\nsu capacidad metamórfica con la que se generan códigos de operación\ndiferentes pero que terminan realizando las mismas acciones.\n\nVirlock se reconstruye tras cada ejecución y, como se puede observar decora el\nnúcleo de la funcionalidad inicial con llamadas a API aleatorias de módulos\nelegidos al azar. El malware elige un número aleatorio de bibliotecas que\nimportará el fichero resultante para la infección futura, y de esas bibliotecas,\nalgunas API aleatorias dentro de cada una de ellas se eligen como\nimportaciones.\n\n\nVIRLOCK TLP: WHITE Página 5 de 18\n\n\n-----\n\nCuando el binario de Virlock es cargado en memoria, la única sección de código\nno cifrada es la que puede apreciarse en el desensamblado de IDA. El resto del\ncódigo, datos y, el archivo original (en caso de que se trate de un fichero\ninfectado) se encuentran cifrados.\n\nTras reservar memoria de forma dinámica, el binario transfiere la ejecución a una\nfunción encargada de descifrar y cargar una shellcode que es la responsable de\ndescifrar el resto del binario. Esta rutina de descifrado de la shellcode utiliza un\nbucle XOR tras lo que realiza un salto a dicha sección de memoria para continuar\ncon la ejecución.\n\nEsta shellcode se encarga de ir descifrando diferentes códigos de instrucciones\n(opcodes) que son inyectados de forma dinámica.\n\n\nVIRLOCK TLP: WHITE Página 6 de 18\n\n\n-----\n\nCuantas más secciones del código de Virlock se ejecuten con su serie continua\nde patrones de descifrado y cifrado, más diferente se verá el malware en la\nmemoria con respecto a la copia cifrada original antes de que se comenzara a\n\nVIRLOCK TLP: WHITE Página 7 de 18\n\n\nLos opcodes son inyectados entre los offsets 0x1032 y 0x103B de la shellcode\nque cambian con cada llamada a la función\n\nTras realizar este proceso, se transfiere la ejecución de vuelta al binario. La\nmayoría de malware utiliza un algoritmo de descifrado simple para descifrar el\ncódigo de malware en memoria, lo que da a los investigadores la oportunidad de\nleer y analizar el código de malware completo una vez es desempaquetado y,\naunque se utilicen claves de cifrado diferentes se seguirá generando el mismo\ncódigo descifrado al completo en memoria.\n\nSin embargo, en este caso, tanto el código del malware, como el fichero original\ncontinúan cifrados. El cuerpo de cada una de las funciones que ejecuta Virlock\ncontiene un pequeño código de cifrado y de descifrado al principio y final de la\nfunción. De esta forma, Virlock solo descifra el código que necesita en un\nmomento dado y luego lo vuelve a cifrar y, para complicar aún más las cosas,\nutiliza una clave diferente cuando lo vuelve a cifrar en la memoria.\n\nEsto significa que los investigadores no pueden extraer todo el malware de una\nvez para poder analizarlo en un desensamblador. No es posible volcar una copia\ncompletamente descifrada del malware a disco porque solo se descifra un bloque\nde código en un momento dado. Por tanto, se complica enormemente la tarea\nde analizar la funcionalidad de este malware.\n\nCuantas más secciones del código de Virlock se ejecuten con su serie continua\nde patrones de descifrado y cifrado, más diferente se verá el malware en la\nmemoria con respecto a la copia cifrada original antes de que se comenzara a\n\n\n-----\n\nejecutar. De esta forma, generar una copia diferente de sí mismo consiste en\ncopiar el contenido de la memoria una vez ejecutado el malware en un archivo.\nPara conseguir generar claves de forma aleatoria, el malware utiliza la\ninstrucción “RDTSC”.\n\n2.1.2. Modificación de claves de registro\n\nVirlock utiliza la herramienta interna de Windows “reg.exe” para modificar\ndiferentes claves de registro que le permitan pasar desapercibido al usuario en\nel sistema y continuar su ejecución.\n\nEn concreto, las acciones que realiza y claves del registro que accede son las\nsiguientes:\n\n          - No mostrar archivos ocultos:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Expl\norer\\Advanced\\Hidden\n\n          - Ocultar extensions de fichero:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Expl\norer\\Advanced\\HideFileExt\n\n         - Desactivar UAC:\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Poli\ncies\\System\\EnableLUA\n\n\nVIRLOCK TLP: WHITE Página 8 de 18\n\n\n-----\n\n2.1.3. Ejecución por instancias\n\nComo se ha comentado, el malware escribe al menos, tres instancias diferentes\ndel virus para llevar a cabo su ejecución. Cada una de estas instancias, pese a\ncontener la misma funcionalidad en su totalidad, reconoce de forma interna que\ndebe realizar una u otra. La primera y segunda copia se realizan en rutas\naleatorias dentro de la carpeta %AllUserProfile%. La tercera copia, al igual que\nlas dos anteriores, genera una ruta aleatoria, pero dentro de la carpeta\n%UserProfile% esta vez.\n\nLa primera instancia es la encargada de escanear el equipo e infectar los ficheros\nobjetivo, la segunda se encarga de establecer persistencia en el equipo y la\ntercera lanza la pantalla de bloqueo con la nota de rescate.\n\n\nVIRLOCK TLP: WHITE Página 9 de 18\n\n\n-----\n\n2.1.3. Persistencia\n\nVirlock modifica el registro del equipo y establece un valor para una de las\ninstancias de sí mismo con nombres aleatorios en la clave de registro\n\"CurrentVersion\\Run\", lo cual hace que se ejecute cada vez que un usuario inicia\nsesión.\n\nPara otra de las instancias, Virlock hace uso de la clave userinit de\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon para\nestablecer persistencia.\n\nPor último, para la otra instancia, crea un servicio con un nombre aleatorio.\n\n2.1.4. Infección de ficheros\n\nDespués de copiar las tres instancias de sí mismo, la primera de ellas es iniciada\nmediante CreateProcess y se encarga de buscar tipos de archivos específicos\npara infectar. Una vez que se ha identificado el archivo de destino, el malware\ncifra el archivo y luego lo reemplaza con una copia del código del propio virus\ncon el contenido del archivo original cifrado adjunto.\n\nVirlock contiene una serie de extensiones que el virus busca para infectar, entre\nlas que se incluyen las siguientes:\n\n**.exe, .doc, .xls, .pdf, .ppt, .mdb, .zip, .rar, .mp3, .mpg, .wma, .png, .gif,**\n**.bmp, .jpg, .jpeg, .psd, .p12, .cer, .crt, .p7b, .pfx, .pem.**\n\nTras infectar un fichero, el malware le añade la extensión .exe al final, pero\ngracias a la modificación del registro donde oculta la extensión del fichero y la\nsustitución del logo del binario por el correspondiente al tipo de fichero original,\nen el caso de ficheros que no sean del tipo “.exe” (para los que se mantiene el\nicono legítimo), permite pasar oculto ante los ojos del usuario.\n\n\nVIRLOCK TLP: WHITE Página 10 de 18\n\n\n-----\n\nA diferencia de otros ransomware que se basan en la combinación de cifrado\nsimétrico y asimétrico para proteger los ficheros de ser descifrados sin la\nintervención de los creadores del malware, Virlock únicamente realiza un cifrado\nsimétrico de los ficheros basado en operaciones XOR y ROL, por lo que es\nposible restaurar los ficheros revirtiendo el algoritmo. La compañía de seguridad\nESET ha creado para ello un descifrador que puede descargarse desde\n[https://descargas.eset.es/virlock-cleaner.](https://descargas.eset.es/virlock-cleaner)\n\n2.1.5. Bloqueo de pantalla y nota de rescate\n\nMientras se ejecuta la rutina de cifrado de ficheros, otra instancia aguarda para,\nuna vez finalice el proceso, bloquear la pantalla de la máquina víctima. Antes de\nhacerlo, Virlock termina el proceso explorer.exe y el administrador de tareas, si\nse estuviera ejecutando. Además, mediante la clave de registro\nHKEY_CURRENT_USER\\Control Panel\\International\\Geo comprueba la\ngeolocalización del usuario para adaptar el mensaje a mostrar, tras lo cual se\nlanza la ventana de bloqueo.\n\n\nVIRLOCK TLP: WHITE Página 11 de 18\n\n\n-----\n\nEl código de transferencia que el programa espera que se introduzca en el\ncampo “Transfer ID” es una cadena de tamaño 64 caracteres. Se ha comprobado\nque, cualquier cadena de este tamaño introducida en el cuadro de texto será\naceptada como válida por el malware, cerrando así la ventana y permitiendo\nvolver a utilizar el sistema. El único requisito, es que el ordenador disponga de\nconexión a internet, la cual comprueba mediante el estado de las interfaces de\nred y una petición posterior al dominio “api.bitcoincharts.com”.\n\nUna vez hecho esto, si se presiona el botón \"PAY FINE\" desaparecerá la pantalla\nde bloqueo y VirLock creerá ahora que se ha pagado el rescate. Debido a esto,\ncualquiera de los archivos infectados, al hacer doble clic en ellos para abrirlos,\nya no iniciará la ventana de bloqueo, sino que extraerá el archivo original\ncontenido dentro de él, restaurándolo así en la ruta donde se encuentre.\n\n\nVIRLOCK TLP: WHITE Página 12 de 18\n\n\n-----\n\n|Initial Access|T1091|Replication Through Removable Media|\n|---|---|---|\n|Execution|T1106|Native API|\n||T1569|System Services|\n||T1204|User Execution|\n|Persistence|T1547|Boot or Logon Autostart Execution|\n||T1554|Compromise Client Software Binary|\n||T1543|Create or Modify System Process|\n|Privilege Escalation|T1547|Boot or Logon Autostart Execution|\n||T1543|Create or Modify System Process|\n|Defense Evasion|T1222|File and Directory Permissions Modification|\n||T1564|Hide Artifacts|\n|Discovery|T1083|File and Directory Discovery|\n||T1012|Query Registry|\n||T1614|System Location Discovery|\n||T1016|System Network Configuration Discovery|\n|Lateral Movement|T1091|Replication Through Removable Media|\n|Command and Control|T1001|Data Obfuscation|\n|Impact|T1486|Data Encrypted for Impact|\n\n\n#### 2.2. Técnicas MITRE ATT&CK\n\n##### Initial Access T1091 Replication Through Removable Media\n\n T1106 Native API\n\n Execution T1569 System Services\n\n T1204 User Execution\n\n T1547 Boot or Logon Autostart Execution\n\n Persistence T1554 Compromise Client Software Binary\n\n T1543 Create or Modify System Process\n\n T1547 Boot or Logon Autostart Execution\n Privilege Escalation\n T1543 Create or Modify System Process\n\n T1222 File and Directory Permissions Modification\n Defense\n Evasion\n T1564 Hide Artifacts\n\n T1083 File and Directory Discovery\n\n T1012 Query Registry\n Discovery\n T1614 System Location Discovery\n\n T1016 System Network Configuration Discovery\n\n Lateral T1091 Replication Through Removable Media Movement\n\n Command and T1001 Data Obfuscation Control\n\n Impact T1486 Data Encrypted for Impact\n\nEn el Apéndice A se puede consultar el mapa de tácticas y técnicas utilizadas\npor Virlock.\n\n\nVIRLOCK TLP: WHITE Página 13 de 18\n\n\n-----\n\n### 3. MITIGACIÓN\n\n#### 3.1. Medidas a nivel de endpoint\n\nLa medida principal consiste en tener el sistema actualizado y utilizar un\nprograma antimalware.\n\nEl código de Virlock no está firmado, por lo que implementar una política que no\npermita la ejecución de binarios que no estén firmados podría prevenir la\nejecución de este _ransomware y de otro tipo de malware. No obstante, gran_\ncantidad de desarrolladores y paquetes de software no distribuyen sus productos\nfirmados, por lo que esta estrategia podría no resultar práctica en algunos casos.\n\nEn concordancia con lo anterior, pero empleando mecanismos más generales,\nse recomienda que las organizaciones prohíban o, al menos, monitoricen la\nejecución de binarios no conocidos previamente dentro de ella o aquellos no\nprovenientes de fuentes confiables. Aunque imperfecto, por la forma en la que\nse crea y distribuye el software legítimo, esta medida puede servir como una\nalarma inicial para impulsar una mayor investigación y, posiblemente, limitar su\npropagación.\n\n#### 3.2. Medidas a nivel de red\n\nSi se dispone de mecanismos para inspeccionar el tráfico que ocurre dentro de\nla red, se debería identificar la transferencia de binarios desconocidos.\n\nPor otro lado, es altamente recomendable mantener una segmentación\nadecuada de la red para evitar desplazamientos laterales y que finalmente se\nalcancen los sistemas críticos de la organización.\n\nEn adición y conociendo el comportamiento de esta familia de ransomware, se\npodría analizar el tráfico interno y generar reglas que comprueben las conexiones\na recursos de un servidor y las conexiones a recursos de red, de forma que, si\nprovienen de algún proceso no reconocido, se pueda parar lo antes posible o\ndetectar al menos la intrusión.\n\n#### 3.3. Medidas y consideraciones adicionales\n\nEn caso de incidente con este malware, se debe de reportar a las autoridades\ncompetentes lo más rápido posible.\n\nA diferencia de otros ransomware donde la ejecución de la amenaza viene de\nforma posterior a un proceso de descubrimiento e intrusión en la red de la\nempresa, en el caso de Virlock una organización puede verse simplemente\nafectada mediante la ejecución de un fichero infectado por parte de alguno de\nsus empleados desde una memoria externa o archivo descargado de internet.\n\n\nVIRLOCK TLP: WHITE Página 14 de 18\n\n\n-----\n\n### 4. INDICADORES DE COMPROMISO\n\nLos indicadores de compromiso y reglas de detección también están disponibles\npara su consulta y descarga en el repositorio público del Basque Cybersecurity\nCentre:\n\n[https://github.com/basquecscentre/technical-reports](https://github.com/basquecscentre/technical-reports)\n\n#### 4.1. Red\n\n**Web consultada por el screenlocker:**\nhxxp://api.bitcoincharts.com/v1/weighted_prices.json\n\n#### 4.2. Hashes\n\n4.2.1. SHA256:\n\nf4ab5cc881c1438afc149dcbeb8d60c0d9d58c6776616f291f7b4880d440796f\n\n#### 4.3. YARA rules\n\nEsta regla sirve para identificar algunas de las muestras generadas durante el\nanálisis. Sin embargo, dada la naturaleza polimórfica del virus, es muy\ncomplicado generar una regla genérica que pueda detectar cualquier muestra de\neste malware.\n```\n            rule Virlock {\n              strings:\n               $op0 = { 6a 40 68 00 10 00 00 68 00 }\n               $op1 = { e9 00 00 00 00 81 ec }\n               $op2 = { 03 00 00 be }\n               $s1 = \"kernel32.dll\" ascii\n               $s2 = \"user32.dll\" ascii\n               $s3 = \"!This program cannot be run in DOS mode.\"\n              condition:\n               uint16(0) == 0x5a4d and filesize < 6000KB and all of ($s*) and\n               all of ($op*)\n            }\n\n```\n\nVIRLOCK TLP: WHITE Página 15 de 18\n\n\n-----\n\n### 5. REFERENCIAS ADICIONALES\n\n          - [https://blogs.blackberry.com/en/2019/07/threat-spotlight-virlock-](https://blogs.blackberry.com/en/2019/07/threat-spotlight-virlock-polymorphic-ransomware)\n\n[polymorphic-ransomware](https://blogs.blackberry.com/en/2019/07/threat-spotlight-virlock-polymorphic-ransomware)\n\n          - [https://www.welivesecurity.com/2014/12/22/win32virlock-first-self-](https://www.welivesecurity.com/2014/12/22/win32virlock-first-self-reproducing-ransomware-also-shape-shifter/)\n\n[reproducing-ransomware-also-shape-shifter/](https://www.welivesecurity.com/2014/12/22/win32virlock-first-self-reproducing-ransomware-also-shape-shifter/)\n\n          - [https://www.knowbe4.com/virlock-ransomware](https://www.knowbe4.com/virlock-ransomware)\n\n          - [https://www.virusradar.com/en/Win32_Virlock/detail](https://www.virusradar.com/en/Win32_Virlock/detail)\n\n          - [https://blog.trendmicro.com/trendlabs-security-intelligence/virlock-](https://blog.trendmicro.com/trendlabs-security-intelligence/virlock-combines-file-infection-and-ransomware/)\n\n[combines-file-infection-and-ransomware/](https://blog.trendmicro.com/trendlabs-security-intelligence/virlock-combines-file-infection-and-ransomware/)\n\n          - [https://www.virusbulletin.com/virusbulletin/2016/12/vb2015-paper-its-file-](https://www.virusbulletin.com/virusbulletin/2016/12/vb2015-paper-its-file-infector-its-ransomware-its-virlock/)\n\n[infector-its-ransomware-its-virlock/](https://www.virusbulletin.com/virusbulletin/2016/12/vb2015-paper-its-file-infector-its-ransomware-its-virlock/)\n\n          - [https://www.linkedin.com/pulse/weird-ransomware-strain-spreads-like-](https://www.linkedin.com/pulse/weird-ransomware-strain-spreads-like-virus-cloud-stu-sjouwerman/)\n\n[virus-cloud-stu-sjouwerman/](https://www.linkedin.com/pulse/weird-ransomware-strain-spreads-like-virus-cloud-stu-sjouwerman/)\n\n          - [https://blog.malwarebytes.com/threat-analysis/2017/01/virlockers-](https://blog.malwarebytes.com/threat-analysis/2017/01/virlockers-comeback-including-recovery-instructions/)\n\n[comeback-including-recovery-instructions/](https://blog.malwarebytes.com/threat-analysis/2017/01/virlockers-comeback-including-recovery-instructions/)\n\n          - [https://www.fortinet.com/blog/threat-research/real-time-polymorphic-](https://www.fortinet.com/blog/threat-research/real-time-polymorphic-code-in-ransomware)\n\n[code-in-ransomware](https://www.fortinet.com/blog/threat-research/real-time-polymorphic-code-in-ransomware)\n\n          - https://insomnihack.ch/wp\n[content/uploads/2017/04/RA_metamorphic_malware.pdf](https://insomnihack.ch/wp-content/uploads/2017/04/RA_metamorphic_malware.pdf)\n\n\nVIRLOCK TLP: WHITE Página 16 de 18\n\n\n-----\n\n### APÉNDICE A: MAPA DE TÉCNICAS MITRE ATT&CK\n\nBABUK TLP: WHITE Página 9 de 18\n\n\n-----\n\n### Reportar incidente Catálogo de ciberseguridad\n\nSi has detectado algún incidente de ¿Necesitas ayuda con tu ciberseguridad\nciberseguridad, avísanos para que tomemos o la de tu empresa?\nlas medidas oportunas para evitar su\npropagación.\n\n900 104 891\n\nincidencias@bcsc.eus\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ciberseguridad.eus/sites/default/files/2022-04/bcsc-malware-virlock-tlpwhite_v1242.pdf"
    ],
    "report_names": [
        "bcsc-malware-virlock-tlpwhite_v1242.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1668771592,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1629810943,
    "ts_modification_date": 1629810955,
    "files": {
        "pdf": "https://archive.orkl.eu/67b242344e4bf9af9865b57b582757c8cd422049.pdf",
        "text": "https://archive.orkl.eu/67b242344e4bf9af9865b57b582757c8cd422049.txt",
        "img": "https://archive.orkl.eu/67b242344e4bf9af9865b57b582757c8cd422049.jpg"
    }
}