{
    "id": "d07eafce-a0b3-4f92-9590-a17cf4812e5a",
    "created_at": "2022-10-25T16:48:15.263619Z",
    "updated_at": "2025-03-27T02:10:53.337349Z",
    "deleted_at": null,
    "sha1_hash": "c848df52070b8baac8ccb65d4a223c2370e75469",
    "title": "Study of an APT attack on a telecommunications company in Kazakhstan",
    "authors": "DrWeb",
    "file_creation_date": "2022-03-23T13:18:22Z",
    "file_modification_date": "2022-03-23T13:18:22Z",
    "file_size": 3902287,
    "plain_text": "# Study of an APT attack on a telecommunications company in Kazakhstan\n\n\n-----\n\n**© Doctor Web, Ltd., 2022. All rights reserved.**\n\nThis document is the property of Doctor Web, Ltd. (hereinafter - Doctor Web). No part of this\ndocument may be reproduced, published or transmitted in any form or by any means for any\npurpose without proper attribution.\n\nDoctor Web develops and distributes Dr.Web information security solutions which provide\nefficient protection from malicious software and spam.\n\nDoctor Web customers can be found among home users from all over the world and in\ngovernment enterprises, small companies and nationwide corporations.\n\nDr.Web antivirus solutions are well known since 1992 for continuing excellence in malware\ndetection and compliance with international information security standards. State certificates and\nawards received by the Dr.Web solutions, as well as the globally widespread use of our products\nare the best evidence of exceptional trust to the company products.\n\n**Study of an APT attack on a telecommunications company in Kazakhstan**\n**3/23/2022**\n\nDoctor Web Head Office\n2-12A, 3rd str. Yamskogo polya\nMoscow, Russia\n125040\n\nWebsite: www.drweb.com\nPhone: +7 (495) 789-45-87\n\nRefer to the official website for regional and international office information.\n\n\n-----\n\n## Table of Contents\n\n###### Introduction 4\n\n Remote Rover 5\n\n Conclusion 7\n\n Operating Routine of Discovered Malware Samples 8\n\n**BackDoor.PlugX.93** **8**\n\n**BackDoor.Siggen2.3622** **18**\n\n**BackDoor.Whitebird.30** **21**\n\n**Trojan.DownLoader43.44599** **27**\n\n**Trojan.Loader.891** **37**\n\n**Trojan.Loader.896** **45**\n\n**Trojan.Uacbypass.21** **54**\n\n###### Appendix. Indicators of Compromise 59\n\n\n-----\n\n### Introduction\n\nIn October 2021, one of Kazakhstan’s telecommunication companies contacted Doctor Web,\nwith suspicion of malware in the corporate network. During the first look, we found backdoors\nthat were previously only used in targeted attacks. During the investigation, we also found out\nthat the company’s internal servers had been compromised since 2019. For several years,\nBackdoor.PlugX.93 and BackDoor.Whitebird.30, the Fast Reverse Proxy (FRP) utilities, and\nRemCom have been the main attackers' tools.\n\nBecause of the hackers' mistake, we got a unique opportunity to study the lists of victims and\nfind out what backdoor management tools were used. Based on the acquired information, we\nconcluded that the hacker group specialized in compromising the Asian companies’ mail servers\nwith Microsoft Exchange software installed. That said, we also found victims from other\ncountries, including:\n\n - Egyptian government agency\n\n  - Italian airport\n\n - USA marketing company\n\n - Canadian transport and woodworking companies\n\nThe logs collected along with the command and control server included victims infected from\nAugust 2021 to early November of the same year. Yet, in some cases, BackDoor.Whitebird.30\nwas installed not only on the server running Microsoft Exchange, but on domain controllers, too.\n\nBased on the tools, methods, and infrastructure used, we conclude that the Calypso APT hacker\ngroup is behind the attack.\n\n\n-----\n\n### Remote Rover\n\n\nCommand and control server for BackDoor.Whitebird.30 calls Remote Rover. It allows hackers\nto remotely launch applications, update the backdoor configuration, download and upload files.\nBesides that, you can use a command shell via Remote Rover. This is what the control server\ninterface looks like:\n\nRemote Rover came with a configuration file CFG\\default.ini with the following content:\n```\n E:\\  \\   \\2021\\RR\\  \\telecom.cfg\n OneClock.exe\n\n```\nIf you translate the content from Chinese into English, you can get this path:\n```\n E:\\personal use\\Independent research and development\n remote\\2021\\RR\\Configuration backup\\telecom.cfg\n\n```\nFor a detailed description of the malware used and how it works, see the Dr.Web Virus Library.\n\n - BackDoor.Siggen2.3622\n\n - BackDoor.PlugX.93\n\n - BackDoor.Whitebird.30\n\n - Trojan.Loader.891\n\n\n-----\n\n- Trojan.Loader.896\n\n- Trojan.Uacbypass.21\n\n- Trojan.DownLoader43.44599\n\n\n-----\n\n### Conclusion\n\nDuring the investigation of the targeted attack, Doctor Web virus analysts found and described\nseveral backdoors and trojans. It’s worth noting that the attackers managed to remain\nundetected for as long as other targeted attack incidents. A hacker group compromised a\ntelecommunications company's network more than two years ago.\n\nDoctor Web specialists recommend regularly checking network resources’ efficiency and timely\nfixing failures that may indicate the presence of malware on the network. Data compromise is\none of targeted attacks’ main dangers, but the long-term presence of intruders is also a cause\nfor concern. Such development allows them to control the organization’s work for many years\nand gain access to especially sensitive information at the proper time. If you suspect malicious\nactivity in the corporate network, the best option is to contact the Doctor Web virus laboratory\nfor qualified help. Dr.Web FixIt! helps you detect malware on servers and workstations. Taking\nadequate measures timely will minimize the damage and prevent the serious consequences of\ntargeted attacks.\n\n\n-----\n\n### Operating Routine of Discovered Malware Samples\n\n\n#### BackDoor.PlugX.93\n\n**Added to the Dr.Web virus database: 2021-10-22**\n\n**Virus description added: 2021-10-30**\n\n**Packer: absent**\n\n**Compilation date: 2020-08-13**\n\n**SHA1 hash: a8bff99e1ea76d3de660ffdbd78ad04f81a8c659**\n\n##### Description\n\nThe PlugX backdoor module is written in C. It’s designed to decrypt the shellcode from the\nregistry that loads the main backdoor into memory.\n\n##### Operating principle\n\nFirst, the backdoor receives the address of the VirtualProtect() function by hash. It then\nuses this address to change access rights to PAGE_EXECUTE_READWRITE, starting from the\nfunction at 0x10001000 and ending with the entire .text section:\n\nGetting the function’s address by the hash passed as a parameter:\n\n\n-----\n\nScript to get a function by hash:\n\n\n-----\n\nChanging the permissions to PAGE_EXECUTE_READWRITE was necessary to decrypt the code\nusing the XOR operation:\n\n\n-----\n\nOne version of the backdoor has dynamic XOR encryption. It has decryption at the beginning of\nthe function:\n\nAnd with encryption at the end of the function:\n\n\n-----\n\nFacilitating the script’s work for IDAPython:\n```\n import idaapi\n def xor_dec(address, count, key):\n   for i in xrange(count):\n     idaapi.patch_dword(address, idaapi.get_dword(address) ^ key) \n     key += idaapi.get_dword(address)\n     address += 4\n\n```\nBefore performing malicious actions, the backdoor, as in the case of VirtualProtect(),\nreceives functions’ addresses that it needs to work\n\n\n-----\n\nReceived features:\n\n|Function name|Hash|\n|---|---|\n|CloseHandle|0x528796C6|\n|CreateFileA|0x4FDAF6DA|\n|DeleteFileA|0x13DD2ED7|\n|ExitProcess|0x56A2B5F0|\n|GetAdaptersInfo|0x62C9E1BD|\n|GetModuleFileNameA|0xFE61445D|\n|GetSystemDirectoryA|0x60BCDE05|\n|LoadLibraryA|0x726774C|\n|ReadFile|0xBB5F9EAD|\n\n\n-----\n\n|Function name|Hash|\n|---|---|\n|RegCloseKey|0x81C2AC44|\n|RegDeleteValueA|0x3846A3A8|\n|RegEnumValueA|0x2EC95AA4|\n|RegOpenKeyExA|0x3E9E3F88|\n|RegQueryValueExA|0x8FF0E305|\n|VirtualAlloc|0xE553A458|\n|VirtualFree|0x300F2F0B|\n|VirtualProtect|0xC38AE110|\n|WinExec|0x876F8B31|\n|WriteFile|0x5BAE572D|\n\n\nIn addition, the backdoor checks if it is executed in a sandbox:\n\n\n-----\n\nAfter receiving the function addresses and checking for execution in the sandbox,\nBackDoor.PlugX.93 removes the updatecfgSetup task from the task scheduler:\n\nThe key for shellcode encryption is MD5 from the following registry key values:\n\n\n-----\n\nThe shellcode is stored in the following registry keys:\n\n\n-----\n\nBefore running the shellcode, it’ll be decrypted in 2 steps: first, using the RC4 algorithm:\n\nthen, with XOR:\n\n\n-----\n\n#### BackDoor.Siggen2.3622\n\n**Added to the Dr.Web virus database: 2021-11-03**\n\n**Virus description added: 2021-xx-xx**\n\n**Packer: UPX**\n\n**SHA1 hash: be4d8344669f73e9620b9060fd87bc519a05617a**\n\n##### Description\n\nA backdoor written in Go. It’s packed by UPX. Investigated backdoor version V2.5.5 z 2021.7.19.\n\n##### Operating principle\n\nIn the beginning, the malicious code checks if another backdoor copy is running. The trojan\nchecks for the c:\\windows\\inf\\mdmslbv.inf file. If it exists, the trojan starts reading. You\ncan use the following script to decrypt:\n```\n import sys\n with open(sys.argv[1], 'rb') as f:\n   d = f.read()\n s = bytearray()\n for i in range(len(d)):\n   s.append(d[i])\n for i in range(len(s)-2, 0, -1):\n   s[i] = (((s[i + 1] * s[i + 1]) ^ s[i]) & 0xff)\n with open(sys.argv[1] + '.dec', 'wb') as f:\n   f.write(s)\n\n```\nEncrypted file’s length\n\nThe packet’s structure:\n\n\n-----\n\n - random string from 10 to 19 characters long\n\n - between the <a>...</a> tags contains the backdoor process’s PID\n\n - between the <b>...</b> tags is the process’s name\n\n - random string from 10 to 19 characters long\n\nThe trojan checks for the existence of a process with the specified parameters. If it finds it, the\ntrojan terminates its work.\n\nIf it doesn’t find a process with the specified parameters or the mdmslbv.inf file itself, the\ntrojan generates data as shown above. Then, it encrypts and writes to the c:\n```\n\\windows\\inf\\mdmslbv.inf.\n\n```\nCommunication with the command and control server\n\nThe trojan has command and control server: blog[.]globnewsline[.]com.\n\nThe trojan sends a GET request to the following URL:\n```\nhxxps://blog.globnewsline.com:443/db/db.asp using User-Agent \"Mozilla/5.0 (X11;\n\n```\nWindows x86_64; rv:70.0) Gecko/20100101 Firefox/70.0\". If the server response contains the\nsubstring Website under construction, then the trojan considers that the control server is\navailable. If the server is unavailable, the malicious code checks for the presence of a proxy\nconfiguration file c:\\windows\\inf\\bksotw.inf. If that’s present, the trojan reads the\nparameters written in the file.\n\nThe backdoor uses MAC addresses as the network interface bot ID. For heartbeat requests, the\nfollowing POST requests are used:\n```\n https://blog.globnewsline.com:443/db/db.asp?m=w&n=~A<macaddr>.t\n\n```\nwhere <macaddr> is the MAC address string, converted to uppercase with colons removed.\n\nNext, a GET request is sent to get a list of commands:\n```\n https://blog.globnewsline.com:443/db/A<macaddr>.c\n\n```\nThe server response is encrypted in the same way as the file with the backdoor process’s PID.\n\nThe following commands can be executed:\n\n - up\n\n - down\n\n - bg\n\n - bgd\n\n - getinfo\n\n\n-----\n\nThe command’s result is encrypted the same way as the command itself was encrypted. Then, it’s\nsent in the POST request’s body to the following URL:\n\n\n-----\n\n#### BackDoor.Whitebird.30\n\n**Added to the Dr.Web virus database: 2021-10-21**\n\n**Virus description added: 2021-xx-xx**\n\n**Packer: absent**\n\n**Compilation date: 2021-29-03**\n\n**SHA1 hash: abfd737b14413a7c6a21c8757aeb6e151701626a**\n\n##### Description\n\nA multi-functional backdoor trojan for 64-bit and 32-bit Microsoft Windows operating system\nfamily. It’s designed to establish an encrypted connection with the command and control server\nand unauthorized control of an infected computer. It has a file manager and Remote Shell’s\nfunctions.\n\n##### Preparing procedures\n\nAt the beginning of the work, the backdoor decrypts the overlay provided by the shellcode. The\nfirst encryption layer is removed by the following algorithm:\n```\n k = 0x37\n s = bytearray()\n for i in range(len(d)):\n   c = d[i] ^ k\n   s.append(c)\n   k = (k + c) & 0xff\n\n```\nThe second layer is the XOR operation with the key 0xCC.\n\nThis overlay contains:\n\n  - configuration of trojan\n\n - module for bypassing UAC\n\nConfiguration looks as follows:\n\n\n-----\n\nThe flags field displays which autoload methods the trojan should use, and what launch\nfeatures are:\n\n\n-----\n\nIf the launch is specified via the task scheduler (INSTALL_AS_MSTASK), then the configuration\n```\nflags creates a mutex after decrypting. That prevents restart:\n\n```\nNext, it checks if the trojan has enough rights to launch in the way that was previously specified\nin the configuration. If not, it restarts itself to bypass UAC.\n\nTrojan checks for the presence of a file in the path\n```\nC:Users\\Public\\Downloads\\clockinstall.tmp, and if it exists, it deletes\nclockinstall.tmp.\n\n```\nIf the clockinstall.tmp file is missing, it checks if the install file exists in the folder from\nwhich the trojan was launched. If it exists, it removes it.\n\nThen, it installs itself into the system in accordance with the type specified in the configuration.\nThe backdoor will also try to hide its activity from the user.\n\nIf the trojan runs on a 32-bit OS, then the same mechanism for hiding a service from running\n[ones is valid, as in BackDoor.PlugX.28, deleting that structure from the list of](https://vms.drweb.ru/virus/?i=21507745)\n```\nServiceDatabase structures. That corresponds to the trojan service.\n\n```\nIf the configuration specifies that the trojan should be injected into a process, then it’ll be\ninjected into the target process. If the RUN_AS_USER flag is specified in the configuration, then\nthe trojan will wait until at least one authorized user appears. After that, it’ll create its own\nprocess, but on behalf of the user.\n\n\n-----\n\nRegardless of the trojan's autorun type, only one process can communicate with the command\nand control server. This creates a mutex:\n\nBefore attempting to establish a connection with the command and control server, trojan\ndetermines the proxy server settings. For this purpose:\n\n - The presence of the <process_name>.ini file in the folder from which the trojan process\nwas launched is checked. Example of the configuration:\n```\n [AntiVir]\n Cloud=0A0804D2242000000000000000000000000000000000000000000000000000000000\n 0000000000000000000000000000299CC1003C9CC10098F11900DCF1190062F21900000000\n 00E02AC300CC004501D8F11900000000000000000000000000000000000000000000000000\n 00000000000000000000000000000000000000000000000000000000000001\n\n```\n - Reads a file named <loader_name>.tmp in the trojan folder, where <loader_name> is\nthe value from the configuration\n\n - Reads proxy settings from registry\n```\n  [HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings,\n\n```\nkeys ProxyEnable and ProxyServer\n\n - Reads proxy settings from Mozilla Firefox settings - %APPDATA%\n```\n  \\Mozilla\\Firefox\\<profile>\\prefs.js\n\n```\n - Checks for stored login:password from the proxy server in Mozilla Firefox and Internet\nExplorer\n\n##### Control server protocol\n\nEstablishing a connection to the server mimics the creation of a TLS1.0 connection between the\nclient and the server. Trojan body contains two buffers:\n\n1. Contains the TLS1.0 Client Hello package:\n\n2. Contains TLS 1.0 Client Key Exchange packets with key length 0x100 bytes, Change Cipher\nSpec, Client Handshake Finished:\n\n\n-----\n\nWhen sending a Client Hello packet, the trojan encrypts all bytes of the Client Random field,\nstarting from the 4th one, using the XOR method with random bytes. It also records the current\ntime in the first 4. The server's response to this message is accepted, but the data is ignored.\n\nWhen sending the second packet, the backdoor also encrypts the Client Key Exchange packet’s\npublic key field using the XOR method with random bytes, and writes its 28-byte key into the\ndata of the Client Handshake Finished packet. That’ll be used to encrypt and decrypt packets\nsent or received from the server. The backdoor encrypts the last 4 bytes of the Client Handshake\nFinished packet with random bytes. Then, it sends it to the command and control server. In\nresponse, the server sends its own key. That key is used to initialize the key shared with the client.\n\nAfter that, the backdoor enters the command processing cycle from the control server. The\ntraffic between the client and the server is encrypted using the RC4 algorithm.\n\nThe list of commands:\n\n|opcode|Command|\n|---|---|\n|0x01|Gathering information regarding the infected device|\n|0x02|Remote shell|\n|0x03|File manager (see below for commands ending in 3)|\n|0x100|Keep-Alive|\n|0x103|Open file for writing|\n\n\n-----\n\n|0x203|Download a file|\n|---|---|\n|0x303|Data to be written|\n|0x400|Reconnect to server|\n|0x403|Obtain information about disk or directory listing;|\n|0x500|To finish work|\n|0x503|Move a file|\n|0x600|Delete proxy configuration ini file|\n|0x603|Delete a file|\n|0x703|Run a process|\n|0x700|Execute a command during ShellExecute|\n|0x800|Renew configuration|\n\n\n-----\n\n#### Trojan.DownLoader43.44599\n\n**Added to the Dr.Web virus database: 2021-10-15**\n\n**Virus description added: 2021-10-20**\n\n**Packer: absent**\n\n**Compilation date: 2020-07-13**\n\n**SHA1 hash: 1a4b8232237651881750911853cf22d570eada9e**\n\n##### Description\n\nThe trojan is written in C++. It’s used for unauthorized control of an infected computer.\n\n##### Operating principle\n\nIn the beginning, the trojan decrypts the C&C server’s IP addresses and ports using the XOR\noperation:\n```\n import idaapi\n address = 0x416200\n for i in xrange(0x7c):\n   idaapi.patch_byte(address + i, idaapi.get_byte(address + i) ^ 0xEF)\n\n```\nDecryption result:\n\n\n-----\n\nC&C server—159.65.157.100:443\n\nCommunication with it occurs using sockets:\n\n\n-----\n\nDepending on the time, the connection to the required C&C server will be selected:\n\n\n-----\n\nThe trojan creates file tmp.0 in folder %tmp%, that it use as log.\n\n\n-----\n\nCollect information about the system:\n\n\n-----\n\n-----\n\n-----\n\nTrojan.DownLoader43.44599 pushes each value onto a stack before encrypting and sending the\ncollected data. The transferred data looks as follows:\n```\n struct computer_info {\n   string computer_name;\n   string user_name;\n   uint32_t major_version;\n   uint32_t minor_version;\n   uint32_t build_number;\n   uint32_t computer_bitness;\n   string March01;\n   uint32_t code_page_id;\n   uint32_t oem_code_page_id;\n };\n\n```\nTo encrypt the information collected about the system, the AES128 algorithm is used in CBC\nmode.\n\nThe key and initialization vector are embedded inside:\n\n\n-----\n\nThe decryption method looks as follows:\n```\n from Crypto.Cipher import AES\n key = '\\x95\\x2B\\x2D\\xBF\\x09\\xC5\\x2F\\x80\\xB4\\xBC\\x47\\x27\\x29\\xB3\\x28\\x09'\n iv = '\\x63\\x5F\\x72\\x2A\\xBB\\xE3\\xE8\\x95\\xF8\\xF9\\x32\\x87\\x53\\x6A\\x77\\xFB'\n enc = ...\n decipher = AES.new(key, AES.MODE_CBC, iv)\n open('dec', 'wb').write(decipher.decrypt(enc))\n\n```\nThe command execution cycle received from the C&C server:\n\n\n-----\n\nTable of commands compiled from the results of this cycle:\n\n|Command ID|Command|\n|---|---|\n|0x51|Creating cmd.exe process|\n|0x52|Execution command exit in cmd.exe|\n|0x54|Execute commands in the cmd.exe console;|\n|0x60|Creating the flow that reads, writes, and encrypts files.|\n\n\n-----\n\n#### Trojan.Loader.891\n\n**Added to the Dr.Web virus database: 2021-10-15**\n\n**Virus description added: 2021-xx-xx**\n\n**Packer: absent**\n\n**Compilation date: 2021-09-03 12:04:44**\n\n**SHA1 hash: 595b5a7f25834df7a4af757a6f1c2838eea09f7b**\n\n##### Description\n\nThis trojan is written in C. The program contains several files, and the trojan uses each file\nsequentially. The trojan’s main task is to decrypt the shellcode and execute it. The decrypted\nshellcode contains BackDoor.Whitebird.30, a module for bypassing UAC and backdoor\nconfiguration.\n\n##### Operating principle\n\nThe trojan folder contains the following files:\n\n  - mcupdui.exe — the executable file into which the malicious library is loaded using\nHijacking DLL has a valid McAfee signature:\n```\n  4F638B91E12390598F037E533C0AEA529AD1A371: CN=McAfee, Inc., OU=IIS,\n  OU=Digital ID Class 3 - Microsoft Software Validation v2,\n  O=McAfee, Inc., L=Santa Clara, S=California, C=US\n\n```\n - McUiCfg.dll — downloader\n\n - mscuicfg.dat — encrypted shellcode\n\n - mcupdui.ini — configuration of trojan\n\nTo move to the main malicious functionality, the trojan modifies the process memory:\n\nThe instruction following the malicious library’s download library is modified:\n\n\n-----\n\nTrojan.Loader.891 finds all the functions it needs by hashes using the PEB (Process Environment\nBlock) structure.\n\nAt the same time, the names of libraries and functions are hashed differently: library names are\nhashed as Unicode strings converted to upper case. Function names are hashed as ASCII strings\nwithout changing the case. The resulting two hashes are added together and then compared\nwith the desired one.\n\n\n-----\n\nTrojan’s main functions are encrypted. When the function is called, it decrypts its code, and when\nit exits, it encrypts it back.\n\nMain function:\n\nTrojan.Loader.891 obtains the MAC addresses of all network interfaces on the computer. The\ntrojan then reads data from the mscuicfg.dat file. If the last 6 bytes are zero, then it writes the\nfirst MAC address from the list into them and encrypts this file with the RC4 algorithm. In this\n\n\n-----\n\ncase, the key is equal to the MAC address written to the file, so the encrypted data is saved to\nthe file mscuicfg.dat.\n\nAfter that, in any way, the trojan reads the file again, sorting through each of the received MAC\naddresses until it finds the right one. The decryption’s correctness is checked by matching the\nlast 6 decrypted bytes with the encryption key. Upon successful decryption, the trojan cuts them\noff and decrypts the file again using the RC4 algorithm, but takes the string mscuicfg.dat as\nthe key. The received data is a shellcode with a configuration and a payload.\n\n##### Shellcode\n\nThe shellcode is obfuscated with a lot of JMP instructions and each value is computed with a lot\nof SUB, ADD, and XOR operations:\n\nThe shellcode’s principle is to decrypt the payload and load it into memory for execution.\n\nThe last DWORD of the shellcode contains the OFFSET before the start of the payload.\n\nEncrypted data at this stage:\n\n\n-----\n\n-----\n\nFor decryption, XOR with a dynamic key is used:\n```\n k = 0x37\n s = bytearray()\n for i in range(len(d)):\n   c = d[i] ^ k\n   s.append(c)\n   k = (k + c) & 0xff\n\n```\nThe decrypted data contains an MZPE file with signatures replaced:\n\n\n-----\n\nThe decoded module is BackDoor.Whitebird.30. In addition, the module overlay contains an\nencrypted configuration and a module for bypassing UAC:\n\n\n-----\n\n-----\n\n#### Trojan.Loader.896\n\n**Added to the Dr.Web virus database: 2021-11-03**\n\n**Virus description added: 2021-11-17**\n\n**Packer: absent**\n\n**Compilation date: 2020-14-10**\n\n**SHA1 hash: ff82dcadb969307f93d73bbed1b1f46233da762f**\n\n##### Description\n\nThe backdoors downloader, PlugX, is written in C.\n\n##### Operating principle\n\nAfter loading from the main module (msrers.exe) using the LoadLibraryW function, the\ntrojan loads the kernel32.dll library using the LoadLibraryA. Then, it gets the address of\nthe exported function GetModuleFileNameA:\n\nIt then obtains the name of the main module using the previously obtained function\n```\nGetModuleFileNameA. It checks if the name contains the substring \"ers.\" (msrers.exe):\n\n```\n\n-----\n\nFrom the hash, 0xEF64A41E gets the function VirtualProtect to change the memory\naccess rights to PAGE_EXECUTE_READWRITE at 0x416362 (msrers.exe):\n\nThe following fragment will modify the code at 0x416362 (msrers.exe):\n\n\n-----\n\nPlace in the main module to be modified:\n\nNext, a function is called that receives the base kernel32.dll, and the addresses of the\nfunctions by hashes.\n\nScript to get a function by hash:\n\n\n-----\n\nReceived features:\n\n|Function name|Hash|\n|---|---|\n|VirtualProtect|0xEF64A41E|\n|GetLastError|0x12F461BB|\n|CloseHandle|0xFF0D6657|\n\n\n-----\n\n|Function name|Hash|\n|---|---|\n|ReadFile|0x130F36B2|\n|VirtualAlloc|0x1EDE5967|\n|GetFileSize|0xAC0A138E|\n|CreateFileA|0x94E43293|\n|lstrcat|0x3E8F97C3|\n|GetModuleFileNameA|0xB4FFAFED|\n\n\nIn the following, the below structure is used to call these functions:\n```\n struct api_addr {\n   DWORD (__stdcall *GetModuleFileNameA)(HMODULE, LPSTR, DWORD);\n   LPSTR (__stdcall *lstrcat)(LPSTR, LPCSTR);\n   HANDLE (__stdcall *CreateFileA)(LPCSTR, DWORD, DWORD,\n LPSECURITY_ATTRIBUTES, DWORD, DWORD, HANDLE);\n   DWORD (__stdcall *GetFileSize)(HANDLE, LPDWORD);\n   LPVOID (__stdcall *VirtualAlloc)(LPVOID, SIZE_T, DWORD, DWORD);\n   BOOL  (__stdcall *ReadFile)(HANDLE, LPVOID, DWORD, LPDWORD,\n LPOVERLAPPED);\n   BOOL  (__stdcall *CloseHandle)(HANDLE);\n   DWORD (__stdcall *GetLastError)();\n };\n\n```\nTrojan takes the name dll (TmDbgLog.dll) and adds the \".TSC\" extension to it. Next, it\nopens the file TmDbgLog.dll.TSC for reading and decrypts its contents, which turns out to be\na shellcode.\n\nAfter decrypting the shellcode (TmDbgLog.dll), the trojan starts executing it:\n\n\n-----\n\nThe below is how the script for decrypting the shellcode looks like:\n```\n enc = bytearray(open('TmDbgLog.dll.TSC', 'rb').read())\n dec = bytearray()\n for i in xrange(len(enc)):\n   dec.append(((enc[i] ^ 0xbb) - 1) & 0xff)\n open('TmDbgLog.dll.TSC.dec', 'wb').write(dec)\n\n```\nBefore decrypting and running the payload, the shellcode assembles the following structure:\n```\n struct st_mw {\n  DWORD magic;\n  DWORD *shell_base;\n  DWORD shell_size;\n  DWORD *enc_payload;\n  DWORD enc_payload_size;\n  DWORD *enc_config;\n  DWORD enc_config_size;\n  DWORD *payload_entry;\n };\n\n```\nThis is what the encrypted config looks like:\n\n\n-----\n\nThe config’s decryption will be done directly in the payload:\n```\n import struct\n enc = open('enc_cfg', 'rb').read()\n key, = struct.unpack('I', enc[0:4])\n key1 = key\n key2 = key\n key3 = key\n dec = bytearray()\n for i in xrange(len(enc)):\n   key = (key + (key >> 3) - 0x11111111) & 0xFFFFFFFF\n   key1 = (key1 + (key1 >> 5) - 0x22222222) & 0xFFFFFFFF\n   key2 = (key2 + 0x33333333 - (key2 << 7)) & 0xFFFFFFFF\n   key3 = (key3 + 0x44444444 - (key3 << 9)) & 0xFFFFFFFF\n   dec.append(ord(enc[i]) ^ (key + key1 + key2 + key3) & 0xFF)\n open('dec_cfg', 'wb').write(dec)\n\n```\nAnd it’ll look like this:\n\n\n-----\n\nEncrypted payload:\n\nScript to decrypt the payload:\n\n\n-----\n\nAfter decrypting the payload, the shellcode transfers control to the trojan, with the previously\nassembled structure st_mw acting as one of the parameters:\n\n[Further, the trojan works in the same way as the backdoor BackDoor.PlugX.28.](https://vms.drweb.com/virus/?lng=en&i=21507745)\n\n\n-----\n\n#### Trojan.Uacbypass.21\n\n**Added to the Dr.Web virus database: 2021-10-22**\n\n**Virus description added: 2021-10-22**\n\n**Packer: absent**\n\n**Compilation date: 2019-09-29**\n\n**SHA1 hash: 7412b13e27433db64b610f40232eb4f0bf2c8487**\n\n##### Description\n\nThis trojan is written in C. It elevates backdoor privileges. It also disguises itself as a legitimate\nprocess and uses a COM object to bypass User Account Control (UAC). In this way, it elevates\nthe executable process’s privileges.\n\n##### Operating principle\n\nThe trojan disguises as a legitimate process C:\\Windows\\explorer.exe via PEB (Process\nEnvironment Block). That’s how it fools the IFileOperation COM object into thinking it’s\nbeing called from a Windows Explorer shell.\n\n\n-----\n\n-----\n\nThe trojan obtains a COM object to implement UAC bypass via privilege elevation\n(https://github.com/cnsimo/BypassUAC/blob/master/BypassUAC_Dll/dllmain\n```\n.cpp):\n\n```\nIt allows Trojan.Uacbypass.21 to run the file that was passed to it as an argument as a legitimate\nWindows process:\n\n\n-----\n\n-----\n\n-----\n\n### Appendix. Indicators of Compromise\n\n\n##### SHA1 hashes\n\n**Trojan.Loader.889**\n\nf783fc5d3fc3f923c2b99ef3a15a38a015e2735a: McUiCfg.dll\n\n**Trojan.Loader.890**\n\n65f64cc7aaff29d4e62520afa83b621465a79823: SRVCON.OCX\n\n8b9e60735344f91146627213bd13c967c975a783: CLNTCON.OCX\n\n84d5f015d8b095d24738e45d2e541989e6221786: sti.dll\n\n3d8a3fcfa2584c8b598836efb08e0c749d4c4aab: iviewers.dll\n\n**Trojan.Loader.891**\n\n595b5a7f25834df7a4af757a6f1c2838eea09f7b: McUiCfg.dll\n\n**Trojan.Loader.893**\n\n46e999d88b76cae484455e568c2d39ad7c99e79f: McUiCfg.dll\n\n**Trojan.Loader.894**\n\nb1041acbe71d46891381f3834c387049cbbb0806: iviewers.dll\n\n**Trojan.Loader.895**\n\n635e3cf8fc165a3595bb9e25030875f94affe40f: McUiCfg.dll\n\n**Trojan.Loader.896**\n\nff82dcadb969307f93d73bbed1b1f46233da762f: TmDbgLog.dll\n\n**Trojan.Loader.898**\n\n429357f91dfa514380f06ca014d3801e3175894d: CLNTCON.OCX\n\n\n-----\n\n**Trojan.Loader.899**\n\ncc5bce8c91331f198bb080d364aed1d3301bfb0c: LDVPTASK.OCX\n\n**BackDoor.PlugX.93**\n\na8bff99e1ea76d3de660ffdbd78ad04f81a8c659: CLNTCON.OCX\n\n**BackDoor.PlugX.94**\n\n5a171b55b644188d81218d3f469cf0500f966bac\n\n**BackDoor.PlugX.95**\n\nb3ecb0ac5bebc87a3e31adc82fb6b8cc4fb66d63: netcfg.dll\n\n**BackDoor.PlugX.96**\n\na3347d3dc5e7c3502d3832ce3a7dd0fc72e6ea49\n\n**BackDoor.PlugX.97**\n\n36624dc9cd88540c67826d10b34bf09f46809da7\n\n**BackDoor.PlugX.100**\n\n16728655e5e91a46b16c3fe126d4d18054a570a1\n\n**BackDoor.Whitebird.30**\n\nabfd737b14413a7c6a21c8757aeb6e151701626a\n\na5829ed81f59bebf35ffde10928c4bc54cadc93b\n\n**Trojan.Siggen12.35113**\n\n4f0ea31a363cfe0d2bbb4a0b4c5d558a87d8683e: rapi.dll\n\n**Trojan.Uacbypass.21**\n\n20ad53e4bc4826dadb0da7d6fb86dd38f1d13255\n\n\n-----\n\n**Program.RemoteAdmin.877**\n\n23873bf2670cf64c2440058130548d4e4da412dd: AkavMiqo.exe\n\n**Tool.Frp**\n\na6e9f5d8295d67ff0a5608bb45b8ba45a671d84c: firefox.exe\n\n39c5459c920e7c0a325e053116713bfd8bc5ddaf: firefox.exe\n\n##### Network indicators\n\n**Domains**\n\nwebmail.surfanny.com\n\nwww.sultris.com\n\nmail.sultris.com\n\npop3.wordmoss.com\n\nzmail.wordmoss.com\n\nyoutubemail.club\n\nclark.l8t.net\n\nblog.globnewsline.com\n\nmail.globnewsline.com\n\n**IPs**\n\n45.144.242.216\n\n45.147.228.131\n\n46.105.227.110\n\n5.183.178.181\n\n5.188.228.53\n\n103.30.17.44\n\n103.93.252.150\n\n103.230.15.41\n\n103.251.94.93\n\n104.233.163.136\n\n159.65.157.100\n\n180.149.241.88\n\n185.105.1.226\n\n\n-----\n\n192.236.177.250\n\n209.250.241.35\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/eos2gobtpnad1b9rblhy4g4ganpgdgk0",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2022/2022.03.23.Kazakhstan_APT/telecom_research_en.pdf",
        "https://st.drweb.com/static/new-www/news/2022/march/telecom_research_en.pdf"
    ],
    "report_names": [
        "DrWeb-telecom_research_en(03-24-2022)",
        "telecom_research_en",
        "telecom_research_en.pdf"
    ],
    "threat_actors": [
        {
            "id": "3c5b0e7e-2388-4b63-9b97-6b027bec4bf7",
            "created_at": "2023-01-06T13:46:39.068694Z",
            "updated_at": "2025-03-27T02:00:02.989445Z",
            "deleted_at": null,
            "main_name": "Calypso",
            "aliases": [
                "BRONZE MEDLEY"
            ],
            "source_name": "MISPGALAXY:Calypso",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13d9c5fc-af82-4474-90dd-188c4e40a399",
            "created_at": "2022-10-25T16:07:23.435079Z",
            "updated_at": "2025-03-27T02:02:09.800346Z",
            "deleted_at": null,
            "main_name": "Calypso",
            "aliases": [
                "Bronze Medley"
            ],
            "source_name": "ETDA:Calypso",
            "tools": [
                "Agent.dhwf",
                "Byeby",
                "Calypso RAT",
                "DCSync",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EternalBlue",
                "EternalRomance",
                "FlyingDutchman",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "NBTscan",
                "OS_Check_445",
                "PlugX",
                "Quarks PwDump",
                "RedDelta",
                "SAMRID",
                "Sogu",
                "SysInternals",
                "TCP Port Scanner",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Whitebird",
                "Xamtrav",
                "ZXPortMap",
                "nbtscan",
                "netcat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041453,
    "ts_creation_date": 1648041502,
    "ts_modification_date": 1648041502,
    "files": {
        "pdf": "https://archive.orkl.eu/c848df52070b8baac8ccb65d4a223c2370e75469.pdf",
        "text": "https://archive.orkl.eu/c848df52070b8baac8ccb65d4a223c2370e75469.txt",
        "img": "https://archive.orkl.eu/c848df52070b8baac8ccb65d4a223c2370e75469.jpg"
    }
}