{
    "id": "d107acb9-c537-4fae-8db8-ad88e303bd00",
    "created_at": "2023-01-12T15:06:01.964422Z",
    "updated_at": "2025-03-27T02:05:44.630371Z",
    "deleted_at": null,
    "sha1_hash": "5bad19f185591b6e13701ae238461931771e34bc",
    "title": "2022-03-11 - New Formbook Campaign Delivered Through Phishing Emails",
    "authors": "",
    "file_creation_date": "2022-05-28T17:13:17Z",
    "file_modification_date": "2022-05-28T17:13:17Z",
    "file_size": 2068499,
    "plain_text": "# New Formbook Campaign Delivered Through Phishing Emails\n\n**[netskope.com/blog/new-formbook-campaign-delivered-through-phishing-emails](https://www.netskope.com/blog/new-formbook-campaign-delivered-through-phishing-emails)**\n\nGustavo Palazolo March 11, 2022\n\n## Summary\n\n[Since the beginning of 2022, the unfolding geopolitical conflict between Russia and Ukraine](https://www.bbc.com/news/world-60525350)\n[has resulted in the discovery of new malware families and related cyberattacks. In January](https://www.wsj.com/articles/the-russia-ukraine-cyberwar-could-outlast-the-shooting-war-11646456442)\n[2022, a new malware named WhisperGate was found corrupting disks and wiping files in](https://www.netskope.com/blog/netskope-threat-coverage-whispergate)\nUkrainian organizations. In February 2022, another destructive malware was found in\n[hundreds of computers in Ukraine, named HermeticWiper, along with](https://www.netskope.com/blog/netskope-threat-coverage-hermeticwiper) IsaacWiper and\nHermeticWizard.\n\nAside from new malware families and novel attacks, previously known malware families\ncontinue to be used against organizations in Ukraine and throughout the world. Recently,\n[Netskope Threat Labs came across an interesting phishing email addressed to high-ranking](https://www.virustotal.com/gui/file/c013b2be04364216421dbec58c254bca979adff55ce7263bcd4da8ada7dd692f)\n[government officials in Ukraine containing Formbook (a.k.a. XLoader), which is a well-known](https://malpedia.caad.fkie.fraunhofer.de/details/win.formbook)\n[malware operating in the MaaS (Malware-as-a-Service) model. This malware provides full](https://www.vmray.com/glossary/formbook/)\ncontrol over infected machines, offering many functionalities such as stealing passwords,\ngrabbing screenshots, downloading, and executing additional malware, among others.\n\nThe email seems to be part of a new spam campaign, since there were multiple emails with\nthe same subject and body addressed to other recipients. Most of them contain an infected\n[spreadsheet encrypted with the “VelvetSweatshop” password which is a known Formbook](https://forensicitguy.github.io/xloader-formbook-velvetsweatshop-spreadsheet/)\n\n\n-----\n\n[behavior. The infected spreadsheet delivers the threat through vulnerability described under](https://forensicitguy.github.io/xloader-formbook-velvetsweatshop-spreadsheet/)\n[CVE-2017-11882 and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-11882) [CVE-2018-0798. However, the email addressed to government](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-0798)\nofficials in Ukraine contains a .NET executable, responsible for loading Formbook in a multistage chain:\n\nIn this blog post, we will analyze all the layers from the email attachment to the last\nFormbook payload.\n\n## Phishing Email\n\nThe infection flow starts with a generic phishing email that uses a common technique,\ntricking the victim into downloading the payload by pretending to be a shipping invoice.\n\n\n-----\n\ncontaining a malicious attachment.\nThe attachment is a compressed file containing the first Formbook stage.\n\n\nPhishing email\n\nEmail\n\n\nattachment carrying Formbook.\nAlso, as we mentioned previously, we found similar emails delivering malicious\nspreadsheets, so we believe that this is part of a new spam campaign delivering multiple\nthreats.\n\n\n-----\n\nSimilar phishing email\n\nwith a malicious attachment.\n\n## Analysis – Summary\n\nBefore executing the last file (Formbook), the malware is divided into multiple stages, which\nwe have summarized below.\n\n1. Stage 01 is a loader, responsible for decoding and executing the next stage;\n2. Stage 02 is another loader, responsible for obtaining the encrypted bytes of Stage 03\n\nfrom the resources of Stage 01, decrypting and executing it;\n3. Stage 03 is a known packer/loader named CyaX-Sharp, responsible for decrypting and\n\nexecuting the last stage;\n4. Stage 04 is the Formbook payload, which injects itself into other processes, as\n\ndescribed later in this analysis.\n\n\n-----\n\nSummary of Formbook loading process\n\n## Analysis – Stage 01\n\nThe first stage is a .NET executable likely compiled on February 21, 2022. This file is a\nloader, responsible for decoding and executing the next stage.\n\n\n-----\n\nBinary details of the first stage.\nOnce we decompile the file, we can see that the real executable name is “VarArgMet.exe”.\nThis stage doesn’t contain any code obfuscation but does contain an obfuscated string and\nan encrypted resource which we will discuss later.\n\nFirst stage decompiled.\n\n[Also, this file seems to be an infected version of a public .NET project named PlaylistPanda,](https://github.com/beaugunderson/playlist-panda)\ncreated in 2009. Looking at the entry point, we can see the same code that is published in\nthe PlaylistPanda public repository, where the MainForm function is called, followed by\n**InitializeComponent.**\n\n\n-----\n\nEntry point\n\nof the first stage.\nIn this malicious version, the InitializeComponent function contains the main code of the\nfirst stage. Once running, the code reads an obfuscated and base64 encoded string stored in\na variable named x121312x121312, which contains the next stage. Once it’s deobfuscated\nand decoded, the file is passed as an argument to the function Springfield.\n\nFurthermore, this loader contains a lot of junk code that will never be executed, possibly to\nconfuse analysts and slow down analysis.\n\n\n-----\n\nLoader’s main code, decoding and executing the next stage.\n[The Springfield function then loads the second stage as a .NET assembly, which is saved in](https://docs.microsoft.com/en-us/dotnet/api/system.reflection.assembly?view=net-6.0)\na variable named DebuggerVisualizer.\n\nSecond stage\n\nbeing loaded as a .NET assembly.\nThe DebuggerVisualizer variable is then passed as an argument to the EraInfo function,\nwhich executes the second stage by calling the CreateInstance function with the payload\nand three strings as arguments:\n\n\n-----\n\n5A6F6E654964656E746974795065726D697373696F6E417474726962\n(ZoneIdentityPermissionAttrib)\n6F513037 (oQ07)\nPlaylistPanda\n\nSecond stage being executed.\n\n## Analysis – Stage 02\n\nThe second stage is a .NET DLL, likely compiled on February 16, 2022. This file is another\nloader responsible for executing the third stage, which is stored in the resources of the first\nstage.\n\nBinary details of the second stage.\nOnce we decompile the file, we can see that the real name is “SpaceChemSolver.dll”. This\nfile doesn’t have any sort of code obfuscation or protection. The entry point of this stage is\nthe RunCore function, which is called within SharpStructures.Main.\n\n\n-----\n\nSecond stage’s name.\n\nThis code is responsible for loading and executing the third stage, which is encrypted and\nstored as a resource named ZoneIdentityPermissionAttrib in the first stage\n(PlaylistPanda), masqueraded as a bitmap image.\n\nThird stage execution flow.\nAfter loading the fake image from the first stage resources, the function\n**ConstructionResponse is responsible for decrypting the binary using XOR operations with**\nthe string “oQ07”.\n\n\n-----\n\nFunction that decrypts the third stage.\nOnce decrypted, the second stage loads the third stage as a .NET assembly, like we saw\npreviously, executing a function named yjO9HynvmD.\n\nThird stage being loaded.\n\n## Analysis – Stage 03 (CyaX-Sharp)\n\n[The third stage is yet another .NET file, but this time it’s protected with .NET Reactor. The](https://www.eziriz.com/dotnet_reactor.htm)\ncompilation date is also near the other files, on February 21, 2022. This file is a known\n[loader/packer named CyaX-Sharp, which is commonly used to deliver malware like](https://www.mcafee.com/blogs/enterprise/mcafee-enterprise-atr/see-ya-sharp-a-loaders-tale/)\n[AgentTesla and](https://www.netskope.com/blog/infected-powerpoint-files-using-cloud-services-to-deliver-multiple-malware) [Warzone RAT.](https://www.netskope.com/blog/dbatloader-abusing-discord-to-deliver-warzone-rat)\n\n\n-----\n\nBinary details of the third stage.\nBefore executing the payload, this packer offers many functionalities such as Virtual Machine\nand Sandbox detection. These features can be enabled or disabled through configuration,\nwhich is stored in a string within the binary.\n\nCyaX-Sharp configuration string.\nOnce it’s running, it starts by parsing the configuration string and then calling the functions\nrelated to the features for which the option is enabled.\n\n\n-----\n\nCyaX-Sharp main\n\nfunction.\nThe malware checks if there’s another instance running through a Mutex object named\n“WuhpBQuQigdPUFFvzgV”.\n\nMutex created by the\n\nthird stage.\nThen, the malware checks if the process is running with administrative privileges, and it adds\n[the path of the executable to the exclusion list of Microsoft Defender.](https://docs.microsoft.com/en-us/powershell/module/defender/add-mppreference?view=windowsserver2022-ps)\n\n\n-----\n\nSimple Windows Defender bypass.\nIn this specific file, the Virtual Machine and Sandbox verification are disabled. However, just\nto demonstrate how it works, this malware is able to detect virtualized environments by\nchecking the presence of specific values in the Windows Registry, used by software like\n[VirtualBox and](https://www.virtualbox.org/) [VMware.](https://www.vmware.com/)\n\n\n-----\n\nFunctionality to detect virtualized environments.\nFor sandbox detection, the malware searches for common file names, loaded modules, and\nwindows titles.\n\n\n-----\n\nFunctionality to detect sandboxes.\nCyaX-Sharp also offers a feature to download and execute additional payloads, which is also\ndisabled in this sample.\n\nFunctionality to\n\ndownload and execute additional payloads.\nIt then copies itself to AppData, as “YtGUemuxgzC.exe”.\n\nMalware copying itself to AppData.\nThe permission of this file is then changed to avoid anyone from deleting it.\n\n\n-----\n\nChanging recently copied AppData permission.\nTo execute this copy, a very simple persistence technique is implemented via Windows\nscheduled tasks.\n\nMalware’s persistence.\n\nThe final stage is then loaded from a resource named “fVkXSK7E”, which contains the\nencrypted bytes of Formbook.\n\nCyaX-Sharp loading the final stage.\n\n\n-----\n\nBefore decrypting the payload, CyaX-Sharp builds the path string of the executable that will\nbe used to inject Formbook. In this case, the malware is configured to use “vbc.exe”.\n\nFormbook is then decrypted through bitwise operations using the bytes of the string\n“SUASbkTWociWWQ”.\n\nCyaX-Sharp decrypting Formbook.\nFormbook is injected into “vbc.exe” via [Process Hollowing, which we have already explained](https://attack.mitre.org/techniques/T1055/012/)\n[in more detail in this analysis. All the APIs are loaded dynamically via GetProcAddress and](https://www.netskope.com/blog/dbatloader-abusing-discord-to-deliver-warzone-rat)\n[LoadLibraryA APIs.](https://docs.microsoft.com/en-us/windows/win32/api/libloaderapi/nf-libloaderapi-loadlibrarya)\n\n\n-----\n\nAPIs related to Process Hollowing.\nWe can find Formbook fully decrypted by inspecting the “vbc.exe” process memory, or by\ndumping the bytes once it’s decrypted in the third stage.\n\n\n-----\n\nFormbook injected into “vbc.exe”\n\n## Analysis – Stage 04 (Formbook)\n\n[The last stage is Formbook, which is an infostealer sold as a service (MaaS) on hacking-](https://www.bleepingcomputer.com/news/security/formbook-infostealer-sold-on-hacking-forums-is-becoming-quite-a-threat/)\nrelated forums since 2016. This malware provides many functionalities, such as:\n\n1. Grabbing keystrokes (Keylogger);\n2. Grabbing screenshots;\n3. Grabbing HTTP(s) forms from network requests;\n4. Stealing data from the clipboard;\n5. Stealing data from common software, such as browsers, email, and ftp clients;\n6. Shutdown/Reboot the OS;\n7. Download and execute additional files;\n8. Remotely execute commands;\n\n\n-----\n\n9. Encrypted C2 communication;\n\nThe malware is written in ASM/C, and the compilation timestamp seems to be altered, as it\nindicates it was created in 2003.\n\nBinary details of Formbook payload.\nThe primary entry point of Formbook is straightforward. Once running, it calls the main\nfunction which is named “InjectMaliciousPayload” in this IDA database. Most of the strings\n[are obfuscated using the “Stack Strings” technique, which can be defeated with FLOSS. A](https://github.com/mandiant/flare-floss)\n[list of decoded strings for this sample can be found in our GitHub repository.](https://github.com/netskopeoss/NetskopeThreatLabsIOCs/blob/main/Formbook/IOCs/Formbook_strings.txt)\n\n\n-----\n\nFormbook’s primary entry point.\nIt then executes a sequence of functions to assess the environment and determine whether\nit’s going to run, by verifying the presence of blacklisted processes and usernames, for\nexample.\n\nFormbook anti-analysis mechanisms.\n\n\n-----\n\nAfter the anti-analysis mechanisms, Formbook proceeds by creating and injecting itself into a\nrandomly chosen process from Windows directory. In this case, it is injected into\n“svchost.exe”.\n\nFormbook injecting itself into\n\nanother process.\nAlso, another instance is injected into “explorer.exe”, responsible for the C2 communication.\nWe found 65 different domains in this sample, where 64 are only used as decoys.\n\nFormbook trying to\n\nconnect to domains.\nThe real C2 of this sample is “www.biohackingz[.]one”.\n\n\n-----\n\nFormbook C2 communication.\n[This domain was first seen on February 21, 2022 on VirusTotal.](https://www.virustotal.com/gui/domain/www.biohackingz.one/relations)\n\nAnalysis of the C2 domain.\nOnce the communication is established, Formbook parses the data to determine the action\nthat needs to be taken.\n\nPart of the function\n\nthat parses the C2 response.\n\n## Conclusions\n\nFormbook is an infostealer, available via the Malware-as-a-Service model since 2016, often\nused by non-experienced people as it’s sold as a service at a [reasonable price. Although it’s](https://www.bleepstatic.com/images/news/u/986406/Malware/RAT/FormBook-ad.jpg)\na simple threat, it contains many layers and techniques to slow down analysis and bypass\ndetection engines. Regardless of the cheap price, Formbook can be quite dangerous as it\nprovides full access to infected systems. Netskope Threat Labs will keep monitoring this new\ncampaign as well as others that may emerge.\n\n## Protection\n\nNetskope Threat Labs is actively monitoring this campaign and has ensured coverage for all\nknown threat indicators and payloads.\n\n\n-----\n\n**Netskope Threat Protection**\n\nWin32.Trojan.FormBook\nWin32.Spyware.Noon\nWin32.Malware.Heuristic\nByteCode-MSIL.Malware.Heuristic\n**Netskope Advanced Threat Protection provides proactive coverage against this**\nthreat.\n\nGen.Malware.Detect.By.StHeur indicates a sample that was detected using static\nanalysis\nGen.Malware.Detect.By.Sandbox indicates a sample that was detected by our\ncloud sandbox\n\n## IOCs\n\nAll the IOCs related to this campaign and the Yara rules can be found in our GitHub\nrepository.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-11 - New Formbook Campaign Delivered Through Phishing Emails.pdf"
    ],
    "report_names": [
        "2022-03-11 - New Formbook Campaign Delivered Through Phishing Emails.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535961,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653757997,
    "ts_modification_date": 1653757997,
    "files": {
        "pdf": "https://archive.orkl.eu/5bad19f185591b6e13701ae238461931771e34bc.pdf",
        "text": "https://archive.orkl.eu/5bad19f185591b6e13701ae238461931771e34bc.txt",
        "img": "https://archive.orkl.eu/5bad19f185591b6e13701ae238461931771e34bc.jpg"
    }
}