{
    "id": "d109d42c-0645-46d5-a5ce-03b115a51993",
    "created_at": "2023-01-12T15:07:14.516618Z",
    "updated_at": "2025-03-27T02:06:14.586771Z",
    "deleted_at": null,
    "sha1_hash": "70b4845f1fd0056a210dd01e86748c0e5d691e61",
    "title": "2022-05-11 - Proactive Threat Hunting Bears Fruit- Falcon OverWatch Detects Novel IceApple Post-Exploitation Framework",
    "authors": "",
    "file_creation_date": "2022-05-28T03:39:49Z",
    "file_modification_date": "2022-05-28T03:39:49Z",
    "file_size": 133964,
    "plain_text": "# Falcon OverWatch Detects Novel IceApple Framework\n\n**[crowdstrike.com/blog/falcon-overwatch-detects-iceapple-framework/](https://www.crowdstrike.com/blog/falcon-overwatch-detects-iceapple-framework/)**\n\nAdrian Justice May 11, 2022\n\nThe [CrowdStrike Falcon OverWatch™ proactive threat hunting team has uncovered a](https://www.crowdstrike.com/products/managed-services/falcon-overwatch-threat-hunting/)\nsophisticated .NET-based post-exploitation framework, dubbed IceApple. Since OverWatch’s\nfirst detection in late 2021, the framework has been observed in multiple victim environments\nin geographically distinct locations, with intrusions spanning the technology, academic and\ngovernment sectors.\n\nThe emergence of new and evolving IceApple modules over the past year indicates that this\nframework remains under active development.\n\nTo date, IceApple has been observed being deployed on Microsoft Exchange server\ninstances, however it is capable of running under any Internet Information Services (IIS) web\napplication. As such, ensuring all web applications are fully patched is critical to ensuring\nIceApple doesn’t end up in your environment.\n\n[For a detailed look at IceApple download OverWatch’s research paper that explores in depth](https://www.crowdstrike.com/resources/white-papers/falcon-overwatch-proactive-threat-hunting-unearths-iceapple-post-exploitation-framework/)\nhow IceApple was found, the functionality of all currently discovered modules, and how these\nmodules interact.\n\n\n-----\n\n## IceApple Likely Intended for Long Running Campaigns\n\nIceApple is a post-exploitation framework — this means it does not provide access, rather it\nis used to further mission objectives after access has already been achieved. OverWatch’s\ninvestigations have identified 18 distinct modules with functionality that includes discovery,\n[credential harvesting, file and directory deletion and data exfiltration. OverWatch has](https://www.crowdstrike.com/cybersecurity-101/data-exfiltration/)\nobserved evidence of adversaries repeatedly returning to victim environments to carry out\ntheir post-exploitation activities.\n\nIceApple uses an in-memory-only framework that highlights the adversary’s priority of\nmaintaining a low forensic footprint on the infected host. This is typical of long-running\nobjectives aimed at intelligence collection and aligns with a targeted, state-sponsored\nmission. While the observed targeted intrusions align with China-nexus, state-sponsored\ncollection requirements, at this time CrowdStrike Intelligence has not attributed IceApple to a\nnamed threat actor.\n\nIceApple has a number of features to help it evade detection. Detailed analysis of the\nmodules suggests that IceApple has been developed by an adversary with deep knowledge\nof the inner workings of IIS software. One of the modules was even found to be leveraging\nundocumented fields that are not intended to be used by third-party developers.\n\nEfforts to blend into the victim environment are also seen with the assembly file names\nthemselves. At first glance they appear to be expected IIS temporary files generated as part\nof the process of converting ASPX source files into .NET assemblies for IIS to load. Closer\ninspection is required to identify that the file names are not randomly generated as would be\nexpected, and the way the assemblies are loaded falls outside of what is normal for Microsoft\nExchange and IIS. OverWatch threat hunters’ familiarity with how systems should operate,\nand also how adversaries attempt to corrupt these systems is what enabled hunters to\nquickly identify this suspicious activity.\n\n## How OverWatch Found IceApple\n\nOverWatch regularly sees adversaries use .NET assemblies as a way to load additional\nfunctionality post-exploitation. Reflectively loading .NET assemblies, which involves\nexecuting the assembly directly within the memory of a process, can be a powerful and\npotentially stealthy way for adversaries to pursue their mission objectives. As such,\nOverWatch threat hunters have been actively developing detections for reflective .NET\nassembly loads.\n\nIn late 2021, one of Falcon OverWatch’s in-development detections for reflective .NET\nassembly loads triggered on a Microsoft Exchange OWA server belonging to a customer who\nhad recently started a trial of the Falcon platform. Eagle-eyed threat hunters identified\nanomalies in the assembly files and quickly reached out to the victim organization to notify\n\n\n-----\n\nthem. OverWatch then worked with the customer to configure the Falcon sensor to extract\nthe contents of reflectively loaded .NET assemblies across the customer’s endpoints giving\nOverWatch increased visibility and facilitating closer inspection of IceApple’s functionality.\n\n## OverWatch Provides Agile Defense in the Face of Evolving Threats\n\nIceApple is a highly sophisticated IIS post exploitation framework, however, it is by no means\nalone. OverWatch regularly identifies new reflectively loaded .NET assemblies of various\nlevels of sophistication.\n\nThe CrowdStrike Falcon® platform detects all currently known IceApple module loads, while\nOverWatch actively hunts new IceApple modules. Threat hunting is a crucial piece of the\ndefensive puzzle when it comes to novel and stealthy adversary tools like IceApple.\nCrowdStrike threat hunters draw on their extensive experience of what “normal” looks like in\nenterprise environments, knowledge of adversary behavior, and up-to-the-minute threat\nintelligence to preempt where the next threat might emerge. This feeds the development and\ntesting of hypotheses that enhance the hunt and curtail adversary attempts to evade\ntechnology-based defenses. OverWatch’s systematic workflows also ensure that the detailed\nanalysis of IceApple will also feed back into continuous improvement and fine tuning of\nhunting leads.\n\nThe discovery of IceApple was the result of one such experimental hunting lead, and\nultimately led to the discovery of attempted intrusions in multiple victim environments.\n\n**Additional Resources**\n\n_Read the_ _[2021 Threat Hunting Report blog or download the report now.](https://www.crowdstrike.com/blog/2021-threat-hunting-report-preview/)_\n_[Learn more about Falcon OverWatch’s proactive managed threat hunting.](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)_\n_Discover the power of tailored threat hunting OverWatch Elite provides customers in_\n_this blog post._\n_[Watch how Falcon OverWatch proactively hunts for threats in your environment.](https://www.crowdstrike.com/resources/videos/falcon-overwatch-proactively-hunts-threats-environment/)_\n_[Read more about how part-time threat hunting is simply not enough in this blog post.](https://www.crowdstrike.com/blog/the-myth-of-part-time-threat-hunting-part-1/)_\n_[Learn more about the CrowdStrike Falcon®](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_ _platform._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-11 - Proactive Threat Hunting Bears Fruit- Falcon OverWatch Detects Novel IceApple Post-Exploitation Framework.pdf"
    ],
    "report_names": [
        "2022-05-11 - Proactive Threat Hunting Bears Fruit- Falcon OverWatch Detects Novel IceApple Post-Exploitation Framework.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536034,
    "ts_updated_at": 1743041174,
    "ts_creation_date": 1653709189,
    "ts_modification_date": 1653709189,
    "files": {
        "pdf": "https://archive.orkl.eu/70b4845f1fd0056a210dd01e86748c0e5d691e61.pdf",
        "text": "https://archive.orkl.eu/70b4845f1fd0056a210dd01e86748c0e5d691e61.txt",
        "img": "https://archive.orkl.eu/70b4845f1fd0056a210dd01e86748c0e5d691e61.jpg"
    }
}