{
    "id": "d1119303-b047-4e29-b97c-338bd038248b",
    "created_at": "2022-10-25T16:48:12.305413Z",
    "updated_at": "2025-03-27T02:13:04.349644Z",
    "deleted_at": null,
    "sha1_hash": "c24ba893644a149a1f05432c392a716251dca72f",
    "title": "Darwin's Favorite Apt Group",
    "authors": "FireEye",
    "file_creation_date": "2014-09-05T14:42:01Z",
    "file_modification_date": "2014-09-05T14:42:01Z",
    "file_size": 217598,
    "plain_text": "**Introduction**\n\nThe attackers referred to as APT12 (also known as IXESHE, DynCalc, and DNSCALC) recently started a\n\nnew campaign targeting organizations in Japan and Taiwan. APT12 is believed to be a cyber espionage\n\ngroup thought to have links to the Chinese People’s Liberation Army. APT12′s targets are consistent with\n\nlarger People’s Republic of China (PRC) goals. Intrusions and campaigns conducted by this group are in\nline with PRC goals and self-interest in Taiwan. Additionally, the new campaigns we uncovered further\n\nhighlight the correlation between APT groups ceasing and retooling operations after media exposure, as\n\nAPT12 used the same strategy after compromising the New York Times in Oct 2012. Much like Darwin’s\n\ntheory of biological evolution, APT12 been forced to evolve and adapt in order to maintain its mission.\n\nThe new campaign marks the first APT12 activity publicly reported since Arbor Networks released their\n\n[blog “Illuminating The Etumbot APT Backdoor.” FireEye refers to the Etumbot backdoor as RIPTIDE.](http://www.arbornetworks.com/asert/2014/06/illuminating-the-etumbot-apt-backdoor/)\n\nSince the release of the Arbor blog post, FireEye has observed APT12 use a modified RIPTIDE backdoor\n\nthat we call HIGHTIDE. This is the second time FireEye has discovered APT12 retooling after a public\n\ndisclosure. As such, FireEye believes this to be a common theme for this APT group, as APT12 will\n\ncontinue to evolve in an effort to avoid detection and continue its cyber operations.\n\nFireEye researchers also discovered two possibly related campaigns utilizing two other backdoors known\n\nas THREEBYTE and WATERSPOUT. Both backdoors were dropped from malicious documents built\n\nutilizing the “Tran Duy Linh” exploit kit, which exploited CVE-2012-0158. These documents were also\n\nemailed to organizations in Japan and Taiwan. While APT12 has previously used THREEBYTE, it is\n\nunclear if APT12 was responsible for the recently discovered campaign utilizing THREEBYTE. Similarly,\n\nWATERSPOUT is a newly discovered backdoor and the threat actors behind the campaign have not been\n\npositively identified. However, the WATERSPOUT campaign shared several traits with the RIPTIDE and\n\nHIGHTIDE campaign that we have attributed to APT12.\n\n**Background**\n\nFrom October 2012 to May 2014, FireEye observed APT12 utilizing RIPTIDE, a proxy-aware backdoor\n\nthat communicates via HTTP to a hard-coded command and control (C2) server. RIPTIDE’s first\n\ncommunication with its C2 server fetches an encryption key, and the RC4 encryption key is used to\n\nencrypt all further communication.\n\n\n-----\n\n**Figure 1: RIPTIDE HTTP GET Request Example**\n\n[In June 2014, Arbor Networks published an article describing the RIPTIDE backdoor and its C2](http://www.arbornetworks.com/asert/2014/06/illuminating-the-etumbot-apt-backdoor/)\n\ninfrastructure in great depth. The blog highlighted that the backdoor was utilized in campaigns from\n\nMarch 2011 till May 2014.\n\nFollowing the release of the article, FireEye observed a distinct change in RIPTIDE’s protocols and strings.\n\nWe suspect this change was a direct result of the Arbor blog post in order to decrease detection of\n\nRIPTIDE by security vendors. The changes to RIPTIDE were significant enough to circumvent existing\n\nRIPTIDE detection rules. FireEye dubbed this new malware family HIGHTIDE.\n\n**HIGHTIDE Malware Family**\n\nOn Sunday August 24, 2014 we observed a spear phish email sent to a Taiwanese government ministry.\n\nAttached to this email was a malicious Microsoft Word document (MD5:\n\nf6fafb7c30b1114befc93f39d0698560) that exploited CVE-2012-0158. It is worth noting that this\n\n**email appeared to have been sent from another Taiwanese Government employee,**\n\n**implying that the email was sent from a valid but compromised account.**\n\n**Figure 2: APT12 Spearphishing Email**\n\nThe exploit document dropped the HIGHTIDE backdoor with the following properties:\n\n|MD5|6e59861931fa2796ee107dc27bfdd480|\n|---|---|\n|Size|75264 bytes|\n|Complie Time|2014-08-23 08:22:49|\n|Import Hash|ead55ef2b18a80c00786c25211981570|\n\n\n-----\n\nthe RIPTIDE samples (Figure 1) to the HTTP GET request from the HIGHTIDE samples (Figure 3) you\n\ncan see the malware author changed the following items:\n\nUser Agent\n\nFormat and structure of the HTTP Uniform Resource Identifier (URI)\n\n**Figure 3: HIGHTIDE GET Request Example**\n\nSimilar to RIPTIDE campaigns, APT12 infects target systems with HIGHTIDE using a Microsoft Word\n\n(.doc) document that exploits CVE-2012-0158. FireEye observed APT12 deliver these exploit documents\n\nvia phishing emails in multiple cases. Based on past APT12 activity, we expect the threat group to continue\n\nto utilize phishing as a malware delivery method.\n\nMD5 File Name Exploit\n73f493f6a2b0da23a79b50765c164e88 議程最新修正及注意事項.doc CVE-2012-0158\nf6fafb7c30b1114befc93f39d0698560 0824.1.doc CVE-2012-0158\neaa6e03d9dae356481215e3a9d2914dc 簡易名冊0全國各警察機關主官至分局 CVE-2012-0158\n\n長.doc\n\n06da4eb2ab6412c0dc7f295920eb61c4 附檔.doc CVE-2012-0158\n53baedf3765e27fb465057c48387c9b6 103年第3屆通訊錄.doc CVE-2012-0158\n00a95fb30be2d6271c491545f6c6a707 2014 09 17 Welcome Reception for Bob CVE-2012-0158\n\nand Jason_invitation.doc\n\n4ab6bf7e6796bb930be2dd0141128d06 產諮會_Y103(2)委員會_從東協新興國家 CVE-2012-0158\n\n崛起(0825).doc\n\n**Figure 4: Identified exploit documents for HIGHTIDE**\n\nWhen the file is opened, it drops HIGHTIDE in the form of an executable file onto the infected system.\n\nRIPTIDE and HIGHTIDE differ on several points: executable file location, image base address, the User\nAgent within the GET requests, and the format of the URI. The RIPTIDE exploit document drops its\n\nexecutable file into the C:\\Documents and Settings\\{user}\\Application Data\\Location folder while the\n\nHIGHTIDE exploit document drops its executable file into the C:\\DOCUMENTS and SETTINGS\\\n\n{user}\\LOCAL SETTINGS\\Temp\\ folder. All but one sample that we identified were written to this folder\n\nas word.exe. The one outlier was written as winword.exe.\n\nResearch into this HIGHTIDE campaign revealed APT12 targeted multiple Taiwanese Government\n\n|MD5|File Name|Exploit|\n|---|---|---|\n|73f493f6a2b0da23a79b50765c164e88|議程最新修正及注意事項.doc|CVE-2012-0158|\n|f6fafb7c30b1114befc93f39d0698560|0824.1.doc|CVE-2012-0158|\n|eaa6e03d9dae356481215e3a9d2914dc|簡易名冊0全國各警察機關主官至分局 長.doc|CVE-2012-0158|\n|06da4eb2ab6412c0dc7f295920eb61c4|附檔.doc|CVE-2012-0158|\n|53baedf3765e27fb465057c48387c9b6|103年第3屆通訊錄.doc|CVE-2012-0158|\n|00a95fb30be2d6271c491545f6c6a707|2014 09 17 Welcome Reception for Bob and Jason_invitation.doc|CVE-2012-0158|\n|4ab6bf7e6796bb930be2dd0141128d06|產諮會_Y103(2)委員會_從東協新興國家 崛起(0825).doc|CVE-2012-0158|\n\n\n-----\n\n**THREEBYTE Malware Family**\n\nOn Monday August 25, 2014 we observed a different spear phish email sent from lilywang823@gmail.com\n\nto a technology company located in Taiwan. This spear phish contained a malicious Word document that\n\nexploited CVE-2012-0158. The MD5 of the exploit document was e009b95ff7b69cbbebc538b2c5728b11.\n\nSimilar to the newly discovered HIGHTIDE samples documented above, this malicious document dropped\n\na backdoor to C:\\DOCUMENTS and SETTINGS\\{user}\\LOCAL SETTINGS\\Temp\\word.exe. This\n\nbackdoor had the following properties:\n\nMD5 16e627dbe730488b1c3d448bfc9096e2\nSize 75776 bytes\nComplie 2014-08-25 01:22:20\nTime\n\nImport dcfaa2650d29ec1bd88e262d11d3236f\nHash\n\nThis backdoor sent the following callback traffic to video[.]csmcpr[.]com:\n\n**Figure 5: THREEBYTE GET Request Beacon**\n\nThe THREEBYTE spear phishing incident (while not yet attributed) shared the following characteristics\n\nwith the above HIGHTIDE campaign attributed to APT12:\n\nThe THREEBYTE backdoor was compiled two days after the HIGHTIDE backdoors.\n\nBoth the THREEBYTE and HIGHTIDE backdoors were used in attacks targeting organizations in\n\nTaiwan.\n\nBoth the THREEBYTE and HIGHTIDE backdoors were written to the same filepath of\n\nC:\\DOCUMENTS and SETTINGS\\{user}\\LOCAL SETTINGS\\Temp\\word.exe.\n\nAPT12 has previously used the THREEBYTE backdoor.\n\n**WATERSPOUT Malware Family**\n\nOn August 25, 2014, we observed another round of spear phishing emails targeting a high-technology\n\ncompany in Japan. Attached to this email was another malicious document that was designed to exploit\n\nCVE-2012-0158. This malicious Word document had an MD5 of 499bec15ac83f2c8998f03917b63652e\n\nand dropped a backdoor to C:\\DOCUMENTS and SETTINGS\\{user}\\LOCAL SETTINGS\\Temp\\word.exe.\n\nThe backdoor had the following properties:\n\n|MD5|16e627dbe730488b1c3d448bfc9096e2|\n|---|---|\n|Size|75776 bytes|\n|Complie Time|2014-08-25 01:22:20|\n|Import Hash|dcfaa2650d29ec1bd88e262d11d3236f|\n\n\n-----\n\nComplie\nTime\n\n\n2014-08-25 02:10:11\n\n|Import Hash|864cd776c24a3c653fd89899ca32fe0b|\n|---|---|\n\n\nThe backdoor connects to a command and control server at icc[.]ignorelist[.]com.\n\nSimilar to RIPTIDE and HIGHTIDE, the WATERSPOUT backdoor is an HTTP-based backdoor that\n\ncommunicates with its C2 server.\n\nGET /<string>/<5 digit number>/<4 character string>.php?<first 3\ncharacters of last string>_id=<43 character string>= HTTP/1.1\nAccept: image/jpeg, application/x-ms-application, image/gif,\napplication/xaml+xml, image/pjpeg, application/x-ms-xbap, */*\nUser-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1;\nTrident/4.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET\nCLR 3.0.30729; .NET4.0C; .NET4.0E)\nHost: <C2 Location>\nCache-Control: no-cache\n\n**Figure 6: Sample GET request for WATERSPOUT backdoor**\n\nAlthough there are no current infrastructure ties to link this backdoor to APT12, there are several data\n\npoints that show a possible tie to the same actors:\n\nSame initial delivery method (spear phishing email) with a Microsoft Word Document exploiting\n\nCVE-2012-0158.\n\nThe same “Tran Duy Linh” Microsoft Word Exploit Kit was used in delivery of this backdoor.\n\nSimilar Targets were observed where the threat actors utilized this backdoor.\n\nJapanese Tech Company\n\nTaiwanese Government Organizations\n\nOrganizations in the Asia-Pacific Region that are of Interest to China\n\nThe WATERSPOUT backdoor was written to the same file path as the HIGHTIDE backdoors:\n\nC:\\DOCUMENTS and SETTINGS\\{user}\\LOCAL SETTINGS\\Temp\\word.exe\n\nC:\\DOCUMENTS and SETTINGS\\{user}\\LOCAL SETTINGS\\Temp\\winword.exe\n\nWATERSPOUT was compiled within two days of the last HIGHTIDE backdoor and on the same day\n\nas the THREEBYTE backdoor.\n\nAlthough these points do not definitively tie WATERSPOUT to APT12, they do indicate a possible\n\nconnection between the WATERSPOUT campaign, the THREEBYTE campaign, and the HIGHTIDE\n\ncampaign attributed to APT12.\n\n\n-----\n\nFireEye believes the change from RIPTIDE to HIGHTIDE represents a temporary tool shift to decrease\n\nmalware detection while APT12 developed a completely new malware toolset. These development efforts\n\nmay have resulted in the emergence of the WATERSPOUT backdoor.\n\n**Figure 7: Compile dates for all three malware families**\n\nAPT12’s adaptations to public disclosures lead FireEye to make several conclusions about this threat\n\ngroup:\n\nAPT12 closely monitors online media related to its tools and operations and reacts when its tools are\n\npublicly disclosed.\n\nAPT12 has the ability to adapt quickly to public exposures with new tools, tactics, and procedures\n\n(TTPs).\n\nPublic disclosures may result in an immediate change in APT12’s tools. These changes may be\n\ntemporary and FireEye believes they are aimed at decreasing detection of their tools until a more\n\npermanent and effective TTP change can be implemented (e.g., WATERSPOUT).\n\nThough public disclosures resulted in APT12 adaptations, FireEye observed only a brief pause in APT12\n\nactivity before the threat actors returned to normal activity levels. Similarly, the public disclosure of\n\nAPT12’s intrusion at the New York Times also led to only a brief pause in the threat group’s activity and\n\nimmediate changes in TTPs. The pause and retooling by APT12 was covered in the Mandiant 2014 M\nTrends report. Currently, APT12 continues to target organizations and conduct cyber operations using its\n\nnew tools. Most recently, FireEye observed HIGHTIDE at multiple Taiwan-based organizations and the\n\nsuspected APT12 WATERSPOUT backdoor at a Japan-based electronics company. We expect that APT12\n\nwill continue their trend and evolve and change its tactics to stay ahead of network defenders.\n\n[Note: IOCs for this campaign can be found here.](https://github.com/fireeye/iocs/blob/master/2384c8ce-6eca-4d06-8aa4-151b53d9a6bc.ioc)\n\n[This entry was posted in Botnets, Targeted Attack, Threat Intelligence, Threat Research and tagged](http://www.fireeye.com/blog/category/technical/botnet-activities-research)\n\n[advanced malware, advanced persistent threat, advanced targeted attack, advanced threat actor, APT12,](http://www.fireeye.com/blog/tag/advanced-malware)\n\n\n-----\n\n[permalink.](http://www.fireeye.com/blog/technical/botnet-activities-research/2014/09/darwins-favorite-apt-group-2.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/aj0b81yqt1fe6ufuklxuirvh8hawnnjb",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.09.03.Darwin_APT/Darwin_fav_APT_Group.pdf"
    ],
    "report_names": [
        "Darwin_fav_APT_Group"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d18fe42c-8407-4f96-aee0-a04e6dce219a",
            "created_at": "2023-01-06T13:46:38.275292Z",
            "updated_at": "2025-03-27T02:00:02.79092Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "Calc Team",
                "IXESHE",
                "BRONZE GLOBE",
                "BeeBus",
                "DynCalc",
                "DNSCalc",
                "Crimson Iron",
                "NUMBERED PANDA",
                "TG-2754",
                "Group 22"
            ],
            "source_name": "MISPGALAXY:APT12",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6a660ea2-1118-404a-9f8f-f0d6a1e9f184",
            "created_at": "2022-10-25T15:50:23.685924Z",
            "updated_at": "2025-03-27T02:00:55.52357Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "APT12",
                "IXESHE",
                "DynCalc",
                "Numbered Panda",
                "DNSCALC"
            ],
            "source_name": "MITRE:APT12",
            "tools": [
                "Ixeshe",
                "RIPTIDE",
                "HTRAN"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c5f79f58-db78-4cd7-88cf-c029a2199360",
            "created_at": "2022-10-25T16:07:23.325227Z",
            "updated_at": "2025-03-27T02:02:09.738383Z",
            "deleted_at": null,
            "main_name": "APT 12",
            "aliases": [
                "APT 12",
                "BeeBus",
                "Bronze Globe",
                "CTG-8223",
                "Calc Team",
                "Crimson Iron",
                "DNSCalc",
                "DynCALC",
                "Group 22",
                "Numbered Panda"
            ],
            "source_name": "ETDA:APT 12",
            "tools": [
                "AUMLIB",
                "ETUMBOT",
                "Exploz",
                "Graftor",
                "HIGHTIDE",
                "IHEATE",
                "IXESHE",
                "RIPTIDE",
                "RapidStealer",
                "Specfix",
                "THREEBYTE",
                "bbsinfo",
                "mswab",
                "yayih"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6e26922-3f4f-4243-9af5-cf9bea8b93bd",
            "created_at": "2022-10-25T16:47:55.577163Z",
            "updated_at": "2025-03-27T02:05:17.26824Z",
            "deleted_at": null,
            "main_name": "BRONZE GLOBE",
            "aliases": [
                "CTG-8223 ",
                "DNSCalc",
                "DyncCalc",
                "Numbered Panda ",
                "APT12 "
            ],
            "source_name": "Secureworks:BRONZE GLOBE",
            "tools": [
                " BeepService",
                " Etumbot",
                " Gh0st RAT",
                " Ixeshe",
                " Mswab",
                " RAdmin",
                " Seatran",
                " SvcInstaller",
                " Ziyang",
                "Badpuck"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041584,
    "ts_creation_date": 1409928121,
    "ts_modification_date": 1409928121,
    "files": {
        "pdf": "https://archive.orkl.eu/c24ba893644a149a1f05432c392a716251dca72f.pdf",
        "text": "https://archive.orkl.eu/c24ba893644a149a1f05432c392a716251dca72f.txt",
        "img": "https://archive.orkl.eu/c24ba893644a149a1f05432c392a716251dca72f.jpg"
    }
}