{
    "id": "d14bb909-c490-498c-921a-fd91786d366e",
    "created_at": "2023-01-12T15:09:45.441175Z",
    "updated_at": "2025-03-27T02:15:35.735444Z",
    "deleted_at": null,
    "sha1_hash": "2477158cdfbfdd4a6bffa4a1bb547b5ba69a6284",
    "title": "2021-01-05 - Earth Wendigo Injects JavaScript Backdoor to Service Worker for Mailbox Exfiltration",
    "authors": "",
    "file_creation_date": "2022-05-28T18:10:17Z",
    "file_modification_date": "2022-05-28T18:10:17Z",
    "file_size": 1153434,
    "plain_text": "# Earth Wendigo Injects JavaScript Backdoor for Mailbox Exfiltration\n\n**[trendmicro.com/en_us/research/21/a/earth-wendigo-injects-javascript-backdoor-to-service-worker-for-.html](https://www.trendmicro.com/en_us/research/21/a/earth-wendigo-injects-javascript-backdoor-to-service-worker-for-.html)**\n\nJanuary 5, 2021\n\nWe discovered a new campaign that has been targeting several organizations — including government organizations,\nresearch institutions and universities in Taiwan — since May 2019, aiming to exfiltrate emails from targeted organizations via\nthe injection of JavaScript backdoors to a webmail system that is widely-used in Taiwan. With no clear connection to any\nprevious attack group, we gave this new threat actor the name “Earth Wendigo.”\n\nAdditional investigation shows that the threat actor also sent spear-phishing emails embedded with malicious links to\nmultiple individuals, including politicians and activists, who support movements in Tibet, the Uyghur region, or Hong Kong.\nHowever, this is a separate series of attacks from their operation in Taiwan, which this report covers.\n\nFigure 1. The attack flow of Earth Wendigo’s operation\n\n\n-----\n\nFigure 2. An\n\nexample of a spear-phishing email sent by Earth Wendigo to a democracy activist. The text mentions that someone had tried\nto log in to the user’s account and that Google had blocked the login attempt. The blue button says, “Check here.”\n\n## Initial Access and Propagation\n\nThe attack begins with a spear-phishing email that is appended with obfuscated JavaScript. Once the victim opens the email\non their webmail page, the appended JavaScript will load malicious scripts from a remote server operated by the threat\nactor. The scripts are designed to perform malicious behaviors, including:\n\nStealing browser cookies and webmail session keys and then sending them to the remote server.\nAppending their malicious script to the victim’s email signature to propagate the infection to their contacts.\nExploiting a webmail system’s cross-site scripting (XSS) vulnerability to allow their malicious JavaScript to be injected\non the webmail page permanently.\n[Registering a malicious JavaScript code to Service Worker, a web browser feature that allows JavaScript to intercept](https://developers.google.com/web/fundamentals/primers/service-workers)\nand manipulate HTTPS requests between client and server. The registered Service Worker script can hijack login\ncredentials and modify the webmail page to add malicious scripts in case the attackers were unable to inject the XSS\nvulnerability mentioned above. (This is also the first time we found an in-the-wild attack that leverages Service Worker.)\n\n## Exfiltration of the mailbox\n\nAfter the attackers gain a foothold into the system — either through XSS injection or Service Worker — the next (and final\npart) of the attack chain, the exfiltration of the mailbox, is initiated.\n\nThe Earth Wendigo threat actor will establish a WebSocket connection between the victims and their WebSocket server via\na JavaScript backdoor. The WebSocket server instructs the backdoor on the victim’s browser to read emails from the\nwebmail server and then send the content and attachments of the emails back to the WebSocket server. We will share more\ndetails of the attack chain in the following paragraphs.\n\nThe victim will receive a spear-phishing email disguised as an advertisement with a discount coupon from an online\nshopping website — however, an obfuscated malicious JavaScript is embedded inside. The email leverages the webmail\nsystem’s search suggestion function to trigger the webpage to execute their script instead of directly running the malicious\nscript. This is done to evade static security checks.\n\n\n-----\n\nThe email will generate multiple email search requests to the webmail system via the CSS function backgroup image using\ntheir malicious code as a search keyword to make the system register it as a frequently searched keyword. Next, a new\n“embed” HTML element is created to load the result of the search suggestion by finding the keyword “java” on the webmail\nserver.\n\nThe returned suggestion is the JavaScript code that was searched during the first step and has now been indirectly loaded\nand used to execute the malicious code. This approach allows the threat actor to hide their malicious code inside CSS\nelements to prevent detection by security solutions that employ static analysis. At the end of this step, the code will create\nanother new script element that will load other malicious JavaScript codes from remote servers.\n\nFigure 3. The\n\nspear-phishing email disguised as an advertisement for a shopping coupon\n\nFigure 4. The malicious JavaScript hidden inside the CSS element\nInterestingly, we found many other emails that have injected their malicious JavaScript code at the bottom to load their\nmalicious code from remote servers. However, these emails don’t look like phishing emails and seemed more like real email\nsent from normal users within the same organization.\n\nFurther investigation revealed that the attacker had modified the victims’ email signatures through malicious code injection.\nThis means that all of the emails sent by the victim with the modified mail signature will have the malicious code appended\nat the end, which is how we found a normal email that was also injected with malicious code. We think the threat actor used\nthis approach to attempt to infect the victim’s contacts for further propagation.\n\n\n-----\n\nFigure 5. Malicious\n\nscript appended on the victim’s email signature\n\nFigure 6. The malicious script used to read and modify the victim’s email signature.\nAs soon as the user executes the malicious script in the email, a cookie stealer script will be delivered and launched on the\nbrowser. The script generates a request to “/cgi-bin/start,” which is a wrapper page embedded with the webmail session key.\nThe script will then extract the session key from the page while also collecting browser cookies.\n\nThe script will send an HTTP GET request to remove the server with all the collected keys and cookies appended on the\nquery string to transfer the stolen information. The framework used to deliver and manage these XSS attack scripts is called\n“XSSER.ME” or “XSS Framework.” The stolen session keys and browser cookies are also sent to the framework to store in\nthe database.\n\nWhile a stolen session key may allow the attacker to log into their target’s webmail system without a password, note that this\nis not the Earth Wendigo operation's ultimate goal.\n\n\n-----\n\nFigure 7. The malicious script to steal the browser cookie and session key\n\n## Infection of email accounts\n\nAfter the initial execution of malicious code with the approaches we mentioned above, the attacker implemented steps to\nensure that their malicious script would be constantly loaded and executed by their targets.\n\nThe actor prepared two different infection methods. The first involves injecting malicious code into the webpage via an XSS\nvulnerability on the webmail system. The vulnerability, which exists inside the webmail system’s shortcut feature, allows\nusers to create links on the webmail front page.\n\nThe attacker can add a shortcut with a crafted payload by exploiting the XSS vulnerability, which replaces part of the original\nscript from the webmail system with malicious JavaScript code. If this is successful, the victim will load the malicious code\nwhenever they access the webmail page with the malicious shortcut added.\n\nNote that the infection will not impact all of the users on the system simultaneously, but only those with infected mail\naccounts. We have reported the vulnerability to the company that developed the webmail system, which informed us that the\nvulnerability had been fixed since January 2020. It should not affect those who are using the latest version of the webmail\nsystem.\n\nFigure 8. A shortcut containing malicious code that was added to the webmail system\n\nFigure 9. The query format used to trigger the XSS vulnerability\n\n## Service Worker script exploitation\n\n\n-----\n\nAnother way the threat actor infects victims is by registering malicious JavaScript to the Service Worker script, which is a\nprogrammable network proxy inside the browser that provides an extended layer for websites and web applications to\n[handle their communications while the network is unreachable. The security risk of Service Worker has been discussed and](https://chromium.googlesource.com/chromium/src/+/master/docs/security/service-worker-security-faq.md)\n[demonstrated by both PoC work and academic research — for example, a registered Service Worker could intercept and](https://shadow-workers.github.io/)\nmanipulate the requests between the client and the web server.\n\nBy examining one of the malicious scripts from the Earth Wendigo campaign, we discovered that it uploaded the tampered\nService Worker script to the webmail server disguised as an original script provided by the server. It then registers the\nuploaded script to the user’s Service Worker before removing it from the server immediately after registration.\n\nThe registered Service Worker script checks the URL path from an intercepted request and performs various responses:\n\nFor HTTPS POST requests sent to “/cgi-bin/login,” which is the API for the authentication of webmail user login and\ncontains the username and password pair, the Service Worker script will copy the pair and send it to a remote server.\nFor requests sent to “/cgi-bin/start,” which is a page wrapper used to show the main webmail page, the Service Worker\nscript will reply by sending another page to the victim. This new page is almost similar to the original wrapper but\ninjected with a script element meant to load malicious script from Earth Wendigo’s server. Therefore, the victim also\nloads the malicious script with the replaced wrapper page whenever they access the webmail server with the malicious\nService Worker enabled in the background.\n\nFigure 10. The malicious script used to upload and register the Service Worker script\n\nFigure 11. The Service Worker script used to steal credentials and reply to the user with a modified wrapper page\n\n\n-----\n\nFigure 12. The wrapper page with the malicious script (highlighted)\n\n## Email exfiltration\n\nAt the end of the attack, Earth Wendigo delivers a JavaScript code that then creates a WebSocket connection to a remote\nserver and executes the script returned from the server. We found that the returned script is a backdoor that gets its\ninstructions from the WebSocket server. It has only one command, “get(‘URL’),” to perform a request from the victim’s\nbrowser to the webmail server and collect the response back to the WebSocket server. The usage of the backdoor we found,\nin this case, is for the mailbox exfiltration.\n\nFigure 13. The email exfiltration flow with\n\nWebSocket backdoor\n\nFigure 14. The script used to establish\n\nWebSocket communication\n\nFigure 15.\n\nThe main script of the backdoor used to get the URL payload and send it back to the WebSocket server\n\n\n-----\n\nFigure 16. An example of WebSocket communication traffic and email exfiltration flow\nA typical sequence used for mailbox exfiltration:\n\n1.   The WebSocket server returns a backdoor script that is executed on the victim’s browser\n\n2.   The backdoor sends the webmail session key, browser cookies, webpage location, and browser user agent string back\nto the WebSocket server to register the victim’s information\n\n3.   The WebSocket server sends the command “get(‘/cgi-bin/folder_tree2?cmd=…’)” to grab the list of existing mailboxes\nunder the victim’s mail account\n\n4.   The WebSocket server sends the command “get(‘/cgi-bin/msg_list?cmd=…’)” to grab the list of emails inside a mailbox\nthat they are interested in reading\n\n5.   The WebSocket server sends the command, “get(‘/cgi-bin/msg_read?cmd=pring_mail&…’)” to read the email listed in\nthe response seen in the previous step; it reads each email sequentially from the mailbox and sends it back to the\nWebSocket server\n\n6.   If a stolen email has attachments, the WebSocket server sends the command “get(‘att:/cgi-bin/downfile/…’)” to grab\nthe relevant attachment from the webmail server and slice it into 4096 bytes as chunks to return to the WebSocket server.\n\nThese steps are repeatedly performed until they receive the victim’s entire mailbox.\n\n## Additional Findings\n\nBesides their attack on webmail servers, we also found multiple malware variants used by Earth Wendigo. These malware\nvariants, which are written in Python and compiled as Windows executables, communicate to a malicious domain — the\nsame one used in this attack.\n\n[Most of them are shellcode loaders that load embedded shellcode likely from Cobalt Strike. Some of them are backdoors](https://www.trendmicro.com/en/research/17/k/cobalt-spam-runs-use-macros-cve-2017-8759-exploit.html)\nthat will communicate with the command and control (C&C)) server to request and execute additional python code. However,\nwe don’t know what code they delivered because the server was already down when we were verifying the malware\nvariants. It’s also not clear how they were delivered to the victims.\n\n\n-----\n\nFigure 17. The Python script decompiled from the malware\n\n## Conclusion\n\n[While Earth Wendigo uses typical spear-phishing techniques to initiate their attack, the threat actor also uses many atypical](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/spear-phishing)\ntechniques to infiltrate the targeted organizations, such as the use of mail signature manipulation and Service Worker\ninfection.\n\nThe impact of spear-phishing attacks can be minimized by following security best practices, which include refraining from\nopening emails sent by suspicious sources. We also encourage both users and organizations to upgrade their servers to the\nlatest version to prevent compromise via vulnerability exploits.\n\n[To avoid XSS attacks similar to what we described in this report, we recommend adapting Contant-Security-Policy (CSP) for](https://help.deepsecurity.trendmicro.com/10/0/Manage-Components/enable-content-security-policy-public-key-pinning.html)\nwebsites.\n\n## Indicators of Compromise\n\n**Indicator** **Description** **Detection**\n\nmail2000tw[.]com Domain\noperated by\nEarth\nWendigo\n\nbf[.]mail2000tw[.]com Domain\noperated by\nEarth\nWendigo\n\nadmin[.]mail2000tw[.]com Domain\noperated by\nEarth\nWendigo\n\n\n-----\n\ngoogletwtw[.]com Domain\noperated by\nEarth\nWendigo\n\nbf[.]googletwtw[.]com Domain\noperated by\nEarth\nWendigo\n\nws[.]googletwtw[.]com Domain\noperated by\nEarth\nWendigo\n\nadmin[.]googletwtw[.]com Domain\noperated by\nEarth\nWendigo\n\nanybodyopenfind[.]com Domain\noperated by\nEarth\nWendigo\n\nsupport[.]anybodyopenfind[.]com Domain\noperated by\nEarth\nWendigo\n\nsupports[.]anybodyopenfind[.]com Domain\noperated by\nEarth\nWendigo\n\nsupportss[.]anybodyopenfind[.]com Domain\noperated by\nEarth\nWendigo\n\na61e84ac9b9d3009415c7982887dd7834ba2e7c8ea9098f33280d82b9a81f923 Earth\nWendigo\n\nXSS attack\nscript\n\n66cf12bb9b013c30f9db6484caa5d5d0a94683887cded2758886aae1cb5c1c65 Earth\nWendigo\n\nXSS attack\nscript\n\n4cdaca6b01f52092a1dd30fc68ee8f6d679ea6f7a21974e4a3eb8d14be6f5d74 Earth\nWendigo\n\nXSS attack\nscript\n\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\n\n-----\n\nf50a589f3b3ebcc326bab55d1ef271dcec372c25d65f381a409ea85929a34b49 Earth\nWendigo\n\nXSS attack\nscript\n\ne047aa878f9e7a55a80cc1b70d0ac9840251691e91ab6454562afbff427b0879 Earth\nWendigo\n\nXSS attack\nscript\n\na1a6dc2a6c795fc315085d00aa7fdabd1f043b28c68d4f98d4152fe539f026f1 Earth\nWendigo\n\nXSS attack\nscript\n\n10d2158828b953ff1140376ceb79182486525fd14b98f743dafa317110c1b289 Earth\nWendigo\n\nXSS attack\nscript\n\n0e04a03afa5b66014457136fb4d437d51da9067dc88452f9ebd098d10c97c5b8 Earth\nWendigo\n\nXSS attack\nscript\n\n75f3f724a2bfda1e74e0de36ff6a12d3f2ea599a594845d7e6bc7c76429e0fa4 Earth\nWendigo\n\nXSS attack\nscript\n\nc3bc364409bb0c4453f6d80351477ff8a13a1acdc5735a9dff4ea4b3f5ad201c Earth\nWendigo\n\nXSS attack\nscript\n\n5251087bb2a0c87ac60c13f2edb7c39fb1ea26984fcc07e4cf8b39db31ce2b08 Earth\nWendigo\n\nXSS attack\nscript\n\n7fa9a58163dd233065a86f9ed6857ed698fc6e454e6b428ea93f4f711279fb61 Earth\nWendigo\n\nXSS attack\nscript\n\nf568f823959be80a707e05791718c1c3c377da1b0db1865821c1cf7bc53b6084 Earth\nWendigo\n\nXSS attack\nscript\n\na54d58d5a5812abaede3e2012ae757d378fb51c7d3974eaa3a3f34511161c1db Earth\nWendigo\n\nXSS attack\nscript\n\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\n\n-----\n\n77c3d62cce21c2c348f825948042f7d36999e3be80db32ac98950e88db4140b1 Earth\nWendigo\n\nXSS attack\nscript\n\nc0dabb52c73173ea0b597ae4ad90d67c23c85110b06aa3c9e110a852ebe04420 Earth\nWendigo\nService\nWorker\nscript\n\nefe541889f3da7672398d7ad00b8243e94d13cc3254ed59cd547ad172c1aa4be Earth\nWendigo\nWebSocket\nJavaScript\nbackdoor\n\n2411b7b9ada83f6586278e0ad36b42a98513c9047a272a5dcb4a2754ba8e6f1d Earth\nWendigo\nShellcode\nLoader\n\n1de54855b15fc55b4a865723224119029e51b381a11fda5d05159c74f50cb7de Earth\nWendigo\nShellcode\nLoader\n\nd935c9fe8e229f1dabcc0ceb02a9ce7130ae313dd18de0b1aca69741321a7d1b Earth\nWendigo\nShellcode\nLoader\n\n50f23b6f4dff77ce4101242ebc3f12ea40156a409a7417ecf6564af344747b76 Earth\nWendigo\nShellcode\nLoader\n\nfab0c4e0992afe35c5e99bf9286db94313ffedc77d138e96af940423b2ca1cf2 Earth\nWendigo\nShellcode\nLoader\n\n4d9c63127befad0b65078ccd821a9cd6c1dccec3e204a253751e7213a2d39e39 Earth\nWendigo\nShellcode\nLoader\n\n25258044c838c6fc14a447573a4a94662170a7b83f08a8d76f96fbbec3ab08e2 Earth\nWendigo\nShellcode\nLoader\n\n13952e13d310fb5102fd4a90e4eafe6291bc97e09eba50fedbc2f8900c80165f Earth\nWendigo\nShellcode\nLoader\n\n\nTrojan.JS.WENDIGOE.A\n\nTrojan.JS.WENDIGOE.A\n\nBackdoor.JS.WENDIGOE.A\n\nTrojan.Win32.WENDIGOE.A\n\nTrojan.Win32.WENDIGOE.A\n\nTrojan.Win32.WENDIGOE.B\n\nTrojan.Win32.WENDIGOE.C\n\nTrojan.Win32.WENDIGOE.C\n\nTrojan.Win32.WENDIGOE.C\n\nTrojan.Win32.WENDIGOE.C\n\nTrojan.Win32.WENDIGOE.C\n\n\n-----\n\nccb7be5a5a73104106c669d7c58b13a55eb9db3b3b5a6d3097ac8b68f2555d39 Earth\nWendigo\nShellcode\nLoader\n\n40a251184bb680edadfa9778a37135227e4191163882ccf170835e0658b1e0ed Earth\nWendigo\nShellcode\nLoader\n\n0d6c3cc46be2c2c951c24c695558be1e2338635176fa34e8b36b3e751ccdb0de Cobalt\nStrike\n\n\nTrojan.Win64.WENDIGOE.A\n\nTrojan.Win64.WENDIGOE.B\n\nTrojan.Win32.COBALT.SM\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-05 - Earth Wendigo Injects JavaScript Backdoor to Service Worker for Mailbox Exfiltration.pdf"
    ],
    "report_names": [
        "2021-01-05 - Earth Wendigo Injects JavaScript Backdoor to Service Worker for Mailbox Exfiltration.pdf"
    ],
    "threat_actors": [
        {
            "id": "501fec31-9b82-487b-bad5-736645148ddc",
            "created_at": "2022-10-25T16:07:23.569989Z",
            "updated_at": "2025-03-27T02:02:09.870956Z",
            "deleted_at": null,
            "main_name": "Earth Wendigo",
            "aliases": [],
            "source_name": "ETDA:Earth Wendigo",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a1063e48-c06a-4bdd-bb56-03654dd2c690",
            "created_at": "2023-01-06T13:46:39.39909Z",
            "updated_at": "2025-03-27T02:00:03.075982Z",
            "deleted_at": null,
            "main_name": "Earth Wendigo",
            "aliases": [],
            "source_name": "MISPGALAXY:Earth Wendigo",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536185,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653761417,
    "ts_modification_date": 1653761417,
    "files": {
        "pdf": "https://archive.orkl.eu/2477158cdfbfdd4a6bffa4a1bb547b5ba69a6284.pdf",
        "text": "https://archive.orkl.eu/2477158cdfbfdd4a6bffa4a1bb547b5ba69a6284.txt",
        "img": "https://archive.orkl.eu/2477158cdfbfdd4a6bffa4a1bb547b5ba69a6284.jpg"
    }
}