{
    "id": "d19c82ab-4156-4070-91c5-160270f1e563",
    "created_at": "2023-01-12T15:01:10.531776Z",
    "updated_at": "2025-03-27T02:09:18.455109Z",
    "deleted_at": null,
    "sha1_hash": "e36b1a2f03b7bfd8a9f4255b4d7295450e311967",
    "title": "2021-03-12 - Spear-Phishing Campaign Distributes Nim-Based Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T16:49:59Z",
    "file_modification_date": "2022-05-28T16:49:59Z",
    "file_size": 167613,
    "plain_text": "# Spear-Phishing Campaign Distributes Nim-Based Malware\n\n**[healthcareinfosecurity.com/spear-phishing-campaign-distributes-nim-based-malware-a-16176](https://www.healthcareinfosecurity.com/spear-phishing-campaign-distributes-nim-based-malware-a-16176)**\n\n[Cybercrime,](https://www.healthcareinfosecurity.com/cybercrime-c-416) [Fraud Management & Cybercrime,](https://www.healthcareinfosecurity.com/fraud-management-cybercrime-c-409) [Fraud Risk Management](https://www.healthcareinfosecurity.com/fraud-risk-management-c-410)\n\nNimzaLoader Uses Nim Programming Language to Avoid Detection [Prajeet Nair](https://www.healthcareinfosecurity.com/authors/prajeet-nair-i-3483)\n[(@prajeetspeaks) • March 12, 2021](https://www.twitter.com/@prajeetspeaks)\n\nTA800 targets individuals with tailored phishing emails. (Source: Proofpoint)\nAn ongoing spear-phishing campaign by the threat group TA800 is distributing a new\nmalware loader based on the Nim programming language that's designed to help avoid\n[detection, according to the cybersecurity company Proofpoint.](https://www.proofpoint.com/us/blog/threat-insight/nimzaloader-ta800s-new-initial-access-malware)\n\n**See Also:** OnDemand | Understanding Human Behavior: Tackling Retail's ATO & Fraud\nPrevention Challenge\n\n“TA800 has predominantly used BazaLoader since April of 2020, but on February 3, 2021\nthey distributed this new malware we are calling NimzaLoader,” says Sherrod DeGrippo,\nsenior director of Proofpoint's threat research and detection team. “This malware is exclusive\nto TA800, and we've only seen it distributed once. This could be a sign of more to come.”\n\n\n-----\n\nLewis Jones, threat intelligence analyst at cybersecurity company Talion, notes: The use of\nNim is uncommon for malware in the threat landscape. However we have recently seen a\nNim-based downloader used by the Zebrocy threat group. It is likely that the threat actors are\nswitching to Nim to avoid detection by defense teams who may not be familiar with the\nlanguage.\"\n\nProofpoint researchers also found evidence suggesting NimzaLoader is being used to\ndownload and execute Cobalt Strike as its secondary payload.\n\n## NimzaLoader Malware\n\nOn Feb. 3, researchers discovered the Nim-based malware was being distributed via\nphishing. The messages are often designed to look as if they came from within the targeted\ncompany, DeGrippo says. “Lures have included hard-to-resist subjects, such as payments,\nmeetings, termination, bonuses and complaints in the subject line or body of the email,” he\nsays\n\nThe message contained links portrayed as a PDF preview that are actually links to a\nGetResponse (an email marketing service) landing page, Proofpoint discovered.\n\n\"The landing pages contained a link to the 'PDF' which was the NimzaLoader executable\nhosted on Slack and used a fake Adobe icon in an attempt to fool the user,\" the researchers\nnote.\n\nNim-related strings used by the malware are encrypted when stored by using an XOR-based\nalgorithm and a single key per string. One of those encrypted strings is a timestamp used as\nan expiration date for the malware, Proofpoint says.\n\n\"At the time of research, all known NimzaLoader C2s were down, but a public malware\nsandbox run seems to show it receiving a 'powershell' command that ultimately delivered a\nCobalt Strike beacon,\" the researchers say. \"We are unable to validate or confirm this\nfinding, but it does align with past TA800 tactics, techniques and procedures.\"\n\n## Evolving Tactics\n\nThe switch to using Nim is a good example of how threat actors are constantly changing\ntactics to avoid detection, Jones says.\n\n\"The activity has so far been linked to TA800, who are a threat group that has targeted a\nwide range of industries infecting victims with banking Trojans and malware loaders,\" Jones\nsays. \"Previous activity by the group has often shown how the group has completed initial\nreconnaissance on targets to specifically target individuals with tailored phishing emails\nattempting to look more genuine and increasing success of the campaigns.\"\n\n\n-----\n\nIn the fourth quarter of last year, TA800 was responsible for a wave of attacks against the\nhealthcare sector using a loader called BazaLoader DeGrippo says. “BazaLoader, under the\ncontrol of a separate threat actor, subsequently installed a ransomware strain called Ryuk.”\n\nDeGrippo says Proofpoint's analysis corroborates analysis by other researchers that\nNimzaLoader is not a BazaLoader variant. That's because NimzaLoader is written in a\ndifferent programming language and does not use the same code-flattening obfuscator.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-12 - Spear-Phishing Campaign Distributes Nim-Based Malware.pdf"
    ],
    "report_names": [
        "2021-03-12 - Spear-Phishing Campaign Distributes Nim-Based Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "cf32661e-7543-4b57-8665-7f8101a000e9",
            "created_at": "2023-01-06T13:46:39.322379Z",
            "updated_at": "2025-03-27T02:00:03.050728Z",
            "deleted_at": null,
            "main_name": "TA800",
            "aliases": [],
            "source_name": "MISPGALAXY:TA800",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535670,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653756599,
    "ts_modification_date": 1653756599,
    "files": {
        "pdf": "https://archive.orkl.eu/e36b1a2f03b7bfd8a9f4255b4d7295450e311967.pdf",
        "text": "https://archive.orkl.eu/e36b1a2f03b7bfd8a9f4255b4d7295450e311967.txt",
        "img": "https://archive.orkl.eu/e36b1a2f03b7bfd8a9f4255b4d7295450e311967.jpg"
    }
}