{
    "id": "d1eecfa8-c1c4-4956-847b-93030248933f",
    "created_at": "2025-01-15T02:05:37.082851Z",
    "updated_at": "2025-03-27T02:17:23.103327Z",
    "deleted_at": null,
    "sha1_hash": "adbc2cca12f4a142966c0958bdffa4f784ad0f59",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-09-23T19:11:52Z",
    "file_modification_date": "2024-09-23T19:11:56Z",
    "file_size": 2277802,
    "plain_text": "#### 2 - 4 October, 2024 / Dublin, Ireland\n\n# SUGARCOATING KANDYKORN: A SWEET DIVE INTO A SOPHISTICATED MACOS BACKDOOR\n\n## Salim Bitam\n\n### Elastic, The Netherlands\n\n#### salim.bitam@elastic.co\n\n www virusbulletin com\n\n\n-----\n\n**ABSTRACT**\n\nKANDYKORN is a novel macOS backdoor recently discovered by Elastic Security Labs during an intrusion targeting\nblockchain engineers at a prominent crypto exchange platform. With macOS devices increasingly becoming prime targets,\nthe discovery of KANDYKORN sheds light on new trends being adopted by cybercriminals and state-sponsored actors.\n\nOperating covertly, KANDYKORN employs a feature-rich multi-staged loader paired with a custom network protocol to\nfacilitate a range of post-compromise activities. Its diverse functionality includes capabilities that enable lateral movement\nand data exfiltration while allowing the adversary to remain under the radar.\n\nKANDYKORN serves as a prime example of how mature threat groups are adapting to new techniques and targeting their\nvictims. By leveraging social media platforms like Discord with enticing lures, these actors are finding new paths into\nhighly targeted environments.\n\n**INTRODUCTION**\n\n_Elastic Security Labs disclosed a novel intrusion in late 2023 that specifically targeted blockchain engineers working for a_\ncryptocurrency exchange platform. This intrusion exemplifies the advanced tactics employed by threat actors, combining\ncustom-developed tools with publicly available open-source capabilities to achieve both initial access and post-exploitation\nobjectives.\n\nThis intrusion was discovered during an investigation into attempts to reflectively load a binary into memory on a macOS\nendpoint. Further analysis revealed that the intrusion began with a Python application disguised as a cryptocurrency\narbitrage bot, which was distributed through a direct message on a public Discord server. This method of delivery\nhighlights innovative and deceptive strategies used by attackers to exploit trusted communication channels.\n\nThis paper will explore the specifics of the intrusion, detailing how the victim was compromised through social engineering\ntactics and the initial code used to achieve the initial stage of compromise. We will provide an in-depth analysis of\nKANDYKORN, focusing on its multi-stage loaders, the obfuscation techniques employed, and its diverse capabilities.\nAdditionally, we will discuss the development of a custom tool designed to interact with KANDYKORN, enabling the\nsimulation of the threat.\n\n**THE INGENIOUS IMPERSONATION: INITIAL COMPROMISE**\n\nThe threat group behind KANDYKORN impersonated members of the blockchain engineering community on a public\n_Discord server frequented by the community members. Through social engineering, the attackers convinced an initial_\nvictim to download and decompress a ZIP archive containing malicious code. The victim believed they were installing an\narbitrage bot, a software tool designed to profit from cryptocurrency rate differences between platforms.\n\nThe software is a Python application packaged in a ZIP file titled Cross-Platform Bridges.zip. Decompressing it\nreveals a main.py script accompanied by a folder named order_book_recorder, housing 13 individual Python scripts.\n\n_Figure 1: Extracted ZIP with Python scripts._\n\nThe victim ran the Python script (main.py), which initially appeared benign. However, upon closer inspection of the other\nfiles within the downloaded package, a file named watcher.py caught our attention. This Python script contained a\nvariable with a Google Drive URL, indicating a potential connection to an external resource. The script downloads the\ncontent and saves it to a file in ./_log/testSpeed.py.\n\n\n-----\n\n_Figure 2: Python snippet downloading testSpeed.py._\n\nThe created file (./_log/testSpeed.py) is then imported as a module, executing the contents of the script. Upon\ncompletion of the execution, the file is deleted to cover its tracks.\n\n_Figure 3: Python snippet deletes testSpeed.py._\n\n**The first wave: droppers and FinderTools**\n\nWhen executed, the newly dropped file (testSpeed.py) establishes an outbound network connection and fetches another\nPython file from a Google Drive URL, named FinderTools. This new file is saved to the /Users/Shared/ directory.\n\n_Figure 4: Outbound request to download FinderTools._\n\nNext, testSpeed.py executes FinderTools, initializing a new outbound network connection with the following URL as\nan argument: tp-globa[.]xyz//OdhLca1mLUp/lZ5rZPxWsh/7yZKYQI43S/fP7savDX6c/bfC.\n\n_Figure 5: Execution of FinderTools._\n\n_Figure 6: Outbound connection from FinderTools._\n\n\n-----\n\n```\nFinderTools is yet another dropper, downloading and executing a hidden second-stage payload (.sld) written to the \n/Users/Shared/ directory.\n\n```\n_Figure 7: Execution of .sld (SUGARLOADER)._\n\n**SUGARLOADER’s hidden layers: decoding the .sld payload**\n\nThe .sld file, a 64-bit macOS binary which we named SUGARLOADER, is an obfuscated binary used twice under two\nseparate names, .sld and .log. The first instance of SUGARLOADER is located at /Users/shared/.sld. The second\ninstance, renamed to .log, is employed as a persistence mechanism.\n\n**_Obfuscation_**\n\nThe main code of SUGARLOADER is packed; before the execution of the start function __mod_init_func is\nexecuted, which contains the unpacking code for SUGARLOADER.\n\nNumerous junk instructions, opaque predicates and indirect jumps in memory are present within the packed code,\ncomplicating the analysis of the unpacking process. An easy way to unpack the code is to put a hardware breakpoint at the\nstart of the packed code. It’s worth noting that a hardware breakpoint is essential due to the preliminary memory checksum\nvalidation performed with the CRC32 algorithm before unpacking occurs.\n\n_Figure 8: Assembly code obfuscation with dead code._\n\nAt the time of the research in late 2023 the sample had zero detections on VirusTotal, mainly due to the packed code.\n\n_Figure 9: SUGARLOADER binary with zero hits in VirusTotal._\n\n**_Execution flow_**\n\nSUGARLOADER is a loader that fetches a macOS binary from the command-and-control server (C2) and reflectively\nloads it in memory. It can take the configuration (C2 address and port) from the command line or from a configuration file\nnamed /Library/Caches/com.apple.safari.ck.\n\n\n-----\n\n_Figure 10: SUGARLOADER arguments handling pseudocode._\n\nThis configuration file is encrypted/decrypted using RC4 with a hard-coded 64-byte key and is utilized by both\nSUGARLOADER and KANDYKORN for establishing secure network communications.\n\nA C2 server can be identified either by a fully qualified URL (c2_urls) or by an IP address and port (c2_ip_address).\nThe system supports two C2 servers: a primary server and a secondary fallback server. This redundancy is a common tactic\nemployed by malicious actors to maintain persistent connectivity with the victim, even if the primary C2 server is taken\ndown or blocked. Additionally, the malware includes a sleepInterval setting, which defines the default time interval it\nwaits between executing separate actions.\n\nThe last step taken by SUGARLOADER is to download and execute a final stage payload from the C2 server. It takes\nadvantage of a technique known as reflective binary loading to execute the final stage, leveraging APIs such as\n```\nNSCreateObjectFileImageFromMemory or NSLinkModule.\n\n```\n_Figure 11: SUGARLOADER code injection._\n\nSUGARLOADER reflectively loads KANDYKORN, creating a new file initially named appname, which we refer to as\nHLOADER. This name was taken directly from the process code signature’s signing identifier.\n\n_Figure 12: HLOADER code signature signing ID._\n\n**HLOADER’s Discord deception: unravelling stage 3**\n\nHLOADER was identified through the use of a macOS binary code-signing technique previously associated with the\nDPRK’s Lazarus Group, notably seen in the 3CX intrusion [1]. Elastic Security Labs has recognized this technique as an\nindicator of DPRK campaigns, as highlighted in our June 2023 research publication on JOKERSPY [2].\n\nHLOADER’s is a self-signed binary written in Swift; it’s main purpose is to create persistence on the system through\nexecution flow hijacking [3] of the widely used chat application Discord. This application is often configured by users as a\nlogin item and launched when the system boots, making it an attractive target for takeover. It also indicates that the author\nhad a clear understanding of their victims.\n\n\n-----\n\nThe purpose of this loader is to execute both the legitimate Discord bundle and the .log payload (SUGARLOADER), the\nlatter of which is used to execute Mach-O binary files from memory without writing them to disk.\n\nThe legitimate Discord binary, /Applications/Discord.app/Contents/MacOS/Discord, was renamed to .lock\nand replaced by HLOADER.\n\n_Figure 13: Renaming of Discord binary to .lock._\n\nWhen executed, HLOADER performs a series of operations. First, it renames itself from Discord to MacOS.tmp. Then,\nit renames the legitimate Discord binary from .lock to Discord. Next, it executes both Discord and .log using\n```\nNSTask.launchAndReturnError. Finally, it renames both files back to their original names.\n\n```\nThe process tree shown in Figure 14 visually depicts how persistence is obtained. The root node Discord is actually\nHLOADER disguised as the legitimate app. As presented above, it first runs .lock, which is in fact Discord, and, alongside,\nspawns SUGARLOADER as a process named .log.\n\n_Figure 14: Process tree analyser._\n\n**Final form: unveiling KANDYKORN’s stage 4 payload**\n\nKANDYKORN is the final stage of this execution chain and possesses a full-featured set of capabilities to access and\nexfiltrate data from the victim’s computer. Elastic Security Labs was able to retrieve this payload from one C2 server which\nhadn’t been deactivated yet.\n\nKANDYKORN processes are forked and run in the background as daemons before loading their configuration file from\n```\n/Library/Caches/com.apple.safari.ck.\n\n```\n_Figure 15: KANDYKORN forking itself after loading its configuration._\n\n\n-----\n\nAn intriguing aspect worth noting is that the binary of KANDYKORN appears to be compiled in debug mode; it contains\nall its symbols, allowing for comprehensive analysis and understanding of its internal structure and functionality.\nAdditionally, the malware prints debugging information during execution.\n\n_Figure 16: KANDYKORN compiled in debug._\n\nThe configuration file is read into memory then decrypted using the same RC4 key, and parsed for C2 settings. The\ncommunication protocol is similar to prior stages using the victim ID value for authentication.\n\n_Figure 17: Commands handling of KANDYKORN._\n\n\n-----\n\nBelow is the KANDYKORN command handler table:\n\n**ID** **Name** **Description**\n\n0xD1 N/A Exit command.\n\n0xD2 resp_basicinfo Gathers information about the system such as hostname, uid, osinfo,\nand image path of the current process, and reports back to the server.\n\n0xD3 resp_file_dir Lists content of a directory and formats the output similar to ls -al,\nincluding type, name, permissions, size, acl, path, and access time.\n\n0xD4 resp_file_prop Recursively reads a directory and counts the number of files,\nnumber of subdirectories, and total size.\n\n0xD5 resp_file_upload Used by the adversary to upload a file from their C2 server to the\nvictim’s computer. This command specifies a path, creates it, and\nthen proceeds to download the file content and write it to the\nvictim’s computer.\n\n0xD6 resp_file_down Used by the adversary to transfer a file from the victim’s computer\nto their infrastructure.\n\n0xD7 resp_file_zipdown Archives a directory and exfiltrates it to the C2 server. The\nnewly created archive’s name has the following pattern\n/tmp/tempXXXXXXX.\n\n0xD8 resp_file_wipe Overwrites file content to zero and deletes the file. This is a\ncommon technique used to impede recovery of the file through\ndigital forensics on the filesystem.\n\n0xD9 resp_proc_list Lists all running processes on the system along with their PID, UID\nand other information.\n\n0xDA resp_proc_kill Kills a process by specified PID.\n\n0xDB resp_cmd_send Executes a command on the system by using a pseudoterminal.\n\n0xDC resp_cmd_recv Reads the command output from the previous command,\nresp_cmd_send.\n\n0xDD resp_cmd_create Spawns a shell on the system and communicates with it via a\npseudoterminal. Once the shell process is executed, commands are\nread and written through the /dev/pts device.\n\n0xDE resp_cfg_get Sends the current configuration to the C2 from\n/Library/Caches/com.apple.safari.ck.\n\n0xDF resp_cfg_set Downloads a new configuration file to the victim’s machine. This is\nused by the adversary to update the C2 hostname that should be\nused to retrieve commands from.\n\n0xE0 resp_sleep Sleeps for a number of seconds.\n\n_Table 1: KANDYKORN command handler table._\n\nThe malware incorporates error code reporting to the C2 server, but with a limited range of values. For instance, the\ncommand process_module::resp_file_zipdown features two distinct error codes: the value 0xFFFFFC1A is\ndesignated to signify an issue encountered during ZIP manipulation, while 0xFFFFFC18 indicates a networking problem\nwith the C2.\n\n|ID|Name|Description|\n|---|---|---|\n|0xD1|N/A|Exit command.|\n|0xD2|resp_basicinfo|Gathers information about the system such as hostname, uid, osinfo, and image path of the current process, and reports back to the server.|\n|0xD3|resp_file_dir|Lists content of a directory and formats the output similar to ls -al, including type, name, permissions, size, acl, path, and access time.|\n|0xD4|resp_file_prop|Recursively reads a directory and counts the number of files, number of subdirectories, and total size.|\n|0xD5|resp_file_upload|Used by the adversary to upload a file from their C2 server to the victim’s computer. This command specifies a path, creates it, and then proceeds to download the file content and write it to the victim’s computer.|\n|0xD6|resp_file_down|Used by the adversary to transfer a file from the victim’s computer to their infrastructure.|\n|0xD7|resp_file_zipdown|Archives a directory and exfiltrates it to the C2 server. The newly created archive’s name has the following pattern /tmp/tempXXXXXXX.|\n|0xD8|resp_file_wipe|Overwrites file content to zero and deletes the file. This is a common technique used to impede recovery of the file through digital forensics on the filesystem.|\n|0xD9|resp_proc_list|Lists all running processes on the system along with their PID, UID and other information.|\n|0xDA|resp_proc_kill|Kills a process by specified PID.|\n|0xDB|resp_cmd_send|Executes a command on the system by using a pseudoterminal.|\n|0xDC|resp_cmd_recv|Reads the command output from the previous command, resp_cmd_send.|\n|0xDD|resp_cmd_create|Spawns a shell on the system and communicates with it via a pseudoterminal. Once the shell process is executed, commands are read and written through the /dev/pts device.|\n|0xDE|resp_cfg_get|Sends the current configuration to the C2 from /Library/Caches/com.apple.safari.ck.|\n|0xDF|resp_cfg_set|Downloads a new configuration file to the victim’s machine. This is used by the adversary to update the C2 hostname that should be used to retrieve commands from.|\n|0xE0|resp_sleep|Sleeps for a number of seconds.|\n\n\n-----\n\n_Figure 18: Process_module::resp_file_zipdown command pseudocode._\n\n**NETWORK PROTOCOL**\n\nBoth KANDYKORN and SUGARLOADER use the RC4 algorithm to encrypt their communications. When the malware\nfirst connects to the C2 server during the initialization phase, a handshake must be validated to proceed. The client\ngenerates a value using rand(), which, due to the lack of seeding, is predictable. This random value is sent to the C2 server,\nwhich responds with a nonce value. The malware then calculates a challenge by performing a left rotation of 16 bits on the\nnonce and doing a bitwise AND operation with the random value. The result is sent back to the server. If the server\nvalidates the challenge and it is correct, it responds with a constant value, 0x41C3372, allowing the malware to continue\nexecution and establish a connection. Once the connection is established, the client sends its unique ID taken from the\nconfiguration file and awaits commands from the server. Subsequent data exchanges are serialized using a common schema\nfor binary objects, with the content length sent first, followed by the payload.\n\n_Figure 19: Handshake pseudocode._\n\n\n-----\n\nThe following is a packet capture showcasing the download of a binary from the C2 by SUGARLOADER.\n\n_Figure 20: Packet capture of an instance of KANDYKORN execution._\n\n**TOOLS: CUSTOM SERVER**\n\nTo support the malware analysis process for KANDYKORN, we developed a custom tool using Python that acts as the C2\nserver. This tool is designed to interact with the malware, allowing us to gain a deeper understanding of KANDYKORN’s\nfeatures, control flow, and structures. By emulating the threat in a controlled environment, this tool facilitates the\ndevelopment of effective detection mechanisms.\n\nIn order to simulate the whole flow, the server expects SUGARLOADER to connect first; it will then serve KANDYKORN\nfrom disk. After that, the user is presented with a list of commands to execute.\n\nFigure 21 is a code snippet of the implementation.\n\n_Figure 21: Custom server._\n\n\n-----\n\n**CONCLUSION**\n\nIn this paper, we took a deep dive into the inner workings of KANDYKORN, an advanced macOS backdoor uncovered\nduring an intrusion targeting engineers at a major crypto exchange platform.\n\nKANDYKORN represents a notable evolution in cyber threats, showcasing sophisticated features aimed at infiltrating and\ncompromising macOS devices, which are increasingly becoming prime targets for cybercriminals. Operating discreetly,\nKANDYKORN employs a complex multi-stage loader and a custom network protocol to carry out various\npost‑compromise activities.\n\nAdditionally, we have developed a custom tool to interact with KANDYKORN throughout our research. This tool not only\nfacilitates the emulation of the threat in a controlled environment, but also serves as a valuable asset for researchers and\ndefenders. It enables the ability to validate security measures and devise effective detection mechanisms.\n\n**REFERENCES**\n\n[1] Stepanic, D.; Sprooten, R.; Desimone, J.; Bousseaden, S.; Kerr, D. Elastic users protected from SUDDENICON’s\n[supply chain attack. Elastic Security Labs. 5 May 2023. https://www.elastic.co/security-labs/elastic-users-](https://www.elastic.co/security-labs/elastic-users-protected-from-suddenicon-supply-chain-attack)\n[protected-from-suddenicon-supply-chain-attack.](https://www.elastic.co/security-labs/elastic-users-protected-from-suddenicon-supply-chain-attack)\n\n[2] Wilhoit, C.; Bitam, S.; Goodwin, S.; Pease, A.; Ungureanu, R. Initial research exposing JOKERSPY.\n[Elastic Security Labs. 21 June 2023. https://www.elastic.co/security-labs/inital-research-of-jokerspy.](https://www.elastic.co/security-labs/inital-research-of-jokerspy)\n\n[3] [MITRE ATT&CK. Hijack Execution Flow. https://attack.mitre.org/techniques/T1574/.](https://attack.mitre.org/techniques/T1574/)\n\n[4] Wilhoit, C.; Ungureanu, R.; Goodwin, S.; Pease, A. Elastic catches DPRK passing out KANDYKORN.\n[Elastic Security Labs. 1 November 2023. https://www.elastic.co/security-labs/elastic-catches-dprk-passing-out-](https://www.elastic.co/security-labs/elastic-catches-dprk-passing-out-kandykorn)\n[kandykorn.](https://www.elastic.co/security-labs/elastic-catches-dprk-passing-out-kandykorn)\n\n**INDICATORS OF COMPROMISE (IOCs)**\n\n|INDICATORS OF COMPROMISE (IOCs)|Col2|Col3|Col4|\n|---|---|---|---|\n|Observable|Type|Name|Reference|\n|3ea2ead8f3cec030906dcbffe3efd5c5d77d5d37 5d4a54cca03bfe8a6cb59940|SHA-256|SUGARLOADER|.log .sld|\n|2360a69e5fd7217e977123c81d3dbb60bf4763a9 dae6949bc1900234f7762df1|SHA-256|HLOADER|Discord (fake) HLOADER|\n|http://tp-globa[.]xyz//OdhLca1mLUp/ lZ5rZPxWsh/7yZKYQI43S/fP7savDX6c/bfC|url||FinderTools C2 URL|\n|tp-globa[.]xyz|domain-name||FinderTools C2 domain|\n|192.119.64[.]43|ipv4-addr|tp-globa IP address|FinderTools C2 IP|\n|23.254.226[.]90|ipv4-addr||SUGARLOADER C2|\n|D9F936CE628C3E5D9B3695694D1CDE79E470E938 064D98FBF4EF980A5558D1C90C7E650C2362A21B 914ABD173ABA5C0E5837C47B89F74C5B23A7294C C1CFD11B|64 bytes key|RC4 key|SUGARLOADER KANDYKORN|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.virusbulletin.com/uploads/pdf/conference/vb2024/papers/Sugarcoating-KANDYKORN-a-sweet-dive-into-a-sophisticated-MacOS-backdoor.pdf"
    ],
    "report_names": [
        "Sugarcoating-KANDYKORN-a-sweet-dive-into-a-sophisticated-MacOS-backdoor.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1736906737,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1727118712,
    "ts_modification_date": 1727118716,
    "files": {
        "pdf": "https://archive.orkl.eu/adbc2cca12f4a142966c0958bdffa4f784ad0f59.pdf",
        "text": "https://archive.orkl.eu/adbc2cca12f4a142966c0958bdffa4f784ad0f59.txt",
        "img": "https://archive.orkl.eu/adbc2cca12f4a142966c0958bdffa4f784ad0f59.jpg"
    }
}