{
    "id": "d25ad016-d330-417c-a969-a5c60aef69cb",
    "created_at": "2023-01-12T15:06:32.454237Z",
    "updated_at": "2025-03-27T02:14:11.959403Z",
    "deleted_at": null,
    "sha1_hash": "4c0f94944be544fc109ae98e8edd49cd7d91661a",
    "title": "2022-08-19 - Cybercriminals Are Targeting Law Enforcement Agencies Worldwide",
    "authors": "",
    "file_creation_date": "2022-09-01T10:23:30Z",
    "file_modification_date": "2022-09-01T10:23:30Z",
    "file_size": 3687609,
    "plain_text": "# Cybercriminals are targeting law enforcement agencies worldwide\n\n**[resecurity.com/blog/article/cybercriminals-are-targeting-law-enforcement-agencies-worldwide](https://resecurity.com/blog/article/cybercriminals-are-targeting-law-enforcement-agencies-worldwide)**\n\n[Back](https://resecurity.com/blog)\nCybercrime Intelligence\n\n19 Aug 2022\ncybercrime, law enforcement, public safety, unauthorized access\n\n\n-----\n\nResecurity registered an increase in malicious activity targeting law enforcement agencies\nat the beginning of Q2 2022.\n\nThreat actors are hacking e-mail accounts belonging to law enforcement officers, their aim\nis to leverage the accounts for further malicious purposes. Typically, they leverage social\nengineering tactics, however one of the recent trends is to address fake subpoenas and so\ncalled EDR’s (Emergency Data Requests) to major technology companies and onlineservices such as Apple, Facebook (Meta), Snapchat, Discord to maliciously collect\nsensitive information about their targets.\n\nThreat actors are looking for billing history, geographical location, phone calls, text history,\nand other sensitive details which could be used to leverage extortion or cyberespionage\npurposes. Such incidents have become especially notable in cybercriminal group activities\nsuch as LAPSUS$ and Recursion Group.\n\nResecurity has observed multiple marketplaces in the Dark Web where cybercriminals\nhave monetized accounts and credentials belonging to police officers of various foreign\ncountries (e-mails, VPNs, SSO, etc.). One such email account has previously been used\nto send fake EDR requests on behalf of the Bangladesh Police which has been recently\n[covered in a Bloomberg article where the CEO of Resecurity Gene Yoo was quoted. The](https://www.bloomberg.com/news/articles/2022-04-28/it-felt-fishy-kids-game-operator-rebuffed-fake-data-request)\nprice of such accounts is typically not different from any other compromised accounts and\nvaries in range between $20-$35 but in some cases independent actors with bigger\naccess may sell it in a range of $1,000-$10,000.\n\n\n-----\n\naccount\n\naccount\n\n\nCompromised email\n\nCompromised email\n\n\nThe incident has been timely reported by Resecurity to BGD e-Gov CIRT (Bangladesh eGovernment Computer Incident Response Team) and over 5 compromised law\nenforcement accounts have been successfully recovered for further risk mitigation.\n\nOne of the biggest concerns – the visible security of the law enforcement IT infrastructure,\nwhich may create a significant risk to our society not just in cyberspace, but in real life too.\nTerrorists and extremist groups may leverage such access for malicious purposes.\n\nThe trend is continuing, and more law enforcement organizations have been impacted by\ncyberattacks this month. Just recently, the Conti ransomware group attacked the\nIntelligence Agency in Peru and leaked their data which created a significant precedent in\nthe security community. Cybercriminals were extorting DIGIMIN, one of the national\nagencies, asking for payment in cryptocurrency.\n\n\n-----\n\nConti Ransomware\n\nGroup\n\nDDOS Secrets - another notable group of threat actors, has released 285,635 leaked\nemails from Nauru Police. The motivation of actors was different - hacktivists attempted to\nhighlight possible abuses endured by asylum-seekers and refugees based on the island\nand to make them public.\n\nThe bad actor in Dark Web offered for sale Shanghai Police database including 1B+\nrecords about Chinese citizens. Multiple postings have been identified around July 2 with\nreference to actor \"ChinaDan\". According to several sources, the actor was offering 23\nTerabytes of data for sale.\n\nLater, this information has been offered by other independent actors for 3 BTC ($60,500).\nUsing anonymous channels and IM like Telegram the actors were looking to monetize the\nstolen data in Dark Web.\n\n\n-----\n\nJuly 5, 2022 - the bad actor was offering access to Indian law enforcement portal and\ngovernment resources in India. Based on further analysis, the credentials and associated\ndata offered by the actor were likely compromised by password stealers such as Mars\nStealer, X-Files Stealer or Azorult.\n\n\n-----\n\nCybercriminals abuse law enforcement databases and offer various illegal services in Dark\nWeb creating significant risk for users' privacy. Using unauthorized access or insider\ncontacts they're able to extract sensitive information and to monetize it in the underground.\nJuly 3, 2022 - there was identified an actor Mr.Eagle selling a \"look-up\" service for 500\neuro (per query / per person).\n\n\n-----\n\nLast year, the bad actor released a dump of data presumably originating from an unnamed\nlaw enforcement system in Turkey. Notably, 6 years ago a hacker going by the online alias\nROR[RG] has released a large amount of data that belonged to a Turkish National Police\ndatabase and it's thought to contain large amounts of sensitive private information.\nROR[RG] is aligned with the Anonymous hacktivist group and has leaked the data that\nwas supposedly stolen from Turkish General Directorate of Security (EGM) onto a number\nof peer-to-peer sites for anyone to download and examine. The data was released through\nThe Cthulu website, which has been a host of a number of leaks by members of\nAnonymous in the past, including a serious hack against a US Police union.\n\n\n-----\n\nIn context of ongoing geopolitical tensions, bad actors are actively attacking law\nenforcement WEB-sites leveraging various types of DDoS activity to create protest\nnarratives.\n\nThe bad actor was offering a dump of hacked law enforcement portals in Jamaica. Based\non further assessment, he was able to exploit a MySQL injection vulnerability in one of the\ninsecure modules of the official Jamaica Federal Police WEB-site.\n\n\n-----\n\nBad actors released a road traffic & vehicle database of Kazakhstan presumably acquired\nfrom a law enforcement system. Such access allows to check car numbers, vehicles\nregistration, and other PII related to citizens. Such offerings are also available\ncommercially in Dark Web covering different geographical regions. The cost of \"look-up\"\nvaries from $50 to $250.\n\nThe bad actor was selling compromised database of WEB-application presumably\nbelonging to a law enforcement in Indonesia. The stolen data also included internal\ncommunications and law enforcement employee information.\n\n\n-----\n\nThe bad actors are also offering abuse service of law enforcement agencies, technically\nleading to fake incidents notifications and other types of malicious activity. While some of\nsuch tactics may look primitive, unfortunately, they may generate serious damage to\ninnocent people on practice.\n\n\n-----\n\nResecurity identified multiple underground services selling police reports about individuals\nwhat allows bad actors to collect sensitive information. Such services can be widely used\nby foreign intelligence and organized crime to target individuals and organizations of\ninterest.\n\n\n-----\n\n-----\n\nIndonesia Police / POLRI DB\n\n**DATABASE COUNTRY : Indonesia**\n\n\n-----\n\n**DATABASE STATES: 34 Province in Indonesia.**\n\n**DATABASE RECORD : +/- 467.149 Police Personnel Full info.**\n\n**DATABASE LEAK YEAR: 2021**\n\nWE ALWAYS ACCEPT ESCROW\n\n**DATABASE FORMAT: TXT**\n\n**DATABASE CONTENTS:**\n\n_Ranks - Name - Unit - Email - Mobile Number_\n\n**DATABASE SAMPLE:**\n\n(431692, 'KOMPOL', AGUS SUWONDO, SH', 'GADIK MUDA 13 SPN POLDA JATIM,\n08121631273, 'a.suwondo@yahoo.com', '2021-11-03 16:09:23'),\n\n(431694, \"KOMPOL', 'TOTOK NUR ARIFIN, S.H. KANIT II SUBDIT III DITRESNARKOBA\nPOLDA JATIM '03170797878/081230557878. ', 'ditresnarkobapoldajatim@yahoo.co.id',\n'2021-11-03 16:09:23'),\n\n(431695, 'KOMPOL', SUHARTI, KAURBIA SUBBIDBIA\n\nResecurity® is committed to protecting consumers and enterprises all over the globe, and\nis actively involved in public-private partnerships to share actionable cyber threat\nintelligence (CTI) with financial institutions, technology companies and law enforcement to\nultimately minimize the risk of credentials being compromised and data breaches being\nexecuted.\n\n## Newsletter\n\nKeep up to date with the latest cybersecurity news and developments.\n\nBy subscribing, I understand and agree that my personal data will be collected and\n[processed according to the Privacy and](https://resecurity.com/privacy-policy) [Cookies Policy](https://resecurity.com/cookies-policy)\n\n\n-----\n\n## Cloud Architecture\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-19 - Cybercriminals Are Targeting Law Enforcement Agencies Worldwide.pdf"
    ],
    "report_names": [
        "2022-08-19 - Cybercriminals Are Targeting Law Enforcement Agencies Worldwide.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535992,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1662027810,
    "ts_modification_date": 1662027810,
    "files": {
        "pdf": "https://archive.orkl.eu/4c0f94944be544fc109ae98e8edd49cd7d91661a.pdf",
        "text": "https://archive.orkl.eu/4c0f94944be544fc109ae98e8edd49cd7d91661a.txt",
        "img": "https://archive.orkl.eu/4c0f94944be544fc109ae98e8edd49cd7d91661a.jpg"
    }
}