{
    "id": "d26ae079-cb5c-4fc7-b09f-1529b58c65ab",
    "created_at": "2023-01-12T14:59:01.735766Z",
    "updated_at": "2025-03-27T02:09:39.355224Z",
    "deleted_at": null,
    "sha1_hash": "232e04ed9f6b88dd59869f66963ef1a030757a87",
    "title": "2016-09-29 - TeamXRat- Brazilian cybercrime meets ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T02:02:03Z",
    "file_modification_date": "2022-05-28T02:02:03Z",
    "file_size": 943272,
    "plain_text": "# TeamXRat: Brazilian cybercrime meets ransomware\n\n**[securelist.com/blog/research/76153/teamxrat-brazilian-cybercrime-meets-ransomware/](https://securelist.com/blog/research/76153/teamxrat-brazilian-cybercrime-meets-ransomware/)**\n\nBrazilian cybercriminals are notorious for their ability to develop banking trojans but now they\nhave started to focus their efforts in new areas, including ransomware. We discovered a new\nvariant of a Brazilian-made ransomware, Trojan-Ransom.Win32.Xpan, that is being used to\ninfect local companies and hospitals, directly affecting innocent people, encrypting their files\nusing the extension “.___xratteamLucked” and asking to pay the ransom.\n\nThe Kaspersky Anti-Ransom team decrypted the Xpan Trojan, allowing them to rescue the\nfiles of a Hospital in Brazil that had fallen victim to this Ransomware family.\n\nActually, this is not the first ransomware to come out of Brazil. In the past, we investigated\n[TorLocker and its flawed encryption, which was created and negotiated worldwide by a](https://securelist.com/a-flawed-ransomware-encryptor/69481/)\n[Brazilian cybercriminal. We also saw a lot of copycats use HiddenTear in local attacks.](https://securelist.com/the-evolution-of-brazilian-malware/74325/#ransomware)\nTrojan Ransom Xpan was created by an organized gang, which used targeted attacks via\n**RDP that abused weak passwords and wrong implementations.**\n\nIn this post, we’ll explain this new Ransomware family and how Brazilian coders are creating\nnew ransomware from scratch.\n\n## The group behind the attack\n\n\n-----\n\nThe group identifies itself as **TeamXRat and** **CorporacaoXRat .**\n_(Translating from Portuguese to English as “CorporationXRat”)_\n\nTheir first ransom trojan consisted of using a simple XOR based encryption, described by\nsome victims [here (most of the victims are from Brazil). The new version of Xpan](http://www.bleepingcomputer.com/forums/t/623659/team-xrat-ransomware-help-and-support-topic-c0rp0rc0xr-extension/)\nRansomware shows that the cybercriminals behind it have improved the code to make it\nmore complex, also switching the encryption scheme.\n\nThe ransom texts used by the group are written in Portuguese from Brazil. The messages do\nnot inform how much the victim has to pay to retrieve their files, nor the payment method\nrequired (which is usually Bitcoins). Instead, they instruct the victim to send an email to one\nof the anonymous email services Mail2Tor or Email.tg. For example,\ncorporacaoxrat@mail2tor.com, xRatTeam@mail2tor.com and xratteam@email.tg providing\nthe public key used by the ransomware to encrypt the files. Older versions of this\nransomware also used e-mail accounts from another Email service – Protonmail, such as\ncorporacaoxrat@protonmail.com, currently deactivated.\n\nWhen the victim gets in touch with the group, they start to negotiate the ransom payment. All\ncommunication is in Portuguese and they request 1 btc (about 603 USD) to decrypt the files.\nThe group also claims that the payment is a “donation” arguing that “they exploited flaws in\nyour system and carried out the attack in order to make sure you increase your security”.\nFinally, the cybercriminals also offer to decrypt one file for free:\n\n\n-----\n\n_For me only the donation is important. Not your files. If your files are important to you, I_\n_advise you to make the donation; otherwise, you’ll lose all your files”_\n\n## Xpan, how it works\n\nThe sample is UPX packed. Once executed it checks the default language of the infected\nsystem set in the following registry key:\nHKLM\\SYSTEM\\CONTROLSET001\\CONTROL\\NLS\\LOCALE\n\nIn addition, it’s able to query local time and obtain the computer name from the registry using\nseveral commands like net.exe, sc.exe, and taskkill.exe. Interestingly, it also deletes any\nProxy setting defined in the system, located in:\nHKCU\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET\nSETTINGS\\ZONEMAP.\n\nSince the targets are companies and corporations, the group might use proxies blocking\naccess to certain Web resources. It is highly probable that this technique is used to “set\nvictim’s free” while emailing the attackers or accessing BTC resources online.\n\nAfter completing its execution, the ransomware displays the following image in the affected\nsystem:\n\n_“All your files were encrypted using a RSA 2048 bits encryption”_\n\n\n-----\n\nThe sample is written in C++ and uses STL, being built as a console application. During the\nlenght of its execution, it logs all its actions to the console, only to clear it once the encryption\nprocess has finished.\n\nThe operation of this malware is ‘guided’ by the configuration data block stored inside the\nbody of the Trojan:\n\n_Decrypted configuration block_\n\nThe configuration contains the following details:\n\nDrive letters which will be processed;\nDenylisted substrings: the files whose path contain any of these strings will not be\nencrypted;\nRansomware text message for the victim;\nExtension of the encrypted files (in this case, .____xratteamLucked);\nName of the file with ransom notes;\nConsole commands to be executed prior to the process of file encryption;\nConsole commands to be executed after the encryption;\nA public RSA-2048 key in the MSBLOB format.\n\n\n-----\n\n_Part of the pseudocode of the main procedure_\n\n## From Xorist to Xpan\n\nA previous ransomware sample that was believed to be part of the TeamXRat ransomware\ncampaign used a simple encryption algorithm known as TEA (or Tiny Encryption Algorithm).\nAfter comparing this original version (dubbed Xorist) against this new Xpan variant, we could\nobserve that now they are using an AES-256 encryption scheme.\n\n\n-----\n\n_Xorist ransomware TEA constant_\n\n_Xpan ransomware now has evolved to use AES-256 encryption_\n\n\n-----\n\nXorist Xpan\n\n\nWill automatically start when user is logged in. It uses\nthe following registry key for persistence:\nSOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\n\n\nNo persistence used.\n\n\nTiny Encryption Algorithm AES-256\n\nASM, MS Linker C++, MinGW compiler\n\nIncludes a list of files that are to be encrypted. Will encrypt everything except\n.exe and .dll files and files with\ndenylisted substrings in the path.\n\nThe developers have clearly shifted their development procedures in the Xpan malware. It’s\ntypical for cybercriminals to evolve their techniques once a decryption method has been\nfound for their ransomware, or that specific variant is widely detected.\n\n_List of file extensions that Xorist ransomware will search and encrypt_\n\n## File Encryption\n\nThe trojan uses the implementation of cryptographic algorithms provided by MS CryptoAPI.\nThe files are encrypted by AES-256 in CBC mode.\n\n\n-----\n\nThere are 2 known versions of this trojan that can be distinguished by their extensions. The\n1st one uses “___xratteamLucked” (3 ‘_’ symbols) and the second one –\n**“____xratteamLucked” (4 ‘_’ symbols).**\n\nThese 2 versions employ different techniques to encrypt the files, which we will describe in\nmore detail.\n\n**Version 1 (3 ‘_’ symbols in the extension)**\n\nThe trojan generates a single 255-symbol password for all files. This password is encrypted\nby RSA-2048 and put into the ransom note (concatenated with the public key). Then the\ntrojan produces a 256-bit key from this password using the API CryptDeriveKey; this key will\nbe used to encrypt all files.\n\nWhen processing each file, the malware adds the string ‘NMoreira’ to the beginning of the\noriginal file and encrypts the file content by 245-byte blocks using the AES-256 algorithm in\nCBC mode. Each block is additionally XOR’ed with a random byte which is stored before the\npadding of the corresponding block.\n\n**Version 2 (4 ‘_’ symbols in the extension)**\n\nFor each file, the trojan generates a new 255-symbol password, encrypts this password by\nRSA-2048 and puts this data into the beginning of each encrypted file. Then, the trojan\nproduces a 256-bit key from this password using the API CryptDeriveKey, and uses this key\nto encrypt the original file content (AES-256 CBC).\n\nFile search and encryption is carried out by multiple threads, each thread processes its disk.\n\n\n-----\n\n_Ransomware in action: console output inform the files encrypted_\n\nAfter encryption is completed, the malware will change the wallpaper in the desktop and\ndisplay this file, with the ransom note:\n\n_The ransom note, in Portuguese_\n\n\n-----\n\nBefore encrypting the data in the affected system, the ransomware executes the following\ncommands, aiming to stop popular database services, to be sure that database files will be\nencrypted as well, so they cause a greater damage to the victim:\n\necho Iniciando pre comandos\n\necho Parando Firbird\nsc config FirebirdServerDefaultInstance start=disabled\ntaskkill /IM fb_inet_server.exe /F\nnet stop FirebirdServerDefaultInstance\n\necho parando SQL SERVE\n\ntaskkill /IM sqlservr.exe /F\nsc config MSSQLSERVER start=disabled\nsc config MSSQL$SQLEXPRESS start=disabled\nnet stop MSSQLSERVER\nnet stop MSSQL$SQLEXPRESS\n\necho parando poostgree\ntaskkill /IM pg_ctl.exe /F\nsc config postgresql-9.0 start=disabled\nnet stop postgresql-9.0\n\nAfter the execution, the ransomware deletes itself from the system, to remove the original\ninfector:\n\n@echo off\ngoto Delete\n:WaitAndDelete\n@timeout 5\n:Delete\n@del “path\\sample_name.exe”\nif exist “path\\sample_name.exe”\ngoto WaitAndDelete\n@del %0\n\nAfter the encryption has finished, the trojan modifies the registry to add a custom handler for\nthe action of double-clicking on any of the encrypted files. As a result, when the victim clicks\non a file with the extension “.____xratteamLucked“, the command stored in the registry is\nexecuted, and this command shows the ransom notes in a new window using msg.exe (a\nstandard utility which is a part of Windows distribution).\n\n\n-----\n\n_Windows Registry modified by the ransom_\n\n## How they attack\n\nMost of the attacks performed by TeamXRat are performed manually, installing the\nransomware in the hacked server. To achieve that, they perform RDP (Remote Desktop\n**Protocol) brute force attacks. Connecting remote desktop servers directly to the Internet is**\nnot recommended and brute forcing them is nothing new; but without the proper controls in\nplace to prevent or at least detect and respond to compromised machines, brute force RDP\nattacks are still relevant and something that cybercriminals enjoy. Once the server is\ncompromised, the attacker manually disables the Antivirus product installed on the server\nand proceeds with the infection itself.\n\n[We are also aware that vulnerabilities such as MS15-067 and](https://docs.microsoft.com/en-us/security-updates/securitybulletins/2015/ms15-067) [MS15-030 in the RDP](https://docs.microsoft.com/en-us/security-updates/SecurityBulletins/2015/ms15-030)\nprotocol, which allow remote code execution if an attacker sends a specially crafted\nsequence of packets to a targeted system, can be used by cybercriminals if a server is not\npatched and exposed to attacks.\n\nAs we saw in the recent [xDedic research, vulnerable servers with exposed RDP connections](https://securelist.com/xdedic-the-shady-world-of-hacked-servers-for-sale/75027/)\nare very valuable assets in the hands of cybercriminals. Not surprisingly, Brazil was the\ncountry with the most compromised servers being offered in the underground market to any\ncybercriminal.\n\n\n-----\n\n_xDedic: compromised Brazilian RDP servers were available in the underground market_\n\n## Decryption: we can help!\n\nIf the victim pays the ransom, the cybercriminals will send this tool to decrypt the files:\n\n_Decryption tool sent by the bad guy after payment_\n\n\n-----\n\nBut the good news is that the Kaspersky Anti-Ransom team was able to break the encryption\nused by the Xpan Trojan. This effort made possible the decryption of files belonging to a\nHospital in Brazil, which was hit by this Ransomware family.\n\nIf you’re a victim of this new Ransomware family and need help to decrypt your files, please\nDON’T PAY the ransom. Instead, contact us via [support.](http://support.kaspersky.com/)\n\n## Conclusion\n\nAs we can see, Brazilian bad guys are now diversifying their “business” with new\nransomware families developed from scratch, abandoning older versions that used XOR\nencryption and adopting new, more robust encryption algorithms. This is a clear signal that\nthey have started to explore new schemes with new targets and newer types of attacks.\n\nAs we [forecasted in the beginning of this year, we expect ransomware attacks to gain ground](https://securelist.com/kaspersky-security-bulletin-2016-predictions/72771/#the-nightmare-of-ransomware-continues)\non banking trojans and to transition into other platforms. Ransomware has two advantages\nover traditional banking threats: direct monetization using an anonymous payment system\n(usually Bitcoin), and relatively low cost per victim. Certainly, this is very attractive to\nBrazilian crooks, well-known for their banking trojans development. Brazilian law\nenforcement is very good at catching criminals (although they are not always convicted and\nimprisoned) by “following the money”, something that we know it’s not entirely possible for\nBitcoin payments.\n\nWe detect this new threat as\n\n**Trojan-Ransom.Win32.Xpan.a and PDM:Trojan.Win32.Generic.**\n\nWe’ll keep an eye out or new variants, which surely will appear from same or other threat\nactors.\n\nMD5 reference: 34260178f9e3b2e769accdee56dac793\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-09-29 - TeamXRat- Brazilian cybercrime meets ransomware.pdf"
    ],
    "report_names": [
        "2016-09-29 - TeamXRat- Brazilian cybercrime meets ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "4e98dd18-e285-4e15-a810-4962bed803e9",
            "created_at": "2023-01-06T13:46:38.492471Z",
            "updated_at": "2025-03-27T02:00:02.847392Z",
            "deleted_at": null,
            "main_name": "TeamXRat",
            "aliases": [
                "CorporacaoXRat",
                "CorporationXRat"
            ],
            "source_name": "MISPGALAXY:TeamXRat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535541,
    "ts_updated_at": 1743041379,
    "ts_creation_date": 1653703323,
    "ts_modification_date": 1653703323,
    "files": {
        "pdf": "https://archive.orkl.eu/232e04ed9f6b88dd59869f66963ef1a030757a87.pdf",
        "text": "https://archive.orkl.eu/232e04ed9f6b88dd59869f66963ef1a030757a87.txt",
        "img": "https://archive.orkl.eu/232e04ed9f6b88dd59869f66963ef1a030757a87.jpg"
    }
}