{
    "id": "d2abd729-da04-4aa4-8055-56a49cf0b82b",
    "created_at": "2023-01-12T15:02:11.94824Z",
    "updated_at": "2025-03-27T02:05:30.451874Z",
    "deleted_at": null,
    "sha1_hash": "f2bc743010a7e84dcb8c791d26cf46ccc4e99c42",
    "title": "2020-12-14 - Sophos-ReversingLabs (SOREL) 20 Million sample malware dataset",
    "authors": "",
    "file_creation_date": "2022-05-28T02:27:13Z",
    "file_modification_date": "2022-05-28T02:27:13Z",
    "file_size": 459977,
    "plain_text": "# Sophos-ReversingLabs (SOREL) 20 Million sample malware dataset\n\n**[ai.sophos.com/2020/12/14/sophos-reversinglabs-sorel-20-million-sample-malware-dataset/](https://ai.sophos.com/2020/12/14/sophos-reversinglabs-sorel-20-million-sample-malware-dataset/)**\n\nDecember 14, 2020\n\nThe Sophos AI team is excited to announce the release of SOREL-20M (SophosReversingLabs – 20 million) – a production-scale dataset containing metadata, labels, and\nfeatures for 20 million Windows Portable Executable files, including 10 million disarmed\nmalware samples available for download for the purpose of research on feature extraction to\ndrive industry-wide improvements in security. This dataset is the first production scale\nmalware research dataset available to the general public, with a curated and labeled set of\nsamples and security-relevant metadata, which we anticipate will further accelerate research\n[for malware detection via machine learning. Code and links to the data are available here.](https://github.com/sophos-ai/SOREL-20M)\n\n## Why are we releasing this data?\n\nData is the foundation upon which machine learning models are built. Standardized datasets\nare the way in which new features and models are developed, tested, and compared to each\nother. The development and ease of access for standardized datasets such as the MNIST\n\n\n-----\n\ndigits dataset, and later, large scale, realistic datasets, such as the ImageNet dataset and the\nPascal Visual Object Classification dataset, sparked an explosion in machine learning for\nimage recognition that culminated in the super-human models available today.\n\nUnlike image recognition or natural language processing, the area of security has seen much\nless activity and a relatively slower rate of improvement. A major reason for this is simply the\nlack of a standard, large-scale, realistic data set that can be easily obtained and tested by a\nwide range of users, from independent researchers to academic labs to large corporate\ngroups. Obtaining a large number of curated, labeled samples is both expensive and\nchallenging, and sharing data sets is often difficult due to issues around intellectual property\nand the risk of providing malicious software to unknown third parties. As a consequence,\nmost published papers on malware detection work on private, internal datasets, with results\nthat cannot be directly compared to each other.\n\n[The EMBER dataset (https://github.com/endgameinc/ember;](https://github.com/endgameinc/ember)\n[https://arxiv.org/abs/1804.04637) was an initial step to address this problem, however the](https://arxiv.org/abs/1804.04637)\nEmber dataset is relatively small (approximately 1 million files), and contains only a single\nlabel per sample (benign/malware), limiting the range of experimentation that can be\nperformed with it. It also includes no raw samples, meaning users must rely on the features\npre-extracted by the developers of the dataset. By contrast, our dataset contains complete –\nalbeit disarmed – samples for malware, malware/benignware labels, as well as the number\nof positive results across ReversingLabs scanners and tag counts derived from detection\nnames. We also provide dumps of metadata extracted via the `pefile` library\n[(https://github.com/erocarrera/pefile) for all samples.](https://github.com/erocarrera/pefile)\n\n## What’s in the dataset?\n\nThe SoReL-20M dataset, developed in collaboration between Sophos AI and\nReversingLabs, is intended to further accelerate research in malware detection via machine\nlearning. SoReL 20M is a production-scale dataset covering 20 million samples, including 10\nmillion disarmed malware samples available for download, as well as extracted features and\nmetadata for an additional 10 million benign samples. In practice, we find that 20 million\nsamples is sufficient to obtain a good rank-ordering of models, allowing us to obtain fair and\nstable comparisons between models. These samples are divided into training, validation,\nand testing splits on the basis of first-seen time. For each sample, we provide:\n\n1. Features extracted as per the EMBER 2.0 dataset\n2. Labels obtained by aggregating both external and Sophos internal sources into a\n\nsingle, high-quality label\n3. Sample-per-sample detection metadata, including total number of positive results on\n\nReversingLabs engines, and tags describing important attributes of the samples\nobtained as per our paper “Automatic Malware Description via Attribute Tagging and\n[Similarity Embedding” https://arxiv.org/abs/1905.06262](https://arxiv.org/abs/1905.06262)\n\n\n-----\n\n4. Complete dumps of file metadata obtained from the pefile library using the dump_dict()\n\nmethod\n5. For malware samples, we provide complete binaries, with the\n\nOptionalHeader.Subsystem flag and the FileHeader.Machine header value both set to\n0 to prevent accidental execution.\n\nTo accompany this data, we are also releasing a set of pre-trained PyTorch\n[(https://pytorch.org/) models and LightGBM (https://github.com/Microsoft/LightGBM) models](https://pytorch.org/)\ntrained on this data as baselines, as well the scripts used to load and iterate over the data,\nand load, train, and test the models. The PyTorch-based deep learning models are based on\n[the ALOHA architecture (https://www.usenix.org/system/files/sec19-rudd.pdf); LightGBM](https://www.usenix.org/system/files/sec19-rudd.pdf)\nparameters were selected using HyperOpt library. Code used to train the models, as well as\n[links to the data, are all available at https://github.com/sophos-ai/SOREL-20M](https://github.com/sophos-ai/SOREL-20M)\n\nFigure 1 — Left: ROC of LightGBM model; Right: ROC of ALOHA deep learning model\nFigure 1 shows the ROC curves for the LightGBM (left) and ALOHA (right) models. We also\nshow the performance of the ALOHA tags in Figure 2. While the performance of the\nbaseline models is quite good, they use a fairly standard set of features: those provided by\nthe EMBER dataset (with minor modifications to make the code python3 compatible). Plots\nshowing the distribution of tags in the malware portion of each dataset, and the cooccurrence relationship between tags, are provided in figures 3, 4, and 5.\n\n\n-----\n\nFigure 2 — per-tag\n\nROC for ALOHA model\n\n## Are you concerned that attackers could use this dataset to cause harm?\n\nThe malware we’re releasing is “disarmed” so that it will not execute. This means it would\ntake knowledge, skill, and time to reconstitute the samples and get them to actually run.\nThat said, we recognize that there is at least some possibility that a skilled attacker could\nlearn techniques from these samples or use samples from the dataset to assemble attack\ntools to use as part of their malicious activities. However, in reality, there are already many\nother sources attackers could leverage to gain access to malware information and samples\nthat are easier, faster and more cost effective to use. In other words, this disarmed sample\nset will have much more value to researchers looking to improve and develop their\nindependent defenses than it will have to attackers.\n\nThere is a consensus in the cybersecurity industry that responsible offensive engagements\nmake us all stronger, and the public release of attack tools facilitates that. Mature projects\nlike ‘afl’ support vulnerability identification (https://lcamtuf.coredump.cx/afl/), tools like sqlmap\n[(http://sqlmap.org/) and Metasploit provide adversaries means to gain entry into and privilege](http://sqlmap.org/)\n[escalation within networks (https://www.metasploit.com/download), tools like MimiKatz](https://www.metasploit.com/download)\n\n\n-----\n\n[support lateral movement https://github.com/gentilkiwi/mimikatz/releases, tools like](https://github.com/gentilkiwi/mimikatz/releases)\nPowershell Empire support persistence, data exfiltration, and other capabilities\n(https://github.com/EmpireProject/Empire). Responsible availability of these tools gives\ndefenders more information about what they are defending against, which leads to more\neffective defenses. Open knowledge and understanding about cyber threats also leads to\nmore predictive cybersecurity. Defenders will be able to anticipate what attackers are doing\nand be better prepared for their next move.\n\nThe malware binaries we’re releasing have been in the wild for some time. Even if they were\noperational, we expect that they would be configured to reach out to command and control\ninfrastructure that has already been dismantled. We also expect that the vast majority of the\nsamples will be readily recognized by anti-virus vendors. We are publishing metadata with\nthe samples, including hash values, that will enable anti-virus vendors to recognize the\nsamples if they don’t already.  We also expect that these samples will quickly become very\nwell-recognized as researchers have the opportunity to work with them.\n\nFinally, we anticipate that the public benefits of releasing our dataset will include significant\nimprovements in malware recognition and defense. We’re offering an opportunity for\nresearchers to make their results commensurable. We’ve seen what this can do for a field in\nthe way computer vision specifically and deep learning more generally has been\nrevolutionized by the ImageNet benchmark image dataset. And, as with colleagues\nresponsible for releasing related datasets, we’re breaking the ice on releasing this kind of\ndata to the community, to promote a culture of benchmark creation that we hope will go\nbeyond what we’re doing here.\n\n## Detailed corpus statistics (for the technically inclined)\n\nAll data is available via AWS S3 at s3://sorel-20m/09-DEC-2020 – baseline pretrained\nmodels and results are available in the ‘baselines’ subdirectory; pre-extracted features and\nmetadata are in the ‘processed-data’ subdirectory, and the raw (defused) binaries –\ncompressed using the python zlib library – are contained in the ‘binaries’ sudirectory.\n\nThe SQLite database schema for the `meta.db file within the ‘processed-data’ subdirectory`\nis as follows:\n\n\n-----\n\n```\nCREATE TABLE meta (sha256 text primary key,\n is_malware SMALLINT,\n rl_fs_t DOUBLE,\n rl_ls_const_positives INTEGER,\n adware INTEGER,\n flooder INTEGER,\n ransomware INTEGER,\n dropper INTEGER,\n spyware INTEGER,\n packed INTEGER,\n crypto_miner INTEGER,\n file_infector INTEGER,\n installer INTEGER,\n worm INTEGER,\n downloader INTEGER );\n\n```\nsha256 – the sha256 of the unmodified file (note that all provided files are “disarmed”)\nis_malware – a value of 0 indicates benignware, 1 indicates malware\nrl_fs_t – the first time (in Unix epoch time) a given sample (unique per sha256) was\nseen in the ReversingLabs feed\nrl_ls_const_positives – the total number of ‘positive’ (i.e. malware) results from all\ndetectors at the most recent time that the samples was seen (assuming that more\nrecent scans will be higher quality due to signature updated etc\nadware, flooder, ransomware, dropper, spyware, packed, crypto_miner, file_infector,\ninstaller, worm, downloader – the number of tokens appearing in detection names that\nrelated to the specified tag; a value >0 indicates a positive result, larger values may\nindicate higher certainty in the tag\n\nFrequency of malware and tags are given below; note that the dataset is approximately\nbalanced with respect to malware, but otherwise rather imbalanced. There are 19724997\nsamples in the data, broken down as follows:\n\n**Yes** **No**\n\n**Is_malware** 9762177 9962820\n\n**Adware** 2411262 17313735\n\n**Flooder** 101595 19623402\n\n**Ransomware** 1152354 18572643\n\n**Dropper** 3577111 16147886\n\n**Spyware** 4550007 15174990\n\n**Packed** 3726059 15998938\n\n**Crypto_miner** 339565 19385432\n\n\n-----\n\n**File_infector** 3317569 16407428\n\n**Installer** 1018880 18706117\n\n**Worm** 3414132 16310865\n\n**Downloader** 2565838 17159159\n\nFor per-split tag distributions, see the plots at the end of this post.\n\nWe provide metadata in LMDB databases (key-value stores) indexed by sample sha256 and\ncontaining compressed json files. Each malware sample – prior to modification – was loaded\nvia the pefile library and the `dump_dict()` method called on the result. When the pefile\nmodule failed to parse the sample, no value was entered into the LMDB database. We also\nprovide EMBER (v2) features, stored as zlib-compressed and msgpack-serialized numpy\narrays. As with the metadata, when EMBER failed to parse a PE file, there is no associated\nsha256 key or value in the LMDB database.\n\n## Conclusion\n\nSoReL-20M is the first production scale, curated, labeled dataset for use in machine learning\nresearch for malware detection, released by the Sophos AI group. We hope that it will\nfurther accelerate research on models and features for malware detection, enable fair\ncomparisons of approaches across labs and researchers, and ultimately improve the ability\nand agility of defenders to offer protections against attackers.\n\n**Appendix: Additional corpus statistics**\n\nFigure 3 —\n\nTraining data tag distribution and co-occurrence matrix\n\n\n-----\n\nValidation data tag distribution and co-occurrence\n\ntag distribution and co-occurrence\n\n\nFigure 4 —\n\nFigure 5 — Test data\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-14 - Sophos-ReversingLabs (SOREL) 20 Million sample malware dataset.pdf"
    ],
    "report_names": [
        "2020-12-14 - Sophos-ReversingLabs (SOREL) 20 Million sample malware dataset.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535731,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653704833,
    "ts_modification_date": 1653704833,
    "files": {
        "pdf": "https://archive.orkl.eu/f2bc743010a7e84dcb8c791d26cf46ccc4e99c42.pdf",
        "text": "https://archive.orkl.eu/f2bc743010a7e84dcb8c791d26cf46ccc4e99c42.txt",
        "img": "https://archive.orkl.eu/f2bc743010a7e84dcb8c791d26cf46ccc4e99c42.jpg"
    }
}