{
    "id": "d2f58a8f-c468-44dd-ab2c-bdf006f15a0b",
    "created_at": "2023-01-12T15:06:46.454927Z",
    "updated_at": "2025-03-27T02:16:26.403614Z",
    "deleted_at": null,
    "sha1_hash": "ab9558b2af4362026940212c067e1aef43f8ed98",
    "title": "2021-02-01 - Operation NightScout- Supply‑chain attack targets online gaming in Asia",
    "authors": "",
    "file_creation_date": "2022-05-28T19:05:30Z",
    "file_modification_date": "2022-05-28T19:05:30Z",
    "file_size": 491923,
    "plain_text": "# Operation NightScout: Supply‑chain attack targets online gaming in Asia\n\n**[welivesecurity.com/2021/02/01/operation-nightscout-supply-chain-attack-online-gaming-asia/](https://www.welivesecurity.com/2021/02/01/operation-nightscout-supply-chain-attack-online-gaming-asia/)**\n\nFebruary 1, 2021\n\nESET researchers uncover a supply-chain attack used in a cyberespionage operation targeting\nonline‑gaming communities in Asia\n\n[Ignacio Sanmillan](https://www.welivesecurity.com/author/isanmillan/)\n1 Feb 2021 - 11:30AM\n\nESET researchers uncover a supply-chain attack used in a cyberespionage operation targeting\nonline‑gaming communities in Asia\n\n_UPDATE (February 3, 2021):rd_\n_Following the publication of our research, BigNox have contacted us to say that their initial denial of the_\n_compromise was a misunderstanding on their part and that they have since taken these steps to_\n_improve security for their users:_\n\n\n-----\n\n_use only HTTPS to deliver software updates in order to minimize the risks of domain hijacking and_\n_Man-in-the-Middle (MitM) attacks_\n_implement file integrity verification using MD5 hashing and file signature checks_\n_adopt additional measures, notably encryption of sensitive data, to avoid exposing users’ personal_\n_information_\n\n_BigNox have also stated that they have pushed the latest files to the update server for NoxPlayer and_\n_that, upon startup, NoxPlayer will now run a check of the application files previously installed on the_\n_users’ machines._\n\n_ESET assumes no responsibility for the accuracy of the information provided by BigNox._\n\nDuring 2020, ESET research reported various supply-chain attacks, such as the case of WIZVERA\n[VeraPort, used by government and banking websites in South Korea, Operation StealthyTrident](https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/)\ncompromising the Able Desktop chat software used by several Mongolian government agencies, and\n[Operation SignSight, compromising the distribution of signing software distributed by the Vietnamese](https://www.welivesecurity.com/2020/12/17/operation-signsight-supply-chain-attack-southeast-asia/)\ngovernment.\n\nIn January 2021, we discovered a new supply-chain attack compromising the update mechanism of\n[NoxPlayer, an Android emulator for PCs and Macs, and part of BigNox’s product range with over 150](https://www.bignox.com/)\nmillion users worldwide.\n\nThis software is generally used by gamers in order to play mobile games from their PCs, making this\nincident somewhat unusual.\n\nThree different malware families were spotted being distributed from tailored malicious updates to\nselected victims, with no sign of leveraging any financial gain, but rather surveillance-related capabilities.\n\nWe spotted similarities in loaders we have been monitoring in the past with some of the ones used in this\noperation, such as instances we discovered in a Myanmar presidential office website supply-chain\ncompromise on 2018, and in early 2020 in an intrusion into a Hong Kong university.\n\n## About BigNox\n\nBigNox is a company based in Hong Kong, which provides various products, primarily an Android\nemulator for PCs and Macs called NoxPlayer. The company’s [official website claims that it has over 150](https://www.bignox.com/about)\nmillion users in more than 150 countries speaking 20 different languages. However, it’s important to note\nthat the BigNox follower base is predominantly in Asian countries.\n\n[BigNox also wrote an extensive blogpost in 2019 on the use of VPNs in conjunction with NoxPlayer,](https://www.bignox.com/blog/top-10-best-vpn-noxplayer-2019/)\nshowing the company’s concern for their users’ privacy.\n\nWe have contacted BigNox about the intrusion, and they denied being affected. We have also offered\nour support to help them past the disclosure in case they decide to conduct an internal investigation.\n\n## Am I compromised?\n\n_Who is affected: NoxPlayer users._\n\n\n-----\n\n_How to determine if I received a malicious update or not: check if any ongoing process has an_\nactive network connection with known active C&C servers, or see if any of the malware based on\nthe file names we provided in the report is installed in:\n\nC:\\ProgramData\\Sandboxie\\SbieIni.dat\nC:\\ProgramData\\Sandboxie\\SbieDll.dll\nC:\\ProgramData\\LoGiTech\\LBTServ.dll\nC:\\Program Files\\Internet Explorer\\ieproxysocket64.dll\nC:\\Program Files\\Internet Explorer\\ieproxysocket.dll\na file named %LOCALAPPDATA%\\Nox\\update\\UpdatePackageSilence.exe not digitally\nsigned by BigNox.\n_How to stay safe:_\n\nIn case of intrusion – standard reinstall from clean media.\nFor non-compromised users: do not download any updates until BigNox notifies that it has\nmitigated the threat.\n\n## Timeline\n\nBased on ESET telemetry, we saw the first indicators of compromise in September 2020, and activity\ncontinued until we uncovered explicitly malicious activity on January 25, 2021, at which point weth\nreported the incident to BigNox.\n\n## Victimology\n\nIn comparison to the overall number of active NoxPlayer users, there is a very small number of victims.\nAccording to ESET telemetry, more than 100,000 of our users have Noxplayer installed on their\nmachines. Among them, only 5 users received a malicious update, showing that Operation NightScout is\na highly targeted operation. The victims are based in Taiwan, Hong Kong and Sri Lanka.\n\n\n-----\n\n_Figure 1. Asia victimology map_\n\nWe were unsuccessful finding correlations that would suggest any relationships among victims.\nHowever, based on the compromised software in question and the delivered malware exhibiting\nsurveillance capabilities, we believe this may indicate the intent of collecting intelligence on targets\nsomehow involved in the gaming community.\n\nIt is important to highlight that, in contrast with similar previous operations such as the Winnti Group\nactivity targeting the gaming industry in 2019, we haven’t found indicators that would suggest\nindiscriminate proliferation of malicious updates among a large number NoxPlayer users, reinforcing our\nbelief that this is a highly targeted operation.\n\n## Update mechanism\n\nIn order to understand the dynamics of this supply-chain attack, it’s important to know what vector was\nused in order to deliver malware to NoxPlayer users. This vector was NoxPlayer’s update mechanism.\n\n\n-----\n\nOn launch, if NoxPlayer detects a newer version of the software, it will prompt the user with a message\nbox (Figure 2) to offer the option to install it.\n\n_Figure 2. NoxPlayer update prompt_\n\nThis is done by querying the update server via the BigNox HTTP API (api.bignox.com) in order to\nretrieve specific update information, as seen in Figure 3.\n\n\n-----\n\n_Figure 3. NoxPlayer client update API request_\n\nThe response to this query contains update-specific information such as the update binary URL, its size,\nMD5 hash and other additional related information as seen in Figure 4.\n\n\n-----\n\n_Figure 4. NoxPlayer server API reply_\n\nUpon pressing the “Update now” button from Figure 1, the main NoxPlayer binary application Nox.exe\nwill supply the update parameters received to another binary in its toolbox NoxPack.exe, which is in\ncharge of downloading the update itself, as can be seen in Figure 5.\n\n\n-----\n\n_Figure 5. NoxPlayer execution chain on update_\n\nAfter this is done, the progress bar in the message box will reflect the state of the download (Figure 6),\nand when completed the update has been performed.\n\n\n-----\n\n_Figure 6. NoxPlayer update ongoing via NoxPack.exe_\n\n## Supply-chain compromise indicators\n\nWe have sufficient evidence to state that the BigNox infrastructure (res06.bignox.com) was\ncompromised to host malware, and also to suggest that their HTTP API infrastructure (api.bignox.com)\ncould have been compromised. In some cases, additional payloads were downloaded by the BigNox\nupdater from attacker-controlled servers. This suggests that the URL field, provided in the reply from the\nBigNox API, was tampered with by the attackers. The intrusion flow observed is depicted in Figure 7.\n\n\n-----\n\n_Figure 7. Intrusion flow sequence diagram_\n\nAn overview of what’s shown in the sequence diagram above is the following:\n\n1. On launch, the primary NoxPlayer executable Nox.exe sends a request via the API to query\n\nupdate information.\n2. The BigNox API server responds to the client request with specific update information, including\n\nthe URL to download the update from BigNox legitimate infrastructure.\n3. Nox.exe provides the appropriate parameters to NoxPlayer.exe to download the update.\n4. The legitimate update stored in BigNox infrastructure could have been replaced with malware, or it\n\nmay be a new filename/URL not used by legitimate updates.\n5. Malware is installed on the victim’s machine. Contrary to legitimate BigNox updates, the malicious\n\nfiles are not digitally signed, strongly suggesting that the BigNox build system was not\ncompromised, but just its systems that distribute updates.\n6. Some reconnaissance of the victim is performed and information sent to the malware operators.\n\n\n-----\n\n7. The perpetrators tailor malicious updates to specific victims of interest based on some unknown\n\nfiltering scheme.\n8. Nox.exe will perform sporadic update requests.\n9. The BigNox API server responds to the client with update information, which states that the update\n\nis stored in the attacker-controlled infrastructure.\n10. Further malware gets delivered to selected victims.\n\nWith this information we can highlight several things:\n\nLegitimate BigNox infrastructure was delivering malware for specific updates. We observed that\nthese malicious updates were only taking place in September 2020.\nFurthermore, we observed that for specific victims, malicious updates were downloaded from\nattacker-controlled infrastructure subsequently and throughout the end of 2020 and early 2021.\nWe are highly confident that these additional updates were performed by Nox.exe supplying\nspecific parameters to NoxPack.exe, suggesting that the BigNox API mechanism may have also\nbeen compromised to deliver tailored malicious updates.\nIt could also suggest the possibility that victims were subjected to a MitM attack, although we\nbelieve this hypothesis is unlikely since the victims we discovered are in different countries, and\nattackers already had a foothold on the BigNox infrastructure.\nFurthermore, we were able to reproduce the download of the malware samples hosted on\nres06.bignox.com from a test machine and using https. This discards the possibility that a MitM\nattack was used to tamper with the update binary.\n\nIt is also important to mention that malicious updates downloaded from the attacker-controlled\ninfrastructure mimicked the path of legitimate updates:\n\nMalicious update to attacker-controlled infrastructure:\nhttp://cdn.cloudfronte[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\nLegitimate NoxPlayer update:\nhttp://res06.bignox[.]com/player/upgrade/202012/1b31bced0a564bed9f60264f061dcdae.exe\n\nFurthermore, registered attacker-controlled domain names mimicked the BigNox CDN network domain\nname, that being cloudfront.net.\n\nThese indicators suggest that attackers were trying to avoid detection so that they could remain under\nthe radar and achieve long-term persistence.\n\n## Malware\n\nA total of three different malicious update variants were observed, each of which dropped different\nmalware. These variants are the following:\n\n### Malicious Update variant 1\n\nThis variant is one of the preliminary updates pointing to compromised BigNox infrastructure. Our\nanalysis is based on the sample with SHA-1 CA4276033A7CBDCCDE26105DEC911B215A1CE5CF.\n\nThe malware delivered does not seem to have been documented before. It is not extremely complex, but\nit has enough capabilities to monitor its victims. The initial RAR SFX archive drops two DLLs into\nC:\\Program Files\\Internet Explorer\\ and runs one of them, depending on architecture, via rundll32.exe.\n\n\n-----\n\nThe names of these DLLs are the following:\n\nieproxysocket64.dll\nieproxysocket.dll\n\nIt also drops a text file named KB911911.LOG to disk, into which the original name of the SFX installer\nwill be written. The DLL attempts to open and read this log file, and if not found will stop execution,\ntherefore implementing an execution guardrail.\n\nThe DLL will then check whether it has been loaded by any of the following processes; if it has, it will\nstop its own execution:\n\nsmss.exe\nwinlogon.exe\ncsrss.exe\nwininit.exe\nservices.exe\nexplorer.exe\n\nThe IP address of the machine will be checked to verify that it is neither 127.0.0.1 nor 0.0.0.0; if it is, it\nwill be rechecked in an infinite loop until it changes. Otherwise, it will proceed to extract the UUID of the\ncurrent machine via a WMI object query. This returned UUID is hashed using MD5 to serialize the\ncurrent victim. Account name information will also be retrieved and saved.\n\nAn encrypted configuration will be retrieved from the DLL’s resource. This configuration is encrypted\nusing a two-byte XOR with 0x5000. The encrypted configuration is partially visible given the weakness of\nthe key used:\n\n\n-----\n\n_Figure 8. Encrypted configuration in resources_\n\nThe format of this configuration is the following (roughly):\n\n**Offset** **Size** **Comment**\n\n0x00 0x08 Fake JPG header magic\n\n0x08 0x12C Buffer holding tokenized C&C information\n\n0x134 0x14 Buffer holding port for C&C communication\n\n0x148 0x14 Sleep time\n\n0x15C 0x14 Operate flag; don’t operate with network monitoring tools deployed or if this flag is\nset\n\n0x170 0x14 N/A\n\n\n-----\n\n**Offset** **Size** **Comment**\n\n0x184 0x14 DNS flag; append a token at the end of a hostname buffer with either |UDP or |DNS,\ndepending on the value of this field\n\n0x198 0x38 Variable holding offset start of decoded configuration buffer\n\nAfter the configuration has been parsed, the backdoor will check several times for network monitoring\nprocesses before transferring execution to the C&C loop. Operation stops if the Operate flag is set or if\neither of the following processes is running:\n\nnetman.exe\nwireshark.exe\n\nThe backdoor can use either a raw IP address or a domain name to communicate with the C&C server.\nAfter successful connection to the C&C, the malware will be able to perform the following commands:\n\n**Command ID** **Specification**\n\ngetfilelist-delete Delete specified files from the disk\n\ngetfilelist-run Run a command via the WinExec API\n\ngetfilelist-upload Upload a file via ScreenRDP.dll::ConnectRDServer\n\ngetfilelist-downfile1 Download a specific file\n\ngetfilelist-downfile2 Download a specific directory\n\ngetfilelist-downfile3 Same as getfilelist-downfile2\n\n<default> \\\\tsclient drive redirection of certain directories (starting with A: for range(0x1A))\n\n\n-----\n\n_Figure 9. Anatomy of malicious update variant 1_\n\n### Malicious Update variant 2\n\nThis malware variant was also spotted being downloaded from legitimate BigNox infrastructure. Our\nanalysis is based on the sample with SHA-1 E45A5D9B03CFBE7EB2E90181756FDF0DD690C00C.\n\nIt contains several files comprising what is known as a trident bundle, in which a signed executable is\nused to load a malicious DLL, which will decrypt and load a shellcode, implementing a reflective loader\nfor the final payload.\n\n[The theme for this trident bundle was to disguise the malware as Sandboxie components. The names of](https://en.wikipedia.org/wiki/Sandboxie)\nthe bundled components are the following:\n\n**Filename** **Description**\n\nC:\\ProgramData\\Sandboxie\\SandboxieBITS.exe Signed Sandboxie COM Services (BITS)\n\nC:\\ProgramData\\Sandboxie\\SbieDll.dll Malicious hijacked DLL\n\nC:\\ProgramData\\Sandboxie\\SbieIni.dat Malicious encrypted payload; decrypts a\nreflectively loaded instance of Gh0st RAT\n\nC:\\Users\\Administrator\\AppData\\Local\\Temp\\delself.bat Script to self-delete the initial executable\n\nC:\\Windows\\System32\\wmkawe_3636071.data Text file containing the sentence Stupid\nJapanese\n\nWe have encountered other instances of this same text file, dropped by a very similar loader in a supplychain compromise involving the Myanmar presidential office website in 2018, and in an intrusion into a\nHong Kong university in 2020.\n\n[The deployed final payload was a variant of Gh0st RAT with keylogger capabilities.](https://attack.mitre.org/software/S0032/)\n\n\n-----\n\n_Figure 10. Anatomy of malicious update variant 2_\n\n### Malicious Update variant 3\n\nThis update variant was only spotted in activity subsequent to initial malicious updates, downloaded from\nattacker-controlled infrastructure. Our analysis is based on the sample with SHA-1\nAA3D31A1A6FE6888E4B455DADDA4755A6D42BEEB.\n\n\n-----\n\nSimilarly, as with the previous variant, this malicious update comes bundled in an MFC file, and extracts\ntwo components: a benign signed file and a dependency of it. The components are:\n\n**Filename** **Description**\n\nC:\\ProgramData\\LoGiTech\\LoGitech.exe Signed Logitech binary\n\nC:\\ProgramData\\LoGiTech\\LBTServ.dll Malicious DLL decrypts and reflectively loads an instance\nof PoisonIvy\n\nOn the most recently discovered victims, the initial downloaded binary was written in Delphi, while for\nprevious victims the same attacker-controlled URL dropped a binary written in C++. These binaries are\nthe initial preliminary loaders. Although the loaders were written in different programming languages,\n[both versions deployed the same final payload, that being an instance of the PoisonIvy RAT.](https://attack.mitre.org/software/S0012/)\n\n_Figure 11. Anatomy of malicious update variant 3_\n\n## Conclusion\n\nWe have detected various supply-chain attacks in the last year, such as [Operation SignSight or the](https://www.welivesecurity.com/2020/12/17/operation-signsight-supply-chain-attack-southeast-asia/)\ncompromise of [Able Desktop among others. However, the supply-chain compromise involved in](https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/)\nOperation NightScout is particularly interesting due to the targeted vertical, as we rarely encounter many\ncyberespionage operations targeting online gamers.\n\nSupply-chain attacks will continue to be a common compromise vector leveraged by cyber-espionage\ngroups, and its complexity may impact the discovery and mitigation of these type of incidents.\n\n_For any inquiries, or to make sample submissions related to the subject, contact us at:_\n_threatintel@eset.com._\n\n## Acknowledgement\n\n\n-----\n\n[The author would like to give special credit to Matthieu Faou for his support and feedback during the](https://www.welivesecurity.com/author/mfaou/)\ninvestigation.\n\n## Indicators of Compromise (IoCs)\n\n Files\n\n**SHA-1** **ESET detection name** **Decription**\n\nCA4276033A7CBDCCDE26105DEC911B215A1CE5CF Win32/Agent.UOJ Malicious\nUpdate variant 1\n\nE45A5D9B03CFBE7EB2E90181756FDF0DD690C00C Win32/GenKryptik.ENAT Malicious\nUpdate variant 2\n\nAA3D31A1A6FE6888E4B455DADDA4755A6D42BEEB Win32/Kryptik.HHBQ Malicious\nUpdate variant 3\n\n5732126743640525680C1F9460E52D361ACF6BB0 Win32/Delf.UOD Malicious\nUpdate variant 3\n\n## C&C servers\n\n210.209.72[.]180\n\n103.255.177[.]138\n\n185.239.226[.]172\n\n45.158.32[.]65\n\ncdn.cloudistcdn[.]com\n\nq.cloudistcdn[.]com\n\nupdate.boshiamys[.]com\n\n## Malicious update URLs\n\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201101/1/bf571cb46afc144cab53bf940da88fe2.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201123/1/2ca0a5f57ada25657552b384cf33c5ec.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20201225/7c21bb4e5c767da80ab1271d84cc026d.exe\nhttp://cdn.cloudfronter[.]com/player/upgrade/ext/20210119/842497c20072fc9b92f2b18e1d690103.exe\nhttps://cdn.cloudfronte[.]com/player/upgrade/ext/20201020/1/c697ad8c21ce7aca0a98e6bbd1b81dff.exe\nhttp://cdn.cloudfronte[.]com/player/upgrade/ext/20201030/1/35e3797508c555d5f5e19f721cf94700.exe\nhttp://res06.bignox[.]com/player/upgrade/202009/6c99c19d6da741af943a35016bb05b35.exe\nhttp://res06.bignox[.]com/player/upgrade/202009/42af40f99512443cbee03d090658da64.exe\n\n## MITRE ATT&CK techniques\n\n_[Note: This table was built using version 8 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)_\n\n**Tactic** **ID** **Name** **Description**\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\nInitial\nAccess\n\n\n[T1195.002](https://attack.mitre.org/techniques/T1195/002/) Supply Chain Compromise:\nCompromise Software Supply\nChain\n\n\nExecution [T1053.005](https://attack.mitre.org/techniques/T1053/005/) Scheduled Task/Job: Scheduled\nTask\n\nExecution [T1569.002](https://attack.mitre.org/techniques/T1569/002/) System Services: Service\nExecution\n\nPersistence [T1053.005](https://attack.mitre.org/techniques/T1053/005/) Scheduled Task/Job: Scheduled\nTask\n\n\nMalware gets delivered via\nNoxPlayer updates.\n\nMalicious update variant 3\ninstances will be executed via\nScheduled task.\n\nMalicious update variant 2\ninstances will be executed via\nservice execution.\n\nMalicious update variant 2\ninstances will create a scheduled\ntask to establish persistence.\n\nMalicious update variant 2 and 3\nwill be contained in \"trident\"\nbundles for evasion purposes.\n\n\nDefense\nEvasion\n\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfuscate/Decode Files or\nInformation\n\n\n[T1574.002](https://attack.mitre.org/techniques/T1574/002/) Hijack\nExecution\nFlow: DLL\nSide-Loading\n\n\nMalicious updates shipped as\n\"trident\" bundles will perform\nDLL side loading.\n\n\nCollection [T1056.001](https://attack.mitre.org/techniques/T1056/001/) Input Capture:Keylogging Some of the final payloads such as\nPoisonIvy and Gh0st RAT have\nkeylogging capabilities.\n\n\nCommand\nand Control\n\n\n[T1090.001](https://attack.mitre.org/techniques/T1090/001/) Proxy: Internal Proxy The PoisonIvy final payload variant\nhas capabilities to authenticate with\nproxies.\n\n\n[T1095](https://attack.mitre.org/techniques/T1095/) NonApplication\nLayer Protocol\n\n[T1573](https://attack.mitre.org/techniques/T1573/) Encrypted\nChannel\n\n\nAll malicious update instances\ncommunicate over raw TCP or\nUDP.\n\nBoth PosionIvy and Gh0st RAT\nuse encrypted TCP\ncommunication to avoid\ndetection.\n\n\nExfiltration [T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over C2 Channel Exfiltration in all malicious updates\ninstances is done over a Command\nand Control channel.\n\n1 Feb 2021 - 11:30AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n\n-----\n\n### Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-01 - Operation NightScout- Supply‑chain attack targets online gaming in Asia.pdf"
    ],
    "report_names": [
        "2021-02-01 - Operation NightScout- Supply‑chain attack targets online gaming in Asia.pdf"
    ],
    "threat_actors": [
        {
            "id": "068b67c8-604c-4272-b808-350413fa9ee3",
            "created_at": "2022-10-25T16:07:23.975708Z",
            "updated_at": "2025-03-27T02:02:10.058689Z",
            "deleted_at": null,
            "main_name": "Operation NightScout",
            "aliases": [],
            "source_name": "ETDA:Operation NightScout",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbdb2d7d-4bf4-4100-a108-f4742cfd69ff",
            "created_at": "2022-10-25T16:07:24.01101Z",
            "updated_at": "2025-03-27T02:02:10.074776Z",
            "deleted_at": null,
            "main_name": "Operation SignSight",
            "aliases": [],
            "source_name": "ETDA:Operation SignSight",
            "tools": [
                "Mimikatz",
                "PhantomNet",
                "SManager"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b5550c4e-943a-45ea-bf67-875b989ee4c4",
            "created_at": "2022-10-25T16:07:23.675771Z",
            "updated_at": "2025-03-27T02:02:09.918749Z",
            "deleted_at": null,
            "main_name": "Gelsemium",
            "aliases": [
                "Operation NightScout",
                "Operation TooHash"
            ],
            "source_name": "ETDA:Gelsemium",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agentemis",
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "Chrommme",
                "Cobalt Strike",
                "CobaltStrike",
                "FireWood",
                "Gelsemine",
                "Gelsenicine",
                "Gelsevirine",
                "JuicyPotato",
                "OwlProxy",
                "Owowa",
                "SAMRID",
                "SessionManager",
                "SinoChopper",
                "SpoolFool",
                "SweetPotato",
                "WolfsBane",
                "cobeacon",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536006,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653764730,
    "ts_modification_date": 1653764730,
    "files": {
        "pdf": "https://archive.orkl.eu/ab9558b2af4362026940212c067e1aef43f8ed98.pdf",
        "text": "https://archive.orkl.eu/ab9558b2af4362026940212c067e1aef43f8ed98.txt",
        "img": "https://archive.orkl.eu/ab9558b2af4362026940212c067e1aef43f8ed98.jpg"
    }
}