{
    "id": "d2fd151c-869a-44b4-9acf-c4e28d1b09b3",
    "created_at": "2022-10-25T16:48:21.683703Z",
    "updated_at": "2025-03-27T02:16:26.366915Z",
    "deleted_at": null,
    "sha1_hash": "8ae82be2071ed361a3fda42519c130848e539702",
    "title": "Caught in the Act: Running a Realistic Factory Honeypot to Capture Real Threats",
    "authors": "",
    "file_creation_date": "2020-01-20T14:09:14Z",
    "file_modification_date": "2020-01-20T14:09:26Z",
    "file_size": 5031239,
    "plain_text": "-----\n\n**TREND MICRO LEGAL DISCLAIMER**\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro\n\nreserves the right to modify the contents of this document\n\nat any time without prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy\n\nis not guaranteed nor implied. If any questions arise\n\nrelated to the accuracy of a translation, please refer to\n\nthe original language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\nPublished by\n**Trend Micro Research**\n\nWritten by\n**Stephen Hilt, Federico Maggi,**\n**Charles Perine, Lord Remorin,**\n**Martin Rösler, and Rainer Vosseler**\n\nStock images used under license from\n\nShutterstock.com\n\n_For Raimund Genes (1963-2017)_\n\n\n### Contents\n\n 4\n###### Conceptualization\n\n### 6\n###### Building the ICS Environment\n\n### 12\n###### Building the Company\n\n### 17\n###### Building the Honeypot\n\n### 28\n###### Incidents\n\n### 60\n###### Conclusion\n\n\n-----\n\nDifferent critical infrastructures have been hit with attacks such as those that\n\ninvolved the infamous Stuxnet malware[1] and the more recent Triton malware.[2 ]\n\nThese incidents — attacks on manufacturing and other sectors that use industrial\n\ncontrol systems (ICSs) — continue to be heard of through the years. In 2017, for\n\ninstance, the notorious WannaCry ransomware shut down a car manufacturing\n\nfactory in Japan,[3] and another ransomware attack took down a factory in North\n\nCarolina, U.S.[4]\n\nSmart factories attract the interest of threat actors for the critical and sensitive\n\ninfrastructures they usually handle. A successful attack, no matter how difficult the\n\nexecution, can yield high-impact results that can corner an organization into giving\n\nin to cybercriminals’ demands or, at the very least, cost it considerable losses.\n\nPrompted by our desire to determine how knowledgeable and imaginative\n\nattackers could be in compromising a manufacturing facility, we built the most\n\nrealistic factory honeypot we had ever created. And in doing so, we also created\n\nan ideal environment where we could monitor and learn about the attacks that\n\nthe honeypot came to attract. From conceptualization to actual execution,\n\nour factory honeypot was designed to be an attractive target for potential\n\ncybercriminals.\n\nOur factory honeypot took on the ruse of a small fictitious company that\n\napparently handled clients from critical industries yet possessed inadequate\n\nsecurity defenses. Our ruse proved successful as our honeypot saw several\n\nattacks, which we had the freedom and resources to monitor. These attacks\n\nincluded a malicious cryptocurrency mining campaign, two ransomware attacks,\n\nanother that posed as a ransomware attack, and several scanners.\n\nIn this research paper, we detail the conceptualization and creation of our\n\nmost elaborate honeypot to date, and discuss the result of our monitoring and\n\ntracking of the incidents that occurred on the honeypot.\n\n\n-----\n\n## Conceptualization\n\nTrend Micro had already created several honeypots, specifically ones that ran ICSs. In 2013, Trend Micro\n\nreleased a research that centered on a honeypot for a water system.[5] This research was focused on a pure\nproduction honeypot that mimicked a real system, including a human-machine interface (HMI) and other\n\ncomponents of an ICS. And in 2015, Trend Micro released research around the Guardian AST monitoring\n\nsystem using a honeypot called GasPot,[6] which simulated a gas tank monitoring system. The purpose\n\nof this honeypot was to deploy multiple unique systems that did not look the same but nonetheless\n\nresponded like real deployed systems.\n\nWe evolve our honeypots by making them more and more realistic each time we build them. This is why\n\nfor this research we wanted to build a honeypot that not only mimicked a real system but could also start\n\nmaking products. The goal was to build a honeypot that appeared so real that not even a well-trained\n\ncontrol systems engineer would be able to tell that it was fake without diving deeply into the system.\n\nFirst, we decided on what services and ports would be exposed to the internet to make our honeypot\n\nattractive to attackers. At the same time, we would maintain a minimal number of exposed services to\n\nprevent our honeypot from being identified as such. Second, we created a backstory for our fictitious\n\ncompany, which included made-up employee names, working phone numbers, and email addresses —\n\nanything and everything that a real company would need to run a day-to-day business. Third, we created\n\na strategy to build the factory with equipment we already owned and equipment we needed to purchase.\n\n\n-----\n\nIndustrial\ncellular router (1)\n\nConsumer\ncellular router (1)\n\nIndustrial\ncellular router (2)\n\nConsumer\ncellular router (2)\n\n\nProxy router\n\nProtocol gateway (1)\n(e.g., Fieldbus)\n\nProtocol gateway (2)\n(e.g., Modbus)\n\n\nDell Precision M4800\n\n\nSiemens S7-1200\n\nAllen-Bradley\nMicroLogix 1100 (x2)\n\nGE Fanuc\n\nPhoenix Contact\nILC 131\n\n\nHMI\n\n\nServer\n\n\nDNS/AD?\n\n\nROS\n\n\nABB\nservices\n\n\nFigure 1. Our original layout plan\n\nLooking at the equipment that we had and what we wanted to achieve, we replaced the Modbus\n\nprogrammable logic controllers (PLCs) with ones from Omron. This was to see if there would be any other\n\nattacks that we did not observe in our 2013 research on water facilities; in that research, we received\n\n12 targeted attacks out of 39 total attacks. After we finalized our build-out, we decided on what type\n\nof products we wanted to make and how we were going to design the logic, HMI screens, and other\n\nICS components.\n\n\n-----\n\n## Building the ICS Environment\n\nIn building our ICS environment, one of our primary goals was to prevent attackers from simply flagging\n\nour system as a honeypot, which would of course drive them away. Advanced attackers could be very\n\npicky in choosing systems they wanted to compromise and would check every small detail that they\n\ncould before conducting an attack. With this is mind, we decided to use real ICS hardware and a mixture\n\nof physical hosts and hardened virtual machines (VMs).\n\nFigure 2. Shodan data classifying our honeypot as ICS\n\n#### Hardware\n\nFor our ICS hardware, we ran four PLCs from three different brands: one Siemens S7-1200, two Allen\nBradley MicroLogix 1100 units, and one Omron CP1L. These PLCs were chosen for their popularity in the\n\ncontrol systems markets from around the world. Also, each PLC brand uses a different protocol, allowing\n\nus to see if there would be any attacks on any of these PLCs that we could monitor.\n\n\n-----\n\nFigure 3. Hardware equipment that ran our factory\n\nEach PLC was loaded with logic and performed specific and associated tasks that together ran the\n\nmanufacturing facility. These roles were agitator, burner control, conveyor belt control, and palletizer,\n\nwhich used a robotic arm. To make our manufacturing process realistic, we used incremental and\n\ndecremental functions through logic to vary the feedback values, which imitated the starting and stopping\n\nseen in motors or heaters. Random generator functions were also created to make slight fluctuations in\n\nthe feedback values.\n\n#### Machines\n\nWe had three VMs and one physical machine running our factory. The three VMs included an HMI to\n\ncontrol our factory, a robotics workstation to control our palletizer, and an engineering workstation to\n\nprogram our PLCs. The physical machine was used as a file server for our factory.\n\n##### Human-Machine Interface\n\nAside from the different brands of PLCs that we used in our production environment, we wanted to\n\nmonitor the status of the logic we loaded on our devices. To mimic a realistic manufacturing environment,\n\nwe created an HMI to quickly identify whether the states of our “virtual” actuators, motors, and feedback\n\nvalues were being modified.\n\n\n-----\n\nDuring our planning stage, we found out that starting with the layout of our HMI would be much easier\n\nthan starting with the PLC logic. The HMI machine of our honeypot was exposed through Virtual Network\n\nComputing (VNC) without control access.\n\nFigure 4. A screenshot of the HMI used to control the plant in our factory\n\n##### Robotics Workstation\n\nIndustrial robots are a key component of modern smart manufacturing. They are used for automating\n\nnot only simple pick-and-place tasks but also complex ones. Because of this, we decided to include a\n\nrobotics station and its corresponding engineering workstation in our factory. To further make our factory\n\nrealistic, we included a robotics workstation that would be used by engineers to graphically write the\n\nautomation logic. Since actual industrial robot machines are normally isolated in an internal network, we\n\ndecided to expose only the workstation via VNC.\n\n\n-----\n\nFigure 5. Industrial robots typically found in modern factories\n\nGiven our experience with the ABB Robotics ecosystem,[7] we opted for the programming environment of\n\nRobotStudio. We downloaded this from the ABB Robotics website, installed it on a dedicated VM, and\n\nconfigured it accordingly. We then opened a simulation file and saw to it that the rendered 3D digital twin\n\nof the robot was visible on screen to ensure that VNC scans — such as those used by Shodan and similar\n\nsearch engines — would grab it and display it to whoever might be interested in exploring VNC targets. In\n\naddition, we collected some code and left it on the machine.\n\nFigure 6. A screenshot of the robotics workstation, used to write automation routines for the robotics station\n\n\n-----\n\nThe effectiveness of our design and implementation in creating an attractive and realistic target was\n\nconfirmed by the several attempts to attack the robotics workstation that we later observed, some of\n\nwhich were successful, with the attackers coming back several times.\n\n##### Engineering Workstation\n\nTo program logic on the PLCs that would perform tasks similar to those required in a production line, we\n\nadded an engineering workstation to our honeypot network. Like the robotics workstation, this workstation\n\nwould be used by engineers to create logic for the PLCs. Accordingly, we installed industrial software for\n\nprogramming the PLCs we used: Totally Integrated Automation Portal (TIA Portal) for Siemens, MicroLogix\n\nfor Allen-Bradley, and CX-One for Omron.\n\nWe decided that the engineering workstation would not be exposed outside of our network. Rather, we\n\nused the same admin password as that of the exposed HMI and robotics workstation. This mimicked a\n\ncommon setup in companies maintained by an administrator.\n\nUnfortunately (for our purpose, that is), the engineering workstation did not receive any attacks, even\n\nthough we purposely used the same admin password as that of the other exposed machines.\n\n##### File Server\n\nWe set up a file server to lure attackers and also to serve as a backup for some of our own “work” in our\n\nsimulated company. This provided us with the ability to sneak net files in and out of the network using\n\na multi-USB method to ensure that we were not leaving any traces of other systems on our honeypot\n\nnetwork. The file server was a Windows 7 Professional build that had a shared directory and allowed\n\nanyone read and write access.\n\nAt first, we built it with no files or structure and intended to build up the structure over time. But once we\n\nfound that actors were actively looking at the structure, we decided to populate it with false files. To do\n\nthis, we created a script that would create a file from a list of extensions. Using multiple words from a\n\ndictionary, the script would create a file of a random size.\n\n\n-----\n\nFigure 7. The script we created to generate random file patterns\n\nAfter we ran the script for a given number of files, we populated our file server with the generated\n\n“honeyfiles.”\n\nFigure 8. Honeyfiles placed in the file server to make it look realistic\n\n\n-----\n\n## Building the Company\n\nThe proliferation of honeypots used to collect attack traces has significantly raised the bar for future\n\nhoneypots. Not only are current attackers already accustomed to encountering honeypots virtually\n\neverywhere, but advanced actors also typically perform in-depth investigation — using open-source\n\nintelligence (OSINT), for example — before attacking a target system to make sure that they are not about\n\nto be “caught” by a honeypot system. For this reason, our honeypot did not only need to look realistic\n\nfrom a design and technical implementation standpoint, but it also had to reflect a system that a real\n\ncompany would use.\n\nTrying to put ourselves in the shoes of an advanced attacker, we took advantage of our OSINT knowledge\n\nto better anticipate how an attacker would act, which information they would cross-check, and from\n\nwhich sources. Would they check used IP addresses in reputation systems? Would they try to match the\n\nreverse lookup history of an IP address? Would they search for names and keywords, trying to find online\n\nevidence of a real company linked to that system? With such questions in mind, we started to create a\n\nlist of ideas.\n\nIn this section, we discuss the details we came up with to make our honeypot more convincing as a real\n\ncompany.\n\n#### An Attractive Target\n\nAlthough it would have resulted in a very attractive target for attackers, posing as an existing company\n\ncould have posed legal issues. We ruled out this option immediately because the potential reputational\n\ndamage in case of an attack would be out of proportion. If existing companies would like to run honeypots,\n\nthey would need to do it on their premises, under their legal responsibility. However, we still wanted to\n\nbe an attractive target. Fortunately for us, many large companies rely on external workforce, especially\n\nfor bleeding-edge applications and technologies (e.g., smart manufacturing). This presented a perfect\n\nposition for us to take in the market.\n\n\n-----\n\nWe decided to pose as a small industrial prototyping boutique working for special customers. Considering\n\nthat some small companies offer consultancy services to larger ones, we thought we could invent one\n\nsuch company. In this way, we would not need to claim ownership of any existing brand. After some\n\nbrainstorming, we decided to pose as a small industrial prototyping boutique: a consultancy firm that\n\nspecialized in advanced prototyping, serving very large anonymous customers in the military, avionic, and\n\nmanufacturing sectors.\n\n#### Vision and Brand Image\n\nAt this point, we started thinking like an entrepreneur. We needed to pick our business mission and name,\n\nand build an image around those ideas. We decided that we would be a company with only a small\n\nnumber of employees, all founding members. We wanted to convey the message that we were highly\n\nspecialized, focused on our business, and for this reason worked for large and important enterprises.\n\nThis was to lure the attackers into thinking that we were dealing with sensitive projects, despite being a\n\nsmall company. In other words, we wanted our company to appear “weak” in terms of cybersecurity, as\n\nthis was not its focus, and at the same time show that it handled important assets in our target systems.\n\nAfter weeks of discussing the company among ourselves, we started to feel it was real. Embracing the\n\nidea, vision, and brand of our faux company was very important because we had to depict a realistic\n\ncompany image while reducing room for mistakes, such as leaking details about our real affiliation. To\n\navoid leaving any trace of our actual purpose, from the day we decided to start developing assets (e.g.,\n\nimages, brand material, domain registration, website), we created an isolated VM on a specific laptop,\n\nwhich we used exclusively to perform any activity related to our faux brand.\n\n#### Online Presence\n\nEven small companies are nowadays expected to maintain a bare minimum of presence online. Creating\n\nthe illusion of a real company through social media was our first thought, but we discarded it quickly as\n\nit could be a very tedious and error-prone process. While creating social network profiles was actually\n\neasy, keeping them active was the hard part. And inactive, freshly created social profiles would just be red\n\nflags. We decided that we did not want to invest time and resources in maintaining social media profiles.\n\nAnyone who might be planning on recreating our setup should consider making the same decision, as\n\nthey could fall into thinking that it would only take a few posts once in a while to maintain a believable\n\nsocial media account.\n\nWith this in mind, our first asset was a website. In creating a website, we first needed a company name.\n\nWe chose a name that reflected our rapid prototyping specialization: MeTech. MeTech was a fictitious\n\ncompany name that we came up with to give the honeypot additional credibility. It is not now, nor has it\n\never been, affiliated in any way with any real company that uses the word “MeTech” or any similar words\n\nor phrases as part of its company name.\n\n\n-----\n\nWe then decided on a motto and a logo, for which we simply used a free logo generator. Similarly, we\n\nused a royalty-free web template to design a professional-looking website with only a few pages. The\n\nfront page was the most important one. We needed to quickly convey a clear message in only that one\n\npage, which was that we were contractors for large enterprises. Our advertised business (i.e., rapid\n\nprototyping) needed to be in line with our honeypot system. The finished homepage of our website,\n\nmetech.co, is shown in Figure 9.\n\nFigure 9. A screenshot of our company’s homepage\n\nWe hand-picked royalty-free images from various sites. We focused on large, low-popularity pictures,\n\nfrom which we could crop relevant objects (e.g., machines, prototypes, labs). This also reduced the\n\nchances of anyone finding the same photos should they search for keywords related to our business.\n\nSimilarly, cropping and rotating avoided the possibility of someone finding the real source of an image\n\nusing, for instance, Google reverse image search.\n\n\n-----\n\n#### People and Contacts\n\nWe wanted to look like a real company composed of real people, with professional profiles in line with\n\nthe expertise needed by our job. We came up with the full names of four fictitious people and looked for\n\nstock images that would fit their ethnicities. Initially, we focused on group photos or photos from which\n\nwe could crop and slightly alter good head shots.\n\nWe did not want a casual attacker to be able to use the reverse image search features of some web services\n\n(e.g., Google Images) to discover that we had used photos taken randomly off the web. Eventually, we\n\nlooked for good-quality AI-generated photos of nonexistent people. We then came up with a short profile\n\nfor each name and photo. We kept the profiles short and essential, without providing too many details,\n\nwhich could be used by an attacker to cross-check the profiles. For this reason, we avoided putting any\n\naffiliation (e.g., school or city names) and kept the profiles rather generic and focused on technical skills.\n\nSince we were just a small company working for important customers, we thought that discretion would\n\nfit our overall image. The result is shown in Figure 10.\n\nFigure 10. Screenshots of the contacts page of our company website\n\nCreating a contact email address was very easy. We used our hosting provider’s mail server. On top of that,\n\nwe used a simple online service to build a web form that we could put on our website for it to look even\n\nmore professional. The form that we created had a simple handler that forwarded any contact request to\n\nour email inbox.\n\n\n-----\n\nFigure 11. Virtual receptionist configuration\n\nCreating phone numbers required an external VoIP provider. Considering the many options available\n\nnowadays (a simple web search for “e-receptionist” or “cloud phone service” would yield a number of\n\nresults), we opted for a service run by a personal contact of our own. We wanted someone whom we\n\ncould trust and who would allow us a little control over the system, e.g., allow us to customize the service\n\nif needed.\n\nWe created two phone numbers under the U.S. country code, one per site (the engineering lab and the\n\nfront office). We wanted someone who could answer professionally, so we configured the e-receptionist\n\nsystem with a distinct recorded message, with a voice guide and the option to leave messages.\n\n\n-----\n\n## Building the Honeypot\n\nWith a clear concept of what we wanted for our honeypot, we were able move on to the execution of\n\nour plans. In this section, we discuss the infrastructure and tools we used to create our honeypot. These\n\ninclude actual operational technology (OT) software and monitoring tools that would allow us to record\n\nincidents in our honeypot in real time. We also illustrate the actions we took to lure potential threat actors\n\ninto attacking our system.\n\n#### Monitoring Environment\n\nTo get the most out of our honeypot, we had to carefully design our monitoring environment. We needed\n\nto get relevant data in real time while keeping the evidence of our monitoring to a minimum so as not to\n\ndeter threat actors from naturally conducting an attack.\n\n##### Infrastructure\n\nThe monitoring infrastructure consisted primarily of a Raspberry Pi 3, four USB Ethernet adapters, four\n\nSharkTap Ethernet taps, and a large external drive. We inserted the Ethernet taps into four specific\n\nlocations in the network, as illustrated in Figure 12.\n\nInternet Cellular modem Cisco ASA 5505 Switch Siemens S7-1200\n\nETH4 - Siemens\n\nFile server\n\nOmron CP1L\n\nETH2 - Omron ETH1 - Laptop\n\nHMI\n\nRaspberry PI\n\nENGR\n\nETH3 - Allen-Bradley\n\nLaptop Allen-Bradley MicroLogix\n\nMicroLogix 1100\n\nRobot\n\nAllen-Bradley\nMicroLogix 1100\n\nInternet Wireless router for host\nand network monitor\n\nFigure 12. The full honeypot design with the red boxes depicting the SharkTap Ethernet taps\n\n\n-----\n\nThe location of three of the PLC Ethernet taps allowed us to monitor external traffic sent specifically to the\n\nthree internet-exposed PLCs, with one PLC accessible only from the local network. The fourth Ethernet\n\ntap was used to monitor the exposed VirtualBox guests and any traffic from the guests to any of the other\n\nsystems on the network.\n\nFigure 13. A SharkTap device and the Sierra Wireless AirLink RV50 that we used\n\nThe Raspberry Pi 3 was able to handle our packet load with few dropped packets, although the new\n\nRaspberry Pi 4 would have worked better as it supports USB 3.0. The Raspberry Pi could be accessed\n\nonly via the VirtualBox host. We set up the Raspberry Pi to capture the traffic in 24-hour increments,\n\nwhich made it easy to parse what was happening on a daily basis. For some lightweight analysis, the\n\nsummary scripts described in the “Tools” subsection below was performed on the Raspberry Pi, while\n\nother analysis required the packet capture (PCAP) files to be off-loaded to a secondary server.\n\nThe internal infrastructure was connected to the internet via an industrial cellular router (as illustrated in\n\nFigure 12), the Sierra Wireless AirLink RV50. We chose this router since its predecessor, the AirLink Raven,\n\nis commonly used in the U.S. An industrial cellular router is similar to a consumer cellular router built for\n\nindustrial environments in that it also has features such as indoor and outdoor use and greater operating\n\ntemperatures.\n\n##### Firewall\n\nDuring our research, we found out a limitation of our industrial router, which was that it would not let us\n\ndo selective blocking to prevent attacks that ran counter to what we were trying to encounter with our\n\nhoneypot. To remedy this, we deployed a firewall in transparent mode between the router and the switch.\n\nOur firewall was a Cisco ASA 5505, which we had on hand, but this could have just as well been any\n\nfirewall that could operate in transparent mode. Adding the firewall allowed us to block things with little\n\nimpact to the network.\n\n\n-----\n\nFigure 14. Access lists that we ran on our network appliance\n\nFigure 14 shows an example of the access lists that we ran on our network appliance. We had an object\n\ngroup called “bad hosts” where we put hosts that we did not want communicating with our honeypot\n\nand vice versa. These included known good hosts that for the purpose of our honeypot we tagged as\n\nmalicious. Adding these known good hosts to our firewall also prevented fraud from originating from our\n\nsystems.\n\n##### Tools\n\n###### Scripts\n\nAny internet-facing system nowadays immediately receives a lot of traffic, especially from scanners. For\n\nour purpose, it was not straightforward to enumerate and whitelist all the scanner sources as they vary\n\nover time. In addition, not all scan traffic comes from legitimate scanning services such as Shodan, which\n\nadvertises its scanners in such a way that people could filter out their source IP addresses. Initially, we\n\nhad to perform some manual work to tell “signal” and “noise” apart. For this reason, we wanted to\n\nreceive daily summary emails with traffic statistics, rankings, and other analytics that could help us spot\n\ninteresting patterns.\n\nWe generated three different scripts to assist in monitoring traffic. The first script created a list of IP\n\naddresses that connected to our PLCs and VirtualBox guests, created the corresponding reverse Domain\n\nName System (DNS) information for each IP address, and counted the number of packets from each IP\n\naddress. The list is then emailed to the members of our team.\n\n\n-----\n\nFigure 15. Output of the first script, containing actual IP addresses and host names\n\nThe second script looked at external conversations. It used Wireshark’s tshark CLI application to gather\n\nthe statistics of the conversations, perform a reverse DNS and GeoIP lookup, and email the list to the\n\nteam.\n\nFigure 16. Output of the second script, showing external conversations\n\nThe third script was added later to search for IP addresses that connected to the factory honeypot multiple\n\ntimes over the course of days, weeks, or months. This script crawled through all of the PCAP files we had\n\ncollected, which were segregated by date. It aggregated IP addresses, reverse DNS information, the last\n\ndate an IP address connected to the honeypot, and the number of days an IP address had connected to\n\nany of our systems.\n\n\n-----\n\nFigure 17. Output of the third script, showing aggregated statistics on each IP address\n\nThese scripts made it easier for us to hunt for and monitor specific or potentially interesting actors using\n\nMoloch.\n\n###### Network Traffic Analysis and Investigation With Moloch\n\nWe needed an effective way to manually dig into the network traffic recordings. While using command-line\n\ntools (e.g., tshark and tcpdump) along with some shell scripts is great for quick tasks, such an approach\n\nwould not be enough to fully handle an environment where multiple people need to collaboratively analyze\n\nand look at many gigabytes of traffic. We turned our attention to Moloch,[8] an open-source traffic analysis\n\nsystem developed by AOL. It provides a user experience similar to that of Wireshark but has more features\n\nfor collaborating, annotating packets, tagging, exporting, drilling, and other tasks.\n\nFigure 18. A screenshot of Moloch, purposely picked from Moloch’s official website\n\nto avoid revealing any detailed information about the real traffic that our honeypot had received\n\n\n-----\n\nInstallation was rather easy, but we needed some fine-tuning. Since we did not want to process the\n\nnetwork data using the same machines used for our honeypot, we exported the PCAP dumps every day\n\nto an Amazon Simple Storage Service (S3) bucket. We then set up a daily cron script that imported the\n\nfiles from the S3 bucket to the Moloch machine, which we located on the Amazon Web Sevices (AWS)\n\ncloud. Moloch’s default setup is to process live network traffic from the system interfaces. However, it is\n\npossible to configure it to process offline data and move it away from a “queue” folder once done.\n\n###### VirtualBox Screen Recording\n\nTo properly document the attacks that we would be receiving on our honeypot system, we decided to\n\nrecord video of the screen every time there was a change made or every time there was VNC access to\n\nthe opened robotics workstation. We created a script that would monitor the VirtualBox guest’s screen\n\nthrough our host machine and take a screenshot on a fixed interval. We then compared two images\n\nto check if there were any big differences — an indicator that someone had been trying to access our\n\nhoneypot through unauthenticated VNC. We started screen-recording the monitored guest VM once a\n\nscreen change was detected, continuously checking whether the VM was still being accessed before\n\nstopping the recording.\n\nThe VirtualBox screen recording proved effective. We minimized any VirtualBox installation footprint on\n\nour guest VM by not installing any guest additions. We also tried replaying VNC traffic from the PCAP to\n\nsee what had been changed on our system, but using the custom screen recording was an easier route\n\nfor us to go with.\n\n###### VNC Utilities\n\nWe investigated both VNC and Remote Desktop Protocol (RDP), and determined that VNC was easier to\n\nmonitor from a pure network perspective than RDP. To make sure the honeypot looked as real as possible,\n\nwe did not have additional tools running on the VirtualBox guests that might tip off an attacker. The\n\n“remote framebuffer” (RFB) protocol VNC is built on was easier to extract information from — information\n\nsuch as keystrokes and clipboard data. In some cases, the VNC session could even be replayed.\n\nThe main tools we used for VNC monitoring were Chaosreader[9] and VNCLogger.[10] Chaosreader can\n\nextract VNC sessions and keystrokes from a PCAP file. While the VNC session replay worked well with\n\ninternal testing, it was difficult to get working for much of the real-world VNC connections, which was\n\nwhy we relied on the VirtualBox screen recording. The keystroke extraction worked, but we found that it\n\ndid not show certain keystrokes (e.g., backspace, enter, control), so it was not as useful as VNCLogger\n\nfor keylogging.\n\nVNCLogger did a better job of extracting all of the keystrokes, but there were a couple of drawbacks to it.\n\nOne drawback was that it is designed to listen on an interface instead of processing PCAP files. This issue\n\nwas easily overcome using tcpreplay. The other drawback to VNCLogger, one shared by Chaosreader,\n\nwas that it does not show clipboard data. In order to obtain clipboard data, we used Wireshark. A few\n\nminor updates to VNCLogger would address the gaps we noticed.\n\n\n-----\n\n###### Zeek and Intel Stack\n\nWe looked into the network security monitor Zeek,[11] formerly known as Bro, combined with Intel Stack,\n\na marketplace of free threat intelligence optimized for it.[12] While some of the output was interesting, we\n\ndetermined that Trend Micro’s own tools and the Suricata threat detection engine[13] provided data that\n\nwas more relevant to our purposes.\n\n###### Syslog Feed From Router, Firewall, and Other Appliances\n\nAs mentioned earlier, we implemented a transparent firewall, allowing us to log our access lists and syslog\n\nthem to a host. This host did not need to have any syslog systems running as we configured our syslog to\n\nuse User Datagram Protocol (UDP). We then pointed syslog to the file server IP address so that we could\n\npick up the syslog messages on our previously described full packet captures.\n\nFigure 19. Enabled syslog logging on the Cisco ASA 5505\n\nWe also logged our AirLink router for any events that were possibly caused by an attacker to the router\n\nitself. Figure 20 shows examples of messages we saw from the router and the transparent firewall.\n\nFigure 20. Examples of messages we saw from the router and the transparent firewall\n\n\n-----\n\n#### Luring Attackers\n\nOne of the main goals of a honeypot is to be attacked. But how does one go about setting up a honeypot\n\nto be attacked? The approach we took was to stage leaking information, to put us in such a position that\n\nattackers might find our honeypot interesting enough to play around in and eventually attack. To do this,\n\nwe started by opening specific ports when we brought the honeypot online, as listed in Table 1.\n\n**Port Number** **Service**\n\n102 Siemens S7\n\n3389 RDP\n\n5900 VNC\n\n5901 VNC\n\n9600 Omron FINS\n\n44818 EtherNet/IP\n\nTable 1. Exposed services on the external router\n\nThese were the ports that we started with in opening our honeypot to the internet through our AirLink\n\nWireless gateway. However, because of the increased amount of scanning on RDP TCP/3389, we saw\n\nhuge performance issues on our network and we decided to not run RDP as it at times made the internet\n\nunusable from our stance. With RDP open on a certain network, there may be performance issues on the\n\nnetwork due to the amount of traffic that is coming at the network to brute-force RDP, including ones that\n\nuse exploits to get into the network with RDP. After we removed RDP, the final setup looked as shown in\n\nFigure 21.\n\nFigure 21. The final setup on the external cellular router\n\n|Port Number 102 3389 5900 5901 9600 44818|Service Siemens S7 RDP VNC VNC Omron FINS EtherNet/IP|\n|---|---|\n\n\n-----\n\nThis was how we ran the system for months, with both of the VNC services in view-only mode, which\n\nrequired no password. Here was where we tried to make things look realistic and see how fast it would\n\ntake for an attacker to notice if something got changed on the network and take advantage of it.\n\nAbout a month into running our honeypot, we “misconfigured” VNC to allow remote input on the robotics\n\nworkstation. We did this over the HMI just to see whether anyone would try to pivot from machine to\n\nmachine to machine.\n\nLater, we acted like a victim infected by malware and uploaded several items to an online antivirus\n\naggregation service, including network diagrams of our factory and some other sensitive information. This\n\nwas to see whether an attacker might be using credentials to search for information leakage. However, we\n\nsaw no attacks related to this information leakage in the online antivirus aggregation service.\n\nShortly afterward, we posted some information about our honeypot on Pastebin, as shown in Figure\n\n22. This included a link to our submission to the antivirus aggregation service and basic information, to\n\nagain see whether we could lure attackers with information leakage in one of the typical places where\n\nit happens.\n\nFigure 22. Information about our honeypot, which we posted on Pastebin to attract attackers\n\nWe then wanted to see whether there would be an increase in attacks if we exposed the web HMI from the\n\nvendor of the HMI that we were using. We made a second Pastebin post, shown in Figure 23, about this\n\na few days later. The post included an update that made it sound as though the post came from a group\n\nthat was actively monitoring the system.\n\n\n-----\n\nFigure 23. Our second Pastebin post, including an update that made it sound as though\n\nthe post came from a group that was actively monitoring our honeypot\n\nWe then monitored underground forums and other online locations for any communications about our\n\nhoneypot to see whether anyone else was discussing it. However, we did not find anything related\n\nspecifically to our honeypot.\n\n#### Lessons Learned\n\nDuring the time that we ran our honeypot, we learned several things that needed to be checked to make\n\nour honeypot more appealing, realistic, and resilient to attacks. This subsection discusses a short list of\n\ndetails that need to be accomplished before running a complicated factory honeypot:\n\n- **Remove all VirtualBox artifacts. On the first few weeks we went live, a member of our team checked**\n\nwhether there was a VirtualBox tray icon on the Windows task manager.\n\n- **Back up files. We did this for resiliency to ransomware attacks, which our honeypot would encounter**\n\noften.\n\n- **Frequently take snapshots of VirtualBox images. We took a snapshot when the system was clean,**\n\nafter an attack, and/or after a Windows update. Ideally, snapshots should be taken daily if storage\n\nspace is not an issue.\n\n\n-----\n\n- **Design the HMI before creating the logic.** We searched for the normal operating values of the\n\nactuators and motors needed on the manufacturing line. From there, we decided on the layout of the\n\nHMI and created the appropriate logic. We then refined the logic and HMI as needed.\n\n- **Install a firewall.** Filtering fraud-related attacks and other unwanted attacks can take some time.\n\nUnfortunately, it is difficult to find the right balance between “attacks that you want to filter” and\n\n“attacks that may turn out to be useful and related to the honeypot.” For this reason, we had to adjust\n\nthe firewall rules over time, as we learned of new attacks.\n\n\n-----\n\n## Incidents\n\nOur honeypot went online in May 2019. For seven months, we maintained the image of a real company\n\nand monitored the honeypot closely. The first attack we encountered came a month after the honeypot\n\nwent live, with several others following in its wake. This showed that our ruse as a small business with\n\ncritical clients and inadequate security was effective in luring threat actors.\n\nSome of the attacks we saw had been briefly mentioned in the previous section detailing the\n\nconceptualization and creation of our honeypot. In this section, we discuss each type of incident that\n\nwe saw. We also provide a summary of our findings in a single timeline illustrating the order in which the\n\nattacks occurred and which of them overlapped.\n\n#### Scanners\n\nAs mentioned earlier, when we started looking at incidents we specifically wanted to exclude any traffic\n\nthat was generated by scanners of well-known, reputable companies. These included ip-ip, Rapid 7,\n\nShadow Server, Shodan, and ZoomEye,. However, during our review of all the traffic, we found that there\n\nwere many other scanners from companies that performed internet figure monitoring and related services,\n\nwhich we also needed to exclude. To do so, we did reverse lookups of IP addresses that were observed\n\nhitting our honeypot in a scanner-like manner. We excluded IP addresses that resolved to sites that, when\n\nvisited, explained the nature of their scanning.\n\nOf the 9,452 unique IP addresses observed over the period our honeypot was online, 610 were linked to\n\nscanners. That was 6.45% of all unique IP addresses.\n\n#### Frauds\n\nOne of the biggest risks we ran into, as with anyone else who has VNC or RDP open to the internet, was\n\nmisuse of the system and resources by third parties to engage in fraudulent activities. We observed that\n\nthird-party actors had used the resources in the honeypot to engage in and obscure possibly abusive\n\nand inappropriate activities, such as buying smartphones by upgrading mobile subscriber accounts and\n\ncashing out airline miles for gift cards.\n\n\n-----\n\n#### Malicious Cryptocurrency Mining\n\nOne of the first uses our honeypot took on shortly after we opened remote control on VNC was as a\n\ncryptocurrency miner. A threat actor came into our system, opened a web browser, went to a website, and\n\ndownloaded a PyInstaller[14] bundle file called host.exe.\n\nFigure 24. A PyInstaller file called host.exe, which was downloaded by one of the\n\nthreat actors who accessed our honeypot\n\nUsing a combination of PyInstxtractor[15] and Uncompyle6[16] to decompile the file, we learned that this file\n\nwas an open-source tool called Ares[17] that had a hard-coded command-and-control (C&C) server. Based\n\non these findings, we then looked into what information was being sent to the C&C server. This was where\n\nwe discovered that the threat actor had installed and joined our system to a well-known Monero-mining\n\nsystem. We found cryptocurrency mining on a VM strange as it seemed that it would not yield much.\n\nHowever, if this was going on with many other machines around the world, the threat actor behind it could\n\ncash in on the attack well.[18]\n\n#### Ransomware Attacks\n\nDuring the period we were running our honeypot, we came across two ransomware infections on\n\nour system. As mentioned earlier, we purposely exposed an accessible VNC service on our robotics\n\nworkstation and recorded videos of the attackers carrying out their campaigns. These two separate\n\nincidents were most likely carried out by two unrelated individuals or groups, but the execution flows of\n\nthe ransomware attacks were quite similar.\n\n\n-----\n\n##### Crysis Ransomware\n\nThe first ransomware attack we encountered happened in late September. We were able to document the\n\nentire duration of the attack. We also responded to the attackers, still posing as our organization, to gain\n\nfurther insight into how similarly threat actors might conduct their deals.\n\nOn Sept. 22, a threat actor began looking around our system. Typical of threat actors, they first investigated\n\nthe system, likely looking for important and sensitive files. They looked at a few items such as the shared\n\ndrive. Their next actions were to close the robotics workstation application and to go back to the shared\n\ndrive to see how much information was on it.\n\nFigure 25. Investigation of the system carried out by the threat actor\n\nAfter these initial actions on our system, they then downloaded the remote desktop software TeamViewer.\n\nIn fact, they opened Bing and searched for “timeviwer” to do so. Then they ran the TeamViewer installer.\n\nThey chose to run TeamViewer only once and chose the option to use it for personal use.\n\nFigure 26. Downloading and running of TeamViewer performed by the threat actor\n\n\n-----\n\nOnce they started connecting to our system using TeamViewer, we lost further keystrokes from the PCAPs.\n\nThis did not stop us from monitoring this attack, however, especially since at this point the threat actor had\n\nstarted to take more interesting actions. They then transferred three files over TeamViewer, which included\n\nthe ransomware file:\n\n- 1btc.exe\n\n   - The ransomware file, a variant of Crysis\n\n   - Detected by Trend Micro as Ransom.Win32.CRYSIS.SM[19]\n\n   - SHA1: ddf8c065d45c734b5b58e770e4f1ea086a293f19\n\n   - First submission from VirusTotal: 2019-07-24 10:14:26 UTC\n\n- Everything.exe\n\n   - A normal application that lists all files on a file system. It allows an attacker to check whether a\nsystem is already infected by another piece of ransomware using the search function.\n\n   - SHA1: c8107e5c5e20349a39d32f424668139a36e6cfd0\n\n- NS.exe\n\n   - A tool used to scan mounted and unmounted physical and network drives. Its ability to scan\nunmounted drives makes it very effective for ransomware attacks.\n\n   - Detected by Trend Micro as HackTool.Win32.NetTool.A[20]\n\n   - SHA1: 629c9649ced38fd815124221b80c9d9c59a85e74\n\n   - It is highly similar to a sample analyzed by Hybrid Analysis.[21]\n\nFigure 27. Downloading of files by the threat actor using TeamViewer\n\nAfter downloading the files, they connected to the system using the computer name “X555DG” with a\n\nTeamViewer ID of “1 405 532 321”. They then started transferring the files to the Documents library under\n\nthe subfolder they named Yandex.\n\nAfter this point, the threat actor began running each of the downloaded files, beginning with NS.exe,\n\nthe tool used to scan for mounted and unmounted drives. Next, they ran the Everything.exe file as an\n\nadministrator. While this was running, they opened a command window and typed in the command\n\n\n-----\n\n“vssadmin delete shadows /all”, which is commonly used in ransomware attacks. Finally, they ran the\n\n1btc.exe file, the Crysis ransomware variant, as an administrator. We were able to record all of these\n\nactivities, as shown in Figures 28 through 30.\n\nFigure 28. The NS.exe file being run\n\nFigure 29. The command “vssadmin delete shadows /all” being run\n\n\n-----\n\nFigure 30. 1bitc.exe being run as an administrator\n\nAfter setting all of these in motion, the threat actors watched and waited by opening the task manager.\n\nThey even stopped other services to give their activities more processing power, as shown in Figure 31.\n\nThey then checked the result of their work by looking at all of the files listed in Everything, the otherwise\n\nlegitimate tool used for listing files on a file system. As shown in Figure 32, the ransomware seemed\n\nto have successfully affected the files in our system. The threat actors even looked at a particular\n\nfile (AcroRdrDCupd1901220034.msp.id-7C24B999) and checked its properties to confirm that the\n\nransomware had worked.\n\nFigure 31. The threat actor viewing task manager and stopping services\n\n\n-----\n\nFigure 32. The threat actor checking files to see whether the ransomware had worked\n\nFinally, with their work done, they closed TeamViewer. A ransom message then popped up, containing\n\nthe typical content like the contact details of the threat actor, how to pay them in bitcoin, and the usual\n\nwarning not to attempt to tamper with the encrypted files.\n\nFigure 33. The ransom note that appeared after the threat actor closed TeamViewer\n\n\n-----\n\nAn actual company, upon realizing that its files have been encrypted and reading the ransom note, would\n\nhave to go through several decision-making processes to handle such a situation. In our case, still posing\n\nas our cover company, we emailed the threat actor using the contact information they had left behind.\n\nOur first email was meant simply to engage the threat actor behind the provided email address. The reply\n\nwe received was an obviously automated response, and it was followed a day later by an email asking for\n\nfurther details. These first few exchanges can be seen in Figure 34.\n\nFigure 34. The first few emails exchanged with the threat actor\n\nWe responded to the email shown in the last image in Figure 34 by saying that one computer and one file\n\nserver were affected in the attack. The next email from the threat actor contained a list of instructions and,\n\nmore significantly, their demand for US$10,000 worth of bitcoin in exchange for having our files returned\n\nto normal, to be transferred to their wallet address, also specified in the email.\n\n\n-----\n\nFigure 35. The emailed list of instructions, including the ransom amount in bitcoin\n\nand the wallet address where the payment should be transferred\n\nThis email was followed by another email, this time informing us of the threat actor’s working hours. This\n\napparently served as a prelude to the next email, which simply stated that their working hours were done\n\nfor the day and that further emails would be replied to the following day. It illustrated how organized the\n\ncrime was from the end of the threat actor. When we did not respond for some time, they emailed us again\n\nto ask whether we had received their previous message, as shown in Figure 36.\n\nFigure 36. Thread snippet showing the threat actor’s working hours and follow-up email\n\n\n-----\n\nIn response, we sent an email asking them to decrypt a file as an example, to make sure that they did in\n\nfact have the decryption key. As shown in Figure 37, during this part of our exchange, we acted the part\n\nof a disgruntled company representative asking why the threat actor was doing this in the first place. They\n\nanswered succinctly and obliged us by decrypting a sample file.\n\nWe sent them the conveyor belt PLC programing file (Omron CXP file), which they decrypted accordingly,\n\nsuggesting that they were unaware that we had in fact sent them an important file. After resending the\n\ndecrypted file, they reiterated their demand for and preferred mode of payment.\n\nFigure 37. Thread snippet showing our request for a sample decrypted file and the other party agreeing to it\n\n\n-----\n\nWe continued the exchange by attempting to haggle. Ultimately, we managed to reduce their price to\n\nUS$6,000 worth of bitcoin from the original US$10,000, as shown in Figure 38.\n\nFigure 38. The last part of our exchange, where we haggled for the price of the ransom\n\nWhen this attack had run its course, we simply reset the system after getting all the information we could.\n\n##### Phobos Ransomware\n\nOn Oct. 21, another ransomware attack occurred on the honeypot. The event took almost an hour\n\nand consisted of the threat actor browsing the file system, scanning the network, and deploying the\n\nransomware. We later found out that the ransomware used for this attack was named Phobos, detected\n\nby Trend Micro as Ransom.Win32.PHOBOS.SM.[22] We recorded notable keystrokes that the attacker\n\ntyped in our honeypot network, as shown in Figure 39.\n\nFigure 39. Notable keystrokes from the second ransomware infection\n\n\n-----\n\nThe threat actor visited the link “sendspace[.]com/file/qlhvgn” to download a RAR archive. This archive\n\nhad the filename “remove backups.rar” (SHA1: ef1418e3fcdcca4410014948116a28fa47e74fe2) and\n\ncontained the files for the attack, as shown in Figure 40 and detailed in Table 2. Perhaps noticing that\n\nthere was no archiver utility installed on our system, they decided to download WinRar as well. They\n\nopened the archive, which was protected with the password “werty163”, as we found logged from the\n\nnetwork traffic.\n\nFigure 40. The contents of the RAR archive\n\n**Filename** **SHA1** **Trend Detection** **Description**\n\n8ecff105db88464edf548b542a7837e92e56fcbe Deletes all shadow copies\n\nf628f11e39d2ce90e49de8774df40a248a6abcff Network scanner\n\nPC_H32.exe c4e2953509e9a47d9ee0ecfa8c886328d700ed7e PC Hunter, an analysis tool for\nWindows\n\nPC_H64.exe d373052c6f7492e0dd5f2c705bac6b5afe7ffc24 PC Hunter, an analysis tool for\nWindows\n\n5ce6f58f46dc8ab89fd8bfc994dabb50316e7202 Task Manager Deluxe\n\n75ba2e4bfb47feed72deed2bed9b2ef698e3253f Process Explorer\n\nbackup.bat 86f599090aa2c7c1df65dccccf00e1818e72246a Deletes all shadow copies\n\ndisable_defen.bat c17f4d57deb93050d094e5a09d2f9e58abc252f9 Disables Windows Defender\n\nmimikatz_trunk.zip ebabab9c5b723df0fde7fe02dc22145e39ba0502 HKTL_MIMIKATZ.component Mimikatz files\n\nph_exec.exe 2be826b4864f86c37592a2e908638873b5ff093c Ransom.Win32.PHOBOS.SM Phobos ransomware used in the\nattack\n\npscan24.exe 47dfbbbce8170891ddfbdcdd4e6a24d465d847e1 Port scanner\n\nstop services.bat 8b77e8888276c8ce99746a7c0d5ca3f93ea9dee8 Batch file that stops database\nservices (e.g., MSSQL, MySQL,\nPostgreSQL) and Windows\nDefender\n\nTable 2. Details of the files from the archive\n\n|Filename|SHA1|Trend Detection|Description|\n|---|---|---|---|\n|1.bat NS.exe PC_H32.exe PC_H64.exe TMX64.exe asfasf.exe backup.bat disable_defen.bat mimikatz_trunk.zip ph_exec.exe pscan24.exe stop services.bat|8ecff105db88464edf548b542a7837e92e56fcbe f628f11e39d2ce90e49de8774df40a248a6abcff c4e2953509e9a47d9ee0ecfa8c886328d700ed7e d373052c6f7492e0dd5f2c705bac6b5afe7ffc24 5ce6f58f46dc8ab89fd8bfc994dabb50316e7202 75ba2e4bfb47feed72deed2bed9b2ef698e3253f 86f599090aa2c7c1df65dccccf00e1818e72246a c17f4d57deb93050d094e5a09d2f9e58abc252f9 ebabab9c5b723df0fde7fe02dc22145e39ba0502 2be826b4864f86c37592a2e908638873b5ff093c 47dfbbbce8170891ddfbdcdd4e6a24d465d847e1 8b77e8888276c8ce99746a7c0d5ca3f93ea9dee8|HKTL_MIMIKATZ.component Ransom.Win32.PHOBOS.SM|Deletes all shadow copies Network scanner PC Hunter, an analysis tool for Windows PC Hunter, an analysis tool for Windows Task Manager Deluxe Process Explorer Deletes all shadow copies Disables Windows Defender Mimikatz files Phobos ransomware used in the attack Port scanner Batch file that stops database services (e.g., MSSQL, MySQL, PostgreSQL) and Windows Defender|\n\n\n-----\n\nPhobos has similar attributes to Crysis, which was the ransomware variant used in the previously discussed\n\nattack. The screenshot in Figure 41 shows the ransom note that was displayed after the malware was\n\nexecuted and also after the system was rebooted. Encrypted files were renamed with the file extension\n\n.actin, as shown in Figure 42.\n\nFigure 41. The ransom note left by the Phobos ransomware\n\nFigure 42. Encrypted files from the Phobos ransomware attack\n\n\n-----\n\n##### A Fake Ransomware Attack\n\nSeveral weeks after the second ransomware attack, on Nov. 12, another threat actor came in and dropped\n\n“ransomware” in our system. This threat actor fumbled around our system trying to get a PowerShell\n\ncommand to work.\n\nFigure 43. The threat actor attempting to run a PowerShell command\n\nWhen they were able to get it to work, it downloaded a file called haha.bat. We watched them struggle to\n\nget this tool to work. They kept changing the bat file to “haha.rnsmwr”, as shown in Figure 44, but they\n\nlater renamed it back to “haha.bat”. This confused us until we saw that the “ransomware” was really just\n\nusing the REN or rename command.\n\nAt one point, as shown in Figure 45, the threat actor even edited haha.bat, which gave us a glimpse of the\n\ncode as its Pastebin page was no longer active. Even though we were watching them perform this attack\n\nlive, they were still quick to close the haha.bat code.\n\n\n-----\n\nInterestingly, after all of these actions, they also made sure that the ABB directory was also “ransomed”\n\nor renamed, as shown in Figure 46.\n\nFigure 44. The threat actor renaming haha.bat to haha.rmsmwr\n\nFigure 45. The threat actor editing the haha.bat file\n\n\n-----\n\nFigure 46. The threat actor renaming the ABB directory\n\nThey then moved on to editing the ransom message. First, they changed the wallet address. Then, they\n\nchanged the payment they were demanding, from US$200 to US$750. They also assigned passwords\n\nto VNC so that only they would have access. They used the admin password “#concreTec” and the view\n\npassword “serfcx”. These actions are reflected in Figures 47 through 49.\n\n\n-----\n\nFigure 47. The threat actor changing the wallet address\n\nFigure 48. The threat actor deciding on the US$750 ransom\n\n\n-----\n\nFigure 49. The threat actor assigning VNC passwords\n\nThey took a few final measures after all this had been set up. They again made sure that the ABB folder\n\nhad been “encrypted.” Then, they cleaned up the registry by editing some of the registry settings that\n\nwere modified during the process. And finally, they changed the desktop background image into their\n\nransom note before leaving our system. These actions are reflected in Figures 50 to 52.\n\nFigure 50. The threat actor checking that the ABB files had been “encrypted”\n\n\n-----\n\nFigure 51. The threat actor cleaning up the registry\n\nFigure 52. The threat actor changing the desktop background image to the ransom note\n\nTwo days later, on Nov. 14, they came back into our system — that is, we had assumed that it was the\n\nsame threat actor based on the unfolding behavior. They went into the Documents library and deleted\n\neverything that was in it, as shown in Figure 53. It should be noted that this was the library where the\n\n“ransomware” actor spent some time on during their first visit to the system.\n\n\n-----\n\nFigure 53. The threat actor deleting all of the files in the Documents library\n\nThey then created a program in Notepad that launched several de[.]youporn[.]com tabs. They executed\n\nthis program before leaving our system again. And sure enough, several tabs of the porn site were opened.\n\nThese actions, which are reflected in Figure 54, were likely meant to garner more attention, after the threat\n\nactor’s first attempt had gone unnoticed for several days.\n\n\n-----\n\nFigure 54. The threat actor leaving a wake of porn site tabs during their second visit to our system\n\n\n-----\n\n#### Attack With a Beacon\n\nOn Oct. 16, an actor came into the robotics workstation via VNC. As it turned out, their intention was to\n\nsend a beacon likely for lateral movement.\n\nThey went to https://www[.]sendspace[.]com/file/fjtdsk and downloaded a file called nsis.exe\n\n(SHA1: 00a31ed29c06c06dde3433a5d6fa0a5dc941f13e), a self-extracting archive with several encrypted\n\nfiles in it. We detail the contents of the downloaded file in Tables 3 and 4, the former pertaining to the\n\nencrypted version and the latter to the decrypted version.\n\n**Filename** **SHA1** **Encrypted** **Description**\n\n$PLUGINSDIR\\System.dll f7543f9e9b4f04386dfbf33c38cbed1bf205afb3 No\n\n$TEMP\\System.Data. 42d5708ee9b662fae73e78f0fd0c5228090c3b40 No Legitimate SQLite library for\nSQLite.dll retrieving stored passwords in\nChrome browser\n\n$TEMP\\ak.tmp 1775f9cb1829910dce7b412c2e7b1b701c23709e Yes\n\n$TEMP\\ak_1.tmp b5931a99036a9a874cb917b6992e7c4510f063c2 Yes\n\n$TEMP\\config.tmp e355b51cf1b98c5d9513ff0752b59e8ab09e93d4 Yes\n\n$TEMP\\installer.ps1 552c69ab13fbc4ed770b4bed69474fbf32ba6f4b No Main script that will be executed\nafter extraction of archive. This\nis responsible for decrypting the\ncomponent files and installing\nthe backdoor malware. Detected\nby Trend Micro as\nTrojan.PS1.CREDSTEAL.SM.\n\n$TEMP\\migwiz.tmp d5d02092dd453185f94f5882ffa090a0358be774 Yes\n\n$TEMP\\migwiz_1.tmp a2ca90c6b6efce5b85335b0cc3ecca07c024dcc0 Yes\n\n$TEMP\\rdpclip.tmp 7da837d644123e3547464273756800f22b0ed034 Yes\n\n$TEMP\\rfxvmt64.tmp 1885f2a4a58fb77c49763e09189aa3c1ec4eaa27 Yes\n\n$TEMP\\termsvc.tmp 4a6ab099aec72b4ca6b82db088e308d5542e1242 Yes\n\n$TEMP\\termsvc_1.tmp e774f3e8379615eaffb7c998c743ec119aa7b481 Yes\n\nTable 3. The list of encrypted files from the downloaded nsis.exe file\n\n|Filename|SHA1|Encrypted|Description|\n|---|---|---|---|\n|$PLUGINSDIR\\System.dll $TEMP\\System.Data. SQLite.dll $TEMP\\ak.tmp $TEMP\\ak_1.tmp $TEMP\\config.tmp $TEMP\\installer.ps1 $TEMP\\migwiz.tmp $TEMP\\migwiz_1.tmp $TEMP\\rdpclip.tmp $TEMP\\rfxvmt64.tmp $TEMP\\termsvc.tmp $TEMP\\termsvc_1.tmp|f7543f9e9b4f04386dfbf33c38cbed1bf205afb3 42d5708ee9b662fae73e78f0fd0c5228090c3b40 1775f9cb1829910dce7b412c2e7b1b701c23709e b5931a99036a9a874cb917b6992e7c4510f063c2 e355b51cf1b98c5d9513ff0752b59e8ab09e93d4 552c69ab13fbc4ed770b4bed69474fbf32ba6f4b d5d02092dd453185f94f5882ffa090a0358be774 a2ca90c6b6efce5b85335b0cc3ecca07c024dcc0 7da837d644123e3547464273756800f22b0ed034 1885f2a4a58fb77c49763e09189aa3c1ec4eaa27 4a6ab099aec72b4ca6b82db088e308d5542e1242 e774f3e8379615eaffb7c998c743ec119aa7b481|No No Yes Yes Yes No Yes Yes Yes Yes Yes Yes|Legitimate SQLite library for retrieving stored passwords in Chrome browser Main script that will be executed after extraction of archive. This is responsible for decrypting the component files and installing the backdoor malware. Detected by Trend Micro as Trojan.PS1.CREDSTEAL.SM.|\n\n\n-----\n\n|Filename|SHA1|Description|\n|---|---|---|\n|ak.bin ak_1.bin config.bin migwiz.bin migwiz_1.bin rdpclip.bin rfxvmt64.bin termsvc.bin termsvc_1.bin|3192ad3118b8c1eb5ee46764920a7d9120ca02e1 61a6b265bc612d97589dddd65e8d31cc9f0625ea 91c24a33a616168604645aacc01f32c9beac92aa fd4552e078bcae7134a3008d3b342011d835b007 554116aabd804663c24d8b3fa41cb72c00dc5b34 306498e9a9f1c6b2813dad7cdcd8433139201794 81d4ad81a92177c2116c5589609a9a08a5ccd0f2 34dd125d42fdb33d2108896ff276cbfe71154cca 8ffe80190f7662422bf6c5736a01ea26880b74a2|UAC bypass binary 64-bit version of ak.bin RDP config 64-bit version of migwiz.bin Legitimate Microsoft binary - rdpclip.exe (RDP Clipboard Monitor) Legitimate Microsoft binary - rfxvmt.dll (Microsoft RemoteFX VM Transport) 64-bit version of termsvc.bin|\n\n\nTable 4. The list of decrypted files from the downloaded nsis.exe file\n\nAfter the PowerShell command was executed, it decrypted the component files and dropped them in\n\nthe Windows temp folder. It then terminated Remote Desktop Services and replaced rdpclip.exe and\n\nrfxvmt.dll with older versions. It also replaced the service dynamic link library (DLL) used by RDP from\n\nthe registry.\n\nFigure 55. The threat actor replacing the DLL used by RDP from the registry\n\nThey then retrieved stored cookies, tokens, and credentials from the Chrome browser and wrote them on\n\nthe following files:\n\n- c:\\windows\\temp\\cookies.txt\n\n- c:\\windows\\temp\\tokens.txt\n\n- c:\\windows\\temp\\logins.txt\n\n- c:\\windows\\temp\\logins_read.txt\n\nThey then reconnected to VNC. A few minutes later, the robotics workstation began beaconing out\n\nto afsasdfa33[.]xyz, via HTTPS (port 443), the certificate of which was generated with Let’s Encrypt, a\n\nfree certificate authority.[23]\n\nAt the time of writing, it was still unknown to us what exactly was being sent out by our robotics workstation.\n\nHowever, we were still looking into the possibility that it was for lateral movement.\n\n\n-----\n\n#### Control System Attacks\n\nAs part of our conceptualization of our honeypot, we used PLCs from several different vendors to see the\n\npossible attacks their used protocols would be prone to. We also left these PLCs somewhat exposed and\n\ninadequately protected. In this subsection, we return to these PLCs and discuss the possible attacks we\n\nobserved on them.\n\n##### Control System ‘Attacks’\n\nIn our Moloch system, as in Wireshark, it is possible to filter down. Since we wanted to see whether there\n\nwere any attacks on our exposed PLCs, we tried filtering out all known scanners, a process we described\n\nearlier. As previously mentioned, doing so required taking the list of IP addresses, resolving them, and\n\nexcluding those that had host names that tracked back to a known internet scanner.\n\n##### Excluded Scanners\n\nWe spent quite some time building a reliable whitelist of internet scanners, which proved useful in\n\nexcluding benign traffic to the exposed ports. The result is shown in Table 5.\n\n51.15.191.81 80.82.77.139 146.88.240.6\n\n51.254.49.101 82.221.105.7 172.105.207.40\n\n68.169.145.238 89.248.167.131 185.142.236.34\n\n71.6.135.131 89.248.168.51 185.142.236.35\n\n71.6.146.130 89.248.172.16 185.173.35.0/24\n\n71.6.146.185 89.248.174.3 185.181.102.18\n\n71.6.146.186 92.118.160.0/24 185.216.140.6\n\n71.6.147.254 93.174.85.106 195.154.61.206\n\n71.6.158.166 93.174.95.106 198.20.70.114\n\n71.6.165.200 94.102.49.190 198.20.99.130\n\n71.6.167.142 104.251.248.86 198.108.66.0/24\n\n71.6.199.23 139.162.65.76 208.64.252.230\n\n80.82.77.33 139.162.83.10 212.83.146.233\n\n139.162.99.243\n\nTable 5. The IP addresses of excluded scanners\n\nWhat this left us with was traffic to our PLCs that could be malicious or that could be originating from\n\nscanners that are not well known. We determined the nature of the traffic by exporting and manually\n\nverifying the PCAPs from Moloch. To do this, we filtered down by the protocol used by each PLC vendor.\n\n|51.15.191.81 51.254.49.101 68.169.145.238 71.6.135.131 71.6.146.130 71.6.146.185 71.6.146.186 71.6.147.254 71.6.158.166 71.6.165.200 71.6.167.142 71.6.199.23 80.82.77.33|80.82.77.139 82.221.105.7 89.248.167.131 89.248.168.51 89.248.172.16 89.248.174.3 92.118.160.0/24 93.174.85.106 93.174.95.106 94.102.49.190 104.251.248.86 139.162.65.76 139.162.83.10 139.162.99.243|146.88.240.6 172.105.207.40 185.142.236.34 185.142.236.35 185.173.35.0/24 185.181.102.18 185.216.140.6 195.154.61.206 198.20.70.114 198.20.99.130 198.108.66.0/24 208.64.252.230 212.83.146.233|\n|---|---|---|\n\n\n-----\n\n##### Siemens S7-1200 PLC\n\nThe Siemens S7-1200 PLC sat on the honeypot network and was remapped or NAT-ed from port 102 to\n\nport 102. What we observed were hosts on the internet using valid commands to request for the CPU\n\nfunctions. These hosts would make the request and the PLC would respond with the basic hardware\n\ninformation. This could be seen as the same information that was collected by Shodan, as shown in\n\nFigure 56.\n\nFigure 56. Shodan information on Siemens S7-1200 PLC\n\nIn 2012, the independent cybersecurity researcher group SCADA StrangeLove released a tool called\n\nPLCScan[24] (now called s7scan[25]). It was a Python script that helped pull information about Siemens S7\n\nPLCs to aid in identifying PLCs on the network. Shodan took this script and started scanning the internet\n\nwith it in 2015. Digital Bond built this into its Redpoint framework, and took PLCScan and made it into an\n\nNmap script.\n\nFrom what we saw, all traffic to our PLCs that was not scanner-related was only using PLCScan (s7scan)\n\nor using s7-info.nse (see Figure 57), which was released in 2015 into the main branch of Nmap. (The file\n\nextension “nse” stands for Nmap Scripting Engine.) No other requests or commands were sent to our\n\nSiemens S7-1200 PLC at the time of writing, both from known scanners and non-scanners.\n\nFigure 57. Comparing the Siemens S7-1200 PLC traffic with s7-info.nse\n\n\n-----\n\nThe traffic was not inherently harmful. From our perspective, the traffic was simply from unknown scanners.\n\nHowever, we are not discounting the possibility that this could be part of a reconnaissance activity for\n\nfurther attacks that were never seen.\n\n##### Allen-Bradley MicroLogix 1100 PLC\n\nOne of the two Allen-Bradley MicroLogix 1100 PLCs on the honeypot network was NAT-ed through 44818\n\nto port 44818, while the other one was not exposed. For our discussion, we consider only the one that\n\nwas exposed as no attacks were seen laterally moving throughout the network to affect the other PLC.\n\nIn 2014, similar to what it did with the Siemens S7, Digital Bond added enip-info.nse to the main branch of\n\nNmap. This script sends a command 63 (request identity) to the PLC, to which the PLC will respond with\n\ninformation about itself, which is the same information shown in Shodan (see Figure 58).\n\nFigure 58. Information on an Allen-Bradley PLC as shown in Shodan\n\nWith some understanding of EtherNet/IP, the requesting host sets the sender context; this is changed\n\nbased on the station that sends the information. However, when the Nmap script was written, we found\n\nthat the sender’s context was set to “0x0000c1debed1”. This was the same for the majority of the scans\n\nthat went against our exposed Allen-Bradley MicroLogix PLC (see Figure 59).\n\nThis led us to believe that the majority of the traffic we saw was properly formed EtherNet/IP traffic,\n\nindicating that most of the traffic was based on the Nmap script and was likely from scanners that are not\n\nwell known. As with the Siemens S7-1200, these were also good recon scripts for determining whether\n\nan exposed device was a PLC, HMI, or any other type of EtherNet/IP-supported device.\n\n\n-----\n\nFigure 59. Comparing the Allen-Bradley MicroLogix 1100 PLC traffic to enip-info.nse,\n\nwhere the sender context is the same\n\nWhile most of the information we saw was only “List Identity(Req)”, we did see a number of “unknown\n\ncommands” (see Figure 60 for an example). However, looking further revealed that these unknowns were\n\nrandom information being sent to the port 44818. While in this case the PLC would respond simply by\n\nsaying that it was an unknown command, sending unknown traffic to known ICS protocol ports still\n\nremains a dangerous practice that could cause older devices to crash. And while we never encountered\n\nan issue because of this, it could have eventually caused an issue, as had been shown by Cisco Talos in\n\nits released vulnerabilities for Allen-Bradley MicroLogix PLCs.[26]\n\nFigure 60. An unknown command sent to the Allen-Bradley MicroLogix 1100 PLC\n\n\n-----\n\n##### Omron CP1L PLC\n\nOmron communicates over a protocol called FINS, which is a UDP or Transmission Control Protocol\n\n(TCP) that operates on port 9600. In 2015, Digital Bond released an Nmap script that identifies both the\n\nUDP and TCP versions of FINS. Shortly after this, Shodan and other known scanners took this script and\n\nstarted scanning the internet to help identify PLCs online.\n\nFigure 61. Information about an Omron CP1L PLC as shown on Shodan\n\nAs with the other PLCs, we took the data and filtered out all the known scanners and then manually\n\nlooked at the valid FINS communications. What we saw mirrored the findings from the other PLCs. Each\n\nrequest matched the omron-info.nse scripts that Digital Bond released, in this case for both the TCP and\n\nUDP versions of the FINS protocol.\n\nFigure 62. The UDP version of omron-info.nse\n\n\n-----\n\nFigure 63. The TCP version of omron-info.nse\n\n#### Gaining Notice From Legitimate Groups\n\nDuring the course of our research, a researcher named Dan Tentler (@Viss on Twitter) posted a tweet that\n\ncaptured our attention as it likely involved our honeypot. Tentler is a well-known researcher that has given\n\na number of talks on finding devices on Shodan and other internet-scanning services. If he was to find our\n\nhoneypot, we did not want legitimate groups to waste much time on it. This was why we had to monitor\n\nthe situation and prevent further escalation.\n\nFigure 64. The tweet from a researcher about our honeypot\n\nWithin a few days, we were in contact with Tentler, who had by then escalated the issue to all of the\n\nappropriate parties. These parties included all of those who needed to be notified in the event of a control\n\nsystem getting exposed to the internet, meaning it also included the Industrial Control Systems Cyber\n\nEmergency Response Team (ICS-CERT). This is the right course of action should what was happening to\n\nour honeypot happen to a real system.\n\n\n-----\n\n#### Honeypot Incident Timeline\n\nWe summarize the aforementioned incidents in a single timeline that spanned the period when the\n\nhoneypot was online to better illustrate when attacks happened and which attacks overlapped.\n\n**MAY**\n\n\n-----\n\n**OCT**\n\n\n-----\n\n**DEC**\n\n**DEC 5** **Switched VNC**\n\n**Factory start** **DEC 10**\n\nA threat actor starts the factory, stops the\nconveyor belt, stops the factory, and closes\nthe window.\n\n**DEC 11** **Factory start continued**\n\n**Factory start and** The same threat actor from the day before\n**activities on the HMI** **DEC 13** comes back, starts the palletizer, and opens\n\nthe log view of the optical eye.\n\nA threat actor plays around with the HMI\nbefore shutting down the factory, locking the\nscreen, and leaving the system.\n\nFigure 65. A timeline of incidents on our honeypot\n\nWe also summarize figures pertaining to the IP addresses that connected to our system and to\n\ncommunication that we detected over the period our honeypot was online, from May 6 to Dec. 31, 2019.\n\n**Unique IP addresses** **External-to-internal communication**\n\nNon-scanners 8,842 Packets 32,314,351\n\nScanners 610 Bytes 28,229,836,479\n\nTotal unique IP addresses 9,452\n\n**Total communication** **Scanner communication**\n\nPackets 565,220,996 Packets 192,473\n\nBytes 128,585,105,149 Bytes 222,123,953\n\nTable 6. A summary of figures pertaining to IP addresses and communication seen on our honeypot\n\n|External-to-internal communication|Col2|\n|---|---|\n|Packets Bytes|32,314,351 28,229,836,479|\n\n|Unique IP addresses|Col2|\n|---|---|\n|Non-scanners Scanners Total unique IP addresses|8,842 610 9,452|\n\n|Total communication|Col2|\n|---|---|\n|Packets Bytes|565,220,996 128,585,105,149|\n\n|Scanner communication|Col2|\n|---|---|\n|Packets Bytes|192,473 222,123,953|\n\n\n-----\n\n## Conclusion\n\nDuring the research period, it became apparent that there was increasing activity on the honeypot, with\n\nhigher levels of interactions from day to day. For our honeypot to garner this kind of attention, we practically\n\nhad to do everything wrong when it came to our faux company’s general security stance. However, for\n\nmany small businesses with no IT or security staff, such a situation is not uncommon.\n\nWe had VNC open and allowed no password for remote control. In the information security sector, this\n\nhas long been known as a very risky configuration. Exposing any port to the internet indeed increases the\n\nrisk of compromise.\n\nIn most cases, organizations should always follow the least-privilege mode. We implemented the exact\n\nopposite to lure attackers into our system. We used a common password throughout our network, but we\n\nactually saw only one potential attempt to do lateral movement. However, the longer we were exposed,\n\nthe more activity we saw — and the more sophisticated attacks appeared to be compared to standard\n\npenetration-testing techniques.\n\nWhile the router that we used did not support filtering to block certain items discovered during the course\n\nof our research, one feature we did not use was trust, which can be enabled on the router to allow only\n\nspecific hosts to and through the device. Most industrial routers also support point-to-point virtual private\n\nnetworks (VPNs) to limit the exposure of remote cellular ICSs.\n\nOur findings should serve as cautionary examples for organizations who run similar systems. We have\n\nextensively discussed the conceptualization and creation of our most realistic honeypot to date. And\n\nwe have illustrated the conscious decisions and actions we took to make our system unsecure and\n\nconsequently inviting for cybercriminals to target. We did all this only to a limited degree to keep our\n\nhoneypot believable. This means we created openings for attacks that could realistically be found in\n\nactual smart factories.\n\nTherefore, such attacks would not have been so successful had adequate security measures been in place\n\nto deter them in the first place. From this, organizations can take the cue to reevaluate their defenses.\n\nOrganizations should ensure that their equipment and the components of their ICSs are not exposed\n\nonline, as we purposely did with our various “misconfigurations.” Although we did not see any attack\n\ntaking advantage of how we used the same admin password for several workstations, organizations\n\nwould do well to not imitate the same practice and to keep strict authentication policies to minimize\n\nthe possibility of intrusions. Ultimately, weak security not only makes cyberattacks possible, but can\n\nalso serve as additional invitation for attacks on industrial systems that have long stoked the interest of\n\ncybercriminals.\n\n\n-----\n\n#### References\n\n1 Danielle Veluz. (1 October 2010). Trend Micro. “STUXNET Malware Targets SCADA Systems.” Last accessed on 6 January\n[2020 at https://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-attack/54/stuxnet-malware-targets-scada-systems.](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-attack/54/stuxnet-malware-targets-scada-systems)\n\n2 Trend Micro. (22 December 2017). Trend Micro. “TRITON Wielding Its Trident – New Malware Tampering with Industrial Safety\n[Systems.” Last accessed on 6 January 2020 at https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/triton-](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/triton-wielding-its-trident-new-malware-tampering-with-industrial-safety-systems/)\n[wielding-its-trident-new-malware-tampering-with-industrial-safety-systems/.](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/triton-wielding-its-trident-new-malware-tampering-with-industrial-safety-systems/)\n\n3 Andrew Krok. (21 June 2017). CNET. “WannaCry ransomware causes Honda plant shutdown in Japan.” Last accessed on 6\n[January 2020 at https://www.cnet.com/roadshow/news/wannacry-ransomware-causes-honda-plant-shutdown-in-japan/.](https://www.cnet.com/roadshow/news/wannacry-ransomware-causes-honda-plant-shutdown-in-japan/)\n\n4 Emery Dalesio. (9 August 2017). AP News. “Take down: Hackers looking to shut down factories for pay.” Last accessed on\n[6 January 2020 at https://apnews.com/e316bd63f21a4fd181b3fb4a8dd7a5ba/Take-down:-Hackers-looking-to-shut-down-](https://apnews.com/e316bd63f21a4fd181b3fb4a8dd7a5ba/Take-down:-Hackers-looking-to-shut-down-factories-for-pay)\n[factories-for-pay.](https://apnews.com/e316bd63f21a4fd181b3fb4a8dd7a5ba/Take-down:-Hackers-looking-to-shut-down-factories-for-pay)\n\n5 Kyle Wilhoit. (15 March 2013). Trend Micro Security Intelligence Blog. “Who Is Really Attacking Your ICS Devices?” Last\n[accessed on 6 January 2020 at https://blog.trendmicro.com/trendlabs-security-intelligence/whos-really-attacking-your-ics-](https://blog.trendmicro.com/trendlabs-security-intelligence/whos-really-attacking-your-ics-devices/)\n[devices/.](https://blog.trendmicro.com/trendlabs-security-intelligence/whos-really-attacking-your-ics-devices/)\n\n6 Kyle Wilhoit and Stephen Hilt. (5 August 2015). Trend Micro Security News. “The GasPot Experiment: Unexamined Perils in\n[Using Gas-Tank-Monitoring Systems.” Last accessed on 6 January 2020 at https://www.trendmicro.com/vinfo/us/security/](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-gaspot-experiment)\n[news/cybercrime-and-digital-threats/the-gaspot-experiment.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-gaspot-experiment)\n\n7 Federico Maggi, Davide Quarta, Marcello Pogliani, Mario Polino, Andrea M. Zanchettin, and Stefano Zanero Politecnico di\nMilano. (3 May 2017). Trend Micro Security News. “Rogue Robots Testing the Limits of an Industrial Robot’s Security.” Last\n[accessed on 6 January 2020 at https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/rogue-robots-testing-](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/rogue-robots-testing-industrial-robot-security)\n[industrial-robot-security.](https://www.trendmicro.com/vinfo/us/security/news/internet-of-things/rogue-robots-testing-industrial-robot-security)\n\n[8 Moloch. (n.d.). Moloch. “Moloch.” Last accessed on 8 January 2020 at https://molo.ch/.](https://molo.ch/)\n\n[9 Brendangregg. (n.d.). GitHub. “Chaosreader.” Last accessed on 6 January 2020 at https://github.com/brendangregg/](https://github.com/brendangregg/Chaosreader)\n[Chaosreader.](https://github.com/brendangregg/Chaosreader)\n\n[10 Jon Oberheide. (n.d.). Jon Oberheide. “VNC Keylogger.” Last accessed on 6 January 2020 at https://jon.oberheide.org/](https://jon.oberheide.org/vnclogger/)\n[vnclogger/.](https://jon.oberheide.org/vnclogger/)\n\n[11 Zeek. (n.d.). Zeek. “The Zeek Network Security Monitor.” Last accessed on 6 January 2020 at https://www.zeek.org/.](https://www.zeek.org/)\n\n[12 Intel Stack. (n.d.). Intel Stack. “Intel Stack.” Last accessed on 6 January 2020 at https://intelstack.com/.](https://intelstack.com/)\n\n[13 Suricata. (n.d.). Suricata. “Suricata.” Last accessed on 9 January 2020 at https://suricata-ids.org/.](https://suricata-ids.org/)\n\n[14 PyInstaller. (n.d.). PyInstaller. “PyInstaller.” Last accessed on 6 January 2020 at http://www.pyinstaller.org/.](http://www.pyinstaller.org/)\n\n[15 Aldeid. (n.d.). Aldeid. “Pyinstxtractor.” Last accessed on 6 January 2020 at https://www.aldeid.com/wiki/Pyinstxtractor.](https://www.aldeid.com/wiki/Pyinstxtractor)\n\n16 Python Package Index. (n.d.). Python Package Index. “uncompyle6 3.6.2.” Last accessed on 6 January 2020 at\n\n[https://pypi.org/project/uncompyle6/.](https://pypi.org/project/uncompyle6/)\n\n[17 Sweetsoftware. (8 December 2017). GitHub. “Ares.” Last accessed on 6 January 2020 at https://github.com/sweetsoftware/](https://github.com/sweetsoftware/Ares)\n[Ares.](https://github.com/sweetsoftware/Ares)\n\n18 Kaffeine. (31 January 2018). Proofpoint. “Smominru Monero mining botnet making millions for operators.” Last accessed on 6\n[January 2020 at https://www.proofpoint.com/us/threat-insight/post/smominru-monero-mining-botnet-making-millions-operators.](https://www.proofpoint.com/us/threat-insight/post/smominru-monero-mining-botnet-making-millions-operators)\n\n19 Wilbert Uy. (23 August 2019). Trend Micro Threat Encyclopedia. “Ransom.Win32.CRYSIS.SM.” Last accessed on 8 January\n[2020 at https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom.win32.crysis.sm.](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom.win32.crysis.sm)\n\n20 Jay Garcia. (14 January 2020). Trend Micro Threat Encyclopedia. “HackTool.Win32.NetTool.A.” Last accessed on 15 January\n[2020 at https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/HackTool.Win32.NetTool.A..](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/HackTool.Win32.NetTool.A.)\n\n21 Hybrid Analysis. (n.d.). Hybrid Analysis. “f47e3555461472f23ab4766e4d5b6f6fd260e335a6abc31b860e569a720a5446.” Last\n[accessed on 8 January 2020 at https://www.hybrid-analysis.com/sample/f47e3555461472f23ab4766e4d5b6f6f](https://www.hybrid-analysis.com/sample/f47e3555461472f23ab4766e4d5b6f6fd260e335a6abc31b860e569a720a5446?environmentId=100)\n[d260e335a6abc31b860e569a720a5446?environmentId=100](https://www.hybrid-analysis.com/sample/f47e3555461472f23ab4766e4d5b6f6fd260e335a6abc31b860e569a720a5446?environmentId=100)\n\n22 Maureen Reyes. (12 July 2019). Trend Micro Threat Encyclopedia. “Ransom.Win32.PHOBOS.SM.” Last accessed on 6 January\n[2020 at https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom.win32.phobos.sm.](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom.win32.phobos.sm)\n\n\n-----\n\n[23 Let’s Encrypt. (n.d.). Let’s Encrypt. “Let’s Encrypt.” Last accessed on 6 January 2020 at https://letsencrypt.org/.](https://letsencrypt.org/)\n\n24 SCADAStrangeLove. (7 November 2012). SCADA StrangeLove. “PLCScan the Internet.” Last accessed on 8 January 2020 at\n\n[http://www.scada.sl/2012/11/plcscan.html.](http://www.scada.sl/2012/11/plcscan.html)\n\n25 SCADAStrangeLove. (15 October 2018). SCADA StrangeLove. “s7scan to replace plcscan.” Last accessed on 8 January 2020\n[at http://www.scada.sl/2018/10/s7scan-to-replace-plcscan.html.](http://www.scada.sl/2018/10/s7scan-to-replace-plcscan.html)\n\n26 Talos Group. (28 March 2018). Cisco. “Vulnerability Spotlight: Multiple Vulnerabilities in Allen Bradley MicroLogix 1400\n[Series Devices.” Last accessed on 6 January 2020 at https://blogs.cisco.com/security/talos/vulnerability-spotlight-multiple-](https://blogs.cisco.com/security/talos/vulnerability-spotlight-multiple-vulnerabilities-in-allen-bradley-micrologix-1400-series-devices)\n[vulnerabilities-in-allen-bradley-micrologix-1400-series-devices.](https://blogs.cisco.com/security/talos/vulnerability-spotlight-multiple-vulnerabilities-in-allen-bradley-micrologix-1400-series-devices)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/white_papers/wp-caught-in-the-act-running-a-realistic-factory-honeypot-to-capture-real-threats.pdf"
    ],
    "report_names": [
        "wp-caught-in-the-act-running-a-realistic-factory-honeypot-to-capture-real-threats.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1579529354,
    "ts_modification_date": 1579529366,
    "files": {
        "pdf": "https://archive.orkl.eu/8ae82be2071ed361a3fda42519c130848e539702.pdf",
        "text": "https://archive.orkl.eu/8ae82be2071ed361a3fda42519c130848e539702.txt",
        "img": "https://archive.orkl.eu/8ae82be2071ed361a3fda42519c130848e539702.jpg"
    }
}