{
    "id": "d3076dd0-0505-4549-9407-26e6b7313afe",
    "created_at": "2023-01-12T15:10:00.080196Z",
    "updated_at": "2025-03-27T02:05:29.651121Z",
    "deleted_at": null,
    "sha1_hash": "62d682ac79231dd34ca027fe886282a7045380eb",
    "title": "2021-04-15 - The $1 billion Russian cyber company that the US says hacks for Moscow",
    "authors": "",
    "file_creation_date": "2022-05-28T17:07:08Z",
    "file_modification_date": "2022-05-28T17:07:08Z",
    "file_size": 1759335,
    "plain_text": "# The $1 billion Russian cyber company that the US says hacks for Moscow\n\n**[technologyreview.com/2021/04/15/1022895/us-sanctions-russia-positive-hacking/](https://www.technologyreview.com/2021/04/15/1022895/us-sanctions-russia-positive-hacking/)**\n\nPatrick Howell O'Neill\n\nBiden administration sanctions six Russian companies over cyber activities\nList includes well-known Moscow security firm Positive Technologies\nUS officials privately believe Positive provides hacking tools and support to Russian\nintelligence\n\nThe hackers at Positive Technologies are undeniably good at what they do. The Russian\ncybersecurity firm regularly publishes highly-regarded research, looks at cutting edge\ncomputer security flaws, and has spotted vulnerabilities in networking equipment, telephone\nsignals, and electric car technology.\n\nBut American intelligence agencies have concluded that this $1 billion company—which is\nheadquartered in Moscow, but has offices around the world— does much more than that.\n\n[Positive was one of a number of technology businesses sanctioned by the US on Thursday](https://home.treasury.gov/news/press-releases/jy0127)\n[for its role in supporting Russian intelligence agencies. President Joe Biden declared a](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/04/15/executive-order-on-blocking-property-with-respect-to-specified-harmful-foreign-activities-of-the-government-of-the-russian-federation/)\nnational emergency to deal with the threat he says Moscow poses to the United States. But\nthe details of the sanctions released by the Treasury Department only cover a small fraction\nof what the Americans now believe about Positive’s role in Russia.\n\n\n-----\n\nMIT Technology Review understands that US officials have privately concluded that the\ncompany is a major provider of offensive hacking tools, knowledge, and even operations to\nRussian spies. Positive is believed to be part of a constellation of private sector firms and\ncybercriminal groups that support Russia’s geopolitical goals, and which the US increasingly\nviews as a direct threat.\n\n## Related Story\n\n[How China’s attack on Microsoft escalated into a “reckless” hacking spree](https://www.technologyreview.com/2021/03/10/1020596/how-chinas-attack-on-microsoft-escalated-into-a-reckless-hacking-spree/)\n\nDays before Microsoft released a fix for a secret attack on its email systems, hackers\nramped up their activity. Now experts say swift action is required.\n\nThe public side of Positive is like many cybersecurity companies: staff look at high-tech\nsecurity, publish research on new threats, and even have cutesy office signs that read “stay\npositive!” hanging above their desks. The company is open about some of its links to the\nRussian government, and boasts an 18-year track record of defensive cybersecurity\nexpertise including a two-decade relationship with the Russian Ministry of Defense. But\naccording to previously unreported US intelligence assessments, it also develops and sells\nweaponized software exploits to the Russian government.\n\n\n-----\n\nOne area that s stood out is the firm s work on SS7, a technology that s critical to global\n[telephone networks. In a public demonstration for Forbes, Positive showed how it can](https://www.forbes.com/sites/thomasbrewster/2016/06/01/whatsapp-telegram-ss7-hacks/?sh=3e2c9546178b)\nbypass encryption by exploiting weaknesses in SS7. Privately, the US has concluded that\nPositive did not just discover and publicize flaws in the system, but also developed offensive\nhacking capabilities to exploit security holes that were then used by Russian intelligence in\ncyber campaigns.\n\nMuch of what Positive does for the Russian government’s hacking operations is similar to\nwhat American security contractors do for United States agencies. But there are major\ndifferences. One former American intelligence official, who requested anonymity because\nthey are not authorized to discuss classified material, described the relationship between\ncompanies like Positive and their Russian intelligence counterparts as “complex” and even\n“abusive.” The pay is relatively low, the demands are one-sided, the power dynamic is\nskewed, and the implicit threat for non-cooperation can loom large.\n\n### Tight working relationship\n\nAmerican intelligence agencies have long concluded that Positive also runs actual hacking\noperations itself, with a large team allowed to run its own cyber campaigns as long as they\nare in Russia’s national interest. Such practices are illegal in the western world: American\nprivate military contractors are under direct and daily management of the agency they’re\nworking for during cyber contracts.\n\nUS intelligence has concluded that Positive did not just discover and publicize flaws,\nbut also developed offensive hacking capabilities to exploit security holes that it found\n\nFormer US officials say there is a tight working relationship with the Russian intelligence\nagency FSB that includes exploit discovery, malware development, and even reverse\nengineering of cyber capabilities used by Western nations like the United States against\nRussia itself.\n\nThe company’s marquee annual event, Positive Hack Days, was described in recent US\nsanctions as “recruiting events for the FSB and GRU.” The event has long been famous for\n[being frequented by Russian agents.](https://www.thedailybeast.com/this-hacker-party-is-ground-zero-for-russias-cyberspies-3)\n\nNSA director of cybersecurity Rob Joyce said the companies being sanctioned \"provide a\nrange of services to the SVR, from providing the expertise to developing tools, supplying\n[infrastructure and even, sometimes, operationally supporting activities,” Politico reported.](https://twitter.com/martinmatishak/status/1382767040692432901)\n\n[One day after the sanctions announcement, Positive issued a statement denying “the](https://www.ptsecurity.com/ww-en/about/news/positive-technologies-official-statement-following-u-s-sanctions/)\ngroundless accusations” from the US. It pointed out that there is “no evidence” of wrongdoing\nand said it provides all vulnerabilities to software vendors “without exception.”\n\n### Tit for tat\n\n\n-----\n\nThursday s announcement is not the first time that Russian security companies have come\nunder scrutiny.\n\nThe biggest Russian cybersecurity company, Kaspersky, has been under fire for years over\nits relationships with the Russian government—eventually being banned from US\ngovernment networks. Kaspersky has always denied a special relationship with the Russian\ngovernment.\n\nBut one factor that sets Kaspersky apart from Positive, at least in the eyes of American\nintelligence officials, is that Kaspersky sells antivirus software to western companies and\ngovernments. There are few better intelligence collection tools than an antivirus, software\nwhich is purposely designed to see everything happening on a computer, and can even take\n[control of the machines it occupies. US officials believe Russian hackers have used](https://www.nytimes.com/2017/10/10/technology/kaspersky-lab-israel-russia-hacking.html)\nKaspersky software to spy on Americans, but Positive—a smaller company selling different\nproducts and services—has no equivalent.\n\nRecent sanctions are the latest step in a tit for tat between Moscow and Washington over\n[escalating cyber operations, including the Russian-sponsored SolarWinds attack against the](https://www.technologyreview.com/2021/03/02/1020166/solarwinds-brandon-wales-hack-recovery-18-months/)\nUS, which led to nine federal agencies being hacked over a long period of time. Earlier this\nyear, the acting head of the US cybersecurity agency said recovering from that attack could\ntake the US at least 18 months.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-15 - The $1 billion Russian cyber company that the US says hacks for Moscow.pdf"
    ],
    "report_names": [
        "2021-04-15 - The $1 billion Russian cyber company that the US says hacks for Moscow.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536200,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653757628,
    "ts_modification_date": 1653757628,
    "files": {
        "pdf": "https://archive.orkl.eu/62d682ac79231dd34ca027fe886282a7045380eb.pdf",
        "text": "https://archive.orkl.eu/62d682ac79231dd34ca027fe886282a7045380eb.txt",
        "img": "https://archive.orkl.eu/62d682ac79231dd34ca027fe886282a7045380eb.jpg"
    }
}