{
    "id": "d318ccbb-ea68-493d-a1bd-32bda66d0d61",
    "created_at": "2023-01-12T15:04:57.866946Z",
    "updated_at": "2025-03-27T02:06:08.021795Z",
    "deleted_at": null,
    "sha1_hash": "224c2c1a1b4b706919fd81fb3ae08051dbcea42a",
    "title": "2018-12-11 - New Satan ransomware variant ‘Lucky’ exposes 10 server-side vulnerabilities",
    "authors": "",
    "file_creation_date": "2022-05-27T21:56:44Z",
    "file_modification_date": "2022-05-27T21:56:44Z",
    "file_size": 898427,
    "plain_text": "# New Satan ransomware variant ‘Lucky’ exposes 10 server-side vulnerabilities\n\n**[cyware.com/news/new-satan-ransomware-variant-lucky-exposes-10-server-side-vulnerabilities-070afbd2](https://cyware.com/news/new-satan-ransomware-variant-lucky-exposes-10-server-side-vulnerabilities-070afbd2)**\n\nSatan ransomware resurfaces with a new variant named Lucky, exploiting multiple\napplication vulnerabilities that affect both Windows and Linux-based servers.\nAttackers are evolving towards server-side exploits.\n\nSince the first discovery of Satan ransomware back in early 2017, it has surfaced multiple\ntimes, exposing new vulnerabilities. It began with a unique model of Ransomware as a\nService (RaaS) which enabled any cybercriminal to create a customized version of the\nSatan Ransomware.\n\n[It resurfaced again in 2018 by adding EternalBlue and](https://bartblaze.blogspot.com/2018/04/satan-ransomware-adds-eternalblue.html) [Mimikatz exploits to its arsenal. In](https://blogs.quickheal.com/satan-ransomware-raises-head/)\nprevious versions, the ransomware targeted vulnerabilities that primarily affected the\nWindows operating system. However, in its latest iteration now, it has exploited 10 serverside vulnerabilities which affect both Linux and Windows systems.\n\n\n-----\n\nThis new variant of Satan ransomware, dubbed Lucky, was spotted by security vendor\n[NSFocus in November 2018. NSFocus reported that Lucky spreads itself by exploiting](https://blog.nsfocusglobal.com/categories/trend-analysis/satan-variant-analysis-handling-guide/)\nseveral application vulnerabilities affecting Windows services, Apache Tomcat, JBoss,\nWebLogic, Springs, and Apache Struts.\n\nLucky spreads primarily like a worm but does not perform any obviously malicious actions\non the infected machines, apart from encrypting the target files. Lucky was also found by\nSangfor Tech, which discovered the ransomware in one of its financial sector customer’s\n[Linux servers. Sangfor Tech found that the ransomware encrypts files and appends ‘.lucky’](https://www.sangfor.com/source/blog-network-security/1094.html)\nto the name of the encrypted files.\n\nDespite a decline in major ransomware activity in 2018, as compared to the WannaCry and\nNetPetya attacks seen last year, ransomware still remains a danger for the owners of online\nservices, with an increasing number of server-side exploits.\n\n### Evolution of Satan\n\nAs seen in the case of Satan and other ransomware threats, attackers have changed their\nstrategy from primarily targeting operating system vulnerabilities to targeting server-side\nvulnerabilities. This shift could have an even bigger impact.\n\nApostolos GIannakidis, from Waratek, [told Dark Reading that one of the reasons for this](https://www.darkreading.com/threat-intelligence/satan-ransomware-variant-exploits-10-server-side-flaws/d/d-id/1333448)\nshift in strategy could be the fact that patching servers and mitigating the effects of\nransomware attacks on servers is more time-consuming and can result in downtime for the\naffected online services.\n\n### Mitigations\n\nOne of the major reasons behind the exposure of servers is that many servers often use an\nolder version of applications or libraries, which remain vulnerable to previously discovered\nexploits. Therefore, it is essential for owners of any affected web servers to upgrade all the\napplications which are targeted by Lucky ransomware.\n\nFurthermore, Lucky also exploits vulnerabilities in Windows OS services, which means that\nthe owners also need to install the necessary patches to avoid an attack. The complete list\nof the patches and upgrades necessary for the remediation are provided by NSFocus in\ntheir [blog post.](https://blog.nsfocusglobal.com/categories/trend-analysis/satan-variant-analysis-handling-guide/)\n\nApart from these, it is important to always follow the industry best practices when\nmaintaining any online services. These include:\n\nChanging default admin account usernames and using complex passwords.\nUsing the latest security solutions to defend against future attacks.\nIsolation of critical network elements from the rest of the network to prevent the\nspread of ransomware.\n\n\n-----\n\nTraining employees for an effective threat response in case of any attacks.\nBacking up critical data periodically to avoid any data loss.\n\nNSA EternalBlue Exploit Ransomware Attacks Satana Ransomware Mimikatz\n\nPublisher\n\n## Cyware\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-11 - New Satan ransomware variant ‘Lucky’ exposes 10 server-side vulnerabilities.pdf"
    ],
    "report_names": [
        "2018-12-11 - New Satan ransomware variant ‘Lucky’ exposes 10 server-side vulnerabilities.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535897,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653688604,
    "ts_modification_date": 1653688604,
    "files": {
        "pdf": "https://archive.orkl.eu/224c2c1a1b4b706919fd81fb3ae08051dbcea42a.pdf",
        "text": "https://archive.orkl.eu/224c2c1a1b4b706919fd81fb3ae08051dbcea42a.txt",
        "img": "https://archive.orkl.eu/224c2c1a1b4b706919fd81fb3ae08051dbcea42a.jpg"
    }
}