{
    "id": "d3e9c1d3-ba27-4852-ace7-679b8f2ee38c",
    "created_at": "2023-01-12T15:05:21.987895Z",
    "updated_at": "2025-03-27T02:16:14.304298Z",
    "deleted_at": null,
    "sha1_hash": "71f7fafda3d1c08a8ca1d54c73c1ed956d302847",
    "title": "2022-05-19 - ITG23 Crypters Highlight Cooperation Between Cybercriminal Groups",
    "authors": "",
    "file_creation_date": "2022-05-25T20:29:35Z",
    "file_modification_date": "2022-05-25T20:29:35Z",
    "file_size": 1823796,
    "plain_text": "# ITG23 Crypters Highlight Cooperation Between Cybercriminal Groups\n\n**securityintelligence.com/posts/itg23-crypters-cooperation-between-cybercriminal-groups**\n\n[Malware May 19, 2022](https://securityintelligence.com/category/x-force/malware-threat/)\nBy [Charlotte Hammond co-authored by Ole Villadsen,](https://securityintelligence.com/author/charlotte-hammond/) [Golo Mühr 24 min read](https://securityintelligence.com/author/golo-muhr/)\n\n\nMay 19, 2022\n\n\n-----\n\nSecu ty o ce esea c e s ave co t ua y a a y ed t e use o seve a c ypte s deve oped by t e cybe c [a g oup](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/) G 3, a so\nknown as Wizard Spider, DEV-0193, or simply the “Trickbot Group”. The results of this research, along with evidence gained from the\n[disclosure of internal ITG23 chat logs (“Contileaks”), provide new insight into the connections and cooperation between prominent](https://www.breachquest.com/conti-leaks-insight-into-a-ransomware-unicorn/)\ncybercriminal groups whose attacks often lead to ransomware.\n\nCrypters are applications designed to encrypt and obfuscate malware to evade analysis by antivirus scanners and malware analysts. Crypters\ngenerally operate by encrypting the pre-compiled malware payload and embedding it within a secondary binary, known as a stub, which\ncontains code to decrypt and execute the malicious payload. The use of crypters allows malware developers to easily experiment with different\nmethods of evading antivirus detection without having to make changes to the malware itself.\n\nX-Force analyzed thirteen crypters that have all been used with malware built or operated by ITG23 internal teams or third-party distributors\n— including Trickbot, BazarLoader, Conti, and Colibri — as well as malware developed by other groups such as Emotet, IcedID, Qakbot, and\nMountLocker. The presence of one of these crypters on a file sample is a strong indication that its developer, distributer, or operator is either a\npart of ITG23 or has a partnership with the group.\n\nX-Force found evidence that ITG23 by mid-2021 scaled up their efforts to crypt malware with the development of several new crypters and the\nconstruction of a Jenkins build server to automate the crypting of malware at scale. X-Force also observed the analyzed crypters used\nrepeatedly by Emotet and IcedID malware samples, indicating ITG23 is also crypting malware for these groups. These findings add to a\ngrowing body of evidence indicating a close relationship between ITG23 and the threat actors behind the development and operation of IcedID\nand Emotet.\n\nAdditionally, X-Force uncovered that at least one ITG23 crypter has been used repeatedly since late February 2022 with the Qakbot banking\ntrojan and at least once with the Gozi banking trojan likely delivered by the ITG23 distribution affiliate TA551 (tracked by X-Force as\nHive0106). X-Force’s analysis of these crypters has also uncovered a previously undisclosed relationship between the IcedID group and\nMountLocker ransomware-as-a-service (RaaS) operation.\n\n## A Tangled Web They Weave\n\n### ITG23’s “Build Machine”\n\nITG23 is a cybercriminal gang known primarily for developing the Trickbot banking Trojan, which was first identified in 2016 and initially used\nto facilitate online banking fraud. The group since that time expanded its operations to develop and operate new malware such as BazarLoader\n[and Anchor. ITG23 also adapted to the ransomware economy by using its payloads to gain a foothold in victim environments for ransomware](https://securityintelligence.com/posts/new-malware-trickbot-anchordns-backdoor-upgrades-anchormail/)\nattacks and developing and operating the Conti and Diavol RaaS operations. ITG23 is best thought of as a group of groups, not unlike a large\ncorporation, who report to common “upper management” and share infrastructure and support functions, such as IT and human resources.\nOne of these support groups within ITG23 is dedicated to developing crypters for use with the group’s own malware operations as well as for\nseveral other groups.\n\nITG23 have been crypting their malware for several years, and crypters used by the group were regularly seen in use with malware such as\nTrickbot, Emotet, Cobalt Strike and Ryuk. However, the development of multiple new crypters during the past year suggests a focused effort to\nscale up their crypting operation.\n\nEvidence gained from several sources, including ContiLeaks, indicates that ITG23 has set up a Jenkins build server to automate the mass\ncrypting of malware, also referred to as the “Build Machine”. Jenkins is an open-source automation server designed to automate the building,\ntesting, and deploying of software. The “Build Machine” was created in April 2021, coinciding with an increase in the use of crypters with\nmalware developed by ITG23 and other groups.\n\nSince that time, ITG23 crypters have been applied to:\n\nMalware used to gain a foothold in victim environments, such as Trickbot, BazarLoader, Sliver, IcedID, Emotet, Qakbot, and Gozi. We\n[even identified ITG23 crypters with Colibri, a loader advertised on underground forums that was used to download Trickbot in fall of](https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/)\n2021, likely by an internal ITG23 distribution affiliate. Some of these malware families are built by ITG23, such as Trickbot and\nBazarLoader, and others are built by different groups, such as IcedID, Emotet, and Qakbot. ITG23 distribution affiliates have deployed\n[Sliver, an open source, cross-platform adversary simulation and red team platform, probably to gain access for ITG23 internal red teams](https://www.proofpoint.com/us/blog/security-briefs/ta551-uses-sliver-red-team-tool-new-activity)\nto conduct ransomware attacks.\n[Cobalt Strike beacon samples downloaded during attacks commencing with the above malware and used by internal red teams or other](https://www.cobaltstrike.com/features/)\naffiliates when performing ransomware attacks.\nRansomware such as Conti and MountLocker, also known as Xinglocker, AstroLocker, and Quantum, which are often deployed following\nan infection with the above tools and malware.\n\nITG23 has discontinued use of Trickbot and BazarLoader as of December 2021 and February 2022, respectively, but X-Force continues to\nobserve the crypters leveraged by other malware, including IcedID, Emotet, Conti, Qakbot, and the adversary simulation software Cobalt\nStrike. One notable exception is the Anchor malware which although attributed to ITG23 does not tend to use the same crypters as the other\nmalware mentioned throughout this report. The Anchor malware was commonly observed using a separate crypter, named ShellStarter, which\n\n\n-----\n\nas so e code ove ap w t c o tse a d was e y c eated by t e sa e deve ope . e S e Sta te c ypte was a so egu a y used w t\n[Cobalt Strike payloads, but otherwise did not seem to be used for general crypting operations. We are also currently analyzing Bumblebee](https://www.proofpoint.com/us/blog/threat-insight/bumblebee-is-still-transforming)\nmalware samples which we have also linked to ITG23 to determine if they are using an ITG23 crypter.\n\n### ContiLeaks\n\n[In February 2022, a Ukrainian security researcher using the Twitter handle “ContiLeaks” revealed a wealth of information about ITG23 and its](https://research.nccgroup.com/2022/03/31/conti-nuation-methods-and-techniques-observed-in-operations-post-the-leaks/)\noperations, including private conversations between its members. While these leaks appeared to concentrate on the Conti RaaS operation, they\nalso show that it was part of the larger ITG23 “corporation” which also includes ITG23’s crypting operation. These chats indicate that the head\nof this crypting operation uses the handle “Bentley”, who manages a team of developers responsible for both developing the crypters and\ncrypting malware for affiliates and partners. Bentley in turn regularly provides status reports to “Mango”, a more senior manager within ITG23\n[who reports to the group’s former leader “Stern.” Other security researchers have also identified Bentley and his role managing the crypting](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\nteam. Below is an example of a status update on malware crypting that Bentley would send on a regular basis to Mango.\n```\nDate: Aug 26, 2021 @ 11:08:21.000\nFrom: bentley@q3mcco35auwcstmt.onion\nTo: mango@q3mcco35auwcstmt.onion\nMessage:\nПроект лео - 13 криптов. Билд машина (Project leo - 13 crypts. Build Machine)\nБК (BK)\nгруппа 15: 20 криптов, билд машина (group 15: 20 crypts, build machine)\nгруппа 19: 5 крипта, билд машина (group 19: 5 crypts, build machine)\nгруппа 20: 1 крипто, билд машина (group 20: 1 crypt, build machine)\nТрик: (Trick)\n4 длл: 2 сэм 2 невил (4 dll: 2 sam 2 nevil)\nТройка: (Troika:)\nневил (nevil)\nШелкод: билд машина (Shellcode: Build Machine)\nКобальт: билд машина (Cobalt: Build Machine)\n\n```\nChat logs from the ContiLeaks also provide details about the creation of the build machine. On April 15, 2021, Mango informed Stern that the\nbuild machine for the crypters would be ready by the end of April 2021.\n```\nMango → Stern: билд машина для крипторов будет готова к концу месяца, вчера уже начали обкатывать ее но пока\nсыровата\n(The build machine for cryptors will be ready by the end of the month, yesterday they already started to run it in,\nbut it’s still raw)\n\n```\nOn June 7, 2021, Bentley provides an update to Stern on the status of the transition of work to the build machine.\n```\nBentley → Stern: Дела - хорошо. Интересно и насыщено.\nВсе крипторы перешли из ручного труда в автоматическуй сборку через билд машину.\nТеперь они занимаются актуализацией и чисткой стабов. А файлы я делаю на билд машине, проверяю и выдаю.\nЕсли что-то билдится грязным - обращаюсь к криптору. Он чистит стаб. Снова проверяем и выдаем.\nЗадачи:\n1. Криптование файлов для Лео на билд машине.\n2. Шелкод кобальт\n3. Локеры\n4. Коабальт ехе и длл\n5. dll трика\n6. Обучаю и предоставлюя доступ другим членам команды к билд машине, чтобы они могли сами собирать крипты.\n7. Подготовака линков для нагрузки и тестирование ехелей для netwalker, hash, cherry.\nEverything is OK. Interesting and rich.\nAll cryptors have moved from manual labor to automatic assembly through the build machine.\nNow they are engaged in updating and cleaning stubs. And I make files on the build machine, check and issue.\nIf something is being built dirty, I turn to cryptor. He cleans the stub. Check again and release.\nTasks:\n1. Crypting files for Leo on the build machine.\n2. Cobalt shellcode\n3. Lockers\n4. Cobalt exe and dll\n5. Trickbot dll\n6. Educate and give other team members access to the build machine so that they can collect the crypts themselves.\n7. Preparing links for loading and testing excels for netwalker, hash, cherry.\n\n```\nWithin the ContiLeaks, there are multiple references to the use of a Jenkins server for the Build Machine. In one such example, on January 17,\n2022, two ITG23 developers “derekson” and “elon” discuss the Jenkins server. X-Force also uncovered Program Database (PDB) file paths\nused by ITG23 crypters that reference Jenkins (see below for more details).\n\n```\nk l\n\n```\n\n-----\n\n```\n( j )\n\n```\nThroughout the leaked chats, there are multiple examples of Bentley delivering crypted malware samples to affiliates and partners such as\n[Cherry, Netwalker, and Zeus. X-Force assesses that “zevs” (“zeus”) is affiliated with the prominent distribution group Hive0106 (aka TA551),](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\nwhich used the gtags ‘zev,’ ‘zem’ and ‘zvs’ during their Trickbot campaigns. Hive0106 is a prominent distribution affiliate with an established\nrelationship with ITG23. Throughout the chats, “zeus” is alternatively translated as “зевса”, “зевсом”, “зевсу”, and “зевс” depending on the\ngrammatical case.\n\nFor example, on Aug 10, 2021, Bentley sends the following request to Hof, a developer associated with Trickbot malware:\n```\nBentley → Hof: Доброе утро. Сделай, пожалуйста, zev4.dll и zem1.dll для Зевса\n(Good morning. Please make zev4.dll and zem1.dll for Zeus)\n\n```\nThe following messages also indicate crypted samples were prepared for Zevs:\n```\nAugust 31, 2021:\nBentley → Zevs: Еще ответ: у нас есть опыт серийной выдачи криптов п БК* уже, один заказчик берет партиями по 30-100\nштук\n(Another answer: we have experience in the serial issuance of crypts and BK* already, one customer takes in batches\nof 30-100 pieces)\n\n```\n```\nSeptember 24, 2021:\nNeo → Zevs: монт молчит, я крипты готовил 3 штуки к 8 по мск\n(Mont is silent, I prepared 3 crypts by 8 Moscow time)\n\n```\n*We assess БК (BK) likely is a reference to BazarLoader based on analyzing multiple chat references to this acronym.\n\n### Emotet and IcedID: Longtime Pals\n\nThe use of ITG23 crypters with Emotet and IcedID malware is the latest evidence of a close relationship with these groups that has featured\ndistributing each other’s malware and cooperating on malware development. Emotet first appeared in 2014 as a banking trojan and later\nemerged as a prominent downloader for other banking trojans, including IcedID, Qakbot, and Trickbot. IcedID, also known as Bokbot and\n[often referred to by ITG23 as Anubis, is a banking trojan first discovered by X-Force in September 2017. Since that time IcedID — like many](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)\nbanking trojans — has evolved to include backdoor and data harvesting capabilities and is often used as a downloader for other malware,\n[including Cobalt Strike and ransomware.](https://thedfirreport.com/2021/07/19/icedid-and-cobalt-strike-vs-antivirus/)\n\n**Emotet: ITG23 and the Emotet group have a history of seeding each other’s malware. ITG23 has used Emotet extensively to deliver Trickbot**\n[malware often leading to the notorious Emotet -> Trickbot -> Ryuk ransomware attack sequence. Following actions to disrupt Trickbot group](https://www.cybereason.com/blog/research/triple-threat-emotet-deploys-trickbot-to-steal-data-spread-ryuk-ransomware)\noperations in fall 2020, [Emotet moved quickly to assist ITG23’s recovery by downloading Trickbot malware to infected machines. A year later,](https://intel471.com/blog/trickbot-online-emotet-microsoft-cyber-command-disruption-attempts/)\n[ITG23 returned the favor by seeding Emotet samples to facilitate Emotet’s return following the January 2021 international law enforcement](https://www.bleepingcomputer.com/news/security/emotet-malware-is-back-and-rebuilding-its-botnet-via-trickbot/)\noperation against the group.\n\nThe presence of “Veron” aka “Mors” participating in conversations with ITG23 members in the leaked chats also points to ITG23’s close\ncooperation with Emotet. Historically, “mors” was a gtag used with Trickbot samples delivered by Emotet. Based on the conversations,\n[Veron/Mors appears to be a liaison to ITG23 for Emotet related matters. Veron/Mors also seemed to work with the crypting team, and](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\nmessages can be found from Bentley which discuss crypting files for Veron. Bentley sent the following messages to Veron and Stern between\nFebruary and May 2021 possibly related to crypting Emotet samples for testing purposes before Emotet’s reappearance in November:\n```\nFebruary 24, 2021:\nStern → Bentley: veron запустился? (Veron started?)\nBentley → Stern: Он начинает в марте. Работаем над криптами для него. наших криптора\n(He starts in March. We're working over the crypters for him. Our crypters)\nMarch 1, 2021:\nStern → Bentley: veron не начал еще? (Veron hasn't started yet?)\nBentley → Stern: Првиет. Еще не начанал. Сделали годеый крипт его длл. Ждем как даст полную версию со всеми ньюансами\n(Hi. Not started yet. Made a suitable crypter for his dll. We're waiting for a full version with all the\nnuances.)\nMay 5, 2021\nBentley → Veron: Можешь дать длл на крипт? Пока можем начать криптовать и готовить стабы\n(Can you give a dll for the crypt? For now, we can start to crypt and prepare stubs)\n\n```\nMessages between Veron and Stern in May 2021 seem to suggest that the return of Emotet may have been delayed due a need to rewrite parts\nof the code for security purposes.\n```\nMay 18, 2021:\nStern → Veron: привет. когда стартуем?\n(Hi, when are we starting?)\n\n```\n\n-----\n\n```\n          р, у д, р у, д\n(Hello, I'll tell you exactly when, in the near future already, I'm doing it so that they don't get hacked)\nMay 24, 2021:\nVeron → Stern: привет, сорри, что задерживаем, но надо переписать часть, я за безопасность\nнапиши как будешь, если вопросы есть\n(hello, sorry for the delay, but we need to rewrite part, I'm for security\nlet me know if you have any questions)\n\n```\n**IcedID: The first evidence of ITG23’s cooperation with the IcedID group appeared in May 2018 when security researchers observed IcedID**\n[downloading Trickbot malware. Several months later other researchers noted Trickbot returning the gesture and downloading an updated](https://www.fortinet.com/blog/threat-research/icedid---trickbot--a-give-and-take-relationship)\nIcedID variant that incorporated features used with Trickbot samples, suggesting that the two groups also collaborated on development. In\n[early 2019, other analysts observed IcedID using a custom Trickbot shareDLL module to download core Trickbot malware. These researchers a](https://www.crowdstrike.com/blog/sin-ful-spiders-wizard-spider-and-lunar-spider-sharing-the-same-web/)\n[month later described a new Trickbot proxy module for man-in-the-middle (MITM) attacks against web browsers that was highly similar to the](https://www.crowdstrike.com/blog/wizard-spider-lunar-spider-shared-proxy-module/)\n[IcedID proxy module. A Trickbot module named anubisDll32 was also developed containing the IcedID core code. In November 2021, X-Force](https://securelist.com/trickbot-module-descriptions/104603/)\n[and other researchers observed multiple campaigns during which BazarLoader was used to download IcedID malware.](https://twitter.com/malware_traffic/status/1465853138657808521)\n\nITG23’s leaked chats provide additional insight into ITG23’s close relationship with IcedID, although the exact nature of this relationship\nremains unclear. On May 1, 2021, Stern congratulates “Leo” on his “cool bot IcedID” for gaining the attention of security researchers, revealing\nthat Leo is likely affiliated with the IcedID group.\n```\nStern → Leo: а твой крутой бот ICEDld\n(and your cool ICEDId bot)\nStern → Leo: про него пишут исследователи\n(researchers write about it)\nStern → Leo: что ты сейчас на первом месте\n(that you're in the first place)\n\n```\nThe leaked chats often refer to a “Project Leo”, which we assess is a reference to IcedID. Bentley regularly provides Mango with updates on\ncrypting related to “Project Leo” and in November 2021, Stern messaged the following instruction to Bentley:\n```\nStern → Bentley: \"включи крипты лео\n(turn on the crypts of Leo)\"\n\n### IcedID and MountLocker Ransomware\n\n```\n[X-Force uncovered evidence that ITG23 crypters were used with MountLocker (see below), a ransomware-as-a-service (RaaS) operation that](https://blogs.blackberry.com/en/2020/12/mountlocker-ransomware-as-a-service-offers-double-extortion-capabilities-to-affiliates)\n[has been active since July 2020. Since then, MountLocker has rebranded several times to other names including XingLocker, AstroLocker, and](https://www.trendmicro.com/en_us/research/21/j/ransomware-operators-found-using-new-franchise-business-model.html)\n[Quantum. This evidence — combined with code overlap between IcedID and MountLocker ransomware and the use of IcedID alongside](https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/)\nMountLocker during multiple ransomware attacks — suggests that the IcedID group operates the MountLocker RaaS.\n\nThe following conversation between Stern and Bentley on May 6, 2021, provides additional evidence that Leo, who operates IcedID, also has\nsome involvement with ransomware. Stern asks Bentley which ‘lockers’, aka ransomware, his team have been crypting, and Bentley responds\nthat they have had binaries from Reshaev and from Leo. Reshaev is a developer/manager for the Conti ransomware.\n```\nStern: как автобилды работают?\nBentley: Большая часть стабов уже работают. Выдаем локеры ехе 32 64 длл 32 64, кобу 32 64 как ехе так и длл. Шелкоды\nв ехе и длл. Простые длл, БК.\nStern: какие локеры\nBentley: от решаева в ехе и от лео в длл\nStern: How's the autobuild working?\nBentley: Most of the stubs are already working. We issue lockers exe 32 64 dll 32 64, cobalt 32 64 as exe and dll.\nShellcode in exe and dll. Simple Dll, BK.\nStern: Which lockers?\nBentley: From Reshaev in exe and from Leo in Dll\n\n```\nAnalysis of IcedID and MountLocker samples reveals areas of code overlap, particularly in the logging and decryption functions. Both IcedID\nand MountLocker generate extensive debug logs, which are formatted in an almost identical manner.\n\n\n-----\n\n_Figure 1 — Debug log strings from an IcedID sample_\n\n_Figure 2 — Debug log strings from a MountLocker sample_\n\nAdditionally, samples of both IcedID and MountLocker were identified which contained almost identical XOR decryption and key generation\nalgorithms.\n\n\n-----\n\n_Figure 3 — XOR algorithm and key generation function from an IcedID sample_\n\n_Figure 4 — XOR algorithm and key generation function from a MountLocker sample_\n\n### Qakbot: A New Partner?\n\nWhile monitoring for signs of ITG23 crypters’ use in the wild, X-Force identified the first known use in late February 2022 of an ITG23 crypter\n[with Qakbot aka Qbot. The Qakbot banking trojan was first identified in 2007 and like other banking trojan groups, it has increased its](https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/)\nfunctionality over the years and evolved into a flexible downloader and backdoor often leading to ransomware attacks. The appearance of\nITG23 crypters on Qakbot samples provides evidence of a direct relationship between ITG23 and the Qakbot group. The relationship between\n[ITG23 and Qakbot is also supported by additional evidence published recently. That said, the discovery does not come as a complete surprise.](https://www.prodaft.com/m/reports/WizardSpider_TLPWHITE_v.1.4.pdf)\nIn the leaked chats, “Tramp” asked Bentley on December 6, 2021, about crypting Qakbot:\n```\nTramp → Bentley: криптанем квак бота ?\n\n```\n```\n(crypt Quak Bot?)\n\n```\n```\nBentley → Tramp: давай попробуем\n\n```\n```\n(let's try)\n\n```\n\nTramp later sends Bentley a file named stager_1_tr.dll to be crypted. Tramp may be affiliated with “TR”, a prominent distribution affiliate also\nknown as TA577 and which is currently distributing Qakbot. We have since identified ITG23 crypters used with Qakbot samples delivered by\nthe two most prominent and current Qakbot distribution affiliates — TA570 and TA577 — suggesting that ITG23 is assisting the Qakbot group\nwith crypting its malware and not just a single distribution affiliate. There is also evidence that Qakbot has a relationship with the Emotet\n[group, dating back several years. Emotet has historically been used to download Qakbot in addition to Trickbot, for example during 2020 and](https://www.bleepingcomputer.com/news/security/emotet-botnet-is-now-heavily-spreading-qakbot-malware/)\n[then more recently in March 2022. Given ITG23’s partnership with Emotet, it is possible that the Emotet group is facilitating ITG23’s](https://twitter.com/Cryptolaemus1/status/1506647250927300611)\nrelationship with Qakbot leading to the latter’s use of an ITG23 crypter.\n\n### Hive0106 (TA551) Gozi Sample\n\n[X-Force researchers also found a Gozi sample using an ITG23 crypter on April 7, 2022 (see below). Gozi is also a banking trojan first appearing](https://research.checkpoint.com/2020/gozi-the-malware-with-a-thousand-faces/)\nin 2007 that has evolved into a multi-module, multi-purpose malware. However, unlike the other banking trojans discussed so far, the Gozi\nsource code has leaked and the malware is not operated or developed by a single group. The threat actor Hive0106 (aka TA551) was likely\n[responsible for this campaign delivering Gozi. We assess that Bentley and his team likely crypted this Gozi sample on behalf of this group, with](https://twitter.com/k3dg3/status/1512067808133214225)\nwhich they have an established relationship.\n\n\n-----\n\n## The Crypters\n\nCrypters are applications designed to encrypt and obfuscate malware to protect it from anti-virus scanners and malware analysts. The crypting\nprocess generally involves encrypting a pre-compiled malware payload, such as an EXE, DLL file, or shellcode, and embedding it within a\nsecondary binary, known as a ‘stub’, which contains code to decrypt and execute the malicious payload. The stubs generally take the form of\nbinaries, such as Exe or DLL files, are often either polymorphic or updated frequently in order to evade signature-based detection methods,\nand usually make use of code obfuscation techniques.\n\nWhen the crypted binary is executed, the stub code will extract the embedded payload, decrypt it, load it into memory and execute it. As a\nresult of this behavior, the crypted binary containing the stub code may also be referred to as a ‘loader’ or ‘in-memory dropper’.\n\nIn order to protect their payloads many crypters may also include additional functionality to detect sandbox environments, hinder AV\nscanners, escalate privileges, or perform other basic system checks. It’s common for crypters to utilize a high level of code obfuscation within\n[the stubs, and the majority also employ polymorphic techniques such as metaprogramming to ensure that each crypted binary is unique and](https://securityintelligence.com/posts/trickbot-gang-template-based-metaprogramming-bazar-malware/)\nthus make it harder to identify via signature-based detection methods.\n\nAnother common technique is for the crypter to disguise the malware as a benign executable, and to this end, they will often use source code\nfrom legitimate applications as a template for the stub binary, or include strings or functions which mimic benign activity. The code to decrypt\nand load the payload will be made as inconspicuous as possible in an effort to hide it from the attention of malware scanners.\n\nAll of these techniques together also provide obstacles for the malware reverse engineer and make it harder to write detection signatures and\nautomated malware parsers.\n\nX-Force research indicates that ITG23 is providing crypting services to other threat actors in addition to using them for their own malware.\nUsing the same crypter for multiple malware families has an additional benefit of confusing the identification capabilities of AV applications.\nIndeed, it is not uncommon to see a crypted malware binary flagged by AV as belonging to one malware family, when it is in fact a completely\ndifferent one, and they just happen to be using the same crypter.\n\nX-Force analysts are tracking at least thirteen crypters we believe to be developed and currently in use by ITG23 that we are calling Dave, Pear,\nLore, Mirror, Galore, Rustic, Tron, Hexa, Stub, Error, Skeleton, Charm, and Graven. Whilst variants of the Dave RC4 crypter have been in use\nfor at least a couple of years, the rest appear to have been primarily developed in the past year. ITG23 has used these crypters with Trickbot,\nBazarLoader and Conti malware — all of which are attributed to ITG23 — and used them to crypt malware on behalf of groups such as IcedID\nand Emotet. We have also observed these crypters used with Cobalt Strike samples, which we assess are used by ransomware internal red\nteams or affiliates when conducting attacks on clients infected with Trickbot, BazarLoader, IcedID or Emotet.\n\nIn the sections below, we provide an overview of each of the crypters and the examples of the malware families they have been used with.\n\n### Dave\n\nDave is one of the older crypters that X-Force tracks as currently in use by ITG23, having been used since at least 2020. Several variations of\nDave exist, but one of the most common variants stores the payload either as an RCData type resource or within the data section, and decrypts\nit using a custom RC4 algorithm, which uses a variable sbox size rather than the standard for RC4 which is 256 bytes. Dave is so-called as it\ncommonly wraps the payload in a second-stage shellcode loader, where the ascii string ‘dave’ is used to mark the end of the payload. Dave\nloaders have been most frequently observed loading Emotet and Trickbot, but also occasionally BazarLoader, Ryuk, Conti, IcedID, Cobalt\nStrike and Colibri.\n\nIt is common practice for malware developers to ‘strip’ malware binaries during compilation which removes symbol information such as\nvariable and function names. This has the benefits of making the malware more difficult to analyze, as well as removing details, which may\npotentially be used by analysts to fingerprint the developer.\n\nAlmost all samples analyzed by X-Force are fully stripped, however from November 2021 to January 2022 X-Force observed a number of\nunstripped Dave-crypted samples uploaded to repositories such as VirusTotal, providing a rare insight into the coding style of the developer.\nBased off some of the strings and function names X-Forced determined the developer utilized components of publicly available code for the\nstub, for example, the function CLoad::FromMemory() can be traced back to a 2016 code sample, memlib.cpp, originally published on a\n[forum. The aforementioned shellcode with the ‘dave’ signature also appears to be modified from the open source sRDI repository.](https://www.mpgh.net/forum/showthread.php?t=1101356)\n\n\n-----\n\n_Figure 5 — Unstripped Dave stub with original function and variable names as assigned by the developer._\n\nSelect samples using the Dave crypter:\n\n**Sample Family** **SHA256 Hash**\n\nCobalt Strike a9c4eafcff0567c68919c93ddf8baa769392e92706e6b35f7b989310d70f732f\n\nColibri f5fd02ebd2376fd1bc1ff121e9bfda618755a5c049edc8a4288eb67eb1cc7f9b\n\nEmotet 5da102cc1ff7d842e3b5c9d6f571bd3b3afdc1715d37f120b31e1859928f5837\n\nTrickbot 947c81aefdb479de7e75f14be2921bb829478680e039c2bc40a4c258524819b8\n\nBazarLoader 47bac27be954cf593ac731cd57fa98b565cf5036a6fbf35c508549f039eea8f3\n\nConti 5ace33358a8b11ae52050d02d2d6705f04bd47a27c6c6e28ef65028bbfaf5da9\n\nRyuk 180f82bbedb03dc29328e32e054069870a1e65078b78b2120a84c96aaed7d843\n\n### Pear\n\nPear crypter can be tracked back to at least March 2021, when it was used to crypt IcedID. Pear has been primarily observed in use with IcedID\npayloads, but samples loading BazarLoader, Trickbot, and Colibri payloads have also been found. Pear crypter stores the payload within one of\nthe stub binary’s data sections, and custom algorithms are used to encrypt the payload. The exact format and values of the encryption\nalgorithm change per sample, suggesting a technique such as metaprogramming may have been employed to generate the algorithms. The\nencrypted payload often has a recognizable alternating byte pattern that makes use of a restricted set of bytes in order to keep the entropy low.\nEntropy measures the level of randomness in the data, and many encryption algorithms will generate encrypted data with a distinctively high\nentropy value, which is easily detectable by binary analysis tools. By using an algorithm that outputs lower-entropy data, the encrypted payload\nis less easy to detect by automated systems.\n\n\n-----\n\n_Figure 6 — Pear crypted sample with distinctive encrypted payload utilizing a restricted byte set._\n\nSelect samples using the Pear crypter:\n\n**Sample Family** **SHA256 Hash**\n\nIcedID 9f4bdbfec9f091e985e153a1597fc271abd0320c60dfe37dc3e7d81e5d18ad83\n\nBazarLoader 26cac671e215d88b5070af7d94200588d2b7c414a6e8debf7370b993fcfffb23\n\nColibri b1fc2855f5579f02ac6d03c2d20e85948e9609fd769389addb8ce5986b1f8ecd\n\nTrickbot e2ba0567ac236a24bfd4df321ae7860e8fe2810dbd088e0e90d67167c1ccd4c5\n\n### Lore\n\nLore crypter has been in use since at least May 2021 and has been observed with payloads including Emotet, Trickbot, BazarLoader, IcedID\nand Cobalt Strike. This crypter stores the payload as a BITMAP type resource, with a 103-byte bitmap file header added to the start of the\npayload data. Upon execution, the stub code loads the resource, removes the bitmap header, and decrypts the remaining data using XOR and a\nhardcoded key. The payload is then loaded into memory and executed. The crypter originally appeared to be designed for use with PE payloads,\nand so shellcode-based payloads were wrapped in an additional second stage loader.\n\nLore crypted binaries often include a lot of extraneous imports and junk functions in an attempt to obscure the location of the payload\ndecryption and loading code from analysts. This loading code instead uses API hashes to retrieve handles to the API functions it requires, so\nthe extraneous imports can generally be ignored by the analyst.\n\nA handful of Lore crypted samples were identified containing the following PDB paths:\n```\n204506c69824371017f482e88f9fbb14cfd0fbc17233fa8d3ffbf4f527e20af5 \n c:\\jenkins\\workspace\\crypter5_generic_exe\\Bin\\x64\\Release\\MFC_Stub.pdb\nd1a12e52d9fcc57580146370933a3f9eb027c5fec972abc9ac2f2b7d9f94e0d3 \n c:\\jenkins\\workspace\\crypter5_shellcode_64_exe\\Bin\\x64\\Release\\MFC_Stub.pdb\n41c56e92efd01a553d0faf39ccb440c7e84d32531335c262572d6a01bf7f70c8 \n c:\\jenkins\\workspace\\crypter5_generic_exe\\Bin\\x86\\Release\\MFC_Stub.pdb\n615f9a5517e71648a0780c186af8642e2848589d6962bc12ff34c0c54b650df5 \n c:\\jenkins\\workspace\\crypter5_shellcode_64_exe\\Bin\\x64\\Release\\MFC_Stub.pdb\n\n```\nThese paths provide evidence of a Jenkins server being used for crypting operations and also suggest that it likely contains a number of\ndifferent crypters, with crypter5 being Lore Crypter. This is corroborated by the PDB path found within some Error crypted samples, detailed\nfurther below, which refer to it as ‘crypter7’.\n\nThe directory names ‘crypter5_generic_exe’ and ‘crypter5_shellcode_64_exe’ indicate that different configurations of the crypter stubs were\nlikely compiled for different types of payloads. In this case, the two samples containing the reference ‘crypter5_shellcode_64_exe’ are both 64bit executable files that contain Cobalt Strike shellcode http stagers as their payloads. For the two samples containing the reference\n\n\n-----\n\nc ypte 5_ge e c_e e, o e s a 64 b t e ecutab e co ta g a a a oade pay oad a d t e ot e s a 3 b t e ecutab e co ta g a Co t\nransomware executable.\n\nSelect samples using the Lore crypter:\n\n**Sample Family** **SHA256 Hash**\n\nCobalt Strike ee8efcd34db429697337d7275d713385600c510558a8a4615bd1eb18847f43f2\n\nConti e6e248be24782f28a492055ebb35886ad057d8a5ff4d7315f22af1fe29d9df0d\n\nIcedID 7a6c42343b3d422c9f6f5c72763645b8f1b4931c609c320e60816aee55e4ae8a\n\nEmotet 70b66e57ea54f48a8b288d65d93063478e27b5710cab106cf41464e086e784db\n\nTrickbot 2587e94f3bc1ae54ff7732984925def76de934b3e1b1f7407bd66491db18f7e0\n\nBazarLoader 8661bd7d893fe1dd2109fac55cf9cea5f609012769732039e20165a3198c1086\n\n### Mirror\n\nMirror crypter has been observed since November 2021, and so far has primarily been found loading BazarLoader payloads, as well as some\nIcedID and Cobalt Strike. Mirror crypter shares some code overlap and obfuscation mechanisms with Lore crypter, suggesting they may have\nthe same developer or codebase. Mirror splits its encrypted payload into three parts which are stored across different sections of the resulting\nbinary loader. Two main variants of the Mirror stub code have been found so far, one which decrypts the payload using AES-256 via the\nWindows CryptDecrypt API, and a second which decrypts the payload using XOR and a hardcoded key.\n\nSelect samples using the Mirror crypter:\n\n**Sample Family** **SHA256 Hash**\n\nBazarLoader (IDB Sample) cbd830c745bbec26733214798fe144c61ef4bac342c853f8a08b682077b2178b\n\nBazarLoader (XOR variant) b44d0261823595b303bdae62df7790b30c13a0a897978d30f3041c27a645eac6\n\nIcedID 00c46232cdad873bf02787746fba9d196a6045bac1051154af7772f5b0f29b87\n\nCobalt Strike 9eedbac3f1c8795cf1f04301ecf2d66aacacbbb9e6c087ed158f00f81fae7375\n\n### Galore\n\nWhilst the majority of ITG23’s current crypter stubs are coded in C/C++, it seems the developers also experimented with alternative languages,\nproducing crypters with loader stubs written in both the Go and Rust programming languages. Galore crypter uses the Go programming\nlanguage and has been observed in the wild since mid-2021 when it was frequently used to crypt BazarLoader payloads. The Go programming\nlanguage has become increasingly popular with malware authors over the past few years due to its convenient cross-platform support, and the\nfact that it produces large and complex binaries upon compilation which can be tricky to reverse engineer and often have lower detection rates\nagainst AV applications than their C/C++ coded counterparts.\n\nUpon execution the Galore stub code decrypts the payload using XOR, and loads and executes the PE payload using code based off the open[source Reflective DLL Injection project. The use of this Reflective Dll Injection code is common in many of ITG23’s crypters.](https://github.com/stephenfewer/ReflectiveDLLInjection)\n\nSelect samples using the Galore crypter:\n\n**Sample Family** **SHA256 Hash**\n\nBaazarloader 26be0ba3533703f5eeea8489e6a8881461dab7f597f33e546182ba1910953d09\n\n### Rustic\n\nRustic crypter uses the Rust programming language which, like Go, has been seeing an increase in popularity with malware developers. The\npayload is stored in the .rdata section of the loader and encrypted using a XOR based algorithm with two keys applied in multiple iterations.\nThe crypter supports both shellcode and PE payloads, with shellcode payloads loaded into memory and executed directly, and PE payloads\nloaded in a similar manner to Galore crypter, using the Reflective DLL Injection technique.\n\nRustic crypted samples were first observed in early September 2021 and it has been used with malware including BazarLoader, IcedID, Cobalt\n[Strike, Quantum, as well as implants from Sliver which is a post-exploitation framework written in Go.](https://github.com/BishopFox/sliver)\n\n\n-----\n\n_Figure 7 — Rustic stub loader code responsible for loading and decrypting the payload_\n\n_Figure 8 — Strings within a Rustic-crypted sample indicate that the binary was written using the Rust language_\n\nSelect samples using the Rustic crypter:\n\n**Sample Family** **SHA256 Hash**\n\nSliver 45aa8efb6b1a9a0e0091040bb99a7c37d346aaf306fa4e31e9d5d9f0fef56676\n\nCobalt Strike e75fce425df2e878c7938cdf86c8e4bde541c68f75d55edb62a670af52521740\n\nBazarLoader 8d84152b69161bf5abb2f80fef310ec92cc8b1cb23dff18eebd8d039cda8f8ad\n\nIcedID bec6dc7f7bfbded59d1a9290105e13ac91cf676ef5a4513bacbfcabf73630202\n\nQuantum fd7ca7af9b2b6c5ffdb3206d647301de8bea33a69679e117be30e9a601c5dea2\n\n### Tron\n\n\n-----\n\no c ypte st appea ed t e w d Septe be 0 w e t was used to c ypt c bot b a es assoc ated w t gtag ob 3 . S ce t e,\nit has been observed with payloads within Emotet, Trickbot, BazarLoader, IcedID, Conti and Cobalt Strike. Of note, Tron is the crypter\n[identified in this article from CERT-UA.](https://cert.gov.ua/article/39708)\n\nTron crypted binaries have their payload usually stored within the .text section of the stub loader which, upon execution, unpacks and\ndecompresses the payload, and then loads it into memory and executes it. The decompression of the payload is performed using the Zlib\nlibrary; however, the unpacking appears to be performed using code originating from an obscure Github project called Megatron\n[(https://github.com/akakist/megatron/), specifically a module called ioBuffer.cpp which implements basic buffer manipulation and unpacking](https://github.com/akakist/megatron/))\nfunctions. The Megatron project has since been taken down but previously strings from the source code in Github could be observed within the\nunpacking functions in the crypted binaries.\n\n_Figure 9 — The source code of ioBuffer.cpp as seen on Github_\n\nThe above image shows the source code of ioBuffer.cpp as seen on Github, specifically a function named inBuffer::get_8() is shown, which\ncontains the error string “inBuffer::get_8: noenough“. This same function and error string can be seen within the unpacking functions of\nthe crypted binary.\n\nThe payload data is split into chunks which are delimited with the bytes ‘c3 cc cc cc’, where the number of ‘cc’ bytes varies based on alignment.\nBytes used to calculate the size of each chunk are added at the start of each chunk. The unpacking code parses the payload data, calculating the\nsize of each chunk and appending the chunk data to the output buffer whilst checking for and discarding the 0xc3 and 0xcc padding bytes.\n\nThe compressed and decompressed sizes are then parsed from the start of the unpacked data, and the zlib.decompress function is used to\ndecompress the payload. One version of this crypter stores the payload in multiple parts, which are unpacked individually and then joined\ntogether before decompression.\n\nSeveral other variants of the Tron crypter have also been observed. One example contains the same ioBuffer unpacking functions, but the\npayloads are decrypted using XOR rather than decompressed using Zlib. Some variants also have the payload stored in the .data section, and\nothers may encode the payload in a numeric ascii format.\n\nSome samples were identified containing path strings for header files such as the following:\n\n\n-----\n\n```\n                    y\nZ:\\cr\\crypter4\\ballast\\3\\openjp2\\opj_intmath.h\n\n```\nConsidering the PDB strings identified within Lore and Error crypted samples, these path strings may indicate that Tron crypter is referred to\nas crypter4 within the group.\n\nSelect samples using the Tron crypter:\n\n**Sample Family** **SHA256 Hash**\n\nCobalt Strike 44e2057c7466881a61e3b542ce055b3d54aa7d88040ce879a915e20ed996d097\n\nConti 38784c635de9716c09a6f11f4d76f6402b5f6638f1614ed929c7de136bb5301a\n\nEmotet 8d8138c23bf514a984918f7b5c5a7501e91b2c058574b7ce0b9ccbe638e82387\n\nTrickbot fd083bc2dbc3426a332eaf861dea03c648ad04cb73ba8f09504c970af9134898\n\nBazarLoader b88382ef06808155253f631a06e31024436e19d5bffd34f9b03906295e82de52\n\nIcedID 2b9cba43290c9d4cc2d6a47432ddac5752c63e5ac519c2056ba466580424ed3b\n\n### Hexa\n\nHexa crypter compresses and RC4 encrypts its payload, and then encodes it as a hexadecimal ascii string to reduce entropy. This is then stored\nin the data sections of the stub binary, with some variants splitting the payload across two or three different sections. Upon execution the\npayload is reconstructed, decompressed and decrypted and then copied to a newly created memory section and execution transferred to the\npayload. Portable executable (PE) payloads may be preceded by a shellcode loader which is responsible for properly mapping the PE file into\nmemory and executing it.\n\nHexa makes use of code obfuscation techniques to hinder analysis efforts including splitting the code into many tiny blocks separated by\njumps, and the inclusion of blocks of junk data.\n\nHexa crypted samples were observed towards the end of 2021, with payloads including BazarLoader, Cobalt Strike, and Conti. It has also seen\nan increase in usage over the past couple of months where it has been used with malware families including IcedID, QakBot and Gozi.\n\nSelect samples using the Hexa crypter:\n\n**Sample Family** **SHA256 Hash**\n\nIcedID bbefa9f7747822e017580206931aec6e948e6cb3ca897b9615d87430b99e7d1e\n\nQakbot 0da8df441dc92d6719092aea1d3e9709e802aa87410279374d69626573fd3177\n\nBazarLoader 18bbaddacba7bcdda4a1a088a640e167271f44d6232c20aa7d88eceeb3028826\n\nCobalt Strike b51465ca7e71da2cd29072c819076c4efccb391dea353f16a36b0a60459b3358\n\nConti c77032c772e0ef0e3200edf38223f9c6047e56294e840ea79689b9e56048c69c\n\nGozi 41ae907a2bb73794bb2cff40b429e62305847a3e1a95f188b596f1cf925c4547\n\n### Stub\n\nStub crypter was first observed in November 2021. It has been used primarily in IcedID campaigns, but samples have also been identified with\npayloads such as BazarLoader, Cobalt Strike, Conti, and Quantum ransomware, which is a variant of MountLocker and thought to be\nassociated with the IcedID group.\n\nStub crypter stores the payload across multiple RCDATA type resources with sequential ids, e.g. 200, 201, 202. The first resource contains the\nencryption key, and the remaining resources each hold an encrypted section of the payload PE file.\n\nTo generate the encryption key, the malware takes the first resource, removes a 62-byte header, and then proceeds to generate each byte of the\nkey by combining the next three bytes from the resource data using bitwise shift and or operations. The final key length is usually 1024 bytes.\n\nThe malware then proceeds to decrypt the next resource using this key and a custom xor-based algorithm, which varies between samples. The\nfirst decrypted resource contains the PE header of the payload binary, and the loading code uses information from this header to map each of\nthe remaining PE sections into memory as it decrypts them from the resources. The loaded payload is then executed at its entry point.\n\nSelect samples using the Stub crypter:\n\n\n-----\n\n**Sample Family** **SHA256 Hash**\n\nBazarLoader 936426ce7210fbd0ce519fb4121289fc1c43247fa96a7d1cd96d276f1662df26\n\nQuantum faf49653a0f057ed09a75c4dfc01e4d8e6fef203d0102a5947a73db80be0db1d\n\nCobalt Strike 84f1e4c2524fea85c43f9df6ac1449c95d2d3ba5bd7cb6bff2f4e1c97dc8cbe1\n\nIcedID 008a674e33435ce0b892d0a68ac6d01f9606c040da87b21a10ed069729ee04ff\n\nConti 41896f40197a6160fcab046b5fc63a36d0805dbb1ca5a03af35b92b27d9a0eb5\n\n### Error\n\nError crypter was prominent from late November 2021 to January 2022 when it was used to crypt samples in Emotet, IcedID and BazarLoader\ncampaigns, as well as being used with Cobalt Strike payloads. Error crypted binaries contain a large amount of junk code and strings for\nobfuscation, with one variant seemingly designed to be disguised as a hospital administration tool. Some samples also contain strings, which\nappear to have been generated from literary texts such as ‘David Copperfield’.\n\n_Figure 10 — Error crypted sample containing strings relating to a hospital administration application_\n\nError crypter encrypts its payload using XOR and the encrypted payload is divided into small chunks which are scrambled up and stored. Upon\nexecution, the stub code uses a complicated series of functions to retrieve the data chunks and reconstruct the encrypted payload. The XOR key\nrequired for decryption is generated in a similarly convoluted manner, with data being decrypted and retrieved from various sources and\nconcatenated to form a string. This string is then hashed, and the hash is used to generate the final XOR key.\n\nAn example of one of the strings used to generate the XOR decryption key is as follows:\n```\n2021-12-03-mok.35022336.17:33:40===700524802745472.xKUzpAWUHQuKEHhnAwJ4MEDN4oDSNpNqXpt.2691200820897.302\n\n```\n\nError crypter also includes some anti-debugging functions within the stub code including checking for the presence of a debugger and checking\nthe system time year against a hard coded value.\n\nSome Error crypted samples were found to contain the following PDB string:\n```\nC:\\\\crypter7\\\\Bin\\\\x64\\\\Release\\\\Dll\\\\cryptERRDll.pdb\n\n```\n\nThis PDB string suggests that this crypter may have been known as ‘crypter7’ or ‘cryptERR’ internally within ITG23.\n\nSelect samples using the Error crypter:\n\n**Sample Family** **SHA256 Hash**\n\nEmotet a7343086d72f81f91cedc05d88b11cf44ba5da9ac6c25983870f3a77f854f4e9\n\nBazarLoader f17718d8f12cfada48a9288bf5f91e81787e361071f82345364c8e85b539524a\n\nCobalt Strike 1d20191aee650fd8c58c6564ce9ff5b86138a954bc49a3e25033cc888fc85466\n\nIcedID f9f62722ff249e8219d4864dc46a1bbb3871b1b3f9c4139ffe2726b8f6f27ad0\n\n\n-----\n\n### C a\n\nCharm crypter was observed primarily in campaigns between August 2021 and October 2021, and has been seen loading payloads such as\nBazarLoader, Cobalt Strike, Conti, and MountLocker. Charm crypter compresses its payload using an arithmetic coding algorithm, and then\nxor encrypts the compressed data and splits it into many small segments which are stored throughout the loader binary. Charm crypted\nbinaries are obfuscated using junk code to hinder analysis.\n\nSelect samples using the Charm crypter:\n\n**Sample Family** **SHA256 Hash**\n\nBazarLoader 8758196b4266ca7809e54c84ff6767784cb105fce247ad3459a15bb8ef9032c8\n\nCobalt Strike 6eccc2f0b5fb42a7b59881acdef621cc086d6ab76dfd80e5a3b3542590197805\n\nConti 63061a372c41f5797f18dfeed166ec350e4029c46ad3c42ff79b8e284eb65ad6\n\nQuantum 267f6ba1363b2dbf56ad7e324380782de682a59f7d647eaee7d92b1ba5d2fcfa\n\n### Graven\n\nGraven crypter splits the payload into three parts which are stored in different sections of the generated loader binary. Each part is then split\ninto small pseudo-randomly sized chunks, delimited with pseudo-randomly sized chunks of null bytes. The algorithm to determine both the\nsize of payload chunks and null-byte chunks is deterministic with a fixed seed allowing for the payload to be reconstructed by the loader. Upon\nexecution, the payload is rebuilt and decrypted using AES, then loaded into memory and executed. Some variants of Graven also include code\nto create a mutex with the name 7ce3e80173264ea19b05306b865eadf9.\n\nGraven crypted samples were primarily observed between November 2021 and February 2022, and payloads include BazarLoader, Emotet, and\nIcedID.\n\nSelect samples using the Graven crypter:\n\n**Sample Family** **SHA256 Hash**\n\nBazarLoader 4246dbf6daf37bac0e525bdd8122131bedf4e32f9542c4696fa525e1f71a6508\n\nEmotet 836d8e2f36ad80f937a377f568d78653e975e4b52db995ae18272dfecca9ac0f\n\nIcedID a61b1d70d469b8ca7acdbd26fc859e6aeb229c4636fe9c92eac856914f326ac8\n\n### Skeleton\n\nSkeleton is a fairly basic crypter, which stores the payload as a XOR encrypted, MessageTable type resource within the loader binary, often with\njust a hardcoded ascii string used as the XOR key. Upon execution, the payload resource is loaded, decrypted, and executed in memory.\nVariants have been found loading either shellcode or PE formatted payloads. PE payloads are mapped into memory, imports loaded, and then\nexecuted from their entrypoint. Skeleton crypted binaries have been observed loading Trickbot, Cobalt Strike and IcedID payloads between\nDecember 2021 and late March 2022.\n\nSelect samples using the Skeleton crypter:\n\n**Sample Family** **SHA256 Hash**\n\nTrickbot 01c69d0acc8734993ba9cbfe9b0da4616bb05041e103afdb487759995b93ee5c\n\nIcedID 617e0f57f4283ca044003326663b5614d66f97e16bccdd8bec1321fad44a7195\n\nCobalt Strike 3dea0bac5c9ae010b4abeb532a3a347cd55682512ffe287dbb310d5d434777ef\n\n## Recommendations\n\nEnsure anti-virus software and associated files are up to date.\nSearch for existing signs of the indicated IoCs in your environment.\nConsider blocking and or setting up detection for all URL and IP based IoCs.\nKeep applications and operating systems running at the current released patch level.\nDo not install unapproved apps on a device that has access to the corporate network.\nExercise caution with attachments and links in emails.\n\n## X-Force\n\n\n-----\n\nyou ave quest o s o wa t a deepe d scuss o o ow o ce ca e p you w t c de t espo se, t eat te ge ce, o o e s ve\nsecurity services schedule a follow up meeting here:\n\n[IBM X-Force Scheduler](https://www.ibm.com/security/services/incident-response-services?schedulerform)\n\nIf you are experiencing cybersecurity issues or an incident, contact X-Force to help.\n\nUS hotline 1-888-241-9812 Global hotline (+001) 312-212-8034\n\n[Charlotte Hammond](https://securityintelligence.com/author/charlotte-hammond/)\nMalware Reverse Engineer, IBM Security\n\nCharlotte is a malware reverse engineer for IBM Security's X-Force IRIS team. She has been working in the security industry for more than 7\nyears with a focu...\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-19 - ITG23 Crypters Highlight Cooperation Between Cybercriminal Groups.pdf"
    ],
    "report_names": [
        "2022-05-19 - ITG23 Crypters Highlight Cooperation Between Cybercriminal Groups.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "475ea823-9e47-4098-b235-0900bc1a5362",
            "created_at": "2022-10-25T16:07:24.506596Z",
            "updated_at": "2025-03-27T02:02:10.263346Z",
            "deleted_at": null,
            "main_name": "Lunar Spider",
            "aliases": [
                "Gold SwathMore"
            ],
            "source_name": "ETDA:Lunar Spider",
            "tools": [
                "BokBot",
                "IceID",
                "IcedID",
                "NeverQuest",
                "Vawtrak",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c2385aea-d30b-4dbc-844d-fef465cf3ea9",
            "created_at": "2023-01-06T13:46:38.916521Z",
            "updated_at": "2025-03-27T02:00:02.950071Z",
            "deleted_at": null,
            "main_name": "LUNAR SPIDER",
            "aliases": [
                "GOLD SWATHMORE"
            ],
            "source_name": "MISPGALAXY:LUNAR SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4f83fef-38ee-4228-9d27-dde8afece1cb",
            "created_at": "2023-02-15T02:01:49.569611Z",
            "updated_at": "2025-03-27T02:00:03.114739Z",
            "deleted_at": null,
            "main_name": "TA577",
            "aliases": [
                "Hive0118"
            ],
            "source_name": "MISPGALAXY:TA577",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "96d5b301-0872-444c-ba32-eecf7a9241c0",
            "created_at": "2023-02-15T02:01:49.560566Z",
            "updated_at": "2025-03-27T02:00:03.112349Z",
            "deleted_at": null,
            "main_name": "TA570",
            "aliases": [
                "DEV-0450"
            ],
            "source_name": "MISPGALAXY:TA570",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7cfe3bc9-7a6c-4ee1-a635-5ea7b947147f",
            "created_at": "2024-06-19T02:03:08.122318Z",
            "updated_at": "2025-03-27T02:05:17.398805Z",
            "deleted_at": null,
            "main_name": "GOLD SWATHMORE",
            "aliases": [
                "Lunar Spider "
            ],
            "source_name": "Secureworks:GOLD SWATHMORE",
            "tools": [
                " GlobeImposter",
                " Gozi",
                " Gozi Trojan",
                " IcedID",
                " Latrodectus",
                " TrickBot",
                " TrickBot",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "22d450bb-fc7a-42af-9430-08887f0abf9f",
            "created_at": "2024-11-01T02:00:52.560354Z",
            "updated_at": "2025-03-27T02:00:55.425961Z",
            "deleted_at": null,
            "main_name": "TA577",
            "aliases": [
                "TA577"
            ],
            "source_name": "MITRE:TA577",
            "tools": [
                "Pikabot",
                "QakBot",
                "Latrodectus"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535921,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1653510575,
    "ts_modification_date": 1653510575,
    "files": {
        "pdf": "https://archive.orkl.eu/71f7fafda3d1c08a8ca1d54c73c1ed956d302847.pdf",
        "text": "https://archive.orkl.eu/71f7fafda3d1c08a8ca1d54c73c1ed956d302847.txt",
        "img": "https://archive.orkl.eu/71f7fafda3d1c08a8ca1d54c73c1ed956d302847.jpg"
    }
}