{
    "id": "d4714e60-9988-4e28-928e-e391295c0281",
    "created_at": "2023-01-12T15:05:25.146588Z",
    "updated_at": "2025-03-27T02:16:25.503324Z",
    "deleted_at": null,
    "sha1_hash": "a58f3845744c5a5e79f675654ac9dcfbb31067b1",
    "title": "2017-01-24 - Charger Malware Calls and Raises the Risk on Google Play",
    "authors": "",
    "file_creation_date": "2022-05-28T17:40:46Z",
    "file_modification_date": "2022-05-28T17:40:46Z",
    "file_size": 208101,
    "plain_text": "# Charger Malware Calls and Raises the Risk on Google Play\n\n**blog.checkpoint.com/2017/01/24/charger-malware/**\n\nJanuary 24, 2017\n\nSeveral weeks ago, Check Point Mobile Threat Prevention detected and quarantined the\nAndroid device of an unsuspecting customer employee who downloaded and installed a\n[0day mobile ransomware from Google Play dubbed “Charger.” This incident demonstrates](https://www.checkpoint.com/cyber-hub/threat-prevention/what-is-ransomware/)\nhow malware can be a dangerous threat to your business, and how advanced behavioral\ndetection fills mobile security gaps attackers use to penetrate entire networks.\n\nCharger was found embedded in an app called EnergyRescue. The infected app steals\ncontacts and SMS messages from the user’s device and asks for admin permissions. If\ngranted, the ransomware locks the device and displays a message demanding payment:\n\n_You need to pay for us, otherwise we will sell portion of your personal information on black_\n_market every 30 minutes. WE GIVE 100% GUARANTEE THAT ALL FILES WILL_\n_RESTORE AFTER WE RECEIVE PAYMENT. WE WILL UNLOCK THE MOBILE DEVICE_\n_AND DELETE ALL YOUR DATA FROM OUR SERVER!_ _TURNING OFF YOUR PHONE IS_\n_MEANINGLESS, ALL YOUR DATA IS ALREADY STORED ON OUR SERVERS! WE STILL_\n_CAN SELLING IT FOR SPAM, FAKE, BANK CRIME etc… We collect and download all of_\n_your personal data. All information about your social networks, Bank accounts, Credit_\n_Cards. We collect all data about your friends and family._\n\nThe ransom demand for 0.2 Bitcoins (roughly $180) is a much higher ransom demand than\n[has been seen in mobile ransomware so far. By comparison, the DataLust ransomware](http://blog.checkpoint.com/2016/03/25/in-the-wild-mobile-security-observations-from-the-check-point-research-team-7/)\ndemanded merely $15. Payments are made to a specific Bitcoin account, but we haven’t\nidentified any payments so far.\n\n\n-----\n\nAdware commonly found on Play collects profits from ad networks, but mobile ransomware\n[inflicts direct harm to users. Like FakeDefender and DataLust, Charger could be an](http://blog.checkpoint.com/2016/03/25/in-the-wild-mobile-security-observations-from-the-check-point-research-team-7/)\nindicator of a wider effort by mobile malware developers to catch up with their PC\nransomware cousins.\n\nSimilar to other malware seen in the past, Charger checks the local settings of the device\nand does not run its malicious logic if the device is located in Ukraine, Russia, or Belarus.\nThis is likely done to keep the developers from being prosecuted in their own countries or\nbeing extradited between countries.\n\nMost malware found on Google Play contains only a dropper that later downloads the real\nmalicious components to the device. Charger, however, uses a heavy packing approach\nwhich it harder for the malware to stay hidden, so it must compensate with other means.\nThe developers of Charger gave it everything they had to boost its evasion capabilities and\nso it could stay hidden on Google Play for as long as possible.\n\nThe malware uses several advanced techniques to hide its real intentions and makes it\nharder to detect.\n\nIt encodes strings into binary arrays, making it hard to inspect them.\nIt loads code from encrypted resources dynamically, which most detection engines\ncannot penetrate and inspect. The dynamically-loaded code is also flooded with\nmeaningless commands that mask the actual commands passing through.\nIt checks whether it is being run in an emulator before it starts its malicious activity. PC\nmalware first introduced this technique which is becoming a trend in mobile malware\nhaving been adopted by several malware families including Dendroid.\n\n\n-----\n\n_Emulator and location conditions for the malware’s activity_\n\n[Check Point Mobile Threat Prevention customers are protected from Charger and similar](https://www.checkpoint.com/products/mobile-threat-prevention/)\nmalware.\n\n\n-----\n\nCheck Point s Analysis and Response Team (ART) disclosed the finding to Android s\nSecurity team who took the appropriate security steps to remove the infected app and\nadded the malware to Android’s built-in protection mechanisms.\n\nCharger SHA256 hash:\n58eb6c368e129b17559bdeacb3aed4d9a5d3596f774cf5ed3fdcf51775232ba0\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-24 - Charger Malware Calls and Raises the Risk on Google Play.pdf"
    ],
    "report_names": [
        "2017-01-24 - Charger Malware Calls and Raises the Risk on Google Play.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535925,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653759646,
    "ts_modification_date": 1653759646,
    "files": {
        "pdf": "https://archive.orkl.eu/a58f3845744c5a5e79f675654ac9dcfbb31067b1.pdf",
        "text": "https://archive.orkl.eu/a58f3845744c5a5e79f675654ac9dcfbb31067b1.txt",
        "img": "https://archive.orkl.eu/a58f3845744c5a5e79f675654ac9dcfbb31067b1.jpg"
    }
}