{
    "id": "d50470df-6e1a-4068-a4f8-6f5a16733240",
    "created_at": "2023-01-12T15:10:56.142501Z",
    "updated_at": "2025-03-27T02:05:57.087628Z",
    "deleted_at": null,
    "sha1_hash": "90618cf7057d39ed2977fdc026760af838c09e2c",
    "title": "2022-02-21 - Revamped CryptBot malware spread by pirated software sites",
    "authors": "",
    "file_creation_date": "2022-05-28T23:46:05Z",
    "file_modification_date": "2022-05-28T23:46:05Z",
    "file_size": 812272,
    "plain_text": "# Revamped CryptBot malware spread by pirated software sites\n\n**[bleepingcomputer.com/news/security/revamped-cryptbot-malware-spread-by-pirated-software-sites/](https://www.bleepingcomputer.com/news/security/revamped-cryptbot-malware-spread-by-pirated-software-sites/)**\n\nBill Toulas\n\nBy\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nFebruary 21, 2022\n12:40 PM\n0\n\nA new version of the CryptBot info stealer was seen in distribution via multiple websites that\noffer free downloads of cracks for games and pro-grade software.\n\nCryptBot is a Windows malware that steals information from infected devices, including\nsaved browser credentials, cookies, browser history, cryptocurrency wallets, credit cards,\nand files.\n\nThe latest version features new capabilities and optimizations, while the malware authors\nhave also deleted several older functions to make their tool leaner and more efficient.\n\nSecurity analysts at Ahn Lab reported that the threat actors are constantly refreshing their\nC2, dropper sites, and the malware itself, so CryptBot is currently one of the most shifting\nmalicious operations.\n\n\n-----\n\n## Using search results for delivery\n\nAccording to the Ahn Lab report, the CryptBot threat actors distribute malware through\nwebsites pretending to offer software cracks, key generators, or other utilities.\n\nTo gain wide visibility, the threat actors utilize search engine optimization to rank the\nmalware distribution sites at the top of Google search results, providing a stable stream of\nprospective victims.\n\nAccording to screenshots shared of the malware distribution sites, the threat actors use\nboth custom domains or websites hosted on Amazon AWS.\n\n**Some of the websites used recently for CryptoBot distribution**\n_Source: Ahn Lab_\nThe malicious websites are constantly being refreshed, so there’s a wide variety of evershifting lures to draw users onto the malware distribution sites.\n\nVisitors of these sites are taken through a series of redirections before they end up on the\ndelivery page, so the landing page could be on a compromised legitimate site abused for\nSEO poisoning attacks.\n\n[We have seen the same malware operators using fake VPN sites to deliver CryptBot to](https://www.bleepingcomputer.com/news/security/fake-vpn-site-pushes-cryptbot-and-vidar-info-stealing-trojans/)\nvictims in previous years, so search engine abuse isn't a new trick.\n\n## Features removed\n\nFresh samples of CryptBot indicate that its authors want to simplify its functionality and\nmake the malware lighter, leaner, and less likely to be detected.\n\nIn this context, the anti-sandbox routine has been removed, leaving only the anti-VM CPU\ncore count check in the newest version.\n\nAlso, the redundant second C2 connection and second exfiltration folder were both\nremoved, and the new variant only features a single info-stealing C2.\n\n\n-----\n\nThe code shows that when sending files, the method of manually adding the sent file data\nto the header was changed to the method that uses simple API. user-agent value when\n[sending was also modified,\" explains ASEC's report](https://asec.ahnlab.com/en/31802/)\n\n\"The previous version calls the function twice to send each to a different C2, but in the\nchanged version, one C2 URL is hard-coded in the function.\"\n\nAnother feature the CryptBot’s authors have scrapped is the screenshot function and the\noption of collecting data on TXT files on the desktop, which were too risky and perhaps\neasily detected during exfiltration.\n\n## Works on all Chrome versions\n\nOn the other hand, the latest version of CryptBot brings some targeted additions and\nimprovements that make it a lot more potent.\n\nIn [previous versions, the malware could only successfully exfiltrate data when deployed](https://www.bleepingcomputer.com/news/security/malicious-kmspico-installers-steal-your-cryptocurrency-wallets/)\nagainst Chrome versions between 81 and 95.\n\nThis limitation arose from implementing a system that looked for user data in fixed file\npaths, and if the paths were different, the malware returned an error.\n\n**Pathname discovery system comparison (new right) - ASEC**\nNow, it searches on all file paths, and if user data is found anywhere, it exfiltrates them\nregardless of the Chrome version.\n\nConsidering that Google rolled out chrome 96 in November 2021, CryptBot remained\nineffective against most of its targets for roughly three months, so fixing this problem was\nwell overdue for its operators.\n\nAs CryptBot primarily targets people searching for software cracks, warez, and other\nmethods of defeating copyright protection, simply avoiding the downloading of these tools\nwill prevent infection by this malware and many others.\n\n### Related Articles:\n\n[Fake Windows 10 updates infect you with Magniber ransomware](https://www.bleepingcomputer.com/news/security/fake-windows-10-updates-infect-you-with-magniber-ransomware/)\n\n[New ChromeLoader malware surge threatens browsers worldwide](https://www.bleepingcomputer.com/news/security/new-chromeloader-malware-surge-threatens-browsers-worldwide/)\n\n[New ERMAC 2.0 Android malware steals accounts, wallets from 467 apps](https://www.bleepingcomputer.com/news/security/new-ermac-20-android-malware-steals-accounts-wallets-from-467-apps/)\n\n[Popular Python and PHP libraries hijacked to steal AWS keys](https://www.bleepingcomputer.com/news/security/popular-python-and-php-libraries-hijacked-to-steal-aws-keys/)\n\n\n-----\n\n[PDF smuggles Microsoft Word doc to drop Snake Keylogger malware](https://www.bleepingcomputer.com/news/security/pdf-smuggles-microsoft-word-doc-to-drop-snake-keylogger-malware/)\n\n[Cracks](https://www.bleepingcomputer.com/tag/cracks/)\n[CryptBot](https://www.bleepingcomputer.com/tag/cryptbot/)\n[Malware](https://www.bleepingcomputer.com/tag/malware/)\n[Pirated Software](https://www.bleepingcomputer.com/tag/pirated-software/)\n[Search Engine](https://www.bleepingcomputer.com/tag/search-engine/)\n[Warez](https://www.bleepingcomputer.com/tag/warez/)\n\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nBill Toulas is a technology writer and infosec news reporter with over a decade of\nexperience working on various online publications. An open source advocate and Linux\nenthusiast, is currently finding pleasure in following hacks, malware campaigns, and data\nbreach incidents, as well as by exploring the intricate ways through which tech is swiftly\ntransforming our lives.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/cookware-giant-meyer-discloses-cyberattack-that-impacted-employees/)\n[Next Article](https://www.bleepingcomputer.com/news/security/expeditors-shuts-down-global-operations-after-likely-ransomware-attack/)\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-21 - Revamped CryptBot malware spread by pirated software sites.pdf"
    ],
    "report_names": [
        "2022-02-21 - Revamped CryptBot malware spread by pirated software sites.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536256,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1653781565,
    "ts_modification_date": 1653781565,
    "files": {
        "pdf": "https://archive.orkl.eu/90618cf7057d39ed2977fdc026760af838c09e2c.pdf",
        "text": "https://archive.orkl.eu/90618cf7057d39ed2977fdc026760af838c09e2c.txt",
        "img": "https://archive.orkl.eu/90618cf7057d39ed2977fdc026760af838c09e2c.jpg"
    }
}