{
    "id": "d537e88a-2248-437a-a9f9-33b67a033748",
    "created_at": "2023-01-12T15:06:27.901602Z",
    "updated_at": "2025-03-27T02:06:15.517748Z",
    "deleted_at": null,
    "sha1_hash": "124c71318154e2e4a0c7c389eb8c50f5c5e8ed31",
    "title": "2022-01-12 - TokyoX- DLL side-loading an unknown artifact (Part 2)",
    "authors": "",
    "file_creation_date": "2022-05-28T03:48:04Z",
    "file_modification_date": "2022-05-28T03:48:04Z",
    "file_size": 421110,
    "plain_text": "# TokyoX: DLL side-loading an unknown artifact (Part 2)\n\n**[lab52.io/blog/tokyox-dll-side-loading-an-unknown-artifact-part-2/](https://lab52.io/blog/tokyox-dll-side-loading-an-unknown-artifact-part-2/)**\n\n[As we mentioned in the previous post, we have performed an analysis of the threat which,](https://lab52.io/blog/tokyox-dll-side-loading-an-unknown-artifact/)\nlacking further information, we have not been able to identify it as a known threat. Thus, for\nthe moment, we will keep referring to it as TokyoX.\n\nThis threat can only be found in memory, since it is encrypted on disk and its loading is\nperformed as described in the previous post.\n\nAfter the whole loading process, the first thing the threat does is to check for the existence of\na mutex in the system with the name “aftdoslm” and if it finds it, it terminates its execution in\norder to avoid multiple instances of the threat running in parallel.\n\nIt then generates a 32-character string similar to a md5 hash from the computer’s file system\nand Volume information, which is used as the victim ID and placed at the beginning of every\npacket it sends to the command and control server:\n\n\n-----\n\nIt then obtains the user name, computer name, local IP and operating system version, with\nwhich it builds a string and generates a first packet for the C2:\n\nAt the time of the analysis the command and control server was not available. For that\nreason, some fields of the packets a priori not used by the threat, could not be identified.\nHowever, from the analysis of the threat assembly, it has been possible to observe that the\nresponse of the C2 is very similar to those sent by the threat, since it most likely contains the\nfirst 44 bytes of the threat request or a very similar content: the victim ID (in red), the first\nthree dwords (in green). After that part, it will have a fourth dword (in blue) that consists of a\ncommand code supported by the threat, after which, depending on the command, it may\ncontain one information or another (in yellow).\n\nThe command code in question goes in LittleEndian, so for the command 7010, the field\nshould contain “10 70 00 00”. Inside the threat code, a switch can be found that identifies 6\ndifferent commands:\n\n\n-----\n\nThe first one is “6010”, which can be seen in the screenshot along with the contents of the\nnetwork packet. This command is not among the options accepted by the threat, but it is the\none that the threat itself uses when it sends the first packet to the command and control\nserver, and we assume that it is the one used as a beacon when it does not intend to do\nanything, since a command that is not supported by the switch statement will simply cause a\n5-minute sleep and a new request to C2 after this time.\n\nSecond comes the “6011” command which is relatively interesting since it first calls a function\nthat will delete all the infection files and terminate the execution of the threat. The fact that\nmakes it interesting to us is that after this call, inside the switch that controls each command,\nit appears again as a command to perform no action (in this case it should be the 6010\nprobably) and make another request to C2, although this code will never be executed\nbecause the initial function will close the process.\n\nThe next command is “7010” which scans the disks installed in the computer using the\n“GetLogicalDriveStringsW” API and sends the results to the command and control server.\n\nThe command “7011” imitates the “Dir” command as it receives after the code a folder path,\nand allows it to list the content of a folder, showing hidden and system files too.\n\n\n-----\n\nThe next command “7017” expects, after the command code, a structure with three dwords\nfollowed by a path with a filename, and allows to upload a file from the attacking computer to\nthe victim machine. In order to do so, it first creates an empty file and then generates a new\nthread that will make a second request to the command and control server. Within the\nresponse from the C2, this request expects the contents of the file to be uploaded, which the\nrequesting thread will store in the file generated by the main thread.\n\nSimilarly, the command “7018” also expects after the command code a structure with three\ndwords, identical to the “7017” command, followed by a path with a filename. In this case, it\ngenerates a new thread that tries to read that file within the victim computer and makes a\nsecond request to the C2 containing the raw content, allowing the attacker to exfiltrate files\nfrom the infected computer.\n\nWith respect to the three dwords received before the file path, it has only been possible to\nidentify the third one for the moment, which consists of the total size of the file to be sent or\nreceived and is used before obtaining the file to reserve a buffer of that size, plus one in the\nHeap of the application in order to recover the content there before dumping it to disk or\nreading it from disk.\n\n\n-----\n\nFinally, there is the 8001 command with a command string to be run in a cmd.exe shell,\nsince it calls CreateProcessW for “cmd.exe” with the input and output redirected by\nanonymous pipes to the executable itself. Then, it executes the command received in the\nrequest and replies to the C2 with the output of that command, thus forming a remote Shell\nof the victim machine.\n\nAlthough we do not have enough evidence to make any kind of attribution, there are\nsome characteristic TTPs in the infection chain: the attacker using a Dll-sideload with a\nlegitimate binary and a library, the fact that the library is responsible for decrypting and\nexecuting a third encrypted file in memory, and the fact of removing the MZ characters from\nthe beginning of the binary and replacing them with another string. This last characteristic is\nvery common in APT groups that use PlugX as the main threat, where instead of using\n“tokyo” to replace MZ, they usually add “plug” at the beginning, which has motivated the\nname of the threat.\n\n[All of this explains the attribution of this hash to PlugX by some antivirus engines, although](https://www.virustotal.com/gui/file/382b3d3bb1be4f14dbc1e82a34946a52795288867ed86c6c43e4f981729be4fc/detection)\nas it has been observed in the post, it is a somewhat smaller threat, which is not developed\nin Delphi as plugx and that keeps a greater resemblance to HttpBrowser in terms of\ncapabilities. However, HttpBrowser does not share code or style of command codes with this\nsample, so it is most likely a different tool for the first infection stage.\n\naftdoslma Mutex\n\n\nC:\\Users\\Public\\Z46F4501-F44G-4DLS-AV8E-4E4DFDY918FGDL5F102TVSFG7\n\n\nPath\n\n\n382b3d3bb1be4f14dbc1e82a34946a52795288867ed86c6c43e4f981729be4fc Dll\n\n3493331e8f6151a37a48d11243e0fa32e756e8ca78a454912630865b48a43693 TokyoX\nciphered\n\n\n-----\n\n6370aa86e4bd2079913553bf34a5fe983b54d4907d168b278d6fe3caaf278d13 Zip File\n\n31.192.107[.]187:443 C2\n\nCustomers with Lab52’s APT intelligence private feed service already have more tools and\nmeans of detection for this campaign.\n\nIn case of having threat hunting service or being client of S2Grupo CERT, this intelligence\nhas already been applied.\n\nIf you need more information about Lab52’s private APT intelligence feed service, you can\n[contact us through the following link](https://lab52.io/contact)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-12 - TokyoX- DLL side-loading an unknown artifact (Part 2).pdf"
    ],
    "report_names": [
        "2022-01-12 - TokyoX- DLL side-loading an unknown artifact (Part 2).pdf"
    ],
    "threat_actors": [
        {
            "id": "452d2d74-e812-45d6-b0fe-b8a6cc4ebd01",
            "created_at": "2022-10-25T16:07:23.562676Z",
            "updated_at": "2025-03-27T02:02:09.865955Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "ETDA:Earth Berberoka",
            "tools": [
                "Agent.dhwf",
                "AngryRebel",
                "AsyncRAT",
                "CinaRAT",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Kaba",
                "Korplug",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "PuppetLoader",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav",
                "Yggdrasil",
                "oRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2664d6f5-f918-4978-87f8-f6afad7402c6",
            "created_at": "2023-01-06T13:46:39.393669Z",
            "updated_at": "2025-03-27T02:00:03.073942Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "MISPGALAXY:Earth Berberoka",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535987,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653709684,
    "ts_modification_date": 1653709684,
    "files": {
        "pdf": "https://archive.orkl.eu/124c71318154e2e4a0c7c389eb8c50f5c5e8ed31.pdf",
        "text": "https://archive.orkl.eu/124c71318154e2e4a0c7c389eb8c50f5c5e8ed31.txt",
        "img": "https://archive.orkl.eu/124c71318154e2e4a0c7c389eb8c50f5c5e8ed31.jpg"
    }
}