{
    "id": "d56fc660-7516-43dd-b077-834010dfab29",
    "created_at": "2023-01-12T15:11:00.671654Z",
    "updated_at": "2025-03-27T02:16:26.479838Z",
    "deleted_at": null,
    "sha1_hash": "fadbf222cfd424d9900152ab668d6f08893280a6",
    "title": "2017-03-07 - Vault 7- CIA Hacking Tools Revealed",
    "authors": "",
    "file_creation_date": "2022-05-29T01:29:43Z",
    "file_modification_date": "2022-05-29T01:29:43Z",
    "file_size": 316747,
    "plain_text": "# Vault7 - Home\n\n**wikileaks.org/ciav7p1/**\n\n## Vault 7: CIA Hacking Tools Revealed\n\nReleases\nDocuments\n\n**Contents**\n\n&bullet; Press Release\n\n&bullet; Analysis\n\n&bullet; Examples\n\n&bullet; Frequently Asked Questions\n\n## Press Release\n\nToday, Tuesday 7 March 2017, WikiLeaks begins its new series of leaks on the U.S. Central\nIntelligence Agency. Code-named \"Vault 7\" by WikiLeaks, it is the largest ever publication of\nconfidential documents on the agency.\n\n\n-----\n\nThe first full part of the series, Year Zero, comprises 8,761 documents and files from an\n[isolated, high-security network situated inside the CIA's Center for Cyber Intelligence in](https://wikileaks.org/ciav7p1/files/org-chart.png)\nLangley, Virgina. It follows an introductory disclosure last month of CIA targeting French\npolitical parties and candidates in the lead up to the 2012 presidential election.\n\nRecently, the CIA lost control of the majority of its hacking arsenal including malware,\nviruses, trojans, weaponized \"zero day\" exploits, malware remote control systems and\nassociated documentation. This extraordinary collection, which amounts to more than\nseveral hundred million lines of code, gives its possessor the entire hacking capacity of the\nCIA. The archive appears to have been circulated among former U.S. government hackers\nand contractors in an unauthorized manner, one of whom has provided WikiLeaks with\nportions of the archive.\n\n\"Year Zero\" introduces the scope and direction of the CIA's global covert hacking program,\nits malware arsenal and dozens of \"zero day\" weaponized exploits against a wide range of\nU.S. and European company products, include Apple's iPhone, Google's Android and\nMicrosoft's Windows and even Samsung TVs, which are turned into covert microphones.\n\nSince 2001 the CIA has gained political and budgetary preeminence over the U.S. National\nSecurity Agency (NSA). The CIA found itself building not just its now infamous drone fleet,\nbut a very different type of covert, globe-spanning force — its own substantial fleet of\nhackers. The agency's hacking division freed it from having to disclose its often controversial\noperations to the NSA (its primary bureaucratic rival) in order to draw on the NSA's hacking\ncapacities.\n\nBy the end of 2016, the CIA's hacking division, which formally falls under the agency's\n[Center for Cyber Intelligence (CCI), had over 5000 registered users and had produced more](https://wikileaks.org/ciav7p1/files/org-chart.png)\nthan a thousand hacking systems, trojans, viruses, and other \"weaponized\" malware. Such is\nthe scale of the CIA's undertaking that by 2016, its hackers had utilized more code than that\nused to run Facebook. The CIA had created, in effect, its \"own NSA\" with even less\naccountability and without publicly answering the question as to whether such a massive\nbudgetary spend on duplicating the capacities of a rival agency could be justified.\n\nIn a statement to WikiLeaks the source details policy questions that they say urgently need\nto be debated in public, including whether the CIA's hacking capabilities exceed its mandated\npowers and the problem of public oversight of the agency. The source wishes to initiate a\npublic debate about the security, creation, use, proliferation and democratic control of\ncyberweapons.\n\nOnce a single cyber 'weapon' is 'loose' it can spread around the world in seconds, to be used\nby rival states, cyber mafia and teenage hackers alike.\n\n\n-----\n\nJulian Assange, WikiLeaks editor stated that There is an extreme proliferation risk in the\ndevelopment of cyber 'weapons'. Comparisons can be drawn between the uncontrolled\nproliferation of such 'weapons', which results from the inability to contain them combined with\ntheir high market value, and the global arms trade. But the significance of \"Year Zero\" goes\nwell beyond the choice between cyberwar and cyberpeace. The disclosure is also\nexceptional from a political, legal and forensic perspective.\"\n\nWikileaks has carefully reviewed the \"Year Zero\" disclosure and published substantive CIA\ndocumentation while avoiding the distribution of 'armed' cyberweapons until a consensus\nemerges on the technical and political nature of the CIA's program and how such 'weapons'\nshould analyzed, disarmed and published.\n\nWikileaks has also decided to redact and anonymise some identifying information in \"Year\nZero\" for in depth analysis. These redactions include ten of thousands of CIA targets and\nattack machines throughout Latin America, Europe and the United States. While we are\naware of the imperfect results of any approach chosen, we remain committed to our\npublishing model and note that the quantity of published pages in \"Vault 7\" part one (“Year\nZero”) already eclipses the total number of pages published over the first three years of the\nEdward Snowden NSA leaks.\n\n## Analysis\n\n### CIA malware targets iPhone, Android, smart TVs\n\nCIA malware and hacking tools are built by EDG (Engineering Development Group), a\nsoftware development group within CCI (Center for Cyber Intelligence), a department\nbelonging to the CIA's DDI (Directorate for Digital Innovation). The DDI is one of the five\n[major directorates of the CIA (see this organizational chart of the CIA for more details).](https://wikileaks.org/ciav7p1/files/org-chart.png)\n\nThe EDG is responsible for the development, testing and operational support of all\nbackdoors, exploits, malicious payloads, trojans, viruses and any other kind of malware used\nby the CIA in its covert operations world-wide.\n\nThe increasing sophistication of surveillance techniques has drawn comparisons with\nGeorge Orwell's 1984, but \"Weeping Angel\", developed by the CIA's Embedded Devices\nBranch (EDB), which infests smart TVs, transforming them into covert microphones, is surely\nits most emblematic realization.\n\n[The attack against Samsung smart TVs was developed in cooperation with the United](https://wikileaks.org/ciav7p1/cms/page_12353643.html)\nKingdom's MI5/BTSS. After infestation, Weeping Angel places the target TV in a 'Fake-Off'\nmode, so that the owner falsely believes the TV is off when it is on. In 'Fake-Off' mode the TV\noperates as a bug, recording conversations in the room and sending them over the Internet\nto a covert CIA server.\n\n\n-----\n\nAs of October 2014 the CIA was also looking at infecting the vehicle control systems used by\nmodern cars and trucks. The purpose of such control is not specified, but it would permit the\nCIA to engage in nearly undetectable assassinations.\n\nThe CIA's Mobile Devices Branch (MDB) developed numerous attacks to remotely hack and\ncontrol popular smart phones. Infected phones can be instructed to send the CIA the user's\ngeolocation, audio and text communications as well as covertly activate the phone's camera\nand microphone.\n\nDespite iPhone's minority share (14.5%) of the global smart phone market in 2016, a\nspecialized unit in the CIA's Mobile Development Branch produces malware to infest, control\nand exfiltrate data from [iPhones and other Apple products running iOS, such as iPads. CIA's](https://wikileaks.org/ciav7p1/cms/space_2359301.html)\n[arsenal includes numerous local and remote \"zero days\" developed by CIA or obtained from](https://wikileaks.org/ciav7p1/cms/page_13205587.html)\nGCHQ, NSA, FBI or purchased from cyber arms contractors such as Baitshop. The\ndisproportionate focus on iOS may be explained by the popularity of the iPhone among\nsocial, political, diplomatic and business elites.\n\nA similar unit targets Google's Android which is used to run the majority of the world's smart\nphones (~85%) including Samsung, HTC and Sony. 1.15 billion Android powered phones\nwere sold last year. \"Year Zero\" shows that as of 2016 the CIA had 24 \"weaponized\" Android\n\"zero days\" which it has developed itself and obtained from GCHQ, NSA and cyber arms\ncontractors.\n\nThese techniques permit the CIA to bypass the encryption of WhatsApp, Signal, Telegram,\nWiebo, Confide and Cloackman by hacking the \"smart\" phones that they run on and\ncollecting audio and message traffic before encryption is applied.\n\n### CIA malware targets Windows, OSx, Linux, routers\n\n[The CIA also runs a very substantial effort to infect and control Microsoft Windows users with](https://wikileaks.org/ciav7p1/cms/page_11628612.html)\nits malware. This includes multiple local and remote weaponized \"zero days\", air gap\njumping viruses such as [\"Hammer Drill\" which infects software distributed on CD/DVDs,](https://wikileaks.org/ciav7p1/cms/page_17072172.html)\n[infectors for removable media such as USBs, systems to](https://wikileaks.org/ciav7p1/cms/page_13762636.html) [hide data in images or in covert](https://wikileaks.org/ciav7p1/cms/page_13763247.html)\n[disk areas ( \"Brutal Kangaroo\") and to](https://wikileaks.org/ciav7p1/cms/page_13763236.html) [keep its malware infestations going.](https://wikileaks.org/ciav7p1/cms/page_13763650.html)\n\nMany of these infection efforts are pulled together by the CIA's Automated Implant Branch\n(AIB), which has developed several attack systems for automated infestation and control of\nCIA malware, such as \"Assassin\" and \"Medusa\".\n\nAttacks against Internet infrastructure and webservers are developed by the CIA's Network\nDevices Branch (NDB).\n\nThe CIA has developed automated multi-platform malware attack and control systems\ncovering Windows, Mac OS X, Solaris, Linux and more, such as EDB's \"HIVE\" and the\nrelated \"Cutthroat\" and \"Swindle\" tools, which are described in the examples section below.\n\n\n-----\n\n### CIA hoarded vulnerabilities ( zero days )\n\nIn the wake of Edward Snowden's leaks about the NSA, the U.S. technology industry\nsecured a commitment from the Obama administration that the executive would disclose on\nan ongoing basis — rather than hoard — serious vulnerabilities, exploits, bugs or \"zero days\"\nto Apple, Google, Microsoft, and other US-based manufacturers.\n\nSerious vulnerabilities not disclosed to the manufacturers places huge swathes of the\npopulation and critical infrastructure at risk to foreign intelligence or cyber criminals who\nindependently discover or hear rumors of the vulnerability. If the CIA can discover such\nvulnerabilities so can others.\n\nThe U.S. government's commitment to the [Vulnerabilities Equities Process came after](https://is.gd/vepvep)\nsignificant lobbying by US technology companies, who risk losing their share of the global\nmarket over real and perceived hidden vulnerabilities. The government stated that it would\ndisclose all pervasive vulnerabilities discovered after 2010 on an ongoing basis.\n\n\"Year Zero\" documents show that the CIA breached the Obama administration's\ncommitments. Many of the vulnerabilities used in the CIA's cyber arsenal are pervasive and\nsome may already have been found by rival intelligence agencies or cyber criminals.\n\nAs an example, specific CIA malware revealed in \"Year Zero\" is able to penetrate, infest and\ncontrol both the Android phone and iPhone software that runs or has run presidential Twitter\naccounts. The CIA attacks this software by using undisclosed security vulnerabilities (\"zero\ndays\") possessed by the CIA but if the CIA can hack these phones then so can everyone\nelse who has obtained or discovered the vulnerability. As long as the CIA keeps these\nvulnerabilities concealed from Apple and Google (who make the phones) they will not be\nfixed, and the phones will remain hackable.\n\nThe same vulnerabilities exist for the population at large, including the U.S. Cabinet,\nCongress, top CEOs, system administrators, security officers and engineers. By hiding these\nsecurity flaws from manufacturers like Apple and Google the CIA ensures that it can hack\neveryone &mdsh; at the expense of leaving everyone hackable.\n\n### 'Cyberwar' programs are a serious proliferation risk\n\nCyber 'weapons' are not possible to keep under effective control.\n\nWhile nuclear proliferation has been restrained by the enormous costs and visible\ninfrastructure involved in assembling enough fissile material to produce a critical nuclear\nmass, cyber 'weapons', once developed, are very hard to retain.\n\nCyber 'weapons' are in fact just computer programs which can be pirated like any other.\nSince they are entirely comprised of information they can be copied quickly with no marginal\ncost.\n\n\n-----\n\nSecuring such weapons is particularly difficult since the same people who develop and use\nthem have the skills to exfiltrate copies without leaving traces — sometimes by using the\nvery same 'weapons' against the organizations that contain them. There are substantial price\nincentives for government hackers and consultants to obtain copies since there is a global\n\"vulnerability market\" that will pay hundreds of thousands to millions of dollars for copies of\nsuch 'weapons'. Similarly, contractors and companies who obtain such 'weapons' sometimes\nuse them for their own purposes, obtaining advantage over their competitors in selling\n'hacking' services.\n\nOver the last three years the United States intelligence sector, which consists of government\nagencies such as the CIA and NSA and their contractors, such as Booz Allan Hamilton, has\nbeen subject to unprecedented series of data exfiltrations by its own workers.\n\nA number of intelligence community members not yet publicly named have been arrested or\nsubject to federal criminal investigations in separate incidents.\n\nMost visibly, on February 8, 2017 a U.S. federal grand jury indicted Harold T. Martin III with\n20 counts of mishandling classified information. The Department of Justice alleged that it\nseized some 50,000 gigabytes of information from Harold T. Martin III that he had obtained\nfrom classified programs at NSA and CIA, including the source code for numerous hacking\ntools.\n\nOnce a single cyber 'weapon' is 'loose' it can spread around the world in seconds, to be used\nby peer states, cyber mafia and teenage hackers alike.\n\n### U.S. Consulate in Frankfurt is a covert CIA hacker base\n\nIn addition to its operations in Langley, Virginia the CIA also uses the U.S. consulate in\nFrankfurt as a covert base for its hackers covering Europe, the Middle East and Africa.\n\nCIA hackers operating out of the Frankfurt consulate ( [\"Center for Cyber Intelligence Europe\"](https://wikileaks.org/ciav7p1/cms/page_20251151.html)\nor CCIE) are given diplomatic (\"black\") passports and State Department cover. The\ninstructions for incoming CIA hackers make Germany's counter-intelligence efforts appear\ninconsequential: \"Breeze through German Customs because you have your cover-for-action\nstory down pat, and all they did was stamp your passport\"\n\n_Your Cover Story (for this trip)_\n\n**Q: Why are you here?**\n\n**A: Supporting technical consultations at the Consulate.**\n\n[Two earlier WikiLeaks publications give further detail on CIA approaches to customs and](https://wikileaks.org/cia-travel/)\n[secondary screening procedures.](https://wikileaks.org/cia-travel/)\n\n\n-----\n\nOnce in Frankfurt CIA hackers can travel without further border checks to the 25 European\ncountries that are part of the Shengen open border area — including France, Italy and\nSwitzerland.\n\nA number of the CIA's electronic attack methods are designed for physical proximity. These\nattack methods are able to penetrate high security networks that are disconnected from the\ninternet, such as police record database. In these cases, a CIA officer, agent or allied\nintelligence officer acting under instructions, physically infiltrates the targeted workplace. The\nattacker is provided with a USB containing malware developed for the CIA for this purpose,\nwhich is inserted into the targeted computer. The attacker then infects and exfiltrates data to\nremovable media. For example, the CIA attack system [Fine Dining, provides 24 decoy](https://wikileaks.org/ciav7p1/cms/page_20251107.html)\napplications for CIA spies to use. To witnesses, the spy appears to be running a program\nshowing videos (e.g VLC), presenting slides (Prezi), playing a computer game (Breakout2,\n2048) or even running a fake virus scanner (Kaspersky, McAfee, Sophos). But while the\ndecoy application is on the screen, the underlaying system is automatically infected and\nransacked.\n\n### How the CIA dramatically increased proliferation risks\n\nIn what is surely one of the most astounding intelligence own goals in living memory, the CIA\nstructured its classification regime such that for the most market valuable part of \"Vault 7\" —\nthe CIA's weaponized malware (implants + zero days), Listening Posts (LP), and Command\nand Control (C2) systems — the agency has little legal recourse.\n\nThe CIA made these systems unclassified.\n\nWhy the CIA chose to make its cyberarsenal unclassified reveals how concepts developed\nfor military use do not easily crossover to the 'battlefield' of cyber 'war'.\n\nTo attack its targets, the CIA usually requires that its implants communicate with their control\nprograms over the internet. If CIA implants, Command & Control and Listening Post software\nwere classified, then CIA officers could be prosecuted or dismissed for violating rules that\nprohibit placing classified information onto the Internet. Consequently the CIA has secretly\nmade most of its cyber spying/war code unclassified. The U.S. government is not able to\nassert copyright either, due to restrictions in the U.S. Constitution. This means that cyber\n'arms' manufactures and computer hackers can freely \"pirate\" these 'weapons' if they are\nobtained. The CIA has primarily had to rely on obfuscation to protect its malware secrets.\n\nConventional weapons such as missiles may be fired at the enemy (i.e into an unsecured\narea). Proximity to or impact with the target detonates the ordnance including its classified\nparts. Hence military personnel do not violate classification rules by firing ordnance with\nclassified parts. Ordnance will likely explode. If it does not, that is not the operator's intent.\n\n\n-----\n\nOver the last decade U.S. hacking operations have been increasingly dressed up in military\njargon to tap into Department of Defense funding streams. For instance, attempted \"malware\ninjections\" (commercial jargon) or \"implant drops\" (NSA jargon) are being called \"fires\" as if a\nweapon was being fired. However the analogy is questionable.\n\nUnlike bullets, bombs or missiles, most CIA malware is designed to live for days or even\nyears after it has reached its 'target'. CIA malware does not \"explode on impact\" but rather\npermanently infests its target. In order to infect target's device, copies of the malware must\nbe placed on the target's devices, giving physical possession of the malware to the target. To\nexfiltrate data back to the CIA or to await further instructions the malware must communicate\nwith CIA Command & Control (C2) systems placed on internet connected servers. But such\nservers are typically not approved to hold classified information, so CIA command and\ncontrol systems are also made unclassified.\n\nA successful 'attack' on a target's computer system is more like a series of complex stock\nmaneuvers in a hostile take-over bid or the careful planting of rumors in order to gain control\nover an organization's leadership rather than the firing of a weapons system. If there is a\nmilitary analogy to be made, the infestation of a target is perhaps akin to the execution of a\nwhole series of military maneuvers against the target's territory including observation,\ninfiltration, occupation and exploitation.\n\n### Evading forensics and anti-virus\n\nA series of standards lay out CIA malware infestation patterns which are likely to assist\nforensic crime scene investigators as well as Apple, Microsoft, Google, Samsung, Nokia,\nBlackberry, Siemens and anti-virus companies attribute and defend against attacks.\n\n[\"Tradecraft DO's and DON'Ts\" contains CIA rules on how its malware should be written to](https://wikileaks.org/ciav7p1/cms/page_14587109.html)\navoid fingerprints implicating the \"CIA, US government, or its witting partner companies\" in\n\"forensic review\". Similar secret standards cover the use of encryption to hide CIA hacker\nand malware communication (pdf), [describing targets & exfiltrated data (pdf) as well as](https://wikileaks.org/ciav7p1/cms/files/Codex-Spec-v1-SECRET.pdf)\n[executing payloads (pdf) and](https://wikileaks.org/ciav7p1/cms/files/ICE-Spec-v3-final-SECRET.pdf) [persisting (pdf) in the target's machines over time.](https://wikileaks.org/ciav7p1/cms/files/Persisted-DLL-Spec-v2-SECRET.pdf)\nCIA hackers developed successful attacks against most well known anti-virus programs.\n[These are documented in AV defeats,](https://wikileaks.org/ciav7p1/cms/page_2064514.html) [Personal Security Products,](https://wikileaks.org/ciav7p1/cms/page_13762910.html) Detecting and defeating\nPSPs and [PSP/Debugger/RE Avoidance. For example, Comodo was defeated by CIA](https://wikileaks.org/ciav7p1/cms/page_2621845.html)\nmalware placing itself in the Window's \"Recycle Bin\". While Comodo 6.x has a \"Gaping Hole\nof DOOM\".\n\nCIA hackers discussed what the NSA's \"Equation Group\" hackers did wrong and how the\nCIA's malware makers could avoid similar exposure.\n\n## Examples\n\n\n-----\n\nThe CIA s Engineering Development Group (EDG) management system contains around\n500 different projects (only some of which are documented by \"Year Zero\") each with their\nown sub-projects, malware and hacker tools.\n\nThe majority of these projects relate to tools that are used for penetration, infestation\n(\"implanting\"), control, and exfiltration.\n\nAnother branch of development focuses on the development and operation of Listening\nPosts (LP) and Command and Control (C2) systems used to communicate with and control\nCIA implants; special projects are used to target specific hardware from routers to smart\nTVs.\n\nSome example projects are described below, but see [the table of contents for the full list of](https://wikileaks.org/ciav7p1/cms/index.html)\nprojects described by WikiLeaks' \"Year Zero\".\n\n### UMBRAGE\n\nThe CIA's hand crafted hacking techniques pose a problem for the agency. Each technique it\nhas created forms a \"fingerprint\" that can be used by forensic investigators to attribute\nmultiple different attacks to the same entity.\n\nThis is analogous to finding the same distinctive knife wound on multiple separate murder\nvictims. The unique wounding style creates suspicion that a single murderer is responsible.\nAs soon one murder in the set is solved then the other murders also find likely attribution.\n\nThe CIA's [Remote Devices Branch's](https://wikileaks.org/ciav7p1/cms/space_753668.html) [UMBRAGE group collects and maintains a substantial](https://wikileaks.org/ciav7p1/cms/page_2621751.html)\nlibrary of attack techniques 'stolen' from malware produced in other states including the\nRussian Federation.\n\nWith UMBRAGE and related projects the CIA cannot only increase its total number of attack\ntypes but also misdirect attribution by leaving behind the \"fingerprints\" of the groups that the\nattack techniques were stolen from.\n\nUMBRAGE components cover keyloggers, password collection, webcam capture, data\ndestruction, persistence, privilege escalation, stealth, anti-virus (PSP) avoidance and survey\ntechniques.\n\n### Fine Dining\n\nFine Dining comes with a standardized questionnaire i.e menu that CIA case officers fill out.\n[The questionnaire is used by the agency's OSB (Operational Support Branch) to transform](https://wikileaks.org/ciav7p1/cms/space_1736706.html)\nthe requests of case officers into technical requirements for hacking attacks (typically\n\"exfiltrating\" information from computer systems) for specific operations. The questionnaire\n\n\n-----\n\nallows the OSB to identify how to adapt existing tools for the operation, and communicate\nthis to CIA malware configuration staff. The OSB functions as the interface between CIA\noperational staff and the relevant technical support staff.\n\nAmong the list of possible targets of the collection are 'Asset', 'Liason Asset', 'System\nAdministrator', 'Foreign Information Operations', 'Foreign Intelligence Agencies' and 'Foreign\nGovernment Entities'. Notably absent is any reference to extremists or transnational\ncriminals. The 'Case Officer' is also asked to specify the environment of the target like the\ntype of computer, operating system used, Internet connectivity and installed anti-virus utilities\n(PSPs) as well as a list of file types to be exfiltrated like Office documents, audio, video,\nimages or custom file types. The 'menu' also asks for information if recurring access to the\ntarget is possible and how long unobserved access to the computer can be maintained. This\ninformation is used by the CIA's 'JQJIMPROVISE' software (see below) to configure a set of\nCIA malware suited to the specific needs of an operation.\n\n### Improvise (JQJIMPROVISE)\n\n'Improvise' is a toolset for configuration, post-processing, payload setup and execution vector\nselection for survey/exfiltration tools supporting all major operating systems like Windows\n(Bartender), MacOS (JukeBox) and Linux (DanceFloor). Its configuration utilities like\nMargarita allows the NOC (Network Operation Center) to customize tools based on\nrequirements from 'Fine Dining' questionairies.\n\n### HIVE\n\nHIVE is a multi-platform CIA malware suite and its associated control software. The project\nprovides customizable implants for Windows, Solaris, MikroTik (used in internet routers) and\nLinux platforms and a Listening Post (LP)/Command and Control (C2) infrastructure to\ncommunicate with these implants.\n\nThe implants are configured to communicate via HTTPS with the webserver of a cover\ndomain; each operation utilizing these implants has a separate cover domain and the\ninfrastructure can handle any number of cover domains.\n\nEach cover domain resolves to an IP address that is located at a commercial VPS (Virtual\nPrivate Server) provider. The public-facing server forwards all incoming traffic via a VPN to a\n'Blot' server that handles actual connection requests from clients. It is setup for optional SSL\nclient authentication: if a client sends a valid client certificate (only implants can do that), the\nconnection is forwarded to the 'Honeycomb' toolserver that communicates with the implant; if\na valid certificate is missing (which is the case if someone tries to open the cover domain\nwebsite by accident), the traffic is forwarded to a cover server that delivers an unsuspicious\nlooking website.\n\n\n-----\n\nThe Honeycomb toolserver receives exfiltrated information from the implant; an operator can\nalso task the implant to execute jobs on the target computer, so the toolserver acts as a C2\n(command and control) server for the implant.\n\nSimilar functionality (though limited to Windows) is provided by the RickBobby project.\n\n[See the classified user and](https://wikileaks.org/ciav7p1/cms/files/UsersGuide.pdf) [developer guides for HIVE.](https://wikileaks.org/ciav7p1/cms/files/DevelopersGuide.pdf)\n\n## Frequently Asked Questions\n\n### Why now?\n\nWikiLeaks published as soon as its verification and analysis were ready.\n\nIn Febuary the Trump administration has issued an Executive Order calling for a \"Cyberwar\"\nreview to be prepared within 30 days.\n\nWhile the review increases the timeliness and relevance of the publication it did not play a\nrole in setting the publication date.\n\n### Redactions\n\nNames, email addresses and external IP addresses have been redacted in the released\npages (70,875 redactions in total) until further analysis is complete.\n\n1. Over-redaction: Some items may have been redacted that are not employees,\n\ncontractors, targets or otherwise related to the agency, but are, for example, authors of\ndocumentation for otherwise public projects that are used by the agency.\n2. Identity vs. person: the redacted names are replaced by user IDs (numbers) to allow\n\nreaders to assign multiple pages to a single author. Given the redaction process used a\nsingle person may be represented by more than one assigned identifier but no identifier\nrefers to more than one real person.\n3. Archive attachments (zip, tar.gz, ...) are replaced with a PDF listing all the file names\n\nin the archive. As the archive content is assessed it may be made available; until then\nthe archive is redacted.\n4. Attachments with other binary content are replaced by a hex dump of the content to\n\nprevent accidental invocation of binaries that may have been infected with weaponized\nCIA malware. As the content is assessed it may be made available; until then the\ncontent is redacted.\n5. The tens of thousands of routable IP addresses references (including more than 22\n\nthousand within the United States) that correspond to possible targets, CIA covert\nlistening post servers, intermediary and test systems, are redacted for further exclusive\ninvestigation.\n\n\n-----\n\n6. Binary files of non-public origin are only available as dumps to prevent accidental\n\ninvocation of CIA malware infected binaries.\n\n### Organizational Chart\n\nThe [organizational chart corresponds to the material published by WikiLeaks so far.](https://wikileaks.org/ciav7p1/files/org-chart.png)\n\nSince the organizational structure of the CIA below the level of Directorates is not public, the\nplacement of the EDG and its branches within the org chart of the agency is reconstructed\nfrom information contained in the documents released so far. It is intended to be used as a\nrough outline of the internal organization; please be aware that the reconstructed org chart is\nincomplete and that internal reorganizations occur frequently.\n\n### Wiki pages\n\n\"Year Zero\" contains 7818 web pages with 943 attachments from the internal development\ngroupware. The software used for this purpose is called Confluence, a proprietary software\nfrom Atlassian. Webpages in this system (like in Wikipedia) have a version history that can\nprovide interesting insights on how a document evolved over time; the 7818 documents\ninclude these page histories for 1136 latest versions.\n\nThe order of named pages within each level is determined by date (oldest first). Page\ncontent is not present if it was originally dynamically created by the Confluence software (as\nindicated on the re-constructed page).\n\n### What time period is covered?\n\nThe years 2013 to 2016. The sort order of the pages within each level is determined by date\n(oldest first).\n\nWikiLeaks has obtained the CIA's creation/last modification date for each page but these do\nnot yet appear for technical reasons. Usually the date can be discerned or approximated\nfrom the content and the page order. If it is critical to know the exact time/date contact\nWikiLeaks.\n\n### What is \"Vault 7\"\n\n\"Vault 7\" is a substantial collection of material about CIA activities obtained by WikiLeaks.\n\n### When was each part of \"Vault 7\" obtained?\n\nPart one was obtained recently and covers through 2016. Details on the other parts will be\navailable at the time of publication.\n\n### Is each part of \"Vault 7\" from a different source?\n\n\n-----\n\nDetails on the other parts will be available at the time of publication.\n\n### What is the total size of \"Vault 7\"?\n\nThe series is the largest intelligence publication in history.\n\n### How did WikiLeaks obtain each part of \"Vault 7\"?\n\nSources trust WikiLeaks to not reveal information that might help identify them.\n\n### Isn't WikiLeaks worried that the CIA will act against its staff to stop the series?\n\nNo. That would be certainly counter-productive.\n\n### Has WikiLeaks already 'mined' all the best stories?\n\nNo. WikiLeaks has intentionally not written up hundreds of impactful stories to encourage\nothers to find them and so create expertise in the area for subsequent parts in the series.\nThey're there. Look. Those who demonstrate journalistic excellence may be considered for\nearly access to future parts.\n\n### Won't other journalists find all the best stories before me?\n\nUnlikely. There are very considerably more stories than there are journalists or academics\nwho are in a position to write them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-07 - Vault 7- CIA Hacking Tools Revealed.pdf"
    ],
    "report_names": [
        "2017-03-07 - Vault 7- CIA Hacking Tools Revealed.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536260,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653787783,
    "ts_modification_date": 1653787783,
    "files": {
        "pdf": "https://archive.orkl.eu/fadbf222cfd424d9900152ab668d6f08893280a6.pdf",
        "text": "https://archive.orkl.eu/fadbf222cfd424d9900152ab668d6f08893280a6.txt",
        "img": "https://archive.orkl.eu/fadbf222cfd424d9900152ab668d6f08893280a6.jpg"
    }
}