{
    "id": "d5898c1a-dc6a-434e-ac24-eec3848dcfef",
    "created_at": "2023-01-12T15:02:02.212206Z",
    "updated_at": "2025-03-27T02:08:41.352388Z",
    "deleted_at": null,
    "sha1_hash": "601bec0f8610e1debf590e38b34dde5c3265d6d3",
    "title": "2021-05-10 - Rise of the Chief Intelligence Officer (CINO)",
    "authors": "",
    "file_creation_date": "2022-05-28T16:50:59Z",
    "file_modification_date": "2022-05-28T16:50:59Z",
    "file_size": 645390,
    "plain_text": "# Rise of the Chief Intelligence Officer (CINO)\n\n**[anomali.com/blog/rise-of-the-chief-intelligence-officer-cino](https://www.anomali.com/blog/rise-of-the-chief-intelligence-officer-cino)**\n\n_Anomali Sr. Director of Cyber Intelligence Strategy A.J. Nash recently penned a column for_\n_United States Cybersecurity Magazine about how changing security challenges call for new_\n_skillsets and leadership professionals, who can help to develop ad run new programs that_\n_keep pace with modern adversaries. In “Rise of the Chief Intelligence Officer (CINO),” A.J._\n_makes a case for why this position is needed and what such a leader’s skill set and_\n_experience should include. It is republished here in its entirety and with full permission._\n\nIn response to growing threats in cyberspace, private sector organizations began creating\nIntelligence programs nearly a decade ago, usually referred to as Cyber Threat Intelligence\n(CTI). In theory, the private sector was attempting to replicate what the government has\nsuccessfully done for generations: gain informational advantage to prevent enemy victories\nand mitigate damage from enemy successes. While most large enterprises today have\nsome sort of a CTI program, the majority are using the word “intelligence” without the\ntradecraft, standards, or processes to support the label. “Intelligence” in the private sector is\nstill primarily tactical and technical cybersecurity led by people with backgrounds to match.\nBest practices for collection, production, and dissemination of intelligence are rarely known\nby those charged with the responsibilities of an intelligence organization. Moreover, only a\nhandful of companies have integrated intelligence into enterprise-wide processes for\noptimization of outputs that meet documented organizational goals and objectives. Instead\nof being intelligence-driven security practices, much of the private sector remains\n\n\n-----\n\nunderinvested and underprepared. Worse yet, most organizations with CTI programs, even\neffective ones, restrict their own ability to capitalize on the time and money invested in CTI\nbecause their vision for Intelligence is limited to the Security Operations Center (SOC).\n\nThe root cause for these challenges is a fundamental misunderstanding of intelligence,\nborne out of ignorance for the differences between Cybersecurity and Intelligence as\nindependent career fields. Instead of being focused on Indicators Of Compromise (IOCs),\nsignatures, and response actions, Intelligence should be a means of countering threats,\ncybersecurity or otherwise, and driving enterprise-wide improvements in risk reduction.\n\nThe answer to this challenge is to capitalize on the lessons learned by the U.S. Government\n(USG) regarding Intelligence. Just as there is a Director of National Intelligence (DNI) who\nreports directly to the President and leads the U.S. Intelligence Community “in intelligence\nintegration, forging a community that delivers the most insightful intelligence possible,”[1]\nprivate sector enterprises each need a single Intelligence leader reporting directly to the\nCEO, President, or Board of Directors. Instead of the sole intelligence function of a\ncompany being a CTI team buried inside the SOC and focused on defensive cyber\noperations or the needs of the Chief Information Security Officer (CISO), establishment of\nthe Chief Intelligence Officer (CINO) will enable companies to maximize the value of their\ninvestments, eliminate redundancies, and reduce risk.\n\nIn the 1980’s, as C-suites expanded to include Chief Information Officers (CIO),and in the\n2010’s, to include Chief Security Officers (CSO) and Chief Human Resources Officers\n(CHRO), it is time to open a new seat at the table for the first Chief Intelligence Officer\n(CINO).\n\n## The Ideal CINO Candidate\n\nWhen adding a chair in the boardroom, it is important to assess what unique value the new\naddition will bring to the Executive Staff (E-Staff). The skills and experiences needed for the\nnewly minted CINO start with a deep knowledge of traditional intelligence standards and\npractices as well as impeccable integrity and judgement. This will be the senior expert on\nIntelligence and an influential voice informing the E-Staff and the Board; sometimes\ninfluencing trajectory-changing corporate decisions. Beyond that, a successful CINO will\nneed a strong understanding of cybersecurity standards and practices, as well as familiarity\nwith physical security concepts, a background in risk assessment and reduction, a mindset\nfor business priorities, a process-driven approach, emotional intelligence to build\nrelationships across business lines and partnerships, and a strategic outlook.\n\nWhile locating someone with all (or even most) of those skills will not be easy, the impact of\nthe role warrants finding or growing someone capable of demonstrating all these\ncharacteristics. The most qualified candidates will be Intelligence leaders in the private\nsector who transitioned from the government, as they will have Intelligence tradecraft\nexpertise and understand what drives private enterprise.\n\n\n-----\n\n## Relationship Between the CINO and Executive Counterparts\n\nA typical E-Staff consists of (see Figure 1) the Chief Executive Officer (CEO), Chief\nFinancial Officer (CFO) Chief Operations Officer (COO), Chief Information Officer (CIO),\nChief Customer Officer (CCO), Chief Marketing Officer (CMO), Chief Product Officer (CPO),\nChief Human Resources Officer (CHRO), and Chief Security Officer (CSO). Subordinate to\nthe CSO is usually the Chief Information Security Officer (CISO), although that role is\nsometimes merged with either the CSO or CIO roles.\n\n_Figure 1: Relationship between the CINO & Executive Counterparts_\n\nThe CINO, like the rest of the E-Staff, will be equal to all except the CEO to whom all others\nreport. If the CISO is subordinate to a CSO or CIO, it is the CSO or CIO who is the CINO’s\npeer; not the CISO. It is important to note that, as Intelligence is a service and not a\nproduct, the CINO will view their peers as customers; therefore, will only take direction from\nthe CEO. Other roles that may or may not exist include Chief Customer Officer (CCO),\nChief Risk Officer (CRIO), and Chief Legal Officer (CLO) for those with inside counsel.”\n\n## Role and Responsibilities of the CINO\n\nServing as the authority on Intelligence, the CINO will have five main responsibilities to the\nenterprise. They are as follows:\n\n\n-----\n\n**Establishment, Enforcement, and Socialization of Intelligence Standards and**\n**Tradecraft: The CINO will be responsible for establishing and enforcing analytic**\nstandards and tradecraft based on established best practices. These will include\nadopting Intelligence Community Directives (ICDs) 203,[2] 206,[3] and 208,[4]\nstructured analytic techniques,[5] the Traffic Light Protocol,[6] and the use of\nframeworks such as MITRE ATT&CK,[7] Cyber Kill Chain,[8] The Diamond Model of\nIntrusion Analysis,[9] National Institute of Standards and Technology (NIST)\nCybersecurity Framework,[10] and Factor Analysis of Information Risk (FAIR).[11]\nFurthermore, as Intelligence is only effective if the receiving parties understand the\nmessages delivered from the Intelligence team, the CINO will be responsible for\ntraining on the language of intelligence, including confidence language, caveats, and\nsource validation.\n**Creation and Maintenance of Intelligence Requirements: The CINO will be**\nresponsible for research and analysis of existing operations, processes, goals,\nobjectives, systems, and personnel for the purpose of authoring, validating, and\nmaintaining Enterprise Intelligence Requirements (EIR) that reflect the strategic needs\nof the business. Furthermore, the CINO will develop and maintain Subordinate\nIntelligence Requirements (SIR) for individual entities across the enterprise. Finally,\nthe CINO must map all SIRs to established EIRs to eliminate the tendency to expend\nenergy on wasteful efforts against interesting but valueless intelligence projects\n(known as “shiny objects”).\n\n\n-----\n\n**Delivery of a Unified Intelligence Picture: The CINO will be responsible for the**\nentire Intelligence Cycle, (Figure 2) with the output being the delivery of Intelligence\nthat creates informational advantages, drives proactive organizational changes, and\nreduces risk across physical security (including facilities, personnel, and executive\nprotection), cybersecurity (offensive and defensive), insider threat, Governance, Risk\nand Compliance (GRC), Mergers and Acquisitions (M&A),brand protection, and crisis\ncommunications. Beyond delivering intelligence to each of these customer\norganizations, the CINO will be in the unique position to synthesize intelligence\nresponding to EIRs and SIRs. What’s more, the CINO will be making connections that\ntoday’s enterprises are unable to see due to duplication of efforts, stove piping,\nparochialism, political rivalries, and individuals who prioritize personal career\nobjectives over the needs of the enterprise.\n\n_Figure 2: Intelligence Process_\n\n\n-----\n\n**Proactive Intelligence: The CINO will be responsible for delivering assessments and**\nestimates regarding threats and risks, including probabilities and recommended\ncourses of action for proactive or reactive responses, to executive leaders and peers.\nThis intelligence can include both actionable intelligence (meant to inform or drive\nimmediate or near-term decisions) and informational intelligence (meant to educate on\npatterns, trends, or understanding needed to grow an overall body of knowledge that\ncan serve as the foundation for later actionable intelligence production).\n**Response Intelligence: The CINO will be responsible for supporting ad-hoc**\noperations within any supported function, to include, but not limited to, physical or\ncybersecurity incident response, and insider threat investigation. The intelligence\nproduced in response to these security operations should seek to improve\nunderstanding of the threats, risks, and recommended courses of action for\nminimizing loss and protecting business interests.\n\n## Benefits of a Top-Down Approach to Intelligence\n\nElevating Intelligence and establishing an independent CINO who will report directly to the\nCEO will yield some clear benefits over today’s more common model of CTI buried inside a\nSOC. First, Intelligence will no longer be disproportionately influenced by the needs of one\norganization at the expense of other organizations. Serving under the CEO will empower\nthe CINO to objectively assess EIRs and SIRs; therefore, recommending prioritization\nbased on the strategic vision of the CEO without subordinate organizations or leaders\nforcing Intelligence to prioritize their needs over all others. This ensures that an enterprise\nwill capitalize on the significant investment in talent, access, and technologies needed to\ncreate an effective Intelligence program. Second, with Intelligence elevated and unified, the\nCINO will be able to reduce redundancies in expenditures and effort that often plague large\nenterprises today. For instance, many enterprises currently have multiple teams paying for\nthe same or similar intelligence from vendors. This is often caused by one of the following\nfactors:\n\nInefficient or bypassed procurement processes\nIgnorance among teams of the roles and responsibilities of their counterparts\nManagers prioritizing personal objectives over the needs of the enterprise\n\nThird, with Intelligence unified under the CINO, the enterprise will benefit from having a\nsingle authoritative source. In time-critical situations, including security, cybersecurity, and\nbusiness crises, competing opinions of varying validity based on inconsistent information\nand judgement criteria lead to poorly informed decisions that can be catastrophic. The\nCINO will act as a unifying agent across all available sources, serving as trusted and\nreliable counsel to the CEO and E-Staff at the most critical times.\n\n## Visualizing the Future of Intelligence in Private Industry\n\n\n-----\n\n_Figure 3_\n\n_Figure 4_\n\nHaving established the role, responsibilities, and benefits of expanding the E-Staff to\ninclude the CINO, the remaining question is who will report to the CINO and how that will\nchange existing organizations. This is likely the easiest adjustment to make, as most\norganizations are mature enough to move to the CINO concept, and already have\nestablished effective CTI programs. Transitioning from CTI within a SOC to Intelligence\nunder a CINO is just a matter of elevating the current team and expanding their mandate to\nmatch the program described previously. Figure 3 and 4 (see above) offers a visualization\nof these current and future states of Intelligence.\n\n## References\n\n[1] https://www.dni.gov/index.php/who-we-are/mission-vision\n\n\n-----\n\n[ ] https://fas.org/irp/dni/icd/icd-203.pdf\n\n[3] https://fas.org/irp/dni/icd/icd-206.pdf\n\n\n\n[4] https://fas.org/irp/dni/icd/icd-208.pdf\n\n[5] https://www.cia.gov/static/955180a45afe3f5013772c313b16face/Tradecraft-Primer\napr09.pdf\n\n\n\n[6] https://www.first.org/tlp/\n\n[7] https://attack.mitre.org/\n\n\n\n[8] https://www.lockheedmartin.com/enus/capabilities/cyber/cyber-kill-chain.html\n\n[9] https://www.activeresponse.org/wpcontent/uploads/2013/07/diamond.pdf\n\n\n\n[10] https://www.nist.gov/cyberframework\n\n[11] https://www.fairinstitute.org/fair-risk-management\n\nTopics:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-10 - Rise of the Chief Intelligence Officer (CINO).pdf"
    ],
    "report_names": [
        "2021-05-10 - Rise of the Chief Intelligence Officer (CINO).pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535722,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653756659,
    "ts_modification_date": 1653756659,
    "files": {
        "pdf": "https://archive.orkl.eu/601bec0f8610e1debf590e38b34dde5c3265d6d3.pdf",
        "text": "https://archive.orkl.eu/601bec0f8610e1debf590e38b34dde5c3265d6d3.txt",
        "img": "https://archive.orkl.eu/601bec0f8610e1debf590e38b34dde5c3265d6d3.jpg"
    }
}