{
    "id": "d5915695-96c4-4296-ae74-821679c1a7f9",
    "created_at": "2022-10-25T16:48:22.095497Z",
    "updated_at": "2025-03-27T02:16:58.164858Z",
    "deleted_at": null,
    "sha1_hash": "69c39d827a80d7a560dbafc31cce36566ec37c7f",
    "title": "The Ransomware Threat Landscape: What to Expect in 2022",
    "authors": "",
    "file_creation_date": "2022-01-31T09:43:31Z",
    "file_modification_date": "2022-01-31T09:43:33Z",
    "file_size": 915227,
    "plain_text": "# The Ransomware Threat Landscape: What to Expect in 2022\n\n##### Threat Hunter Team\n\n\n### Table of Contents\n\nIntroduction\n\nRansomware Trends\n\nCase Study – REvil Takedown a\nSign of Things to Come?\n\nTactics, Tools and Procedures\n\nNew and Updated Ransomware\nThreat Actors\n\nBirdwing\n\nSirex\n\nPinion\n\nDryxiphia\n\nBatfly\n\nPollen\n\nCase Study – Noberus: Rust-coded\nRansomware Wants to Keep\nNegotiations Private\n\nMiner\n\nCoreid\n\nHispid\n\nCase Study – Exmatter Data\nExfiltration Tool Used in\nBlackMatter, Conti Attacks\n\nVectors\n\nEmail Used to Deliver\nSquirrelWaffle Loader\n\nVulnerabilities in Public-Facing\nApplications Leveraged by\nRansomware Actors\n\nCase Study – Botnets: The Return\nof Emotet and the Importance\nof Access Brokers\n\nConclusion\n\nMitigation\n\nProtection\n\n\n### Introduction\n\nRansomware was the dominant cyber-crime trend of 2021, with no signs of\nthat changing in 2022. The big names on the ransomware landscape may\nchange, as takedowns, improved security, and new arrivals force existing\nfamilies to adapt, but activity remains at a high level. Big names like Ryuk,\nREvil/Sodinokibi, and Darkside have declined or disappeared over the last\nwhile, but newer names like Hive and AvosLocker have come to the fore\ninstead.\n\nWhile the most active names, and the tactics, tools, and procedures (TTPs)\nused by ransomware developers and their affiliates may alter, ransomware\nis unlikely to disappear or decline dramatically due to its sheer profitability.\nRansomware is only likely to disappear if something more profitable and\neasier to execute for cyber criminals comes along, which doesn’t seem\nlikely at the moment.\n\nChanges in the area of cyber insurance - such as insurance firms refusing\nto cover ransomware attacks - or increased regulation of cryptocurrencies\nare two external factors that could impact the profits ransomware actors\ncan make. Any change in the world of cryptocurrency that may impact\n[ransomware authors seems unlikely, but we have seen some cyber](https://www.insurancejournal.com/news/international/2021/05/09/613255.htm)\n[insurance companies become stricter about ransomware pay-outs, which](https://www.insurancejournal.com/news/international/2021/05/09/613255.htm)\nmakes that an area to watch. Many companies rely on insurance pay-outs\nt d f tt k\n\n\n-----\n\nSome of the main findings in this paper include:\n\n  - Targeted ransomware attacks trended upwards in 2021, almost trebling between the first and final quarter of\n2021.\n\n  - The list of TTPs used by ransomware actors continues to evolve. While hacktools and commodity malware\nare frequently leveraged by ransomware actors, dual-use tools and living-off-the-land tactics also continue to\nremain popular as ransomware actors endeavor to keep their activity undetected until they can deploy their\nransomware payload.\n\n  - The main ransomware families on the scene constantly change, often due to the impact of takedowns,\nsanctions, or increased scrutiny from law enforcement. New actors like Pinion (Hive) and Sirex (AvosLocker)\nare now very active, while Miner (Conti) also remains a strong presence on the ransomware scene.\n\n  - The return of the Emotet botnet in late 2021 has the potential to have a major impact on the ransomware\nlandscape in 2022.\n\n### Ransomware Trends\n\nThe number of organizations being bit by targeted ransomware trended upwards in 2021, as can be seen in Figure 1.\n\nFigure 1: Number of Targeted Ransomware Attacks, Jan to Dec 2021\n\n300\n\n250\n\n200\n\n150\n\n100\n\n50\n\n0\n\nJAN FEB MAR APR MAY JUN JUL AUG SEPT OCT NOV DEC\n2021\n\n[We noted in last year’s Ransomware Threat Landscape whitepaper that the number of targeted ransomware](https://symantec.drift.click/ransomware-threat-paper)\nattacks jumped by 83% between January 2020 and June 2021. We can see that this growth continued in the\nsecond half of 2021, with more than 250 targeted ransomware attacks recorded in both October and November\n2021. Between January 2021 and November 2021, the number of targeted ransomware attacks almost trebled from\n85 to 254, increasing by just under 200%.\n\nIt is important to note too when looking at the figures around targeted ransomware, which can seem small,\nthat confirmed attacks from known targeted ransomware families are probably only a representative sample of\nthe overall number of attacks involving these threats. Many targeted ransomware attacks are blocked before\nthe payload is deployed, meaning they may not be identified as ransomware. Also, most targeted ransomware\noperators recompile their ransomware for every new attack. This means that the variant of the ransomware used in\nan attack may be blocked by a generic or machine-learning-generated detection signature rather than a detection\nlinked to that ransomware family.\n\n\n-----\n\nWhile the number of targeted ransomware attacks has trended upwards over the last couple of years, the total\nnumber of ransomware attacks detected by Symantec, a division of Broadcom, has been in decline, as can be seen\nin Figure 2. This is likely a reflection of the decline in the popularity of mass-mailing spam ransomware campaigns,\nwith the focus of most cyber criminals in this space now on targeted ransomware. It is by no means an indication\nthat the danger posed by ransomware is declining in any way. With attackers increasingly focusing on targeted\nransomware, the danger for large organizations has likely only increased.\n\nFigure 2: All Ransomware Detections, Jan 2020 to Dec 2021\n\n10,000\n\n9,000\n\n8,000\n\n7,000\n\n6,000\n\n5,000\n\n4,000\n\n3,000\n\n2,000\n\n1,000\n\n0\n\nJAN F M A M J J A S O N D JAN F M A M J J A S O N D\n2020 2021\n\nThe difference between indiscriminate ransomware attacks and targeted ransomware attacks can be seen when we\nlook at the overall number of ransomware detections by country (Figure 3), compared to the number of targeted\nransomware detections by country (Figure 4).\n\nWhile the U.S. is the most targeted country in both cases, the overall number, which tends to be dominated by\nindiscriminate, mass-spamming ransomware attacks, lists countries such as the Democratic Republic of Congo\n(DRC), Ethiopia, and other countries that do not appear in the targeted ransomware list.\n\nFigure 3: Overall Number of Ransomware Detections by Country, Jan to Dec 2021\n\n\nUS\n\nChina\n\nIndia\n\nSouth Africa\n\nEthiopia\n\nCameroon\n\nTurkey\n\nGermany\n\nDRC\n\nGreat Britain\n\n\n0 3,000 6,000 9,000 12,000 15,000\n\n\n-----\n\nThe targeted ransomware list is more dominated by richer countries, including the UK, France, and Italy. Once\nagain, the U.S. is at the top of the list, with it seeing more than 10 times as many targeted ransomware attacks as\nthe next nation on the list (the UK). This is unsurprising considering the U.S. is a rich nation with a large business\nsector, and many targeted ransomware gangs have claimed to exclusively target U.S.-based companies.\n\nFigure 4: Targeted Ransomware Detections by Country, Jan to Dec 2021\n\nUS\n\nUK\n\nTurkey\n\nIndia\n\nCanada\n\nThailand\n\nSingapore\n\nBarbados\n\nFrance\n\nItaly\n\n0 500 1,000 1,500 2,000 2,500 3,000 3,500 4,000\n\nThe presence of a small country like Barbados in the top 10 in Figure 4 might raise eyebrows, but this is a count\nof computers on which a targeted ransomware family was detected, rather than a count of organizations. Many\nvictims of targeted ransomware have operations in more than one country.\n\nWhile overall activity and impacted countries are valuable information, what many people want to know is the\nmost active ransomware families they need to be aware of now. The ransomware landscape is ever evolving, and\nransomware families that were once dominant have become inactive – sometimes due to takedowns and at other\ntimes because operators have decided to “retire” a particular family – while new ransomware families have come to\nprominence.\n\n\n-----\n\nFigure 5: Targeted Ransomware Attacks by Family, Jan to Dec 2021\n\n250\n\n200\n\n150\n\n100\n\n50\n\n0\n\nJAN FEB MAR APR MAY JUN\n2021\n\nJAN Dec\n2021 2021\n\n\n50\n40\n30\n20\n10\n0\n\n\n**Avaddon** 83 **Avoslocker 52** **Babuk** 6 **Blackkingdom** 56 **Blackmatter** 10\n\n\n**Clop** 121 **Conti** 2 **Dearcry** 58 **Diavol** 16 **Exx** 13\n50\n40\n30\n20\n10\n0\n\n**Hive** 7 **Karma** 29 **Lockbit3** **Lockfile43** **Macaw6**\n50\n40\n30\n20\n10\n0\n\n**Matrix** 171 **Mespinoza** 117 **Netwalker** 41 **Ragnarlocker** 5 **Robinhood** 13\n50\n40\n30\n20\n10\n0\n\n**Ryuk** 28 **Sodinokibi** 9 **Thieflock** 8 **Wastedlocker** 184 **Yanluowang477**\n50\n40\n30\n20\n10\n0\n\n**Zeppelin499**\n50\n40\n30\n20\n10\n0\n\nWhile some families, such as Conti and LockBit, were active for much of 2021, many of the now-most-dominant\nransomware families only appeared in the final half or even the final quarter of 2021. Mespinoza, AvosLocker, Hive,\nand Zeppelin are all ransomware families that are very active and highly dangerous at the moment, with all of\nthese families seeing an uptick in activity in the second half of 2021, underlining the fast-changing nature of the\nransomware landscape.\n\nMore information about these active threats can be found in the Ransomware Threat Actors section of this\nwhitepaper.\n\n\n-----\n\nAgain, it should be stressed that these statistics should be treated as a representative sample of attacks blocked by\nSymantec products. The majority of attacks are likely to be blocked at the pre-ransomware deployment stage or\nbefore they can be associated with any particular family of ransomware.\n\n## Case Study \n\n### REvil Takedown a Sign of Things to Come?\n\nInfamous ransomware gang REvil/Sodinokibi This action was followed in January 2022 by\n(aka Leafroller) was forced offline in October [announcements from Russia that 14 alleged](https://www.theregister.com/2022/01/14/russia_revil_ransomware_gang_charged/)\n2021 when control of its infrastructure was [members of the REvil ransomware gang had](https://www.theregister.com/2022/01/14/russia_revil_ransomware_gang_charged/)\nseized in a multi-country operation. REvil had [been arrested by authorities in that country, in](https://www.theregister.com/2022/01/14/russia_revil_ransomware_gang_charged/)\ninitially gone offline in July 2021, when its main what was a highly unusual move by Russian law\nspokesperson “Unknown” also appeared to enforcement. Russian law enforcement said they\ndisappear from the internet, but the ransomware made the arrests after they received information\ncame back online in September. about the ransomware gang from authorities\n\nin the U.S. The White House said that among\n\nThe July shutdown of REvil occurred shortly\n\n[those arrested in those raids was the person](https://www.zdnet.com/article/moscow-court-charges-8-revil-ransomware-hackers/)\n\n[after the high-profile REvil ransomware attack](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/kaseya-ransomware-supply-chain)\n\n[responsible for the Colonial Pipeline ransomware](https://www.zdnet.com/article/moscow-court-charges-8-revil-ransomware-hackers/)\n\n[that hit IT management software company](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/kaseya-ransomware-supply-chain)\n\n[attack that occurred in May 2021. While that](https://www.zdnet.com/article/moscow-court-charges-8-revil-ransomware-hackers/)\n\n[Kaseya. However, while that disappearance was](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/kaseya-ransomware-supply-chain)\n\nattack was linked to the Darkside ransomware,\n\ntemporary, signs are that this October takedown\n\nthe developers of Darkside – Coreid – are\n\n[may have a more lasting impact. Media reports](https://www.reuters.com/technology/exclusive-governments-turn-tables-ransomware-gang-revil-by-pushing-it-offline-2021-10-21/)\n\nbelieved to have been associates of the REvil\n\nsaid that the U.S. Federal Bureau of Investigation\n\ngang.\n\n(FBI), U.S. Cyber Command, the Secret Service,\nand a number of international governments were High-profile ransomware attacks in 2021, such\nresponsible for the coordinated action against as those targeted at Colonial Pipeline, Kaseya,\nREvil in October. and also U.S. food production giant JBS Foods,\n\nappear to have made governments much more\nwilling to take a strong stance against the cybercriminal gangs that are involved in ransomware\nattacks.\n\n[Also in 2021, we saw the takedown of the](https://www.bleepingcomputer.com/news/security/emotet-botnet-disrupted-after-global-takedown-operation/)\n[Emotet botnet in January, though it may now](https://www.bleepingcomputer.com/news/security/emotet-botnet-disrupted-after-global-takedown-operation/)\n[have returned, and the Netwalker ransomware](https://krebsonsecurity.com/2021/01/arrest-seizures-tied-to-netwalker-ransomware/)\n[infrastructure was also seized and arrests made in](https://krebsonsecurity.com/2021/01/arrest-seizures-tied-to-netwalker-ransomware/)\n[that same month.](https://krebsonsecurity.com/2021/01/arrest-seizures-tied-to-netwalker-ransomware/)\n\n### Tactics, Tools and Procedures\n\nMost targeted ransomware attacks are a multi-stage process that see the attackers take many steps and deploy\nan array of TTPs before deploying the ransomware payload. An awareness of the TTPs commonly employed\nby ransomware attackers is key for organizations seeking to defend their networks from being infiltrated by\nransomware attackers, as spotting this pre-ransomware activity can allow defenders to stop an attack before it\ndetonates.\n\nAttackers employ these TTPs for a variety of actions, including to infiltrate the victim’s network, steal credentials,\nelevate privileges, move laterally across the network, and deploy their ransomware payloads.\n\n\n-----\n\nThe pre-ransomware tools we saw used most often in attacks during 2021 can be seen in Table 1. It is notable that\na Windows operating system tool like PsExec was the tool seen in the most investigations (34%) between April\nand December 2021. While commodity malware like Cobalt Strike also features strongly in the list of tools used by\nransomware attackers, the large number of living-off-the-land and dual-use tools leveraged points to the continuing\npopularity of living-off-the-land tactics among ransomware attackers as they endeavor to keep their activity on\nvictim networks hidden until the ransomware payload is deployed. They do this by leveraging legitimate processes\nand tools that are less likely to trigger security software or look suspicious to users on the network.\n\nTable 1: Most Frequently Seen Pre-ransomware Tools, April – December 2021\n\nTool Percentage of Investigations\n\nPsExec 34%\n\nCobalt Strike 18%\n\nMimikatz 11%\n\nVssAdmin 10%\n\nNetScan 7%\n\nBitsadmin 4%\n\nAdFind 5%\n\nNsudo 5%\n\nPowerShell 5%\n\nMSIExec 4%\n\nWEIRDLOOP 3%\n\nIcedID 3%\n\nDisable Defender 3%\n\nWMI 4%\n\nrclone 3%\n\nNetworkShare 2%\n\nPAExec 2%\n\nRaccoonStealer 2%\n\nPasswordRevealer 2%\n\nNetsh 2%\n\nProcDump 2%\n\nScreenConnectInstaller 2%\n\nSystemBC 2%\n\nDelete Shadow Copies 1%\n\nQakbot 1%\n\nIn the ransomware whitepaper we shared with customers in September 2021, we listed a number of the tools we\nsaw leveraged in ransomware attacks. Almost all of those tools are still relevant now, but we have also seen some\nadditional tools leveraged in more recent attacks. These include:\n\n**• VssAdmin: Legitimate Windows process that can be used to manage - or delete - shadow copies on**\nWindows machines.\n\n**• MSIExec: Legitimate Windows installer that can be abused by attackers to load malicious payloads onto**\ni ti hi\n\n\n-----\n\n**• NetworkShare: Command attackers can issue in order to spread their malicious payload to other machines**\non the same network.\n\n**• PAExec: Allows users to launch Windows programs on remote Windows computers without needing to**\ninstall software on the remote computer first. Like PsExec, it is primarily used by attackers to move laterally\non victim networks.\n\n**• RaccoonStealer: An information-stealer-for-hire that its operators rent to other cyber criminals for a fee. It**\ncan be used to steal a variety of information from infected machines, but is most likely used by ransomware\nattackers to steal credentials to allow for privilege escalation and lateral movement.\n\n**• PasswordRevealer: Hacktool that shows the passwords hidden behind asterisks on machines it is installed**\non.\n\n**• Netsh: Windows command-line utility that allows a user to configure and display the status of various**\nnetwork communications server roles and components. Has been used in LockBit and Mespinoza/Pysa\nattacks.\n\n**• ScreenConnectInstaller: An installer for ScreenConnect (now known as ConnectWise), a legitimate remote**\naccess tool that has been frequently exploited by malicious actors to provide access to victim machines. Has\nrecently been used in attacks leveraging the Yanluowang and Noberus (ALPHV/BlackCat) ransomware.\n\nThe tools which feature in our statistics and which also appeared in our September ransomware whitepaper are\nlisted below.\n\n**• Cobalt Strike: An off-the-shelf tool that can be used to execute commands, inject other processes, elevate**\ncurrent processes, or impersonate other processes, and upload and download files. It ostensibly has\nlegitimate uses as a penetration testing tool but is invariably exploited by malicious actors.\n\n**• PsExec: Microsoft Sysinternals tool for executing processes on other systems. The tool is primarily used by**\nattackers to move laterally on victim networks.\n\n**• PowerShell: Legitimate tool that can be used for a variety of malicious purposes, including executing**\ncommands directly from memory, and injecting malware into other legitimate processes. Because\nPowerShell has many legitimate uses it provides an ideal way for attackers to hide their malicious activity.\n\n**• NetScan: SoftPerfect Network Scanner, a publicly available tool used for discovery of hostnames and**\nnetwork services.\n\n**• Mimikatz: Freely available tool capable of changing privileges, exporting security certificates, and recovering**\nWindows passwords in plaintext depending on the configuration.\n\n**• AdFind: A free tool that can be used to query Active Directory.**\n\n**• Weirdloop: Cobalt Strike HTTPS Stager loader used in some attacks involving Ryuk during 2021.**\n\n**• IcedID: Botnet malware that was originally developed as a financial Trojan but is now frequently used in**\ncollaboration with ransomware attackers.\n\n**• SystemBC: Commodity malware that can open a backdoor on the infected computer and use the SOCKS5**\nproxy protocol to communicate with a command-and-control (C&C) server.\n\n**• ProcDump: Microsoft Sysinternals tool for monitoring an application for CPU spikes and generating crash**\ndumps, but which can also be used as a general process dump utility.\n\n**• Nsudo: Open-source system management tool that can be abused to elevate privileges.**\n\n**• Windows Management Instrumentation (WMI) (wmic.exe): Microsoft command-line tool that can be used**\nto execute commands on remote computers.\n\n**• Rclone: An open-source command-line utility that can legitimately be used to manage content in the cloud,**\nbut has been seen being abused by ransomware actors to exfiltrate data from victim machines.\n\n**• Qakbot: Botnet malware that was originally developed as a financial Trojan.**\n\n**• BITSAdmin: A Microsoft command-line tool that can be used to create, download, or upload jobs and**\nmonitor their progress.\n\nKnowing the TTPs used by ransomware attackers allows defenders to better understand how their organizations\ncould be compromised and can provide some guidance on prioritization of defensive measures.\n\n\n-----\n\n### New and Updated Ransomware Threat Actors\n\n[Many of the main ransomware threat families were detailed in our September 2021 ransomware whitepaper.](https://symantec.drift.click/ransomware-threat-paper)\nHowever, the nature of the ever-changing cyber-crime landscape, and in particular the ransomware landscape,\nmeans that several new ransomware families have become prominent since then. Some of the currently most active\nransomware families are detailed in this section.\n\n##### New Actor Profiles:\n\n Birdwing\n\nAliases: Pysa, Mespinoza\n\nRansomware families: Pysa\n\nActive since: 2018\n\nBirdwing develops the Mespinoza/Pysa ransomware, which has been used in attacks on victims in a large number\n[of sectors and countries, though most of its victims have been in the U.S. It is not entirely clear if Birdwing deploys](https://www.cybereason.com/blog/threat-analysis-report-inside-the-destructive-pysa-ransomware)\n[the ransomware itself, or if it operates a ransomware-as-a-service (RaaS) model, where affiliates deploy the](https://www.cybereason.com/blog/threat-analysis-report-inside-the-destructive-pysa-ransomware)\nransomware on its behalf for a cut of the profits.\n\n[Active since at least October 2018, Birdwing’s activity has ramped up in recent times, with the FBI issuing an alert](https://www.cisa.gov/stopransomware/fbi-flash-increase-pysa-ransomware-targeting-education-institutions)\n[about the group in March 2021. Birdwing ransom notes contain the phrase “Protect Your System Amigo”, which](https://www.cisa.gov/stopransomware/fbi-flash-increase-pysa-ransomware-targeting-education-institutions)\nmay be what Pysa stands for.\n\nBirdwing typically gains unauthorized access to victim networks by compromising Remote Desktop Protocol\n(RDP) credentials and/or through phishing emails. The group carries out reconnaissance on compromised\nsystems, likely to determine whether there is enough valuable data to justify launching a full-scale attack, and it\nsearches for keywords such as “clandestine”, “fraud”, “ssn”, and more, likely to find sensitive files that would have\nan impact if leaked. The cyber actors use Advanced Port Scanner and Advanced IP Scanner to conduct network\nreconnaissance, and proceed to install open-source tools, such as PowerShell Empire, Koadic, and Mimikatz. Other\nopen-source tools like PsExec, PowerShell, and netsh have been seen being deployed in Birdwing attacks as well.\nSecurity products, including Windows Defender, are also generally deactivated before the ransomware is deployed,\nand shadow copies are deleted from victim systems so that data cannot be restored from them.\n\n[Palo Alto said that in a Birdwing attack it observed a new backdoor it dubbed Gasket being downloaded to](https://unit42.paloaltonetworks.com/gasket-and-magicsocks-tools-install-mespinoza-ransomware/)\nmaintain access to the network. Gasket also referenced a capability called “MagicSocks” that uses the open-source\nChisel project to create tunnels for continued remote access to a network. The attackers created a standalone\nversion of the MagicSocks tool that they used in addition to Gasket to tunnel traffic. Symantec researchers also\nobserved a malicious script named p.ps1 being deployed by attackers via PsExec approximately 24-hours before\nransomware was deployed on victim machines during a Birdwing attack. Birdwing uses various methods to\nexfiltrate files from victim networks. The FBI reported it had been seen using the free open-source tool WinSCP,\nwhile both Symantec and Palo Alto researchers observed Birdwing attackers use IP-based URLs containing\nthe same URI pattern to exfiltrate victim data, e.g. URIs /upload-wekkmferokmsdderiuheoirhuiewiwnijnfrer?\ntoken=<base64 token value>&id=<unique number for organization>&fullPath=<path on disk of file exfiltrated>. In\nsome Birdwing attacks, stolen data has been uploaded to the Mega.nz file-sharing site.\n\nOnce the data is exfiltrated, the data on infected networks is encrypted by the ransomware. In several instances\nBirdwing has downloaded its payload with the file name svchost.exe, most likely in an effort to disguise the\nransomware as the generic Windows host process by giving it the same name. When the ransomware is executed, a\ndetailed ransom message is generated and displayed on the victim’s login or lock screen.\n\nSymantec researchers observed a Pysa ransomware attack in late October 2021 when the attackers spent just three\nor four days on the network before deploying the ransomware payload, which is a relatively short dwell time for\nransomware attackers.\n\n\n-----\n\n##### Sirex\n\nAliases: AvosLocker\n\nRansomware families: AvosLocker\n\nActive since: 2021\n\nSirex first appeared in June 2021. It is a ransomware operator that uses affiliates to carry out attacks using its\nAvosLocker ransomware for a cut of the profits. It offers not only the malware, but also help in managing the\ncommunication with the victim, and hosting of the data stolen during the operation.\n\nAvosLocker is generally spread via spam email campaigns or malvertising, however, as Sirex operates as an RaaS\nand the ransomware is distributed by affiliates, the TTPs used to carry out AvosLocker ransomware attacks may\nvary. Attackers using AvosLocker have also been seen exploiting known vulnerabilities in Microsoft Exchange Server\nto gain initial access to victim networks. Once the ransomware executes, the ransom note GET_YOUR_FILES_\nBACK.txt is created. The ransomware then encrypts the user’s files and appends the .avos extension to them. The\nlink given in the ransom note guides victims to a Tor website that requests the ID that was also in the note. If not\npaid, the ransom increases after a certain time, and the group also threatens to reveal publicly that the victim\norganization has been hacked.\n\nIf a file is currently being accessed by another process when the payload detonates, the ransomware ends the\nprocess and proceeds with the content encryption. The ransomware reads the file’s content, encrypts it, and\nwrites the content in the encrypted file with a unique signature. This signature is used to identify whether the file is\nencrypted or not. It also encrypts the network share drive.\n\n[Analysis by Malwarebytes concluded that AvosLocker was an unremarkable family of ransomware, which did](https://blog.malwarebytes.com/threat-analysis/2021/07/avoslocker-enters-the-ransomware-scene-asks-for-partners/)\n“not distinguish itself much from other ransomware (apart from being unusually noisy).” However, there are no\nweaknesses in its encryption, so it is impossible to recover encrypted data without the decryption key.\n\n[In September 2021, Sirex updated its website to create a system to allow it to auction off the data of hacked](https://therecord.media/avoslocker-ransomware-gang-to-auction-the-data-of-victims-who-dont-pay/)\n[companies that refuse to pay ransom demands, rather than just dumping it online for free.](https://therecord.media/avoslocker-ransomware-gang-to-auction-the-data-of-victims-who-dont-pay/)\n\n##### Pinion\n\nAliases: Hive\n\nRansomware families: Hive\n\nActive since: 2021\n\nPinion is notable for not seeming to exclude any sectors from its attacks, as many ransomware operators often\nclaim to do, with it known to have attacked multiple victims in the healthcare sector, for example. These attacks\ndo not seem to be mistakes because the ransomware is human-operated and designed to take input from the\ncommand-line, indicating the attackers are both aware of the environment they are in and tailoring their attacks for\nmaximum impact.\n\n[In an attack on non-profit U.S. healthcare provider Memorial Health Systems (MHS) in August 2021, attackers using](https://www.bleepingcomputer.com/news/security/hive-ransomware-attacks-memorial-health-system-steals-patient-data/)\nthe Hive ransomware claimed to have stolen data belonging to as many as 200,000 patients. The attack also led\nto the cancellation of surgeries and the curtailment of healthcare operations. Unlike in similar ransomware attacks\nwhere the ransomware actors have provided a decryption key free of charge after hitting a healthcare provider,\nPinion didn’t do this, with MHS reportedly paying a ransom of close to $2 million.\n\nPinion operates as an RaaS, with affiliates carrying out attacks using the Hive ransomware for a cut of the profits.\nHive is used in double-extortion ransomware attacks, where victim information is stolen as well as their files being\nencrypted.\n\nPinion and the affiliates leveraging its ransomware use multiple mechanisms to compromise business networks,\nincluding phishing emails with malicious attachments to gain access and RDP to move laterally once on the\nnetwork. Attackers using Hive have also been seen leveraging Cobalt Strike and the legitimate ConnectWise tool\nf i t i f t d t k\n\n\n-----\n\nThe ransomware seeks processes related to backups, anti-virus/anti-spyware, and file copying, and terminates\nthem to facilitate file encryption. It adds the .hive extension to encrypted files and then drops a hive.bat script into\nthe directory, which enforces an execution timeout delay of one second in order to perform a clean-up after the\nencryption is finished by deleting the Hive executable and the hive.bat script. A second file, shadow.bat, is dropped\ninto the directory to delete shadow copies, including disc backup copies or snapshots, and then delete the shadow.\nbat file. During the encryption process, encrypted files are renamed with the double final extension of *.key.hive\nor *.key.*. The ransom note, HOW_TO_DECRYPT.txt, is dropped into each affected directory and states that if the\n*key.* file is modified, renamed, or deleted, the encrypted files will no longer be able to be recovered.\n\nThe ransom note contains a “sales department” link, accessible through a Tor browser, that allows victims to contact\nthe actors through a live chat. Some victims also reported receiving phone calls from Hive actors requesting\n[payment for their files, according to the FBI. The note also informs victims that their data will be published on a](https://www.documentcloud.org/documents/21049431-fbi-flash-hive-ransomware-iocs)\ndata leaks website if they do not pay the ransom.\n\n[There are also Hive variants capable of encrypting Linux and FreeBSD systems.](https://www.bleepingcomputer.com/news/security/hive-ransomware-now-encrypts-linux-and-freebsd-systems/)\n\n##### Dryxiphia\n\nAliases: Yanluowang\n\nRansomware families: Yanluowang\n\nActive since: 2021\n\n[Dryxiphia, which was discovered by Symantec researchers, was first observed attempting to carry out a](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-targeted-ransomware)\n[ransomware attack using the Yanluowang ransomware in September 2021. The attack targeted a large enterprise](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-targeted-ransomware)\norganization and was spotted after researchers noted suspicious use of AdFind, a legitimate command-line Active\nDirectory query tool that is regularly abused by ransomware attackers. Days after the suspicious AdFind use was\nseen on victim machines the attackers attempted to deploy the Yanluowang ransomware.\n\n[Following our initial discovery of Yanluowang, Symantec researchers then found evidence that it had also been](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue)\n[used by a threat actor mounting targeted attacks against U.S. corporations since at least August 2021. The attacker](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue)\nused a number of TTPs that were previously linked to Canthroid (Thieflock) ransomware attacks, suggesting that\nthey may have been a Thieflock affiliate who shifted allegiances to the new Yanluowang ransomware family.\n\nYanluowang appears to be quite a newly developed ransomware, and it is unclear at the moment whether it is\nbeing rented out for use by affiliates as part of an RaaS operation or if Dryxiphia is carrying out most attacks\ndirectly. The ransomware has primarily been deployed against organizations in the financial sector.\n\nAlso notable is that, in its ransomware note, Dryxiphia warns victims not to contact law enforcement or\nransomware negotiation firms. If the attackers’ rules are broken the ransomware operators say they will conduct\ndistributed denial of service (DDoS) attacks against the victim, as well as make “calls to employees and business\npartners.” The criminals also threaten to repeat the attack “in a few weeks” and delete the victim’s data. This follows\na recent trend we have seen of ransomware attackers making further threats if victims attempt to involve any third\nparties in ransomware negotiations.\n\n##### Batfly\n\nAliases: Nemty, Karma\n\nRansomware families: Karma, Nemty, JSWorm, Nefilim, Fusion, Milihpen, Gangbang\n\nActive since: 2019\n\nBatfly is responsible for the well-known Nemty and Karma ransomware strains, as well as being involved in the\ndevelopment of various other ransomware variants, including Nefilim, Gangbang, and Milihpen, since 2019. Batfly’s\nfirst publicly observed activity was under the moniker JSWorm in April 2019. Nemty was first spotted in August\n2019, and it went through numerous different versions. Both Nemty and Karma are named as those are the\nextensions they add to encrypted files.\n\n\n-----\n\nWhen Nemty first appeared it was available for purchase on cyber-crime forums and the ransoms demanded were\nmodest by current standards, equating to approximately $1,000. In the early days of Nemty’s operations Batfly was\nvery active about releasing new versions of it to fix bugs and make improvements. Some of these were necessitated\ndue to the work done by security researchers and companies, while some were spurred on by critiques from the\nusers of the underground cyber-crime forums where Batfly was initially selling access to Nemty.\n\nBatfly was also one of the earlier ransomware developers to carry out double-extortion attacks, where the attackers\nsteal data for extortion purposes as well as encrypting it, operating a data leaks website since August 2019. Nemty\nwas distributed through email spam campaigns, exploit kits, and by brute-forcing RDP endpoints, as well as at one\n[point being distributed via the Trik botnet.](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/nemty-ransomware-trik-botnet)\n\nIn March/April 2020, Batfly rebranded its ransomware to Nefilim and announced it would be “going private”. This\nmeant it was no longer freely available to purchase on ransomware forums and that its developers would only work\nwith trusted affiliates, which is typically how RaaS offerings operate now.\n\nThe Milihpen variant appeared in January 2021. Written in C++ it retained the main functionality, execution flow,\ncrypto scheme and data leak site addresses of earlier variants, while Gangbang, which appeared in February\n2021, was identical to Milihpen. Karma appeared in May 2021 and researchers concluded it was most likely from\nthe same developers as Nemty due to code similarities between Karma, Gangbang, and Milihpen. The similarities\nincluded the exclusion of folders, file types, and the debug messages used. However, several changes had also\nbeen made, including Karma using Salsa20 encryption, while it also creates a new thread for the enumeration and\nthe encryption, possibly to achieve a more reliable outcome. The size of the ransoms demanded by Karma is not\nknown, but the ransomware seems to be primarily deployed against large organizations with revenues of more than\n$1 billion.\n\nBatfly’s older ‘Corporate Leaks’ data leaks website went dormant around the same time that Karma and its data\nleaks website appeared, indicating that, for now anyway, Karma appears to be the main focus for Batfly.\n\n##### Pollen\n\nAliases: Zeppelin, VegaLocker\n\nRansomware families: Zeppelin, Buran, VegaLocker\n\nActive since: 2019\n\nActive since 2019, Pollen initially used the VegaLocker ransomware, which targeted Russian speakers and was\nspread via malvertising on an online Russian advertising network. At the time it was indiscriminate in its targeting,\nand over the course of 2019 multiple new versions of VegaLocker appeared - Jamper, Storm, Buran - with some\noffered for sale on underground forums.\n\nHowever, a change in Pollen’s approach occurred when it launched the Zeppelin ransomware in November 2019,\nwith the ransomware being used to target carefully chosen organizations in the technology and healthcare sectors\nin the U.S. and Europe. Another feature of Zeppelin that marks it out from earlier versions of Pollen’s ransomware is\nthat it is designed to quit if it is running on machines in Russia or other Commonwealth of Independent States (CIS)\ncountries.\n\nPollen sells Zeppelin on underground forums, allowing buyers of the malware to decide how they wish to use\nit rather than distributing it through the more typical, controlled RaaS programs we generally see ransomware\ndevelopers operating now. Pollen is also notable for not operating a data leaks website, unlike most ransomware\nactors these days. Zeppelin is also notable for long periods of inactivity, with many believing it had been retired at\nthe end of 2020 before Pollen returned to offer a new version of the ransomware for sale in mid-2021.\n\nCyber criminals using Zeppelin generally use common initial attack vectors like RDP, VPN vulnerabilities, and\nphishing, while it has also been seen being distributed via compromised websites or temporary C&C infrastructures\nthat are active only during distribution. More recent Zeppelin variants also include a sleep function that lasts for 26\nseconds in an attempt to bypass dynamic analysis engines and sandboxes.\n\nSymantec researchers observed a Zeppelin ransomware attack in November 2021 that abused a local network\nshare as a staging server for the ransomware payload and a malicious PowerShell script named w.ps1. Prior to the\n\n\n-----\n\n  - Credential dumping using comsvcs\n\n  - Disabling security services\n\n  - Deletion of volume shadow copies\n\n  - Inhibiting system recovery using BCDEdit\n\n  - Remote compiling and execution using CVTRES\n\nPsExec was used to execute w.ps1 and copy the ransomware payload to all computers on the network. In this\nattack, encrypted files were given the file extension .v-society.9BF-C5F-9E3 and the ransom note stated that\n“VICE SOCIETY” was responsible.\n\nBecause Zeppelin can be relatively easily bought on underground forums it is likely to be distributed by a larger\nthan normal number of cyber-crime actors, making it more challenging to develop a picture of a typical Zeppelin\nattack as the TTPs used are likely to vary greatly.\n\n## Case Study \n\n### Noberus: Rust-coded Ransomware Wants to Keep Negotiations Private\n\n[Noberus (aka ALPHV/BlackCat) was first seen on](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/noberus-blackcat-alphv-rust-ransomware) Leaked negotiation transcripts largely arise from\n[a victim organization on November 18, 2021, with](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/noberus-blackcat-alphv-rust-ransomware) the fact that the preferred means of ransom\nthree variants of Noberus deployed over the course negotiation is a chat site with a unique URL for each\nof the one attack. Noberus is interesting because victim. While it makes it easy for victims to contact\nit is coded in Rust, and this is the first time we the attackers, it does mean that anyone with the\nhave seen a professional ransomware strain that URL can view the conversation and even post\nhas been used in real-world attacks coded in this themselves. Ransom negotiation URLs are often\nprogramming language. contained within the ransomware payload and can\n\nbe found if a sample is uploaded to services such\n\nNoberus carries out the now-typical double\nas VirusTotal, which means that even if the victim\n\nextortion ransomware attacks we are accustomed\n\ndoesn’t want to publicize the negotiation, it may\n\nto seeing, and deploys commonly seen ransomware\n\nbe accessible to third parties. The creation of these\n\ntools like PsExec and PowerShell in its attacks. It\n\nunique access keys during the attacks prevents this\n\nalso appears to leverage the legitimate ConnectWise\n\nfrom happening.\n\ntool to deploy its payload. It also carries out various\nother commonly seen pre-ransomware actions, such Negotiations being leaked or infiltrated is something\nas disabling Window Defender and deleting shadow that appears to have aggravated ransomware\ncopies. attackers recently, with more than one ransomware\n\ngroup having threatened to halt negotiations if\n\nOne interesting thing that Noberus does is run\n\nvictims bring in a professional negotiator or if\n\ncommands to collect system information via WMIC,\n\ninformation about the attack is leaked to the media.\n\nin order to collect Universally Unique Identifiers\n(UUIDs) from each machine. These are then used [Conti (aka Miner) said that it would immediately leak](https://therecord.media/conti-gang-threatens-to-dump-victim-data-if-ransom-negotiations-leak-to-reporters/)\nto generate the ‘access token’ that makes up part [victim data if transcripts or screenshots of ransom](https://therecord.media/conti-gang-threatens-to-dump-victim-data-if-ransom-negotiations-leak-to-reporters/)\nof the unique Tor address victims are instructed to [negotiations were publicly shared. Meanwhile, the](https://therecord.media/conti-gang-threatens-to-dump-victim-data-if-ransom-negotiations-leak-to-reporters/)\nvisit. Victims need to have this unique address in [Grief ransomware said it would delete decryption](https://www.bleepingcomputer.com/news/security/ransomware-gang-threatens-to-wipe-decryption-key-if-negotiator-hired/)\norder to enter into negotiations with the attackers. keys if victims hired a professional negotiator, while\nIt is likely the attackers did this in order to stop their [RagnarLocker said it would leak victim data if law](https://www.bleepingcomputer.com/news/security/ransomware-gang-threatens-to-leak-data-if-victim-contacts-fbi-police/)\nnegotiations being infiltrated by others, such as [enforcement was contacted.](https://www.bleepingcomputer.com/news/security/ransomware-gang-threatens-to-leak-data-if-victim-contacts-fbi-police/)\nsecurity researchers or journalists.\n\n### Case Study – Noberus: Rust-coded Ransomware Wants to Keep\n\n\n-----\n\n##### Miner\n\nNo sign of activity abating\n\nAliases: Wizard Spider\n\nRansomware families: Diavol, Conti, Ryuk, GoGaLocker (inactive), MegaCortex (inactive)\n\nActive since: 2014\n\nOne of the most active ransomware developers of recent years, Miner showed no signs of intending to slow down\nits activity as 2021 came to a close. Conti remains one of the most active targeted ransomware families, with the\n[Australian Cyber Security Center (ACSC) as recently as December 2021 issuing a warning about attacks using this](https://www.bleepingcomputer.com/news/security/australian-govt-raises-alarm-over-conti-ransomware-attacks/)\nransomware. The ACSC said there were “multiple instances” of Australian organizations being impacted by Conti\nransomware in November and December 2021.\n\nElsewhere, it has been reported that attackers associated with Conti were involved in the return of the Emotet\nbotnet in the last quarter of 2021 (See Case Study). However, it is not clear if this was Miner, or an affiliate user of\nConti.\n\nMeanwhile, in more recent months, Miner has been associated with a new ransomware called Diavol, which appears\n[to be becoming increasingly active. Fortinet researchers linked it to Miner in July, when it said the ransomware](https://www.fortinet.com/blog/threat-research/diavol-new-ransomware-used-by-wizard-spider)\nwas used in an attack during which Conti was also deployed on the same network. There are also some similarities\nbetween the two pieces of malware, as well as between the TTPs used. Diavol uses “nearly identical” command-line\nparameters to those of Conti and they are used for the same functionality, namely to log files, encrypt local drives\nor network shares, and scan specific hosts for network shares. Both Diavol and Conti also feature asynchronous I/O\noperations when queuing the file paths for encryption.\n\nMiner has remained consistently active during a time of great disruption on the ransomware landscape. If the group\nnow also has the Emotet botnet in its arsenal it is likely that attacks using ransomware developed by this group will\ncontinue to increase in 2022.\n\n##### Coreid\n\nLink to notorious FIN7 cyber-crime group\n\nAliases: Darkside\n\nRansomware families: Darkside, BlackMatter\n\nActive since: 2020\n\n[Coreid is most famously associated with the Darkside ransomware, which was used to carry out the May 2021](https://www.cnbc.com/2021/05/08/colonial-pipeline-shuts-pipeline-operations-after-cyberattack.html)\n[attack on Colonial Pipeline. Intense attention from both media and law enforcement following this attack led](https://www.cnbc.com/2021/05/08/colonial-pipeline-shuts-pipeline-operations-after-cyberattack.html)\nto Coreid retiring Darkside, with the group claiming it had lost access to its servers and cryptocurrency wallets\nfollowing law enforcement action.\n\n[However, in July 2021, the BlackMatter ransomware, which is widely believed by experts to be associated with](https://www.bleepingcomputer.com/news/security/darkside-ransomware-gang-returns-as-new-blackmatter-operation/)\nCoreid, appeared. BlackMatter used the same encryption routines as Darkside, while blockchain analysis firm\n[Chainalysis also found financial links between the two ransomware families. The U.S. government issued a](https://us-cert.cisa.gov/ncas/alerts/aa21-291a)\n[warning about BlackMatter in October 2021, saying it had been used in multiple targeted attacks aimed at critical](https://us-cert.cisa.gov/ncas/alerts/aa21-291a)\n[infrastructure organizations in the country. However, at the start of November, BlackMatter posted a message](https://www.bleepingcomputer.com/news/security/blackmatter-ransomware-claims-to-be-shutting-down-due-to-police-pressure/)\n[saying it would be ceasing operations due to “certain unsolvable circumstance associated with pressure from the](https://www.bleepingcomputer.com/news/security/blackmatter-ransomware-claims-to-be-shutting-down-due-to-police-pressure/)\nauthorities.” This likely means that arrests had made continuing to run the ransomware difficult. Its disappearance\njust over four months after it became active underlines the volatile nature of the ransomware landscape.\n\n\n-----\n\nWhile initially tracked by Symantec researchers as a standalone group, in the second half of 2021, research by\n[CrowdStrike linked Coreid to the infamous FIN7 (aka Carbon Spider) cyber-crime group, stating that they were](https://www.crowdstrike.com/blog/carbon-spider-embraces-big-game-hunting-part-1/)\none and the same and that FIN7 was behind both the Darkside and BlackMatter ransomware strains. FIN7 is a\nprolific cyber-crime group that has been active since at least 2016. Initially known for installing malware on pointof-sale systems in the retail and hospitality industries, according to CrowdStrike the group shifted its focus in 2020\nand started carrying out some ransomware attacks using the REvil ransomware. CrowdStrike says that FIN7 was\nresponsible for developing both the Darkside and BlackMatter ransomware strains, and for running the affiliate\nprograms for both ransomware.\n\nThe fact that a well-known and prolific cyber-crime gang like FIN7 made the decision to focus its attention on\nransomware shows the influence of ransomware on the cyber-crime landscape at the moment – it is the primary\nvehicle which sophisticated cyber criminals are using to make money. Now that the group has been forced to retire\nboth Darkside and BlackMatter it will be interesting to see if they appear with a new ransomware strain, or if law\nenforcement pressure has had an irreversible effect on the group’s activity.\n\n##### Hispid\n\nGroup debuts two new ransomware strains\n\nAliases: EvilCorp, Indrik Spider, TA505\n\nRansomware families: Grief, Macaw, DoppelPaymer, Hades, WastedLocker, Phoenix Locker, BitPaymer (retired)\n\nActive since: 2011\n\nHispid is a well-established cyber-crime group that has been active for around 10 years. The group was initially\nassociated with financial fraud, being responsible for the Dridex banking Trojan, before it turned its attention to\nransomware in 2017. Sanctions were imposed on Hispid by the U.S. Treasury Department’s Office of Foreign Assets\nControl (OFAC) in 2019, which prohibited victims from making payments to the threat group. The group is known\nto frequently rebrand its ransomware, likely in an effort to circumvent these sanctions and receive payment from\nU.S.-based companies.\n\nIn the second half of 2021, Hispid was seen operating two new ransomware strains. The Grief ransomware appeared\n[in June, and in October it claimed responsibility for a ransomware attack that hit the U.S. National Rifle Association](https://www.forbes.com/sites/teakvetenadze/2021/10/27/russian-cyber-gang-grief-claims-ransomware-attack-on-nra/)\n[(NRA). Also, in September 2021, Grief posted a statement on its data leaks website threatening to delete its victim’s](https://www.forbes.com/sites/teakvetenadze/2021/10/27/russian-cyber-gang-grief-claims-ransomware-attack-on-nra/)\ndecryption keys if victims hired a negotiation firm.\n\n[Meanwhile, in October 2021, another new ransomware, Macaw, was launched by Hispid. An attack using Macaw](https://www.bloomberg.com/news/articles/2021-10-20/sinclair-broadcast-hack-linked-to-notorious-russian-cybergang)\n[led to significant disruption at U.S. broadcasters Olympus and Sinclair Broadcast Group, leading to TV broadcasts](https://www.bloomberg.com/news/articles/2021-10-20/sinclair-broadcast-hack-linked-to-notorious-russian-cybergang)\nbeing cancelled and newscasters reporting stories using paper and whiteboards. The attackers reportedly\ndemanded ransoms of $28 million and $40 million off the victims.\n\nIt is likely we will see further new Hispid rebrands in 2022, as the group continues to try and evade the sanctions\nagainst it.\n\n\n-----\n\n### Conti Attacks\n\n## Case Study \n\n### Exmatter: Data Exfiltration Tool Used in BlackMatter, Conti Attacks\n\nExmatter is a custom data-exfiltration tool that was developers behind BlackMatter and Conti,\n[discovered by the Symantec Threat Hunter team](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackmatter-data-exfiltration) respectively).\n[in October 2021. It is designed to steal specific](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackmatter-data-exfiltration)\n\nOnce executed, the tool attempts to exfiltrate files\n\nfile types from a number of selected directories\n\nfrom a local machine according to some hardcoded\n\nand upload them to an attacker-controlled server\n\nrules. It will search a number of specified directories\n\nprior to deployment of the ransomware itself\n\nfor the following file types: .doc, .docx, .xls, .xlsx,\n\non the victim’s network. This is the third time a\n\n.pdf, .msg, .png, .ppt, .pptx, .sda, .sdm, .sdw, or .csv.\n\ncustom data-exfiltration tool appears to have been\n\nIt attempts to prioritize any files for exfiltration by\n\ndeveloped by ransomware operators, following\n\nusing LastWriteTime. Multiple variants of Exmatter\n\nthe earlier discovery of the Ryuk Stealer tool and\n\nhave been observed, indicating that the actor\n\nStealBit, which is linked to the LockBit ransomware\n\nbehind it is continually refining the tool in order to\n\noperation.\n\nexpedite exfiltration of a sufficient volume of high\nWhile Exmatter was initially spotted being used value data as quickly as possible.\nin a BlackMatter ransomware attack, it was also\n\nOnce it has finished exfiltrating data from victim\n\nsubsequently used in an attack where Conti was\n\nmachines, Exmatter runs a command to remove any\n\ndeployed in December 2021. This indicates that\n\ntrace of itself.\n\nExmatter is likely to be the product of a ransomware\naffiliate rather than Coreid or Miner (the ransomware\n\n### Vectors\n\nIt can often be hard to establish the initial infection vector used in ransomware attacks. However, some of the\nknown vectors commonly used by targeted ransomware actors include:\n\n  - Email – phishing and spam campaigns\n\n  - Vulnerability exploitation\n\n  - Botnets\n\nThe initial access vectors used by ransomware attackers are relevant because if a ransomware actor discovers a\nvector that gives them extensive access to victim networks it could allow them to execute highly disruptive and\ncostly attacks. It can also allow them to become a dominant figure on the ransomware landscape if they discover a\nway to infiltrate victim networks that other ransomware actors do not have access to, such as knowledge of a zeroday vulnerability or access to a particularly powerful botnet.\n\n##### Email Used to Deliver SquirrelWaffle Loader\n\nSquirrelWaffle is a malware loader that first appeared in September 2021, and which was described by some\nresearchers as a potential successor to Emotet - before the latter’s reappearance (see Case Study). Email is a\nknown tool for delivering ransomware threats, and SquirrelWaffle is primarily spread via spam campaigns and used\nto deliver Qakbot and Cobalt Strike, which are commonly seen pre-ransomware tools.\n\nThe spam emails delivering SquirrelWaffle generally contain hyperlinks to malicious Zip archives that include a\n[malicious .doc or .xls attachment. In a campaign analyzed by Cisco Talos, the actors used the DocuSign signing](https://blog.talosintelligence.com/2021/10/squirrelwaffle-emerges.html)\nplatform to trick the recipients into enabling macros on malicious documents.\n\n\n-----\n\nIf the victim enables macros on the document, SquirrelWaffle is fetched, which leads to the eventual download of\nQakbot and Cobalt Strike onto victim machines. All communications between SquirrelWaffle and its C&C servers\nare encrypted, while the malware also contains an IP address block list that is populated with notable security\nresearch firms as a way to evade detection and analysis. It was noted by Cisco Talos researchers when it appeared\non the scene that SquirrelWaffle’s “distribution campaigns, infrastructure, and [C&C] implementations feature\nseveral interesting techniques that are similar to those seen from other more established threats.”\n\nQakbot and Cobalt Strike are classic pre-ransomware tools. Symantec researchers spotted a campaign in October\n2021 that deployed many of the same tactics as those seen in SquirrelWaffle activity. The same paths and file\n[names were used in this campaign as were used in a SquirrelWaffle campaign Netskope blogged about, but we](https://www.netskope.com/blog/squirrelwaffle-new-malware-loader-delivering-cobalt-strike-and-qakbot)\ndid not see the SquirrelWaffle loader being deployed. In this campaign Qakbot was used to deliver Cobalt Strike,\nand while ransomware was not observed being delivered, that is believed to have been the likely end goal of the\ncampaign.\n\nVictims received an email with a Zip file attached. This Zip file contained a malicious Excel file. If victims opened\nthe malicious Excel document, Qakbot was launched on their machines. Once Qakbot was executed, the attackers\ncarried out some reconnaissance activity, including discovering shared resources on the device, as well as the\nname of the server and local groups on the device. Meanwhile, AdFind and various other suspicious files were\nalso executed. A Cobalt Strike beacon loader was then also executed from a scheduled task. The attackers then\nattempted to execute another unknown file, which is likely to have been ransomware.\n\n##### Vulnerabilities in Public-Facing Applications Leveraged by Ransomware Actors\n\nLeveraging vulnerabilities in public-facing applications has become an increasingly popular attack vector for cyber\ncriminals and advanced persistent threat (APT) groups over the last couple of years, and ransomware actors have\nbeen no exception.\n\nThe ProxyLogon vulnerabilities in Microsoft Exchange Server, which came to light in March 2021, were known to be\nleveraged by ransomware actors, among others. The AvosLocker (aka Sirex) ransomware, which is an RaaS offering\nthat was first seen in July 2021, was spotted in late November and December 2021 leveraging vulnerabilities in\nMicrosoft Exchange Server to gain initial access to victim networks. It would then drop web shells in non-standard\nfolders on the server, likely to allow for remote code execution.\n\nThe actors also abused the legitimate SoftEther VPN, renaming a copy of it to “systemresetosupdate.exe” to hide\nits functionality. Mimikatz and SecretsDump were also dropped in these attacks for credential theft. Certutil was\nused to download additional payloads, while AnyDesk was installed for lateral movement.\n\nElsewhere, bugs in virtual private networks (VPNs) were also a popular target. A known bug (CVE-2018-13379)\nin Fortinet’s VPN product is known to have been exploited by targeted ransomware actors. The Australian Cyber\n[Security Centre (ACSC) published an advisory in mid-2021 warning that LockBit 2.0 ransomware attackers were](https://www.cyber.gov.au/acsc/view-all-content/alerts/lockbit-20-ransomware-incidents-australia)\nusing CVE-2018-13379 to gain initial access to victim networks. Elsewhere, Canthroid (aka Thieflock) is known\nto compromise victims by exploiting a vulnerability in SonicWall VPN (CVE-2021-20016). The vulnerability was\npatched in February 2021, but Canthroid has continued to attack organizations using unpatched versions of the\nsoftware. Successful exploitation of this vulnerability allows an attacker to create their own credentials and join the\ntarget’s network.\n\nMore recently, the vulnerabilities in Apache Log4j, which were discovered in December 2021, were reportedly being\nexploited by ransomware families, among others. The Dridex botnet, which is known to deliver ransomware,\n[was reported as exploiting the vulnerabilities. Meanwhile, it was also reported that a ransomware family called](https://twitter.com/vxunderground/status/1473091815163273221)\n[Khonsari was attempting to leverage the vulnerabilities to access victim networks.](https://businessinsights.bitdefender.com/technical-advisory-zero-day-critical-vulnerability-in-log4j2-exploited-in-the-wild)\n\n\n-----\n\n### of Access Brokers\n\n\n-----\n\n### Conclusion\n\nIndications are that ransomware will remain the dominant threat on the cyber-crime landscape in 2022. The main\nnames on the ransomware landscape are likely to continue to change and evolve as takedowns and sanctions have\nan impact on ransomware developers and their affiliates. However, as Hispid (aka Evil Corp) shows, sanctions alone\nare not necessarily enough to stop these ransomware gangs, rather actions like that can just force them to rebrand\nfrequently. However, it became clear in 2021, particularly since the Colonial Pipeline attack, that authorities are\nincreasingly willing to take action to disrupt and take down ransomware and other cyber-crime gangs.\n\n[A significant occurrence in the first weeks of 2022 was the arrest by Russian authorities in Russia of 14 members of](https://www.zdnet.com/article/russian-authorities-take-down-revil-ransomware-gang/)\nthe REvil ransomware gang, with Russian law enforcement saying they took this action after receiving information\nabout alleged REvil members from U.S. authorities. This was a highly unusual move from police in Russia, which\nhave generally largely turned a blind eye to the activities of the large number of ransomware gangs that are\nbelieved to operate in the country, provided Russian organizations or individuals are not targeted. This is why\nwe so often see machines located in Russia and other CIS countries excluded from the lists of countries that\nransomware will attempt to infect. However, if this recent operation indicates a greater willingness on the part of\nauthorities in Russia to take action against ransomware gangs in the country it could have a significant impact on\nthe ransomware landscape.\n\nDespite the disruptions to the ransomware landscape caused by takedowns and arrests, ransomware operators\ncontinue to innovate. This was seen with the development of Noberus, the first professional ransomware strain\ncoded in Rust that has been used in real-world attacks, and the development of new tools for use in ransomware\nattacks, such as the SquirrelWaffle loader and the Exmatter exfiltration tool. The return of the Emotet botnet, if\nit reaches anything like the influence it had prior to its shutdown, is also likely to have a significant impact on the\nransomware landscape in 2022.\n\nWhile it can be hard to predict what will happen on the cyber-crime landscape in any given year due to the fastchanging nature of cyber criminals’ activity, it seems clear that targeted ransomware attacks will be a key threat\nthat large enterprise organizations will continue to face this year, and likely beyond. This is why it is important for all\norganizations to have an effective cyber-security strategy in place in order to protect themselves and mitigate the\ndangers of targeted ransomware attacks.\n\n\n-----\n\n### Mitigation\n\nSymantec recommends customers observe the following best practices to protect against targeted attacks.\n\nLocal environment:\n\n  - Monitor the use of dual-use tools inside your network.\n\n  - Ensure you have the latest version of PowerShell and you have logging enabled.\n\n  - Restrict access to RDP Services. Only allow RDP from specific known IP addresses and ensure you are using\nmulti-factor authentication (MFA).\n\n  - Implement proper audit and control of administrative account usage. You could also implement one-time\ncredentials for administrative work to help prevent theft and misuse of admin credentials.\n\n  - Create profiles of usage for admin tools. Many of these tools are used by attackers to move laterally\nundetected through a network.\n\n  - Use application whitelisting where applicable.\n\n  - Locking down PowerShell can increase security, for example with the constrained language mode.\n\n  - Make credential dumping more difficult, for example by enabling credential guard in Windows 10 or disabling\nSeDebugPrivilege.\n\n  - MFA can help limit the usefulness of compromised credentials.\n\n  - Create a plan to consider notification of outside parties. In order to ensure correct notification of required\norganizations, such as the FBI or other law enforcement authorities/agencies, be sure to have a plan in place\nto verify.\n\n  - Create a “jump bag” with hard copies and archived soft copies of all critical administrative information. In\norder to protect against the compromise of the availability of this critical information, store it in a jump bag\nwith hardware and software needed to troubleshoot problems. Storing this information on the network is not\nhelpful when network files are encrypted.\n\nEmail:\n\n  - Enable MFA to prevent the compromise of credentials during phishing attacks.\n\n  - Harden security architecture around email systems to minimize the amount of spam that reaches end-user\ninboxes and ensure you are following best practices for your email system, including the use of SPF and other\ndefensive measures against phishing attacks.\n\nBackup:\n\n  - Implement offsite storage of backup copies. Arrange for offsite storage of at least four weeks of weekly full\nand daily incremental backups.\n\n  - Implement offline backups that are onsite. Make sure you have backups that are not connected to the\nnetwork to prevent them from being encrypted by ransomware.\n\n  - Verify and test your server-level backup solution. This should already be part of your Disaster Recovery\nprocess.\n\n  - Secure the file-level permissions for backups and backup databases. Don’t let your backups get encrypted.\n\n  - Test restore capability. Ensure restore capabilities support the needs of the business.\n\n\n-----\n\n### Protection\n\nHow Symantec Solutions Can Help\n\nSymantec, a division of Broadcom Software, provides\na comprehensive portfolio of security solutions to\naddress today’s security challenges and protect data\nand digital infrastructure from multifaceted threats.\nThese solutions include core capabilities designed\nto help organizations prevent and detect advanced\nattacks.\n\nSymantec Endpoint Security Complete\n\nSymantec Endpoint Security Complete (SESC) was\nspecifically created to help protect against advanced\nattacks. While many vendors offer EDR to help find\nintrusions, there are gaps. We call these gaps blind\nspots and there are technologies in SESC to eliminate\nthem.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/endpoint/end-user/complete)\n\nPrivileged Access Management (PAM)\n\nPAM is designed to prevent security breaches by\nprotecting sensitive administrative credentials,\ncontrolling privileged user access, proactively\nenforcing security policies and monitoring and\nrecording privileged user activity.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/identity/pam)\n\nSymantec Web Isolation\n\nSymantec Web Isolation eliminates web threats and\nsolves the challenge of providing access to unknown,\nuncategorized and potentially risky web sites by\ncreating a remote execution environment between an\nagency’s enterprise systems and content servers on\nthe web.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/network/gateway/web-isolation)\n\n\nSymantec Secure Web Gateway (SWG)\n\nSWG delivers high-performance on-premises or cloud\nsecure web gateway that organizations can leverage to\ncontrol or block access to unknown, uncategorized, or\nhigh-risk web sites.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/network/gateway/proxy-sg-and-advanced-secure-gateway)\n\nSymantec Intelligence Services\n\nSymantec Intelligence Services leverages the Symantec\nGlobal Intelligence Network to deliver real-time threat\nintelligence to several Symantec network security\nsolutions including Symantec Secure Web Gateway,\nSymantec Content Analysis, Symantec Security\nAnalytics, and more.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/network/gateway/webfilter-intelligent-services)\n\nSymantec Content Analysis with Advanced\nSandboxing\n\nWithin the Symantec Content Analysis platform,\nzero-day threats are automatically escalated and\nbrokered to Symantec Malware Analysis with dynamic\nsandboxing for deep inspection and behavioral\nanalysis of potential APT files and toolkits.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/network/gateway/atp-content-malware-analysis)\n\nSymantec Security Analytics\n\nSymantec Security Analytics delivers enriched,\nfull-packet capture for full network traffic analysis,\nadvanced network forensics, anomaly detection, and\nreal-time content inspection for all network traffic to\narm incident responders for quick resolution.\n\n[LEARN MORE](https://www.broadcom.com/products/cyber-security/network/atp/network-forensics-security-analytics)\n\n\n**[For product information and a complete list of distributors, visit our website at: broadcom.com](https://www.broadcom.com/products/cyber-security)**\n\nCopyright © 2022 Broadcom. All Rights Reserved. The term “Broadcom” refers to Broadcom Inc. and/or its subsidiaries.\nBroadcom, the pulse logo, Connecting everything, and Symantec are among the trademarks of Broadcom.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.symantec.broadcom.com/hubfs/SED/SED_Threat_Hunter_Reports_Alerts/SED_FY22Q2_SES_Ransomware-Threat-Landscape_WP.pdf"
    ],
    "report_names": [
        "SED_FY22Q2_SES_Ransomware-Threat-Landscape_WP.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "84aa9dbe-e992-4dce-9d80-af3b2de058c0",
            "created_at": "2024-02-02T02:00:04.041676Z",
            "updated_at": "2025-03-27T02:00:03.297502Z",
            "deleted_at": null,
            "main_name": "Vanilla Tempest",
            "aliases": [
                "DEV-0832",
                "Vice Society"
            ],
            "source_name": "MISPGALAXY:Vanilla Tempest",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "600a0c3b-b595-4d10-b84b-cc2cf89289ac",
            "created_at": "2024-06-19T02:03:08.134296Z",
            "updated_at": "2025-03-27T02:05:17.402638Z",
            "deleted_at": null,
            "main_name": "GOLD VICTOR",
            "aliases": [
                "STAC5279 ",
                "Vanilla Tempest ",
                "Vice Society",
                "DEV-0832 "
            ],
            "source_name": "Secureworks:GOLD VICTOR",
            "tools": [
                " Advanced Port Scanner",
                " HelloKitty ransomware",
                " MEGAsync",
                " Neshta",
                " PAExec",
                " PSexec",
                " PortStarter",
                " SystemBC",
                " Zeppelin ransomware",
                "Advanced IP Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1643622211,
    "ts_modification_date": 1643622213,
    "files": {
        "pdf": "https://archive.orkl.eu/69c39d827a80d7a560dbafc31cce36566ec37c7f.pdf",
        "text": "https://archive.orkl.eu/69c39d827a80d7a560dbafc31cce36566ec37c7f.txt",
        "img": "https://archive.orkl.eu/69c39d827a80d7a560dbafc31cce36566ec37c7f.jpg"
    }
}