{
    "id": "d5c5ce8e-4741-4db9-83ee-98912a99955c",
    "created_at": "2023-05-06T02:09:35.75439Z",
    "updated_at": "2025-03-27T02:05:39.704869Z",
    "deleted_at": null,
    "sha1_hash": "4a7f2f3ba4d7eb1c518ee5494e98dbed9b2ebc27",
    "title": "2023-04-04 - Typhon Reborn V2- Updated stealer features enhanced anti-analysis and evasion capabilities",
    "authors": "",
    "file_creation_date": "2023-05-05T01:50:16Z",
    "file_modification_date": "2023-05-05T01:50:16Z",
    "file_size": 3087879,
    "plain_text": "# Typhon Reborn V2: Updated stealer features enhanced anti-analysis and evasion capabilities\n\n**[blog.talosintelligence.com/typhon-reborn-v2-features-enhanced-anti-analysis/](https://blog.talosintelligence.com/typhon-reborn-v2-features-enhanced-anti-analysis/)**\n\nEdmund Brumaghin April 4, 2023\n\nBy [Edmund Brumaghin](https://blog.talosintelligence.com/author/edmund-brumaghin/)\n\nTuesday, April 4, 2023 08:04\n\n[Threat Spotlight](https://blog.talosintelligence.com/category/threat-spotlight/) [SecureX\nThreats](https://blog.talosintelligence.com/category/securex-3/)\n\nThe developer of the Typhon Reborn information stealer released version 2 (V2) in\nJanuary, which included significant updates to its codebase and improved capabilities.\nMost notably, the new version features additional anti-analysis and anti-virtual\nmachine (VM) capabilities to evade detection and make analysis more difficult.\nWe assess Typhon Reborn 2 will likely appear in future attacks, as we have already\nobserved samples in the wild and multiple purchases of the malware.\nThe stealer is currently offered on underground forums for $59 per month but also\noffers a lifetime subscription for $540, which is inexpensive compared to competing\ninfostealers.\n\n\n-----\n\nThe stealer can harvest and exfiltrate sensitive information and uses the Telegram API\nto send stolen data to attackers.\n\n## Typhon Reborn V2 release\n\n[Typhon is an information stealer first publicly reported in mid-2022. It steals sensitive](https://blog.cyble.com/2022/08/16/phishing-site-used-to-spread-typhon-stealer/)\ninformation, such as cryptocurrency wallet data, from a variety of applications and uses a\n“file grabber” to collect a predefined list of file types, then exfiltrates them via Telegram.\n[Since its initial arrival, it has undergone continuous development, with Typhon Reborn being](https://unit42.paloaltonetworks.com/typhon-reborn-stealer/)\nreleased just several months later in late 2022. The malware’s developer announced the\nrelease of Typhon Reborn V2 on Jan. 31, 2023 on the popular Russian language dark web\nforum XSS. Samples uploaded to public repositories indicate that the new version of\nTyphon Reborn has been in the wild since December 2022.\n\n_Post announcing Typhon Reborn V2 release._\n\n\n-----\n\nIn the latest version, the malware developer claimed to have refactored the codebase and\nsignificantly improved existing capabilities present within the malware, which Cisco Talos\nindependently confirmed. It is available for $59 per month or a lifetime subscription for\n$540, which is inexpensive compared to competing infostealers. Analysis of the\ncryptocurrency wallet from which the attacker collects payments suggests that multiple\nadversaries have purchased access to the stealer, making it likely that it will be used in\nattacks moving forward.\n\n## Notable changes in Typhon Reborn V2\n\nThe code in Version 2 of Typhon Reborn was heavily modified compared to Version 1,\nbased on our analysis.\n\n_Code changes between Typhon Reborn V1 and V2._\nFor example, Version 2 has significantly more anti-analysis and anti-virtualization\ncapabilities, as evidenced by comparing the anti-analysis routines present in each version.\nFor example, the developer made several changes to the logic that prevents the malware\nfrom infecting systems that match predefined criteria. That includes heavily expanding this\n\n\n-----\n\nlist of criteria to include present usernames, CPUIDs, applications and processes present\non the system, debugger/emulation checks, and geolocation data for countries that\nattackers may wish to avoid.\n\n_Anti-analysis routine comparison between Typhon Reborn versions._\nFinally, in Typhon Reborn V2 samples that we analyzed, the developer appeared to have\nremoved the functionality that establishes persistence across reboots. Instead, V2 simply\nterminates itself after data exfiltration.\n\n## Dissecting Typhon Reborn V2\n\nIn Typhon Reborn V2, the malware complicates analysis via string obfuscation by using\nBase64 encoding and applying the XOR function to various strings. During execution, the\nmalware decodes the Base64, generating a UTF-8 character-encoded string that is then\ndeobfuscated using an XOR key stored in the malware’s configuration or hard-coded into\n```\nDecryptString(). The XOR key used is based on the mode passed when the function is\n\n```\ncalled each time. The resulting string is then decoded from Base64 again, creating a plain\ntext string to continue the operation.\n\n\n-----\n\n_String deobfuscation functionality._\nThe malware’s operations are determined by a series of parameters stored in the malware’s\nconfiguration that dictate what information should be collected, keys used for string\ndeobfuscation and geolocations where the malware should not execute.\n\n_Typhon Reborn V2 configuration parameters._\n\n## Anti-analysis and sandbox evasion\n\nWhen Typhon Reborn V2’s main() method is executed, it checks the malware configuration\nto determine if anti-analysis has been enabled. If it is enabled, the malware will attempt to\nconduct a series of anti-analysis checks to determine if it is being executed in an analysis or\nsandbox environment.\n\n_Anti-analysis checks._\n\n\n-----\n\nIf any of the checks fail, the malware will call a SelfRemove() class, creating a batch file in\nthe temp directory with the following contents.\n```\nchcp 65001\n\nTaskKill /F /IM [MALWARE_PID]\n\nTimeout /T 2 /Nobreak\n\n\n```\nThis batch file is then executed via the Windows command processor, thus terminating the\nmalware’s execution.\n\n_Self-removal functionality._\nThe overall execution flow of the various anti-analysis checks is shown below.\n\n\n-----\n\n-----\n\n_Anti-analysis process flow._\nThe malware uses Windows Management Instrumentation (WMI) to retrieve information\nabout the Graphics Processing Unit (GPU) on the system.\n```\nSELECT * FROM Win32_VideoController\n\n```\nIt then checks the returned value to determine if it contains the string vmware svga.\n\nThen, it makes an HTTP request to the following URL to determine if the system is located\nin a network associated with a hosting provider, colocation facility, or data center\nenvironment. The API returns either a “True” or “False” response based on the location of\nthe system which is used to determine the type of environment in which the system is\nlocated.\n```\nhxxp://ip-api[.]com/line/?fields=hosting\n\n```\nThen, it checks for the presence of the following DLLs associated with common security\nproducts that may be installed.\n\nSbieDLL.dll (Sandboxie)\nSxIn.dll (360 Total Security)\nSf2.dll (Avast)\nSnxhk.dll (Avast)\ncmdvrt32.dll (Comodo Internet Security)\n\nIt also retrieves the system manufacturer and model via WMI using the following query:\n```\nSelect * from Win32_ComputerSystem\n\n```\n\n-----\n\nThe retrieved information is checked to determine if it contains the following hypervisorrelated strings.\n\nVIRTUAL\nvmware\nVirtualBox\n\nThe malware also uses WMI to collect information about the system’s video controller.\n```\nSELECT * FROM Win32_VideoController\n\n```\nThis information is then checked to determine if it contains the strings VMware or VBox.\n\nNext, the malware uses CheckRemoteDebuggerPresent to determine if the process is being\ndebugged.\n\nThe malware then obtains the current system time, initiates a short (10ms) sleep, then\nobtains the system time again. It compares the delta between the two times to what is\nexpected during normal operations to determine if the process is being run in a debugging\nsession.\n\nThe command line argument used to initially launch the malware is then obtained to\ndetermine if the sample was executed using the file name detonate.exe or if the argument\n```\n-–detonate was passed when initiating execution.\n\n```\nThe malware also checks the Windows Registry\n(SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall) to determine if any subkeys\nreference the following common analysis tools:\n\ndnSpy PDFStreamDumper Ghidra\n\nWireshark Autoruns x64dbg\n\nHashCalc Process Hacker\n\nFileInsight Process Monitor\n\nNext, WMI is queried to obtain the ProcessorId (CPUID) for the system using the following\nquery.\n```\nSelect ProcessorId From Win32_Processor\n\n```\n\n-----\n\nThe CPUID is then checked against the following list of CPUIDs under which the malware\nwill not execute:\n\n4AB2DFCCF4\nBFEBFBFF000906E9\n078BFBFF000506E3\n078BFBFF00000F61\n178BFBFF00830F10\n0F8BFBFF000306C1\n\nThe malware also determines the user account context under which the malware is\nexecuting and will terminate if the username matches the following values:\n\nIT-ADMIN sand box Abby\n\nPaul Jones maltest WDAGUtilityAccount\n\nWALKER malware Frank\n\nSandbox virus fred\n\ntimmy John Doe JOHN-PC\n\ntim Emily Lisa\n\nvboxuser CurrentUser John\n\nsandbox test\n\nPeter Wilson TVM\n\nThe malware then obtains the list of currently running processes on the system and checks\nthe executable path associated with them against the following list of executable file names\nassociated with common analysis tools.\n\nollydbg.exe idaq64.exe\n\nprocesshacker.exe immunitydebugger.exe\n\n\n-----\n\ntcpview.exe wireshark.exe\n\nautoruns.exe dumpcap.exe\n\nde4dot.exe hookexplorer.exe\n\nilspy.exe lordpe.exe\n\ndnspy.exe petools.exe\n\nautorunsc.exe resourcehacker.exe\n\nfilemon.exe x32dbg.exe\n\nprocmon.exe x64dbg.exe\n\nregmon.exe fiddler.exe\n\nidaq.exe\n\nIt then attempts to test internet connectivity by making an HTTP request to\n```\nhttp://www.google.com.\n\n```\nThe malware again obtains the execution environment to determine if its filename matches\nthe following list:\n\ndetonate\nvirus\ntest\nmalware\nmaltest\n\nNext, the malware checks the Programs subdirectory under the Windows Start Menu for the\npresence of the following analysis tools:\n\ndnspy x86dbg\n\ndetect it easy ghidra\n\n\n-----\n\ndie ida\n\nprocmon fiddler\n\nprocess monitor scylla\n\nprocess hacker winhex\n\nilspy hxd\n\nx64dbg de4dot\n\nIt then attempts to locate wine_get_unix_file_name to determine if [Wine is being used in](https://www.winehq.org/)\nan analysis environment.\n\nNext, it checks the SYSTEM_CODEINTEGRITY_INFORMATION structure to determine if unsigned\nor test-signed drivers are allowed on the system (CODEINTEGRITY_OPTION_ENABLED,\n```\nCODEINTEGRITY_OPTION_TESTSIGN).\n\n```\nThe malware also checks the SYSTEM_KERNEL_DEBUGGER_INFORMATION structure to\ndetermine if kernel mode debugging is enabled (KernelDebuggerEnabled).\n\nThen, the malware checks various system DLLs for the presence of instructions that may\nindicate that the environment is instrumented for analysis.\n\nThe malware also features two geolocation avoidance mechanisms. The first one allows for\nthe specification of a list of countries in the malware’s config that the attacker does not want\nto infect systems in. The malware uses the IP-API service to determine where the system is\nlocated and compares it against the user-supplied list.\n\n_IP geolocation check._\nIf the system is located in one of these countries, the malware calls the SelfRemove()\nfunctionality previously described.\n\nThe malware also contains a RunAntiCIS() feature that specifically avoids infecting\nsystems located in Commonwealth of Independent States (CIS) countries.\n\n\n-----\n\n_CIS country avoidance_\n\n\n-----\n\n## System and network data collection\n\nIf the victim’s environment passes all the malware’s anti-analysis checks, Typhon Reborn\nV2 begins collecting and exfiltrating sensitive information. First, the malware creates a\nrandomly named subdirectory under %LOCALAPPDATA%, then the malware begins generating\nstealer logs that will ultimately be staged in that subdirectory for exfiltration.\n\nTo generate the logs, the malware retrieves survey information about the infected system\nand writes it to the stealer log. It collects a variety of system information including user data,\nsystem data and network information, using various mechanisms such as WMI queries,\nenvironment variables, and registry keys. The malware uses api[.]ipify[.]org to obtain\nthe public IP of the infected system. This information is saved in the malware’s working\ndirectory (UserData.txt) along with a text file (BuildID.txt) containing the Telegram\nchannel for the malware’s developer. A list of installed software is also generated using\nWMI and saved (InstalledSoftwares.txt). A list of hard drives present within the system\nis also saved (Drive Info.txt).\n\nThe malware also captures screenshots from infected systems saved in the same directory\nas the stealer logs.\n\n_Screenshot capture._\nThe stealer also collects saved Wi-Fi network information and stores it (Wifi\n```\nPasswords.txt) using the following system commands:\ncmd.exe /C chcp 65001 && netsh wlan show profile | findstr All\ncmd.exe /C timeout /t 5 /nobreak > nul && netsh wlan show profile name=\n<PROFILE_NAME> key=clear | findstr Key\n\n```\n\n-----\n\nIt also attempts to scan for available wireless networks and stores information about them\n(Available Networks.txt).\n```\ncmd.exe /C timeout /t 5 /nobreak > nul && netsh wlan show networks mode=bssid\n\n```\nA list of currently running processes and process executable paths is collected and saved\nas well (Running Processes.txt).\n\n## Application data collection\n\nOnce basic system information has been collected and saved, the stealer begins iterating\nthrough specific applications and collecting data based on the malware’s configuration. The\nstealer currently supports collecting passwords, tokens, and other sensitive information\nfrom the applications shown below.\n\n\n-----\n\n_Typhon Reborn V2 Application Support._\n\n## Gaming clients\n\n\n-----\n\nTyphon Reborn V2 can steal data from additional applications, including various gaming\nclients. However, this functionality was never actually called from the main() method of the\nmalware in the latest version analyzed.\n\nThe malware also contains a FileGrabber() feature that is used to collect and exfiltrate\nfiles of interest from victim environments. It iterates through all drives detected on the\nsystem and attempts to determine whether any are removable storage devices, network\nstorage locations or optical drives.\n\n_Drive enumeration._\nEach drive that meets this criterion has its root directory added to a list of target directories.\nThe malware then iterates through all of the target directories, copying contents that match\nthe parameters in the malware’s configuration to the malware’s working directory.\n\nThe two parameters Config.GrabberSize and Config.GrabberFileExtensions defined in\nthe malware’s configuration determine the operation of the file collection capability.\n\n_File grabber configuration parameters._\n\n## Data exfiltration\n\nOnce the stealer has finished collecting information from infected systems, the data is\nstored in a compressed archive and exfiltrated via HTTPS using the Telegram API. First, the\nmalware sends an overview log containing survey information and basic statistics related to\nthe data collected.\n\n\n-----\n\n_Stealer log transmission._\nThen, the malware sends another Telegram message containing the data being exfiltrated\nfrom the infected system.\n\n\n-----\n\n_Data exfiltration._\nOnce the data has been successfully transmitted to the attacker, the archive is then deleted\nfrom the infected system. The malware then calls SelfRemove.Remove() to terminate\nexecution.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html?ref=cisco-talos-blog)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium=web-referral%3Futm_source%3Dcisco&%3Butm_campaign=amp-free-trial&%3Butm_term=pgm-talos-trial&%3Butm_content=amp-free-trial&ref=cisco-talos-blog)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html?ref=cisco-talos-blog)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html?ref=cisco-talos-blog)\nthreat actors as part of their campaign. You can try Secure Email for free [here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium=web-referral&%3Butm_source=cisco&%3Butm_campaign=cmd-free-trial-request&%3Butm_term=pgm-talos-trial&ref=cisco-talos-blog)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances](https://www.cisco.com/c/en/us/products/security/firewalls/index.html?ref=cisco-talos-blog)\nsuch as [Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html?ref=cisco-talos-blog) [Adaptive Security Appliance and](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html?ref=cisco-talos-blog) [Meraki MX can detect](https://meraki.cisco.com/products/appliances?ref=cisco-talos-blog)\nmalicious activity associated with this threat.\n\n\n-----\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html?ref=cisco-talos-blog)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/?ref=cisco-talos-blog)\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a\n[free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium=web-referral%3Futm_source%3Dcisco&%3Butm_campaign=umbrella-free-trial&%3Butm_term=pgm-talos-trial&%3Butm_content=automated-free-trial&ref=cisco-talos-blog)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html?ref=cisco-talos-blog)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are\n[available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html?ref=cisco-talos-blog)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are](https://signup.duo.com/?utm_source=talos&utm_medium=referral&utm_campaign=duo-free-trial)\naccessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products?ref=cisco-talos-blog)\n\nThe following Snort SIDs are applicable to this threat: 61532-61533, 300476.\n\n### Orbital Queries\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex OSqueries](https://orbital.amp.cisco.com/help/)\nto see if their endpoints are infected with this specific threat. For specific OSqueries on this\nthreat, click [here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/typonstealer_file_staging.yml)\n\n## Indicators of Compromise (IOCs)\n\n[IOCs for this research can also be found at our Github repository here](https://github.com/Cisco-Talos/IOCs/tree/main/2023/04)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-04 - Typhon Reborn V2- Updated stealer features enhanced anti-analysis and evasion capabilities.pdf"
    ],
    "report_names": [
        "2023-04-04 - Typhon Reborn V2- Updated stealer features enhanced anti-analysis and evasion capabilities.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338975,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1683251416,
    "ts_modification_date": 1683251416,
    "files": {
        "pdf": "https://archive.orkl.eu/4a7f2f3ba4d7eb1c518ee5494e98dbed9b2ebc27.pdf",
        "text": "https://archive.orkl.eu/4a7f2f3ba4d7eb1c518ee5494e98dbed9b2ebc27.txt",
        "img": "https://archive.orkl.eu/4a7f2f3ba4d7eb1c518ee5494e98dbed9b2ebc27.jpg"
    }
}