{
    "id": "d5d99604-8706-4f9c-a310-972363cc6cca",
    "created_at": "2023-01-12T15:04:13.26454Z",
    "updated_at": "2025-03-27T02:15:35.678612Z",
    "deleted_at": null,
    "sha1_hash": "af6ec243432734668e149529d3e7a99c4096c768",
    "title": "2022-05-18 - eSentire Threat Intelligence Malware Analysis- Mars Stealer",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:55Z",
    "file_modification_date": "2022-05-29T00:53:55Z",
    "file_size": 33813723,
    "plain_text": "# eSentire Threat Intelligence Malware Analysis: Mars Stealer\n\n**esentire.com/blog/esentire-threat-intelligence-malware-analysis-mars-stealer**\n\nMars Stealer is an information-stealing malware that first appeared on hacking forums in June 2021, a year after its predecessor Oski Stealer\nwas discontinued in June 2020. Mars Stealer can target or ‘support’ over 50 crypto wallets and extensions, is multi-functional, and avoids\ndetection. In addition, it’s low price on the malware market has generated significant attention from threat actor(s) who are looking to add the\neffective malware into their arsenal.\n\n[eSentire's Threat Response Unit (TRU) team previously published a TRU Positive that focused on the cyber threat investigation summary of a](https://www.esentire.com/blog/fake-chrome-setup-leads-to-netsupportmanager-rat-and-mars-stealer)\nsingular incident and recommendations regarding Mars Stealer malware. However, this blogpost delves deeper into the technical details that\n[were gathered during the research and analysis of the Mars Stealer TRU Positive.](https://www.esentire.com/blog/fake-chrome-setup-leads-to-netsupportmanager-rat-and-mars-stealer)\n\n## Key Takeaways:\n\nMars Stealer is the latest version of Oski Stealer, which was discontinued in June 2020.\nNetSupport RAT (Remote Access Tool), or client32.exe, was embedded in a ChromeSetup.exe file and used by an attacker to gain\naccess to a victim’s workstation for further deployment of tools needed to plant Mars Stealer.\nAn executable with the original filename 3uAirPlayer was used to deploy obfuscated AutoIt scripts with Mars Stealer embedded inside\nand a renamed version of AutoIt to evade detections.\nThe persistence mechanism was created to make sure the attacker(s) maintain access to NetSupportManager as a backdoor.\nMars Stealer can self-delete itself after successfully exfiltrating the victim’s data, leaving no trace behind.\n\n## Case Study\n\nThe first mention of Mars Stealer appeared on Russian-speaking forums in June 2021 and at the time, it was being sold for $140 a month\n(Exhibit 1).\n\n\n-----\n\n_Exhibit 1: Advertisement on Mars Stealer_\n\nMars Stealer allegedly ‘supports’, or is capable of, harvesting data from common browsers, crypto wallets, and two-factor authentication (2FA)\nand crypto extensions. Since the release of Mars Stealer, eSentire’s Threat Response Unit (TRU) team has observed a number of cracked\nversions being distributed by a reverse engineer who goes under the username ‘LLCPPC’. The latest version is Mars Stealer v8 (Exhibit 2).\n\nExhibit 2: Mars Stealer v8 advertisement\n\n\n-----\n\na s Stea e as bee de e ed as a d [e by do](https://blog.morphisec.com/threat-research-mars-stealer) oad a c o ed ebs tes o o so t a e, suc as Ope O ce e a a e s a so\n[distributed as patching software and keygens on gaming forums. In the incident observed by eSentire, the stealer was delivered via the](https://cyberint.com/blog/research/mars-stealer/)\nNetSupportManager RAT.\n\n## Technical Analysis of Mars Stealer Infection\n\n### Initial Access\n\nThe initial access vector occurred when the victim visited a malicious website hosting an ISO image named ChromeSetup.iso\n(hxxps[:]//googleglstatupdt[.]com/LEND/ChromeSetup[.]iso).\n\nThe ISO image contained ChromeSetup.exe, which had an embedded NetSupportManager RAT and a Chrome Updater in a cabinet (CAB)\narchive-file format (Exhibits 3-4).\n\n_Exhibit 3: Cabinet section under RCData_\n\n_Exhibit 4: Contents of the extracted CAB file_\n\nThe NetSupportManager RAT was obfuscated by the attacker as ‘21m_18_033.exe’. The RAT was installed in tandem when the victim opened\nChromeSetup.exe. Persistence was achieved by the RAT via a Startup LNK file through the following path:\n\nc:\\users\\*\\appdata\\roaming\\microsoft\\windows\\start menu\\programs\\startup\\autorunings.ini.lnk\n\nThe LNK runs the RAT under C:\\Users\\*\\AppData\\Roaming\\WinSupports\\client32.exe after each reboot attempt.\n\nIt is worth noting that attacks involving RATs do not usually start with the full infection chain once the user executes the initial payload. The\nattacker would need additional time to access the RAT and load additional payloads. In the incident we analyzed, the attacker’s movement in\nthe network can be observed in Exhibit 5.\n\n_Exhibit 5: Infection chain_\n\n\n-----\n\na p e e (o g a a e 3u aye e e) as used to p a t t e o o g uto t sc pts o t e ct s o stat o u de t e pat\nC:\\Users\\*\\AppData\\Local\\Temp\\IXP001.TMP:\n\nuna.wmd\nfervore.wmd\nvai.wmd\n\nThe scripts were embedded within the CAB file of the executable (Exhibits 6-7)\n\n_Exhibit 6: Cabinet section under RCData (aNpRAHx.exe)_\n\n_Exhibit 7: Contents of the CAB file_\n\nThe AutoIt scripts were highly obfuscated. Within the aNpRAHx.exe resources, there was a POSTRUNPROGRAM section that contained the\nfollowing command:\n\n**Esitanza.exe.pif: the renamed AutoIt program**\n**una.wmd: the script responsible for dropping Esitanza.exe**\n**vai.wmd: the core script that contains Mars Stealer, its dependencies, and the copy of a NTDLL.DLL file**\n\n_Exhibit 8: Obfuscated Fervore.wmd script_\n\nThe post command execution was also responsible for running the following commands on the host:\n\nfind /I /N \"bullguardcore.exe\"\nfind /I /N \"psuaservice.exe”\n\n\n-----\n\ndst / /\n\"^UzERaIroWGYHeuAyIPBJMSUyDIptkdLqzqzZHgBHJNQEeOwczSBTavTwnmhKnZWGVYgwNAnxhUZYefrOGNKzOSHWiaAoqRoKRlJtmq\nUna.wmd\ntasklist /FI \"imagename eq BullGuardCore.exe”\ntasklist /FI \"imagename eq PSUAService.exe\"\n\nAs indicated above, vai.wmd is the script responsible for loading additional dependencies as well as Mars Stealer. The value $ARZURr holds\nthe obfuscated Mars Stealer version (Exhibit 9). The RC4 key was derived from the following pattern:\n\nBinary(MRPvnDnroX(\"58}59}59}63}61}63}60}60}58}59}62}63}57}57}58}64}56}63}57}63}57}63}57}61}60}57}60\",7)))))\n\nThe pattern subtracts 7 from each character that is eventually converted to ASCII format. The RC4 key to decrypt the Mars Stealer is\n“344868553478223918282826525”.\n\n_Exhibit 9: The hex values of the obfuscated Mars Stealer_\n\nAfter decrypting the binary (Exhibit 10), there appeared to be another layer of obfuscation added to the file that was decrypted during runtime.\n\n_Exhibit 10: Decrypting the binary using CyberChef_\n\n\n-----\n\nt out a g to u y deob uscate t e uto t sc pt, e co e ted t e sc pt to a e ecutab e a d p oceeded t debugg g ( b t )\nWe were able to extract the deobfuscated Mars Stealer executable by leveraging the debugger. It should be noted that Mars Stealer is loading\nits own copy of NTDLL.DLL and renames it (Exhibit 12). NTDLL.DLL is responsible for injecting Mars Stealer into explorer.exe module during\n[the runtime (Exhibit 13-14). A similar technique was observed in Oasis Stealer and thoroughly described by a Malware Analyst, hasherezade.](https://blog.malwarebytes.com/threat-analysis/2018/08/process-doppelganging-meets-process-hollowing_osiris/)\n\n[Endpoint Detection and Response (EDR) uses API hooking to monitor suspicious processes in real time. It is a common practice for EDR](https://www.ired.team/offensive-security/defense-evasion/bypassing-cylance-and-other-avs-edrs-by-unhooking-windows-apis)\nsolutions to hook the functions exported from NTDLL.DLL. The library does not rely on other DLL (Dynamic Link Library) dependencies. In\n[addition, it is also responsible for exporting Native APIs that are often abused by malware developers. Moreover, in order to bypass the](https://en.wikipedia.org/wiki/Native_API)\ndetection by EDR tools, attacker(s) will independently load a copy of NTDLL.DLL (Exhibit 15).\n\n_Exhibit 11: Credential stealing evidence from the debugger_\n\n_Exhibit 12: Renamed copy of NTDLL.DLL (partially deobfuscated AutoIt script)_\n\nExhibit 13: Mars Stealer is being injected into explorer.exe (1)\n\n\n-----\n\n_Exhibit 14: Mars Stealer is being injected into explorer.exe (2)_\n\n_Exhibit 15: Custom loaded NTDLL.DLL_\n\nIt is also worth noting that another executable was dropped via the remote session on the victim’s machine – consoleappmrss.exe. The\nexecutable contained an embedded file named Installer_ovl.exe, which was written in C#.\n\nThe executable connected to the shortened URL (tiny[.]one), a Discord CDN to retrieve another file named\nDebugViewPortable_4_90_Release_3_English_online_Auejpzlt.bmp (Exhibit 16).\n\n\n-----\n\n_Exhibit 16: The file reaches out to Discord CDN to download additional payloads_\n\nAt the time of the analysis, the link to the BMP file was not accessible. We believe that the attacker(s) tried to retrieve additional payloads, but\nthe attempt was unsuccessful.\n\n### Mars Stealer and C2 Panel Analysis\n\nThe deobfuscated Mars Stealer was written in ASM/C and approximately 162KB in size. The compilation date was March 29, 2022, which\nsuggests that the attacker(s) modified the stealer right before shipping it onto the victim’s machine.\n\nThe stealer includes anti-debugging and anti-sandbox features:\n\n[For anti-debugging purposes, it manually checks the PEB (Process Environment Block) for BeingDebugged flag.](https://docs.microsoft.com/en-us/windows/win32/api/winternl/ns-winternl-peb)\n[For anti-sandboxing, the stealer sleeps for 16000 milliseconds (about 16 seconds) and calls GetTickCount API (Exhibit 17) to retrieve the](https://docs.microsoft.com/en-us/windows/win32/api/sysinfoapi/nf-sysinfoapi-gettickcount)\nnumber of milliseconds that have passed since the system was started and the number of milliseconds of the current running time.\n\nBoth values get subtracted and are compared to 12000 milliseconds (about 12 seconds).\nIf the value is less than 12000, it means that the Sleep function was skipped by the debugger or sandbox, and the sample exits\n(Exhibit 18).\n\nThe sample also performs anti-emulation checks for Windows Defender Antivirus on values HAL9TH and JohnDoe (Exhibit 19).\n\n_Exhibit 17: Using GetTickCount() for anti-debugging purposes_\n\n\n-----\n\n_Exhibit 18: If the sample is being debugged, the running process terminates_\n\n_Exhibit 19: Windows Defender Antivirus anti-emulation checks_\n\nMars Stealer will exit if the following languages are detected (Exhibit 20):\n\nUzbekistan\nAzerbaijan\nKazakhstan\nRussia\nBelarus\n\n_Exhibit 20: Language check using GetUserDefaultUILanguage function_\n\nThe language checks are also performed within the Mars Stealer panel (Exhibit 21).\n\n\n-----\n\n_Exhibit 21: Language check in PHP component_\n\nThe strings in .RDATA section are XOR’ed (XOR or \"exclusive or\" is a logical operator that yields true if exactly one (not both) of two conditions\nis true) with different keys as shown in Exhibit 22. The first batch of decrypted strings are mostly API calls (Exhibit 23).\n\n_Exhibit 22: XOR-encoding routine_\n\n_Exhibit 23: Decrypted strings (1)_\n\nFrom another batch of decrypted strings, we can observe the following (Exhibit 24):\n\n1. C2 channel\n2. Mutex value\n3 C2 channel (same as #1)\n\n\n-----\n\ndepe de c es equ ed o t e stea e to u ct o p ope y\n5. The stealer fingerprints the following information on the infected machine and outputs it to system.txt file:\n\nTag (the tag of the Stealer build)\nCountry\nIP\nWorking Path\nLocal Time\nTime Zone\nDisplay Language\nKeyboard Languages\nLaptop/Desktop\nProcessor\nInstalled RAM\nOS (Operating Systems)\nVideo card\nDisplay Resolution\nPC name\nUsername\nInstalled Software\n\n_Exhibit 24: Decrypted strings (2)_\n\nMars Stealer avoids reinfection by looking up a Mutex value 67820366929896267194. If the host returns the code\nERROR_ALREADY_EXISTS (183), the stealer quits running (Exhibit 25).\n\n\n-----\n\n_Exhibit 25: Checks if Mutex value already exists_\n\nMars Stealer has grabber and loader capabilities. The grabber functionality allows the attacker(s) to specify what files to collect, from which\npaths and the maximum file size. The following constant paths allow Mars Stealer to grab a victim’s data (Exhibit 26):\n\n%DESKTOP%\n%APPDATA% - path to Roaming folder (C:\\Users\\*user*\\AppData\\Roaming)\n%LOCALAPPDATA% - path to Local folder (C:\\Users\\*user*\\AppData\\Local)\n%USERPROFILE% - path to User’s folder (C:\\Users\\*user*\\)\n\nExhibit 26: Grab panel\n\nThe loader allows the attacker(s) to upload additional payloads to the infected host including the modified/upgraded version of Mars Stealer.\nThe loader functionality has the same constant paths mentioned above. The attacker(s) can enable the “Cold Wallet” option in the Loader\npanel, but it only works if the infected machine stores files related to crypto wallets and plugins (Exhibit 27).\n\n\n-----\n\n_Exhibit 27: Loader panel_\n\nAs a part of the configuration, the attacker(s) can set up a Telegram Bot, which is used to receive the logs from infected machines. The\nsettings panel also allows the attacker(s) to enable the following folders/files to collect:\n\nDownloads\nHistory\nAutofill (passwords, payment methods, addresses, etc.)\nScreenshot\nDiscord\n\nThe attacker(s) can also choose the “Build self-delete” option to remove the stealer on the infected machine. The self-delete command is\nexecuted via command line (Exhibit 28):\n\n/c timeout /t 5 & del /f /q \"%s\" & exit\n\n_Exhibit 28: Self-deletion function_\n\nIt is worth mentioning that the attacker(s) can replace their cryptocurrency and 2FA authenticator extensions in the browser with the ones\ncollected on the victim’s machine and eventually obtain access to it Here is the list of cryptocurrency extensions the stealer collects:\n\n\n-----\n\n|Crypto wallet|Extension|\n|---|---|\n|TronLink|ibnejdfjmmkpcnlpebklmnkoeoihofec|\n|MetaMask Binance Chain Wallet|nkbihfbeogaeaoehlefnkodbefgpgknn fhbohimaelbohpjbbldcngcnapndodjp|\n|Yoroi|ffnbelfdoeiohenkjibnmadjiehjhajb|\n|Nifty Wallet|jbdaocneiiinmjbjlgalhcelgbejmnid|\n|Math Wallet|afbcbjpbpfadlkmhmclhkeeodmamcflc|\n|Coinbase Wallet|hnfanknocfeofbddgcijnmhnfnkdnaad|\n|Guarda|hpglfhgfnhbgpjdenjgmdgoeiappafln|\n|EQUAL Wallet|blnieiiffboillknjnepogjhkgnoapac|\n|Jaxx Liberty|cjelfplplebdjjenllpjcblmjkfcffne|\n|BitApp Wallet|fihkakfobkmkjojpchpfgcmhfjnmnfpi|\n|iWallet|kncchdigobghenbbaddojjnnaogfppfj|\n|Wombat|amkmjjmmflddogmhpjloimipbofnfjih|\n|MEW CX|nlbmnnijcnlegkjjpcfjclmcfggfefdm|\n|GuildWallet|nanjmdknhkinifnkgdcggcfnhdaammmj|\n|Saturn Wallet|nkddgncdjgjfcddamfgcmfnlhccnimig|\n|Ronin Wallet|fnjhmkhhmkbjkkabndcnnogagogbneec|\n|NeoLine|cphhlgmgameodnhkjdmkpanlelnlohao|\n|Clover Wallet|nhnkbkgjikgcigadomkphalanndcapjk|\n|Liquality Wallet|kpfopkelmapcoipemfendmdcghnegimn|\n|Terra Station|aiifbnbfobpmeekipheeijimdpnlpgpp|\n|Keplr|dmkamcknogkgcdfhhbddcghachkejeap|\n|Sollet|fhmfendgdocmcbmfikdcogofphimnkno|\n|Sollet|fhmfendgdocmcbmfikdcogofphimnkno|\n|Auro Wallet|cnmamaachppnkjgnildpdmkaakejnhae|\n|Polymesh Wallet|jojhfeoedkpkglbfimdfabpdfjaoolaf|\n|ICONex|flpiciilemghbmfalicajoolhkkenfel|\n|Nabox Wallet|nknhiehlklippafakaeklbeglecifhad|\n|KHC|hcflpincpppdclinealmandijcmnkbgn|\n|Temple|ookjlbkiijinhpmnjffcofjonbfbgaoc|\n|TezBox|mnfifefkajgofkcjkemidiaecocnkjeh|\n|Cyano Wallet|dkdedlpgdmmkkfjabffeganieamfklkm|\n|Byone|nlgbhdfgdhgbiamfdfmbikcdghidoadd|\n|OneKey|infeboajgfhgbjpjbeppbkgnabfdkdaf|\n|LeafWallet|cihmoadaighcejopammfbmddcmdekcje|\n|DAppPlay|lodccjjbdhfakaekdiahmedfbieldgik|\n|BitClip|ijmpgkjfkbfhoebgogflfebnmejmfbml|\n|Steem Keychain|lkcjlnjfpbikmcmbachjpdbijejflpcm|\n\n\nNash Extension onofpnbbkehpmmoabgpcpmigafmmnjhl\n\n\n-----\n\n|Hycon Lite Client|bcopgchhojmggmffilplmbdicgaihlkp|\n|---|---|\n|ZilPay|klnaejjgbibmhlephnhpmaofohgkpgkd|\n|Coin98 Wallet|aeachknmefphepccionboohckonoeemg|\n\n\nBelow is the list of 2FA Authenticator extensions:\n\n**2FA Authenticator** **Extension**\n\nAuthenticator bhghoamapcdpbohphigoooaddinpkbai\n\nAuthy gaedmjdfmmahhbjefcbgaolhhanlaolb\n\nEOS Authenticator oeljdldpnmdbchonielidgobddffflal\n\nGAuth Authenticator ilgcnhelpchnceeipipijaljkblbcobl?hl=ru\n\nTrezor Password Manager imloifkgjagghnncjkhggdhalmcnfklk?hl=ru\n\nMoreover, the stealer gathers the credentials and sensitive data from numerous browsers and crypto wallets (Exhibit 29).\n\nExhibit 29: The function responsible for gathering crypto wallet data\n\n**Supported browsers:**\n\nInternet Explorer, Microsoft Edge, Google Chrome, Chromium, Microsoft Edge (Chromium version), Kometa, Amigo, Torch, Orbitum, Comodo\nDragon, Nichrome, Maxthon5, Maxthon6, Sputnik Browser, Epic Privacy Browser, Vivaldi, CocCoc, Uran Browser, QIP Surf, Cent Browser,\nElements Browser, TorBro Browser, CryptoTab Browser, Brave Browser, Opera Stable, Opera GX, Opera Neon, Firefox, SlimBrowser,\nPaleMoon, Waterfox, Cyberfox, BlackHawk, IceCat, KMeleon, Thunderbird\n\n**Supported crypto wallets:**\n\nDogecoin, Zcash, DashCore, LiteCoin, Ethereum, Electrum, Electrum LTC, Exodus, Electron Cash, MultiDoge, JAXX, Atomic, Binance,\nCoinomi\n\n### C2 Communication\n\n[The infected machine occasionally sends the POST requests to http://162.33.178[.]122/fakeurl.htm, which is a NetSupportManager server](http://162.33.0.178/)\n(Exhibit 30).\n\n|2FA Authenticator|Extension|\n|---|---|\n|Authenticator|bhghoamapcdpbohphigoooaddinpkbai|\n|Authy|gaedmjdfmmahhbjefcbgaolhhanlaolb|\n|EOS Authenticator|oeljdldpnmdbchonielidgobddffflal|\n|GAuth Authenticator|ilgcnhelpchnceeipipijaljkblbcobl?hl=ru|\n|Trezor Password Manager|imloifkgjagghnncjkhggdhalmcnfklk?hl=ru|\n\n\n-----\n\n_Exhibit 30: POST requests of NetSupport Manager traffic_\nThe victim then reaches out to the Mars Stealer C2 server (/request) to grab additional DLL dependencies (Exhibit 31):\n\nsoftokn3.dll (Mozilla Firefox Library)\nsqlite3.dll (used for SQLite database)\nvcruntime140.dll (Microsoft Visual Studio runtime library)\nfreebl3.dll (Mozilla NSS freebl Library)\nmozglue.dll (Mozilla Firefox Library)\nmsvcp140.dll (Microsoft Visual Studio runtime library)\nnss3.dll (Network Security Services Mozilla Firefox Library)\n\n\n-----\n\n_Exhibit 31: The infected machine is reaching out to C2 Server to retrieve DLL components_\n\nThe infected machine then sends out the collected data including RDP credentials and certificates in a ZIP archive to Mars Stealer C2 (Exhibit\n32).\n\n_Exhibit 32: Exfiltrated data sent out to C2_\n\nThe following is an example of the exfiltrated data and the contents of the previously mentioned system.txt file (Exhibit 33).\n\n\n-----\n\n_Exhibit 33: The contents of the exfiltrated ZIP archive including system.txt_\n\n[During the analysis of Mars Stealer, we observed a number of similarities with Oski Stealer including anti-emulation and self-removal](https://www.cyberark.com/resources/threat-research-blog/meet-oski-stealer-an-in-depth-analysis-of-the-popular-credential-stealer)\ncapabilities, language checks, loader, and grabber features of the stealer. The obfuscation mechanism is also identical to the previous versions\nof Mars Stealer: RC4 decryption key and Base64 strings. The Oski Stealer author removed the Telegram Support channel and stopped\nresponding to requests on Oski Stealer at the end of June 2020.\n\neSentire’s TRU team accesses with high confidence that Mars Stealer is a successor of Oski Stealer, although it is worth noting that unlike\nOski Stealer, Mars Stealer does not support Outlook data and credential exfiltration.\n\n## How eSentire is Responding\n\nOur Threat Response Unit (TRU) team combines threat intelligence obtained from research and cybersecurity incidents to create practical\noutcomes for our customers. We are taking a full-scale response approach to combat modern cybersecurity threats by deploying\ncountermeasures, such as:\n\nImplementing cyber threat detections to identify malicious command execution, usage of renamed tools and ensure that eSentire has\n[visibility and detections are in place across eSentire MDR for Endpoint and](https://www.esentire.com/how-we-do-it/signals/endpoint) [MDR for Network.](https://www.esentire.com/how-we-do-it/signals/network)\nPerforming global cyber threat hunts for indicators associated with Mars Stealer.\n\nOur detection content is supported by investigation runbooks, ensuring our SOC (Security Operations Center) analysts respond rapidly to any\nintrusion attempts related to a known malware Tactics, Techniques, and Procedures. In addition, TRU closely monitors the threat landscape\nand constantly addresses capability gaps and conducts retroactive threat hunts to assess customer impact.\n\n## Recommendations from eSentire’s Threat Response Unit (TRU)\n\nWe recommend implementing the following controls to help secure your organization against SolarMarker malware:\n\n[Implement a Phishing and Security Awareness Training (PSAT) program that educates and informs employees on emerging threats in](https://www.esentire.com/what-we-do/managed-vulnerability-and-risk/technical-testing/security-awareness-training-managed-phishing-training)\nthe threat landscape.\n[Confirm that all devices are protected with Endpoint Detection and Response (EDR) solutions.](https://www.esentire.com/how-we-do-it/signals/endpoint)\nPrevent web browsers from automatically saving and storing passwords. It is recommended to use password managers instead.\nEnable multi-factor authentication whenever it is applicable.\n\nWhile the TTPs used by adversaries grow in sophistication, they lead to a certain level of difficulties at which critical business decisions must\nbe made. Preventing the various cyberattack paths utilized by the modern threat actor requires actively monitoring the threat landscape,\ndeveloping, and deploying endpoint detection, and the ability to investigate logs & network data during active intrusions.\n\neSentire’s TRU team is a world-class team of threat researchers who develop new detections enriched by original threat intelligence and\nleverage new machine learning models that correlate multi-signal data and automate rapid response to advanced cyber threats.\n\nIf you are not currently engaged with an MDR provider, [eSentire MDR can help you reclaim the advantage and put your business ahead of](https://www.esentire.com/what-we-do/esentire-managed-detection-and-response)\ndi ti\n\n\n-----\n\nea at t ea s to a e a e te tea o eat u te s a d esea c e s t at o s o you Co ect t a eSe t e Secu ty Spec a st\n\n## Appendix\n\n### Indicators of Compromise\n\n**Name** **Indicators**\n\ngoogleglstatupdt[.]com Hosting ChromeSetup ISO\n\nzrianevakn1[.]com NetSupportManager RAT C2\n\n162[.]33.178.122 NetSupportManager RAT C2\n\n115d1ae8b95551108b3a902e48b3f163 ChromeSetup.iso\n\nb15e0db8f65d7df27c07afe2981ff5a755666dce ChromeSetup.exe\n\n37c24b4b6ada4250bc7c60951c5977c0 NetSupportManager RAT\n\n5[.]45.84.214 Mars Stealer C2 (Offline)\n\ne57756b675ae2aa07c9ec7fa52f9de33935cbc0f Mars Stealer\n\ne3c91b6246b2b9b82cebf3700c0a7093bacaa09b Esitanza.exe.pif (renamed AutoIt)\n\ne3c91b6246b2b9b82cebf3700c0a7093bacaa09b ANpRAHx.exe (disguised as 3uAirPlayer, drops Mars Stealer and obfuscated AutoIt\nscripts)\n\n5c4e3e5fda232c31b3d2a2842c5ea23523b1de1a Installer_ovl.exe\n\n2a2b00d0555647a6d5128b7ec87daf03a0ad568f consoleappmrss.exe\n\n3c80b89e7d4fb08aa455ddf902a3ea236d3b582a Fervore.wmd (obfuscated AutoIt script)\n\n26136c59afe28fc6bf1b3aeba8946ac2c3ce61df Vai.wmd (obfuscated AutoIt script, contains Mars Stealer)\n\ne6f18804c94f2bca5a0f6154b1c56186d4642e6b Una.wmd (obfuscated AutoIt script)\n\n### Yara Rules\n```\nimport \"pe\"\nrule MarsStealer {\n  meta:\n    description = \"Identifies Mars Stealer malware\"\n    author = \"eSentire TI\"\n    date = \"04/20/2022\"\n    hash = \"e57756b675ae2aa07c9ec7fa52f9de33935cbc0f\"\n  strings:\n    $string1 = \"C:\\\\ProgramData\\\\nss3.dll\"\n    $string2 = \"passwords.txt\" \n    $string3 = \"screenshot.jpg\" \n    $string4 = \"*wallet*.dat\" \n    $string5 = \"Grabber\\\\%s.zip\"\n  condition:\n    all of ($string*) and\n    (uint16(0) == 0x5A4D or uint32(0) == 0x4464c457f)    \n}\n\n Skip To:\n\n```\nKey Takeaways:\nCase Study\nTechnical Analysis of Mars Stealer Infection\nHow eSentire is Responding\nRecommendations from eSentire’s Threat Response Unit (TRU)\nAppendix\n\n|Name|Indicators|\n|---|---|\n|googleglstatupdt[.]com|Hosting ChromeSetup ISO|\n|zrianevakn1[.]com|NetSupportManager RAT C2|\n|162[.]33.178.122|NetSupportManager RAT C2|\n|115d1ae8b95551108b3a902e48b3f163|ChromeSetup.iso|\n|b15e0db8f65d7df27c07afe2981ff5a755666dce|ChromeSetup.exe|\n|37c24b4b6ada4250bc7c60951c5977c0|NetSupportManager RAT|\n|5[.]45.84.214|Mars Stealer C2 (Offline)|\n|e57756b675ae2aa07c9ec7fa52f9de33935cbc0f|Mars Stealer|\n|e3c91b6246b2b9b82cebf3700c0a7093bacaa09b|Esitanza.exe.pif (renamed AutoIt)|\n|e3c91b6246b2b9b82cebf3700c0a7093bacaa09b|ANpRAHx.exe (disguised as 3uAirPlayer, drops Mars Stealer and obfuscated AutoIt scripts)|\n|5c4e3e5fda232c31b3d2a2842c5ea23523b1de1a|Installer_ovl.exe|\n|2a2b00d0555647a6d5128b7ec87daf03a0ad568f|consoleappmrss.exe|\n|3c80b89e7d4fb08aa455ddf902a3ea236d3b582a|Fervore.wmd (obfuscated AutoIt script)|\n|26136c59afe28fc6bf1b3aeba8946ac2c3ce61df|Vai.wmd (obfuscated AutoIt script, contains Mars Stealer)|\n|e6f18804c94f2bca5a0f6154b1c56186d4642e6b|Una.wmd (obfuscated AutoIt script)|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-18 - eSentire Threat Intelligence Malware Analysis- Mars Stealer.pdf"
    ],
    "report_names": [
        "2022-05-18 - eSentire Threat Intelligence Malware Analysis- Mars Stealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535853,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653785635,
    "ts_modification_date": 1653785635,
    "files": {
        "pdf": "https://archive.orkl.eu/af6ec243432734668e149529d3e7a99c4096c768.pdf",
        "text": "https://archive.orkl.eu/af6ec243432734668e149529d3e7a99c4096c768.txt",
        "img": "https://archive.orkl.eu/af6ec243432734668e149529d3e7a99c4096c768.jpg"
    }
}