{
    "id": "d5f7ec75-c0cb-4a75-a8c3-b0fa380995ea",
    "created_at": "2023-01-12T15:04:51.671262Z",
    "updated_at": "2025-03-27T02:06:12.325295Z",
    "deleted_at": null,
    "sha1_hash": "0d853fab3222ba2aa19f2bb1b0ddc5470e733b8f",
    "title": "2020-05-28 - Goodbye Mworm, Hello Nworm- TrickBot Updates Propagation Module",
    "authors": "",
    "file_creation_date": "2022-05-28T00:21:26Z",
    "file_modification_date": "2022-05-28T00:21:26Z",
    "file_size": 7524524,
    "plain_text": "# Goodbye Mworm, Hello Nworm: TrickBot Updates Propagation Module\n\n**[unit42.paloaltonetworks.com/goodbye-mworm-hello-nworm-trickbot-updates-propagation-module/](https://unit42.paloaltonetworks.com/goodbye-mworm-hello-nworm-trickbot-updates-propagation-module/)**\n\nBrad Duncan May 28, 2020\n\nBy [Brad Duncan](https://unit42.paloaltonetworks.com/author/bduncan/)\n\nMay 28, 2020 at 12:00 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Mworm,](https://unit42.paloaltonetworks.com/tag/mworm/) [Nworm,](https://unit42.paloaltonetworks.com/tag/nworm/) [Trickbot](https://unit42.paloaltonetworks.com/tag/trickbot/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/goodbye-mworm-hello-nworm-trickbot-updates-propagation-module/)\n\n## Executive Summary\n\nFirst [discovered in 2016, TrickBot is an information stealer that provides backdoor access](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\nsometimes used by criminal groups to distribute other malware. TrickBot uses modules to\nperform different functions, and one key function is propagating from an infected Windows\nclient to a vulnerable Domain Controller (DC). TrickBot currently uses three modules for\n[propagation. As early as April 2020, TrickBot updated one of its propagation modules known](https://www.malware-traffic-analysis.net/2020/04/20/index2.html)\nas \"mworm\" to a new module called \"nworm.\" Infections caused through nworm leave no\nartifacts on an infected DC, and they disappear after a reboot or shutdown.\n\nOther key differences of the new nworm module include:\n\n\n-----\n\nIt retrieves an encrypted, or otherwise encoded binary, over network traffic that\nrepresents a TrickBot executable file (the old mworm module sent it as an\nexecutable file without any sort of encryption/encoding).\nA TrickBot infection caused by the new mworm module is run from system RAM\nand does not appear to remain persistent on an infected host.\nThis is a much better method of evading detection on an infected DC.\n\nTrickBot is a significant threat that has received high-profile coverage in recent years, and\nthis is a notable evolution. This blog reviews TrickBot modules, and it covers characteristics\nof the new nworm module in greater detail.\n\n**TrickBot Modules**\n\nTrickBot is modular, meaning it uses various binaries to perform different functions during an\ninfection. In most cases, the basis of a TrickBot infection is a malicious Windows executable\n(EXE) file saved to disk. This EXE is often called a \"TrickBot loader\" because it loads the\nTrickBot modules. TrickBot modules are dynamic link libraries (DLLs) or EXEs run from\nsystem memory. See Figure 1 for a visualization of TrickBot modules.\n\nFigure\n\n1. A visual representation of TrickBot and its modules.\nOn an infected Windows 10 host, TrickBot modules are only found in system memory. But on\nan infected Windows 7 host, we also see artifacts related to the modules stored on the disk.\nThese artifacts are encrypted binaries. During a TrickBot infection, these encrypted binaries\nare decrypted and run from system memory as TrickBot modules. Figure 2 shows an\nexample of artifacts for TrickBot modules from an infection on a Windows 7 client in January\n2020.\n\n\n-----\n\nFigure\n\n2. Example of artifacts for TrickBot modules on an infected Windows 7 client.\nAs seen in Figure 2, the artifact names end with 64, meaning this host is running a 64-bit\nversion of Windows 7. If the infection happens on a 32-bit Windows 7 host, these artifact\nnames would end in 32 instead of 64.\n\nFigure 2 also reveals three modules TrickBot uses to spread to a DC in an Active Directory\n(AD) environment. They are:\n\nmwormDll64 (the \"mworm\" module)\nmshareDll64 (the \"mshare\" module)\ntabDll64 (the \"tab\" module)\n\n[Note: The tab module has a propagation function, but it also includes different capabilities](https://www.zdnet.com/article/old-trickbot-trojan-taught-new-tricks/)\nnot applicable to this blog.\n\n**Modules for Propagation**\n\n[Starting in September 2019, TrickBot modules with propagation capabilities have been](https://www.malware-traffic-analysis.net/2019/09/25/index2.html)\nmworm, mshare, and tab. They generate distinct activity when propagating to a vulnerable\nDC.\n\nFor the mshare and tab modules:\n\nAn infected Windows client retrieves a new TrickBot EXE using an HTTP URL.\nThe infected Windows client sends this new TrickBot EXE over SMB traffic to the\nvulnerable DC.\n\nFor the mworm module:\n\n\n-----\n\nThe infected Windows client uses an SMB exploit targeting the vulnerable DC.\nThe vulnerable DC retrieves a new TrickBot EXE using an HTTP URL and infects\nitself with it.\n\nOf note, the mworm module did not usually appear unless the TrickBot infection happened in\nan AD environment with a DC.\n\nFigure 3 shows a flow chart of propagation traffic caused by these three TrickBot modules.\n\nFigure\n\n3. TrickBot propagation flow chart from September 2019 through March 2020.\n[Since February 2020, URLs generated by these modules to retrieve follow-up TrickBot EXE](https://twitter.com/malware_traffic/status/1232782901927972865)\nfiles used the following patterns:\n\nURL generated by mshare module ends with /images/cursor.png\nURL generated by mworm module ends with /images/redcar.png\nURL generated by tab module ends with /images/imgpaper.png\n\nThese URLs use IP addresses instead of domains. Figure 4 shows an example of the traffic\n[filtered in Wireshark from a pcap of a TrickBot infection in March 2020.](https://www.malware-traffic-analysis.net/2020/03/04/index.html)\n\n\n-----\n\nFigure\n\n4. HTTP GET requests caused by TrickBot’s mshare, mworm and tab modules.\n\n**Goodbye Mworm: Hello Nworm**\n\n[In April 2020 while generating a TrickBot infection in a lab environment, TrickBot stopped](https://www.malware-traffic-analysis.net/2020/04/20/index2.html)\nusing the mworm module. In its place, a new artifact named \"nworm\" appeared on an\ninfected Windows 7 client. Figure 5 shows an example of this new nworm artifact.\n\nFigure\n\n5. New nworm module found from an infection on April 24, 2020.\nHTTP traffic for follow-up TrickBot EXEs caused by nworm is noticeably different than traffic\ncaused by mworm. The differences are:\n\nmworm: URL for TrickBot EXE ends with /images/redcar.png\nnworm: URL for TrickBot EXE ends with /ico/VidT6cErs\n\nmworm: Follow-up TrickBot EXE is returned unencrypted in the HTTP traffic\nnworm: Follow-up TrickBot EXE is returned as an encrypted or otherwise\nencoded binary in the HTTP traffic\n\n\n-----\n\nBy using Wireshark and examining TCP streams, we can easily spot the differences in HTTP\ntraffic caused by the old mworm module and the new nworm module. Figure 6 shows traffic\n[from the mworm module in March 2020, and Figure 7 shows traffic from the nworm module](https://www.malware-traffic-analysis.net/2020/03/04/index.html)\n[in April 2020.](https://www.malware-traffic-analysis.net/2020/04/20/index2.html)\n\nFigure\n\n6. TCP stream showing HTTP traffic caused by the mworm module in March 2020.\n\n\n-----\n\nFigure\n\n7. TCP stream showing HTTP traffic caused by the nworm module April 2020.\nFigure 8 shows the current propagation flowchart, highlighting changes seen with the nworm\nmodule since April 2020.\n\nFigure\n\n8. TrickBot propagation flow chart since April 2020.\n\n\n-----\n\nLike mworm, the new nworm module does not appear unless the TrickBot infection happens\nin an AD environment with a DC.\n\n**TrickBot Caused By Nworm: Not Persistent**\n\nWhen nworm infects a vulnerable DC, the malware is run from memory. No artifacts are\nfound on the infected DC and TrickBot on the DC doesn’t survive a reboot.\n\nIn cases where mshare and tab infect a vulnerable DC with TrickBot, these infections remain\npersistent on the DC, but TrickBot caused by nworm is not persistent. This shouldn’t be an\nissue for the malware, because the DC is a server and servers rarely shut down or reboot\nlike a Windows client.\n\n**Post-Infection Gtag from TrickBot Caused By Nworm**\n\nEvery TrickBot binary has an identifier called a gtag. This is found in configuration data\nextracted from a TrickBot binary. Gtags can also be found in HTTP traffic during a TrickBot\ninfection. They indicate the specific campaign or source of infection used for a TrickBot\nbinary.\n\nThe gtag is a short alphabetic string followed by a number representing a one-up\nserialization. Examples follow:\n\nmor-series gtag: TrickBot caused by an Emotet infection, for example: TrickBot\n[gtag mor84 caused by Emotet on January 27th, 2020.](https://isc.sans.edu/forums/diary/Emotet+epoch+1+infection+with+Trickbot+gtag+mor84/25752/)\nono-series gtag: various TrickBot infections initiated through malicious Microsoft\nOffice documents like Word documents or Excel spreadsheets, distributed\nthrough English-language emails.\nred-series gtag: TrickBot distributed as a DLL file instead of an EXE, for example:\n[TrickBot gtag red5 documented on March 17th, 2020.](https://isc.sans.edu/forums/diary/Trickbot+gtag+red5+distributed+as+a+DLL+file/25918/)\n\nGtags for TrickBot binaries used by TrickBot modules are unique. They break out as:\n\ntot-series gtag: TrickBot binaries used by mshare module\njim-series gtag: TrickBot binaries used by nworm (and the old mworm) module\nlib-series gtag: TrickBot binaries used by tab module\n\nFigure 9 and Figure 10 show gtags from traffic filtered in Wireshark from an infection on April\n20th, 2020. In these images, the Windows client is at 10.4.20.101, and the DC is at\n10.4.20.4.\n\n\n-----\n\nFigure\n\n9. The initial TrickBot infection, where HTTP traffic from an infected client at 10.4.20.101\nshows gtag ono38.\n\nFigure\n\n10. TrickBot spreads to the DC where we see gtag jim716 from an infection caused by the\nnworm module.\n\n## Conclusion\n\nAn infection caused by nworm is run from system memory, leaves no artifacts on an infected\nDC and disappears after a reboot or shutdown. Furthermore, the TrickBot binary used by\nnworm is encrypted or otherwise encoded when it is retrieved over the Internet. These\ncharacteristics are likely an attempt by TrickBot developers to avoid detection.\n\nThis is the latest in a series of changes in TrickBot as it evolves within our current threat\nlandscape.\n\n\n-----\n\nHowever, best security practices like running fully-patched and up-to-date versions of\nMicrosoft Windows will hinder or prevent TrickBot infections. Palo Alto Networks customers\n[are further protected from TrickBot by our threat prevention platform. AutoFocus users can](https://www.paloaltonetworks.com/cortex/autofocus)\ntrack TrickBot activity by using the [TrickBot tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.TrickBot)\n\n**Indicators of Compromise**\n\n**Recent HTTP URLs for TrickBot binaries for propagation to vulnerable DC**\n\n(Read: First seen YYYY-MM-DD - module name - URL)\n\n2020-04-20 - nworm - hxxp://107.172.221[.]106/ico/VidT6cErs\n\n2020-04-20 - mshare - hxxp://107.172.221[.]106/images/cursor.png\n\n2020-04-20 - tab - hxxp://107.172.221[.]106/images/imgpaper.png\n\n2020-05-08 - nworm - hxxp://23.95.227[.]159/ico/VidT6cErs\n\n2020-05-08 - mshare - hxxp://23.95.227[.]159/images/cursor.png\n\n2020-05-08 - tab - hxxp://23.95.227[.]159/images/imgpaper.png\n\n**SHA256 hash for nwormDll64 artifact (encrypted binary) from an infected Windows 7 client on**\n**April 24th 2020:**\n\n900aa025bf770102428350e584e8110342a70159ef2f92a9bfd651c5d8e5f76b\n\n**SHA256 hash for nwormDll64 artifact (encrypted binary) from an infected Windows 7 client on May**\n**8th 2020:**\n\n85d88129eab948d44bb9999774869449ab671b4d1df3c593731102592ce93a70\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-28 - Goodbye Mworm, Hello Nworm- TrickBot Updates Propagation Module.pdf"
    ],
    "report_names": [
        "2020-05-28 - Goodbye Mworm, Hello Nworm- TrickBot Updates Propagation Module.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535891,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653697286,
    "ts_modification_date": 1653697286,
    "files": {
        "pdf": "https://archive.orkl.eu/0d853fab3222ba2aa19f2bb1b0ddc5470e733b8f.pdf",
        "text": "https://archive.orkl.eu/0d853fab3222ba2aa19f2bb1b0ddc5470e733b8f.txt",
        "img": "https://archive.orkl.eu/0d853fab3222ba2aa19f2bb1b0ddc5470e733b8f.jpg"
    }
}