{
    "id": "d612047a-29a5-4452-b91d-82fe2a4d6456",
    "created_at": "2023-01-12T15:05:06.924425Z",
    "updated_at": "2025-03-27T02:05:37.898118Z",
    "deleted_at": null,
    "sha1_hash": "d552e124aa0916a93375eb937c5a379635c7600d",
    "title": "2021-02-04 - Blockchain Analysis Shows Connections Between Four of 2020’s Biggest Ransomware Strains",
    "authors": "",
    "file_creation_date": "2022-05-28T23:08:56Z",
    "file_modification_date": "2022-05-28T23:08:56Z",
    "file_size": 812270,
    "plain_text": "# Blockchain Analysis Shows Connections Between Four of 2020’s Biggest Ransomware Strains\n\n**[blog.chainalysis.com/reports/ransomware-connections-maze-egregor-suncrypt-doppelpaymer](https://blog.chainalysis.com/reports/ransomware-connections-maze-egregor-suncrypt-doppelpaymer)**\n\nChainalysis Team February 4, 2021\n\n**_This blog is an excerpt from the Chainalysis 2021 Crypto Crime Report._** **_[Click here to](https://go.chainalysis.com/2021-Crypto-Crime-Report.html)_**\n**_download the whole thing!_**\n\n[As we’ve covered on our blog, there may be fewer cybercriminals responsible for](https://blog.chainalysis.com/reports/ransomware-ecosystem-crypto-crime-2021)\nransomware attacks than one would initially think given the number of individual attacks,\ndistinct strains, and amount stolen from victims. Cybersecurity researchers point out that\nmany RaaS affiliates carrying out attacks switch between different strains, and many believe\nthat seemingly distinct strains are actually controlled by the same people. Using blockchain\nanalysis, we’ll investigate potential connections between four of 2020’s most prominent\nransomware strains: Maze, Egregor, SunCrypt, and Doppelpaymer.\n\nThe four ransomware strains were quite active last year, attacking prominent companies\nsuch as [Barnes & Noble,](https://www.bleepingcomputer.com/news/security/barnes-and-noble-hit-by-egregor-ransomware-strange-data-leaked/) [LG,](https://searchsecurity.techtarget.com/news/252485287/Maze-ransomware-hit-biggest-target-yet-with-LG-breach) [Pemex, and](https://www.bleepingcomputer.com/news/security/mexicos-pemex-oil-suffers-ransomware-attack-49-million-demanded/) [University Hospital New Jersey, amongst others.](https://www.bleepingcomputer.com/news/security/university-hospital-new-jersey-hit-by-suncrypt-ransomware-data-leaked/)\nAll four use the RaaS model, meaning that affiliates carry out the ransomware attacks\nthemselves and pay a percentage of each victim payment back to the strain’s creators and\n\n\n-----\n\n[administrators. All four also use the double extortion strategy of not just withholding victims](https://www.infosecurity-magazine.com/blogs/double-extortion-ransomware/)\ndata, but also publishing pieces of it online as an extra incentive for victims to pay the\nransom.\n\nBelow, we see the four strains’ revenue since late 2019 broken out quarterly.\n\nNote that Egregor only became active just before Q4 2020 (mid-September to be specific),\nsoon after the Maze strain became inactive. Some cybersecurity researchers see this as\nevidence that Maze and Egregor are linked in some way. In early November, Maze’s\noperators said the strain was shutting down in a press release posted to its website,\nfollowing a slowdown in activity. Soon after, [most of its affiliates migrated to Egregor, leading](https://www.bleepingcomputer.com/news/security/maze-ransomware-is-shutting-down-its-cybercrime-operation/)\nsome to believe that the Maze operators have simply rebranded as Egregor and instructed\nthe affiliates to join. This is relatively common in ransomware, though it’s also possible that\nthe affiliates have decided for themselves that Egregor is their best option. It’s even possible\nthat the Maze affiliates became unhappy with the Maze operators, leading to the split.\nHowever, as [noted by Bleeping Computer, Maze and Egregor share much of the same code,](https://www.bleepingcomputer.com/news/security/maze-ransomware-is-shutting-down-its-cybercrime-operation/)\nthe same ransom note, and have very similar victim payment sites. Cybersecurity firm\n[Recorded Future notes this too, as well as similarities between Egregor and a banking trojan](https://www.recordedfuture.com/egregor-ransomware-attacks/)\ncalled QakBot.\n\nIt’s not just Egregor either. In another story, [Bleeping Computer claims that Suncrypt](https://www.bleepingcomputer.com/news/security/suncrypt-ransomware-sheds-light-on-the-maze-ransomware-cartel/#:~:text=SunCrypt%20data%20leak%20site,-At%20this%20time&text=Other%20ransomware%20operations%20that%20run,Sekhmet%2C%20Snatch%2C%20and%20Snake.)\nrepresentatives contacted them claiming to be part of the “Maze ransomware cartel” prior to\nMaze’s shutdown announcement, though Maze has denied this. However, the claim of a\nconnection is also supported by a privately circulated report from threat intelligence firm\n[Intel471 claiming that representatives from SunCrypt described their strain as a “rewritten](https://intel471.com/)\nand rebranded version of a ‘well-known’ ransomware strain.” Intel471’s report also claims\nthat SunCrypt only works with a small number of affiliates at a time, whom the SunCrypt\n\n\n-----\n\noperators interview and vet extensively. Therefore, we believe any overlap in affiliates\nbetween SunCrypt and other ransomware strains would be more likely to suggest a deeper\nconnection between the two strains, rather than just coincidence.\n\n## Blockchain analysis suggests affiliate overlap and other possible connections between Maze, Egregor, SunCrypt, and Doppelpaymer\n\nAs we outline above, there’s circumstantial evidence suggesting links between some of\nthese four strains, as well as reports of affiliate migration. But what links do we see on the\nblockchain? Let’s start with Maze and SunCrypt.\n\nThe [Chainalysis Reactor graph above provides strong evidence suggesting that a Maze](https://www.chainalysis.com/chainalysis-reactor/)\nransomware affiliate is also an affiliate for SunCrypt. Starting at the bottom of the graph, we\nsee how Maze distributes funds taken in ransomware attacks. First, the majority of each\nsuccessful ransom payment goes to the affiliate, as they’re taking on the risk of actually\ncarrying out the ransomware attack. The next biggest cut goes to a third party. While we\ncan’t know for sure what that third party’s role is, we believe it’s likely an ancillary service\nprovider who helps Maze pull off attacks. Ransomware attackers often rely on third parties\n\n\n-----\n\nfor tools like bulletproof hosting, penetration testing services, or access to vulnerabilities in\nvictims’ networks. These ancillary service providers can be found peddling their wares on\ncybercriminal darknet forums, but aren’t necessarily involved in all ransomware attacks.\nFinally, the smallest cut of each ransom payment goes to another wallet that we believe\nbelongs to the strain’s administrators.\n\nIn this case, however, we see that the Maze affiliate also sent funds — roughly 9.55 Bitcoin\nworth over $90,000 — via an intermediary wallet to an address labeled “Suspected\nSunCrypt admin,” which we’ve identified as part of a wallet that has consolidated funds\nrelated to a few different SunCrypt attacks. This suggests that the Maze affiliate is also an\naffiliate for SunCrypt, or possibly involved with SunCrypt in another way.\n\nAnother Reactor graph shows links between the Egregor and Doppelpaymer ransomware\nstrains.\n\nIn this case, we see that an Egregor wallet sent roughly 78.9 BTC worth approximately\n$850,000 to a suspected Doppelpaymer administrator wallet. Though we can’t know for sure,\nwe believe that this is another example of affiliate overlap. Our hypothesis is that the\nEgregor-labeled wallet is an affiliate for both strains sending funds to the Doppelpaymer\nadministrators.\n\nFinally, the Reactor graph below shows what we believe is an instance of Maze and Egregor\nadministrators using the same money laundering infrastructure.\n\n\n-----\n\nBoth strains’ victim payments’ wallets have sent funds to two deposit addresses at a\nprominent cryptocurrency exchange via intermediary wallets. Based on their transaction\npatterns, we believe that both deposit addresses belong to over-the-counter (OTC) brokers\n[who specialize in helping ransomware operators and other cybercriminals trade illicitly-](https://blog.chainalysis.com/reports/money-laundering-cryptocurrency-2019)\ngained cryptocurrency for cash. In the case of Maze, those funds first flow through another\nsuspected money laundering service before reaching the OTC addresses — it’s unclear\nwhether Maze receives cash from that service or from the OTCs themselves, and it’s also\npossible that the OTC broker and those running the laundering service are one in the same.\n\nWhile this doesn’t suggest that Maze and Egregor share the same administrators or affiliates,\nit’s still an important potential lead for law enforcement. Cryptocurrency-related crime isn’t\nworthwhile if there’s no way to convert ill-gotten funds into cash. By going after bad actors\nlike the money laundering service or corrupt OTC brokers on the graph above — the latter of\nwhom, again, operate on a large, well-known exchange — law enforcement could\nsignificantly hamper the ability of Maze and Egregor to operate profitably without actually\ncatching the strains’ administrators or affiliates. It’s not just those specific ransomware strains\neither.\n\n\n-----\n\nThe suspected laundering service has also received funds from the Doppelpaymer,\nWastedLocker, and Netwalker ransomware strains, taking in nearly $2.9 million worth of\ncryptocurrency from the category as a whole. Likewise, it’s received nearly $650,000 worth of\ncryptocurrency from darknet markets such as Hydra and FEShop. The two OTC broker\naddresses on the graph have similar criminal exposure as well.\n\n## What does this mean for ransomware?\n\nWhile we can’t say for sure that Maze, Egregor, SunCrypt, or Doppelpaymer have the same\nadministrators, we can say with relative certainty that some of them have affiliates in\ncommon. We also know that Maze and Egregor rely on the same OTC brokers to convert\ncryptocurrency into cash, though they interact with those brokers in different ways.\n\nRegardless of the exact depth and nature of these connections, the evidence suggests that\nthe ransomware world is smaller than one may initially think given the number of unique\nstrains currently operating. This information can be a force multiplier for law enforcement. If\nthey can identify and act against groups controlling multiple ransomware strains, or against\nOTCs enabling multiple ransomware strains to cash out their earnings, then they’ll be able to\nhalt or impact the operations of several strains with one takedown.\n\n**_This blog is an excerpt from the Chainalysis 2021 Crypto Crime Report._** **_[Click here to](https://go.chainalysis.com/2021-Crypto-Crime-Report.html)_**\n**_download the whole thing!_**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-04 - Blockchain Analysis Shows Connections Between Four of 2020’s Biggest Ransomware Strains.pdf"
    ],
    "report_names": [
        "2021-02-04 - Blockchain Analysis Shows Connections Between Four of 2020’s Biggest Ransomware Strains.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535906,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653779336,
    "ts_modification_date": 1653779336,
    "files": {
        "pdf": "https://archive.orkl.eu/d552e124aa0916a93375eb937c5a379635c7600d.pdf",
        "text": "https://archive.orkl.eu/d552e124aa0916a93375eb937c5a379635c7600d.txt",
        "img": "https://archive.orkl.eu/d552e124aa0916a93375eb937c5a379635c7600d.jpg"
    }
}