{
    "id": "d6448bdf-313d-40f8-9c34-0d24860815b9",
    "created_at": "2023-01-12T15:09:54.594787Z",
    "updated_at": "2025-03-27T02:05:36.805606Z",
    "deleted_at": null,
    "sha1_hash": "90ac9532125e1f75b536b3d8ec719245cceb9aa8",
    "title": "2021-02-16 - TAG Bulletin- Q1 2021",
    "authors": "",
    "file_creation_date": "2022-05-28T02:48:12Z",
    "file_modification_date": "2022-05-28T02:48:12Z",
    "file_size": 110985,
    "plain_text": "# TAG Bulletin: Q1 2021\n\n**blog.google/threat-analysis-group/tag-bulletin-q1-2021/**\n\nShane Huntley April 20, 2021\n\nThis bulletin includes coordinated influence operation campaigns terminated on our platforms\nin Q1 2021. It was last updated on April 20, 2021.\n\n## January\n\n\n-----\n\nWe terminated 4 YouTube channels and 1 advertising account as part of our ongoing\ninvestigation into coordinated influence operations linked to Ukraine. This campaign\nuploaded content in Russian pertaining to current events in Kazakhstan and critical of\nEuropean Union policies toward Moldova.\n\nWe terminated 5 blogs as part of our investigation into coordinated influence operations\nlinked to Morocco. This campaign uploaded content in Arabic that was critical of the\nAlgerian government. This campaign was consistent with similar findings reported by\nFacebook.\n\nWe terminated 5 YouTube channels as part of our investigation into coordinated\ninfluence operations linked to Brazil. This campaign was linked to a PR firm named AP\nExata Intelligence and uploaded content in Portuguese expressing support for several\nmayoral candidates in Brazil. This campaign was consistent with similar findings\nreported by Facebook.\n\nWe terminated 6 YouTube channels as part of our investigation into coordinated\ninfluence operations linked to Kyrgyzstan. The campaign uploaded content in Kyrgyz\ncritical of the former President Almazbek Atambayev and the opposition leader\nAdakhan Madumarov. This campaign was consistent with similar findings reported by\nFacebook.\n\nWe terminated 3 advertising accounts as part of our investigation into coordinated\ninfluence operations linked to Egypt. This campaign was linked to a PR firm named\nMubashier and uploaded content in Arabic supportive of the Russian government\nacross several countries in the Middle East.\n\nWe terminated 1 YouTube channel as part of our ongoing investigation into coordinated\ninfluence operations linked to Russia. This campaign uploaded content in Russian on\ncurrent events in Ukraine.\n\nWe terminated 1 YouTube channel, 2 advertising accounts and 1 mobile developer\naccount as part of our ongoing investigation into coordinated influence operations\nlinked to Russia. This campaign uploaded content in Russian on such topics as the\nU.S. election and the poisoning of Alexei Navalny.\n\nWe terminated 5 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Russia. This campaign uploaded content in\nRussian on such topics as the annexation of Crimea and the Syrian civil war.\n\nWe terminated 2 YouTube channels and 1 advertising account as part of our ongoing\ninvestigation into coordinated influence operations linked to Russia. This campaign\nuploaded content in Russian on historical events in Afghanistan, Armenia and Ukraine.\n\n\n-----\n\nWe terminated 2 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Russia. This campaign uploaded content in\nRussian on such topics as the U.S. current events and Alexei Navalny political rallies.\n\nWe terminated 3 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Iran. This campaign uploaded content in\nEnglish and was amplifying narratives on regional topics such as Israel, the Nagorno\nKarabakh conflict, and the war in Yemen. We received leads from FireEye that\nsupported us in this investigation.\n\nWe terminated 2,946 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to China. These channels mostly uploaded\nspammy content in Chinese about music, entertainment, and lifestyle. A very small\nsubset uploaded content in Chinese and English about the U.S. response to COVID-19\nand growing U.S. political divisions. We received leads from Graphika that supported\nus in this investigation. These findings are consistent with our previous reports in the\n[Q3 and](https://blog.google/threat-analysis-group/tag-bulletin-q3-2020/) [Q4 TAG bulletins.](https://blog.google/threat-analysis-group/tag-bulletin-q4-2020/)\n\n## February\n\nWe terminated 5 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Iran. This campaign uploaded content in\nEnglish, Farsi, and Bahasa Indonesian on several topics including criticism of Israel\nand the U.S. election. This campaign was consistent with similar findings reported by\nTwitter.\n\nWe terminated 5 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Russia. This campaign uploaded content in\nRussian specific to narratives around the Russian military. This campaign was\nconsistent with similar findings reported by Twitter.\n\nWe terminated 938 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to China. These channels mostly uploaded\nspammy content in Chinese about music, entertainment, and lifestyle. A very small\nsubset uploaded content in Chinese and English about the U.S. COVID-19 vaccine\nrollout and current events. We received leads from FireEye and Graphika that\nsupported us in this investigation. These findings are consistent with our previous\n[reports in the Q3 and](https://blog.google/threat-analysis-group/tag-bulletin-q3-2020/) [Q4 TAG bulletins.](https://blog.google/threat-analysis-group/tag-bulletin-q4-2020/)\n\n## March\n\n\n-----\n\nWe terminated 13 YouTube channels as part of our investigation into coordinated\ninfluence operations linked to Morocco. This campaign uploaded content in Arabic that\nwas supportive of Morocco’s government and discussed issues related to regional\nintelligence agencies as well as Moroccan ownership of the Western Sahara region.\nThis campaign was consistent with similar findings reported by Facebook.\n\nWe terminated 3 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Russia. This campaign uploaded content in\nRussian, French, German, English and Spanish about the conflict in Syria, historical\nfootage of the war in Afghanistan, and the civil war in Eastern Ukraine.\n\nWe terminated 34 YouTube channels as part of our ongoing investigation into\ncoordinated influence operations linked to Russia. This campaign uploaded content in\nRussian that was critical of the protests in support of Alexei Navalny.\n\nWe terminated 33 YouTube channels and 2 advertising accounts as part of our ongoing\ninvestigation into coordinated influence operations linked to Myanmar. This campaign\nuploaded content in Burmese about the military coup in Myanmar.\n\nWe terminated 682 YouTube channels and 2 advertising accounts as part of our\nongoing investigation into coordinated influence operations linked to China. These\nchannels mostly uploaded spammy content in Chinese about music, entertainment,\nand lifestyle. A very small subset uploaded content in Chinese and English about\nChina’s COVID-19 vaccine efforts and social issues in the U.S. These findings are\n[consistent with our previous reports in the Q3 and](https://blog.google/threat-analysis-group/tag-bulletin-q3-2020/) [Q4 TAG bulletins.](https://blog.google/threat-analysis-group/tag-bulletin-q4-2020/)\n\nPOSTED IN:\n\n[Threat Analysis Group](https://blog.google/threat-analysis-group/%20)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-16 - TAG Bulletin- Q1 2021.pdf"
    ],
    "report_names": [
        "2021-02-16 - TAG Bulletin- Q1 2021.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536194,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653706092,
    "ts_modification_date": 1653706092,
    "files": {
        "pdf": "https://archive.orkl.eu/90ac9532125e1f75b536b3d8ec719245cceb9aa8.pdf",
        "text": "https://archive.orkl.eu/90ac9532125e1f75b536b3d8ec719245cceb9aa8.txt",
        "img": "https://archive.orkl.eu/90ac9532125e1f75b536b3d8ec719245cceb9aa8.jpg"
    }
}