{
    "id": "d661b7b8-cc6f-4cd9-bfe0-ec63167de4c8",
    "created_at": "2022-10-25T16:48:11.335982Z",
    "updated_at": "2025-03-27T02:17:05.692778Z",
    "deleted_at": null,
    "sha1_hash": "dafed0f2a46c513004287c96588d3be3b7ae513a",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-12-11T16:26:43Z",
    "file_modification_date": "2017-12-11T16:26:43Z",
    "file_size": 1157290,
    "plain_text": "## Untangling the Patchwork Cyberespionage GroupTechnical BriefTrendLabs Security Intelligence BlogDaniel Lunghi, Jaromir Horejsi, and Cedric PernetCyber Safety Solutions TeamDecember2017\n\n\n-----\n\n# Table of Contents\n\nInfection Vectors ........................................................................................................................................... 2\n\nSpear-phishing Emails ............................................................................................................................................... 2\n\nWebsite Redirects ..................................................................................................................................................... 2\n\nDirect Links ................................................................................................................................................................ 3\n\nMalicious Attachments .............................................................................................................................................. 3\n\nMail Sending Method ................................................................................................................................................ 3\n\nDrive-by Download .................................................................................................................................................... 3\n\nPhishing ..................................................................................................................................................................... 3\n\nSocial Engineering and Weaponized Documents......................................................................................... 7\n\nDownloaders ............................................................................................................................................... 10\n\nSimple Downloaders ................................................................................................................................................ 10\n\nDDE Downloader ..................................................................................................................................................... 12\n\nPayloads...................................................................................................................................................... 12\n\nxRAT ........................................................................................................................................................................ 12\n\nNDiskMonitor ........................................................................................................................................................... 13\n\nSocksbot ................................................................................................................................................................. 14\n\nBadnews Backdoor ................................................................................................................................................. 16\n\nFile Stealers ................................................................................................................................................. 19\n\nTaskhost Stealer ...................................................................................................................................................... 19\n\nWintel Stealer .......................................................................................................................................................... 23\n\nAutoIt Stealer ........................................................................................................................................................... 24\n\nInfrastructure ............................................................................................................................................... 25\n\nPractice Defense in Depth .......................................................................................................................... 26\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information and educational purposes only. It is not intended and should not be construed to constitute legal\nadvice. The information contained herein may not be applicable to all situations and may not reflect the most current situation. Nothing contained herein should\nbe relied on or acted upon without the benefit of legal advice based on the particular facts and circumstances presented and nothing herein should be construed\notherwise. Trend Micro reserves the right to modify the contents of this document at any time without prior notice.\n\nTranslations of any material into other languages are intended solely as a convenience. Translation accuracy is not guaranteed nor implied. If any questions arise\nrelated to the accuracy of a translation, please refer to the original language official version of the document. Any discrepancies or differences created in the\ntranslation are not binding and have no legal effect for compliance or enforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include accurate and up-to-date information herein, Trend Micro makes no warranties or representations of any\nkind as to its accuracy, currency, or completeness. You agree that access to and use of and reliance on this document and the content thereof is at your own\nrisk. Trend Micro disclaims all warranties of any kind, express or implied. Neither Trend Micro nor any party involved in creating, producing, or delivering this\ndocument shall be liable for any consequence, loss, or damage, including direct, indirect, special, consequential, loss of business profits, or special damages,\nwhatsoever arising out of access to, use of, or inability to use, or in connection with the use of this document, or any errors or omissions in the content thereof.\nUse of this information constitutes acceptance for use in an “as is” condition.\n\n\n-----\n\n[Patchwork](https://www.csoonline.com/article/3100381/cyber-attacks-espionage/cyberespionage-group-patchwork-sets-its-sights-on-multiple-industries.html) (also known as Dropping Elephant) is a cyberespionage group whose targets included\ndiplomatic and government agencies as well as businesses. Patchwork is known for rehashing off-therack tools and malware for its own campaigns. The group uses attack vectors that may not be\n[groundbreaking—what with other groups exploiting zero-days](https://www.trendmicro.com/vinfo/us/security/definition/zero-day-vulnerability) [or cunningly adjusting their tactics—but](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2017)\nas its moniker entails, its repertoire of infection vectors and payloads still makes them a credible threat.\n\nWe trailed Patchwork’s activities over the course of its campaigns in 2017. The diversity of their methods\nis notable—from the social engineering hooks, attack chains, and backdoors they deployed. They also\n[included Dynamic Data Exchange (DDE) and Windows Script Component](https://www.trendmicro.com/vinfo/us/security/news/threat-landscape/dde-what-it-is-what-it-does-and-how-to-defend-against-attackers-who-may-exploit-it) (SCT) abuse to their tactics, as\nwell as started exploiting recently reported vulnerabilities. These imply they’re at least keeping an eye on\nother threats and security flaws to repurpose for their own ends. Also of note are its attempts to be more\ncautious and efficient in their operations.\n\nThis technical brief provides deeper analyses of their campaigns—from the infection vectors and social\nengineering to the infrastructure and malware they used. The indicators of compromise are in this\n[appendix.](https://documents.trendmicro.com/assets/appendix-untangling-the-patchwork-cyberespionage-group.pdf)\n\nInfection VectorsSpear-phishing Emails\n\nSpear-phishing emails are their staple method for delivering malware. These socially engineered emails\ncontain web links of weaponized documents containing exploits or macros. We found Patchwork using\nthree variations of this method.\n\nWebsite Redirects\n\nPatchwork set up an English-language news site. The spoofed website looks exactly like the legitimate\nand original website. Inspection of the fake site’s HTML source code, however, reveals the addition of a\nsmall code snippet. It contains an additional meta tag at the end of the web page source code,\n“refreshing” (redirecting) the site visitor to the weaponized document.\n\nThe web page is not indexed in search engines. It can only be visited by clicking on the link contained in\nthe spear-phishing emails, helping it evade traditional security mechanisms compared to directly\nsending the link to the malicious document.\n\nFigure 1: The added code snippet that redirects its visitors to the malicious document\n\n\n-----\n\nWe also saw spear-phishing emails containing direct links to the weaponized documents hosted on\nservers they own. The group employs typosquatting to increase clicks. These servers were reached\nthrough domain names similar to legitimate websites, such as rannd[.]org instead of rand.org.\n\nMalicious Attachments\n\nThe malicious documents were also directly attached to the email. However, we didn’t see this method\nused as much, as the attachments can be detected by spam filters.\n\nMailSending Method\n\n[The spear-phishing emails were sometimes sent to victims by misusing YMLP](https://www.ymlp.com/) and serversecure.net,\nwhich are email/newsletter distribution services. Abusing these legitimate online services helps improve\ntheir emails’ chances of not being flagged as spam.\n\nMore recently, they’ve started sending emails using a Postfix server they operate. The domain name\n“servicelogin.center” was linked to this server. It had a proper MX record, an SSL certificate issued by\n[Let’s Encrypt, and the domain property validated on Google. Recently, the TXT SPF1 record of domains](https://letsencrypt.org/)\nhosting malicious documents has been updated to include “servicelogin.center”, probably to bypass\nspam filters.\n\nDrive-by Download\n\n[The attackers also reportedly used a fake Youku Tudou website (a video platform similar to YouTube](https://www.hksilicon.com/articles/1441630)\nvery popular in China). It entices users to download a fake Adobe Flash player update, which turned out\nto be a variant of the xRAT malware.\n\nPhishing\n\nThe group also employs phishing to harvest their targets’ credentials to access email accounts and other\nonline services.\n\nWe took a closer look at a phishing kit hosted on Patchwork’s infrastructure. Opening one of the\nsuspicious domains, hxxps://accounts[-]login[-]secure[.]163[.]com[.]neteease[.]com, in a web browser\nreturns an “account suspended” message, which they’ve copied from a web development company.\n\n\n-----\n\nFigure 2: One of the domains of Patchwork’s phishing kit whose appearance\n\nwas copied from a web development company\n\nA closer look reveals that the phishing kit expects a few parameters. The kit, which spoofs a legitimate\nweb portal and email service, consists of two PHP files: main.php, which has the initial webpage; and\nerror.php, which harvests and processes entered credentials.\n\nFigure 3: The PHP file that processes entered credentials\n\n\n-----\n\nmain.php expects the following commands with base64-encoded values (seen on the screenshot\nabove):\n\nu = user (encoded username, the victim cannot change it on the web form)\n\nr = referrer (hxxp://mial[.]163[.]com was used as referrer; the use of “mial” instead of “mail” is noted)\n\nd = domain (163 or 126 or yeah or shouji)\n\nThe domain has one of the four possible values:\n\nMTYz is 163\n\nMTI2 is 126\n\neWVhaA== is yeah\n\nc2hvdWpp is shouji (which means mobile phone in Chinese)\n\nAs of November 24, 2017, we found three different phishing websites using a valid SSL certificate issued\nby Let’s Encrypt for three months. Some of them used the new TLD “.support”. The SSL certificates\nlisted the following domain names:\n\n  - accounts[-]login[-]secure[-]163 [-]com[-]neteease.com\n\n  - accounts[-]login[-]secure[-]qq[-]com[-]neteease.com\n\n  - accounts[-]login[-]vip[-]sina[-]com[-]neteease[-]com\n\n  - neteease[.]com\n\n  - accounts[.]login[.]yahoomail[.]support\n\n  - yahoomail[.]support\n\n  - accounts[.]login[.]googlemail[.]support\n\n\n-----\n\nFigure 4: Page information properties of one of the phishing websites\n\nThe parameters sent to the error.php script that attackers collect are username, domain, password and\nredirector values.\n\nFigure 5: Parameters sent to the error.php script\n\nGiven how the phishing kit works, the attackers seem cautious. The phishing page can only be obtained\nby sending specific arguments to the PHP script. Any other way will lead to the fake suspended account\npage. The link leading to the phishing page can only be found on the emails sent to the victims.\n\n\n-----\n\nMany of the documents were found in a directory accidentally left open. The group uses sociopolitical\nthemes as social engineering hooks. Those with the .doc extension are actually Rich Text format (RTF)\n[files that trigger an exploit for CVE-2012-1856, patched via MS12-060](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/vulnerability/2583/mscomctlocx-rce-vulnerability-cve20121856) last August 2012. It is a remote\ncode execution (RCE) vulnerability in the Windows common control MSCOMCTL, an ActiveX Control\nmodule. These files drop variants of the NDiskMonitor backdoor. The PowerPoint Open XML Slide Show\n[(PPSX) files exploit Sandworm (CVE-2014-4114), an RCE vulnerability in Windows’ Object Linking and](http://blog.trendmicro.com/trendlabs-security-intelligence/an-analysis-of-windows-zero-day-vulnerability-cve-2014-4114-aka-sandworm/)\nEmbedding (OLE) feature patched last October 2014.\n\nFigure 6: The directory containing the documents\n\nThe PowerPoint (PPT) file exploits [CVE-2017-0199, an RCE vulnerability in Microsoft Office’s Windows](http://blog.trendmicro.com/trendlabs-security-intelligence/cve-2017-0199-new-malware-abuses-powerpoint-slide-show/)\nOLE, patched last April 2017. Once the victim clicks “Enable Editing”, the file will attempt to download\nan .HTA file and silently exploits it by leveraging CVE-2017-0199.\n\nFigure 7: The PPT containing the CVE-2017-0199 exploit\n\n\n-----\n\nFigure 8: Code snapshot showing the PPT file downloading a malicious .HTA file\n\nWe also saw another document that comes with an executable instead of a macro. The file decodes and\nexecutes a Visual Basic script (VBS) that drops and executes a hybrid batch/.NET file, which then\ndownloads and executes the NDiskMonitor backdoor and a decoy document. The relatively long\ninfection chain can be construed as their way to obscure their activities.\n\nA document the group recently used had an additional step, likely done to avoid antivirus (AV) detection.\nA Word document embedded with a malicious PPSX file urges the victim to click on a fake PDF icon to\nopen the malicious document. It exploits [CVE-2017-8570](https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2017-8570) (an RCE vulnerability in Microsoft Office\npatched last July 2017) to download a Windows Script Component (SCT) file from a Patchwork-owned\nserver.\n\nFigure 9: Screenshot of the Word document containing a PPSX file that exploits CVE-2017-8570\n\n\n-----\n\nFigure 10: Code snippet showing the malicious SCT to be retrieved\n\nThe scriptlet .SCT file shown above contains PowerShell code. The payload downloads a malicious\nxRAT sample and a decoy PowerPoint presentation. It also recursively deletes Resiliency registry keys\ncreated by Microsoft Office applications (Word, Excel, PowerPoint, etc.). Some items in the Resiliency\nregistry key are created when the Office application does not terminate correctly, later displaying this\ninformation to the user. Deleting Resiliency keys will make the Office application think that everything\nwas correct and there were no problems during the latest application run. The latest step involves\nstarting PowerPoint, maximizing its window, and loading a decoy document while starting the payload in\nthe background. We also found other PPSX documents that exploited this vulnerability, but they were\nsent directly and not embedded in a DOCX file.\n\nWe also uncovered documents related to the Bangladesh Army and a United Nations Development\nProgramme in Sri Lanka. These documents contained malicious macros that deliver the xRAT remote\naccess tool, which lets attackers control the infected machine.\n\nThere were also other socially engineered documents that used government-related news and activities,\n[with subjects such as “Supply Chain Management” as lures. These are RTF files exploiting CVE-2015-](http://blog.trendmicro.com/trendlabs-security-intelligence/april-2015-patch-tuesday-issues-updates-to-microsoft-office/)\n[1641, a memory corruption vulnerability in Microsoft Office patched last April 2015. When executed, it](http://blog.trendmicro.com/trendlabs-security-intelligence/april-2015-patch-tuesday-issues-updates-to-microsoft-office/)\ndrops a signed java-rmi.exe executable from Java Runtime and two dynamic-link libraries (DLLs)—a\nclean msvcr71.dll and malicious jli.dll. The malicious DLL, which contains the Badnews backdoor, is\n[loaded and executed using the DLL side-loading technique.](https://attack.mitre.org/wiki/Technique/T1073)\n\n\n-----\n\nFigure 11: Screenshots of RTF files that exploit CVE-2015-1641 and deliver the Badnews backdoor\n\nDownloadersSimple Downloaders\n\n[We managed to acquire a few samples abusing a technique called self-compiled .NET hybrids. One text](http://www.dostips.com/forum/viewtopic.php?t=5260)\nfile contains both JavaScript code and batch code, which compiles the JavaScript code into executable\nfiles and later executes it.\n\nThe file starts with two lines, shown below. The first line must be a valid statement in both languages. If\nexecuted as a batch script, the first comparison (@X)==(@Y) is evaluated as False. Therefore @end is not\nexecuted. Each following line is then evaluated by a batch file interpreter until the “exit /b” command\ncauses the batch processing to terminate.\n\n\n-----\n\nFigure 12: Code snippet of samples using the self-compiled .NET hybrid\n\n[JavaScript, however, treats terms starting with @ as conditional compilation variables, evaluated as](http://www.javascriptkit.com/javatutors/conditionalcompile2.shtml)\nFalse, followed by a multiline comment. JavaScript, therefore, ignores all the code between /* and */,\nand only the code that follows */ is considered.\n\n[The compilation process is achieved by the following command, where %jsc% points to a JScript](https://msdn.microsoft.com/en-us/library/7435xtz6(v=vs.100).aspx)\ncompiler and %~dpsfnx0 is resolved to the name of the currently executed batch file (d means disc, p\nmeans path, f means file, x means extension; all are modifiers of a special %0 parameter).\n\nFigure 13: Command that facilitates the compilation process\n\nThe end of the batch script behind the */ comment is treated as source code. The code shown below\nmakes a simple command-line downloader with two parameters, URL, and file name.\n\nFigure 14: Snapshot showing the command-line downloader\n\nAfter compilation, the batch script uses the previously compiled simpledownloader.exe to download and\nexecute both the payload and decoy document.\n\n\n-----\n\nFigure 15: Snapshot showing the payload and decoy document being retrieved\n\nThe scvhost6.exe file is actually a variant of the NDiskMonitor backdoor, while the document.doc is a\ndecoy document, which is a legitimate sociopolitical essay.\n\nDDE Downloader\n\n[Patchwork also abused the Dynamic Data Exchange (DDE) protocol to deliver their malware. The internal](https://www.trendmicro.com/vinfo/us/security/nws/threat-landscape/dde-what-it-is-what-it-does-and-how-to-defend-against-attackers-who-may-exploit-it)\nstructure of a sample we analyzed, an Office Open XML file, is a ZIP archive that contains the\n“document.xml” file, which contains an embedded DDE payload.\n\nThe payload starts with a DDEAUTO string, followed by a command to be executed. The command can\n[be split into several fields by “w:instrText” or through the use of other methods. In the figure below, the](http://officeopenxml.com/WPfields.php)\nentire PowerShell command (displayed in black) is split into several chunks. When a victim opens the\ndocument and DDE is enabled on the machine, the PowerShell command downloads and displays the\ndecoy document then retrieves and executes xRAT.\n\nFigure 16: PowerShell command retrieving and executing xRAT\n\nPayloadsxRAT\n\nxRAT, renamed QuasarRAT in its latest versions, is a remote access tool whose source is publicly\navailable on Github. This availability allows anyone to easily clone the project and compile it. The project\nis actively maintained, with users reporting bugs and the developer fixing them and committing the\nrepaired files back to the Github repository.\n\n\n-----\n\nNDiskMonitor is a custom backdoor written in .NET, named after the project name. We haven’t seen this\nbackdoor used by any other threat actor, so we construe this as Patchwork’s own.\n\nFigure 17: Snapshot of NDiskMonitor’s properties\n\nNDiskMonitor’s configuration is stored in update_details global variable. 70600 is probably its backdoor\nID, \"FuckYou\" is the AES password used for encrypting certain information, and the string following it is\nthe command and control (C&C) address.\n\nFigure 18: NDiskMonitor’s configuration\n\nNDiskMonitor spawns a few threads. The first thread beacons regularly to let attackers know that the\nmachine is alive. The parameter license is the encrypted username, current_license is the encrypted\ncomputer name, and bui is the backdoor ID.\n\nFigure 19: Thread spawned by NDiskMonitor\n\n\n-----\n\nThe second thread listens for backdoor commands. Backdoor queries are done via updatecheck.php,\nwith parameters client as the encrypted user name. Supported commands are:\n\ncme-update|<base64 execute command, AES-encrypted result\ncommand> exfiltrated with /php/component_update.php,\n\nparameters component = user name and check =\nencrypted result\nDv return list of all logical drives, separated by “&”\nrr|<base64 directory> list all the files and directories in given directory\nue|<base64 url> download and execute file from given URL\n\nThe third thread regularly downloads and executes the Wintel file/information stealer, while the fourth\nthread runs a custom Task Host program. It’s a persistence mechanism for Wintel, which doesn’t have\none on its own.\n\nOf note were multiple NDiskmonitor samples we found in the wild that had different hashes but similar\ncode. The attackers added four extra bytes of random uppercase and lowercase letters after the PEreferenced data in the overlay. We think this is done solely to change the file hashes since the Windows\nPE loader won't even load those extra bytes into memory. Socksbot\n\nPatchwork also uses the Socksbot backdoor. As its name suggests, it abuses Socket Secure (SOCKS)\nproxies.\n\nFigure 20: Snapshot showing Socksbot\n\nAll Socksbot binaries are DLL files that create a suspended svchost process, in which the DLL is\ninjected and then executed (e.g., as a module in another backdoor). When Socksbot communicates with\nthe C&C server, the response will include a status code.\n\n|cme-update|<base64 command>|execute command, AES-encrypted result exfiltrated with /php/component_update.php, parameters component = user name and check = encrypted result|\n|---|---|\n|Dv|return list of all logical drives, separated by “&”|\n|rr|<base64 directory>|list all the files and directories in given directory|\n|ue|<base64 url>|download and execute file from given URL|\n\n\n-----\n\nBased on the status code, Socksbot will execute one of the following branches:\n\n  - 200: start a SOCKS proxy thread\n\n  - 202: take a screenshot and list of all running processes to C&C\n\n  - 203: activate the backdoor function, which depends on the first byte of received and decoded\nbuffer, which can be:\n\n`o` Write and execute an EXE file\n\n`o` Write and execute a PowerShell script\n\n`o` Write and execute a PowerShell script and exit\n\nFigure 21: Code snippets showing Socksbot executing branches based on status code\n\n\n-----\n\nThis backdoor, which has been used in [other](https://www.forcepoint.com/resources/datasheets/monsoon-analysis-apt-campaign) [campaigns, has an interesting method for retrieving the](https://blog.fortinet.com/2017/04/05/in-depth-look-at-new-variant-of-monsoon-apt-backdoor-part-1)\nactual C&C address. The binary has a few hardcoded and encoded URL addresses, which can be\ndecoded by subtracting 0x01 from each character.\n\nAfter the decoding, we get the actual URLs.\n\nFigure 22: The hardcoded strings (above), and the actual URLs when decoded (below)\n\nThese addresses refer to legitimate websites such as Github, Feed43, WebRSS, Wordpress, and Weebly,\nlikely to circumvent AV detection. Accessing these decoded URLs reveals a long base64 string enclosed\nwithin parentheses. This may be hidden on some websites, as the text has white color on a white\nbackground, so it’s important to “make a selection” to highlight the text.\n\n\n-----\n\nFigure 23: base64 string enclosed in the decoded URLs (above and center), and how it’s decoded (below)\n\nThe text needs to be decoded on the actual C&C server. This can be done by base64 decoding,\ndecoding Hex string to bytes, then XORing each byte with 0x23 and rotating left by three positions. The\ndecoded C&C URL looks like the following:\nhxxp://188[.]165[.]124[.]30/c6afebaa8acd80e7/byuehf8af[.]php\n\nBadnews will then start to communicate with the C&C server. The request is not sent in clear text form,\nbut is encoded using the same algorithm used for encoding the C&C server name:\n\nuid=<14 hex digits >&u=<hex encoded Unicode username>&c=<hex encoded Unicode computer\nname>&v=2.2\n\n\n-----\n\nThe server response may include any of these 11 implemented commands:\n\n  - shell—download and save file\n\n  - link—download and write file, run with ShellExecute, inject into process if writing to file fails\n\n  - mod—download and save DLL file; likely module\n\n  - upd—download and save EXE file; likely update\n\n  - dwd—create empty file and send it to C&C server; probably for testing purposes\n\n  - kl—send logged keys to C&C server\n\n  - snp—snap, take screenshot\n\n  - ustr—upload stolen documents\n\n  - sdwl—upload file to C&C server\n\n  - utop—stop stealing files\n\n  - hcmd—run cmd.exe as a shell\n\nFigure 24: Badnews’ backdoor commands\n\n\n-----\n\nDepending on Badnews’ version, there are two threads. One logs all the pressed keys and stores them\nin a file, which, based on the received backdoor command, may be sent back to C&C server. The same\ngoes for the file-stealing thread, which monitors USB devices and copies files with certain extensions to\nthe backdoor’s predefined directory. Depending on C&C server’s command, it can send the stolen files\nback to C&C server. This feature is probably implemented to overcome air-gapped environments, as not\nall of its versions have a thread that steals data stored on USB devices. Badnews is usually compiled as\na DLL loaded by a legitimate Java runtime executable, which is vulnerable to DLL hijacking. The real\nAuthenticode certificate is sometimes appended to the DLL to make it look more legitimate, but it is\ninvalid. We recently saw a sample of it as an executable in the wild.\n\n## File Stealers\n\nIn Patchwork’s case, file stealers are used to search for files with certain extensions, which are then\nuploaded to their C&C server. The stealers we found seem to be developed and used exclusively by\nPatchwork.\n\nTaskhost Stealer\n\nTaskhost Stealer combines theft and persistence capabilities. It’s written in .NET and obfuscated with\nCrypto Obfuscator, which can be removed with the de4dot tool.\n\nFigure 25: Taskhost Stealer’s properties\n\n\n-----\n\nTaskhost Stealer has a constructor of a class, where the base.Load function is assigned an important\nfunction called RemoveResources. The IP address of C&C server is also assigned to a variable named\nwindowID. Note that function names don’t have any relation to their actual function, e.g.,\nRemoveResources doesn’t mean that it “removes resources”. The fake names were probably made to\nconfuse reverse engineers and researchers.\n\nFigure 26: Code snapshot showing RemoveResources\n\nWithin the RemoveResources function is a list of document extensions that are of interest to Patchwork,\nwhich are files commonly associated with cyberespionage. It also has a function that checks for the\nexistence of a sys.bin file in %APPDATA\\Roaming\\Microsoft\\taskhost\\1.0.0.0\\. This file contains a list of\nall documents with paths accessible from the infected machine.\n\nFigure 27: Document extensions specified by Taskhost Stealer\n\nThen, it drops Microsoft.Win32.TaskScheduler.dll and adds persistence. The code snippet below shows\nthe name of the task (Active Qiho Security), as well as the time interval (5 minutes) and duration (60 days).\nIt means that the process of looking for new files repeats every 5 minutes for the next 86,400 minutes\n(60 days), based on the code and scheduled task exported to XML format.\n\n\n-----\n\nFigure 28: Code snippets showing how Taskhost Stealer looks for new files (above), which is also in the XML file\n\nexported from Task Scheduler (below)\n\nIt then enumerates all the available drives and makes a POST request on C&C about the existence of\nthese drives:\n\nFigure 29: Available drives in the infected machine are enumerated\n\n\n-----\n\nThe request contains parameters drive and student_name. drive’s value is a disk letter followed by\ninformation if it is a Fixed or Network drive. student_name contains computer name and username,\nseparated by a hyphen. Files on all “ready” drives will be enumerated as saved as a list in sys.bin.\n\nFigure 30: POST request with the drive and student_name parameters (above) and files being enumerated (below)\n\nThe next step is to read from hxxp://209[.]58[.]185[.]35/LOG/<computer name>-<user name>[.]html. If\nthe response is c121, the program ends. This lets attackers control which machines they do not want to\nreceive files from.\n\nAll files from the previously created list will be uploaded one by one. A list of uploaded files will be in\ns.dwg, while the list of all files is in sys.bin. During each run, sys.bin is deleted and newly created;\nhowever, s.dwg remains the same. This ensures that only newly created files are uploaded. The upload\npath looks like this: drive (Fixed or Network), followed by path, computer name, and username.\n\n\n-----\n\nFigure 31: Code snippets showing the c121 response (top) and s.dwg (bottom)\n\nWintel Stealer\n\nWintel Stealer (Win Telephonic Services) is another .NET stealer named after the project name.\nCompared to the Taskhost Stealer, Wintel Stealer targets different files types and has no persistence\nmechanism.\n\nThe information of files are stored in the following format: filename whose path is AES-encrypted with a\nhardcoded password, then encoded with base64, with the &, SHA256 hash, and $ character appended.\nThis structure is stored in a global variable and remains in memory. A timer is enabled, starting the\nupload process when an internet connection is available.\n\nFigure 32: Wintel Stealer’s configuration (left) and the file types it targets (right)\n\n\n-----\n\nFigure 33: Information about the files is stored in a certain format\n\nThe load_check.php script is first queried with the parameters user, which is base64-encoded username,\nand hsh, which is file hash. The ?ussr= in the screenshot below is likely a typo; it should be user and not\nussr (Soviet Union).\n\nFigure 34: Wintel Stealer’s load_check.php script\n\nQuerying this script will tell whether the files are of interest and should be uploaded, and also ensures\nthat the backend server doesn’t upload duplicate files. The up.php script is for uploading files, using\nparameters use for username, fl for bytes of the file, hs for the SHA256.\n\nAutoIt Stealer\n\nOlder versions of Patchwork’s file stealers were written in AutoIt, and each of these contains an endless\nloop. The function __searchindex searches drive C:\\ for certain file extensions. They will copy the\ntargeted files to a directory named index. It also maintains a file Temp.log, each line of which containing\na file’s hex-encoded MD5 hash. The function __sendoutlist uploads all the files from index directory to\nthe C&C server and deletes them. Persistence is carried out by modifying the Run registry key.\n\n\n-----\n\nFigure 35: The functions of the AutoIt stealers\n\nInfrastructure\n\nWe found 30 to 40 IP addresses as well as domain names used by Patchwork in 2017. Each server has\na different purpose. Some are only meant to be C&C servers that collect data sent by the file stealers,\nand no domain name points to those IP addresses. In some cases, the same server is used for C&C\ncommunication while also acting as a website hosting content copied from legitimate websites and\npropagating malware or weaponized documents.\n\nThey misuse publicly available PHP scripts to retrieve files from the server without disclosing their real\npaths. While this could be for tracking purposes, it’s more likely for deterring researchers from finding\nopen directories. The documents are almost always downloaded from the /xinwen directory, which is\nnow properly configured and cannot be browsed. On multiple occasions, we observed them temporarily\nremoving the file so it could not be retrieved. Sometimes they replaced it with a legitimate file to dupe\nresearchers. In some of their servers’ homepages, they display a fake 302 redirection page to trick\nresearchers into thinking the files are gone.\n\n\n-----\n\nOther servers are used only to host phishing websites. Content changes between each campaign, but\nthe same server remains. For instance, the qzonecn[.]com domain has been pointing to the same IP\naddress since January 2017, but it now points to yahoomail[.]support. It references euuwebmail[.]com\nfor four months, and then militaryreviews[.]net for a week. This is consistent with the three months of\nvalidity of the Let’s Encrypt certificates. Apart from militaryreviews[.]net, all of these domain names are\nsimilar to legitimate websites that require authentication. We also found one server that was not hosting\nany content but had a Postfix instance running and being used to send targeted emails.\n\nAll of these servers seem to use Apache on CentOS. The favicon on a server they recently used was still\nsimilar to the one used in WampServer. It’s probable that Patchwork uses this package to facilitate\nserver installation when using a Windows environment.\n\nThe domain names are always registered using a service protecting the related whois information, which\nwasn’t always the case before Patchwork’s activities were disclosed in 2016. Additionally, many of the\ndomain names published in previous reports have been either sinkholed by security companies or\nabandoned by the attackers.\n\nPractice Defense in Depth\n\nPatchwork is in a vicious cycle, given the group’s habit of rehashing tools and malware. The more these\ntools are used, the likelier it is for them to be incorporated into the group’s arsenal. For enterprises, the\ngamut of tools and techniques at Patchwork’s disposal highlights the significance of defense in depth:\n[arraying proactive defense to thwart threats at each level—from the gateways, endpoints, and networks](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html)\n[to servers.](https://www.trendmicro.com/en_us/business/products/hybrid-cloud.html)\n\n[What can enterprises do? Keep the operating system and its applications updated—or employ virtual](https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/patching-problems-and-how-to-solve-them)\n[patching](https://www.trendmicro.com/vinfo/us/security/news/virtualization-and-cloud/virtual-patching-in-mixed-environments-how-it-protects-you/) [for legacy systems—to prevent security gaps and deter attackers from exploiting them. Firewall,](https://www.trendmicro.com/vinfo/us/security/news/security-technology/best-practices-deploying-an-effective-firewall)\n[sandbox,](https://www.trendmicro.com/vinfo/us/security/news/security-technology/how-can-advanced-sandboxing-techniques-thwart-elusive-malware) [and intrusion detection and prevention systems help detect red flags in the network. Enforce](https://www.trendmicro.com/en_us/business/products/network/integrated-atp/next-gen-intrusion-prevention-system.html)\n[the principle of least privilege: blacklist and secure the use of tools](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/best-practices-securing-sysadmin-tools) usually reserved for system\n[administrators, such as PowerShell.](https://www.trendmicro.com/vinfo/us/security/news/security-technology/security-101-the-rise-of-fileless-threats-that-abuse-powershell) [Network segmentation](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/protecting-data-through-network-segmentation) [and data categorization](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/keeping-digital-assets-safe-need-for-data-classification) thwart lateral\nmovement and risk of further data theft, while behavior monitoring and [application control/whitelisting](https://www.trendmicro.com/en_ca/business/capabilities/application-control-capability.html)\n[block anomalous routines executed by suspicious files. And more importantly, secure the email gateway.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\nPatchwork may only be reusing vulnerability exploits and malware, but they’re tried-and-tested—it only\ntakes one susceptible layer to affect the whole chain.\n\n\n-----\n\nTrend Micro Incorporated, a global leader in security software, strives to make the\nworld safe for exchanging digital information. Our innovative solutions for consumers,\nbusinesses and governments provide layered content security to protect information\non mobile devices, endpoints, gateways, servers and the cloud. All of our solutions\nare powered by cloud-based global threat intelligence, the Trend Micro™ Smart\nProtection Network™, and are supported by over 1,200 threat experts around the\nglobe. For more information, visit www.trendmicro.com.\n\n©2017 by Trend Micro, Incorporated. All rights reserved. Trend Micro and the Trend\nMicro t-ball logo are trademarks or registered trademarks of Trend Micro,\nIncorporated. All other product or company names may be trademarks or registered\ntrademarks of their owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.12.11.Patchwork_APT/tech-brief-untangling-the-patchwork-cyberespionage-group.pdf"
    ],
    "report_names": [
        "tech-brief-untangling-the-patchwork-cyberespionage-group"
    ],
    "threat_actors": [
        {
            "id": "ca292585-950c-400f-b632-c19fa3491fe1",
            "created_at": "2022-10-25T15:50:23.599765Z",
            "updated_at": "2025-03-27T02:00:55.504509Z",
            "deleted_at": null,
            "main_name": "MONSOON",
            "aliases": null,
            "source_name": "MITRE:MONSOON",
            "tools": [
                "TINYTYPHON",
                "BADNEWS",
                "Unknown Logger",
                "AutoIt backdoor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b29dd16-a06f-4830-81a1-365443bc54b8",
            "created_at": "2023-01-06T13:46:38.460047Z",
            "updated_at": "2025-03-27T02:00:02.839173Z",
            "deleted_at": null,
            "main_name": "QUILTED TIGER",
            "aliases": [
                "ATK11",
                "G0040",
                "Orange Athos",
                "Chinastrats",
                "Sarit",
                "Dropping Elephant",
                "APT-C-09",
                "Thirsty Gemini",
                "ZINC EMERSON"
            ],
            "source_name": "MISPGALAXY:QUILTED TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1513009603,
    "ts_modification_date": 1513009603,
    "files": {
        "pdf": "https://archive.orkl.eu/dafed0f2a46c513004287c96588d3be3b7ae513a.pdf",
        "text": "https://archive.orkl.eu/dafed0f2a46c513004287c96588d3be3b7ae513a.txt",
        "img": "https://archive.orkl.eu/dafed0f2a46c513004287c96588d3be3b7ae513a.jpg"
    }
}