{
    "id": "d6646914-d2e5-42aa-adf1-bd32de11fde0",
    "created_at": "2023-01-12T15:04:41.674635Z",
    "updated_at": "2025-03-27T02:05:18.95596Z",
    "deleted_at": null,
    "sha1_hash": "9d9830b1866a24ce208652715ce3706640d7b8f6",
    "title": "2020-08-14 - EmoCrash- Exploiting a Vulnerability in Emotet Malware for Defense",
    "authors": "",
    "file_creation_date": "2022-05-28T17:48:21Z",
    "file_modification_date": "2022-05-28T17:48:21Z",
    "file_size": 2416418,
    "plain_text": "# EmoCrash: Exploiting a Vulnerability in Emotet Malware for Defense\n\n**[binarydefense.com/emocrash-exploiting-a-vulnerability-in-emotet-malware-for-defense/](https://www.binarydefense.com/emocrash-exploiting-a-vulnerability-in-emotet-malware-for-defense/)**\n\nAugust 14, 2020\n\n**By: James Quinn**\n\nMost of the vulnerabilities and exploits that you read about are good news for attackers and\nbad news for the rest of us. However, it’s important to keep in mind that malware is software\nthat can also have flaws. Just as attackers can exploit flaws in legitimate software to cause\nharm, defenders can also reverse-engineer malware to discover its vulnerabilities and then\nexploit those to defeat the malware. The difficulty, of course, is how to share the news about\nthe vulnerability with other defenders while keeping it a secret from threat actors so they\ndon’t just patch the flaw. Researchers at Binary Defense have been doing exactly that since\nFebruary 6, and now it is time to share the details more publicly.th\n\nEmotet is a prolific and highly successful email-based malware, with a primary focus on\nemail theft and loading additional malware as a service. Most commonly identified by its\nthree distinct botnets and fairly obfuscated code flow, Emotet is a unique and persistent\nthreat to organizations of all sizes.\n\n\nUnique threats require unique solutions, which is why Binary Defense developed a killswitch\nexploiting a simple buffer overflow found in Emotet’s installation process and shared it freely\nwith the infosec community, avoiding public channels to ensure maximum uptime of the\nexploit before the threat actors behind Emotet patched their malware to close the\nvulnerability. This killswitch was alive between Feb 6, 2020 – Aug 6, 2020, or 182 days.th th\n\n\n-----\n\n## Emotet’s “New” persistence mechanism\n\nIn early February of this year, Emotet released a massive codebase overhaul, changing\nseveral of the installation and persistence mechanisms and introducing a polymorphic statemachine to their code flow. This added a layer of obfuscation to the loader, making analysis\nmore difficult. One of the key changes was the removal of the word list and file generation\nalgorithm used by Emotet during previous Emotet installs.\n\nIn its place was a new algorithm that generated a filename to save the malware on each\nvictim system, using a randomly chosen exe or dll system filename from the system32\ndirectory. This filename was encrypted (encoded) with an exclusive OR (XOR) key and\nsaved into a registry value set to the victim’s volume serial number. Additionally, the XOR key\nwas set to the volume serial number in little endian format.\n\nFig 1, Emotet installed key\n\n## Killswitch, V1\n\nAround 37 hours after Emotet unveiled these changes, Binary Defense threat researcher\nJames Quinn finished the first version of the killswitch/vaccine that eventually became\nEmoCrash. In the early days of this protection method, the PowerShell script would generate\nthe registry key value for each victim and set the data for each value to null.\n\n\n-----\n\nWhen Emotet would check Registry for the install marker, it would find the newly-generated\nnull value and generate the exe name “.exe”. It would then search the normal install location\nfor this exe (%AppdataLocal%, C:\\Windows\\System32,C:\\Windows\\Syswow64, based on\nenvironment). If it didn’t find it, it would drop a file to the normal install location called “.exe”.\nHowever, when the malware attempts to execute “.exe”, it would be unable to run because “.”\ntranslates to the current working directory for many operating systems.\n\nWhile this mechanism worked, it was very messy and still allowed Emotet to install—it just\nprevented Emotet from running successfully and reaching out over the network. Worried\nabout lack of deployment due to the messiness of the protection mechanism, and the\nadditional concern that it makes cleanup difficult, Binary Defense continued experimenting\nwith the killswitch, looking for ways to increase its effectiveness.\n\n## Killswitch, V2\n\nAround 48 hours after Emotet released the newest loader version, Binary Defense\ncompleted the second version of the killswitch. This version exploited a simple buffer\noverflow discovered in Emotet’s installation routine which caused Emotet to crash during\nmalware install, but before the malware would drop itself to the normal Emotet install\nlocations, thus completely preventing malware installation. Additionally, two crash logs would\nappear with event ID 1000 and 1001, which could be used to identify endpoints with disabled\nand dead Emotet binaries after deployment of the killswitch (and a computer restart).\n\n\n-----\n\nPackaged into a nice usable PowerShell script (which we named EmoCrash), this utility\nwould identify the user’s architecture and then generate the corresponding install registry\nvalue for the user’s volume serial number. It would then generate a buffer of 0x340 (832)\nbytes, which it would save to the new registry value’s data.\n\nThis tiny data buffer was all that was needed to crash Emotet, and could even be deployed\nprior to infection (like a vaccine) or mid-infection (like a killswitch).\n\n## Exploit Release\n\nWith an incredible amount of coordinating between the Infosec and CERT communities,\nespecially those at Team Cymru who helped immensely with this, Binary Defense began\ndistributing the EmoCrash exploit script to defenders around the world on Feb 12, 2020, with\nstrict instructions not to post it publicly. As our goal was to maximize the amount of good\n\n\n-----\n\ndone by this exploit while also avoiding tipping off the threat actors and allowing them to\npatch their code, Binary Defense set the information disclosure rules to TLP:Green, which\nlimits disclosure to non-public channels.\n\nAs we began disclosing the exploit to the community, we received a lot of helpful feedback,\nincluding a fix to some compatibility issues that arose with Windows 7 deployments,\ncontributed by the CERT at the University of Frankfurt in Germany. We would like to offer our\nmost sincere thanks and appreciation to the members of the information security community\naround the world who worked to help keep this killswitch a secret from attackers while widely\ndistributing it to defenders.\n\n## Emotet Enters “dev mode”\n\nAround Feb 7, Emotet entered a period of time where they stopped spamming and beganth\nworking on developing their malware. This time period stretched from Feb 7 – July 17, 2020.\nWhile their spam distribution was completely halted, they were not “inactive” during this time,\nas they continued to push out a few core binary updates and protocol updates. Additionally,\nEmotet was observed using Trickbot for loads as early as April 2, 2020.\n\n## April 2020 Update\n\nIn mid April, Emotet released a new protocol change, along with changes to the core binary.\nOne of the key changes was the introduction of a new installation method, retiring the\nExplorer registry key method. Additionally, this new update removed the use of concurrency\nmutexes, possibly in a bid to evade other more public killswitches.\n\nWhile the Explorer registry key install method was retired, it was not removed entirely from\nthe code. Instead, the explorer registry key was accessed by the malware when it checked to\nsee if there were old installs that needed removing.\n\n\n-----\n\nWhen it accessed this key, EmoCrash still triggered and would crash the malware before it\ncould communicate out. Unfortunately, this crash would trigger after Emotet had installed\nitself (including service creation and file drop). However, the malware would not connect out\nand the service would not run. Additionally, as the crash still triggered event ID 1000 and\n1001, responders were able to easily locate and remove these files.\n\nFig 2, Conveniently, Emotet would crash right before data stolen was formatted and sent to\nthe C2\n\n## May 2020 – July 17, 2020\n\nWhile Emotet did not return in force until July 17, 2020, Binary Defense received notifications\nfrom various organizations that had deployed EmoCrash and found and mitigated an\nongoing Emotet infection. As Emotet was not spamming during this time, the loss of entire\nvictim organizations had to have a negative impact on the botnet’s operations.\n\n## July 17 – August 6, 2020\n\nOn July 17, 2020, Emotet finally returned to spamming after their several months-long\ndevelopment period. With EmoCrash still active at the start of their full return, up until August\n6, EmoCrash was able to provide total protection from Emotet.\n\nNot bad for a 832-byte buffer!\n\nOn August 6, a core loader update was sent out which finally removed the vulnerableth\nregistry value code, effectively “killing” EmoCrash.\n\n## Thank you to the security community\n\nAs stated above, we’d like to offer our sincerest thanks to everyone who worked hard to keep\nthis exploit alive as long as possible. A huge thank you to Team Cymru for all the work they\ndid to spread this throughout the community (while also keeping it off public channels).\n\nJust for fun, I submitted a vulnerability report to MITRE’s CVE program to see if they would\nassign it a CVE number. It is for the best that it was denied, since public disclosure would\nhave been exactly the opposite of what we wanted, but it was fun to get a denial from MITRE\nabout it.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-14 - EmoCrash- Exploiting a Vulnerability in Emotet Malware for Defense.pdf"
    ],
    "report_names": [
        "2020-08-14 - EmoCrash- Exploiting a Vulnerability in Emotet Malware for Defense.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535881,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653760101,
    "ts_modification_date": 1653760101,
    "files": {
        "pdf": "https://archive.orkl.eu/9d9830b1866a24ce208652715ce3706640d7b8f6.pdf",
        "text": "https://archive.orkl.eu/9d9830b1866a24ce208652715ce3706640d7b8f6.txt",
        "img": "https://archive.orkl.eu/9d9830b1866a24ce208652715ce3706640d7b8f6.jpg"
    }
}