{
    "id": "d6c06512-804a-4789-8bd5-39b2086b147b",
    "created_at": "2023-01-12T15:02:31.808594Z",
    "updated_at": "2025-03-27T02:09:54.191082Z",
    "deleted_at": null,
    "sha1_hash": "b87d27d0606b8746d6ca2960c0ea94ba44b4990f",
    "title": "2021-04-29 - DomainTools And Digital Archeology- A Look At RotaJakiro",
    "authors": "",
    "file_creation_date": "2022-05-27T19:07:48Z",
    "file_modification_date": "2022-05-27T19:07:48Z",
    "file_size": 366160,
    "plain_text": "# DomainTools And Digital Archeology: A Look At RotaJakiro\n\n**[domaintools.com/resources/blog/domaintools-and-digital-archeology-a-look-at-rotajakiro](https://www.domaintools.com/resources/blog/domaintools-and-digital-archeology-a-look-at-rotajakiro)**\n\n## Background\n\nOn April 21, 2021, Netlab released an excellent report on a malware sample they dubbed\n[RotaJakiro, a long-lived backdoor targeting 64-bit Linux systems with 0 detections on](https://blog.netlab.360.com/stealth_rotajakiro_backdoor_en/)\nVirusTotal. This backdoor used a number of techniques to remain unnoticed and the\ncraftiness of the sample piqued the attention of the DomainTools Research Team. Netlab’s\npost ended talking about how analysis of the binary was just the tip of the iceberg in\ndiscovering what this sample was about and that is where we feel that DomainTools, with\nour thorough historical data set of over 20 years of Whois and DNS information, had to take\na look. For analysis on the binary itself, we suggest reading their excellent post while we\nconcentrate here on one of our specialties: digital archeology.\n\n## Initial Indicators\n\nIn this instance, the samples found by Netlab were first added to VirusTotal in 2018. As\nmentioned, none of them were detected by any of the engines VirusTotal employs. These\nsamples all called out to C2 infrastructure of the following domains:\n\n\n-----\n\n```\nnews.thaprior.net\nblog.eduelects.com\ncdn.mirror-codes.net\nstatus.sublineover.net\n\n```\nA quick look in passive DNS shows that these domains only have these subdomains listed\nand they do not appear to be a part of any Dynamic DNS system so we can assume that\nthe SLDs are owned by the same operator. We’ll look more at passive DNS later, but for\nnow we can throw these domains into Iris Investigate to see more about their intrinsic\nproperties.\n\nFirst is the use of the Web4Africa registrar. This registrar has just a little over 18,000\ndomains associated with it so the frequency of registration is rather low. Second, we see the\nregistration dates are about the same for all of the domains being from December 9th and\n10th of 2015. This aligns with the research from the Netlab report and may indicate that\nthere are actually older samples to be found in the wild. Third, we see that all have the\nsame nameservers except for one domain. Outliers are always useful as they often link to\nadditional connections elsewhere in the broader domain name data set. Lastly, the use of\nthe Confluence Networks IP for their apex A record which is only slightly valuable. This is a\nparking page IP address and makes sense as the operator of this backdoor used\nsubdomains that all had A records to a specific IP address for C2.\n\n### Summary of Additional Information and What it Tells Us\n\n\n**Web4Africa**\n**Registrar**\n\n\nLow volume registrar.\n\n\n-----\n\n**Grouped Create**\n**Date**\n\n\nGrouped create date plus low volume registrar means we can\nhunt on the same day for additional registrations.\n\n\n**Outlier Nameserver** Outliers often lead to additional infrastructure as they have been\ntreated special for a reason.\n\n\n**Parking Page IP**\n**For Apex Domain**\n\n\nGood to point out simply because it can be a rabbit hole.\n\n\n## Diving Deeper Than Domains\n\nThe first step from here is we look at Whois history. In this case, privacy protection has\nbeen in place since the domains were first registered in 2015. Most importantly we can tell\nthat because the domain has never been allowed to expire,these weren’t domains that were\ndropped and re-registered. This lets us know that the same person has owned these\n**domains since 2015. That is an important distinction to make as adversaries are**\nincreasingly aware that getting a drop catch domain is a nice way to immediately “age” a\ndomain so it goes undetected as many machine learning algorithms rely heavily on\nregistration date to determine malicious intent. We have certainly found that an\noverwhelming number of attacks come from newly registered domains in our analysis.\n\nSince Whois history provides minimal additional points to pivot on, we can then turn to\npassive DNS. This data set of passively collected query and response pairs from recursive\nresolvers around the Internet shows a first and last seen entry for any pair along with a\ncount. This can help determine both breadth of use as well as when something first began\nand was last seen operating. In the case of the IP address used for all four of the\nsubdomains that were C2 infrastructure, we get the following list that shows activity as early\nas November 08, 2017 and as recently as April 29, 2021 which is the time of this writing. In\naddition to that we get three new domains pointing to the exact same IP address just a few\nmonths prior in 2017.\n\n\n-----\n\nWhile this is interesting, it’s important not to jump to conclusions and tie this directly to the\nother domains. For one, the IP is tied to a Ukraine and Netherlands based VPS provider\ncalled DeltaHost. A VPS provider rents out servers and with that IP addresses. This IP\ncould simply have been recycled that month when the operator behind RotaJakiro decided\nto become active. Secondly, there are no subdomain patterns that match the naming\nconvention of the domains prior. Given that this IP has only ever hosted the confirmed\nRotaJakiro C2 domains and these new domains, though, it behooves any analyst to take a\ncloser look.\n\n\n-----\n\nUnfortunately, these three additional domains do not provide anything that can definitively\ntie them to the other domains. They lack any overlapping times in passive DNS records and\ntheir registration patterns are different. One oddity however is their Risk Score of 100. The\nDomainTools Risk Score is informed by a number of things, but a score of 100 is indicative\nof a domain being included on a blocklist for a previous report of known badness. Looking\nat historical Whois for these domains we see them with a registrant email of\ndaniel.madi@mail[.]com who is tied to 88 Office 365 based phishing domains.\n\n\n-----\n\nGiven the complexity and stealth of the RotaJakiro backdoor it seems unlikely that such a\nnoisy phishing campaign would be so easily tied to such a quiet operation. If we were to tie\nthese together it would be with extremely low confidence. We feel as researchers that it is\nmuch more likely that DeltaHost recycled this VPS IP address shortly after the blocklisting\nof these domains and it was coincidentally used in other criminal activity and that the IP\naddress was picked up by the RotaJakiro operators. In support of this, passive DNS records\nshow that one of these older domains was suspended just before the C2 domains for\nRotaJakiro began operating on that IP address. Passive DNS also shows the RotaJakiro C2\ndomains existing on other IP addresses prior to moving to DeltaHost. Both of these facts\nsupport the theory that these are separate.\n\nThis IP now belongs to Hivelocity, a small cloud provider that has only owned the IP\naddress since 2019 according to the create date on the IP Whois record for their subnet.\nAccording to historical IP Whois information, Hivelocity acquired this range from Swiftway\nafter [acquiring the company which had server locations in the Netherlands. The IP shown,](https://www.hivelocity.net/blog/hivelocity-has-acquired-dedicated-server-and-colocation-business-from-swiftway-net/)\n46.21.147[.]87 is still geolocated in the Netherlands.\n\nUnfortunately, we also cannot find any connections between the C2s mentioned in Avast’s\nTorii botnet [report from 2018 and the domains in the RotaJakiro report. Netlab did mention](https://blog.avast.com/new-torii-botnet-threat-research)\nsimilarities between RotaJakiro and the Torii botnet in their operation. If there had been a tie\nbetween those domains even and the daniel.madi@mail[.]com domains we could increase\nour confidence in them belonging to the same operator.\n\nSometimes when reaching a dead end on infrastructure databases the best thing for us as\nanalysts to do is turn to traditional search engines. Throwing in the initial C2 domains we\ndiscovered and a few interesting hits came up. The first is a link to a 2016 repository of Tor\nDNS logs that show to us that this domain has at least been accessed since 2016. The\nsecond is from a Turkish government website and is a URL list in XML format. The domains\nare mentioned as appearing on April 29, 2021, same as the time of this writing, from the\nZararlı Yazılım Komuta Kontrol Merkezi which is Turkish for Malware Command Control\nCenter, likely having been an ingestion of the original Netlab report.\n\n\n-----\n\n### Summary of Additional Information and What It Tells Us\n\n\n**C2 Domains**\n**Never Lapsed**\n\n\nSame registrant has owned these domains since their initial\nregistration in 2015.\n\n\n**IP On**\n**DeltaHost VPS**\n**Provider**\n\n\nVPS providers share resources amongst clients so unless we can\noverlap some records we cannot confirm that a single IP ties two\nevents together.\n\n\n**IP Used In**\n**Other**\n**Maliciousness**\n\n\nThe VPS IP was used, but never overlapped, with another set of\nmalicious domains doing Office 365 phishing with entirely different\nregistration patterns and levels of noise.\n\n\n**C2s Previously**\n**Used A**\n**Different IP**\n\n\nDuring the time where there could have been overlap with other\nmaliciousness, the C2s used an IP on a different VPS provider in the\nNetherlands.\n\n\n**No**\n**Infrastructure**\n**Tie To Match**\n**Code Ties**\n\n\nThe Torii Botnet mentioned by Netlab does not have any infrastructure\nties to RotaJakiro.\n\n\n**Domain**\n**Resolving In**\n**2016**\n\n\nAlthough resolving as early as 2016, we cannot confirm that it\nresolved to the same IP as the DeltaHost IP.\n\n\n## Conclusion\n\nAlthough we were unable to tie the Netlab report on RotaJakiro to another operator, we\nhave produced a good amount of evidence and potential conclusions for further analysis.\nWe’ve been able to confirm timelines from the Netlab report as well as mark key oddities for\nfurther avenues of investigation. We were also able to identify additional IP addresses\nwhich had been previously used by the C2 domains and would lower the threshold of\nconfidence for tying this to previous maliciousness. When all else brought us to a dead end\n\n\n-----\n\nwe were able to expand upon our original timeline thanks to good old fashioned OSINT\nusing classic search engines. Whenever coming across reports like this we hope that\ncustomers can find DomainTools useful in the practice of digital archeology.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - DomainTools And Digital Archeology- A Look At RotaJakiro.pdf"
    ],
    "report_names": [
        "2021-04-29 - DomainTools And Digital Archeology- A Look At RotaJakiro.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b07fec96-80cd-4d92-aa52-a26a0b25b7c2",
            "created_at": "2022-10-25T16:07:23.826594Z",
            "updated_at": "2025-03-27T02:02:09.994638Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [
                "Mahdi"
            ],
            "source_name": "ETDA:Madi",
            "tools": [
                "Madi"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "322a0ef1-136b-400e-89d0-0d62ee2bd319",
            "created_at": "2023-01-06T13:46:38.662109Z",
            "updated_at": "2025-03-27T02:00:02.885938Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [],
            "source_name": "MISPGALAXY:Madi",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535751,
    "ts_updated_at": 1743041394,
    "ts_creation_date": 1653678468,
    "ts_modification_date": 1653678468,
    "files": {
        "pdf": "https://archive.orkl.eu/b87d27d0606b8746d6ca2960c0ea94ba44b4990f.pdf",
        "text": "https://archive.orkl.eu/b87d27d0606b8746d6ca2960c0ea94ba44b4990f.txt",
        "img": "https://archive.orkl.eu/b87d27d0606b8746d6ca2960c0ea94ba44b4990f.jpg"
    }
}