{
    "id": "d6d95c18-093e-4198-81db-96827749e8ce",
    "created_at": "2023-01-12T15:09:00.811466Z",
    "updated_at": "2025-03-27T02:05:32.829011Z",
    "deleted_at": null,
    "sha1_hash": "896ce6eb6495721790d02d1b96ffd06bd3197831",
    "title": "2020-12-15 - Overview of Recent Sunburst Targeted Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T16:01:23Z",
    "file_modification_date": "2022-05-28T16:01:23Z",
    "file_size": 123895,
    "plain_text": "# Overview of Recent Sunburst Targeted Attacks\n\n**trendmicro.com/en_us/research/20/l/overview-of-recent-sunburst-targeted-attacks.html**\n\nCyber Threats\n\n\nDecember 15, 2020\n\n\nVarious sources have recently disclosed a sophisticated attack that hit organizations via the supply chain via a compromised network\nmonitoring program. This post discusses what the Sunburst backdoor is and what you can do now to mitigate this threat.\n\nBy: Trend Micro December 15, 2020 Read time: ( words)\n\n_Update on 12/29/2020 2:40 PM PST: Information on Supernova added_\n\n_[Update on 1/22/2021 4:56 PM PST: Trend Micro's Zero-Day Initiative (ZDI) provided technical analysis of recently patched vulnerabilities in the](https://www.zerodayinitiative.com/blog/2021/1/20/three-bugs-in-orions-belt-chaining-multiple-bugs-for-unauthenticated-rce-in-the-solarwinds-orion-platform)_\n_SolarWinds Orion Platform. CVE-2020-14005, one of these vulnerabilities, has been linked to the recent SUNBURST cyberattack on_\n_SolarWinds. These vulnerabilities, when combined, could allow an unauthenticated attacker to execute arbitrary code as Administrator on an_\n_affected system._\n\nVarious sources have recently disclosed a sophisticated attack that hit organizations via the supply chain. This was carried out via a\ncompromised version of a network monitoring application called SolarWinds Orion. The attackers used the access provided by this application\nto plant a backdoor known as Sunburst onto affected machines. This [backdoor provided the attacker with complete access to the targeted](https://www.trendmicro.com/en_us/research/20/l/backdoors-hard-to-spot.html)\norganization’s network.\n\nWhat is Sunburst?\n\nSunburst is a sophisticated backdoor that provides an attacker nearly complete control over an affected system. It has several peculiarities in\nits behavior, however.\n\nBefore it runs, it checks that the process name hash and a registry key have been set to specific values. It will also only run if the execution\ntime is twelve or more days after the system was first infected; it will also only run on systems that have been attached to a domain. This\nspecific set of circumstances makes analysis by researchers more difficult, but it also limits the scope of its victims to some degree.\n\nIt connects back to its command-and-control server via various domains, which take the following format:\n\n_{random strings}.appsync-api.{subdomain}.avsvmcloud.com_\n\nThe subdomain is one of the following strings:\n\neu-west-1\n\neu-west-2\nus-east-1\nus-east-2\n\nOnce in a system, it can both gather information about the affected system and execute various commands. The gathered information\nincludes:\n\nDomain name\nNetwork interfaces\nRunning processes/services\n\n\n-----\n\nsta ed d e s\n\nThis gathered information is used either to generate a user ID for the affected machine, or to check against blocklists - if certain drivers,\nprocesses, or services are found on the machine, the backdoor will cease to function.\n\nThe commands that can be executed include:\n\nRegistry operations (read, write, and delete registry keys/entries)\nFile operations (read, write, and delete files)\nRun/stop processes\nReboot the system\n\nWhat is Supernova?\n\nSupernova, one of the malicious components associated with the attack, is a .NET web shell backdoor that presents itself as a legitimate\nSolarWinds web service handler. It is a second-stage payload in the attack. Once running, it inspects and responds to HTTP requests with\nappropriate HTTP query strings, cookies, and HTML form values. It can also execute web shell commands via a specific HTTP request format.\n\nWho is affected?\n\n[It is believed that Sunburst was delivered via a trojanized version of the Orion network monitoring application. According to SEC filings by](https://www.sec.gov/ix?doc=/Archives/edgar/data/1739942/000162828020017451/swi-20201214.htm)\nSolarWinds, threat actors inserted the malicious code into otherwise legitimate code, which means anyone who downloaded the software was\npotentially at risk. This was done as part of the build process; the source code repository was not affected.\n\nAccording to the SolarWinds SEC filing, this trojanized version was downloaded by under 18,000 customers from March to June of 2020. Once\nthis malicious code is present in a system, it runs the behavior described in the first part of this post. Multiple organizations, including US\ngovernment agencies, have reported that they were affected by this campaign.\n\nSolutions\n\nIn a [security advisory, SolarWinds advised all of their affected customers to immediately update their software to versions that do not contain](https://www.solarwinds.com/securityadvisory)\nthe malicious code. The advisory also lists the appropriate products and their versions. Our article titled Managing Risk While Your ITSM Is\n_Down includes suggestions on how to manage network monitoring and other IT systems management (ITSM) solutions._\n\nIn addition to this, the US Department of Homeland Security, in a [directive to US government agencies, ordered that systems with the said](https://cyber.dhs.gov/ed/21-01/)\nsoftware be taken offline and not reconnected to networks until they have been rebuilt. The directive treats agencies to treat said machines as\ncompromised, with credentials used by said machines to be changed as well. Organizations that use SolarWinds Orion within their network\nmay consider similar steps.\n\n[The malicious files associated with this attack are already detected by the appropriate Trend Micro products as Backdoor.MSIL.SUNBURST.A](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Backdoor.MSIL.SUNBURST.A)\n[and Trojan.MSIL.SUPERNOVA.A. In addition to this, the entirety of the domain avsvmcloud.com has been blocked.](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Trojan.MSIL.SUPERNOVA.A)\n\n[If you believe that your organization may have been affected by this campaign, visit this page for the available Trend Micro solutions that can](https://success.trendmicro.com/solution/000283368)\nhelp detect and mitigate any risks from this campaign.\n\nIf you’re a Trend Micro Apex One customer, check your product console for a notification to scan your environment for attack indicators of this\ncampaign.\n\nIndicators of Compromise\n\nThe following hashes are associated with this campaign and are detected by Trend Micro products:\n\nSHA256 SHA1 Trend Micro\n\n019085a76ba7126fff22770d71bd901c325fc68ac55aa743327984e89f4b0134 2f1a5a7411d015d01aaee4535835400191645023 Backdoor.M\n\nc15abaf51e78ca56c0376522d699c978217bf041a3bd3c71d09193efa5717c71 75af292f34789a1c782ea36c7127bf6106f595e8 Trojan.MSIL\n\nce77d116a074dab7a22a0fd4f2c1ab475f16eec42e1ded3c0b0aa8211fe858d6 d130bd75645c2433f88ac03e73395fba172ef676 Backdoor.M\n\n32519b85c0b422e4656de6e6c41878e95fd95026267daab4215ee59c107d6c77 76640508b1e7759e548771a5359eaed353bf1eec Backdoor.M\n\nd0d626deb3f9484e649294a8dfa814c5568f846d5aa02d4cdad5d041a29d5600 1b476f58ca366b54f34d714ffce3fd73cc30db1a Backdoor.M\n\nThe following domain names are associated with this campaign and are also blocked:\n\navsvmcloud[.]com\ndatabasegalore[.]com\ndeftsecurity[.]com\nhighdatabase[.]com\ni d t [ ]\n\n\n-----\n\npa a d a e[ ]co\nthedoccloud[.]com\nzupertech[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-15 - Overview of Recent Sunburst Targeted Attacks.pdf"
    ],
    "report_names": [
        "2020-12-15 - Overview of Recent Sunburst Targeted Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536140,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653753683,
    "ts_modification_date": 1653753683,
    "files": {
        "pdf": "https://archive.orkl.eu/896ce6eb6495721790d02d1b96ffd06bd3197831.pdf",
        "text": "https://archive.orkl.eu/896ce6eb6495721790d02d1b96ffd06bd3197831.txt",
        "img": "https://archive.orkl.eu/896ce6eb6495721790d02d1b96ffd06bd3197831.jpg"
    }
}