{
    "id": "d6e66712-8e06-4021-97c7-54a6a5867356",
    "created_at": "2023-01-12T14:59:12.983348Z",
    "updated_at": "2025-03-27T02:05:47.342375Z",
    "deleted_at": null,
    "sha1_hash": "37baa6864948e8a28e6f372ade2d7efb0627c930",
    "title": "2021-06-03 - OAuth’s Device Code Flow Abused in Phishing Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T02:09:26Z",
    "file_modification_date": "2022-05-28T02:09:26Z",
    "file_size": 356580,
    "plain_text": "# OAuth’s Device Code Flow Abused in Phishing Attacks\n\n**[secureworks.com/blog/oauths-device-code-flow-abused-in-phishing-attacks](https://www.secureworks.com/blog/oauths-device-code-flow-abused-in-phishing-attacks)**\n\nSecureworks Adversary Group and Counter Threat Unit Research Team\n\nIn business email compromise (BEC) scams, threat actors can bypass multi-factor\n[authentication (MFA) by abusing OAuth applications. These “illicit consent” attacks typically](https://en.wikipedia.org/wiki/OAuth)\ninvolve the threat actors using phishing to convince a victim to grant sensitive permissions\n(e.g., the ability to read and write email) to an attacker-controlled Azure application. One\nvariation on this attack leverages the OAuth interactive device authorization protocol to\n\n\n-----\n\nimitate legitimate (and possibly verified) OAuth applications during the user consent\nexperience. This approach does not require the threat actor to register a malicious OAuth\napplication, making it challenging for defenders to detect and audit.\n\n## Abusing OAuth2.0 Device Authorization\n\n[Reports of high-profile BEC incidents and](https://www.sans.org/dataincident2020) [takedowns of threat actors conducting](https://blogs.microsoft.com/on-the-issues/2020/07/07/digital-crimes-unit-covid-19-cybercrime/)\nsophisticated phishing campaigns that used COVID-19 (also known as coronavirus) themes\nhighlight the need to detect and prevent OAuth-based threats. In parallel with other research\n[teams, Secureworks® researchers identified a novel phishing technique that abuses the](https://o365blog.com/post/phishing/)\n[OAuth2.0 Device Authorization Grant protocol (RFC 8628) to obtain illicit consent.](https://tools.ietf.org/html/rfc8628)\n\nThe OAuth 2.0 Device Authorization Grant allows a user to authenticate an application to an\nOAuth provider from a different device. This authentication flow was created to facilitate\nauthorization of a device that has limited interactivity (e.g., no keyboard). One of the most\ncommon implementations is using a mobile phone or PC to authorize a video-streaming\napplication on a device like a Roku. The application on the device provides a code to the\nuser and then polls the provider to detect when authentication happens (see Figure 1).\n\n_Figure 1. Microsoft Azure Active Directory OAuth 2.0 device flow. (Source:_ _[Microsoft)](https://docs.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-device-code)_\n\nWhile investigating the device code flow, Secureworks researchers observed\nimplementations that required only a client ID to generate the user code and device code\nand then subsequently poll for authentication. This behavior seemed to indicate that a threat\nactor could use the flow to conduct a phishing attack and impersonate legitimate client\napplications. The RFC notes this possibility and provides some mitigations that the OAuth\nprovider should have in place (see Figure 2). Impersonating legitimate client applications\nhelps the threat actor avoid detection and increases the likelihood that a victim will click a\nlink.\n\n\n-----\n\n_Figure 2. Reference to phishing potential and mitigations in RFC 8628. (Source: Internet_\n_[Engineering Task Force (IETF)).](https://tools.ietf.org/html/rfc8628)_\n\nFrom a victim’s perspective, the authentication process could appear legitimate. They could\nbe prompted to visit a legitimate OAuth provider link and enter the code from a phishing\nemail or SMS message to authorize their phone with an application their company uses (see\nFigure 3).\n\n_Figure 3. Microsoft device login page. (Source: Secureworks)_\n\nAfter authenticating, the victim could grant permissions to an app that does not appear\nsuspicious. In some cases, the app may be verified (see Figure 4). The permissions could\nallow the threat actor to perform various tasks, including reading email. If offline access is\n\n\n-----\n\nspecified, the attacker could maintain access long term.\n\n_Figure 4. Phishing attack using the OAuth device code flow and a verified application._\n_(Source: Secureworks)_\n\n## PhishInSuits tool\n\nThe Secureworks Adversary Group (SwAG) and Counter Threat Unit™ (CTU) research team\n[developed the PhishInSuits (pis.py) tool to conduct security assessments and test control](https://github.com/secureworks/PhishInSuits)\nframeworks against scenarios such as BEC attacks. It combines this variation of illicit\nconsent attack with SMS-based phishing to emulate BEC campaigns and includes\nautomated data-exfiltration capabilities.\n\nPhishInSuits automates the OAuth 2.0 Device Authorization Grant processes, obtaining a\nuser's access/refresh tokens upon application authorization and performing data exfiltration\nusing the acquired access token(s). The tool performs four steps (see Figure 5):\n\n\n-----\n\n1. Device code authorization: It uses a specified application client ID to communicate with\n\nthe authorization server and acquire both a user code and a device code.\n2. Phishing/smishing: It uses the acquired user code to perform one of two actions:\n\n1. It sends the target victim(s) an SMS text message containing both the user code\n\nand authorization URL and prompts the victim to enter the code and authorize the\napplication.\n2. It instructs the tool’s user to send the user code and authorization URL to the\n\nvictim via email.\n3. Polling for authentication: PhishInSuits polls the authorization server for the victim’s\n\naccess and refresh tokens. Polling requests continue at a specified interval until the\nvictim authenticates (which generates an access token) or the device code expires.\nThe tool then writes the full token response from the authorization server to a local file.\n4. Data exfiltration: If the tool’s user instructs PhishInSuits to exfiltrate data, then the tool\n\nuses the acquired access token to query the target API for the specified data. Each API\nresponse is written to a local file.\n\n_Figure 5. Example output of the PhishInSuits tool. Twilio is a third-party API for_\n_programmatically sending SMS messages. (Source: Secureworks)_\n\nThe tool user could use external (e.g., LinkedIn) or internal (e.g., the organization’s Global\nAddress List (GAL)) sources to perform reconnaissance and identify email addresses and\nphone numbers used by target victims. After compiling a list of victims, the tool user can\nleverage PhishInSuits to perform targeted phishing via the command shown in Figure 6.\n\n_Figure 6. Example command to perform an attack against multiple victims. (Source:_\n_Secureworks)._\n\n\n-----\n\nIf a victim authorizes the application sent by the tool user, PhishInSuits uses the --get-data\nflag to obtain sensitive data from the Azure Graph API using the victim's access token. The\ntool user can leverage the victim’s access token and the '--api' flag to collect user data from\none or more API endpoints.\n\n## Mitigations for these attacks\n\n[Microsoft offers multiple user consent settings for Azure AD tenants. These configurations](https://docs.microsoft.com/en-us/azure/active-directory/manage-apps/configure-user-consent?tabs=azure-portal)\ninclude preventing users from granting consent to unapproved applications without\nadministrator preapproval, allowing users to request consent from administrators, restricting\nthe types of consent that can be granted (e.g., disabling permissions to read user\nmailboxes), and restricting consent to only apps from verified publishers.\n\n[Microsoft published best practices for granting consent and managing application](https://docs.microsoft.com/en-us/azure/active-directory/manage-apps/manage-consent-requests)\npermissions. Additional policies and controls for OAuth applications are available in the\nMicrosoft Cloud App Security (MCAS) portal.\n\n## Conclusion\n\nBEC continues to be a lucrative type of attack. Combining weaknesses in an OAuth\nimplementation with phishing can improve threat actors’ chances of success. By\ndemonstrating these techniques, the PhishInSuits tool can help organizations simulate these\nattacks to educate employees and identify potential detection and defense methods.\n\n[Try the Secureworks PhishInSuits tool.](https://github.com/secureworks/PhishInSuits)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-03 - OAuth’s Device Code Flow Abused in Phishing Attacks.pdf"
    ],
    "report_names": [
        "2021-06-03 - OAuth’s Device Code Flow Abused in Phishing Attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535552,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653703766,
    "ts_modification_date": 1653703766,
    "files": {
        "pdf": "https://archive.orkl.eu/37baa6864948e8a28e6f372ade2d7efb0627c930.pdf",
        "text": "https://archive.orkl.eu/37baa6864948e8a28e6f372ade2d7efb0627c930.txt",
        "img": "https://archive.orkl.eu/37baa6864948e8a28e6f372ade2d7efb0627c930.jpg"
    }
}