{
    "id": "d7079c1d-94c9-4417-831d-9b2200cd3121",
    "created_at": "2023-01-12T15:05:46.674574Z",
    "updated_at": "2025-03-27T02:15:35.511666Z",
    "deleted_at": null,
    "sha1_hash": "9e4a36366f4e4fc3ef7d9e96bf3c3e9432ecb87d",
    "title": "2022-11-21 - ViperSoftX- Hiding in System Logs and Spreading VenomSoftX",
    "authors": "",
    "file_creation_date": "2022-11-28T19:11:07Z",
    "file_modification_date": "2022-11-28T19:11:07Z",
    "file_size": 1818216,
    "plain_text": "# ViperSoftX: Hiding in System Logs and Spreading VenomSoftX\n\n**decoded.avast.io/janrubin/vipersoftx-hiding-in-system-logs-and-spreading-venomsoftx/**\n\nby [Jan RubínNovember 21, 202219 min read](https://decoded.avast.io/author/janrubin/)\n\n\nNovember 21, 2022\n\n\nWe’ve been closely monitoring an information stealer called ViperSoftX. ViperSoftX was first [reported on Twitter in 2020, and by Fortinet in](https://twitter.com/c3rb3ru5d3d53c/status/1227071037633945600)\n[the same year. Some aspects of ViperSoftX were also described previously by Colin Cowie. However, it has undergone very intensive](https://www.th3protocol.com/2022/ViperSoftX-Stealer)\ndevelopment since then, intensifying throughout 2022. The malware authors’ constant game of hide-and-seek in which they continually\nimprove their strategies and techniques to avoid detections shows no signs of stopping. We, therefore, decided to put the pieces together to\nprovide a comprehensive analysis.\n\nThis multi-stage stealer exhibits interesting hiding capabilities, concealed as small PowerShell scripts on a single line in the middle of\notherwise innocent-looking large log files, among others. ViperSoftX focuses on stealing cryptocurrencies, clipboard swapping, fingerprinting\nthe infected machine, as well as downloading and executing arbitrary additional payloads, or executing commands.\n\nOne of the payloads ViperSoftX distributes is a specific information stealer in the form of a browser extension for Chromium-based browsers.\nDue to its standalone capabilities and uniqueness, we decided to give it its own name, VenomSoftX. The malicious extension provides full\naccess to every page the victim visits, carries out man-in-the-browser attacks to perform cryptocurrency addresses swapping by tampering\nwith API requests’ data on popular cryptocurrency exchanges, steals credentials and clipboard content, tampers with crypto addresses on\nvisited websites, reports events using MQTT to the C&C server, and more.\n\nViperSoftX is mostly spread via cracked software such as `Adobe Illustrator,` `Corel Video Studio,` `Microsoft Office, and more,`\ncommonly distributed over torrents.\n\n## Campaign overview\n\nSince the beginning of 2022, we have protected more than 93,000 of our users. As the malware is mostly spread via torrents and softwaresharing sites, ViperSoftX activity is distributed all over the world. The most impacted countries are India (7,000+), USA (6,000+), and Italy\n(5,000+).\n\n_Map illustrating the targeted countries since the beginning of 2022_\n\n## Monetary gain\n\n\n-----\n\not pe So t a d e o So t ocus o stea g c yptocu e c es o ected co pute s, e t e by sca g oca es o by us g o e\nsophisticated techniques. In the table below, we show an estimation of the attackers’ total earnings for relevant cryptocurrency wallets.\n\n**Cryptocurrency** **Earnings in cryptocurrency** **~Earning in USD**\n\nBitcoin 5.947 BTC $116,812.81\n\nEthereum 5.312 ETH $7,826.13\n\nDogecoin 34,355.528 DOGE $3,474.47\n\nBitcoin Cach 9.11997194 BCH $1,021.39\n\nCosmos (ATOM) 65.153 ATOM $846.44\n\nTezos 191.445553 XTZ $241.32\n\nDash 4.72446445 DASH $199\n\n_Table with monetary gain (data refreshed 2022-11-08)_\n\nThe amounts in the wallets ViperSoftX and VenomSoftX redirect stolen cryptocurrencies to add up to about $130,421.56, as of November 8,\n2022. This is just the amount sent to cryptocurrency wallets, and doesn’t include other possible profits from other activities.\n\n## Technical analysis\n\n Overview of the infection chain\n\n\n-----\n\n## From cracked software to fake logs\n\nIn the beginning, ViperSoftX is served to victims when they download what they believe to be cracked software. It is commonly named\n```\nActivator.exe or Patch.exe . Upon execution, however, the victim is infected with ViperSoftX.\n\n### Activator.exe extraction\nActivator.exe is in fact a loader that decrypts data from itself using AES in CBC mode.\n\n```\nThe decryption algorithm performs a checksum as follows:\n\n1. Read 4 bytes at offset `0x24 from the end of the file which gives an offset`\n2. Hash the offset value using SHA256\n3. Read the rest of the bytes (from `-0x20 ) and compare it to the hash`\n\nIf the checksum holds, the offset points to the location where the data is stored at `offset+0x24 from the end of the binary. Since the data is`\nstored from the end of the binary, offset is also the size of the data blob. This blob can be decrypted straight away using a hardcoded key as\nwell as IV inside the binary:\n\n\n-----\n\nKey `71C54C3BCFFCE591A70C0B5BA6448327BC975D89F3021053125F1CB9A7C0AF72`\n\nIV `C0BA0B56EAC742AFD4CB680EE0EB4FB0`\n\nThe decrypted data blob is a serialized protocol buffer structure. The structure template contains two protobuf messages as shown below:\n\nWe can use this template to deserialize the structure, revealing five different files:\n\nA log file with a hidden additional payload resulting in the `ViperSoftX PowerShell (see next subsections)`\n```\n   XML file for the task scheduler\n   SyncAppvPublishingServer.vbs (clean) that is used to create a scheduled task for persistence\n\n```\nApplication `binary (usually clean) that is supposed to be cracked`\n```\n   Manifest file\n\n```\n[Last but not least, you can find the extraction Python script in our GitHub repository.](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/extraction_script/extract_files.py)\n\n### Analyzing the files\n\nThe most interesting file is the aforementioned “log file” which is usually more than `5 MB in size and contains a single malicious line of code`\n(usually from `17,302 lines in total, but this might vary in different versions).`\n\nThis log file is usually named and stored as:\n```\nC:\\Windows\\Logs\\system-logs.txt\n\n```\n\nalthough we saw variants dropping the same “log” files disguising as a “driver” or a “text” file, e.g.\n```\nC:\\Windows\\System32\\Drivers\\p4kizn\\e12de1ae-2139-45f6-b883-3c58243f23d6.sys\n\n```\n```\nC:\\Windows\\2ZQ2UoL\\5A7C4B54-4404-4424-83DA-CC696BED43D3.txt\n\n```\nwhere the subfolder names and the GUIDs are randomized.\n\nAn example of such a malicious line can be found below. As we will see later, this line actually contains a script that is decoded and executed.\n\n_Example of the log file with a single malicious line on the line 17,034_\nThe malware creates a scheduled task using the legacy `SyncAppvPublishingServer.vbs script for executing these hidden scripts`\nafterward as well for ensuring persistence. Note that the line number varies depending on the malware configuration provided in the\nscheduled task.\n\n\n-----\n\n### dde Sc pt a a ts\n\nWe have seen two variants of hidden scripts lurking in the logs so far.\n\nThe first variant is a simple dropper that downloads another payload from a hardcoded C&C server and executes it. We have only seen the\nViperSoftX information stealer downloaded as a payload so far. We will cover the stealer separately in the subsection below.\n\n_The first variant of_\n\n_the PowerShell script – simple dropper_\nThe second variant is in the form of a PowerShell script without the encoding. This script contains two parts, the first one is a set of decryption\nfunctions and the second is an encrypted data blob.\n\n_Example of the log file with a single malicious line on line 17,034 (second variant)_\nThe script uses AES in CBC mode to decrypt the payload, the ViperSoftX stealer. The AES key is passed via the command line by the\n[scheduled task created by Activator.exe. You can find the decryption process in this CyberChef template.](https://gchq.github.io/CyberChef/#recipe=Reverse('Character')From_Base64('A-Za-z0-9%2B/%3D',true,false)To_Hex('None',0)Register('(.%7B32%7D)',true,false,false)Drop_bytes(0,32,false)AES_Decrypt(%7B'option':'Base64','string':''%7D,%7B'option':'Hex','string':'%24R0'%7D,'CBC','Hex','Raw',%7B'option':'Hex','string':''%7D,%7B'option':'Hex','string':''%7D))\n\n## ViperSoftX Information Stealer\n\nWhen the payload is dropped, an obfuscated `ViperSoftX PowerShell script is presented to us. We have seen multiple variants of`\nViperSoftX, suggesting that the malware is under active development. In the text below, we will cover the stealer’s features as a whole.\n\n### Stealing Capabilities\n\nFirst, let’s have a look at what ViperSoftX is actually capable of stealing. ViperSoftX performs fingerprinting of the infected machine, focusing\non various types of information, including:\n\nComputer name\nUsername\nOS information and its architecture\nInstalled antivirus or other security software and whether the solution is active\n\nThe malware focuses on stealing cryptocurrencies. To do so, it searches the typical locations for web browser extensions and locally stored\nwallets. The full list of locations can be found in the Appendix. More generic information, such as OS, architecture, and username, is obtained\nusing `WMI and system variables.`\n\nViperSoftX searches for cryptocurrencies stored locally on the infected device in cryptocurrency software and browser extensions, and\nmonitors the clipboard for cryptocurrency wallet addresses to perform clipboard swapping.\n\nThe gathered data, as well as the fingerprint, is then concatenated together into a single string, encoded by base64, and sent to the\nhardcoded C&C server in the `User-Agent HTTP header. Note that C&C servers vary across versions:`\n```\nhttp://api.private-chatting[.]com/connect\n\n```\n\nEach time the victim copies anything to their clipboard, ViperSoftX scans the content using predefined regular expressions in the background.\nIf the expression matches one of the configured wallet addresses belonging to the specific cryptocurrency, the malware replaces the content\nwith the attacker’s address and sends a notification to the C&C server in the `X-Notify HTTP header in a form of three values:`\n```\nCryptocurrency type - victim’s address - attacker’s address\n\n```\n\n-----\n\ne c yptocu e cy type e ects at type o c yptocu e cy as atc ed a d ca be o e o t e o o g `C,` `C`,,,,\n```\nXRP, DOGE, or DASH .\n\n```\nThe malware also checks title texts of opened windows ( MainWindowTitle property) and if it spots an application focused on\ncryptocurrencies or finance, it logs its presence into:\n```\n%SystemDrive%\\Users\\Public\\log.dat\n\n```\n\nThe full list of searched keywords can be found in the Appendix.\n\nOn top of the information-stealing core, ViperSoftX provides RAT functionalities as well, like executing arbitrary commands on the command\nline, downloading an additional arbitrary payload provided by the C&C server, and executing it, as well as removing itself completely from the\nsystem. The RAT functionality can also be used, for example, to steal cryptocurrencies from their locations, which it previously identifies and\nsends to the C&C server.\n\n### Host Header Spoofing\n\nAside from trying to steal cryptocurrencies, the malware spoofs host headers to obfuscate its communication with the C&C servers.\n\nThe spoofed host header consists of five to 10 lowercase alpha letters, but the true destination is in the hardcoded `$meta_host variable.`\nThis way, the real C&C server address is obfuscated by a random-looking domain that doesn’t exist.\n\n## VenomSoftX Browser Extensions\n\nNewer versions of ViperSoftX information stealer are capable of loading a custom malicious browser extension to `Chromium-based`\n```\nbrowsers installed on infected computers. The extension is provided by the C&C server. The extension is basically another standalone\n\n```\ninformation stealer, we are calling VenomSoftX, but is installed by ViperSoftX, as described below. The extension disguises itself as various\npopular browser extensions to avoid user detection.\n\nThe main goal VenomSoftX is also to steal cryptocurrencies from the unsuspecting victim. The difference is, VenomSoftX mainly does this by\nhooking API requests on a few very popular crypto exchanges victims visits/have an account with. When a certain API is called, for example,\nto send money, VenomSoftX tampers with the request before it is sent to redirect the money to the attacker instead. Although similar in\nprinciple to what information stealers like ViperSoftX do and rather a common clipboard swapping, this technique is performed at a lower\nlevel, meaning the victim has little to no chance of noticing the money is being transferred elsewhere.\n\n### Installing the extension\n\nViperSoftX’s approach is simple. The malware downloads a `VenomSoftX PowerShell installer from the C&C server e.g. by base64-`\ndecoding a hardcoded request metadata directly from the PowerShell script, following a request to:\n```\nhttp://apps-analyser[.]com/api/v1/<HASH>\n\n```\n\ndepending on the malware version. This can hold different payloads, but we will focus on the VenomSoftX browser extension.\n\nAfter the installer script is downloaded from the C&C server and the `VenomSoftX browser extension is extracted, the installer searches`\nseveral locations for .lnk files and if such a link file belongs to `Chrome,` `Brave,` `Opera, or` `Edge, it modifies the link file with a parameter`\n```\n--load-extension=<path_to_the_malicious_extension> . This way, when the user starts their favorite browser, they actually load the\n\n```\nmalicious extension with it.\n\nThese locations are checked for link files leading to browsers:\n```\n   %USERPROFILE%\\Desktop\n   %USERPROFILE%\\OneDrive\\Desktop\n   %PUBLIC%\\Desktop\n   %ALLUSERSPROFILE%\\Microsoft\\Windows\\Start Menu\\Programs\n   %APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\n   %APPDATA%\\Microsoft\\Internet Explorer\\Quick Launch\\User Pinned\\TaskBar\n\n```\nThe extension ID is randomly generated, provided random lowercase characters to represent the extension folder and randomly generated\nversion number of the extension:\n```\n$(Get-Random -Minimum 1 -Maximum 10).$(Get-Random -Minimum 1 -Maximum 10).$(Get-Random -Minimum 1 -Maximum 10)._0\n\n```\n\n-----\n\ne obse ed u t e e s o s o pe So t co ta g a u update ec a s ese e s o s e e ab e to a t oug t e od ed\n```\n.lnk files, parse the manifest.json file of the malicious extension, and when an older version or an old write timestamp of the extension\n\n```\nwas detected on the infected system than what was advertised by the C&C server, the malware requested an update and replaced the\nextension files to the newest version by a dedicated command (provided by the C&C server).\n\nThe extension tries to disguise itself as well known and common browser extensions such as `Google Sheets . In reality, the VenomSoftX is`\nyet another information stealer deployed onto the unsuspecting victim with full access permissions to every website the user visits from the\ninfected browser.\n\n### Diving into javascript shenanigans\n\nThe extension contains several files, as shown in the table below. Each file has a different purpose:\n\n**File name** **Purpose**\n\n128.png Google Sheets icon to disguise the extension\n\ncontent.bootstrap.js Orchestrates the malicious activity, sends results using MQTT\n\nmanifest.json The extension’s manifest file\n\nrules.json URL filter rules for Kucoin\n\nwebpack_block.js Request tampering and credential theft on Blockchain.com\n\nwebpack_bnb.js Request tampering and cryptocurrency theft on Binance\n\nwebpack_cb.js Request tampering and cryptocurrency theft on Coinbase\n\nwebpack_common.js Contains an address book for pattern matching, clipboard monitoring and stealing\n\nwebpack_content.js When no exchange is detected – attacker’s addresses are replaced on the visited websites with the ones that victim\nentered earlier\n\nwebpack_gt.js Request tampering and cryptocurrency theft on Gate.io\n\nwebpack_kuc.js Request tampering and cryptocurrency theft on Kucoin\n\nThe malware focuses on five big cryptocurrency exchanges, reflected by abbreviations in the modules names.\n\nIn the paragraphs below, we’ll focus on what each of the modules do, in detail.\n\n**content.bootstrap.js**\n\nThis module is the starting point of VenomSoftX and it is loaded with every site visit. It orchestrates what modules to load and it is also\nresponsible for sending stolen data to the C&C server.\n\nThe scripts are loaded depending on the visited domain. The bootstrap checks what site is being loaded and if it is one of the following:\n```\nBlockchain.com, Binance, CoinBase, Gate.io, or Kucoin, the module loads an appropriate “ webpack ”. If the user is on any other\n\n```\nsite, `webpack_content.js is loaded. The module` `webpack_common.js is loaded by default regardless of which site the victim visits.`\n\n\n-----\n\n_Determination_\n\n_process which modules to load (deobfuscated)_\nAll the modules serve their own purpose. However, two of the modules, `webpack_common.js and` `webpack_block.js, are capable of`\nsending data back to the collector server using a `Paho MQTT client present in the` `content.bootstrap.js . The MQTT client has an`\nevent listener set to a hardcoded value `b8b0becb-080a-46af-9688-e3671fcc4166 that indicates data should be sent to an MQTT broker,`\nharvesting the data:\n```\nbroker.emqx[.]io\n\n```\n\nNote that the collector address can vary in different versions.\n\nThe sent data are structured as follows:\n```\nMSG: time: <utc_datetime>\n\n```\n```\nip: <client_ip>\n\n```\n```\ndata: <data>\n\n```\n\nThe `time and` `ip fields are obtained using a public service ( https://worldtimeapi.org/api/ip ).`\n\nThe `data field is either clipboard content with a cryptowallet and other metadata, or stolen credentials for` `blockchain.com . See further`\nsections below for details.\n\n**webpack_common.js**\n\nThe “ common ” module is loaded to every website, regardless of whether it is a cryptocurrency exchange or something else. It is used to\ndefine an address book with regular expression patterns, which is used for crypto address matching on several occasions in other modules.\n\nThe structure of the address book is in the form of a dictionary, where the key is the regular expression and the value is yet another dictionary\ncontaining three values: `coin,` `address, and` `network . An example of such an address book can be seen in the below snippet. For the`\nfull address book, see Appendix.\n\n\n-----\n\n_A snippet of a possible_\n\n_address book (incomplete, deobfuscated)_\nFurthermore, each time the user pastes anything into any website (except the malicious address from the address book), this module checks\nwhether the clipboard content matches any of the regular expressions from the address book and if they do, it sends the following data to the\ncollector server encoded using base64. The data for the MQTT message has a following construct:\n```\nAction\n\n```\n```\nBrowser: <USER-AGENT>\nClipboard: <CLIPBOARD-WALLET-ADDRESS>\n\n```\n```\nTime: <TIMESTAMP>\n\n```\n\n**webpack_content.js**\n\nThis module monitors two input elements for content the user fills into websites and it is loaded when the victim is outside of any of the\nmentioned exchange sites:\n```\n   HTMLInputElement\n   HTMLTextAreaElement\n\n```\nThis is done by implementing hooks in getters of these elements to try to find a compatible crypto address for the user’s input and if found,\nthe malware creates new `localStorage entry with a combination of visited site and the compatible address:`\n```\nwebsite_attackerAddress: userAddress\n\n```\n\n-----\n\ne co pat b e add ess s ou d e t e p o ded add ess atc es a y o t e egu a e p ess o s o t e add ess boo desc bed t e\nprevious section.\n\nAfter that, a custom `MutationObserver watches for dynamic changes in the site (e.g. loading the page, displaying a message sent earlier`\nin the user’s messenger client, etc.) and if such a change occurs, the malware replaces all mentions of the malicious address (if found) with\nthe user’s address using the `localStorage . This effectively hides all traces of the malicious address in the website’s body.`\n\nNote that since the information is stored directly in the persistent `localStorage, the functionality survives a browser restart, PC restart, or`\nre-visiting the page anytime in the future. The victim has to clear the user data in their browser or uninstall the malware extension altogether\nto get rid of the malicious behavior.\n\nFor the sake of demonstrating this behavior, we decided to create a `demo PoC of a simple page that illustrates the whole process of content`\ntampering while the malware is active:\n\n1. First two buttons, `Attacker address and` `User address, fill in attacker address or user address to the “ Dynamic content to be`\n```\n   pasted ” line on the webpage\n\n```\n2. “ Get value ” button triggers the getter but the hook is inactive since the provided address doesn’t match cryptowallet address pattern\n\n(it is too short)\n3. The user fills in a `compatible address`\n4. “ Get value ” button creates a `localStorage entry with the entered address`\n5. The attacker’s address is always replaced with the one from `localStorage`\n\n_Demo illustrating the content tampering process_\n\n### Draining the victim’s accounts\n\nAs we already mentioned, VenomSoftX focuses on five different crypto exchanges/websites, namely on `Blockchain.com,` `Binance,`\n```\nCoinbase, Gate.io, and Kucoin .\n\n```\nIn these modules, the malware tries to tamper with API requests the sites use for several actions like money withdrawal or sending security\ncodes. This is done by creating hooks on the API calls (or rather functions responsible for sending those requests), parsing their structure,\nand replacing the response’s body with the desired attacker’s contents – commonly meaning that the recipient’s address is replaced by the\nattacker’s one as well as the amount is set to the value of an available account balance if known. The request is then processed by the\nmalware without the user noticing anything, completely draining the victim’s portfolio as a result.\n\nNote that the user has little to no chance to notice this. In comparison to a rather common clipboard swapping, for example, this “swapping” is\nperformed on a lower level. Since the transactions on blockchains/ledgers are inherently irreversible, when the user checks the transaction\nhistory of payments afterward, it is already too late.\n\nThe complete list of hooked API functions can be found in the Appendix. The only file that differs from the rest is `webpack_block.js . This`\nmodule focuses on `www.blockchain.com and it tries to hook` `https://blockchain.info/wallet . It also modifies the getter of the`\npassword field to steal entered passwords. Once the request to the API endpoint is sent, the wallet address is extracted from the request,\nbundled with the password, and sent to the collector as a base64-encoded JSON via MQTT.\n\nSince the rest of the hooks are the same on the higher level if we ignore API differences, we will use the Binance module as an illustration\nexample.\n\nThe Binance module recognizes six different API calls invoking malicious interactions. When the user logs in to the site, it is expected that at\nsome point the API function\n```\nhttps://www.binance.com/bapi/asset/v3/private/asset-service/asset/get-user-asset\n\n```\n\nwill be called. VenomSoftX then parses and saves all assets available on the victim’s account. When the user tries to manipulate their\nsavings, e.g. withdrawing their money, the malware intercepts the request\n```\nhttps://www.binance.com/bapi/capital/v3/private/capital/withdraw/apply\n\n```\n\n-----\n\na d ta pe s t t e equest body, od y g t e add ess to ed ect t e o ey to t e attac e s add ess a co pat b e attac e s add ess\nwas found. The amount of the request is also set to the maximum amount available obtained by the previous step. After the tampering, the\nrequest is passed further like nothing happened, effectively draining the victim’s wallet.\n\n## Conclusion\n\nIn this blog post, we took a closer look at ViperSoftX, a long-standing information stealer, and its malicious browser extension payload\nVenomSoftX. We described both information stealers’ infection chains, and how the original payload hides and decrypts on the infected\nsystem.\n\nWe described what both ViperSoftX and VenomSoftX steal and how the browser extension leverages its full access to every page the victim\nvisits and carries out man-in-the-browser attacks by silently tampering with the API requests popular cryptocurrency exchanges use, resulting\nin draining the victim’s accounts.\n\n## Indicators of Compromise (IoC)\n\nGitHub repository: [ViperSoftX](https://github.com/avast/ioc/blob/master/ViperSoftX/)\n\n## ViperSoftX\n\n**File name** **SHA256**\n\nActivator.exe e1dc058fc8282acb95648c1ee6b0bc36b0d6b5e6853d4f602df5549e67d6d11a\n\nHidden log script first variant 0bad2617ddb7586637ad81aaa32912b78497daf1f69eb9eb7385917b2c8701c2\n\nHidden log script second variant 0cb5c69e8e85f44725105432de551090b28530be8948cc730e4b0d901748ff6f\n\nViperSoftX PowerShell 23b9075dac7dbf712732bb81ecd2c21259f384eb79ae8fdebe29b7c5a12d0519\n\nViperSoftX’s browser installer 5c5202ed975d6647bd157ea494d0a09aac41d686bcf39b16a870422fa77a9add\n\n## VenomSoftX\n\n**File name** **SHA256**\n\ncontent.bootstrap.js 3fe448df20c8474730415f07d05bef3011486ec1e070c67683c5034ec76a2fcb\n\nmanifest.json 0de9a23f88b9b7bda3da989dce7ad014112d88100dceaabca072d6672522be26\n\nrules.json 1d6845c7b92d6eb70464a35b6075365872c0ae40890133f4d7dd17ea066f8481\n\nwebpack_block.js 7107ab14a1760c6dccd25bf5e22221134a23401595d10c707f023f8ca5f1b854\n\nwebpack_bnb.js ddee23e2bfd6b9d57569076029371e6e686b801131b6b503e7444359d9d8d813\n\nwebpack_cb.js 947215a1c401522d654e1d1d241e4c8ee44217dacd093b814e7f38d4c9db0289\n\nwebpack_common.js 7b75c1150ef10294c5b9005dbcd2ee6795423ec20c512eb16c8379b6360b6c98\n\nwebpack_content.js d7dfc84af13f49e2a242f60804b70f82efff7680cddf07f412667f998143fe9c\n\nwebpack_gt.js 4da1352e3415faa393e4d088b5d54d501c8d2a9be9af1362ca5cc0a799204b37\n\nwebpack_kuc.js 705deecbbb6fd4855df3de254057c90150255c947b0fb985ea1e0f923f75a95f\n\n## C&C\n\n**C&C**\n\napi.private-chatting[.]com\n\napps-analyser[.]com\n\nwmail-blog[.]com\n\nwmail-service[.]com\n\n## Appendix\n\n\n-----\n\n## Scripts and tools\n\n[Extractor for ViperSoftX’s initial payloads (commonly named](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/extraction_script) `Activator.exe )`\n[CyberChef template for decrypting the second variant of the hidden scripts in logs](https://gchq.github.io/CyberChef/#recipe=Reverse('Character')From_Base64('A-Za-z0-9%2B/%3D',true,false)To_Hex('None',0)Register('(.%7B32%7D)',true,false,false)Drop_bytes(0,32,false)AES_Decrypt(%7B'option':'Base64','string':''%7D,%7B'option':'Hex','string':'%24R0'%7D,'CBC','Hex','Raw',%7B'option':'Hex','string':''%7D,%7B'option':'Hex','string':''%7D))\n\n## List of wallet addresses\n\n**Cryptocurrency** **Address**\n\nADA addr1q9c27w7u4uh55sfp64ahtrnj44jkthpe7vyqgcpt73z9lrq7fw3juld8k2ksz2p82tv45j8yc5wzqmr4ladxyt0vjxrsf33mjk\n\nATOM cosmos1mcah8lel6rxhlqsyrzpm8237cqcuzgyw70nm6f\n\nBNB bnb1u64a2n3jhw4yh73s84rc58v8wxrwp7r8jwakpr\n\nBNB bnb1vmwl54jxj9yvsgz33xtyuvqnurdjy2raqnttkq\n\nBTC 1L8EBHDeiHeumtcpcroaxBceXnWFiYU5dh\n\nBTC 1Pqkb4MZwKzgSNkaX32wMwg95D9NfW9vZX\n\nBTC 32Wx3dsHCCxyJZLwseFYkgeFqVk16tCCcF\n\nBTC 3JvBvRuBfYvB6MjzMornj9EQpxhq9W7vXP\n\nBTC bc1qn6ype8u5kgj672mvsez9wz9wt9wk22tzd5vprp\n\nBTC bc1qxgz2g8kn2kg0wqqrmctyxu5n925pnwphzlehaw\n\nBTC qq9yrhef7csy3yzgxgs0rvkvez440mk53gv8ulyu6a\n\nBTC qqh3g98z60rdl05044xxt7gkgncezmdfy5tja99z53\n\nDASH XdxTmTFuHrcHnQQhfweAnHtExFB5BXmU1z\n\nDASH Xtwj8uGx77NYBUki1UCPvEhe4kHYi6yWng\n\nDOT 122zNSYNN2TSR2H5wBCX16Yyvq7qLFWo1d6Lvw2t9CNxMxt1\n\nDOGE DDxhfK5wbJkRN25mAbBYk3ND4xLjiMRyNq\n\nDOGE DUUNTm23sVwLyiw27WW9ZPT9XfiWhB1Cvf\n\nETH 0x12507F83Dde59C206ec400719dF80D015D9D17B6\n\nETH 0x884467182849bA788ba89300e176ebe11624C882\n\nKAVA kava1emxzwjw84e0re7awgue9kp4gseesyqrttg69sm\n\nSOL 7j5bxiFPSsScScBEjLj9qud5Yc2CqXGmembX3hQBdFTd$\n\nUSDT TDJLMdJWPrKNMHuxgpQL8QPYgvdXTnWJao\n\nXMR 475WGyX8zvFFCUR9ufThrNRtJmzmU13gqH9GV2WgAjbR7FgRVCWzokdfVf2hqvRbDBaMzBm1zpDiBTpBgxLt6d7nAdEEh\n\nXMR 48qx1krgEGzdcSacbmZdioNwXxW6r43yFSJDKPWZb3wsK9pYhajHNyE5FujWo1NxVwEBvGebS7biW9mjMEWdMevqMGm\n\nXRP rH6dyKWNpcvFz6fQ4ohyDbevSxcxdxfSmz\n\nXRP rpzn8Ax7Kz1A4Yi8KqvzV43KYsa59SH2Aq\n\nXTZ tz1g6rcQAgtdZc8PNUaTUzrDD8PYuCeVj4mb\n\nZEC t1XjiZx8EydDDRuLisoYyVifcSFb96a3YBj\n\nZIL zil1aw3kyrymt52pq2e4xwzusdfce9e5tmewvshdrm\n\nAlso in our [GitHub.](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/wallets.csv)\n\n## ViperSoftX\n\n### List of monitored cryptocurrency locations\n\n[Complete list in our Github.](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/list_of_locations.txt)\n\n### List of monitored window titles\n\n\n-----\n\n**Monitored window titles**\n\nbinance\n\ncoinbase\n\nblockchain\n\nvoyager\n\nblockfi\n\ncoindesk\n\netoro\n\nkucoin\n\nciti\n\npaxful\n\npaypal\n\nhuobi\n\npoloniex\n\nbittrex\n\nkraken\n\nbitfinex\n\nbitstamp\n\nAlso in our [GitHub.](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/list_of_keywords.txt)\n\n## VenomSoftX\n\n### Address book\n\n[Complete list in our Github.](https://github.com/avast/ioc/blob/master/ViperSoftX/extras/VenomSoftX_address_book.txt)\n\n### List of hooked API calls\n\n**Blockchain.com**\n\nhttps://blockchain.info/wallet\n\n**Binance**\n\nhttps://www.binance.com/bapi/accounts/v1/protect/account/email/sendEmailVerifyCode\n\nhttps://www.binance.com/bapi/accounts/v1/protect/account/email/sendMobileVerifyCode\n\nhttps://www.binance.com/bapi/kyc/v1/private/risk/check/withdraw-pre-check\n\nhttps://www.binance.com/bapi/capital/v3/private/capital/withdraw/apply\n\nhttps://www.binance.com/bapi/asset/v3/private/asset-service/asset/get-user-asset\n\nhttps://www.binance.com/bapi/capital/v1/private/capital/deposit/queryUserDepositAddress\n\n**Coinbase**\n\nhttps://www.coinbase.com/api/v3/coinbase.public_api.authed.sends.Sends/CreateSend\n\nhttps://www.coinbase.com/api/v3/coinbase.public_api.authed.sends.Sends/CreateSendMax\n\nhttps://www.coinbase.com/api/v3/coinbase.public_api.authed.accounts.Accounts/GetAccounts\n\nhttps://www.coinbase.com/api/v3/coinbase.public_api.authed.sends.Sends/CommitSend\n\n\n-----\n\nhttps://www.coinbase.com/graphql/query?&operationName=ReceiveContentQuery\n\n**Gate.io**\n\nhttps://www.gate.io/myaccount/second_confirm\n\n**Kucoin**\n\nhttps://www.kucoin.com/_api/payment/withdraw/safe-img\n\nhttps://www.kucoin.com/_api/payment/withdraw/apply\n\nhttps://www.kucoin.com/_api/account-front/query/currency-balance\n\nhttps://www.kucoin.com/_api/payment/deposit-address/get\n\n[Tagged asanalysis,](https://decoded.avast.io/tag/analysis/) [browser extension,](https://decoded.avast.io/tag/browser-extension/) [cryptocurrency,](https://decoded.avast.io/tag/cryptocurrency/) [malware,](https://decoded.avast.io/tag/malware/) [stealer](https://decoded.avast.io/tag/stealer/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-21 - ViperSoftX- Hiding in System Logs and Spreading VenomSoftX.pdf"
    ],
    "report_names": [
        "2022-11-21 - ViperSoftX- Hiding in System Logs and Spreading VenomSoftX.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535946,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1669662667,
    "ts_modification_date": 1669662667,
    "files": {
        "pdf": "https://archive.orkl.eu/9e4a36366f4e4fc3ef7d9e96bf3c3e9432ecb87d.pdf",
        "text": "https://archive.orkl.eu/9e4a36366f4e4fc3ef7d9e96bf3c3e9432ecb87d.txt",
        "img": "https://archive.orkl.eu/9e4a36366f4e4fc3ef7d9e96bf3c3e9432ecb87d.jpg"
    }
}