{
    "id": "d73a9c02-fe37-4a61-9225-498fff86414f",
    "created_at": "2023-01-12T15:03:59.973144Z",
    "updated_at": "2025-03-27T02:06:01.239392Z",
    "deleted_at": null,
    "sha1_hash": "85f40d299e37c7e19dae0d64a588e283afbef4f4",
    "title": "2021-04-13 - Detecting Clop Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:11:05Z",
    "file_modification_date": "2022-05-28T23:11:05Z",
    "file_size": 1935870,
    "plain_text": "# Detecting Clop Ransomware\n\n**[splunk.com/en_us/blog/security/detecting-clop-ransomware.html](https://www.splunk.com/en_us/blog/security/detecting-clop-ransomware.html)**\n\nSECURITY\n\n\nApril 13, 2021\n\n\nBy [Splunk Threat Research Team April 13,](https://www.splunk.com/en_us/blog/author/secmrkt-research.html)\n\n2021\nAs [ransomware campaigns continue, malicious actors introduce different modus operandi](https://www.hhs.gov/sites/default/files/analyst-note-cl0p-tlp-white.pdf)\nto target their victims. In this blog, we’ll be taking a look at the Clop ransomware. This\n[crimeware was discovered in 2019 and is said to be used for an attack that demanded one](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/clop-ransomware/)\n[of the highest ransom amounts in recorded history ($20 million).](https://blogs.infoblox.com/security/clop-ransomware-demands-20-million-ransom/)\n\nTheir strategy is to send the malicious payloads via different methods, such as phishing\nemails, and spreading ransomware payload post-exploitation by exploiting exposed or\nrelated vulnerable systems. Actors behind this crimeware then present instructions on how\nto pay ransom and communicate further threats of exposure by publishing the sensitive\ninformation they obtained on a publicly accessible website.\n\nAlthough this may appear as a new modality, in reality ransomware is usually the cherry on\ntop of the cake, as malicious actors usually dwell, exfiltrate and qualify exfiltrated data,\nwhich eventually lands on dark web public forums, dark markets or private crime\nintelligence brokers where qualified financial, business and kompromat information is then\npriced and sold to the highest bidder.\n\n\n-----\n\n[*Source: Vericlouds](https://www.vericlouds.com/wp-content/uploads/2016/06/FICO-1.png)\n\nThe above is a simple example of how compromised information is brokered in dark\nmarkets. Some private crime intelligence brokers actually present specific company names\nand verticals. All this information comes from malicious campaigns; victims realize they\nhave been compromised when they observe ransomware in their systems.\n\n\n-----\n\nIn the case of Clop ransomware, the perpetrators threaten to publish stolen information in a\npublicly accessible site via an onion router (Tor), as seen in the screen capture below.\n\n## The Attack\n\nThe actors behind Clop ransomware are financially motivated and clearly target several\nindustry verticals. Ransomware is by nature a post-exploitation tool, so before deploying it\nthey must infiltrate the victim's infrastructure. At the Splunk Threat Research team we\n[decided to try this payload on our Splunk Attack Range Local, and this is what we found.](https://github.com/splunk/attack_range_local)\n\nWe first started by creating a local environment with a Windows Domain Controller.\n\n\n-----\n\nWe then simply executed the sample:\n[d0cde86d47219e9c56b717f55dcdb01b0566344c13aa671613598cab427345b9.](https://www.virustotal.com/gui/file/d0cde86d47219e9c56b717f55dcdb01b0566344c13aa671613598cab427345b9/detection)\n\nFiles were encrypted pretty quickly and added the .Clop extension. We can also observe\nthe appearance of the ransomware note (ClopReadMe.txt).\n\n\n-----\n\nThe above screenshots show how quickly data is encrypted, and the victim is clearly\nwarned not to attempt to decrypt. They are also threatened with all file deletion after a\nperiod of two weeks.\n\n## Reverse Engineering Breakdown\n\n**Sandbox Evasion**\n\nThe Clop binary performs several checks, including running command arguments like\n“runrun” to enumerate and encrypt the network.\n\n**Defense Evasion**\n\nThis ransomware has a defense evasion feature where it tries to delete all the logs in the\ninfected machine to avoid detection.\n\n\n-----\n\n## Encryption\n\nThis ransomware uses the AES and rc4 algorithm to encrypt the file.\n\n## Infection\n\nThe binary makes sure only one instance of its code runs on the machine it creates a\nmutex. If the mutex already exists it will exit the process.\n\n## Kill Switch\n\nSome variants of this malware contain a kill switch. The binary checks the keyboard layout\nof the infected machine and its locale identifier (language). In our sample analysis we found\nthat it tries to skip infection or delete itself if the locale identifier or the keyboard layout is\nGeorgian, Uzbek, Azeri, Kazakhstani or Kyrgyzstani.\n\n\n-----\n\n## Kill Switch Function\n\n Encrypting Network Objects\n\nThe following thread is responsible for encrypting files within the network shares by using\nthe following API of mpr.dll as seen below:\n\nWNetOpenEnumW\nWNetEnumResourceW\n\n\n-----\n\nWNetCloseEnum\n\n## Encrypting Drives By Type\n\nThe payload can encrypt files on three drive types (FIXED_DRIVE, REMOVABLE_DRIVE\nand REMOTE_DRIVE). This function allows the execution of encryption on pretty much any\nattached or mapped drives, including both local and attached, like a USB hard drive, for\nexample, or remote drives usually mapped for backups and centralized data.\n\n\n-----\n\n## Deleting and Resizing Shadow Storage\n\nMany ransomware variants target the Volume Shadow Copy Service, which is a feature of\nWindows that allows the operator to restore data from backup. The expected behavior is the\ndeletion of the shadow copy storage. In this variant we found that it first deletes the files and\nthen it resizes them in order to prevent the generation of shadow volume copies, which\neffectively impairs this service’s capabilities.\n\n**Encrypted. rsrc Section (Ransomware Notes and Resizing Shadow Storage)**\n\nThe .rsrc section is the common place where the encrypted ransomware notes and some\nscripts are located. This figure shows how it enumerates or looks for the right resource data\nto decrypt the ransomware note and save it as ClopReadMe.txt.\n\n## Detections\n\n\n-----\n\nThe Splunk Threat Research Team has developed a new Analytic Story to detect a Clop\nransomware threat; it consists of new and former detections, and you can use the following\ndetection searches.\n\nSuspicious wevtutil usage\nWindows Event Log Cleared\nCommon Ransomware Notes\nDeleting Shadow Copies\nCommon Ransomware Extensions (New version)\nHigh Frequency of File Deletion (New)\nClop Common Exec Parameter (New)\nClop Deleting itself (New)\nResizing Shadow Copies (New)\nClop Known Service Name (New)\nSuspicious Service File Path Creation (New)\nClop High Frequency Process Termination (New)\nHigh Frequency creation of ransomware notes (New)\n\n## Detection Searches Breakdown\n\nCommon Ransomware Extensions\n\n_Variant A_\n\n_Variant B_\n\n\n-----\n\nHigh Frequency of File Deletion\n\nResizing Shadow Copies\n\n_Raw Search_\n\n\n-----\n\nClop Common Exec Parameter\n\nClop Deleting itself\n\nClop Known Service Name\n\nSuspicious Service File Path Creation\n\n\n-----\n\nClop High Frequency Process Termination\n\nHigh Frequency creation of ransomware notes\n\n_Variant B_\n\n_Variant A_\n\n\n-----\n\n## Hashes: SHA256\n\n[15f9ed36d9efc6e570b4f506791ce2c6a849853e2f6d587f30fb12d39dba2649](https://www.virustotal.com/gui/file/15f9ed36d9efc6e570b4f506791ce2c6a849853e2f6d587f30fb12d39dba2649/summary)\n[3d94c4a92382c5c45062d8ea0517be4011be8ba42e9c9a614a99327d0ebdf05b](https://www.virustotal.com/gui/file/3d94c4a92382c5c45062d8ea0517be4011be8ba42e9c9a614a99327d0ebdf05b/detection)\n[d0cde86d47219e9c56b717f55dcdb01b0566344c13aa671613598cab427345b9](https://www.virustotal.com/gui/file/d0cde86d47219e9c56b717f55dcdb01b0566344c13aa671613598cab427345b9/detection)\n[43e633a9a26287e9be7a4788d750258d64612e7b625ab5a3f0a9128469e99c2d](https://www.virustotal.com/gui/file/43e633a9a26287e9be7a4788d750258d64612e7b625ab5a3f0a9128469e99c2d/detection)\n\n## Defense\n\n[We can pursue further defensive actions by using the Splunk Phantom playbook Detect,](https://www.splunk.com/en_us/blog/security/playbook-series-ransomware-detect-block-contain-and-remediate.html)\nContain, and Remediate Ransomware, as shown in the following graphic.\n\nThis playbook is composed of the following steps:\n\n**Get file: Downloads the file sample from a repository.**\n**Detonate file: Submits the file sample for sandbox analysis.**\n**Block IP: Configures your infrastructure to block access to IP addresses associated**\nwith the ransomware.\n**Block hash: Configures your infrastructure to block access to files matching the hash**\nof a malicious sample.\n**Hunt file: Looks for indications of other infected devices in your environment.**\n\n\n-----\n\n**Terminate process: Terminates any instances of the malware actively executing.**\n**Quarantine device: Place the infected devices in quarantine to prevent it from**\ninfecting other devices.\n**List connections: Examine a device’s active connections/add newly discovered**\nmalicious IPs to the block ip action.\n**Disable user: Disable the user’s account to prevent further malware propagation.**\n\n[Please download the Splunk ES Content Update app from Splunkbase™ and install the](https://splunkbase.splunk.com/app/3449/)\nlatest version of our content update, which includes the new ransomware analytic story\nfocusing on Clop crimeware.\n\n### About the Splunk Threat Research Team\n\nThe Splunk Threat Research team is devoted to understanding actor behavior and\nresearching known threats to build detections that the entire Splunk community can benefit\nfrom. The Splunk Threat Research team does this by building and open-sourcing tools that\n[analyze threats and actors like the Splunk Attack Range and using these tools to create](https://github.com/splunk/attack_range)\nattack data sets. From these data sets, new detections are built and shared with the Splunk\n[community under Splunk Security Content. These detections are then consumed by various](https://github.com/splunk/security-content)\nSplunk products like Enterprise Security, Splunk Security Essentials and Mission Control to\nhelp customers quickly and effectively find known threats.\n\nPosted by\n\n**[Splunk Threat Research Team](https://www.splunk.com/en_us/blog/author/secmrkt-research.html)**\n\n\n-----\n\nThe Splunk Threat Research Team is an active part of a customer’s overall defense\nstrategy by enhancing Splunk security offerings with verified research and security content\nsuch as use cases, detection searches, and playbooks. We help security teams around the\nglobe strengthen operations by providing tactical guidance and insights to detect,\ninvestigate and respond against the latest threats. The Splunk Threat Research Team\nfocuses on understanding how threats, actors, and vulnerabilities work, and the team\n[replicates attacks which are stored as datasets in the Attack Data repository.](https://github.com/splunk/attack_data/)\n\nOur goal is to provide security teams with research they can leverage in their day to day\noperations and to become the industry standard for SIEM detections. We are a team of\nindustry-recognized experts who are encouraged to improve the security industry by\nsharing our work with the community via conference talks, open-sourcing projects, and\nwriting white papers or blogs. You will also find us presenting our research at conferences\nsuch as Defcon, Blackhat, RSA, and many more.\n\n[Read more Splunk Security Content.](https://github.com/splunk/security_content)\n\nTAGS\n[Cybersecurity](https://www.splunk.com/en_us/blog/tag/cybersecurity.html)\nShow All Tags\n\nShow Less Tags\n\n**Join the Discussion**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-13 - Detecting Clop Ransomware.pdf"
    ],
    "report_names": [
        "2021-04-13 - Detecting Clop Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535839,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653779465,
    "ts_modification_date": 1653779465,
    "files": {
        "pdf": "https://archive.orkl.eu/85f40d299e37c7e19dae0d64a588e283afbef4f4.pdf",
        "text": "https://archive.orkl.eu/85f40d299e37c7e19dae0d64a588e283afbef4f4.txt",
        "img": "https://archive.orkl.eu/85f40d299e37c7e19dae0d64a588e283afbef4f4.jpg"
    }
}