{
    "id": "d7731724-e096-4e47-a185-85dd797974ac",
    "created_at": "2023-05-06T02:09:58.795019Z",
    "updated_at": "2025-03-27T02:14:38.880427Z",
    "deleted_at": null,
    "sha1_hash": "ec9d119c7a37fb95212f23d8d9671122ebdc5945",
    "title": "2022-12-31 - Analyzing a VIDAR Infostealer Sample",
    "authors": "",
    "file_creation_date": "2023-05-05T02:04:36Z",
    "file_modification_date": "2023-05-05T02:04:36Z",
    "file_size": 819178,
    "plain_text": "# Analyzing a VIDAR Infostealer Sample\n\nJ **blog.jaalma.io/vidar-infostealer-analysis/**\n\n[← Home](https://blog.jaalma.io/)\n\n## Introduction\n\nWhile reviewing samples submitted to Any.Run, I came across a [binary that appeared to](https://app.any.run/tasks/8449e90f-586d-44e6-a277-f2be9aa0a2ca/)\ninject into a target process before performing some suspicious HTTP requests. After further\nanalysis, this binary was found to be consistent with the VIDAR infostealer.\nThis article aims\nto explain exactly how the infostealer works, the loader chain, what it attempts to steal, and\nhow it exfiltrates data stolen from the host in a short time without leaving a trace.\n\nSince this sample already had a dynamic, sandbox run within Any.Run, I decided to\ndownload a copy and attempt to reverse engineer it with the aim of understanding more\nabout how it worked, what it was designed to do, and to attempt to identify the malware\nfamily.\n\nThe sample being analyzed in this post has the following file hashes:\n\n**MD5: 9BB9FD7110158BEA15B3EB3881C52606**\n**SHA1: F545BF2A5E310ED8E9A8F553DA11B5C03D859A79**\n**SHA256: F2FEEFF2C03FE54E6F8415390CFA68671576D4CA598C127B5C73B60864E7372B**\n\nThe entire infection chain and malware operation can be summarized at a high level by this\ndiagram:\n\n\n-----\n\n## About VIDAR\n\nAlthough this is not unique to the VIDAR malware family, this infostealer performs a smashand-grab approach to harvesting data by harvesting as much data from the host and\nexfiltrating as quickly as possible. Public reporting shows that delivery mechanisms for the\n[VIDAR infostealer include fake software installers,](https://www.secureblink.com/cyber-security-news/tutorial-videos-on-you-tube-help-spread-vidar-and-raccoon-malware) [Windows 11 installers and even](https://www.zscaler.com/blogs/security-research/vidar-distributed-through-backdoored-windows-11-downloads-and-abusing) malicious\nMicrosoft help files delivered via phishing.\n\nSince the service provided to the customers of VIDAR exists only to facilitate payload\nconfiguration, generation and C2, it is left to the customer to get the malware on to systems;\nwhether themselves or via a third-party malware distribution service. An example of such a\n[malware distribution service is a group Microsoft tracks as DEV-0569, who leverage](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\ntechniques such as malvertising, phishing etc. to distribute BATLOADER; a separate\nmalware designed to deliver additional payloads, including VIDAR, ROYAL ransomware and\nCOBALT STRIKE.\n\n## Loader Analysis\n\n\n-----\n\nBased on the sandbox run, the binary appears to spawn a child process instance of\n```\nAppLaunch.exe, which is a legitimate binary and part of the .NET framework. The suspicious\n\n```\nactivity performed by the malware then appears to originate from this legitimate process,\nwhich is a good indicator that some form of process injection is occurring.\n\n## Initial Assessment\n\nThe binary being analyzed has the following characteristics:\n\n**MD5: 9BB9FD7110158BEA15B3EB3881C52606**\n**SHA1: F545BF2A5E310ED8E9A8F553DA11B5C03D859A79**\n**SHA256: F2FEEFF2C03FE54E6F8415390CFA68671576D4CA598C127B5C73B60864E7372B**\n**Compiled Timestamp: Fri Dec 23 14:09:41 2022 UTC**\n**Linker: Linker GNU linker ld (GNU Binutils)**\n\nThe executable itself has very few imports, which indicates that there is some form of\nobfuscation going on to conceal the malware’s true purpose and functionality.\n\n## First Stage Loader\n\nThis first loader works by XOR decrypting at runtime both the second stage malware, and an\nadditional loader shellcode, which loads the final stage payload. It then stores a pointer to\nthe decrypted loader shellcode in the register edx, that was previously made executable\nusing VirtualProtect. Next, it pushes the parameters to be passed to the loader function\n(consisting of a pointer to the decrypted second stage payload and a filepath to the injection\ntarget) on to the stack before executing it with a call edx instruction.\n\n\n-----\n\n## Second Stage Loader\n\nThe second stage loader performs the process injection to load the final stage payload into\nmemory. In this case, it used a process hollowing but not really approach to injecting the\nVIDAR binary into an AppLaunch.exe process.\n\nThe process injection method uses the following sequence of API calls:\n```\n   NtCreateUserProcess\n   VirtualAlloc\n   VirtualAllocEx\n   WriteProcessMemory\n   ResumeThread\n\n```\nFirstly, NtCreateUserProcess is called with the following arguments to spawn the process\ninjection target in a suspended state.\n\n\n-----\n\n```\nNtCreateUserProcess is an undocumented function, however more information about this\n\n```\n[function can be found here, and has been well documented by security researchers. For the](https://captmeelo.com/redteam/maldev/2022/05/10/ntcreateuserprocess.html)\npurposes of this loader, two important arguments are passed:\n```\n   CreateThreadFlags, which is set to 0x01, and corresponds to starting the process in a\n\n```\nsuspended state.\n```\n   ProcessParameters, which is a RTL_USER_PROCESS_PARAMETERS structure, and within it\n\n```\nthe image path C:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\AppLaunch.exe\nis provided.\n\nNext, the loader calls both VirtualAlloc and VirtualAllocEx to allocate a region in the\nmemory space of the target process for the final payload to be injected.\n\n**VirtualAlloc Arguments**\n\n**VirtualAllocEx Arguments**\n\nAs per the documentation for these functions, both calls pass in the same arguments. The\nonly difference being that VirtualAlloc is not provided a lpAddress pointer, which results in\nthe function returning a pointer to the allocated memory region, whereas the hProcess\nargument provided to VirtualAllocEx is 0x009C. Aside from those differences, the\narguments provided to both functions are the same:\n```\n   dwSize: 0x67000, which corresponds to 421888 bytes.\n   flAllocationType: 0x03000, which corresponds to both committing and reserving the\n\n```\naddress range in one step.\n```\n   flProtect: 0x40, which corresponds to read, write and execute (RWX) permissions.\n\n```\n\n-----\n\nThese API calls serve to allocate a region in memory for the target AppLaunch.exe process\nthat is readable, writable and executable, which allows the loader to finally write the bytes for\nthe finaly payload into this memory region within the target process using\n```\nWriteProcessMemory. Finally, the injected process is then resumed from its suspended state\n\n```\nusing ResumeThread, which allows it to execute the injected payload.\n\n## Dumping the Injected Payload\n\nDumping the injected payload was straight forward using x32dbg. All that was needed was a\nbreakpoint to be set to pause execution when the malware reaches the WriteProcessMemory\ncall.\n```\nbp WriteProcessMemory\nBOOL WriteProcessMemory(\n\n [in] HANDLE hProcess,\n\n [in] LPVOID lpBaseAddress,\n\n [in] LPCVOID lpBuffer,\n\n [in] SIZE_T nSize,\n\n [out] SIZE_T *lpNumberOfBytesWritten\n\n);\n\n```\n**WriteProcessMemoryArguments**\n\nThe arguments passed to WriteProcessMemory correspond to the following:\n```\n   hProcess: 0x009C, which is the same process handle passed into the previous\n   VirtualAllocEx function call.\n   lpBaseAddress: 0x00400000, which corresponds to the image base address in which\n\n```\nthe process memory is written.\n```\n   lpBuffer: 0x02EA0000\n   nSize: 0x67000, which corresponds to the same 421888 bytes.\n\n```\nThe argument of interest is lpBuffer, which is the pointer to the memory region containing\nthe bytes to be written to the memory space of the new process.\n\n\n-----\n\nAs shown, this memory region starts with a MZ header and DOS string, which means this\nmemory region must contain the binary that is being injected into AppLaunch.exe. The final\nstage executable payload can then be retrieved by dumping the memory region to disk.\n\n## Realigning the Dumped PE\n\nWhen viewing the dumped executable in PEBear, or CFF Explorer, both programs were\nunable to determine the presence of any imports used by the binary. This is actually because\nthe PE recovered from memory was in a mapped format. This caused a misalignment of\nsection offsets within the raw executable on disk and therefore resulted in a misaligned\nimport address table (IAT). [This video explains the concept far better than I can.](https://www.youtube.com/watch?v=WthvahlAYFY)\n\nFortunately, we can edit the section table to unmap the sections within the executable and\nrealign the IAT. By setting the raw address offsets to be equivalent to the virtual address\noffsets, and modifying the section sizes accordingly.\n\n\n-----\n\nNow the executable has been correctly aligned, the module and function imports are now\nreadable.\n\nSince we now have an unmapped exectable, it is possible to reverse engineer and analyze\nthe resulting payload. In this case, the reconstructed executable is written in C++.\n\n## VIDAR Infostealer Analysis\n\nOnce the dumped payload has been realigned and otherwise fixed to become a valid\nportable executable, the second stage executable has the following characteristics:\n\n**MD5: 47a6959ac869f65dd31e65b1c80fa8b2**\n**SHA1: f9d9ecf59523c202bca9ac4364b2a2042f116f32**\n**SHA256: 1521e9e7b06676a62e30e046851727fe4506bdf400bcf705a426f0f98fba5701**\n**Compiled Timestamp: Mon Dec 19 12:33:40 2022 UTC**\n**Compiler: Microsoft Visual C/C++**\n**Linker: Microsoft Linker 10.0 - (Visual Studio 2010)**\n\n### Encrypted Strings & Module Imports\n\nThe VIDAR malware stores some of its strings, and module imports in a base64-encoded,\nRC4 encrypted format. By combining the different functions in the binary, along with the\ndecrypted and decoded strings, we arrive at a full list of browser extensions targeted by the\nmalware.\nThese are mainly cryptocurrency wallets, but also include two factor authentication\n(2FA) extensions, and other password managers.\n\nBefore doing anything else, VIDAR first calls a built-in routine to base64-decode and RC4\ndecrypt each string before writing it into a memory region.\nA pointer to each string and\nmodule import can then be referenced by the malware to use them\n\n\n-----\n\nThe malware leverages the BCryptDecrypt API call to decode base64, and a custom-coded\nRC4 decryption function.\n\n**Cryptocurrency wallets and 2FA browser extensions and applications targeted by**\n**VIDAR**\n\n\n-----\n\n```\nTronLink\n\nMetaMask\n\nBinanceChainWallet\n\nYoroi\n\nNiftyWallet\n\nMathWallet\n\nCoinbase\n\nGuarda\n\nEQUALWallet\n\nJaxxLiberty\n\nBitAppWallet\n\niWallet\n\nWombat\n\nMewCx\n\nGuildWallet\n\nRoninWallet\n\nNeoLine\n\nCloverWallet\n\nLiqualityWallet\n\nTerra_Station\n\nKeplr\n\nSollet\n\nAuroWallet\n\nPolymeshWallet\n\nICONex\n\nHarmony\n\nCoin98\n\nEVER Wallet\n\nKardiaChain\n\nTrezor Password Manager\n\nRabby\n\nPhantom\n\nBraveWallet\n\nOxygen (Atomic)\n\nPaliWallet\n\nBoltX\n\nXdefiWallet\n\nNamiWallet\n\nMaiarDeFiWallet\n\nWavesKeeper\n\nSolflare\n\nCyanoWallet\n\nKHC\n\nTezBox\n\nTemple\n\nGoby\n\nAuthenticator\n\nAuthy\n\nEOS Authenticator\n\nGAuth Authenticator\n\nTronium\n\nTrust Wallet\n\n```\n\n-----\n\n```\nExodus Web3 Wallet\n\nBraavos\n\nEnkrypt\n\nOKX Web3 Wallet\n\nSender\n\nHashpack\n\nEternl\n\nGeroWallet\n\nPontem Wallet\n\nPetra Wallet\n\nMartian Wallet\n\nFinnie\n\nLeap Terra\n\nMicrosoft AutoFill\n\nBitwarden\n\nKeePass Tusk\n\nKeePassXC-Browser\n\nBitwarden\n\nEthereum\\Ethereum\\\n\nElectrum\\Electrum\\wallets\\\n\nElectrumLTC\\Electrum-LTC\\wallets\\\n\nExodus\\exodus\\conf.json,window-state.json\n\n\\Exodus\\exoduswallet\\passphrase.json,seed.seco,info.seco\n\nElectronCash\\ElectronCash\\wallets\\default_wallet\n\nMultiDoge\\MultiDoge\\multidogewallet\n\nJaxx_Desktop_Old\\jaxx\\Local Storage\\file__0localstorage\n\nBinance\\Binance\\app-store.json\n\nCoinomi\\Coinomi\\wallets\\\n\n*wallets\n\n*config\n\nwallet_path\n\nSOFTWARE\\monero-project\\monero-core,\\Monero\\\n\n```\nAlso encrypted in the binary are the SQL queries used to harvest data stored in web\nbrowsers:\n\n**SQL queries used by VIDAR to harvest browser data**\n```\nSELECT origin_url, username_value, password_value FROM logins\n\nSELECT name, value FROM autofill\n\nSELECT name_on_card, expiration_month, expiration_year, card_number_encrypted FROM\ncredit_cards\n\nSELECT target_path, tab_url from downloads\n\nSELECT url FROM urls\n\nSELECT HOST_KEY, is_httponly, path, is_secure, (expires_utc/1000000)-11644480800,\nname, encrypted_value from cookies\n\n```\nIn addition, one of the encrypted strings, C:\\ProgramData\\ is the staging directory used by\nthe malware when it downloads additional libraries and stages data for exfiltration. This\nstaging directory appears to be consistent across all VIDAR samples.\n\n\n-----\n\n### Retrieving C2 Servers\n\nThe malware stores its C2 servers in an unencrypted format within the binary:\n```\n   hxxps://t[.]me/traduttoretg\n   hxxps://steamcommunity[.]com/profiles/76561199445991535\n   hxxp://5.75.253[.]16:80\n\n```\nInterestingly, the VIDAR malware leverages legitimate services to host C2 configuration data.\nFor example, the Telegram and Steam profile links contain IP addresses, whereas the\n```\n5.75.253[.]16 appears to be consistent with threat actor infrastructure. This way, the\n\n```\nmalware operators can contiunously cycle C2 servers and have the malware beacon back to\neach new IP address so long as the social media profiles hosting the C2 IP address remain\nactive.\n\n\n-----\n\nThis particular VIDAR sample uses the string grundic to identify where on the webpage the\nC2 address is, and grabs the string up until the ending | character.\n\n### Initial C2 Callback\n\n\n-----\n\nOnce the malware has retrieved a C2 IP address from one of the social media profiles\nhardcoded within the binary, it then submits a HTTP GET request containing the profile ID of\nthe affiliate. Since the VIDAR malware is sold as an infostealer-as-a-service where the\n[cybercriminal gains access to a control panel to configure and generate the malware, this ID](https://any.run/malware-trends/vidar)\nis used to retrieve the configuration data set by the VIDAR customer. In this sample, the\nprofile ID is 1375.\n\n**VIDAR configuration retrieved**\n```\n1,1,1,1,1,36bfd46626a0b531909b016919dd1fbd,1,1,1,1,0,Default;%DOCUMENTS%\\;*.txt;50;tr\nue;movies:music:mp3;desktop;%DESKTOP%\\;*.txt:*.doc:*.docx:*.xlsx:*.xlsm:*.xls:*.pptx;\n950;true;movies:music:mp3:exe;\n\n### Downloading Additional Libraries\n\n```\nTo be able to perform its full credential harvesting tasks, the VIDAR malware must download\nadditional DLL libraries to extend its capability. For example, to interact with web browsers or\nuse SQLite3.\n\nIn previous samples, the download of these additional libraries was achieved by sending a\nHTTP GET request to the C2 server for a ZIP file named with random alphanumeric\ncharacters. In an apparent change of technique, or configuration, this sample retrieves the\nadditional libraries by downloading a resource from the C2 server named update.zip.\n\nNevertheless, once the ZIP file containing the DLLs is downloaded, it is extracted and the\nDLL binaries are saved to the C:\\ProgramData staging directory. The resource update.zip\ncontained the following DLLs:\n```\nMD5 (freebl3.dll) = ef2834ac4ee7d6724f255beaf527e635\n\nMD5 (libcurl.dll) = 37f98d28e694399e068bd9071dc16133\n\nMD5 (mozglue.dll) = 8f73c08a9660691143661bf7332c3c27\n\nMD5 (msvcp140.dll) = 109f0f02fd37c84bfc7508d4227d7ed5\n\nMD5 (nss3.dll) = bfac4e3c5908856ba17d41edcd455a51\n\nMD5 (softokn3.dll) = a2ee53de9167bf0d6c019303b7ca84e5\n\nMD5 (sqlite3.dll) = e477a96c8f2b18d6b5c27bde49c990bf\n\nMD5 (vcruntime140.dll) = 7587bf9cb4147022cd5681b015183046\n\n```\n\n-----\n\n## Data Exfiltration\n\nThe harvested data is then sent back to the C2 server using a HTTP POST request.\n\n\n-----\n\n**HTTP POST body**\n```\n------1531306219445135\n\nContent-Disposition: form-data; name=\"profile\"\n\n1375\n\n------1531306219445135\n\nContent-Disposition: form-data; name=\"profile_id\"\n\n1700\n\n------1531306219445135\n\nContent-Disposition: form-data; name=\"hwid\"\n\nd8d914bc22c31291311131-90059c37-1320-41a4-b58d-816d-806e6f6e6963\n\n------1531306219445135\n\nContent-Disposition: form-data; name=\"token\"\n\n36bfd46626a0b531909b016919dd1fbd\n\n------1531306219445135\n\nContent-Disposition: form-data; name=\"file\"\n\nUEsDBBQAAgAIAMSYl1XqxfupygAAAJMB...[truncated base64-encoded ZIP file]\n\n------1531306219445135-\n```\n\n-----\n\nInterestingly, the token 36bfd46626a0b531909b016919dd1fbd matches the string contained\nwithin the initial config downloaded from the C2 server.\n\nThe data harvested from the host is stored within the ZIP file in the POST request body.\n\n**Directory structure of the ZIP file**\n```\n/History/Mozilla Firefox_qldyz51w.default.txt\n\n/Cookies/Google Chrome_Default.txt\n\n/History/Google Chrome_Default.txt\n\n/passwords.txt\n\n/information.txt\n\n/Files/Default.zip\n\n/Files/desktop.zip\n\n/screenshot.jpg\n\n```\nIt is important to note that this is not an exhaustive list of what the ZIP file exfiltrated from\nevery system will look like. It will depend on both the stealer configuration set by the threat\nactor during the payload generation stage, and the software present on the compromised\nsystem. For example, the sample analyzed in this writeup included routines for stealing\nDiscord tokens, data from Telegram and even FTP and SCP clients.\n\n### Cleanup Operations\n\nOnce the data has been succesfully harvested and exfiltrated, the malware then deletes itself\nand any created files from the host with the following command:\n```\n\"C:\\Windows\\System32\\cmd.exe\" /c timeout /t 6 & del /f /q\n\"C:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\AppLaunch.exe\" & exit\n\n```\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-31 - Analyzing a VIDAR Infostealer Sample.pdf"
    ],
    "report_names": [
        "2022-12-31 - Analyzing a VIDAR Infostealer Sample.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf4d333d-ef79-40aa-b233-886e6de875a3",
            "created_at": "2023-12-08T02:00:05.754609Z",
            "updated_at": "2025-03-27T02:00:03.266797Z",
            "deleted_at": null,
            "main_name": "DEV-0569",
            "aliases": [
                "Storm-0569"
            ],
            "source_name": "MISPGALAXY:DEV-0569",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338998,
    "ts_updated_at": 1743041678,
    "ts_creation_date": 1683252276,
    "ts_modification_date": 1683252276,
    "files": {
        "pdf": "https://archive.orkl.eu/ec9d119c7a37fb95212f23d8d9671122ebdc5945.pdf",
        "text": "https://archive.orkl.eu/ec9d119c7a37fb95212f23d8d9671122ebdc5945.txt",
        "img": "https://archive.orkl.eu/ec9d119c7a37fb95212f23d8d9671122ebdc5945.jpg"
    }
}