{
    "id": "d777a824-6c20-4856-8a9a-dd7b37e98a1c",
    "created_at": "2023-01-12T15:03:12.88319Z",
    "updated_at": "2025-03-27T02:10:49.444045Z",
    "deleted_at": null,
    "sha1_hash": "db124ef1398b101534493b8de1f918c114f7c1ee",
    "title": "2019-02-06 - Threat Actor -Magecart-- Coming to an eCommerce Store Near You",
    "authors": "",
    "file_creation_date": "2022-05-28T19:42:16Z",
    "file_modification_date": "2022-05-28T19:42:16Z",
    "file_size": 795754,
    "plain_text": "# Threat Actor “Magecart”: Coming to an eCommerce Store Near You\n\n**[crowdstrike.com/blog/threat-actor-magecart-coming-to-an-ecommerce-store-near-you/](https://www.crowdstrike.com/blog/threat-actor-magecart-coming-to-an-ecommerce-store-near-you/)**\n\nPeyton Smith and Tim Parisi February 6, 2019\n\nThreat actors that target eCommerce platforms to skim credit card information from online\nshoppers are commonly referred to under the umbrella threat actor name “Magecart.” This\nblog analyzes recently observed Magecart tactics, techniques, and procedures (TTPs) used\nto exploit e-commerce applications and steal credit card information from customers during\nonline checkout.\n\nA popular target of Magecart threat actors has been the Magento eCommerce platform,\nwhich is used by merchants to offer direct-to-consumer goods for sale. Since 2016, Magecart\nthreat actors have targeted Magento retailers by exploiting CVE-2016-4010, a PHP Object\nInjection vulnerability in the Magento API. More recently, however, CrowdStrike has observed\nMagecart threat actors targeting undisclosed PHP Object Injection vulnerabilities in Magento\neCommerce third-party plugins and extensions. Like CVE-2016-4010, these vulnerabilities\nallow an attacker to execute arbitrary code in the context of the vulnerable server, commonly\nknown as a remote code execution (RCE) vulnerability.\n\n## Initial Reconnaissance\n\nCrowdStrike observed recent attacks against Magento that began with an automated\nscanner attempting to identify URIs (Uniform Resource Identifiers) associated with previously\naggregated vulnerable Magento plugins. The scanner requests various URIs with a basic\n\n\n-----\n\nPHP Object Injection payload to probe for vulnerable servers. An example scan request for\nthe resource `/madecache/varnish/esi` is below.\n\nFigure 1: Example of an encoded POST request to scan the /index/php/madecache/varnish/esi resource\n\nAs shown in Figure 1, the attacker assigns a large base64 encoded string to the `misc`\nparameter and sends a secondary request parameter `dl . A closer look at the misc`\nparameter indicates the data is likely base64-encoded, and decoding the data shows a\nserialized PHP object indicative of a typical PHP object post request.\n\nFigure 2: Decoded PHP object sent to the /madecache/varnish/esi/ resource\n\nThe decoded PHP object looks benign, with the exception of a 29-character string embedded\ntoward the end of the object:\n\nFigure 3: Malicious PHP Object\n\nWhen the PHP Object is deserialized, this snippet of PHP code included in the object will be\nexecuted in the context of the server. If the `/madecache/varnish/esi/ resource is`\nvulnerable, the server will retrieve and evaluate the contents of the “dl” parameter, shown in\nfigure 3 above. Percent-decoding the dl parameter value shows the following code snippet\n```\nexit(\"<h1>Hi</h1>\"); . From this, we determine that the adversary is likely performing\n\n```\n\n-----\n\nautomated scanning of a large set of domains to check for the HTTP 200 response of `Hi .`\nThis response determines if the URI queried is present on the web server and vulnerable to\nPHP Object Injection.\n\nCrowdStrike identified Magecart threat actors scanning for 30 URIs, shown in the list below:\n\n/rewards/customer_notifications/unsubscribe/\n/appointment/index/index/\n/AvisVerifies/dialog/index/\n/pdffree/Product/pdfsave/\n/ajax/Showroom/submit/\n/prescription/Prescription/amendQuoteItemQty/\n/netgocust/Gwishlist/updategwishlist/\n/CustomGrid/index/index/\n/simplebundle/Cart/add/\n/layaway/view/add/\n/multidealpro/index/edit/\n/vendors/credit/withdraw/review/\n/customgrid/Blcg_Column_Renderer_index/index/\n/tabshome/index/ajax/\n/customgrid/Blcg/Column/Renderer/index/index/\n/customgrid/index/index/\n/aheadmetrics/auth/index/\n/rewards/customer/notifications/unsubscribe/\n/gwishlist/Gwishlist/updategwishlist/\n/vendors/credit_withdraw/review/\n/vendors/withdraw/review/\n/emaildirect/abandoned/restore/\n/rewards/notifications/unsubscribe/\n/bssreorderproduct/list/add/\n/advancedreports/chart/tunnel/\n/minifilterproducts/index/ajax/\n/ajaxproducts/index/index/\n/qquoteadv/download/downloadCustomOption/\n/freegift/cart/gurlgift/\n/madecache/varnish/esi/\n\nIf vulnerable, the attacker will return to the website at a later time to further exploit the\napplication. CrowdStrike has observed three different attack paths — outlined below — that\nhave the same objective: to exfiltrate payment card data from online customers.\n\n## From RCE to Payment Information: Attack Path Analyses\n\n\n-----\n\n### Example One: Overwriting a Core JavaScript Library\n\nIn this attack path, the attacker attempts to overwrite a JavaScript library file, used by the\nvictim website, with attacker-controlled JavaScript. The HTTP request for this type of attack\nwould look like the following:\n\nFigure 4: Example One payload\n\nThe payload in Figure 4 is similar in structure to the scanning payload except with a larger dl\nparameter value. The attacker uses the same PHP Object Injection technique to execute the\ndl parameter in the context of the vulnerable application. Percent-decoding the dl parameter\nshows the code snippet in Figure 5.\n\nFigure 5: Example One overwrite payload\n\n\n-----\n\nAs shown in Figure 5, the attacker attempts to coerce the server to download a JavaScript\nfile from attacker-controlled infrastructure `$url and overwrite a local file on the victim`\nserver `$dest using native PHP functions.`\n\nThe attacker strategically overwrites a core JavaScript library file because these files are\nreferenced on every Magento web resource. This means they are executed by the victim’s\nbrowser every time a Magento-affiliated web page is visited. If the JavaScript code identifies\na credit card form on the current webpage, the code will capture the credit card information\non submission and forward the credit card data to the attacker-controlled infrastructure.\n\n### Example Two: Altering the Magento Configuration Database Table\n\nCrowdStrike has also observed a secondary attack vector involving a sequence of payloads\nfrom the attacker. Using the same PHP Object Injection vulnerability to execute a request\nparameter, the attacker first attempts to retrieve the Magento configuration file `local.xml`\nby executing the following PHP code:\n\nFigure 6: PHP payload to extract Magento database credentials\n\nThe configuration file `local.xml1 contains the plaintext username and password for the`\nMagento database, providing the attacker with the necessary credentials to directly connect\nto the database via a similar payload. The attacker uses the compromised credentials to\nupdate the Magento core configuration table `core_config_data to reference attacker-`\ncontrolled infrastructure. The attacker’s command would look similar to Figure 7, displayed\nbelow.\n\n\nFigure 7: PHP payload updating Magento configuration table\n\nThe base64-encoded `$k variables decode to a raw SQL query, as shown below in Figure`\n8.\n\n\n-----\n\nFigure 8: Raw SQL query updating the Magento configuration table\n\nThe `config_id variable referenced in Figure 6 typically corresponds to a generic HTML`\ntag, such as `footer, that is included on every page of the eCommerce website. Therefore,`\nthe attacker-controlled JavaScript executes on each page, allowing the attacker to identify\ncredit card forms and exfiltrate payment card data.\n\n### Example Three: Exploiting Old Vulnerabilities\n\n Creation of a Database Account\n\nTo gain access to the Magento database, attackers have also exploited versions of Magento\n[that do not have the SUPEE-5344 patch. This exploit leverages a vulnerability where the](https://www.magentocommerce.com/products/downloads/magento/)\nattacker can create database administrator accounts through GET requests against the web\nfront-end. Figure 9 contains an example GET request where the attacker references the\nWYSIWYG (what you see is what you get) page editor resource to leverage an SQL Injection\nand ultimately create a new database administrator account inside a base64 payload.\n\nFigure 9: Example web log showing an SQL Injection exploit to create a database administrator account\n\nFigure 10 shows the decoded payload, which created the database administrator account\n\n```\nrogueaccount.\n\n```\n\n-----\n\nFigure 10: Decoded base64 payload that creates the new database administrator account “rogueaccount”\n\n### Leveraging the Magpleasure Extension\n\nWith the malicious database administrator account created, the attackers can install\nadditional tools to aid in their attack. One tool in particular includes the Magpleasure\nfilesystem Magento extension, which allows administrators to modify the web server’s\nfilesystem. Similar to PowerShell in Windows, Magpleasure is used legitimately by admins,\nbut threat actors also leverage the extension to modify files within the web directory and\nfurther their attack. In a number of investigations CrowdStrike has conducted, Magpleasure\nwas identified within the php-fpm-error.log file on a victim web server. An example from\nthe error log is shown in Figure 11.\n\nFigure 11: Secondary php-fpm-error Magpleasure log\n\n### Magento Core File Code Injection\n\nIn addition to overwriting JavaScript libraries, CrowdStrike has also observed attackers\nmodifying a core PHP file within Magento. In this example, the attacker inserts base64\nencoded code within the functions.php core Magento file. The malicious code snippet\nextracts victim billing information from HTTP POST requests and copies the extracted\ninformation to a file on disk. The code injected into functions.php can be seen in Figure 12.\n\n\n-----\n\nFigure 12: Obfuscated threat actor code\n\nFigure 13 shows the code from Figure 12 after it has been de-obfuscated.\n\nFigure 13: De-obfuscated threat actor code\n\nThe malicious code is loaded when functions.php is imported into other Magento scripts. The\nsnippet attempts to match strings within the preg_match regular expression with data sent\nvia HTTP POST requests by potential victims. If a regular expression match occurs, the\nskimmer then serializes the `$_POST and` `$_COOKIE data and writes it to a JPG file in the`\nNFS directory of the web server. The attacker intermittently retrieves the JPG file from the\nweb server as data is collected.\n\n## Detection and Prevention Measures\n\nThis section provides an overview of techniques to detect and prevent attacks against your\neCommerce application.\n\n### Audit Magento Third-Party Extensions and Plugins\n\nCrowdStrike recommends auditing your Magento installation to determine if your deployment\ncontains any aforementioned plugins targeted by Magecart threat actors. If identified,\nCrowdStrike recommends removing the plugin, or blocking requests to these resources by\nediting .htaccess, utilizing Apache mod_rewrite or similar, depending on the web\ninfrastructure in use. A forensic investigation should be conducted to determine if threat\nactors successfully targeted these resources. Additionally, unnecessary plugins and\nextensions should be removed to minimize the eCommerce application’s attack surface.\n\n### Database Logging in Magento Enterprise\n\n\n-----\n\nIn some investigations, CrowdStrike was able to identify previous attacker activity by\nanalyzing a table in the Magento database that logs all changes made to it. The\n```\nenterprise_logging_event_changes table, available in enterprise versions of Magento\n\n```\nonly, records changes to the Magento database. This can be extremely useful to forensic\ninvestigators if any reverting occurred or modifications were made to the database since the\ninitial attack. Figure 14 below shows an example entry in the\n```\nenterprise_logging_event_change table, where a URL to a malicious JavaScript file\n\n```\nwas added to the `absolute_footer field.`\n\nFigure 14: Example entry in the enterprise_logging_event_change table that shows changes made to the\n\ndatabase\n\n### Web Log Analysis and Monitoring\n\neCommerce environments should actively monitor and analyze web access logs for\nunauthorized or suspicious activity, specifically for the presence of SQL Injection methods,\nand the placement and interaction with web shells. eCommerce environments should also\nmonitor authentications to the back-end eCommerce application database to ensure only\nauthorized accounts from expected source IP addresses are occurring.\n\n### Perform Regular Penetration Tests\n\neCommerce environments should perform web application penetration testing on at least a\nbiannual basis to ensure their eCommerce web application is patched and secure. The\ntesting should be conducted by a third party with the goals of identifying any unpatched\nvulnerabilities on the web application and/or the system running the web application, as well\nas trying to access the eCommerce web server and/or the database.\n\n### Implement Code Integrity Checks\n\neCommerce environments should consider implementing code integrity verification checks\nand processes for their eCommerce applications. These checks would detect the\n“Overwriting a Core JavaScript Library” example mentioned above. For instance, an\neCommerce administrator can calculate a SHA256 hash of core JavaScript libraries\nemployed by the eCommerce application and ensure the hash of these libraries only\nchanges during expected maintenance periods.\n\n### Regular Updates and Patching\n\n\n-----\n\neCommerce environments should minimize the attack footprint by regularly patching the core\neCommerce platform and pertinent application dependencies, such as Apache and PHP.\nAdministrators should also audit and remove unnecessary eCommerce application plugins\nand extensions.\n\n### Implement a Web Application Firewall\n\nDeploying and configuring a Web Application Firewall (WAF) will mitigate the probability of a\nsuccessful attack. WAFs should be configured to block and generate alerts on potential code\ninjection attacks, such as PHP Object Injection or SQL Injection. Generated alerts should be\nregularly reviewed by security personnel to ensure the attacks were successfully prevented.\n\n### Implement Advanced Endpoint Protection\n\nDeploying an advanced endpoint protection program, such as the CrowdStrike® Falcon®\nplatform, will mitigate the risk of a successful attack. Falcon utilizes an array of powerful\nmethods to provide protection against rapidly changing TTPs used by various adversaries.\nFalcon Prevent™ next-gen antivirus is capable of detecting and preventing the execution of\nexploits and web shells that are often used in attacks against eCommerce applications.\n\n## Conclusion\n\nMagecart threat actors continue to target payment web applications in an attempt to steal\ncredit card information. Despite the absence of known high-severity vulnerabilities in the core\nMagento eCommerce product since 2016, attackers have successfully gained access by\ntargeting common third-party Magento plugins. They have also used these same techniques\non other eCommerce applications such as PinnacleCart. CrowdStrike analysts expect this\nattack trend to continue, and they advise eCommerce administrators to review the previously\nmentioned detection and prevention measures to minimize the likelihood of the attackers\nsuccessfully exploiting and exfiltrating payment card information.\n\n### Footnotes\n\n1. This file may vary depending on Magento version\n\n### Additional Resources\n\n_Learn how CrowdStrike can help your organization answer its most important security_\n_questions:_ _[Visit the CrowdStrike Services web page.](https://www.crowdstrike.com/services/)_\n_[Download the 2018 CrowdStrike Services Cyber Intrusion Casebook and read up on](https://www.crowdstrike.com/resources/reports/cyber-intrusion-services-casebook-2018/?ctm_source=Digital&ctm_medium=blog&ctm_campaign=WC_Casebook2018_Report)_\n_real-world incident response (IR) investigations, with details on attacks and_\n_recommendations that can help your organization be better prepared._\n_Watch an on-demand webcast on the Cyber Intrusion Casebook: Stories From the_\n_Front Lines of Cybersecurity in 2018 and Insights That Matter for 2019._\n\n\n-----\n\n_Learn more about CrowdStrike s next-gen endpoint protection by visiting the Falcon_\n_platform product page._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-06 - Threat Actor -Magecart-- Coming to an eCommerce Store Near You.pdf"
    ],
    "report_names": [
        "2019-02-06 - Threat Actor -Magecart-- Coming to an eCommerce Store Near You.pdf"
    ],
    "threat_actors": [
        {
            "id": "2646f776-792a-4498-967b-ec0d3498fdf1",
            "created_at": "2022-10-25T15:50:23.475784Z",
            "updated_at": "2025-03-27T02:00:55.479958Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Palmerworm"
            ],
            "source_name": "MITRE:BlackTech",
            "tools": [
                "Kivars",
                "PsExec",
                "TSCookie",
                "Flagpro",
                "Waterbear"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d3a7123c-f519-49a0-a234-de24a1ef052a",
            "created_at": "2022-10-25T16:47:55.545211Z",
            "updated_at": "2025-03-27T02:05:17.254744Z",
            "deleted_at": null,
            "main_name": "BRONZE CANAL",
            "aliases": [
                "CTG-6177 ",
                "Circuit Panda ",
                "Palmerworm ",
                "Shrouded Crossbow ",
                "BlackTech"
            ],
            "source_name": "Secureworks:BRONZE CANAL",
            "tools": [
                " DRIGO",
                " Flagpro",
                " Gh0stTimes",
                " PLEAD",
                " Spiderpig",
                " Waterbear",
                "Bifrose"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75024aad-424b-449a-b286-352fe9226bcb",
            "created_at": "2023-01-06T13:46:38.962724Z",
            "updated_at": "2025-03-27T02:00:02.964002Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "CIRCUIT PANDA",
                "Temp.Overboard",
                "G0098",
                "Red Djinn",
                "HUAPI",
                "Palmerworm",
                "T-APT-03",
                "Manga Taurus",
                "Earth Hundun"
            ],
            "source_name": "MISPGALAXY:BlackTech",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "efa7c047-b61c-4598-96d5-e00d01dec96b",
            "created_at": "2022-10-25T16:07:23.404442Z",
            "updated_at": "2025-03-27T02:02:09.781478Z",
            "deleted_at": null,
            "main_name": "BlackTech",
            "aliases": [
                "BlackTech",
                "Circuit Panda",
                "Earth Hundun",
                "Manga Taurus",
                "Operation PLEAD",
                "Operation Shrouded Crossbow",
                "Operation Waterbear",
                "Palmerworm",
                "Radio Panda",
                "Red Djinn",
                "T-APT-03",
                "TEMP.Overboard"
            ],
            "source_name": "ETDA:BlackTech",
            "tools": [
                "BIFROST",
                "BUSYICE",
                "BendyBear",
                "Bluether",
                "CAPGELD",
                "DRIGO",
                "Deuterbear",
                "Flagpro",
                "GOODTIMES",
                "Gh0stTimes",
                "IconDown",
                "KIVARS",
                "LOLBAS",
                "LOLBins",
                "Linopid",
                "Living off the Land",
                "TSCookie",
                "Waterbear",
                "XBOW",
                "elf.bifrose"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535792,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653766936,
    "ts_modification_date": 1653766936,
    "files": {
        "pdf": "https://archive.orkl.eu/db124ef1398b101534493b8de1f918c114f7c1ee.pdf",
        "text": "https://archive.orkl.eu/db124ef1398b101534493b8de1f918c114f7c1ee.txt",
        "img": "https://archive.orkl.eu/db124ef1398b101534493b8de1f918c114f7c1ee.jpg"
    }
}