{
    "id": "d782c359-c9a8-4896-b401-1cfe2aba94bb",
    "created_at": "2023-01-12T15:06:18.137409Z",
    "updated_at": "2025-03-27T02:06:09.504495Z",
    "deleted_at": null,
    "sha1_hash": "91b9b2f9368237ca7d8fff44d01b713b5763d1b4",
    "title": "2020-02-18 - Nemty Ransomware Scaling UP- APAC Mailboxes Swarmed by Dual Downloaders",
    "authors": "",
    "file_creation_date": "2022-05-29T10:46:14Z",
    "file_modification_date": "2022-05-29T10:46:14Z",
    "file_size": 395402,
    "plain_text": "# Nemty Ransomware Scaling UP: APAC Mailboxes Swarmed by Dual Downloaders\n\n**[lastline.com/labsblog/nemty-ransomware-scaling-up-apac-mailboxes-swarmed-dual-downloaders/](https://www.lastline.com/labsblog/nemty-ransomware-scaling-up-apac-mailboxes-swarmed-dual-downloaders/)**\n\nFebruary 18, 2020\n\nPosted by [Jason Zhang and](https://www.lastline.com/author/jzhang/) [Stefano Ortolani ON FEB 18, 2020](https://www.lastline.com/author/stefano/)\nNemty is a ransomware that first surfaced in the wild in August 2019, reportedly spreading via\nRDP with a specific focus on the APAC region. By the end of November 2019 the attack\nexpanded its reach using Phorpiex (also called Trik) by spreading via SMB hosts configured with\nweak credentials. The ransomware encrypts the victims’ files appending the suffix .nemty to\neach filename, hence its name. After a few months of negligible activity, in the past few days our\nsensors picked an unprecedented wave of attacks targeting, again, the APAC region. Unlike\nprevious attacks, the attackers clearly scaled up operations by launching a massive email\ncampaign using again the botnet managed by Phorpiex, this time to distribute a swarm of ZIP\narchive files containing malicious downloaders implemented in VBScripts. To make the attack\nmore resilient, the adversaries attempt to evade defenses by relying on two different “living off\nthe land” binaries, powershell.exe and bitsadmin.exe, both downloading and executing the same\npayload.\n\nIn this blog post, we detail some of Lastline’s telemetry showcasing the magnitude of the attack,\nand we provide a brief overview of the most distinctive aspects of the downloader.\n\n## Telemetry Data\n\nFigure 1 shows the last two months of telemetry data of analyzed Nemty artifacts (both payloads\nand downloaders) since December 11th, 2019. As we can see, while there was not much activity\nuntil February 7th, when the attacks reached the peak of over 7,500 instances on February 8th,\nand then dropped to around 5,000 cases the day afterwards. The total number of detections\nexceeded 14,000 within five days.\n\n\n-----\n\n**Figure 1: Detection timeline of Nemty artifacts analyzed in the APAC region.**\nSince there is a high probability for the same attachment to be delivered multiple times (common\ntrait of spam waves), to better reflect the scale of the attack we also looked at the actual number\nof emails featuring this specific downloader. Figure 2 shows the timeline of the delivered email\nZIP attachments grouped into 3-hour buckets throughout the whole campaign. The overall email\ncount amounts to 66,000 attachments, far above the number of actual payloads discussed\nabove.\n\n**Figure 2: Number of emails with a ZIP attachment containing a Nemty downloader.**\nAll attachment ZIP files follow the pattern PIC_xxxxxx_2020.zip where xxxxxx refers to a 6-digit\nnumber, e.g. PIC_172599_2020.zip.\n\nIt is interesting to note that all email subjects only contain one of the following smiley emojis: :-),\n:-*, :), ;), ;-), 8-D, 8-), which, once rendered, look like these: 🙂😊😀😁😄😆😍. Using a\nsmiley icon in an email subject can be seen as a naive social engineering technique, but due to\nthe payload, it is unlikely to have similarly happy consequences for the victim. A more likely\n\n\n-----\n\nreason is that some spam detectors use email subjects (e.g., invoice, delivery notice, etc.) as an\nimportant data point in detection heuristics, and unusually short subjects might help evade\ndetection.\n\n## The Dual Downloader\n\nAs mentioned earlier, all email attachments are ZIP files containing a malicious VBScript. Table\n1 shows the basic information of one of the analyzed VBScript files:\n```\nMD5 913e1ce18aa6c620dbf33eeecdbc1085\nSHA1 5daa5ad47affc1bec48d1a95767f70c9b032e405\nSHA256 add3864eea1847533b52551a1868b0e9b992fe24940b5d8aae5202193f1d107d\nSize 1979 bytes\nType text/vbscript\n\n```\n**Table 1: The VBScript sample analyzed in this blog post.**\n\nThis is a very simple VBScript file with only three lines of code (as shown in Figure 3). It first\ncreates a WScript.Shell object, and then runs cmd.exe to launch the payload downloading\nprocess. While not really sophisticated, what is interesting is that there are two command lines\nrelying on different services to download the very same payload, e.g., 6246258358.exe:\n\nSHA256: bc7e55048478507b6734c8314857f33309f663ff4f3c3cb65e653a5b308f0bd5\n\nAs Figure 3 shows, the first command line uses PowerShell to download the payload from the\nremote server 92.63.197[.]190 (a known compromised host managed by Phorpiex), and save it\nto the victim’s temporary directory and execute it, whereas the second command invokes the\nBITSadmin service.\n\n**Figure 3: Malicious VBScript-based downloader for Nemty ransomware.**\n\n\n-----\n\nAccording to Microsoft documentation, BITSadmin (Background Intelligent Transfer Service, first\nreleased with Windows XP) is a command-line tool used to create download or upload jobs\nwhenever the network connection is left idle. As it is a trusted tool by most host and network\nfirewalls, malware creators have been known to abuse this service since 2007. In this specific\nexample, it creates a high priority download job, “getitman”, to download the very same payload\nfrom the same server, and execute it.\n\nAbusing living-off-the-land binaries (LoLBins, referring to legitimate OS tools or processes) such\nas PowerShell or BITSadmin, to download or execute malware is, unfortunately, an increasingly\npopular trend. However, using multiple executables in an attempt to increase the resilience of\nthe process is far less common. In this case, the attackers acknowledged the popularity of\nPowerShell (almost 50% of recent threats detected by Lastline use PowerShell in one way or\nanother), and wanted to increase the chance of infection by adding an alternative way when the\nPowerShell process gets blocked by host firewalls or AV products.\n\nThough all VBScript files have the same malicious functionality, the content is not exactly the\nsame. Some files are obfuscated with garbage code attempting to evade static detection.\n\nFigure 4 shows the fishbone chart detailing the infection chain in a controlled environment when\nexecuting the VBScript. As we can see it involves a few interesting subjects, such as\npowershell.exe (subject 3), bitsadmin.exe (subject 6) and the 6246258358.exe (Nemty\nransomware, subject 4).\n\n**Figure 4: VBScript downloader infection chain.**\n\n## Conclusions\n\nAs compared to previously reported attacks exploiting vulnerable RDP endpoints in August\n2019, this time attackers massively scaled up their operation via an email campaign\nweaponizing ZIP file attachments with malicious VBScripts downloading Nemty, a well known\nransomware. This last campaign relied on both PowerShell and BITSadmin to retrieve and\nexecute the very same payload from the same server. While not incredibly sophisticated, this\nconfirms a well-established trend of relying on multiple LoLBins as a technique to improve the\nresiliency of an attack; in this specific case the attackers seemed to have assumed that it is\n\n\n-----\n\ncommon for at least some of those binaries to be actually monitored (and blocked if acting\nmaliciously), and hence chose to double their chances by using both binaries for the very same\npurpose.\n\n## Appendix: IoCs\n\nZIP archives\n\n0517ae27126f767937976d733064869a1b5296aaf622596af6cd4c4aa2184bd2\n069390b186ce9a3678441d208a5614340d4b2a0a7bbe2991e3087b72e7480112\n\n06cf3e872a886db4ed77639eebe08361f9a81d4908ee643de0135f491f690923\n\n06df03c989148bcbee007b66216a4fdcec635491922fd744a32315010ba99d2a\n\n07c2632f548015a0e61d14b8f5a9e4e988c1674fcc02a90a87d3d94afe0c8135\n\n080cb0ad0d69490097f641311186147e8b16954d23885630a7231f7ff5bd8bda\n\n0c0c467b094b13943ea7d2b5f91fb19e81c6b521a7a58c27e571ed33a56d8ccb\n\n0da9aa96f41ad1cc117dcff1272521a0b9be55e59635704af897169268ef2db7\n\n0f49c5375ac7aac76caf8cb0dfd16b8f422e197162c36a4a4ba1449cd08e5056\n\n12294dbc60c9b9935abdbba25da98b0314f82da9252e29229860ee4e346aa6ad\n\n1261860de3fd1ea3e59f61572f12c2efa41d460896a46ef8731787724f8845ca\n\n150b1e4155894701c4b8919413b73d4eebc1d781c4203f54a0713b552f6961be\n\n160402da510e6c751bef39ab6af152ef71d7a25c710a8d88586dc56b5bfe1170\n\n170d3ddddc64a9feca1fc5ef77b5c1fd0b86b8fb98a91256070ad7be7cf0e619\n\n18b656b27704b9fe418d55f5472bda0b2ffe5ae8eb26b910f4db4029fb8a9f7e\n\n25a29351100b75f30ae133a3e035b2852298bbe05b9fd08f73a4a8fda52c439d\n\n2f3bed3382382b95c84390b6138f68875ce96273fa5f521bab83d67b8e9ad740\n\n758c26dcf2a8963b3fcf3b6ea796aacf08870b9733ac87a608cd1be6b56af421\n\nb20e0ade92a2e824f66e991db75f9ef8b9260e9acda55d52b0d9e1c0936919f8\n\ne96ca035fc8a2c2ae2dc2e6c112942469821c6682beab8fa7ece1e25e55497ba\n\n\nVBScripts\n\nf058019c4b68c9cdb588f300074ce1cbb272d9d3737963a16e50961d1474fe22\nadd3864eea1847533b52551a1868b0e9b992fe24940b5d8aae5202193f1d107d\n67565c1d380f13d6b486a7485241cdb3bc942a29dda7d96f2176c56ef6e3623a\n392bd0111d7691547b5cf4d4b64ac9c1168532acb57a5954b815c52a812c30c8\n\n\nDownload URLs\n\n://92.63.197.190/jap[.]exe\n\n://92.63.197.190/jp[.]exe\n\n\nNemty payload\n\nbc7e55048478507b6734c8314857f33309f663ff4f3c3cb65e653a5b308f0bd5\n\n\nAbout\n\n\n-----\n\nLatest Posts\n\n## Jason Zhang\n\nJason Zhang is a senior threat researcher at Lastline. Prior to joining Lastline, Jason worked at\nSophos and MessageLabs (then Symantec) specializing in cutting-edge threat research, and ML\napplication in malware detection. Jason is a regular speaker at leading technical conferences\nincluding Black Hat and VB. Jason earned his Ph.D. in Signal Processing from King's College\nLondon & Cardiff University.\n\n**[Latest posts by Jason Zhang (see all)](https://www.lastline.com/author/jzhang/)**\n\n[InfoStealers Weaponizing COVID-19 - May 11, 2020](https://www.lastline.com/labsblog/infostealers-weaponizing-covid-19/)\n[Nemty Ransomware Scaling UP: APAC Mailboxes Swarmed by Dual Downloaders -](https://www.lastline.com/labsblog/nemty-ransomware-scaling-up-apac-mailboxes-swarmed-dual-downloaders/)\nFebruary 18, 2020\nThreat Research Report: Infostealers and self-compiling droppers set loose by an unusual\nspam campaign - January 30, 2020\n\nAbout\nLatest Posts\n\n## Stefano Ortolani\n\nStefano Ortolani is Director of Threat Intelligence at Lastline. Prior to that he was part of the\nresearch team in Kaspersky Lab in charge of fostering operations with CERTs, governments,\nuniversities, and law enforcement agencies. Before that he earned his Ph.D. in Computer\nScience from the VU University Amsterdam.\n\n**[Latest posts by Stefano Ortolani (see all)](https://www.lastline.com/author/stefano/)**\n\n\n-----\n\n[Evolution of Excel 4.0 Macro Weaponization - June 2, 2020](https://www.lastline.com/labsblog/evolution-of-excel-4-0-macro-weaponization/)\n[InfoStealers Weaponizing COVID-19 - May 11, 2020](https://www.lastline.com/labsblog/infostealers-weaponizing-covid-19/)\n[Nemty Ransomware Scaling UP: APAC Mailboxes Swarmed by Dual Downloaders -](https://www.lastline.com/labsblog/nemty-ransomware-scaling-up-apac-mailboxes-swarmed-dual-downloaders/)\nFebruary 18, 2020\n\nTags:\n\n[BITSadmin,](https://www.lastline.com/tag/bitsadmin/) [Nemty,](https://www.lastline.com/tag/nemty/) [PowerShell,](https://www.lastline.com/tag/powershell/) [VBScript](https://www.lastline.com/tag/vbscript/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-18 - Nemty Ransomware Scaling UP- APAC Mailboxes Swarmed by Dual Downloaders.pdf"
    ],
    "report_names": [
        "2020-02-18 - Nemty Ransomware Scaling UP- APAC Mailboxes Swarmed by Dual Downloaders.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535978,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653821174,
    "ts_modification_date": 1653821174,
    "files": {
        "pdf": "https://archive.orkl.eu/91b9b2f9368237ca7d8fff44d01b713b5763d1b4.pdf",
        "text": "https://archive.orkl.eu/91b9b2f9368237ca7d8fff44d01b713b5763d1b4.txt",
        "img": "https://archive.orkl.eu/91b9b2f9368237ca7d8fff44d01b713b5763d1b4.jpg"
    }
}