{
    "id": "d7854ba1-90c5-43d1-9018-dbbe606039f4",
    "created_at": "2023-01-12T14:59:42.85001Z",
    "updated_at": "2025-03-27T02:06:06.69252Z",
    "deleted_at": null,
    "sha1_hash": "797bc8512d8c7e7955ece1027d7f21ac30c4df8d",
    "title": "2018-08-02 - How to defend yourself against SamSam ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:55:35Z",
    "file_modification_date": "2022-05-28T19:55:35Z",
    "file_size": 1285993,
    "plain_text": "# How to defend yourself against SamSam ransomware\n\n**[nakedsecurity.sophos.com/2018/08/02/how-to-defend-yourself-against-samsam-ransomware/](https://nakedsecurity.sophos.com/2018/08/02/how-to-defend-yourself-against-samsam-ransomware/)**\n\nBy Mark Stockley 02 Aug 2018\n\n[On Tuesday 31 July 2018 Sophos released the largest and most comprehensive research](https://www.sophos.com/en-us/medialibrary/PDFs/technical-papers/SamSam-The-Almost-Six-Million-Dollar-Ransomware.pdf?cmp=26061)\npaper ever compiled on SamSam, a sophisticated and highly destructive piece of\nransomware noted for its ability to put entire organisations under siege.\n\nSamSam is different from most other ransomware – it’s used sparingly, in a relatively small\nnumber of targeted attacks by a skilled team or individual. They break into and survey a\nvictim’s network before deploying and running the ransomware, just like a sysadmin\ndeploying legitimate software.\n\n\n-----\n\nThose unusual tactics create advantages for both attacker and defender.\n\nThe good news is that the SamSam attackers aren’t looking for a challenge. They want easy\ntargets, which means that getting a few of the basics right gives you a very good chance of\nkeeping them out.\n\nThe bad news is that if they do get a foothold in your organisation they can dig in quickly.\nThey don’t deploy the SamSam malware until they’re able to act as a Domain Admin, which\ngives them high ground from which to attack.\n\nSamSam hackers have been seen changing their tactics during attacks and they will spend\nhours, and perhaps days, getting it right. If one approach doesn’t work they’ll try another and\nanother, and if security software stops the malware from running, they’ll look for ways to\ndisable it.\n\nAs a result of Sophos’s research into SamSam it has been able to further strengthen the\nprotection provided by all of its products, and through membership of the Cyber Threat\nAlliance it’s been able to benefit from other’s insights and share the information it’s learned\nwith industry partners, strengthening everyone’s protection.\n\n\n-----\n\n[Sophos believes that its products provide the best possible protection against SamSam. Like](https://www.sophos.com/en-us/products/intercept-x.aspx)\nall good security software though, those products are most effective when they’re deployed\nas part of a defence in depth strategy.\n\nIn this article we draw on the new research to look at some of the other important layers in\nthat strategy, and how they can help you defend your organisation against SamSam.\n\n## Be the smallest possible target\n\nThe best way to avoid trouble is to not be there when it starts.\n\nSo far, the SamSam attacker has entered victims’ networks using exploits in internet-facing\nservers, most notably the JBoss application server, or by brute-forcing RDP (Remote\nDesktop Protocol) passwords.\n\n### Patch\n\nSamSam attacks have probably used the approaches mentioned above because they were\nthe most successful or convenient at the time. There is no reason to suspect they won’t\nswitch to a different approach if a more effective alternative, such as a new exploit, emerges.\n\nBecause of that we recommend you don’t focus on patching specific vulnerabilities but follow\na strict patching protocol for operating systems and all the applications that run on them.\n\n### Lock down RDP\n\n[Unless it’s properly secured, RDP is a tempting target for all kinds of crooks, not just the](https://nakedsecurity.sophos.com/2017/11/15/ransomware-spreading-hackers-sneak-in-through-rdp/)\nSamSam attackers. We recommend you take the following steps to protect your organisation\nfrom attacks via RDP:\n\nLimit RDP access to people that need it.\nDon’t allow Domain Admin accounts to use RDP.\nRequire multi-factor authentication.\nHave a sensible policy for securing idle accounts.\nLimit the rate of password retries with the Security Policy Editor.\nAutomatically lock accounts after a number of failed login attempts.\nHave staff access RDP through a VPN.\nLimit VPN access to specific IP addresses, ranges or geographies.\n[Educate users about strong passwords and the dangers of password reuse.](http://nakedsecurity.sophos.com/2014/10/01/how-to-pick-a-proper-password/)\nEncourage employees to use secure password managers.\n[Test your staff’s passwords to see how resilient they are.](https://nakedsecurity.sophos.com/2016/11/23/stop-wasting-time-making-the-wrong-passwords-stronger/)\n\n### View your network like an adversary\n\n\n-----\n\nBecause there is no guarantee that the SamSam hackers won t change tactics it s important\nto understand what your network looks like to them. You can do that by undertaking regular\nvulnerability scans and penetration tests, and by performing periodic assessments, using\nthird party tools like Censys or Shodan, to identify publicly-accessible ports and services\nacross your public-facing IP address space.\n\n## Follow the principle of least privilege\n\nIf the SamSam attackers gain access to your network they will try to become Domain\nAdministrators using a combination of hacking tools and exploits.\n\nOne approach uses the credential harvesting tool Mimikatz to steal a Domain Administrator’s\npassword from memory when they log in.\n\nPrivilege escalation can take days and the longer it takes, the more chance you have of\nspotting the intruder. To contain and frustrate an attacker you should follow the principle of\nleast privilege, giving user accounts only the access rights they need and nothing more. For\nexample:\n\nUsers who don’t need to install software should not have administrative privileges.\nDomain Admin accounts should be used for administration tasks, not for mail or web\nbrowsing.\nWhere possible, favour elevating to domain privileges over the use of Domain Admin\naccounts.\nDon’t give service accounts for important services like SQL databases access to\nbackups.\nRestrict access to critical system to the smallest possible group.\nLock down access to C$ and other shares as much as possible.\n\nYou may find models or approaches to privileged access, such as Microsoft’s tiers-based\n[approach, useful, as well as tools like BloodHound that can help you identify and eliminate](https://github.com/BloodHoundAD/BloodHound)\nhidden risks.\n\nThe principle of least privilege applies to software as well as access.\n\nThe extensive use of administration tools such as PowerShell, PsExec and PAExec, and\nof [Potentially Unwanted Applications like Mimiktaz, during attacks makes the proper](https://community.sophos.com/kb/en-us/14887)\nconfiguration of application control technologies vitally important.\n\nScripting languages such as JavaScript and Powershell, and admin tools like PsExec, should\nbe blocked everywhere they aren’t needed, or blocked everywhere and allowed as and when\nthey’re required.\n\nThe [SamSam technical details section of the research contains more information about the](https://www.sophos.com/en-us/medialibrary/PDFs/technical-papers/SamSam-The-Almost-Six-Million-Dollar-Ransomware.pdf?cmp=26061)\nsoftware that’s been seen in SamSam attacks.\n\n\n-----\n\n### Assume an attack is a matter of when, not if\n\nWhen you’re considering your defence against SamSam it’s important to remember that the\nexecution of the actual SamSam ransomware is the final step in the attack. Up to that point\nyou are dealing with a skilled intruder who may be able to exercise tremendous power on\nyour network, and who can counter your defensive moves.\n\nYou cannot wait until after you’re breached to determine what you’ll need or what you should\ndo, by then it’s too late. To prepare accordingly, you must act as if it’s a matter of when you’re\n_breached, not if you’re breached._\n\nYou will need to have trained and well drilled staff and software capable of monitoring and\nreacting to anomalous events on your network, such as unusual account activity, in real time.\n\nCareful selection of software with the right approaches to automation, reporting and\ninteroperability is important.\n\nIts reporting capabilities, and its ability to talk to other security software, should ensure your\nstaff have sufficient, relevant information, but aren’t overwhelmed.\n\nAutomation is important because SamSam malware is designed to act quickly, and to\nencrypt your most important files first. It’s typically launched in middle of the night or the early\nhours of the morning in a victim’s local time zone, when most users and admins are asleep.\n\n## What if an attack is successful?\n\nShould a SamSam attack successfully encrypt computers on your network you’ll need to be\nable to get back up and running quickly, and understand what you need to do to prevent it\nhappening again.\n\nUnlike most other ransomware, SamSam doesn’t just target document files and data, it also\ntargets applications and configuration files. So, before you can restore your data you’ll need\nto reinstall or reimage your computers’ operating systems and applications, and that can take\na long time if you aren’t prepared for it.\n\nWhen looking at your SamSam-resistant backup strategy it’s useful to consider the same\nquestions you might face in the event of a fire or flood, like: how many computers does your\norganisation need to maintain a bare-bones operation, how long would it take to restore\nthose machines, and how long would it take you to return to normal operations?\n\nYou don’t want to find yourself in the position of having survived an attack but paying the\nransom anyway because you can’t restore your computers fast enough.\n\n\n-----\n\nSimilarly, you must remember that if a Domain Administrator on your network can access\nyour backups then an attacker acting as a Domain Administrator one can destroy or encrypt\nthem.\n\nTherefore, your backup strategy should:\n\n1. Account for how you will restore the necessary number of entire machines, not just\n\ndata.\n2. Include offline and offsite backups that put an air gap between them and an attacker.\n\nShould the worst happen you’ll also want to have collected enough information for a\nretrospective analysis that can answer questions like: what was lost, how did the attacker get\nin and how can you prevent it happening again?\n\n## Further reading\n\nYou can read more about the history of SamSam, how it works and how to protect against it\nin Sophos’s extensive new research paper, **SamSam: The (Almost) Six Million Dollar**\n**Ransomware.**\n\nThe investigation is ongoing – if you have information about SamSam or you are a security\nvendor interested in collaborating with our investigation, please contact Sophos.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-08-02 - How to defend yourself against SamSam ransomware.pdf"
    ],
    "report_names": [
        "2018-08-02 - How to defend yourself against SamSam ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535582,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653767735,
    "ts_modification_date": 1653767735,
    "files": {
        "pdf": "https://archive.orkl.eu/797bc8512d8c7e7955ece1027d7f21ac30c4df8d.pdf",
        "text": "https://archive.orkl.eu/797bc8512d8c7e7955ece1027d7f21ac30c4df8d.txt",
        "img": "https://archive.orkl.eu/797bc8512d8c7e7955ece1027d7f21ac30c4df8d.jpg"
    }
}