{
    "id": "d82379b7-a7a8-4e5d-9671-efdfa80347c3",
    "created_at": "2023-01-12T15:08:35.634764Z",
    "updated_at": "2025-03-27T02:06:14.892271Z",
    "deleted_at": null,
    "sha1_hash": "f6c5d75790fc02cf6a28c8b758e3c88988dfee4b",
    "title": "2017-02-23 - Korean MalDoc Drops Evil New Years Presents",
    "authors": "",
    "file_creation_date": "2022-05-28T15:54:58Z",
    "file_modification_date": "2022-05-28T15:54:58Z",
    "file_size": 635170,
    "plain_text": "# Korean MalDoc Drops Evil New Years Presents\n\n**blog.talosintelligence.com/2017/02/korean-maldoc.html**\n\n[This blog was authored by Warren Mercer and](https://blogs.cisco.com/author/warrenmercer) [Paul Rascagneres.](https://www.blogger.com/profile/10073079939160046441)\n\n## Executive Summary\n\nTalos has investigated a targeted malware campaign against South Korean users. The\ncampaign was active between November 2016 and January 2017, targeting a limited number\nof people. The infection vector is a Hangul Word Processor document (HWP), a popular\nalternative to Microsoft Office for South Korean users developed by Hancom.\n\nThe malicious document in question is written in Korean with the following title:\n\n5170101-17년_북한_신년사_분석.hwp (translation: 5170101-17 __ North Korea _ New\nYear _ analysis .hwp)\n\nThis document was alleged to be written by the Korean Ministry of Unification and included\ntheir logo as a footer on the document.\n\n\n-----\n\nAn interesting twist also came within the analysed malicious document as it attempts to\ndownload a file from an official Korean government website: kgls.or.kr (Korean Government\nLegal Service). The file downloaded is a binary masquerading as a jpeg file that is later\nexecuted as part of the infection. It's likely that the website was compromised by the\nattackers to try and legitimise the HTTP GET attempts for the final payload, this traffic would\npotentially not have looked unfamiliar for any system administrators.\n\nThe attackers' infrastructure appeared to be up for a few days at a time with no observed\ninfrastructure re-use occurring. Unfortunately, the compromised sites were all either cleaned\nor removed by the attackers and Talos were unable to obtain the final payload. This level of\noperational security is common for sophisticated attackers.\n\nDue to these elements it's likely that this loader has been designed by a well-funded group in\norder to target public sector entities in South Korea. Many of these techniques fit the profile\nof campaigns previously associated with attacks by certain government groups.\n\n## Infection Vector: Hangul Word Processor\n\nThe infection vector identified by Talos is a HWP file. This is a fairly unusual choice as this\nsoftware is rarely used outside of Korea, but it is known to be widely used within Korea,\nincluding use by the South Korean government. As a regional file format, many security\ndevices are not equipped to process HWP files. This can allow an attacker a vector with a\nmuch lower risk of detection by any security scanning devices.\n\nHere is a screenshot of the opened document:\n\n\n-----\n\nThe title of the document is \"Analysis of \"Northern New Year\" in 2017\". The logo at the\nbottom of the document in the logo of the Ministry Of Unification. This ministry is working\ntowards the reunification of North & South Korea. The document describes information linked\nto the North Korean celebration of New Year.\n\nAt the end of the document are 2 links to additional documents. The malicious document\nmentions that users should double click in order to access to these documents, Document1\nis identified as \"Comparison of Major Tasks in '16 & '17\" and the Document2 linked is\nidentified as \"Comparison between '16 & '17\"\n\n\n-----\n\nThe links point to 2 OLE objects embedded in the document (BIN0003.OLE and\nBIN004.OLE):\n\nOnce decompressed (zlib), we identified two PE32 files embedded within the 2 OLE files. If\nthe targeted user double clicks on one of the links, a PE32 file is dropped and executed.\n\nThe 2 dropped binaries will be found and executed in this location during our analysis:\n\nC:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\Hwp (2).exe\nC:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\Hwp (3).exe\n\nWe can identify a JavaScript object in the document. This one does not contain malicious\ncontent, it's an object included by default.\n\n\n-----\n\n[Here is the execution of the HWP file in Cisco AMP Thread Grid:](https://www.cisco.com/c/en/us/products/security/amp-threat-grid-appliances/index.html)\n\n## Dropped files\n\nThe compilation path of the binaries was not removed which allows us to determine the\nworking space and environment used for this attack.\n\ne:\\Happy\\Work\\Source\\version 12\\T+M\\Result\\DocPrint.pdb\n\nThe two dropped malware files have a different hash but their purpose is the same:\n\nOpen a HWP document (to respond to the double click in the previous document)\nDownload a payload from a compromised host/C2.\n\nThe opened document is embedded in the PE (in a resource named 'DOC'):\n\n\n-----\n\nLike the previous document, this one speaks of the relation between North Korea and South\nKorea, and is seemingly written by a native Korean speaker due to the specific language\nused.\n\nThe second stage of the binary executes wscript.exe and injects shellcode into the process.\nThe shellcode is embedded in a resource called 'BIN'. The purpose of this shellcode is to\nunpack a second PE32 in the legitimate wscript.exe process and execute it. The injection is\nperform by the classic:\nVirtualAllocEx(), WriteProcessMemory() and CreateRemoteThread() APIs.\n\nThe unpacked binary is used to collect information on the infected system, and to attempt to\ncommunicate with the C2 in order to download the final payload. The information collected\nwas:\n\nThe computer name\nThe username\nThe execution path of the sample\nThe BIOS model by analysing the\nHKLM\\System\\CurrentControlSet\\Services\\mssmbios\\Data\\SMBiosData registry key.\nThis information allows the attackers to identify Virtual Machine (on VirtualBox the\nmodel is \"innotek GmbH VirtualBox\")\n\n\n-----\n\nAn ID randomly generated to identify the system\n\nThis information could be used as a reconnaissance phase to determine if there was a\nsuitable platform to deliver the final payload and to avoid sending the final payload to\nsandbox systems.\n\nThe analysed sample performed network connections to these 2 URLs in this order:\n\nwww.kgls.or.kr/news2/news_dir/index.php (where the collected information is sent)\nwww.kgls.or.kr/news2/news_dir/02BC6B26_put.jpg\n\nThe beginning of the jpg document (02BC6B26) is the ID previously generated. We think that\nthe jpg file is automatically generated by the index.php file if the collected data is relevant.\nThe content of the jpg file is saved in a file called 'officepatch.exe'. Finally, this new file is\nexecuted and the unpacked executable terminates itself.\n\nThe website kgls.or.kr is the web site of the Korean Government Legal Service. Talos can\nonly assume that this website was compromised in order to deliver the final stage malware,\nthe jpg file. All the infrastructure was down during our analysis, which meant we were unable\nto analyse the payload directly.\n\nThe collected binaries are compiled between 22:43:05 UTC and 4:55:18 UTC (the 3 files at\n22:00:00 are the binaries dropped by the HWP document and the other files are the\nunpacked payload) - Time Stamp artifacts can be easily faked and can be deployed as a\nfalse flag mechanism to make the researcher believe the compiled code came from a certain\nTime Zone - this should not be trusted as an indicator of where the attack or attacker\noriginated from.\n\n## Command & Control infrastructure\n\nDuring our investigation we were able to identify additional Command and Control\ninfrastructure used by this actor. The four C2s were based in the following countries:\n\n3 C2 in South Korea\n1 C2 in the Netherlands\n\nHere is a global map of the identified infrastructure:\n\n\n-----\n\nColour Key:\n\nRed: the '_put.jpg' binary (final payload)\nOrange: C2 infrastructure used by the attackers\nYellow: the unpacked samples that perform the connection to download the final\nmalware (the green bubbles share 90% of similar codes)\nGreen: the dropped executable by the HWP document (the orange bubbles share 90%\nof similar codes)\nBlue: the HWP document\n\n## Conclusion\n\nThis actor appears to have made intentional decisions to limit the attack surface by using\nHangul. This allowed them to evade some security devices as this format is not frequently\nprocessed.\n\nThe infection process was a MalDoc with multiple droppers (identical in their execution) and\nthen C2 communication to obtain the final payload. The use of decoy documents is very\ncommon and shows that the attacker wanted to use a social engineering / enticement aspect\nto encourage the users to open the file.\n\n\n-----\n\nThis campaign has clearly targeted at a specific group of users, this rings true with the use of\nsuch specific file formats. Steps were clearly taken to limit the ability of security products to\ndetect the threat as well as adherence to a strict timeline to prevent the malicious files from\nbeing discovered. The attackers were careful to remove their malicious payloads and not reuse their infrastructure.\n\nWe believe this is a targeted attack aimed at South Korean users in the public sector\nconducted by a sophisticated threat actor with access to native Korean speakers. Attacks on\nthese individuals may be an attempt to gain a foothold into assets which can be deemed\nextremely valuable.\n\n## IOC\n\nHWP File:\n\n5170101-17년_북한_신년사_분석.hwp:\n281828d6f5bd377f91c6283c34896d0483b08ac2167d34e981fbea871893c919\n\nDropped files:\n\n95192de1f3239d5c0a7075627cf9845c91fd397796383185f61dde893989c08a\n\n7ebc9a1fd93525fc42277efbccecf5a0470a0affbc4cf6c3934933c4c1959eb1\n\n6c372f29615ce8ae2cdf257e9f2617870c74b321651e9219ea16847467f51c9f\n\n19e4c45c0cd992564532b89a4dc1f35c769133167dc20e40b2a41fccb881277b\n\n3a0fc4cc145eafe20129e9c53aac424e429597a58682605128b3656c3ab0a409\n\n7d8008028488edd26e665a3d4f70576cc02c237fffe5b8493842def528d6a1d8\n\nUnpack related samples:\n\n7e810cb159fab5baccee7e72708d97433d92ef6d3ef7d8b6926c2df481ccac2f\n\n21b098d721ea88bf237c08cdb5c619aa435046d9143bd4a2c4ec463dcf275cbe\n761454dafba7e191587735c0dc5c6c8ab5b1fb87a0fa44bd046e8495a27850c7\n\n3d442c4457cf921b7a335c0d7276bea9472976dc31af94ea0e604e466596b4e8\n930fce7272ede29833abbfb5df4e32eee9f15443542434d7a8363f7a7b2d1f00\n\n4b20883386665bd205ac50f34f7b6293747fd720d602e2bb3c270837a21291b4\nf080f019073654acbe6b7ab735d3fd21f8942352895890d7e8b27fa488887d08\n\nNetwork:\n\nwww.imuz.com/admin/data/bbs/review2/board/index.php\n\nwww.imuz.com/admin/data/bbs/review2/board/123.php\n\nwww.imuz.com/admin/data/bbs/review2/board/02BC6B26_put.jpg (where 02BC6B26 is\nrandomly generated)\n\n\n-----\n\nwww.wildrush.co.kr/bbs/data/image/work/webproxy.php\nwww.wildrush.co.kr/bbs/data/image/work/02BC6B26_put.jpg (where 02BC6B26 is randomly\ngenerated)\n\nwww.belasting-telefoon.nl//images/banners/temp/index.php\nwww.belasting-telefoon.nl//images/banners/temp/02BC6B26_put.jpg (where 02BC6B26 is\nrandomly generated)\n\nwww.kgls.or.kr/news2/news_dir/index.php\nwww.kgls.or.kr/news2/news_dir/02BC6B26_put.jpg (where 02BC6B26 is randomly\ngenerated)\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/support/security/amp-firepower-software-license/tsd-products-support-series-home.html)\nmalware used by these threat actors.\n\n[CWS orWSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[The Network Security protection ofIPS andNGFW have up-to-date signatures to detect](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nmalicious network activity by threat actors.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella prevents DNS resolution of the domains associated with malicious activity.](https://umbrella.cisco.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-23 - Korean MalDoc Drops Evil New Years Presents.pdf"
    ],
    "report_names": [
        "2017-02-23 - Korean MalDoc Drops Evil New Years Presents.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536115,
    "ts_updated_at": 1743041174,
    "ts_creation_date": 1653753298,
    "ts_modification_date": 1653753298,
    "files": {
        "pdf": "https://archive.orkl.eu/f6c5d75790fc02cf6a28c8b758e3c88988dfee4b.pdf",
        "text": "https://archive.orkl.eu/f6c5d75790fc02cf6a28c8b758e3c88988dfee4b.txt",
        "img": "https://archive.orkl.eu/f6c5d75790fc02cf6a28c8b758e3c88988dfee4b.jpg"
    }
}