{
    "id": "d8249f15-4d9c-4aee-b83e-91e30ec15071",
    "created_at": "2023-01-12T15:05:44.551946Z",
    "updated_at": "2025-03-27T02:05:20.991297Z",
    "deleted_at": null,
    "sha1_hash": "9ca087d52a187476f2891f73323fc84cf194fbd4",
    "title": "2022-05-15 - Fake Pixelmon NFT site infects you with password-stealing malware",
    "authors": "",
    "file_creation_date": "2022-05-27T02:10:51Z",
    "file_modification_date": "2022-05-27T02:10:51Z",
    "file_size": 1454920,
    "plain_text": "# Fake Pixelmon NFT site infects you with password- stealing malware\n\n**[bleepingcomputer.com/news/security/fake-pixelmon-nft-site-infects-you-with-password-stealing-malware/](https://www.bleepingcomputer.com/news/security/fake-pixelmon-nft-site-infects-you-with-password-stealing-malware/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nMay 15, 2022\n12:34 PM\n0\n\nA fake Pixelmon NFT site entices fans with free tokens and collectibles while infecting them\nwith malware that steals their cryptocurrency wallets.\n\n[Pixelmon is a popular NFT project whose roadmap includes creating an online metaverse](https://pixelmon.club/)\ngame where you can collect, train, and battle other players using pixelmon pets.\n\nWith close to 200,000 Twitter followers and over 25,000 Discord members, the project has\ngarnered a lot of interest.\n\n## Impersonating the Pixelmon project\n\nTo take advantage of this interest, threat actors have copied the legitimate pixelmon.club\nwebsite and created a fake version at pixelmon[.]pw to distribute malware.\n\n\n-----\n\nThis site is almost a replica of the legitimate site, but instead of offering a demo of the\nproject's game, the malicious site offers executables that install password-stealing malware\non a device.\n\n**Fake Pixelmon website**\n\n_Source: BleepingComputer_\nThe site is offering a file called Installer.zip that contains an executable that appears to be\ncorrupt and does not infect users with any malware.\n\n[However, MalwareHunterTeam, who first discovered this malicious site, found other](https://twitter.com/malwrhunterteam/status/1524826748738752516)\nmalicious files distributed by the site that allowed us to see what malware it was spreading.\n\nOne of the files distributed by this malicious site is setup.zip, which contains the setup.lnk\nfile. Setup.lnk is a Windows shortcut that will execute a PowerShell command to download a\nsystem32.hta file from pixelmon[.]pw.\n\n\n-----\n\n**Setup.lnk contents**\n\n_Source: BleepingComputer_\nWhen BleepingComputer tested these malicious payloads, the System32.hta file\ndownloaded Vidar, a password-stealing malware that is not as commonly used as it was in\n[the past. This was confirmed by security researcher Fumik0_, who has previously analyzed](https://twitter.com/fumik0_)\nthis malware family.\n\nWhen executed, the threat actor's Vidar sample will connect to a Telegram channel and\nretrieve the IP address of a malware's command and control server.\n\n\n-----\n\n**Telegram**\n\n**channel containing C2 IP address**\n_Source: BleepingComputer_\nThe malware will then retrieve a configuration command from the C2 and download further\nmodules to be used to steal data from the infected device.\n\nThe Vidar malware can steal passwords from browsers and applications and search a\ncomputer for files that match specific names, which are then uploaded to the threat actor.\n\nAs you can see from the malware configuration below, the C2 instructs the malware to\nsearch for and steal various files, including text files, cryptocurrency wallets, backups, codes,\npassword files, and authentication files.\n\n**Configuration commands retrieved from the C2 server**\n\n_Source: BleepingComputer_\n\n\n-----\n\nAs this is an NFT site, the expectation is that visitors will have cryptocurrency wallets\ninstalled on their computers. Due to this, the threat actors emphasize searching for and\nstealing files related to cryptocurrency.\n\nWhile the site is currently not distributing a working payload, BleepingComputer has seen\nevidence that the threat actors continue to modify the site over the past few days, as\npayloads that were available two days ago are no longer present.\n\nDue to the activity on the site, we can expect this campaign to continue to be active and for\nworking threats to be added soon.\n\nWith NFT projects being overwhelmed with scams designed to steal your cryptocurrency, you\nshould always triple-check that the URL you are visiting is, in fact, related to the project you\nare interested in.\n\nFurthermore, never execute any executables from unknown websites without first scanning\n[them with antivirus software or using VirusTotal.](https://www.virustotal.com/gui/home/upload)\n\n### Related Articles:\n\n[Fake Binance NFT Mystery Box bots steal victim's crypto wallets](https://www.bleepingcomputer.com/news/security/fake-binance-nft-mystery-box-bots-steal-victims-crypto-wallets/)\n\n[Ukraine warns of “chemical attack” phishing pushing stealer malware](https://www.bleepingcomputer.com/news/security/ukraine-warns-of-chemical-attack-phishing-pushing-stealer-malware/)\n\n[Pixiv, DeviantArt artists hit by NFT job offers pushing malware](https://www.bleepingcomputer.com/news/security/pixiv-deviantart-artists-hit-by-nft-job-offers-pushing-malware/)\n\n[New powerful Prynt Stealer malware sells for just $100 per month](https://www.bleepingcomputer.com/news/security/new-powerful-prynt-stealer-malware-sells-for-just-100-per-month/)\n\n[New ZingoStealer infostealer drops more malware, cryptominers](https://www.bleepingcomputer.com/news/security/new-zingostealer-infostealer-drops-more-malware-cryptominers/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-15 - Fake Pixelmon NFT site infects you with password-stealing malware.pdf"
    ],
    "report_names": [
        "2022-05-15 - Fake Pixelmon NFT site infects you with password-stealing malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535944,
    "ts_updated_at": 1743041120,
    "ts_creation_date": 1653617451,
    "ts_modification_date": 1653617451,
    "files": {
        "pdf": "https://archive.orkl.eu/9ca087d52a187476f2891f73323fc84cf194fbd4.pdf",
        "text": "https://archive.orkl.eu/9ca087d52a187476f2891f73323fc84cf194fbd4.txt",
        "img": "https://archive.orkl.eu/9ca087d52a187476f2891f73323fc84cf194fbd4.jpg"
    }
}