{
    "id": "d8386e54-4db5-4232-b5c9-cb3849cf69dc",
    "created_at": "2024-01-17T02:05:25.727902Z",
    "updated_at": "2025-03-27T02:16:39.721229Z",
    "deleted_at": null,
    "sha1_hash": "c501ec19fa16b701ca5d314e13e09e5caec4d55f",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T04:07:01Z",
    "file_modification_date": "2024-01-16T04:07:01Z",
    "file_size": 1518973,
    "plain_text": "# New ShroudedSnooper actor targets telecommunications firms in the Middle East with novel Implants\n\n**[blog.talosintelligence.com/introducing-shrouded-snooper](https://blog.talosintelligence.com/introducing-shrouded-snooper/)**\n\nAsheer Malhotra September 19, 2023\n\n[By Asheer Malhotra, Caitlin Huey, Sean Taylor, Vitor Ventura, Arnaud Zobec](https://blog.talosintelligence.com/author/asheer-malhotra/)\n\nTuesday, September 19, 2023 08:00\n\n[SecureX Threats](https://blog.talosintelligence.com/category/securex-3/)\n\nCisco Talos recently discovered a new malware family we’re calling “HTTPSnoop”\nbeing deployed against telecommunications providers in the Middle East.\nHTTPSnoop is a simple, yet effective, backdoor that consists of novel techniques\nto interface with Windows HTTP kernel drivers and devices to listen to incoming\nrequests for specific HTTP(S) URLs and execute that content on the infected\nendpoint.\nWe also discovered a sister implant to “HTTPSnoop” we’re naming “PipeSnoop,”\nwhich can accept arbitrary shellcode from a named pipe and execute it on the\ninfected endpoint.\n\n\n-----\n\nWe identified DLL- and EXE-based versions of the implants that masquerade as\nlegitimate security software components, specifically extended detection and\nresponse (XDR) agents, making them difficult to detect.\nWe assess with high confidence that both implants belong to a new intrusion set\nwe’re calling “ShroudedSnooper.” Based on the HTTP URL patterns used in the\nimplants, such as those mimicking Microsoft’s Exchange Web Services (EWS)\nplatform, we assess that this threat actor likely exploits internet-facing servers and\ndeploys HTTPSnoop to gain initial access.\nThis activity is a continuation of a trend we have been monitoring over the last\nseveral years in which sophisticated actors are frequently targeting telecoms. This\n[sector was consistently a top-targeted industry vertical in 2022, according to Cisco](https://blog.talosintelligence.com/quarterly-report-incident-response-trends-in-q4-2022/)\n[Talos Incident Response data.](https://blog.talosintelligence.com/quarterly-report-incident-response-trends-in-q4-2022/)\n\n## ShroudedSnooper activity highlights latest threat to telecommunications entities\n\nThis specific cluster of implants involving HTTPSnoop and PipeSnoop and associated\ntactics, techniques, and procedures (TTPs) do not match a known group that Talos\ntracks. We are therefore attributing this activity to a distinct intrusion set we’re calling\n“ShroudedSnooper.”\n\nIn recent years, there have been many instances of state-sponsored actors and\nsophisticated adversaries targeting telecommunications organizations around the world.\n[In 2022, this sector was consistently a top-targeted vertical in Talos IR engagements.](https://blog.talosintelligence.com/quarterly-report-incident-response-trends-in-q4-2022/)\nTelecommunications companies typically control a vast number of critical infrastructure\nassets, making them high-priority targets for adversaries looking to cause significant\nimpact. These entities often form the backbone of national satellite, internet and\ntelephone networks upon which most private and government services rely.\nFurthermore, telecommunications companies can serve as a gateway for adversaries to\naccess other businesses, subscribers or third-party providers.\n\nOur IR findings are consistent with reports from other cybersecurity firms outlining\nvarious attack campaigns targeting telecommunications companies globally. In 2021,\n[CrowdStrike disclosed a years-long campaign by the LightBasin (UNC1945) advanced](https://www.crowdstrike.com/blog/an-analysis-of-lightbasin-telecommunications-attacks/)\npersistent threat (APT) targeting 13 telecommunications companies globally using Linuxbased implants to maintain long-term access in compromised networks. That same year,\nMcAfee discovered activity targeting telecommunication firms in Europe, the U.S. and\n[Asia dubbed “Operation Diànxùn” linked to the Chinese APT group MustangPanada](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/operation-dianxun-cyberespionage-campaign-targeting-telecommunication-companies/)\n(RedDelta). This campaign heavily relied on the PlugX malware implant. Also in 2021,\n[Recorded Future reported that four distinct Chinese state-sponsored APT groups were](https://www.recordedfuture.com/chinese-apt-groups-target-afghan-telecommunications-firm)\ntargeting the email servers of a telecommunications firm in Afghanistan, again using the\nPlugX implant.\n\n\n-----\n\nThe targeting of telecommunications firms in middle-east Asia is also quite prevalent. In\n[January 2021, Clearsky disclosed the “Lebanese Cedar” APT leveraging web shells and](https://www.clearskysec.com/wp-content/uploads/2021/01/Lebanese-Cedar-APT.pdf)\nthe “Explosive” RAT malware family to target telecommunication firms in the U.S., U.K.\n[and middle-east Asia. In a separate campaign, Symantec noted the MuddyWater APT](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-campaign-telecoms-asia-middle-east)\ntargeting telecommunication organizations in the Middle East, deploying web shells on\nExchange Servers to instrument script-based malware and dual-use tools to carry out\nhands-on-keyboard activity.\n\n## Masquerading as a security component\n\nWe also discovered both HTTPSnoop and PipeSnoop masquerading as components of\nPalo Alto Networks’ Cortex XDR application. The malware executable is named\n[“CyveraConsole.exe,” which is the application that contains the Cortex XDR agent for](https://docs-cortex.paloaltonetworks.com/r/Cortex-XDR/7.8/Cortex-XDR-Agent-Administrator-Guide/Use-Cortex-XDR-Agent-for-Windows)\n[Windows. The variants of both HTTPSnoop and PipeSnoop we discovered had their](https://docs-cortex.paloaltonetworks.com/r/Cortex-XDR/7.8/Cortex-XDR-Agent-Administrator-Guide/Use-Cortex-XDR-Agent-for-Windows)\n[compile timestamps tampered with but masqueraded as XDR agent from version](https://docs-cortex.paloaltonetworks.com/r/Cortex-XDR/7.8/Cortex-XDR-Agent-Release-Notes/Addressed-Issue-in-Cortex-XDR-Agent-7.8-hotfix-7.8.0.64264)\n[7.8.0.64264. Cortex XDR v7.8 was released on Aug. 7, 2022, and decommissioned on](https://docs-cortex.paloaltonetworks.com/r/Cortex-XDR/7.8/Cortex-XDR-Agent-Release-Notes/Addressed-Issue-in-Cortex-XDR-Agent-7.8-hotfix-7.8.0.64264)\nApril 24, 2023. Therefore, it is likely that the threat actors operated this cluster of\nimplants during the aforementioned timeframe. For example, one of the\n“CyveraConsole.exe” implants was compiled on Nov. 16, 2022, falling approximately in\nthe middle of this time window of the life of Cortex XDR v7.8.\n\nVersion information of HTTPSnoop sample with fake Cortex XDR information.\n\n## A primer on HTTPSnoop\n\nHTTPSnoop is a simple, yet effective, new backdoor that uses low-level Windows APIs\nto interact directly with the HTTP device on the system. It leverages this capability to\nbind to specific HTTP(S) URL patterns to the endpoint to listen for incoming requests.\nAny incoming requests for the specified URLs are picked up by the implant, which then\nproceeds to decode the data accompanying the HTTP request. The decoded HTTP data\nis, in fact, shellcode that is then executed on the infected endpoint.\n\n\n-----\n\nHTTPSnoop consists of the same code across all observed variants, with the key\ndifference in samples being the URL patterns that it listens for. So far, we have\ndiscovered three variations in the configuration:\n\nGeneric HTTP URL-based: Listens for generic HTTP URLs specified by the\nimplant.\n[EWS-related URLs listener: Listen for URLs that mimic Microsoft’s Exchange Web](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\n[Services (EWS) API.](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\nOfficeCore’s Location Based Services (LBS)-related URL listener: Listens for URLs\nthat mimic OfficeCore’s LBS/OfficeTrack and telephony applications.\n\n## HTTPSnoop variants\n\nThe DLL-based variants of HTTPSnoop usually rely on DLL hijacking in benign\napplications and services to get activated on the infected system. The attackers initially\ncrafted the first variant of the implant on April 17, 2023, so that it could bind to specific\nHTTP URLs on the endpoint to listen for incoming shellcode payloads that are then\n[executed on the infected endpoint. These HTTP URLs resemble those of Microsoft’s](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\n[Exchange Web Services (EWS) API, a product that enables applications to access](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\nmailbox items.\n\nA second variant, generated on April 19, 2023, is nearly identical to the initial version of\nHTTPSnoop from April 17. The only difference is that this second variant is configured to\nlisten to a different set of HTTP URLs on Ports 80 and 443 exclusively, indicating that\nthe attackers may have intended to focus on a separate non-EWS internet-exposed web\nserver.\n\nThe attackers then built a third variant that consisted of a killswitch URL and one other\nURL that the implant listens to. This implant was crafted on April 29, 2023. This version\nof the implant was likely an effort to minimize the number of URLs that the implant\nlistens to, to reduce the likelihood of detection.\n\n## HTTPSnoop analysis\n\nThe DLL analyzed simply consists of two key components:\n\nEncoded Stage 2 shellcode.\nEncoded Stage 2 configuration.\n\nThe malicious DLL on activation will XOR decode the Stage 2 configuration and\nshellcode and run it.\n\n\n-----\n\nSingle byte XOR routine to decode Stage\n\ncomponents.\n\n### Stage 2 analysis\n\nStage 2 is a single-byte XOR’ed backdoor shellcode that uses the accompanying\nconfiguration data to listen for incoming shellcode to execute on the infected endpoint.\nAs part of Stage 2, the sample proceeds to make numerous calls to kernel devices in\norder to set up a web server endpoint for its backdoor. The implant opens a handle to\n“\\Device\\Http\\Communication” and calls the HTTP driver API\n“http.sys!UlCreateServerSession” with IOCTL code 0x1280000to initialize the connection\nto the HTTP server. The sample continues by creating a new URL group using\nhttp.sys!UlCreateUrlGroup with IOCTL code 0x128010 opens a request queue device\n“\\Device\\Http\\ReqQueue” and sets the new URL group for the session using\nhttp.sys!UlSetUrlGroupwith IOCTL code 0x12801d.\n\nUsing the decrypted configuration the sample begins to feed the URLs to the HTTP\nserver via http.sys!UlAddUrlToUrlGroup with IOCTL code l 0x128020. This binds the\nspecified URL patterns to a listenable endpoint for the malware to communicate. The\nimplant takes care to not overwrite already existing URL patterns being serviced by the\nHTTP server, to coexist with previous configurations on the server, such as EWS and\nprevent URL listener collisions.\n\nWith the URLs bound to listen on the kernel’s web server, the malware proceeds to\nlisten in a loop for incoming HTTP requests, carried out via\nhttp.sys!UlReceiveHttpRequest. If the headers from the HTTP request contain a\nconfigured keyword, in this particular sample’s case, “api_delete”, the listening loop for\nthe infection will terminate. Once a request comes in, it creates a new thread and calls\nhttp.sys!UlReceiveEntityBody with IOCTL codes 0x12403b, or 0x12403a when running\nWindows Server 2022 version 21H2, to receive the full message body from the implant\noperator. If the request has valid data, the sample proceeds to process the request or\nelse returns an HTTP 302 Found redirect response to the requester.\n\nValid data comes in the form of a base64-encoded request body. Upon decoding, it\nproceeds to use the first byte of data to single-byte XOR-decode the rest of the data.\nOnce decrypted, a simple data structure is unveiled. The payload received from the\noperator is an arbitrary shellcode payload. The execution metadata consists of an\nuninitialized pointer and size, plus the size of the metadata structure, which is a constant\n0x18. These uninitialized pointers are initialized by the execution of the shellcode, used\nto pass back data to the implant to eventually send back to the operator as a response\nto the HTTP request.\n\n\n-----\n\nPayload structure from C2.\n\nThe ultimate result of the execution of the arbitrary shellcode is returned to the requester\n(operator) in the form of a base64-encoded XOR-encoded blob. The first byte of the\nresponse is a random letter from the ASCII table, which is used to XOR the rest of the\nresponse. With this, the malware sends back a 200 OK response with the encoded\nexecution result in its body via http.sys!UlSendHttpResponsewith IOCTL code\n0x12403f.\n\n\n-----\n\n## Introducing PipeSnoop\n\nThe PipeSnoop implant, created in May 2023, is a simple implant that can run arbitrary\nshellcode payloads on the infected endpoint by reading from an IPC pipe. Although\nsemantically similar, the PipeSnoop implant should not be considered an upgrade of\nHTTPSnoop. Both implants are likely designed to work under different environments.\nThe HTTP URLs used by HTTPSnoop along with the binding to the built-in Windows\nweb server indicate that it was likely designed to work on internet-exposed web and\nEWS servers. PipeSnoop, however, as the name may imply, reads and writes to and\nfrom a Windows IPC pipe for its input/output (I/O) capabilities This suggests the implant\nis likely designed to function further within a compromised enterprise--instead of publicfacing servers like HTTPSnoop — and probably is intended for use against endpoints\nthe malware operators deem more valuable or high-priority. PipeSnoop is likely used in\nconjunction with another component that is capable of feeding it the required shellcode.\n(This second component is currently unknown.)\n\n## PipeSnoop analysis\n\nPipeSnoop is a simple backdoor that, much like HTTPSnoop, aims to act as a backdoor\nexecuting arbitrary shellcode on the infected endpoint. In contrast to HTTPSnoop\nhowever, PipeSnoop does not rely on initiating and listening for incoming connections\nvia an HTTP server. As indicated by the name, PipeSnoop will simply attempt to connect\nto a pre-existing named pipe on the system. Named pipes are a common means of\nInter-Process Communication (IPC) on the Windows operating system. The key\nrequirement here is that the named pipe that PipeSnoop connects to should have been\nalready created/established - PipeSnoop does not attempt to create the pipe, it simply\ntries to connect to it. This capability indicates that PipeSnoop cannot function as a\nstandalone implant (unlike HTTPSnoop) on the endpoint. It needs a second component,\nthat acts as a server that will obtain arbitrary shellcode via some methods and will then\nfeed the shellcode to PipeSnoop via the named pipe.\n\n\n-----\n\n-----\n\nImplant connecting to a named pipe to obtain arbitrary shellcode.\n\n## Masquerading as benign traffic on the wire\n\nWe’ve observed HTTPSnoop listening for URL patterns that make it look like the\n[infected system being contacted is a server hosting Microsoft’s Exchange Web Services](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\n[(EWS) API. The URLs consisted of “ews” and “autodiscover” keywords over Ports 443](https://learn.microsoft.com/en-us/exchange/client-developer/exchange-web-services/ews-applications-and-the-exchange-architecture)\nand 444:\n\nSome of the HTTPSnoop implants use HTTP URLs that masquerade as those belonging\n[to OfficeTrack, an application developed by software company OfficeCore that helps](https://officetrack.com/)\nusers manage different administrative tasks. In several instances, we see URLs ending\n[in “lbs” and “LbsAdmin,” references to the application’s earlier name (OfficeCore’s LBS](https://pdfcoffee.com/officecore-officetrack-api-reference-pdf-free.html)\n[System) before it was later rebranded as OfficeTrack. OfficeTrack is currently marketed](https://pdfcoffee.com/officecore-officetrack-api-reference-pdf-free.html)\n\n\n-----\n\nas a workforce management solution geared toward providing coverage for logistics,\norder orchestration and equipment control. OfficeTrack is especially marketed towards\n[telecommunication firms. Some of the LBS URLs used by HTTPSnoop are:](https://officetrack.com/benefits-app-telecommunications/)\n\nThe HTTP URLs also consist of patterns mimicking provisioning services from an Israeli\ntelecommunications company. This telco may have used OfficeTrack in the past and/or\ncurrently uses this application, based on open-source findings.\n\nSome of the URLs in the HTTPSnoop implant are also related to those of systems from\nthe telecommunications firm:\n\n\n-----\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium=web-referral?utm_source=cisco&utm_campaign=amp-free-trial&utm_term=pgm-talos-trial&utm_content=amp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\n[threat actors as part of their campaign. You can try Secure Email for free here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium=web-referral&utm_source=cisco&utm_campaign=cmd-free-trial-request&utm_term=pgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW)](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[appliances such as Threat Defense Virtual, Adaptive Security Appliance and Meraki MX](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html)\ncan detect malicious activity associated with this threat.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to](https://umbrella.cisco.com/)\nmalicious domains, IPs and URLs, whether users are on or off the corporate network.\n[Sign up for a free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium=web-referral?utm_source=cisco&utm_campaign=umbrella-free-trial&utm_term=pgm-talos-trial&utm_content=automated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are\n[available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized](https://signup.duo.com/?utm_source=talos&utm_medium=referral&utm_campaign=duo-free-trial)\nare accessing your network.\n\n**_Note: We have shared our findings with both Microsoft and Palo Alto Networks for this_**\n_threat and intrusion set._\n\nClamAV detections are available for this threat:\nWin.Trojan.WCFBackdoor\n\n\n-----\n\n## Indicators of Compromise (IOCs)\n\n[Indicators of Compromise associated with this threat can be found here.](https://github.com/Cisco-Talos/IOCs/tree/main/2023/09)\n\n[© 2024 Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our Privacy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n[Policy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.09.19.ShroudedSnooper_Middle_East/New%20ShroudedSnooper%20actor%20targets%20telecommunications%20firms%20in%20the%20Middle%20East%20with%20novel%20Implants.pdf"
    ],
    "report_names": [
        "New ShroudedSnooper actor targets telecommunications firms in the Middle East with novel Implants"
    ],
    "threat_actors": [
        {
            "id": "b5449533-0ff1-4048-999d-7d4bfd8e6da6",
            "created_at": "2022-10-25T16:07:24.114365Z",
            "updated_at": "2025-03-27T02:02:10.111256Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [
                "Operation Dianxun",
                "TA416"
            ],
            "source_name": "ETDA:RedDelta",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Chymine",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9d63303c-817c-40d7-b703-c6d62f0dbddc",
            "created_at": "2023-10-14T02:03:14.471787Z",
            "updated_at": "2025-03-27T02:02:10.133386Z",
            "deleted_at": null,
            "main_name": "ShroudedSnooper",
            "aliases": [],
            "source_name": "ETDA:ShroudedSnooper",
            "tools": [
                "HTTPSnoop",
                "PipeSnoop",
                "TOFULOAD",
                "TOFUPIPE"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa90ad17-8852-4732-9dba-72ffb64db493",
            "created_at": "2023-07-11T02:00:10.067957Z",
            "updated_at": "2025-03-27T02:00:03.134199Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [],
            "source_name": "MISPGALAXY:RedDelta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1ddad928-ad5f-4885-9abd-e8965dd793df",
            "created_at": "2023-11-08T02:00:07.129402Z",
            "updated_at": "2025-03-27T02:00:03.191113Z",
            "deleted_at": null,
            "main_name": "ShroudedSnooper",
            "aliases": [],
            "source_name": "MISPGALAXY:ShroudedSnooper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc5c22a8-29eb-4a87-acd6-4817060e80f2",
            "created_at": "2022-10-25T15:50:23.658256Z",
            "updated_at": "2025-03-27T02:00:55.514297Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Volatile Cedar",
                "Lebanese Cedar"
            ],
            "source_name": "MITRE:Volatile Cedar",
            "tools": [
                "Caterpillar WebShell"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b152bc-6f7e-463c-8b4c-a4844caea6df",
            "created_at": "2023-01-06T13:46:38.498795Z",
            "updated_at": "2025-03-27T02:00:02.849085Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Lebanese Cedar",
                "DeftTorero"
            ],
            "source_name": "MISPGALAXY:Volatile Cedar",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ece64b74-f887-4d58-9004-2d1406d37337",
            "created_at": "2022-10-25T16:07:23.794442Z",
            "updated_at": "2025-03-27T02:02:09.981874Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "DecisiveArchitect",
                "Luminal Panda",
                "TH-239",
                "UNC1945"
            ],
            "source_name": "ETDA:LightBasin",
            "tools": [
                "CordScan",
                "EVILSUN",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LEMONSTICK",
                "LOGBLEACH",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "OKSOLO",
                "OPENSHACKLE",
                "ProxyChains",
                "Pupy",
                "PupyRAT",
                "SIGTRANslator",
                "SLAPSTICK",
                "SMBExec",
                "STEELCORGI",
                "Tiny SHell",
                "pupy",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "31c0d0e1-f793-4374-90aa-138ea1daea50",
            "created_at": "2023-11-30T02:00:07.29462Z",
            "updated_at": "2025-03-27T02:00:03.256081Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "UNC1945",
                "CL-CRI-0025"
            ],
            "source_name": "MISPGALAXY:LightBasin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1705457125,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1705378021,
    "ts_modification_date": 1705378021,
    "files": {
        "pdf": "https://archive.orkl.eu/c501ec19fa16b701ca5d314e13e09e5caec4d55f.pdf",
        "text": "https://archive.orkl.eu/c501ec19fa16b701ca5d314e13e09e5caec4d55f.txt",
        "img": "https://archive.orkl.eu/c501ec19fa16b701ca5d314e13e09e5caec4d55f.jpg"
    }
}