{
    "id": "d8413b9e-abfe-494a-a92d-2d80b1ddf273",
    "created_at": "2023-01-12T15:08:55.111621Z",
    "updated_at": "2025-03-27T02:05:52.907917Z",
    "deleted_at": null,
    "sha1_hash": "1d8dc809a897307232459f34ef38ddfff9e7e584",
    "title": "2017-03-28 - Cerber Starts Evading Machine Learning",
    "authors": "",
    "file_creation_date": "2022-05-28T19:37:31Z",
    "file_modification_date": "2022-05-28T19:37:31Z",
    "file_size": 182860,
    "plain_text": "# Cerber Starts Evading Machine Learning\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/cerber-starts-evading-machine-learning/](http://blog.trendmicro.com/trendlabs-security-intelligence/cerber-starts-evading-machine-learning/)**\n\nRansomware\n\n\nMarch 28, 2017\n\n\nCERBER is a ransomware family which has adopted a new technique to make itself harder\nto detect: it is now using a new loader which appears to be designed to evade detection by\nmachine learning solutions.\n\nBy: Trend Micro March 28, 2017 Read time: ( words)\n\n[The CERBER family of ransomware has been found to have adopted a new technique to](https://www.trendmicro.com/vinfo/us/security/definition/Ransomware)\nmake itself harder to detect: it is now using a new loader that appears to be designed to\nevade detection by machine learning solutions. This loader is designed to hollow out a\nnormal process where the code of CERBER is instead run.\n\n**_Behavior and Analysis_**\n\nRansomware typically arrives via email, and these new CERBER variants are no exception.\nEmails that claim to be from various utilities may have been used. The emails contain a link\nto a self-extracting archive, which has been uploaded to a Dropbox account controlled by the\nattackers. The target then downloads and opens it to infect a system. The following flow\nchart shows what happens next.\n\n_Figure 1. Cerber behavior flowchart_\n\n\n-----\n\nThe downloaded file is a self-extracting archive that contains three files: a Visual Basic script,\na DLL file, and a binary file that looks like a configuration file. In one sample we saw, these\nfiles are named 38oDr5.vbs, 8ivq.dll, and x, respectively. Other cases with the same\nbehavior may have different file names, however.\n\n_Figure 2. Contents of self-extracting archive_\n\nFirst, the script is run using the Windows Script Host. The script, in turn, loads the DLL file\nusing rundll32.exe with the DLL's filename and exports as the arguments.\n\nThe DLL file itself is simple and straightforward. All it does is read the configuration file (file\n_x), decrypts part of it, and execute whatever it decrypts. The DLL file is not packed or_\nencrypted; however, the code that it decrypted from file x is definitely malicious.\n\n_Figure 3. Start of binary file in X_\n\n_X contains the loader, as well as various configuration settings. The loader has features that_\ncheck if it is running in a virtual machine (VM), if it is running in a sandbox, if certain analysis\ntools are running on the machine, or if certain AV products are present. If any of these\nchecks fail, the malware stops running. The lists below highlight the specific tools and\nproducts this software checks for:\n\n_Analysis Tools_\n\nMsconfig\nSandboxes\nRegedit\nTask Manager\nVirtual Machines\nWireshark\n\n_Security vendors_\n\n360\nAVG\nBitdefender\nDr. Web\nKaspersky\nNorton\nTrend Micro\n\n\n-----\n\nThe main payload of the loader is the injection of code in another process. In this case, the\ninjected code is the whole Cerber binary, and it can be injected into any of the following\nprocesses:\n\nC:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\csc.exe\nC:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\regasm.exe\nC:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\csc.exe\nC:\\Windows\\SysWow64\\WerFault.exe\nC:\\Windows\\System32\\WerFault.exe\n\nPlease note that we have provided a list of the Dropbox URLs to their security team. The\nURLs in question are no longer functional, and the accounts involved have been banned\nfrom the service.\n\n**_Machine Learning and Evasion_**\n\nAs a threat, Cerber has already been blocked by earlier advances in security solutions.\nRunning Cerber in a normal process (as done by the loader) can help evade behavioral\nmonitoring, but why go to the trouble of repackaging Cerber and using a separate loader?\nEarlier versions of Cerber already had a code injection routine which could mimic that\nparticular behavior, so why was the separate loader necessary?\n\nThe answer lies in the adoption of the security industry of machine learning solutions. The\nindustry has created features to proactively detect malicious files based on features instead\nof signatures. The new packaging and loading mechanism employed by Cerber can cause\nproblems for static machine learning approaches–i.e, methods that analyze a file without any\nexecution or emulation.\n\nSelf-extracting files and simple, straightforward files could pose a problem for static machine\nlearning file detection. All self-extracting files may look similar by structure, regardless of the\ncontent. Unpacked binaries with limited features may not look malicious either. In other\nwords, the way Cerber is packaged could be said to be designed to evade machine learning\nfile detection. For every new malware detection technique, an equivalent evasion technique\nis created out of necessity.\n\nThis new evasion technique does not defeat an anti-malware approach that uses multiple\nlayers of protection. Cerber has its weaknesses against other techniques. For instance,\nhaving an unpacked .DLL file will make it easy to create a one-to-many pattern; alternately\nhaving a set structure within an archive will make it easier to identify if a package is\nsuspicious. Solutions that rely on a variety of techniques, and are not overly reliant on\nmachine learning, can still protect customers against these threats.\n\n**_Trend Micro Solutions_**\n\n\n-----\n\nThreats will always try to get around the latest solutions, and users should avoid relying on\nany single approach to security. A proactive, multilayered approach to security is more\neffective— from the [gateway,](http://blog.trendmicro.com/en_us/business/products/user-protection/sps.html) [endpoints,](http://blog.trendmicro.com/en_us/business/products/user-protection/sps.html) [networks, and](http://blog.trendmicro.com/en_us/business/products/network/advanced-threat-protection.html) [servers..](http://blog.trendmicro.com/en_us/business/products/hybrid-cloud.html)\n\n[Endpoint solutions such as Trend Micro™ Smart Protection Suites, and](http://blog.trendmicro.com/en_us/business/products/user-protection/sps.html) Worry-Free™\nBusiness Security can protect users and businesses from these threats by detecting\nmalicious files, and spammed messages as well as blocking all related malicious\nURLs. [Trend Micro Deep Discovery™ has an email inspection layer that can protect](http://blog.trendmicro.com/en_us/business/products/network/advanced-threat-protection.html)\nenterprises by detecting malicious attachment and URLs.\n\n[Trend Micro OfficeScan™ with](http://blog.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html) [XGen™ endpoint security infuses high-fidelity machine](http://www.trendmicro.com/us/business/xgen/index.html)\nlearning with other detection technologies and global threat intelligence for comprehensive\nprotection against ransomware and advanced malware. Our machine learning capabilities\nhave been tuned to account for attacks using these types of evasion techniques.\n\n**_Indicators of Compromise_**\n\nFiles with the following SHA256 hashes are associated with this threat:\n\n09ef4c6b8a297bf4cf161d4c12260ca58cc7b05eb4de6e728d55a4acd94606d4\n(Detected as VBS_CERBER.DLCYG)\na61eb7c8d7a6bc9e3eb2b42e7038a0850c56e68f3fec0378b2738fe3632a7e4c\n(Detected as Ransom_CERBER.ENC)\ne3e5d9f1bacc4f43af3fab28a905fa4559f98e4dadede376e199360d14b39153 (Detected\nas Ransom_CERBER.VSAGD)\nf4dbbb2c4d83c2bbdf4faa4cf6b78780b01c2a2c59bc399e5b746567ce6367dd (Detected\nas TROJ_CERBER.AL)\n\n**_Additional Analysis By Brian Cayanan and Jon Oliver._**\n\nTags\n\n[Endpoints |](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:environments/endpoints) [Research |](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:article-type/research) [Ransomware](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/ransomware)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-28 - Cerber Starts Evading Machine Learning.pdf"
    ],
    "report_names": [
        "2017-03-28 - Cerber Starts Evading Machine Learning.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536135,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653766651,
    "ts_modification_date": 1653766651,
    "files": {
        "pdf": "https://archive.orkl.eu/1d8dc809a897307232459f34ef38ddfff9e7e584.pdf",
        "text": "https://archive.orkl.eu/1d8dc809a897307232459f34ef38ddfff9e7e584.txt",
        "img": "https://archive.orkl.eu/1d8dc809a897307232459f34ef38ddfff9e7e584.jpg"
    }
}