{
    "id": "d852b4fd-ac6f-4e35-b48a-079386cef885",
    "created_at": "2023-01-12T15:06:05.888613Z",
    "updated_at": "2025-03-27T02:16:25.558309Z",
    "deleted_at": null,
    "sha1_hash": "7dd914bbc1fdd41d15198c1ddd67064e6424181f",
    "title": "2018-11-14 - Big Game Hunting- The Evolution of INDRIK SPIDER From Dridex Wire Fraud to BitPaymer Targeted Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T00:48:17Z",
    "file_modification_date": "2022-05-28T00:48:17Z",
    "file_size": 1155298,
    "plain_text": "# Big Game Hunting: The Evolution of INDRIK SPIDER From Dridex Wire Fraud to BitPaymer Targeted Ransomware\n\n**crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-**\nransomware/\n\nSergei Frankoff and Bex Hartley November 14, 2018\n\nINDRIK SPIDER is a sophisticated eCrime group that has been operating Dridex since June\n2014. In 2015 and 2016, Dridex was one of the most prolific eCrime banking trojans on the\nmarket and, since 2014, those efforts are thought to have netted INDRIK SPIDER millions of\ndollars in criminal profits. Throughout its years of operation, Dridex has received multiple\nupdates with new modules developed and new anti-analysis features added to the malware.\n\nIn August 2017, a new ransomware variant identified as BitPaymer was reported to have\nransomed the U.K.’s [National Health Service (NHS), with a high ransom demand of 53 BTC](https://www.bleepingcomputer.com/news/security/bit-paymer-ransomware-hits-scottish-hospitals/)\n(approximately $200,000 USD). The targeting of an organization rather than individuals, and\nthe high ransom demands, made BitPaymer stand out from other contemporary ransomware\nat the time. Though the encryption and ransom functionality of BitPaymer was not technically\nsophisticated, the malware contained multiple anti-analysis features that overlapped with\nDridex. Later technical analysis of BitPaymer indicated that it had been developed by\nINDRIK SPIDER, suggesting the group had expanded its criminal operation to include\nransomware as a monetization strategy.\n\n\n-----\n\nThe beginning of 2017 also brought a turning point in INDRIK SPIDER s operation of Dridex.\nDridex spam campaigns significantly declined, with new campaigns moving from high\nvolume and frequency, to smaller, targeted distribution. The rapid development of Dridex also\nslowed during this time, with fewer versions released during 2017 than in previous years.\nCrowdStrike® Falcon® Intelligence™ also observed a strong correlation between Dridex\ninfections and BitPaymer ransomware. During incidents that involved BitPaymer, Dridex was\ninstalled on the victim network prior to the deployment of the BitPaymer malware. Also\nunusual was the observation that both Dridex and BitPaymer were spread through the victim\n[network using lateral movement techniques traditionally associated with nation-state actors](https://www.crowdstrike.com/epp-101/lateral-movement/)\nand penetration testing.\n\nThese new tactics of selectively targeting organizations for high ransomware payouts have\nsignaled a shift in INDRIK SPIDER’s operation with a new focus on targeted, low-volume,\nhigh-return criminal activity: a type of cybercrime operation we refer to as big game hunting.\nSince this shift, INDRIK SPIDER has used BitPaymer ransomware as a key vehicle for these\noperations, having netted around $1.5M USD in the first 15 months of ransomware\noperations.\n\n## Targeted Delivery\n\nFalcon Intelligence has provided support to multiple active BitPaymer incident response (IR)\nengagements. The information gathered from these engagements, combined with\ninformation from prior Dridex IR engagements, provides insight into how INDRIK SPIDER\ndeploys and operates both Dridex and BitPaymer. An overview of this process is provided\nbelow in Figure 1.\n\n\n-----\n\nFigure 1. BitPaymer Ransomware Infection With Dridex\n\nIn recent BitPaymer IR engagements, Falcon Intelligence linked the initial infection vector to\nfake updates for a FlashPlayer plugin and the Chrome web browser. These fake updates are\nserved via legitimate websites that have been compromised, and use social engineering to\ntrick users into downloading and running a malicious executable. These fake update\ncampaigns appear to be a pay-per-install service that is simply used by INDRIK SPIDER to\n[deliver its malware, as other malware has also been delivered via the same campaigns.](https://blog.malwarebytes.com/threat-analysis/2018/04/fakeupdates-campaign-leverages-multiple-website-platforms/)\n\n### Lateral Movement With PowerShell Empire\n\nAfter the initial compromise, Falcon Intelligence observed both the Dridex loader and\n[PowerShell Empire in operation on the infected host. PowerShell Empire is a post-](https://www.powershellempire.com/)\nexploitation agent built for penetration testing, which was used to move laterally between\nhosts. When moving between hosts, the PowerShell Empire agent was run as a service with\nthe name `Updater, as shown below in Figure 2.`\n\n\n-----\n\nFigure 2. PowerShell Empire Run as a Service\n\nDuring this lateral movement, Falcon Intelligence also observed PowerShell Empire\ndeploying the Mimikatz module on servers in the victim’s network. [Mimikatz is a post-](https://github.com/gentilkiwi/mimikatz/wiki)\nexploitation tool used to harvest credentials from Windows hosts. These compromised\ncredentials were then used for further lateral movement. For many of the hosts that\nPowerShell Empire moved to, it would download and install the Dridex loader. The lateral\nmovement continued until the domain credentials for the environment were retrieved and\nboth PowerShell Empire and the Dridex loader were installed on the domain controllers in\nthe environment. This process appears to be automated based on the speed at which the\nhosts are compromised.\n\nThough traditionally used to load modules for fraud activity, recent updates to the Dridex\nloader also allow it to perform system and network reconnaissance. These reconnaissance\ncapabilities include the ability to collect information about the current user on the host, list\ncomputers on the local network, and extract the system’s environment variables. This\ninformation is likely used to assist with identifying interesting targets within the victim\nnetwork.\n\nIn some instances, Falcon Intelligence observed several days of inactivity between the time\nthe domain controllers were compromised and the installation of BitPaymer. This delay may\nindicate that the operators were performing reconnaissance and gathering information about\nthe victim before deciding how best to monetize the compromise.\n\n### Ransomware Deployed via PowerShell Empire and GPO\n\nFalcon Intelligence has observed two different methods used to deploy BitPaymer once the\ndomain controllers are compromised. In one instance, only the domain controllers and other\ncritical infrastructure, like payroll servers, were targeted and PowerShell Empire was used to\ndownload and execute the BitPaymer malware directly on these servers.\n\n\n-----\n\nIn another instance, the BitPaymer malware was downloaded to a network share in the\nvictim network, and a startup script called `gpupdate.bat was pushed to all the hosts on`\nthe network via Group Policy Object (GPO), from the domain controllers. This script copied\nBitPaymer from the share and executed it on each host in the network, encrypting thousands\nof machines.\n\n### Big Game Hunters Use APT Tactics\n\nThis targeted deployment methodology involving credential compromise, lateral movement,\nand the use of system administrator tools closely mimics behavior Falcon Intelligence has\nobserved from nation-state adversary groups, and penetration testing teams. With the move\nto targeting select victims for high-value payouts, the INDRIK SPIDER adversary group is no\nlonger forced to scale its operations, and now has the capacity to tailor its tooling to the\nvictim’s environment and play a more active role in the compromise with “hands on\nkeyboard” activity.\n\n## BitPaymer Ransomware\n\nThough the first publicly reported use of BitPaymer was in August 2017, when the malware\n[was linked to ransomware attacks against several NHS hospitals, it was first identified in July](https://www.bleepingcomputer.com/news/security/bit-paymer-ransomware-hits-scottish-hospitals/)\n[2017 by Twitter user Michael Gillespie. Later, in January 2018, a report was released that](https://twitter.com/demonslay335/status/884545841691844608)\nidentified similarities between the BitPaymer ransomware and Dridex malware. The report\n[authors renamed the malware “FriedEx.” Falcon Intelligence has analyzed this malware and](https://www.welivesecurity.com/2018/01/26/friedex-bitpaymer-ransomware-work-dridex-authors/)\ncan confirm the overlap between BitPaymer/FriedEx and Dridex malware.\n\nDue to the targeted nature of the ransomware, BitPaymer is custom-built for each operation,\nwith a unique encryption key, a ransom note and contact information embedded in it. As a\nresult of this customization, there are multiple builds of the malware, though Falcon\nIntelligence has identified two main variants: an older variant that splits the encryption\nprocess into multiple “modes” with each mode focused on a specific task; and a newer\nvariant that is built to be run as a service.\n\n### BitPaymer AKA “wp_encrypt”\n\nDuring analysis, Falcon Intelligence obtained builds of the ransomware that contained the\nprogram database (PDB) string S:\\Work\\_bin\\Release-Win32\\wp_encrypt.pdb. Based on this\nstring, the malware developers refer to this ransomware as wp_encrypt. The PDB string also\ncontains the prefix string S:\\Work\\, which is identical to other Dridex modules, including those\nshown in Table 1. The ransomware also contains code from the Dridex modules, with some\nvariants of the ransomware sharing up to 69 percent of their code with the Dridex loader.\n\n\n**MODULE**\n**NAME**\n\n\n**DESCRIPTION**\n\n\n-----\n\n`loader` Downloads and installs the core Dridex modules, including the worker\n\n`vnc` Provides remote desktop access\n\n`netcheck` Checks network connectivity\n\n`spammer` Spam module\n\n`worker` Core component responsible for banking trojan functionality, including\nkeylogging, web injects, download and execute second-stage payloads,\netc.\n\n`trendmicro` Whitelists Dridex modules from TrendMicro antivirus detection\n\n`wp_decrypt` BitPaymer decryption tool\n\nTable 1. Dridex Modules Sharing the Same PDB Path Prefix\n\n### Anti-Analysis\n\nBoth variants of the BitPaymer malware feature multiple techniques to hinder analysis. The\nmalware developers have employed a combination of encrypted strings, string hashes and\ndynamic API resolution to ensure that no strings exist in the binary.\n\n**Encrypted Strings Table**\n\nThe BitPaymer malware contains a small table of encrypted strings in the `rdata section of`\nthe binary. These strings use standard RC4 encryption in which the first 40 bytes form the\nRC4 key, and the remaining data contains the encrypted strings table. These strings are\ntemporarily decrypted on-demand during runtime. The strings in the decrypted strings table\nare separated by a null byte and are referenced by their order. This string table encryption\nmethod is identical to the method used in other Dridex malware, including the 40-byte key\nlength and the position of the table in the `rdata section. The strings table includes, among`\nother strings, the RSA public key used in the ransomware encryption, the ransom note, file\nextensions and the encryption target flags string.\n\n**String Hashes**\n\nIn addition to the encrypted strings table, BitPaymer replaces the remaining strings in the\nbinary with hashes and uses an algorithm to match these hashes with strings that exist on\nthe host. For example, when setting the run key for persistence, instead of simply opening\nthe registry key `HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run, BitPaymer`\nuses the API `RegEnumKeyW  to iterate through all the registry keys, comparing their hash`\nvalue until the correct key has been located. The hashing algorithm generates a CRC32\nhash of the string, converted to lowercase. This hash is combined with a DWORD using a\n\n\n-----\n\nsimple XOR. This DWORD is different for each build of the malware. This string hashing\nalgorithm is identical to the hashing algorithm used in other Dridex modules. The hash\nalgorithm has been replicated in Python below.\n\n```\nimport binascii\n\n```\n\n**Dynamic API Resolution**\n\nThe Windows APIs that are used in the malware are resolved dynamically at runtime. For\neach API, the function name and DLL name are hashed and stored in the binary. At runtime,\nwhen the API is needed, the malware will iterate through all DLLs in the Windows system\ndirectory, comparing a hash of their name with a precomputed DLL hash until it has been\nlocated. The malware will then load the DLL and iterate through the export table comparing a\nhash of the API name with the expected hash until it has been located. The hashing\nalgorithm used for the API names is the same CRC32 algorithm used for the string hashes.\nHowever, when hashing the DLL names, BitPaymer converts the strings to uppercase before\nhashing them. This process is also used in other Dridex modules.\n\n### Persistence\n\nThe older “mode” variant of BitPaymer uses the Windows registry for persistence, while the\nnewer service variant will attempt to install itself as a service. If that fails, it will fall back to\nusing the Windows registry.\n\n**Registry Persistence**\n\nThe older “mode” variant will first copy itself to either the `%USERPROFILE%\\AppData\\Local`\nor the `%USERPROFILE%\\AppData\\LocalLow directory, depending on its process integrity`\nlevel. Then it will add a new registry value to the registry key\n```\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run with the path to the newly\n\n```\ncopied malware. The registry value name is a randomly generated string between five and\nfifteen characters, containing upper and lowercase letters as well as numbers.\n\n**Windows Event Viewer UAC Bypass (eventvwr.msc)**\n\nWhen the newer service variant of BitPaymer is run, it first determines if it is being executed\nfrom an alternate data stream. If it is not executed from an alternate data stream, the\nmalware creates a file in the `%APPDATA% folder with a random file name between three and`\neight characters long, containing uppercase and lowercase letters as well as numbers. It\nthen copies itself to the alternate data stream `:bin of the newly created file and creates a`\nnew process from the stream.\n\n\n-----\n\nWhen the malware is executed from the alternate data stream, it checks the process integrity\nlevel. If it is not running with a level above medium integrity, it attempts to elevate its\nprivileges. To suppress the User Access Control (UAC) prompt that normally occurs during\nprivilege elevation, the malware uses a UAC bypass technique first documented in August\n2016. This bypass requires temporarily setting either the registry key\n```\nHKCU\\Software\\Classes\\ms-settings\\shell\\open\\command on Windows 10, or the\n\n```\nregistry key `HKCU\\Software\\Classes\\mscfile\\shell\\open\\command on Windows 7 to`\nexecute the malware. Once the registry key is set, the malware launches the Windows event\nviewer process `eventvwr.msc, which will inadvertently launch the malware set in the`\nregistry keys with elevated privileges.\n\n**Hijacked Service Persistence**\n\nIf elevated privileges are not obtained, the malware falls back to using the same Windows\nregistry run key as the older mode variant for persistence\n```\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run . However, if the malware is\n\n```\nsuccessful in elevating privileges, it begins to enumerate existing Windows services on the\nhost that are configured to run as `LocalSystem . The malware selects services that are`\ncurrently not active and ignores services that launch the executables `svchost.exe and`\n```\nlsass.exe . For each service, the malware attempts to take control of the service’s\n\n```\nexecutable — first using `icacls.exe with the` `/reset flag to reset the executable’s`\npermissions, then using `takeown.exe with the` `/F flag to take ownership of the`\nexecutable.\n\nIf this is successful, the malware creates a `:0 alternate data stream in the executable and`\ncopies the executable’s own contents to the stream. This can be used to restore the\nexecutable later. Then the malware replaces the contents of the executable with a copy of\nitself and launches the service. The file modified time of the executable is also artificially\nchanged to `00:00:00 UTC . The purpose of this time change is so the file can be identified`\nand restored by the decryption tool.\n\nOnce a service has been successfully hijacked and launched, the malware stops attempting\nto hijack the remaining services and exits. If there are no services matching the selection\ncriteria, BitPaymer simply exits and no files are encrypted\n\n### Shadow Files Removal\n\nBefore encryption, both variants of BitPaymer attempt to remove the backup shadow files\nfrom the host, making it impossible to restore encrypted files. This is achieved by launching\nthe `vssadmin.exe process with the following command` `vssadmin.exe` `Delete Shadows`\n```\n/All /Quiet .\n\n### Encryption\n\n```\n\n-----\n\nThere is a string present in the strings table that works like a configuration flag for the\nencryption targets of the malware. The string may contain a combination of the letters F, R,\nN, and S. During the encryption process, the letters in this flag are checked to determine\nwhat drive types to encrypt. The corresponding drive types for each letter are described\nbelow in Table 2. All BitPaymer samples analyzed by Falcon Intelligence had all four flags\nenabled for maximum encryption.\n\n**LETTER** **DESCRIPTION**\n\nF Encrypt fixed drives\n\nR Encrypt removable drives\n\nN Encrypt network drives (mounted)\n\nS Search for network shares on the domain / workgroup and encrypt them\n\nTable 2. BitPaymer Drive Type Configuration String\n\n**Network Share Encryption**\n\nIn order to encrypt network shares, BitPaymer will attempt to enumerate the sessions for\neach user logged onto the infected host and create a new process, using the token of each\nuser. These new processes will first spawn a `net.exe processing with the` `view argument`\nto gather a list of network accessible hosts. For each host, BitPaymer spawns another\n```\nnet.exe process with command net view <host> using the newly discovered host as a\n\n```\nparameter. This will return a list of network shares available to the impersonated user on the\nhost. Once a list of all available shares has been gathered, BitPaymer attempts to mount\nthem to be encrypted.\n\n**Encryption Routine**\n\nFor each drive targeted, the malware recursively iterates through all files and directories. For\neach file, the name and path are compared against a list of excluded filenames and two lists\nof excluded directory names. These exclusion lists are composed of regular expression type\nstrings that are located in the encrypted strings table. If the file name and path do not match\nany regular expressions in the exclusion lists, the file is encrypted.\n\nThe file encryption algorithm imports a hard-coded RSA 1024-bit public key from the\nencrypted strings table using `CryptImportPublicKeyInfo, and for each file, generates a`\n128-bit RC4 key using `CryptGenKey` `. The RC4 key is then used to encrypt the file in`\nplace. Once it is encrypted, the file is moved to a new file with the same name, and the file\nextension is appended with the keyword `.locked .`\n\n\n-----\n\nThe RC4 key is exported as a `SIMPLEBLOB encrypted with the RSA key and Base64-`\nencoded. A second file is created with the same name as the encrypted file, except it is\nappended with the extension `.readme_txt . A ransom note is written to this file, and the`\nRSA-encrypted, Base64-encoded RC4 key is appended to this file along with the `KEY:`\nstring. An example of the ransom note with the appended key is shown in Figure 3.\n\nFigure 3. BitPaymer Ransom Note with Encrypted RC4 Key\n\nBecause the key is not appended to the encrypted file but instead written to a separate file, if\nthe file containing the ransom note is accidentally deleted or moved to a separate directory,\nthe encrypted file will become unrecoverable. There is some indication that this may have\noccurred in the past, as newer ransom notes include specific warnings about touching the\n```\nreadme_txt files, while older versions of the ransom notes do not. The text from a newer\n\n```\nransom note is provided below in Figure 4.\n\n\n-----\n\nFigure 4. Newer Version of BitPaymer Ransom Note\n\nThe language in the ransom notes indicate that this ransomware is targeted specifically at\ncompanies, not individuals. The notes also contain a threat to leak private information that\nhas been collected from the target if the ransom is not paid. Though there is no functionality\nto collect this information in the ransomware itself, the ransomware is deployed by INDRIK\nSPIDER in parallel with Dridex malware, and the Dridex malware contains modules that may\nbe used to collect information from infected hosts.\n\nThe use of an embedded RSA public key also indicates that each build of the ransomware\nbinary is unique to a specific target. By design, the decryption tool needs to contain the\ncorresponding RSA private key so if the same build is used for multiple targets, the ransom\nwould only need to be paid once to acquire the private key, which could then be used to\ndecrypt all the infections. Falcon Intelligence has acquired multiple decryption tools related to\nBitPaymer, which confirm the theory that a unique key is used for each infection.\n\n## Ransom Note and Decryption Process\n\nInformation provided in Bitpaymer ransom notes has continued to change, with the first\nchange coming shortly after the first identified campaign in July 2017. Initially INDRIK\nSPIDER provided all required information in either the ransom note or through a TOR-based\npayment portal, meaning the victim could make the payment with very little interaction with\nthe actor. However, later notes removed this key information forcing the victims to email the\nINDRIK SPIDER campaign operator for payment and decryption details. A table of observed\nransom note changes can be seen below.\n\n\n-----\n\nTable 3. BitPaymer Ransom Note Changes\n\nBy removing the ransom demand from the note, INDRIK SPIDER can change the amount\nbased on campaign success, which likely depends on the size of the organization and the\nspeed of initial contact from the victim.\n\n### Email Support for Decryption\n\nUnlike many ransomware operations, which usually just require victims to make the payment\nand subsequently download a decryptor, INDRIK SPIDER requires the victim to engage in\ncommunication with an operator. Falcon Intelligence has had unique insight into the email\ndialogue between a victim and an INDRIK SPIDER operator. This dialogue has revealed\ndetails about how the adversary approaches payment negotiation with the victim, as well as\nthe communication of decryption instructions.\n\nInitial victim communication with the INDRIK SPIDER operator, using one of the email\naddresses provided, results in the operator providing key pieces of information up front, such\nas the BTC address and the ransom amount. INDRIK SPIDER is also willing to demonstrate\ndecryption legitimacy by offering to decrypt two test files of the victim’s choice.\n\nIt was made clear during communications that INDRIK SPIDER is not willing to negotiate on\nthe ransom amount, explicitly stating that the victim can use multiple Bitcoin exchanges to\nobtain the number of BTC required, and the exchange rate should be calculated based on\nthe rate posted on the cryptocurrency exchange Bittrex.\n\nRansom demands have varied between requesting an exact USD value in BTC and an exact\nnumber of BTC, which is likely due to the continued fluctuation in the BTC-to-USD value. In\ncommunications with INDRIK SPIDER, the victim is told to use any BTC exchange from the\n\n\n-----\n\ntop 10 and seek help from local information technology (IT) support companies. Of note,\nINDRIK SPIDER specifies the geographical location of where the victim should seek help,\nconfirming that they know key information about the victim.\n\nOnce payment has been made, INDRIK SPIDER acknowledges receipt and states that the\ndecryptor will be “delivered within a few hours.” Though earlier in the communication\nprocess, a one-hour time window for delivery of the decrypter is promised upon receipt of\npayment, the decryptor was actually delivered closer to four hours after payment. This\ndiscrepancy could be due to the difference in time zones and working hours of the INDRIK\nSPIDER operator.\n\nINDRIK SPIDER uses file sharing platforms to distribute the BitPaymer decryptor. In an\nextensive email to the victim, the INDRIK SPIDER operator provides a decryptor download\nlink, decryptor deletion link (to be used following decryptor download) and a password. The\nsame email also provides clear instructions on how to download and use the BitPaymer\ndecryptor, including how to remove the malware persistence. The operator also states that\nthey will be able to provide assistance using the same email address for a further period of\ntime, which is usually until the end of the current work week. Interestingly, INDRIK SPIDER\nprovides the victim with several key security recommendations to follow that may ultimately\navoid further breaches (see Figure 5). The recommendations provided are not only good\nadvice, but also provide indications of how INDRIK SPIDER breaches organizations and\nmoves laterally until domain controller access is gained.\n\nFigure 5. BitPaymer Security Recommendations\n\n### Ransom Payments\n\nRansom demands have varied significantly, suggesting that INDRIK SPIDER likely calculates\nthe ransom amount based on the size and value of the victim organization. The lowest\nidentified payment was for approximately $10,000 USD, and the highest observed was for\nclose to $200,000 USD.\n\n\n-----\n\n**BTC Address** **Total Received in USD**\n\n`12AWdHJkwF193ud21XWGontyCJTW6A9i6p` $197,596.05\n\n`1Ln9RxSRuDqqFhCTuqBPBKRMeyhVhRaUG4` $0\n\n`1BWj247jtipKr1wuFciKypeidZVwZWHCi9` $77,651.59\n\n`19aF868XPJhNqheXWgvrHPqnXpwhttf3Hw` $173,315.48\n\n`14uAWnPnhtrXDB9DTBCruToawM65dUgwot` $740,752.71\n\n`1PNmBWJHzJGqTUemastR7E4ccrUNASktmZ` $172,793.80\n\n`1DWbPyjmbKA1NFqv3nyL47y9Vsz6WFU4Hw` $192,867.22\n\nTable 4. BitPaymer BTC Addresses and Identified Payment Totals\n\nAs of Nov. 1, 2018, Falcon Intelligence had observed a total of 185.7 BTC paid to INDRIKSPIDER-controlled BTC addresses, with a USD total of $1,554,977 based on BTC-to-USD\nvalue at the time the ransom payment was made.\n\n## How CrowdStrike Falcon Prevent Stops BitPaymer\n\nThe process tree for BitPaymer, as seen by the Falcon sensor, is shown below in Figure 6.\n[To prevent BitPaymer from encrypting files on the host, Falcon Prevent™ next-generation](https://www.crowdstrike.com/products/falcon-prevent/)\nantivirus must kill the ransomware process (KX9OGR~1:BIN) prior to execution of the file\nencryption routines.\n\nFigure 6. BitPaymer Process Tree\n\n[Falcon Prevent provides two layers of defense to protect against ransomware threats like](https://www.crowdstrike.com/epp-101/what-is-ransomware/)\nBitPaymer: indicators of attack (IOAs) and machine learning (ML). Either one of these\ndefenses is enough to stop the BitPaymer process before it can encrypt any files.\n\n\n-----\n\nFigure 7 below shows an example of an IOA prevention alert that is sent to the centralized\nFalcon console. In this case, BitPaymer’s attempt to delete the backup shadow files triggered\nthe IOA that led to the prevention of this process.\n\nHad a prevention not existed for this IOA, BitPaymer would still have been prevented with\nCrowdStrike Falcon’s ML. Below, Figure 7 shows CrowdStrike ML detecting the BitPaymer\nbinary as malicious.\n\nFigure 7. BitPaymer Prevented by Falcon Prevent\n\nHad a prevention not existed for this IOA, BitPaymer would still have been prevented with\nCrowdStrike Falcon’s ML capabilities. Below, Figure 8 shows CrowdStrike ML detecting the\nBitPaymer binary as malicious.\n\nFigure 8. BitPaymer Detected by CrowdStrike Machine Learning\n\n## The Future of INDRIK SPIDER and Big Game Hunting\n\nINDRIK SPIDER consists of experienced malware developers and operators who have likely\nbeen part of the group since the early days of Dridex operations, beginning in June 2014.\nThe formation of the group and the modus operandi changed significantly in early 2017.\nDridex operations became more targeted, resulting in less distribution and Dridex subbotnets in operation, and BitPaymer ransomware operations began in July 2017.\n\nThere is no doubt that BitPaymer ransomware operations are proving successful for this\ncriminal group, with an average estimate take of over $200,000 USD per victim, but it is also\nimportant to remember that INDRIK SPIDER continues to operate the Dridex banking trojan.\nThough Dridex is still bringing in criminal revenue for the actor after almost four years of\n\n\n-----\n\noperation, targeted wire fraud operations likely require lengthy planning. Therefore, a\nransomware operation provides high-value income for the actor for a lot less expenditure,\nboth in operator and development costs.\n\nFalcon Intelligence anticipates that INDRIK SPIDER will continue to operate both Dridex and\nBitPaymer, with the two monetization strategies complementing each other. In scenarios\nwhere wire fraud is not as lucrative an option, INDRIK SPIDER might use ransomware to\nmonetize the compromise instead. What is clear though, is that the low-scale, selective\ntargeting and high payout tactics of big game hunting is proving to be a winning strategy for\nINDRIK SPIDER.\n\nINDRIK SPIDER isn’t the only criminal actor running big game hunting operations; The first\n[ransomware to stake a claim for big game hunting was Samas (aka SamSam), which is](https://www.crowdstrike.com/blog/operators-of-samsam-continue-to-receive-significant-ransom-payments/)\ndeveloped and operated by BOSS SPIDER. Since they were first identified in January 2-16,\nthis adversary has consistently targeted large organizations for high ransom demands. In\nJuly 2017, INDRIK SPIDER joined the movement of targeted ransomware with BitPaymer.\nMost recently, the ransomware known as Ryuk came to market in August 2017 and has\nnetted its operators, tracked by Falcon Intelligence as GRIM SPIDER, a significant (and\nimmediate) profit in campaigns also targeting large organizations.\n\nFalcon Intelligence anticipates that big game hunting operations will continue to grow. The\ncriminal actors INDRIK SPIDER, BOSS SPIDER, and GRIM SPIDER will sustain their\noperations in the near-term. It is also likely that other criminal actors are considering the\noption of running sophisticated ransomware operations. Given the tools, skilled campaign\noperators and malware required, it is likely there will still be only a handful of criminal groups\nable to do so in the near future; however, Falcon Intelligence considers this to be a growing\neCrime threat.\n\n## Indicators\n\nThe following table contains SHA256 hashes for BitPaymer samples analyzed by Falcon\nIntelligence.\n\n**SHA256 Hash** **Build**\n**Time**\n**(UTC)**\n\n`c7f8c6e833243519cdc8dd327942d62a627fe9c0793d899448938a3f10149481` 201710-22\n07:48:04\n\n`17526923258ff290ff5ca553248b5952a65373564731a2b8a0cff10e56c293a4` 201706-08\n14:20:38\n\n\n-----\n\n`282b7a6d1648e08c02846820324d932ccc224affe94793e9d63ff46818003636` 201706-30\n09:33:52\n\n`8943356b0288b9463e96d6d0f4f24db068ea47617299071e6124028a8160db9c` 201801-26\n14:43:27\n\nThe following table contains SHA256 hashes for unpacked BitPaymer decryptor samples\nanalyzed by Falcon Intelligence.\n\n**SHA256 Hash** **Build**\n**Time**\n**(UTC)**\n\n`f0e600bdca5c6a5eae155cc82aad718fe68d7571b7c106774b4c731baa01a50c` 201706-07\n15:08:59\n\n`b44e61de54b97c0492babbf8c56fad0c1f03cb2b839bad8c1c8d3bcd0591a010` 201708-02\n15:40:03\n\n`13209680c091e180ed1d9a87090be9c10876db403c40638a24b5bc893fd87587` 2017-1107\n14:40:50\n\nThe following table contains SHA256 hashes for Dridex samples deployed during the initial\nstages of a BitPaymer compromise.\n\n**SHA256 Hash** **Build**\n**Time**\n**(UTC)**\n\n`91c0c6ab8a1fe428958f33da590bdd52baec868c7011461da8a8972c3d989d42` 201805-01\n14:43:04\n\n`f1d69b69f53af9ea83fe8281e5c1745737fd42977597491f942755088c994d8e` 201805-01\n00:35:47\n\n`39e7a9b0ea00316b232b3d0f8c511498ca5b6aee95abad0c3f1275ef029a0bef` 201802-18\n12:38:40\n\n### Learn More:\n\n\n-----\n\n_For more information on how to incorporate intelligence on threat actors like INDRIK_\n_[SPIDER into your security strategy, please visit the Falcon Intelligence product page](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)_\n_[Download the CrowdStrike 2020 Global Threat Report](https://www.crowdstrike.com/resources/reports/2020-crowdstrike-global-threat-report/)_\n_[Learn more about CrowdStrike’s next-gen AV solution](https://www.crowdstrike.com/endpoint-security-products/falcon-prevent-endpoint-antivirus/)_\n_[Test Falcon Prevent for yourself with a free 15-day trial today](https://go.crowdstrike.com/try-falcon-prevent.html)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-14 - Big Game Hunting- The Evolution of INDRIK SPIDER From Dridex Wire Fraud to BitPaymer Targeted Ransomware.pdf"
    ],
    "report_names": [
        "2018-11-14 - Big Game Hunting- The Evolution of INDRIK SPIDER From Dridex Wire Fraud to BitPaymer Targeted Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb8697fd-882a-4323-9eb8-8e20222cfd91",
            "created_at": "2022-10-25T16:07:23.416834Z",
            "updated_at": "2025-03-27T02:02:09.788953Z",
            "deleted_at": null,
            "main_name": "Boss Spider",
            "aliases": [
                "Boss Spider",
                "CTG-0007",
                "Gold Lowell"
            ],
            "source_name": "ETDA:Boss Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "SDelete",
                "SamSam",
                "Samas"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8492b1a0-126f-4113-b8f7-101d28559629",
            "created_at": "2023-01-06T13:46:38.864213Z",
            "updated_at": "2025-03-27T02:00:02.938147Z",
            "deleted_at": null,
            "main_name": "GRIM SPIDER",
            "aliases": [
                "GOLD ULRICK"
            ],
            "source_name": "MISPGALAXY:GRIM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4116df25-aff6-46ee-a5dd-926254a78e89",
            "created_at": "2023-01-06T13:46:38.894033Z",
            "updated_at": "2025-03-27T02:00:02.94496Z",
            "deleted_at": null,
            "main_name": "BOSS SPIDER",
            "aliases": [
                "GOLD LOWELL"
            ],
            "source_name": "MISPGALAXY:BOSS SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1b20199b-07ae-42f1-ad22-bbe2dd471df8",
            "created_at": "2024-06-04T02:03:07.872554Z",
            "updated_at": "2025-03-27T02:05:17.383011Z",
            "deleted_at": null,
            "main_name": "GOLD LOWELL",
            "aliases": [
                "CTG-0007 ",
                "Boss Spider "
            ],
            "source_name": "Secureworks:GOLD LOWELL",
            "tools": [
                "Samas"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535965,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653698897,
    "ts_modification_date": 1653698897,
    "files": {
        "pdf": "https://archive.orkl.eu/7dd914bbc1fdd41d15198c1ddd67064e6424181f.pdf",
        "text": "https://archive.orkl.eu/7dd914bbc1fdd41d15198c1ddd67064e6424181f.txt",
        "img": "https://archive.orkl.eu/7dd914bbc1fdd41d15198c1ddd67064e6424181f.jpg"
    }
}