{
    "id": "d8ac2473-f7ee-40a2-9980-88f025c37983",
    "created_at": "2023-01-12T15:03:54.00765Z",
    "updated_at": "2025-03-27T02:15:49.298125Z",
    "deleted_at": null,
    "sha1_hash": "02815ad9b63865b6cf50a68546939273701b183b",
    "title": "2022-07-14 - North Korean threat actor (H0lyGh0st -DEV-0530) targets small and midsize businesses with H0lyGh0st ransomware",
    "authors": "",
    "file_creation_date": "2022-07-18T18:27:14Z",
    "file_modification_date": "2022-07-18T18:27:14Z",
    "file_size": 774312,
    "plain_text": "# North Korean threat actor targets small and midsize businesses with H0lyGh0st ransomware\n\n**[microsoft.com/security/blog/2022/07/14/north-korean-threat-actor-targets-small-and-midsize-businesses-with-h0lygh0st-ransomware/](https://www.microsoft.com/security/blog/2022/07/14/north-korean-threat-actor-targets-small-and-midsize-businesses-with-h0lygh0st-ransomware/)**\n\nJuly 14, 2022\n\nA group of actors originating from North Korea that Microsoft Threat Intelligence Center (MSTIC) tracks as DEV-0530 has been developing and\nusing ransomware in attacks since June 2021. This group, which calls itself H0lyGh0st, utilizes a ransomware payload with the same name for\nits campaigns and has successfully compromised small businesses in multiple countries as early as September 2021.\n\nAlong with their H0lyGh0st payload, DEV-0530 maintains an .onion site that the group uses to interact with their victims. The group’s standard\nmethodology is to encrypt all files on the target device and use the file extension .h0lyenc, send the victim a sample of the files as proof, and\nthen demand payment in Bitcoin in exchange for restoring access to the files. As part of their extortion tactics, they also threaten to publish\nvictim data on social media or send the data to the victims’ customers if they refuse to pay. This blog is intended to capture part of MSTIC’s\nanalysis of DEV-0530 tactics, present the protections Microsoft has implemented in our security products, and share insights on DEV-0530 and\nH0lyGh0st ransomware with the broader security community to protect mutual customers.\n\nMSTIC assesses that DEV-0530 has connections with another North Korean-based group tracked as PLUTONIUM (aka DarkSeoul or\nAndariel). While the use of H0lyGh0st ransomware in campaigns is unique to DEV-0530, MSTIC has observed communications between the\ntwo groups, as well as DEV-0530 using tools created exclusively by PLUTONIUM.\n\nAs with any observed nation-state actor activity, Microsoft directly notifies customers that have been targeted or compromised, providing them\nwith the information they need to secure their accounts. Microsoft uses DEV-#### designations as a temporary name given to an unknown,\nemerging, or a developing cluster of threat activity, allowing MSTIC to track it as a unique set of information until we reach high confidence\nabout the origin or identity of the actor behind the activity.\n\n## Who is DEV-0530?\n\nDEV-0530 primarily operates ransomware campaigns to pursue financial objectives. In MSTIC’s investigations of their early campaigns,\nanalysts observed that the group’s ransom note included a link to the .onion site\n_hxxp://matmq3z3hiovia3voe2tix2x54sghc3tszj74xgdy4tqtypoycszqzqd[.]onion, where the attackers claim to “close the gap between the rich_\nand poor”. They also attempt to legitimize their actions by claiming to increase the victim’s security awareness by letting the victims know more\nabout their security posture.\n\n\n-----\n\n_Figure 1. A H0lyGh0st ransom note linked to the attackers’_\n\n_.onion site._ _Figure 2. DEV-0530 attackers publishing their claims_\n\n_on their website._\nLike many other ransomware actors, DEV-0530 notes on their website’s privacy policy that they would not sell or publish their victim’s data if\nthey get paid. But if the victim fails to pay, they would publish everything. A contact form is also available for victims to get in touch with the\nattackers.\n\n_Figure 3. Privacy policy and contact us information on the_\n\n_H0lyGh0st website._\n\n### Affiliations with other threat actors originating from North Korea\n\nMSTIC assesses there is likely some overlap between DEV-0530 and PLUTONIUM. PLUTONIUM is a North Korean threat actor group\naffiliated with clusters of activity that are also known as DarkSeoul and Andariel. Active since at least 2014, PLUTONIUM has primarily\ntargeted the energy and defense industries in India, South Korea, and the United States using a variety of tactics and techniques.\n\nMSTIC has observed known DEV-0530 email accounts communicating with known PLUTONIUM attacker accounts. MSTIC has also observed\nboth groups operating from the same infrastructure set, and even using custom malware controllers with similar names.\n\n\n-----\n\no u t e assess t e o g o 0530 ope at o s, S C pe o ed a te po a a a ys s o obse ed act ty o t e g oup S C\nestimates that the pattern of life of DEV-0530 activity is most consistent with the UTC+8 and UTC+9 time zones. UTC+9 is the time zone used\nin North Korea.\n\nDespite these similarities, differences in operational tempo, targeting, and tradecraft suggest DEV-0530 and PLUTONIUM are distinct groups.\n\n### Why are North Korean actors using ransomware?\n\nBased on geopolitical observations by global experts on North Korean affairs and circumstantial observations, Microsoft analysts assess the\nuse of ransomware by North Korea-based actors is likely motivated by two possible objectives.\n\nThe first possibility is that the North Korean government sponsors this activity. The weakened North Korean economy has become weaker\n[since 2016 due to sanctions,](https://www.eastasiaforum.org/2019/07/03/the-true-impact-of-north-korean-sanctions/) [natural disasters,](https://www.dw.com/en/north-korea-heavy-flooding-destroys-homes-farmland/a-58836629?msclkid=eeef7b7dd11111ecb691bad2c3ea6f1b) [drought, and the North Korean government’s COVID-19](https://www.reuters.com/world/asia-pacific/nkorea-mobilises-office-workers-fight-drought-amid-food-shortages-2022-05-04/?msclkid=08fb8968d11211ec82529b8c3be00fef) [lockdown from the outside world since](https://www.brookings.edu/blog/order-from-chaos/2021/11/22/north-korea-is-addressing-the-pandemic-in-its-style-that-means-leaving-a-lot-of-people-hungry/?msclkid=370e097cd11211ec883f8581c6694799)\nearly 2020. To offset the losses from these economic setbacks, the North Korean government could have sponsored cyber actors stealing from\n[banks and cryptocurrency wallets for more than five years. If the North Korean government is ordering these ransomware attacks, then the](https://www.microsoft.com/en-us/security/business/microsoft-digital-defense-report?msclkid=42ced67ad11411ec99c5ac69ac1c0a22)\nattacks would be yet another tactic the government has enabled to offset financial losses.\n\nHowever, state-sponsored activity against cryptocurrency organizations has typically targeted a much broader set of victims than observed in\nDEV-0530 victimology. Because of this, it is equally possible that the North Korean government is not enabling or supporting these\nransomware attacks. Individuals with ties to PLUTONIUM infrastructure and tools could be moonlighting for personal gain. This moonlighting\ntheory might explain the often-random selection of victims targeted by DEV-0530.\n\nAlthough Microsoft cannot be certain of DEV-0530’s motivations, the impact of these ransomware attacks on our customers raises the\nimportance of exposing the underlying tactics and techniques, detecting and preventing attacks in our security products, and sharing our\nknowledge with the security ecosystem.\n\n## Ransomware developed by DEV-0530\n\nBetween June 2021 and May 2022, MSTIC classified H0lyGh0st ransomware under two new malware families: SiennaPurple and SiennaBlue.\nBoth were developed and used by DEV-0530 in campaigns. MSTIC identified four variants under these families – BTLC_C.exe, HolyRS.exe,\nHolyLock.exe, and BLTC.exe – and clustered them based on code similarity, C2 infrastructure including C2 URL patterns, and ransom note\ntext. BTLC_C.exe is written in C++ and is classified as SiennaPurple, while the rest are written in Go, and all variants are compiled into .exe to\ntarget Windows systems. Microsoft Defender Antivirus, which is built into and ships with Windows 10 and 11, detects and blocks BTLC_C.exe\nas SiennaPurple and the rest as SiennaBlue, providing protection for Windows users against all known variants the H0lyGh0st malware..\n\n_Figure 4. Timeline of DEV-0530_\n\n_ransomware payloads._\n\n### SiennaPurple ransomware family: BTLC_C.exe\n\nBLTC_C.exe is a portable ransomware developed by DEV-0530 and was first seen in June 2021. This ransomware doesn’t have many\nfeatures compared to all malware variants in the SiennaBlue family. Prominently, if not launched as an administrative user, the BLTC_C.exe\nmalware displays the following hardcoded error before exiting:\n```\n\"This program only execute under admin privilege\".\n\n```\nThe malware uses a simple obfuscation method for strings where 0x30 is subtracted from the hex value of each character, such that the string\n“aic^ef^bi^abc0” is decoded to 193[.]56[.]29[.]123. The indicators of compromise (IOCs) decoded from the BLTC_C.exe ransomware are\nconsistent with all malware variants in the SiennaBlue family, including the C2 infrastructure and the HTTP beacon URL structure access.php?\n_order=AccessRequest&cmn. The BTLC_C.exe sample analyzed by MSTIC has the following PDB path: M:\\ForOP\\attack(utils)\\attack_\n_tools\\Backdoor\\powershell\\btlc_C\\Release\\btlc_C.pdb._\n\n\n-----\n\n### S e a ue a so a e a y o y S e e, o y oc e e e, a d C e e\n\nBetween October 2021 and May 2022, MSTIC observed a cluster of new DEV-0530 ransomware variants written in Go. We classified these\nvariants as SiennaBlue. While new Go functions were added to the different variants over time, all the ransomware in the SiennaBlue family\nshare the same core Go functions.\n\nA deeper look into the Go functions used in the SiennaBlue ransomware showed that over time, the core functionality expanded to include\nfeatures like various encryption options, string obfuscation, public key management, and support for the internet and intranet. The table below\ndemonstrates this expansion by comparing the Go functions in HolyRS.exe and BTLC.exe:\n\n**HolyRS.exe [2021]** **BTLC.exe [2022]**\n\n_main_main_\n\n_main_main_ _main_init_0_\n\n_main_init_0_ _main_IsAdmin_\n\n_main_IsAdmin_ _main_encryptFiles_\n\n_main_encryptFiles_ **_main_DeleteSchTask_**\n\n_HolyLocker_RsaAlgorithm_GenerateKeyPair_ **_main_DisableNetworkDevice_** **_main_encryptString_**\n\n_HolyLocker_RsaAlgorithm_Encrypt_ **_main_decryptString_**\n\n_HolyLocker_CryptoAlogrithm___ptr_File__EncryptRSA_ **_main_cryptAVPass_**\n\n_HolyLocker_CryptoAlogrithm___ptr_File__EncryptAES_ **_main_SelfDelete_**\n\n_HolyLocker_utilities_GenerateRandomANString_ _HolyLocker_RsaAlgorithm_GenerateKeyPair_\n\n_HolyLocker_utilities_StringInSlice_ _HolyLocker_RsaAlgorithm_Encrypt_\n\n_HolyLocker_utilities_SliceContainsSubstring_ _HolyLocker_CryptoAlogrithm___ptr_File__EncryptRSA_\n\n_HolyLocker_utilities_RenameFile_ _HolyLocker_CryptoAlogrithm___ptr_File__EncryptAES_\n\n_HolyLocker_Main_init_ _HolyLocker_utilities_GenerateRandomANString_\n\n_HolyLocker_communication_New_ _HolyLocker_utilities_StringInSlice_\n\n_HolyLocker_communication___ptr_Client__GetPubkeyFromServer_ _HolyLocker_utilities_SliceContainsSubstring_\n\n_HolyLocker_communication___ptr_Client__Do_ _HolyLocker_utilities_RenameFile_\n\n_HolyLocker_communication___ptr_Client__SendEncryptedPayload_ _HolyLocker_Main_init_\n\n_HolyLocker_communication___ptr_Client__SendFinishRequest_ _HolyLocker_communication_New_\n\n_HolyLocker_communication___ptr_Client__AddNewKeyPairToIntranet_ _HolyLocker_communication___ptr_Client__GetPubkeyFromServer_\n\n_HolyLocker_communication___ptr_Client__AddNewKeyPair_ _HolyLocker_communication___ptr_Client__Do_\n\n_HolyLocker_communication___ptr_Client__SendEncryptedPayload_\n\n_HolyLocker_communication___ptr_Client__SendFinishRequest_\n\n_HolyLocker_communication___ptr_Client__AddNewKeyPairToIntranet_\n_HolyLocker_communication___ptr_Client__AddNewKeyPair_\n\nMSTIC assesses DEV-0530 successfully compromised several targets in multiple countries using HolyRS.exe in November 2021. A review of\nthe victims showed they were primarily small-to-midsized businesses, including manufacturing organizations, banks, schools, and event and\nmeeting planning companies. The victimology indicates that these victims are most likely targets of opportunity. MSTIC suspects that DEV[0530 might have exploited vulnerabilities such as CVE-2022-26352 (DotCMS remote code execution vulnerability) on public-facing web](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-26352)\napplications and content management systems to gain initial access into target networks. The SiennaBlue malware variants were then\ndropped and executed. To date, MSTIC has not observed DEV-0530 using any 0-day exploits in their attacks.\n\nAfter successfully compromising a network, DEV-0530 exfiltrated a full copy of the victims’ files. Next, the attackers encrypted the contents of\nthe victim device, replacing all file names with Base64-encoded versions of the file names and renaming the extension to .h0lyenc. Victims\nfound a ransom note in C:\\FOR_DECRYPT.html, as well as an email from the attackers with subject lines such as:\n```\n!!!!We are < H0lyGh0st>. Please Read me!!!!\n\n```\nAs seen in the screenshot below, the email from the attackers let the victim know that the group has stolen and encrypted all their files. The\nemail also included a link to a sample of the stolen data to prove their claim, in addition to the demand for payment for recovering the files.\n\n_Figure 5. Ransom note left by DEV-0530 attackers._\n\nBTLC.exe is the latest DEV-0530 ransomware variant and has been seen in the wild since April 2022. BTLC.exe can be configured to connect\nto a network share using the default username, password, and intranet URL hardcoded in the malware if the ServerBaseURL is not accessible\nfrom the device. One notable feature added to BTLC.exe is a persistence mechanism in which the malware creates or deletes a scheduled\ntask called lockertask, such that the following command line syntax can be used to launch the ransomware:\n```\ncmd.exe /Q /c schtasks /create /tn lockertask /tr [File] /sc minute /mo 1 /F /ru system 1> \\\\127.0.0.1\\ADMIN$\\__[randomnumber] 2>&1\n\n```\n\n-----\n\nO ce t e a so a e s success u y au c ed as a ad st ato, t t es to co ect to t e de au t Se e aseU a dcoded t e\nmalware, attempts to upload a public key to the C2 server, and encrypts all files in the victim’s drive.\n\n**HolyRS.exe/HolyLocker.exe C2 configuration** **BTLC.exe C2 configuration**\n\n\nmain_ServerBaseURL: hxxp://193[.]56[.]29[.]123:8888\n\nmain_IntranetURL: 10[.]10[.]3[.]42\n\nmain_Username: adm-karsair\n\n\nEncryptionKey: H0lyGh0stKey1234\nIntranetUrl: 192[.]168[.]168[.]5\n\nUsername: atrismsp Scheduledtask name: lockertask\n\n\n_Figure 6. BTLC.exe C2 communication_\n\nBased on our investigation, the attackers frequently asked victims for anywhere from 1.2 to 5 Bitcoins. However, the attackers were usually\nwilling to negotiate and, in some cases, lowered the price to less than one-third of the initial asking price. As of early July 2022, a review of the\nattackers’ wallet transactions shows that they have not successfully extorted ransom payments from their victims.\n\n_Figure 7. Screenshot of DEV-0530 attackers’ wallet_\n\nHolyRS.exe/BTLC.exe C2 URL pattern:\n\n_hxxp://193[.]56[.]29[.]123:8888/access.php?order=GetPubkey&cmn=[Victim_HostName]_\n_hxxp://193[.]56[.]29[.]123:8888/access.php?order=golc_key_add&cmn=[Victim_HostName]&type=1_\n_hxxp://193[.]56[.]29[.]123:8888/access.php?order=golc_key_add&cmn=[Victim_HostName]&type=2_\n_hxxp://193[.]56[.]29[.]123:8888/access.php?order=golc_finish&cmn=[Victim_HostName]&_\n\nExamples of HolyRS.exe/BTLC.exe ransom note metadata:\n\nAttacker email address: H0lyGh0st@mail2tor[.]com\n\nImage location: hxxps://cloud_ex42[.]usaupload[.]com/cache/plugins/filepreviewer/219002/f44c6929994386ac2ae18b93f8270ec9ff8420d528c9e35a878efaa2d38fb94c/1100x800_\nReport URL: hxxp://matmq3z3hiovia3voe2tix2x54sghc3tszj74xgdy4tqtypoycszqzqd[.]onion\n\nMicrosoft will continue to monitor DEV-0530 activity and implement protections for our customers. The current detections, advanced\ndetections, and indicators of compromise (IOCs) in place across our security products are detailed below.\n\n## Recommended customer actions\n\n\n-----\n\nc oso t as p e e ted p otect o s to detect t ese a a e a es as S e a u p e a d S e a ue (e g, a so 3 /S e a ue )\nvia Microsoft Defender Antivirus and Microsoft Defender for Endpoint, wherever these are deployed on-premises and in cloud environments.\n\n[Microsoft encourages all organizations to proactively implement and frequently validate a data backup and restore plan as part of broader](https://docs.microsoft.com/azure/security/fundamentals/backup-plan-to-protect-against-ransomware)\nprotection against ransomware and extortion threats.\n\nThe techniques used by DEV-0530 in H0lyGh0st activity can be mitigated by adopting the security considerations provided below:\n\nUse the included IOCs to investigate whether they exist in your environment and assess for potential intrusion.\n\nOur [blog on the ransomware-as-a-service economy has an exhaustive guide on how to protecting against ransomware threats. We encourage](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/)\nreaders to refer to that blog for a comprehensive guide that has a deep dive into each of the following areas:\n\nBuilding credential hygiene\nAuditing credential exposure\nPrioritizing deployment of Active Directory updates\nCloud hardening\n\n[Implement the Azure Security Benchmark and general best practices for securing identity infrastructure.](https://docs.microsoft.com/security/benchmark/azure/)\n[Ensure cloud admins/tenant admins are treated with the same level of security and credential hygiene as Domain Admins.](https://docs.microsoft.com/azure/active-directory/roles/best-practices)\n[Address gaps in authentication coverage.](https://docs.microsoft.com/azure/active-directory/authentication/how-to-authentication-find-coverage-gaps)\n[Enforcing MFA on all accounts, remove users excluded from MFA, and strictly require MFA from all devices, in all locations, at all times.](https://docs.microsoft.com/azure/active-directory/identity-protection/howto-identity-protection-configure-mfa-policy)\nEnabling passwordless authentication methods (for example, Windows Hello, FIDO keys, or Microsoft Authenticator) for accounts that\nsupport passwordless. For accounts that still require passwords, use authenticator apps like Microsoft Authenticator for MFA.\n[Disabling legacy authentication.](https://docs.microsoft.com/azure/active-directory/fundamentals/concept-fundamentals-block-legacy-authentication#moving-away-from-legacy-authentication)\n\nFor small or midsize companies who use Microsoft Defender for Business or Microsoft 365 Business Premium, enabling each of the features\nbelow will provide a protective layer against these threats where applicable. For Microsoft 365 Defender customers, the following checklist\neliminates security blind spots:\n\nTurn on [cloud-delivered protection in Microsoft Defender Antivirus to cover rapidly evolving attacker tools and techniques, block new and](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus?view=o365-worldwide)\nunknown malware variants, and enhance attack surface reduction rules and tamper protection.\nTurn on [tamper protection features to prevent attackers from stopping security services.](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection?view=o365-worldwide)\n[Run EDR in block mode so that Microsoft Defender for Endpoint can block malicious artifacts, even when a non-Microsoft antivirus](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/edr-in-block-mode?view=o365-worldwide)\ndoesn’t detect the threat or when Microsoft Defender Antivirus is running in passive mode. EDR in block mode also blocks indicators\nidentified proactively by Microsoft Threat Intelligence teams.\n[Enable network protection to prevent applications or users from accessing malicious domains and other malicious content on the](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/enable-network-protection?view=o365-worldwide)\ninternet.\n[Enable investigation and remediation in full automated mode to allow Microsoft Defender for Endpoint to take immediate action on alerts](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/automated-investigations?view=o365-worldwide)\nto resolve breaches.\nUse [device discovery to increase visibility into the network by finding unmanaged devices and onboarding them to Microsoft Defender for](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/device-discovery?view=o365-worldwide)\nEndpoint.\n[Protect user identities and credentials using Microsoft Defender for Identity, a cloud-based security solution that leverages on-premises](https://docs.microsoft.com/defender-for-identity/what-is)\nActive Directory signals to monitor and analyze user behavior to identify suspicious user activities, configuration issues, and active\nattacks.\n\n## Indicators of compromise\n\nThis list provides IOCs observed during our investigation. We encourage our customers to investigate these indicators in their environments\nand implement detections and protections to identify past related activity and prevent future attacks against their systems.\n\n**Indicator** **Type** **Description**\n\n99fc54786a72f32fd44c7391c2171ca31e72ca52725c68e2dde94d04c286fccd SHA-256 Hash of BTLC_C.exe\n\nf8fc2445a9814ca8cf48a979bff7f182d6538f4d1ff438cf259268e8b4b76f86 SHA-256 Hash of HolyRS.exe\n\nbea866b327a2dc2aa104b7ad7307008919c06620771ec3715a059e675d9f40af SHA-256 Hash of BTLC.exe\n\n\ncmd.exe /Q /c schtasks /create /tn lockertask /tr [File] /sc minute /mo 1 /F /ru system 1>\n\\\\127.0.0.1\\ADMIN$\\__[randomnumber] 2>&1\n\n\nCommand\nline\n\n\nExample of new\nScheduledTask to BTLC.exe\n\n\n193[.]56[.]29[.]123 C2 C2 IP address\n\nH0lyGh0st@mail2tor[.]com Email Ransomware payment\ncommunication address\n\nC:\\FOR_DECRYPT.html File path File path of ransom note\n\n**NOTE Th** i di t h ld t b id d h ti f thi b d ti it\n\n\n-----\n\n## Microsoft 365 detections\n\n### Microsoft Defender Antivirus\n\n[Trojan:Win32/SiennaPurple.A](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/SiennaPurple.A!dha&threatId=-2147141099)\n[Ransom:Win32/SiennaBlue.A](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Win32/SiennaBlue.A!dha&threatId=-2147141100)\n[Ransom:Win32/SiennaBlue.B](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Win32/SiennaBlue.B!dha&threatId=-2147141098)\n\n### Microsoft Defender for Endpoint\n\nMicrosoft Defender for Endpoint customers may see any or a combination of the following alerts as an indication of possible attack.\n\nDEV-0530 activity group\nRansomware behavior detected in the file system\nPossible ransomware infection modifying multiple files\nPossible ransomware activity\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\nTo locate possible DEV-0530 activity mentioned in this blog post, Microsoft Sentinel customers can use the queries detailed below:\n\n**Identify DEV-0530 IOCs**\n\nThis query identifies a match based on IOCs related to DEV-0530 across various Sentinel data feeds:\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Dev-0530_July2022.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Dev-0530_July2022.yaml)\n\n**Identify renamed file extension**\n\nDEV-0530 actors are known to encrypt the contents of the victim’s device as well as rename the file and extension. The following query detects\nthe creation of files with .h0lyenc extension:\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Dev-0530_FileExtRename.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Dev-0530_FileExtRename.yaml)\n\n**Identify Microsoft Defender Antivirus detection related to DEV-0530**\n\nThis query looks for Microsoft Defender AV detections related to DEV-0530 and joins the alert with other data sources to surface additional\ninformation such as device, IP, signed-in on users, etc.\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityAlert/Dev-0530AVHits.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityAlert/Dev-0530AVHits.yaml)\n\n### Yara rules\n```\nrule SiennaPurple\n\n{ \n     meta:\n\n          author = \"Microsoft Threat Intelligence Center (MSTIC)\"\n\n          description = \"Detects PDB path, C2, and ransom note in DEV-0530 Ransomware SiennaPurple samples\"\n\n          hash = \"99fc54786a72f32fd44c7391c2171ca31e72ca52725c68e2dde94d04c286fccd\"\n\n     strings:\n\n          $s1 = \"ForOP\\\\attack(utils)\\\\attack tools\\\\Backdoor\\\\powershell\\\\btlc_C\\\\Release\\\\btlc_C.pdb\"\n\n          $s2 = \"matmq3z3hiovia3voe2tix2x54sghc3tszj74xgdy4tqtypoycszqzqd.onion\"\n\n          $s3 = \"H0lyGh0st@mail2tor.com\"\n\n          $s4 = \"We are <HolyGhost>. All your important files are stored and encrypted.\"\n\n          $s5 = \"aic^ef^bi^abc0\"\n\n          $s6 = \"---------------------------3819074751749789153841466081\"\n\n     condition:\n\n          uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550 and\n\n          filesize < 7MB and filesize > 1MB and\n\n          all of ($s*)\n\n}\n\n```\n\n-----\n\n```\n{\n     meta:\n\n          author = \"Microsoft Threat Intelligence Center (MSTIC)\"\n\n          description = \"Detects Golang package, function, and source file names observed in DEV-0530 Ransomware SiennaBlue\nsamples\"\n\n          hash1 = \"f8fc2445a9814ca8cf48a979bff7f182d6538f4d1ff438cf259268e8b4b76f86\"\n\n          hash2 = \"541825cb652606c2ea12fd25a842a8b3456d025841c3a7f563655ef77bb67219\"\n\n     strings:\n\n          $holylocker_s1 = \"C:/Users/user/Downloads/development/src/HolyLocker/Main/HolyLock/locker.go\"\n\n          $holylocker_s2 = \"HolyLocker/Main.EncryptionExtension\"\n\n          $holylocker_s3 = \"HolyLocker/Main.ContactEmail\"\n\n          $holylocker_s4 = \"HolyLocker/communication.(*Client).GetPubkeyFromServer\"\n\n          $holylocker_s5 = \"HolyLocker/communication.(*Client).AddNewKeyPairToIntranet\"\n\n          $holyrs_s1 = \"C:/Users/user/Downloads/development/src/HolyGhostProject/MainFunc/HolyRS/HolyRS.go\"\n\n          $holyrs_s2 = \"HolyGhostProject/MainFunc.ContactEmail\"\n\n          $holyrs_s3 = \"HolyGhostProject/MainFunc.EncryptionExtension\"\n\n          $holyrs_s4 = \"HolyGhostProject/Network.(*Client).GetPubkeyFromServer\"\n\n          $holyrs_s5 = \"HolyGhostProject/Network.(*Client).AddNewKeyPairToIntranet\"\n\n          $s1 = \"Our site : <b><a href=%s>H0lyGh0stWebsite\"\n\n          $s2 = \".h0lyenc\"\n\n          $go_prefix = \"Go build ID:\"\n\n     condition:\n\n          uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550 and\n\n          filesize < 7MB and filesize > 1MB and\n\n          $go_prefix and all of ($s*) and (all of ($holylocker_*) or all of ($holyrs_*))\n\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-14 - North Korean threat actor (H0lyGh0st -DEV-0530) targets small and midsize businesses with H0lyGh0st ransomware.pdf"
    ],
    "report_names": [
        "2022-07-14 - North Korean threat actor (H0lyGh0st -DEV-0530) targets small and midsize businesses with H0lyGh0st ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "40ec2da8-7156-4bff-b878-41984eb70df4",
            "created_at": "2024-02-02T02:00:04.080917Z",
            "updated_at": "2025-03-27T02:00:03.309961Z",
            "deleted_at": null,
            "main_name": "Storm-0530",
            "aliases": [
                "DEV-0530",
                "H0lyGh0st"
            ],
            "source_name": "MISPGALAXY:Storm-0530",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "68cc6e37-f16d-4995-a75b-5e8e2a6cbb3d",
            "created_at": "2024-05-01T02:03:07.943593Z",
            "updated_at": "2025-03-27T02:05:17.259709Z",
            "deleted_at": null,
            "main_name": "BRONZE EDISON",
            "aliases": [
                "DarkSeoul",
                "Maverick Panda ",
                "Sykipot ",
                "TG-0623 ",
                "getkys",
                "APT4 "
            ],
            "source_name": "Secureworks:BRONZE EDISON",
            "tools": [
                " Wkysol",
                " ZxPortMap",
                "Gh0st RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535834,
    "ts_updated_at": 1743041749,
    "ts_creation_date": 1658168834,
    "ts_modification_date": 1658168834,
    "files": {
        "pdf": "https://archive.orkl.eu/02815ad9b63865b6cf50a68546939273701b183b.pdf",
        "text": "https://archive.orkl.eu/02815ad9b63865b6cf50a68546939273701b183b.txt",
        "img": "https://archive.orkl.eu/02815ad9b63865b6cf50a68546939273701b183b.jpg"
    }
}