{
    "id": "d91dcc2f-7cea-4a6e-9e24-433df17cdee3",
    "created_at": "2022-10-25T16:48:19.793382Z",
    "updated_at": "2025-03-27T02:15:36.162956Z",
    "deleted_at": null,
    "sha1_hash": "11ce27412676f3584b8e9abefc629e2b90735056",
    "title": "",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1284403,
    "plain_text": "# In Pursuit of Optical Fibers and Troop Intel: Targeted Attack Distributes PlugX in Russia\n\n**By Thoufique Haq & Aleksey F**\n\nProofpoint researchers recently observed a campaign targeting telecom and military in\nRussia. Beginning in July 2015 (and possibly earlier), the attack continued into August and is\ncurrently ongoing. As a part of this campaign, we also observed attacks on Russian-speaking\nfinancial analysts working at global financial firms and covering telecom corporations in\nRussia, likely a result of collateral damage caused by the attackers targeting tactics.\n\nThe attacks employed PlugX, a Remote Access Trojan (RAT) widely used in targeted attacks.\nProofpoint is tracking this attacker, believed to operate out of China, as TA459 . This same\nattacker is also reported to have targeted various military installations in Central Asia in the\npast (http://www.welivesecurity.com/2014/11/12/korplug-military-targeted-attacksafghanistan-tajikistan/) [1]. While the current campaign from this attacker has been active for\na couple of months, there is evidence of activity by this attacker as far back as 2013,\nemploying other backdoors such as Saker, Netbot and DarkStRat .\n\nThe attacks seen in the current campaign involved spear-phishing emails that employ both\nexploit-laden Microsoft Word document attachments, as well as links leading to RAR archives.\nThe email contents, filenames and decoy are all usually in Russian.\n\n**1. Campaign Details: Attachments**\n\nThe Microsoft Word document attachments observed in this campaign utilized CVE-2012-0158\nto exploit the client and implant the PlugX RAT. For example, the attachment LTE-2600.doc\n(SHA: 6ea86b944c8b5a9b02adc7aac80e0f33217b28103b70153710c1f6da76e36081) was sent\nto financial analysts covering the telecom industry with the email Subject “Проект бизнесплана” (“Project business-plan”). The attachment name is suited to the targets because “LTE”\nis a telecom term referring to Long-Term Evolution networks, typically used to describe 4G\n\n\n-----\n\nusing a builder tool, which can be seen in various artifacts visible in the document properties.\n(Fig.1) However, it should be noted that we do not believe that this builder is exclusively used\nby this attacker and is likely shared among multiple threat actor groups.\n\nFigure 1: Builder artifacts in exploit document\n\n**2. Campaign Details: URLs**\n\nAs a part of this campaign, the attackers also sent spear-phishing emails with URLs to RAR\narchive files hosted on fake domains registered for this campaign. An interesting fact that\nshines some light on the social engineering tradecraft used by the group is that these domain\nnames as well as payload file names were not chosen at random, as is often the case, but\nwere instead chosen to fit the specific lure.\n\nFor example, the RAR archive hosted on www.forum-mil[.]net/news/2015-08-03-3001.rar\ncontained the executable file \"Воздушно-космические силы России заступили на боевое\nдежурство.exe” (“Aerospace Russian forces step up military duty.exe”). Additional searching\nuncovered a news article with this title on a legitimate Russian-language news site:\nhttp://www.forummil.ru/news/vozdushno_kosmicheskie_sily_rossii_zastupili_na_boevoe_dezhurstvo/2015-0803-3001 (http://www.forummil.ru/news/vozdushno_kosmicheskie_sily_rossii_zastupili_na_boevoe_dezhurstvo/2015-0803-3001): the malicious executable borrowed the name from the article title, and the site to\nhost the malware mimics the site that hosts the news article.\n\nIn another example, the news article http://tvzvezda.ru/news/forces/content/20150819145988tq.htm (http://tvzvezda.ru/news/forces/content/201508191459-88tq.htm) was used as the\nbasis for registering the payload hosting site\nwww[.]tvzvezda[.]net/news/forces/content/201508181025.rar. Again, the title of the article\nwas used as the name for the executable inside the RAR archive, and it appears that many of\nthese lures were created in a similar fashion. Specifically, the actor starts with an article\ndescribing a military-related event and then registers a payload site and names the malware\nfile. Table 1 shows the full list of payload domains and sites they mimic. (A list of the payload\nURLs can be found in the Indicators of Compromise section at the end of this post.)\n\n**Infection Site** **Registrant Email** **Legitimate Site Mimicked**\n\narms-expo[.]ru (Russian\narms-expo[.]net gengd@gmail.com\ninformation agency on weapons)\nforu-mil[.]ru (Forum of the\n\n|Infection Site|Registrant Email|Legitimate Site Mimicked|\n|---|---|---|\n|arms-expo[.]net|gengd@gmail.com|arms-expo[.]ru (Russian information agency on weapons)|\n\n\n-----\n\nmilitarynews[.]com (US military\nmilitarynewes[.]comgjklsdf@gmail.com\nnews portal)\nTable 1: Details on domains hosting malicious RAR-archived PlugX executables\n\nAll the infection domains and command and control (C2) domains were registered using the\nsame registrar in Beijing: “Shanghai Meicheng Technology Information Development Co.,\nLtd.”. Other than the emails, the information used for registration was randomized.\n\nThe RAR archives hosted on fake domains contained RAR SFX (self-extracting executable)\npackaged executables which drop and load PlugX. Proofpoint researchers observed the\nfollowing filenames being used for executables in the campaign:\n\n**Embedded Filename** **Translated**\n\nСМИ -расчет рассылки новый.scr Mass Media - Calculation of new distribution.scr\nВ России сформирована\n\nIn Russia, a legendary 6-th Leningrad army VVS and\n\nлегендарная 6-я Ленинградская\n\nPVO is formed.scr\n\nармия ВВС и ПВО.scr\n\nСамая мощная ядерная бомба в\nStrongest nuclear bomb in history.scr\nистории.scr\n\nCommemorative events in connection with the 15th\n\nПамятные мероприятия, в связи с\n\nanniversary of the sinking of nuclear submarine\n\n15-летием гибели АПРК «Курск».exe\n\n“Kursk”.exe\n\nСМИ.scr Mass Media.scr\nВоздушно-космические силы России\nAerospace Russian forces step up military duty.exe\nзаступили на боевое дежурство.exe\n\n11.08.2015.scr N/A\n\nTable 2: Filenames of executables inside RAR archives\n\n**2.1. Decoy Content and Sandbox Evasion**\n\nInterestingly, one of the RAR SFX droppers (SHA:\n71be8bb45dfe360ee6076ed34fde12a382fe9d7922bd11b179ca773be12fa54c) launches a\ndecoy Microsoft Word document before launching the executable. (Fig 2) The contents of this\ndecoy document reference the “Tsar Bomba” nuclear test from the Cold War era and have\n[been directly lifted from a Russian site (http://inosmi.ru/russia/20150818/229690166.html).](http://inosmi.ru/russia/20150818/229690166.html)\n\n|tvzvezda[.]net|hsdf@gmail.com|Federation) tvzvezda.ru (TV network run by Russian Ministry of Defense)|\n|---|---|---|\n|rusarmy[.]net|dolphin@yahoo.com|rusarmy[.]com (Russian army and its weapons forum)|\n|patriotp[.]com|dolphin@yahoo.com|patriotp[.]ru (Russian military patriot recreation park)|\n|militarynewes[.]com|gjklsdf@gmail.com|militarynews[.]com (US military news portal)|\n\n|Embedded Filename|Translated|Col3|\n|---|---|---|\n|СМИ -расчет рассылки новый.scr|Mass Media - Calculation of new distribution.scr||\n|В России сформирована легендарная 6-я Ленинградская армия ВВС и ПВО.scr|In Russia, a legendary 6-th Leningrad army VVS and PVO is formed.scr||\n|Самая мощная ядерная бомба в истории.scr|Strongest nuclear bomb in history.scr||\n|Памятные мероприятия, в связи с 15-летием гибели АПРК «Курск».exe|Commemorative events in connection with the 15th anniversary of the sinking of nuclear submarine “Kursk”.exe||\n|СМИ.scr|Mass Media.scr||\n|Воздушно-космические силы России заступили на боевое дежурство.exe|Aerospace Russian forces step up military duty.exe||\n|11.08.2015.scr|N/A||\n\n\n-----\n\nFigure 2: Contents of decoy document referencing “Tsar Bomba”\n\nIn addition to displaying something potentially relevant to the recipient’s interests, the PlugX\npayload is not executed by the RAR SXF until the victim closes the decoy Word document,\nseen in the past as a sandbox evasion technique (https://www.proofpoint.com/us/threatinsight/post/Run-on-Close-Macros-Try-to-Shut-the-Door-on-Sandboxes) wherein the payload\nis not executed until the decoy document is closed. As a result, the actual payload may never\nexecute in malware sandbox environments unless the sandbox is configured to simulate the\naction of a user closing the decoy document. The SFX script for this document (Fig. 3) appears\nto have been created with a Chinese language pack version of WinRAR. The decoy document\n“1.doc” is executed first and waits until it is closed before launching “0810.exe”. This effect can\nbe easily achieved in WinRAR by setting the “Wait and return exit code” option when creating\nthe SFX archive.\n\n\n-----\n\nFigure 3: RAR SFX script\n\n**3. PlugX Implant**\n\nThe attachment and email campaigns both employed DLL side-loading\n(https://attack.mitre.org/wiki/DLL_side-loading) techniques to load the PlugX payload. All of\nthe payloads used the same clean signed executable “fsguidll.exe”, masquerading as the Fsecure GUI component, to sideload “fslapi.dll” which in turn unpacks code from “fslapi.dll.gui”.\n\nFigure 4: DLL sideloading masquerading as the F-secure GUI component\n\nThe variant of PlugX used is the P2P version that was described by JPCert\n(http://blog.jpcert.or.jp/2015/01/analysis-of-a-r-ff05.html) [2]. A sample configuration\nextracted using the volatility script from Arbor (https://github.com/arborjjones/volatility_plugins) [3] is shown below.\n\n\n-----\n\ng g y\n\nHide Dll: -1\n\nKeylogger: -1\n\nSleep1: 167772160\n\nSleep2: 0\n\nCnc: www.pressmil[.]com:80 (HTTP / UDP)\n\nCnc: www.pressmil[.]com:80 (TCP / HTTP)\n\nCnc: www.pressmil[.]com:80 (UDP)\n\nCnc: www.pressmil[.]com:443 (HTTP / UDP)\n\nCnc: www.pressmil[.]com:443 (TCP / HTTP)\n\nCnc: www.pressmil[.]com:443 (UDP)\n\nCnc: www.pressmil[.]com:53 (HTTP / UDP)\n\nCnc: www.pressmil[.]com:53 (UDP)\n\nCnc: www.pressmil[.]com:53 (TCP / HTTP)\n\nCnc: www.pressmil[.]com:995 (HTTP / UDP)\n\nCnc: www.pressmil[.]com:995 (TCP / HTTP)\n\nCnc: www.pressmil[.]com:995 (UDP)\n\nPersistence: Service + Run Key\n\nInstall Folder: %AUTO%\\ucP\n\nService Name: sWtDmsuBTyMK\n\nService Display Name: sWtDmsuBTyMK\n\nService Desc: Windows sWtDmsuBTyMK Service\n\nReg Hive: HKCU\n\nReg Key: Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\nReg Value: gGIHBgytn\n\nInjection: 1\n\nI j t P %P Fil ( 86)%\\Wi d M di Pl \\\n\n\n-----\n\nInject Process: %windir%\\system32\\winlogon.exe\n\nInject Process: %windir%\\explorer.exe\n\nInject Process: %windir%\\system32\\svchost.exe\n\nUac Bypass Injection: 1\n\nUac Bypass Inject: %windir%\\system32\\msiexec.exe\n\nUac Bypass Inject: %windir%\\system32\\rundll32.exe\n\nUac Bypass Inject: %windir%\\explorer.exe\n\nUac Bypass Inject: %windir%\\system32\\dllhost.exe\n\nPlugx Auth Str: TEST\n\nCnc Auth Str: LLL-0808\n\nMutex: Global\\IUNJCCvywXlrisLlcBhqGm\n\nScreenshots: 0\n\nScreenshots Sec: 10\n\nScreenshots Zoom: 50\n\nScreenshots Bits: 16\n\nScreenshots Qual: 50\n\nScreenshots Keep: 3\n\nScreenshot Folder: %AUTO%\\FS\\screen\n\nEnable Tcp P2P: 1\n\nTcp P2P Port: 1357\n\nEnable Udp P2P: 1\n\nUdp P2P Port: 1357\n\nEnable Icmp P2P: 1\n\nIcmp P2P Port: 1357\n\nEnable Ipproto P2P: 1\n\nIpproto P2P Port: 1357\n\n\n-----\n\nP2P Start Scan1: 0.0.0.0\n\nP2P Start Scan2: 0.0.0.0\n\nP2P Start Scan3: 0.0.0.0\n\nP2P Start Scan4: 0.0.0.0\n\nP2P End Scan1: 0.0.0.0\n\nP2P End Scan2: 0.0.0.0\n\nP2P End Scan3: 0.0.0.0\n\nP2P End Scan4: 0.0.0.0\n\nMac Disable: 00:00:00:00:00:00\n\nMany of the samples used the string “EEEEEE” for authentication of the C2 communication,\nwhich is likely the default value. Other observed values include “LLL-0808”, “0abcde”, and “niii0701”.\n\n**4. Command and Control Infrastructure**\n\nWe observed pressmil[.]com and notebookhk[.]net being used as the C2 servers for this\nspecific campaign. Over the duration of the campaign both of these domains pointed to the\nsame infrastructure on the IP address “43.252.175.119” in Hong Kong. This IP infrastructure\nhas been actively used by this attacker as early as 2014-12-04. The other domains also\nregistered to point to this same IP address include “fedpress[.]net” and “dicemention[.]com”,\nwhich have been observed at use in past campaigns.\n\nIn addition, the C2 server notebookhk[.]net pointed to 123.254.104.50 multiple times between\n2013-08-23 and 2014-09-29. Similarly dicemention[.]com pointed to this IP multiple times\nbetween 2013-12-05 and 2014-09-28. There were multiple domains that used this same IP\ninfrastructure 123.254.104.50 in the past such as\n\nbusiness-isa.mynetav[.]org\n\nbusiness-rsa.onmypc[.]org\n\nblacktan[.]cn\n\ndicemention[.]com\n\nleeghost[.]com\n\nnotebookhk[.]net\n\nWhen investigating 123.254.104.50 we discovered additional, older payloads clustering in to\nthree different malware families. These additional malware families used by this attacker in\nthe past were Saker, Netbot and DarkStRat. Researchers at ESET also reported and\ndocumented the usage of DarkStRat by this attacker [1].\n\n\n-----\n\nnexus. For example, the file “zamysel praticteskih dejstvi voisk.scr” (SHA:\n556e7e944939929ca4d9ca6c54d9059edf97642ece1d84363f2d46e2e8ca72ae), translates to\n“plan of army practice maneuvers.scr”. It was also similarly packaged in a RAR archive, and on\nexecution it drops and loads a DLL file “icwnet.dll” (SHA:\n1a789568a53c18dab21c9c0386c746878cf8458e3369f0dc36a285fe296f3be3) which contains\nthe exports “ServiceMain” and “JustTempFun”. The malware makes the following beacon to a\nremote server:\n\n\nGET /30106C07000038FE0F00<removed>000000000000000000000000000000000000\n0000000000000000000000000000000000000000000000000000000000000000000000\n0100000<removed>000000000000000000000000000000000000000000000000000000\n0000000000000000 HTTP/1.1\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0; .NET CL\nR 1.1.4322)\nHost: www.leeghost.com:1037\nCache-Control: no-cache\n\n\nThis backdoor has been analyzed extensively in the past [4] and provides the attacker a range\nof functionality, including file manager (enumerate, create, copy, move, delete); the ability to\ndownload and run secondary payloads; and deleting all traces of itself and shutting down.\n\n**4.2. Related Malware: Netbot (aka TornRat) Implant**\n\nWhen an example payload (SHA:\n277fe4dab731149f3d40630f2f8b25092b007c701f04b5304d3ba9570280d015) from this\ncluster is detonated, it drops and loads a DLL file “taskhost.dll” (SHA:\ndd9d31c3acb4299619c2251698024da1ac9ec42280aa6c16cd2369907f3be4e3). The malware\nsends an initial beacon to its C2 server (Fig. 5), which matches the TornRAT network signature\npreviously published by CrowdStrike [5].\n\nFigure 5: Netbot network beacon\n\nThe scheme used to encrypt the beacon is a byte XOR with 0x3f followed by an addition with\n0x3f. The encrypted beacon contains hostname, system memory, OS information and\ninfection timestamp. (Fig. 6)\n\n\n-----\n\nFigure 6: Netbot network beacon decoded\n\nSamples from this cluster were found creating the following mutexes.\n\nWinlogin Running!\n\nNetbot2012 Is Running!\n\nNetBotServer Is Running!\n\nIt is worth noting that there is similarity in mutex naming scheme to another malware family\ncalled NetTraveler (aka Travnet). Netbot is a backdoor and has commands to support features\nsimilar noted above for Saker, such as file manager (enumerate, create, copy, move, delete),\nability to download and execute secondary payloads; and deleting all traces of itself.\n\n**4.3. Related Malware: DarkStRat implant**\n\nWhen an example payload (SHA:\nb38aa09a2334e11a73ef9a926694f2054789934daa38afeb8d00bce6949b6c4c) from this\ncluster is detonated it drops and runs an executable file “netlink.exe” (SHA:\nb38aa09a2334e11a73ef9a926694f2054789934daa38afeb8d00bce6949b6c4c). The RAT sends\nthe string \"ok\\n\" following initial beacon to a remote server. A configuration file\n“netsetting.ini” is also written to disk with the following contents:\n\n\n\n[Option]\n\nHostPort=443\n\nHostName=www.dicemention.com\n\n\nDarkStRat is a full-fledged RAT written in Delphi with an array of features such as file\nmanager, process manager, registry manager, service manager, downloading and running\nsecondary payloads and deleting all traces of itself.\n\nAs also noted by the ESET researchers [1], the strings in this RAT strangely show Spanish\nlanguage origins, albeit with some Chinese connections. The source code for this RAT is\n[hosted on google code (https://code.google.com/p/darkstrat/) with the name “DarkStRat 2008](https://code.google.com/p/darkstrat/)\n1.0开源.rar”. The string “开源.” in the name translates to “Open Source”. Various parts of the\nsource code also have strings in Chinese and reference “darkst[.]com” and “fsg2[.]cn”. The\nowner of this Google-hosted code project is listed as darkteam...@gmail.com. As a result, it\n\n\n-----\n\na definitive attribution based solely on characteristics such as language and C2 server\nlocations.\n\n**5. Conclusion**\n\nA detailed examination of this operation reveals an adversary who demonstrates a keen\ninterest in Russian telecom and military sectors, indicative of an actor with geopolitical\nmotives. The attacker adapts and evolves their Tactics, Techniques and Procedures (TTPs)\nover time as the situation demands. While the attacker appears to do very little to hide their\ntracks, they remain highly determined and persistent and have carried out attacks through a\nsustained operation spanning at least two years, and possibly longer. The attacker also\ninvests time to research the locale and current events relevant to their targets and then\nleverages this in their targeting tactics. Attacks such as these have become a constant\noccurrence given the covert nature of digital attacks and easy access to targeting information\nonline.\n\nAs this threat shows, attackers continue to employ increasingly sophisticated techniques\nagainst new targets in order to uncover and steal sensitive information. Organizations need to\nrecognize that they cannot rely on traditional antivirus and anti-spam solutions to detect and\nstop these advanced threats. In order to combat targeted attacks, organizations should adopt\nnext-generation solutions that make it possible to identify and respond to sophisticated\ntargeted attacks by correlating advanced detection with threat intelligence about actor TTPs\nand global views of threat traffic, including IOCs that enable response teams to quickly detect\nand mitigate compromises. Moreover, a multi-layer approach is essential, with email security\nrepresenting the logical starting point for an advanced threat defense: like this targeted\nattack, email remains the vector-of-choice for penetrating target organizations and delivering\nthese sophisticated payloads.\n\n**Indicators of Compromise (IOCs)**\n\nPlugX Infection URLs:\n\nhttp://www.arms-expo[.]net/news/content/387206.rar\n\nhttp://arms-expo[.]net/news/content/day_2015-08-20.rar\n\nhttp://arms-expo[.]net/news/samaia_mochnaia_iagernaia_bomba_v_istorii.rar\n\nhttp://www.arms-expo[.]net/news/content/20150818.rar\n\nhttp://www.tvzvezda[.]net/news/forces/content/201508181025.rar\n\nhttp://www.arms-expo[.]net/news/content/20150818.zip\n\nhttp://www.arms-expo[.]net/news/content/Day_2015-08-20.rar\n\nhttp://www.arms-expo[.]net/news/content/VTC.rar\n\nhttp://www.rusarmy[.]net/forum/vvs/modernizirovanoj.rar\n\nhttp://www.rusarmy[.]net/forum/threads/sostojanie-krejserov-proekta-1144.9.rar\n\nhttp://www.forum-mil[.]net/news/2015-08-03-3001.rar\n\nhttp://www.militarynewes[.]com/news/11.08.2015.rar\n\n\n-----\n\ng\n\n1aa6c5d0c9ad914fb5ed24741ac947d31cac6921ece7b3b807736febda7e2c4b\n\n1b32825f178afe76e290c458ddbf8a3596002c6f9a7763687311f7d211a54aab\n\n3e824972397b322ea9f48fd1a9a02bd6c3eb68cc7de3a4f29e46a5c67b625ec1\n\n49e1f953dc17073bf919972868576b93cc9f3b5b9600f98a0bd9e39e5d229d9e\n\n4cadbdb5a09781555cc5d637d3fecf89b9a66fac245d6a3a14989f39a9a48c6e\n\n67cccfa23a7fd1d9ca8160cd977d536c4a40bf9525a93aa4122a89527a96fa8f\n\n6ea86b944c8b5a9b02adc7aac80e0f33217b28103b70153710c1f6da76e36081\n\n7efcf2211cd68ab459582594b5d75c64830acf25bcaab065bbd60377fb9eb22a\n\n8702506e8e75834a8f011cfc268d02043af5522aeda20a8458880c8fbed7ecac\n\n8a5df5f31a3b4f893a0565967d64e57f41d91e3592bbd8d52f98f81b3fb8452b\n\nSaker hashes (SHA256):\n\n556e7e944939929ca4d9ca6c54d9059edf97642ece1d84363f2d46e2e8ca72ae\n\n0d2600d978f5c1042e93b701654db080aac144dfa2877844334b1d4cd78f4a1d\n\n2a6dee57cb302a1350ade4a33f40a77c1952cf2e6b29d1be8400c13927e34670\n\n383c5d22c1de3aae7684eb5a7d87d6b553f09f166ca402894c5deecabaa7d866\n\n53d29782b8c325c2ff62493cdb261a8e54e45ed04880527e75e8e211b4d8d861\n\n5d97ec30c481e00d4285246b528745f331be905f453e062bd9c2d506e9386f0e\n\n664f80b427bf0145e62f6f90cb4833c30cfb8dc4b2d68746aa01420da82bd8af\n\n6dc560a3b20a6e95552254bdb04fba03f74223a83a58436a3decfab74abc5fb5\n\na2f4aa2d25bff21e73b15065e2fc38d297ee14253044a66d00690b1bb23fc373\n\nc7d7211d1fea69ea6a9697a8f8d21ac40f6d7dc6863708b9a98930271a156c86\n\nd2a5cf434e8a0c63c23e6a3e5cf8a60f259099a706d2d243ffa5c7dbd46fd9d4\n\nd6ff406da6e9a20074c3e1228ab04d35a3839b1719d3cafbb21ad3e3b6d03ef4\n\ndf4571b7d3be63de8338e6905b2689309ed5cce88d57a8db0c7b9aebf713d81c\n\ned7771339794c7908865f7816513b593369a93c98b39f58ebaaa98f3f0067e9d\n\nNetbot hashes (SHA256):\n\n4524ede160d5476211e99329768b38abd88aacb6fa9334f2c2bbcaab9b0438f5\n\n317e9deef23ff0e919083ac6c94b5ccd3bb0227f674078d66cdd4a2e5d1ebba9\n\n68a98b8e174cb5af20e0ac97978bad6d245a1cb0970b82a4a269a92e7726d74b\n\n\n-----\n\nf95c6749f4d4fae18f9d384f495dc1c79e7484b309d0d35ea68966763ed325bd\n\nDarkStRat hashes (SHA256):\n\nb38aa09a2334e11a73ef9a926694f2054789934daa38afeb8d00bce6949b6c4c\n\n0d219aa54b1d417da61bd4aed5eeb53d6cba91b3287d53186b21fed450248215\n\nC2 domains observed:\n\npressmil[.]com\n\nnotebookhk[.]net\n\ndicemention[.]com\n\nleeghost[.]com\n\nReferences:\n\n[1] http://www.welivesecurity.com/2014/11/12/korplug-military-targeted-attacks-afghanistan[tajikistan/ (http://www.welivesecurity.com/2014/11/12/korplug-military-targeted-attacks-](http://www.welivesecurity.com/2014/11/12/korplug-military-targeted-attacks-afghanistan-tajikistan/)\nafghanistan-tajikistan/)\n\n[2] http://blog.jpcert.or.jp/2015/01/analysis-of-a-r-ff05.html\n(http://blog.jpcert.or.jp/2015/01/analysis-of-a-r-ff05.html)\n\n[3] https://github.com/arbor-jjones/volatility_plugins (https://github.com/arborjjones/volatility_plugins)\n\n[4] http://kasperskycontenthub.com/wp-content/uploads/sites/43/vlpdfs/kaspersky-the-net[traveler-part1-final.pdf (http://kasperskycontenthub.com/wp-](http://kasperskycontenthub.com/wp-content/uploads/sites/43/vlpdfs/kaspersky-the-net-traveler-part1-final.pdf)\ncontent/uploads/sites/43/vlpdfs/kaspersky-the-net-traveler-part1-final.pdf)\n\n[5]http://blog.crowdstrike.com/whois-anchor-panda/ (http://blog.crowdstrike.com/whoisanchor-panda/)\nTuesday, September 15, 2015 - 16:30\n\n**[Targeted attacks (/us/tags/targeted-attacks)](https://www.proofpoint.com/us/tags/targeted-attacks)** **[PlugX (/us/tags/plugx)](https://www.proofpoint.com/us/tags/plugx)**\n\n\n**[Spear phishing (/us/tags/spear-phishing)](https://www.proofpoint.com/us/tags/spear-phishing)**\n\n\nThoufique Haq & Aleksey F\n\n## Related Links\n\n[Press Releases > (https://www.proofpoint.com/us/news/press-releases)](https://www.proofpoint.com/us/news/press-releases)\n[Proofpoint in the News > (https://www proofpoint com/us/news/in the news)](https://www.proofpoint.com/us/news/in-the-news)\n\n\n-----\n\n[Threat Insights blog > (https://www.proofpoint.com/us/threat-insight)](https://www.proofpoint.com/us/threat-insight)\n[Events > (https://www.proofpoint.com/us/events)](https://www.proofpoint.com/us/events)\n[Media Contacts > (https://www.proofpoint.com/us/contact-us)](https://www.proofpoint.com/us/contact-us)\n\n### ADD NEW COMMENT\n\n**Your name**\n\n**Subject**\n\n**Comment ***\n\n[原始碼](javascript:void('%E5%8E%9F%E5%A7%8B%E7%A2%BC'))\n\n格式\n\n[Switch to plain text editor](javascript:void(0);)\n\n\n-----\n\n**BACK TO TOP**\n\n### SOLUTIONS\n\nFOR YOUR NEED\n\n[Threat Protection (/us/solutions/needs/threat-protection)](https://www.proofpoint.com/us/solutions/needs/threat-protection)\n\nDetect, classify, and respond to threats\n\nCompliance (/us/solutions/needs/compliance)\n\nControl and encrypt your data, share securely, and prevent data loss\n\nDiscovery (/us/solutions/needs/discovery)\n\nCloud archiving, governance, and discovery\n\nFOR YOUR ROLE\n\nSecurity (/us/solutions/role/security)\n\nMessaging Ops (/us/solutions/role/messaging-ops)\n\nLegal (/us/solutions/role/legal)\n\nCompliance (/us/solutions/role/compliance)\n\nFOR YOUR INDUSTRY\n\nEducation (/us/solutions/industry/education)\n\n[Financial Services (/us/solutions/industry/financial-service)](https://www.proofpoint.com/us/solutions/industry/financial-service)\n\nGovernment (/us/solutions/industry/government)\n\nHealthcare (/us/solutions/industry/healthcare)\n\nManufacturing (/us/solutions/industry/manufacturing)\n\nPharmaceutical (/us/solutions/industry/pharmaceutical)\n\nRetail (/us/solutions/industry/retail)\n\nFOR YOUR APPLICATION\n\nOffice 365 (/us/solutions/application/office-365)\n\nSocial Apps (/us/solutions/application/social-media)\n\n### PRODUCTS\n\n\n-----\n\n[Proofpoint Essentials (/us/solutions/smb/proofpoint-essentials)](https://www.proofpoint.com/us/solutions/smb/proofpoint-essentials)\n\n[Proofpoint Essentials Support (http://support.proofpointessentials.com/)](http://support.proofpointessentials.com/)\n\nENTERPRISE PRODUCTS\n\n[Enterprise Protection (/us/solutions/products/enterprise-protection)](https://www.proofpoint.com/us/solutions/products/enterprise-protection)\n\n[Targeted Attack Protection (http://proofpoint.com/solutions/products/targeted-attack-protection)](http://proofpoint.com/solutions/products/targeted-attack-protection)\n\nThreat Response (/us/solutions/products/threat-response)\n\n[Privacy, DLP and Encryption (/us/solutions/products/enterprise-privacy-suite)](https://www.proofpoint.com/us/solutions/products/enterprise-privacy-suite)\n\n[Malvertising Protection (/us/solutions/products/malvertising-protection)](https://www.proofpoint.com/us/solutions/products/malvertising-protection)\n\nArchive (/us/solutions/products/enterprise-archive)\n\n[Governance (/us/solutions/products/enterprise-governance)](https://www.proofpoint.com/us/solutions/products/enterprise-governance)\n\nContent Control (/us/solutions/products/content-control)\n\n[Sentrion Sendmail (/us/solutions/products/sentrion-sendmail)](https://www.proofpoint.com/us/solutions/products/sentrion-sendmail)\n\nSocial Media Security (http://nexgate.com)\n\n### BLOGS, NEWS, EVENTS\n\nThreat Insight (/us/threat-insight)\n\nNews (/us/news)\n\nEvents (/us/node/1708)\n\nCorporate Blog (/us/corporate-blog)\n\n### INFORMATION\n\nPartners (/us/partners)\n\nService & Support (/us/services/support-services)\n\nInvestors (http://investors.proofpoint.com/)\n\nCareers (/us/careers/life-proofpoint)\n\n### WHY PROOFPOINT\n\n[Cloud and Big Data Platform (/us/why-proofpoint/cloud-big-data)](https://www.proofpoint.com/us/why-proofpoint/cloud-big-data)\n\n[Satisfied Customers (http://proofpoint.com/us/customer-stories)](http://proofpoint.com/us/customer-stories)\n\nAbout Us (/us/why-proofpoint/about-us)\n\nCall (/us/contact-us)\n\nEmail (/us/contact-us)\n\nChat\n\nR D (/ / f i l d )\n\n\n-----\n\n## REGIONS\n\n[United States (/us)](https://www.proofpoint.com/us)\n\n[United Kingdom (/uk)](https://www.proofpoint.com/uk)\n\n[France (/fr)](https://www.proofpoint.com/fr)\n\n[Germany (/de)](https://www.proofpoint.com/de)\n\n[Spain (/es)](https://www.proofpoint.com/es)\n\n[Japan (/jp)](https://www.proofpoint.com/jp)\n\n[Taiwan (/tw)](https://www.proofpoint.com/tw)\n\n\n[PARTNER LOG-IN (/us/partner-log)](https://www.proofpoint.com/us/partner-log)\n\n\n[SENDMAIL SUPPORT LOG-IN (https://www.sendmail.com/cfusion/CFIDE/smi/support/)](https://www.sendmail.com/cfusion/CFIDE/smi/support/)\n\n\n[SUPPORT LOG-IN (https://support.proofpoint.com/)](https://support.proofpoint.com/)\n\n\n© 2015 PROOFPOINT, INC.\n\n[PRIVACY POLICY (/US/PRIVACY-POLICY)](https://www.proofpoint.com/us/privacy-policy)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.09.15.PlugX_in_Russia/In%20Pursuit%20of%20Optical%20Fibers%20and%20Troop%20Intel_%20Targeted%20Attack%20Distributes%20PlugX%20in%20Russia%20_%20Proofpoint.pdf"
    ],
    "report_names": [
        "In Pursuit of Optical Fibers and Troop Intel_ Targeted Attack Distributes PlugX in Russia _ Proofpoint"
    ],
    "threat_actors": [
        {
            "id": "0bf35542-9ebc-44a9-b319-b6df0bee4bac",
            "created_at": "2022-10-25T15:50:23.437853Z",
            "updated_at": "2025-03-27T02:00:55.468981Z",
            "deleted_at": null,
            "main_name": "TA459",
            "aliases": [
                "TA459"
            ],
            "source_name": "MITRE:TA459",
            "tools": [
                "gh0st RAT",
                "NetTraveler",
                "PlugX",
                "ZeroT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7041fcf5-b34d-47c3-be4c-3c40f243af89",
            "created_at": "2023-01-06T13:46:38.611261Z",
            "updated_at": "2025-03-27T02:00:02.872972Z",
            "deleted_at": null,
            "main_name": "TA459",
            "aliases": [
                "G0062"
            ],
            "source_name": "MISPGALAXY:TA459",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "808d8d52-ca06-4a5f-a2c1-e7b1ce986680",
            "created_at": "2022-10-25T16:07:23.899157Z",
            "updated_at": "2025-03-27T02:02:10.019417Z",
            "deleted_at": null,
            "main_name": "NetTraveler",
            "aliases": [
                "APT 21",
                "Hammer Panda",
                "NetTraveler",
                "TEMP.Zhenbao"
            ],
            "source_name": "ETDA:NetTraveler",
            "tools": [
                "Agent.dhwf",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "NetTraveler",
                "Netfile",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "TravNet",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "254f2fab-5834-4d90-9205-d80e63d6d867",
            "created_at": "2023-01-06T13:46:38.31544Z",
            "updated_at": "2025-03-27T02:00:02.802896Z",
            "deleted_at": null,
            "main_name": "APT21",
            "aliases": [
                "HAMMER PANDA",
                "TEMP.Zhenbao",
                "NetTraveler"
            ],
            "source_name": "MISPGALAXY:APT21",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "802552ac-1f16-4b85-8d78-76d683684124",
            "created_at": "2022-10-25T16:07:24.28032Z",
            "updated_at": "2025-03-27T02:02:10.158732Z",
            "deleted_at": null,
            "main_name": "TA459",
            "aliases": [],
            "source_name": "ETDA:TA459",
            "tools": [
                "Agent.dhwf",
                "AngryRebel",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Kaba",
                "Korplug",
                "Moudour",
                "Mydoor",
                "NetTraveler",
                "Netfile",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "TravNet",
                "Xamtrav",
                "ZeroT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c6604303-a1c8-4e59-ba12-5da5c0bc6877",
            "created_at": "2023-01-06T13:46:38.312359Z",
            "updated_at": "2025-03-27T02:00:02.8021Z",
            "deleted_at": null,
            "main_name": "APT14",
            "aliases": [
                "ANCHOR PANDA",
                "QAZTeam"
            ],
            "source_name": "MISPGALAXY:APT14",
            "tools": [
                "Gh0st Rat",
                "Gh0stRat, GhostRat",
                "Poison Ivy",
                "Backdoor.Win32.PoisonIvy",
                "Gen:Trojan.Heur.PT",
                "Torn RAT",
                "Anchor Panda"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "25a38dea-d23b-479b-9548-024e955b8964",
            "created_at": "2022-10-25T16:07:23.305911Z",
            "updated_at": "2025-03-27T02:02:09.729131Z",
            "deleted_at": null,
            "main_name": "Anchor Panda",
            "aliases": [
                "APT 14",
                "Anchor Panda",
                "QAZTeam"
            ],
            "source_name": "ETDA:Anchor Panda",
            "tools": [
                "AngryRebel",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Torn RAT",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041736,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/11ce27412676f3584b8e9abefc629e2b90735056.pdf",
        "text": "https://archive.orkl.eu/11ce27412676f3584b8e9abefc629e2b90735056.txt",
        "img": "https://archive.orkl.eu/11ce27412676f3584b8e9abefc629e2b90735056.jpg"
    }
}