{
    "id": "d9a6844b-bb8d-4992-b378-cbff690f8f5a",
    "created_at": "2023-01-12T15:05:14.735664Z",
    "updated_at": "2025-03-27T02:05:56.662439Z",
    "deleted_at": null,
    "sha1_hash": "6e4467e8364c0324b4621cfd0d14d0af2a5d2b9e",
    "title": "2022-03-15 - Alert (AA22-074A) Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability",
    "authors": "",
    "file_creation_date": "2022-05-29T01:07:27Z",
    "file_modification_date": "2022-05-29T01:07:27Z",
    "file_size": 150474,
    "plain_text": "# Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability\n\n**cisa.gov/uscert/ncas/alerts/aa22-074a**\n\n## Summary\n\n**_Multifactor Authentication (MFA): A Cybersecurity Essential_**\n\n- MFA is one of the most important cybersecurity practices to reduce the risk of intrusions—\naccording to industry research, users who enable MFA are up to 99 percent less likely to\nhave an account compromised.\n\n- Every organization should enforce MFA for all employees and customers, and every user\nshould sign up for MFA when available.\n\n- Organizations that implement MFA should review default configurations and modify as\nnecessary, to reduce the likelihood that a sophisticated adversary can circumvent this\ncontrol.\n\nThe Federal Bureau of Investigation (FBI) and Cybersecurity and Infrastructure Security\nAgency (CISA) are releasing this joint Cybersecurity Advisory (CSA) to warn organizations\nthat Russian state-sponsored cyber actors have gained network access through exploitation\nof default MFA protocols and a known vulnerability. As early as May 2021, Russian statesponsored cyber actors took advantage of a misconfigured account set to default MFA\nprotocols at a non-governmental organization (NGO), allowing them to enroll a new device\nfor MFA and access the victim network. The actors then exploited a critical Windows Print\nSpooler vulnerability, “PrintNightmare” (CVE-2021-34527) to run arbitrary code with system\nprivileges. Russian state-sponsored cyber actors successfully exploited the vulnerability\nwhile targeting an NGO using Cisco’s Duo MFA, enabling access to cloud and email\naccounts for document exfiltration.\n\nThis advisory provides observed tactics, techniques, and procedures, indicators of\ncompromise (IOCs), and recommendations to protect against Russian state-sponsored\nmalicious cyber activity. FBI and CISA urge all organizations to apply the recommendations\nin the Mitigations section of this advisory, including the following:\n\nEnforce MFA and review configuration policies to protect against “fail open” and reenrollment scenarios.\nEnsure inactive accounts are disabled uniformly across the Active Directory and MFA\nsystems.\n[Patch all systems. Prioritize patching for known exploited vulnerabilities.](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\n\n\n-----\n\nFor more general information on Russian state-sponsored malicious cyber activity, see\nCISA's [Russia Cyber Threat Overview and Advisories webpage. For more information on the](https://www.cisa.gov/uscert/russia)\nthreat of Russian state-sponsored malicious cyber actors to U.S. critical infrastructure as well\nas additional mitigation recommendations, see joint CSA Understanding and Mitigating\nRussian State-Sponsored Cyber Threats to U.S. Critical Infrastructure and CISA's Shields\nUp Technical Guidance webpage.\n\n[Click here for a PDF version of this report.](https://www.cisa.gov/sites/default/files/publications/AA22-074A_Russian_State-Sponsored_Cyber_Actors_Gain_Network_Access_by_Exploiting_Default_MFA_and_PrintNightmare.pdf)\n\n[For a downloadable copy of IOCs, see AA22-074A.stix.](https://www.cisa.gov/sites/default/files/publications/AA22-074A.stix.xml)\n\n## Technical Details\n\n**Threat Actor Activity**\n\n**_Note: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 10. See_**\n_Appendix A for a table of the threat actors’ activity mapped to MITRE ATT&CK tactics and_\n_techniques._\n\nAs early as May 2021, the FBI observed Russian state-sponsored cyber actors gain access\nto an NGO, exploit a flaw in default MFA protocols, and move laterally to the NGO’s cloud\nenvironment.\n\n[Russian state-sponsored cyber actors gained initial access [TA0001] to the victim](https://attack.mitre.org/versions/v10/tactics/TA0001/)\n[organization via compromised credentials [T1078] and enrolling a new device in the](https://attack.mitre.org/versions/v10/techniques/T1078/)\n[organization’s Duo MFA. The actors gained the credentials [TA0006] via brute-force](https://attack.mitre.org/versions/v10/tactics/TA0006/)\n[password guessing attack [T1110.001], allowing them access to a victim account with a](https://attack.mitre.org/versions/v10/techniques/T1110/001/)\nsimple, predictable password. The victim account had been un-enrolled from Duo due to a\nlong period of inactivity but was not disabled in the Active Directory. As Duo’s default\nconfiguration settings allow for the re-enrollment of a new device for dormant accounts, the\nactors were able to enroll a new device for this account, complete the authentication\nrequirements, and obtain access to the victim network.\n\nUsing the compromised account, Russian state-sponsored cyber actors performed privilege\n[escalation [TA0004] via exploitation of the “PrintNightmare” vulnerability (CVE-2021-34527)](https://attack.mitre.org/versions/v10/tactics/TA0004/)\n\n[[T1068] to obtain administrator privileges. The actors also modified a domain controller file,](https://attack.mitre.org/versions/v10/techniques/T1068/)\n```\nc:\\windows\\system32\\drivers\\etc\\hosts, redirecting Duo MFA calls to localhost\n\n```\n[instead of the Duo server [T1556]. This change prevented the MFA service from contacting](https://attack.mitre.org/versions/v10/techniques/T1556/)\nits server to validate MFA login—this effectively disabled MFA for active domain accounts\nbecause the default policy of Duo for Windows is to “Fail open” if the MFA server is\nunreachable. Note: “fail open” can happen to any MFA implementation and is not exclusive\n_to Duo._\n\n\n-----\n\nAfter effectively disabling MFA, Russian state-sponsored cyber actors were able to\nsuccessfully authenticate to the victim’s virtual private network (VPN) as non-administrator\nusers and make Remote Desktop Protocol (RDP) connections to Windows domain\n[controllers [T1133]. The actors ran commands to obtain credentials for additional domain](https://attack.mitre.org/versions/v10/techniques/T1133/)\naccounts; then using the method described in the previous paragraph, changed the MFA\nconfiguration file and bypassed MFA for these newly compromised accounts. The actors\nleveraged mostly internal Windows utilities already present within the victim network to\nperform this activity.\n\nUsing these compromised accounts without MFA enforced, Russian state-sponsored cyber\n[actors were able to move laterally [TA0008] to the victim’s cloud storage and email accounts](https://attack.mitre.org/versions/v10/tactics/TA0008/)\nand access desired content.\n\n**Indicators of Compromise**\n\nRussian state-sponsored cyber actors executed the following processes:\n```\n   ping.exe - A core Windows Operating System process used to perform the\n\n```\nTransmission Control Protocol (TCP)/IP Ping command; used to test network\n[connectivity to a remote host [T1018] and is frequently used by actors for network](https://attack.mitre.org/versions/v10/techniques/T1018/)\n[discovery [TA0007].](https://attack.mitre.org/versions/v10/tactics/TA0007/)\n```\n   regedit.exe - A standard Windows executable file that opens the built-in registry\n\n```\n[editor [T1112].](https://attack.mitre.org/versions/v10/techniques/T1112/)\n```\n   rar.exe - A data compression, encryption, and archiving tool [T1560.001]. Malicious\n\n```\ncyber actors have traditionally sought to compromise MFA security protocols as doing\nso would provide access to accounts or information of interest.\n```\n   ntdsutil.exe - A command-line tool that provides management facilities for Active\n\n```\nDirectory Domain Services. It is possible this tool was used to enumerate Active\n[Directory user accounts [T1003.003].](https://attack.mitre.org/versions/v10/techniques/T1003/003/)\n\nActors modified the c:\\windows\\system32\\drivers\\etc\\hosts file to prevent communication\nwith the Duo MFA server:\n\n```\n127.0.0.1 api-<redacted>.duosecurity.com\n\n```\n\nThe following access device IP addresses used by the actors have been identified to date:\n```\n   45.32.137[.]94\n   191.96.121[.]162\n   173.239.198[.]46\n   157.230.81[.]39\n\n## Mitigations\n\n```\n\n-----\n\nThe FBI and CISA recommend organizations remain cognizant of the threat of statesponsored cyber actors exploiting default MFA protocols and exfiltrating sensitive\ninformation. Organizations should:\n\nEnforce MFA for all users, without exception. Before implementing, organizations\nshould review configuration policies to protect against “fail open” and re-enrollment\nscenarios.\nImplement time-out and lock-out features in response to repeated failed login attempts.\nEnsure inactive accounts are disabled uniformly across the Active Directory, MFA\nsystems etc.\nUpdate software, including operating systems, applications, and firmware on IT\n[network assets in a timely manner. Prioritize patching known exploited vulnerabilities,](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\nespecially critical and high vulnerabilities that allow for remote code execution or\ndenial-of-service on internet-facing equipment.\nRequire all accounts with password logins (e.g., service account, admin accounts, and\ndomain admin accounts) to have strong, unique passwords. Passwords should not be\nreused across multiple accounts or stored on the system where an adversary may\nhave access.\nContinuously monitor network logs for suspicious activity and unauthorized or unusual\nlogin attempts.\nImplement security alerting policies for all changes to security-enabled\naccounts/groups, and alert on suspicious process creation events ( ntdsutil, `rar,`\n```\n   regedit, etc.).\n\n```\n**_Note: If a domain controller compromise is suspected, a domain-wide password reset—_**\n_including service accounts, Microsoft 365 (M365) synchronization accounts, and_ `krbtgt —`\n_will be necessary to remove the actors’ access. (For more information, see_\n_[https://docs.microsoft.com/en-us/answers/questions/87978/reset-krbtgt-password.html).](https://docs.microsoft.com/en-us/answers/questions/87978/reset-krbtgt-password.html)_\n_Consider soliciting support from a third-party IT organization to provide subject matter_\n_expertise, ensure the actor is eradicated from the network, and avoid residual issues that_\n_could enable follow-on exploitation._\n\nFBI and CISA also recommend organizations implement the recommendations listed below\nto further reduce the risk of malicious cyber activity.\n\n**Security Best Practices**\n\nDeploy Local Administrator Password Solution (LAPS), enforce Server Message Block\n(SMB) Signing, restrict Administrative privileges (local admin users, groups, etc.), and\nreview sensitive materials on domain controller’s `SYSVOL share.`\nEnable increased logging policies, enforce PowerShell logging, and ensure\nantivirus/endpoint detection and response (EDR) are deployed to all endpoints and\nenabled.\n\n\n-----\n\nRoutinely verify no unauthorized system modifications, such as additional accounts and\nSecure Shell (SSH) keys, have occurred to help detect a compromise. To detect these\nmodifications, administrators can use file integrity monitoring software that alerts an\nadministrator or blocks unauthorized changes on the system.\n\n**Network Best Practices**\n\nMonitor remote access/ RDP logs and disable unused remote access/RDP ports.\nDeny atypical inbound activity from known anonymization services, to include\ncommercial VPN services and The Onion Router (TOR).\nImplement listing policies for applications and remote access that only allow systems to\nexecute known and permitted programs under an established security policy.\nRegularly audit administrative user accounts and configure access control under the\nconcept of least privilege.\nRegularly audit logs to ensure new accounts are legitimate users.\nScan networks for open and listening ports and mediate those that are unnecessary.\nMaintain historical network activity logs for at least 180 days, in case of a suspected\ncompromise.\nIdentify and create offline backups for critical assets.\nImplement network segmentation.\nAutomatically update anti-virus and anti-malware solutions and conduct regular virus\nand malware scans.\n\n**Remote Work Environment Best Practices**\n\nWith an increase in remote work environments and the use of VPN services, the FBI and\nCISA encourage organizations to implement the following best practices to improve network\nsecurity:\n\nRegularly update VPNs, network infrastructure devices, and devices used for remote\nwork environments with the latest software patches and security configurations.\nWhen possible, implement multi-factor authentication on all VPN connections. Physical\nsecurity tokens are the most secure form of MFA, followed by authenticator\napplications. When MFA is unavailable, require employees engaging in remote work to\nuse strong passwords.\nMonitor network traffic for unapproved and unexpected protocols.\nReduce potential attack surfaces by discontinuing unused VPN servers that may be\nused as a point of entry for attackers.\n\n**User Awareness Best Practices**\n\nCyber actors frequently use unsophisticated methods to gain initial access, which can often\nbe mitigated by stronger employee awareness of indicators of malicious activity. The FBI and\nCISA recommend the following best practices to improve employee operations security when\nconducting business:\n\n\n-----\n\nProvide end-user awareness and training. To help prevent targeted social engineering\nand spearphishing scams, ensure that employees and stakeholders are aware of\npotential cyber threats and delivery methods. Also, provide users with training on\ninformation security principles and techniques.\nInform employees of the risks associated with posting detailed career information to\nsocial or professional networking sites.\nEnsure that employees are aware of what to do and whom to contact when they see\nsuspicious activity or suspect a cyberattack, to help quickly and efficiently identify\nthreats and employ mitigation strategies.\n\n## Information Requested\n\nAll organizations should report incidents and anomalous activity to the FBI via your local FBI\n[field office or the FBI’s 24/7 CyWatch at (855) 292-3937 or CyWatch@fbi.gov and/or CISA’s](http://10.10.0.46/mailto:CyWatch@fbi.gov)\n[24/7 Operations Center at report@cisa.gov or (888) 282-0870.](http://10.10.0.46/mailto:report@cisa.gov)\n\n## APPENDIX A: Threat Actor Tactics and Techniques\n\nSee table 1 for the threat actors’ tactics and techniques identified in this CSA. See the\n[ATT&CK for Enterprise for all referenced threat actor tactics and techniques.](https://attack.mitre.org/versions/v10/techniques/enterprise/)\n\n_Table 1: Threat Actor MITRE ATT&CK Tactics and Techniques_\n\n**Tactic** **Technique**\n\n[Initial Access [TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/) [Valid Accounts [T1078]](https://attack.mitre.org/versions/v10/techniques/T1078/)\n\n[Persistence [TA0003]](https://attack.mitre.org/versions/v10/tactics/TA0003/) [External Remote Services [T1133]](https://attack.mitre.org/versions/v10/techniques/T1133/)\n\n[Modify Authentication Process [T1556]](https://attack.mitre.org/versions/v10/techniques/T1556/)\n\n[Privilege Escalation [TA0004]](https://attack.mitre.org/versions/v10/tactics/TA0004/) Exploitation for Privilege Escalation\n\n[[T1068]](https://attack.mitre.org/versions/v10/techniques/T1068/)\n\n[Defense Evasion [TA0005]](https://attack.mitre.org/versions/v10/tactics/TA0005/) [Modify Registry [T1112]](https://attack.mitre.org/versions/v10/techniques/T1112/)\n\n[Credential Access [TA0006]](https://attack.mitre.org/versions/v10/tactics/TA0006/) [Brute Force: Password Guessing [T1110.001]](https://attack.mitre.org/versions/v10/techniques/T1110/001/)\n\nOS Credential Dumping: NTDS\n\n[[T1003.003]](https://attack.mitre.org/versions/v10/techniques/T1003/003/)\n\n[Discovery [TA0007]](https://attack.mitre.org/versions/v10/tactics/TA0007/) [Remote System Discovery [T1018]](https://attack.mitre.org/versions/v10/techniques/T1018/)\n\n[Lateral Movement [TA0008]](https://attack.mitre.org/versions/v10/tactics/TA0008/)\n\n[Collection [TA0009]](https://attack.mitre.org/versions/v10/tactics/TA0009/) Archive Collected Data: Archive via Utility\n\n[[T1560.001]](https://attack.mitre.org/versions/v10/techniques/T1560/001/)\n\n\n-----\n\n## Revisions\n\nMarch 15, 2022: Initial Version\n\n[This product is provided subject to this Notification and this](https://www.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa22-074a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-15 - Alert (AA22-074A) Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability.pdf"
    ],
    "report_names": [
        "2022-03-15 - Alert (AA22-074A) Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability.pdf"
    ],
    "threat_actors": [
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535914,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1653786447,
    "ts_modification_date": 1653786447,
    "files": {
        "pdf": "https://archive.orkl.eu/6e4467e8364c0324b4621cfd0d14d0af2a5d2b9e.pdf",
        "text": "https://archive.orkl.eu/6e4467e8364c0324b4621cfd0d14d0af2a5d2b9e.txt",
        "img": "https://archive.orkl.eu/6e4467e8364c0324b4621cfd0d14d0af2a5d2b9e.jpg"
    }
}