{
    "id": "d9bc2071-1e10-46fa-9d62-d093d9cad6af",
    "created_at": "2023-01-12T15:05:36.90083Z",
    "updated_at": "2025-03-27T02:15:45.268905Z",
    "deleted_at": null,
    "sha1_hash": "ed0e03a69e060c88274764ee298e993a1e6ecaff",
    "title": "2021-12-02 - APT Expands Attack on ManageEngine With Active Campaign Against ServiceDesk Plus",
    "authors": "",
    "file_creation_date": "2022-05-28T00:36:38Z",
    "file_modification_date": "2022-05-28T00:36:38Z",
    "file_size": 522238,
    "plain_text": "# APT Expands Attack on ManageEngine With Active Campaign Against ServiceDesk Plus\n\n**[unit42.paloaltonetworks.com/tiltedtemple-manageengine-servicedesk-plus/](https://unit42.paloaltonetworks.com/tiltedtemple-manageengine-servicedesk-plus/)**\n\nRobert Falcone, Peter Renals December 2, 2021\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Peter Renals](https://unit42.paloaltonetworks.com/author/peter-renals/)\n\nDecember 2, 2021 at 6:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [APT,](https://unit42.paloaltonetworks.com/tag/apt/) [Godzilla webshell,](https://unit42.paloaltonetworks.com/tag/godzilla-webshell/) [ServiceDesk Plus,](https://unit42.paloaltonetworks.com/tag/servicedesk-plus/) [TiltedTemple,](https://unit42.paloaltonetworks.com/tag/tiltedtemple/) [Zoho ManageEngine](https://unit42.paloaltonetworks.com/tag/zoho-manageengine/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/tiltedtemple-manageengine-servicedesk-plus/)\n\n## Executive Summary\n\nOver the course of three months, a persistent and determined APT actor has launched\nmultiple campaigns which have now resulted in compromises to at least 4 additional\norganizations, for a total of 13. Beginning on Sept. 16, 2021, the U.S. Cybersecurity and\n[Infrastructure Security Agency (CISA) released an alert warning that advanced persistent](https://us-cert.cisa.gov/ncas/alerts/aa21-259a)\nthreat (APT) actors were actively exploiting newly identified vulnerabilities in a self-service\npassword management and single sign-on solution known as ManageEngine ADSelfService\nPlus. Building upon the findings of that initial report, on Nov. 7, Unit 42 [disclosed a second,](https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/)\nmore sophisticated, active and difficult-to-detect campaign that had resulted in the\ncompromise of at least nine organizations.\n\n\n-----\n\nAs an update to our initial reporting, over the past month we have observed the threat actor\nexpand its focus beyond ADSelfService Plus to other vulnerable software. Most notably,\nbetween Oct. 25 and Nov. 8, the actor shifted attention to several organizations running a\ndifferent Zoho product known as ManageEngine ServiceDesk Plus. We now track the\ncombined activity as the TiltedTemple campaign. In our Nov. 7 blog, we stated that “while\nattribution is still ongoing and we have been unable to validate the actor behind the\ncampaign, we did observe some correlations between the tactics and tooling used in the\ncases we analyzed and Threat Group 3390 (TG-3390, Emissary Panda, APT27).” At this\nstage, we would note that correlation to those tactics and tooling is accurate, but attribution\nremains ongoing. In line with the Microsoft Threat Intelligence Center’s (MSTIC) findings,\nsome portions of TiltedTemple, specifically the September attacks exploiting ManageEngine\nADSelfService Plus overlaps with activity associated with DEV-0322, which according to\nMSTIC is “a group operating out of China, based on observed infrastructure, victimology,\ntactics, and procedures.”\n\nServiceDesk Plus is a help desk and asset management software. On Nov. 22, Zoho\n[released a security advisory alerting customers of active exploitation against newly](https://pitstop.manageengine.com/portal/en/community/topic/security-advisory-for-cve-2021-44077-unauthenticated-rce-vulnerability-in-servicedesk-plus-versions-up-to-11305-22-11-2021)\n[registered CVE-2021-44077. The vulnerability impacted ServiceDesk Plus versions 11305](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44077)\nand below. While we have been unable to identify any publicly available proof of concept\ncode for this vulnerability, it is now clear that the actor has successfully determined how to\nexploit unpatched versions of the software. Additionally, upon exploitation, the actor has\nbeen observed uploading a new dropper to victim systems. Similar to the previous tactics\nused against the ADSelfService software, this dropper deploys a Godzilla webshell which\nprovides the actor with further access to and persistence in compromised systems. In\nscoping the problem, we leveraged Xpanse capabilities to determine that there are currently\nover 4,700 internet-facing instances of ServiceDesk Plus globally, and 2,900 – or 62% – are\nassessed to be vulnerable to exploitation.\n\nIn light of these recent developments, we would advance our characterization of the threat to\nthat of an APT(s) conducting a persistent campaign, and leveraging a variety of initial access\nvectors, to compromise a diverse set of targets globally. Over the past three months, at least\n13 organizations across the technology, energy, healthcare, education, finance and defense\nindustries have been compromised. Of the four new victims, two were compromised through\nvulnerable ADSelfService Plus servers while two were compromised through ServiceDesk\nPlus software. We anticipate that this number will climb as the actor continues to conduct\nreconnaissance activities against these industries and others, including infrastructure\nassociated with five U.S. states.\n\nPalo Alto Networks customers are protected from the threats described in this blog by Threat\nPrevention for the [Next-Generation Firewall,](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Cortex XDR and](https://www.paloaltonetworks.com/cortex/cortex-xdr) [WildFire signatures.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nAdditionally, [Cortex Xpanse can accurately identify vulnerable versions of ADSelfService](https://www.paloaltonetworks.com/cortex/cortex-xpanse)\nPlus and ServiceDesk Plus software.\n\n\n-----\n\n## Recent Activity\n\nUpon performing a thorough analysis across all of our telemetry sets, we observed that\nbetween Sept. 17 and Oct. 15, the actor conducted reconnaissance and exploitation\nactivities against ManageEngine ADSelfService Plus software, as documented in our\nprevious report.\n\nThe threat actor, however, quickly began to expand the scope. Notably, following the initial\ncampaign, we witnessed a steady flow of connections from the actor's malicious\ninfrastructure to Zoho infrastructure beginning on Oct. 21 and continuing through Nov. 9. The\nactors accessed archives.manageengine[.]com and download.manageengine[.]com.\nBrowsing to the first site presents visitors with a form they can submit to request access to\nolder versions of ManageEngine software.\n\nFigure 1.\n\nScreenshot of archives.manageengine[.]comGiven this pattern of activity, we believe the\nactor may have used this portal to request older vulnerable versions of software in order to\ndevelop working exploits for known CVEs. Four days after this activity began, on Oct. 25, we\nobserved the first reconnaissance activity against a U.S. financial organization running a\n\n\n-----\n\nvulnerable version of ManageEngine ServiceDesk Plus. In the days that followed, we\nobserved similar activity across six other organizations, with exploitation against one U.S.\ndefense organization and one tech organization beginning as early as Nov. 3.\nIn continuing to track this actor's activities, we believe it is also important to note that on Nov.\n9, we observed the actor connecting to passwordmanagerpromsp[.]com. This domain is\nassociated with another ManageEngine product that provides Managed Service Providers\n(MSPs) with the ability to manage passwords across multiple customers in a single instance.\n[Earlier this year, Zoho released a patch for CVE-2021-33617 affecting this product. While we](https://nvd.nist.gov/vuln/detail/CVE-2021-33617)\nhave not seen any exploitation attempts to date, given the actor’s emerging pattern of\ntargeting ManageEngine products and the actor’s interest in this third product, we highly\nrecommend organizations apply the relevant patches.\n\nFigure 2. Timeline and impact of campaigns.\n\n## ServiceDesk Plus Vulnerability\n\nOn Nov. 20, a record for [CVE-2021-44077 was created. Two days later, Zoho released a](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44077)\n[security advisory alerting customers of active exploitation against an unauthenticated remote](https://pitstop.manageengine.com/portal/en/community/topic/security-advisory-for-cve-2021-44077-unauthenticated-rce-vulnerability-in-servicedesk-plus-versions-up-to-11305-22-11-2021)\ncode execution (RCE) vulnerability affecting ServiceDesk Plus versions up to 11305. With a\nseverity rating of critical, this vulnerability can allow an adversary to execute arbitrary code\nand carry out subsequent attacks. However, it is also worth noting that Zoho released an\nupdate on Sept. 16, three months earlier, that prevents exploitation in versions 11306 and\nabove.\n\nWe are not currently aware of any publicly available proof of concept code for how to exploit\nthis vulnerability. Additionally, given that the vulnerability was only disclosed after attacks\nbegan, we assess that the actor independently developed exploit code for their attacks.\n\n\n-----\n\nWe analyzed Zoho s ManageEngine ServiceDesk Plus to determine how the actors would\nexploit this vulnerability. We confirmed the existence of an RCE vulnerability that leveraged\nServiceDesk's REST API. The exploit requires a malicious actor to issue two requests to the\nREST API. The first is to upload an executable specifically named msiexec.exe and the\nsecond request launches the msiexec.exe payload. Both of these requests are required for\nsuccessful exploitation, and both are initiated remotely via the REST API without requiring\nauthentication to the ServiceDesk server. With our understanding of this vulnerability, we\ncreated the threat prevention signature Zoho ManageEngine ServiceDesk Plus File Upload\nVulnerability (91949) to block inbound exploitation attempts.\n\n## Msiexec.exe Analysis\n\nAfter successfully exploiting an internet-facing instance of ServiceDesk Plus, on Nov. 3, the\nactor uploaded and attempted to run a malicious dropper called msiexec.exe (SHA256:\necd8c9967b0127a12d6db61964a82970ee5d38f82618d5db4d8eddbb3b5726b7). This file\nwas uploaded to the server via the ServiceDesk REST API during exploitation, after which\nthe server saved the executable to the following path:\n\nD:\\ManageEngine\\ServiceDesk\\bin\\msiexec.exe\n\nStatic analysis of this file shows that it was compiled a few days earlier on Oct. 31, thus\nsuggesting it was available for use against other vulnerable targets in preceding days.\nAdditionally, as seen in malware in previous campaigns, the author of this payload did not\nremove debug symbols when compiling this sample, which provided two interesting\nanalytical leads. The debug symbol path was as follows:\n\nC:\\Users\\pwn\\documents\\visual studio 2015\\Projects\\payloaddll\\Release\\sd11301.pdb\n\nThe first interesting portion of the debug path is the username of pwn that was used to create\nthis payload, which is the same username seen in the debug path within the\n[ME_ADManager.exe dropper delivered in the attacks on ADSelfService Plus. Secondly, the](https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/)\nfilename of sd11301.pdb suggests that the payload was specifically designed to target\n[ServiceDesk Plus versions 11301 and below, which are vulnerable to CVE-2021-44077 as](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44077)\n[well as an older CVE-2021-37415.](https://nvd.nist.gov/vuln/detail/CVE-2021-37415)\n\nAs mentioned above, the actor would execute this payload during the exploitation of CVE2021-44077 by issuing a second request to the REST API, which instructs the ServiceDesk\napplication to run the following command:\n\nmsiexec.exe /i Site24x7WindowsAgent.msi EDITA1=<unique site24x7 API key> /qn\n\nThe ServiceDesk application runs this command as part of the setup of Zoho’s Site24x7\nproduct, which is described as a “Performance Monitoring Solution for DevOps and IT\nOperations.” The documentation for the Site24x7 product details how to install the software\nusing a legitimate copy of msiexec exe as follows:\n\n\n-----\n\nmsiexec.exe /i Site24x7WindowsAgent.msi EDITA1=<Device Key> /qn\n\nTherefore, the actor uploads the malicious msiexec.exe payload and tricks ServiceDesk into\nrunning it instead of the legitimate msiexec.exe application. We confirmed that the malicious\nmsiexec.exe dropper does not actually use any of the other arguments passed on the\ncommand line.\n\nUpon successful execution, this sample starts by creating the following generic mutex, which\ncan be found in many code examples freely available on the internet. This mutex prevents\nmultiple instances of the dropper from running on the same victim host, which is the same\nmutex as seen in the ME_ADManager.exe dropper delivered in previous attacks on attacks\non ADSelfService Plus:\n\ncplusplus_me\n\nThe dropper then attempts to write a hardcoded Java module to the following location:\n\n../lib/tomcat/tomcat-postgres.jar\n\nThe tomcat-postgres.jar (SHA256:\n67ee552d7c1d46885b91628c603f24b66a9755858e098748f7e7862a71baa015) file is a\nvariant of the Godzilla webshell that leverages Apache Tomcat’s [Java Servlet Filter](https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/Filter.html)\nfunctionality, which we will describe in the next section. In order to load the webshell into\nmemory, the dropper searches for and kills the java.exe process that is currently running the\nServiceDesk Plus service. After killing the Java process, the process is automatically\nrestarted by ServiceDesk Plus, which effectively loads the webshell filter into Tomcat. The\ndropper finishes by moving itself to RunAsManager.exe within the current directory, which the\nServiceDesk application specifically sets to ManageEngine\\ServiceDesk\\site24x7 when\nexecuting msiexec.exe using Java's ProcessBuilder API.\n\n## Godzilla Webshell\n\nWhile the threat actor used the same webshell secret key – 5670ebd1f8f3f716 – that was\npreviously seen in the attacks on ADSelfService Plus, the Godzilla webshell used in this\nattack was not a single Java Server Pages (JSP) file as seen before. Rather, the webshell\nwas installed as an Apache Tomcat Java Servlet Filter. According to Tomcat’s\ndocumentation, these Tomcat Filters allow for the filtering of inbound requests or outbound\nresponses. In this particular case, this allows the actor to filter inbound requests to determine\nwhich requests are meant for the webshell.\n\nThe fact that this Godzilla webshell is installed as a filter means that there is no specific URL\nthat the actor will send their requests to when interacting with the webshell, and the Godzilla\nwebshell filter can also bypass a security filter that is present in ServiceDesk Plus to stop\naccess to webshell files.\n\n\n-----\n\n[It appears that the threat actor leveraged publicly available code called tomcat-backdoor to](https://github.com/Scorpio-m7/tomcat-backdoor)\nbuild the filter and then added a modified Godzilla webshell to it. The use of a publicly\navailable tool with documentation written in Chinese fits the actor’s prior tactics, techniques\nand procedures (TTPs). For example, we previously saw this in the Godzilla and NGLite\ntools used by the actor to attack ADSelfService Plus. The publicly available tomcat-backdoor\nsource code provided the actors a codebase which they then modified by removing the\ndefault code that would run commands from inbound requests with custom code that used\nthe Godzilla webshell.\n\nFigure 3a. Threat actor's Tomcat filter.\n\nFigure 3b. Publicly available tomcat-backdoor\n\n\n-----\n\nIn order to make the Godzilla webshell work under the filter environment, the threat actor\nmade a few changes to the webshell code as well as, we believe, the webshell controller. For\nexample, the Tomcat filter does not support the HttpSession object. Thus, HttpSession\nmethods in Godzilla webshell were replaced with HttpServletRequest request and response.\nAlso, to identify requests to interact with Godzilla, the tomcat-postgres.jar filter looks for\ninbound POST requests with a parameter jsessionsid. After identifying inbound requests to\nthe webshell, the filter will look for parameters named j_username to obtain the Godzilla\nwebshell command’s functional code and j_password to access the parameters for the\nfunctional code.\n\nFigure 4. Modified Godzilla shell vs original Godzilla shell.\n\n## Vulnerable Systems\n\nRecent scans by the Palo Alto Networks Cortex Xpanse platform identified over 4,700\ninternet-exposed systems running the ServiceDesk Plus software globally. Across the global\npopulation, we also determined that roughly 2,900 – or 62% – of systems are running\nvulnerable or unpatched versions of the software. The largest population of vulnerable\nsystems was found in the U.S., followed by India, Russia, Great Britain and Turkey.\n\n**Country** **Percentage**\n\nUnited States 21%\n\nIndia 6.0%\n\nRussia 5.7%\n\nGreat Britain 3.5%\n\nTurkey 3.4%\n\n_Table 1. Global dispersion of vulnerable ServiceDesk Plus systems._\n\nAs of publication, within the U.S., we identified over 1,200 systems running ServiceDesk Plus\nsoftware. Roughly 600 – or 50% – of the systems are running vulnerable or unpatched\nversions of the software. In characterizing this vulnerable population, we found systems\n\n\n-----\n\nfalling across all industry segments, including 23 universities, 14 state or local governments,\nand 10 healthcare organizations.\n\n## Conclusion\n\nOver the course of three months, a persistent and determined APT actor has launched\nmultiple campaigns which have resulted in compromises to at least 13 organizations. Several\nof the impacted organizations fall across U.S. critical infrastructure sectors, including\ndefense, transportation, healthcare and energy.\n\nThe actor's first campaign leveraged a zero-day vulnerability in Zoho ManageEngine\nADSelfService Plus software. In late October, the actor launched its most recent campaign,\nwhich shifted focus toward a previously undisclosed vulnerability in Zoho ManageEngine\n[ServiceDesk Plus software (CVE-2021-44077). Upon exploiting this vulnerability, the actor](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44077)\nuploaded a new dropper that deployed a Godzilla webshell on victim networks with capability\nto bypass a security filter on ADSelfService and ServiceDesk Plus products.\n\nGlobally there are over 4,700 internet facing instances of ServiceDesk Plus, of which 2,900 –\nor 62% – are assessed to be vulnerable to exploitation. Given the actor's success to date\nand continued reconnaissance activities against a variety of industries (including\ninfrastructure associated with five US states), we anticipate the number of victims will\ncontinue to climb.\n\nWe encourage all organizations to patch vulnerable software in their environments.\n\n### Protections and Mitigations\n\nThe best defense against this evolving campaign is a security posture that favors prevention.\nWe recommend that organizations implement the following:\n\n1. Identify all Zoho software and ensure the latest patches/upgrades have been applied.\n2. Evaluate the business need and risk associated with any internet-facing Zoho products.\n3. Review all files that have been created in ServiceDesk Plus directories since early\n\nOctober 2021.\n4. If you think you may have been impacted, please email unit42\ninvestigations@paloaltonetworks.com or call (866) 486-4842 – (866) 4-UNIT42 – for\nU.S. toll free, (31-20) 299-3130 in EMEA or (65) 6983-8730 in JAPAC. The Unit 42\nIncident Response team is available 24/7/365.\n\nFor Palo Alto Networks customers, our products and services provide the following coverage\nassociated with this campaign:\n\n[Threat Prevention provides protection against the Godzilla webshells. Threat IDs 81803,](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\n81815, 81816, 81817 and 81819 cover the various deviations in traffic across the .net, java,\nphp, and asp formats of this webshell. These protections have been in place since Apr. 28,\n\n\n-----\n\n2021. Threat ID 91949 (Zoho ManageEngine ServiceDesk Plus File Upload Vulnerability)\n[provides protection against CVE-2021-44077.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44077)\n\n[Cortex XDR protects endpoints and accurately identifies the dropper used in this campaign](https://www.paloaltonetworks.com/cortex/cortex-xdr)\nas malicious. Additionally, Cortex XDR has several detections for lateral movement and\ncredential theft TTPs employed by this actor set.\n\n[WildFire cloud-based threat analysis service accurately identifies the dropper used in this](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\ncampaign as malicious.\n\n[Cortex Xpanse can accurately identify Zoho ManageEngine ADSelfService Plus and](https://www.paloaltonetworks.com/cortex/cortex-xpanse)\nServiceDesk Plus servers, as well as whether or not they are vulnerable to these attacks,\nacross customer networks.\n\nPalo Alto Networks has shared these findings, including file samples and indicators of\ncompromise, with our fellow Cyber Threat Alliance members. CTA members use this\nintelligence to rapidly deploy protections to their customers and to systematically disrupt\nmalicious cyber actors. Learn more about the Cyber Threat Alliance.\n\n### Indicators of Compromise\n\n**Samples**\n\necd8c9967b0127a12d6db61964a82970ee5d38f82618d5db4d8eddbb3b5726b7\n\n67ee552d7c1d46885b91628c603f24b66a9755858e098748f7e7862a71baa015\n\n### Additional Resources\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-02 - APT Expands Attack on ManageEngine With Active Campaign Against ServiceDesk Plus.pdf"
    ],
    "report_names": [
        "2021-12-02 - APT Expands Attack on ManageEngine With Active Campaign Against ServiceDesk Plus.pdf"
    ],
    "threat_actors": [
        {
            "id": "0a80df4d-5ab7-4ca3-809d-8ef7b5a54f1f",
            "created_at": "2023-11-21T02:00:07.386886Z",
            "updated_at": "2025-03-27T02:00:03.248375Z",
            "deleted_at": null,
            "main_name": "TiltedTemple",
            "aliases": [
                "DEV-0322",
                "Circle Typhoon"
            ],
            "source_name": "MISPGALAXY:TiltedTemple",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535936,
    "ts_updated_at": 1743041745,
    "ts_creation_date": 1653698198,
    "ts_modification_date": 1653698198,
    "files": {
        "pdf": "https://archive.orkl.eu/ed0e03a69e060c88274764ee298e993a1e6ecaff.pdf",
        "text": "https://archive.orkl.eu/ed0e03a69e060c88274764ee298e993a1e6ecaff.txt",
        "img": "https://archive.orkl.eu/ed0e03a69e060c88274764ee298e993a1e6ecaff.jpg"
    }
}