{
    "id": "d9bd02bd-7497-488e-b059-adc645e1146d",
    "created_at": "2023-01-12T15:07:25.982295Z",
    "updated_at": "2025-03-27T02:05:19.558555Z",
    "deleted_at": null,
    "sha1_hash": "30ec99da587564b6c3452d40919396cb019f1d8a",
    "title": "2021-07-28 - DoppelPaymer Continues to Cause Grief Through Rebranding",
    "authors": "",
    "file_creation_date": "2022-05-28T19:57:08Z",
    "file_modification_date": "2022-05-28T19:57:08Z",
    "file_size": 615007,
    "plain_text": "# DoppelPaymer Continues to Cause Grief Through Rebranding\n\n**[zscaler.com/blogs/security-research/doppelpaymer-continues-cause-grief-through-rebranding](https://www.zscaler.com/blogs/security-research/doppelpaymer-continues-cause-grief-through-rebranding)**\n\nIn early May 2021, DoppelPaymer ransomware activity dropped significantly. Although the\nDoppelPaymer leak site still remains online, there has not been a new victim post since May\n6, 2021. In addition, no victim posts have been updated since the end of June. This lull is\n[likely a reaction to the Colonial Pipeline ransomware attack which occurred on May 7, 2021.](https://www.zscaler.com/resources/security-terms-glossary/what-are-ransomware-attacks)\nHowever, the apparent break is due to the threat group behind DoppelPaymer rebranding\nthe ransomware under the name Grief (aka Pay OR Grief). An early Grief ransomware (aka\nPay or Grief) sample was compiled on May 17, 2021. This sample is particularly interesting\nbecause it contains the Grief ransomware code and ransom note, but the link in the ransom\nnote points to the DoppelPaymer ransom portal. This suggests that the malware author may\nhave still been in the process of developing the Grief ransom portal. Ransomware threat\ngroups often rebrand the name of the malware as a diversion.\n\nIn this blog, we will compare the similarities between DoppelPaymer and Grief ransomware.\nBoth ransomware leak sites are nearly identical, including shared code that displays a\ncaptcha to prevent automated crawling as shown in Figure 1.\n\n\n-----\n\nFigure 1. Grief ransomware (left) and DoppelPaymer (right) captcha\n\nThe main landing page has changed the term latest proofs to griefs in progress and latest\n_leaks to complete griefs. The victim-specific leak page layouts are also identical as shown_\nbelow in Figure 2 containing the victims URL, organizational description, images of stolen\ndata, example stolen data files, and a list of machines that were compromised.\n\nFigure 2. Grief ransomware (left) and DoppelPaymer (right) victim leak pages\n\nThe Grief ransom portal has some differences from the DoppelPaymer portal. In particular,\nthe ransom demand payment method is made in Monero (XMR) instead of Bitcoin (BTC).\nThis switch in cryptocurrencies may be in response to the FBI recovering part of the Colonial\nPipeline ransom payment. The Grief ransom portal, however, kept the same live chat code\nthat allows victims to resume a previous conversation or to start a new conversation as\nshown in Figure 3.\n\n\n-----\n\nFigure 3. Grief ransomware (left) and DoppelPaymer (right) victim ransom portals\n\nGrief ransomware portal and leak site also attempts to weaponize the European Union’s\nGeneral Data Protection Regulation (GDPR) to pressure businesses into paying a ransom to\navoid potential fines.\n\nThe malware code differences between DoppelPaymer and Grief are also relatively minimal.\nGrief samples removed the embedded ProcessHacker binaries. However, Grief still retains\nthe code to decrypt data from the binary’s .sdata section. The Grief string encryption\nalgorithm is similar to DoppelPaymer, except the RC4 key was increased from a length of 40\nbytes to 48 bytes. The vast majority of the two codebases are very similar with identical\nencryption algorithms (2048-bit RSA and 256-bit AES), import hashing, and entry point\noffset calculation.\n\n## Conclusion\n\nGrief ransomware is the latest version of DoppelPaymer ransomware with minor code\nchanges and a new cosmetic theme. The threat group has been very active since the\nrelease of Grief in the middle of May 2021. However, they have been successful in\nmaintaining a low profile so far. This is in light of recent high-profile attacks including the\nColonial Pipeline hack by Darkside ransomware and the Kaseya supply-chain attack by\nREvil.\n\n## Indicators of Compromise (IOCs)\n\nThe following IOCs can be used to detect Grief ransomware.\n\n### Samples\n\nSHA256 Hash Module\nName\n\n\n-----\n\nb5c188e82a1dad02f71fcb40783cd8b910ba886acee12f7f74c73ed310709cd2 Grief\nransomware\nsample\n\n91e310cf795dabd8c51d1061ac78662c5bf4cfd277c732385a82f181e8c29556 Grief\nransomware\nsample\n\ndda4598f29a033d2ec4f89f4ae687e12b927272462d25ca1b8dec4dc0acb1bec Grief\nransomware\nsample\n\n0864575d4f487e52a1479c61c2c4ad16742d92e16d0c10f5ed2b40506bbc6ca0 Grief\nransomware\nsample\n\nb21ad8622623ce4bcdbf8c5794ef93e2fb6c46cd202d70dbeb088ea6ca4ff9c8 Grief\nransomware\nsample\n(early build)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-28 - DoppelPaymer Continues to Cause Grief Through Rebranding.pdf"
    ],
    "report_names": [
        "2021-07-28 - DoppelPaymer Continues to Cause Grief Through Rebranding.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536045,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653767828,
    "ts_modification_date": 1653767828,
    "files": {
        "pdf": "https://archive.orkl.eu/30ec99da587564b6c3452d40919396cb019f1d8a.pdf",
        "text": "https://archive.orkl.eu/30ec99da587564b6c3452d40919396cb019f1d8a.txt",
        "img": "https://archive.orkl.eu/30ec99da587564b6c3452d40919396cb019f1d8a.jpg"
    }
}