{
    "id": "d9bfca68-9d00-4e44-8d78-59afeb89bcc1",
    "created_at": "2023-01-12T15:09:25.583144Z",
    "updated_at": "2025-03-27T02:17:27.762427Z",
    "deleted_at": null,
    "sha1_hash": "1e7ad08f71dada3571e04e76effefffcb9b2a89a",
    "title": "2018-09-12 - OilRig Uses Updated BONDUPDATER to Target Middle Eastern Government",
    "authors": "",
    "file_creation_date": "2022-05-29T01:30:35Z",
    "file_modification_date": "2022-05-29T01:30:35Z",
    "file_size": 209117,
    "plain_text": "# OilRig Uses Updated BONDUPDATER to Target Middle Eastern Government\n\n**researchcenter.paloaltonetworks.com/2018/09/unit42-oilrig-uses-updated-bondupdater-target-middle-eastern-**\ngovernment/\n\nKyle Wilhoit, Robert Falcone September 12, 2018\n\nBy [Kyle Wilhoit and](https://unit42.paloaltonetworks.com/author/kyle-wilhoit/) [Robert Falcone](https://unit42.paloaltonetworks.com/author/robertfalcone/)\n\nSeptember 12, 2018 at 4:00 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [BONDUPDATER,](https://unit42.paloaltonetworks.com/tag/bondupdater/) [OilRig](https://unit42.paloaltonetworks.com/tag/oilrig/)\n\nThe OilRig group has been active since at least mid-2016, and continues their attack\ncampaigns throughout the Middle East, targeting both governmental agencies and\nbusinesses on an almost routine basis. Often preferring homegrown tools and malware,\nOilRig continually modifies their malware and tools to accomplish their objectives. In August\n2018, Unit 42 observed OilRig targeting a government organization using spear-phishing\nemails to deliver an updated version of a Trojan known as BONDUPDATER.\nBONDUPDATER is a PowerShell-based Trojan first discovered by FireEye in mid-November\n2017, when OilRig targeted a different Middle Eastern governmental organization.\n\nThe BONDUPDATER Trojan contains basic backdoor functionality, allowing threat actors to\nupload and download files, as well as the ability to execute commands. BONDUPDATER,\nlike other OilRig tools, uses DNS tunneling to communicate with its C2 server. During the\n\n\n-----\n\npast month, Unit 42 observed several attacks against a Middle Eastern government\nleveraging an updated version of the BONDUPDATER malware, which now includes the\nability to use TXT records within its DNS tunneling protocol for its C2 communications.\n\nA New Series of Attacks\n\nIn mid-August, the Oilrig threat group sent what appeared to be a highly targeted phishing\nemail to a high-ranking office in a Middle Eastern nation. The email had no subject and what\ninitially drew our attention to this attack was the content of the spear phishing email.\n\n_Figure 1. Spear phishing email sent by the Oilrig threat group_\n\nAttached to the email was a malicious document named “N56.15.doc” (SHA256:\n7cbad6b3f505a199d6766a86b41ed23786bbb99dab9cae6c18936afdc2512f00) which\ncontained a macro that attempted to install a new version of the BONDUPDATER Trojan.\n\n_Figure 2. Microsoft Word document with embedded macros and PowerShell_\n\n\n-----\n\nUpdated BONDUPDATER\n\nThe spear-phishing email had an attached Microsoft Word document that contained a macro\nresponsible for installing a new variant of BONDUPDATER. The macro begins this\ninstallation process by creating two files on the system at the following location:\n\nC:\\ProgramData\\WindowsAppPool\\AppPool.vbs (SHA256:\nc0018a2e36c7ef8aa15b81001a19c4127ad7cd21ae410c1f854e5dadfa98b322)\n\nC:\\ProgramData\\WindowsAppPool\\AppPool.ps1 (SHA256:\nd5c1822a36f2e7107d0d4c005c26978d00bcb34a587bd9ccf11ae7761ec73fb7)\n\nThe macro finishes by running the dropped VBScript \"AppPool.vbs\" file by running \"wscript\nC:\\ProgramData\\WindowsAppPool\\AppPool.vbs\". When first executed, the \"AppPool.vbs\" file\nwill create the following scheduled task to execute every minute, which provides\nBONDUPDATER persistence and the ability to continually run on the system as the Trojan\ndoes not have a main loop to carry out its functionality:\n\ncmd.exe /C schtasks /create /F /sc minute /mo 1 /tn \"\\WindowsAppPool\\AppPool\" /tr \"wscript\n/b \"C:\\ProgramData\\WindowsAppPool\\AppPool.vbs\"\"\n\nAfter creating the scheduled task, the VBScript will execute the \"AppPool.ps1\" script dropped\nby the macro using the following command line:\n\nPowerShell.exe -exec bypass -file C:\\ProgramData\\WindowsAppPool\\AppPool.ps1\n\nSubsequent executions of \"AppPool.vbs\" will check for the existence of a file named \"quid\",\nwhich, if present, will also use the above PowerShell script to run \"AppPool.ps1\". The\nPowerShell script creates the \"quid\" file upon its first execution to avoid creating multiple\nscheduled tasks.\n\nThe \"AppPool.ps1\" file is a PowerShell script that is a variant of the BONDUPDATER\npayload. BONDUPDATER, like other OilRig payloads, uses DNS tunneling to communicate\nwith its C2 server. This variant of the BONDUPDATER Trojan has a new lock file, which\ninvolves creating a lock file at the following location which will write the current PowerShell\nprocess identifier (PID) to this file:\n\nC:\\ProgramData\\WindowsAppPool\\lock\n\nThe purpose of this lock file is to only have one instance of the Trojan running at one time.\nHowever, it also uses this lock file to determine how long the PowerShell process has been\nexecuting, as it checks the creation time of the file lock against the current time to determine\nif the PowerShell process has been running for more than ten minutes. If it has, the script will\nstop the process based on the PID in the lock file and delete the lock file. Future executions\nof the PowerShell script will fully execute as the lock file will no longer exist on the system.\n\n\n-----\n\nThis suggests the threat actors may have experienced issues with this Trojan running for\nextended periods in the past, likely related to the communication loops that we will discuss\nlater.\n\nThis BONDUPDATER variant also creates the following file that it will use to store a unique\nidentifier for the system, which is generated by obtaining a random number between 10 and\n99 and appending the first 8 characters of a generated GUID:\n\nC:\\ProgramData\\WindowsAppPool\\quid\n\nThe BONDUPDATER Trojan then creates several folders that it will use to store files it\nreceives from the C2 server and files that it generates or gathers to send to the C2 server.\nThe folder names are:\n\nC:\\ProgramData\\WindowsAppPool\\files\n\nC:\\ProgramData\\WindowsAppPool\\<unique ID from quid file>\\receivebox\n\nC:\\ProgramData\\WindowsAppPool\\<unique ID from quid file>\\sendbox\n\nC:\\ProgramData\\WindowsAppPool\\<unique ID from quid file>\\done\n\nEven though the script creates the \"files\" folder, it does not appear that the Trojan uses these\nfolders within the code. The Trojan uses the \"receivebox\" folder to store files obtained from\nthe C2 server, while the \"sendbox\" folder is used to store files that the Trojan will upload to\nthe server. The Trojan uses the filenames of the file received from the C2 server stored in the\n\"receivebox\" folder to determine how to handle the file, which is explained below.\n\nThe BONDUPDATER sample retains its original command handling and C2 communication\nfunctionality. This process involves communicating with the C2 server to receive a file and\nusing a character in the filename as the command. The Trojan's command handler checks\nthe trailing character of the filename to process the file contents, which can be seen in Table\n1.\n\n\n**Trailing**\n**Character/Command**\n\n\n**Purpose** **Description**\n\n\n0 Execute\ncommand\n\n1 Download\nfile\n\n\nReads the contents of the file and runs them as a\ncommand with \"cmd.exe\". The output of the\ncommand is saved to a file whose name starts with\n\"proc\" and is stored in the \"sendbox\" folder, which the\nTrojan will send to the C2 server.\n\nReads the contents of the file for a path to a file to\ndownload. Copies the specified file to a file in the\n\"sendbox\" folder for the Trojan to send to the C2\nserver.\n\n\n-----\n\nAny other character Upload\nfile\n\n\nUsed to store a file on the system. The file is moved\nto the \"done\" folder, which stores the file for future\nuse. The Trojan writes \"200<>[path to stored file]\" to\na file in the \"sendbox\" folder to notify the C2 that the\nfile was downloaded successfully.\n\n\n_Table 1 Commands available in BONDUPDATER and their purpose_\n\nAfter handling the command, BONDUPDATER will send files it saved in the \"sendbox\" folder\nto the C2 server, after which it terminates and relies on the scheduled task to run again in the\nfuture.\n\nAs discussed above, the BONDUPDATER Trojan uses a DNS tunneling protocol to receive\nfiles from the C2 server for processing. This particular BONDUPDATER sample includes two\ndifferent variations of the DNS tunneling protocol, one using DNS A records, and one using\nDNS TXT records to transmit data from the C2 to the Trojan. The use of TXT records for C2\ncommunications appears to be a new feature to the BONDUPDATER Trojan.\n\nThe DNS tunneling protocol uses carefully crafted subdomains sent to the authoritative name\nserver of the C2 domain, which in this specific sample was the domain \"withyourface[.]com\".\nThe Trojan generates subdomains differently when it sends data to the C2 compared to\nwhen it is looking to receive data from the C2, regardless of which DNS tunneling protocol is\nused for communications. The format of the generated domains for both sending and\nreceiving starts with the previously generated GUID created to uniquely identify the system.\nHowever, the Trojan inserts a part number value and an action type character into this GUID\nstring at random offsets. The part number value is a three-digit string that corresponds to the\nchunk of data the Trojan is attempting to transmit. The action type is a single character that\nnotifies the C2 the type of communication the Trojan is carrying out. The two static\ncharacters \"C\" and \"T\" in the subdomain surround two digits, which help the C2 server find\nthe part number and action type mixed in within the GUID string at random offsets.\n\n**Sending data format**\n\n<GUID with part number and action character><sequence number><between 1 and 7\nrandom characters>C<index of part number><index of action>T.<data chunk>.<filename>.\n<c2 domain>\n\n**Receiving data format**\n\n<GUID with part number and action character><sequence number><between 1 and 7\nrandom characters>C<index of part number><index of action>T.<c2 domain>\n\nDepending on whether the C2 communications use DNS A or TXT records, different action\ntypes are used when generating the subdomains to notify the C2 what format to use to\nrespond. Table 2 shows action types used in outbound requests and the purpose of the\n\n\n-----\n\nrequest.\n\n**Action**\n**Type**\n\n\n**A/TXT**\n**Communications**\n\n\n**Description**\n\n\nM A/TXT Initial beacon\n\n0 A Provide filename\n\n1 A Provide data\n\nW TXT Provide filename\n\nD TXT Provide data\n\nP TXT TXT method failed, notify C2 to switch to A\nrecords\n\n_Table 2 Action types used within the DNS tunneling protocol and their purpose_\n\nFor example, the Trojan will begin communicating with its C2 server by sending an initial\nbeacon with the action character \"M\". This initial beacon will follow the receiving format, as\nseen in the following example:\n\n_Figure 3. Example domain for the C2 beacon with its format explained_\n\nThe offset to the part number and action type in the GUID above may not seem correct at\nfirst, as the action type does not appear to be at offset 8 in the string. However, this is\ncorrect, as the action type is inserted at offset 8 before the part number was inserted at offset\n3. Therefore, we believe the C2 server just adds the two offsets together to find the actual\nlocation of the action type in the string.\n\nOriginal Data Transfer using DNS Tunneling\n\n\n-----\n\nThe original data transfer process within BONDUPDATER looked for specific A records\nwithin answers to DNS queries, shown in Table 3. The Trojan processed the A records in the\nC2 response to obtain a filename, which specifically looks for an IPv4 address within the A\nrecord with \"24.125\" in the first two octets. The Trojan appends the remaining two octets of\nthis A record to the string \"rcvd\" and uses this as the filename to save future data to in the\n\"receivebox\" folder. This IP address also instructs the Trojan to treat following DNS A records\nas data. The following DNS A records are split on the \".\" and each of the first three octets are\ntreated as data, whereas the fourth octet is used as a counter to obtain the correct chunk of\ndata. Lastly, the Trojan looks for the A record \"1.2.3\" as a signal to write the provided data to\nthe specified file, which is then subjected to the previously mentioned file-based command\nhandler.\n\n**IP Address** **Description**\n\n24.125.\\d.\\d Sets the filename \"rcvd\\d\\d\" in the \"receivebox\" to store data for processing\n\n\\d.\\d.\\d.\\d First three \\d are treated as data and the fourth is used to keep track of the\nsequence\n\n1.2.3.\\d Instructs the Trojan to write the data to the file and begin processing it for\ncommands.\n\n_Table 3 IP Addresses and their meanings within the original data transfer process in_\n_BONDUPDATER_\n\nNew Data Transfer using DNS Tunneling\n\nThis BONDUPDATER sample has a new method to obtain files from the C2 server using a\nseries of DNS TXT queries. This method follows a similar process as the original method but\nuses DNS TXT results to obtain a filename and the data to write to the file. Once data is\nwritten to the file system, this method uses the same command handler as the original\nmethod to process the contents of the file based on the trailing character of the filename, as\nseen in Table 1.\n\nThe C2 can initiate the new command handling functionality by responding to the initial\nbeacon with a DNS A record of \"99.250.250.199\". The script will enter a loop attempting to\ncommunicate with its C2 every 50 milliseconds, looking for a series of responses with\nspecific characters that the script will use as instructions to determine how to handle the\nresult of the TXT record, which can be seen in Table 4. The Trojan will split each TXT record\nfrom the C2 response on the character \">\", with the data to the left of the \">\" character used\nas the instruction and the data to the right as the data.\n\n**Instruction** **Description**\n\nN Idle. Set action type of next query to \"W\"\n\n\n-----\n\nS Receive data from C2. Decode data portion as base64. Sets the action type\nof future queries to the C2 to \"D\".\n\nS000s Use data to as a portion of the filename to save data to. The data is\nappended to the string \"rcvd\", which will be saved in the \"receivebox\" folder.\nSets the action type of future queries to the C2 to \"D\".\n\nE Write bytes provided by the \"S\" command to the file resulting from the\n\"S000s\" command. The breaks the loop for the script to process the\ndownloaded file.\n\nC Cancel communications by exiting the loop.\n\n_Table 4 Instructions within the new data transfer process in BONDUPDATER and their_\n_meanings_\n\nWhile we have not seen the C2 use this TXT record-based communications, we believe the\nprocess would involve the C2 providing a TXT record with the \"S000s\" instruction to set the\nfilename to which data is saved. The C2 would then provide a series of \"S\" instructions to\nprovide data, followed by the \"E\" instruction to write that data to the file, which would then be\nsubjected to the command handler.\n\nConclusion\n\nAs expected, OilRig is continuing their onslaught of attacks well into 2018 with continued\ntargeting in the Middle East. Sometimes developing new tools, OilRig also often uses what\nhas worked in the past, including developing variants of previously used tools and malware.\nThis reduces development time and capitalizes on previous versions of the tool and its\nsuccess.\n\nOilrig is a highly diverse and very resourceful threat actor, employing a litany of methods and\ntools to compromise victims, but Palo Alto Networks customers are protected from this OilRig\nattack and BONDUPDATER by:\n\n[AutoFocus customers can track this Trojan with the Bondupdater_Docs tag](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Bondupdater_Docs)\nAll known BONDUPDATER document samples are marked with malicious verdicts in\nWildFire\nAll known BONDUPDATER document C2 domains have DNS signatures and are\nclassified as Command and Control\n\nIndicators\n\n**BONDUPDATER C2**\n\nwithyourface[.]com\n\n**BONDUPDATER Dropper Docs**\n\n\n-----\n\n7cbad6b3f505a199d6766a86b41ed23786bbb99dab9cae6c18936afdc2512f00\n\nc0018a2e36c7ef8aa15b81001a19c4127ad7cd21ae410c1f854e5dadfa98b322\n\nd5c1822a36f2e7107d0d4c005c26978d00bcb34a587bd9ccf11ae7761ec73fb7\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-09-12 - OilRig Uses Updated BONDUPDATER to Target Middle Eastern Government.pdf"
    ],
    "report_names": [
        "2018-09-12 - OilRig Uses Updated BONDUPDATER to Target Middle Eastern Government.pdf"
    ],
    "threat_actors": [
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536165,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1653787835,
    "ts_modification_date": 1653787835,
    "files": {
        "pdf": "https://archive.orkl.eu/1e7ad08f71dada3571e04e76effefffcb9b2a89a.pdf",
        "text": "https://archive.orkl.eu/1e7ad08f71dada3571e04e76effefffcb9b2a89a.txt",
        "img": "https://archive.orkl.eu/1e7ad08f71dada3571e04e76effefffcb9b2a89a.jpg"
    }
}