{
    "id": "d9cc270e-3119-4ae3-bb24-d036005217bf",
    "created_at": "2022-10-25T16:48:22.248196Z",
    "updated_at": "2025-03-27T02:14:11.693895Z",
    "deleted_at": null,
    "sha1_hash": "b64a571a29d1c2cfc40b6b6cef50a95e6ce3b455",
    "title": "The \"Red October\" Campaign - An Advanced Cyber Espionage Network Targeting Diplomatic And Government Agencies",
    "authors": "Kaspersky",
    "file_creation_date": "2015-02-08T18:37:33Z",
    "file_modification_date": "2015-02-08T18:37:33Z",
    "file_size": 1557346,
    "plain_text": "# Network Targeting Diplomatic and Government Agencies\n\n**[Here's a link to the full paper (part 1) about our Red October research. During the next](http://www.securelist.com/en/analysis/204792262/Red_October_Diplomatic_Cyber_Attacks_Investigation)**\n\n**days, we'll be publishing Part 2, which contains a detailed technical analysis of all the**\n\n**known modules. Please stay tuned.**\n\nDuring the past five years, a high-level cyber-espionage campaign has successfully infiltrated computer\n\nnetworks at diplomatic, governmental and scientific research organizations, gathering data and\n\nintelligence from mobile devices, computer systems and network equipment.\n\nKaspersky Lab's researchers have spent several months analyzing this malware, which targets specific\n\norganizations mostly in Eastern Europe, former USSR members and countries in Central Asia, but also in\n\nWestern Europe and North America.\n\nThe campaign, identified as \"Rocra\", short for \"Red October\", is currently still active with data being sent\n\nto multiple command-and-control servers, through a configuration which rivals in complexity the\n\n[infrastructure of the Flame malware. Registration data used for the purchase of C&C domain names and](https://www.securelist.com/en/blog/208193522/The_Flame_Questions_and_Answers)\n\nPE timestamps from collected executables suggest that these attacks date as far back as May 2007.\n\n\n-----\n\nThe attackers have been active for at least five years, focusing on diplomatic and governmental\n\nagencies of various countries across the world. Information harvested from infected networks is\n\nreused in later attacks. For example, stolen credentials were compiled in a list and used when the\n\nattackers needed to guess passwords and network credentials in other locations. To control the\n\nnetwork of infected machines, the attackers created more than 60 domain names and several server\n\nhosting locations in different countries (mainly Germany and Russia). The C&C infrastructure is\n\nactually a chain of servers working as proxies and hiding the location of the true -mothership\ncommand and control server.\n\nThe attackers created a multi-functional framework which is capable of applying quick extension of\n\nthe features that gather intelligence. The system is resistant to C&C server takeover and allows the\n\nattacker to recover access to infected machines using alternative communication channels.\n\nBeside traditional attack targets (workstations), the system is capable of stealing data from mobile\n\ndevices, such as smartphones (iPhone, Nokia, Windows Mobile); dumping enterprise network\n\nequipment configuration (Cisco); hijacking files from removable disk drives (including already\n\ndeleted files via a custom file recovery procedure); stealing e-mail databases from local Outlook\n\nstorage or remote POP/IMAP server; and siphoning files from local network FTP servers.\n\nWe have observed the use of at least three different exploits for previously known vulnerabilities:\n\n**CVE-2009-3129 (MS Excel), CVE-2010-3333 (MS Word) and CVE-2012-0158 (MS**\n\n**Word). The earliest known attacks used the exploit for MS Excel and took place in 2010 and 2011,**\n\nwhile attacks targeting the MS Word vulnerabilities appeared in the summer of 2012.\n\n\n-----\n\nThe exploits from the documents used in spear phishing were created by other attackers and\n\nemployed during different cyber attacks against Tibetan activists as well as military and energy\n\nsector targets in Asia. The only thing that was changed is the executable which was embedded in the\n\ndocument; the attackers replaced it with their own code.\n\n\n-----\n\nSample fake image used in one of the Rocra spear phishing attacks.\n\nDuring lateral movement in a victim's network, the attackers deploy a module to actively scan the\n\nlocal area network, find hosts vulnerable for MS08-067 (the vulnerability exploited by Conficker) or\n\naccessible with admin credentials from its own password database. Another module used collected\n\ninformation to infect remote hosts in the same network.\n\nBased on registration data of the C&C servers and numerous artifacts left in executables of the\n\nmalware, we strongly believe that the attackers have Russian-speaking origins. Current attackers\n\nand executables developed by them have been unknown until recently, they have never related to\n\nany other targeted cyber attacks. Notably, one of the commands in the Trojan dropper switches the\n\ncodepage of an infected machine to 1251 before installation. This is required to address files and\n\ndirectories that contain Cyrillic characters in their names.\n\n## Rocra FAQ:\n\n**What is Rocra? Where does the name come from? Was Operation Rocra targeting any**\n\n**specific industries, organizations or geographical regions?**\n\nRocra (short for \"Red October\") is a targeted attack campaign that has been going on for at least five years.\n\nIt has infected hundreds of victims around the world in eight main categories:\n\n\n-----\n\n2. Diplomatic / embassies\n\n3. Research institutions\n\n4. Trade and commerce\n\n5. Nuclear / energy research\n\n6. Oil and gas companies\n\n7. Aerospace\n\n8. Military\n\nIt is quite possible there are other targeted sectors which haven't been discovered yet or have been\n\nattacked in the past.\n\n**How and when was it discovered?**\n\nWe have come by the Rocra attacks in October 2012, at the request of one of our partners. By analysing\n\nthe attack, the spear phishing and malware modules, we understood the scale of this campaign and started\n\ndissecting it in depth.\n\n**Who provided you with the samples?**\n\nOur partner who originally pointed us to this malware prefers to remain anonymous.\n\n**How many infected computers have been identified by Kaspersky Lab? How many victims**\n\n**are there? What is the estimated size of Operation Red October on a global scale?**\n\nDuring the past months, we've counted several hundreds of infections worldwide - all of them in top\n\nlocations such as government networks and diplomatic institutions. The infections we've identified are\n\ndistributed mostly in Eastern Europe, but there are also reports coming from North America and Western\n\nEuropean countries such as Switzerland or Luxembourg.\n\nBased on our Kaspersky Security Network (KSN) here's a list of countries with most infections (only for\n\nthose with more than 5 victims):\n\n|Country|Infections|\n|---|---|\n|RUSSIAN FEDERATION|35|\n|KAZAKHSTAN|21|\n|AZERBAIJAN|15|\n|BELGIUM|15|\n|INDIA|14|\n\n\n-----\n\n|ARMENIA|10|\n|---|---|\n|IRAN; ISLAMIC REPUBLIC OF|7|\n|TURKMENISTAN|7|\n|UKRAINE|6|\n|UNITED STATES|6|\n|VIET NAM|6|\n|BELARUS|5|\n|GREECE|5|\n|ITALY|5|\n|MOROCCO|5|\n|PAKISTAN|5|\n|SWITZERLAND|5|\n|UGANDA|5|\n|UNITED ARAB EMIRATES|5|\n\n\nFor the sinkhole statistics see below.\n\n**Who is behind/responsible for this operation? Is this a nation-state sponsored attack?**\n\nThe information we have collected so far does not appear to point towards any specific location, however,\n\ntwo important factors stand out:\n\nThe exploits appear to have been created by Chinese hackers.\n\nThe Rocra malware modules have been created by Russian-speaking operatives.\n\nCurrently, there is no evidence linking this with a nation-state sponsored attack. The information stolen\n\nby the attackers is obviously of the highest level and includes geopolitical data which can be used by nation\n\nstates. Such information could be traded in the underground and sold to the highest bidder, which can be\n\nof course, anywhere.\n\n**Are there any interesting texts in the malware that can suggest who the attackers are?**\n\nSeveral Rocra modules contain interesting typos and mis-spellings:\n\nnetwork_scanner: \"SUCCESSED\", \"Error_massage\", \"natrive_os\", \"natrive_lan\"\n\nimapispool: \"UNLNOWN_PC_NAME\", \"WinMain: error CreateThred stop\"\n\nmapi_client: \"Default Messanger\", \"BUFEER IS FULL\"\n\nmsoffice_plugin: \"my_encode my_dencode\"\n\nwinmobile: \"Zakladka injected\", \"Cannot inject zakladka, Error: %u\"\n\nPswSuperMailRu: \"-------PROGA START-----\", \"-------PROGA END-----\"\n\n\n-----\n\nmeans an application or a program among Russian-speaking software engineers.\n\nIn particular, the word \"Zakladka\" in Russian can mean:\n\n\"bookmark\"\n\n(more likely) a slang term meaning \"undeclared functionality\", i.e. in software or hardware.\n\nHowever, it may also mean a microphone embedded in a brick of the embassy building.\n\nThe C++ class that holds the C&C configuration parameters is called \"MPTraitor\" and the corresponding\n\nconfiguration section in the resources is called \"conn_a\". Some examples include:\n\n**What kind of information is being hijacked from infected machines?**\n\nInformation stolen from infected systems includes documents with extensions:\n\ntxt, csv, eml, doc, vsd, sxw, odt, docx, rtf, pdf, mdb, xls, wab, rst, xps, iau,\n\ncif, key, crt, cer, hse, pgp, gpg, xia, xiu, xis, xio, xig, acidcsa, acidsca,\n\naciddsk, acidpvr, acidppr, acidssa.\n\nIn particular, the \"acid*\" extensions appear to refer to the classified software \"Acid Cryptofiler\", which is\n\nused by several entities such as the European Union and/or NATO.\n\n**What is the purpose/objective of this operation? What were the attackers looking for by**\n\n**conducting this sustained cyber-espionage campaign for so many years?**\n\nThe main purpose of the operation appears to be the gathering of classified information and geopolitical\n\nintelligence, although it seems that the information gathering scope is quite wide. During the past five\n\nyears, the attackers collected information from hundreds of high profile victims although it's unknown\n\nhow the information was used.\n\nIt is possible that the information was sold on the black market, or used directly.\n\n**What are the infection mechanisms for the malware? Does it have self-propagating (worm)**\n\n**capabilities? How does it work? Do the attackers have a customized attack platform?**\n\nThe main malware body acts as a point of entry into the system which can later download modules used\n\nfor lateral movement. After initial infection, the malware won't propagate by itself - typically, the attackers\n\nwould gather information about the network for a few days, identify key systems and then deploy modules\n\nwhich can compromise other computers in the network, for instance by using the MS08-067 exploit.\n\n\n-----\n\nMost of the tasks are provided as one-time PE DLL libraries that are received from the server, executed in\n\nmemory and then immediately discarded.\n\nSeveral tasks however need to be constantly present in the system, i.e. waiting for the iPhone or Nokia\n\nmobile to connect. These tasks are provided as PE EXE files and are installed in the infected machine.\n\n**Examples of \"persistent\" tasks**\n\nOnce a USB drive is connected, search and extract files by mask/format, including deleted files.\n\nDeleted files are restored using a built in file system parser\n\nWait for an iPhone or a Nokia phone to be connected. Once connected, retrieve information about\n\nthe phone, its phone book, contact list, call history, calendar, SMS messages, browsing history\n\nWait for a Windows Mobile phone to be connected. Once connected, infect the phone with a mobile\n\nversion of the Rocra main component\n\nWait for a specially crafted Microsoft Office or PDF document and execute a malicious payload\n\nembedded in that document, implementing a one-way covert channel of communication that can be\n\nused to restore control of the infected machine\n\nRecord all the keystrokes, make screenshots\n\nExecute additional encrypted modules according to a pre-defined schedule\n\nRetrieve e-mail messages and attachments from Microsoft Outlook and from reachable mail servers\n\nusing previously obtained credentials\n\n**Examples of \"one-time\" tasks**\n\nCollect general software and hardware environment information\n\nCollect filesystem and network share information, build directory listings, search and retrieve files\n\nby mask provided by the C&C server\n\nCollect information about installed software, most notably Oracle DB, RAdmin, IM software\n\nincluding Mail.Ru agent, drivers and software for Windows Mobile, Nokia, SonyEricsson, HTC,\n\nAndroid phones, USB drives\n\nExtract browsing history from Chrome, Firefox, Internet Explorer, Opera\n\nExtract saved passwords for Web sites, FTP servers, mail and IM accounts\n\nExtract Windows account hashes, most likely for offline cracking\n\nExtract Outlook account information\n\nDetermine the external IP address of the infected machine\n\nDownload files from FTP servers that are reachable from the infected machine (including those that\n\nare connected to its local network) using previously obtained credentials\n\n\n-----\n\nPerform a network scan, dump configuration data from Cisco devices if available\n\nPerform a network scan within a predefined range and replicate to vulnerable machines using the\n\nMS08-067 vulnerability\n\nReplicate via network using previously obtained administrative credentials\n\nThe Rocra framework was designed by the attackers from scratch and hasn't been used in any other\n\noperations.\n\n**Was the malware limited to only workstations or did it have additional capabilities, such as**\n\n**a mobile malware component?**\n\nSeveral mobile modules exist, which are designed to steal data from several types of devices:\n\nWindows Mobile\n\niPhone\n\nNokia\n\nThese modules are installed in the system and wait for mobile devices to be connected to the victim's\n\nmachine. When a connection is detected, the modules start collecting data from the mobile phones.\n\n**How many variants, modules or malicious files were identified during the overall duration**\n\n**of Operation Red October?**\n\nDuring our investigation, we've uncovered over 1000 modules belonging to 30 different module\n\ncategories. These have been created between 2007 with the most recent being compiled on 8th Jan 2013.\n\nHere's a list of known modules and categories:\n\n\n-----\n\n**Were initial attacks launched at select \"high-profile\" victims or were they launched in**\n\n**series of larger (wave) attacks at organizations/victims?**\n\nAll the attacks are carefully tuned to the specifics of the victims. For instance, the initial documents are\n\ncustomized to make them more appealing and every single module is specifically compiled for the victim\n\n\n-----\n\nLater, there is a high degree of interaction between the attackers and the victim - the operation is driven\n\nby the kind of configuration the victim has, which type of documents the use, installed software, native\n\nlanguage and so on. Compared to Flame and Gauss, which are highly automated cyberespionage\n\ncampaigns, Rocra is a lot more \"personal\" and finely tuned for the victims.\n\n**Is Rocra related in any way to the Duqu, Flame and Gauss malware?**\n\nSimply put, we could not find any connections between Rocra and the Flame / Tilded platforms.\n\n**How does Operation Rocra compare to similar campaigns such as Aurora and Night**\n\n**Dragon? Any notable similarities or differences?**\n\nCompared to Aurora and Night Dragon, Rocra is a lot more sophisticated. During our investigation we've\n\nuncovered over 1000 unique files, belonging to about 30 different module categories. Generally speaking,\n\nthe Aurora and Night Dragon campaigns used relatively simple malware to steal confidential information.\n\nWith Rocra, the attackers managed to stay in the game for over 5 years and evade detection of most\n\nantivirus products while continuing to exfiltrate what must be hundreds of Terabytes by now.\n\n**How many Command & Control servers are there? Did Kaspersky Lab conduct any forensic**\n\n**analysis on them?**\n\nDuring our investigation, we uncovered more than 60 domain names used by the attackers to control and\n\nretrieve data from the victims. The domain names map to several dozen IPs located mostly in Russia and\n\nGermany.\n\nHere's an overview of the Rocra's command and control infrastructure, as we believe it looks from our\n\ninvestigations:\n\n\n-----\n\nMore detailed information about the Command and Control servers will be revealed at a later date.\n\n**Did you sinkhole any of the Command & Control servers?**\n\nWe were able to sinkhole six of the over 60 domains used by the various versions of the malware. During\n\nthe monitoring period (2 Nov 2012 - 10 Jan 2013), we registered over 55,000 connections to the sinkhole.\n\nThe number of different IPs connecting to the sinkhole was 250.\n\nFrom the point of view of country distribution of connections to the sinkhole, we have observed victims in\n\n39 countries, with most of IPs being from Switzerland. Kazakhstan and Greece follow next.\n\n\n-----\n\nSinkhole statistics - 2 Nov 2012 - 10 Jan 2013\n\n**Is Kaspersky Lab working with any governmental organizations, Computer Emergency**\n\n**Response Teams (CERTs), law enforcement agencies or security companies as part of the**\n\n**investigation and disinfection efforts?**\n\nKaspersky Lab, in collaboration with international organizations, Law Enforcement, Computer Emergency\n\nResponse Teams (CERTs) and other IT security companies is continuing its investigation of Operation\n\nRed October by providing technical expertise and resources for remediation and mitigation procedures.\n\nKaspersky Lab would like to express their thanks to: US-CERT, the Romanian CERT and the Belarusian\n\nCERT for their assistance with the investigation.\n\nIf you are a CERT and would like more information about infections in your country, please contact us at\n\ntheflame@kaspersky.com.\n\n**[Here's a link to the full paper (part 1) about our Red October research. During the next](http://www.securelist.com/en/analysis/204792262/Red_October_Diplomatic_Cyber_Attacks_Investigation)**\n\n**days, we'll be publishing Part 2, which contains a detailed technical analysis of all the**\n\n**known modules Please stay tuned**\n\n\n-----\n\n114ed0e5298149fc69f6e41566e3717a\n\n1f86299628bed519718478739b0e4b0c\n\n2672fbba23bf4f5e139b10cacc837e9f\n\n350c170870e42dce1715a188ca20d73b\n\n396d9e339c1fd2e787d885a688d5c646\n\n3ded9a0dd566215f04e05340ccf20e0c\n\n44e70bce66cdac5dc06d5c0d6780ba45\n\n4bfa449f1a351210d3c5b03ac2bd18b1\n\n4ce5fd18b1d3f551a098bb26d8347ffb\n\n4daa2e7d3ac1a5c6b81a92f4a9ac21f1\n\n50bd553568422cf547539dd1f49dd80d\n\n51edea56c1e83bcbc9f873168e2370af\n\n5d1121eac9021b5b01570fb58e7d4622\n\n5ecec03853616e13475ac20a0ef987b6\n\n5f9b7a70ca665a54f8879a6a16f6adde\n\n639760784b3e26c1fe619e5df7d0f674\n\n65d277af039004146061ff01bb757a8f\n\n6b23732895daaad4bd6eae1d0b0fef08\n\n731c68d2335e60107df2f5af18b9f4c9\n\n7e5d9b496306b558ba04e5a4c5638f9f\n\n82e518fb3a6749903c8dc17287cebbf8\n\n85baebed3d22fa63ce91ffafcd7cc991\n\n91ebc2b587a14ec914dd74f4cfb8dd0f\n\n93d0222c8c7b57d38931cfd712523c67\n\n9950a027191c4930909ca23608d464cc\n\n9b55887b3e0c7f1e41d1abdc32667a93\n\n9f470a4b0f9827d0d3ae463f44b227db\n\na7330ce1b0f89ac157e335da825b22c7\n\nb9238737d22a059ff8da903fbc69c352\n\nc78253aefcb35f94acc63585d7bfb176\n\nfc3c874bdaedf731439bbe28fc2e6bbe\n\nbb2f6240402f765a9d0d650b79cd2560\n\nbd05475a538c996cd6cafe72f3a98fae\n\nc42627a677e0a6244b84aa977fbea15d\n\ncb51ef3e541e060f0c56ac10adef37c3\n\n\n-----\n\ncee7bd726bc57e601c85203c5767293c\n\nd71a9d26d4bb3b0ed189c79cd24d179a\n\nd98378db4016404ac558f9733e906b2b\n\ndc4a977eaa2b62ad7785b46b40c61281\n\ndc8f0d4ecda437c3f870cd17d010a3f6\n\nde56229f497bf51274280ef84277ea54\n\nec98640c401e296a76ab7f213164ef8c\n\nf0357f969fbaf798095b43c9e7a0cfa7\n\nf16785fc3650490604ab635303e61de2\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/ymcjx37fp0zyyjybcl80czcrpzctjfp9",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.01.14.Red_October_Campaign/Securelist_RedOctober.pdf"
    ],
    "report_names": [
        "Securelist_RedOctober"
    ],
    "threat_actors": [
        {
            "id": "ea844ee6-eb12-42c0-8426-11395fe81e6f",
            "created_at": "2022-10-25T15:50:23.300796Z",
            "updated_at": "2025-03-27T02:00:55.434471Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "Night Dragon"
            ],
            "source_name": "MITRE:Night Dragon",
            "tools": [
                "at",
                "gsecdump",
                "zwShell",
                "PsExec",
                "ASPXSpy",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "02c9f3f6-5d10-456b-9e63-750286048149",
            "created_at": "2022-10-25T16:07:23.722884Z",
            "updated_at": "2025-03-27T02:02:09.945869Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK 116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "Inception Framework",
                "Operation Cloud Atlas",
                "Operation RedOctober",
                "The Rocra"
            ],
            "source_name": "ETDA:Inception Framework",
            "tools": [
                "Lastacloud",
                "PowerShower",
                "VBShower"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "09a8f8fe-e907-47b4-8709-a97717dde3cc",
            "created_at": "2022-10-25T16:07:23.90252Z",
            "updated_at": "2025-03-27T02:02:10.020919Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [],
            "source_name": "ETDA:Night Dragon",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Cain & Abel",
                "gsecdump",
                "zwShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "020794ec-7315-47de-818c-2032c362fd15",
            "created_at": "2023-01-06T13:46:38.306576Z",
            "updated_at": "2025-03-27T02:00:02.800515Z",
            "deleted_at": null,
            "main_name": "Night Dragon",
            "aliases": [
                "G0014"
            ],
            "source_name": "MISPGALAXY:Night Dragon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1423420653,
    "ts_modification_date": 1423420653,
    "files": {
        "pdf": "https://archive.orkl.eu/b64a571a29d1c2cfc40b6b6cef50a95e6ce3b455.pdf",
        "text": "https://archive.orkl.eu/b64a571a29d1c2cfc40b6b6cef50a95e6ce3b455.txt",
        "img": "https://archive.orkl.eu/b64a571a29d1c2cfc40b6b6cef50a95e6ce3b455.jpg"
    }
}