{
    "id": "d9de9d42-a4ca-4dfa-b906-c0c259c496f4",
    "created_at": "2023-01-12T15:06:30.769675Z",
    "updated_at": "2025-03-27T02:06:09.34955Z",
    "deleted_at": null,
    "sha1_hash": "ac5c479e20aba9e27dbfbc0398e04db1346ddb32",
    "title": "2021-02-03 - Dissecting a RAT. Analysis of DroidJack v4.4 RAT network traffic.",
    "authors": "",
    "file_creation_date": "2022-05-27T21:07:23Z",
    "file_modification_date": "2022-05-27T21:07:23Z",
    "file_size": 2349215,
    "plain_text": "# Dissecting a RAT. Analysis of DroidJack v4.4 RAT network traffic.\n\n**[stratosphereips.org/blog/2021/1/22/analysis-of-droidjack-v44-rat-network-traffic](https://www.stratosphereips.org/blog/2021/1/22/analysis-of-droidjack-v44-rat-network-traffic)**\n\nKamila Babayeva February 3, 2021\n\n**_This blog post was authored by Kamila Babayeva (@_kamifai_) and Sebastian Garcia_**\n**_(@eldracote)._**\n\n_The RAT analysis research is part of the Civilsphere Project_\n_[(https://www.civilsphereproject.org/), which aims to protect the civil society at risk by](https://www.civilsphereproject.org/)_\n_understanding how the attacks work and how we can stop them. Check the webpage for_\n_more information._\n\nThis is the second blog of a series analyzing the network traffic of Android RATs from our\n[Android Mischief Dataset [more information here], a dataset of network traffic from Android](https://www.stratosphereips.org/android-mischief-dataset)\nphones infected with Remote Access Trojans (RAT). In this blog post we provide the\n[analysis of the network traffic of the RAT02-DroidJack v4.4 [download here].](https://mcfp.felk.cvut.cz/publicDatasets/Android-Mischief-Dataset/AndroidMischiefDataset_v1/DroidJack.zip)\n\n## RAT Details and Execution Setup\n\nThe goal of each of our RAT experiments is to use the software ourselves and to execute\nevery possible action while capturing all the traffic and storing all the logs. So these RAT\ncaptures are functional and were used in real attacks.\n\nThe DroidJack v.4.4 RAT is a software package that contains the controller software and\nbuilder software to build an APK. It was executed on a Windows 7 virtual machine with\nUbuntu 20.04 as a host. The Android Application Package (APK) built by the RAT builder\nwas installed in the Android virtual emulator called Genymotion with Android version 8.\n\nWhile performing different actions on the RAT controller (e.g. upload a file, get GPS\nlocation, monitor files, etc.), we captured the network traffic on the Android virtual emulator.\n\nThe details about the network traffic capture are:\n\nThe controller IP address: 147.32.83.253\n\nThe phone IP address: 10.8.0.57\n\nUTC time of the infection in the capture: 2020-08-01 14:10:43 UTС\n\n\n-----\n\n## Initial Communication and Infection\n\nOnce the APK was installed in the phone, it directly tries to establish a TCP connection with\nthe command and control (C&C) server. To connect, the phone uses the IP address and the\nport of the controller specified in the APK. In our case, the IP address of the controller is\n147.32.83.253 and the port is 1337/TCP. Also, DroidJack uses the port 1334/TCP as a\ndefault port and the phone connects to it later too. The controller IP 147.32.83.253 is the IP\naddress of Windows 7 virtual machine in our lab computer, meaning that the IP address is\nnot connected to any indicator of compromise (IoC).\n\n**_Figure 1. A 3-way handshake started by the phone to establish TCP connection with the_**\nC&C controller.\n\nIn Figure 1 we can see that the connection was established, but the C&C server was\nresetting it several times. After a while a successful 3-way handshake was performed and\nthe connection was established, the C&C sends the next packet with following data:\n\n**_Figure 2. Data sent by the C&C after establishing the first TCP connection with the phone._**\n\nThe phone replies with some initialization parameters such as its phone model, Android\nversion, and other parameters in plain text.\n\n**_Figure 3. Data sent by the phone with initialization parameters._**\n\n## Communication over 1337/TCP\n\nAfter establishing the communication over port 1337/TCP, there is a sequence of three\nNULL (00) bytes in the data of both packets, as shown in Figure 2 and Figure 3. This\nsequence is followed by the hexadecimal number 0x3C, which represents the packet\n**length in its decimal form, and after that the phone sends the delimiter byte 0x03. The**\namount for the packet length does not include bytes for the NULL sequence and the byte\nfor the packet length. The following is an example of the bytes in hexadecimal as seen from\nthe packet sent by the phone in the Figure 3:\n\n\n-----\n\n**_Figure 4. Bytes sent from the phone to the C&C controller in one packet, including how we_**\nfound the format.\n\nIn Figure 4, the actual length of the packet is 64. The byte 0x3C is 60 in a decimal format,\nwhich is exactly the length of the packet without the byte for packet length 0x3C (1 byte)\nand the sequence of NULL characters (3 bytes).\n\nIn the small packets of length 1 or 2, like in Figure 2 or in the heartbeat in Figure 6, there\nare no delimiters. Thus only packets with data of more than 2 bytes sent from the C&C and\nthe phone over 1337/TCP has the following format:\n```\n{00 00 00}{data length}{delimiter}{data in plain text}\n\n```\n**_Figure 5. The format of packets sent from the C&C and the phone as part of the custom_**\nprotocol used by the RAT.\n\nAfter sending phone parameters, the phone is waiting for the command from the controller.\nWhile waiting for the command, the phone and the C&C maintain a heartbeat, which in this\ncase is a couple of packets in both directions inside the same connection. They exchange\npackets every 8 seconds.\n\n**_Figure 6. The heartbeat between the C&C and the phone._**\n\nAfter some time, when it is requested by the botmaster, the C&C server sends a packet with\nthe command to the phone. The command is ‘File Voyager’, which aims to search through\nthe file system of the phone. In the C&C software, the command ‘File Voyager ’ looks like\nthis:\n\n\n-----\n\n**_Figure 7. The command ‘File Voyager’ in DroidJack v4.4 C&C software._**\n\nFigure 8 shows an example of this order “File Voyager”, that is sent unencrypted.\n\n**_Figure 8. Command ‘File Voyager’ sent from the C&C after the heartbeat._**\n\nThe commands from the C&C server to the phone seem to be predefined with a specific\nnumber. From Figure 8, number 20 might define the command ‘File Voyager’ and it is\nfollowed by some extra parameters (false#/~#0194074 5667#.). The character ‘#’ might be\na separator between parameters. As a reply to the C&C command, the phone sends back:\n\n**Figure 9. The phone’s reply on the command ‘File Voyager’ sent by the C&C.**\n\n## Communication over 1334/TCP\n\nThe reply of the phone to the C&C in Figure 9 is an acknowledgement for the received\ncommand. The actual phone reply with data is sent in a different connection. For each new\ncommand received from the C&C, the phone establishes a new TCP connection over port\n1334/TCP, sends the data and closes the connection. Figure 10 shows a new connection\nover 1334/TCP to reply on the command in Figure 8.\n\n\n-----\n\n**Figure 10. The phone replies to the command sent by the C&C in port 1337/TCP (shown in**\nFigure 8) with data over another connection on port 1334/TCP.\n\nThe packets in the connection 1334/TCP do not have any format as in Figure 5, the data is\nsent in the plain text:\n\n**_Figure 11. Packet sent from the phone to the controller over 1334/TCP._**\n\n## Communication over 1337/UDP\n\nEven though there is a heartbeat over port 1337/TCP, the phone sends UDP packets to the\nС&C over port 1337 every 20 seconds.\n\n**Figure 12. UDP packets from the phone to the C&C server sent every 20 seconds over port**\n1337/UDP.\n\n\n-----\n\nThe data inside UDP packets is in the plain text:\n\n**Figure 13. Example data inside the UDP packets on port 1337/UDP sent from the phone to**\nthe controller.\n\n## Long Connections\n\nIf we open the Conversations -> statistics -> TCP menu in Wireshark, as shown in Figure\n14, a lot of connections between the phone and the controller are over port 1334/TCP (new\nC&C - new connection) and only a few are over 1337/TCP. The connections over 1337/TCP\nare usually long, e.g. 1548.2056 seconds (approximately 40 minutes) or 1413.3981\nseconds (approximately 31 minutes). This indicates that the connections between the\nphone and the controller are kept for long periods of time in order to answer fast.\n\n\n-----\n\n**_Figure 14. Top connections between the phone and the controller from Wireshark ->_**\nStatistics -> Conversations -> TCP. It can be noted the long duration of the main\nconnections.\n\n## Detecting C&C using Slips\n\nSlips is a Python Intrusion Detection and Prevention system that uses machine learning to\ndetect malicious behaviours in the network traffic of the devices. Slips is an open-source\n[tool and can be installed from here.](https://www.stratosphereips.org/download)\n\nAfter Slips is run on the DroidJack v4.4 packet capture, Slips creates a profile per each IP\nthat appeared in the traffic. Each profile contains flows sent from this IP. Each flow is\n[described with a specific letter which description can be found here. Considering that, Slips](https://www.stratosphereips.org/stratosphere-testing-framework)\n\n\n-----\n\ndetects the C&C channel over 1334/TCP. The behavioral model of the connection between\nthe phone and C&C is in Figure 15, and Slips’ machine learning module called LSTM\ndetecting C&C channel is shown in Figure 16.\n\n**Figure 15. Behavioral model of the connection between the phone and C&C over**\n1334/TCP.\n\n**Figure 16. Alert from slips that it detects a C&C channel over port 1334/TCP using a**\nmachine learning LSTM neural network. The LSTM uses the letters shown in Figure 15.\n\nSlips did not detect periodic connection over 1337/UDP because the LSTM module focuses\non TCP. But from the behavioral model of the connections over 1337/UDP shown in Figure\n17, we can conclude that the model is periodic and most of connections are of a small size.\n\n**Figure 17. Behavioral model created by Slips for the connection between phone and C&C**\nover 1337/UDP.\n\n## Conclusion\n\nIn this blog, we have analyzed the network traffic from a phone infected with DroidJack v4.4\nRAT. We were able to decode its connection and found the distinctive features as long\nduration or heartbeat. The DroidJack v4.4 RAT does not seem to be complex in its\ncommunication protocol and it is not sophisticated in its work.\n\nTo summarize, the details found in the network traffic of this RAT are:\n\nThe phone connects directly to the IP address and ports specified in APK (default port\nand custom port).\n\n\n-----\n\nSome connections over port 1337/TCP between the phone and the controller are\nlong, i.e. more than 30 minutes.\n\nThere is a heartbeat between the controller and the phone over 1337/TCP.\n\nPackets sent from the phone and the C&C over port 1337/TCP have a form of {00 00\n**00}{data length}{delimiter}{data in plain text}.**\n\nA new connection over 1334/TCP is established when a new command is received\nfrom the C&C.\n\nThe phone sends UDP packets to the C&C every 20 seconds.\n\nPackets sent from the phone to the C&C over 1334/TCP and 1337/UDP are in plain\ntext.\n\n## Biographies\n\nKamila Babayeva\n\nKamila Babayeva is a 20 years old and third-year bachelor student in the Computer\nScience and Electrical Engineering program at the Czech Technical University in Prague.\nShe is a researcher in the Civilsphere project, a project dedicated to protecting civil\norganizations and individuals from targeted attacks. Her research focuses on helping\npeople and protecting their digital rights by developing free software based on machine\nlearning. Initially, she worked as a junior Malware Reverser. Currently, Kamila leads the\ndevelopment of the Stratosphere Linux Intrusion Prevent System (Slips), which is used to\nprotect the civil society in the Civilsphere lab.\n\n\n-----\n\nSebastian Garcia\n\nSebastian Garcia is a malware researcher and security teacher with experience in applied\nmachine learning on network traffic. He founded the Stratosphere Lab, aiming to do\nimpactful security research to help others using machine learning. He believes that free\nsoftware and machine learning tools can help better protect users from abuse of our digital\nrights. He researches on machine learning for security, honeypots, malware traffic\ndetection, social networks security detection, distributed scanning (dnmap), keystroke\ndynamics, fake news, Bluetooth analysis, privacy protection, intruder detection, and\nmicrophone detection with SDR (Salamandra). He co-founded the MatesLab hackspace in\nArgentina and co-founded the Independent Fund for Women in Tech. @eldracote.\nhttps://www.researchgate.net/profile/Sebastian Garcia6\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-03 - Dissecting a RAT. Analysis of DroidJack v4.4 RAT network traffic..pdf"
    ],
    "report_names": [
        "2021-02-03 - Dissecting a RAT. Analysis of DroidJack v4.4 RAT network traffic..pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535990,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653685643,
    "ts_modification_date": 1653685643,
    "files": {
        "pdf": "https://archive.orkl.eu/ac5c479e20aba9e27dbfbc0398e04db1346ddb32.pdf",
        "text": "https://archive.orkl.eu/ac5c479e20aba9e27dbfbc0398e04db1346ddb32.txt",
        "img": "https://archive.orkl.eu/ac5c479e20aba9e27dbfbc0398e04db1346ddb32.jpg"
    }
}