{
    "id": "da04cb54-33d2-4eaf-b9f1-0c71e4e1daa7",
    "created_at": "2023-01-12T15:10:21.619825Z",
    "updated_at": "2025-03-27T02:05:53.011553Z",
    "deleted_at": null,
    "sha1_hash": "1b9d09c49f42581f3c9b8e9bd2e9655358e304d4",
    "title": "2013-08-13 - Inside a ‘Reveton’ Ransomware Operation",
    "authors": "",
    "file_creation_date": "2022-05-28T04:09:09Z",
    "file_modification_date": "2022-05-28T04:09:09Z",
    "file_size": 476615,
    "plain_text": "# Inside a ‘Reveton’ Ransomware Operation\n\n**[krebsonsecurity.com/2012/08/inside-a-reveton-ransomware-operation/](https://krebsonsecurity.com/2012/08/inside-a-reveton-ransomware-operation/)**\n\nThe U.S Federal Bureau of Investigation is warning about an uptick in online extortion\nscams that impersonate the FBI and frighten people into paying fines to avoid prosecution for\nsupposedly downloading child pornography and pirated content. This post offers an inside\nlook at one malware gang responsible for orchestrating such scams.\n\nIn [an alert published last week, the FBI](http://www.fbi.gov/news/stories/2012/august/new-internet-scam/new-internet-scam?utm_campaign=email-Immediate&utm_medium=email&utm_source=fbi-top-stories&utm_content=129647)\nsaid that The Internet Crime Complaint\nCenter — a partnership between the\nFBI and the National White Collar\nCrime Center — was “getting\ninundated with complaints” from\nconsumers targeted or victimized by\nthe scam, which uses drive-by\ndownloads to hijack host machines.\nThe downloaded malware displays a\nthreatening message (see image to the\nright) and blocks the user from doing\nanything else unless he pays the fine\nor finds a way to remove the program.\n\nThe FBI alert said the attacks have\n\nReveton ransomware scam page impersonating the FBI\n\nsurged with the help of a “new drive-by\nvirus” called Reveton; in fact, Reveton\nand its ilk are hardly new. These types of attacks have been around for years, but\ntraditionally have targeted European users. The scam pages used in the attacks mimic\nofficial notices from various national police or investigatory agencies, corresponding to the\ncountry in which the victim resides. For a breakdown of these Reveton-related ransomware\nscam pages by country, see [this comprehensive gallery set up at botnets.fr.](https://www.botnets.fr/index.php/Reveton)\n\n[Reveton.A is blamed in these most recent attacks, and the FBI said it appears Reveton is](http://www.microsoft.com/security/portal/Threat/Encyclopedia/Entry.aspx?Name=Trojan:Win32/Reveton.A)\nbeing distributed in conjunction with Citadel, an offshoot of the ZeuS Trojan that I have\n[written](http://krebsonsecurity.com/2012/02/collaboration-feuls-rapdid-growth-of-citadel-trojan/) [about on several occasions. It is certainly possible that crooks are using Citadel to](http://krebsonsecurity.com/2012/01/citadel-trojan-touts-trouble-ticket-system/)\ndeploy Reveton, but as I’ll illustrate below, it seems more likely that the attackers in these\ncases are using exploit kits like BlackHole to plant both threats on victim PCs.\n\nINSIDE A REVETON MALWARE GANG\n\n\n-----\n\nOperations of one Reveton crime group. Source: ‘Kafeine,’ from botnets.fr.\n\nAt least that’s the behavior that’s been observed by a ragtag group of researchers that has\nbeen tracking Reveton activity for many months. Some of the researchers are associated\nwith botnets.fr, but they’ve asked to remain nameless because of the sensitivity of their work.\nOne of them, who goes by the screen name “Kafeine,” said much of the Reveton activity\n[traces back to a group that is controlling the operation using reverse proxies at dozens of](http://en.wikipedia.org/wiki/Reverse_proxy)\n[servers scattered across data centers globally (see this PDF for a more detailed look at the](http://krebsonsecurity.com/wp-content/uploads/2012/08/Reveton-Distribution-Scheme-1st-May-20111.pdf)\nimage above).\n\nKafeine said the groups involved in spreading Reveton are constantly fine-tuning all aspects\nof their operations, from the scam pages to solidifying their back-end hosting infrastructure.\nThe latest versions of Reveton, for example, serve the scam pages from an encrypted\n(https://) connection, and only cough up the pages when an infected machine visits and\nsends a special request.\n\nSome readers may have a hard time understanding how such schemes could be successful.\n[To those folks, I say consider the lucrative operations of the once-mighty](http://krebsonsecurity.com/2011/08/huge-decline-in-fake-av-following-credit-card-processing-shakeup/) [scareware](http://krebsonsecurity.com/2011/03/chronopays-scareware-diaries/) [industry,](http://krebsonsecurity.com/2011/08/fake-antivirus-industry-down-but-not-out/)\nwhich similarly hijacks infected machines with warnings about malware until the victim\nrelents and pays for some worthless and fake cleaner program.\n\nKafeine shared a couple of screen shots of two similar and recent ransomware scams (not\nReveton-related) targeting European users that shows just how successful these scams can\nbe. Both of these images were obtained when security researchers stumbled upon statistics\npages maintained by the criminal groups running the scheme.\n\nThe one on the right, for instance, shows that the attackers managed to get their malware\ninstalled on 2,116 PCs in France, and of those, only 3.7 percent — 79 victims — opted to\npay to rid their machines of the ransomware. But those 79 victims each paid $100, earning\nthe miscreants 7,800 Euros.\n\n\n-----\n\nThat s the haul from just one country; bear in\nmind that this stats page shows the total take\nfrom a single day (May 17, 2012). According to\nthese stats, at least 322 people from all\ncountries they ran the scam in opted to pay the\nransom that day, earning the attackers more\nthan €28,000 (~$34,500)! The next day (the\nscreen shot below left), the miscreants earned\n€43,750 (~$54,000).\n\n\nRansomware earnings on 5/17/2012\n\n\nUnlike scareware scams, ransomware schemes\ndo not rely on credit card payments from victims\n— a key pressure point for squashing affiliate\nprograms that help spread this crud. Most\nprevious ransomware schemes have used\n[alternative payment systems such as Ukash](http://ukash.com/)\n[and Paysafe. The Reveton attacks that spoof](http://paysafecard.com/)\n\nRansomware earnings 5/18/2012 the FBI instruct victims to pay their “fines” via\n\n[MoneyPak, which allows people who don’t have](http://moneypak.com/)\nbank accounts to send money and pay bills at participating businesses. MoneyPak cards are\navailable for purchase at Wal-Mart, CVS and other retailers, and can be reloaded with cash,\nand can be used to send money to PayPal accounts, prepaid credit cards, and to pay bills\nfor some cell phone companies and DirectTV.\n\nI mentioned earlier that most of these Reveton attacks that have been tracked so far used\nversions of the BlackHole exploit kit to deploy the malware. These are kits that are stitched\ninto hacked or malicious Web sites, so that all visiting browsers are checked for a variety of\ninsecure, outdated plugins, from Flash to Java to Adobe Reader. Browsers that are found\nvulnerable will be handed a Trojan downloader that fetches Reveton and most likely a copy\nof the password-stealing Citadel/ZeuS Trojan.\n\nKafeine and his fellow researchers recently gained access to one of the three main\nBlackHole exploit panels used by a Reveton malware gang. The screen shot below shows\nthe BlackHole administration page; in the upper left portion of the image, we get a sense of\nhow much traffic these crooks see on any given day. It shows that in just one day, the exploit\nkit was sent more than 187,000 potential victims, and that more than 11,000 of those were\nsuccessfully seeded with Reveton. The “exploits” stats in the upper right portion of the image\n[show that, once again, insecure and outdated installations of Java remain by far the most](http://krebsonsecurity.com/2012/07/new-java-exploit-to-debut-in-blackhole-exploit-kits/)\npopular vehicle for exploiting PCs.\n\n\n-----\n\nA recent screenshot of a BlackHole exploit kit panel used by a group spreading Reveton. Source:\n\nKafeine from botnets.fr\n\nA number of Web sites include instructions for removing the Reveton malware without having\nto pay the ransom (here’s [one example). But it’s important for readers to understand that if](http://www.f-secure.com/v-descs/trojan_w32_reveton.shtml)\nyou have been hit by a ransomware attack, the ransomware component is almost certainly\njust the most visible of the threats that reside on your system. For one thing, Kafeine said,\nthe latest Reveton versions will steal all passwords stored on the victim’s PC. What’s more,\nthe FBI’s report indicates Reveton is being bundled with Citadel, which is an extremely\npowerful and advanced family of malware that can be quite difficult to remove.\n\nAttacks such as Reveton illustrate the need to have a solid plan for backing up your data,\nbecause the surest way to clean a machine infected with the likes of Reveton is to\n[completely reinstall Windows (from the Master Boot Record on up). The most advanced](http://en.wikipedia.org/wiki/Master_boot_record)\nransomware threats (the subject of a future post) will steal your passwords and then encrypt\nall of your important files before demanding a ransom payment.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-08-13 - Inside a ‘Reveton’ Ransomware Operation.pdf"
    ],
    "report_names": [
        "2013-08-13 - Inside a ‘Reveton’ Ransomware Operation.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536221,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1653710949,
    "ts_modification_date": 1653710949,
    "files": {
        "pdf": "https://archive.orkl.eu/1b9d09c49f42581f3c9b8e9bd2e9655358e304d4.pdf",
        "text": "https://archive.orkl.eu/1b9d09c49f42581f3c9b8e9bd2e9655358e304d4.txt",
        "img": "https://archive.orkl.eu/1b9d09c49f42581f3c9b8e9bd2e9655358e304d4.jpg"
    }
}