{
    "id": "da074180-fdd3-4122-8389-28cc0707477a",
    "created_at": "2022-10-25T16:48:22.278358Z",
    "updated_at": "2025-03-27T02:17:14.382464Z",
    "deleted_at": null,
    "sha1_hash": "865d88a8d0c6bf1dff0accd241bc1f06a7f22616",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-03-14T15:35:12Z",
    "file_modification_date": "2020-03-14T15:35:12Z",
    "file_size": 1888096,
    "plain_text": "# Who's Hacking the Hackers: No Honor Among Thieves\n\n**[cybereason.com/blog/whos-hacking-the-hackers-no-honor-among-thieves](https://www.cybereason.com/blog/whos-hacking-the-hackers-no-honor-among-thieves?fbclid=IwAR1LgNlWoJ92T6Pqz1ne5zPYdFgxdqHA9SYcKAgh4xbsFtXeL5ztMFu6zH4)**\n\n**Research by: Amit Serper**\n\n## Introduction\n\nCybereason Nocturnus is investigating a campaign where attackers are trojanizing multiple\nhacking tools with njRat, a well known RAT. The campaign ultimately gives attackers total access\nto the target machine. The threat actors behind this campaign are posting malware embedded\ninside various hacking tools and cracks for those tools on several websites. Once the files are\ndownloaded and opened, the attackers are able to completely take over the victim’s machine. In\nthis write-up we present our analysis of the TTPs of the attackers and the indicators of\ncompromise. In the investigation of this campaign, we have found hundreds of trojanized files and\na lot of information about the threat actors infrastructure.\n\n**_Learn more about what trends we expect to see this year in our 2020 security predictions_**\n**_report._**\n\n## Key Points\n\n**Widespread Campaign: We have found a widespread hacking campaign that uses the**\nnjRat trojan to hijack the victim’s machine, giving the threat actors complete access that\ncan be used for anything from conducting DDoS attacks to stealing sensitive data.\n**Baiting Hackers: The malware is spreading by turning various hacking tools and other**\ninstallers into trojans. The threat actors are posting the maliciously modified files on various\nforums and websites to bait other hackers.\n**Using Vulnerable WordPress Websites: The threat actors are hacking vulnerable**\nWordPress installations to host their malicious njRat payloads.\n**A “Malware Factory”: It seems as if the threat actors behind this campaign are building**\nnew iterations of their hacking tools on a daily basis.\n\n## table of contents\n\n Malware analysis\n\nWhile reviewing some detection data last week, we stumbled on a new detection of [njRat in one](https://en.wikipedia.org/wiki/Njrat)\nof the environments we are monitoring. njRat is popular in the Middle East and gives its operators\nthe ability to hijack the victim’s machine for keylogging, taking screenshots, file manipulation and\nexfiltration, webcam and microphone recording.\n\nWhile njRat is [a fairly prevalent threat and popular RAT, this particular infection caught our eye.](https://www.zdnet.com/article/njrat-secures-top-spot-as-most-active-malware-on-networks-in-2017/)\n\n\n-----\n\n_Initial detection of the njRat in the Cybereason Defense Platform._\n\nThe process appears to be masquerading as a legitimate Windows application (explorer.exe).\nHowever, when checking its hash on VirusTotal, the sample seems to be very new, just a few\nhours old at the time. In the affected environment, it looks as if the njRat is contacting two IP\naddresses: one of them was unknown to us at the time (capeturk.com - more on that later) and\nthe other, (anandpen.com) a compromised website of an Indian office supplies manufacturer.\n\n#### Hostname IP\n\n capeturk.com 104.206.239.81\n\n www.anandpen.com 209.99.16.94\n\n_IP addresses and hostnames contacted by the malware._\n\n|Hostname|IP|\n|---|---|\n|capeturk.com|104.206.239.81|\n|www.anandpen.com|209.99.16.94|\n\n\n-----\n\nanandpen.com is a hacked WordPress website that serves malware from one of its internal\nWordPress directories. This is a common practice by attackers who are exploiting vulnerable\nWordPress installations. In this case, one of the payloads was served through the /wp_includes/images/media/1/explorer.zip path on the anandpen.com domain._\n\nAfter running a few YARA queries and searching for all of the samples on VT associated with the\ntwo aforementioned IP addresses, we found dozens of different samples of the same njRat\nhosted on the same server. Each sample had a different creation time, but they were all hosted\non the same server and actively targeting victims.\n\nAs mentioned before, all of the observed samples (including the detection on one of the\nenvironments we are monitoring) had the name of a legitimate Windows process, like svchost.exe\nor explorer.exe, yet all of them were executed from subdirectories inside %AppData%. Clearly,\nsome mischief was taking place, but the root cause for these executions was unknown since the\nfiles were dropped in the environment prior to the deployment of our product.\n\n## Finding the Root Cause\n\nWhen investigating the Malop, it’s clear the malicious explorer.exe process is communicating with\nthe hostname 7777.elitfilmizle[.]com.\n\n\n-----\n\nThe information fields in the unsigned PE file have an interesting peculiarity to them:\n\n_Highlighted are the company name and product name of the file, as seen in the Cybereason_\n_Defense Platform._\n\n_Further inspection of the file version information reveals more mismatches:_\n\n_Additional information about file hash d5f53d26615772ff3ca84d88604f2ddf._\n\n\n-----\n\nFor comparison, here’s the product information field for a legitimate signed _explorer.exe from a_\nWindows 10 Pro build 1903:\n\nLegitimate explorer.exe hash: 4E196CEA0C9C46A7D656C67E52E8C7C7.\n\nWhile the file name is explorer.exe, the company name is “Intel Corporation” and the product\nname is “Intel(R) Common Users Interface”, which certainly doesn’t make much sense.\n\nSome more hints (notice the date) are in the PDB path for said file:\n\nThere are a few interesting details in this PDB path:\n\n1. “03-02-2020” - this date implies there are multiple different variants of the same project\n\n(past/future versions.Upon further investigation, I found many of these variants.\n2. “TripleDES-Rijn-GZIPP” - this refers to methods the loader of the malware uses to\n\nmasquerade it’s true purpose (more on that later)\n\nWhen examining explorer.exe, it’s clear that it is actually a .NET PE executable:\n\nUpon closer inspection, this file was originally written in Visual Basic, which is typical for njRat\nloaders:\n\n\n-----\n\nSome of the crypter functionality is available once the executable is decompiled (note that the\ndecomplication is to C# for legibility):\n\nThe three red arrows in the screenshot are directly related to the string I mentioned before, which\nappeared in the PDB (“TripleDES-Rijn-GZIPP”). The arrows point to the method of encryption and\n[compression (one can say obfuscation) of the file: TripleDES followed by AES (Rijndael) and then](https://en.wikipedia.org/wiki/Triple_DES)\nGZIP compression. The blue arrows point to the key used for both the TripleDES and AES\nencryption, which is “abc123456”.\n\nOnce the loader unpacks the payload, it deletes the original loader file and continues to run its\ncourse. The malware will create a new directory, %USER%\\AppData\\Roaming\\Intel\n_Corporation\\Intel(R) Common User Interface\\8.1.1.7800\\ and use it as a staging directory. The_\nnjRat loader continues to drop files into that staging directory, eventually dropping the main njRat\npayload with a random name. The malware changes the random file name to explorer.exe, copies\nit to %AppData%\\roaming, and executes it from there. After it executes, the fake explorer.exe (the\nnjRat payload) runs a netsh command to communicate to the outside world. It alters the\nWindows Firewall with the following command:\n\n\n-----\n\n#### netsh firewall add allowedprogram 'C:\\Users\\user\\AppData\\Roaming\\explorer.exe' 'explorer.exe'\n\nnjRat contacts several servers to receive commands and files from its operators:\n\nCapeturk.com - a repository for a newer version of njRat used in this campaign\nBlog.capeturk.com - the C2 for njRat\nAnandpen.com - the repository for various njRat versions and other tools used by the\nattackers\n\n**Note: anandpen.com was hacked by the attackers. It is a WordPress-powered website of a**\n**pen manufacturing company from India. We have reached out to the company and**\n**informed them about the incident, but we have yet to receive a response.**\n\n## Threat Intel\n\nNow that we understand how this njRat campaign operates and which servers it’s connecting to,\nthere is one question that remains: how do people get infected?\n\nAfter examining the environment, it’s clear there were many hacking and penetration tools\ndeployed in various paths on the target machine. By examining the hashes on the network, we\ncould see that all of the hacking tools had various cracks deployed alongside them. Both the tools\nand the cracks were all infected with this njRat campaign.\n\nBy correlating the identified servers with the hashes found on VT using VTGraph, we can see\nthere are plenty of samples related to this campaign:\n\n\n-----\n\n_VTGraph correlating between samples and servers._\n\nAt this point, we know there is a campaign targeting hackers by trojanizing various hacking tools.\nThe one question that remains is, “where are all of these trojanized tools coming from?”\n\nOne of the files on the system was a keygen for an SQLi Dumper. SQLi Dumper is a tool used to\n[perform all kinds of SQL injections and data dumps.](https://en.wikipedia.org/wiki/SQL_injection)\n\n\n-----\n\n_One of the infected keygens for the program SQLi dumper v8.2._\n\nAs we can see in the screenshot below, the keygen is credited to [RTN]. RTN is a group that\nwrites cracks to various programs. They have a website and a forum:\n\n_Screenshot from RTN’s website._\n\n**Important note: RTN’s forum was inaccessible as of writing this report - we cannot determine if**\nthe trojanized files have anything to do with the original creators of the keygens made by RTN.\nHowever, the mediafire file hosting website contains the trojanized file and many other cracked\nversions of tools:\n\n\n-----\n\n_Trojanized files in MediaFire file share._\n\n[When looking for the page that leads to this file share, a blog hosted on Blogspot was found](http://sharetools99.blogspot.com/)\nwhich offers many cracked hacking and the aforementioned trojanized tools, linking to the above\nmentioned MediaFire file share:\n\n\n-----\n\nAs mentioned above, this campaign appears to have been going on for several years. So far, we\nhave found samples that are either pretending to be various hacking tools or pretending to be\ninstallers of the Chrome Internet browser. There are around 700 samples associated with the\n*.capeturk.com subdomain, and there are more samples added to various threat intelligence\nresources on a daily basis.\n\n## PDB Artifacts\n\nAs described in the malware analysis section of this writeup, it appears that the PDB path\nembedded in the malware samples contains valuable information on how the malware is packed,\nas can be seen in the following examples. Each example is taken from a different sample:\n\n1. C:\\Users\\pc\\Desktop\\25-8-2019\\3 lop-GZip+poly Xor base64\\GZip+poly Xor base64\n\nbuilder\\WindowsApplication2\\obj\\Release\\WindowsApplication2.pdb\n2. C:\\Users\\pc\\Downloads\\Gen code PolyRSM RC4 Poly AES Gzip Builder 21-09\n2018\\PolyRSM RC4 Poly AES Gzip 26-07-2018\\PolyRSM +RC4+ Poly AES +Gzip Builder\n07-01-2015\\obj\\x86\\Release\\explorer.pdb\n3. C:\\Users\\pc\\Desktop\\xxxxx\\ALL PolyRSM +RC4+ Poly AES +Gzip StrReverse 11-01\n2019\\PolyRSM +RC4+ Poly AES +Gzip Builder StrReverse 11-012019\\obj\\x86\\Release\\explorer.pdb\n4. C:\\Users\\pc\\Desktop\\03-02-2020\\ZIP RC2\n\nRC4\\decode\\WindowsApplication6\\obj\\Release\\explorer.pdb\n5. C:\\Users\\pc\\Desktop\\03-02-2020\\NEW 3DES ZIP 29-01\n2020\\decode\\WindowsApplication6\\obj\\Release\\taskhost.pdb\n\n\n-----\n\nThese are just four examples out of hundreds of files. It’s worth noting that each example has\ndifferent dates. Some are very recent, while others are from a few years ago. This suggests that\ncompilation of these malicious files is automated.\n\n## The Domain\n\nUntil June 2018, it seems capeturk.com was a Turkish gaming website dedicated to the well[known game Minecraft. On November 25 2018, the capeturk.com domain expired and was](https://en.wikipedia.org/wiki/Minecraft)\nregistered by a Vietnamese individual. The domain started to be associated with malware around\nthe time of the re-registration, however, it is unclear whether this Vietnamese individual has any\nties to the malware campaign. That being said, it seems someone from Vietnam is constantly\ntesting the samples by submitting them to VirusTotal. We suspect this individual is tied to the\nVietnamese domain ownership:\n\n_VirusTotal submissions page from one of the samples._\n\n**Important note: According to the highlighted path from the submission information and**\n**the win7x64 username in the path, this is some sort of test machine. Additionally, this**\n**sample was submitted from Vietnam.**\n\n## Multiple campaigns and targets?\n\nAfter examining different samples submitted to different subdomains of capeturk.com (as detailed\nin the IOCs section of this writeup) it appears that each subdomain is targeting different software\nand therefore a different set of victims. While all of the samples associated with\n_blog.capeturk.com are targeting various penetration testing and hacking tools, other subdomains_\nare targeting Chrome installers, native Windows applications, and other random programs that\nhave nothing to do with hacking or penetration testing.\n\nFor example, this sample which is connecting to 6666.elitfilmizle.com, is another njRat payload\npretending to be an NVIDIA service:\n\n\n-----\n\nAnother important behavior to note is that the numbers in the subdomain (6666, 7777, etc)\ncorrespond to the port on which the C2 server is running on the host. For example,\n6666.elitfilmizle.com has port 6666 listening on it, 7777.elitfilmizle.com has port 7777, and so on.\n\n## Conclusion\n\nThis investigation surfaced almost 1000 njRat samples compiled and built on almost a daily basis.\nIt is safe to assume that many individuals have been infected by this campaign (although at the\nmoment we are unable to know exactly how many). This campaign ultimately gives threat actors\ncomplete access to the target machine, so they can use it for anything from conducting DDoS\nattacks to stealing sensitive data off the machine.\n\nIt is clear the threat actors behind this campaign are using multiple servers, some of which appear\nto be hacked WordPress blogs. Others appear to be the infrastructure owned by the threat group,\njudging by multiple hostnames, DNS data, etc.\n\nAt the moment, we are unable to ascertain the other victims this malware campaign is targeting,\nother than those targeted by the trojanized hacking tools connecting to the “7777 server”. We will\ncontinue to monitor this campaign for any further developments.\n\n**_Check out how we use MITRE ATT&CK to identify and categorize threats like Operation_**\n**_Soft Cell in our webinar with the MITRE ATT&CK team._**\n\n### Indicators of Compromise\n\n[Click here to download this campaign's IOCs (PDF)](https://www.cybereason.com/hubfs/njRat%20IOCs.pdf)\n\n## MITRE ATT&CK BREAKDOWN\n\n|Execu‐ tion|Persis‐ tence|Privi‐ lege Escala‐ tion|De‐ fense Evasion|Discov‐ ery|Lat‐ eral Move ment|Col‐ lection|Exfiltra‐ tion|Com‐ mand and Control|\n|---|---|---|---|---|---|---|---|---|\n\n\n-----\n\n|Win‐ dows Man‐ age‐ ment Instru‐ menta‐ tion|Reg‐ istry Run Keys / Startup Folder|Access Token Manipu‐ lation|Web Service|Security Soft‐ ware Discov‐ ery|Re‐ mote File Copy|Clip‐ board Data|Data En‐ crypted|Web Service|\n|---|---|---|---|---|---|---|---|---|\n|Graph‐ ical User Inter‐ face|Modify Exist‐ ing Ser‐ vice|Process Injec‐ tion|Soft‐ ware Packing|File and Directo‐ ry Discov‐ ery||||Uncom‐ monly Used Port|\n||||Dis‐ abling Securi‐ ty Tools|System Infor‐ mation Discov‐ ery||||Remote File Copy|\n||||Deob‐ fuscate/ Decode Files or Infor‐ mation|Query Reg‐ istry||||Stan‐ dard Crypto‐ graphic Proto‐ col|\n||||Obfus‐ cated Files or Infor‐ mation|Virtual‐ ization/ Sand‐ box Evasion||||Stan‐ dard Non- Applica‐ tion Layer Proto‐ col|\n||||Mas‐ querad‐ ing|Process Discov‐ ery|||||\n||||Modify Reg‐ istry|Applica‐ tion Window Discov‐ ery|||||\n\n\n-----\n\n|Col1|Col2|Col3|Virtual‐ ization/ Sand‐ box Evasion|Remote System Discov‐ ery|Col6|Col7|Col8|Col9|\n|---|---|---|---|---|---|---|---|---|\n||||Access Token Manip‐ ulation||||||\n\n\n[Click here to view the njRat Threat Alert or browse our existing threat alerts below.](https://www.cybereason.com/hacking-the-hackers)\n\n[Threat Alerts »](https://www.cybereason.com/cs/c/?cta_guid=52ab9dcb-8dc3-4881-a97b-0a7ee3d104b3&placement_guid=70f9a980-80be-4f89-917e-ebae854158e5&portal_id=3354902&canon=https%3A%2F%2Fwww.cybereason.com%2Fblog%2Fwhos-hacking-the-hackers-no-honor-among-thieves&redirect_url=APefjpGwqDKK1Bx3DNf5LfsCyUOn3wrPKtyyzdlqEmUxHlCODz8C9bz0Z-FqjMOROkNP2G5PPbFwV6U5yJCpkmjvpBNemV9HFBTI5dnClMRt49QAiJ2pSMwtU1poRi8dPXoBirFlFU_jCKNPbLHKQLUkAJ7McdK6mxgUgxBPqtphDhuKrGK3cfKOPkBfvz2BJuwJW31TI2hV2PQeeOOMvvY95CDAv0MgXcou3RqSiGMhMZeyTuMDJT4s7_Vc--zPyBAta6aiC21n&click=a66be798-3432-48e6-94f2-4b7ae4d1273d&hsutk=d068c1bd28dc3e06e5d5b0e641659d4c&signature=AAH58kHsJBSLEahjB2oS9uJ7OGEWwrdZrw&utm_referrer=https%3A%2F%2Fl.facebook.com%2F&pageId=26685300345&__hstc=85683782.d068c1bd28dc3e06e5d5b0e641659d4c.1582038099792.1582038099792.1584168423012.2&__hssc=85683782.1.1584168423012&__hsfp=4029181480&contentType=blog-post)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.03.10.WHO_HACKING_THE_HACKERS/Who%27s%20Hacking%20the%20Hackers_%20No%20Honor%20Among%20Thieves.pdf"
    ],
    "report_names": [
        "Who's Hacking the Hackers_ No Honor Among Thieves"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3b8b4ed7-e8cc-4a3a-b14d-c8ebf87c0f9c",
            "created_at": "2023-01-06T13:46:39.062729Z",
            "updated_at": "2025-03-27T02:00:02.988182Z",
            "deleted_at": null,
            "main_name": "Operation Soft Cell",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Soft Cell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2025-03-27T02:00:55.414817Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1584200112,
    "ts_modification_date": 1584200112,
    "files": {
        "pdf": "https://archive.orkl.eu/865d88a8d0c6bf1dff0accd241bc1f06a7f22616.pdf",
        "text": "https://archive.orkl.eu/865d88a8d0c6bf1dff0accd241bc1f06a7f22616.txt",
        "img": "https://archive.orkl.eu/865d88a8d0c6bf1dff0accd241bc1f06a7f22616.jpg"
    }
}