{
    "id": "da0f202f-84b9-4bd4-8c6c-7c59f3d39b9a",
    "created_at": "2022-10-25T16:48:15.054761Z",
    "updated_at": "2025-03-27T02:16:39.726914Z",
    "deleted_at": null,
    "sha1_hash": "98fe112857885dc84909b66d652305b9ff09952d",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-10-21T16:09:40Z",
    "file_modification_date": "2021-10-21T16:09:40Z",
    "file_size": 2638098,
    "plain_text": "Search\n\n\n# LightBasin: A Roaming Threat to Telecommunications Companies\n\nOctober 19, 2021 [Jamie Harries and Dan Mayer](https://www.crowdstrike.com/blog/author/jamie-harries-and-dan-mayer/) [From The Front Lines](https://www.crowdstrike.com/blog/category/from-the-front-lines/)\n\nLightBasin (aka UNC1945) is an activity cluster that has been\n\nconsistently targeting the telecommunications sector at a global scale\n\nsince at least 2016, leveraging custom tools and an in-depth knowledge\n\nof telecommunications network architectures.\n\nRecent findings highlight this cluster’s extensive knowledge of\n\ntelecommunications protocols, including the emulation of these\n\nprotocols to facilitate command and control (C2) and utilizing\n\nscanning/packet-capture tools to retrieve highly specific information\n\nfrom mobile communication infrastructure, such as subscriber\n\ninformation and call metadata.\n\nThe nature of the data targeted by the actor aligns with information\n\nlikely to be of significant interest to signals intelligence organizations.\n\n\n-----\n\nintrusion actor that will continue to target the telecommunications\n\nsector. This assessment is made with high confidence and is based on\n\ntactics, techniques and procedures (TTPs), target scope, and objectives\n\nexhibited by this activity cluster. There is currently not enough\n\navailable evidence to link the cluster’s activity to a specific country\nnexus.\n\n### Background\n\nCrowdStrike Services, CrowdStrike Intelligence and Falcon OverWatch™ have\ninvestigated multiple intrusions within the telecommunications sector from a\nsophisticated actor tracked as the LightBasin activity cluster, also publicly known\nas UNC1945. Active since at least 2016, LightBasin employs significant operational\nsecurity (OPSEC) measures, primarily establishing implants across Linux and Solaris\nservers, with a particular focus on specific telecommunications systems, and only1\ninteracting with Windows systems as needed. LightBasin’s focus on Linux and\nSolaris systems is likely due to the combination of critical telecommunications\ninfrastructure running on those operating systems, in addition to the comparatively\nlax security measures and monitoring solutions on Linux/Solaris systems that are\ntypically in place on Windows operating systems within an organization.\n\nLightBasin managed to initially compromise one of the telecommunication\ncompanies in a recent CrowdStrike Services investigation by leveraging external\nDNS (eDNS) servers — which are part of the General Packet Radio Service (GPRS)\nnetwork and play a role in roaming between different mobile operators — to\nconnect directly to and from other compromised telecommunication companies’\nGPRS networks via SSH and through previously established implants. CrowdStrike\nidentified evidence of at least 13 telecommunication companies across the world\ncompromised by LightBasin dating back to at least 2019.\n\n### GPRS eDNS Servers\n\nLightBasin initially accessed the first eDNS server via SSH from one of the other\ncompromised telecommunications companies, with evidence uncovered indicative of\npassword-spraying attempts using both extremely weak and third-party-focused\npasswords (e.g., `huawei` ), potentially helping to facilitate the initial compromise.\nSubsequently, LightBasin deployed their SLAPSTICK PAM backdoor on the system to\nsiphon credentials to an obfuscated text file. As part of early lateral movement\noperations to further their access across the network, LightBasin then pivoted to\nadditional systems to set up more SLAPSTICK backdoors.\n\nLater, LightBasin returned to access several eDNS servers from one of the\ncompromised telecommunications companies while deploying an ICMP traffic\nsignalling implant tracked by CrowdStrike as PingPong under the filename\n`/usr/bin/pingg`, with persistence established through the modified SysVinit script\n```\n/etc/rc d/init d/sshd through the following additional line:\n\n```\n\n-----\n\nThis implant waits for a magic ICMP echo request, which, when sent to the system,\nestablished a TCP reverse shell to an IP address and port specified within the magic\npacket. The `/bin/bash` process spawned by PingPong masquerades under the\nprocess name `httpd` .\n\neDNS servers are usually protected from general external internet access by\nfirewalls; the magic packet that PingPong listens for would most likely have to be\nsent from other compromised GPRS network infrastructure. CrowdStrike Services\nobserved reverse shells that had been spawned from this implant, which\ncommunicated with a server owned by a different compromised telecommunications\ncompany in another part of the world — typically connecting to the remote system\non TCP port 53, which is the port primarily used for DNS. These efforts further\nindicate the actor’s continued attempts to disguise their activity as legitimate\ntraffic.\n\nAlongside the deployment of the PingPong implant, LightBasin added `iptables`\nrules to the eDNS server that ensured SSH access to the server from five of the\ncompromised telecommunications companies. The actor also replaced the\nlegitimate `iptables` binary with a trojanized version (SHA256:\n`97d4c9b5750d614face73d11ba8532e53594332af53f4c07c1543195225b76eb` ) that\nwould filter out output from `iptables` that included the first two octets of the IP\naddresses belonging to the compromised telecommunications companies. These\nactions make it more difficult for administrators and analysts to identify the firewall\nrules through review of `iptables` output alone. Indicators relating to this utility are\nhighlighted in Table 1.\n\n**File Path** **Description**\n\n`/usr/local/sbin/iptables` Trojanized `iptables` binary that rep\n```\n /usr/sbin/iptablesDir/iptables\n /usr/sbin/iptablesDir/iptables-apply\n /usr/sbin/iptablesDir/iptables-batch\n\n```\nLegitimate `iptables` binaries in a n\n```\n /usr/sbin/iptablesDir/iptables-multi\n /usr/sbin/iptablesDir/iptables-restore\n /usr/sbin/iptablesDir/iptables-save\n\n```\nTable 1. Trojanized and legitimate iptables file details\n\n### Serving GPRS Support Node (SGSN) Emulation\n\nLightBasin uses a novel technique involving the use of SGSN emulation software to\nsupport C2 activities in concert with TinyShell. SGSNs are essentially GPRS network\naccess points, and the emulation software allows the adversary to tunnel traffic via\nthis telecommunications network.\n\n\n-----\n\ng q y p p y\nemulator `sgsnemu through a bash script. This script constantly ran on the system,2`\nbut only executed certain steps between 2:15 and 2:45 UTC each day. This window\nwas specified via command-line arguments. During this window, the script\nperformed the following steps in a loop:\n\n1. Execute TinyShell to communicate with an actor-controlled C2 IP\n\naddress hosted by the virtual private server (VPS) provider Vultr.\n\n2. Add a route to the TinyShell C2 on the interface `tun0` .\n\n3. Check for connectivity to the TinyShell C2 via `ping` .\n\n4. If connectivity to the IP address fails, the script executes the SGSN\n\nemulator in a loop, attempting to connect to a set of nine pairs of\n\nInternational Mobile Subscriber Identity (IMSI) and Mobile Subscriber\n\nIntegrated Services Digital Network (MSISDN) numbers that are used\n\nas arguments to the SGSN emulator. These numbers are required to\n\ngenerate Packet Data Protocol (PDP) context requests for connection\n\nto a Gateway GPRS Support Node (GGSN), which will then forward\n\ntraffic to the C2 IP address. Once a connection is established, the\n\nSGSN emulator creates a connection to the GGSN via the GPRS\n\nTunnelling Protocol (GTP), and utilizes the interface `tun0` for the\n\nconnection. The TinyShell implant then uses `tun0`, as mentioned\n\n\nabove.\n\n\n3\n\n\n5. If a successful connection has not been made by the end of the 30\nminute window, the script kills both the SGSN emulator and the\n\nTinyShell implant.\n\nIn short, the SGSN emulator is used to tunnel TinyShell C2 traffic between the C2\nserver and the infected host via GTP through a GGSN. The script is used as a4\npersistence mechanism; it runs continually, but attempts to establish a tunnel to\neach of the specified mobile stations, which, in turn, act as tunnels to the TinyShell\nC2 server. The script runs for only 30 minutes each day, culminating in a similar\neffect to a scheduled job.\n\nCrowdStrike Intelligence assesses that this sophisticated form of C2 is likely an\nOPSEC measure. This assessment carries moderate confidence, as GTP-encapsulated\nTinyShell C2 traffic is less anomalous within the environment of a global mobile\ncommunications network due to its use of a protocol native to the\ntelecommunications infrastructure that is compromised. Additionally, GTPencapsulated traffic is potentially subject to less inspection and restrictions by\nnetwork security solutions.\n\n### Additional Malware and Utilities\n\n**CordScan:** This executable is a network scanning and packet capture utility that\n\nt i b ilt i l i l ti t th li ti l f t l i ti\n\n\n-----\n\ng y y, y\nresponsible for packet data delivery to and from mobile stations and also hold\nlocation information for registered GPRS users. CrowdStrike identified multiple\nversions of this utility, including a cross-compiled version for systems running on\nARM architecture, such as Huawei’s commercial CentOS-based operating system\nEulerOS.\n\nLightBasin’s ability to fingerprint various brands of telecommunications products\nand compile tools for various architectures likely indicates robust research and\ndevelopment capabilities to target vendor-specific infrastructure commonly seen in\ntelecommunications environments. This range of capability would also be consistent\nwith a signals intelligence organization with a need to respond to collection\nrequirements against a diverse set of target environments.\n\n**SIGTRANslator:** This executable provides LightBasin with the ability to transmit\ndata via telecommunication-specific protocols, while monitoring the data being\ntransmitted. SIGTRANslator is a Linux ELF binary capable of sending and receiving\ndata via various SIGTRAN protocols, which are used to carry public switched\ntelephone network (PSTN) signaling over IP networks. This signaling data includes\nvaluable metadata such as telephone numbers called by a specific mobile station.\nData transmitted to and from SIGTRANslator via these protocols is also sent to a\nremote C2 host that connects to a port opened by the binary. This allows the\nremote C2 server to siphon data flowing through the binary and send data to\nSIGTRANslator from the C2 to be re-sent via a SIGTRAN protocol.\n\nNotably, data that is sent to and from the remote C2 is encrypted with the hardcoded XOR key `wuxianpinggu507` . This Pinyin translates to “unlimited evaluation\n507” or “wireless evaluation 507.” “Wireless evaluation” is likely the correct\ntranslation, as the malware is targeting telecommunications systems. The\nidentification of a Pinyin artifact indicates the developer of this tool has some\nknowledge of the Chinese language; however, CrowdStrike Intelligence does not\nassert a nexus between LightBasin and China.\n\n**Fast Reverse Proxy:** This open-source utility is a reverse proxy used by LightBasin\nto permit general access to the eDNS server via an actor-controlled C2 IP address\nhosted by the VPS provider Vultr.\n\n**Microsocks Proxy** : This open-source utility is a lightweight SOCKS5 proxy server,\ntypically used by LightBasin to pivot to systems internally.\n\n**ProxyChains:** This open-source utility is capable of chaining proxies together and\nforcing network traffic through said chain of proxies, even if the program\ngenerating the traffic does not have proxy support. It utilizes a configuration file to\nspecify proxies in use. The recovered configuration file contained a mixture of local\nIP addresses, IP addresses belonging to Vultr, and IP addresses belonging to eight\ndifferent telecommunication organizations from around the world.\n\nSome of the tools and TTPs observed by CrowdStrike Services during investigations\ndeviate from the more sophisticated, OPSEC-aware behavior of LightBasin observed\nin the past, such as by not encrypting binaries using LightBasin’s binary packer\npublicly known as STEELCORGI. The tools and TTPs cataloged in this blog post were\nobserved in congruence with the the usage of SLAPSTICK on select eDNS servers at\nthe start of the intrusion, as well as during periods of strong time correlation, when\nSSH access from multiple compromised telecommunications company and artifacts\nindicative of LightBasin tool usage overlapped.\n\n### d i\n\n\n-----\n\np g g p ;,\nLightBasin’s ability to pivot between multiple telecommunications companies stems\nfrom permitting all traffic between these organizations without identifying the\nprotocols that are actually required. As such, the key recommendation here is for\nany telecommunications company to ensure that firewalls responsible for the GPRS\nnetwork have rules in place to restrict network traffic to only those protocols that\nare expected, such as DNS or GTP.\n\nIf already the victim of a LightBasin intrusion, simply restricting network traffic will\nnot solve the problem as LightBasin has displayed the ability to utilize common\ntelecommunications protocols such as GTP for command and control. In this event,\nCrowdStrike recommends an [incident response investigation](https://www.crowdstrike.com/services/am-i-breached/incident-response/) that includes the\nreview of all partner systems alongside all systems managed by the organization\nitself. Similarly, if an organization wishes to determine whether they’ve fallen\nvictim to LightBasin, any compromise assessment must also include a review of all\nof the aforementioned systems.\n\nFurther, as it is a common situation where parts of the network may in fact be\nmanaged by a third-party managed service provider as opposed to the\ntelecommunications company itself, an evaluation of security controls in place with\nthe partner should be undertaken to ensure that the systems are sufficiently\nprotected. CrowdStrike Services investigations commonly reveal a lack of any\nmonitoring or security tooling on telecommunications core network systems. While\nthe deployment of security tooling to real-time operating systems is generally\nlimited, other Unix-based operating systems that support the core\ntelecommunications network services are typically targeted by LightBasin and\nshould have some basic security controls and logging in place (e.g., SSH logging\nforwarded to a SIEM, [endpoint detection and response (EDR)](https://www.crowdstrike.com/cybersecurity-101/endpoint-security/endpoint-detection-and-response-edr/) for process execution,\nfile integrity monitoring (FIM) for recording file changes of key configuration files).\nIt is also important to ensure that appropriate incident response plans are in place\nthat take into account situations involving partner-managed systems within the\nnetwork in the event that such an incident is identified. This [incident response plan](https://www.crowdstrike.com/cybersecurity-101/incident-response)\nshould contain the roles and responsibilities of third-party managed service\nproviders to ensure acquisition of forensic artifacts from third-party equipment not\ndirectly under the management of the telecommunication operator themselves.\n\nFinally, given that companies within the telecommunications vertical are\nextensively targeted by highly advanced state-sponsored adversaries on a constant\nbasis, these organizations need to have access to up-to-date and comprehensive\nthreat intelligence resources so they can understand the threats facing the\nindustry. This intelligence should also provide insights into the TTPs of adversaries\nthat telecommunications companies are likely to encounter, across both the\ncorporate network and critical telecommunications infrastructure, so that these\ninsights can then be used to further augment detection mechanisms and inform on\ndecisions regarding existing security controls.\n\n### Conclusion\n\nSecuring a telecommunications organization is by no means a simple task,\nespecially with the partner-heavy nature of such networks and the focus on highavailability systems; however, with the clear evidence of a highly sophisticated\nadversary abusing these systems and the trust between different organizations,\nfocusing on improving the security of these networks is of the utmost importance.\nGiven the significant intelligence value to any state-sponsored adversary that’s\n\n\n-----\n\ng y g p\ninfrastructure beyond simply focusing on the corporate network alone.\n\n### Indicators of Compromise\n\n**Indicator** **SHA256 Hashes**\n\n```\ne9c0f00c34dcd28fc3cc53c9496bf\n4668561d60daeb7a4a50a9c3e210a\n\n```\n```\n3a259ad7e5c19a782f7736b5ac50a\n65143ccb5a955a22d6004033d073e\n\n```\n```\n05537c1c4e29db76a24320fb7cb80\n16294086be1cc853f75e864a405f3\n\n```\n\n`/usr/lib/frpc.ini` N/A\n\n```\n6d3759b3621f3e4791ebcd28e6ea6\nc5ddd616e127df91418aeaa595ac7\n9973edfef797db84cd17300b53a7a\n4480b58979cc913c27673b2f68133\nad9fef1b86b57a504cfa1cfbda2e2\n\n```\n```\n/home/ REDACTED /cordscan_raw_arm cdf230a7e05c725a98ce95ad8f3e2\n/usr/lib/javacee 917495c2fd919d4d4baa2f8a3791b\n\n```\n```\nbf5806cebc5d1a042f87abadf686f\n78c579319734a81c0e6d08f1b9ac5\nb06f52e2179ec9334f8a3fe915d26\n\n```\n```\n/usr/lib/tshd a388e2ac588be6ab73d7e7bbb61d8\n\n```\n\nN/A\n\n\n`/var/tmp/.font-unix` N/A\n\n\n-----\n\nN/A\n\n\n`45.76.215.0/24` N/A\n\n`167.179.91.0/24` N/A\n\n`45.32.116.0/24` N/A\n\n`207.148.24.0/24` N/A\n\n`172.104.79.0/24` N/A\n\n`45.33.77.0/24` N/A\n\n`139.162.156.0/24` N/A\n\n`172.104.236.0/24` N/A\n\n`172.104.129.0/24` N/A\n\nTable 2. LightBasin indicators of compromise\n\n### Endnotes\n\n1. Key examples of telecommunications-specific systems targeted\n\ninclude systems involved in the GPRS network such as External DNS\n\n(eDNS) servers, Service Delivery Platform (SDP) systems, and\n\nSIM/IMEI provisioning, as well as Operations Support Systems (OSS),\n\nand Operation and Maintenance Units (OMU).\n\n2. https[:]//osmocom[.]org/projects/openggsn/wiki/Sgsnemu\n\n3. Correction at 3 p.m. EST 10/20/2021: Clarified the methodology\n\nthrough which an SGSN emulator creates a GTP-encapsulated\n\nconnection to an IP address.\n\n4. Ibid.\n\n###### Additional Resources\n\n\n-----\n\nKaseya Attack in the CrowdStrike blog.\n\nDownload the [CrowdStrike 2021 Global Threat Report for more](https://www.crowdstrike.com/resources/reports/global-threat-report/)\n\ninformation about adversaries tracked by CrowdStrike Intelligence in\n\n2020.\n\nSee how the powerful, cloud-native [CrowdStrike Falcon® platform](https://www.crowdstrike.com/endpoint-security-products/)\n\nprotects customers from DarkSide ransomware in this blog: DarkSide\n\nGoes Dark: How CrowdStrike Falcon Customers Were Protected.\n\n[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn](https://go.crowdstrike.com/try-falcon-prevent.html)\n\nhow true next-gen AV performs against today’s most sophisticated\n\nthreats.\n\n[Tweet](https://twitter.com/share?text=LightBasin%3A+A+Roaming+Threat+to+Telecommunications+Companies&url=https://www.crowdstrike.com/blog/an-analysis-of-lightbasin-telecommunications-attacks/) [Share](https://www.linkedin.com/shareArticle?mini=true&url=https://www.crowdstrike.com/blog/an-analysis-of-lightbasin-telecommunications-attacks/&title=LightBasin%3A+A+Roaming+Threat+to+Telecommunications+Companies)\n\n##### Related Content\n\n\n-----\n\n#### The Myth of Part-time Threat Hunting, Part 2: Leveraging the Power of Human Ingenuity\n\nThe race between hunter and hunted is defined as much by stealth as it is by speed. In Part 2 of this two-part\n\nblog series, we dive into why having hunters immersed full time in the threat hunting mission is critical to\n\nbuilding out a hunting program capable of detecting stealthy and novel tradecraft before […]\n\n\n-----\n\n## CATEGORIES\n\n CONNECT WITH US\n\n\n#### SuperMem: A Free CrowdStrike Incident Response Tool for Automating Memory Image Processing\n\nPerforming memory analysis in incident response investigations can be tedious and challenging because of the\n\nlack of commercial options for processing memory samples, no all-in-one open-source tools to process samples,\n\nand a shortage of the knowledge and skill to do so. Recognizing this, CrowdStrike Services created SuperMem, an\n\nopen-source Windows memory processing script that helps […]\n\n## CATEGORIES\n\n\n-----\n\n##### SUBSCRIBE\n\nSign up now to receive the latest notifications and updates from CrowdStrike.\n\n###### Sign Up\n\n\n##### See CrowdStrike Falcon in Action\n\nDetect, prevent, and respond to attacks— even malware-free intrusions—at any stage, with next\ngeneration endpoint protection.\n\n###### See Demo\n\n\n-----\n\nImproving Performance and Reliability of Internal\n[Communication Among Microservices: The Story](https://www.crowdstrike.com/blog/improving-performance-and-reliability-of-microservices-communication-with-grpc/)\nBehind the Falcon Sandbox Team’s gRPC Journey\n\n\nLog Management vs. SIEM: See How Security Solutions\n\nCompare **TRY**\n# CROWDSTRIKE FREE FOR 15 DAYS\n\n###### GET STARTED WITH A FREE TRIAL\n\n\nCopyright © 2021 CrowdStrike |\n[Privacy](https://www.crowdstrike.com/privacy-notice/) |\n[Request Info](https://www.crowdstrike.com/request-information/) |\n[Blog](https://www.crowdstrike.com/blog) |\n[Contact Us](https://www.crowdstrike.com/contact-us/) |\n1.888.512.8906\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.10.19.UNC1945_LightBasin/LightBasin_A-Roaming-Threat-to-Telecommunications-Companies_CrowdStrike.pdf"
    ],
    "report_names": [
        "LightBasin_A-Roaming-Threat-to-Telecommunications-Companies_CrowdStrike"
    ],
    "threat_actors": [
        {
            "id": "ece64b74-f887-4d58-9004-2d1406d37337",
            "created_at": "2022-10-25T16:07:23.794442Z",
            "updated_at": "2025-03-27T02:02:09.981874Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "DecisiveArchitect",
                "Luminal Panda",
                "TH-239",
                "UNC1945"
            ],
            "source_name": "ETDA:LightBasin",
            "tools": [
                "CordScan",
                "EVILSUN",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LEMONSTICK",
                "LOGBLEACH",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "OKSOLO",
                "OPENSHACKLE",
                "ProxyChains",
                "Pupy",
                "PupyRAT",
                "SIGTRANslator",
                "SLAPSTICK",
                "SMBExec",
                "STEELCORGI",
                "Tiny SHell",
                "pupy",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "31c0d0e1-f793-4374-90aa-138ea1daea50",
            "created_at": "2023-11-30T02:00:07.29462Z",
            "updated_at": "2025-03-27T02:00:03.256081Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "UNC1945",
                "CL-CRI-0025"
            ],
            "source_name": "MISPGALAXY:LightBasin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1634832580,
    "ts_modification_date": 1634832580,
    "files": {
        "pdf": "https://archive.orkl.eu/98fe112857885dc84909b66d652305b9ff09952d.pdf",
        "text": "https://archive.orkl.eu/98fe112857885dc84909b66d652305b9ff09952d.txt",
        "img": "https://archive.orkl.eu/98fe112857885dc84909b66d652305b9ff09952d.jpg"
    }
}