{
    "id": "da5b7d66-85fc-436e-81b5-ef0590b3ff10",
    "created_at": "2023-01-12T15:08:36.273042Z",
    "updated_at": "2025-03-27T02:05:37.277948Z",
    "deleted_at": null,
    "sha1_hash": "63ae711b5fd5cf2b5758b9c6c45ac7a83eb60d30",
    "title": "2011-04-19 - TDSS part 1- The x64 Dollar Question",
    "authors": "",
    "file_creation_date": "2022-05-28T03:12:45Z",
    "file_modification_date": "2022-05-28T03:12:45Z",
    "file_size": 867973,
    "plain_text": "# TDSS part 1: The x64 Dollar Question\n\n**resources.infosecinstitute.com/tdss4-part-1/**\n\nReverse engineering\nApril 19, 2011 by ESET Team\n\n## Introduction\n\n[In the two years since the Win32/Olmarik family of malware programs (also known as TDSS,](https://www.infosecinstitute.com/courses/advanced_reverse_engineering_malware.html)\nTDL and Alureon) started to evolve, its authors have implemented a notably sophisticated\nmechanism for bypassing various protective measures and security mechanisms embedded\ninto the operating system.\n\nThe fourth version of the TDL rootkit family (TDL4) is the first reliable and widely spread\nbootkit to target x64 operating systems (Windows Vista and Windows 7). Since TDL4 started\nto spread actively in August 2010, several versions of the malware have been released. By\ncomparison with its predecessors, TDL4 is not just characterized by modification of existing\ncode, but to all intents and purposes can be regarded as new malware. Among the many\nchanges that have been applied as it developed, the most radical were those made to its\nmechanisms for self-embedding into the system and surviving reboot. One of the most\nstriking features of TDL4 is its ability to load its kernel-mode driver on systems with an\nenforced kernel-mode code signing policy (64-bit versions of Microsoft Windows Vista and\nWindows 7) and perform kernel-mode hooks with kernel-mode patch protection policy\nenabled. This makes TDL4 a powerful weapon in the hands of cybercriminals. In this article,\nwe consider the PPI (Pay Per Install) distribution model used by both TDL3 and TDL4, and\nthe initial installation.\n\n## Distribution by Pay Per Install\n\nIn [“TDL3: The Rootkit of All Evil?” Aleksandr Matrosov and Eugene Rodionov described how](http://www.eset.com/us/resources/white-papers/TDL3-Analysis.pdf)\nthe DogmaMillions cybercrime group distributed the third version of the TDSS (a.k.a. TDL,\nOlmarik, or Alureon) rootkit using a PPI (Pay Per Install) scheme. It’s both interesting and\ninstructive to compare the ways in which TDL3 and TDL4 (as described in their more recent\npaper [“The Evolution of TDL: Conquering x64″) have been distributed.](http://www.eset.com/us/resources/white-papers/The_Evolution_of_TDL.pdf)\n\nThe TDL3 rootkit droppers were distributed using a Pay-Per-Install (PPI) scheme popular\namong cybercrime groups. The scheme is, in fact, similar to schemes commonly used for\ndistributing browser toolbars. Toolbar distributors have a special build with an embedded\nidentifier which allows for calculating the number of installations associated with that ID and\n\n\n-----\n\ntherefore for determining their revenue. The same approach is used for distributing the\nrootkits: information about the distributor is embedded into the executable and special\nservers are used to calculate the number of installations.\n\nAnyone deciding to cooperate with the cybercrime group received a unique login and a\npassword, identifying the number of installations per resource, like this:\n```\nhxxp://dogmamillions.com/download.html?\nlogin=b0bah&amp;key=2b15ea4e5eb2bbd734081c051a14fa41&amp;affSid=0\n\n```\nThe gang made use of a well-developed business infrastructure: for example, each affiliate\nhad a personal manager who could be consulted in case of any problems.\n\nDistributed malware was repacked every few hours (or even more frequently) using all-tooreliable and sophisticated packers and protectors in order to reduce the risk of detection by\nantivirus software, using sophisticated tools and techniques to detect debuggers and virtual\nmachines. Partners were instructed not to check on whether the malware can be detected by\nAV by using resources like VirusTotal, and could even be “fined” for doing so.\n\nYou can see the user interface characteristic of one widely-used encryptor in the figure\nbelow. At that point, this was attracting a charge of around $500.\n\n\n-----\n\n_Figure 1 – User Interface of a Packer_\n\nThe Dogma Millions cybercrime group set up in business in the autumn 2009, placing many\nadvertisements on public forums offering “easy money”. However, it seems to have been\nsomewhat uncomfortable with the copious attention it received last year, and shut down in\nthe fall. Major affiliates to DogmaMillions could earn a cool $100,000 daily, so it’s no surprise\nthat TDL4, the latest generation of TDSS, quickly found similar distribution channels.\n\nGangstaBucks appeared at the end of 2010 and was widely advertised in various forums in\nRussia and elsewhere, offering very similar terms and features to DogmaMillions, and a very\nsimilar mode of expression.\n\n_Figure 2 – The GangstaBucks Adverts_\n\nAffiliates are able to download the current version of the Trojan downloader and to receive\nstatistics relating to detection by antivirus software. This serves to dissuade the partner from\nsubmitting the current version to services such as VirusTotal that forward malicious samples\nto security companies.\n\n\n-----\n\n_Figure 3 –Scanning Samples for Detection by AV Software_\n\nWhen the downloader is known to be widely detected, the partner receives a newly-repacked\nsample, so that release/detect cycle begins again.\n\nWhen the downloader is launched it sends information about the compromised system to a\nC&C (Command and Control) server and pulls down a secondary downloader which in turn\ndownloads and runs the main malware. The sequence of download events for the\ndownloader which we analyzed is depicted in the following figure. As we can see, the first\ndownloader obtains Win32/Agent.QNF which downloads and installs either Win32/Bubnix or\n_Win32/KeyLogger.EliteKeyLogger malware onto the system._\n\n\n-----\n\n_Figure 4 – The Downloader at Work_\n\nDownloader packers and links are changed every few hours, so as to minimize the risk of\ndetection by malware installation tracking systems.\n\nIn the middle of February we received a downloader (Win32/TrojanDownloader.Agent.QOF)\nthat installs the latest version of the TDL4 bootkit onto the system. During the installation of\nthe bootkit, as we can see from figure 5, the downloader reports back to the server to\nregister the installation with the partner identifier.\n\n_Figure 5 – Installation of GangstaBucks’s TDL4_\n\nWhen conditions are mutually beneficial, services like DogmaMillions and GangstaBucks can\naccumulate hundreds of partners. In such a case the number of sites all over the world\ndistributing the malicious software can reach several thousand.\n\n## Bootkit Installation\n\n\n-----\n\nThe installation of the bootkit is handled differently on x86 and x64 systems due to specific\nlimitations on x64 platforms. As soon as the dropper is unpacked it checks whether it is\nrunning in Wow64 process and determines which branch of the code it should execute.\n\n_Figure 6 –Determining OS Version_\n\n**Infecting x86 Systems**\n\nOn x86 systems the installation process looks the same as it does for TDL3/TDL3+, as\ndescribed in an earlier paper (http://www.eset.com/resources/white-papers/TDL3Analysis.pdf). To bypass HIPS the bootkit loads itself as a print provider into the trusted\nsystem process (spooler.exe) from whence it loads a kernel-mode driver (drv32) which\ninfects the system.\n\nThe bootkit implements an additional HIPS bypassing technique which wasn’t noticed in\nTDL3/TDL3+ droppers: it hooks the ZwConnectPort system routine exported from ntdll.dll.\n\n_Figure 7 – Hooking ZwConnectPort_\n\nHere is the prototype of the function ZwConnectPort. Parameter PortName is set to the\nname of the target LPC port to connect to.\n```\nNTSYSAPI\nNTSTATUS\nNTAPI\nZwConnectPort(\nOUT PHANDLE PortHandle,\nIN PUNICODE_STRING PortName,\nIN PSECURITY_QUALITY_OF_SERVICE SecurityQos,\nIN OUT PPORT_SECTION_WRITE WriteSection OPTIONAL,\nIN OUT PPORT SECTION READ ReadSection OPTIONAL,\n\n```\n\n-----\n\n```\nOUT PULONG MaxMessageSize OPTIONAL,\nIN OUT PVOID ConnectData OPTIONAL,\nIN OUT PULONG ConnectDataLength OPTIONAL\n\n```\nThe routine is called during execution of AddPrintProvidor to connect to the print spooler\nLPC port. As shown here the hook prepends to the target port name “??GLOBALROOT”\nstring in an attempt to connect to the print spooler service.\n\n_Figure 8 – The Code of ZwConnectPort Hook_\n\nWhen the driver is loaded into kernel-mode address space it overwrites the MBR (Master\nBoot Record) of the disk by sending SRB (SCSI Request Block) packets directly to the\nminiport device object, after which it initializes its hidden file system. The bootkit’s modules\nare written into the hidden file system from the dropper by means of the CreateFile and\n_WriteFile API functions._\n\nThe algorithm for infecting x86 operating systems is presented in Figure 10. It is important to\nmention that the TDL4 dropper exploits the now-patched MS10-092 vulnerability in the\nMicrosoft Windows Task Scheduler service in order to elevate privileges and successfully\nload its own driver. The vulnerable systems include all Windows operating systems starting\nfrom Microsoft Windows Vista (both x86 and x64 versions). If it fails to exploit the\nvulnerability it copies itself into a file into TEMP directory with the name “setup_xxx.exe” and\ncreates a corresponding manifest file requesting administrative privileges to run the\napplication. After that, it runs the copied dropper by calling ShellExecute and a dialog box\nmessage requesting administrative rights is displayed to the user.\n\n\n-----\n\n_Figure 9 – The Algorithm of Infecting x86 System_\n\n**Infecting x64 Systems**\n\nWhen the dropper is run on x64 operating systems it is unable to load the kernel-mode\ndriver, as 64-bit systems require it to be signed. To overcome this restriction the dropper\nwrites all its components directly to the hard drive by sending\nIOCTL_SCSI_PASS_THROUGH_DIRECT requests to a disk class driver. It obtains the\ndisk’s parameters and creates the image of its hidden file system in the memory buffer which\nis then written onto the hard drive at a certain offset. We’ll discuss the way in which the\nhidden file system is maintained in a future article, but an earlier article for Virus Bulletin\n[(Rooting around in TDSS) is also relevant to the discussion. When the image is written the](http://www.eset.com/us/resources/white-papers/Rooting-about-in-TDSS.pdf)\ndropper modifies the MBR of the disk to get its malicious components loaded at boot time.\nAfter that, the dropper reboots the system by calling the ZwRaiseHardError routine, passing\nas its fifth parameter OptionShutdownSystem. This instructs the system to display a BSOD\n(Blue Screen Of Death) and reboot the system:\n```\nNTSYSAPI\nNTSTATUS\nNTAPI\nNtRaiseHardError(\nIN NTSTATUS ErrorStatus\nIN ULONG NumberOfParameters,\nIN PUNICODE_STRING  UnicodeStringParameterMask OPTIONAL,\n\n```\n\n-----\n\n```\nIN PVOID Parameters,\nIN HARDERROR_RESPONSE_OPTION ResponseOption,\nOUT PHARDERROR_RESPONSE Response );\n\n```\nIn the next figure we present a diagram depicting process of infecting x64 system.\n\n_Figure 10 – The Algorithm for Infecting x64 Systems_\n\n**The Dropper’s Payload**\n\nThe bootkit’s components are contained inside the “.config” section of the dropper (the layout\nof the section is described below as detailed in our report on TDL3).\n\nThe rootkit dropper is encrypted. The decryption routine is slightly obfuscated and varies\nbetween different droppers. During unpacking, the dropper performs some simple antidebugging checks and also checks that it isn’t running inside a virtual machine. The next\nfigure shows the structure of the dropper.\n\n\n-----\n\n_Figure 11 – The Dropper Structure_\n\nHere is the list of modules that are dropped into the hidden file system:\n\n**Dropped modules** **Description**\n\n_mbr_ original contents of the infected hard drive boot sector\n\n_ldr16_ 16-bit real-mode loader code\n\n_ldr32_ fake kdcom.dll for x86 systems\n\n_ldr64_ fake kdcom.dll for x64 systems\n\n_drv32_ the main bootkit driver for x86 systems\n\n_drv64_ the main bootkit driver for x64 systems\n\n_cmd.dll_ payload to inject into 32-bit processes\n\n_cmd64.dll_ payload to inject into 64-bit processes\n\n_cfg.ini_ configuration information\n\n_bckfg.tmp_ encrypted list of C&C URLs\n\n_Table 1 – Dropped Modules_\n\n\n-----\n\n**Comparison with TDL3/TDL3+**\n\nHere is the table summarizing the major differences between the TDL3/TDL3+ and TDL4\ndroppers which include bypassing HIPS, escalating privileges, installation mechanism and\nnumber of installed modules.\n\n**TDL3/TDL3+** **TDL4**\n\n**Bypassing HIPS** AddPrintProcessor/AddPrintProvidor AddPrintProvidor,\nZwConnectPort\n\n\n**Privilege**\n**Escalation**\n\n**Installation**\n**mechanism**\n\n**Number of**\n**installed modules**\n\n\n– MS10-092\n\nBy loading kernel-mode driver By loading kernel-mode\ndriver,Overwriting MBR of\nthe disk\n\n4 10\n\n\n_Table 2 – Comparison of TDL Droppers_\n\n## TDL4 and Glupteba\n\nAt the beginning of March 2011 we received another interesting sample of TDL4: this time,\none that downloads and installs another malicious program, Win32/Glupteba.D. This was the\nfirst instance the authors had come across of TDL4s being used to install other malware. It is\nimportant to mention that this is not a plug-in for TDL4: it is standalone malware, which can\ndownload and execute other binary modules independently. A sample of Win32/Olmarik.AOV\nwas obtained from a server at vidquick.info. After what looked at first like a standard TDL4\ninstallation, at any rate by comparison with the most recent versions analyzed,\nWin32/Olmarik.AOV received a command from the C&C server to download and execute\nanother binary file.\n\nWin32/Glupteba.D uses the customary blackhat SEO (Search Engine Optimization) methods\nto push clickjacking contextual advertising as used by the ads network Begun\n(http://www.begun.ru/), which has a high profile in Russia. Clickjacking algorithms have been\ndeveloped for crawling web sites pushing typical content for specified context ads. All the\naffected web sites are hosted by a single provider: “Masterhost.ru” is, in fact, the biggest\nRussian hosting-provider.\n\n\n-----\n\n_Figure 12 – the Masterhost.ru Empire_\n\nNetwork activity from Win32/Glupteba.D is shown in the following screendump:\n\nCommands for Win32/Glupteba.D directed to the C&C server look like this:\n\n\n-----\n\n## Conclusion\n\nIn the [next article in this series, we’ll consider the bot, kernel mode and bootkit functionality](https://resources.infosecinstitute.com/tdss4-part-2/)\nof the malware.\n\n[TDSS part 2: Ifs and Bots](https://resources.infosecinstitute.com/tdss4-part-2/)\n\nPosted: April 19, 2011\n\nAuthor\n\n**ESET Team**\n\n**VIEW PROFILE**\nAleksandr Matrosov is a Senior Malware Researcher at ESET. He is also a Lecturer at the\nCryptology and Discrete Mathematics at National Nuclear Research University MEPh. He\nspecializes in the analysis of malicious threats and cybercrime activity. Eugene Rodionov is a\nmalware researcher for ESET. Rodionov also holds the position of Lecturer at the National\nNuclear Research University MEPhI in Russia. His interests include kernel-mode\nprogramming, anti-rootkit technologies, reverse engineering and cryptology. David Harley is\na Senior Research Fellow at ESET. He is a Director of the Anti-Malware Testing Standards\n\n\n-----\n\nOrganization, Chief Operations Officer at AVIEN, and CEO of Small Blue-Green World. He is\na Fellow of the BCS Institute and holds qualifications in security management, service\nmanagement (ITIL), BSI security audit and medical informatics.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-04-19 - TDSS part 1- The x64 Dollar Question.pdf"
    ],
    "report_names": [
        "2011-04-19 - TDSS part 1- The x64 Dollar Question.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536116,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653707565,
    "ts_modification_date": 1653707565,
    "files": {
        "pdf": "https://archive.orkl.eu/63ae711b5fd5cf2b5758b9c6c45ac7a83eb60d30.pdf",
        "text": "https://archive.orkl.eu/63ae711b5fd5cf2b5758b9c6c45ac7a83eb60d30.txt",
        "img": "https://archive.orkl.eu/63ae711b5fd5cf2b5758b9c6c45ac7a83eb60d30.jpg"
    }
}