{
    "id": "daa63705-2f44-4902-a130-24942710ad16",
    "created_at": "2023-01-12T15:01:49.224253Z",
    "updated_at": "2025-03-27T02:08:40.595749Z",
    "deleted_at": null,
    "sha1_hash": "862e11dc48d0d783b01b041f1404d55963fbf8ee",
    "title": "2016-07-05 - New Backdoor Allows Full Access to Mac Systems, Bitdefender Warns",
    "authors": "",
    "file_creation_date": "2006-04-12T11:37:10Z",
    "file_modification_date": "2006-04-12T11:38:52Z",
    "file_size": 318889,
    "plain_text": "INL/EXT-05-00993\n\n# Common Control System Vulnerability\n\n## November 2005\n\n### Prepared by Idaho National Laboratory\n\n\n-----\n\n**INEEL/EXT-05-00993**\n\n**Rev. 0**\n\n## Control Systems Security Center\n\n Common Control System Vulnerability\n\n##### Trent Nelson\n\n November 2005\n\n#### Idaho National Laboratory\n Idaho Falls, Idaho 83415\n\n\n-----\n\n#### Control Systems Security Center \n\n Common Vulnerability\n\n##### Introduction\n\nThe Control Systems Security Center (CSSC) and National SCADA Test Bed (NSTB)\nprograms have discovered a vulnerability common to control systems in all sectors that\nallows an attacker to penetrate most control systems, spoof the operator, and gain full\ncontrol of targeted system elements. This vulnerability has been identified on several\nsystems that have been evaluated at INL, and in each case a 100% success rate of\ncompleting the attack paths that lead to full system compromise was observed. Since these\nsystems are employed in multiple critical infrastructure sectors, this vulnerability is deemed\ncommon to control systems in all sectors.\n\nModern control systems architectures can be considered analogous to today’s information\nnetworks, and as such are usually approached by attackers using a common attack\nmethodology to penetrate deeper and deeper into the network. This approach often is\ncomposed of several phases, including reconnaissance, traffic analysis, profiling of\nvulnerabilities, launching attacks, escalating privilege, maintaining access, and covering\nevidence. With irrefutable proof that external attacks can lead to a compromise of a\ncomputing resource on the organizations business local area network (LAN), access to the\ncontrol network is usually considered the next phase in the attack plan. Once the attacker\ngains access to the control network through vulnerabilities in the business LAN, the second\nphases of reconnaissance begins with traffic analysis within the control domain. Thus, the\ncommunications between the workstations and the field device controllers can be monitored\nand evaluated, allowing an attacker to capture, analyze, and evaluate the commands sent\namong the control equipment. Through manipulation of the communication protocols of\ncontrol systems (a process generally referred to as “reverse engineering”), an attacker can\nthen map out the control system processes and functions. With the detailed knowledge of\nhow the control data functions, as well as what computers and devices communicate using\nthis data, the attacker can use a well known Man-in-the-Middle attack to perform malicious\noperations virtually undetected.\n\nThe control systems assessment teams have used this method to gather enough\ninformation about the system to craft an attack that intercepts and changes the information\nflow between the end devices (controllers) and the human machine interface (HMI and/or\nworkstation). Using this attack, the cyber assessment team has been able to demonstrate\ncomplete manipulation of devices in control systems while simultaneously modifying the\ndata flowing back to the operator’s console to give false information of the state of the\nsystem (known as “spoofing”). This is a very effective technique for a control system attack\nbecause it allows the attacker to manipulate the system and the operator’s situational\nawareness of the perceived system status. The three main elements of this attack\ntechnique are: 1) network reconnaissance and data gathering, 2) reverse engineering, and\n3) the Man-in-the-Middle attack.\n\n**Control Systems Security Center**\n\n\n-----\n\n##### Network Reconnaissance and Data Gathering \n\nOnce access has been obtained on the control system network, be it via the business LAN\nor some other plausible attack vector (vendor channel, wireless, dial-in access, etc), network\nreconnaissance is used to gather the information required to develop a plan of attack. By\npassively scanning, listening, and gathering communication traffic (i.e., protocols), the\nattacker is able to obtain an initial inventory regarding the architecture components in the\ncontrol network, as well as direct insight into the communications used by the control\ndevices on the network. After enough information has been gathered, the attacker can begin\ndecoding and assessing the system information flow. This process of passively listening to\nnetwork traffic is often referred to as ‘sniffing’.\n\nEach system evaluated suggested that in order to communicate with the end-point field\ndevices, the application always communicated directly with the device-specific controllers.\nThis identified a critical path on the flow of system information between the controllers\nand/or field devices and the workstation. Decoding the communications within this flow of\ninformation is the key to understanding the system and more importantly, verifying targets\non the control network. In order to break the communication layer, the control network traffic\nhad to be monitored and dissected to develop a greater understanding of how the\ncomponents communicate. From an attack perspective, if a resource has been\ncompromised on the control network, and the attacker has escalated his privileges to an\nauthoritative level, then the task of monitoring control-centric traffic and collecting it\nundetected for back-end analysis becomes trivial.\n\n##### Reverse Engineering\n\nIn the testing the assessment teams performed, the decoding of the communication\n(protocols) required reverse engineering. To reverse engineer a protocol, communication\npackets are captured by the attacker using the compromised machine on the control\nnetwork and dissected to identify the inner working of the communications. Each packet\ncontains all the required components to operate and control the field devices. The critical\naspect of each protocol is to understand how the packet is put together and identify which\npieces (bits) within the packet are the commands for controlling the equipment. These\npieces are identified through reverse engineering of the protocol, which allows the attacker\nthe ability to manipulate each packet as required.\n\nAs control system information infrastructures once existed as closed networks, the threat of\nexternal attack was minimal, and it could be assumed that any data on the control network\nwas authorized and permitted. Therefore, data sent to and from control devices and to the\noperator consoles was usually considered valid. Each control system network component\ncould theoretically communicate with any other component without any verification of sender\nor receiver. Historically, the Internet has seen myriad attacks where an attacker has been\nable to capture (sniff) data, analyze it, change critical instructions in the payload of the\ncaptured data, and reinsert it back into the network. This new data, with possible harmful\ninstructions, would be accepted by the target resource and command would be executed.\nThis category of attacks are know as ‘replay attacks’, and the impact they can have in a\ncontrol systems environment is an obvious concern. While it has been shown that an\n\n**Control Systems Security Center**\n\n\n-----\n\nattacker can see, collect, reverse engineer and change data payloads in control system\ntraffic, the final task of successfully inserting the modified rogue traffic into the data stream\nrequires that the information flow be uninterrupted. In order to use the information and insert\nthe modified packets into the information flow, a Man-in-the-Middle attack must be carried\nout.\n\n\n##### Man-in-the-Middle Attack\n\nA Man-in-the-Middle attack requires the use of the address resolution protocol (ARP) and an\nin-depth understanding of the protocol to be manipulated. The ARP Man-in-the-Middle\nattack is a popular method used by an attacker to gain access to the network flow of\ninformation on a target system. This is done by attacking the network ARP cache tables of\nthe controller and the workstation machines. Using the compromised computer on the\ncontrol network, the attacker poisons the ARP tables on each host and informs them that\nthey must route all their traffic through a specific internet protocol (IP) and hardware address\n(i.e., the attacker’s machine). By manipulating the ARP tables, the attacker can insert his\nmachine between the two target machines and/or devices.\n\n\nThe Man-in-the-Middle attack works by initiating gratuitous ARP commands to confuse each\nhost (referred to as ARP poisoning). These ARP commands cause each of the two target\nhosts to use the Media Access Control (MAC) address of the attacker as the address for the\nother target host. When a successful Man-in-the-Middle attack is performed, the hosts on\neach side of the attack are unaware that their network data is taking a different route\nthrough the attacker’s computer. The attacker’s computer then needs to forward all packets\nto the intended host so the connection stays in sync and does not time out. Figure 1\nillustrates a typical Man-in-the-Middle attack.\n\n\nH ost 1\n\n\nHost 2\n\n\nFigure 1. Generic man-in-the-middle attack\n\nThe Man-in-the-Middle attack is effective against any switched network because it effectively\nputs the attacker’s computer between the two hosts. This means the hosts send their data\nto the attacker’s computer, thinking it is the host to which they intended to send the data.\nAfter the ARP tables on both target hosts have been successfully poisoned, the program\nshuttles packets back and forth between the target hosts. This ensures that all of the\ncurrent applications on the target hosts will continue to work properly. During the shuttling\nprocess, every packet destined for either target host is processed through the attacker’s\nmachine and can be manipulated (packet crafting) to send specific commands to each host.\n\n**Control Systems Security Center**\n\n\n-----\n\nOnce the attacker has successfully inserted their machine into the information stream, he or\nshe now has full control over the data communications and can carry out several types of\nattacks. As previously stated, one attack well suited for the compromise of control system\noperation is a replay attack. In its simplest form, captured data from the control/HMI is\nmodified to instantiate activity when received by the device controller, and the reverse\nengineering that has occurred previously will empower the attacker to craft any instruction\nbe it benign or malicious. When considering the activities an attacker will perform during a\nsystem compromise, one key element is to maintain covert activity and remove evidence of\nthe attack wherever possible. Bearing in mind that cyber-based attacks on control systems\nare unique in that they are ‘digital’ attacks that manifest themselves in ‘physical’ actions,\nmanipulation of the operator’s information is vital to the success of the attack. Control of the\ninformation that is accessible by the operator is required to hide the attack. During the\nearlier data capture phase of the attack, data reflecting normal operations in the control\nsystems are harvested and can be played back to the operator as required. This will ensure\nthat the operator’s console will appear to be normal and the attack will go unobserved as the\ninformation presented to the operator via the HMI. During this replay attack the attacker can\ncontinue to send destructive commands to the controller and/or field devices to cause an\nundesirable event while the operator is blind to the true state of the system.\n\nAnother attack that can be carried out with the Man-in-the-Middle attack is false messaging\nto the operator, and can take the form of a false negative or a false positive. This aspect of\n‘perception management’ is used to indicate operational activities (good or bad) and thus\ninfluence the behavior of the operator who would, under normal conditions, see console\nactivity reflecting the physical manifestation of the cyber attack on the actual devices. The\nattacker would simply send commands to the operator’s console indicating a system\nchange, and when the operator follows normal procedures and attempts to correct the\nproblem, the operator’s action would cause the undesirable event. There are numerable\nvariations of how the modification and replay of control data can impact the operations of the\nsystem.\n\n##### Mitigation Techniques\n\nProtocol manipulation and the Man-in-the-Middle attack is a common hacking practice that\ncan be used across control systems in all sectors. However, there are mitigation techniques\nthat can be applied to secure the systems through MAC address locking, static tables, and\nencryption.\n\n**Mac Locking - The ARP Man-in-the-Middle attack requires the attacker to be connected to**\nthe local network or have control of a local computer on the network. Port security, also\ncalled MAC address locking, is one method to secure the physical connection at the end of\neach port on a network switch. The high-end corporate class network switches usually have\nsome kind of option for MAC address locking. MAC address locking is very effective against\na rogue individual looking to physically plug into the internal network. Without port security,\nany open network jack on the wall could be used as an avenue onto the corporate network.\nPort security locks a specific MAC address to a specific port on a managed switch. If the\nMAC address does not match, the communication link is disabled and the intruder will not\nbe able to achieve his goal. Some of the more advanced switches have an auto resetting\noption, which will reset the security measure if the original MAC is returned to the port.\n\n**Control Systems Security Center**\n\n\n-----\n\nAlthough port security is not hacker proof, it does add a layer of added security to the\nphysical network. The implementation of port security is not difficult, but it increases the\ncomplexity of normal maintenance functions such as plugging in a legitimate computer onto\nthe network. It also protects the local network from employees plugging un-patched and outof-date systems onto the protected network. This reduces the number of target computers a\nremote attacker can access. These security measures not only protect against attacks from\nexternal networks but provide added physical protection as well.\n\n**Static Tables - A smaller network that stays relatively static can attempt to implement**\nstatically coded ARP tables. Most operating systems have the capability to statically code\nall of the MAC addresses into the ARP table on each computer. Statically coding the ARP\ntables on each computer prevents the attacker from changing them by sending ARP reply\npackets to the victim computer. Static ARP entries are hard to maintain in small networks\nand impossible to maintain when the network is large and/or dynamic.\n\n**Encryption - As a longer term solution, systems need to be redesigned to include**\nencryption between devices in order to make it very difficult to reverse engineer protocols\nand forge packets on control system networks. Encrypting the communications between the\ncontroller and workstations would shut the door on this type of attack, but would be\nexpensive and difficult to retrofit to the existing systems. Along with encryption, monitoring\nfor ARP poisoning provides an added layer of defense. There are several programs\navailable, ARPwatch for example, that can monitor for changing MAC addresses through\nthe ARP packets.\n\n**Control Systems Security Center**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/Common Control System Vulnerabilities (2005).pdf"
    ],
    "report_names": [
        "Common Control System Vulnerabilities (2005).pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535709,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1144841830,
    "ts_modification_date": 1144841932,
    "files": {
        "pdf": "https://archive.orkl.eu/862e11dc48d0d783b01b041f1404d55963fbf8ee.pdf",
        "text": "https://archive.orkl.eu/862e11dc48d0d783b01b041f1404d55963fbf8ee.txt",
        "img": "https://archive.orkl.eu/862e11dc48d0d783b01b041f1404d55963fbf8ee.jpg"
    }
}