{
    "id": "dad7fcd1-7dec-4233-99f0-76b1066aa3b7",
    "created_at": "2023-01-12T15:08:39.116138Z",
    "updated_at": "2025-03-27T02:09:54.998376Z",
    "deleted_at": null,
    "sha1_hash": "92d459ff29db902b7522dfdf26424d5afab3168e",
    "title": "2011-09-14 - Ice IX- not cool at all",
    "authors": "",
    "file_creation_date": "2022-05-28T21:46:10Z",
    "file_modification_date": "2022-05-28T21:46:10Z",
    "file_size": 540350,
    "plain_text": "# Ice IX: not cool at all\n\n**securelist.com/ice-ix-not-cool-at-all/29111/**\n\nAuthors\n\n[Dmitry Tarakanov](https://securelist.com/author/dmitryt/)\n\nMy colleague Jorge Mieres recently found a C&C server of a botnet based on a malicious\nprogram called Ice IX. As announced on several user forums, Ice IX is a bot created using\nthe source code of ZeuS 2.0.8.9, which became publicly available in May. The author of the\nnew bot says the program includes substantial enhancements, which should be interesting to\nthose cybercriminals who steal money from users with the help of banking Trojans.\n\n**_Figure 1. Description of the bot_**\n\nAs you can see in the screenshot, the description of the new program focuses on the\nenhancements allegedly introduced into the ZeuS original code. These included bypassing\nfirewalls, bypassing proactive protection provided by security products, and protection from\ndetection by trackers. The latter obviously refers to the ZeuS Tracker\n[https://zeustracker.abuse.ch, which has been making cybercriminals’ life difficult. The](https://zeustracker.abuse.ch/)\nprogram’s author charged $600 for a version of the bot with a hardwired URL that the bot\nmust connect to after infection (i.e., the C&C address), and $1800 for a version without a\nhard-coded C&C address.\n\n\n-----\n\nUnfortunately, we were unable to obtain a sample of the enhanced Ice IX version – possibly,\nbecause nobody had purchased it. Most likely, this version included a mechanism that was\nsimilar to that implemented in ZeuS beginning with version 2.1. Here is how it worked in\nZeuS: the bot included a key that was used in combination with the current date to generate\n1020 domain names each day. The bot searched through this entire list, trying to find its C&C\nserver.\n\nAt the same time, someone has apparently tested the base version of the bot kit. These\nsamples were analyzed for differences from the original ZeuS samples used as the basis for\nthe Ice IX bot.\n\nI must confess, I had expected more. The author advertized the programs as something\nspecial, and in addition, there was a comment in the thread that the author deserved credit\nfor bypassing proactive detection, since it was an important improvement, concluding that\nthis was no doubt a completely new bot, much better than ZeuS… In fact, however, it was all\na bunch of lies. There were no major improvements compared to ZeuS 2.0.8.9 – the version\nwhich became publicly available.\n\nHere are the differences I was able to identify:\n\n1) ZeuS can find the user’s email credentials saved on the infected system. The bot sends\nany data found to the botnet operator, giving the cybercriminal access to the victim’s\nmailboxes. However, the code section responsible for finding and processing email\ncredentials was commented out in the original ZeuS source code. The author of Ice IX simply\nremoved the comment marks from this code, so the modules that were not included in ZeuS\n2.0.8.9 samples were present in his bot.\n\n2). The ZeuS 2.0.8.9 bot can be launched with the following arguments: -f, -n, -v, -i. I won’t\ngo into the discussion of what each of them means. Let me just mention the key –i: if ZeuS\n2.0.8.9 sample is launched with this key, a window with some information about the bot will\nbe displayed:\n\n**_Figure 2. ZeuS 2.0.8.9 information window_**\n\nThe author of Ice IX simply removed the fragment processing this key from the code.\nConsequently, Ice IX sample does not support this argument.\n\n\n-----\n\n3) A modified function that is associated with reading data from the registry has been\nidentified. There is a small chance that this could prove that “enhancement” introduced in\norder to bypass proactive protection provided by security products. However, it could also be\nmerely the consequence of compiler optimization – the result of compiling the bot’s code\nmight have been slightly different from that for the original ZeuS code due to the changes,\nalbeit small, introduced into Ice IX. In the ZeuS 2.0.8.9 code, the function that reads data\nfrom the registry includes all the API functions required for this task, i.e., RegOpenKeyEx,\nRegQueryValueEx and RegCloseKey:\n\n**_Figure 3. The function in ZeuS which reads data from the registry_**\n\nWhen a value needed to be read from the registry, it was done as follows:\n\n**_Figure 3a. Calling the function which reads from the registry in ZeuS_**\n\nIn the Ice IX sample, there are some changes in the places where the function is called. The\nAPI function RegOpenKeyEx was removed from the function that reads registry data:\n\n**_Figure 4. The function in Ice IX that reads data from registry_**\n\n\n-----\n\nAs a result, whenever a value needed to be read from the registry, the API function\nRegOpenKeyEx was called first to open the registry key (e.g., HKEY_CURRENT_USER or\nHKEY_LOCAL_MACHINE) before calling the actual registry read function:\n\n**_Figure 4a. Calling the function to read from registry in Ice IX_**\n\nI admit that some antivirus products may possibly detect ZeuS based on the presence of the\nabove registry read function. It is quite probable that this essential function is present in all\nZeuS samples regardless of version; it is also possible that its code uniquely identifies this\nentire malware family. Why not, after all? In this case, modifying this function (e.g., removing\nRegOpenKeyEx) would help to prevent the detection which depends on it.\n\nI didn’t test all antivirus products on Ice IX samples, so I cannot say whether any product\nwould fail to detect them because of this change. I only scanned the sample with KIS 2012\nusing old antivirus databases dating back to June, when nothing was known as yet about Ice\nIX. As the bot was runnung, KIS 2012 detected dangerous activity and blocked the\nprogram’s execution. No wonder: given the long history and extensive functionality of ZeuS,\nthere are quite a few criteria based on which KIS/KAV can detect this malware family’s\nmalicious code.\n\nNow, let’s move on to the significant changes that distinguish Ice IX from ZeuS 2.0.8.9 at\nleast to some extent.\n\n3) In the ZeuS configuration file, there is a section called “Web Filters” in which the botnet\noperator defines how the bot should respond when the user visits certain websites. This is\ndone using special characters “!”, “@”, “-“, “^” are used.\n\nLet’s look at the way in which the “@” character is used. It is placed before the URL (e.g.,\n@*/login.osmp.ru/*) to tell the bot to make screenshots when the user visits any addresses\nmatching the mask specified every time that the user left -clicks the mouse, and then to send\nthe screenshots to the cybercriminal. This is a mechanism that allows the cybercriminal to\nreconstruct the data entered by the user on the website using the virtual keyboard. Other\nsymbols also define specific actions to be performed by the bot. All that the author of Ice IX\ndid was to assign different characters to the same functions: the letters “N”, “S”, “C” and “B”\nhave replaced “!”, “@”, “-” and “^”, respectively.\n\n4) The last distinguishing feature is a slightly modified method used by the bot to download\nthe configuration file. In its code, ZeuS includes a hard-coded URL of a configuration file that\nanyone can download, e.g., http://www.example.com/files/config.bin. The author of Ice IX\n\n\n-----\n\nmakes the point that it is this availability of configuration files that is at the root of all\nproblems with trackers. So how does he address this issue? Here is his solution. You can no\nlonger simply download the configuration file from a URL. Instead, you must send a specially\nformed POST request to a certain address (which is actually a URL hardcoded into the bot in\nthe same location as in ZeuS 2.0.8.9). The request must include a pair of parameters:\n“id=&hash=”, for example:\n\nid=TEST_WIN_XP_B5DF77116522DF69&hash=DC0D2CAB39D49FC3D5E467501A2682C5\n\nid is the bot’s identifier calculated using the same algorithm as in ZeuS 2.0.8.9. It is used for\nthe bot’s direct communication with the C&C.\n\nThe identifier is the computer’s name with a unique 16-digit hexadecimal number added to it.\nFrom the C&C viewpoint, both the computer name and the 16-digit number can be arbitrary.\nThis identifier is encrypted using the RC4 algorithm (which ZeuS uses all the time to encrypt\ndata) in combination with an S-box that is also hardcoded into the bot. The MD5 checksum is\ncalculated for the encrypted data and sent as a hash variable. Since the bot identifier can be\narbitrary (at the most it needs to meet the COMPUTERNAME_16CHARSHEXNUMBER\nformat), the only data needed to obtain the configuration file is the S-box – it is needed to\nencrypt the bot identifier. But wait a minute. The configuration file is also encrypted using the\nsame RC4 algorithm with the same S-box. Without the S-box, the configuration file is\nuseless, a meaningless sequence of bytes. The really valuable stuff is inside the file.\n\nSo in the end it all comes down to this:\n\nBot What is needed to obtain useful data from the configuration file\n\nIce IX S-box\n\nZeuS S-box\n\nThe question is: what is it that is supposed to make trackers’ life more difficult? And the\nobvious answer is “virtually nothing”. It might perhaps take an extra half hour to run a\nsample, make a dump, and identify the changes made to known code. And that only is one is\ngoing to do the analysis and mass-download different bots’ configuration files. However,\nthere is an easier way: getting the parameters of the POST request from an infected\ncomputer’s traffic, which is a matter of a few minutes. With all the hype, you wouldn’t believe\nit!\n\nThere is a saying about sports that can be applied to this situation: It takes one athlete with a\n9-meter jump to win the Olympics not 9 athletes with 1-meter jumps. Same here: it doesn’t\nmatter how many times and on how many values are encrypted using the same algorithm\nand the same key – with the same source data, more iterations of encryption will not result in\na significantly stronger encryption algorithm. But apparently, this is not what the cybercriminal\n\n\n-----\n\nwas after, and this entire business is fraud, plain and simple. Somebody decided to make\nsome easy money by selling supposedly enhanced malware with functionality that is already\npublicly available.\n\n[Botnets](https://securelist.com/tag/botnets/)\n[Data theft](https://securelist.com/tag/data-theft/)\n[ZeuS](https://securelist.com/tag/zeus/)\n\nAuthors\n\n[Dmitry Tarakanov](https://securelist.com/author/dmitryt/)\n\nIce IX: not cool at all\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-09-14 - Ice IX- not cool at all.pdf"
    ],
    "report_names": [
        "2011-09-14 - Ice IX- not cool at all.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536119,
    "ts_updated_at": 1743041394,
    "ts_creation_date": 1653774370,
    "ts_modification_date": 1653774370,
    "files": {
        "pdf": "https://archive.orkl.eu/92d459ff29db902b7522dfdf26424d5afab3168e.pdf",
        "text": "https://archive.orkl.eu/92d459ff29db902b7522dfdf26424d5afab3168e.txt",
        "img": "https://archive.orkl.eu/92d459ff29db902b7522dfdf26424d5afab3168e.jpg"
    }
}