{
    "id": "daf63de5-87fa-4634-b16b-df1d1fa306e8",
    "created_at": "2022-10-25T16:48:10.531334Z",
    "updated_at": "2025-03-27T02:16:28.858029Z",
    "deleted_at": null,
    "sha1_hash": "41b4eaba5fe24d785a859eeed4ca45dd911ef623",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-02-17T14:53:29Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 422436,
    "plain_text": "# Click and Bait: Vietnamese Human Rights Defenders Targeted\n with Spyware Attacks\n\n**Under strict embargo until the 24[th] of February 2021 at 2am CET (8am**\n\n**GMT+7)**\n\nA new Amnesty International investigation has identified a campaign of spyware attacks targeting\nVietnamese human rights defenders (HRDs) from February 2018 to November 2020. Amnesty\nInternational’s Security Lab attributes these attacks to an attack group known as Ocean Lotus. The group\nhas been active since at least 2014, targeting the private sector and HRDs.\n\nThe spyware attacks investigated and identified by the Security Lab are the latest evidence of a\ncrackdown on freedom of expression in Viet Nam and against Vietnamese activists outside the country.\n\n## Viet Nam’s History of Online Repression\nHuman rights are increasingly under attack both offline and online in Viet Nam. Over the past 15 years,\nrepression linked to online activity has intensified, leading to a wave of harassment, intimidation,\nphysical assault, and prosecution.\n\nAmnesty International has documented multiple cases of the arrest and prosecution of HRDs in Viet\n[Nam in retaliation for their online expression since 2006. That year, former prisoner of conscience](https://www.amnesty.org/en/documents/ASA41/012/2006/en/)\n[Truong Quoc Huy was arrested at an internet café in Ho Chi Minh City. Many activists and bloggers have](https://www.amnesty.org/en/documents/ASA41/012/2006/en/)\n[been convicted for “conducting propaganda against the state.” Human rights blogger Nguyen Ngoc Nhu](https://www.amnesty.org/en/documents/asa41/4979/2016/en/)\n[Quynh (Mother Mushroom) was sentenced to 10 years in prison in June 2017 on such charges.](https://www.amnesty.org/en/documents/asa41/4979/2016/en/)\n\n[Activists and bloggers also face frequent physical assaults by officials or government-connected thugs.](https://www.hrw.org/news/2017/06/19/vietnam-end-attacks-activists-and-bloggers)\n[Police place actvists under house arresti](http://www.asianews.it/news-en/Hanoi:-Buddhist-leader-detained,-placed-under-house-arrest-29954.html) or briefly detain them to prevent them from participating in\n[public events. The government also uses travel bans to prevent activists and HRDs from going abroad](https://www.facebook.com/thao.gao/posts/3996329593718485)\nand engaging with the international community.\n\n[In December 2020, Amnesty International published “Let Us Breathe”, a report documenting the](https://www.amnesty.org/en/latest/research/2020/12/vietnam-let-us-breathe/)\nwidespread criminalization, online harassment and physical attacks faced by activists and bloggers and\nthe rising numbers of individuals detained for peacefully expressing themselves online. Amnesty\nInternational also revealed the increasing complicity of tech giants Facebook and Google in the\nVietnamese authorities’ harsh censorship regime, whereby any expression of peaceful dissent is liable to\nbe blocked or otherwise restricted.\n\nActivists and HRDs are jailed, harassed, attacked, and censored into silence on the basis of vague and\nsweeping laws that do not comply with international human rights standards. In January 2019, a\n[controversial Law on Cybersecurity came into effect in Viet Nam, granting the government broad powers](https://www.amnesty.org/en/latest/news/2018/06/viet-nam-proposed-cybersecurity-law-threatens-to-stamp-out-online-freedom/)\nto limit online freedom, to compel technology companies to hand over vast amounts of data and to\ncensor users’ content.\n\n\n-----\n\n### What is Ocean Lotus?\nThe cyber-security industry, comprised of individual and company-based researchers, routinely\nresearches and publishes information about attack groups targeting companies and governments. The\nindustry often gives informal names to groups they continuously track based on each group’s unique\ntactics and tools. Ocean Lotus (also commonly called APT32 or APT-C-00) is one of these groups.\n\n[The first known Ocean Lotus attack happened in 2014. It targeted US-based NGO Electronic Frontier](https://www.eff.org/deeplinks/2014/01/vietnamese-malware-gets-personal)\nFoundation (EFF), the Associated Press international news organization and two Vietnamese activists.\n[This group was named Ocean Lotus in a report from the Chinese company Qihoo 360 in May 2015. In](https://blogs.360.cn/post/oceanlotus-apt.html)\n[2017, the American cyber-security company FireEye published a report linking the 2014 EFF and other](https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html)\nattacks to this same Ocean Lotus.\n\nOver the years, Ocean Lotus has developed a sophisticated spyware toolkit comprised of several variants\n[of Mac OS spyware, Android spyware and Windows spyware. They also strategically compromise](https://www.volexity.com/blog/2020/11/06/oceanlotus-extending-cyber-espionage-operations-through-fake-websites/)\n[websites in order to identify visitors and conduct further targeting. More recently, Ocean Lotus was](https://www.volexity.com/blog/2020/11/06/oceanlotus-extending-cyber-espionage-operations-through-fake-websites/)\n[found creating fake media websites based on content automatically gathered online.](https://www.volexity.com/blog/2020/11/06/oceanlotus-extending-cyber-espionage-operations-through-fake-websites/)\n\nA significant part of the group’s activities is the targeting of HRDs and civil society. In 2017, the cybersecurity company Volexity revealed that over 100 websites were compromised, including many\nbelonging to human rights organizations from Viet Nam, in an attack campaign that they attributed to\nOcean Lotus. Numerous other spyware attacks linked to Ocean Lotus against human rights organizations\n[have also been reported, such as the targeting of the Cambodian human rights organizaton, LICADHOi](https://www.abc.net.au/news/2018-05-15/hackers-trigger-software-trap-after-phnom-penh-post-sale/9763906) in\n2018.\n\n[The cyber-security company FireEye describes Ocean Lotus’ operations as “aligned with Vietnamese](https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html)\n[state interests” based on the list of targeted companies and civil society groups they identified. In](https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html)\n[December 2020, Facebook published a threat report linking Ocean Lotus’ activities with a Vietnamese](https://about.fb.com/news/2020/12/taking-action-against-hackers-in-bangladesh-and-vietnam/amp/)\ncompany named CyberOne Group. Although Amnesty International was unable to independently verify\nany direct connection between Ocean Lotus and CyberOne or with the Vietnamese authorities, the\nattacks described in this investigation confirm a pattern of targeting Vietnamese individuals and\norganizations.\n\n## Attacks against HRDs\n[The investigation conducted by Amnesty International’s Security Lab revealed that two HRDs and a non-](https://www.amnesty.org/en/tech/)\nprofit human rights organization from Viet Nam have been targeted by a coordinated spyware\ncampaign. This spyware allows to fully monitor a compromised system, including reading and writing\nfiles, or launching other malicious programs.\n\n**Bui Thanh Hieu is a blogger and pro-democracy activist who goes by the**\nname “Nguoi Buon Gio” (The Wind Trader). He writes about  social and\neconomic justice and human rights. He is also critical of the Vietnamese\ngovernment’s policies and actions regarding its relations with China, including\nthe dispute over sovereignty in the South China Sea. Due to his writing and\nactivism, the licence for an Internet Café he owned in Ha Noi has been\n[revoked and he has been repeatedly subjected to reprisals. He was arrested along with activists Pham](https://www.amnesty.org/download/Documents/48000/asa410052009en.pdf)\nDoan Trang and Nguyen Ngoc Nhu Quynh in 2009 and was kept in police custody for 10 days for\n\n\n-----\n\n“abusing democratic freedoms to infringe upon the interests of the State.” In January 2013, Bui Thanh\n[Hieu reported on the trial of 14 dissidents in Viet Nam and was arrested and released a few days later.](https://danlambaovn.blogspot.com/2013/01/blogger-nguoi-buon-gio-bi-ca-bat-coc.html)\nHe has since left Viet Nam and has lived in exile in Germany since 2013.\n\n**Vietnamese Overseas Initati** **[ve for Conscience Empowerment (VOICE)i](https://vietnamvoice.org/en/)** is a nonprofit organization supporting Vietnamese refugees and promoting human rights\nin Viet Nam. It was established in 1997 in the Filipino capital of Manila as a legal\naid office, before formally registering in the United States in 2007.  The\norganization continues to operate out of Manila and has helped 3,000 Vietnamese\nrefugees resettle in third countries. Since 2011, VOICE has operated an internship programme to equip\nVietnamese people with knowledge, skills, and tools to become effective activists. The organization has\nfaced reprisals from Vietnamese authorities several times. Staff at VOICE told Amnesty International that\nemployees and interns have been harassed, banned from travelling, and have had their passports\nconfiscated when they have returned to Viet Nam. Furthermore, state-owned media has run an\n[unsubstantiated smear campaign against VOICE, claiming that the organizaton is a terrorist groupi](https://nhandan.com.vn/binh-luan-phe-phan/ve-trinh-hoi-va-to-chuc-voice-238535/) .\n\n**A blogger residing in Viet Nam has also been confirmed as an Ocean Lotus target by the Security Lab,**\nbut due to security concerns their name has been omitted. They are known to have spoken out publicly\nabout [the Dong Tam incident on 9 January 2020, when approximately 3,000 security officers from Ha](https://thediplomat.com/2020/04/dong-tam-land-dispute-exposes-vietnams-rights-and-democracy-challenges/)\nNoi raided Dong Tam village and killed the 84-year-old village leader Le Dinh Kinh. Three police officers\nwere also killed. The Dong Tam incident sparked a national outcry in Viet Nam. Activists and bloggers\nwere at the forefront of the public debate online, prompting a nationwide crackdown on online\nexpression by the government. VOICE and the two bloggers all received emails containing spyware\nbetween February 2018 and November 2020.\n\nThese emails pretended to share an important document. They either contained spyware as an\nattachment or as a link. Once downloaded and launched on the victim’s computer, the spyware would\nthen open a decoy document in line with what the email pretended to share to trick the victim in\nbelieving the file was benign.\n\n\n-----\n\n_Screenshot of the email sent to VOICE in April 2020_\n\nThe spyware identified by the Security Lab were either for Mac OS or Windows systems. The Windows\nspyware was a variant of a malware family called Kerrdown and used exclusively by the Ocean Lotus\ngroup. Kerrdown is a downloader that installs additional spyware from a server on the victim’s system\n[and opens a decoy document. In this case, it downloaded Cobalt Strike, a commercial spyware toolkit](https://www.cobaltstrike.com/)\n[developed by the American company Strategy Cyber and routinely used to lawfully audit the security of](https://www.cobaltstrike.com/contact)\n[organizations through simulated attacks. It allows an attacker full access to the compromised system](https://www.cobaltstrike.com/features)\nincluding executing scripts, taking screenshots or logging keystrokes. Unlicensed versions of Cobalt\n[Strikes have been increasingly used by attack groups, including Ocean Lotus, over the past three years.](https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/)\n\n_Example of Windows Spyware Infection Chain from one of the emails received_\n\nThe Mac OS Spyware was a variant of a malware family for Mac OS developed and used exclusively by\n[Ocean Lotus, analysed by Trend Micro in April 2018 and November 2020. It allows the perpetrator to](https://www.trendmicro.com/en_us/research/20/k/new-macos-backdoor-connected-to-oceanlotus-surfaces.html)\naccess system information, download, upload or execute files and execute commands.\n\n\n-----\n\n## Unlawful Surveillance: A Threat to Human Rights\nOur investigation was not able to attribute Ocean Lotus’ activities to any company or government entity.\nHowever, the extensive list of people and organizations targeted by Ocean Lotus over years shows that\nit has a clear focus on targeting human rights and media groups from Viet Nam and neighbouring\ncountries. This raises questions about whether Ocean Lotus is linked to Vietnamese state actors. The\nconsistent evidence linking Ocean Lotus to Viet Nam should trigger the Vietnamese authorities to\nundertake an impartial, thorough and independent investigation into the group's unlawful activities and\nhuman rights abuses.\n\nThe targeting of human rights defenders using digital surveillance technology is unlawful under\ninternational human rights law. Unlawful surveillance violates the right to privacy and impinges on the\nrights to freedom of expression and opinion, of association and of peaceful assembly. Both the Universal\nDeclaration of Human Rights and the International Covenant on Civil and Political Rights protect these\n[rights. The Covenant guarantees the right to hold opinions without interference and the right to free](https://www.ohchr.org/EN/ProfessionalInterest/Pages/CCPR.aspx)\nexpression (Article 19) and guards against arbitrary and unlawful intrusion of privacy (Article 17).\nInternational law and standards also require that any interference by the state on the right to privacy\nshould be lawful, necessary, proportional, and legitimate. States are required to ensure that individuals\n[whose rights have been violated have access to remedy (Article 2(3)). This includes the positive](https://docstore.ohchr.org/SelfServices/FilesHandler.ashx?enc=6QkG1d%2FPPRiCAqhKb7yhsjYoiCfMKoIRv2FVaVzRkMjTnjRO%2Bfud3cPVrcM9YR0iW6Txaxgp3f9kUFpWoq%2FhW%2FTpKi2tPhZsbEJw%2FGeZRASjdFuuJQRnbJEaUhby31WiQPl2mLFDe6ZSwMMvmQGVHA%3D%3D)\nobligation to take appropriate measures to prevent, punish, investigate or redress the harm caused by\nsuch acts by private persons or entities.\n\nThis targeted surveillance led by Ocean Lotus is part of a broader pattern of censorship and\ncriminalization of online expression in Viet Nam, described in depth in Amnesty International’s [“Let Us](https://www.amnesty.org/en/documents/asa41/3243/2020/en/)\n[Breathe” report. Along with the censorship of political content involving the complicity of “big tech”](https://www.amnesty.org/en/documents/asa41/3243/2020/en/)\ncompanies Google and Facebook and the criminalization of bloggers, it describes the systemic online\nharassment and abuse of activists. Against this background, these attacks further undermine the ability\nof HRDs to exercise their rights to freedom of expression, opinion and peaceful assembly. Targeting\npeople solely for peacefully exercising their human rights is unlawful. The Vietnamese government should\nconduct an independent and transparent investigation on these attacks and ensure that effective legal\nremedies are provided to people who complain of abuses of their human rights due to surveillance.\n\n## Recommendations\n\n**To Vietnamese authorities:**\n\n  - Conduct an independent, impartial, and transparent investigation into the unlawful targeted\nsurveillance of the human rights defenders mentioned in this report, including investigating the\nattack group Ocean Lotus and determining whether there are links between this spyware campaign\nand any specific government agencies\n\n  - Implement a human rights regulatory framework that governs surveillance. Until such a framework is\nimplemented, a moratorium on the purchase, sale, transfer, and use of surveillance equipment\nshould be enforced.\n\nAddressing unlawful targeted surveillance also requires changes from the Vietnamese authorities. You\n[can find a full list of recommendations in the “Let Us Breathe” report from December 2020.](https://www.amnesty.org/en/documents/asa41/3243/2020/en/)\n\n\n-----\n\n## How to protect yourself\n\n  - Be careful when receiving emails with attachments or links. If you did not expect to receive the email\nor do not know the sender, do not click on the links in the email or open attached or shared files.\n\n  - You should pay particularly close attention to shortened links, especially on social media. Attacks\noften use these – from Bitly and other shortening services – to trick you into thinking you are clicking\na legitimate link, when in fact you are being inadvertently directed to a fake site. When in doubt\n[about the shortened link, here is the guide on how to reveal full URLs](https://safecomputing.umich.edu/be-aware/phishing-and-suspicious-email/shortened-url-security#:~:text=There%20are%20a%20number%20of,tinyurl.com.)\n\n  - Be careful when a website or application asks for access to your Google account. If it asks to access\nyour emails (“Read, send, delete and manage your email”), do not accept unless you have full trust in\nthe application getting access to it.\n\n  - [Enable two-factor authentcati](https://ssd.eff.org/vi/module/l%C3%A0m-th%E1%BA%BF-n%C3%A0o-d%C3%B9ng-x%C3%A1c-minh-hai-y%E1%BA%BFu-t%E1%BB%91) ion (two-step verification) on all your accounts, especially on your\nemail.\n\n  - Make sure your operating system and applications are up to date. Avoid using pirated system\nsoftware and office tools, as serious damage can be caused to your PC by malware and spyware\nincluded within the copy of the pirated software you receive.\n\n  - Use antivirus software. Macs need this just as much as Windows computers. Make sure Windows\nDefender (if you are a Windows user), and XProtect (if you are a Mac user) are turned on.\n\n  - If you believe you have been targeted with attacks similar to the ones described in this report, please\n\ncontact us at:\n\n  - You can find more guidelines on how to protect yourself here\n\n## Appendix\nHere is the list of emails identified in this investigation:\n\n**Date** **Target** **Subject** **Spyware**\nFeb 12, 2018 Bui Thanh Hieu Thư mời thuyết trình Mac OS Spyware\ntrong HMDC Stuttgart\n2018\n\nJun 10, 2019 Bui Thanh Hieu Tài liệu quan trọng ! Mac OS and Windows\nSpyware\nOct 8, 2019 Bui Thanh Hieu Danh sách nhân sự dự Mac OS Spyware\nkhuyết Đại hội13 Đảng\nCSVN\n\nDec 20, 2019 Bui Thanh Hieu Đơn kêu cứu của gia Mac OS Spyware\nđình anh Lê Nam Trà\n\nApr 29, 2020 VOICE Some reviews about Windows Spyware\nTrinh Hoi and Voice\n\nJul 28, 2020 [REDACTED] Thanh toán hóa đơn Windows Spyware\nNov 18, 2020 [REDACTED] Yêu cầu thanh toán Windows Spyware\nNov 27, 2020 [REDACTED] Hỗ trợ truyền thông Windows Spyware\n\nFor a technical analysis of the spyware used in these attacks, see the technical analysis published on\nGithub.\n\n|Date|Target|Subject|Spyware|\n|---|---|---|---|\n|Feb 12, 2018|Bui Thanh Hieu|Thư mời thuyết trình trong HMDC Stuttgart 2018|Mac OS Spyware|\n|Jun 10, 2019|Bui Thanh Hieu|Tài liệu quan trọng !|Mac OS and Windows Spyware|\n|Oct 8, 2019|Bui Thanh Hieu|Danh sách nhân sự dự khuyết Đại hội13 Đảng CSVN|Mac OS Spyware|\n|Dec 20, 2019|Bui Thanh Hieu|Đơn kêu cứu của gia đình anh Lê Nam Trà|Mac OS Spyware|\n|Apr 29, 2020|VOICE|Some reviews about Trinh Hoi and Voice|Windows Spyware|\n|Jul 28, 2020|[REDACTED]|Thanh toán hóa đơn|Windows Spyware|\n|Nov 18, 2020|[REDACTED]|Yêu cầu thanh toán|Windows Spyware|\n|Nov 27, 2020|[REDACTED]|Hỗ trợ truyền thông|Windows Spyware|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.amnestyusa.org/wp-content/uploads/2021/02/Click-and-Bait_Vietnamese-Human-Rights-Defenders-Targeted-with-Spyware-Attacks.pdf",
        "https://www.amnesty.de/sites/default/files/2021-02/Amnesty-Bericht-Vietnam-Click-And-Bait-Blogger-Deutschland-Spionage-Menschenrechtsverteidiger-Februar-2021.pdf"
    ],
    "report_names": [
        "Click-and-Bait_Vietnamese-Human-Rights-Defenders-Targeted-with-Spyware-Attacks.pdf",
        "Amnesty-Bericht-Vietnam-Click-And-Bait-Blogger-Deutschland-Spionage-Menschenrechtsverteidiger-Februar-2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1613573609,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/41b4eaba5fe24d785a859eeed4ca45dd911ef623.pdf",
        "text": "https://archive.orkl.eu/41b4eaba5fe24d785a859eeed4ca45dd911ef623.txt",
        "img": "https://archive.orkl.eu/41b4eaba5fe24d785a859eeed4ca45dd911ef623.jpg"
    }
}