{
    "id": "dafe430a-285b-4771-8cd0-29cb95bf55c7",
    "created_at": "2022-10-25T16:48:13.336302Z",
    "updated_at": "2025-03-27T02:12:18.322194Z",
    "deleted_at": null,
    "sha1_hash": "2306d03d7e80ab6e90c753e55ed363904371a6ff",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-02-17T21:51:59Z",
    "file_modification_date": "2021-02-17T21:51:59Z",
    "file_size": 2614843,
    "plain_text": "# [RE020] ElephantRAT (Kunming version): our latest discovered RAT of Panda and the similarities with recently Smanager RAT\n\n**[blog.vincss.net/2021/02/re020-elephantrat-kunming-version-our-latest-discovered-RAT-of-Panda.html](https://blog.vincss.net/2021/02/re020-elephantrat-kunming-version-our-latest-discovered-RAT-of-Panda.html)**\n\n[Recently, ESET published a report on a supply chain attack targeting software company BigNox, taking advantage of the update](https://www.bignox.com/)\nmechanism of the NoxPlayer software - an Android emulator on PC and Mac. This software is used by many gamers in Vietnam as well as\n[in all over the world. ESET has named this campaign Operation NightScout. With the assessment that Vietnam can also have many people](https://www.welivesecurity.com/2021/02/01/operation-nightscout-supply-chain-attack-online-gaming-asia/)\ninfected due to a large number of users, we have begun to investigate and analyze further.\n\nBased on the hashes of the samples provided by ESET, we have not only re-analyzed them, but also digged deeper. We found many points\nthat the ESET did not mention in their report. At the same time, we have found a number of similarities and relationships between these\n[samples and those used in the last campaign against the Vietnam Government CertificationAuthority as well as a large Vietnamese](https://blog.vincss.net/2020/12/re018-1-analyzing-new-malware-of-china-panda-hacker-group-used-to-attack-supply-chain-against-vietnam-government-certification-authority.html)\ncorporation that we already mentioned. Not only that, we have discovered a new RAT, which is named ElephantRat.\n\n“昆明版本” means “Kunming version”\n\n[In those samples, we focus on the E45A5D9B03CFBE7EB2E90181756FDF0DD690C00C sample and analyze through to embedded PE(s)](https://www.virustotal.com/gui/file/e76567a61f905a2825262d5f653416ef88728371a0a2fe75ddc53aad100e6f46/detection)\nand execute fileless on memory to the very end. Looking for similarities in the binary pattern, we discovered another pattern that is being\nused by hackers recently, similar to the one used in our attack on large corporations in Vietnam.\n\nBecause the hacker does not use much C++ in OOP Style, the main tool we use is still IDA and the following main plugins: FindCrypt3,\n_SusanRTTI, LazyIDA._\n\nSample E45A5D9B03CFBE7EB2E90181756FDF0DD690C00C (SHA-1), in ESET report is UpdatePackageSilence.exe, has:\n\nMD5 = 06AF27C0F47837FB54490A8FE8332E04\nSHA-256 = E76567A61F905A2825262D5F653416EF88728371A0A2FE75DDC53AAD100E6F46\nCompiler time: Wednesday, 26.08.2020 08:39:20 UTC\n\nIt is the first stage in the infection chain. The way to code, execute, and behavior like VVSup.exe mentioned in the previous blog post.\nThe sample is compiled using Visual Studio 2008 (Linker version 9.00). In particular, this file has a very large overlay data at the end of\nPE, offset 0x45800.\n\n\n-----\n\nThis Exe file is also an MFC Dialog application, except that it uses MFC version 9.0 which included in Visual Studio 2008 (VVSup uses\n_MFC ver 4.2, included in Visual Studio 6), ANSI mode. And the Visual Studio that hacker used is the Chinese version, so all default_\nresource items that MFC Wizard automatically generates are in Chinese.\n\nDialog 30721 is the MFC's default \"New Item\" Dialog, the StringTable ID from 60000 is also the default resource string ID of MFC.\nHacker randomly entered the About Wizard named Exe and version number. The dialog that the hacker added was reseted to English.\nMain Dialog has ID = 102, About Dialog has ID = 100.\n\nControl IDs 1 and 2 are the default MFC Wizard generates, which are IDOK and IDCANCEL.\nButtons 3 (ID_ABORT), 4 (ID_RETRY), 5 (ID_IGNORE) are added by hacker. We need to\nnotice Button ID_ABORT 3. The main icon of the app (ID 1) is used by the hacker using the\nicons that installers often use.\n\nSusanRTTI gives us the class flowchart of the app. The figure below is part of the flowchart.\n\n[Using LazyIDA's Search features, with CSkinMfcApp and CSkinMfcDlg, we just found this one link from China, which mention about skin](http://blog.sina.com.cn/s/blog_a4b23162010162z4.html)\ndialog creation technique for MFC app.\n\n\n-----\n\nWith the addition of the CRgn class, we can believe that hackers took this entire project and made a few changes. The execution\nmechanism of a dialog-type MFC app, we released in the previous blog post, you can review but in this blog post, we just focus on the main\npoint.\n\nIn the OnInitDialog method of CSkinMfcDlg, the hacker has changed the call to the main infection task and added code:\n\nResize Dialog to 0\nHide Dialog\nChange the style of Dialog to not show the Windows Taskbar\nPost WM_COMMAND to Button ID 3\nHackers are also careful to simulate adding user left mouse to click on Button ID 3\n\nAt the AFX_MSGMAP of CSkinMfcDlg, we found the function that performs the primary infection task.\n\nWhen ExtractAndLoadOverlayDll is called, the hacker will first check if the app has read permission to the Windows\\System32 directory\nand check if the clb.dll file exists. Clb.dll is Windows file - Column ListBox. Then the hacker opens the Exe, reads the Overlay data at offset\n0x45800 and xor with 0xA0 to decrypt the PE file is a DLL. It will then manually load this DLL to memory, starting a long series of\nmanually load fileless PE.\n\nAt this ManualLoadDll function, we discovered a hacker programming error. Specifically, Malloc does not have free and wrong code:\nmalloc(sizeof(PE_LOADER_INFO)) (16 bytes) to malloc(sizeof(pLdrInfo)) (4 bytes). The PE_LOADER_INFO struct that we renamed,\nincluding 4 data members, size is 16 bytes.\n\n\n-----\n\nAfter alloc 4 byte:\n\nAfter overwrite:\n\n[About values 0xBAADFOOD and 0xABABABAB ... of VC RTL and Windows Heap Manager, you can read more here. The functions that](https://library.softwareverify.com/unusual-memory-bit-patterns)\nmanually (reflective) load overlay Dll functions are compiled into a shellcode array of bytes, embedded in the .data section, and have a\ntotal size of 0xA9E. Start at the address of the LoaderProc function: .data:00440830. 0xA95 is the RVA of constant 0x12345678, which\nwill be overwrite by the memory contents of the variable pLdrInfo after being saved by malloc, sizeof(pointer) = 4 (x86). The first byte of\nthe LoaderProc function will be modified to 0x55 = push ebp\n\nGetLoaderApiAddrs function retrieves the API addresses from kernel32.dll and ntdll.dll into a struct containing pointers to those API\n[functions. The algorithm used to calculate the hash value from the exported API name is ROR13, which is commonly used in](https://github.com/snus-b/Metasploit_Function_Hashes)\n[Metasploit. Readers can use the plugin shellcode_hashes_search_plugin.py in FireEye's Flare_ida toolkit to automatically determine the](https://github.com/fireeye/flare-ida)\nname of the API function, select the hash function ror13AddHash32AddDll. This struct has been redefined as follows:\n\n\n-----\n\nGetLoaderApiAddrs function:\n\nThe value of this struct variable in the LoaderProc function after the GetLoaderApiAddrs function is called and returned.\n\nThe remarkable point is the manual/reflective load feature is used directly with Ntdll.dll native functions, not through kernel32 functions.\nThis is possible to avoid detecting by the AV/EDR hook kernel32.dll. And it also goes with other samples and later fileless PE(s).\n\nThe code of ReflectiveLoadDll is similar to the other manually load/reflective open source. We will not talk about it again. Searching on\nGithub, Google, and VirusTotal for GetLoaderApiAddrs function, we found no such function. So we think this is a manually/reflectively\nload library that this group wrote themselves and didn't use any open source.\n\nAt this point, the Overlay Dll has been loaded and the execution flows directly into the OEP of the Dll. The parent exe does not exit\nimmediately like VVSup.exe, the fileless child dlls will call ExitProcess or TerminateProcess later.\n\n[We temporarily move to another sample that the ESET report mentioned has SHA1 = 5732126743640525680C1F9460E52D361ACF6BB0.](https://www.virustotal.com/gui/file/5c2a6b11d876c5bad520ff9e79be44dfbb05ee6a6ff300e8427deab35085bef6/detection)\nThis sample was compiled using Visual Studio 2012, built on 11/16.2020 08:35:32 UTC, also an MFC app, however no longer Dialog app\nbut a Doc - View app, using new MFC Ribbon classes. As a result, the amount of code and classes are bigger, and it is possible that the first\nstage uses the latest MFC of this group. Hackers no longer rely on extrac32.exe to extract embedded Cab files, but write a CCabinet class\n[using Cabinet API functions available from Windows to unpack.](https://docs.microsoft.com/en-us/windows/win32/devnotes/cabinet-api)\n\nPDB path =\n\"C:\\Users\\enWin7x64\\Desktop\\XActor\\CreateServer_src\\XActorCreateServer\\DATA_RES\\CommandoLoader\\mfeesp\\Release\\mfeesp.pdb\nexecutable code that extracts two cab files from the resource is written directly into the InitInstance function of the CmfeespApp class.\nAnd LBTServ.dll malware file is extracted from the cab file is a Dll, written in Delphi and built using Embarcadero's latest RAD Studio\n10.4 Sydney. This could be a shift to another language, compiler/IDE for future malware development of this group. For the purposes and\nscope of this article, we do not present these samples.\n\nBack on the above Dll overlay, after extracting, we have a DLL with the following information:\n\nSize = 557,056 bytes\nMD5 = 054E07CB00E9B21786E2815E9B43CDA9\nSHA256 = 8BF3DF654459B1B8F553AD9A0770058FD2C31262F38F2E8BA12943F813200A4D\nCompile time: Monday, 17.08.2020 09:56:11 UTC\nVisual Studio 6\nThere is no PDB path and export, so the original DLL name could not be determined.\n\n\n-----\n\nThe size of the .data section is large, after running FindCrypt3, we found that there were large data. All the main tasks of this Dll reside\nentirely within the DllMain function. When DllMain is called with fdwReason other than DLL_PROCESS_ATTACK, hacker checks\nwhether the Dll can OpenProcess with System Process (PID = 4) with the highest permissions 0x1F0FFF or not. If OpenProcess succeeds,\nit will return TRUE and do nothing next. Then hacker read from the parent Exe, use the MemSearch function as in VVSup.exe to find and\nextract the C&C information and save it into a file C:\\ProgramData/resmon.resmoncfg. The small difference is that VVSup uses\nMemSearch to get the C&C info from the parent to write in the child's Dll. And here is the Dll child search back from the parent Exe.\n\nWrite C&C info to resmon.resmoncfg file\n\nByte array is the mask for searching is “3F 3E 2F 1E 7F 7E 6F 2E 1F 1E 00 03 3F 3E 2F 4E”. File size of resmon.resmoncfg file is 1550\nbytes, copy the content from mask offset + 47.\n\nHackers also use the MakeSureDirectoryPathExists export function from dbghelp.dll to create directory, same as VVSup, and also use a lot\nof global variables, strings, and arrays. There is a lot of redundant code such as getting CreationTime, LastAccessTime, LastWriteTime of\nthe csrss.exe file system that is not used, and initializing unused strings. Create Sandboxie directory, attribute hidden and system\n\n\n-----\n\nDll continues to unpack embedded data in DLL into files: SbieIni.dat, SbieDll.dll, SandboxieBITS.exe and saves them into\n_C:\\ProgramData\\Sanboxie._\n\nThe compression and decompression algorithm that hackers use here is the LZMA algorithm. LZMA's SDK can be downloaded and\n[referenced here. The LZMA algorithm identifier used is LZMA_PROPS_SIZE = 5 and the first 8 bytes of the struct CLzmaProps at the](https://www.7-zip.org/sdk.html)\nbeginning of the data compressed.\n\nThe uncompressed function, the size of the compressed data is passed in minus 4, the size value of the uncompressed data region DWORD\nimmediately preceded the data compressed.\n\nBut especially the hacker has changed in the code of this LZMA algorithm, so if we statically extract these compressed data areas\naccording to the above information then when decompressing with 7z or tool, lib will normally error, but It is still possible to extract the\nfirst area of the correct data compared to the results when debugging and dumping.\n\n\n-----\n\nUsing this custom LZMA compression algorithm, we also found in a new sample SManager RAT plugin, uploaded to the first VirusTotal\non 23/01/2021:\n\nMD5 = 0603145EFAD6A63F52B6D5161CC5E5AE\n[SHA256 = 321045519CC3A50CE7948C33C6BBC837B063CD878F8C2CE67DC8DE0825515E10](https://www.virustotal.com/gui/file/321045519cc3a50ce7948c33c6bbc837b063cd878f8c2ce67dc8de0825515e10/submissions)\nFile name: SuperShellC_x86.dll\n\nIn this DLL file, the CSuperShellC class has the task of extracting an embedded Exe, the original name is ssh_server.exe.\n\nThis LZMA algorithm continues to be improved by hackers, so with static dump we could not open, we had to debug and dump it.\n\nReturn to Overlay Dll, after extracting 3 files x86 files into C:\\ProgramData\\Sandboxie folder, Dll continues to check if itself has write\npermissions to the System32 directory and target Windows operating system is x64 or not. If all is passed, Dll will extract two additional\nfiles SbieMsg.dll and SbieMsg.dat into that directory.\n\n\n-----\n\nAt the HavePermission function, hacker will create a random file in System32, the first name is wmkawe_ and the content is only one line\nof text: \"Stupid Japanese\".\n\nIn addition, the hacker also checks to see if there are two files with the same random name wmkawe_xxx.data in the two folders:\n\"%LOCALAPPDATA%\\VirtualStore\\Windows\\System32\\\" and \"% LOCALAPPDATA%\\VirtualStore\\Windows\\SysWOW64\\\", if any, it\nwill be deleted. The function will check in the targeted machine OS is Windows, hacker doesn't use the usual IsWow64Process API\nfunction, but uses the GetNativeSystemInfo API function.\n\nAfter extracting two more files SbieMsg.dat and SbieMsg.dll, Dll will load SbieMsg.dll by using rundll32.exe utility of Windows, call the\nexported function is \"installsvc\", pass the parameter as \"ByPassUAC\".\n\nIf it's not Windows x64, SandboxieBITS.exe will be called with the parameter \"ByPassUAC\" aswell. And if there is no write permission to\nSystem32, the Dll just calls SandboxieBITS.exe with the parameter \"InsertS\". Finally, Dll will create bat file to delete parent Exe itself and\nthe bat file itself and then exit parent Exe.\n\nThe SelfDelete execute cmd.exe function in the hidden window, idle priority and disable Ctrl-C/Ctrl-Break.\n\n\n-----\n\nAt this point, stage one of the infection is complete. Stage 2 starts from executing SandboxieBITS.exe or SbieMsg.dll (x64) run as a service\nDll.\n\nWe would like to stop here and publish the following sections when the time appropriate.\n\nWe wish you a happy new year!\n\n_[Click here for Vietnamese version.](https://blog.vincss.net/2021/02/re020-elephantrat-phien-ban-Con-Minh-dong-RAT-moi-cua-Panda.html)_\n\n**Truong Quoc Ngan (aka HTC)**\n\n**Malware Analysis Expert - VinCSS (a member of Vingroup)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2021.02.01.ElephantRAT/blog.vincss.net-RE020%20ElephantRAT%20Kunming%20version%20our%20latest%20discovered%20RAT%20of%20Panda%20and%20the%20similarities%20with%20recent.pdf"
    ],
    "report_names": [
        "blog.vincss.net-RE020 ElephantRAT Kunming version our latest discovered RAT of Panda and the similarities with recent"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "068b67c8-604c-4272-b808-350413fa9ee3",
            "created_at": "2022-10-25T16:07:23.975708Z",
            "updated_at": "2025-03-27T02:02:10.058689Z",
            "deleted_at": null,
            "main_name": "Operation NightScout",
            "aliases": [],
            "source_name": "ETDA:Operation NightScout",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b5550c4e-943a-45ea-bf67-875b989ee4c4",
            "created_at": "2022-10-25T16:07:23.675771Z",
            "updated_at": "2025-03-27T02:02:09.918749Z",
            "deleted_at": null,
            "main_name": "Gelsemium",
            "aliases": [
                "Operation NightScout",
                "Operation TooHash"
            ],
            "source_name": "ETDA:Gelsemium",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agentemis",
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "Chrommme",
                "Cobalt Strike",
                "CobaltStrike",
                "FireWood",
                "Gelsemine",
                "Gelsenicine",
                "Gelsevirine",
                "JuicyPotato",
                "OwlProxy",
                "Owowa",
                "SAMRID",
                "SessionManager",
                "SinoChopper",
                "SpoolFool",
                "SweetPotato",
                "WolfsBane",
                "cobeacon",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041538,
    "ts_creation_date": 1613598719,
    "ts_modification_date": 1613598719,
    "files": {
        "pdf": "https://archive.orkl.eu/2306d03d7e80ab6e90c753e55ed363904371a6ff.pdf",
        "text": "https://archive.orkl.eu/2306d03d7e80ab6e90c753e55ed363904371a6ff.txt",
        "img": "https://archive.orkl.eu/2306d03d7e80ab6e90c753e55ed363904371a6ff.jpg"
    }
}