{
    "id": "db2aa65d-efe3-46ef-85a3-974c9d5057d5",
    "created_at": "2023-06-05T02:08:03.657793Z",
    "updated_at": "2025-03-27T02:16:55.6418Z",
    "deleted_at": null,
    "sha1_hash": "0731570b0255d1da2c600299db4eb521b08b30e9",
    "title": "2023-05-23 - Kimsuky - Ongoing Campaign Using Tailored Reconnaissance Toolkit",
    "authors": "",
    "file_creation_date": "2023-06-04T13:51:55Z",
    "file_modification_date": "2023-06-04T13:51:55Z",
    "file_size": 605052,
    "plain_text": "# Kimsuky | Ongoing Campaign Using Tailored Reconnaissance Toolkit\n\n**[sentinelone.com/labs/kimsuky-ongoing-campaign-using-tailored-reconnaissance-toolkit/](https://www.sentinelone.com/labs/kimsuky-ongoing-campaign-using-tailored-reconnaissance-toolkit/)**\n\nAleksandar Milenkoski\n\n**By Aleksandar Milenkoski and Tom Hegel**\n\n## Executive Summary\n\nSentinelLabs has observed an ongoing campaign by Kimsuky, a North Korean APT\ngroup, targeting North Korea-focused information services, human rights activists, and\nDPRK-defector support organizations.\nThe campaign focuses on file reconnaissance and information exfiltration using a\nvariant of the RandomQuery malware, enabling subsequent precision attacks.\nKimsuky distributes RandomQuery using Microsoft Compiled HTML Help (CHM) files,\ntheir long-running tactic for delivering diverse sets of malware.\nKimsuky strategically employs new TLDs and domain names for malicious\ninfrastructure, mimicking standard .com TLDs to deceive unsuspecting targets and\nnetwork defenders.\n\n## Overview\n\nSentinelLabs has been tracking a targeted campaign against information services, as well as\norganizations supporting human rights activists and defectors in relation to North Korea. The\ncampaign focuses on file reconnaissance, and exfiltrating system and hardware information,\nlaying the groundwork for subsequent precision attacks. Based on the infrastructure used,\nmalware delivery methods, and malware implementation, we assess with high confidence\nthat the campaign has been orchestrated by the Kimsuky threat actor.\n\nKimsuky is a suspected North Korean advanced persistent threat (APT) group known for\ntargeting organizations and individuals on a global scale. Active since at least 2012, the\ngroup regularly engages in targeted phishing and social engineering campaigns to collect\nintelligence and gain unauthorized access to sensitive information, aligning with the interests\nof the North Korean government.\n\nLately, Kimsuky has been consistently distributing custom malware as part of\nreconnaissance campaigns to enable subsequent attacks. For example, we recently\n[revealed the group’s distribution of ReconShark through macro-enabled Office documents.](https://www.sentinelone.com/labs/kimsuky-evolves-reconnaissance-capabilities-in-new-global-campaign/)\n\n\n-----\n\nThe campaign we discuss in this post indicates a shift towards using a variant of the\n[RandomQuery malware that has the single objective of file enumeration and information](https://download.ahnlab.com/global/brochure/ATIP_2023_Jan_Threat-Trend-Report-on-Kimsuky-Group.pdf)\n[exfiltration. This stands in contrast to recently observed RandomQuery variants supporting a](https://asec.ahnlab.com/wp-content/uploads/2023/04/ATIP_2023_Feb_Threat-Trend-Report-on-Kimsuky-Group.pdf)\nwider array of features, such as keylogging and execution of further specialized malware.\n\nRandomQuery is a constant staple in Kimsuky’s arsenal and comes in various flavors. This\ncampaign specifically uses a VBScript-only implementation. The malware’s ability to exfiltrate\nvaluable information, such as hardware, operating system, and file details, indicates its\npivotal role in Kimsuky’s reconnaissance operations for enabling tailored attacks.\n\nThis campaign also demonstrates the group’s consistent approach of delivering malware\n[through CHM files, such as keylogging and clipboard content theft malware. In line with their](https://asec.ahnlab.com/en/49295/)\nmodus operandi, Kimsuky distributes the RandomQuery variant we observed through this\nvector.\n\nFinally, this campaign highlights Kimsuky’s recent extensive use of less common top-level\ndomains (TLDs) for their infrastructure, such as .space, .asia, .click, and .online. The\ngroup also uses domain names that mimic standard .com TLDs, aiming to appear legitimate.\n\n## Initial Targeting\n\nKimsuky makes use of specially crafted phishing emails to deploy RandomQuery. The\nphishing emails are sent to targets from an account registered at the South Korean email\nprovider Daum, a standard Kimsuky phishing practice. Recent sender email addresses\ninclude bandi00413[@]daum.net.\n\nThe phishing emails, written in Korean, request the recipient to review an attached document\n[claiming to be authored by Lee Kwang-baek, the CEO of Daily NK. Daily NK is a prominent](https://www.dailynk.com/english/)\nSouth Korean online news outlet that provides independent reporting on North Korea,\nmaking them a prime organization for impersonation by DPRK threat actors looking to\nappear legitimate.\n\nKimsuky phishing email (in Korean)\n\n\n-----\n\nThe attached document is a CHM file stored in a password-protected archive. Aligning with\nthe targeting focus of Kimsuky in this campaign, the lure document is entitled “Difficulties in\nactivities of North Korean human rights organizations and measures to vitalize them” and\npresents a catalog of challenges pertaining to human rights organizations.\n\nLure document snippet (in Korean)\nConsistent with known Kimsuky tactics, the CHM file contains a malicious Shortcut object\nthat activates on the Click event. The object:\n\nCreates a Base-64 encoded file in the %USERPROFILE%\\Links\\ directory, such as\n```\n   mini.dat.\n\n```\nDecodes the file using the certutil utility, creating a VB script, and then stores the\nscript in a separate file, such as %USERPROFILE%\\Links\\mini.vbs.\nEstablishes persistence by editing the\n```\n   HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run registry key, such that the\n\n```\nnewly created VB script is executed at system startup.\n\nShortcut object\nThe VB script issues a HTTP GET request to a C2 server URL, for example,\n```\nhttp[://]file.com-port.space/indeed/show[.]php?query=50, and executes the second\n```\nstage payload returned from the server. Based on overlaps in code documented in previous\n\n\n-----\n\n[work, we assess that the second-stage payload is a VBScript RandomQuery variant.](https://download.ahnlab.com/global/brochure/ATIP_2023_Jan_Threat-Trend-Report-on-Kimsuky-Group.pdf)\n\nExecution of a RandomQuery variant\n\n## Dissecting RandomQuery\n\nThe RandomQuery variant that Kimsuky distributes first configures the Internet Explorer\nbrowser by editing registry values under HKCU\\Software\\Microsoft\\Internet\n```\nExplorer\\Main:\n\n```\nSets Check_Associations to no: The system does not issue a notification if Internet\nExplorer is not the default web browser.\nSets DisableFirstRunCustomize to 1: Prevents Internet Explorer from running the\n```\n   First Run wizard the first time a user starts the browser.\n\n```\nRandomQuery also sets the registry value\n```\nHKCU\\Software\\Microsoft\\Edge\\IEToEdge\\RedirectionMode to 0, which stops Internet\n\n```\nExplorer from redirecting to the Microsoft Edge browser.\n\nRandomQuery configures Internet Explorer\nThese Internet Explorer configurations enable the uninterrupted use of the browser by\nRandomQuery, whose earlier variants are known to use the\n```\nInternetExplorer.Application object when communicating with C2 servers. However, the\n\n```\nRandomQuery variant we analyzed does not use this object, but leverages\n```\nMicrosoft.XMLHTTP for this purpose.\n\n```\nRandomQuery then proceeds to gather and exfiltrate information about the infected platform,\nstructured into three classes that the malware refers to as Basic System, Specific Folder,\nand Process List.\n\n\n-----\n\nThe malware first gathers system and hardware information using the\n```\nWin32_ComputerSystem, Win32_OperatingSystem, and Win32_Processor WMI classes, such\n\n```\nas: computer name, processor speed, OS version, and the amount of physical memory\navailable to the system. RandomQuery refers to this information as Basic System\ninformation.\n\nRandomQuery gathers Basic System information\nRandomQuery then enumerates subdirectories and files within particular directories by\n[specifying them using ID numbers of the Windows ShellSpecialFolderConstants](https://learn.microsoft.com/en-us/windows/win32/api/shldisp/ne-shldisp-shellspecialfolderconstants)\nenumeration: Desktop (ID 0); Documents (ID 5, for example, C:\\Users\\\n```\n[username]\\Documents); Favorites (ID 6, for example, C:\\Documents and Settings\\\n[username]\\Favorites); Recent (ID 8, for example, C:\\Users\\\n[username]\\AppData\\Roaming\\Microsoft\\Windows\\Recent); Program Files (ID 38, for\n\n```\nexample, C:\\Program Files); Program Files (x86) (ID 42, for example, C:\\Program Files\n```\n(x86) on 64-bit platforms); and %USERPROFILE%\\Downloads (ID 40, for example, C:\\Users\\\n[username]\\Downloads).\n\n```\nThe malware refers to this information as Specific Folder information: It provides the\nattackers with a wealth of user- and platform-related information, such as installed\napplications, user document details, and frequented websites.\n\n\n-----\n\nRandomQuery gathers Specific Folder information\nRandomQuery also enumerates the process and session IDs of running processes using the\n```\nWin32_Process WMI class. The malware refers to this information as Process List\n\n```\ninformation.\n\nRandomQuery gathers Process List information\nTo exfiltrate the gathered information, RandomQuery first Base64-encodes it, and then\nconstructs and issues an HTTP POST request containing the information to a C2 server URL\n(for example, http[://]file.com-port.space/indeed/show[.]php?query=97). We\nobserved that the C2 URLs RandomQuery uses for exfiltration overlap with the URLs from\nwhich RandomQuery itself is downloaded, with a difference in the value of the query\nparameter.\n\n\n-----\n\nRandomQuery exfiltrates information\nThe variants we analyzed use c2xkanZvaXU4OTA as a boundary string separating header\nvalues from the exfiltrated information stored in the POST request. Pivoting on this string\nenabled us to identify additional RandomQuery variants used by Kimsuky in the past. This is\na further indication of the threat group consistently using this malware in its targeted\ncampaigns.\n\nThese variants differ to various extents from those we observed in Kimsuky’s latest\ncampaign. This includes features such as enumeration of deployed security products, focus\non Microsoft Word documents when enumerating files, and execution of additional malicious\ncode. Kimsuky continuously adapts its RandomQuery arsenal to the task at hand, with the\ncurrent iteration focussing on information exfiltration and file reconnaissance.\n\n## Infrastructure\n\nKimsuky has made extensive use of less common TLDs during their malicious domain\n[registration process. In our recent reporting on Kimsuky’s ReconShark activity, we noted](https://www.sentinelone.com/labs/kimsuky-evolves-reconnaissance-capabilities-in-new-global-campaign/)\nmultiple clusters of malicious domains which made use of the same technique.\n\nThis latest campaign is tied to infrastructure abusing the .space, .asia, .click, and\n```\n.online TLD’s, combined with domain names mimicking standard .com TLDs. Noteworthy\n\n```\nexamples include com-def[.]asia, com-www[.]click, and com-otp[.]click. Placed into a\nfull URL path, an average user is less likely to spot obvious suspicious links.\n\n\n-----\n\nCampaign-related domain registration timeline\nFor this latest campaign, the threat actor used the Japan-based domain registration service\nOnamae for primary malicious domain purchasing. This particular cluster of activity began on\nMay 5th 2023, and continues as of this report. ABLENET VPS Hosting is used by the actor\nfollowing domain registration.\n\n## Conclusion\n\nWe continue to closely monitor the persistent attacks carried out by Kimsuky and its\ncontinuously advancing attack toolkit. These incidents underscore the ever-changing\nlandscape of North Korean threat groups, whose remit not only encompasses political\nespionage but also sabotage and financial threats.\n\nIt is imperative for organizations to familiarize themselves with the TTPs employed by\nsuspected North Korean state-sponsored APTs and to adopt appropriate measures to\nsafeguard against such attacks. The correlation between recent malicious activities and a\nbroader range of previously undisclosed operations attributed to North Korea emphasizes\nthe importance of maintaining a state of constant alertness and fostering collaborative\nefforts.\n\n## Indicators of Compromise\n\n### SHA1 Hashes\n\n96d29a2d554b36d6fb7373ae52765850c17b68df\n\n84398dcd52348eec37738b27af9682a3a1a08492\n\n912f875899dd989fbfd64b515060f271546ef94c\n\n49c70c292a634e822300c57305698b56c6275b1c\n\n8f2e6719ce0f29c2c6dbabe5a7bda5906a99481c\n\n0288140be88bc3156b692db2516e38f1f2e3f494\n\n\n-----\n\n### Domains\n\ncom-port[.]space\n\ncom-pow[.]click\ncom-def[.]asia\n\ncom-www[.]click\n\ncom-otp[.]click\n\ncom-price[.]space\n\nde-file[.]online\n\ncom-people[.]click\n\nkr-angry[.]click\n\nkr-me[.]click\n\ncf-health[.]click\n\ncom-hwp[.]space\n\ncom-view[.]online\n\ncom-in[.]asia\n\nko-asia[.]click\n\ndb-online[.]space\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-23 - Kimsuky - Ongoing Campaign Using Tailored Reconnaissance Toolkit.pdf"
    ],
    "report_names": [
        "2023-05-23 - Kimsuky - Ongoing Campaign Using Tailored Reconnaissance Toolkit.pdf"
    ],
    "threat_actors": [
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1685930883,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1685886715,
    "ts_modification_date": 1685886715,
    "files": {
        "pdf": "https://archive.orkl.eu/0731570b0255d1da2c600299db4eb521b08b30e9.pdf",
        "text": "https://archive.orkl.eu/0731570b0255d1da2c600299db4eb521b08b30e9.txt",
        "img": "https://archive.orkl.eu/0731570b0255d1da2c600299db4eb521b08b30e9.jpg"
    }
}