{
    "id": "db4a20cc-d8a4-4366-8ee5-8cdec2ea0ec5",
    "created_at": "2022-10-25T16:48:23.923378Z",
    "updated_at": "2025-03-27T02:05:56.837636Z",
    "deleted_at": null,
    "sha1_hash": "fc2c278b8a87914117c0d5bcb679b463272cb5de",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-05-21T14:42:37Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 6392559,
    "plain_text": "```\n                      PROCUREUR GENERAL DU\n                   CANADA REPRESENTANT LES\n                     ETATS-UNIS D’AMERIQUE,\n                       ayant une adresse au Ministére do\n                           la Justice Canada, 284, Wellington\n                         Street, Ottawa, ON, Canada KIA\n                     OH.\n                      INTIME\n                LISTE DES ANNEXES\n                                                                                       |\n      Annexe 1 Enliasse\n                + Request for Provisional Arrest to Canada\n              * Statementof facts supporting the Provisional Arrest of\n              Sebastien Vachon-Desjardins\n              + Mandat d'arrestation émis par les Etats-Unis d'Amérique\n      Annexe 2 Autorisation de demander émission d'un mandat d'arrestation\n             provisoire\n                                   EY\n\n```\n\n-----\n\n```\n      Annexe 5 Arété Introductf instance\n      Annexe 6 Affidavit de Louisette Vachon (mére)\n      Annexe 7 Affidavit de Robert Desjardins (pére)\n      Annexe 8 Affidavit du Requérant\n        Et J'AI SIGNE a Montréal, ce 3 mai 2021\n       IC 3 [)\n      Me Régirial Victor\n       Procurgut du\\Requégant\n                          a\n\n```\n\n-----\n\n```\n          ur Supérieure\n      Palais de justice de Gatineau\n      17 Rue Laurier,\n      Gatineau, Québec\n     JBX 4C1\n      Courriel :geriS50@justice.gouv.qc.ca\n      PRENEZ AVIS que la présente requéte en mise en liberté sera présentée pour\n       adjudication devant honorable juge Catherine Mandeville j.c:s. au palais de\n       justice de Gatineau, sis 17 Rue Laurier, les 12 et 13 mai 2021, 4 9h30 ou aussitot\n      que le Conseil pourra étre entendu.\n       Veuillez agir en conséquence.\n       SIGNE A MONTREAL\n      Le 3 mai 2021\n       [\n   I~)\n   ALL\n          ie [REginal Victorin\n        Propuireur du Reduérant\n      V\n                          2\n\n```\n\n-----\n\n-----\n\n```\n       “Fhe United States Ataeney's Office, Middle District ofFlorida, Tampa Division\n     A IDENTIFICATION OF FUGITIVE;\n       Name: SebastienVachon.Desjardins, sa Sebastien Vachon\n       Country ofCitizenship: Conada (Quebes drvers license tached)\n    Dateof ia: July 11, 1987\n       Place ofBirth: Unknow,\n       Race: Caucasian\n       Gender: Male\n      HeightWeight 173 am, unkiova\n         ‘Hair/EyeColor: Brown, Brown\n       SearsOtherCharacteristics: Unknown\n       Photographs Attached.\n       Drivers License No. V2536-110787-04 State ssued: Quebec\n        ‘SpecificAddressExact Location in Canada: 36 Rue Desfoges, JR 2W1, Gtineay, Quebec\n\n```\n\n-----\n\n```\n         . Charging Or Commitment Document\n       Indictment (copy attached\n         Number: $:20.c1366-T-025PF\n          DateFiled: December 2, 2020\n         United States Distt Cour, Middle DistrictofFlorida, TampaDivision\n       saraHas the the Charging US. Sate DocumentDeparuint been unsealed and a foreign (0, bocn govermncrt unsealed for for purposesth limited ofxtrdiony? purpose of\n          YES\n     2 Minimum Sentence\n      Offs for which extradition i requested sr punishable by at east ore year prison:\n       yes\n        3. Statuteof Linitations (Atached)\n         Does statueof limitations preclude prosecutiono incarcertion?\n       xo\n     4 US. Arrest Warzant (tached)\n         Fugitive s wanted to Sand Teta\n        Number: 20.c-366-T-0257F\n         Date Filed: December 2, 2020\n       sued By: Jessica Dahl\n\n```\n\n-----\n\n```\n         2 Prosecutor Authorization\n         Provide the nameof heprosecutorauliorizing this PA request\n          Carlton Gammon\n          Assistant US. Atomey\n         400 N. Tampa Stee, Suite 3200, Tap, Florida 33602\n         Phonc: (813) 301-3081\n         mail:Carlton Gammors@usdoj gov\n         BY SUBMITTING THIS FORM, THE PROSECUTOR COMMITS TO:\n         (1) PREPARING A FINAL FXTRADITION REQUEST WITILN THE TIME:\n          SPECIFIED BY OIA UPON THEARRESTOF TIIE FUGITIVE IN CANADA; AND\n           (2) ACCEPTING RESPONSIBILITY FOR EXTRADIFION-RELATED COSTS.\n\n```\n\n-----\n\n```\n            2. Since at least as early as in ox around March 2020, NetWalker has been advertised as\n      sensomvare-as-a-service (\"RaaS\")!mide up of developers end afilates. Under this model, developers\n       (or the “NetWalker organization”) ar responsible for creating and updating fhe ransomware, and aking\n        it availble through agreements with “afliates”. Aflates ar individualso groupsofindividuals who\n      ‘onduet research in order to ident high-value victims, aad who actually lunch the slacks oa victim\n      networks by using the ransomaare cod packsges aud tools oblained rom Netwalkes organization. FBI\n     guts have observed, in connection with various Netwalker investigations, tat the NetWalker afflites\n       are identification (1D) nunber and not by name. As more fully set orth below, the FBI has identificd\n      Sebastien Vachon-Desjarding os an afliateof Netwalker, also known as User 125,\n          3. Aer a victim pays the demanded ransom according the instructions provided by the\n       affiliate, the ransom is split between the Netwalker developers (he NetWalke organization) and afflstes\n       in accordance with thei agreement. On or about March 20, 2020, an individual using the moniker\n      “Bugatti” posted an sdvertsemet on acybercriminal foram for NetWalker es a ReaS. The post—witien\n      inthe Russian language with Cyrillic characters—outlined the process to become a NetWalker aiiae,\n              * Blagents with raininga experience i rarsommvar investigationssr war that“rasomvare” aac the\n       useofspecific malicioss computer code fo inflate and niet ths ges compute. The code J bh eas to\n    itheaccessarson”thedatand ncypt typically eyvariouspossesmadeforms i, na in iselfaformof dt,of valuablerypocurrey, such at commoeity Ui vncsuch-oftheascithr coi.daabecousecont Victims iti decryptaressential targetedoracesothe speileally lesoperations hey becuseof ay.the\n      farted vik, or consistsof ighlysensitive persona or sania dataofdivas, whic, ecssod\n      could viletheprivacy or ole hts ofth individu Tho roleofsuch informatio would ls expose the\n      argoted victimto civil ardoreroial Gabi.\n     TBI agents with tang and experience ia ransomvare investigations ae awaro that Netwatke rasomware\n       products,ed ctor consistingwh intend ofbundictal seiofcomputer digital code daa and ls tools, for nancial is marketed gan nd sod on he dark web spciicaly to\n                      Page tof\n\n```\n\n-----\n\n```\n       ‘confidential etaofindividuals, whic,ifleased couldexpose those individualo he tered entity to\n       civil or criminal Habit. 1€ victimdoes not py theransom, the stolen data is often published online.\n         6. Since a leas is or round May 2020, a website named “the NetWalker Blog? (the Blog)\n      hes cxistod—also on the dark web—for the exclusive purpose of fcilatng the publication of stolen\n      victimdata. The Blogis accessibletoanyonewhouses the darkweb, and might seektouse it as3\n      resource for the various types ofciminal conduct,\n           7. The NetWalker Blogi not encrypted, but is freely accessible to anyone onthedark web.\n      FBI agents who accessed the Blog observed tha,atimes, the NetWalkerBlogbas provided links to a\n      cloud storage and file hosting service, MEGANZ (MEGA), where stolen ransomuare vietim data had\n     ‘en uploaded. The NetWalker Blo lists the victin company or entity, sunimaryofthe company’s\n      servis, and either a lik tothe stolen data oF when it ill be published. The NetWalker Blog also posts\n      inks to sxeenshotsof daa stolenfom victiuns, in an apparentatempt 1o prove hat thesensitivedeta has\n      infact been stolen.\n     RansomusareAttacks\n            8. OnoraboutMay 1, 2020, etelecommunications company headquartered inFlorida (Victim\n      #1) received a ransom note on one or wore of its workstations indiceting its network had been\n      ‘compromised by tae NetWalker Rausomware. Victim #1's confidential business data was stolen and\n      encrypted. The tausora demandedwas approximately US $300,000i bicoin, whichVictim#1 did not\n       pay. Victim 1, however, estimated having spent spproximately US $1.2 millon to respond to the atack,\n      contain its damage, and restore operations o normal. Forcsic analysis by Vieim #1 of ifs computer\n      network revealed that on or about April 30, 2020, aserverusing I addross 193.56.28100 later identified\n     TheealerTorFalees tothe darkwe se conelled by the NeclkerdeslerheNether\n       crgmization.\n                     vagezar7\n\n```\n\n-----\n\n```\n            11. FBI conducted surveillance of Poland Server #1 from tho United States, and discovered\n       that it contained. un sbundanceof hacking tools, including those used to perform reconnaissance, clevate\n       privileges, and steal information rom & computer or network. Poland Server #1 also contained folders\n       with customized sansomware deployment packages, also known as a “build” Each build is a zip file\n       containing an executable file, PowerShell script, and text file identifying the vitim—all the tools\n       necessary fo execute a ransomware tack. Tn tote], investigators discovered 12 builds on Poland Server\n       #1 that had names of identified NetWalker victims, including both Vietira #1 and Victim #2.\n           12. Onor about May 13, 2020, FB investigators observed a new build on Poland Server #1\n       fora transport logisticscompanyheadquaatered ia France(Victim#3), and notified the FBI Legal Attaché\n       that covers France. Unforturately, thecompanydid not receive the notiiestion quickly enough. Victim\n      #3 received a ransom uote on oceormore of its workstations onorahout May 15, 2020, indicating its\n      network had been compromised by the NetWalker Ransomware. The initial ransom demanded was\n       spproximatcly US $50,000, and subsequently increased to approximately US $2,000,000 the same day.\n      Victim #3 did not pay the ransom. On or sbout May 26, 2020, FBI investigators observed on the\n      NetWalker Blog that Victim #s stolen data would be published on or about May 30, 2020, and elso\n       posted a screenshot ofthescasitivedata. FBI determined that, onorshout May 30, 2020, Victim #3's data\n      was linked on the NetWalker Blog via MEGA, the cloud storage and file hosting service used by the\n      NetWalker organization to post stolen date.\n          13. On orabout June 3, 2020, an education institution headguistered in California (Victim #4)\n       received a ransom note indicating its network had ben compromised by the NetWelker Rensomware.\n       * Pulse Secure VP, is a commercial service designed o provid secure, authenticatedaccessfo remoteand mobile\n      usersfromanyweb enabieddevicetocorporate resources,I thicas, the VPNwasbeing usedbyVictim 135 partof\n       ts norma business operations.\n                      Page3ol7\n\n```\n\n-----\n\n```\n                 ursaent 10 a Mutual Legal Assistance Treaty request. FBI authorities\n      conducted & forensic analysis of the servers. Tho contents of Poland Server #1 had largely been wiped\n       clean. The recyele bin, however, did contain a directory with the same files that investigators had\n      previously observed, including those relatingto Victim #1, Victim #2, and Victim #3.\n          15. The contentsofPolandServer#2 provided connections to a individual named “Sebastien\n       Vachon.” On the server, FBI investigators discovered a fil named *2.png.” that depictedascreenshot af\n      several files. According to the metadata attached o these files, * “Sebastien Vachon” had created snd\n      ‘modified at least one ofthe files s recently as ino around June 2020, The server also provided clues ss\n       to the locationof ts user. In or roundJune 2020,the Google Chromeautofillfanction indicated that the.\n      userhid saved the address “36 Desforges, Gatineau, J8R 2/1.” Also, in July 2020, the user had viewed\n      a webpage wracking the delivery ofa physical package that had been sent to Gatincay, Quebec.\n          16. The contentsofPoland Server #2 also provided additonal connections to the NetWalker\n      Ransomware sorvices. According fo the web history data on thal server, NetWalkes Uses ID 128, whom\n     the FBI hes reason to believe,based oncircumstantial dat, is Vachon,had registeredonthecybercriminel\n      foram (discussed in paragraph 3, above), wher NetWelker was fist advertised. Additionally, the sae\n      user had cither visited the email inbox or saved the usermame of email uddresses\n      (megamogaup@protenmeil.com and syrs@pm.me), whick were connected 10 the individual who had\n      uploaded data stolen from Victim #3 and Victim #4 on the Netwalker Blog\n     Tho tm “metadata”as sed her refers 0data that provides informstion honothe dita, and specifically, th\n       fil properties. Metadata co include the date when lewasexcted, modifcd, the deatof the user who\n       created, modified oraccessed the fl, the locationwherethe file wascreatedand other information. Nota files\n       ‘contain al pose formsofmeade and the metadsia can be sirippe or delecd froma le, in wholeofinpart.\n                     Pagosor7\n\n```\n\n-----\n\n```\n       tlined herein, P51 believes that User ID 128 is Vachon. User ID 128 ranked second among affiliates in\n      numberof buis* (144 builds), including the builds ofVictim #1, Victim #2, Victim 15, Vict #4, and\n     many others. The BulgariaServercontained information rested to the NetWalker Blog, including nearly\n      500 fle depicting screenshots of sonsiive dat stolen fom vitims. Among those, User ID 128 was\n      associated with 302ofthe screenshots. According o the miadataofthose 302 files, “Sebestcn Vachon”\n      was eitherth “cxeator”or “author”of 73 serocnshot,inudingthoserelated 10 Victim # and Victim 4\n      “Th metadata attache (0 thebalanceof th serocshots did no contain informationegardingthe“author”\n      or “creator”of those fils.\n         20. Accordingto ecords from Google, lawfully obtined in the United Sats, aroundth ime\n      Victim #5 was attacked by the NetWalker Ransome (o or about May 15, 2020, Poland Server #1's\n     1 adress (hich ad been identified in connection withthe ransomware atack on Victim #37] had\n      Togaed into Google accouat skankhusher@gmaL com. Records for thatsccount,lll obtainedinthe\n      United Stats, indicated that it ws controlled by Scbesticn Vachon.\n          21. The second email sent from skenkiuntber@gmsil comonor about September 25, 2017,\n      approzimately six deys afte the account's creation (on of about September 19, 2017), was sent t cal\n      address svachon@hotmailf as described in the next section, this address hus been confirmedto belong\n    0 Vachon). Additcnally, on January 17, 2013, skankhunthex@gmaslcom received an email receipt fons\n      ‘Googe forthe purchaseofa “GoogleHomeMin,”which had benshipped t “Sebastien Vachon 1 “36\n     Rue Desforges, Gatineau, QC, J8R 2W1, Canada.”\n         22. Google also provided records, sof September 2020ofmre then 35,000 incre searches\n      conducted and websites visited by the skankhenthex@gmail.com accoursholder, which revealed\n   epi\n                    wagesar?\n\n```\n\n-----\n\n```\n                      hon.” I addition to the subscriber information, the contents\n     ofthe account established thatit was controledby Vachon. The account contained to photosofVachon\n      holding his Quobe driver's license and a sheet of paper bearing his full name as Sebastien Vachon\n      Desjardias, a date, and the nameof a cyposurrency exchungs. Those photographs re attached to this\n       request. The email account also contained correspondence from Banque Nationale du Canada (National\n      BeakofCanada) in Vachon's name, and listing Vachon's known address (36 Rue Desforges, Gatiacau\n      (QC) J8R 2W1). The account also contained a bill fom Bell Canad, = Canadian telecommunications\n      ‘company, that was addressed to Vachon at tissemeaddress.\n          24. Thecontentsof the svachon@hotmailf account elo linkedVachon directly totheransom\n      payment of a NetWalker Ransorviere attack of an education company headguirtered in the State of\n      Washinglon (Vietim #5). Tn or around May 2020, Victim #5 was victimized by the NetWalker\n      Ransomware. Victim #5 pad approximately 10.479 bitcoin [approximately US $94,877 on thedateof the\n       transaction] in ransom. A. review of the svachon@hotmalfr sccount revealed two unrelated bitcoin\n       transactions thet Vachon had conducted on or about Mey 22 and 24, 2020. Those transection hashes\n      revealed that the cluster’ outofwhich Vachon paid, had received 8.16856429 bitin [epproximately\n      $72,374.21 on the dateof the transaction)ofthe Victim #5 ransom on of about Mey 26, 2020. As further\n      omaboration, investigators discovered a build for this victim on Poland Scrver #1, and Vachon had\n      researched this vietim using the skanklunther@gmail.com account. Additionally, according to the\n       ‘metadata ofthe scrccashots found on the Bulgaria Server, “Sebastien Vachon” create all fivescreenshots\n      associatod with Victim 5.\n          25. Throughout the entire course of the investigation, Vachon has been linked (0 36 Rue\n      Desforges, Gatineau, QC, J8R 2W1, Canad, including through: (1) his current Quebec-issued driver's\n    ‘ode?A”lustor lustris isacollectioni esateofitcolnofladdresses he bic addrese thtare asssted ind to 0s be cin) controled continbyone nperson 3 ussor bean iy In wales theror\n                  Pager?\n\n```\n\n-----\n\n```\n       sjardins, astien”.\n         27. In 2020 lone, US. thriies have identified dozensofNetwelker Ransomwars atacks,\n      resulting inthepayment of1433.57674 itoin in ransom ( curent valueofmore than US S27 milion).\n      Based on the data obtined fiom the Bulgaria Server, Vachon isthe mostprofitable NeeWalke afte\n      “This substantial amountof cyptocurrency— whichinvestigators havebeen unable 0tack 0date—would\n     eatly fuciltate is Right from prosccstion. Additonal, as ofthe dateofthe most recent records from\n      Google, lawfully obtained in the United States on or sbout September 2020, Vachon was actively\n      escarching neve victims 0attackwiththeNetWalker Rasomwre,thecebypresentinganongoing danger\n    1o thes. I edditon toVachon's potential Bight, itis verylikely that he has, and will continue,to conduct\n      ransomwareattacks, hereby presenting eal and penitent danger to others.\n         28. Aspastofa coordinated, nemationllowenforcement ation, FB isplewingo sce and\n      disble the Bulgaria Server in January 2021, effectively ceasing the operation of the NetWalker\n      Ransomware. As part ofthe persion, FB! will eplce the NetWalker Tor Panel welcome page with\n     arms indicating, that lw enforcement has taken ove the website, I is Hkely that most, if ot al,\n      dovelopers and afFlats, including Vachon, will immediately become aware of is law enforcement\n       action. U.S. authorities request that Vachon's amt be conducted conlemprancously with the ation, so\n     510 nojeopardizeth vestigationby giving Vachonan ppotunityto fle,ordestroy and tamper with\n      evidence.\n         29. Theprosecutor conumits o:\n        (1) Preparing a formal exruditon request within the ime specified by the Office of Tnesnationsl\n       ARBis/US. DepartmentofHusic, pon the amet ofthe fugitive in Canada; wid\n       ©) scsspting responsibilityfo extradition elated costs.\n                   Page7or\n\n```\n\n-----\n\n```\n       : | hl\n         388g i : iwd |\n   HE8\n        5g\n           will\n     iHS iiHH hih\n    £m {\n     yam 14\n          3 LE ¥ 4\n      a\n\n```\n\n-----\n\n-----\n\n```\n          Yuan = gnley\n                      5\n\n```\n\n-----\n\n```\n       To: Anysoredoe nforesmntoffisr Ji\n      YOU ARE COMMANDED toames and bringbefore 8UnitedSatemagistats judgewithoutunnecessary delay\n     foams feinbers)_SEBASTIENVACHONDESIAROINS __/___ +\n     horsseus of ffs orvillion ised he Fallow doc Fid ihdscor\n    of cman ©Swpreding fimens © aloo 0Sparse nfometon ©Comps\n    3Probation Vicon Pelion © SupervisedRls ViléaPaiion 3VilaionNace 5 OnderoftheCout\n      hi ors i bi dsb lows: /\n   Conspiracyo oni Compster Frau iiaof18US. § 371 Conseto Commi isFu,[ n][vision] [of]\n         marion aage 8 rossCo he. vlan [of] 150.5. 6[ TSHENSHAL] [(HNO,]\n   AAO ard SCREX:smsSonsratinsSeg ella Domogia aPrtciedCompu, lain[of]\n     THUSCS ORENTHB). (HNC). 7\n    owe BEC 83200 — Gesgeer BELLpsi —\n   Gyms: TomoPoids J. SupASEmsoednsStsoctcont\n               iainte\n               Ren\n   mamaTisvarawas sev ona TTT ndeprensa\n     oe: / J [—]\n         TR\n                                            TTT\n          —\n\n```\n\n-----\n\n-----\n\n```\n             LEPROCUREUR GENERAL DU CANADA\n                       (aunom des Bats-Unis &Amérique)\n              —em\n               SEBASTIEN VACHON-DESJARDINS\n             AUSST CONNU SOUSLEENOM DE SEBASTIEN VACHON\n       AUTORISATIONDE DEMANDERL'EMISSIONDUN.\n             'MANDATDARRESTATION PROVISOIRE\n                 (Article 12 deaLotsur extradition)\n         Les Etats-Unis dAmérique ont demandé au Canada de procéder 3 Farrestation\n         provisoirc de Sebastien YachonDesjardins aussi conn Sous le nom de Sébastien\n        Vachon\n         Le Procureur ginéral du Canada est autorisé demander Fémision dun mandat\n        arrestation provisore.\n         Faith Gatincau le 24 jour de janvier 2021,\n                 17\n                    IN\n                    CathChoy, Avocate-conseil\n                      Service Ghnrjide nerntionale\n                    Cenuetetainistredela Justice du Canada\n\n```\n\n-----\n\n-----\n\n```\n             REQUETE EX PARTE VISANT L'OBTENTION D'UN\n            WANDAT D’ARRESTATION PROVISOIRE\n             Adie 13 de a Lolsurfoxtraition\n      A L'UN DES HONORABLES JUGES DE LA COUR SUPERIEURE DE LA PROVINCE\n      DE QUEBEC, SIEGEANT EN CHAMBRE, LE REQUERANT EXPOSE CE QUI SUIT :\n         1. Les Etats-Unis d/Amérique ont proserté une demande d'arestation provisoira\n          visant Sébastien VACHON-DESJARDINS, aussi connu sous le nom do Sébastien\n         Vachon (ciaprés « linéressé »), en attendant la présentation d'une demande pour\n         son extradition. Lademande d'arrostation provisoiro otante 4 a présonte requéte\n         Sous Fannexe A;\n        2. Me Cathy Chalfour, coprésentante du ministre, a émis lo 22 janvier 2021 une\n          autorisation au Procureur général du Canada fin de présener une demande pour\n          artestation provisolre de fintérosse. Une copio do cette autorisation est inte a1a\n         présente requéte sous fannexe B;\n          3. Sylvain Desormeaux, détectivelsergent au sain du Service de police de fa Ville ce\n          Gatineau, a d6posé un affidavit qui est joint & la présente requéte sous (annexe\n       c\n         4. Les Elals-Unis d'Amérique ont confiré qu'une demande pour fextradiion de\n          Tintéressé sera présentée au Canada dans les soixante (60) jours de son\n          attestation provisoire;\n\n```\n\n-----\n\n```\n         EMETTRE un mandatpour 'amestation provisolrede lintéressé;\n         EMETTRE une autorisation de pénétrer dans la maison d'habitation sise\n            5135 ue Destorges, Gatineau, Qube, on vor d Farle\n                   529 du Code criminel;\n       RENDRE fou sur ordonnancejugée pporune\n                             Signé a Gatineau, district de\n                             Gatineau, ce 26 Janvier 2021\n                                                   Lo ED\n                             Ud JOSS\n                      We Véronique Rousseau\n                Subst du procurour général du\n                   Canada\n\n```\n\n-----\n\n```\n eee\n                  AFFIDAVIT\n erm.\n       Jo, DétectvelSergent Sylvain Desormeaux, agent dola paix au sein du Servis de police do la\n       Vill do Gatineau, exergant au 590, boulevard Gréber, Gatineau, Québec, ayant été doment\n       ‘assermentée, déclere co qui sult:\n             1. Je suis membre du Senvce de police de fa Vile do Gatncau (chaprés « SPVG ») ol\n        Tocoupe le rang de détectivelsergent.\n          2. Jai 46 informé que les Euals-Unis Amérique (d-aprés « Etats-Unis ») solictent\n         farmestation provisoirs de Sébastien VACHON-DESJARDINS, aussi connu sous le nom\n        do Sébastien Vachon, nolo 11/07/1987.\n         3. Dans le cadre do celte affair, fai pris connaissance de ka domande damestation\n           Provisoire, incluant [identification de VACHON-DESJARDINS, envoyée par les Etats-\n          Unis.\n          4. Selon le Federal Bureau of Investigation (c-apres « FB »), VACHON-DESJARDINS a\n          utlisé lo rangongicil « Netwalker» afin de voler de diverses viclimes dos fichiors do\n        données numeiquespossédantdes informations sensiblespouroblenirun gain financier.\n          5. Unrangongicil est un type de malicel qui nfilre Fordinateur ou le systéme informatique\n        de sa victime ef bloguo acobs ses données. Latiaquant exige une rangon payable,\n         habitusllemant en monaie numérique (ex- bilcoin), du propritaire des données avant\n         auilelle puisse récupérer ses fchirs.\n\n```\n\n-----\n\n```\n                               o:\n          = 1 est rcharché pares Etats-Unis aff de subirun procs pour des accusations\n         sériouses do raudes commises par crimteur\n          + En 200 2018, Io FBI début ne enauete visant VAGHONDESJARDINS of\n         autres comme ataquan qui ulsent e rangongice « Netwalker» pou nfecier\n          les réseau iformatiues do plusieurs victimes. VACHON,DESJARDIN ef os\n         atoquants exigentqnrangon soi pays pendant une mts do amps on\n          victimes veulent sofa remee leurs fichiers:\n          + ortaines des vicimes ce VACHON.DESJARDINS sont des tabissements\n         densoignement, uno eniopise de. logisiaue de anspor ainsi quume\n         compagnie do tlécommunicatons. Ges organismsse font wer des conden\n         confidentelcs of menacer que cesrensignomentsseont publ en ligne 14\n         rangan cost pes payee:\n          + La preuve cionsancile abit que VACHON-DESUARDINS fst aff avec\n         Torgarisaion « Netvalker » et so ert du om ulfistour« User 128.5;\n          + Suite 4 une analyse médicorégala du serveur informatique en Bulgare qui\n         héberge le « Nfvalke Tor Panel » fe site de Fnernet candestn comolé par\n       Targanisaion«Netwaker »), I FBI détorming que « Uso 126.»eetac dep\n           Je mols dav 2020 of ul est utlisteur ayant amass to plus grand nombre\n        do rangons, soit une valeur approxmalve de 27 millon a dolers U.S, an\n       boi;\n           + Le FBI cblient do dossiers letroniques cs Google et détomine que Fadresss\n         Inlemet «Poland Server #1 », uiséo lors de Tataquo da rangongicel des\n          victimes, stat connect au comple email skarkhurthor@gmaicom:\n\n```\n\n-----\n\n```\n      Les motifs durgence pour farrestation provisoire de VACHON-DESJARDINS\n          * Le 27 janvier 2021, a Gendarmerie royale du Canada pianifie d'exécuter un\n         mandat236ue do Desforges perquisiion3Galinea,a maison Québec; dhabitelon deVACHON-DESUARDINS sss\n          + En méme temps que le manda de perquisiton chdassus sera exéouté, le FBI\n         attend de désealiver le serveur informatique en Bulgari sur lequel opére le\n          rangongicil « Netwalker ». A ce moment, un message sur site ndquer que\n         des organisms application de Ia of coirole Ie ste web cu « Ntwalker Tor\n          Panel» donc les ullsateurs, incuznt VAGHON-DESJARDINS, seron avisés\n          dss que visteronto site;\n          + Selon les informations abtenues par le FB, VACHON.DESARDINS est afiis\n          «Netvalker» le plus proffable ce forgerisaton. Il posséde une quanits\n          substantille de cryplo-momnaie,ce qui poural faciter sa fut afin déviter des\n          poursules juccilros;\n          + Los plusrécants(ssptombre2020)dossiers électriques de Google éiabissent\n         quo VACHON-DESIARDINS recharche des nouvelles vicimes & poursue\n         avec le rangongiciel« Netwalker . Par conséquen!, i demeurs un danger pour\n           Ia sécurte publique.\n\n```\n\n-----\n\n```\n      Asserments devant mo & Gatineau,\n      Distrlct de Gatineau, ca 26 janvier\n      2021\n   Coast jms.\n ——\n     Hon Catherine Mandevite, 2.55.\n\n```\n\n-----\n\n```\n    ETATTEN)a ut ct oocom at coin drs pec lrort rtGoin\n   Be eS Fl CESry,\n     CE ADRES LES PESBUTES OXPu BET OE US EAIOHOREAU HOM OF 6A MAIESTECARRTER WEOTEVENT\n   ss] EF x CAMENER DEVARY|4S. TEREFOR 70 COMMAS Yo. HE BASES HABE POR 10\n     ESTHEPERSONSOUGHTA410 BANG HERA SE nsSt pir in | opus Co ofBuin\n    RoR RLLE Sot ARLE S08CL 755D riAEROS To\n      ATIENOU qu gt otssaego sauTies oun Sear WHEREAS os ssl\n        aae et i ees (6 REE CORSE PPR STE\n   rerade\n      FE ———\n eniaooieShain\n aa or Pt tose\n              re ee eee ee ed Epo hecotarons\n   Es Sit oonayoht Seng or,Era LS rs\n     a thge ov\n                         GoPIC CONFORIE TRUE COPY\n                                                              | i\n                                                                  | fon dss\n                Situa iromque procures Rozesasyints du Cana!\n             ountorto ory Conse ofGove\n      hun canons we 2st - son\n        HON, CATHERINE NANDEVILLE, 4.5. Abarat it J Cs\n                    wnenssstie\n\n```\n\n-----\n\n-----\n\n```\n        (FBI) has been investigating VACHON-—a Canadian citizen who resides in Gatincau,\n       Quebec—and others for thir participation in ransomware attacks involvinga rnsomware:\n        variant named “NetWalker.” Ransomware is a typeof malware that is used to compromise:\n         ‘and restrict access to a victim's computer network in an effort to extract ransom.\n                3. FBI Special Agent Daniel Sirmons (“SA Simons”), would testify as.\n         follows: He is the case agent primarily responsible for this investigation and he has been a\n         ‘Special Agent with the FBI for approximately 25 years. SASirmonshas attended over 500\n        hours of training in various aspects of criminal investigation, including classes dealing\n         specifically with cyber investigations and cyber-related technical training. In bis capacity\n         as a special agent with the FBI, he has conducted investigations into both criminal and\n         national security matters\n             4. Since at least as early as March 2020, NetWalker has been advertised as\n        ransomware-as-a-service (‘RaaS”) on eybercriminal forums, featuring developers and\n          affiliates.! For example, on March 20, 2020, an individual using the moniker “Bugatti”\n      SA7 Sirmons will esify tht under the Raa model, developers se responsible for crating and updating\n        th ransomware, and making it availableto afte. Based onNetWalkeradvriseanets on cybereiminal\n                               1\n\n```\n\n-----\n\n```\n                            am. We ar interested in\n          people who work for quality, buforquantity. We give preference to those\n         who knows how to work with large networks and hs their own material.\n          ‘We are hiringa limited numberofpartners andwestop hing unil positions\n          ‘become available. We offer youa fast locker with flexible configuration,\n           ‘convenient administrative] panel in TOR, and automatic service. Access (0\n           service is via encryption offiles from AV. VErified adverts are sud ready\n          material in the format (ipldomain admin accountaccess to nslinfo about\n          AViorganization namelrevenue) for network processing. The locker has\n          been operational since September 2019 and has gained a good reputation,\n          and it cannot be decrypted. More details about the locker and tems of of\n           the job will be provided once you complete an application in PM.\n          Application format; 1) What is your areaofexpertise? 2) Your experience.\n          ‘What partner programs have you worked with and what profit have you\n           ‘had? 3) How much material do you have and when are you ready to star’?\n        How much material do you plan on processing?\n              6. Tased on victim interviews, SA Sirmonshas eamed and would testify that\n        a victim company generally cams that ts computer network has been compromised and\n         its data encrypted via the deliveryof a ransom note in the formof a file. Below, a\n        representative ransom note has been recreated in part\n           Hil Your files are encrypted by Netwalker If for some reason you read\n           thistextbefore the encryption ended, this can be understoodbythe fact that\n           the computer slows down, and your heart rte has increased due to the\n           ability to tum it off, then we recommend that you move away from the\n         forums, interviews of NetWolker vcs, ad evidence obtained from a sever locied in Bulgari, SA\n        Simons is expected totes tha afc ar responsible for identifying and tackinghigh vali victims\n       ith the ransomwar. Aferavem pays, then th developersan af sis spsh nso\n                       2\n\n```\n\n-----\n\n```\n                                 ng entrance, the\n        victim is provided with the amount of ransom demanded (in bitcoin), and instructions for\n        payment. The vietim can also communicate directly with a NetWalker developer and/or\n         affiliate on the NetWalker Tor Panel via a chat function.\n           8. Based on victim interviews, SA Simons has learned and would testify that\n       NetWalker is used not only to encrypt vietim data, but it is also used to steal victim data,\n       fa victim does not pay theransom, the stolen datai often published online. Since at least\n       May 12,2020, website named “the NetWalker Blog” has existed on Tor for the exclusive\n        purpose of facilitating the publication of stolen victim data. The NetWalker Blog is\n        accessible to anyone who uses the dark web, and might seek to use it as a resource for\n        various types of criminal conduct. The stolen victim data may consistof he company’s\n        sensitive intellectual property or financial records, or personally identifiable information\n      ofthe company’s customers. Such data may be used bothtothe advantageof the criminal,\n        and detriment to the victim company. For example, stolen personally identifiable\n             7 SA Simons wil sity has the Onion Roser (“Tor”) i ewokofcomputers disor sound hc\n         ‘worlddesignedoconcat he ru I addresses fhenetwork's wes,TheTor networkalsoenables websics\n      0 operste in: mannerha cancelsthe tr P adress ofthe serve hosting he website\n                        3\n\n```\n\n-----\n\n```\n                         summary of the company's\n        services, and either lnk to the stolen data (refered ton the NetWalker Blogas “secret\n        data”) ora date when the stolen data would be published. The NetWalker Blog has also\n        posted links to screenshotsof dat stolen rom vietims, nan apparent attempt to prove tht\n       he sensitive dat had infatbeen olen.\n                RansomwareAttacks\n           11. Victim #1 is a company based in Florida. A company representative of\n        ‘Victim #1 is expected to testify that on May 1,2020,it received a ransom note on maltile\n          workstations indicating its network had been compromised by the NetWalker\n       Ransomware. The ransom demanded was $300,000 in bicoin, which Victim #1 did not\n        pay. To date, Victim #1 estimates having spent approximately $1.2 millon to respond to\n        the attack, contain its damage, and restore operations to normal. Forensic analysis\n       conducted by Vietim #1 revealed that on April 30, 2020 at 23:57 UTC, server using IP\n        address 193.56.28.100 (ater identified by the FBI as “PolandServer #1), which was not\n        authorized to acces the Victim's network, had gained unsuthorized access to is network\n                     4\n\n```\n\n-----\n\n```\n                        lker Tor Panel a instructed by\n        the ransom note. Victim #2 provided investigators with forensic copyof the compromised\n        servers, which revealed tha from May 6, 2020, to May §, 2020, Poland Server#1 had aso\n       gained unauthorized access 0 its network vi the company's Pulse Secure Virtual Private\n       Network\n             13. Computer Scientist Frampton would testify that in response to Poland\n       Server #1°s unauthorized acces to the networks of Victim #1 and Victim #2 around the\n          time of NetWalker Ransomware attacks, he uscd an intemet-connected computer to\n       connect o tatIPaddress from May 11,2020, to May 26, 2020. At times, the surveillance\n        sevesled the names, properties, and contentoffiles stored on PolandServer #1. Through\n       his surveillance, Compute Scientist Frampton discovered that Poland Server #1 contained\n       an abundanceofsoftware.\n       SA Simons will tsi th Pulse Scar Vial Private Netvark, or Puc VPN, purport 10 provide\n       sect, subenticated esas for emete and be wets fom an epamsbed device 1 rpc\n        353Simon will cy ths Windows PowerSel ss sutamaion cine ad sping gage cs\n        designed coo nd uma skies ofWindows psa yess ud he ppIanons.\n       SA Simons wil iy te aMDS hah 3 32. sheen Gods a an b aed 10 aml\n     denyfle\n                      s\n\n```\n\n-----\n\n```\n             15. Computer Scientist Frampton would testify that he discovered 12 builds\n       on Poland Server #1 that had names of identified NetWalker victims, including Victim #1\n       and Victim #2. Computer Scientist Frampton alsodiscovered—and identified by MDS\n       hash—the exact PowerShell script that Victim #1 had found on muliple workstations\n        affected by the May 1, 2020, NetWalker Ransomware attack. Computer Scicntist Frampton\n        ‘would further testify that on May 13, 2020, he observeda new build on PolandServer#1\n        for Victim #3—a company based in France6\n             16. A company representative of Victim #3 is expected to testify that on or\n        about May 15, 2020, Victim #3 received a ransom note indicating its network had been\n        ‘compromised by the NetWalker Ransome. The initial ransom demanded was $50,000,\n       and subsequently inorcased t0 $2,000,000 th sme day. Victim #3 did not pay the ransom.\n             17. Computer Scientist Frampton would testify that on May 26, 2020, he\n        observed that the NetWalker Blog indicated that Victim #3's stolen data would be\n      SA Sirmonswouldety atde tothe lbs ssl of the cies, mile domestic 32d frig aw\n        enforcement agencies re conducing paral imvstgaion of the parpertors, melding the Preach\n          authorities. The FBI has coodinaied wilh French lw enforcement thoughout th invesiguton and\n         Secordingly determined the ocaionofVien 5.\n                     6\n\n```\n\n-----\n\n```\n        linked to that accountholder: syrsfatlpmme, megamegauplatprotonmailcom,\n        vicinonus{atjprotonmail com, and valultion{stJprotonmail com. MEGA suspended the\n        offending account afte tleamed ofthe above conduct\n           20. Victim #4 is a company located in Califoreia. A company representative\n        of Victim #4 would testify that on June 3, 2020, i observed “security incident” that\n       occured within ts network on June 1, 2020. The ransom demanded was $3,000,000 in\n         bitcoin. It ulimately paid $1.14 million (in bicoin) in ransom into a bitcoin wallet\n        identified on the NetWalkerTor Panel,\n            21. Computer Scientist Frampton would esify that on June 3, 2020, he\n        visited the NetWalker Blog and observed that it indicated that Victim #4's stolen data\n      SA Sirmons wil etythat Protons sa Switerandase aml provide th ons te dons\n       pin” and pronmalcom.” Th vl servicis cadto-ed cncypled, nd 20 person infomation\n      {eedtocri an account. Thee Furs, ke in conjuncion with it Swi pvacy vs,hive mde\n        {very popular with bereimint.\n          © A MEGA representative woul esti ht when an sccounvder sess MEGA's website, MEGA\n        collectscotainnformaion, cluding hebrowser ht he scouteduss. Though rovae eogoion,\n       MEGA 1c 0 i ny subscaetysrsed acco 10h orin cot\n                       7\n\n```\n\n-----\n\n```\n  voor om. MEGA al provid sg irs rn\n      coil iiss tt bd ic tt coum, eligite\n     lied to te slotin of Visi £5 vim ut: rlcroommntaom,\n    nome, megmegsalonmaion, icnamlaprocanaon, 1\n     suinfpronnilcon. Agkin, MEGA suspended the ofin sect sf\n   md ote stevcone\n        20 MEGA do eit the IF aress ving ged foscons\n     (Polen Scr 47) MEGA iid Fold Sse 2 hing ee he EG\n     esses prscncan, bso nek rocuse the cen odd by se\n   0.\n         20. Sa Sons i iy tht at coming te IF adbeses in fe\n    morn Lastg Sele ra rninof i Be\n   aTei\n                  .\n\n```\n\n-----\n\n```\n                            suant to the MAT request,\n       ‘Computer Scientist Frampton would testy that be reviewed the copies. The contents of\n       Poland Server #1 had largely been wiped clean. The folder where deleted items are\n        temporarily stored, commonly identified as » “recycle bin” however, did contain a\n        directory withthe same fils that Computer Scientist Frampton had observed in May 2020.\n            26. The contents of Poland Server #2 provided a ink fo an individual named\n          “Sebastien Vachon.” On the server, Computer Scientist Frampton discovered a file named\n       “2png,” that depicted a screenshot of several fle. According to the file's metadata,0\n          “Sebastien Vachon” created the file on May 29, 2020, and had last modified the file on\n       June 2, 2020. The server also provided cus as o the location ofits use. Fo example, on\n        July 15, 2020, th user had viewed a webpage filled, “Canada Post - Track a package by\n        tracking number” The link tracked package that had been sent to Gatineau, Quebec.\n         ‘Additionally, on June 20, 2020, the Google Chrome autofill function indicated that the user\n      Sirmons9SA wouldte hat he tn “ntact,” sd here refs o deta te provides nformsion\n        about thr dt, ad special, fhe Ge Papas Metab con cloedt hen levas creel,\n     a ah mo me peeoofee\n       ppdor deleted fom 1. inwhol rnpr.\n                     9\n\n```\n\n-----\n\n```\n       Ransomwiare | XSSis” Additionally, the user ad visited the email inbox of\n      megamegaup{aprotonmaicom on June 2, 2020, and the Google Chrome autofl function\n        indicated that the user had saved the usemame “syrs{atmme” on June 21, 2020, As\n       discussed above, bothof these ProtonMail mil addresses were linked to the uploader of\n       Victim #3 and Victim #4's dat onthe Netwalker Blog.\n                28. On April 15,2020, an FBI Online Covert Employee (“OCE\") accessed the\n          NetWalker Tor Panel. The OCE would testify that while there, she was able to observe\n        the websites index peg entity tag and the date that the index page had last been\n       modified\n                29. SA Sirmons would testify that investigators then queried Shodan and\n      Consys—wo independent commercial tos tha scanth inemet and collet information\n        4SAStrmons will styht the Google uch bower, Chrome, has an autos uncon. Tris fcion\n       lows th owt ord evi wt\n        re en eBBe eplr\n      suse can be rivedFm oc ache, he bowie cs noted (ake oh ado eqn tte\n        Server Gensel, nytagar i ene\n                     In\n\n```\n\n-----\n\n```\n                                y that based on his forensic\n        analysis of the Bulgaria Server, the server appears to be the backend server of the\n       NetWalker Tor Panel and NetWalker Blog\"\n             31. The BulgariaServer contained detailed transactional information a to each\n         affiliate. The records revealed hat from February 29, 2020, to September 14, 2020, 68\n         affiliates had ben active, 910builds had been generated, and victims had paid more than\n        $38 million (3,657.84 bitcoin) in ransoms. Affiliate “User ID 128” had been active since\n      Apr 13, 2020, and ranked first among affiliates in amountofbitcoin received in ransoms,\n        collecting more than SIS million (1,433.57674 bitin). “User ID 128\" ranked second\n       among affiliates in numberofbuilds (144 builds), includingthe buildsofVictim#1, Vietim\n        #2, Victim #3, Victim #4, and many others\n             32. The Bulgaria Server contained information related to the NetWalker Blog,\n        including when the blog entries were created in the database (but not when they were\n        posted online). The Bulgaria Server also contained nearly 500 files depicting screenshots\n         37SASrmonswilletyha bckend servers seveatypically contains ll afhe rw fomation\n          that is used 1m 3 webs or software appication\n                           nu\n\n```\n\n-----\n\n```\n                                        .\n    ©Victim |Screenshot| Build og En\n   [Com | om | om, | cere|\n        Vieum BL NA 05032020 03.38 TNA\n           Victim #2 1 N/A 05/07/2020 22:17 NA |\n          Victim £3 05/13720202157 | 05/13/20202333 me\n  =—7) | 2245 |0601/2020 23:54| 0/01/2020 23:54\n          34. Asan example, acordingtothemetadataofacetanscreenshot taken fiom\n        the Bulgaria Server, depictinga Victim #4 aplication form, “Scbasien Vachon” crested\n      he file on May 31,2020. SA Simons will testify that pacar sescenhot is denticl to\n         the screenshot posted by BlecpingComputer.comon June 3, 2020, except the applicant's\n        personally identifiable information hid not been redacted in the version ound on the\n        Bulgaria Server\n       B. MdentificationofSebastienVachon-Desardins\n                 Sursatiomame\n           35. SA Sirmons will testify that HackForums.net (“HackForums®) is an\n         Intemet forum, and a representative from web traffic analysis companyAlexa Internet,\n         Inc is expected to testify ha th foun rkssecondon the Internet in temsofweb caffe\n        in the category of “hacking.” SA Sirmons is cxpscid to tesify hat according o records\n               2\n\n```\n\n-----\n\n```\n           36. User “syrius0l” originally registered on HackForums with email address\n        ‘svachonat]hounailfr.By May 22, 2019, however, theuserhad changedhis/herregistered\n         ‘email addresson the forum to syrs{atlpm.me, oneofthe ProtonMail email addresses linked\n         to the uploadingofVictim #3 and Victim #4 data\n                  ‘Skankbuntherfatj¢mail.com\n             37. OnJune23,2020,a U.S. Magistrate Judge signedanorder requiring Google.\n         to provide records relating to Poland Server #1. A Google company representative will,\n       if necessary, be able to authenticate these records. The results revealed that twice on May\n        14,2020, azound the time Victim #3 was attacked by the NetWalker Ransomware, Poland\n        Server #1's TP address had logged into Google account skankhuntherfat]gmailcom.\n                 3\n\n```\n\n-----\n\n```\n                     nt. SA Sirmons will tesify that he reviewed the\n       Google results, which indicated that was controlledbyVACHON. The second email sent\n       from skankhunther{stjgmail com, just six days after the account’s creation, was sen to\n        email address svachon(atJhotmail f(s described in the next section, tisis VACHON's\n       known email address). The subject of the email read “test” and the body read “1”\n        ‘Additionally, on January 17, 2018, skankhunther{atjgmailcom received an email fom the\n       Google Store with the subject, “Your Google Store order has shipped.” The body of the\n        email containeda receiptfor a Google Home Mis, which had been shipped to “Sebastien\n         Vachon” at “36 Rue Desforges, Gatineau, QC, JSR 2W1,Canada” —the same address\n        saved by Google Chrome on Poland Server #2. Last, the account's search and web history\n        includes numerous queris for fast food restaurants in close proximity to VACHON's\n          residence in Gatineau, Quebec.\n           39. Googe also provided recordsofmore than 35,000 searches conducted and\n        websites visited by the skankhunther(atJgmail com acsountholder. Tis search and web\n    SrmonsSA willcsifythtGrad Broflvas fos chr on th aimed television ses\n        South Prk. In Sexson 20, Eide 2. ted “Skank Hun Broflovki anonymously yberbulls her\n        members of he src ing th monic Skankhitd2.”\n                       in\n\n```\n\n-----\n\n```\n                                    arch terms\n        “intruder,” “attack.” and “vpn.” And on May 20, 2020, the accountholder searched\n       “ransomware negotiation conversations.”\n            40. SA Sirmons wil testify that ZoomInfo s a subscription-based service that\n         sells access to its databaseofinformation about companies and their employees. A query\n      ofa company name can retum awealthofinformation, such as annual revenue, number of\n        employees, and employee contact information. The skankhunther{atjgmail.com\n        accountholder also researched more than 350 companies on Zoominfo, atleast $9ofwhich\n        are identified NetWalker victims. These companies include Victim #1, Victim #2, Victim\n        #3, and Victim #4. For example, on May 1, 2020, the accountholder searched “[Victim\n        #1).com revenue,” and “what is [Victim #1.” On May 20, 2020, the term “[Victim #1)\" is\n        included in more than 20 searches and websites visited, including searches such as\n        “([Vietim #1] zoominfo,\" “[Vietim #1] contracts with federal,” and “(Victim #1] backup\n        system.” On dozens of occasions, the accountholder also rescarched the specific\n        vulnerability used to attack Victim #1 and Victim#2'snetwork—the Pulse Secure Virtual\n        Private Network. For example, on April 21, 2020, the accountholder searched “pulse vpn\n                       1s\n\n```\n\n-----\n\n```\n        Zoominfo.” and on May 24, 2020, the accountholder searched “[Victim #3] revenue\n        ‘zoomino.” The accountholder searched [Victim #4].cdu Zoominfo\" on May 31, 2020, 3\n       day before Victim #4 realized ts network hadbeen compromised. The sccountholder again\n        searched [Victim#4] edu Zoominfo\" on June1,2020,and June 9,2020. On July 15,2020,\n        the accountholder searched “[Vietim #4] ransom 114m,\" and visited a webpage titled,\n       “How hackers extorted $1. 14m from UniversityofCalifornia, [Victim #1]...\n            42. The search and webhistoryalso connected the account to the uploading of\n        vietim data on MEGA. As discussed above, MEGA liked the anal address sys{atlpmme\n         to the uploading of Victim #3 and Victim #4's data. According fo the web history for\n        skankhuntherfatlgmail.com, on October 26, 2019, the accountholder visited the email\n         inbox. of syrs{atlpm.me. Also, as discussed above, MEGA suspended several MEGA\n        accounts aie learning they were involved with uploading victim data, On June 12,2020,\n        the accountholder for skankinntheratlgmailcom searched “megan give reports to\n      vere14SirmonsSA methwil for esi publiclythat knownthe Common inform Veinsscary inetabs and Exposuresand cpo58s. (CVE) sytem provides 3\n                       16\n\n```\n\n-----\n\n```\n                              entative wil, if\n        necessary, be abl to authenticate these cords. Microsoft provided the following\n        subscriber information fo the account:\n    [ome BE\n    —\n                     svachon]at]hotmail.fr — ~\n    -\n        riouState | Quebe -—\n        Postal Code |JSVOMS EE\n           44. In addition to the subscriber information, SA Sirmons will testify tht he\n       reviewed the coments ofthe svachon{atThotmail i sccoun, which established that it was\n       controled by VACHON. The account contained the two photos depicted below (one of\n          ‘which is depicted in Exhibit A to thisRecordofthe Case) of VACHON holding bis Quebec.\n       driver’ license and a sheet of paper bearing his mame, a dat, and the name of a\n          cryptocurrency exchange (Bit Buy and KuCoin).\n      SASimons will sity thatcypocreney exchanges commonlyeq somes submit potssich\n        tein contim day\n               n\n\n```\n\n-----\n\n```\n          45. VACHON dateoftitombisdie sense Gly 1, 1957) consis\n           ‘with the statement made by “syrius01” on HackForums in June 2016 that he was 28 years\n       ld. The account conned similar photo ofSar Eni Laocguete individ\n      hose information ad ben sve nhs auto ctionof Poland Serr #2\n         46. The sachonshomailf csounconecorcsponden romBangs\n          Nationale du Canada (National Bank of Canada) in VACHON's name, and listing\n        VACHON's known address (36 Rue Desforges, Gatineau (QC) JSR 2W1) and phone\n    ibe (819) 5982055).The coun sso connedi ro Bll Canada,Canadian\n          telecommunications company, which was addressed to VACHON at his known address.\n          47. On November 30, 2018, sachonfschomaile sent wn cml to\n      abasic vchonig. gc. Th body ofthe mil contin a fink to VACHON's\n          six-page curriculum vitae. The curriculum vitae indicated that VACHON had held a variety\n                    is\n\n```\n\n-----\n\n```\n            48. The contentsof the svachon{atlhotmailfr account also licked VACHON\n        directly to the ransom paymentof at least one NetWalker Ransomsvare atack. Victim #5\n         is a company located in the State of Washington. A company representative of Victim\n       #5 is expected to testify that on May 13, 2020, it was vieimized by the NetWalker\n       Ransomware, and on May 26, 2020, Victim #5 paid 10479 bitcoin in ransom\n        (approximately $94,877 onthe dateof the transaction).\n            49. SASirmons would testify tha thebitinblockchinisan open, distributed\n        ledger that records transactions of bitcoin between two addresses efficiently and in a\n     verifiableand permancat way. Because the blockehainservesas a searchable public ledger\n       of every bitcoin transaction, investigators can observe addresses invalved in certain\n        transactions, and tha information anbe used 0 identity therbitin addresses that likely\n        belong to the same owner (also known as a cluster)\n            50. A review of the svachonatJhotmailf account revealed two unrelated\n        bitcoin transactions that VACHON had conducted on May 22 and 24, 2019. Those\n                      19\n\n```\n\n-----\n\n```\n                                   s\n        discussed above in paragraphs 48-50, Victim #5 has paid a total a ransomof $94,877, and\n        Vachon's split is $72,374.21. The developers would receive the balance of the ransom.\n         ‘This percentage split between affiliate and developer (roughly 75% to affiliate and 25% to\n        developer) is consistent with practices that U.S. authorities have observed on the Bulgaria\n         Server.\n           52. Computer Scientist Frampton would testify that he had discovereda build\n         for Victim #5 on Poland Server #1, and VACHON had searched this victim using the\n        skankhunther(at]gmail.com account as early as May 11, 2020. Additionally, according to\n         the metadataofthe screenshots found on the Bulgaria Server, “Sebastien Vachon” created\n          all five screenshots associated with Victim #5,\n             $3. VACHON's last known address prior to his provisional arrest was 36 Rue\n        Desforges, Gatineau (QC) JSR 2W1. His identifiers aras follows:\n          Date of Birth July 11,1987\n           Place ofBirth: Unknown\n      7$4Sirmonswilcay tat »sanscion hac sn alphumerc cod hat ca be cto snc\n         identity le.\n                      20\n\n```\n\n-----\n\n```\n                             21\n\n```\n\n-----\n\n```\n      Exhibit A\n\n```\n\n-----\n\n```\n       Koongl\n lon\n\n```\n\n-----\n\n```\n       Date CarltonC. Gammons\n       soA\n         tan\n\n```\n\n-----\n\n-----\n\n```\n                LE PROCUREUR GENERAL DU CANADA\n             (aunom des Etats-Unis Amérique)\n                  Let\n               SEBASTIEN VACHON-DESJARDINS\n                AUSSI CONNU SOUS SEBASTIEN VACHON\n           ARRETEINTRODUCTIFD'INSTANCE\n                 (Article 15 Lof sur IExtradition)\n         Le ministre dela Justice du Canada autorise le Procureur général du Canada3\n         procéder devant la Cour supérieure du Québec afin de rechercher une\n         ordonnance dincarcération pour Sébastien Vachon-Desjardins aussi conn\n         sous Sébastien Vachon qui est recherché par les Etats-Unis aux fins de\n          poursauite. infraction qui, au Canada, correspond la conduite alléguée est\n            + Extorsion, contrairementa article 346 du Code criminel.\n          DATE & Gatineau, Québec ce 26¢ jourd'avril 2021.\n               WH Mt\n                      Cathy Chalift.f, Aocate-consell\n                      Service d'eftaide internationale\n                    Pour le wifistre déla Justice du Canada\n\n```\n\n-----\n\n-----\n\n```\n        code postal JBV 2M7, depuis septembre 1903;\n        2. Je vis avec mon conjoint Robert Desjardins, depuis 41 ans;\n        3. Mon numéro de téléphone de résidence est: (819) 246-9782\n        4. Comme occupation, je travaille comme coiffeuse au salon Coiffure.\n         Sébastien, silué au 1079 Rue Saint-Louis, Gatineau, QC JeT 252,\n         téléphone (819) 243-4903;\n       B. LIEN AVEC LE PREVENU :\n        5. Je suis la mére de Sébastien Vachon Desjardins. Jai une trés bonne\n          relation avec mon fis et il a du respect pour moi et sachant que je suis\n         impliquée comme caution, je sus convaincue quil S'agit d'un élément\n         supplémentaire qui le motivera a respecter ses conditions. Sébastien est\n        mon fils unique, je suis prét a lider et encadrer de tout mon cceur et en\n          faisant de mon mieux;\n        C. INFORMATION SUR LE PREVENU :\n        6. Mon fils Sébastien Vachon-Desjardins est né le 11 juillet 1987;\n        D. AUTRES INFORMATIONS EXIGEES\n        7. Jen'agis pas en tant que caution pour d'autres personnes;\n          8. Je n'ai aucun antécédent ni aucune cause pendants;\n\n```\n\n-----\n\n```\n           Conspiracy to Commit Wire Fraud, in violation of 18 U.S.C. 1349;\n             Intentional Damageto a Protected Computer in violationof 18 U.S.C.\n              1030(2)(5)XA). (C)ANAINI. (X4XANIXVI), and (c)4)(B); and\n            Transmitting a Demand in Relation fo Damaging a Protected\n           Computer, in violation of 18 U.S.C. 1030(a7)(@). (aX7)C). and\n           (©)3)A)\n       11. Jai été inform du contenu des documents actuellement divulgués dans le\n         dossier relatifa la demande extradition. J'ai pris connaissance notamment\n         des mandats darrestation du Canada et des Etats-Unis ¢'Amérique et jo\n          joinsunecopie desdils mandats avec mes initales pour en attester ma prise\n         de connaissance; (A-1)\n         F. AUTRES INCULPATIONS PENDANTES VISANT LE PREVENU\n       12. Je comprends également que mon fils est accusé d'autres infractions & la\n          ‘Cour du Québec a Gatineau, distrct de Gatineau, dans le dossier de Cour\n          portant le numéro 550-01-118357-203;\n        13. Jo comprends que dans le dossier 550-01-118357-203, mon fils fail face &\n         des accusations de :\n            a. Trafic de stupéfiants;\n            b. Possession de plusieurs sortes de stupéfiants en vue d'en faire le\n             faire le trafic;\n            c. Recel;\n\n```\n\n-----\n\n```\n        47. Jai pris connaissance de la liste de ses antécédents judiciaires ot je joins\n         une copie desdis antécédents avec mes initiles pour en attester ma prise\n         de connaissance; (A-3)\n        H. ENGAGEMENT MONETAIRE OU DEPOT\n        18. En tant que caution pour mon fils je suis disposée 4 _m'engager a verser\n         au tribunal la somme de cent mille dollars (100 000.00S) conjointement\n         avec mon conjoint Robert Desjardins;\n        19. Sile tribunal exige le dépdt de la somme decentmille dollars (100 000.00\n           $) au lieu dun engagement pour ce montant, mon conjoint et mokméme\n        sommes préts 4 en faire le dépdt;\n        20. Si le tribunal exige un engagement pour un montant plus important, mon\n          conjoint et moi-méme sommes disposes & faire le sacrifice pour en offic\n          plus si nécessaire;\n         21. Siremis en liberté mon fils viendra demeurer chez moi;\n       I AUTRES GARANTIES\n        22. Je suis au courant que les infractions en lien avec la demande d extradition\n          auraient été perpétiées par [utlisation dintemet et dordinateur.\n          Actuellement, nous avons pas dordinateur dans notre résidence ni de\n\n```\n\n-----\n\n```\n        24. Jo comprends que le défaut de mon fis de respecter les conditions de\n         fordonnance de mise en liberté ou de son engagement pourrait entrainer\n           Ia confiscation de la somme engagée ou déposée a ftre de caution;\n       25. Je comprends que je peux en tout temps présente une demande pour éire.\n         relevée de mes fonctions en tant que caution (article 766 du Code criminel),\n        amener le prévenu devant le tribunal afin d'éte libérée de mes obligations\n          (article 767 du Code criminel) ou de le faire mettre sous garde (article 768\n         du Code criminel);\n        26. Malgré les antécédents judiciaires de mon fis, jai confiance en lui pour\n         respecter ses conditions, parce que je sais quil me respecte et quil mesure\n         timportance de cette somme pour moi considérant ma situation;\n        27. Je comprends qui titre de caution, jaccepte délre responsable dune\n         personne accusée d'un acte criminel et quil s'agit d'un engagement\n          sérieux;\n       28. Je sais qua titre de caution, mes obligations seront notamment de\n            a. Massurerque mon fils comparaisse devant le tribunal a heute ot\n           aux dates prévues;\n             b. Massurer que mon fis respecte toutes les conditions de\n           fordonnance de mise en liberté sous caution;\n           ©. Ne pas faire au nom de mon fils, quelque chose que ses conditions\n           de remise en bere lui interdit de faire directement ou\n            indirectement;\n\n```\n\n-----\n\n```\n                          Louisette VACHON\n       Déclaré solennellement devant moi\n       A Gatineau, ce 3 mai 2021\n       Commissaire a lassermentation\n\n```\n\n-----\n\n```\n                                           il est fait mention dans laffidavit de\n                            Louisette Vachon\n                          Assermenté devant moi a Gatineau,\n                            province de Québec, le 3 mai 2021\n                      Commissaire assermentation\n\n```\n\n-----\n\n```\n     Tor Anyauthorizedlawenorme ofc 7\n     YOU ARECOMMANDEDtosrsad ing efor United Stats judg without sassysy\n    roefront rie) SEBASTIEN ACHONDESIAROMS___ SE\n    hotscusedofa ffns orvt basedone ll dco! i ih hs cour.\n   of Idicmen © Supesediotodicnen © nfomaton// © Spesiogforaion 3Comply\n    ©Pobeton Violation eiion 1Serie ReeseVionPetion 0ViiaonNote ©OverofhsCot\n      Thi oe isbit died lls:\n    ConspkasyoCome CapuaFauciiain of 18UA. § 371 Conspacyl Comt Vice Frau inviominof\n anSumsge03Fone Cot vaso 30.5.6. 53 EOSIN(II,\n    {GAYAYGHVI).and(H4XBXT) andTransmitlingaDemyindinRelakionlo Damaging aProtectedComputer,inviolationof\n        18U.S.C. § 1030(a)7)(B),(a)7)(C).and(cX3)A).\n   owe 0EC 03 2020 (ers. ; . em\n  Hoan GenUL\n       Cityand state: _Tompo,Florida / mer EAEABETHWARREN,drench lot \\e0dStsBohCout ...,\n               Ter\n  [— tbeponvs oon\n   mts J TT\n    onc: J\n   — TrBT\n                     TTT niwdve ede\n\n```\n\n-----\n\n```\n    TAT 50 sc th oi ptco\n       rotackn | ANDWHEEAS rs isovioosis oursIo GosIk 1.3secessionoais\n    cra 5smscco onntocs ner. oe rt.\n  EE\n            Een 1 otoS TAT\n     yo re rent Coats\n    AT ty orssre rattsrs ERS\n      nees pe\n Sr\n    EPR htrstcrtst dt\n       Ir Ghana porSA apar Sao es ne ber pled dot cote\n       Sp Ls\n rei ee\n Ee pn Rl Ee\n      aH house,T2501 0rd10 elev afo PersonSOUTHS recon ns etn Pon\n      pr\n           alone xs\n       EETcoer\n     Spre)\n — JOR ae rn\n  AA 75. at gs\n\n```\n\n-----\n\n```\n                                             il est fait mention dans [affidavit de\n                              Louisette Vachon\n                           Assermenté devant moi a Gatineau,\n                             province de Québec, le 3 mai 2021\n                       Commissaire a Iassermentation\n\n```\n\n-----\n\n```\n         Goncecnant Stéphane FESCOTE (001), Sbatien VAGHEN BESIDES (002, Alesandce\n     Ee ie Tr nv Le 16 sermser 2020, 3 + vategoscto\n         afore? so ouliell of ellen “ELS i GI\n          Comatehnt inet Ticta criminal prave” 3 ‘Laceicie S01 (31a) en ia Eek\n        Comomans ieatien cH OHO (1D, Meanie hGLTO-ST- HEIR (G00\n                             Tor \"aa vn bau possessionah ves dram faire In Seale, sen. MEhenphetimiote;\n          Corationt inal Thats. crinirel ‘provi 3 Lackicie $310 de 1a ok\n         Concemmant sbsatien VACION SERMDINS (002), NesandesINIT:ST-NOON 653)\n        aon vreau 16 feveier 1020, 3 Gotinens 5% Vob-seroBote, ALSCELCE do Gatinens,\n            eu Su possession Su Canaria on we do Le dLsvEipseE on Conzarention su\n           Farastapnnjrpedipion 30111 someteint ainsy I acte Cririned peivs 8 article SCE) FAI So\n         Concetnant Sébastien YACKSN DESTASDINS (00), Aloxandee NILTOH-SI-RO0R (053)\n         aren vers 1a 16 Fuveier 2020, & Govinehs 0 Jaloihe-Bots, SLovEien de Guciness.\n           Gkectutene 5s GosiesctenantGe 14 pacpiczation, au Casace, dune. intsuction\n          EoLeniote sus acts a scommakion, donc Le wsiese SAsie 3000.5, Sometiont sine\n      Et tne Siow 4 omeions Soeini asa) de Code criminal\n      CanoaraantOi BO0STT (001), Sdbastian VACKO DESINDING (02), Nlssandce\n       Tron so oo :\n   Er Wtteier 2030, 0 vatsestets, dszicrdocrn,onto on\n     FEU a CT 2 a ol Tien sestaines\n\n```\n\n-----\n\n```\n     ELEm SenS SL MATS,Be LS SL\n     AS5,EB CnetCtSS tt oe fn AAOIEE TI rteto enns.\n   ES eal, Shel TeaS\n     EE I RLEL\n   EIST\n      Ev——n “\n    ETT TTiutacmepeatntoss\n         TTT mee TTT\n            . .\n\n```\n\n-----\n\n```\n                                           il est fait mention dans raffidavit de\n                  Losisati Vachon\n                          Assermenté devant moi a Gatineau,\n                  Province de Québe, lo 3 mal 2021\n                      Commissaire a l'assermentation\n\n```\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n```\n         code postal J8V 2M7, depuis septembre 1993;\n          2. Je vis avec ma conjointe Louisette Vachon, depuis 41 ans;\n          3. Mon numéro de téléphone de résidence est: (819) 246.9782\n         4. Jessuis retralté depuis environ 7 ans;\n        B. LIEN AVEC LE PREVENU :\n          5. Jesuisle pére de Sébastien Vachon Desjardins. J'ai une trés bonne relation\n         avec mon fils et il a du respect pour mo et sachant que je suis mpliqué\n         ‘comme caution, je suis convaincu qui agit d'un élément supplémentaire\n         quile motivera & respecter ses conditions. Sébastien est mon fils unique, je\n          suis prét & lider et l'encadrer comme tout bon pére de famille;\n        C. INFORMATION SUR LE PREVENU :\n         6. Mon fils Sebastien Vachon-Desjardins est né le 11 juillet 1987;\n       D. AUTRES INFORMATIONS EXIGEES\n        7. Jo nagis pas en tant que caution pour d'autres personnes;\n         8. Jo n'ai aucun antécédent ni aucune cause pendante;\n\n```\n\n-----\n\n```\n             Intentional Damageto a Protected Computerinviolation of 18 U.S.C.\n            1030(@)(5)(A), (CYA)AXIND, (CHANANIVD, and (cH4)B)): and\n            Transmitting a Demand in Relation to Damaging a Protected\n             Computer, in violation of 18 U.S.C. 1030(a)(7)(B), (aX7)C), and\n           (©X3)A)\n         11. Jai été informé du contenu des documents actuellement divulgués dans le\n         dossier relalifa la demande d'extradition. Jai pis connaissance notamment\n         des mandats d'arrestation du Canada et des Etats-Unis dAmérique et je\n          joins une copie desdits mandats avec mes initales pour en attester ma prise:\n         de connaissance; (A-1)\n        F. AUTRES INCULPATIONS PENDANTES VISANT LE PREVENU\n        12. Je comprends également que mon fils est accusé d'autres infractions & la\n         Cour du Québec a Gatineau, district de Gatineau, dans le dossier de Cour\n          portant le numéro 550-01-118357-203;\n        13. Je comprends que dans le dossier 550-01-118357-203, mon fi fait face &\n         des accusations de\n              a. Trafic de stupéfiants;\n              b. Possession de plusieurs sortes de stupéfiants en vue d'en faire le\n             faire le trafic;\n              ©. Recel;\n        14. Jai été informé sommairement du contenu de la preuve dans ce dossier.\n         Jai pris connaissance notamment de la dénonciation dans le dossier 550-\n\n```\n\n-----\n\n```\n        une copie desdis antécédents avec mes iniles pour en attester ma prise\n         de connaissance; (A-3)\n       H. ENGAGEMENT MONETAIRE OU DEPOT\n        18. En tant que caution pour mon fis je suis disposé & mengager a verser au\n          tribunal la somme de cent mille dollars (100 000.00 $) conjointement avec\n         ‘ma conjointe Louisette Vachon;\n        19. Sile tribunal exige le dépdt de la somme de cent mille dollars (100 000.00\n          $) au lieu d'un engagementpour ce montant, ma conjointe et mok-méme\n        sommes préts a en faire le dépot;\n        20. Site tribunal exige un engagement pour un montant plus important, ma\n          conjointe et mol-méme sommes disposés faire le sacrifice pour en offic\n          plus si nécessaire;\n         21. Siremis en liberté mon fils viendra demeurer chez moi;\n       I AUTRES GARANTIES\n        22. Je suis au courant que les infractions en lien avec la demande ‘extradition\n          auraient été pemétrées par [utiisation dlintemet ot dordinateur.\n          Actuellement, nous n'avons pas dordinateur dans notre résidence ni de\n         connexion internet. Nous avions pas prévu installer internet non plus.\n\n```\n\n-----\n\n```\n       24. Je comprends que le défaut de mon fils de respecter les conditions de\n         fordonnancea confiscation de de mise en la somme liberté engagée ou de ou son déposee engagement a ire de pourrait caution; entrainer\n       25. Je comprends que je peux en tout temps présenter une demande pour etre\n         relevée de mes fonctions en tant que caution (article 766 du Code criminel),\n        amener le prévenu devant le tribunal afin d'étre libéré de mes obligations\n          (article 767 du Code criminel) ou de le faire mettre sous garde (aricle 768\n         du Code criminel);\n        26. Malgré les antécédents judiciaires de mon fils, jai confiance en lui pour\n         respecter ses conditions, parce que je sais qui me respecte et quil mesure\n         Vimportance de cette somme pour moi considérant ma situation;\n        27. Je comprends qua titre de caution, jaccepte détre responsable d'une\n         personne accusée dun acte criminel et quil s'agit d'un engagement\n          sérieux;\n        28. Je sais qua tire de caution, mes obligations seront notamment de :\n           a. Massurer que mon fils comparaisse devant le tribunal a eure et\n           aux dates prévues;\n            b. Massurer que mon fis respecte toutes les conditions de\n           fordonnance de mise en liverté sous caution;\n           ©. Nepasfaire au nom de mon fils, quelque chose que ses conditions\n           de remise en liberté lui interdit de faire directement ou\n            indirectement;\n\n```\n\n-----\n\n```\n                  Robert Desjardins\n      Déclaré solennellement devant moi\n     A Gatineau, ce 3 mai 2021\n      Commissaire & Fassermentation\n\n```\n\n-----\n\n```\n                                                ilDearing est fait mention dans Iaffidavit de Robert\n                          Assermenté devant moi a Gatineau,\n                            province de Québec, le 3 mai 2021\n                       Commissaire & lassermentation oo\n\n```\n\n-----\n\n```\n      To: Anysthorzedlowexertoffs 5\n      YOU ARECOMMANDEDtorstad ing efor UtdStmagic fodgewithont ccs ely\n   refprontbrie) SEBASTIENVACHONDESIAROMS agreeereeenreeia?\n    hot esdofaa offenseorvitobis th ll dour Teilscout\n    of Inticmen 0 Superdog ndcmen. Information 3Supssding lafomaion 0 Compl\n    3 FoobotonViconPrion 0Supeviscd Reese Vionakion 0 Viiaion Notice ©Orderof he Court\n    This offreis ifydeserved a lls:\n     Consissy toCorn Compulr Fraud, iolaonof 18 A.C. 371; Conspscy aComet WisFru,invatonof\n     TBUSC:S 1348 Inlndond)Oamape oaPrtaciod Coyfulr invaste 1.0.5.6 8 1033053.(XNA\n  CHOXANON)0d CKINEX:andTamsinaCry i Raton 0Oat55% 8ProsedComp rion of\n     T8US.C55O3ENTIE).(ITN.ond HIN\n   owe DEC 03200 Geren OO\n               freer\n    Ciymdsue: Tomparods / _ clsetmewssneces esseonto\n                       Tetra one\n  [— epeeaw ny\n   tants of\n       4 JE\n                        Tr\n         mT\n\n```\n\n-----\n\n```\n    LAT 307ErLlns ctSOE ATemet Am entedlr petbo nc coinec,\n    a\n   A no cen mentscu ———\n           LE 0 Co 0\n       iedSeLo een\n  BT\n       PARAGRAPHETLE SUIVANT) eT ee im se en\n                                                     S\n  ESEToTcgittsti01\n               ns i Ci ieot uscn ts hdc satns\n       a ere\n BLSlA\n               a\n  FETE\n   er ae\n       Ere\n             [oie dissa,\n       a\n                        rire\n      Ec,\n    ——.\n          we sin\n                 rem\n        \"HON. CATHERINEMANDEVILLE, 4.C.8. ei Cs\n —— |\n      eliemT 0\n         yee\n\n```\n\n-----\n\n```\n                      REASys areenhrs on is.\n       Siemans span HSSCoT: (001, $escien AGH OESIAROTS (601, iersnize\n   EEFUTme rn dow st ae oe ti 1cats, wire\n          commarean”dune substance Sloe TREYincorita Seaman4 L'amnexs pears“I ou OILprésentée TSS,oa tems commeTH elie.\n        onemETantET Sonucommer Siberianvee dour SRT te 16 penieieion, VACHS OLSIROIN faves 3030, SLA 4h 3 ie Givinens (O12), SH ater Alerades, fois or eben LuSLI Sevtics NLACH-37-90R Een oh are Meneses 0% (063) os,\n   REAa\n        an-sa-enor\n         Concasnant Sibasian TACK CRAIMOTNS (003, Aexande IONGLION-S3-REAR. (063)\n     RRC ter rioyine hevg rakiariing toro J\n        Savage Tih Conend MTn Troets ovine pete 3 TeAR AT\n         GoncernantGreeeon vent Sibarsien ie Tafe ottenon VACKH Tovar DESMOND 30%, sacha 3 Gottman (G62), a tau Alexa oh on Thee preci INTONTRbaton oh Coes Siren (055) eetrent, Shnenet\n      irene tu keatiln me Connie soe cea\n     Elbo acts SLC, doo Le Sinise Soba, Cornea Shae]\n     DLL TR TTI Sa de\n     Somtasnanntsb tpaecact (061), Sibastion YACKN DESH (052), Nsaxandcs\n   is oy\n                ST Gu vars 0 16 favre: 2020, 8 Val-dus-ols, aistrics de Gacinens, cnt as an\n      Baroni ate tude ba are S87 aloe a TE\n        hee” Sh Te SiEa\n\n```\n\n-----\n\n```\n        STcesarATIEND0011 dnd 0TCconrts SGcmos ae aceipsi WHEREAS, Tory hrAR asrteBe rectRrbern Ll\n      Tae utarenao ns (ST Cr) SeseesEhCd\n        Atone, SES CAUSES,ou nomcrSo ls ptesu cr ur ci de vs THEREFORE.TS1 coudyo. or Meet rae,\n    iElbitvrs Ga SosanLvsvots Caensi ev Se to at rein rsRgnesSy sdibarramedia beootom ak Boo dobo or\n        Aatnaas 14sec 2020 n\n       TTSmasnnemeien CT advert\n         TT ima TTT eden\n\n```\n\n-----\n\n```\n                             Desjardins\n                           Assermenté devant moi a Gatineau,\n                             province de Québec, le 3 mai 2021\n                       Commissaire a lassermentation\n\n```\n\n-----\n\n-----\n\n-----\n\n-----\n\n```\n                            ssport ou ttre de\n        Voyage d'aucun autre pays;\n       3. En date du 27 janvier 2021, fai été amété par la GRC en fien avec une demande\n         damrestafion provisoire présentée par les Etats-Unis Amérique en vue d'une\n       demande d'extradion me concernant ;\n      4. Je fais le présent affidavit pour soutenir ma demande de remise en liberté en\n        attendant la décisionsurla demande d'extradition ;\n        5. aJai iste des de antécédents mes antécédents judiciaires judiciaires, pour lesquels pour valoirfai purgé comme une peine si était en récité 2015. au Je longjoins\n        dans mon affidavit ; (Annexe 1);\n      6. Au moment de mon amestation, jétais sous condition dans un dossier pendant a\n         1a Cour du Québec, 4 Gatineau, dossier portant le numéro 550-01-118357-203,\n       Dans cedossierje fais face & des accusations en lien avec :\n          - Trafic de stupéfiants;\n           + Possession de plusieurs sortes de stupéfiants en vue d'en faire le aire le trafic;\n           - Recel;\n       7. Jaitoujours respects les conditions qui mont été imposées par la Cour;\n      8. Depuis ma détention le 27 janvier 2021, et durant toute détention antérieure, e n'ai\n       Jamas fait robjet de rapport disciplinaire. Lorsque fai été en fibération\n         conditionnelle, ai toujours respecté les conditions qui mont é16 imposes;\n       9. Comme garanties au respect des conditions de remise en liberté, je suis prét &\n        souscrire aux engagements suivants :\n\n```\n\n-----\n\n```\n         © Ne pas étre contact avec des gens qui & ma connaissance ont des antécédents\n          criminels;\n       10. Dopuis mon incarcération, 'ai 16 placé en quarantaineadeux occasions, pour un\n         total de 1 mois. Les conditions de détention deviennent plus diffcies pendant ces\n        périodes de quarantaine. A titre d'exemple, jai été confiné en cellule 24/24 avec\n        une sortie de 15 minutes par jour, et certaines joumées cette sortie de 15 minutes\n        dans Ia cour ne fut pas accordée. En raison de la pandémis actuelle, il ny a pas\n        98 cours & Fécole do la prison, aucune visite n'est permise, les communications\n        avec a famille sont plus diffcies étant donné le nombre de personnes désireuses\n        dutliserdifficutéa le rejoindre téléphone. mon Parfois,avocat leen téléphone raison des n'est restrictions: pas disponible. J'éprouve de la\n      1. Lapremiére quarantaine a été imposéelorsde mon arrivée & Ia prison lo 27 janvier\n        2021. La deuxiéme quarantaine a été imposse du 3 avril au 17 avil parce quil y\n         avait une éclosion qui sévissalt dans le centre détention;\n      12. Actuellement, je suis toujours considéré un employé des Services publics et\n        Approvisionnement Canada (SPAC), mais, ma cote de secure a\n       81 suspendue durant fenquete effectuseparles SPAC. La cote de sécurité est un\n        préalable & l'emploi au sein des Services publics et Approvisionnement Canada\n       (SPAC) en vertu de la Loisur femploi dans la fonction publique dés lors, je ne suis\n        Plus aulorisé & avoir acces aux informations, aux biens, aux établissements ainsi\n        Qu'aux employés de SPAC, jusqua la conclusion de la révision pour motif valabie;\n      13. Advenant maremiseen liberts, Je suis prt 4 faire des démarches pour trouver un\n         ‘emploi légitime ef rémunéré dans lequel je aura acces a aucun ordinateur ou qui\n        nexige pas usage internet;\n\n```\n\n-----\n\n```\n                   je respecte mes parents et habiter sous leur toit est pour moi un\n          grand réconfort;\n        18. Je m'engage a me livrer aux autorités policiéres immeédiatement si le tribunal\n           ‘ordonnemon incarcération en attendant que je sois livré aux autorités américaines\n          dans le cadre de la procédure d'extradition;\n        19. A ma connaissance, il n'y a pas d'intemet ni dordinateur 4 la résidence demes\n           parents et je m'engage a ne pas utiliser intemet ni un ordinateur selon les\n           paramétres que la Cour pourra déterminer;\n        20. Tous les faits allégués dans le présent affidavit sont vrais au meilleur de ma\n        connaissance,\n         EN FOI DE QUOI JAI SIGNE AGatineau le 3 mai 2021\n       Sabai,Vabgy\n  oh\n           ‘Sébastien Vachon-Desjardins.\n         AFFIRME SOLLENNELLEMENTDEVANT OI A Gatineau le 3 mai 2021\n                  A\n   oil\n                  i —— rs\n        ce 4 Tassermentation {EEQe,i\n\n```\n\n-----\n\n```\n                                           il est fait mention dans laffidavit de\n                           Sébastien Vachon-Desjardins\n                          Assermenté devant moi a Gatineau,\n                            province de Québec, le 3 mai 2021\n                              I J\n                          mimi ‘alassermentation\n                 /\n                      /\n                on,\n                 Fee,\n            Qe\n\n```\n\n-----\n\n-----\n\n-----\n\n-----\n\n```\n   | 8\n           - 8\n   | LH\n        le g: 58 |§ : & |\n FE2 | 2g é5 ag$ 25 % 5 2388:£e.0 |\n |g | td 2 9 33 w 3 g, HH\n cEgl 8521 Esi: ig: § £8 azzi\n       8 | 3 g = ES : 2.0\n   g | © $0 od § E © Be\n  g Se 00 & fee\n  : of Eek er\n   § g 28 gEd F |\n   ; EE3 8st |\n  =| |&a8 8% gE |\n          BEE 2 ~ — J\n\n```\n\n-----\n\n```\n   T S— EE\n     |\n                      { |\n     | 3 =\n     | 22 2s3 - 3gC\n     | y 2 EE) E | 3 FI\n   0 |E £ 32 8 g £5, 8\n   2 zg 2 > 5 § Fresco\n     | § | Ea a 3g z z $ ERE\n   £ | gk 8 a3 i £ So feeds |\n  § | a3 21 3: z I] 83 jes2 |\n  i838] 5% §ie| 3 || fn\n   3 |3 g = 42 ¢ u 3 E520 |\n    | 3 sg EE t+ ffsE\n    | 8 zs Eh 3 : FC\n | [i 28 § 2 u 2 §\n IE w bh § ZZ ¥ 3 g\n   i E23 8g% ©\n Ls 8 Eg E2E\n\n```\n\n-----\n\n-----\n\n```\n       to this Applicant. More detail about our monitaring technology and programsis avalabl in our\n       ‘Compliance Monitoring Program for Criminal Cases document. Thisletterassumes that document has\n      been provided together with tis eter,\n          1, Stephen Tan,Director of Operations for RSC, have been contacted by counsel or[ Sebastien] [Vachon]\n       Besjarcins the Applicant. | confirm thatf the Applicant is granted bail with the requirement to be\n      monitored with a GPS ankle bracelet, RSC is prepared to provide that sevice. The technician would\n       instal the bracelet at a location and within a window of me required by the court, for cramle, at the\n       detention centreor within 24 or 48 hours a th residence. Ashorterwindow of ime for instalation is\n       possible, pending the specific requirements and confirmationby[RSC.]\n      understand that the Applicant proposestoreside at 23 Rue Ragueneau, Gatineau, Quebec. | confirm\n       that ths address is in an area of cellar coverage,so ha the GPS bracelet willbeable to communicate\n        its data, and themonitoringwil be functional.\n       Thisfetter does not reflect any assessment by RSCofwhetherthe Applicant and[ the][ overall][ plan][ of]\n       supervision meet the appicabe legal test for release.\n       (GPS monitoring performs two primary functions (1) t creates a continuous recordofthe wearer's\n       location and (2) it generates alerts when the accused leaves an area they ar [required][ to][ remain][within]\n       or enters an area they are not permitted to enter, Whenageographic restriction such as a house arrest\n       or curfew has no exceptions, the alert generated when [the][ wearer][ eaves][o][ enters][ the][ relevant][ area][ will]\n       result in immediate action on ourpart.When terms alow exceptionstoa geographic restriction, sich as\n       Surety-accompanied leave, or special purpose eaves (for work, school, meeting [with][ counsel][ tc),][ the]\n       Systemsgenerated alertb itself wil not be sufficientto incicateavilaion. We therefore perform\n       additional steps to verify compliance.\n      When an exception permits the accused to leave the residence n the companyof[ a][ surety,] [we][use][two]\n       tool. Every such leave must be preceded by the surety makinga cal to ur vice[ verification][ sytem.]\n      When we see the alert Indicating tha the accused has le the residence, we [check][ immediately][ to][ see]\n       whetherthe surety has passed the voice verification test. All surety-sccomparied [leaves are] so\n       Subject to random spot checks rearing the surety to submit ive video showing thesuretywith the\n       accused usingour vevideoapp installed on their mobile phone. Both of these[ tools][ result][ in][ immediate]\n       action on our partif not complied with.\n       Readiness/Commitment etterfoSebastien VACHON-DESIARDINS\n\n```\n\n-----\n\n```\n      Since une201,thre hovebeen ver 1500bls ane in provinces 5, A, S, WB, ON, CN,\n       NS here ourmonirinwe ar of he al hing ovr330SuperrCoun comtenssai\n  rainllsand 25 Cour of pes bt. Rh morte40 eae deve on oo\n   rineof Quebec. FC caren manos over 500 pape onl\n    Toe Applicant or copay forthe Applicant responsefor css Theres costohep the\n    own, cou, even fe ae rerei cence of sion. Wo sn pot, he Alcorn\n     orpayors inal make peyment rhe manor,SCwil eper onpov RCohcome\n    10Brovie themonnlhpoe a Crownas ha in 0 rr hl cure of son\n   Tos po, 5 hesemiratesior tee cove ot roBene\n     1am svatfor any further information or ssonce.\n    Snare\n  —Stephon Tom\n   Oecorof Operations\n    Recor Sores Corporation\n    To416.3371400or 18632275232\n     Readings Commie tr for ehstienVACHONDESATOINS\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://s3.documentcloud.org/documents/21199896/vachon-desjardins-court-docs.pdf"
    ],
    "report_names": [
        "vachon-desjardins-court-docs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1621608157,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/fc2c278b8a87914117c0d5bcb679b463272cb5de.pdf",
        "text": "https://archive.orkl.eu/fc2c278b8a87914117c0d5bcb679b463272cb5de.txt",
        "img": "https://archive.orkl.eu/fc2c278b8a87914117c0d5bcb679b463272cb5de.jpg"
    }
}