{
    "id": "dbc75275-78a0-43f9-8667-c1cb3d3742c3",
    "created_at": "2023-01-12T15:09:54.542912Z",
    "updated_at": "2025-03-27T02:17:11.753016Z",
    "deleted_at": null,
    "sha1_hash": "5405e09de233c1bf33688d912d0fbc67046ae2a0",
    "title": "2020-05-05 - Who Is Dmitry Badin, The GRU Hacker Indicted By Germany Over The Bundestag Hacks-",
    "authors": "",
    "file_creation_date": "2022-05-28T02:11:05Z",
    "file_modification_date": "2022-05-28T02:11:05Z",
    "file_size": 1867762,
    "plain_text": "# Who Is Dmitry Badin, The GRU Hacker Indicted By Germany Over The Bundestag Hacks?\n\n**[bellingcat.com/news/2020/05/05/who-is-dmitry-badin-the-gru-hacker-indicted-by-germany-over-the-bundestag-hacks/](https://www.bellingcat.com/news/2020/05/05/who-is-dmitry-badin-the-gru-hacker-indicted-by-germany-over-the-bundestag-hacks/)**\n\nMay 5, 2020\n\nMay 5, 2020\n\n[Germany](https://www.bellingcat.com/tag/germany)\n[GRU](https://www.bellingcat.com/tag/gru)\n\nOn 5 May 2020, German media reported that Germany’s Federal Prosecutor has issued an\n[arrest warrant against Russian citizen Dmitry Badin, the main suspect in the 2015 hacking of](https://www.bbc.com/news/technology-36284447)\nthe German Bundestag.\n\n## What Was The 2015 Bundestag Hack?\n\nIn April 2015, members of the German parliament as well as members of Merkel’s\nBundestag office, received an email that ostensibly originated from the United Nations,\nbased on its visible domain name “@un.org”. The mail was titled “Ukraine conflict with\n_Russia leaves economy in ruins“. The email carried malicious executable code that installed_\nitself on the victim’s computer.\n\nOver the next several weeks, the malicious software — which appeared to steal passwords\nand spread via the local networks — had taken over the whole Bundestag IT infrastructure,\nrendering its online services and external website inaccessible. In the background, logs later\n\n\n-----\n\nshowed, over 16 gigabytes of data had been sucked up by a foreign-based hacker. These\nincluded complete mailboxes of German parliamentarians. According to media reports,\nAngela Merkel’s parliamentary office was also breached.\n\n## Who Is Dmitry Badin?\n\nGerman media report that the German Federal Police has been able to link the 2015\nphishing campaign and subsequent data theft to Dmitry Badin, an assumed member of\nGRU’s elite hacking unit 26165, better known among cyber security analysts as APT28. The\noperations’ linkage to him has reportedly been made based on log analysis and “information\nfrom partner services”; however, no specific evidence of how the attribution was made has\nyet been made public.\n\nDmitry Badin was already on the FBI’s wanted list over his alleged involvement in several\nhacking operations attributed to GRU’s APT28 unit. Among these operations was the hack of\nthe [anti-doping organization WADA while it was investigating a doping administration](https://www.fbi.gov/wanted/cyber/gru-hacking-to-undermine-anti-doping-efforts)\n[program, as well the DNC hack on the eve of the U.S. presidential elections.](https://www.fbi.gov/wanted/cyber/russian-interference-in-2016-u-s-elections)\n\n## Validating Dmitry Badin’s Linkage To The GRU\n\nFBI documents describe Dmitry Badin briefly as “alleged to have been a Russian military\nintelligence officer, assigned to Unit 26165”, born in Kursk on 15 November 1990. His\npassport photograph was published as part of his Wanted package.\n\n\n-----\n\nBased on analysis of data from primarily open sources, we can confirm that Dmitry Badin,\nborn 15 November 1990, indeed works for GRU’s unit 26165.\n\nUsing Russian social-media reverse-image search application FindClone, we found Dmitry Badin’s\nphotographs in his wife’s VK account. We then re-validated that this is the same person by comparing the\n\ntwo photos in Microsoft Azure’s Face Verification tool\n\nA search for Badin’s full name and birth date in previously leaked Moscow car registration\ndatabases provided a match: Dmitry Sergeevich Badin, born on 15 November 1990,\npurchased a KIA PS car in June 2018. The car registration included the owner’s passport\nnumber and place of issue (St. Petersburg), as well as his registered address. Badin’s\nregistered address, as of 1 June 2018, was Komsomolsky Prospect 20.\n\n\n-----\n\n[This is the address of GRU’s military unit 26165, as can be seen from publicly available](https://zachestnyibiznes.ru/search?query=+26165++)\nRussian corporate registries. Unit 26165 is also known as the GRU’s 85th Main Center,\nspecializing in cryptography. The center first gained public notoriety in 2017, when our\n[Russian investigative partner The Insider discovered that an officer from this unit had](https://theins.ru/politika/58803)\ninadvertently left his personal metadata in a document leaked as part of the so-called\nMacron Leaks.\n\nAddress registration for Unit 26165\n\n[We have previously identified a breach in the operational security of Russia’s military](https://www.bellingcat.com/news/2018/10/04/305-car-registrations-may-point-massive-gru-security-breach/)\nintelligence that allowed the identification of at least 305 officers who had their cars\nregistered at this same address. Dmitry Badin was not among the list of 305 officers we\nidentified then due to the fact that he purchased his car after the car-registration database\nwe consulted in October 2018 had been publicly leaked.\n\n## Scaramouche, Scaramoush!\n\nCurrently, we have no knowledge of how German investigators were able to link Dmitry\nBadin to the Bundestag hack. However, open-source evidence we discovered may point to\nhis role in many more than the three hacking operations that his name has been linked to.\n\nUsing the license plate number of Badin’s car, we searched a leaked Moscow parking\n[database and found that he frequently parked his car near the dormitory of Russia’s Military](https://avinfo18.info/)\nAcademy at Bolshaya Pirogovskaya 51 The parking logs also contained two phone\n\n\n-----\n\nnumbers that he had used for mobile payments for his parking sessions. We then looked up\nboth of these numbers in various phone messengers and reverse-search phone databases.\n\nOne of the numbers appeared in the Viber messenger app under the obviously assumed\n[name of Gregor Eisenhorn, a character from the fantasy Warhammer 40,000 game.](https://en.wikipedia.org/wiki/Warhammer_40,000)\n\nThe other number appeared in two different phone-number look-up apps, both under his real\nname and under what would later appear to be his favorite alias: “Nicola Tesla.”\n\nWe then checked if this number was linked to a social media account in Russia, and\ndiscovered that it had been connected to a now-deleted account on VKontakte (VK).\n[Searching through archived copies of this account, we discovered that as of 2016 it had](https://topdb.ru/id14503478)\nbeen used under the name Dmitry Makarov. Even earlier, however, it had borne the name\nNicola Tesla, and also had the user name “Scaramouche”.\n\nData from archived copy of the now-defunct VK account, showing two linked numbers, including a Kursk\n\nland-line numbe\n\nDuring this period — which we could not date precisely from the archived copy — the user of\nthe VK account had been based in Kursk, which is where Dmitry Badin was born, and where\nhe grew up before moving to St. Petersburg. His Petersburg period — which can be\nestablished both from the place of issuance of his passport and from photos on his wife’s VK\naccount prior to 2014 — is likely linked to his university studies. Our prior investigations into\nmembers of GRU’s hacking team have established that a large number of the hackers\ngraduate from St. Petersburg computer science universities.\n\n\n-----\n\nWe also found out that Badin s mobile number is linked to a Skype account, which, like his\nnow defunct VK account, is in the name of “Nicola Tesla”, but uses the username\n**Scaramoush777.**\n\nScaramouche, from the Italian word scaramuccia, literally “little skirmisher”, is the standard\nevil-ish clown character from 16th-century commedia dell’arte. The word is probably better\nknown from the well-known recitative from Queen’s Bohemian Rhapsody. However, to cyber\nsecurity researchers investigating state-actor hacking operations, this word carries an\nadditional payload.\n\nIn March 2017, the cyber threats unit of the cyber security firm SecureWorks(c) [published its](https://www.secureworks.com/research/iron-twilight-supports-active-measures)\nown attribution white paper, reasoning its conclusions that the hacking exploits by APT28\n(which SecureWorks refers to with its own code name “Iron Twilight”) are a governmentsponsored operation, which is most likely linked to Russia’s military intelligence. In its report,\nSecureWorks lists both the targets that it has identified APT28 as having attacked, as well as\nthe tool set used by this shadowy hacker group.\n\n**The endpoint kit used by APT28 to perform screen captures and steal targets’**\n**credentials, is called Scaramouche. This particular set of malware got its name from**\n**the SecureWorks Cyber Threats Unit who named it, in their own words,“after the**\n**_Scaramouche username found in the PDB path of both tools”._**\n\nGiven that Dmitry Badin used the Scaramouche username —judging by all evidence —\nbefore he joined the GRU, it is unlikely that he usurped a pre-existing user name for his VK\nand Skype accounts. This is clear when based on being part of a team of GRU coders called\n“scaramouche”. Much more plausibly, the user name “scaramouche” discovered by CTU was\nnamely Badin’s own user name. This, in turn, would mean that the endpoint kit written by\nDmitry Badin was a crucial piece of the malware used in all hacks attributable to APT28.\nfrom attacks on Russian opposition figures and journalists to Western media organizations\n(including Bellingcat), the MH17 investigation team, the German Bundestag, and the DNC.\n\nIt would be prudent to ask: is it plausible that such a prolific and savvy hacker would leave\nsuch traces that would readily implicate him in serial cyber crime? It is not so hard to believe,\ngiven GRU hackers’ own nonchalance towards covering their own tracks. Badin’s colleagues\n\n\n-----\n\nwho were caught trying to hack the OPCW s lab in the Hague, for example, were carrying on\ntaxi receipts explicitly showing a route from GRU’s headquarters to the airport. We could\neasily identify 305 of them simply by the address they had registered their cars at, not to\nmention Badin himself registered his vehicle to the official address of his GRU unit.\n\nThe most surreal absence of “practice-what-you-breach” among GRU hackers might be\nvisible in their lackadaisical attitude to their own cyber protection. In 2018, a large collection\nof hacked Russian mail accounts, including user name and passwords, was dumped online.\nDmitry Badin’s email — which we figured out from his Skype account, which we in turn\nobtained from his phone number, which we of course got from his car registration — had\nbeen hacked. He had apparently been using the password Badin1990. After this, his email\ncredentials were leaked again as part of a larger hack, where we see that he had changed\nhis password from Badin1990 to the much more secure Badin990.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-05 - Who Is Dmitry Badin, The GRU Hacker Indicted By Germany Over The Bundestag Hacks-.pdf"
    ],
    "report_names": [
        "2020-05-05 - Who Is Dmitry Badin, The GRU Hacker Indicted By Germany Over The Bundestag Hacks-.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536194,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703865,
    "ts_modification_date": 1653703865,
    "files": {
        "pdf": "https://archive.orkl.eu/5405e09de233c1bf33688d912d0fbc67046ae2a0.pdf",
        "text": "https://archive.orkl.eu/5405e09de233c1bf33688d912d0fbc67046ae2a0.txt",
        "img": "https://archive.orkl.eu/5405e09de233c1bf33688d912d0fbc67046ae2a0.jpg"
    }
}