{
    "id": "dbc89bda-b6a6-4bae-b4ee-660f797b3069",
    "created_at": "2023-01-12T15:04:46.516977Z",
    "updated_at": "2025-03-27T02:09:30.375472Z",
    "deleted_at": null,
    "sha1_hash": "89a983bd54dfa1f87c69c3b4950a078f326d260b",
    "title": "2015-09-11 - SUCEFUL- Next Generation ATM Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:00:05Z",
    "file_modification_date": "2022-05-28T18:00:05Z",
    "file_size": 1010110,
    "plain_text": "# SUCEFUL: Next Generation ATM Malware\n\n**[fireeye.com/blog/threat-research/2015/09/suceful_next_genera.html](https://www.fireeye.com/blog/threat-research/2015/09/suceful_next_genera.html)**\n\n\n-----\n\nYou dip your debit card in an automated teller machine (ATM) and suddenly realize it is stuck\ninside, what happened?\n\na)  You took too much time entering details.\n\nb)  There was an error in the network connection to the bank.\n\nc)  The machine is infected with malware and your card was intentionally retained to be\nejected to the crooks once you walk away asking for help.\n\nIf you answered ‘c’ you might be correct! FireEye Labs discovered a new piece of ATM\nmalware (4BDD67FF852C221112337FECD0681EAC) that we detect as\nBackdoor.ATM.Suceful (the name comes from a typo made by the malware authors), which\ntargets cardholders and is able to retain debit cards on infected ATMs, disable alarms, or\nread the debit card tracks.\n\nATM malware is not new, back in 2013 and 2014 threats like Ploutus[1] or PadPin[2]\n(Tyupkin) were used to empty ATMs in Mexico, Russia and other countries, but SUCEFUL\noffers a new twist by targeting the cardholders.\n\nSUCEFUL was recently uploaded to VirusTotal (VT) from Russia, and based on its\ntimestamp, it was likely created on August 25, 2015. It might still be in its development\nphase; however, the features provided are shocking and never seen before in ATM malware.\n\n\n-----\n\nFigure 1. SUCEFUL Testing Interface\n\nBy clicking on different buttons in the GUI shown in Figure 1. The malware authors can test if\nthe malware operates properly; the word “SUCEFUL” is displayed in the text box indicating\nsuccess.\n\nPotential SUCEFUL capabilities in Diebold or NCR ATMs include:\n\n1. Reading all the credit/debit card track data\n2. Reading data from the chip of the card\n3. Control of the malware via ATM PIN pad\n4. Retention or ejection of the card on demand: This could be used to steal physical cards\n5. Suppressing ATM sensors to avoid detection\n\n**XFS Manager**\n\nSimilar to Ploutus and PadPin, SUCEFUL interacts with a middleware called XFS Manager\nwhich is part of the WOSA/XFS[3] Standard that major vendors comply with. The XFS\nManager is the interface between the application (malware in this case) and the peripheral\ndevices (e.g., printer, dispenser, card reader, in pad) as shown at Figure 2.\n\n\n-----\n\nFigure 2. WOSA/XFS Architecture\n\nOne benefit of the XFS Manager is that it is vendor independent, similar to Java’s “Write\nonce, run anywhere” mantra. This means that it can be used maliciously by ATM malware, so\nthat it can run transparently in multiple hardware vendors. This is the case of SUCEFUL,\nwhich is targeted for Diebold and NCR.\n\nEvery vendor has its own implementation of the XFS Manager with proper security controls\nin place; however, they also support the default XFS Manager template provided by\nWOSA/XFS Standard allowing the attackers to create their own interface with the ATM.\n\nThe Service Provider Interfaces (XFS SPIs) are vendor-dependent developed to provide the\nfunctionality of their own hardware.\n\n**Establishing a connection with the XFS Manager**\n\nAs shown in Figure 3, the first step before starting interacting with the ATMs peripheral\ndevices is to establish a connection with the XFS Manager via WFSStartup API.\n\nFigure 3. Connecting with the XFS Manager via XFSStartUp API\n\n**Opening sessions with the peripheral devices**\n\nThe next step is to open sessions with the peripheral devices via the Service Providers (XFS\nSPIs) through the XFS Manager by calling WFSOpen or WFSAsyncOpen APIs where the\nfirst parameter is the Logical Device Name.\n\nIn Figure 4, a session with Diebold Card Reader is being initiated where the logical device\nname is “DBD_MotoCardRdr”.\n\nFigure 4. Diebold Card Reader\n\nIn Figure 5, a session with NCR Card Reader is being initiated where the logical device\nname is “IDCardUnit1”:\n\n\n-----\n\nFigure 5. NCR Card Reader\n\nIn Figure 6, a session with the Sensors and Indicators Unit (SIU) is being initiated:\n\nFigure 6. Sensors and Indicators Unit\n\nThe SIU provides functions to operate port (indicators) categories including but not limited to:\n\nDoor Sensors: cabinet, safe, or vandal shield doors\nAlarm Sensors: tamper, seismic, or heat sensors\nProximity Sensors\n\nIn Figure 7, a session with NCR PIN pad is being initiated where the device logical name is\n“Pinpad1”.\n\nFigure 7. Connecting with the ATM PIN pad\n\nBy reading information from the PIN pad, the crooks could interact with the ATM malware.\n\n**Interacting with the peripheral devices**\n\nOnce a session has been opened, the APIs WFSExecute or WFSAsyncExecute can be used\nto request specific operations to the peripheral devices where the second parameter is the\ncommand to be executed.\n\n**Reading debit card track data**\n\n\n-----\n\nIn Figure 8, the WFS_CMD_IDC_READ_RAW_DATA command instructs the card reader to\nread all the track data and chip if a card is inserted or wait to read it as soon as the card has\nbeen inserted or pulled through.\n\nFigure 8. WFS_CMD_IDC_READ_RAW_DATA Command\n\nTrack 1 & 2 contain information like cardholder’s name, account number, expiration date,\nencrypted PIN, etc.\n\n**Retain and/or Eject debit card**\n\nThe WFS_CMD_IDC_RETAIN_CARD command in Figure 9 instructs the Card Reader to\nretain the card:\n\nFigure 9. WFS_CMD_IDC_RETAIN_CARD\n\nIn Figure 10, the WFS_CMD_IDC_EJECT_CARD command instructs the Card Reader to\neject the card:\n\nFigure 10. WFS_CMD_IDC_EJECT_CARD\n\nThis RETAIN and EJECT commands suggest that the malware authors can retain debit\ncards inserted into the ATM and eject them whenever they want stealing the physical card\nfrom the victims.\n\n**Interact with the Malware via PIN pad**\n\nIn Figure 11, the WFS_CMD_PIN_GET_DATA command is used to read the keystrokes\nentered by the cardholder (or attacker) in the PIN pad.\n\n\n-----\n\nFigure 11. WFS_CMD_PIN_GET_DATA\n\nOnce the input is read, a loop will run to identify the keys typed in the Pin pad, which can be\nKey0-9, Key-ENTER, Key-CANCEL or KEY-CLEAR. In Figure 12, the Key-0 and Key-1 are\nbeing checked:\n\nFigure 12. Pin pad Keys check\n\n**Disabling ATM Sensors**\n\nIn Figure 13, the WFS_CMD_SIU_SET_PORTS command could be able to set or clear ATM\noutput ports (indicators) in order to avoid triggering the alarms, some of the sensors that can\nbe controlled are:\n\nTurn on/off the Audible Alarm device\nTurn on/off the Facial light\nTurn on/off the Audio indicator\nTurn on/off the Internal Heating device\n\nFigure 13. WFS_CMD_SIU_SET_PORTS\n\nIn Figure 14 the WFS_CMD_SIU_SET_AUXILIARY command is used to set the status of an\nAuxiliary indicator including but not limited to:\n\n\n-----\n\nWFS_SIU_VOLUME: Set the value of the volume control\nWF_SIU_REMOTE_STATUS_MONITOR: Set the value of the Remote Status Monitor\nWFS_SIU_AUDIBLE_ALARM: Set the value of the Audible Alarm\n\nFigure 14. WFS_CMD_SIU_SET_AUXILIARY\n\n**DLL Hooking**\n\nAlthough DLL Hooking is not a novel technique, it is interesting to understand the reason this\nis being done inside an ATM. SUCEFUL is able to hook the WFSAsyncExecute API in order\nto control and monitor all the commands issued to the peripheral devices, this is done by\nreplacing the first 6 bytes of the API Entry point with a classical push <malware_func>, ret\ninstruction (see Figure 15) to redirect execution, as well as patching the RVA address in the\nExport Directory pointing to WFSAsyncExecute Entry point.\n\nFigure 15. Hooking WFSAsyncExecute API\n\n**Conclusion**\n\nSince it is impossible to ascertain whether a retained card is due to this malware, keep the\ncontact number for your bank in your phone and call it while keeping eyes on the ATM.\n\nSUCEFUL is the first multi-vendor ATM Malware targeting cardholders, created to steal the\ntracks of the debit cards but also to steal the actual physical cards, which is definitely raising\nthe bar of sophistication of this type of threats.\n\n**List of known MD5s**\n\n4bdd67ff852c221112337fecd0681eac  - Backdoor.ATM.Suceful\nf74755b92ffe04f97ac506960e6324bb  - Backdoor.ATM.Suceful\n\n\n-----\n\n[1] Ploutus: http://www.symantec.com/connect/blogs/texting-atms-cash-showscybercriminals-increasing-sophisticatio\n\n[2] Padpin: https://www.symantec.com/security_response/writeup.jsp?docid=2014-0512130525-99&tabid=2\n\n[3] WOSA/XFS: http://www.cen.eu/work/areas/ict/ebusiness/pages/ws-xfs.aspx\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-09-11 - SUCEFUL- Next Generation ATM Malware.pdf"
    ],
    "report_names": [
        "2015-09-11 - SUCEFUL- Next Generation ATM Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535886,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653760805,
    "ts_modification_date": 1653760805,
    "files": {
        "pdf": "https://archive.orkl.eu/89a983bd54dfa1f87c69c3b4950a078f326d260b.pdf",
        "text": "https://archive.orkl.eu/89a983bd54dfa1f87c69c3b4950a078f326d260b.txt",
        "img": "https://archive.orkl.eu/89a983bd54dfa1f87c69c3b4950a078f326d260b.jpg"
    }
}