{
    "id": "dbd35a20-43ae-470d-a371-773d15a64527",
    "created_at": "2023-01-12T15:00:03.526124Z",
    "updated_at": "2025-03-27T02:05:57.934531Z",
    "deleted_at": null,
    "sha1_hash": "3ac6bd7485e5586b86b765c6b30573b616708b64",
    "title": "2020-09-17 - GuLoader's VM-Exit Instruction Hammering explained",
    "authors": "",
    "file_creation_date": "2022-05-28T19:18:52Z",
    "file_modification_date": "2022-05-28T19:18:52Z",
    "file_size": 679694,
    "plain_text": "# GuLoader's VM-Exit Instruction Hammering explained\n\n**joesecurity.org/blog/3535317197858305930**\n\nIn [Joe Sandbox Cloud Basic, our community version of Joe Sandbox, we often get very](https://www.joesandbox.com/analysispaged/0)\ninteresting and recent malware samples. On the September 16th, 2020 we came across a\nnew GuLoader variant (MD5: 01a54f73856cfb74a3bbba47bcec227b). GuLoader is a\nmalware loader well known for its anti-evasion techniques.\n\n## Slow VM Exits\n\nThe initial analysis on a virtual machine showed the following results:\n\n\n-----\n\nAs we can see in the Signature section, there are some RDTSC based evasion checks\nexecuted:\n\nAmong many other anti-evasion checks, GuLoader uses the following code to detect that it is\nrunning in a virtual machine:\n\n\n-----\n\nThe code has two main purposes. First, it measures how long the execution of the CPUID\ninstructions takes. On real hardware, CPUID is directly executed by the CPU. Inside a virtual\nmachine, the CPUID instruction forces a VM exit - execution is transferred from the guest VM\nto the host. The hypervisor handles the instructions and switches back. This transition is\nmuch slower compared to direct CPU execution. The same is true for other instructions like\nRDTSC. This difference is measured and used to decide if the loader is going to execute the\npayload or not.\n\n## Instruction Hammering\n\nSecondly, the measurements are not executed once but executed thousands of times. The\nresult is an overall delay which often exceeds the execution time on a sandboxed analyzer.\nAs a result, the payload execution is never reached. This method of executing massive\namounts of delay instructions to prevent the execution - also known as Instruction\n**Hammering - is very similar to** [API hammering, a technique we saw in TrickBot and many](https://www.joesecurity.org/blog/498839998833561473)\nother malware samples.\n\nInstruction Hammering is extremely powerful since it is hard to detect and challenging to\nbypass, as it exploits the architecture of virtualization. The GuLoader creators seem to have\nnoticed that, and in the new version they have even increased the number of delay\ninstructions being executed:\n\n\n-----\n\nThis code executes RDTSC and CPUID 11 million times. In\naddition, UserSharedData.SystemTime is being used for time measurements.\n\nOn a Windows 10 x64 system running on VirtualBox the delay loop takes several minutes to\nfinish:\n\n\n-----\n\nOn real hardware, the loop is executed in under one second!\n\n## Bare Metal Analysis to the Rescue\n\nJoe Sandbox is one of a few vendors offering analysis on bare metal. In this setup, the\nmalware sample is run on a real physical machine. Physical machines are much closer to the\nreal target of the malware. As a result, VM-based evasions don't work and the sandbox can\ncatch and record the real payload. If we analyze GuLoader on bare metal the delay loop is\npassed in under a second and we can see that the LuminosityLink RAT is dropped:\n\n\n-----\n\n[The full analysis report of the GuLoader variant is available here.](https://www.joesecurity.org/reports/report-01a54f73856cfb74a3bbba47bcec227b.html)\n\n[Interested in Joe Sandbox? Register for free at Joe Sandbox Cloud Basic or](https://www.joesandbox.com/) [contact us for](https://www.joesecurity.org/contact)\nan in-depth technical demo!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-17 - GuLoader's VM-Exit Instruction Hammering explained.pdf"
    ],
    "report_names": [
        "2020-09-17 - GuLoader's VM-Exit Instruction Hammering explained.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535603,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1653765532,
    "ts_modification_date": 1653765532,
    "files": {
        "pdf": "https://archive.orkl.eu/3ac6bd7485e5586b86b765c6b30573b616708b64.pdf",
        "text": "https://archive.orkl.eu/3ac6bd7485e5586b86b765c6b30573b616708b64.txt",
        "img": "https://archive.orkl.eu/3ac6bd7485e5586b86b765c6b30573b616708b64.jpg"
    }
}