{
    "id": "dbf11038-bc20-4247-bb1b-59d664d70d3e",
    "created_at": "2023-01-12T15:01:10.584047Z",
    "updated_at": "2025-03-27T02:08:40.865514Z",
    "deleted_at": null,
    "sha1_hash": "2635e1d5336b52ddb6c9b15594e14776466d7f2a",
    "title": "2021-05-05 - Malware group leaks millions of stolen authentication cookies",
    "authors": "",
    "file_creation_date": "2022-05-27T22:42:36Z",
    "file_modification_date": "2022-05-27T22:42:36Z",
    "file_size": 500610,
    "plain_text": "# Malware group leaks millions of stolen authentication cookies\n\n**[therecord.media/malware-group-leaks-millions-of-stolen-authentication-cookies/](https://therecord.media/malware-group-leaks-millions-of-stolen-authentication-cookies/)**\n\nMay 5, 2021\n\nTo add insult to injury, after users were infected by a malware strain that stole their\npasswords and personal data, the malware operators forgot to secure their backend servers,\nwhich leaked sensitive user information for hundreds of thousands of victims for more than a\nmonth.\n\nFor weeks, [Bob Diachenko, Cyber Threat Intelligence Director at security firm Security](https://twitter.com/MayhemDayOne)\nDiscovery, has been trying to convince a cloud provider to intervene and take down a\nmalware group’s server that was leaking hundreds of thousands of stolen\n**passwords and millions of authentication cookies.**\n\nThe data was leaked via an Elasticsearch server left exposed online without a password.\n\n\n-----\n\nImage: The Record\nThe server exposed data that is typically collected by a type of malware known as an\ninfostealer. This type of malware infects devices and then collects user credentials from web\nbrowsers, FTP, and email clients, data that is later uploaded to command and control (C&C)\nservers.\n\nTypically, most C&C servers are hosted on a hacked website or a cheap virtual private server\n(VPS), and then the data is aggregated in a so-called data lake, where it is centralized for\nfurther analysis.\n\nThe Elasitcsearch server discovered by Diachenko is believed to be one of these data lakes,\nwhere crooks were aggregating their stolen information.\n\nAccording to [Vitali Kremez, CEO of threat intelligence company Advanced Intelligence,](https://twitter.com/VK_Intel/)\n[and James Maude, lead cyber-security researcher at security firm BeyondTrust, based on](https://twitter.com/EndpointSec)\nthe format of the “bot_ID” field assigned to each infected host, the server was collecting data\n[from users infected with version 1.7.2 of the RaccoonStealer malware.](https://malpedia.caad.fkie.fraunhofer.de/details/win.raccoon)\n\n“Racoon is fairly typical Malware-as-a-Service where for $75-$200 per month you get access\nto the toolkit to generate malware payloads and a backend website to administer your\ncampaign from,” Maude told The Record in an email interview last month.\n\n\n-----\n\nIt is designed to steal login credentials, credit card information, cryptocurrency wallets, and\nbrowser information. People often don’t realize, but things like the password store on\nChrome are encrypted using the Windows API. This means that if the malware is running in\nthe user context, it can decrypt all the logins saved in the Chrome DB and steal them,”\nMaude said.\n\nAnd according to data seen by this reporter, Maude was right. The Elasticsearch server did\nnot only hold personal victim data like emails, usernames, and device details but was also\nstoring cleartext passwords and even authentication cookies.\n\nImage: The Record\n\n\n-----\n\nImage: The Record\n\nImage: The Record\nIn the leaked data, we found credentials and cookies for email accounts, social media\nprofiles, work applications, and even government portals.\n\nOf the entire data collected in the server, the most prevalent were authentication cookies,\ncollected in the millions, rather than passwords, which were only hundreds of thousands.\n\nThe reason why the threat actor focused on stealing authentication cookies is that they allow\nbetter and easier access to an account compared to usernames and passwords.\n\nAuth cookies, as they are also called, allow intruders to access victim accounts without\nneeding to authenticate using usernames and passwords and even bypass any two-step\nverification process that victims might have had in place.\n\n\n-----\n\nFor this reason, authentication cookies are highly prized in the cybercrime ecosystem.\n[Cybercrime marketplaces such as Genesis or](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/) [RichLogs often list authentication cookies for](https://twitter.com/campuscodi/status/1134958433243926530)\nsale on their portals.\n\n## Server disappeared today without a trace\n\nBut while Diachenko has been fighting for weeks with little success to get the cloud provider\nto intervene and take down this malware gang’s data, the server mysteriously disappeared\nearlier today.\n\nAt the time of writing, it is unclear if the cloud provider finally decided to act or if the malware\ngang saw Diachenko and this reporter sift through the data while preparing this article.\n\nDiachenko told The Record he plans to provide parts of the stolen data he discovered in the\nnow-defunct Elasticsearch server to Troy Hunt, the operator of the Have I Been Pwned\nportal, so the data can be indexed and allow users to check if their account passwords and\ncookies were compromised. Diachenko said most of the data was for users living in the\nUnited Arab Emirates and other Middle East countries.\n\nWe will update this article when the stolen data is going to be added to HIBP, so readers can\nknow they can check it there.\n\nTags\n\n[authentication cookies](https://therecord.media/tag/authentication-cookies/)\n[cookies](https://therecord.media/tag/cookies/)\n[credentials](https://therecord.media/tag/credentials/)\n[data leak](https://therecord.media/tag/data-leak/)\n[Elasticsearch](https://therecord.media/tag/elasticsearch/)\n[infostealer](https://therecord.media/tag/infostealer/)\n[leak](https://therecord.media/tag/leak/)\n[malware](https://therecord.media/tag/malware/)\n[passwords](https://therecord.media/tag/passwords/)\n[Raccoon](https://therecord.media/tag/raccoon/)\n[RaccoonStealer](https://therecord.media/tag/raccoonstealer/)\n\nCatalin Cimpanu is a cybersecurity reporter for The Record. He previously worked at ZDNet\nand Bleeping Computer, where he became a well-known name in the industry for his\nconstant scoops on new vulnerabilities, cyberattacks, and law enforcement actions against\nhackers.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-05 - Malware group leaks millions of stolen authentication cookies.pdf"
    ],
    "report_names": [
        "2021-05-05 - Malware group leaks millions of stolen authentication cookies.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535670,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653691356,
    "ts_modification_date": 1653691356,
    "files": {
        "pdf": "https://archive.orkl.eu/2635e1d5336b52ddb6c9b15594e14776466d7f2a.pdf",
        "text": "https://archive.orkl.eu/2635e1d5336b52ddb6c9b15594e14776466d7f2a.txt",
        "img": "https://archive.orkl.eu/2635e1d5336b52ddb6c9b15594e14776466d7f2a.jpg"
    }
}