{
    "id": "dc0c0ce0-7efe-42bc-972a-a90d1f62b60b",
    "created_at": "2022-10-25T16:48:17.678496Z",
    "updated_at": "2025-03-27T02:16:26.095989Z",
    "deleted_at": null,
    "sha1_hash": "3bb5dd467d55de7dee2c7894ca3c7f31af092cad",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-01-11T13:26:32Z",
    "file_modification_date": "2021-01-11T13:26:34Z",
    "file_size": 1592748,
    "plain_text": "# Interview with\n a LockBit\n ransomware\n operator\n\n#### By Azim Khodjibaev,\n Dmytro Korzhevin and Kendall McKay\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n### CONTENTS\n\n**Introduction................................................................................................................................................................................. 3**\n\n**Initial contact and actor credibility............................................................................................................................................. 4**\n\n**Professional background and actor motivation......................................................................................................................... 5**\n\n**Confirmed theories ..................................................................................................................................................................... 5**\n\n**Ransomware operations and TTPs............................................................................................................................................. 6**\n\n**Conclusion................................................................................................................................................................................... 9**\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n### INTRODUCTION\n\n In September 2020, Cisco Talos established contact with a self-described\n\n LockBit operator and experienced threat actor. Over the course of several\n\n weeks, we conducted multiple interviews that gave us a rare, first-hand\n\n account of a ransomware operator’s cybercriminal activities. Through\n\n these exchanges, we gleaned several valuable takeaways for executives\n\n and the broader cybersecurity community.\n\n\nCompanies and security strategists are often most\nconcerned about prolific threats that garner lots of media\nattention — those involving APTs, sophisticated TTPs and\nlarge-scale compromises costing organizations millions of\ndollars. What is frequently overlooked, though, is a more\ncommon and simpler type of threat, which was represented\nby the LockBit operator we spoke with. The actor is\nallegedly self-taught and stays up to date on the latest\ncybersecurity developments, weaponizing new research\nto use in future attacks. He operates alone, without the\nsupport of a large group or state actor. He uses well-known\ntactics, relying heavily on common tools like Mimikatz,\nPowerShell, and others rather than exploiting zero-day\nvulnerabilities or using more sophisticated methods. He\nlooks for targets with well-known security issues that can\nbe easily exploited, and, like many criminals, he says he\nseeks only modest financial gains to provide for his family.\n\nThis actor’s TTPs remind us to remain vigilant about\nthese seemingly unsophisticated, common cybercriminals\nwho, despite their straightforward approach to targeting\nand operations, continue to be highly successful in\ncompromising companies and wreaking havoc on\nunsuspecting victims. Below are our key takeaways for\nexecutives and network defenders from our interview with\nthis LockBit operator:\n\n##### • Threat actors continue to view unpatched systems\n**as an easy, if not preferred, method of intrusion.**\nRoutine patching can be difficult, especially for large\norganizations, and the bad guys know this, too. The\nmost commonly exploited vulnerabilities are those that\nare well-understood with publicly available exploit code.\n\n##### • Many cybercriminals rely almost exclusively on\n**common open-source tools that are readily available**\n\n\n**on the internet and easy to use. They are not looking**\nto reinvent the wheel, and tool reuse is a quicker, more\neffective way for them to carry out their operations\nthan leveraging more sophisticated means. Companies\nshould be most concerned about the tools and tactics\nthat are also likely used by their own red teams.\n\n##### • Cybercriminals are avid consumers of security\n**news and remain up to date on the latest research**\n**and vulnerabilities, weaponizing that information**\n**to use in future attacks. They are often self-taught**\nand hungry for continual knowledge, a mentality that\nall but ensures they will always be updating their TTPs\nand looking for new ways to make their attacks more\nsuccessful. Organizations should encourage their\nsecurity teams to continue their own learning — not just\nby obtaining industry-respected security certificates,\nbut by remaining familiar with the latest open-source\ninformation, conducting their own research, and closely\nfollowing trends in the threat landscape.\n\n##### • While threat actors may state publicly that their\n**personal ethics influence their target selection,**\n**many adversaries go after the easiest victims**\n**regardless of any moral obligation, based on our**\n**experience. We assess that schools, health care**\nproviders, and COVID-19 response-affiliated entities\nremain high-value targets — despite contrary claims\nby threat actors — given their generally under-funded\ncybersecurity teams and low downtime tolerance.\n\nThis report also has a human-interest component, as it\nexplores the actor’s professed motivations for transitioning\nfrom legitimate IT work to illicit cyber activity, his insights\non the current threat landscape, and his thoughts on other\nmajor ransomware groups. Below are some of the most\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\ninteresting claims this LockBit operator made, which, if true,\nprovide valuable insight into the current ransomware scene.\n\n##### • The actor appears to have a contradictory code of\nethics, portraying a strong disdain for those who\nattack health care entities while displaying conflicting\nevidence about whether he targets them himself. This is\nprobably representative of many adversaries engaged\nin illicit cyber activity.\n\n##### • Hospitals are considered easy targets, making ransom\npayments 80 to 90 percent of the time during a\nransomware attack.\n\n\n\n##### • Maze formerly kept up to 35 percent of ransom profits\nearned by its affiliates, an extremely high amount\ncompared to other ransomware groups that likely\ndeterred some actors from working with them.\n\n##### • The EU’s General Data Protection Regulation (GDPR)\nlaw plays to adversaries’ favor, with victims in Europe\nbeing more likely to pay ransoms to avoid the legal\nconsequences of the compromise if it became public\nknowledge.\n\n##### • The U.S. also has lucrative targets, but with data\nprivacy laws requiring victim companies to report all\nbreaches — regardless of whether an attack is mitigated\nvia cooperation with the adversary — the incentive for\nsuch entities to pay the ransom is likely somewhat\nreduced.\n\n### INITIAL CONTACT\n AND ACTOR CREDIBILITY\n\nThis operator has several usernames and handles on\nvarious social media platforms. As explained below,\nhe made initial contact with us on Twitter using his @\nuhodiransomwar account (transliterated from Russian as\n“go away, ransomware”). The first mention of this actor\nin open-source reporting was in June 2020, when he\n[published access to a major VPN provider’s SSH keys.](https://www.zdnet.com/article/hacker-leaks-passwords-for-900-enterprise-vpn-servers/)\n[That same month, security researchers at KELA mentioned](https://ke-la.com/the-secret-life-of-an-initial-access-broker/)\nuhodiransomwar as being active since 2009 and associated\nwith LockBit ransomware.\n\nOur contact with the actor, who we will refer to throughout\nthis report as the fictitious name “Aleks,” began in early\nSeptember, when he used his uhodiransomwar account to\nTweet that he had compromised a Latin American financial\ninstitution. Shortly thereafter, the actor tweeted at the\n\n\n_Figure 1: Screenshot of uhodiransomwar's tweet._\n\nvictim organization, this time tagging several cybersecurity\ncontacts, likely to compel the victim to respond by drawing\npublic attention to the attack. One of the tagged accounts\nbelonged to Bleeping Computer, a technology news website\n[that has previously communicated with other ransomware](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)\n[operators, and one of the authors of this paper, who focuses](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)\non cybercrime in Eastern Europe and Asia. We believe Azim\nwas tagged because he initially followed @uhodiransomwar’s\naccount for research purposes.\n\nWe used this initial indirect contact as an inroad to\nestablish communication with uhodiransomwar. We\ndirectly messaged Aleks with questions that were specific\nto the conditions he set for the victim. During our initial\nconversations, we shared what we believed to be Aleks’\nidentity and location based on our own research, which he\nconfirmed. The threat actor was familiar with Talos' work\nbased on the information available on their Twitter account.\nNotably, this did not discourage Aleks from engaging with\nus. Rather, it sparked a lot of curiosity about the “white hat”\nside of the business, as he referred to it. Our initial chats,\nwhich focused mostly on the victim, occurred over Twitter’s\ndirect messaging platform. It was during this time that Aleks\noffered to conduct an interview for what he referred to as\n“my interests and research purposes.” Talos accepted the\noffer, interviewing the subject over the course of several\ndays during late September and early October 2020.\n\nBefore the interview began, Aleks established some\npreconditions and guidelines. First, he requested that\nwe refer to him specifically as a “LockBit operator.”\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\nAdditionally, while he agreed to let us publish our summary and analysis of the\ninterview, he asked us not to share the evidence he provided as proof of his\naccess to LockBit operations. One of the pieces of evidence was a screenshot\nof a conversation between himself and the victim. Aleks also shared information\nabout a victim organization being compromised two days before the breach was\nmade public, highlighting his inside knowledge of LockBit threat activity. Lastly,\nAleks provided some evidence of victims that had paid their ransom on time,\nbut he did not want their names disclosed since they had “honored” their part\nof the transaction. As always, Talos provided any relevant information to our law\nenforcement partners at the conclusion of our research.\n\nWe found Aleks to be credible during our conversations. As outlined above and\nthroughout other parts of this report, he provided ample evidence of his standing\nwithin the LockBit community, including advance knowledge of LockBit operations\nand changes to the group’s ransomware, which we were able to corroborate. His\nseemingly strong moral convictions — including protecting victims’ identities if\nthey paid the ransom, his emphasis on the importance of establishing trust with a\nvictim, and the existence of certain ethical guidelines pertaining to targeting — also\npositively influenced our assessment of his credibility. Aleks also seemed to be\nforthcoming in sharing personal information about himself, including his immediate\nfamily, highlighting his openness and a degree of vulnerability. Lastly, we generally\nfound him responsive to our requests to maintain an ongoing dialogue and he was\nwilling to answer our questions with what seemed like full transparency.\n\n### PROFESSIONAL BACKGROUND\n AND ACTOR MOTIVATION\n\nBy learning about Aleks’ professional background and personal interests and\nbeliefs, we came to understand what drove him to engage in cyber criminal\nactivities, how he selects his targets, his thoughts on the ransomware threat\nlandscape, and more. However, we should note that Aleks’ views are his\nalone and may not necessarily represent those of the broader LockBit group.\nAdditionally, we cannot corroborate many of the claims he makes about the ease\nof targeting certain geographic regions and entities.\n\nAleks’ life is kept busy by his underground criminal activity, but he also claims\nto have legitimate interests and hobbies, including world history, culinary arts,\nand music. These conversations were representative of the fact that this threat\nactor, and others like him, lead seemingly normal lives that are filled with family\ndemands, work deadlines, and leisure activities.\n\nWe are confident that the threat actor is a male and resides in the Siberian region\nof Russia and has probably been an active ransomware operator for at least\nseveral years. We estimate that he is in his early 30s and believe that he has at\nleast a university-level education. Aleks claims he is self-taught in cyber-related\nskills such penetration testing, network security and intelligence collection, both\nopen-source and in the cybercriminal underground. He has been studying and\ntraining in IT since the 2000s, when the onset of widespread internet availability\nsparked his initial interest in what was then a new technology. This included\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n\nnetwork protocols and the entire line of dial-up protocols\n(up to v42.bis), which allowed the use of old telephone dialup lines and a Motorola modem.\n\nAfter gaining a good understanding of networks, Aleks\nbegan to focus on the markup and scripting languages\nsuch as HTML, CSS and JavaScript, along with small web\nframeworks like CodeIgniter. Subsequently, he began to\nwrite plugins for these frameworks while also learning\nhow the databases are organized. He spent ample time\nunderstanding particular issues within networks as well\nas the technology behind them. Over time, Aleks’ strong\nunderstanding of IT technologies helped him secure a job\nat an IT company while finishing his college degree. After\ngraduation, he continued his work in the IT field.\n\nDespite Aleks’ education and aptitude, he expressed a\ngeneral sense of disappointment, at times even resentment,\nfor not being properly appreciated within the Russian\ncyber industry. His frustration was evident during our\nconversations, with him disparaging several well-known\nRussian cybersecurity companies. He also remarked\nthat, “In the West, I would probably work in white [hat\nsecurity] and earn easily…” suggesting that his perceived\nunderappreciation and low wages drove him to participate\nin unethical and criminal behavior.\n\nAleks shared several examples of times he felt\nunderappreciated by his peers in the IT and cybersecurity\nfield. During his work, he periodically encountered various\nsecurity errors while setting up websites. He was naturally\ncurious about such unsecured sites that showed errors\nor were not working properly. In these cases, he would\ntry to understand the problem and then notify the site’s\nadministrators to help fix the issue. However, he was often\nmet with complete disregard for both the problem itself and\nhis efforts to offer a solution. Aleks continued to experience\nsimilar scenarios with other websites, including a wellknown Russian social networking site.\n\nBased on our conversations, it was clear that Aleks was\nfrustrated with being unable to warn about vulnerabilities\nand often felt like his well-intentioned efforts were ignored.\nThis became a significant motivator for him to pursue\nunethical and/or criminal work. Recounting one such\nexperience, he told us, “I found a blind SQL injection on\na Russian website. I reported and no one reacted, so I\ndropped it. I realized that our Big Brother (the Russian\none) doesn’t care about cybersecurity.” He surmised that\ninteractions like this encouraged researchers to find other\n\n\nways to use their skills for financial gain, suggesting many\nare turning to illegal activities.\n\nAleks also shared his pessimistic view on bug bounty\nprograms in which vendors pay independent researchers\nfor finding bugs and vulnerabilities in their products.\nAccording to him, there has been a strong tendency\nrecently to “deceive” people who report such security\nflaws. He said that companies are making efforts to find\nloopholes that allow them to forgo paying the researcher\nbased on technicalities in the completeness of their\nreport. However, this stands completely at odds with our\nprofessional observations from the security community. It\nmay be the case that Aleks chooses to view vulnerability\nprograms through this lens to account for his own decision\nto not participate in them or because he has heard\ninaccurate stories from other threat actors.\n\n### RANSOMWARE OPERATIONS AND TTPS\n\nOnce Aleks made the decision to turn to illicit cyber activity,\nhe dabbled in several different types of attacks, including\nattempting to compromise websites and distributed denialof-service (DDoS) attacks. He said he eventually settled on\nransomware because of its profitability and because it gave\nhim the opportunity to “teach” companies the consequence\nof not properly securing their data.\n\nAleks’ personal background and desire to be compensated for\nhis skills influences not only his motivation for engaging in illicit\nactivity, as described above, but also his guiding principles\naround how to carry out such operations. He attested to\nhaving a moral code and personal convictions, including a\nstrong sense of patriotism, that influences his target selection.\nDespite his claims, however, we found several instances in\nwhich he made conflicting claims about his ethics and actual\nconduct. For example, he told us that “for a cybercriminal,\nthe best country is Russia,“ while later explaining that he\nwill not target citizens of the former Soviet Union or “friends\nof Russia,” such as entities within the People’s Republic\nof China, a close Russian ally. Aleks also suggested that\nentities in post-Soviet states are not as lucrative from an\noperational perspective and therefore are not worth his time.\nWe believe that Aleks’ personal security is likely another factor\nin his targeting choices, as attacking Russian entities would\nprobably put him at additional risk to retaliation. He went\non to note that companies within the United States and the\nEuropean Union “will pay quicker and more,” suggesting those\nregions are where he focuses his targeting.\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n_Figure 2: A redacted and translated portion of our conversation in which Aleks talked about ransomware payments in the U.S. and Europe._\n_(Editor’s note: We mistakenly referred to the Sarbanes-Oxley Act as the “Sarbanes-Auxley Act [sp]” in this correspondence.)_\n\n\nAdditionally, Aleks claims that he avoids targeting entities\nrelated to health care, labor unions and education. He\ncriticized other ransomware operators that do not share\nsimilar ethical views, saying “just because you are a criminal\ndoesn’t mean you have to stop being a human being.” In a\nlater conversation, he went further, adding that “if you are\nattacking hospitals during COVID-19, you are a [expletive].”\nTalos notes that although the Aleks claims to not attack health\ncare institutions, we have reason to believe this is not the\ncase. He shared information with us during our conversations\nthat presumably would only be known by those involved\nin such operations, such as that “hospitals pay 80 to 90\npercent of the time because they simply have no choice.”\nMoreover, his impassioned denial about being involved in such\nactivity is somewhat suspicious and suggests he might be\novercompensating to hide potential falsehoods.\n\nRegarding entities Aleks does target, he tends to focus on\nIT firms that he thinks should be practicing better network\nsecurity. In our conversations, he made clear that he wanted\nto “teach them” to employ better security measures. He\nalso has geographic preferences, noting that the Middle\nEast has many “easy” targets with “weak cybersecurity.” He\nadded that the EU is the most lucrative area, as Europeans\nare very concerned with data privacy. Aleks noted that\n[the General Data Protection Regulation (GDPR) law plays](https://en.wikipedia.org/wiki/General_Data_Protection_Regulation)\nto his favor, as victim organizations are more likely to\n\n\npay ransoms for fear of facing legal consequences if the\ncompromise becomes public knowledge. The United States\nis also lucrative, but, according to Aleks, its laws around\ndata breaches negatively affect the threat actor’s degree of\ninfluence during a ransomware operation. In such situations,\n[he explained, the actor has less leverage since U.S. laws](https://en.wikipedia.org/wiki/Sarbanes%E2%80%93Oxley_Act)\nrequire victim companies to publicly disclose breaches\nanyway. (We note, however, that incentive to pay the\nransom might still exist regardless of any legal or regulatory\nrequirements if the victim believes it would avoid having\ndata leaked.) Given these differences, he prefers targeting\nthe EU, noting, “I do not like to work in the U.S. because\ngetting paid is harder there, the EU pays better and more.”\n\nHe added that if a victim organization has cyber insurance,\nthe ransom payment is “all but guaranteed.” This statement\n[aligns with current data showing that ransomware attacks](https://www.coalitioninc.com/blog/coalition-releases-new-2020-cyber-insurance-claims-report)\naccounted for more than 40 percent of cyber insurance\npayments in North America during the first half of 2020.\n\nAleks also revealed more technical components of his\nransomware operations, including many of his tactics and\ntools. He uses common tools and malware that many other\nmalicious actors incorporate into their attack framework,\nsuch as Masscan, Shodan, Cobalt Strike, Mimikatz and\nPowerShell, among others. He also uses informationgathering tools such as ZoomInfo to research possible\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n\ntargets. Aleks suggested that the dark web provides a lot of\ninformation on potential targets and their business details.\nHe claimed that ransomware operators can assess their\ntarget’s worth by either finding stolen information about\nthe company on the dark web from a previous compromise\nor from insiders at the target organization who sell this\ninformation directly on these underground platforms.\n\nAleks also mentioned that he gains an operational\nadvantage from white hat research that reveals\nnew vulnerabilities and the common delay in users’\nimplementation of new protections. He takes advantage\nof the gap in time between a vulnerability release and\nsubsequent patching, claiming, “We use white hat\nresearch against them. As soon as a CVE is published,\nwe take advantage of it because it takes a long time for\npeople to patch.” Essentially, Aleks claims his operations\nare successful because he is more agile than network\nadministrators by staying current on security news that\nhe incorporates into future attacks. While he lacks the\nresources of a state actor that would allow him to carry out\nmore sophisticated, stealthy operations, he still maintains\nan advantage over defenders due to his ability to act quickly\nbased on publicly available information.\n\nAleks emphasized that one of the most important aspects\nof his operation is the trust he establishes with his victims.\nHe revealed that without “keeping your word,” it would be\nimpossible for him to continue his operations. This comes\ninto play when the ransomware victim pays. Aleks insisted\nthat he deletes the victim’s stolen information and never\nreposts it. At the same time, however, Aleks said he will\nalso follow through with leaking the stolen information if the\nvictim does not meet their conditions.\n\nWe also talked extensively with Aleks about how he\nbelieves LockBit and other groups execute and manage\ntheir attacks. During this part of the interview, he shared\nhis perspective on executing an attack that many\nresearchers already see in the wild. In order to access the\nvictim’s network, ransomware operators first try to obtain\ninformation about the victim’s domain space, including\ndetails about the Autonomous System, IP address blocks,\nor external access gateways that belong to the victim\norganization. After that, attackers leverage virtual private\nservers with bulletproof hosting providers and data centers\nthat are usually in Russia (because these providers do\nnot commonly respond to abuse notifications) to scan the\nexternally facing domain space and IP block of the victim’s\nnetwork. Aleks mentioned that operators use scanners such\n\n\nas Masscan, Nmap, and other add-ons, such as RustScan,\nthat enhance scanning speed.\n\nAfter identifying and confirming various accessible\nservices, such as RDP, a common next step of the attack\nis using already-compromised accounts to login to the\nvictim organization. This is typically done by searching\nfor the victim’s data on the dark web and purchasing it to\nattempt to log in as the organization’s user. If successful,\nthe operator escalates privileges by exploiting a known\nvulnerability. According to Aleks, any useful information\nabout the victim system is collected and leveraged with\n[open-source tools such as winPEAS and linPEAS. These](https://github.com/carlospolop/privilege-escalation-awesome-scripts-suite)\nare primarily leveraged to disable security features,\nincluding damaging or disabling the antivirus driver and\ndisabling or bypassing antivirus solutions. These malicious\nactivities are initiated by a series of C2 commands.\n\nOnce persistence is established on the victim network, a\nvariety of follow-on attacks are executed. For example,\n[adversaries sometimes attack LLMNR and NBT-NS to](https://attack.mitre.org/techniques/T1557/001/)\nobtain the administrator’s hashed password, which is\nthen transmitted to the cloud. The operators will use\nprivate cloud services found on the dark web to crack the\npassword. Sometimes, tools such as Google Colab and\nColabcat are also used during this process. At the same\ntime, an obfuscated stager (using the Artifact Kit or Shelter\nPro) is dropped into the random-access memory of the\nvictim machine, allowing the actors to avoid saving any\ninformation in the file system. After that, pentesting tools\n[like Cobalt Strike are used to connect with the C3 Custom](https://github.com/FSecureLABS/C3)\n[Command and Control.](https://github.com/FSecureLABS/C3)\n\nTo connect the stager with the attacker’s C2 infrastructure,\nvarious obfuscation parameters are employed using\nMalleable C2 (in the case of Cobalt Strike), such as the\nobfuscation of the user agent field. Next, attackers try to\ncollect as much information as possible about the network\nusing automated frameworks such as BloodHound. After\nthat, the ransomware is executed and the operators wait for\nthe victims to contact them.\n\nWe also discussed the general structure of the LockBit\ngroup, which Aleks described as a business-oriented\nprocess where communication is rapid and the dedication\nto the bottom line is the ultimate goal. For example,\nAleks claims that he can directly communicate with the\nLockBit development team and that he can publish victim\ninformation directly to the LockBit blog. According to him,\nhe has privileged information about potential new features\n\n\n-----\n\n## Interview with a LockBit ransomware operator\n\n\nthat may be added to future versions of LockBit and has\nthe capability to provide technical feedback. During one of\nour conversations in early September, Aleks claimed that\nLockBit would be making updates to its ransomware soon.\nThe following month, security researchers from Sophos\n[published new findings indicating that LockBit had started](https://www.sophos.com/en-us/press-office/press-releases/2020/10/lockbit-used-automated-tools-to-sleuth-out-specific-tax-and-point-of-sale-software.aspx)\nleveraging new methods to stay undetected, confirming our\nsubject’s claim and bolstering his credibility.\n\nAleks also spoke at length about other threat groups,\nadding that he considered working with other ransomware\noutfits but chose not to participate with them for several\nreasons. He specified that the Maze group takes a\nvery high amount of the ransom that is paid — up to 35\npercent — leaving operators with less desirable margins\ncompared to other ransomware groups. Aleks explained\nthat while LockBit does not “demand as much as Maze”\nfrom their victims, they also have a better profit-sharing\nratio. Separately, he also mentioned that “REvil can make\nyour files unstable and Netwalker slows the system down\ntoo much.” REvil (also known as Sodinokibi) is a highly\nprofitable ransomware group that makes money from\ncompromising lucrative targets and selling its ransomware\nas a service to other cybercriminals. While Aleks generally\nworks alone, he communicates with other ransomware\ngroups through underground forums. He said the nature\nof these relationships are business-like, with the actors\nexchanging information on tactics, malware development,\nand financially focused agreements.\n\n### CONCLUSION\n\nAt the time of this writing in in early December, we are\nstill in direct contact with Aleks through Jabber and we\ncontinue to collect as much information as we can. In midOctober, Twitter suspended his @uhodiransomwar account\n[because it violated the Twitter Rules against publishing](https://help.twitter.com/en/rules-and-policies/twitter-rules)\nstolen personal data of individuals.\n\nOur interviews with Aleks gave us unique insight into\nthe human side of a threat actor and left us with several\nvaluable takeaways for executives and cybersecurity\n\n\nleaders to consider. As a result of these interactions with\nAleks, we were able to confirm many common assumptions\nabout such threat actors, including their background and\nmotivations. Our conversations also revealed the ordinary\nnature of cyber attacks, which, in this case, still rely heavily\non unpatched systems and simple tools.\n\nOne of our most interesting takeaways was Aleks’\ndecision-making process that led him to participate\nin major cyber crimes, or at least the decision-making\nprocess he wants us to believe he followed. It is not\nunusual for criminals to view their own actions as justifiable\nafter the fact even if there was no real moral ambiguity\nto the crime. In this case, the lack of jobs that meet his\nsatisfaction, appear to be the introductory course to\ncybercrime. His feelings of underappreciation, resentment,\nand economic incentive are common motivators of illicit\ncyber activity, and his story, as portrayed to us, illustrates\nhow one could be driven toward cybercrime.\n\nThere appears to be an underlying contradiction in Aleks’\nportrayal of his personal story in which he presents himself\nas being guided by certain moral codes, while his actions\nseem to be more opportunistic, financially motivated\nand self-serving. This is not unusual, as criminals often\nrationalize their actions to justify their crimes. Aleks’\njudgement of other criminals is a good example of this, as\nit seems he derides them to differentiate himself from their\nbad behavior.\n\nBased on our conversations with Aleks about LockBit,\nwe believe that the ransomware and its operations will\nexpand in the near future, as there does not seem to be\nsignificant barriers to enter the market if one has certain\ntechnical skills. Given that there appears to be dedicated\ndevelopment and confirmed success of LockBit’s\noperations, the group will most certainly attempt to\ncapitalize on Maze’s recent alleged retirement. Additionally,\nthe spike in remote working and distance learning due\nto COVID-19 has increased the number of potentially\nvulnerable victims, making the conditions for LockBit\nand other ransomware operators even more favorable to\ncontinue to expand their operations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://talos-intelligence-site.s3.amazonaws.com/production/document_files/files/000/095/481/original/010421_LockBit_Interview.pdf"
    ],
    "report_names": [
        "010421_LockBit_Interview.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1610371592,
    "ts_modification_date": 1610371594,
    "files": {
        "pdf": "https://archive.orkl.eu/3bb5dd467d55de7dee2c7894ca3c7f31af092cad.pdf",
        "text": "https://archive.orkl.eu/3bb5dd467d55de7dee2c7894ca3c7f31af092cad.txt",
        "img": "https://archive.orkl.eu/3bb5dd467d55de7dee2c7894ca3c7f31af092cad.jpg"
    }
}