{
    "id": "dc137c41-5554-44bf-85a5-ef45f6e373f3",
    "created_at": "2023-01-12T15:03:40.401107Z",
    "updated_at": "2025-03-27T02:05:59.224632Z",
    "deleted_at": null,
    "sha1_hash": "175f7b5815796821e7e17e254420a343372ffd80",
    "title": "2017-07-01 - TrickBot Banking Trojan - DOC00039217.doc",
    "authors": "",
    "file_creation_date": "2022-05-28T04:56:46Z",
    "file_modification_date": "2022-05-28T04:56:46Z",
    "file_size": 291076,
    "plain_text": "# TrickBot Banking Trojan - DOC00039217.doc\n\n**[ringzerolabs.com/2017/07/trickbot-banking-trojan-doc00039217doc.html](https://www.ringzerolabs.com/2017/07/trickbot-banking-trojan-doc00039217doc.html)**\n\nDOC00039217.doc runs malicious VBA scripts to download a second stage trojan which can\ninstall additional malware.\nFilename\nDOC00039217.doc\nMD5\n31529e5221e16a522e8aece4998036d7\nSample\n[Download Sample](https://www.reverse.it/sample/f934141126cdc13d1078e8c463b7241594d354c5513aa025d32853a658d237e7?environmentId=100)\nVideo\n\nWatch Video At:\n\nhttps://youtu.be/b6aul3QH0HY\n\n\n-----\n\n## DETAILS\n\nWe start by analyzing the DOC’s header and see that it is PK with XML references inside.\nThis is indicative of Microsoft Word DOCX and DOCM files. To inspect the individual files\ncontained within the document we simply change the DOC extension to ZIP and open the file\nwith an archive manager.\n\nInside the archive we find a vbaProject.bin file which contains VBA macro code. Opening this\nin a text editor reveals the script which runs after opening the original document. The script\nwill download a file from http://appenzeller.fr/aaaa\n\nThe aaaa file is a VBScript which invokes Wscript.Shell and runs Powershell to download\nanother file. The variable to download this file is constructed from a parameter passed by the\nfirst script “amphibiousvehicle.eu/0chb7”.\n\nAn important note is that the file is downloaded to the %TEMP% folder and named\npetya.exe. This file IS NOT the recent Petya ransomware. It is a trojan.\n\nThe downloaded trojan comes to us packed by PECompact2. In order to unpack the file we\nfirst load it in our debugger and get to the “entry point” chosen by the debugger.\n\nWe then go to the first address put in EAX. In this case it is 0x002440e4.\n\n\n-----\n\nNext we scroll down from 0x002440e4 to the last instruction before a lot of 0x00000000\nbytes. It should be a JMP to a register. Advancing a single step will put you at the Original\nEntry Point (OEP). Traditional import reconstructors can be used to restore the file at this\npoint. Unpacking the file is not necessary for execution, but it makes static analysis much\neasier.\n\nAfter execution, petya.exe copies itself to the following Roaming\\winapp directory and\nrenames itself odsxa.exe. It also generates a client_id and group_tag file which contain\nvictim identification strings. A modules folder is also added where additional\nmalware/modules/addons can be downloaded later.\n\nOnce everything is copied to the new folder, petya.exe closes and odsxa.exe takes over.\nodsxa launches SVCHOST.EXE in a suspended state and proceeds to inject data into a new\nsection of the file’s memory segment. This is called Process Hollowing and allows the\ninjected code greater freedom in the Windows operating system because it is running under\nthe security context of SVCHOST.EXE.\n\nAfter the injection is complete, SVCHOST.EXE will first retrieve the user’s public facing IP by\nissuing a GET request to the legitimate website ipinfo.io/ip.\n\nThe trojan will then begin beaconing to 16 different IP’s using HTTPS. Mac1 was found in the\ngroup_tag document and WIN-FD… was found in the client_id file.\n\n\n-----\n\nThe malware will continue to reach out to the servers until one has data for it to download.\nOnce new files have been downloaded, they will be placed in the modules folder of the\nwinapp directory.\n\nAfter ~30 minutes, multiple other modules were downloaded to the directory.\n\nAll data downloaded in our session appeared to be encrypted/obfuscated in some way. It is\nunknown at this time which routines were used to do this, however, with a bit more reversing\nthey should be able to be found in the unpacked version of the trojan.\n\n\n-----\n\n## DETECTION\n\nThe initial document is generically detected by most major Antivirus scanners as a script\ndownloader. The final packed file is also generically detected by Antivirus as a generic trojan\ndownloader, however, Symantec has a unique signature identifying this malware as\nTrojan.Trickybot. The technical details seem to line up with the analysis in this document.\n\nEven with a proper BLUECOAT device inspecting the HTTPS traffic, the variable length\nparameters in the GET string make signaturing the beacon traffic difficult. The best mitigation\nstrategy here is to block the C&C IP’s listed above.\n\nAlso a best practice is to not enable any macros in Word Documents in which the sender\ncannot be verified by you.\n\n## CONCLUSION\n\nThis is a macro enabled document that downloads and executes a PECompact2 packed\ntrojan. The malware appears to have multiple modules it can download and execute on the\nvictim’s machine which extend it’s functional capability.\n\n## POST-ANALYSIS FINDINGS\n\nAfter further investigation, this file was found to be part of the TrickBot campaign which is\ndubbed as Dyreza’s successor. It is a multi-staged trojan that is capable of downloading\nmultiple modules to the victim’s machine for credential stealing, bank fraud, email hijacking,\n[and much more. See these two EXCELLENT in-depth analysis posts by MalwareBytes and](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\n[FidelisSecurity.](https://www.fidelissecurity.com/threatgeek/2016/10/trickbot-we-missed-you-dyre)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-07-01 - TrickBot Banking Trojan - DOC00039217.doc.pdf"
    ],
    "report_names": [
        "2017-07-01 - TrickBot Banking Trojan - DOC00039217.doc.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535820,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653713806,
    "ts_modification_date": 1653713806,
    "files": {
        "pdf": "https://archive.orkl.eu/175f7b5815796821e7e17e254420a343372ffd80.pdf",
        "text": "https://archive.orkl.eu/175f7b5815796821e7e17e254420a343372ffd80.txt",
        "img": "https://archive.orkl.eu/175f7b5815796821e7e17e254420a343372ffd80.jpg"
    }
}