{
    "id": "dc456056-5bd6-4acb-bee3-694361064947",
    "created_at": "2023-06-05T02:06:19.789848Z",
    "updated_at": "2025-03-27T02:05:41.33808Z",
    "deleted_at": null,
    "sha1_hash": "1a77830e34afa536ab174afcaf76d74364e22c77",
    "title": "2023-02-10 - Bypassing MFA- A Forensic Look At Evilginx2 Phishing Kit",
    "authors": "",
    "file_creation_date": "2023-06-04T12:24:04Z",
    "file_modification_date": "2023-06-04T12:24:04Z",
    "file_size": 558680,
    "plain_text": "# Bypassing MFA: A Forensic Look at Evilginx2 Phishing Kit\n\n**[aon.com/cyber-solutions/aon_cyber_labs/bypassing-mfa-a-forensic-look-at-evilginx2-phishing-kit/](https://www.aon.com/cyber-solutions/aon_cyber_labs/bypassing-mfa-a-forensic-look-at-evilginx2-phishing-kit/)**\n\n## Is MFA Enough?\n\nRecently, [Stroz Friedberg Incident Response Services encountered an uptick in](https://www.aon.com/cyber-solutions/solutions/breach-response/)\ncompromises where multi-factor authentication (“MFA”) was not effective in keeping the\nthreat actor out of the environment. Attack patterns to bypass MFA have been around for\nyears, but some methods are becoming increasingly mainstream due to the increase in\norganizations adopting and implementing MFA. While there are dozens of ways for a threat\nactor to breach an account with MFA enabled, the post below covers the technical details of\none technique that is easy to exploit, but difficult to prevent – proxy phishing sites.\n\nProxy phishing sites are more advanced versions of the typical credential harvesting\nphishing page, as they enable interception of authentication tokens. Such sites are known as\nMan-in-the-Middle/Machine-in-the-Middle (“MitM”) or Adversary-in-the-Middle (“AitM”) sites\nas they stand between the victim user and a legitimate service that a threat actor is\nimpersonating.\n\nThere are several phishing kits available on GitHub that were created for use by red teams\nand penetration testers and allow threat actors to set up their own proxy phishing sites;\nEvilginx2, Modlishka, and EvilnoVNC are all phishing kits that have templates for popular\nservices such as Okta, Microsoft 365 (“M365”), Google Workspace, and others. Stroz® ®\nFriedberg’s research tested Evilginx2 with M365 to determine whether there were any\nindicators of proxy usage in the authentication details.\n\n## Evilginx2: An Operational Overview\n\n[Developed between 2018 and 2021, Evilginx2 is an open-source phishing framework that is](https://github.com/kgretzky/evilginx2)\nbuilt on an earlier framework, EvilGinx. Evilginx2 is written in Go and comes with various\nbuilt-in “phishlets” to mimic login pages for Citrix, M365, Okta, PayPal, GitHub, and other\nsites. It can be set up using basic server infrastructure and a custom domain to host the\nphishing site.\n\nFor this testing, we purchased a domain, configured DNS, and ran a handful of commands to\nstand up a phishing site on a test server with the built-in O365 phishlet. Once the site is up\nand running, any users who visit the phishing link generated by Evilginx2 will be met with a\npage that looks identical to a legitimate Microsoft login page. Common security advice\nmaintains that pages without the TLS lock icon in the URL bar should be a red flag of\n[malicious activity – Evilginx2 requests an TLS certificate from Let’s Encrypt, a free certificate](https://letsencrypt.org/)\n\n\n-----\n\nauthority, meaning that its communications are secured with HTTPS, resulting in phishing\nsites that do have this lock icon. The only way for a regular user to tell this page apart from a\nlegitimate login page is the URL.\n\n_Fraudulent login page displayed to victim from built-in Evilginx2 O365 phishlet_\nWhen the unsuspecting user enters their credentials into the fraudulent login page, the\nphishing site checks these with Microsoft to ensure that valid credentials were entered. After\nproviding the correct credentials, the user is then prompted with a regular MFA challenge, in\nwhatever methods they normally have enabled for their M365 account. In our test case, the\naccount had SMS and calling options for MFA verification.\n\n\n-----\n\n_MFA challenge provided to_\n\n_victim by Evilginx2 phishing site_\nIf MFA is successfully approved, it will appear to the victim that they are logged in with their\ncredentials. Efforts to access additional resources will require another sign-in as they are\nfinally leaving the phishing site to access the real office.com. The user may be tipped off by\nthe additional request for authentication, or by the fact that whatever was promised to them\nin the phishing email was not available, but many users may still not realize they were\nphished.\n\nOn the other side of the scheme, the phishing site operator can run the sessions command\nfrom their Evilginx2 instance and view all captured credentials as well as details about any\nspecific session and associated tokens.\n\n\n-----\n\n_Attacker view of sessions collected by Evilginx2_\nThe threat actor can then copy the text of the cookie that is provided at the bottom of the\nsession information and import it into a browser using any cookie modification plugin, such\nas [EditThisCookie. When the threat actor refreshes the Microsoft sign in page, they are](https://chrome.google.com/webstore/detail/editthiscookie/fngmhnnpilhplaeedifhccceomclgfbg?hl=en)\nlogged in as the phished user.The diagram below shows the workflow of the attack at a high\nlevel.\n\n\n-----\n\n_Sample attack diagram_\n\n## Forensic Findings\n\nWhile it may be difficult to positively identify the use of a proxy phishing site such as\nEvilginx2, there are fact patterns that examiners can rely on to indicate that an attacker may\nhave stolen a user’s cookies through a phishing site. The following subsections will discuss\nStroz Friedberg’s main observations, including:\n\n1. Logins will still originate from anomalous IP addresses.\n2. All attacker activity will have the same SessionId, even if the cookie is moved off the\n\nphishing server to be imported into a browser on another system.\n3. Initial logins from the phishing server will appear as the victim’s legitimate user agent\n\n**string.**\n\n\n-----\n\n**Anomalous IPs**\n\nThe typical methods of identifying email compromise still apply in this situation. Although it\nlooks to the user like they are logging in through Microsoft, their credentials are being sent to\nMicrosoft through the phishing site, so it is the phishing server’s IP address, and not the IP of\nthe user’s system, that will appear in the logs for the initial login.\n\n**Consistent Session ID**\n\nWhile the phishing server IP address will show up for the first login through the phishing site,\nthe IP address may change with subsequent logged activity. In typical adversary-in-themiddle attacks, the login occurs on the phishing server, and the threat actor will then move\nthe cookie to a different machine to import into a browser. Because the cookie is the same,\nthe SessionId in the Unified Audit Log (“UAL”) will be consistent between logins, even though\nthey are coming from different IP addresses and/or user agents. The SessionId can be found\nunder “DeviceProperties” for UserLoggedIn events in the UAL.\n\n_Abbreviated export of Unified Audit Log showing threat actor logins_\nIn the example shown above, the IP address of the phishing server is shown in red and ends\nin .91, while the IP address of the mock threat actor system is shown in orange and ends in\n.94. The subsequent logins with the .94 IP address are logins that occurred when the mock\nthreat actor imported the captured cookie from the phishing server into a Chrome browser\nand continued interacting with the victim account. The SessionId shown in blue is consistent\nthroughout all activity because the same authentication cookie is used.\n\n**User Agent Pattern**\n\n\n-----\n\nFor many unauthorized email access investigations, the investigator can often differentiate\nmalicious activity from legitimate logins by the user agent, which represents the device type\nand client being used to access the account. Typically, threat actor activity will have a\ndifferent user agent than the legitimate user because the threat actor is logging in from their\nown infrastructure. However, Evilginx2 captures the victim’s legitimate user agent string and\nsets its own user agent to mirror the legitimate user. This means that although the phishing\nsite may be running on a Linux system, if the victim clicks the link using Firefox on a\nWindows 10 machine, the user agent recorded in the logs will reflect the Firefox on Windows\n10 user agent string.\n\nIn the sample UAL logs shown above, the mock victim during our testing accessed the\nphishing site using Windows 10 and the Opera browser – the same user agent that is\nreflected in the initial logins originating from the phishing server IP address.\n\nThis attempt at blending into legitimate logins in authentication logs has substantial\nimplications for investigators. Without a clearly anomalous user agent, the only clear\nindicator of compromise in the login event is the anomalous IP address. In a situation where\nthe threat actor employs a botnet or other infrastructure belonging to regular residential\ninternet service providers (“ISPs”), detection of this activity would be very difficult.\n\nIn the second phase of the attack, once the cookies are captured, they can be imported into\nthe threat actor’s browser. A threat actor may view the user agent from the captured session\nwithin Evilginx2 and spoof the user agent of their browser to match, but Stroz Friedberg has\nidentified many occasions where threat actors have not bothered to continue matching their\nuser agent to the victim’s. As such, there may be a detection opportunity when the threat\nactor imports cookies into their own browser and the user agent switches while the SessionId\nremains the same.\n\n## Prevention\n\nPrevention against MFA bypass techniques is non-trivial, but there are several ways that\norganizations can lower the risk of successful compromise:\n\n**Implement FIDO2 Authentication**\n\nHardware-based authentication mechanisms using FIDO2 protocols currently appear to be\nthe best way to mitigate the risk of threat actors bypassing MFA in all forms. FIDO2\nauthentication uses cryptographic keys that are pre-registered with a service such as M365\nto allow the user to authenticate to that site. The challenge presented to the FIDO2 device by\nthe service includes details about the origin of the request, such as the URI of the site.\nBecause of this, attempts to authenticate to a fraudulent phishing site using this\nauthentication mechanism should fail. Examples of FIDO2 authentication include hardware\ntokens such as Yubikeys or a built-in solution on a user’s laptop such as Windows Hello.\n\n\n-----\n\nThere is a risk of downgrade attacks on FIDO2 authentication, where alternative\nauthentication methods are also made available. For example, an organization may have\nFIDO2 authentication as their primary method but may also allow one-time passwords (OTP)\nto be delivered via SMS or email as an alternative. In addition to this risk, there are logistical\nreasons why FIDO2 authentication may be difficult to implement. Switching to FIDO2\nauthentication is a big change for most users, and it comes with additional costs to\norganizations in many cases.\n\n**Limit External Access**\n\nOrganizations that continue using typical push notifications, calls, or SMS as a second factor\nshould consider using a layered security approach that includes limiting external access to\nuser accounts. This is typically implemented by allowing access only from approved IP\naddresses, such as the IP range of the corporate VPN, or by requiring authenticating devices\nto be managed by the organization. These types of security controls can be very effective\nmeasures in making life difficult for threat actors.\n\n**Other Layered Security Protocols**\n\nOther important aspects of layered security that help to minimize the risk of this attack\noccurring in its earlier stages include spam filtering — either using your email platform’s builtin filtering functionality or using a third-party solution — and the use of a web proxy for\nfiltering users’ web traffic. With web filtering, users can be blocked from visiting known\nphishing sites or other sites in categories that are considered risky. Additionally,\norganizations can also help guard against attacks by providing user training on how to better\nidentify phishing emails and malicious websites.\n\nWhile shortening the lifetime of tokens will not prevent access to targeted accounts, it can\nlimit the overall impact to the organization by helping to minimize the time that the threat\nactor has to accomplish their goals. In M365 specifically, administrators can modify the\nsession lifetime – this can also be done for particular groups of users, such as\nadministrators, through conditional access. Password resets in M365 will invalidate old\npersistent tokens, so this is an effective remediation step for accounts that have suffered this\nattack pattern.\n\n## Closing Thoughts\n\nCybersecurity is always evolving, and the abilities of threat actors to circumvent MFA does\nnot come as a surprise. The concepts of token theft or adversary-in-the-middle attacks are\nnot new, but with the number of organizations moving to secure their systems with MFA,\nthreat actors are forced to use newer methods to obtain access to targeted accounts. These\nattacks threaten more than just email environments, as other services such as Okta, Citrix,\nand others are at risk of the same types of attack. The consequences of compromising these\naccounts could lead to a full-scale breach of the network, culminating in ransomware\ndeployment, data theft, or installation of persistence for future use or sale of access.\n\n\n-----\n\nThreat actors can bypass MFA even without possessing the technical skills required to set up\na proxy phishing site. Phishing-as-a-Service solutions are available for threat actors to\n[subscribe to for a couple hundred dollars per month — much less than threat actors typically](https://www.bleepingcomputer.com/news/security/new-evilproxy-service-lets-all-hackers-use-advanced-phishing-tactics/)\nearn from even a single redirected wire transfer. Even simpler for threat actors, some users\nmay just accept push notifications on their phone even when they did not initiate the login\nattempt. Threat actors have many methods for MFA circumvention at their disposal, and\nwhile MFA may at this time be a non-negotiable, must-have tool in cyber defense, it is not a\nbulletproof solution to security.\n\n_Author: Carly Battaile_\n\nFebruary 10, 2023\n\n©Aon plc 2023\n\nWhile care has been taken in the preparation of this material and some of the information contained within it has been\nobtained from sources that Stroz Friedberg believes to be reliable, Stroz Friedberg does not warrant, represent, or\nguarantee the accuracy, adequacy, completeness or fitness for any purpose of the article and accepts no liability for any\nloss incurred in any way whatsoever by any person or organization who may rely upon it. It is for informational purposes\nonly. You should consult with your own professional advisors or IT specialists before implementing any recommendation\nor following the guidance provided herein. Further, we endeavor to provide accurate and timely information, there can be\nno guarantee that such information is accurate as of the date it is received or that it will continue to be accurate in the\nfuture. Further, this article has been compiled using information available to us up to 02/10/2023.\n\n**About Cyber Solutions**\n\nCyber security services are offered by Stroz Friedberg Inc., its subsidiaries and affiliates. Stroz Friedberg is part of Aon’s\nCyber Solutions which offers holistic cyber risk management, unsurpassed investigative skills, and proprietary\ntechnologies to help clients uncover and quantify cyber risks, protect critical assets, and recover from cyber incidents.\n\nCyber security services offered by Stroz Friedberg Inc. and its affiliates. Insurance products\nand services offered by Aon Risk Insurance Services West, Inc., Aon Risk Services Central,\nInc., Aon Risk Services Northeast, Inc., Aon Risk Services Southwest, Inc., and Aon Risk\nServices, Inc. of Florida and their licensed affiliates. Aon UK Limited is authorised and\nregulated by the Financial Conduct Authority in respect of insurance distribution services.\nFP.AGRC.238.JJ The following products or services are not regulated by the Financial\nConduct Authority:\n\n- Cyber risk services provided by Aon UK Limited and its affiliates\n\n- Cyber security services provided by Stroz Friedberg Limited and its affiliates.\n\nCopyright 2021 Aon plc. All Rights Reserved.\nCyber security services offered by Stroz Friedberg Inc. and its affiliates. Insurance products\nand services offered by Aon Risk Insurance Services West, Inc., Aon Risk Services Central,\nInc., Aon Risk Services Northeast, Inc., Aon Risk Services Southwest, Inc., and Aon Risk\nServices, Inc. of Florida and their licensed affiliates. Aon UK Limited is authorised and\nregulated by the Financial Conduct Authority in respect of insurance distribution services.\nFP.AGRC.238.JJ The following products or services are not regulated by the Financial\nConduct Authority:\n\n- Cyber risk services provided by Aon UK Limited and its affiliates\n\n- Cyber security services provided by Stroz Friedberg Limited and its affiliates.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-10 - Bypassing MFA- A Forensic Look At Evilginx2 Phishing Kit.pdf"
    ],
    "report_names": [
        "2023-02-10 - Bypassing MFA- A Forensic Look At Evilginx2 Phishing Kit.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930779,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1685881444,
    "ts_modification_date": 1685881444,
    "files": {
        "pdf": "https://archive.orkl.eu/1a77830e34afa536ab174afcaf76d74364e22c77.pdf",
        "text": "https://archive.orkl.eu/1a77830e34afa536ab174afcaf76d74364e22c77.txt",
        "img": "https://archive.orkl.eu/1a77830e34afa536ab174afcaf76d74364e22c77.jpg"
    }
}