{
    "id": "dc5157f3-ff28-4111-9507-37c0f27b1130",
    "created_at": "2022-10-25T16:48:10.573212Z",
    "updated_at": "2025-03-27T02:16:01.111994Z",
    "deleted_at": null,
    "sha1_hash": "34e9bd7aa78ee059a78b0575dfe21ef50cc8714a",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-06-26T17:19:29Z",
    "file_modification_date": "2019-06-26T17:19:31Z",
    "file_size": 2918107,
    "plain_text": "-----\n\n## ASEC REPORT\n#### VOL.95 [Q2 2019]\n\n\n###### ASEC (AhnLab Security Emergency Response Center) is a global security response group consisting of malware\n\n analysts and security experts. This report is published by ASEC and focuses on the most significant security\n\n threats and latest security technologies to guard against such threats. For further details, please visit AhnLab,\n\n Inc.’s homepage (www.ahnlab.com).\n\n\n###### SECURITY TREND OF Q2 2019\n\n\n###### Table of Contents\n\n\n-----\n\n-----\n\n###### Security Issue\n\n\n### Scheming the Android Malware Related to Cryptocurrency\n\n\n###### The emergence of cryptocurrency in 2008 made a huge impact on malware. It resulted in the\n\n creation of malware related to cryptocurrencies. Cryptocurrency malware exists for various\n\n operation systems, but this report looks into the malware designed specifically for Android.\n\n Android cryptocurrency malware can be divided into three main categories: Cryptojacking malware\n\n for mining cryptocurrency without the user's knowledge, FakeWallet malware that disguises itself as\n\n a cryptocurrency wallet, and Clipper malware that intercepts and swaps wallet-related information\n\n from the clipboard.\n\nFigure 1 | Total malware detected by IRIS using three aliases (until 2019.04.12)\n\n\n-----\n\n###### Figure 1 shows the changes in the number of the Android Cryptojacking malware. The graph seems\n\n to be directly proportional to the price of Bitcoins shown in Figure 2.\n\nFigure 2 | BTC chart provided by CoinMarketCap\n\n###### Based on this, we can expect a rise in the number of cryptocurrency-related malware if the\n\n cryptocurrency market continues to expand. The next part shows charactersitics of cryptocurrency\n\n related malware.\n\n Type 1: Cryptojacking\n\n Cryptojacking is a malware for Android and is being detected by AhnLab under three aliases,\n\n including Android-PUP and CoinMiner. This type of malware secretly uses the infected device for\n\n coin mining. It uses significant CPU power and slows down the mobile usage.\n\n The malicious code, a miner, shown in Table 1, was embedded in a game called Bug Smasher. Once\n\n the game starts, there is a sudden increase in CPU usage as shown in Figure 3.\n\n\n-----\n\n###### The user is made to believe that this is a genuine game application while the mining secretly\n\n takes place in the background.\n\nFigure 4 | Screenshot of Bug Smasher\n\n\n-----\n\n###### The mining methods used by cryptojacking are mainly the native function of the SO file or\n\n calling the JavaScript API. The native function of the SO file can be used to run without a\n\n user's recognition, because the thread runs as a service type when loaded.\n\nFigure 5 | Native function in the SO file\n\n###### The JavaScript API has a code for mining coins in the JavaScript file, as shown in Figure 6.\n\nFigure 6 | Code that calls the JavaScript file from the internal html file\n\n###### Coinhive, which is one of the best-known mining services that uses JavaScript, stopped\n\n services from March 8, 2019.(https://coinhive.com/blog/en/discontinuation-of-coinhive)\n\n However, the end of Coinhive does not necessarily mean the JavaScript mining method\n\n is finished. Bad Packets Report 2018 indicated that 81.6% of the detected Cryptojacking\n\n malware used Coinhive, but other services also accounted for 18.4%.(https://badpackets.net/\n\n\n-----\n\n###### how-to-find-cryptojacking-malware/) Other services included CoinIMP and Crypto-Loot. It is\n\n likely that these services will be used for cryptojacking malware.\n\n Type2: FakeWallet\n\n FakeWallet is currently being detected as V3 alias Android-Trojan/FakeWallet. This malware\n\n pretends to be a wallet application for cryptocurrency.\n\nLabel BTC Blockchain Wallet\n\nPackage name com.appybuilder.amal_zaki_meka212.BitcoinWallet\n\nMD5 2778b8493e0e71e5aa3cf70e3bb2a3d0\n\nTable 2 | Information of BTC Blockchain Wallet malware\n\n###### The application in Table 2 seems to be generating a new wallet address, but it creates a\n\n wallet address as shown in Figure 7 that is assumed to be the address of the attacker. The\n\n same wallet address is created no matter how many times the wallet is created from different\n\n devices. And the transactions that follow lead to the transfer of coins to another wallet\n\n address.\n\nFigure 7 | Address provided by the malicious application\n\n\n-----\n\n###### By tracking the above address, it showed that there were 8 transactions to transfer the total\n\n amount received on the wallet, 0.5 BTC, to other wallets.\n\n Another method of FakeWallet is to impersonate an existing cryptocurrency wallet and get\n\n the user to enter their private key. This is shown on Table 3.\n\nLabel MyEtherWallet\n\nPackage name com.myetherwalletproject\n\nMD5 3f85490f886755b6e1bdeaa4be1f70a4\n\nTable 3 | Information of MyEtherWallet malware\n\n###### MyEtherWallet (MEW) is the most widely used Ethereum (ETH) wallet. This is why there are\n\n many malware programs impersonating MEW. The fake MEW application appears to be\n\n genuine, as shown in Figure 8, and asks for the user's private key in order to log in.\n\n\n-----\n\n###### Once a user enters the wallet address and the private key and taps on the LOG IN button, an\n\n \"invalid address\" message appears while the values input by the user are sent to the attacker.\n\n 3. Type 3: Clipper type\n\n Clipper is currently being detected as V3 alias Android-Trojan/Clipper. It monitors the\n\n clipboard on the infected device and checks for a user’s wallet information. Once detected, it\n\n sends the information to the attacker and tampers with the address that the user has pasted.\n\n This malware was created with the notion that most users are more likely to copy and paste\n\n their wallet addresses due to the complexity.\n\nLabel Intim\n\nPackage name clipper.abcchannelmc.ru.clipperreborn\n\nMD5 85247d1102958d138462137d61fd901a\n\nTable 4 | Information of Intim malware\n\n###### An example of a clipper is the Intim application shown in Table 4. This malicious app hides\n\n the app icon on the infected device. Once the user taps on the icon, it shows a message\n\n saying: \"Not supported on your device and deleted.\" It makes the user to think that the\n\n application has been deleted, while it actually runs in the background. Then it monitors the\n\n clipboard. Once the characteristics of a wallet are detected, it sends the wallet information to\n\n the attacker's server.\n\n For example, a Pay-to-PubKey Hash (P2PKH) format of BTC wallets can be distinguished by its\n\n characteristics, such as starting with the number 1, and a Pay-to-Script Hash (P2SH) format\n\n can be distinguished by starting with a 3 and having a length between 25 and 35 characters.\n\n\n-----\n\n###### An ETH wallet address can be distinguished, as it starts with “0x” and consists of a 40-digit hex\n\n string.\n\n After the Intim malware sends the address detected from the clipboard to the server, it\n\n receives the fake wallet address. Here, the received wallet address replaces the user's address\n\n using setText() within change(). (Currently setText() is deprecated and use of setPrimaryClip()\n\n is recommended.)\n\n The malware in Table 5 also switches the wallet addresses in a similar way.\n\nLabel MetaMask\n\nPackage name com.lemon.metamask\n\nMD5 d26881cb84d71cc062e200f6e74e8e31\n\nTable 5 | Information of MetaMask malware\n\n###### The MetaMask malware also detects the BTC address format and the ETH address format\n\n in a similar manner to the malware above. When an address is detected, it uses the\n\n setPrimaryClip() method to change the clipboard information to the wallet address of the\n\n attacker. The difference with the Intim malware is that MetaMask does not send or receive\n\n data from the server but uses a fixed address to replace the user's address.\n\n 4. Conclusion\n\n Users are advised to take a cautious look into the services that allow for the easy mining of\n\n cryptocurrency, and those using JavaScript in particular. Until now, most of the cryptojacking\n\n malware has been related to Coinhive. Now, new types of malware can appear using the APIs\n\n\n-----\n\n###### of CoinIMP Crypto-Loot, following the closure of the Coinhive service. So users must take into\n\n possibility that any APIs found on the service may be a cryptojacking malware.\n\n Also, as we have already seen in FakeWallet or Clipper, and sometimes attackers use a fixed\n\n address. These can be used as indicators of compromise (IOC). And it can be determined\n\n to be malicious if evidence of such text strings is found. Other information that is used by\n\n attackers can also be used as IOC, including the domain of the attacker.\n\n 5. Reference\n\n https://coinmarketcap.com/currencies/bitcoin\n\n : BTC price graph\n\n https://coinhive.com/blog/en/discontinuation-of-coinhive\n\n : Coinhive blog page. Declaration of official shutdown\n\n https://blockchain.com\n\n : Provide cryptocurrency transaction information\n\n https://badpackets.net/how-to-find-cryptojacking-malware/\n\n : Services frequently used in cryptojacking\n\n https://en.bitcoin.it/wiki/Address\n\n : BTC address format\n\n\n-----\n\n-----\n\n###### ANALYSIS-IN-DEPTH\n\n\n### Analysis Report on Tickusb\n\n\n###### USB flash drives are widely used data storage devices which replaced the floppy disks that\n\n came before them. USB flash drives are used not only by individuals, but also in companies\n\n and institutions. They are mainly used to move data and systems that are not connected to a\n\n network due to internal security policy.\n\n Secure USB flash drives are used to encrypt and save data in places that handle sensitive\n\n information. However, Secure USB Flash Drives cannot guarantee the safety of the user's\n\n system. If the system is compromised with malware, information can still leak from the secure\n\n USB flash drive when the files are opened.\n\n As the use of USB flash drives increase, more and more malware creators are leaking data\n\n saved in their drives or using the USB flash drive as a propagation path. The group called\n\n Tick, which targets companies and institutions in South Korea and Japan, has also created\n\n a malware called Tickusb that infects the system via the USB flash drive and steals internal\n\n information and has been active since of 2014 – which might be created in 2012.\n\n This report is an analysis of Tickusb, a malware designed to steal information from USB flash\n\n\n-----\n\n###### drives and spread malware.\n\n Attacks using Tickusb\n\n Tickusb is a malware that was produced by the Tick Group for the purpose of extracting\n\n information from a USB flash drive. It was distributed from the spring of 2014 to November\n\n 2017. (The Tick Group has been active since 2008. So it is possible that there are other\n\n malware that has yet to be discovered.)\n\n Some variants of Tickusb exist as stand-alone files, but most consist of DLL and EXE files. The\n\n malware is executed as a DLL file. To induce loading of the malicious DLL file, it alters a normal\n\n EXE file or disguises itself as a CRYPTBASE.dll, which is the DLL file required to load genuine\n\n programs. So, Tickusb is executed not when the PC starts but when a certain program is\n\n opened.\n\n When the malicious DLL file is executed, it creates a log file in a specific path and checks the\n\n USB flash drive connection. If a USB flash drive is connected to the system, it executes the\n\n malicious EXE file and downloads additional files.\n\n A malicious EXE file performs slightly different functions depending on the variant, but\n\n generally collects file information within a USB flash drive. Some variations modify the EXE\n\n file in the USB flash drive if it exists.\n\n If you insert a USB flash drive with a tampered file into another system and run the modified\n\n EXE file, the computer is also infected with Tickusb.\n\n\n-----\n\n###### The major attacks using Tickusb began at least as early as the spring of 2014.\n\n|First Detection|File Content|Description|\n|---|---|---|\n|2014.3|?.exe|Assumed to be created in Sept 2012. In 2018, Unit 42 first released their analysis. It is assumed that it is an early version of Tickusb with very different codes for other Tickusb variants.|\n|2015.4|CRYPTBASE.dll|Assumed to be created in December 2014. Independent DLL type. Collect system information and file information within the USB flash drive.|\n|2015.6|BrStMonW.exe, BrWeb.dll, wsmt.exe|Alters the BrStMonW.exe file associated with the Brother printer and loads the BrWeb.dll file. Downloads the msupdata.exe file. Alters the EXE file within the USB flash drive and patches the ALYAC25.exe file.|\n|2015.6|CRYPTBASE.dll, svcmgr.exe|Assumed to be created in February 2015. Checks for a specific secure USB connection. Alters the EXE file within the USB flash drive and patches the ALYAC25. exe file.|\n|2015.7|?.dll (Unconfirmed), ctfmon.exe|Assumed to be created in Sept 2014. Alters the EXE file within the USB flash drive and patches the ALYAC25.exe file.|\n|2015.7|CRYPTBASE.dll, svcmgr.exe (Unsecured)|Assumed to be created in November 2014.|\n|2016.10|Wincrypt.dll, wsmt.exe (Unsecured).|-|\n|2017.01|Wincrypt.dll, wsmt.exe (Unsecured).|-|\n|2017.11|Wincrypt.dll|Independent DLL type.|\n\n\nTable 1 | Major attacks using Tickusb\n\n\n-----\n\n###### The changes to Tickusb are as follows.\n\nFigure 2 | Tickusb evolution\n\n###### Early versions were produced before spring 2014 and a variant with the file name cryptbase.\n\n dll appeared in 2014. In September 2014, a variant was created that modifies the EXE file in\n\n a USB flash drive. In 2015, a variant of the DLL files and EXE files was created. In early June\n\n 2015, an external tool was used to patch the files on the system to load malicious DLLs. From\n\n October 2016 to November 2017, it changed the filenames to wincrypt.dll.\n\n Stage 1 – Dropper, Downloader, Patcher\n\n The downloaders and droppers associated with Tickusb have been identified, but no specific\n\n infection methods, such as emails, have been identified. However, the comparison of the\n\n altered code of the installation file altered by a dropper and the file within the USB flash\n\n drive showed by some of the droppers were EXE files altered by Tickusb. The attacker did not\n\n automatically run Tickusb malware upon booting, but only when certain files were executed.\n\n It makes difficult for the user to discover the malware.\n\n 1. Dropper\n\n The report from Unit 42 describes that there are several droppers associated with Tickusb. 1\n\n (https://unit42.paloaltonetworks.com/unit42-tick-group-weaponized-secure-usb-drives\n target-air-gapped-critical-systems)\n\n\n-----\n\n###### Aya.exe (b76d2b33366c5ec96bc23a717c421f71) is a Go game file. If executed, an initial\n\n version of Tickusb (6f665826f89969f689cba819d626a85b) is created in the temporary folder.\n\n AhnLab collected Aya.exe file in March 2014.\n\nFigure 3 | Aya.exe execution screen\n\n###### The Secure Unlock win.exe file (bb8c83cfd133ab38f767d39605208a75) started to attack the\n\n users from early June 2015. It altered normal programs and created the wsktray.exe file (3c6e\n\n 67fc006818363b7ddade90757a84) in the temporary folder. When generating the file, it adds\n\n a garbage data at the end of the filename to have a filename of more than 34 megabytes in\n\n length. The file generated is a Bisodown variant that downloads other malware.\n\n Portable SecretZone.exe (dbc10f9b99cc03e21c033ea97940a8c2), pNDPS(V2.11).exe (c865b\n\n 83a2096642b0de3e2880e63ab0e), NEW_GOMPLAYERSETUP.exe (0a4bec5fc88406d126aa1\n\n 06a7c0aab87) create the same Bisodown variant (e470b7538dc075294532d8467b1516f8).\n\n Among these droppers, SecretZone.exe and pNDPS (V2.11) .exe files appear to be infected by\n\n\n-----\n\n###### the Tickusb variant.\n\n 2. Downloader - Ghostdown\n\n A variant of the Ghostdown malware (4868fd194f0448c1f43f37c33935547d, 62ee703bbfbd5\n\n d77ff4266f9038c3c6c) was found on a system infected with Tickusb.\n\n Ghostdown is a downloader that was discovered in February 2013 and was active up until\n\n February 2018. In Ghostdown, key strings such as APIs and connection addresses are\n\n encrypted. Its initial version had applied encryption to addresses and key strings with the\n\n XOR 0xDF key.\n\n The initial Ghostdown variant used www.poi.cydisk.net and www.kot.gogoblog.net as the\n\n C&C server, all of which were created with the www.dnserver.com service. The C&C address of\n\n the Ghostdown variant found in the Tickusb infected system in 2016 used the cloud service\n\n at www.memsbay.com:443.\n\n\nFigure 4 | Decrypted C2 text strings\n\n\n###### 3. Patcher - iff.exe\n\n The iff.exe (e84f29c45e4fbbce5d32edbfeec11e3a) file alters the EXE file to run a specific\n\n EXE file or to load a specific DLL file. This file is found in the Tickusb infected system and is\n\n\n-----\n\n###### assumed to be a file that is additionally installed once the attacker infiltrates the system.\n\n The iff.exe file takes the file alteration, file to be altered, the DLL file to load or run as\n\n arguments.\n\nFigure 5 | Execution screen of Iff.exe\n\n###### The -b option modifies the executable file by adding an executable file to be run. The -l\n\n option alters the target EXE file to load the specific DLL file.\n\n The EXE file altered as Iff.exe contains the infection identification string \".texe.\"\n\nFigure 6 | Patch content by iff.exe - 1\n\n###### It changes the jump command on the entry point of the program so that the command\n\n added by iff.exe is executed first.\n\n\n-----\n\n###### The code added with the -b option is used to obtain the required API address. Then it reads\n\n the executable file at the end of the altered file in the temporary folder (% temp%) and the\n\n entire executable file to create and run a temporary file. This is for the purpose of adding a\n\n downloader for downloading another malware.\n\nFigure 8 | Coded added by iff.exe -b\n\n\n###### At the end of the altered file is an executable file that is run by MZ. Therefore, the total file\n\n length increases by the length of the file added to the end of the file.\n\n\n-----\n\n###### The -l option overwrites the code that finds a blank area in the target EXE file and loads the\n\n specified DLL file. Therefore, if there is not an empty area that provides as much space as\n\n is needed, file alteration does not occur and the file length of the target EXE file does not\n\n change even if file modulation occurs.\n\n 4. Tickusb Loader - BrStMonW.exe\n\n The attacker used the iff.exe file on June 1, 2015 to patch Brother's BrStMonW.exe file (d536f\n\n 5f929ddd2472a95f3356f7d835c) so that the malicious BrWeb.dll file can be loaded if the file\n\n runs.\n\n The entry is modified so that the code address (in this case 0x004972EF) added by the\n\n malicious code is executed first.\n\n\n-----\n\n###### The arbitrary code is written in the empty area of the file, the file length does not change\n\n even after file alteration.\n\nFigure 11 | Modified BrStMonW.exe\n\n###### The code added by iff.exe loads a specific DLL (in this case, BrWeb.dll) into memory.\n\n\n-----\n\n###### Therefore, Tickusb runs only when the printer is used, making it difficult for users to suspect\n\n malware infection.\n\n Since a patcher program exists like iff.exe, the attacker can select one of the programs in the\n\n system after infiltrating the system to run additional malware.\n\n Stage 2 – Tickusb\n\n Tickusb is usually made up of a DLL file plus an EXE file, but some variants contain a single\n\n DLL file or an EXE file. The DLL file checks for a USB flash drive connection. If connected, it\n\n runs the malicious EXE. The malicious EXE file takes the role of altering the executable file\n\n within the USB flash drive.\n\n 1. Tickusb DLL\n\n The malicious DLL file used names like BrWeb.dll, CRYPTEBASE.dll, and wincrypt.dll. The\n\n CRYPTEBASE.dll file is a file embedded in Windows that provides password-related functions.\n\n Tickusb has the same file name as CRYPTBASE.dll and has the same export function as the\n\n\n-----\n\n###### genuine CRYPTBASE.dll file. A program with a password feature can load the CRYPTBASE.dll\n\n file when it is run, so a program that loads malicious CRYPTBASE.dll is expected to use the\n\n password feature.\n\n Tickusb acts as a loader and contains strings such as the name of the log file to be executed,\n\n the path of the EXE file to be executed, and the type of the drive.\n\n The CRYPTBASE.dll (bcb56ee8b4f8c3f0dfa6740f80cc8502) found in April 2015 is a DLL\n only type and no additional EXE file exists. When executed, it creates a Credentials.\n\n dat file. It deletes the C:\\\\WINDOWS\\\\system32\\\\CatRoot\\\\{375EA1F-1CD3-22D3-7602\n 00D04ED295CC}\\\\TAG file and collects system information with files like netstat.exe. Then it\n\n checks whether VPN_Cliend.exe, incorrectly spelt as Cliend and not Client, and IPPEManager.\n\n exe exist in the process.\n\n The BrWeb.dll (9b31a5d124621e244cede857300f8aa6) file found in June 2015 was found in\n\n the path, C:\\Program Files(x86)\\browny02\\brother C:\\Program Files (x86)\\ControlCenter4,\n\n by disguising as a Brother printer related file. It patched the BrStMon.exe file and loaded it\n\n until it was executed. When the BrWeb.dll file is run, it creates a log file in %USERPROFILE%\\\n\n AppData\\Roaming\\Microsoft\\Credentials\\Credentials.csv.\n\n Then it creates a Mutex (WinsMutexIII) and multiple threads. The first thread (0x10004774)\n\n runs the file C:\\WINDOWS\\System32\\migration\\WSMT\\wsmt.exe if a USB flash drive\n\n is connected. The second thread (0x100045cd) reads the file C:\\Windows\\schemas\\\n\n AvailableNetwork\\basev1.xsd and finds uses FindWindow to search processes. The details of\n\n\n-----\n\n###### the basev1.xsd file are not yet confirmed. The third thread (0x100035f0) gets the system date,\n\n and if it is Monday and Thursday, it downloads the file from http://update.saranmall.com/\n\n script/main.html and creates and runs the MSUPDATA.EXE file. The msupdata.exe file is a file\n\n name that is often used by the Tick group for the downloader.\n\n The filename was changed to wincrypt.dll after October 2016. This variant was not discovered\n\n until November 2017.\n\n 2. Tickusb EXE\n\n The EXE file Tickusb has filenames like cftmon.exe, svcmgr.exe, wsmt.exe, etc. It collects the\n\n file list in the USB flash drive or alters the EXE file.\n\n Within the EXE file are the text strings related to the file infection, and the text strings related\n\n to the log of the USB flash drive.\n\n The variant found in June 2015 (29875836605c26f7c78fc91bb2cff95d) has an additional\n\n feature to collect file information within the USB file drive and alter the EXE file.\n\n Some variants find and alter the EXE files on USB memory. And it adds a specific system file\n\n (e.g., C:\\Windows\\AppPatch\\Custom\\Custom64\\apihex.dat) to the end of the found EXE file.\n\n However, the apihex.dat file has yet to be analyzed.\n\n\n-----\n\n###### Some Tickusb discovered between 2012 and 2014 read and execute data from a specific area\n\n of a USB flash drive if a certain secure USB flash drive from a Korean company is connected.\n\n The code used for the USB flash drive has yet to be confirmed. This type of attack is not\n\n common and is assumed to be aimed at attacking a system on a separate network.\n\n Stage 3 – Modified EXE\n\n Tickusb variant finds and alters EXE files in USB flash drives. The entry points of the files\n\n are edited to run specific code so that an executable file is created at the end of the file for\n\n execution.\n\n Unit 42 released a report in 2018 where the droppers Portable SecretZone.exe (dbc10f9b99\n\n cc03e21c033ea97940a8c2) and pNDPS(V2.11).exe(c865b83a2096642b0de3e2880e63ab0e)\n\n created the same downloader (e470b7538dc075294532d8467b1516f8).\n\n The Tickusb variant found in June 2015 finds the EXE file from the USB flash drive and\n\n appends the contents of the C:\\Windows\\AppPatch\\Custom\\Custom64\\apihex.dat file to the\n\n end of the EXE file.\n\n The code in the altered EXE file is similar to the code in the file known as the dropper in the\n\n Unit 42's report. Therefore, it is highly likely that these files have been altered by the Tickusb\n\n variant and not the dropper.\n\n\n-----\n\n###### The method for infection identification is also similar. EXE files altered by the Tickusb contain\n\n .texe within the code.\n\n The file (b76d2b33366c5ec96bc23a717c421f71) that drops the early version of Tickusb found\n\n in March 2014 contains .ext within the code.\n\n\nFigure 14 | Infection identification string of Initial Tickusb Dropper\n\n\n###### Therefore, it is highly likely that these files have been altered by the Tickusb variant, not the\n\n dropper.\n\n\n-----\n\n###### Additional Installation Files\n\n Keyloggers, port scanners, mimikatz, and ARP spoofers were discovered on the system\n\n infected with Tickusb.\n\n 1. Keylogger Type C\n\n Keyloggers have been found in some of the Tickusb infection systems. This variant was\n\n discovered from April 2017 until February 2018. The typical file names for keyloggers include\n\n apphelp.dll, linkinfo.dll, and netutils.dll. The key content entered by the user is stored in a file\n\n such as debug.log.\n\n 2. ARPSpoofer – hwp70.exe\n\n The hwp70.exe file (026ae46934eca5862db4dfc8c88c720a) was found in the Hangul folder\n\n (C:\\HNC\\Hwp70) of a Tickusb infected system. The attacker masqueraded as Hancom's\n\n Hangul related file.\n\n The hijack causes APT spoofing. It is presumed to be aimed at infecting other internal\n\n systems.\n\nFigure 15 | Execution screen of the hijack\n\n\n-----\n\n###### 3. ScanLine – l.dat\n\n In 2016, the attacker used ScanLine, a port scanner, from Foundstone which has now been\n\n acquired by McAfee. The file (a353b591c7598a3ed808980e2b22b2a2) was used on many\n\n systems and the filenames used included msp.exe, ls.tmp, and sl-p.exe.\n\nFigure 16 | Execution screen ScanLine\n\n###### 4. Mimikatz – mi.exe, mi2.exe\n\n The attacker used mimi 2.1 (3fe76cf644e045b8620d577c2366630a) and mimi 2.1.1 (b108df0\n\n bd168684f27b6bddea737535e) variants of the mimikatz variant on the infected system. The\n\n filenames used included mi.exe and mi2.exe, which is mainly used by the Tick group.\n\nFigure 17 | Execution screen of mimi 2.1\n\n\n-----\n\n###### AhnLab’s V3 products detect the Tickusb malware under the following aliases:\n\n <V3 Product Aliases>\n\n HackTool/Win32.Hijack\n\n HackTool/Win32.Mimikatz\n\n HackTool/Win32.Tickpatcher\n\n Trojan/Win32.Agent\n\n Trojan/Win32.Homamdown\n\n Trojan/Win32.Loader\n\n Trojan/Win32.Tickusb\n\n 7. IoC (Indicators of Compromise)\n\n|Major files|Col2|Col3|\n|---|---|---|\n|apphelp.dll|BrWeb.dll|CRYPTBASE.dll|\n|igfext.exe|linkinfo.dll|msupdata.exe|\n|svcmgr.exe|wincrypt.dll|wsmt.exe|\n\n\n-----\n\n|Hashes (md5)|Col2|\n|---|---|\n|Downloader : Bisodown||\n|3c6e67fc006818363b7ddade90757a84|e470b7538dc075294532d8467b1516f8|\n|Downloader : Ghostdown||\n|4868fd194f0448c1f43f37c33935547d|62ee703bbfbd5d77ff4266f9038c3c6c|\n\n\nTickusb\n\n|Col1|Tickusb|Col3|Col4|\n|---|---|---|---|\n|15e72d83caaf1fe9e72e72b633ec5dfb|16572393021beea366679e80cc78610c||29875836605c26f7c78fc91bb2cff95d|\n|46c9fb12187c08f9da3429c047a41fd8|4aadf927e5c2aa43b90d4b830c331a69||599c4110aed58aa75d2322b4232a6855|\n|6f665826f89969f689cba819d626a85b|9b31a5d124621e244cede857300f8aa6||ad33da0d9507e242eb344b313454cea9|\n|bcb56ee8b4f8c3f0dfa6740f80cc8502|ca99ea5f1ece7430243d8322445d1a1c||dfba5e8019be5e400d53afeba83d6d93|\n|Keylogger||||\n|220bf51185cd7ccc0aa64229c434ce1a||27dbf927e85e00f14ee9be56711a5246||\n|7f98ff2b6648bd4fe2fc1503fc56b46d||b79ef5a004e26c3d491eca895c59fb86||\n\n\nTools\n\n|Col1|Tools|Col3|\n|---|---|---|\n|026ae46934eca5862db4dfc8c88c720a|3fe76cf644e045b8620d577c2366630a|a353b591c7598a3ed808980e2b22b2a2|\n|b108df0bd168684f27b6bddea737535e|e84f29c45e4fbbce5d32edbfeec11e3a||\n\n\n###### Domains, URLs and IP address\n\n 127.0.0.1/jscript/timepill.html\n\n pre.englandprevail.com/km/news/index.htm\n\n update.saranmall.com/script/main.html\n\n www.memsbay.com:443\n\n 8. References\n\n [1] Tick Group Weaponized Secure USB Drives to Target Air-Gapped Critical Systems\n\n (https://unit42.paloaltonetworks.com/unit42-tick-group-weaponized-secure-usb-drives\n target-air-gapped-critical-systems)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/AhnLab/ASEC_REPORT_vol.95_ENG.pdf"
    ],
    "report_names": [
        "ASEC_REPORT_vol.95_ENG"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1561569569,
    "ts_modification_date": 1561569571,
    "files": {
        "pdf": "https://archive.orkl.eu/34e9bd7aa78ee059a78b0575dfe21ef50cc8714a.pdf",
        "text": "https://archive.orkl.eu/34e9bd7aa78ee059a78b0575dfe21ef50cc8714a.txt",
        "img": "https://archive.orkl.eu/34e9bd7aa78ee059a78b0575dfe21ef50cc8714a.jpg"
    }
}