{
    "id": "dc6702ee-db8d-41a5-a759-8257efd2e830",
    "created_at": "2023-01-12T15:09:30.851639Z",
    "updated_at": "2025-03-27T02:12:03.98695Z",
    "deleted_at": null,
    "sha1_hash": "137e5690274484e39ba4c5ddaac22fc5c944c9d1",
    "title": "2021-03-03 - Detecting HAFNIUM Exchange Server Zero-Day Activity in Splunk",
    "authors": "",
    "file_creation_date": "2022-05-28T04:05:32Z",
    "file_modification_date": "2022-05-28T04:05:32Z",
    "file_size": 7998276,
    "plain_text": "# Detecting HAFNIUM Exchange Server Zero-Day Activity in Splunk\n\n**[splunk.com/en_us/blog/security/detecting-hafnium-exchange-server-zero-day-activity-in-splunk.html](https://www.splunk.com/en_us/blog/security/detecting-hafnium-exchange-server-zero-day-activity-in-splunk.html)**\n\nMarch 3, 2021\n\n\n-----\n\nBy [Ryan Kovar March 03, 2021](https://www.splunk.com/en_us/blog/author/rkovar.html)\n\n**_If you want just to see how to find HAFNIUM Exchange Zero-Day Activity, skip down_**\n**_to the “detections” sections. Otherwise, read on for a quick breakdown of what_**\n**_happened, how to detect it, and MITRE ATT&CK mappings._**\n\n## Introduction to HAFNIUM and the Exchange Zero-Day Activity\n\nOn Tuesday, March 2, 2021, Microsoft released a set of [security patches for its mail server,](https://techcommunity.microsoft.com/t5/exchange-team-blog/released-march-2021-exchange-server-security-updates/ba-p/2175901)\nMicrosoft Exchange. These patches respond to a group of vulnerabilities known to impact\nExchange 2013, 2016, and 2019. It is important to note that an Exchange 2010 security\nupdate has also been issued, though the CVEs do not reference that version as being\nvulnerable.\n\nWhile the CVEs do not shed much light on the specifics of the vulnerabilities or exploits, the\n[first vulnerability (CVE-2021-26855) has a remote network attack vector that allows the](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26855)\nattacker, a group Microsoft named HAFNIUM, to authenticate as the Exchange server.\n[Three additional vulnerabilities (CVE-2021-26857,](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26857) [CVE-2021-26858, and](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-26858) CVE-202127065) were also identified as part of this activity. When chained together along with CVE2021-26855 for initial access, the attacker would have complete control over the Exchange\nserver. This includes the ability to run code as SYSTEM and write to any path on the server.\n\nA temporary mitigation for these vulnerabilities from external threats is restricting access to\nOWA, such as placing the OWA server behind a VPN to prevent external access. This does\n\n\n-----\n\nnot, however, prevent an internal attacker from exploiting the vulnerability. In short, patch as\nsoon as possible.\n\n## What you need to know\n\nYou may be thinking, “another Tuesday filled with patches, just like any other month.” That\n[may be true to some extent, but it is essential to point out based on Volexity’s blog that:](https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/)\n\n**_“In all cases of RCE (remote code execution), Volexity has observed the_**\n**_attacker writing web shells (ASPX files) to disk and conducting further_**\n**_operations to dump credentials, add user accounts, steal copies of the Active_**\n**_Directory database (NTDS.DIT), and move laterally to other systems and_**\n**_environments.”_**\n\nI don’t know about you, but whenever I see an adversary stealing copies of my Active\nDirectory (AD) database, that sends chills down my spine because, at that point, I am\nrebuilding my entire AD from scratch as part of my remediation effort. For more color,\n\n\n-----\n\nstealing the AD database implies that the adversary will have domain administrator\nprivilege, so this is important to investigate.\n\n### OWA! That hurts!\n\nSome of these vulnerabilities are being exploited via Outlook Web Services (OWA), a\ncommonly enabled feature of Exchange Server 2013, 2016, and 2019. Underlying OWA is\nMicrosoft’s venerable web server, Internet Information Services (IIS). It just so happens that\nelements of this attack can be detected by looking for the appropriate POST requests in IIS\nlogs.\n\nWait just a moment! [Splunk is super good at ingesting logs from all sources and looking for](https://www.splunk.com/en_us/software/splunk-cloud.html)\npatterns in them! All we need to do is ensure that logs are being ingested from our OWA\nservers appropriately.\n\n[Our recipe for success is to use the Splunk Universal Forwarder and add in a little bit of the](https://www.splunk.com/en_us/download/universal-forwarder.html)\n[Splunk-supported Technical Add-On for Microsoft IIS. Next, add something like this to your](https://splunkbase.splunk.com/app/3185/#/overview)\ninputs.conf file so that you can ingest all of the exciting logs in the C:\\inetpub\\logs\\LogFiles\ndirectory in W3C format. This will let you search through the IIS access logs for unusual\nUser-Agent string patterns known to be associated with this attack, as was mentioned\n[earlier today by our friends at](https://twitter.com/forensicitguy/status/1366473879242354692) [Red Canary. You’ll also want to add a monitoring entry to](https://redcanary.com/)\ncapture log activity in C:\\Program Files\\Microsoft\\Exchange Server\\V15\\Logging\\HttpProxy.\n\nRefer to the Volexity blog post for other interesting User-Agents seen both pre and postexploit.\n\n### Yes, Yet Again, We Need Windows Events and Command Line Auditing\n\n\n-----\n\nWhile you re under the hood of that Universal Forwarder, you might as well ensure you re\n[collecting both Windows Security events of interest and process start events, as both of](https://docs.splunk.com/Documentation/WindowsAddOn/8.1.1/User/Configuration#Configure_inputs.conf)\nthose are important for certain HAFNIUM detections. For this, we recommend you use the\n[Technical Add-On for Windows and also collect event 4688 (with command line arguments)](https://splunkbase.splunk.com/app/742/)\n[from the Security event log, OR you can always use Microsoft Sysmon and collect event 1.](https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon)\nThese process start events can be searched for anomalous execution of the Exchange UM\nservice.\n\nYou can also configure auditing on your Exchange server UM process and then search for\nWindows 4663 events for suspicious FileCreated events (in this case, the web shells.)\nHowever, be careful here - the possibility to generate many thousands of 4663 events exists\nif you do not set up your auditing policies correctly!\n\nFinally, collect the Application log from your Exchange servers, again using the Windows\nTA. This allows you to search for errors in the log containing specific patterns in the\nRenderedDescription field about the Exchange UM service’s execution.\n\n## Detecting HAFNIUM and Exchange Zero-Day Activity in Splunk\n\nHere we will give you some hot-off-the-press searches to help find some of the HAFNIUM\nbadness derived from the Volexity and Microsoft blogs. If we have coverage for these\nsearches in ESCU, we call them out further below in the MITRE ATT&CK section.\n\nPlease note that the actual remote code execution (RCE) proof of concept (POC) for these\nCVEs has not been publicly released. As such, the detections below are all derived from the\n[original blogs from Microsoft and](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/) [Volexity. When we have more information, we will publish](https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/)\nupdates!\n\n**Indicators of Compromise (IOCs)**\n\nBoth Volexity and Microsoft published IOCs, including IP addresses of observed attackers,\nweb shell hashes and filenames, and user-agents in their blog posts. We have converted\n[these indicators into simple CSV format so that you may use them as lookup tables - they](https://docs.splunk.com/Documentation/Splunk/8.1.2/Knowledge/Aboutlookupsandfieldactions)\nare posted [here. But what’s a lookup table, and how does it help with security detection in](https://github.com/stressboi/hafnium-exchange-splunk-csvs)\n[Splunk? Got you covered there, too.](https://www.splunk.com/en_us/blog/security/lookup-before-you-go-go-hunting.html)\n\n**Authentication Bypass Vulnerability**\n\nFrom Volexity’s blog, we see that this exploit is bypassing authentication and then moving\nto access users’ emails with minimal effort. The exploit requires an HTTP POST to files in a\nspecific directory /owa/auth/Current/themes/resources/.\n\nWe can detect this behavior via the following search, which requires ingesting the IIS logs\non the Exchange OWA server.\n\n\n-----\n\n```\nindex sourcetype ms:iis:auto http_method POST\nuri_path=\"/owa/auth/Current/themes/resources/*\"\n| stats count by src_ip, http_user_agent, uri_path, http_method, uri_query\n\n```\n**Nishang PowerShell framework**\n\nOne of the tools used by HAFNIUM in this attack was using the Nishang PowerShell\nframework. One method would be to look for PowerShell messages where the Nishang\ncommandlets called out in the Microsoft blog would be detected:\n```\nindex=\"*\" sourcetype=\"WinEventLog\" source=\"WinEventLog:Security\" EventCode=4104\nMessage=\"* Invoke-PowerShellTCP*\"\n\n```\nAnother would be to use other would use event code 4688 and find some of the specific\nactivity executed:\n```\nindex=\"*\" sourcetype=\"WinEventLog\" source=\"WinEventLog:Security\" EventCode=4688\nCreator_Process_Name=\"powershell.exe\" System.Net.Sockets.TCPClient\n\n```\n**Powercat detection**\n\nThe adversary used PowerShell to download and execute Powercat in memory. We’ve\n[talked about PowerShell and IEX cradles for years at Splunk (like this blog and this](https://www.splunk.com/en_us/blog/tips-and-tricks/hellsbells-lets-hunt-powershells.html) .conf16\ntalk). One simple way to detect if you were affected by this activity is to make sure you are\nbringing in event code 4104 and check for “powercat”:\n```\nindex=\"*\" sourcetype=\"WinEventLog\" source=\"WinEventLog:Security\" EventCode=4104\nMessage=\"*powercat*\"\n\n```\n\n-----\n\n**Exchange Unified Messaging Service Creating Executable Content**\n\nThe Unified Messaging Service in Microsoft Exchange Server may be abused by HAFNIUM\nto create executable content in common server-side formats such as PHO, JSP, ASPX, etc.\nIt is unusual and dangerous for a server-side component like the Unified Messaging Service\nto create new executable content. Such content, if subsequently executed, could be used\nfor remote code execution. This search inspects Event ID 4663 file system audit logs for\nevidence that the Unified Messaging service has been misused to create new executable\ncontent on the server.\n```\nindex=* sourcetype=WinEventLog source=\"WinEventLog:Security\" EventCode=4663\nObject_Type=\"File\" (Object_Name=\"*.php\" OR Object_Name=\"*.jsp\" OR Object_Name=\"*.js\"\nOR Object_Name=\"*.aspx\" OR Object_Name=\"*.asmx\" OR Object_Name=\"*.cfm\" OR\nObject_Name=\"*.shtml\") (Process_Name=\"*umworkerprocess.exe*\" OR\nProcess_Name=\"*UMService.exe*\") \n\n```\n**Exchange Unified Messaging Service Creating Child Process**\n\nThe Unified Messaging Service in Microsoft Exchange Server may be abused by HAFNIUM\nto launch child processes. Watching for unusual parent processes is a well-established\ndetection technique that we can adapt and apply in this situation. This Splunk search takes\nadvantage of Windows Event ID 4688, also referred to as Process Creation events. When\nthe parent process is related to Exchange Unified Messaging, the process may be\nsuspicious. This search employs a NOT clause to help reduce noise.\n\n\n-----\n\n```\nindex sourcetype WinEventLog source WinEventLog:Security EventCode 4688\n(Creator_Process_Name=\"*umworkerprocess.exe*\" OR\nCreator_Process_Name=\"*UMService.exe*\") NOT New_Process_Name=\"*UMWorkerProcess.exe*\"\n\n### Finding Hacker Tools\n\n```\nSuspicious zip, rar, and 7z files that are created in C:\\ProgramData\\ may\n\nindicate possible data staging for exfiltration. The searches below for Sysmon and Windows\nEvent logs, respectively, may assist in identifying these files.\n```\nindex=* (sourcetype=\"XmlWinEventLog:Microsoft-Windows-Sysmon/Operational\" OR\nsource=\"XmlWinEventLog:Microsoft-Windows-Sysmon/Operational\") EventCode=11\n(TargetFilename=\"C:\\\\ProgramData\\\\*.rar\" OR TargetFilename=\"C:\\\\ProgramData\\\\*.zip\"\nOR TargetFilename=\"C:\\\\ProgramData\\\\*.7z\")\n\n```\nOR\n```\nindex=* (sourcetype=\"WinEventLog\" source=\"WinEventLog:Security\" OR\nsourcetype=XmlWinEventLog source=\"XmlWinEventLog:Security\") EventCode=4663\nAccessList=\"%%4417\" (ObjectName=\"C:\\\\ProgramData\\\\*.rar\" OR\nObjectName=\"C:\\\\ProgramData\\\\*.zip\" OR ObjectName=\"C:\\\\ProgramData\\\\*.7z\")\n\n```\nIt has also been noted that the execution of 7-Zip to create archives as a means of staging\ndata for exfiltration has been utilized as well. To determine if this specific file has been\nexecuted, the following searches using Sysmon and Windows Event logs, respectively, can\nbe used as a starting point.\n```\nindex=* (sourcetype=\"XmlWinEventLog:Microsoft-Windows-Sysmon/Operational\" OR\nsource=\"XmlWinEventLog:Microsoft-Windows-Sysmon/Operational\") EventCode=1\nCommandLine=\"C:\\\\ProgramData\\\\7z*\"\n\n```\nOR\n```\nindex=* (sourcetype=\"WinEventLog\" source=\"WinEventLog:Security\" OR\nsourcetype=XmlWinEventLog source=\"XmlWinEventLog:Security\") EventCode=4688\nprocess=\"C:\\\\ProgramData\\\\7z*\"\n\n### Web Shells\n\n```\nIf you don’t have IIS logs, don’t fret, Wire data (like Splunk for Stream) or Zeek logs that\ncapture web traffic can also serve as a way of gaining some visibility. Obviously, we need a\n[“Hunting with Splunk” post on the subject! However, until then, check out this classic](https://www.splunk.com/en_us/blog/security/hunting-with-splunk-the-basics.html)\nYoutube video from James Bower about how to hunt web shells with Splunk.\n\n## Splunk Enterprise Security and ESCU\n\n### Know thyself\n\n\n-----\n\nWhile we have spent some time explaining that this attack is essential and effort needs to\nbe put toward investigating this, it is also important to note that the basics are important.\nBasic asset management, hopefully via your asset and identity framework, will tell you\nwhere your Exchange servers reside. Running regular vulnerability scans that integrate into\nSplunk will display which Exchange servers are vulnerable and can help you prioritize your\npatching schedule and better focus your detection efforts.\n\n### Threat Intelligence Framework\n\n[If you are using Splunk Enterprise Security, the lookups of IOCs that are listed above can](https://www.splunk.com/en_us/software/enterprise-security.html)\nbe ingested easily into the threat intelligence framework. Perhaps you aren’t sure how to do\nthat. No worries, we published some guidance and a how-to on integrating lists of IOC into\nthe Enterprise Security threat intelligence framework.\n\n### Enterprise Security Content Updates (ESCU)\n\nFor folks using ESCU, our Security Research team will release a new Splunk Analytic Story\ncalled “HAFNIUM Group” on March 4th, 2021, containing detections for this threat. Saying\nthat, check out the MITRE ATT&CK table below. If you have ESCU running today, you\nalready have some great coverage!\n\n## MITRE ATT&CK\n\nReviewing the blog posts from Microsoft and Volexity, we mapped the adversary’s activity to\nMITRE ATT&CK. Each tactic is then linked to Splunk Content to help you hunt for that\ninformation. Be aware; these searches are provided as a way to accelerate your hunting.\n[We recommend you configure them via the Splunk Security Essentials App. You may need](https://splunkbase.splunk.com/app/3435/)\nto modify them to work in your environment! Many of these searches are optimized for use\nwith the tstats command.\n\n\n-----\n\nFinally, as more information becomes available, we will update these searches if more\nATT&CK TTPs become known.\n\n\n**ATT&CK**\n**Tactic**\n\n\n**Title** **HAFNIUM**\n**activity**\n\n\nT1003.001 OS Credential\nDumping:\nLSASS\nMemory\n\nT1059.001 Command and\nScripting\nInterpreter:\nPowerShell\n\nT1114.001 Email\nCollection:\nLocal Email\nCollection\n\nT1136 Create\nAccount\n\nT1003.003 OS Credential\nDumping:\nNTDS\n\nT1021.002 Remote\nServices:\nSMB/Windows\nAdmin Shares\n\n\nUsed Procdump\nto export\nLSASS\n\n\n**Splunk Searches**\n\n[Dump LSASS via Procdump](https://github.com/splunk/security_content/blob/d9b977a7a683afd0206601a6964fae09c6dd4324/detections/endpoint/dump_lsass_via_procdump.yml)\n\n[Dump of LSASS using comsvcs.dll](https://github.com/splunk/security_content/blob/develop/detections/endpoint/dump_lsass_via_comsvcs_dll.yml)\n\n\nNishang\nPowerShell Malicious PowerShell Process [Connect To Internet With Hidden](https://github.com/splunk/security_content/blob/develop/detections/endpoint/malicious_powershell_process___connect_to_internet_with_hidden_window.yml)\nWindow, Malicious PowerShell Process\n\n         - Execution Policy Bypass\n\nAttempt To Set Default PowerShell\n[Execution Policy To Unrestricted or](https://github.com/splunk/security_content/blob/develop/detections/endpoint/attempt_to_set_default_powershell_execution_policy_to_unrestricted_or_bypass.yml)\nBypass\n\n\nPowerShell\nmailbox\ncollection\n\nAdd user\naccounts\n\nSteal copies of\nthe Active\nDirectory\ndatabase\n(NTDS.DIT)\n\nLateral\nmovement\n\n\nEmail files written outside of the email\ndirectory\n\n[Detect New Local Admin account](https://github.com/splunk/security_content/blob/develop/detections/endpoint/detect_new_local_admin_account.yml)\n\n[Ntdsutil export ntds](https://github.com/splunk/security_content/blob/develop/detections/endpoint/ntdsutil_export_ntds.yml)\n\n[Detect PsExec With accepteula Flag](https://github.com/splunk/security_content/blob/develop/detections/endpoint/detect_psexec_with_accepteula_flag.yml)\n\n\nHere is a list of all the MITRE ATT&CK TTP’s that we saw being used in this attack:\nT1003.001, T1005, T1027, T1046, T1059, T1059.001, T1070, T1071, T1074.002, T1083,\nT1110, T1190, T1505, T1560.001, T1589.002, T1590.002\n\n## Conclusion\n\n\n-----\n\nWe know that this is a significant vulnerability and that customers will want to patch as soon\nas possible and determine if they were affected by this attack in the past. If you haven’t\npatched yet (we’ve all been there), hopefully, these searches will provide you the ability to\nhave more visibility into your environment and any malicious activity that you might be\nexperiencing. If they don’t work perfectly, think of them as “SplunkSpiration” :-). As soon as\nwe have more information, we will update this blog and, as we talked about earlier, be on\nthe lookout for more detections from our threat research team that will be released through\nEnterprise Security Content Updates.\n\n**_As always, security at Splunk is a family business. Credit to authors and_**\n**_collaborators:_**\n\n**_Mick Baccio_**\n**_James Brodsky_**\n**_Shannon Davis_**\n**_Michael Haag_**\n**_Amy Heng_**\n**_Jose Hernandez_**\n**_Dave Herrald_**\n**_Ryan Kovar_**\n**_Marcus LaFerrera_**\n**_John Stoner_**\n\nPosted by\n\n\n-----\n\n**[Ryan Kovar](https://www.splunk.com/en_us/blog/author/rkovar.html)**\n\nNY. AZ. Navy. SOCA. KBMG. DARPA. Splunk.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-03 - Detecting HAFNIUM Exchange Server Zero-Day Activity in Splunk.pdf"
    ],
    "report_names": [
        "2021-03-03 - Detecting HAFNIUM Exchange Server Zero-Day Activity in Splunk.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536170,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653710732,
    "ts_modification_date": 1653710732,
    "files": {
        "pdf": "https://archive.orkl.eu/137e5690274484e39ba4c5ddaac22fc5c944c9d1.pdf",
        "text": "https://archive.orkl.eu/137e5690274484e39ba4c5ddaac22fc5c944c9d1.txt",
        "img": "https://archive.orkl.eu/137e5690274484e39ba4c5ddaac22fc5c944c9d1.jpg"
    }
}