{
    "id": "dc69f8a4-8e69-41b3-8fa3-f005570ddf1c",
    "created_at": "2023-06-05T02:06:47.214986Z",
    "updated_at": "2025-03-27T02:05:44.443809Z",
    "deleted_at": null,
    "sha1_hash": "17019be0ad53e62c1ac2ac711dfd2e17d6e3d397",
    "title": "2023-05-09 - eSentire Threat Intelligence Malware Analysis- Vidar Stealer",
    "authors": "",
    "file_creation_date": "2023-06-04T12:59:05Z",
    "file_modification_date": "2023-06-04T12:59:05Z",
    "file_size": 15171880,
    "plain_text": "# eSentire Threat Intelligence Malware Analysis: Vidar…\n\n**[esentire.com/blog/esentire-threat-intelligence-malware-analysis-vidar-stealer](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-vidar-stealer)**\n\nResources\n\nTRU INTELLIGENCE CENTER\n\nOur Threat Response Unit (TRU) publishes security advisories, blogs, reports, industry\npublications and webinars based on its original research and the insights driven through\nproactive threat hunts.\n\n[View Threat Intelligence Resources →](https://www.esentire.com/resources/tru-intelligence-center)\nCompany\n\nABOUT ESENTIRE\n\nAbout Us\n\neSentire is The Authority in Managed Detection and Response Services, protecting the\ncritical data and applications of 2000+ organizations in 80+ countries from known and\nunknown cyber threats. Founded in 2001, the company’s mission is to hunt, investigate and\nstop cyber threats before they become business disrupting events.\n\n[Read about how we got here](https://www.esentire.com/company/about-us)\n[Leadership](https://www.esentire.com/company/leadership) [Work at eSentire](https://www.esentire.com/company/careers)\nEVENT CALENDAR\n\nMay\n\n31\n\nNetDiligence Cyber Risk Summit\n\neSentire will be a Sponsor at the NetDeligence Cyber Risk Summit in Fort…\n\nMay\n\n31\n\nMemorial Insights Special\n\neSentire will be attending Avant's Memorial Insights Special.\n\nJun\n\n\n-----\n\n01\n\nAppDirect Boston Regional Event\n\neSentire will be attending this event.\n\n[View Event Calendar →](https://www.esentire.com/company/event-calendar)\nPartners\n\nPARTNER PROGRAM\n\ne3 Ecosystem\n\nWe provide sophisticated cybersecurity solutions for Managed Security Service Providers\n(MSSPs), Managed Service Providers (MSPs), and Value-Added Resellers (VARs). Find out\nwhy you should partner with eSentire, the Authority in Managed Detection and Response,\ntoday.\n\n[Learn more](https://www.esentire.com/partners)\nSearch\n\nResources\n\n[Speak With A Security Expert Now](https://www.esentire.com/get-started)\nVidar Stealer is an information stealer (infostealer) malware that first appeared on hacking\nforums at the end of 2018. It’s typically spread through the use of drive-by social engineering\ntechniques wherein the victim visits a malicious webpage and unknowingly downloads the\nmalware payload. In comparison to other infostealers, Vidar Stealer has a significantly higher\nsubscription price largely due to its successful infection rate (above 75%) and the fact that\nnew domains for the payloads are renewed in 3-4 days.\n\nThis malware analysis delves deeper into the technical details of how the Vidar Stealer\nmalware operates and our security recommendations to protect your organization from being\nexploited.\n\n## Key Takeaways\n\nIn 2022, Vidar Stealer was the second most used infostealer malware on the Dark\nWeb, based on the number of logs sold in Dark Web forums, meaning that threat actors\nare both having success with deploying the stealer into networks and spreading the\nstealer across the Internet.\nBased on our analysis, Vidar Stealer does not include country checks, which means it\n[is able to infect countries within The Commonwealth of Independent States (CIS).](https://cert.gov.ua/article/2724253)\nThe threat actor(s) are actively using social media accounts to host their Command\nand Control (C2) servers.\n\n\n-----\n\nThe current versions of Vidar Stealer do not store the exfiltrated data on the victims\ndisk.\nNew versions of Vidar Stealer use XOR string encryption instead of RC4. Each string is\nencrypted with a different XOR key.\nThe new version of Vidar Stealer (56.1) includes Signal Messenger for data exfiltration.\n\n## Case Study: Vidar Stealer\n\neSentire Threat Response Unit (TRU) has observed numerous Vidar infections in enterprise\nsoftware, Retail, Business Services, and Real Estate industries. We have also observed the\n[stealer being delivered in a BatLoader campaign upon successful infection. The stealer is](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-batloader)\nalso capable of deleting itself after the infection.\n\nThe first mention of the stealer appeared on hacking forums at the end of 2018 (Figure 1).\n\nFigure 1: Vidar Stealer seller’s post translated from Russian\nThe Vidar Stealer subscription price is significantly higher than other stealers such as\nRedline, Mars Stealer and Raccoon Stealer (Figure 2).\n\n\n-----\n\nFigure 2: Subscription price for Vidar Stealer\nIn a forum post, the malware author explained the high subscription price due to multiple\nfeatures that include:\n\nThe successful infection rate (successful log delivery), which is also commonly called\nas “otstuk” (“отстук”) among native Russian speakers, is above 75%.\nNew domains for the builders (payloads) are renewed once in 3-4 days with the\nprevious ones remaining intact.\n\nThe feature of the stealer generating and hosting their own domains/IPs for the builders\nmakes it very convenient for the buyers as there is no need to spin up a VPS server and\nmaintain it to receive the logs compared to other stealers.\n\nVidar Stealer is commonly confused as a variant of Arkei Stealer due to the code similarities\nbut the developer claims that Arkei and Vidar are not related to each other. In December\n2022, based on the Dark Web marketing known as ‘Russianmarket’, Vidar Stealer was the\nsecond most used Stealer on the Dark Web, with [Redline Stealer being the number one](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-redline-stealer)\nstealer (Figure 3).\n\nFigure 3: Number of logs are getting sold on russianmarket\nAll the stolen logs are then sent to the Admin panel that is browser-based. The end-user\nwould need an invitation code to register and purchase the subscription without directly\ninteracting with the seller on Telegram (Figure 4).\n\n\n-----\n\nFigure 4: Vidar Stealer C2 Panel\nVidar Stealer spreads through drive-by downloads – users visit the website hosting a\nmalicious stealer payload; typically it’s a [fake cracked software or fake installers. The stealer](https://www.esentire.com/blog/cracked-software-leads-to-information-stealing-malware)\nalso uses [GitHub\nas a repository to host the payloads. That way the attacker(s) will receive](https://twitter.com/ankit_anubhav/status/1588073956606550018?s=20&t=cEI8GPRjfTd4FYqbzi3pWA)\nthe direct link to the payload file that they can send over to installer bots/providers (services\nthat provide the mass spreading of the payload) (Figure 5).\n\n\n-----\n\nFigure 5: Manual for uploading stealer payloads to GitHub (translated from Russian inbrowser)\nIt is worth mentioning that most Vidar Stealer users are using installer services to spread the\nstealer, which was likely the case with the Vidar stealer infection in Ukraine reported by\n[CERT-UA, where the user visited the fake Advanced IP Scanner landing page.](https://cert.gov.ua/article/2724253)\n\n## Vidar Stealer Panel Review\n\nOne of the main sections of the panel is Settings, where the threat actor can specify what\nadditional information, they want to exfiltrate from the infected host including Telegram logs,\ncryptocurrency wallets, browser history and downloads, screenshots, Steam, and Discord\nlogs (Figure 6)\n\n\n-----\n\nFigure 6: Settings panel\nThe grabber module allows an attacker to harvest files under the following folders (Figure 7):\n\n%DESKTOP%\nC:\\Users\\<username>\\Documents\n%DRIVE_FIXED% (all drives on the machine)\n%DRIVE_REMOVABLE% (removable drives)\n%USERPROFILE%\n%APPDATA%\n%LOCALAPPDATA%\nC:\\Program Files (x86)\nC:\\Program Files\nC:\\Users\\<username>\\Recent\n\n\n-----\n\nFigure 7: Grabber module\nThe stealer contains a non-resident loader module. There are two kinds of loaders that are\ncommonly mentioned by Russian native speakers:\n\n**Non-resident loader – the loader deletes itself after successful infection.**\n**Resident loader – upon starting, the loader creates the persistence on the infected**\nhost via Registry Run Keys, Startup folder, and service creation.\n\nThe loader module only supports .exe binaries that are grabbed from the URL the attacker\nspecifies. The attacker can specify to which country the loader can be applied to (Figure 8).\n\n\n-----\n\nFigure 8: Loader module\nThe stealer builder is constantly getting updated including the “Defender cleaning”, which\nmeans that the builder gets modified once a week, so Windows Defender is less likely to\ndetect it (Figure 9).\n\n\n-----\n\nFigure 9: Builder updates\nThe logs panel allows the malicious actor to easily navigate through logs and access them\ndirectly within the portal without having to download them to their machine (Figure 10).\n\n\n-----\n\nFigure 10: Logs panel enabling attacker(s) to view the host information, screenshot and\nretrieved files directly in-browser\nThe Services section automatically parses the stolen data including banking information,\nSMTP, Cpanel and WordPress credentials (Figure 11).\n\nFigure 11: Services section\nCompromised credentials for Cpanel and WordPress can be bought and used by other\nmalicious actor(s) to spread their malware via the drive-by downloads.\n\nOne of the main features of Vidar Stealer is that it provides malicious users an option to set\nup their own domains (Figures 12-13), which is known as “gasket” or “pads”.\n\n\n-----\n\nFigure 12: Personal Domain Configuration Tab\nPads, or gaskets, is an intermediate server set for the stealer to communicate with as a\nCommand and Control (C2) server and send the exfiltrated logs to. The standard ports for\nC2 communications are HTTP/80 and HTTPS/443.\n\nThe malicious actor can host the C2 server on Telegram or Mastodon as the pads. Telegram\nand Mastodon allow the user to change the IPs on the fly by editing the profile description.\nWith Telegram, the malicious actor can create a channel and add the IP and port in the\ndescription, for example hello http://IP:80|\n(Figure 13).\n\nFigure 13: Instruction on how to setup the personal pad\nAn example of an attacker’s Telegram C2 channel is shown in Figure 14.\n\n\n-----\n\nFigure 14: Attacker's Telegram channel\nExamples of Mastodon websites where an attacker can host their C2 include:\n\n[https://c.im/](https://c.im/)\n[https://indieweb.social/](https://indieweb.social/)\n[https://busshi.moe/](https://busshi.moe/)\n[https://koyu.space/](https://koyu.space/)\n[https://mastodon.online/](https://mastodon.online/)\n[https://ioc.exchange/](https://ioc.exchange/)\n[https://nerdculture.de/](https://nerdculture.de/)\n\nThe scheme works the same way as for Mastadon; an attacker inputs their C2 IP into the\n[profile description field as shown in Figure 15. The threat actors have also been using Steam](https://twitter.com/ankit_anubhav/status/1595664080479535104?s=46&t=agmu8eh2vry7HB3A78Ga5Q)\n[and TikTok\naccounts to host the C2.](https://twitter.com/crep1x/status/1593360365240389633?s=20&t=DADIky1LQTUvElJ2ZfnYcA)\n\n\n-----\n\nFigure 15: Attacker's C2 on the site running with Mastodon engine\n\n## Vidar Stealer Binary Review\n\nVidar Stealer binary is written in C++ programming language. The payload generated from\nVidar Stealer Panel contains strings that are encoded with XOR keys. The XOR key is\ndifferent for each string. In the binaries we have observed on clients’ environments (MD5:\n810aa0d8faf41720af07153258c05b77), most payloads were using RC4 for string encryption.\n\nWe assume that the payloads with RC4 encryption are from the older version. The\ncomparison of the decompiled codes containing the encoding/encryption functions for Vidar\npayload generated from the panel (on the left) and the one that we have observed on\ninfected machines (on the right) (Figure 16).\n\n\n-----\n\nFigure 16: Encoding/encryption from two Vidar samples\nThe second binary contains an embedded RC4 key as shown in Figure 17. The encrypted\nhex strings are base64-encoded.\n\nFigure 17: Embedded RC4 key from the second payload\n\n\n-----\n\nInteresting enough, both payloads still have unencrypted strings embedded in the payloads\n(Figure 18) including the cryptocurrency browser extensions and some crypto wallets,\nattacker’s C2, the text files generated from collecting the user’s browsing data, etc.\n\nFigure 18: Plaintext strings observed in the second payload\nWe will proceed with the analysis of the payload generated from C2 panel with the builder\nversion 55.6 which is the latest one at the time of writing the report. The payload we have\nobserved on the infected hosts from the BatLoader campaign are on version 54.7.\n\nThere are two XOR-decryption tables in the binary, one is responsible for decrypting the API\nfunctions and sandbox name checks, the other table decrypts the rest of the stealer strings.\nIn order to complete this analysis, we wrote a script to decrypt the strings within the stealer\nbinary. The stealer searches for the cryptowallet extensions in Chrome browser and extracts\nthe CURRENT file within the %appdatalocal%\\Google\\Chrome\\User Data\\Default\\Local\n_Extension Settings\\<extension_name> directory (Figure 19)._\n\n\n-----\n\nFigure 19: XOR tables\nVidar is also enumerating JSON and wallet.dat files (Figure 20).\n\nFigure 20: Function responsible for cryptowallet extension search\nThe JSON file is also known as Keystore file that stores the private key of the cryptowallet in\nan encrypted format. The wallet DAT file contains transaction information, key metadata,\nprivate & public keys, and can be in an unencrypted or encrypted format. If it is encrypted but\nprotected with a weak password, the attacker may be able to crack it (Figure 21).\n\nFigure 21: Cryptowallet search (wallet DAT files)\nThe list of cryptowallet extensions that Vidar attempts to steal:\n\n\n-----\n\n|Cryptowallet Name|Browser Extension|\n|---|---|\n|TronLink|ibnejdfjmmkpcnlpebklmnkoeoihofec|\n|MetaMask|nkbihfbeogaeaoehlefnkodbefgpgknn|\n|BinanceChainWallet|fhbohimaelbohpjbbldcngcnapndodjp|\n|Yoroi|ffnbelfdoeiohenkjibnmadjiehjhajb|\n|NiftyWallet|jbdaocneiiinmjbjlgalhcelgbejmnid|\n|MathWallet|afbcbjpbpfadlkmhmclhkeeodmamcflc|\n|Coinbcase|hnfanknocfeofbddgcijnmhnfnkdnaad|\n|Guarda|hpglfhgfnhbgpjdenjgmdgoeiappafln|\n|EQUALWallet|blnieiiffboillknjnepogjhkgnoapac|\n|JaxxLiberty|cjelfplplebdjjenllpjcblmjkfcffne|\n|BitAppWallet|fihkakfobkmkjojpchpfgcmhfjnmnfpi|\n|iWallet|kncchdigobghenbbaddojjnnaogfppfj|\n|Wombat|amkmjjmmflddogmhpjloimipbofnfjih|\n|MewCx / Enkrypt|nlbmnnijcnlegkjjpcfjclmcfggfefdm|\n|GuildWallet|nanjmdknhkinifnkgdcggcfnhdaammmj|\n|RoninWallet|fnjhmkhhmkbjkkabndcnnogagogbneec|\n|RoninWalletEdge|kjmoohlgokccodicjjfebfomlbljgfhk|\n|NeoLine|cphhlgmgameodnhkjdmkpanlelnlohao|\n|CloverWallet (CLV Wallet)|nhnkbkgjikgcigadomkphalanndcapjk|\n|LiqualityWallet|kpfopkelmapcoipemfendmdcghnegimn|\n|Terra Station|aiifbnbfobpmeekipheeijimdpnlpgpp|\n|Keplr|dmkamcknogkgcdfhhbddcghachkejeap|\n|Sollet|fhmfendgdocmcbmfikdcogofphimnkno|\n|AuroWallet|cnmamaachppnkjgnildpdmkaakejnhae|\n|PolymeshWallet|jojhfeoedkpkglbfimdfabpdfjaoolaf|\n\n\n-----\n\n|ICONex|flpiciilemghbmfalicajoolhkkenfel|\n|---|---|\n|Harmony|fnnegphlobjdpkhecapkijjdkgcjhkib|\n|Coin98|aeachknmefphepccionboohckonoeemg|\n|EVER Wallet|cgeeodpfagjceefieflmdfphplkenlfk|\n|KardiaChain|pdadjkfkgcafgbceimcpbkalnfnepbnk|\n|Rabby|acmacodkjbdgmoleebolmdjonilkdbch|\n|Phantom|bfnaelmomeimhlpmgjnjophhpkkoljpa|\n|Brave Wallet|odbfpeeihdkbihmopkbjmoonfanlbfcl|\n|MetaMask|ejbalbakoplchlghecdalmeeeajnimhm|\n|Oxygen (Atomic)|fhilaheimglignddkjgofkcbgekhenbh|\n|PaliWallet|mgffkfbidihjpoaomajlbgchddlicgpn|\n|BoltX|aodkkagnadcbobfpggfnjeongemjbjca|\n|XdefiWallet|hmeobnfnfcmdkdcmlblgagmfpfboieaf|\n|NamiWallet|lpfcbjknijpeeillifnkikgncikgfhdo|\n|MaiarDeFiWallet|dngmlblcodfobpdpecaadgfbcggfjfnm|\n|WavesKeeper|lpilbniiabackdjcionkobglmddfbcjo|\n|Solflare|bhhhlbepdkbapadjdnnojkbgioiodbic|\n|CyanoWallet|dkdedlpgdmmkkfjabffeganieamfklkm|\n|KHC|hcflpincpppdclinealmandijcmnkbgn|\n|TezBox|mnfifefkajgofkcjkemidiaecocnkjeh|\n|Temple|ookjlbkiijinhpmnjffcofjonbfbgaoc|\n|Goby|jnkelfanjkeadonecabehalmbgpfodjm|\n\n\nAdditionally, the stealer grabs the leveldb files and wallet folder for Jaxx, Daedalus Mainnet,\nWasabi, Blockstream, Dogecoin, Binance, Ravencoin, and Ledger Live cryptowallets.\n\nFor Mozilla Firefox password decryption process, the stealer looks for files such as\ncookies.sqlite, formhistory.sqlite, logins.json, and places.sqlite:\n\n**Cookies.sqlite – stores the cookies.**\n\n\n-----\n\n**Formhistory.sqlite – stores the forms that the user has entered webpages.**\n**Logins.json – stores the encrypted usernames and passwords.**\n**Places.sqlite – stores the bookmarks, browsing history and keywords.**\n\nIf cookies.sqlite is found, the stealer then proceeds to use SQLite to extract the cookies\nusing the query SELECT host, isHttpOnly, path, isSecure, expiry, name, and value FROM\nmoz_cookies (moz_cookies table contains the cookie information) (Figure 22).\n\nFigure 22: Extracting the cookies\nThen, it will proceed to look for formhistory.sqlite and if the latest was found, the stealer starts\nextracting the Autofill data using SQLite functions and outputs the data in a text file for\nexfiltration (Figure 23).\n\n\n-----\n\nFigure 23: The stealer proceeds with extracting the Autofill data if the form.sqlite is found\nAfter successfully decrypting the password, Vidar stealer appends the “Soft:” (Browser\nname) and “Host:” (domain) fields to the text file along with extracted logins and passwords.\n\nFor logins.json, the stealer calls NSS_Init() function that initializes the NSS library and\nextracts the parameters such as encryptedUsername, encryptedPassword, formSubmitURL.\nThe stealer then proceeds with decrypting the fields using the NSS library cryptography\nfunctions such as PK11SDR_Decrypt, PK11_GetInternalKeySlot and PK11_Authenticate\n(Figure 24).\n\n\n-----\n\nFigure 24: Decrypting the encrypted data within logins.json\nTo extract browsing history, the stealer utilizes the query SELECT url FROM moz_places\n(moz_tables contain the list of the URLs that the user visited). After successfully extracting\nthe browsing data, the stealer appends them to a History.txt file (Figure 25).\n\nFigure 25: Extracting the browsing data\nIt’s worth noting that prior to decrypting the browser credentials, cookies and extracting\nsensitive information, the stealer looks for profiles.ini file under\n%appdata%\\mozilla\\firefox\\profiles\\ (Mozilla Firefox), %appdata%\\Moonchild\nProductions\\Pale Moon\\Profiles\\ (Pale Moon), %appdata%\\Thunderbird\\Profiles\\\n\n\n-----\n\n(Thunderbird). The .INI file contains the information of user profiles. Vidar stealer then gets\nthe DLL dependencies such as vcruntime140.dll, softokn3.dll, nss3.dll, msvcp140.dll,\nmozglue.dll, and freebl3.dll (Figure 26).\n\nFigure 26: Getting the profile.ini and DLL dependencies\nMost stealers require the mentioned dependencies to function properly. You can refer to our\n[blog on Mars Stealer to read about the DLLs mentioned. The DLL dependencies are](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-mars-stealer)\ndownloaded from the C2 server within the ZIP archive, the ZIP archive name contains 19\nrandom hexadecimal numbers and is extracted to ProgramData folder. Please note that the\nZIP archive can also contain the name “update.zip” if the threat actor decides to set up and\nhost their personal panel.\n\nTo extract FileZilla credentials, the stealer reads the recentservers.xml file on the host. The\npasswords are base64-encoded, so all the threat actor needs to do is to decode them to\ncleartext to further abuse the victims accounts. FileZilla stores credentials in two places,\nrecentservers.xml saves the credentials that were entered via the quick connect bar,\nsitemanager.xml saves the credentials that were configured within the site manager. After\nsuccessfully extracting the credentials, the data will be saved in the format:\n\nSoft: FileZilla\n\nHost: :port\n\nLogin:\n\nPassword:\n\n\n-----\n\nThe stealer also retrieves sensitive files from Authy Desktop (two-factor authentication\napplication) such as .log, MAFINEST, LOG, LOCK and CURRENT files under the path\nAppData\\Roaming\\Authy Desktop\\Local Storage\\leveldb and copies them to the Soft\\Authy\nDesktop folder that will be archived to be sent to the attacker. Besides Authy Desktop, the\nstealer also exfiltrates data from Google Authenticator browser extension, EOS\nAuthenticator, and GAuth Authenticator (Figure 27).\n\nFigure 27: Vidar Stealer extracts Authy Desktop sensitive data\nVidar will exfiltrate data from Telegram, Discord, Chrome, and Steam in the following\nmanners:\n\n**Telegram: Vidar Stealer exfiltrates the files such as key_datas, maps,**\nA7FDF864FBC10B77, A92DAA6EA6F891F2, F8806DD0C461824F (Telegram\nencrypted data files) from AppData\\Roaming\\Telegram Desktop\\tdata folder. The\nattacker can then attempt to decrypt the files and extract sensitive information. The\nexfiltrated data is written to \\Soft\\Telegram\\ folder.\n**Discord: The stealer retrieves the files under AppData\\Roaming\\discord\\Local**\nStorage\\leveldb and AppData\\Roaming\\discord\\Session Storage\\leveldb then it\nattempts to extract Discord tokens that will be written to\n\\Soft\\Discord\\discord_tokens.txt.\n**Chrome: In order to decrypt credentials saved in Chrome, the stealer retrieves the**\nAES encrypted key (encrypted_key) in Google\\Chrome\\User Data\\Local State.\n**Steam: The stealer queries the registry value SteamPath under**\nHKEY_CURRENT_USER\\Software\\Valve\\Steam to obtain the full path to Steam on the\nmachine. Then it starts retrieving SSFN, config.vdf, DialogConfig.vdf,\nDialogConfigOverlay.vdf, libraryfolders.vdf, loginusers.vdf files that contain sensitive\ninformation. By obtaining the SSNF files, the attacker can bypass Steam Guard and get\nthe full access to the account, considering that an attacker was able to obtain user’s\ncredentials.\n\nWith the version 56.1, Vidar also added data exfiltration for Signal Messenger.\n\n\n-----\n\nAs previously mentioned, Vidar Stealer has a loader module that allows a malicious actor to\npush additional malware on the machine. The additional malware retrieved from a C2 with\nthe help of a loader module will be placed under ProgramData folder.\n\nFirst, the stealer checks if the URL to retrieve the payload is up and running (status code\n200). If the link is valid, the malware writes the secondary payload to the host and if not the\nstealer sleeps for 1000 milliseconds (Figure 28).\n\nFigure 28: Loader module\nThe emulation check is also present within the Vidar Stealer binary. The binary retrieves the\nname of the local computer and the username and if it matches “HAL9TH” or “JohnDoe”\nstrings accordingly, the binary will exit. The mentioned values are used by Windows\nDefender emulator (Figure 29).\n\nFigure 29: Emulation check\nThe stealer exfiltrates WinSCP credentials via looking up the Sessions value name under\nHKEY_CURRENT_USER\\Software\\Martin Prikryl\\WinSCP 2\\Sessions. But first, it checks if\nthe user is using Master Password for WinSCP, if not then it proceeds with extracting the\nusername and encrypted password values. The decrypting function and function responsible\nfor extracting WinSCP credentials are shown in Figure 30.\n\n\n-----\n\nFigure 30: Extracting WinSCP Sessions data and decrypting the passwords\nThe stealer is not able to decrypt the passwords if WinSCP is protected with a master\npassword and will then only be able to extract usernames.\n\nCredit card information can also be extracted from browsers via SQLite functions. For\nexample, the stealer would look for \\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Web\n_Data path and extracts the credit card information with the query SELECT name_on_card,_\n_expiration_month, expiration_year, card_number_encrypted FROM credit_cards, then it calls_\n[the functions BCryptDecrypt\nand](https://learn.microsoft.com/en-us/windows/win32/api/bcrypt/nf-bcrypt-bcryptdecrypt) [CryptUnprotectData\nto decrypt the data.](https://learn.microsoft.com/en-us/windows/win32/api/dpapi/nf-dpapi-cryptunprotectdata)\n\nBesides the sensitive data exfiltration, the stealer also gathers the host information including:\n\n**MachineID – the stealer locates the value under**\n_SOFTWARE\\Microsoft\\Cryptography\\MachineGuid_\n**[GUID – GUID is retrieved from calling the function GetCurrentHwProfileA\nwhich](https://learn.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-getcurrenthwprofilea)**\nreceives the information about the hardware profile)\n**HWID – Figure 31 shows how the first 12 hexadecimal values are calculated based on**\n[the Volume Serial Number that is retrieved via the GetVolumeInformationA\nfunction.](https://learn.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-getvolumeinformationa)\nLater the stealer appends 10 digits to it, and part of the GUID and MachineID values\nare also added to the HWID which makes it unique to each infected host\n\n\n-----\n\nFigure 31: HWID calculation\nThe host information also contains the path where the stealer was executed, such as the OS\nversion, computer name, username, display resolution, display language, keyboard\nlanguages, local time, time zone, hardware information, running processes and list of\nsoftware installed on the host (Figure 32).\n\n\n-----\n\nFigure 32: Gathered host information that is sent out to C2\n\n## Vidar Stealer 3.6-3.7 Update\n\nStarting from version 3.6, which was released in April 2023, Vidar users can generate builds\nwith embedded DLL dependencies. This has increased the size of the builds to 2.9MB, but it\nmeans that the DLL dependencies no longer need to be retrieved from the C2 server.\nInstead, the ZIP archive containing the dependencies is already embedded within the\nexecutable.\n\n\n-----\n\nThis reduces the amount of suspicious activity on the network traffic. After extracting the\nDLLs, they will be placed under C:\\ProgramData\nfolder. Vidar users now also have the option\nto disable the self-deletion feature for the stealer after successful execution, starting from\nupdate 3.7.\n\nFigure 33: Vidar Stealer updates\n\nFigure 34: Embedded ZIP archive with DLL dependencies within the executable\nWith the latest build, the threat actor also switched from using XOR to using RC4 encryption\nwith a hardcoded key in the binary.\n\n\n-----\n\nFigure 35: Hardcoded RC4 key\nWe wrote the [IDAPython string decryption script for the latest Vidar Stealer build as well as](https://github.com/RussianPanda95/IDAPython/blob/main/Vidar/Vidar_Stealer_3.7_RC4_string_decryption.py)\nthe [configuration extractor script.](https://github.com/RussianPanda95/Configuration_extractors/blob/main/vidar_config_extractor.py)\n\n## Vidar Stealer C2 Communication\n\nAs mentioned before, Vidar Stealer uses HTTP/HTTPs for C2 communication. First, the\ninfected machine receives the ZIP archive from the C2 that contains DLL dependencies. The\ndependencies are extracted under ProgramData folder.\n\nThe stealer configuration is also shown in the PCAP below (Figure 33). The configuration\nincludes the grabber parameters. In our example, the stealer exfiltrates the .txt files under\nDocuments folder and excludes ‘movies:music:mp3’. 50 (KB) is the maximum size of the file\nthat stealer grabs.\n\nFigure 36: Stealer configuration\n\n\n-----\n\nThe exfiltrated data is compressed in a ZIP archive and base64-encoded (Figure 37 in red).\nThe POST data also contains the profile value and profile ID which are hardcoded within the\nbinary and the token value (Figure 37).\n\nFigure 37: POST data including the exfiltrated data\n\n## How eSentire is Responding\n\nOur Threat Response Unit (TRU) combines threat intelligence gained from research and\nsecurity incidents to create practical outcomes for our customers. We are taking a\ncomprehensive response approach to combat modern cybersecurity threats by deploying\ncountermeasures, such as:\n\nPerforming global threat hunts for indicators associated with Vidar Stealer.\n\nImplementing threat detections to identify malicious command execution and ensure\nthat eSentire has visibility and detections are in place across eSentire MDR for\nEndpoint.\n\nOur detection content is supported by investigation runbooks, ensuring our SOC (Security\nOperations Center) analysts respond rapidly to any intrusion attempts related to a known\nmalware Tactics, Techniques, and Procedures. In addition, TRU closely monitors the threat\nlandscape and constantly addresses capability gaps and conducts retroactive threat hunts to\nassess customer impact.\n\n## Recommendations from eSentire’s Threat Response Unit (TRU)\n\n\n-----\n\nWe recommend implementing the following controls to help secure your organization against\nVidar Stealer malware:\n\n[Confirm that all devices are protected with Endpoint Detection and Response (EDR)](https://www.esentire.com/how-we-do-it/signals/endpoint)\nsolutions.\n[Implement a Cyber Phishing and Security Awareness Training (PSAT)\nProgram that](https://www.esentire.com/what-we-do/managed-vulnerability-and-risk/technical-testing/security-awareness-training-managed-phishing-training)\neducates and informs your employees on emerging threats in the threat landscape.\nEncourage your employees to use password managers instead of using the password\nstorage feature provided by web browsers. Use master passwords where it’s\napplicable.\n\nWhile the TTPs used by threat actor(s) grow in sophistication, they lead to a certain level of\ndifficulties at which critical business decisions must be made. Preventing the various attack\ntechnique and tactics utilized by the modern threat actor requires actively monitoring the\nthreat landscape, developing, and deploying endpoint detections, and the ability to\ninvestigate logs & network data during active intrusions.\n\neSentire’s TRU is a world-class team of threat researchers who develop new detections\nenriched by original threat intelligence and leverage new machine learning models that\ncorrelate multi-signal data and automate rapid response to advanced threats.\n\nIf you are not currently engaged with an MDR provider, eSentire MDR can help you reclaim\nthe advantage and put your business ahead of disruption.\n\nLearn what it means to have an elite team of Threat Hunters and Researchers that works for\nyou. [Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n## Appendix\n\n Yara Rule\n\n\n-----\n\n```\nrule Vidar_DLL_embedded {\n\n  meta:\n\n    author = \"eSentire Threat Intelligence\"\n\n    description = \"Vidar Stealer with embedded DLL dependencies\"\n\n    date = \"5/2/2023\"\n\n  strings:\n\n    $s = {50 4B 03 04 14 00 00 00 08 00 24 56 25 55 2B 6D 5C 08 39 7C 05}\n\n    $a1 = \"https://t.me/mastersbots\"\n\n    $a2 = \"https://steamcommunity.com/profiles/76561199501059503\"\n\n    $a3 = \"%s\\\\%s\\\\Local Storage\\\\leveldb\"\n\n    $a4 = \"\\\\Autofill\\\\%s_%s.txt\"\n\n    $a5 = \"\\\\Downloads\\\\%s_%s.txt\"\n\n    $a6 = \"\\\\CC\\\\%s_%s.txt\"\n\n    $a7 = \"Exodus\\\\exodus.wallet\"\n\n  condition:\n\n    $s and 5 of ($a*)\n\n}\n\n## Indicators of Compromise\n\n```\n**Name** **Indicators**\n\nVidar Stealer payload 810aa0d8faf41720af07153258c05b77\n\nC2 95.217.27[.]240\n\nC2 88.198.89[.]6\n\nC2 168.119.167[.]188\n\nC2 78.46.160[.]87\n\nVidar Stealer payload 783597870319e8fc1c818c5f13e28a0d\n\n## MITRE ATT&CK\n\n|Name|Indicators|\n|---|---|\n|Vidar Stealer payload|810aa0d8faf41720af07153258c05b77|\n|C2|95.217.27[.]240|\n|C2|88.198.89[.]6|\n|C2|168.119.167[.]188|\n|C2|78.46.160[.]87|\n|Vidar Stealer payload|783597870319e8fc1c818c5f13e28a0d|\n\n|MITRE ATT&CK Tactic|ID|MITRE ATT&CK Technique|Description|\n|---|---|---|---|\n|MITRE ATT&CK Tactic Initial Access|ID T1189|MITRE ATT&CK Technique Drive-by Compromise|Description Vidar Stealer is delivered via malicious websites hosting the fake cracked or pirated software.|\n\n\n-----\n\nMITRE ATT&CK Tactic\n\nUser Execution\n\n\nID\n\nT1204.002\n\n\nMITRE\nATT&CK\nTechnique\n\nMalicious\nFile\n\n\nDescription\n\nThe user launches the malicious file\n\n|MITRE ATT&CK Tactic Virtualization/Sandbox Evasion|ID T1497.001|MITRE ATT&CK Technique System Checks|Description The stealer performs checks on “HAL9TH” or “JohnDoe” usernames that are used by Windows Defender emulator|\n|---|---|---|---|\n|MITRE ATT&CK Tactic Defense Evasion|ID T1070.004|MITRE ATT&CK Technique Indicator RemovalFile Deletion|Description Vidar Stealer deletes itself from the machine after successful execution.|\n|MITRE ATT&CK Tactic Credential Access|ID T1555 T1555.003|MITRE ATT&CK Technique Indicator RemovalFile Deletion Credentials from Password Stores Credentials from Password Stores: Credentials from Web Browsers|Description Vidar Stealer steals sensitive data from browsers including credentials, cookies and saved credit cards. It also steals SMTP, WordPress and FTP credentials.|\n\n\n-----\n\nMITRE ATT&CK Tactic\n\nDiscovery\n\nMITRE ATT&CK Tactic\n\nCollection\n\nMITRE ATT&CK Tactic\n\nExfiltration\n\n### Skip To:\n\n\nID\n\nT1033\n\nT1518\n\nT1057\n\nT1614.001\n\nT1082\n\n\nMITRE\nATT&CK\nTechnique\n\nSystem\nOwner/User\nDiscovery\n\nSoftware\nDiscovery\n\nProcess\nDiscovery\n\nSystem\nLocation\nDiscovery:\nSystem\nLanguage\nDiscovery\n\nSystem\nInformation\nDiscovery\n\n\nDescription\n\nThe stealer enumerates the host for\nthe username and hardware\ninformation, running processes and\ninstalled applications as well as\nkeyboard and display languages.\n\n|MITRE ATT&CK Tactic Collection|ID T1113|MITRE ATT&CK Technique Screen Capture|Description The stealer takes the screenshot from the infected machine and sends it to the C2.|\n|---|---|---|---|\n|MITRE ATT&CK Tactic Exfiltration|ID T1020|MITRE ATT&CK Technique Automated Exfiltration|Description The stealer automatically exfiltrates the gathered files to C2, some file grabbing options can be customized by an attacker.|\n\n\nKey Takeaways\nCase Study: Vidar Stealer\nVidar Stealer Panel Review\nVidar Stealer Binary Review\nVidar Stealer 3.6-3.7 Update\nVidar Stealer C2 Communication\nHow eSentire is Responding\nRecommendations from eSentire’s Threat Response Unit (TRU)\n\n\n-----\n\nAppendix\nYara Rule\nIndicators of Compromise\nMITRE ATT&CK\n\n[View Most Recent Blogs](https://www.esentire.com/resources/blog)\n\neSentire Threat Response Unit (TRU)\n\nOur industry-renowned Threat Response Unit (TRU) is an elite team of threat hunters and\nresearchers, that supports our 24/7 Security Operations Centers (SOCs), builds detection\nmodels across our Atlas XDR Cloud Platform, and works as an extension of your security\nteam to continuously improve our Managed Detection and Response service. TRU has been\nrecognized for its threat hunting, original research and content development capabilities.\n\n\n-----\n\nTRU is strategically organized into cross-functional groups to protect you against advanced\nand emerging threats, allowing your organization to gain leading threat intelligence and\nincredible cybersecurity acumen.\n\nCookies allow us to deliver the best possible experience for you on our website - by\ncontinuing to use our website or by closing this box, you are consenting to our use of\n[cookies. Visit our Privacy Policy to learn more.](https://www.esentire.com/legal/privacy-policy)\n\nAccept\n\n**The Authority in Managed Detection and Response.**\n\n2023 eSentire, Inc. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-09 - eSentire Threat Intelligence Malware Analysis- Vidar Stealer.pdf"
    ],
    "report_names": [
        "2023-05-09 - eSentire Threat Intelligence Malware Analysis- Vidar Stealer.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930807,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1685883545,
    "ts_modification_date": 1685883545,
    "files": {
        "pdf": "https://archive.orkl.eu/17019be0ad53e62c1ac2ac711dfd2e17d6e3d397.pdf",
        "text": "https://archive.orkl.eu/17019be0ad53e62c1ac2ac711dfd2e17d6e3d397.txt",
        "img": "https://archive.orkl.eu/17019be0ad53e62c1ac2ac711dfd2e17d6e3d397.jpg"
    }
}