{
    "id": "dc7b9973-c15a-40b3-abf0-1450f5858b99",
    "created_at": "2023-01-12T15:01:35.334612Z",
    "updated_at": "2025-03-27T02:08:40.895573Z",
    "deleted_at": null,
    "sha1_hash": "2d1d2b358b4657c5eefe557e33ecf579cefcc4d4",
    "title": "2016-07-13 - Troldesh ransomware influenced by (the) Da Vinci code",
    "authors": "",
    "file_creation_date": "2001-10-25T16:10:26Z",
    "file_modification_date": "2005-11-23T12:05:42Z",
    "file_size": 514807,
    "plain_text": "## Inter-Control Center Communications Protocol (ICCP, TASE.2): Threats to Data Security and Potential Solutions\n\n\n###### Technical Report\n\n\n-----\n\n-----\n\n### Inter-Control Center Communications Protocol (ICCP, TASE.2): Threats to Data Security and Potential Solutions\n\n**1001977**\n\nFinal Report, October 2001\n\nEPRI Project Manager\nD. Becker\n\nEPRI • 3412 Hillview Avenue, Palo Alto, California 94304 • PO Box 10412, Palo Alto, California 94303 • USA\n800.313.3774 • 650.855.2121 • askepri@epri.com • www.epri.com\n\n\n-----\n\n**DISCLAIMER OF WARRANTIES AND LIMITATION OF LIABILITIES**\n\nTHIS DOCUMENT WAS PREPARED BY THE ORGANIZATION(S) NAMED BELOW AS AN\nACCOUNT OF WORK SPONSORED OR COSPONSORED BY THE ELECTRIC POWER RESEARCH\nINSTITUTE, INC. (EPRI). NEITHER EPRI, ANY MEMBER OF EPRI, ANY COSPONSOR, THE\nORGANIZATION(S) BELOW, NOR ANY PERSON ACTING ON BEHALF OF ANY OF THEM:\n\n(A) MAKES ANY WARRANTY OR REPRESENTATION WHATSOEVER, EXPRESS OR IMPLIED, (I)\nWITH RESPECT TO THE USE OF ANY INFORMATION, APPARATUS, METHOD, PROCESS, OR\nSIMILAR ITEM DISCLOSED IN THIS DOCUMENT, INCLUDING MERCHANTABILITY AND FITNESS\nFOR A PARTICULAR PURPOSE, OR (II) THAT SUCH USE DOES NOT INFRINGE ON OR\nINTERFERE WITH PRIVATELY OWNED RIGHTS, INCLUDING ANY PARTY'S INTELLECTUAL\nPROPERTY, OR (III) THAT THIS DOCUMENT IS SUITABLE TO ANY PARTICULAR USER'S\nCIRCUMSTANCE; OR\n\n(B) ASSUMES RESPONSIBILITY FOR ANY DAMAGES OR OTHER LIABILITY WHATSOEVER\n(INCLUDING ANY CONSEQUENTIAL DAMAGES, EVEN IF EPRI OR ANY EPRI REPRESENTATIVE\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES) RESULTING FROM YOUR\nSELECTION OR USE OF THIS DOCUMENT OR ANY INFORMATION, APPARATUS, METHOD,\nPROCESS, OR SIMILAR ITEM DISCLOSED IN THIS DOCUMENT.\n\nORGANIZATION(S) THAT PREPARED THIS DOCUMENT\n\n**Hoffman Publications, Inc.**\n\n**SISCO, Inc.**\n\n**ORDERING INFORMATION**\n\nRequests for copies of this report should be directed to EPRI Customer Fulfillment, 1355 Willow Way,\nSuite 278, Concord, CA 94520, (800) 313-3774, press 2.\n\nElectric Power Research Institute and EPRI are registered service marks of the Electric Power\nResearch Institute, Inc. EPRI. ELECTRIFY THE WORLD is a service mark of the Electric Power\nResearch Institute, Inc.\n\nCopyright © 2001 Electric Power Research Institute, Inc. All rights reserved.\n\n\n-----\n\n#### CITATIONS\n\nThis report was prepared by\n\nHoffman Publications, Inc.\n16360 Monterey Road\nSuite 230\nMorgan Hill, CA 95037-5455\n\nPrincipal Investigator\nS. Hoffman\n\nSISCO, Inc.\n6605 19 ½ Mile Road\nSterling Heights, MI 48314\n\nPrincipal Investigator\nH. Falk\n\nThis report describes research sponsored by EPRI.\n\nThe report is a corporate document that should be cited in the literature in the following manner:\n\n_Inter-Control Center Communications Protocol (ICCP, TASE.2): Threats to Data Security and_\n_Potential Solutions, EPRI, Palo Alto, CA: 2001. 1001977._\n\niii\n\n\n-----\n\n-----\n\n#### REPORT SUMMARY\n\nThe ever widening use of the Inter-Control Center Communications Protocol (ICCP) protocol to\nexchange data between entities in the energy industry, coupled with the confidential, sensitive\nnature of much of this data, is giving rise to data security concerns related to ICCP use. This\nreport examines how the ICCP protocol addresses data security and summarizes data security\nthreats and recommended preliminary solutions.\n\n**Background**\nEPRI first introduced the ICCP (also known as TASE.2) to help standardize communications\nbetween control centers. ICCP applications now also include communication between control\ncenters and power plants and substations and between nodes of NERC’s Inter-regional Security\nNetwork (ISN). At last count, over 200 installations of ICCP were completed in the U.S. and in\nmany other countries at transmission companies, energy companies, and grid operators. The\nInternational Electrotechnical Commission (IEC) and the International Standards Organization\n(ISO) have adopted ICCP in the form of three international standards. ICCP uses a well-proven,\nrobust, existing standard called the Manufacturing Message Specification (MMS) for the\nmessaging service. With deregulation – and the resultant increased competition – the security of\noperational data exchanged using ICCP between control centers and other locations becomes\nincreasingly important.\n\n**Objective**\nTo provide energy companies, regional transmission organizations (RTOs), and other\nstakeholders information on the current state of data security related to ICCP use\n\n**Approach**\nThe project team gathered information from existing EPRI reports and other documentation,\nconducted interviews with experts in networking and data security, and synthesized information\nthat was relevant to ICCP data security. They prepared the report for a diverse audience—\ntechnical and non-technical middle-level managers at domestic and international energy\ncompanies, RTOs, equipment and system vendors in the energy industry, and other stakeholders.\nIndustry experts then reviewed the report for completeness and accuracy.\n\n**Results**\nThis report reviews issues associated with secure communications between energy control\ncenters and specifically addresses the role of ICCP. The report provides an introduction to ICCP\nand its applications, identifies data security threats in ICCP, covers the limited data security\nfeatures within ICCP, and discusses preliminary data security solutions that experts have\nproposed.\n\nv\n\n\n-----\n\nICCP provides access control via bilateral tables maintained on an ICCP server. This is the only\ndata security service provided within ICCP; and, to date, no additional data security services\nwithin ICCP have been proposed. The documents synthesized to prepare this report did not\nidentify specific additions of data security measures to be implemented within ICCP. The ICCP\nprotocol designers assumed that additional data security measures would be implemented in\nvarious layers of the open systems interconnection (OSI) 7-layer stack. Hence, this report\ndiscusses data security that ICCP provides via bilateral tables, briefly covers physical security,\nand provides an overview of preliminary data security solutions relevant to ICCP that experts\nhave proposed for implementation in various layers of the OSI 7-layer stack. These preliminary\nsolutions are organized according to the five types of data security services defined by the OSI\nmodel—authentication, access control, data confidentiality, data integrity, and nonrepudiation.\n\nThe report also describes a proposed system, currently in review, that defines a new Application\nService Element (ASE) called Security Transformations Application Service Element for MMS\n(STASE-MMS). Residing between MMS and the presentation layer in the OSI protocol stack,\nthe proposed system supports data security services for MMS protocol data units and MMS\nobjects. Proposers point out that this system can, in turn, secure data being communicated using\nthe ICCP protocol.\n\n**EPRI Perspective**\nEPRI has been instrumental in the development and adoption of ICCP worldwide. As use of\nICCP expands to a wider range of applications, EPRI continues to address issues of interest to\nICCP users. As a result of industry restructuring, trends that include increasing demands on the\nexisting power system, the increasing amount of confidential information exchange, and the\ngrowing number of players exchanging this information are giving rise to concerns over data\nsecurity when ICCP is used. This report is the beginning of a process in which EPRI is\nexamining data security issues relevant to ICCP and recommending security-related\nenhancements. To continue this process, EPRI plans to publish a second report with specific data\nsecurity recommendations for ICCP in 2002.\n\n**Keywords**\nControl center\nData security\nInformation security\nInter-Control Center Communications Protocol (ICCP)\nTelecontrol Application Service Element (TASE.2)\nUtility Communications Architecture (UCA)\n\nvi\n\n\n-----\n\n#### ABSTRACT\n\nIn the mid 1990s, EPRI’s Grid Operations and Planning Area brought together key members of\nthe electric industry to design a proposed standard for the interchange of control center data. At\nthat time the industry had no standards for data exchange and sharing of data was very limited\ndue to complexity/customization issues between utilities. EPRI first introduced the Inter-Control\nCenter Communications Protocol (ICCP, also known as the International Standard or TASE.2) to\nhelp standardize communications between control centers. ICCP applications now also include\ncommunication between control centers and power plants and substations and between nodes of\nNERC’s Inter-regional Security Network (ISN). Now an accepted international standard, ICCP\nuses a well-proven, robust, existing standard called the Manufacturing Message Specification\n(MMS) for the messaging service. As a result of industry restructuring, trends that include\nincreasing demands on the existing power system, the increasing amount of confidential\ninformation exchange, and the ever widening number of players exchanging this information are\ngiving rise to concerns over data security when ICCP is used. A synthesis of information from a\nvariety of reports and papers, this report provides an introduction to ICCP and its applications,\nidentifies data security threats in ICCP, describes the limited data security measures\nimplemented within ICCP, and discusses potential data security solutions relevant to ICCP that\nexperts have proposed for implementation in various layers of the OSI 7-layer stack. The report\nalso describes a proposed system, currently in review, that defines a new Application Service\nElement (ASE) called Security Transformations Application Service Element for MMS (STASEMMS). To continue the process of examining data security issues relevant to ICCP and\nrecommending data-related enhancements, EPRI plans to publish a second report with specific\ndata security recommendations for ICCP in 2002.\n\nvii\n\n\n-----\n\n-----\n\n#### ACKNOWLEDGMENTS\n\nEPRI and the report author wish to thank the following individuals for their time and aid in\nproviding information and reviewing this report:\n\nDavid Becker, EPRI, has been responsible for the development of the control center data\nexchange Standardization effort within the USA electric industry. In response to the request from\nthe International Standards Group, International Electro technical Commission (IEC), a USA\ntask force comprised of control center data exchange experts was brought together and ultimately\ndeveloped a draft of a proposed standard called ICCP This proposal was submitted to the\nWorking Group 7 of the IEC and ultimately approved within the IEC and is known by the formal\nname of TASE.2 and published as IEC 870-6-503. This USA design was the initial Standard\nproduced as part of the overall EPRI led Utility Communications Architecture (UCA) .\n\nWilliam Blair, EPRI, has been responsible for development of the Utility Communications\nArchitecture (UCA) since 1991. In addition to leading the effort to establish the UCA Users\nGroup and the UCA Test Facility, Dr. Blair is presently directly responsible for the Initiative\nfor Substation Automation and EPRI support for the development of IEC International Standards\nfor UCA. Dr. Blair supported other EPRI managers in various areas of UCA development,\nincluding Dave Becker (ICCP), Joe Hughes (distribution automation), Frank Goodman\n(distributed resources), and Joe Weiss (cyber security).\n\nHerb Falk, SISCO, Inc., has been involved in numerous projects involving the application of\ninformation systems technology and real-time communications technology to automated\nmanufacturing, electrical distribution and automation, and power quality monitoring. Mr. Falk is\na recognized expert on UCA, ICCP, and MMS, serving on and chairing numerous industry\ntechnical committees. Mr. Falk has been appointed the convenor of the IEC TC 57 Working\nGroup 15 (WG15), the scope of which is “data and communication security in the field of\nIEC/TC 57.”\n\nTerry Saxton, Xtensible Solutions, is the current editor for the ICCP standards documents and is\nthe Chief USA delegate to Working Group 7 of IEC TC 57, which is responsible for the\ndevelopment and publication of the ICCP standards. Mr. Saxton is a recognized expert on ICCP,\nhas delivered numerous courses and presentations on ICCP, and has provided consulting services\nto energy companies and vendors to assist in its deployment.\n\nDavid Becker, EPRI\n\nix\n\n\n-----\n\nIn addition to their contributions to this report, these individuals authored or managed reports on\nICCP and related topics, which served as source material for this synthesis report (see\nbibliography in section 5).\n\nx\n\n\n-----\n\n#### CONTENTS\n\n**_1 ICCP PRIMER ........................................................................................................................1-1_**\n\nIntroduction ...........................................................................................................................1-1\n\nEvolution of ICCP..................................................................................................................1-1\n\nICCP Today...........................................................................................................................1-3\n\nICCP and the Utility Communications Architecture (UCATM) .................................................1-4\n\nData Exchange Using ICCP..................................................................................................1-5\n\nICCP Applications .................................................................................................................1-5\n\nSample ICCP Application for Internal Communication..........................................................1-8\n\nNeed at GPU ..................................................................................................................1-11\n\nThe ICCP Solution at GPU.............................................................................................1-11\n\nResults of ICCP Project at GPU.....................................................................................1-13\n\nRelated Standards-Based Efforts........................................................................................1-13\n\n**_2 THREAT/VULNERABILITY IDENTIFICATION IN ICCP........................................................2-1_**\n\nSummary...............................................................................................................................2-1\n\nIntroduction ...........................................................................................................................2-1\n\nMotivation for Attacks............................................................................................................2-2\n\nFinancial Rewards............................................................................................................2-2\n\nDisgruntled Employee ......................................................................................................2-4\n\nCause Motivation..............................................................................................................2-4\n\nDemonstration of Capability .............................................................................................2-4\n\nThreat Types .........................................................................................................................2-4\n\nBypassing Controls...........................................................................................................2-4\n\nIntegrity Violation..............................................................................................................2-5\n\nAuthorization Violation......................................................................................................2-5\n\nIndiscretion by Personnel .................................................................................................2-5\n\nIllegitimate Use and Information Leakage ........................................................................2-6\n\nExample of ICCP Data Security Concers: NERC ISN..........................................................2-6\n\nxi\n\n\n-----\n\n**_3 PRELIMINARY SOLUTIONS .................................................................................................3-1_**\n\nData Security in ICCP ...........................................................................................................3-1\n\nPhysical Security...................................................................................................................3-2\n\nAuthentication .......................................................................................................................3-2\n\nAccess Control ......................................................................................................................3-3\n\nData Confidentiality ...............................................................................................................3-4\n\nData Integrity.........................................................................................................................3-4\n\n**_4 SECURING ICCP USING STASE-MMS.................................................................................4-1_**\n\nSecuring MMS.......................................................................................................................4-1\n\nSupported Security Transformations.....................................................................................4-2\n\nDefault Data Security Algorithms and Mechanisms ..............................................................4-3\n\nData Security Information Exchange.....................................................................................4-3\n\nSTASE-MMS Model ..............................................................................................................4-3\n\n**_5 BIBLIOGRAPHY ....................................................................................................................5-1_**\n\n**_A ACRONYMS ......................................................................................................................... A-1_**\n\nxii\n\n\n-----\n\n#### LIST OF FIGURES\n\nFigure 1-1 Schematic of Data Exchange. ICCP provides real-time data exchange\nbetween energy companies using a client-server model. Either the client or server\nenergy company may initiate a connection. Interactions between a client and server\nconsist of requests for information as well as the issuance of control directives.\nField devices in the domain of control center 1 may be included in the domain of\ncontrol center 2 to create an inter-domain control area. This means that ICCP\nenables extension of monitoring and control from a local, or intra-SCADA\n(Supervisory Control and Data Acquisition System) environment to an inter-SCADA\nenvironment. Source: ”IEC 1999” in bibliography ..............................................................1-4\n\nFigure 1-2 GPU’s Portland Station ICCP Network. ICCP was integrated in the corporate\nLAN/WAN station communications and ICCP nodes were established between the\ncorporate EMS and four functional units. This configuration is similar for the two\nother GPU stations. Source: “EPRI 1999” in bibliography ...............................................1-12\n\nFigure 4-1 Location of STASE-MMS in the Open Systems Interconnection (OSI) Protocol\nStack. Within the application layer, Security Transformations Application Service\nElement for MMS (STASE-MMS) resides below MMS, which operates below ICCP\n(TASE.2). ...........................................................................................................................4-1\n\nFigure 4-2 Mandatory Application Service Elements When STASE-MMS Is Used. The\nASEs available to an application process require communication over an\napplication association. The application processing the services provided by the\nAssociation Control Service Element (ACSE) control the application association.\nSource: “SISCO 1998” in the bibliography .........................................................................4-4\n\nxiii\n\n\n-----\n\n-----\n\n#### LIST OF TABLES\n\nTable 1-1 ICCP Conformance Blocks ........................................................................................1-6\n\nTable 1-2 Applications of ICCP in the United States and Europe..............................................1-7\n\nTable 1-3 ISN Data Exchange Requirements. ICCP is the primary real-time protocol for\nthe ISN. ..............................................................................................................................1-8\n\nTable 1-4 Data Exchange Requirements Between Control Centers and Power Pools or\nISOs/RTOs .......................................................................................................................1-10\n\nTable 2-1 Control Center Data Security Comparison:  Percent of Respondents\nExpressing Concern over Data Security ............................................................................2-3\n\nxv\n\n\n-----\n\n-----\n\n# 1\n#### ICCP PRIMER\n\n###### Introduction\n\nSince its initial use in the mid 1990s, ICCP (TASE.2) has become the international standard form\nof communication between energy control centers, and between control centers and power plants\nand substations. It is also the primary protocol used on NERC’s Inter-regional security network\n(ISN), is used for control center to ISO/RTO communications, and is being considered for even\nwider adoption.\n\nICCP is the most widely adopted communications protocol available to the electric power\nindustry today, with over 200 completed installations in the United States, and in many other\ncountries, at transmission companies, energy companies, and grid operators. A wide range of\nhardware and software vendors support ICCP, allowing energy companies to implement the\nprotocol inexpensively.\n\nSince ICCP is instrumental in helping energy control centers maintain a high level of power\nsystem security (i.e., reliability), discussing the data security aspects of ICCP can lead to some\nconfusion. To avoid any misunderstanding, this report refers to either power system security or\n_data security._\n\n###### Evolution of ICCP\n\nThe electric power industry uses more operating data than perhaps any other industry. Seamless\ncommunication of this information to appropriate locations smoothes the process of generating,\ntransmitting, and distributing electricity. To achieve this objective, over the years energy\ncompanies developed their own custom-designed communications protocols to facilitate\nexchange of these data from one location to another. Unfortunately, these protocols were often\ndeveloped on an as-needed basis, leading to a proliferation of proprietary, incompatible\nprotocols. Around 1980, most energy companies that possessed inter-control center\ncommunications capabilities used these proprietary, custom-developed protocols for point-topoint transmission.\n\nIn the years leading up to 1980 (before the days of independent system operators, ISOs, or\nregional transmission organizations, RTOs), North America witnessed an increase in cooperative\nenterprises such as power pools and regional centers. Industry participants needed the seamless\nexchange of data but found themselves hampered by the technical and economic limitations of\nthe available protocols.\n\n1-1\n\n\n-----\n\n_ICCP Primer_\n\nThis led two groups of energy companies, first one in the western U.S. and then later one in the\neastern U.S, to begin design of a common protocol they could all use. Their objective was to rid\nthemselves of the costly difficulties of using proprietary protocols.\n\nIn the western U.S, members of the Western Systems Coordinating Council (WSCC) initiated\nefforts in the early 1980s to develop an inter-energy company data communications standard.\nThis group succeeded in developing the initial version of what became known as the WSCC\nprotocol. Later, in the mid 1980s, a group of energy companies in the eastern United States\nformed the Inter-Utility Data Exchange Consortium (IDEC) and developed the inter-utility data\nexchange protocol. Elcom 83 and Elcom 90 were used in Europe.\n\nIEEE explains that “as the need for a unified standard became clear, the International\nElectrotechnical Commission (IEC) solicited member bodies for contributions to be considered\nfor international standardization. The lack of a consensus standard in the U.S., as well as the\nperceived limitations of all of the existing candidate protocols, led to the formation of a\nutility/vendor task force sponsored by EPRI, WSCC, IDEC, and a number of utilities. This task\nforce led development of the Intercontrol Center Communications Protocol (ICCP). The name\nwas later changed to the Telecontrol Application Service Element 2 (TASE.2) to conform to IEC\nTechnical Committee 57 Working Group 7 taxonomy.” These efforts culminated in the late\n1990s when ICCP received official status as an international standard (see “IEEE 1999” in\nbibliography for more information).\n\nWhile this effort to develop ICCP was proceeding, dramatic changes were taking place in the\nU.S. energy industry. The 1996 Federal Energy Regulatory Commission (FERC) passage of\nOrders 888 and 889 mandated “open access” to the U.S. transmission system. This and other\nlegislative and regulatory changes presented major implications for energy company\ncommunications of data. The amount and types of data exchanged between energy companies,\nbetween energy companies and new entities, and within various parts of each energy company\nexpanded dramatically. Secure wide area operation of the power system necessitated effective\ncommunication of data between energy control centers. And as ISOs began operation,\ncommunication between energy companies and these new entities became necessary. This need\nwill only increase, as the FERC continues to move aggressively forward to mandate formation of\na finite number of RTOs in the U.S.\n\nIncreasing demands on the power system have also fueled the need to effectively communicate\ndata. As wholesale transactions of power increase in magnitude and frequency, securely\noperating a power system strained by these transactions becomes increasingly challenging. In\nlight of these developments, efficient communication between involved parties to ensure secure\npower system operation becomes a necessity, rather than simply a beneficial capability.\n\nThe drive to maintain power system security amidst these changes has resulted in establishment\nof new types of systems and networks. For example, the Inter-regional Security Network (ISN)\nestablished by the North American Electric Reliability Council (NERC) provides coordinated\npower system security processes both regionally and in individual control areas. But such a\nsystem needed a way for the security coordinators and other participants to communicate needed\ndata using standard protocols.\n\n1-2\n\n\n-----\n\n_ICCP Primer_\n\nU.S. energy industry restructuring has also led to the deregulation of the power generation\nfunction in many parts of the country. The consequent buying and selling of generation assets\nhas led to new entrants in the power business, new business models in the power generation\nindustry, and other fundamental structural changes. This, in turn, has led to added complexity in\ncommunicating between energy control centers or ISOs/RTOs and these power plants.\n\nBut maintaining power system security is not the only motivation for a uniform communications\nprotocol. In order to succeed in the deregulated power generation market, energy companies look\nto curtail operating costs by improving operating efficiency and reducing maintenance\nexpenditures. Hence, communication of information must be accomplished cost effectively.\n\nICCP is meeting each of these needs for a standardized communication protocol, as well as other\nemerging applications.\n\n###### ICCP Today\n\nICCP is a modern comprehensive client/server protocol (see Figure 1-1). Data exchange\ninformation consists of real-time and historical power system monitoring and control data,\nincluding measured values, scheduling data, energy accounting data, and operator messages.\nICCP also defines a mechanism for exchanging time-critical data between locations.\n\nThe International Electrotechnical Commission (IEC) and the International Standards\nOrganization (ISO) adopted ICCP in the form of the following international standards:\n\n- TASE.2 Services and Protocol (IEC 60870-6-503)\n\n- TASE.2 Object Models (IEC 60870-6-802)\n\n- TASE.2 Application Profile (IEC 60870-6-702).\n\nICCP uses a well-proven, robust, existing standard called the Manufacturing Message\nSpecification (MMS) for the messaging service. MMS (ISO/IEC-9506) was designed to facilitate\nthe exchange of real-time application data among manufacturing and process control systems and\nis broad enough in scope to address the needs of many industry sectors.\n\nMMS is an object-oriented program, allowing organization of a complex system into a collection\nof easily understood, discrete objects that incorporate both information and behavior. This means\nthat MMS is relatively easy to implement and maintain. ICCP uses MMS objects to define\nmessages and data structures, and all ICCP operations run form these objects. Supported data\ntypes include control messages, status, analogs, quality codes, schedules, text and simple files. In\naddition to data exchange, optional functions include remote control, operator station output,\nevents, and remote program execution. Using MMS as a foundation enables use of widely\navailable telecommunications technologies, such as frame relays and ISDN lines.\n\n1-3\n\n\n-----\n\n_ICCP Primer_\n\nControl Control Centre 2\nCentre 1\n\nField Device in Field Device in\nCC1 CC2\n\nIntra-Domain Control\n\nInter-Domain Control\n\nInter-Control Centre\n.\n\n**Figure 1-1**\n**Schematic of Data Exchange. ICCP provides real-time data exchange between energy**\n**companies using a client-server model. Either the client or server energy company may**\n**initiate a connection. Interactions between a client and server consist of requests for**\n**information as well as the issuance of control directives. Field devices in the domain of**\n**control center 1 may be included in the domain of control center 2 to create an inter-**\n**domain control area. This means that ICCP enables extension of monitoring and control**\n**from a local, or intra-SCADA (Supervisory Control and Data Acquisition System)**\n**environment to an inter-SCADA environment. Source: ”IEC 1999” in bibliography**\n\n###### ICCP and the Utility Communications Architecture (UCATM)\n\nICCP is part of the Utility Communications Architecture (UCA). IEEE defines UCA as a\n“standards-based approach to utility communications that provides for wide-scale integration at\nreduced costs and solves many of the most pressing communication problems for today’s\nutilities. The UCA is designed to apply across all of the functional areas within the electric, gas,\nand water utilities. These functional areas include customer interface, distribution, transmission,\npower plant, and control centers” (see “IEEE 1999” in bibliography for more information).\n\nAs IEEE explains, the role that ICCP plays is best understood by examining the two main types\nof applications that involve exchange of real-time data acquisition and control information in the\nenergy industry:\n\n1. Access to real-time databases (e.g., supervisory control and data acquisition, or SCADA,\nsystems, and energy management systems, or EMS)\n\n2. Access to real-time devices (e.g., remote terminal units, switchgear, and meters)\n\n1-4\n\n\n-----\n\n_ICCP Primer_\n\nUCA supports access to real-time databases through ICCP (see “IEEE 1999” in bibliography for\nmore information).\n\nThe three IEEE standards for TASE.2 (IEC 60870-6-503, IEC 60870-6-802, and IEC 60870-6702) are published independently of the rest of UCA, but are included by reference in UCA\nVersion 2.0.\n\n###### Data Exchange Using ICCP\n\nData types that can be exchanged between two or more ICCP nodes include the following (see\nTable 1-1 for a complete list):\n\n- Real-time process analog and discrete control and data acquisition signals used by the\nexisting remote terminal units (RTUs) and new substation automation computers\n\n- Historical data such as average values of accumulations over time\n\n- Predefined reports\n\n- Unit forecast schedule data\n\n- Unit commitment data\n\n- Simultaneous updating of generation report requirements through utilization of a common\ndistributed database.\n\n###### ICCP Applications\n\nICCP capabilities range from linking wide-area interconnected power systems to facilitating\ninternal communications. Table 1-2 provides a list of types of ICCP communication applications,\nalong with other protocols used in each application. The types of data links (e.g., dedicated\npoint-to-point and frame relay WAN with routers) are discussed in the context of data security in\nChapter 2.\n\nLinking individual control centers with regional coordinators, ICCP enables real-time exchange\nof system data, such as MW, MVAR, kV, and breaker status, allowing instant assessment of the\ninterconnected networks. For example, the Southwest Power Pool (SPP) collects data via two\nICCP systems. As transmission security coordinator, SPP collects operational data from 17\ncontrol areas via an ICCP-compliant communications system. Data, collected within 30 seconds,\nare used to perform state estimation and power flow modeling.\n\nSPP also collects operational data from neighboring control areas with the ICCP-compliant\ncommunications system in place on the NERC ISN. Capabilities include anticipating\ncontingencies and taking both preventive measures prior to a disturbance and corrective\nmeasures in the event of a disturbance.\n\n1-5\n\n\n-----\n\n_ICCP Primer_\n\n**Table 1-1**\n**ICCP Conformance Blocks**\n\n**ICCP Conformance Block Name** **Type of Services**\n\nBlock 1 Periodic Power System Data Periodic transfer of power system data,\nincluding field device status, analog\nvalues, and accumulator values with\nquality and time stamps\n\nBlock 2 Extended Data Set Monitoring Non-periodic transfer of data, including\ndetection of system changes or integrity\ncheck performance\n\nBlock 3 Block Transfer Data Efficient transfer mechanism where\nbandwidth is at a premium\n\nBlock 4 Information Messages General message transfer mechanism,\nincluding capabilities to transfer simple\ntext or binary files\n\nBlock 5 Device Control Mechanism for transferring a request to\noperate a device from one node to\nanother\n\nBlock 6 Program Control Mechanism for ICCP client to conduct\nprogram control at a server site\n\nBlock 7 Event Reporting Extended reporting of system events at\nremote sites\n\nBlock 8 Additional User Objects Mechanism for transferring scheduling\nand accounting information, device\noutage information, and power plant\ninformation\n\nBlock 9 Time Series Data Mechanism enabling transmission of\ntime series data\n\nSource: “EPRI 1998” in bibliography.\n\nThe latter example illustrates the pivotal role ICCP plays as the only protocol used to exchange\nreal-time data between ISN nodes. The ISN is comprised of 18 security coordinator systems\ninterconnected via ICCP operating over a frame relay network. Each security coordinator is in\nturn connected to one or more control areas to obtain the electric system security data needed for\nthe security coordinators to perform operational power system security assessments and\ncoordinate reliable operations. This latter connection has no specific protocol requirements\nplaced on it. Each security coordinator is free to choose the protocols most appropriate for their\ncontrol area.\n\n1-6\n\n|ICCP Conformance Block Name|Col2|Type of Services|\n|---|---|---|\n|Block 1|Periodic Power System Data|Periodic transfer of power system data, including field device status, analog values, and accumulator values with quality and time stamps|\n|Block 2|Extended Data Set Monitoring|Non-periodic transfer of data, including detection of system changes or integrity check performance|\n|Block 3|Block Transfer Data|Efficient transfer mechanism where bandwidth is at a premium|\n|Block 4|Information Messages|General message transfer mechanism, including capabilities to transfer simple text or binary files|\n|Block 5|Device Control|Mechanism for transferring a request to operate a device from one node to another|\n|Block 6|Program Control|Mechanism for ICCP client to conduct program control at a server site|\n|Block 7|Event Reporting|Extended reporting of system events at remote sites|\n|Block 8|Additional User Objects|Mechanism for transferring scheduling and accounting information, device outage information, and power plant information|\n|Block 9|Time Series Data|Mechanism enabling transmission of time series data|\n\n\n-----\n\n_ICCP Primer_\n\nNow functional with links to all ten U.S. NERC regions, the ISN is designed to provide\ncoordinated power system security processes both regionally and within individual control areas.\nCentral to the success of the ISN is the use of ICCP as the communications highway.\n\n**Table 1-2**\n**Applications of ICCP in the United States and Europe**\n\n**ICCP Application** **Dedicated** **Frame Relay** **Internet**\n**Point-to-Point** **WAN with**\n**Routers**\n\nControl Center to Control Center ICCP, WSCC ICCP, WSCC\n(different entities)\n\nControl Center to Control Center Proprietary, ICCP Proprietary, ICCP\n(same entity)\n\nControl Center to Transmission ICCP, DNP,\nSubstation Proprietary, RTU,\nCASM\n\nControl Center to Power Plant Proprietary, RTU,\nICCP\n\nControl Center to Power Pool or ICCP, WSCC, ICCP,\nISO/RTO Proprietary, FTP, Proprietary, FTP,\nTelnet, TCP/IP, Telnet, TCP/IP,\nSQL SQL\n\nISN data exchange (node to node) ICCP\n\nISN off-line file transfer of ICCP, FTP FTP\nconfiguration data\n\nSource: modified from Table 4-1 in “EPRI 2000a” in bibliography.\n\nData exchange can take place between the following entities:\n\n- Security coordinator to other security coordinators\n\n- Control area to security coordinator\n\n- Control area to other control areas via a common security coordinator or over the ISN if\nattached to different security coordinators.\n\nThe electric system security data to be exchanged over these links is described in Table 1-3. The\ndata with specific elements identified on the right side of the table is updated and sent every ten\nminutes. The remainder of the data is updated whenever it changes and is available.\n\nISOs/RTOs present another important application of ICCP. In this case, energy companies are\nable to directly communicate with the ISO/RTO control center(s) using a standardized protocol.\nTable 1-4 identifies typical exchange requirements between a control center and a power pool or\n\n1-7\n\n|ICCP Application|Dedicated Point-to-Point|Frame Relay WAN with Routers|Internet|\n|---|---|---|---|\n|Control Center to Control Center (different entities)|ICCP, WSCC|ICCP, WSCC||\n|Control Center to Control Center (same entity)|Proprietary, ICCP|Proprietary, ICCP||\n|Control Center to Transmission Substation|ICCP, DNP, Proprietary, RTU, CASM|||\n|Control Center to Power Plant|Proprietary, RTU, ICCP|||\n|Control Center to Power Pool or ISO/RTO|ICCP, WSCC, Proprietary, FTP, Telnet, TCP/IP, SQL|ICCP, Proprietary, FTP, Telnet, TCP/IP, SQL||\n|ISN data exchange (node to node)||ICCP||\n|ISN off-line file transfer of configuration data||ICCP, FTP|FTP|\n\n\n-----\n\n_ICCP Primer_\n\nISO/RTO. The use of ICCP for most transactions, now common for data links to a power pool or\nISO/RTO from control centers, is assumed.\n\n**Table 1-3**\n**ISN Data Exchange Requirements. ICCP is the primary real-time protocol for the ISN.**\n\n**Type of Data** **Examples**\n\nTransmission Data - Status\n\n             - MW or ampere loadings\n\n             - MVA capability\n\n             - Transformer tap and phase angle settings\n\n             - Key voltages\n\nGenerator data - Status\n\n             - MW and MVAR capability\n\n             - MW and MVAR net output\n\n             - Status of automatic voltage control facilities\n\nOperating Reserve - MW reserve available within ten minutes\n\nControl Area Demand - Instantaneous\n\nInterchange - Instantaneous actual interchange with each control area\n\n             - Current interchange schedules with each control area by individual\n\nInterchange - Interchange schedules for the next 24 hours\nTransactions\n\nControl Area Error and - Instantaneous area control error\nFrequency\n\n             - Clock hour area control error\n\n             - System frequency at one or more locations in the control area\n\nSource: “EPRI 2000a” in bibliography.\n\n###### Sample ICCP Application for Internal Communication\n\nApplications of ICCP for internal communications include communication between control\ncenters that the same energy company operates. Neighboring control centers can communicate\nwith each other easily, transmitting the entire range of real-time and historical power system\nmonitoring and control data.\n\nOther internal communication needs that ICCP facilitates include communication between a\ncontrol center and transmission substations for purposes of substation control. For power plant\ncontrol from control centers, ICCP enables direct digital communication between power plant\ncontrol and central dispatch systems. Load-following commands are transmitted to selected\n\n1-8\n\n|Type of Data|Examples|\n|---|---|\n|Transmission Data|• Status • MW or ampere loadings • MVA capability • Transformer tap and phase angle settings • Key voltages|\n|Generator data|• Status • MW and MVAR capability • MW and MVAR net output • Status of automatic voltage control facilities|\n|Operating Reserve|• MW reserve available within ten minutes|\n|Control Area Demand|• Instantaneous|\n|Interchange|• Instantaneous actual interchange with each control area • Current interchange schedules with each control area by individual|\n|Interchange Transactions|• Interchange schedules for the next 24 hours|\n|Control Area Error and Frequency|• Instantaneous area control error • Clock hour area control error • System frequency at one or more locations in the control area|\n\n\n-----\n\n_ICCP Primer_\n\ngenerators via the Supervisory Control and Data Acquisition System (SCADA) network. In this\napplication, ICCP also provides for additional communications comprising outage scheduling,\nreporting of availability and real-time status reporting of emissions data, and forecasting.\n\nBy deploying ICCP for communication between control centers and power plants, power\nproducers benefit from improved accuracy, speed, and flexible response for load demands and\ntransmission grid stability. The enabling technology enables power producers to be more agile\nand responsive when business success requires quick and accurate management decisions. A\nproject at GPU illustrates the value of ICCP in this type of application.\n\n1-9\n\n\n-----\n\n_ICCP Primer_\n\n**Table 1-4**\n**Data Exchange Requirements Between Control Centers and Power Pools or ISOs/RTOs**\n\n**Application** **Data/Comments**\n\nBasic SCADA applications for data acquisition, **ICCP Block 1,2 energy management system (EMS): analogs**\nsuch as limit processing, to process data (engineering units) status, accumulators; status data\nreceived via data links same as telemetered from\nRTU\n\nNetwork status processor, drive map board **ICCP Block 1,2 to EMS: status of lines, SS buses, generation,**\ncondensers, loads, capacitors, circuit breakers, switches, tap\nchangers – down to 69 kV\nEnergy dispatch **ICCP Block 8 to Participants: log time, unit ID, block # (up to 7**\nblocks), MW, price, required action, operational flag, comments\nRegulation **ICCP Block 1,2 to Participants: MW reading to security**\ncoordinator (SC), ACE (float) to participant\nReserve **ICCP Block 8 to Participants**\nReal-time power system security – state **ICCP Block 1,2 to SC: ICCP Block 8 to participants**\nestimator, penalty factor calculations\n\nSystem alerts **ICCP Block 4 to Participants: text alarms and messages;**\nemergency procedure information; and power system restoration\nsummary\nSystem controller console messages **ICCP Block 4 bi-directional**\nLoad forecasting **ICCP Block 8 to EMS: load forecasts of participants (aggregate**\nloads); ICCP Block 1,2 or external link to EMS; weather data\nNotification of electronic tags **ICCP Block 5 to SC**\nRegulation dispatch setpoints, device control **ICCP Block 5,7 to Participants**\nGeneration event tracking information **ICCP Block 8 to EMS (transaction): generation outage report**\nwith reason and impact on capacity\nTransmission outage scheduling information **ICCP Block 8 to EMS (transaction): device name and requested**\nstart/stop time of outage\nInterchange scheduling data **ICCP Block 8 to EMS (transaction): data for establishing two-**\nparty interchange contracts, including start/stop time, name of\nparties, path name, MW values\nGeneration scheduling data **ICCP Block 8 to EMS (transaction): generating unit or schedule**\nname, and data values for associated parameters\nGeneration dispatch data **ICCP Block 8 to EMS: participants choice of previously-approved**\ngeneration schedule, including limits\nPower system restoration status **ICCP Block 8 to Participants**\nAccounting data report **ICCP Block 8 bi-directional: hourly accounting data from**\nparticipants is compiled and balanced, and a summary report\nreturned\nLine/transformer limits **ICCP Block 8 to EMS: normal, load dump, short term, and long**\nterm limit values\nAGC regulation capacity report **ICCP Block 8 to Participants: amount of regulation by type**\nassigned to each generating unit\nContingency status report **ICCP Block 8 to Participants: list of primary lines impacted by a**\ncontingency and the affect on flow\nLines out of service report **ICCP Block 8 to Participants: name of line and voltage level for**\neach critical line out of service\nTransmission overload report **ICCP Block 8 to Participants: actual, trend, and contingency**\noverloads\nLoad Summary **ICCP Block 8 to Participants: summary of current loads**\nSource: “EPRI 2000a” in bibliography.\n\n1-10\n\n|Table 1-4 Data Exchange Requirements Between|Control Centers and Power Pools or ISOs/RTOs|\n|---|---|\n|Application|Data/Comments|\n|Basic SCADA applications for data acquisition, such as limit processing, to process data received via data links same as telemetered from RTU|ICCP Block 1,2 energy management system (EMS): analogs (engineering units) status, accumulators; status data|\n|Network status processor, drive map board|ICCP Block 1,2 to EMS: status of lines, SS buses, generation, condensers, loads, capacitors, circuit breakers, switches, tap changers – down to 69 kV|\n|Energy dispatch|ICCP Block 8 to Participants: log time, unit ID, block # (up to 7 blocks), MW, price, required action, operational flag, comments|\n|Regulation|ICCP Block 1,2 to Participants: MW reading to security coordinator (SC), ACE (float) to participant|\n|Reserve|ICCP Block 8 to Participants|\n|Real-time power system security – state estimator, penalty factor calculations|ICCP Block 1,2 to SC: ICCP Block 8 to participants|\n|System alerts|ICCP Block 4 to Participants: text alarms and messages; emergency procedure information; and power system restoration summary|\n|System controller console messages|ICCP Block 4 bi-directional|\n|Load forecasting|ICCP Block 8 to EMS: load forecasts of participants (aggregate loads); ICCP Block 1,2 or external link to EMS; weather data|\n|Notification of electronic tags|ICCP Block 5 to SC|\n|Regulation dispatch setpoints, device control|ICCP Block 5,7 to Participants|\n|Generation event tracking information|ICCP Block 8 to EMS (transaction): generation outage report with reason and impact on capacity|\n|Transmission outage scheduling information|ICCP Block 8 to EMS (transaction): device name and requested start/stop time of outage|\n|Interchange scheduling data|ICCP Block 8 to EMS (transaction): data for establishing two- party interchange contracts, including start/stop time, name of parties, path name, MW values|\n|Generation scheduling data|ICCP Block 8 to EMS (transaction): generating unit or schedule name, and data values for associated parameters|\n|Generation dispatch data|ICCP Block 8 to EMS: participants choice of previously-approved generation schedule, including limits|\n|Power system restoration status|ICCP Block 8 to Participants|\n|Accounting data report|ICCP Block 8 bi-directional: hourly accounting data from participants is compiled and balanced, and a summary report returned|\n|Line/transformer limits|ICCP Block 8 to EMS: normal, load dump, short term, and long term limit values|\n|AGC regulation capacity report|ICCP Block 8 to Participants: amount of regulation by type assigned to each generating unit|\n|Contingency status report|ICCP Block 8 to Participants: list of primary lines impacted by a contingency and the affect on flow|\n|Lines out of service report|ICCP Block 8 to Participants: name of line and voltage level for each critical line out of service|\n|Transmission overload report|ICCP Block 8 to Participants: actual, trend, and contingency overloads|\n|Load Summary|ICCP Block 8 to Participants: summary of current loads|\n\n\n-----\n\n_ICCP Primer_\n\n**_Need at GPU_**\n\nAs documented in “EPRI 1999” in the bibliography, the GPU Demonstration Project deployed\nICCP for connecting power plant control systems to the organization’s energy management\nsystem. The organization lacked a standard communications link between the generating units\nDCS, the central dispatching systems energy management control system, the corporate client\nserver environment, and the legacy corporate mainframe. Each of these systems contained data\ngenerated by one or more of the other systems. Unit control and financial data were transmitted\nthroughout the organization, often over public data paths. Access to this data by a competitor\nwould jeopardize the company’s competitive edge, and data security was a critical issue.\n\nThe GPU energy management system (EMS) is located in a corporate facility separate from the\nelectric generating stations. This project linked the EMS to three different plants with the\nfollowing DCSs:\n\n- Conemaugh Station with a Honeywell DCS\n\n- Portland Station with a Westinghouse DCS\n\n- Shawville Station with a Bailey DCS\n\nThe primary objective of the project was integrating the corporate power plant process data to\nthe client server environment. A secondary objective was to demonstrate the ability to exchange\ndata between different DCS systems over the WAN. Because of the geographic differences\nbetween the plan locations, as well as the heterogeneous DCS systems, a detailed risk analysis\nwas required to validate that the LAN/WAN was secure.\n\n**_The ICCP Solution at GPU_**\n\nThe system implemented was based on the hierarchical control functions performed in each of\nthe modules. A spatial model was developed based on the objective tree of the project. The shortterm objective focused on delivering an operational communications systems based on the longterm needs of the organization. This prototype system delivered capability for data exchange\nfunctionality between the various DCS and the EMS. This functional operation was selected to\nvalidate the life-cycle methodology and provide immediate benefit to the organization.\n\nThe initial phase of the project established the ICCP digital link between the EMS and DCS. The\nproject team developed and established all necessary interfaces for exchanging the required data\nover the ICCP links, whether analog, discrete, or object format. This was followed by\nimplementation of the selected applications to demonstrate viability of the enabling technology.\nFigure 1-2 illustrates implementation of the ICCP network at one of the GPU stations.\n\n1-11\n\n\n-----\n\n|ture ICCP erconnectio ture ICCP erconnectio ture ICCP erconnectio|Col2|CP rconnection CP rconnection CP rconnection|\n|---|---|---|\n|FFFuuu IIInnnttt||IIICCCCCC IIInnnttteee|\n||||\n\n\n-----\n\n_ICCP Primer_\n\nThe team anticipated the following results from the study:\n\n- Reduced dependence on verbal communication between the dispatching center and unit\ncontrol rooms, resulting in an expected cost-saving of five man-hours per month during peak\nsystem coordination.\n\n- Elimination of RTUs at the stations, reducing the station book value by approximately\n$65,000 and associated O&M costs by 40 man-hours per year.\n\n- Reduction in Lost Generation Report Accounting development time by two man-hours per\nmonth.\n\n- Relief of 45 man-hours per month for the Group Shift supervisor due to automation of the\nDaily Status Report.\n\n**_Results of ICCP Project at GPU_**\n\nBoth of the objectives for this project – integrating corporate power plant process data to the\nclient server environment and exchanging data between two different DCS systems over the\nWAN – were met. The project demonstrated through the use of selected applications the ability\nto transmit/receive data and objects for information exchange and unit dispatch control between\ndissimilar systems. In addition, GPU found that integration through a standard protocol such as\nICCP enabled greater efficiency and improved production while reducing costs.\n\nThe project team found the ICCP system easy to install. When configuring an ICCP connection,\nprecise spelling (including case) is critical. Most of the problems encountered during installation\nwere due to minor configuration errors. Databases on both the Honeywell PHD and Siemen’s\nICCPNT were easy to configure and maintain. The Honeywell receiver data interfaces (RDIs)\nwere easily configured into the system and provided a good method of exacting data from the\nvarious DCS. The LAN connection could be either Ethernet or Token Ring. With NT-based PCs,\nHoneywell’s PHD and RDIs, and Siemen’s ICCPNT, the team found that they could transmit\ndata to almost any system with minimal effort.\n\n###### Related Standards-Based Efforts\n\nICCP is not the only state-of-the-art, standards-based control center tool. While ICCP serves as\nthe standard for communication of data, two sets of standards-based approaches EPRI also\nhelped initiate--the Control Center Application Program Interface (CCAPI) and Common\nInformation Model (CIM)--provide a standard interface and standard model format for exchange\nof data between control centers.\n\nThe CCAPI is essentially a standardized interface that enables users to integrate applications\nfrom various sources by specifying the data that applications will share and how they will share\nit. The heart of the CCAPI, the CIM defines the essential structure of a power system model in\norder to provide a common language for information sharing among applications. This common\nlanguage reduces the number of needed software translators between applications. Furthermore,\nas vendors develop new applications, developing internal and external data structures in\n\n1-13\n\n\n-----\n\n_ICCP Primer_\n\nThe team anticipated the following results from the study:\n\n- Reduced dependence on verbal communication between the dispatching center and unit\ncontrol rooms, resulting in an expected cost-saving of five man-hours per month during peak\nsystem coordination.\n\n- Elimination of RTUs at the stations, reducing the station book value by approximately\n$65,000 and associated O&M costs by 40 man-hours per year.\n\n- Reduction in Lost Generation Report Accounting development time by two man-hours per\nmonth.\n\n- Relief of 45 man-hours per month for the Group Shift supervisor due to automation of the\nDaily Status Report.\n\n**_Results of ICCP Project at GPU_**\n\nBoth of the objectives for this project – integrating corporate power plant process data to the\nclient server environment and exchanging data between two different DCS systems over the\nWAN – were met. The project demonstrated through the use of selected applications the ability\nto transmit/receive data and objects for information exchange and unit dispatch control between\ndissimilar systems. In addition, GPU found that integration through a standard protocol such as\nICCP enabled greater efficiency and improved production while reducing costs.\n\nThe project team found the ICCP system easy to install. When configuring an ICCP connection,\nprecise spelling (including case) is critical. Most of the problems encountered during installation\nwere due to minor configuration errors. Databases on both the Honeywell PHD and Siemen’s\nICCPNT were easy to configure and maintain. The Honeywell receiver data interfaces (RDIs)\nwere easily configured into the system and provided a good method of exacting data from the\nvarious DCS. The LAN connection could be either Ethernet or Token Ring. With NT-based PCs,\nHoneywell’s PHD and RDIs, and Siemen’s ICCPNT, the team found that they could transmit\ndata to almost any system with minimal effort.\n\n###### Related Standards-Based Efforts\n\nICCP is not the only state-of-the-art, standards-based control center tool. While ICCP serves as\nthe standard for communication of data, two sets of standards-based approaches EPRI also\nhelped initiate--the Control Center Application Program Interface (CCAPI) and Common\nInformation Model (CIM)--provide a standard interface and standard model format for exchange\nof data between control centers.\n\nThe CCAPI is essentially a standardized interface that enables users to integrate applications\nfrom various sources by specifying the data that applications will share and how they will share\nit. The heart of the CCAPI, the CIM defines the essential structure of a power system model in\norder to provide a common language for information sharing among applications. This common\nlanguage reduces the number of needed software translators between applications. Furthermore,\nas vendors develop new applications, developing internal and external data structures in\nconformance with the CIM eliminates the need for software translators altogether (see “EPRI\n2000b” in bibliography for more information).\n\n1-13\n\n\n-----\n\n# 2\n#### THREAT/VULNERABILITY IDENTIFICATION IN ICCP\n\n###### Summary\n\nThe major threats to control center data security are bypassing controls, integrity violation,\nauthorization violation, indiscretion by personnel, illegitimate use, and information leakage.\nMotivations for control center attacks include disgruntled current or previous employees (who\ninitiate 80 percent of all data security attacks), financial rewards, “causes,” and the ability to\ndemonstrate capability. NERC has identified malicious external hackers, disgruntled employees,\nunintentional employee errors, and “trusted” external users as the four general threats to the\nInter-regional Security Network (ISN).\n\n###### Introduction\n\nWhenever a system is designed to exchange data among various entities, including the use of\nICCP, the focus on data security issues is important. In the case of the GPU example of ICCP\napplication at the end of chapter 1, project investigators conducted a risk analysis for the project.\nThis analysis identified threats that relate to ICCP from the following categories:\n\n- Intentional human intervention – the deliberate disruption of control of the data link. While\nthe source of this type of intrusion is usually within the organization, knowledgeable outside\nhackers also fall into this category.\n\n- Accidental human intervention – the accidental or procedural failure by which an individual\nis able to access the data link.\n\n- Physical threats – a category that might cause faulty data or physical loss of equipment and\nservices.\n\n- Natural threats such as storms and fires.\n\nOf the four threats the team identified, the first two relate to data security, and the third threat\nrelates to physical security. Although little publicly available information exists on attacks on\nenergy company communication systems, this does not rule out the possibility that such attacks\nare taking place. For example, many energy companies may not be aware that such attacks are\noccurring or may opt not to disclose these events—both of which are endemic in other industries.\n\nAs more data is transmitted outside the physical control center, the acquisition of such\ninformation by hackers, disgruntled employees, or terrorists increases in possibility. The\nlikelihood of such threats leading to problems also increases as the financial motivation rises\n\n2-1\n\n\n-----\n\n_Threat/Vulnerability Identification in ICCP_\n\n(due to the ability to profit from power market information) and the ease of conducting attacks\nrises (due to technological advances and easy access online to hacking tools).\n\nAccording to a recent EPRI survey (EPRI 2000a) of energy companies and vendors regarding\ncurrent communication security practices, the main threats to control center data security are in\nthe following areas (in order, most likely threats first, with percent of respondents listing the\nthreat in parentheses):\n\n- Bypassing controls (42 percent)\n\n- Integrity violation -- interception and/or alteration (40 percent)\n\n- Authorization violation (38 percent)\n\n- Indiscretion by personnel (35 percent)\n\n- Illegitimate use and information leakage (32 percent)\n\nNone of the perceived threats currently cause widespread concern among end-users, although\nconcern about data security threats increases as the size of the energy company increases\n(according to peak load). Table 2-1 compares the percent of all respondents (“aggregate\nresponse”) expressing concern about data security threats with the percent of respondents from\nlarge energy companies expressing this concern (data based on 160 respondents). For\ntechnologies currently in use that are relevant to ICCP, Table 2-1 also illustrates the type of data\nsecurity risks that control centers face, according to the survey. As communication outside of the\ncontrol center via the Internet and WAN connections increases, so do potential data security\nexposures.\n\nThe survey also found that hackers and disgruntled employees are the highest perceived intruder\nthreats to the control center, while competitors and terrorists are of concern among fewer\nrespondents. After summarizing the motivations for attacks on control centers, this chapter\nexamines each of the individual data security threats and vulnerabilities that are relevant to\nICCP.\n\n###### Motivation for Attacks\n\nMotivations for data security attacks on portions of energy companies’ and other players’\ninfrastructures that are relevant to ICCP range from financial gain to mayhem. The following\nmotivations are discussed in order of importance.\n\n**_Financial Rewards_**\n\nIn the deregulated energy industry, advance information on outages or lower than predicted\navailable power would represent a financial advantage to the traders of wholesale power. Such\nadvance information could allow traders to reap millions of dollars of revenue per transaction.\n\n2-2\n\n\n-----\n\n_Threat/Vulnerability Identification in ICCP_\n\n**Table 2-1**\n**Control Center Data Security Comparison:**\n**Percent of Respondents Expressing Concern over Data Security**\n\n**Aggregate** **Large** **Conclusion**\n**Response** **Energy**\n**(percent)** **Companies**\n\n**(percent)**\n\nEquipment attached to The aggregate responses reflect\nmodems usage of older technology.\n\nNT Servers 31 40\n\nUNIX Servers 27 35\n\nASCII terminals 23 15\n\nTerminal servers 21 25\n\nPotential exposure due 50 44 Although the technology used is\nto non-secure different, the amount of exposure is\nconnected devices similar between the aggregate\n\nresponses and the larger utilities.\n\nWAN connections in 33 73\nuse\n\nWAN support for 51 57 Larger utilities will be more exposed\nTCP/IP to Internet security threats.\n\nFirewall protecting 48 40 Aggregate response represents best\nWAN (of those utilities case scenario.\nresponding with WAN\nconnectivity\n\nPerson assigned to 80 35\nmanage firewall\n\nExposure due to firewall 62 65\nissues\n\nSource: modified from Table 2-1 in “EPRI 2000a” in bibliography\n\nHowever, the financial rewards of eavesdropping are directly related to the timeliness of the\ninformation. “Fresher” information yields higher potential financial rewards. Therefore, the part\nof the appropriate data security objective to combat this threat is to protect the information\nduring the time period over which the information has value. For example, the fact that surplus\ngeneration is available for the next hour should be protected for a relatively short period of time\n– about five minutes. Disclosure into the appropriate channels would occur rapidly in order for\nthe surplus power to be sold, and data security is required only until the information is disclosed\n\n2-3\n\n|Col1|Aggregate Response (percent)|Large Energy Companies (percent)|Conclusion|\n|---|---|---|---|\n|Equipment attached to modems|||The aggregate responses reflect usage of older technology.|\n|NT Servers|31|40||\n|UNIX Servers|27|35||\n|ASCII terminals|23|15||\n|Terminal servers|21|25||\n|Potential exposure due to non-secure connected devices|50|44|Although the technology used is different, the amount of exposure is similar between the aggregate responses and the larger utilities.|\n|WAN connections in use|33|73||\n|WAN support for TCP/IP|51|57|Larger utilities will be more exposed to Internet security threats.|\n|Firewall protecting WAN (of those utilities responding with WAN connectivity|48|40|Aggregate response represents best case scenario.|\n|Person assigned to manage firewall|80|35||\n|Exposure due to firewall issues|62|65||\n\n\n-----\n\n_Threat/Vulnerability Identification in ICCP_\n\nproperly. This approach is valuable because limited protection of information is much easier to\naddress than perpetual protection.\n\nAs with capital equipment, the value of information typically decreases with time. While an\nexpired login password has no value, a one-year generation schedule may represent significant\nvalue. Therefore, control centers managers should determine the time period during which each\ndata type has value.\n\n**_Disgruntled Employee_**\n\nCurrent or previous employees initiate 80 percent of all data security attacks. Abuse by current\nemployees with appropriate access to information is difficult to prevent. However, effective\ncorporate security policies include provisions for restricting access by previous employees.\nBecause assigning a general username/password alone for employee remote login requires that\nthe username/password be changed whenever an employee departs, administrators are\nincreasingly assigning specific username/passwords or combining two authentication methods\n(e.g., a password and a token).\n\n**_Cause Motivation_**\n\nReligion, politics, and other closely held beliefs might motivate attacks on control centers.\nDepending upon the level of motivation, the “cause” could manifest itself in disruption,\nrendering of certain assets useless, or extensive damage and cost.\n\n**_Demonstration of Capability_**\n\nIndividuals may cause disruption and damage as a way to demonstrate their capability and\npower.\n\n###### Threat Types\n\n**_Bypassing Controls_**\n\nRecent FERC orders and industry restructuring have unwittingly created financial incentives for\naccessing operational cost data maintained in control center EMS systems. Hackers, disgruntled\nemployees (or ex-employees) or competitors may bypass authentication and computer access\ncontrol schemes for the purpose of obtaining confidential data for financial gain and/or\nmodifying data to sabotage power system operations. In the case of ICCP, this involves\nbypassing the bilateral table form of access control built into ICCP (see Section 3). Hackers may\nalso be able to gain access to data that use ICCP by accessing MMS directly.\n\n2-4\n\n\n-----\n\n_Threat/Vulnerability Identification in ICCP_\n\n**_Integrity Violation_**\n\nAn unauthorized user could send false information to the EMS by tapping into an ICCP network\nor SCADA network. The false data would appear as valid data sent from an RTU. This could\ncause a control center EMS operator to take incorrect actions (e.g., in response to a false out-oflimit measurement reading, or a false trip reading fro a circuit breaker). Unless the operator took\nan inappropriate action, no harm would occur to the power system.\n\nSimilarly, an unauthorized user could tap into an ICCP or SCADA network and send false\ninformation to a substation or power plant. In the case of a substation, this could cause breakers\nor switches to open or close, causing local outages, or even wide area blackouts in critical\ntransmission substations. In the case of a power plant, consequences could include improperly\nchanging a set point on a generator.\n\nFor an integrity violation to occur, the data would need to be modified at one of the following\nlocations:\n\n- The EMS/SCADA database and/or ICCP clients/servers in a control center\n\n- SCADA master or substation computer in the substation\n\n- The control system computer in the power plant.\n\n- The data circuit between the control center and substation, power plant, or other control\ncenter.\n\n**_Authorization Violation_**\n\nUnauthorized users could obtain access to data and/or software. This threat could result from a\ntrusted, external source who has gained certain access rights, but who has violated the access\nrights granted. Control centers that rely on physical security and authentication, and ICCP alone,\nwhich relies only on built-in bilateral table access control, are vulnerable.\n\n**_Indiscretion by Personnel_**\n\nThe following types of inadvertent mistakes by employees can impact system operations and\nnetwork reliability:\n\n- Data entry error\n\n- Inadvertent disclosure of confidential data (e.g., via improper disposal methods)\n\n- Incorrect system command entry\n\n- Changes to software source code\n\nThere is a high vulnerability to indiscretion at most control centers. Data entry errors and\ninadvertent disclosure by enabling garbage diving represent the most prevalent types of\npersonnel indiscretion.\n\n2-5\n\n\n-----\n\n_Threat/Vulnerability Identification in ICCP_\n\n**_Illegitimate Use and Information Leakage_**\n\nIllegitimate use and information leakage, which compromises the confidentiality of sensitive\ninformation, is a key threat for ISOs/RTOs. Cost, scheduling, and outage data transmitted\nbetween control centers are potential targets for illegitimate use.\n\n###### Example of ICCP Data Security Concers: NERC ISN\n\nThe NERC ISN uses ICCP exclusively for real-time data exchange. ICCP is also used (along\nwith ftp) to transmit configuration data via off-line file transfer.\n\nFrom a communication security perspective, the following are known security requirements for\nthe NERC ISN:\n\n- Integrity and accuracy of operational data\n\n- Confidentiality of data, especially ensuring that purchasing/selling entities in the wholesale\nmerchant community are not able to access the operational data.\n\nNERC has identified the following four general threat sources to the ISN:\n\n- Malicious, external hacker\n\n- Disgruntled employee\n\n- Unintentional employee error\n\n- “Trusted” external user\n\nPotential damage resulting from these threats depends upon the extent of the intrusion or error\nand ranges from a brief loss of system functionality to database or software corruption that\nresults in extended loss of availability and lengthy recovery. Database content alteration could\npropagate invalid information to critical decision support systems and potentially disrupt power\ngrid operations.\n\nBased on these general data security requirements, range of threat sources, and serious potential\nconsequences of intrusion or error, examining data security provisions in ICCP is warranted to\nprotect the ISN alone. Consideration of the additional uses of ICCP in a range of energy\ncompany communication applications listed in Table 1-2 reinforces this conclusion.\n\n2-6\n\n\n-----\n\n# 3\n#### PRELIMINARY SOLUTIONS\n\nICCP provides access control via bilateral tables maintained on an ICCP server. This is the only\ndata security service provided within ICCP. To date, no additional data security services within\nICCP have been proposed. Further, documents synthesized to prepare this report did not identify\nspecific additions of data security measures to be implemented within ICCP. The ICCP protocol\ndesigners assumed that additional data security measures—such as authentication to ensure users\nare who they say they are and encryption to ensure data integrity—would be implemented in\nvarious layers of the OSI 7-layer stack.\n\nBased on information presented in “EPRI 2000a” in the bibliography, this chapter discusses data\nsecurity that ICCP provides via bilateral tables, briefly covers physical security, and provides an\noverview of preliminary data security solutions that can be implemented in various layers of the\nOSI 7-layer stack. These preliminary solutions are organized according to the five types of data\nsecurity services defined by the OSI model—authentication, access control, data confidentiality,\ndata integrity, and nonrepudiation. The solutions covered in this chapter are preliminary; EPRI\nplans to publish a second report with specific data security recommendations for ICCP in 2002.\n\n###### Data Security in ICCP\n\nICCP specifies access control through the use of bilateral tables defined for each client/server\nassociation. Clearly specified in IEC 60870-6-503 (ICCP Services and Protocol), bilateral tables\nprovide execute, read/write, read-only, or no access for each item that can be requested by a\nclient. The server checks each client request to verify that the client has access rights to the data\nor capability requested. An ICCP client can view only data pre-approved and listed in these\ntables. Either a client or a server can initially establish an association, and an established\nassociation can be used by either a client or server application, independent of how the\nassociation was established. The Protocol Implementation Conformance Statement (PICS)\nperformance specifies how associations are used in ICCP actual configurations.\n\nImplementation, including the management and maintenance of these tables, is a “local\nimplementation issue.” As a result, each vendor that markets a product based on ICCP can\nchoose how to implement the bilateral tables, including the type of operator interface provided.\nThis means that an actual physical table is not required, as long as the functionality is\nimplemented according to the ICCP specification.\n\nIn some cases, ICCP users may decide not to use the data security mechanisms provided through\nbilateral tables (e.g., ICCP use between two regional control centers within the same energy\ncompany). One way to handle this is to provide the same access to all control center objects in\n\n3-1\n\n\n-----\n\n_Preliminary Solutions_\n\nthe Virtual Control Center to any client. However, the protocol operations and actions defined in\nthe ICCP specifications must be implemented to ensure interoperability.\n\n###### Physical Security\n\nPhysical security is important to control access to devices that can, in turn, enable access to data\nbeing exchanged using ICCP. The majority of the respondents to the EPRI survey on control\ncenter security indicated that their control centers were physically secure. However, recent\ninvasions and malicious destruction of control center equipment by ex-employees has\ndemonstrated that procedures used to enforce this security are often missing or ignored.\n\nIn addition, a large percentage of the respondents indicated that the garbage of the control center\nis not secure and that it is removed by non-bonded services. This allows for the threat of\ninformation leakage through what is commonly called “garbage diving.”\n\nAlthough measures that block physical access to control centers and control center data are an\nimportant component of a data security program, a detailed discussion is beyond the scope of this\nreport.\n\n###### Authentication\n\nOne of the five types of data security services that the OSI model defines, authentication services\nverify the identity of a user or entity and are usually performed when a connection is established.\nAccess requests to the ICCP server may originate from an individual within the control center or\nfrom an entity at a remote location.\n\nThe following services can be used to authenticate individuals seeking to access a network that\nuses ICCP:\n\n- **Passwords. Passwords can be required for each host and for individual applications. In a**\ndistributed computing environment, a directory service can provide a single entry point for\nall distributed services, avoiding the need for a separate password for each service.\n\n- **Key cards. Key cards are especially useful for challenge-and-response authentication**\ntechniques. Commonly used on EMS operator consoles to gain access, key cards are a more\nsecure form of individual authentication than usernames/passwords.\n\n- **Biometrics. The next level of individual authentication, biometrics incorporate information**\nabout physical characteristics such as signatures, fingerprints, voiceprints, eye prints.\n\nIn some cases, individual authentication procedures involve combinations of these techniques,\nincorporating information that you know (e.g., a password) with something you have (e.g., a key\ncard or physical characteristic).\n\n3-2\n\n\n-----\n\n_Preliminary Solutions_\n\nThe following services can be used to verify the identity of an entity seeking access to a network\nusing ICCP:\n\n- **Private key technology or public key technology (i.e., public key infrastructure, PKI).**\nAfter ICCP users create a connection and establish an association, these technologies enable\nentities to authenticate themselves using a digital certificate issued from a trusted source.\n\n- **UCA 2.0 ACSE. The Utility Communications Architecture (UCA) Version 2.0 profile**\ndocument specifies the use of the OSI layer 7 Association Control Service Element (ACSE)\nAuthentication-value parameter.\n\n###### Access Control\n\nAfter authenticating the identity of individuals or entities, the next step in the OSI security model\nis access control, which controls what information the users is authorized to access and what\nactions the users is permitted to enact (e.g., read, write and/or execute). Alternative mechanisms\nto provide access control for individuals include the following:\n\n- **Access control lists. For example, UNIX file systems can restrict access privileges to the**\nuser ID of the owner, a workgroup, or all users, but fall short of the full functionality of\naccess control lists, which define access privileges for each individual user for each system\nresource. Most UNIX vendors offer optional software to provide access control lists.\n\n- **Passwords. Passwords are a form of access control, when used by individual applications**\nsuch as EMS consoles.\n\nIn addition to access control lists, access control techniques for remote entities include the\nfollowing:\n\n- **Bilateral tables. Bilateral tables in ICCP provide limited access control, and must be**\ncoupled with an authentication service when a connection is first established between client\nand server.\n\n- **Router. The filtering capability of a router, which can restrict access by address (destination**\nor source IP address and port for TCP/IP networks), provides another type of access control.\nPacket filtering provides a way to build a firewall around a specific network or system. This\ntechnique typically is used internally (e.g., to restrict access to the real-time EMS/SCADA\nsystem from devices not on the real-time EMS LAN). A router can also be used to restrict\nexternal access from the Internet, although a gateway offers better protection.\n\n- **Gateway. Some types of application-level gateways or “proxies” can provide more robust**\nprotection for vital system resources against intentional or inadvertent intrusion. When used\nas the link to the Internet, the gateway is configured like a router, except that it appears as an\nend system to the Internet. Such a gateway limits the types of TCP connections permitted\nfrom outside the gateway to the control center networks, while permitting more possibilities\nfor control center personnel to access external systems. A gateway is more secure than a\nrouter, but less convenient for users and has the potential to become a bottleneck due to\nlower performance.\n\n3-3\n\n\n-----\n\n_Preliminary Solutions_\n\n- **Firewall. Increasingly sophisticated firewalls typically combine most of the data security**\nfeatures described above and incorporate additional features. A recent EPRI report\nrecommended the following key capabilities of firewalls in a control center environment:\n\n– Packet filtering in order to restrict access based on both source and destination IP\naddresses\n\n– Application-layer proxy capability\n\n– Ability to guard against IP spoofing (i.e., would-be intruder outside the firewall\nconfigures its machine with IP addresses on the internal EMS LAN)\n\n– Protection against denial-of-service attacks (e.g., by rejecting packets identified as\npart of such an attack)\n\n– Performance of network address translation, enabling the control center to hide IP\naddresses used on the internal EMS LAN from external view\n\n– Comprehensive logging capability to log break-in attempts\n\n– Notification via pager and/or email when a break-in attempt is detected\n\n– Remote management\n\n– Granular management to prevent the attack response from denying communication\nservices to legitimate users (e.g., both source and destination address-based filtering,\nport-based filtering, and protocol-based filtering).\n\n###### Data Confidentiality\n\nData confidentiality is concerned with protecting data from unauthorized disclosure. Available\nalternatives include the following:\n\n- Physical protection, such as installing transmission media through conduit or observed areas\nto prevent tapping.\n\n- Security routing, which specifies selected routes for routers to use when routing packets. This\npermits the use of only certain links, such as privately owned links, when sending sensitive\ndata between sites. This feature requires OSI network layer software to accept such routing\ninformation. ICCP uses this feature.\n\n- Encryption with the DES standard.\n\n###### Data Integrity\n\nData integrity services ensure that no modification, insertion, or deletion of data can occur in\neither the entire message or in selected fields. Typically this is done at higher layers in the\nprotocol stack, such as layers 4 or 7. Some protection is provided through standard error\ndetecting algorithms, such as cyclic redundancy codes (CRC) in layer 2.\n\n3-4\n\n\n-----\n\n# 4\n#### SECURING ICCP USING STASE-MMS\n\n###### Securing MMS\n\nThis chapter summarizes a proposed system described in “SISCO 1998” in the bibliography,\ncurrently in review, that defines a new Application Service Element (ASE) called Security\nTransformations Application Service Element for MMS (STASE-MMS). Residing between\nMMS and the presentation layer in the OSI protocol stack, the proposed system supports data\nsecurity services for MMS protocol data units (PDUs, which are packets that contain structured\nmessage content) and MMS objects. The system can, in turn, secure data being communicated\nusing the ICCP protocol (see Figure 4-1).\n\n## ICCP (TASE.2) MMS\n\n##### 7 Application\n\n## STASE-MMS\n\n##### 6 Presentation\n\n 5 Session\n\n 4 Transport\n\n 3 Network\n\n 2 Data Link\n\n 1 Physical\n\n**Figure 4-1**\n**Location of STASE-MMS in the Open Systems Interconnection (OSI) Protocol Stack.**\n**Within the application layer, Security Transformations Application Service Element for**\n**MMS (STASE-MMS) resides below MMS, which operates below ICCP (TASE.2).**\n\nThe proposed system provides an approach for performing security transformations (STs).\nSecurity transformations are used to provide security services such as peer entity authentication,\ndata origin authentication, confidentiality, integrity, and non-repudiation. STs include\nencryption, hashing, digital seals, and digital signatures. STASE-MMS makes use of the\nAssociation Control Service Element (ACSE) (layer 7) and adds additional transformation\n\n4-1\n\n\n-----\n\n_Securing ICCP Using STASE-MMS_\n\nfunctions within the Presentation layer (layer 6). Otherwise, no other security enhancements are\nrequired for layers 1 through 5 of the communications stack. STASE-MMS is an implementation\nof several options specified by the Generic Upper Layers Security (GULS) standard.\n\nICCP uses MMS as its messaging service, and STASE-MMS was developed with ICCP in mind.\n\n###### Supported Security Transformations\n\nSTASE-MMS is an application service element that provides the transformations necessary for\nsecure transfer of MMS PDUs. In addition, STASE-MMS provides a means for exchanging\ninformation regarding the data security being provided. A request from MMS on the transmitting\nside invokes STASE-MMS, and STASE-MMS provides an indication to MMS on the receiving\nside. Both the request and the indication contain the MMS PDU being protected, as well as\n(optionally) information regarding the type of data security being provided.\n\nSTASE-MMS protects MMS PDUs by applying selected security transformations to whole\nMMS PDUs encoded with the Distinguished Encoding Rules (DERs). STASE-MMS supports\nthe following STs:\n\n- **Confidential: The DER-encoded MMS PDU is encrypted for privacy protection with a**\nsymmetric key encryption algorithm.\n\n- **Public enciphered: The DER-encoded MMS PDDU is encrypted for privacy protection with**\na public key encryption algorithm.\n\n- **Hashed: STASE-MMS computes a hash-based Message Authentication Code (MAC) of the**\nDER-encoded MMS PDU and a secret password and appends the result to the MMS PDU for\nintegrity protection.\n\n- **Sealed: STASE-MMS computes the digital seal of the DER-encoded MMS PDU and**\nappends the result to the MMS PDU for integrity protection.\n\n- **Signed: STASE-MMS computes the digital signature of the DER-encoded MMS PDU and**\nappends the result to the MMS PDU for non-repudiation protection.\n\n- **Confidential signed: STASE-MMS computes the digital signature of the DER-encoded**\nMMS PDU and appends the result to the encrypted (see “confidential” above) MMS PDU for\nnon-repudiation and privacy protection.\n\n- **Confidential hashed: STATE-MMS computes the MAC of the DER-encoded MMS PDU**\nand appends the result to the encrypted (see “confidential” above) MMS PDU for integrity\nand privacy protection.\n\n- **Confidential sealed: STASE-MMS computes the digital seal of the DER-encoded MMS**\nPDU and appends the result to the encrypted (see “confidential” above) MMS PDU for\nintegrity and privacy protection.\n\nSTASE-MMS can also pass through MMS PDUs in the clear, without encoding or STs.\n\n4-2\n\n\n-----\n\n_Securing ICCP Using STASE-MMS_\n\n###### Default Data Security Algorithms and Mechanisms\n\nUnless otherwise agreed between the communication entities, the following selected default\nconventions, data security algorithms, and data security mechanisms are proposed:\n\n- Default encryption algorithm for symmetric key encryption: the Digital Encryption Standard\n(DES) in the Cipher Block Chaining (CBC) mode.\n\n- If triple DES is needed: Encryption Decryption Encryption in the CBC outer feedback mode\nwith three different DES keys.\n\n- The default public key encryption algorithm: RSA\n\n- The default hashing algorithm: MD5.\n\n- The default MAC (for keyed hashing): HMAC.\n\n- The default seal: the MD5 hash of the DER encoded MMS PDU encrypted with DES.\n\n- The default digital signature: the MD5 hash of the DER encoded MMS PDU encrypted with\nRSA and the user’s private key.\n\n###### Data Security Information Exchange\n\nThe following messages, exchanged between STASE-MMS entities, or between MMS and\nSTASE-MMS, specify which of the STs listed above is being used to protect the MMS PDU:\n\n- MMS invokes STASE-MMS on the originating side\n\n- The originating STASE-MMS sends a STASE-MMS PDU to a peer STASE-MMS entity on\nthe receiving side\n\n- STASE-MMS on the receiving side provides an indication to MMS.\n\nKnowledge of which STs are performed is mandatory, but not sufficient for proper\ncommunications. Indeed, both sides need to know which algorithms are being used, as well as\nthe values of all parameters (e.g., encryption keys, initialization vectors) that are in use. The\nproposed STASE-MMS provides several default values and mechanisms that require only the\nbare minimum of security-related information exchange. It also provides facilities for negotiating\nat association setup time which algorithms will be supported and for changing and specifying\nsuch information dynamically for every MMS PDU.\n\n###### STASE-MMS Model\n\nIn the OSI environment, communication between application processes is represented in terms of\ncommunication between a pair of application entities (AEs) using the presentation service (see\nFigure 4-2). Communication between application entities may require secure transfer of\napplication protocol data units (APDUs).\n\n4-3\n\n\n-----\n\n_Securing ICCP Using STASE-MMS_\n\nAPDUs sent by one AE (the sender) are received by the other AE (the receiver). Secure transfer\nensures that APDUs transferred by the sender can be correctly verified for integrity, and/or\nchecked for non-repudiation, and/or understood only by the intended receiver. Secure transfer\ninvolves security transformation (e.g., encryption) of APDUs from the sending application entity\nbefore transferring them and performing the reverse security transformations (e.g., decryption).\nSTASE-MMS only deals with the secure transfer of the MMS application protocol data units.\n\nSecure transfer is carried out within the context of the application association. An application\nassociation defines the relationship between a pair of AEs, and is formed by the exchange of\napplication protocol control information through the use of presentation layer services. The AE\nthat initiates the association is called the association initiating entity, or the association initiator,\nwhile the AE that responds to the initiation of an application association by another AE is called\nthe application responding AE, or the association responder.\n\nThe functionality of an AE is factored into one application process and a set of application\nservice elements (ASEs). Each ASE may itself be factored into a set of more primitive ASEs.\nThe interaction between AEs is described in terms of their use of ASEs.\n\nApplication-entity Application-entity\n\nApplication Process Application Process\n\nApplication service Application service\nelements elements\n\nApplication application\nLayer protocol\n\nMMS over MMS\n\napplication\nassociation\n\nACSE STASE ACSE STASE\n\nMMS MMS\n\nPresentation presentation connection\nLayer\n\n**Figure 4-2**\n**Mandatory Application Service Elements When STASE-MMS Is Used. The ASEs available**\n**to an application process require communication over an application association. The**\n**application processing the services provided by the Association Control Service Element**\n**(ACSE) control the application association. Source: “SISCO 1998” in the bibliography**\n\n4-4\n\n|Col1|Application-entity|Col3|Application-entity|Col5|\n|---|---|---|---|---|\n|ication r|Application Process|application protocol over application association|Application Process||\n||Application service elements MMS ACSE STASE MMS||Application service elements MMS ACSE STASE MMS||\n\n|ntation|presentation connection|Col3|\n|---|---|---|\n\n\n-----\n\n# 5\n#### BIBLIOGRAPHY\n\nEPRI 2000a. “Communication Security Assessment for the United States Electric Utility\nInfrastructure,” EPRI Technical Report 1001174, EPRI project manager: William Blair, report\nprepared by SISCO with assistance from Xtensible Solutions, Inc., (Palo, Alto, CA: EPRI,\nDecember 2000).\n\nEPRI 2000b. “The Benefits of Integrating Information Systems Across the Energy Enterprise:\nThe Power of the Control Center Application Program Interface (CCAPI) and Common\nInformation Model (CIM),” EPRI Technical Report 1001324, EPRI project manager: Dave\nBecker, report prepared by Hoffman Publications, Inc., (Palo Alto, CA: EPRI, December 2000).\n\nEPRI 1999. “Guidelines for “Inter-Control Center Communications Protocol (ICCP)\nDemonstration: Plant Controls to Dispatch Computer,” EPRI Technical Report TR-113652,\nEPRI project manager: R. Shankar, report prepared by EPRI Instrumentation and Control Center,\n(Palo Alto, CA: EPRI, September 1999).\n\nEPRI 1998. “Systems Integration at Kansas City Power and Light Using API and ICCP,” EPRI\nTechnical Report TR-111443, EPRI project manager: Dave Becker, report prepared by Hoffman\nPublications, Inc., (Palo Alto, CA: EPRI, October 1998).\n\nEPRI 1996. “Inter-Control Center Communications Protocol (ICCP) User’s Guide,” EPRI\nTechnical Report TR-107176, EPRI project manager: Dave Becker, report prepared by KEMAECC, (Palo Alto, CA: EPRI, December 1996).\n\nEPRI 1995a. “Intercontrol Center Communications Protocol (ICCP) Demonstration,” EPRI\nTechnical Report TR-105800, EPRI project manager: Dave Becker, report prepared by ECC,\nInc., (Palo Alto, CA: EPRI, November 1995).\n\nEPRI 1995b. “Inter-Control Center Communications Protocol (ICCP): Interoperability Test\nVersion 5.1,” EPRI Technical Report TR-105552, EPRI project manager: Dave Becker, report\nprepared by ECC, Inc., (Palo Alto, CA: EPRI, September 1995).\n\nIEC 1999. “Data and Communication Security,” Initial Report from TC 57 ad-hoc WG06,\nInternational Electrotechnical Commission (IEC), (Geneva, Switzerland: IEC, September 1999.\n\n5-1\n\n\n-----\n\n_Bibliography_\n\nIEEE 1999. “IEEE-SA Technical Report on Utility Communications Architecture (UCA )\nVersion 2.0,” IEEE-SA TR 1550-1999, volume 1, part 1: Introduction to UCA  Version 2.0,\n(New York: Institute of Electrical and Electronics Engineers (IEEE), 15 November 1999).\n\nSISCO 1998. “STASE-MMS,” draft report, provided by Herb Falk, (Sterling Heights, MI:\nSISCO, Inc., March 10, 1998).\n\n5-2\n\n\n-----\n\n# A\n#### ACRONYMS\n\nACSE association control service element\n\nACE area control error\n\nAE application entity\n\nAPDU application protocol data unit\n\nASE application service element\n\nCASM common application service model\n\nCBC cipher block chaining\n\nCCAPI control center application program interface\n\nCIM common information model\n\nCRC cyclic redundancy codes\n\nDCS distributed control system\n\nDER distinguished encoding rules\n\nDES digital encryption standard\n\nDNP distributed network protocol\n\nEMS energy management system\n\nEPRI Electric Power Research Institute (www.epri.com)\n\nFERC Federal Energy Regulatory Commission\n\nFTP file transfer protocol\n\nGULS generic upper layers security\n\nICCP Inter-Control Center Communication Protocol\n\nIDEC Inter-Utility Data Exchange Consortium\n\nIEC International Electrotechnical Commission (www.iec.ch)\n\nIEEE Institute of Electrical and Electronics Engineers (www.ieee.org)\n\nIP Internet protocol\n\n\nA-1\n\n\n-----\n\n_Acronyms_\n\nISN inter-regional security network\n\nISO International Standards Organization (www.iso.ch)\n\nISO independent system operator\n\nLAN local area network\n\nMAC message authentication code\n\nMMS manufacturing messaging specification\n\nNERC North American Electric Reliability Council (www.nerc.com)\n\nOSI open systems interconnection\n\nPDU protocol data unit\n\nPICS Protocol Implementation Conformance Statement\n\nPLC programmable logic controller\n\nRDI receiver data interface\n\nRTO regional transmission organization\n\nRTU remote terminal unit\n\nSC security coordinator\n\nSCADA supervisory control and data acquisition\n\nSPP Southwest Power Pool\n\nSQL Structured Query Language\n\nST security transformation\n\nSTASE-MMS security transformations application service element for MMS\n\nTASE Telecontrol Application Service Element\n\nTCP transmission control protocol\n\nUCA Utility Communications Architecture\n\nWAN wide area network\n\nWSCC Western Systems Coordinating Council (www.wscc.com)\n\nThe Utility Communications Architecture (UCA) is a trademark of the Electric Power\nResearch Institute (EPRI), Palo Alto, CA.\n\nA-2\n\n\n-----\n\n-----\n\n_Targets:_\nGrid Operations and Management\n\n\n**About EPRI**\n\nEPRI creates science and technology solutions for\n\nthe global energy and energy services industry. U.S.\n\nelectric utilities established the Electric Power\n\nResearch Institute in 1973 as a nonprofit research\n\nconsortium for the benefit of utility members, their\n\ncustomers, and society. Now known simply as EPRI,\n\nthe company provides a wide range of innovative\n\nproducts and services to more than 1000 energy\nrelated organizations in 40 countries. EPRI’s\n\nmultidisciplinary team of scientists and engineers\n\ndraws on a worldwide network of technical and\n\nbusiness expertise to help solve today’s toughest\n\nenergy and environmental problems.\n\nEPRI. Electrify the World\n\n© 2001 Electric Power Research Institute (EPRI), Inc.All rights\nreserved. Electric Power Research Institute and EPRI are registered\nservice marks of the Electric Power Research Institute, Inc.\nEPRI. ELECTRIFY THE WORLD is a service mark of the Electric\nPower Research Institute, Inc.\n\n_Printed on recycled paper in the United States of America_\n\n1001977\n\n\nEPRI • 3412 Hillview Avenue, Palo Alto, California 94304 • PO Box 10412, Palo Alto, California 94303 • USA\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/EPRI - ICCP Protocol - Threats to Data Security and Potential Solutions.pdf"
    ],
    "report_names": [
        "EPRI - ICCP Protocol - Threats to Data Security and Potential Solutions.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "62985c5c-6938-4365-8432-29573e99ecf4",
            "created_at": "2022-10-25T16:07:24.075092Z",
            "updated_at": "2025-03-27T02:02:10.099951Z",
            "deleted_at": null,
            "main_name": "PowerPool",
            "aliases": [],
            "source_name": "ETDA:PowerPool",
            "tools": [
                "ALPC Local PrivEsc",
                "FireMaster",
                "PowerDump",
                "PowerSploit",
                "Quarks PwDump",
                "SMBExec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "adee5dfb-98d1-488f-969d-48eed28cd7e4",
            "created_at": "2023-01-06T13:46:38.799427Z",
            "updated_at": "2025-03-27T02:00:02.9221Z",
            "deleted_at": null,
            "main_name": "PowerPool",
            "aliases": [
                "IAmTheKing"
            ],
            "source_name": "MISPGALAXY:PowerPool",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535695,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1004026226,
    "ts_modification_date": 1132747542,
    "files": {
        "pdf": "https://archive.orkl.eu/2d1d2b358b4657c5eefe557e33ecf579cefcc4d4.pdf",
        "text": "https://archive.orkl.eu/2d1d2b358b4657c5eefe557e33ecf579cefcc4d4.txt",
        "img": "https://archive.orkl.eu/2d1d2b358b4657c5eefe557e33ecf579cefcc4d4.jpg"
    }
}