{
    "id": "dcb1908a-e547-442c-adc4-a8f13b66297d",
    "created_at": "2023-01-12T15:05:03.27863Z",
    "updated_at": "2025-03-27T02:05:36.833389Z",
    "deleted_at": null,
    "sha1_hash": "661e64a49fe6a5f6d8eed0cbc02a90dbb7c578d1",
    "title": "2020-03-19 - RedLine Info-Stealing Malware Spread by [email protected] Phishing",
    "authors": "",
    "file_creation_date": "2022-05-27T02:00:02Z",
    "file_modification_date": "2022-05-27T02:00:02Z",
    "file_size": 604780,
    "plain_text": "# RedLine Info-Stealing Malware Spread by Folding@home Phishing\n\n**[bleepingcomputer.com/news/security/redline-info-stealing-malware-spread-by-folding-home-phishing/](https://www.bleepingcomputer.com/news/security/redline-info-stealing-malware-spread-by-folding-home-phishing/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nMarch 19, 2020\n11:25 AM\n3\n\nA new phishing email is trying to take advantage of the Coronavirus pandemic and the race\nto develop medications by promoting a fake Folding@home app that installs an informationstealing malware.\n\nFolding@home is a well-known distributed computing project that allows users to download\nsoftware that uses CPU and GPU cycles to research new drug opportunities against\ndiseases and a greater understanding of various diseases.\n\n[As the COVID-19 epidemic spreads throughout the world, Folding@home has](https://foldingathome.org/) added over 20\nnew projects focusing on coronavirus research and has seen a huge increase in usage by\npeople all over the world.\n\n## Scammers take advantage of a good thing\n\nWith the rise in popularity of Folding@home, security researchers at ProofPoint have\ndiscovered a new phishing campaign that pretends to be from a company developing a cure\nfor Coronavirus.\n\n\n-----\n\nThese emails have a subject of Please help us with Fighting corona-virus and state that\nthey want you to help \"speed up our process of finding the cure\" by downloading and\ninstalling the Folding@home client.\n\n**Folding@home Phishing email**\n\nClick to see full size\nThe text of this email reads:\n```\nGreetings from Mobility Research Inc and Folding@Thome \nAs we all know, recently corona-virus is becoming a major threat to the human\nsociety. We are a leading institution working on the cure to solve this world-wide\ncrisis. However, we need your help. With your contribution, you can speed up our\nprocess of finding the cure. The process is very simple, you will need to install an\napp on your computer, which will allow us to use it to run simulations of the cure.\n\n```\nEmbedded in the phishing email is a \"Download now\" button that when clicked will download\na file called foldingathomeapp.exe, which is the Redline information-stealing Trojan.\n\n\"RedLine Stealer is new malware available for sale on Russian underground forums with\nseveral pricing options: $150 lite version; $200 pro version; $100 / month subscription\noption. It steals information from browsers such as login, autocomplete, passwords, and\n\n\n-----\n\ncredit cards. It also collects information about the user and their system such as the\nusername, their location, hardware configuration, and installed security software. A recent\nupdate to RedLine Stealer also added the ability to steal cryptocurrency cold wallets,\"\n[ProofPoint states in their report.](https://www.proofpoint.com/us/threat-insight/post/new-redline-stealer-distributed-using-coronavirus-themed-email-campaign)\n\nOnce installed, the malware will connect to a remote site to receive commands as to what\ntypes of data should be stolen from the victim. These instructions are sent using the SOAP\nmessaging protocol as seen by the image below.\n\n**RedLine getting instructions**\nThis malware can steal saved login credentials, credit cards, cookies, and autocomplete\nfields from browsers. It can also collect data from FTP and IM clients, steal files, download\nfiles, execute commands, and send information back about the computer.\n\n[You can see an example of this malware in action in an Any.run session performed by](https://app.any.run/tasks/65be5131-84ea-464a-9e61-7b112f049112/)\n[security researcher James.](https://twitter.com/James_inthe_box/status/1240651301932826624)\n\nAs this malware can steal a large amount of information, anyone who has fallen victim to this\nscam should immediately perform a scan using antivirus software.\n\nThey should also change the passwords at any online accounts that they frequent as they\nmay now be in the possession of the attackers. This should be done from another computer\nuntil they are sure their infected computer has been cleaned.\n\nIt should also be noted that Folding@home is a terrific project and just because people are\nperforming scams in their name, does not mean it should be avoided.\n\n\n-----\n\n[Just be sure to download the Folding@home client only from the legitimate site.](https://foldingathome.org/)\n\n### Related Articles:\n\n[German automakers targeted in year-long malware campaign](https://www.bleepingcomputer.com/news/security/german-automakers-targeted-in-year-long-malware-campaign/)\n\n[New Meta information stealer distributed in malspam campaign](https://www.bleepingcomputer.com/news/security/new-meta-information-stealer-distributed-in-malspam-campaign/)\n\n[PDF smuggles Microsoft Word doc to drop Snake Keylogger malware](https://www.bleepingcomputer.com/news/security/pdf-smuggles-microsoft-word-doc-to-drop-snake-keylogger-malware/)\n\n[Eternity malware kit offers stealer, miner, worm, ransomware tools](https://www.bleepingcomputer.com/news/security/eternity-malware-kit-offers-stealer-miner-worm-ransomware-tools/)\n\n[Historic Hotel Stay, Complementary Emotet Exposure included](https://www.bleepingcomputer.com/news/security/historic-hotel-stay-complementary-emotet-exposure-included/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-19 - RedLine Info-Stealing Malware Spread by Folding@home Phishing.pdf"
    ],
    "report_names": [
        "2020-03-19 - RedLine Info-Stealing Malware Spread by Folding@home Phishing.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535903,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653616802,
    "ts_modification_date": 1653616802,
    "files": {
        "pdf": "https://archive.orkl.eu/661e64a49fe6a5f6d8eed0cbc02a90dbb7c578d1.pdf",
        "text": "https://archive.orkl.eu/661e64a49fe6a5f6d8eed0cbc02a90dbb7c578d1.txt",
        "img": "https://archive.orkl.eu/661e64a49fe6a5f6d8eed0cbc02a90dbb7c578d1.jpg"
    }
}