{
    "id": "dcb560a1-6b3c-4280-a6b3-d4a805301ea3",
    "created_at": "2023-01-12T15:04:07.999436Z",
    "updated_at": "2025-03-27T02:06:08.991545Z",
    "deleted_at": null,
    "sha1_hash": "98c0a1078bbe424b549543d826afa40e91d22009",
    "title": "2021-04-29 - Saving World Health Day- UNICC and Group-IB Take Down Scam Campaign Impersonating the World Health Organization",
    "authors": "",
    "file_creation_date": "2022-05-27T22:25:08Z",
    "file_modification_date": "2022-05-27T22:25:08Z",
    "file_size": 1927020,
    "plain_text": "# Saving World Health Day: UNICC and Group-IB Take Down Scam Campaign Impersonating the World Health Organization\n\n**[unicc.org/news/2021/04/29/unicc-and-group-ib-take-down-scam-campaign/](https://www.unicc.org/news/2021/04/29/unicc-and-group-ib-take-down-scam-campaign/)**\n\nMaria Thomsen 29 April, 2021\n\n[UNICC, together with Group-IB, a global threat hunting and adversary-centric cyber](https://www.group-ib.com/)\nintelligence company that specialises in investigating high-tech cybercrimes, detected and\ntook down a massive multistage scam campaign circulating online on April 7, World Health\nDay. Scammers created a distributed network of 134 rogue websites impersonating the\nWorld Health Organization (WHO) on its health awareness day, encouraging users to take a\nfake survey with a promise of funds in return. The scheme targeted millions of users around\nthe world with the goal of tricking them into visiting fraudulent third-party websites.\n\nGroup-IB Digital Risk Protection Team detected the campaign and reached out UNICC’s\nCommon Secure team as a trusted contact for cyber threat intelligence matters within the UN\nin order to assure that competent contacts with WHO are aware of its existence.\n\nGroup-IB Digital Risk Protection Team performed the takedown of all the scam domains.\nGroup-IB researchers established that one scammer collective, codenamed DarkPath\nScammers, is likely to be behind the campaign. The investigation is underway.\n\n**Cyber-hygiene for the Sustainable Development Goals**\n\n\n-----\n\nUNICC works with the World Health Organization and many other UN Agencies to deliver on\n[their mandates, represented by the Sustainable Development Goals, a collection of 17](https://www.unicc.org/who-we-are/unicc-support-for-the-sustainable-development-goals/)\ninterlinked global goals designed to be a blueprint to achieve a better and more sustainable\nfuture for all. Whether it’s health, eradication of poverty or hunger, rights for women and girls,\nactions to take on climate change, economic justice, sustainable cities and communities, or\nfor peace and justice around the world, UNICC provides digital business solutions, including\na [threat intelligence network for over 30 UN Agencies and international organizations.](https://www.unicc.org/news/2020/12/14/a-strengthened-threat-intelligence-posture-for-the-un-family/)\n\n_After warning us, we knew Group-IB was the team to deal with this World Health Day_\n_scam. They have the expertise and tools to get the job of takedown done, in short_\n_order._\n\n_Bojan Simetic, Information Security Specialist, UNICC_\n\n_We are excited to cooperate with UNICC in the detection and elimination of scams_\n_deceiving people into thinking they are dealing with legitimate websites._\n\n_Dmitry Tyunkin, Head of Group-IB Digital Risk Protection Team_\n\n**Detecting the Scam**\n\nOn April 7, Group-IB alerted UNICC about a fake website impersonating WHO branding,\nwhere users were encouraged to answer a few simple questions to earn a 200 Euro reward\non the occasion of World Health Day.\n\nOnce users answered questions, they were prompted to share links with their WhatsApp\ncontacts. This way scammers tried to ensure the viral distribution of their multistage schema.\nGroup-IB researchers discovered that users would see several fake Facebook comments\nabout gifts commentators supposedly received. When they then hit the Share button they\nwould unknowingly involve friends in the scam by sharing the link with them – instead of the\npromised reward – with a redirect to third-party fraudulent resources offering participation in\nanother lucky draw.\n\nBy this time in the scam routine WHO is no longer mentioned as users would visit a hookup\nwebsite, inadvertently install an extension for their browsers or subscribe for paid services. In\nthe worst-case scenario, users would end up on a malicious or a phishing website.\n\nIn addition to the multi-stage nature of the scam, which makes it harder to detect, victims\nsaw customised content depending on their geolocation, user agents and language settings.\nFor example, the currency of the reward would change depending on user location.\n\n**What the Scam Looked Like**\n\nGroup-IB Digital Risk Protection team discovered that it was not a one-off, short-lived\nwebsite impersonating the WHO brand, but rather a sophisticated distributed scam\ninfrastructure that included a network of 134 almost-identical, connected domains hosting\n\n\n-----\n\nweb pages exploiting the World Health Day theme. Within 48 hours upon discovery, GroupIB managed to block all the rogue domains.\n\nScreenshot from Group-IB Digital Risk Protection Platform shows the network of 134 rogue\nwebsites impersonating the World Health Organization. Credit: Group-IB\nFurther investigation found that the 134 domains, identified and blocked by Group-IB, are\npart of a larger scam network, attributed to a single scammer collective.\n\nGroup-IB researchers discovered connections between the blocked 134 websites involved in\nthe WHO scam and at least 500 other scam and phishing resources impersonating more\nthan 50 well-known international food, sportswear, e-commerce, software, automotive, e\nnergy industry brands. The analysis of websites revealed that cybercriminals used scam kits,\nsimilar to phishing kits, which are sets of instruments for the creation and design of scam\npages. One scam kit allows impersonating multiple brands at a time using the same\ntemplate. Interestingly, after the takedown efforts by UNICC and Group-IB, the scammers\nstopped using the WHO branding across their whole network.\n\n\n-----\n\nBrands impersonated by DarkPath Scammers. Breakdown by industries. Credit: Group-BI\n\n**Scam Syndicate**\n\nDuring the infrastructure analysis, Group-IB researchers examined the domains and other\ndigital indicators and concluded that the whole network is likely to be maintained and\ncontrolled by a scammer collective codenamed DarkPath Scammers. Most of the domains\nwith phishing and scam content are using CDN’s (Content Delivery Networks) to hide IPaddresses of the real servers. Thanks to its proprietary Graph Analysis system, Group-IB\nresearchers analysed dozens of SSL certificates, SSH keys, DNS and were able to track\ndown malicious infrastructure, unveil the IP-addresses of the real servers where phishing\ncontent was stored and connect the domains into one distributed scam network. The\nscammers are using the same infrastructure configuration with its own traits and\nmisconfigurations across all their servers. Group-IB continues to monitor the scammers’\nactivity.\n\nMost of the scam websites controlled by DarkPath Scammers remain active at the moment\nand keep targeting millions of users around the world. The scammers advertise their\nresources using email blasts, paid ads and in social media. According to Group-IB estimates,\nthe scammers’ whole network attracts around 200,000 users daily from the US, India, Russia\nand other locations.\n\n\n-----\n\nDmitry Tyunkin, Head of Group-IB Digital Risk Protection team in Amsterdam, noted that\n“many brands, however, still underestimate the impact of such scams on their businesses\nand customers. Most organizational approaches to eliminating brand abuse online seems a\nlot like tilting at windmills. They miss this continuous trend toward the use of multistage\nscams and distributed infrastructure. Scammers use smart, advanced technologies. They are\nsuccessful due to the lack of comprehensive digital asset monitoring by brand owners.”\n\nOrganizations should carry out seamless online monitoring to promptly detect any cases of\nillicit use of their brands. Many institutions monitor only separate brand infringements, like\nphishing pages and domains but overlook other elements of fraudulent infrastructure. To see\nthe comprehensive picture of all brand violations, companies should use Group-IB Digital\nRisk Protection solutions that will promptly eliminate all brand infringements online on a pretrial basis without additional investment and lengthy litigation.\n\nTo avoid falling prey to this scheme, online users should carefully check the website they are\ninteracting with. It is never redundant to check if the link you’re going to click on is identical to\nthe domain of the organization’s official website since fraudsters often register domain\nnames mimicking official ones. Stay suspicious of any website on which you plan to enter\nyour data is a habit that must be developed by everyone willing to keep their money safe.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - Saving World Health Day- UNICC and Group-IB Take Down Scam Campaign Impersonating the World Health Organization.pdf"
    ],
    "report_names": [
        "2021-04-29 - Saving World Health Day- UNICC and Group-IB Take Down Scam Campaign Impersonating the World Health Organization.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535847,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653690308,
    "ts_modification_date": 1653690308,
    "files": {
        "pdf": "https://archive.orkl.eu/98c0a1078bbe424b549543d826afa40e91d22009.pdf",
        "text": "https://archive.orkl.eu/98c0a1078bbe424b549543d826afa40e91d22009.txt",
        "img": "https://archive.orkl.eu/98c0a1078bbe424b549543d826afa40e91d22009.jpg"
    }
}