{
    "id": "dce1c879-84b1-4e15-9dcd-ca672f2b930e",
    "created_at": "2023-01-12T14:59:44.015365Z",
    "updated_at": "2025-03-27T02:05:53.717193Z",
    "deleted_at": null,
    "sha1_hash": "ba85810ec47397aecb12454bfe3c2d30a087f0a0",
    "title": "2018-07-03 - Smoking Guns - Smoke Loader learned new tricks",
    "authors": "",
    "file_creation_date": "2022-05-27T21:10:03Z",
    "file_modification_date": "2022-05-27T21:10:03Z",
    "file_size": 371294,
    "plain_text": "# Smoking Guns - Smoke Loader learned new tricks\n\n**[blog.talosintelligence.com/2018/07/smoking-guns-smoke-loader-learned-new.html](https://blog.talosintelligence.com/2018/07/smoking-guns-smoke-loader-learned-new.html)**\n\n[This post is authored by Ben Baker and](https://blogs.cisco.com/author/benbaker) [Holger Unterbrink](https://blogs.cisco.com/author/holgerunterbrink)\n\n## Overview\n\nCisco Talos has been tracking a new version of Smoke Loader — a malicious application\nthat can be used to load other malware — for the past several months following an alert from\nCisco Advanced Malware Protection’s (AMP) Exploit Prevention engine. AMP successfully\nstopped the malware before it was able to infect the host, but further analysis showed some\ndevelopments in the Smoke Loader sample resulting from this chain of malware that\nintrigued us. This includes one of the first uses of the PROPagate injection technique in real[world malware. Besides a report released at the end of last week describing a different RIG](https://www.bleepingcomputer.com/news/security/propagate-code-injection-technique-detected-in-the-wild-for-the-first-time/)\nExploit Kit-based campaign, we haven’t seen real-world malware using this.\n\nTalos is very familiar with Smoke Loader. For example, it was used as a downloader for a\n[cyberattack that was launched using the official website of Ukraine-based accounting](https://blog.talosintelligence.com/2018/01/cfm-zeus-variant.html)\nsoftware developer Crystal Finance Millennium (CFM) in January.\n\n\n-----\n\nSimilar to many other campaigns, the initial infection vector was an email with a malicious\nMicrosoft Word document attached. The victims were tricked into opening the attachment\nand enabling the embedded macros. This started the malware-downloading chain, down to\nthe final Smoke Loader infection and its plugins.\n\nSmoke Loader is primarily used as a downloader to drop and execute additional malware like\n[ransomware or cryptocurrency miners. Actors using Smoke Loader botnets have posted on](https://blog.talosintelligence.com/2018/01/malicious-xmr-mining.html)\nmalware forums attempting to sell third-party payload installs. This sample of Smoke Loader\ndid not transfer any additional executables, suggesting that it may not be as popular as it\nonce was, or it’s only being used for private purposes.\n\nThe plugins are all designed to steal sensitive information from the victim, specifically\ntargeting stored credentials or sensitive information transferred over a browser — including\nWindows and Team Viewer credentials, email logins, and others.\n\n## Technical details\n\n**Infection Chain**\n\nAs mentioned above, the infection chain started with an email and an attached malicious\nWord document\n(b98abdbdb85655c64617bb6515df23062ec184fe88d2d6a898b998276a906ebc). You can\nsee the content of this email below.\n\n\n-----\n\nFig. 1 - Phishing Email\n\nThe attached Word document had an embedded macro that initiated the second stage and\ndownloaded the Trickbot malware.\n(0be63a01e2510d161ba9d11e327a55e82dcb5ea07ca1488096dac3e9d4733d41).\n\n\n-----\n\nFig. 2 - Email attachment: IO08784413.doc\n\nThis document downloads and executes the Trickbot malware from\n_hxxp://5[.]149[.]253[.]100/sg3.exe, or hxxp://185[.]117[.]88[.]96/sg3.exe as %TEMP%\\[a-zA-_\n_Z]{6-9}.exe. These URLs have served up multiple malicious executables in the past,_\nincluding samples of Trickbot.\n\nIn our Trickbot cases, the malware finally downloaded the Smoke Loader trojan\n(b65806521aa662bff2c655c8a7a3b6c8e598d709e35f3390df880a70c3fded40), which\ninstalled five additional Smoke Loader plugins. We are describing these plugins in detail later\nin the plugins section of this report.\n\n\n-----\n\n**Trickbot**\n\n(0be63a01e2510d161ba9d11e327a55e82dcb5ea07ca1488096dac3e9d4733d41)\n\nSmoke Loader has often dropped Trickbot as a payload. This sample flips the script, with our\ntelemetry showing this Trickbot sample dropping Smoke Loader. This is likely an example of\nmalware-as-a-service, with botnet operators charging money to install third-party malware on\ninfected computers. We haven’t analysed the Trickbot sample further, but for your reference,\nwe are providing the Trickbot configuration here (IP addresses redacted with bracketed dots\nfor security reasons.):\n\n_<mcconf>_\n\n_<ver>1000167</ver>_\n\n_<gtag>wrm13</gtag>_\n\n_<srv>185[.]174[.]173[.]34:443</srv>_\n\n_<srv>162[.]247[.]155[.]114:443</srv>_\n\n_<srv>185[.]174[.]173[.]116:443</srv>_\n\n_<srv>185[.]174[.]173[.]241:443</srv>_\n\n_<srv>62[.]109[.]26[.]121:443</srv>_\n\n_<srv>185[.]68[.]93[.]27:443</srv>_\n\n_<srv>137[.]74[.]151[.]148:443</srv>_\n\n_<srv>185[.]223[.]95[.]66:443</srv>_\n\n_<srv>85[.]143[.]221[.]60:443</srv>_\n\n_<srv>195[.]123[.]216[.]115:443</srv>_\n\n_<srv>94[.]103[.]82[.]216:443</srv>_\n\n_<srv>185[.]20[.]187[.]13:443</srv>_\n\n_<srv>185[.]242[.]179[.]118:443</srv>_\n\n_<srv>62[.]109[.]26[.]208:443</srv>_\n\n_<srv>213[.]183[.]51[.]54:443</srv>_\n\n_<srv>62[.]109[.]24[.]176:443</srv>_\n\n_<srv>62[.]109[.]27[.]196:443</srv>_\n\n_<srv>185[.]174[.]174[.]156:443</srv>_\n\n_<srv>37[.]230[.]112[.]146:443</srv>_\n\n_<srv>185[.]174[.]174[.]72:443</srv>_\n\n_</servs>_\n\n_<autorun>_\n\n_<module name=\"systeminfo\" ctl=\"GetSystemInfo\"/>_\n\n_<module name=\"injectDll\"/>_\n\n_</autorun>_\n\n_</mcconf>_\n\n**Smoke Loader packer/injector details**\n\n\n-----\n\nMalware frequently iterates through process lists to find a process to inject. Security\nresearchers know this process well and have created many tools to track the Windows APIs\nused in this technique, like CreateToolhelp32Snapshot. This Smoke Loader sample avoids\niterating through process lists by calling the Windows API GetShellWindow to get a handle to\nthe shell’s desktop window, then calling GetWindowThreadProcessId to get the process ID of\nExplorer.exe.\n\nSmoke Loader then uses standard injection API to create and write two memory sections in\nExplorer, one for shellcode and another for a UxSubclassInfo structure to be used later for\n**PROPagate injection.**\n\nGetShellWindow -> GetWindowThreadProcessId -> NtOpenProcess -> NtCreateSection ->\nNtMapViewOfSection x2 -> NtUnmapViewOfSection\n\nThe window handle retrieved from the previous call to GetShellWindow has a second\npurpose. Smoke Loader uses EnumChildWindows to iterate through each of the handle’s\nchild windows to find one containing the property UxSubclassInfo, which indicates it is\nvulnerable to PROPagate injection.\n\n[PROPagate injection was first described by a security researcher in late 2017, though there](http://www.hexacorn.com/blog/2017/10/26/propagate-a-new-code-injection-trick/)\nwere no public POCs available when Smoke Loader started using it. The Smoke Loader\ndevelopers likely used publicly available notes on PROPagate to recreate the technique.\n\n\n-----\n\nFig. 3 - PROPagate Injection\n\nFor each child window, the injector calls EnumPropsA to iterate through window properties\nuntil it finds UxSubclassInfo. This function also showcases some of the anti-analysis\ntechniques employed by this sample’s packer. There are several unnecessary jumps for\ncontrol flow obfuscation, including simple opaque predicates leading to junk code.\n\n“Deobf_next_chunk” takes arguments for size and offset for the next chunk of code to\ndeobfuscate and execute, so the bulk of the malicious code is deobfuscated as needed, and\ncan be obfuscated again once the next chunk is loaded. The obfuscation method is a simple\none-byte XOR with the same hardcoded value for every piece.\n\n\n-----\n\nThese anti-analysis techniques are accompanied by anti-debugging and anti-VM checks, as\nwell as threads dedicated to scanning for processes and windows belonging to analysis\ntools. These features complicate forensics, runtime AV scanners, tracing, and debugging.\n\nFig. 4 - Trigger malicious event handler via WM_NOTIFY and WM_PAINT\n\nOnce the shellcode and UxSubclassInfo data are written to the remote process, the injector\ncalls SetPropA to update the property for the window, then sends WM_NOTIFY and\nWM_PAINT messages to the target window to force it to trigger the malicious event handler\nthat executes the injected shellcode.\n\n**Injected shellcode: Smoke Loader**\n\nSmoke Loader received five interesting plugins instead of additional payloads. Each plugin\nwas given its own Explorer.exe process to execute in, and the malware used older\ntechniques to inject each plugin into these processes. Each Explorer.exe process is created\nwith the option CREATE_SUSPENDED, the shellcode is injected, then executed using\nResumeThread. This is noisy and leaves six Explorer.exe processes running on the infected\nmachine.\n\n**Plugins**\n\n\n-----\n\nAs mentioned above, the plugins are all designed to steal sensitive information from the\nvictim, explicitly targeting stored credentials or sensitive information transferred over a\nbrowser. Each plugin uses the mutex \"opera_shared_counter\" to ensure multiple plugins\ndon’t inject code into the same process at the same time.\n\n**Plugin 1:**\n\nThis is the largest plugin with approximately 2,000 functions. It contains a statically linked\nSQLite library for reading local database files.\n\nIt targets stored info for Firefox, Internet Explorer, Chrome, Opera, QQ Browser,\nOutlook, and Thunderbird.\n\nRecursively searches for files named logins.json which it parses for hostname,\n_encryptedUsername, and encryptedPassword._\n\nvaultcli.dll - Windows Credential Manager\nPOP3, SMTP, IMAP Credentials\n\n**Plugin 2:**\n\nThis plugin recursively searches through directories looking for files to parse and exfiltrate.\n\n_Outlook_\n_*.pst_\n_*.ost_\n_Thunderbird_\n_*.mab_\n_*.msf_\n_inbox_\n_sent_\n_templates_\n_drafts_\n_archives_\n_The Bat!_\n_*.tbb_\n_*.tbn_\n_*.abd_\n\n**Plugin 3:**\n\nThis one injects into browsers to intercept credentials and cookies as they are transferred\nover HTTP and HTTPS.\n\n\n-----\n\nIf _fgclearcookies is set, kills browser processes and deletes cookies._\n\niexplore.exe and microsoftedgecp.exe\n\n_HttpSendRequestA_\n_HttpSendRequestW_\n_InternetWriteFile_\n_firefox.exe_\n\nPR_Write in nspr4.dll or nss3.dll\n\nchrome.exe\n\n_unknown function inside chrome.dll_\n\nopera.exe\n\n_unknown function inside opera_browser.dll or opera.dll_\n\n**Plugin 4:**\n\nThis hooks ws2_32!send and ws2_32!WSASend to attempt to steal credentials for ftp, smtp,\n_pop3, and imap_\n\n**Plugin 5:**\n\nThis one injects code into TeamViewer.exe to steal credentials\n\n## IOC\n\nB98abdbdb85655c64617bb6515df23062ec184fe88d2d6a898b998276a906ebc\n(IO08784413.doc)\n\n0be63a01e2510d161ba9d11e327a55e82dcb5ea07ca1488096dac3e9d4733d41 (Trickbot)\n\nb65806521aa662bff2c655c8a7a3b6c8e598d709e35f3390df880a70c3fded40 (Smoke\nLoader)\n\nMutex: opera_shared_counter\n\nTrickbot IPs:\n\n_185[.]174[.]173[.]34_\n\n_162[.]247[.]155[.]114_\n\n_185[.]174[.]173[.]116_\n\n_185[.]174[.]173[.]241_\n\n_62[.]109[.]26[.]121_\n\n_185[.]68[.]93[.]27_\n\n_137[.]74[.]151[.]148_\n\n_185[.]223[.]95[.]66_\n\n\n-----\n\n_85[.]143[.]221[.]60_\n_195[.]123[.]216[.]115_\n_94[.]103[.]82[.]216_\n_185[.]20[.]187[.]13_\n_185[.]242[.]179[.]118_\n_62[.]109[.]26[.]208_\n_213[.]183[.]51[.]54_\n_62[.]109[.]24[.]176_\n_62[.]109[.]27[.]196_\n_185[.]174[.]174[.]156_\n_37[.]230[.]112[.]146_\n_185[.]174[.]174[.]72_\n\nSmoke Loader domains:\n_ukcompany[.]me_\n_ukcompany[.]pw_\n_ukcompany[.]top_\n\nDropped File: %appdata%\\Microsoft\\Windows\\[a-z]{8}\\[a-z]{8}.exe\n\nScheduled Task: Opera scheduled Autoupdate [0-9]{1-10}\n\n## Conclusion\n\nWe have seen that the trojan and botnet market is constantly undergoing changes. The\nplayers are continuously improving their quality and techniques. They modify these\ntechniques on an ongoing basis to enhance their capabilities to bypass security tools. This\nclearly shows how important it is to make sure all our systems are up to date. Organizations\ncan utilize a multi-layered defensive approach to detect and protect against these kinds of\nthreats. Talos continues to monitor these campaigns as they evolve to ensure that defenses\nprotect our customers. We strongly encourage users and organizations to follow\nrecommended security practices, such as installing security patches as they become\navailable, exercising caution when receiving messages from unknown third parties, and\nensuring that a robust offline backup solution is in place. These practices will help reduce the\nthreat of a compromise, and should aid in the recovery of any such attack.\n\n## Coverage\n\n\n-----\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/advanced-malware-protection&sa=D&ust=1524553763505000)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html&sa=D&ust=1524553763506000)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html&sa=D&ust=1524553763507000)\n\n[Network Security appliances such asNGFW,NGIPS, andMeraki MX can detect malicious](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/firewalls/index.html&sa=D&ust=1524553763508000)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.google.com/url?q=https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html&sa=D&ust=1524553763509000)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://www.google.com/url?q=https://umbrella.cisco.com/&sa=D&ust=1524553763510000)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.google.com/url?q=https://www.snort.org/products&sa=D&ust=1524553763510000)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-03 - Smoking Guns - Smoke Loader learned new tricks.pdf"
    ],
    "report_names": [
        "2018-07-03 - Smoking Guns - Smoke Loader learned new tricks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535584,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1653685803,
    "ts_modification_date": 1653685803,
    "files": {
        "pdf": "https://archive.orkl.eu/ba85810ec47397aecb12454bfe3c2d30a087f0a0.pdf",
        "text": "https://archive.orkl.eu/ba85810ec47397aecb12454bfe3c2d30a087f0a0.txt",
        "img": "https://archive.orkl.eu/ba85810ec47397aecb12454bfe3c2d30a087f0a0.jpg"
    }
}