{
    "id": "dd96467a-56bc-4a1e-9b61-329885ff293c",
    "created_at": "2022-10-25T16:48:11.07724Z",
    "updated_at": "2025-03-27T02:11:24.396664Z",
    "deleted_at": null,
    "sha1_hash": "f26ddf5c622dd52fc46cd46813c9552a08214587",
    "title": "The Nitro Attacks: Stealing Secrets From The Chemical Industry",
    "authors": "Symantec",
    "file_creation_date": "2011-10-28T11:32:50Z",
    "file_modification_date": "2011-10-28T11:33:21Z",
    "file_size": 1451426,
    "plain_text": "## Security Response\n\n# The Nitro Attacks\n\n### Stealing Secrets from the Chemical Industry\n\n###### Eric Chien and Gavin O’Gorman\n\n#### Introduction\n\n###### Contents\n\nThis document discusses a recent targeted attack campaign directed\n\nIntroduction........................................................ 1\n\nprimarily at private companies involved in the research, develop­\n\nTargets................................................................ 1\n\nment, and manufacture of chemicals and advanced materials. The\n\nAttack methodology........................................... 2\n\ngoal of the attackers appears to be to collect intellectual property\n\nGeographic Spread ............................................ 3\n\nsuch as design documents, formulas, and manufacturing processes.\n\nAttribution........................................................... 4\n\nIn addition, the same attackers appear to have a lengthy operation\n\nTechnical details................................................. 4\n\nhistory including attacks on other industries and organizations. At­\n\nDelivery......................................................... 4\n\ntacks on the chemical industry are merely their latest attack wave.\n\nThreat details................................................ 5\n\nAs part of our investigations, we were also able to identify and con­\n\nCommand and Control (C&C)....................... 6\n\ntact one of the attackers to try and gain insights into the motiva­\n\nRelated Attacks................................................... 6\n\ntions behind these attacks. As the pattern of chemical industry tar­\n\nSummary............................................................. 6\n\ngets emerged, we internally code-named the attack campaign Nitro.\n\nAppendix............................................................. 7\n\nThe attack wave started in late July 2011 and continued into mid-\nSeptember 2011. However, artifacts of the attack wave such\nas Command and Control (C&C) servers are also used as early\nas April 2011 and against targets outside the chemical indus­\ntry. The purpose of the attacks appears to be industrial espio­\nnage, collecting intellectual property for competitive advantage.\n\n#### Targets\n\nThe attackers have changed their targets over time. From late April to\nearly May, the attackers focused on human rights related NGOs. They\nthen moved on to the motor industry in late May. From June until mid-\nJuly no activity was detected. At this point, the current attack campaign\nagainst the chemical industry began. This particular attack has lasted\n\n\n-----\n\nA total of 29 companies in the chemical sector were confirmed to be targeted in this attack wave and another 19\nin various other sectors, primarily the defense sector, were seen to be affected as well. These 48 companies are\nthe minimum number of companies targeted and likely other companies were also targeted. In a recent two week\nperiod, 101 unique IP addresses contacted a command and control server with traffic consistent with an infected\nmachine. These IPs represented 52 different unique Internet Service Providers or organizations in 20 countries.\n\nCompanies affected include:\n\n     - Multiple Fortune 100 companies involved in research and development of chemical compounds and advanced\n\nmaterials.\n\n     - Companies that develop advanced materials primarily for military vehicles.\n\n     - Companies involved in developing manufacturing infrastructure for the chemical and advanced materials\n\nindustry.\n\n#### Attack methodology\n\nThe attackers first researched desired targets and then sent an email specifically to the target. Each organiza­\ntion typically only saw a handful of employees at the receiving end of these emails. However, in one organization\nalmost 500 recipients received a mail, while in two other organizations, more than 100 were selected. While\nthe attackers used different pretexts when sending these malicious emails, two methodologies stood out. First,\nwhen a specific recipient was targeted, the mails often purported to be meeting invitations from established\nbusiness partners. Secondly, when the emails were being sent to a broad set of recipients, the mails purported\nto be a necessary security update. The emails then contained an attachment that was either an executable that\nappeared to be a text file based on the file name and icon, or a password-protected archive containing an execut­\nable file with the password provided in the email. In both cases, the executable file was a self-extracting execut­\nable containing PoisonIvy, a common backdoor Trojan developed by a Chinese speaker.\n\nWhen the recipient attempted to open the attachment, they would inadvertently execute the file, causing Poi­\nsonIvy to be installed. Once PoisonIvy was installed, it contacted a C&C server on TCP port 80 using an encrypt­\ned communication protocol. Using the C&C server, the attackers then instructed the compromised computer to\nprovide the infected computer’s IP address, the names of all other computers in the workgroup or domain, and\ndumps of Windows cached password hashes.\n\nBy using access to additional computers through the currently logged on user or cracked passwords through\ndumped hashes, the attackers then began traversing the network infecting additional computers. Typically, their\nprimary goal is to obtain domain administrator credentials and/or gain access to a system storing intellectual\nproperty. Domain administrator credentials make it easier for the attacker to find servers hosting the desired\nintellectual property and gain access to the sensitive materials. The attackers may have also downloaded and\ninstalled additional tools to penetrate the network further.\n\nWhile the behavior of the attackers differs slightly in each compromise, generally once the attackers have identi­\nfied the desired intellectual property, they copy the content to archives on internal systems they use as internal\nstaging servers. This content is then uploaded to a remote site outside of the compromised organization com­\npleting the attack.\n\n\n-----\n\n#### Geographic Spread\n\nFigure 1 shows the location\nof infected computers. This\ndata is derived from the\nIP addresses of machines\nconnecting back to the\ncommand and control serv­\ner. The majority of infected\nmachines are located in\nthe US, Bangladesh and\nthe UK; however, overall\nthere is wide geographical\nspread of infections.\n\nFigure 2 shows the country\nof origin of the organiza­\ntions targeted by these at­\ntacks. While the US and UK\nagain figure highly here,\noverall the geographical\nspread is different. This\nmeans that the infected\ncomputers are rarely\nlocated within the organi­\nzations’ headquarters or\ncountry of origin.\n\n\nFigure 1\n###### Geographic location of infected computers\n\n\nFigure 2\n###### Country of origin of targeted organizations*\n\n\n-----\n\nThere are two possible explanations for this:\n\n     - The attackers are targeting sites, or individuals in certain sites, which they know have access to certain data\n\nthat is of interest to the attacker.\n\n     - The attackers are targeting sites or individuals that they believe have less security measures in place and are\n\ntherefore an easier access point into the victims’ networks.\n\nWe can conclude that the attackers are not targeting organizations in a particular country.\n\n#### Attribution\n\nThe attacks were traced back to a computer system that was a virtual private server (VPS) located in the United\nStates. However, the system was owned by a 20-something male located in the Hebei region in China. We inter­\nnally have given him the pseudonym of Covert Grove based on a literal translation of his name. He attended a\nvocational school for a short period of time specializing in network security and has limited work experience,\nmost recently maintaining multiple network domains of the vocational school.\n\nCovert Grove claimed to have the U.S.-based VPS for the sole purpose of using the VPS to log into the QQ instant\nmessage system, a popular instant messaging system in China. By owning a VPS, he would have a static IP ad­\ndress. He claims this was the sole purpose of the VPS. And by having a static IP address, he could use a feature\nprovided by QQ to restrict login access to particular IP addresses. The VPS cost was RMB200 (US$32) a month.\nWhile possible, with an expense of RMB200 a month for such protection and the usage of a US-based VPS, the\nscenario seems suspicious. We were unable to recover any evidence the VPS was used by any other authorized\nor unauthorized users. Further, when prompted regarding hacking skills, Covert Grove immediately provided a\ncontact that would perform ‘hacking for hire’. Whether this contact is merely an alias or a different individual has\nnot been determined.\n\nWe are unable to determine if Covert Grove is the sole attacker or if he has a direct or only indirect role. Nor are\nwe able to definitively determine if he is hacking these targets on behalf of another party or multiple parties.\n\n#### Technical details\n\nAs mentioned above, the threat used to compromise the targeted networks is Poison Ivy, a Remote Access Tool\n(RAT). This application is freely available from poisonivy-rat.com. It comes fully loaded with a number of plug-ins\nto give an attacker complete control of the compromised computer.\n\n##### Delivery\n\nThe method of delivery has changed over time as the attackers have changed targets. Older attacks involved a\nself-extracting archive with a suggestive name, for example: “Human right report of north Africa under the war.\nscr”. The most recent attacks focusing on the chemical industry are using password-protected 7zip files which,\nwhen extracted, contain a self-extracting executable. The password to extract the 7zip file is included in the\nemail. This extra stage is used to prevent automated systems from extracting the self-extracting archive. Some\nexample file names using this technique include:\n\n     - AntiVirus_update_package.7z\n\n     - acquisition.7z\n\n     - offer.7z\n\n     - update_flashplayer10ax.7z\n\n\n-----\n\nAn example of an email used to send\nthe attachment can be seen in figure\n3.\n\nThe email is quite generic, appli­\ncable to any corporate user. Some\nof the subject lines will vary and may\ninclude the name of the targeted\ncompany in an attempt to be more\nconvincing.\n\n##### Threat details\n\nWhen the self-extracting archive file\nis executed, it will drop two files.\nExamples of file names that are used\ninclude:\n\n   - %Temp%\\happiness.txt\n\n   - %Temp%\\xxxx.exe\n\nThe executable file, xxxx.exe in this\ncase, is then executed. The second\nfile, happiness.txt, contains custom\ncode in binary format that is en­\ncrypted and used by xxxx.exe. The\nxxxx.exe file copies happiness.txt to\nC:\\PROGRAM FILES\\common files\\\nODBC\\ODUBC.DLL and to C:\\WIN­\nDOWS\\system32\\jql.sys. It then loads\nthe contents of the encrypted file and\ninjects it into the explorer.exe and\niexplore.exe processes.\n\n\nFigure 3\n###### Malicious email\n\n\nThe injected code copies xxxx.exe to\n%System%\\winsys.exe and connects\nto the Command and Control (C&C) server on TCP port 80.\n\nThe communication with the server is a handshake using an encryption algorithm (Camellia). Once the Trojan\nestablishes the server’s authenticity, it expects a variable-size block of binary code that is read from the server\nstraight into the virtual space for iexplore.exe and then executed.\n\nWhen an executable is compiled, the compiler will store some metadata in the compiled executable. One particu­\nlar piece of relevant metadata is the location of the compiled code on disk. The path in this instance contained\nChinese characters and was:\n\nC:\\Documents and Settings\\Administrator\\桌面\\新建文件夹\\读取文件\\Release\\读取文件.pdb\n\nThis translates to:\n\nC:\\Documents and Settings\\Administrator\\[Desktop]\\[New Folder]\\[read the file]\\Release\\[read the file].pdb\n\n\n-----\n\n##### Command and Control (C&C)\n\nWhen executed, the Poison Ivy threat, or Backdoor.Odivy, connects to a command and control (C&C) server over\nTCP port 80. A number of different C&C domains and IP addresses were identified. The domains and IPs are\nlisted in table 1.\n\nThe majority of samples connect to Table 1\na domain; however one subset of C&C domains and IPs\nsamples connected directly to the IP\n\n###### Domain IPs\n\naddress 204.74.215.58, which be­\nlonged to the Chinese QQ user men­ pr[REMOVED].noip.org 173.252.207.71, 173.252.205.36, 173.252.205.37,\n\n173.252.205.64\n\ntioned previously and was also associ­\nated with antivirus-groups.com. antivirus-groups.com 74.82.166.205, 204.74.215.58\n\n#### Related Attacks domain.rm6.org 216.131.95.22, 222.255.28.27\n\nSeveral other hacker groups have also anti-virus.sytes.net 173.252.205.36, 173.252.205.37, 173.252.205.64\nbegun targeting some of the same\nchemical companies in this time pe­\nriod. Attackers are sending malicious PDF and DOC files, which use exploits to drop variants of Backdoor.Sogu.\nThis particular threat was also used by hackers to compromise a Korean social network site to steal records of 35\nmillion users.\n\nDetermining if the two groups are related is difficult, but any relationship appears unlikely. The attackers\ndescribed in this document use a very basic delivery platform; compressed self-extracting archives sometimes\nsent to a large number of recipients. The Sogu gang, in contrast, use PDF and DOC files in very tailored, targeted\nemails. The Sogu gang use a custom developed threat – Backdoor.Sogu, whereas the group described in this\ndocument use an off the shelf threat – Poison Ivy. While the number of Sogu targets is currently small relative to\nthe Poison Ivy attacks, we continue to monitor their activities.\n\n#### Summary\n\nNumerous targeted attack campaigns are occurring every week. However, relative to the total number of at­\ntacks, few are fully disclosed. These attacks are primarily targeting private industry in search of key intellectual\nproperty for competitive advantage, military institutions, and governmental organizations often in search of\ndocuments related to current political events and human rights organizations.\n\nThis attack campaign focused on the chemical sector with the goal of obtaining sensitive documents such as pro­\nprietary designs, formulas, and manufacturing processes.\n\n|Table 1|Col2|\n|---|---|\n|C&C domains and IPs||\n|Domain|IPs|\n|pr[REMOVED].noip.org|173.252.207.71, 173.252.205.36, 173.252.205.37, 173.252.205.64|\n|antivirus-groups.com|74.82.166.205, 204.74.215.58|\n|domain.rm6.org|216.131.95.22, 222.255.28.27|\n|anti-virus.sytes.net|173.252.205.36, 173.252.205.37, 173.252.205.64|\n\n\n-----\n\n#### Appendix\n\nExample MD5s of PoisonIvy samples used in these attacks:\n\n     - 091457444b7e7899c242c5125ddc0571\n\n     - 6e99585c3fbd4f3a55bd8f604cb35f38\n\n     - 07e266f7fb3c36a1f3a5c5d2d229a478\n\n     - 17e7022496d8092d3ca76ae9524a7260\n\n     - 2f37912e7cb6e5c478e6dc3d0e381a24\n\n     - 5d075e9536c5494745135c1176981c96\n\n     - 76000c77ea9a214f5b2ae8cc387809db\n\n     - a98d2c90b9494fc885c7cd35d43666ea\n\n     - c128c40bd8acb282288e8138352ce4e1\n\n     - cab66da82594ff5266ac8dd89e3d1539\n\n     - 70fcb3446fce23b18d9a12b2ed911e52\n\n     - c53c93a445d751387eb167e5a2b901da\n\n     - dd5715cb3b0cdddbe131f03cc08f0f57\n\n     - 0f54a9757f1a2fef2b04b776714a7546\n\n     - 37f70717f549f1938e5785527e56978d\n\n     - 31346e5b39ddb095d76071ac86da4c2e\n\n     - 330ddac1f605ff8abf60880c584ed797\n\n     - 457a2a8d0784e9fc8e49f6ef60f7f29e\n\n     - 87aeec7f7c4ec1b6dc5e6c39b28d8273\n\n     - 8d36fd85d9c7d1f4bb170a28cc23498a\n\n     - de7e293aa9c4d849dc080f3e87573b24\n\n     - 64a4ad90a55e7b6c30c46135435f50a2\n\n\n-----\n\nAny technical information that is made available by Symantec Corporation is the copyrighted work of Symantec Corporation and is owned by Symantec\nCorporation.\n\nNO WARRANTY . The technical information is being delivered to you as is and Symantec Corporation makes no warranty as to its accuracy or use. Any use of the\ntechnical documentation or the information contained herein is at the risk of the user. Documentation may include technical or other inaccuracies or typographical\nerrors. Symantec reserves the right to make changes without prior notice.\n\n**About Symantec**\nSymantec is a global leader in\nproviding security, storage and\nsystems management solutions to\n\nhelp businesses and consumers\nsecure and manage their information.\nHeadquartered in Moutain View, Calif.,\n\n\ntechnical documentation or the information contained herein is at the risk of the user. Documentation may include technical or other inaccuracies or typographical\nerrors. Symantec reserves the right to make changes without prior notice.\n\n**About Symantec**\nSymantec is a global leader in\nproviding security, storage and\nsystems management solutions to\n\n\n**About the authors**\nEric Chien is a Technical Director for Security Response and\nGavin O’Gorman is a Security Response Manager in Symantec.\n\n\nFor specific country offices and contact num­\nbers, please visit our Web site. For product\ninformation in the U.S., call\ntoll-free 1 (800) 745 6054.\n\n\nSymantec Corporation\n\nWorld Headquarters\n\n350 Ellis Street\nMountain View, CA 94043 USA\n\n+1 (650) 527-8000\nwww.symantec.com\n\n\nSymantec has operations in more\nthan 40 countries. More information\n\nis available at www.symantec.com.\n\nCopyright © 2011 Symantec Corporation. All rights reserved.\nSymantec and the Symantec logo are trademarks or registered\n\ntrademarks of Symantec Corporation or its affiliates in the\nU.S. and other countries. Other names may be trademarks of\n\ntheir respective owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/sp5gpgu0xpf0dsfxj269ptxyyzm0ohkf",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2011/2011.10.31.Nitro/the_nitro_attacks.pdf",
        "https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2011/the_nitro_attacks.pdf",
        "https://papers.vx-underground.org/papers/ICS SCADA/Other/The Nitro Attacks.pdf"
    ],
    "report_names": [
        "the_nitro_attacks",
        "the_nitro_attacks.pdf",
        "The Nitro Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041484,
    "ts_creation_date": 1319801570,
    "ts_modification_date": 1319801601,
    "files": {
        "pdf": "https://archive.orkl.eu/f26ddf5c622dd52fc46cd46813c9552a08214587.pdf",
        "text": "https://archive.orkl.eu/f26ddf5c622dd52fc46cd46813c9552a08214587.txt",
        "img": "https://archive.orkl.eu/f26ddf5c622dd52fc46cd46813c9552a08214587.jpg"
    }
}