{
    "id": "de2e1cb3-3994-4429-b991-719164271f00",
    "created_at": "2023-01-12T15:00:04.815889Z",
    "updated_at": "2025-03-27T02:05:51.416944Z",
    "deleted_at": null,
    "sha1_hash": "a22cdf88b561f34ed0d4da7d2ec3b2d1a516aedf",
    "title": "2021-11-23 - RATDispenser- Stealthy JavaScript Loader Dispensing RATs into the Wild",
    "authors": "",
    "file_creation_date": "2022-05-28T19:09:13Z",
    "file_modification_date": "2022-05-28T19:09:13Z",
    "file_size": 2712467,
    "plain_text": "# Recent Posts\n\n**[threatresearch.ext.hp.com/javascript-malware-dispensing-rats-into-the-wild/](https://threatresearch.ext.hp.com/javascript-malware-dispensing-rats-into-the-wild/)**\n\nNovember 23, 2021\n\n[HP Threat Research Blog • RATDispenser: Stealthy JavaScript Loader Dispensing RATs into](https://threatresearch.ext.hp.com/blog/)\nthe Wild\n\n## RATDispenser: Stealthy JavaScript Loader Dispensing RATs into the Wild\n\nThreat actors are always looking for stealthy ways of delivering malware without being\ndetected. In this article, we describe how attackers are using an evasive JavaScript loader,\nthat we call RATDispenser, to distribute remote access Trojans (RATs) and information\nstealers. With an 11% detection rate, RATDispenser appears to be effective at evading\nsecurity controls and delivering malware. In total, we identified eight malware families\ndistributed using this malware during 2021. All the payloads were RATs, designed to steal\ninformation and give attackers control over victim devices.\n\nAs with most attacks involving JavaScript malware, RATDispenser is used to gain an initial\nfoothold on a system before launching secondary malware that establishes control over the\ncompromised device. Interestingly, our investigation found that RATDispenser is\npredominantly being used as a dropper (in 94% of samples analyzed), meaning the malware\ndoesn’t communicate over the network to deliver a malicious payload. The variety in malware\nfamilies, many of which can be purchased or downloaded freely from underground\n\n\n-----\n\nmarketplaces, and the preference of malware operators to drop their payloads, suggest that\nthe authors of RATDispenser may be operating under a malware-as-a-service business\nmodel.\n\nIn this report we:\n\nAnalyze the infection chain of RATDispenser and suggest detection opportunities for\ndetecting and blocking the malware\nDescribe how RATDispenser is obfuscated\nDiscuss the malware families distributed by RATDispenser\n[Share a YARA rule and a Python extraction script so that network defenders can detect](https://github.com/hpthreatresearch/tools/tree/main/ratdispenser)\nand analyze this malware\n\n## Infection Chain\n\nFigure 1 – Email delivering RATDispenser as an attachment.\n\nThe infection chain begins with a user receiving an email containing a malicious attachment.\nFor example, Figure 1 shows a JavaScript file (.js) masquerading as a text file, supposedly\ncontaining information about an order. The user simply needs to double-click the file to run\nthe malware.\n\n\n-----\n\n[Network defenders can prevent infection by blocking executable email attachment file types](https://docs.microsoft.com/en-us/exchange/security-and-compliance/mail-flow-rules/inspect-message-attachments)\nfrom passing through their email gateways, for example JavaScript or VBScript. Defenders\ncan also interrupt the execution of the malware by changing the default file handler for\n[JavaScript files, only allowing digitally signed scripts to run, or](https://docs.microsoft.com/en-us/previous-versions/tn-archive/ee156597(v=technet.10)) disabling Windows Script Host\n(WSH).\n\nWhen the malware runs, the JavaScript decodes itself at runtime and writes a VBScript file to\nthe %TEMP% folder using cmd.exe. To do this, the cmd.exe process is passed a long,\nchained argument, parts of which are written to the new file using the echo function.\n\nFigure 2 – Process execution graph showing chained command line argument.\n\nAfterwards, the VBScript file runs, which in turn downloads the malware payload. If it was\ndownloaded successfully, it is executed, and the VBScript file is deleted.\n\n## Obfuscation\n\nThe initial JavaScript downloader is obfuscated and contains several eval functions. One of\nthe eval calls is a function that returns a long string, which is decoded by another function.\n\nFigure 3 – Snippet from obfuscated JavaScript downloader.\n\nThe function that decodes the string is located further down in the script. At first sight it looks\ncomplicated, but it is a simple replacement function. First, the passed arguments are stored\nin a new variable. It is done this way to work correctly with an arbitrary number of arguments.\nNext, the replacement operation runs on the initial string. The second argument of the\nreplace function in JavaScript is another function which returns the replacement string. In this\n\n\n-----\n\ncase, the second argument to this inline function is the capturing group which matches the\nregular expression {\\d+}. Since the capturing group is a decimal number, it is used as an\nindex for the arguments array which is returned as a replacement string. In case of an index\nout of bounds exception, the function returns the whole matching string, which was most\nlikely implemented to handle mismatches.\n\nFigure 4 – Deobfuscation function using regular expression replacement.\n\nTo decode the string shown in Figure 3, three arguments (A, u, F) are passed to the function.\nThe decoded string is Base64 encoded which can simply be decoded to analyze it in more\ndetail. By creating and writing an ActiveX Data Stream Object this sequence is decoded and\nexecuted using an eval statement. The newly decoded second stage code looks as follows\n(Figure 5).\n\nFigure 5 – Decoded JavaScript downloader string.\n\nThe most notable part of this sequence are the hex characters stored in a nested array,\nwhich is used as another layer of obfuscation. Using an ActiveX object, a shell application\ninstance is created, passing a long, chained argument. By simply adding line breaks after the\n_& characters, we can reformat the command line argument into a readable format._\n\n\n-----\n\nFigure 6 – Command line arguments passed to cmd.exe.\n\nThe first parts of the command line argument are used to write lines to a VBScript file using\nan echo function. This file is then executed, resulting in a download through an XMLHTTP\nobject. The response to the GET request – the malware payload – is written to a file called\n_YVC.JAR. The VBScript file is then deleted. Afterwards, the cmd.exe process waits 12_\nseconds, before running the payload.\n\n## Malware Payloads\n\nWe have seen RATDispenser distribute eight malware families. In the example above, it\n[delivered Formbook, a keylogger and information stealer. To analyze which malware families](https://malpedia.caad.fkie.fraunhofer.de/details/win.formbook)\nthe loader is spreading, we wrote a signature to track sightings in the wild. Its obfuscation\nmade this task more complicated than usual. The malware splits strings using the replace\n\n\n-----\n\nfunction, stores them in nested arrays, and interprets and executes commands using eval\nfunctions, so it is difficult to find consistent patterns in them. Nevertheless, we wrote a YARA\nrule (Figure 7) to understand the dispersion of malware families.\n```\nrule js_RATDispenser : downloader\n{\n meta:\n  description = \"JavaScript downloader resp. dropper delivering various RATs\"\n  author = \"HP Threat Research @HPSecurity\"\n  filetype = \"JavaScript\"\n  maltype = \"Downloader\"\n  date = \"2021-05-27\" \n strings:\n  $a = /{(\\d)}/\n  $c1 = \"/{(\\\\d+)}/g\"\n  $c2 = \"eval\"\n  $c3 = \"prototype\"\n  $d1 = \"\\\\x61\\\\x64\\\\x6F\\\\x64\\\\x62\\\\x2E\"\n  $d2 = \"\\\\x43\\\\x68\\\\x61\\\\x72\\\\x53\\\\x65\\\\x74\"\n  $d3 = \"\\\\x54\\\\x79\\\\x70\\\\x65\"\n  $e1 = \"adodb.\"\n  $e2 = \"CharSet\"\n  $e3 = \"Type\"\n  $f1 = \"arguments\"\n  $f2 = \"this.replace\"\n condition:\n  #a > 50 and all of ($c*) and (any of ($d*) or any of ($e*)) and all of ($f*) and\nfilesize < 2MB\n}\n\n```\nFigure 7 – YARA rule to detect RATDispenser.\n\nRunning a retrohunt over the last three months with this YARA rule identified 155\nRATDispenser samples. Within those samples we noticed three variants. One of the variants\nwe described above. The two other variants are a PowerShell downloader and a dropper\nwhich stores the payload as a Base64-encoded string and therefore does not perform any\nnetwork requests.\n\nWe also wrote a [Python script that recovers the final payload and identifies the malware](https://github.com/hpthreatresearch/tools/blob/main/ratdispenser/decode.py)\nfamily and RATDispenser variant. Analyzing the 155 malware samples with our script found:\n\n145 of the 155 samples (94%) were droppers. Only 10 samples were downloaders that\ncommunicate over the network to download a secondary stage of malware\n8 malware families delivered as payloads\n\n\n-----\n\nAll the payloads were remote access Trojans (RATs), keyloggers and information\nstealers\n\nFigure 8 – Malware families distributed by RATDispenser.\n\n[By far the most frequently observed malware families were STRRAT and](https://malpedia.caad.fkie.fraunhofer.de/details/jar.strrat) [WSHRAT,](https://malpedia.caad.fkie.fraunhofer.de/details/win.houdini)\naccounting for 81% of the samples we analyzed. First seen in mid-2020, STRRAT is a Java\nRAT that has remote access, credential stealing and keylogging features. WSHRAT, also\nknown as Houdini, is a VBS RAT first seen in 2013 that also has typical RAT capabilities.\nSlightly less common were AdWind, Formbook, Remcos and Panda Stealer.\n\n[The most interesting among them is Panda Stealer. First seen in April 2021, this is a new](https://www.trendmicro.com/en_us/research/21/e/new-panda-stealer-targets-cryptocurrency-wallets-.html)\nmalware family that targets cryptocurrency wallets. The Panda Stealer sample we analyzed\nwere all fileless variants that download additional payloads from a text storage site, paste.ee.\n[The least common families were GuLoader and](https://malpedia.caad.fkie.fraunhofer.de/details/win.cloudeye) [Ratty. GuLoader is a downloader known for](https://malpedia.caad.fkie.fraunhofer.de/details/jar.ratty)\ndownloading and running various RATs, while Ratty is an open-source RAT written in Java.\n\nFigure 9 shows the different variants and the malware families distributed through them.\nCertain malware families were always downloaded – Panda Stealer and Formbook – rather\nthan dropped. Because this JavaScript malware can operate as a downloader or as a\ndropper, and distributes RATs exclusively, we refer to it internally as RATDispenser.\n\n\n-----\n\nFigure 9 – Overview of RATDispenser variants and the malware families they delivered.\n\n## Detection\n\nAlthough JavaScript is a less common malware file format than Microsoft Office documents\nand archives, in many cases it is more poorly detected. From our set of 155 RATDispenser\nsamples, 77 were available on VirusTotal which allowed us to analyze their detection rates.\nUsing each sample’s earliest scan result, on average the RATDispenser samples were only\ndetected by 11% of available anti-virus engines, or eight engines in absolute numbers.\n\n## Indicators of Compromise\n\nYou can find the full set of hashes, URLs, YARA rule and extraction script in the HP Threat\nResearch GitHub repository.\n\n00853f4f702bf8a3c82edbd1892c19aaa612f03d4541625068c01d0f56d4415b : RatLoader \n- Formbook\n\n026b19fdc75b76cd696be8a3447a5d23a944a7f99000e7fae1fa3f6148913ff3 : RatDropper \n- STRRAT\n\n0383ab1a08d615632f615aa3c3c49f3b745df5db1fbaba9f9911c1e30aabb0a5 : RatDropper \n- WSHRAT\n\n094ddd437277579bf1c6d593ce40012222d8cea094159081cb9d8dc28a928b5a : RatDropper \n- AdWind\n\n2f9a0a3e221a74f1829eb643c472c3cc81ddf2dc0bed6eb2795b4f5c0d444bc9 : RatDropper \n- RemcosRAT\n\n942224cb4b458681cd9d9566795499929b3cedb7b4e6634c2b24cd1bf233b19a : RatLoader \n\n-----\n\n- Panda Stealer\nb42c6b4dd02bc3542a96fffe21c0ab2ae21ddba4fef035a681b5a454607f6e92 : RatDropper \n- GuLoader\n\nTags\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-23 - RATDispenser- Stealthy JavaScript Loader Dispensing RATs into the Wild.pdf"
    ],
    "report_names": [
        "2021-11-23 - RATDispenser- Stealthy JavaScript Loader Dispensing RATs into the Wild.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535604,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653764953,
    "ts_modification_date": 1653764953,
    "files": {
        "pdf": "https://archive.orkl.eu/a22cdf88b561f34ed0d4da7d2ec3b2d1a516aedf.pdf",
        "text": "https://archive.orkl.eu/a22cdf88b561f34ed0d4da7d2ec3b2d1a516aedf.txt",
        "img": "https://archive.orkl.eu/a22cdf88b561f34ed0d4da7d2ec3b2d1a516aedf.jpg"
    }
}