{
    "id": "de68f5cb-e4be-474b-9745-f32460deb84e",
    "created_at": "2023-01-12T15:02:38.063819Z",
    "updated_at": "2025-03-27T02:05:18.061518Z",
    "deleted_at": null,
    "sha1_hash": "207e64a3c7b53a3a318175743270288242c71a67",
    "title": "2020-11-06 - RansomEXX Trojan attacks Linux systems",
    "authors": "",
    "file_creation_date": "2022-05-28T19:36:22Z",
    "file_modification_date": "2022-05-28T19:36:22Z",
    "file_size": 1894430,
    "plain_text": "# RansomEXX Trojan attacks Linux systems\n\n**[securelist.com/ransomexx-trojan-attacks-linux-systems/99279/](https://securelist.com/ransomexx-trojan-attacks-linux-systems/99279/)**\n\nAuthors\n\nFedor Sinitsyn\n\n[Vladimir Kuskov](https://securelist.com/author/vladimirkuskov/)\n\nWe recently discovered a new file-encrypting Trojan built as an ELF executable and intended\nto encrypt data on machines controlled by Linux-based operating systems.\n\nAfter the initial analysis we noticed similarities in the code of the Trojan, the text of the\nransom notes and the general approach to extortion, which suggested that we had in fact\nencountered a Linux build of the previously known ransomware family RansomEXX. This\nmalware is notorious for attacking large organizations and was most active earlier this year.\n\nRansomEXX is a highly targeted Trojan. Each sample of the malware contains a hardcoded\nname of the victim organization. Moreover, both the encrypted file extension and the email\naddress for contacting the extortionists make use of the victim’s name.\n\nSeveral companies have fallen victim to this malware in recent months, including the Texas\nDepartment of Transportation (TxDOT) and [Konica Minolta.](https://www.bleepingcomputer.com/news/security/business-technology-giant-konica-minolta-hit-by-new-ransomware/)\n\n\n-----\n\n## Technical description\n\n[The sample we came across – aa1ddf0c8312349be614ff43e80a262f – is a 64-bit ELF](https://opentip.kaspersky.com/aa1ddf0c8312349be614ff43e80a262f/)\nexecutable. The Trojan implements its cryptographic scheme using functions from the opensource library mbedtls.\n\nWhen launched, the Trojan generates a 256-bit key and uses it to encrypt all the files\nbelonging to the victim that it can reach using the AES block cipher in ECB mode. The AES\nkey is encrypted by a public RSA-4096 key embedded in the Trojan’s body and appended to\neach encrypted file.\n\nAdditionally, the malware launches a thread that regenerates and re-encrypts the AES key\nevery 0.18 seconds. However, based on an analysis of the implementation, the keys actually\nonly differ every second.\n\nApart from encrypting the files and leaving ransom notes, the sample has none of the\nadditional functionality that other threat actors tend to use in their Trojans: no C&C\ncommunication, no termination of running processes, no anti-analysis tricks, etc.\n\n\n-----\n\n**_Fragment of the file encryption procedure pseudocode; variable and function names_**\n**_are saved in the debug information and must match the original source code_**\n\nCuriously, the ELF binary contains some debug information, including names of functions,\nglobal variables and source code files used by the malware developers.\n\n**_Original names of source files embedded in the trojan’s body_**\n\n**_Execution log of the trojan in Kaspersky Linux Sandbox_**\n\n## Similarities with Windows builds of RansomEXX\n\nDespite the fact that previously discovered PE builds of RansomEXX use WinAPI (functions\nspecific to Windows OS), the organization of the Trojan’s code and the method of using\nspecific functions from the mbedtls library hint that both ELF and PE may be derived from the\nsame source code.\n\nIn the screenshot below, we see a comparison of the procedures that encrypt the AES key.\nOn the left is the ELF sample aa1ddf0c8312349be614ff43e80a262f; on the right is the PE\nsample fcd21c6fca3b9378961aa1865bee7ecb used in the TxDOT attack.\n\nDespite being built by different compilers with different optimization options and for different\nplatforms, the similarity is quite obvious.\n\n\n-----\n\nWe also observe resemblances in the procedure that encrypts the file content, and in the\noverall layout of the code.\n\nWhat’s more, the text of the ransom note is also practically the same, with the name of the\nvictim in the title and equivalent phrasing.\n\n## Parallels with a recent attack in Brazil\n\nAs [reported by the media, one of the country’s government institutions has just been](https://www.bleepingcomputer.com/news/security/brazils-court-system-under-massive-ransomexx-ransomware-attack/)\nattacked by a targeted ransomware Trojan.\n\nBased on the ransom note, which is almost identical to the one in the sample we described,\nand the news article mentioned above, there is a high probability that the target is the victim\nof another variant of RansomEXX.\n\n**_Ransom note from the sample aa1ddf0c8312349be614ff43e80a262f_**\n\n\n-----\n\n**_Ransom note from the Bleeping Computer post about the most recent attack in Brazil_**\n\nOur products protect against this threat and detect it as Trojan-Ransom.Linux.Ransomexx\n\n**_Kaspersky Threat Attribution Engine identifies Ransomexx malware family_**\n\n## Indicators of compromise\n\n[Recent Linux version: aa1ddf0c8312349be614ff43e80a262f](https://opentip.kaspersky.com/aa1ddf0c8312349be614ff43e80a262f/)\n\n[Earlier Windows version: fcd21c6fca3b9378961aa1865bee7ecb](https://opentip.kaspersky.com/fcd21c6fca3b9378961aa1865bee7ecb/)\n\n[Encryption](https://securelist.com/tag/encryption/)\n[Linux](https://securelist.com/tag/linux/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\n\n-----\n\nFedor Sinitsyn\n\n[Vladimir Kuskov](https://securelist.com/author/vladimirkuskov/)\n\nRansomEXX Trojan attacks Linux systems\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-06 - RansomEXX Trojan attacks Linux systems.pdf"
    ],
    "report_names": [
        "2020-11-06 - RansomEXX Trojan attacks Linux systems.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535758,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653766582,
    "ts_modification_date": 1653766582,
    "files": {
        "pdf": "https://archive.orkl.eu/207e64a3c7b53a3a318175743270288242c71a67.pdf",
        "text": "https://archive.orkl.eu/207e64a3c7b53a3a318175743270288242c71a67.txt",
        "img": "https://archive.orkl.eu/207e64a3c7b53a3a318175743270288242c71a67.jpg"
    }
}