{
    "id": "df20c57f-35a1-456d-bbde-bb49ca0d5086",
    "created_at": "2023-01-12T14:59:20.805919Z",
    "updated_at": "2025-03-27T02:08:33.325022Z",
    "deleted_at": null,
    "sha1_hash": "66a81cd042a3d6ba1f79043fe4036c054114ba3b",
    "title": "2022-11-30 - LockBit 3.0 ‘Black’ attacks and leaks reveal wormable capabilities and tooling",
    "authors": "",
    "file_creation_date": "2022-12-29T00:20:49Z",
    "file_modification_date": "2022-12-29T00:20:49Z",
    "file_size": 3149954,
    "plain_text": "# LockBit 3.0 ‘Black’ attacks and leaks reveal wormable capabilities and tooling\n\n**[news.sophos.com/en-us/2022/11/30/lockbit-3-0-black-attacks-and-leaks-reveal-wormable-capabilities-and-tooling/](https://news.sophos.com/en-us/2022/11/30/lockbit-3-0-black-attacks-and-leaks-reveal-wormable-capabilities-and-tooling/)**\n\nAndrew Brandt November 30, 2022\n\nA postmortem analysis of multiple incidents in which attackers eventually launched the latest\n[version of LockBit ransomware (known variously as LockBit 3.0 or ‘LockBit Black’), revealed](https://twitter.com/vxunderground/status/1541156954214727685)\nthe tooling used by at least one affiliate. Sophos’ Managed Detection and Response (MDR)\nteam has observed both ransomware affiliates and legitimate penetration testers use the\nsame collection of tooling over the past 3 months.\n\n[Leaked data about LockBit that showed the backend controls for the ransomware also](https://twitter.com/vxunderground/status/1528801206923141122)\nseems to indicate that the creators have begun experimenting with the use of scripting that\nwould allow the malware to “self-spread” using Windows Group Policy Objects (GPO) or the\ntool PSExec, potentially making it easier for the malware to laterally move and infect\ncomputers without the need for affiliates to know how to take advantage of these features for\nthemselves, potentially speeding up the time it takes them to deploy the ransomware and\nencrypt targets.\n\nA reverse-engineering analysis of the LockBit functionality shows that the ransomware has\ncarried over most of its functionality from LockBit 2.0 and adopted new behaviors that make\nit more difficult to analyze by researchers. For instance, in some cases it now requires the\n\n\n-----\n\naffiliate to use a 32-character password in the command line of the ransomware binary\nwhen launched, or else it won’t run, though not all the samples we looked at required the\npassword.\n\nWe also observed that the ransomware runs with LocalServiceNetworkRestricted\npermissions, so it does not need full Administrator-level access to do its damage (supporting\nobservations of the malware made by other researchers).\n\nMost notably, we’ve observed (along with other researchers) that many LockBit 3.0 features\nand subroutines appear to have been lifted directly from BlackMatter ransomware.\n\n## Is LockBit 3.0 just ‘improved’ BlackMatter?\n\n[Other researchers previously noted that LockBit 3.0 appears to have adopted (or heavily](https://blog.cluster25.duskrise.com/2022/07/06/lockbit-3-0-making-the-ransomware-great-again)\nborrowed) several concepts and techniques from the BlackMatter ransomware family.\n\nWe dug into this ourselves, and found a number of similarities which strongly suggest that\nLockBit 3.0 reuses code from BlackMatter.\n\n**Anti-debugging trick**\n\nBlackmatter and Lockbit 3.0 use a specific trick to conceal their internal functions calls from\nresearchers. In both cases, the ransomware loads/resolves a Windows DLL from its hash\ntables, which are based on ROT13.\n\nIt will try to get pointers from the functions it needs by searching the PEB (Process\nEnvironment Block) of the module. It will then look for a specific binary data marker in the\ncode (0xABABABAB) at the end of the heap; if it finds this marker, it means someone is\ndebugging the code, and it doesn’t save the pointer, so the ransomware quits.\n\nAfter these checks, it will create a special stub for each API it requires. There are five\ndifferent types of stubs that can be created (randomly). Each stub is a small piece of\nshellcode that performs API hash resolution on the fly and jumps to the API address in\nmemory. This adds some difficulties while reversing using a debugger.\n\n\n-----\n\nLockBit’s 0xABABABAB marker\n[SophosLabs has put together a CyberChef recipe for decoding these stub shellcode](https://gchq.github.io/CyberChef/#recipe=Disassemble_x86('32','Full%20x86%20architecture',16,0,true,true)&input=QjggNDQ4M2Y2NjAKQzFDMCAwNApGRkUw)\nsnippets.\n\n\n-----\n\nThe\n\n[first stub, as an example (decoded with CyberChef)](https://gchq.github.io/CyberChef/#recipe=Disassemble_x86('32','Full%20x86%20architecture',16,0,true,true)&input=QjggNDQ4M2Y2NjAKQzFDMCAwNApGRkUw)\n\n**Obfuscation of strings**\n\nMany strings in both LockBit 3.0 and BlackMatter are obfuscated, resolved during runtime by\npushing the obfuscated strings on to the stack and decrypting with an XOR function. In both\nLockBit and BlackMatter, the code to achieve this is very similar.\n\n[BlackMatter’s string obfuscation (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\n\n\n-----\n\nGeorgia Tech student [Chuong Dong analyzed BlackMatter and showed this feature on his](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\nblog, with the screenshot above.\n\nLockBit’s string obfuscation, in comparison\nBy comparison, LockBit 3.0 has adopted a string obfuscation method that looks and works in\na very similar fashion to BlackMatter’s function.\n\n**API resolution**\n\nLockBit uses exactly the same implementation as BlackMatter to resolve API calls, with one\nexception: LockBit adds an extra step in an attempt to conceal the function from debuggers.\n\n\n-----\n\n[BlackMatter’s dynamic API resolution (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\nThe array of calls performs precisely the same function in LockBit 3.0.\n\n\n-----\n\nLockBit’s dynamic API resolution\n\n**Hiding threads**\n\nBoth LockBit and BlackMatter hide threads using the NtSetInformationThread function, with\nthe parameter ThreadHideFromDebugger. As you probably can guess, this means that the\ndebugger doesn’t receive events related to this thread.\n\nLockBit employs the same ThreadHideFromDebugger feature as an evasion technique\n\n**Printing**\n\nLockBit, like BlackMatter, sends ransom notes to available printers.\n\n\n-----\n\nLockBit can send its ransom notes directly to printers, as BlackMatter can do\n\n**Deletion of shadow copies**\n\nBoth ransomware will sabotage the infected computer’s ability to recover from file encryption\nby deleting the Volume Shadow Copy files.\n\nLockBit calls the IWbemLocator::ConnectServer method to connect with the local\nROOT\\CIMV2 namespace and obtain the pointer to an IWbemServices object that eventually\ncalls IWbemServices::ExecQuery to execute the WQL query.\n\n[BlackMatter code for deleting shadow copies (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\nLockBit’s method of doing this is identical to BlackMatter’s implementation, except that it\nadds a bit of string obfuscation to the subroutine.\n\n\n-----\n\nLockBit’s deletion of shadow copies\n\n**Enumerating DNS hostnames**\n\nBoth LockBit and BlackMatter enumerate hostnames on the network by calling\n_NetShareEnum._\n\n\n-----\n\n[BlackMatter calls NetShareEnum() to enumerate hostnames… (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\nIn the source code for LockBit, the function looks like it has been copied, verbatim, from\nBlackMatter.\n\n…\n\nas does LockBit\n\n**Determining the operating system version**\n\nBoth ransomware strains use identical code to check the OS version – even using the same\nreturn codes (although this is a natural choice, since the return codes are hexadecimal\nrepresentations of the version number).\n\n\n-----\n\n[BlackMatter’s code for checking the OS version (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\n\n\n-----\n\nLockBit’s OS enumeration routine\n\n**Configuration**\n\nBoth ransomware contain embedded configuration data inside their binary executables. We\nnoted that LockBit decodes its config in a similar way to BlackMatter, albeit with some small\ndifferences.\n\nFor instance, BlackMatter saves its configuration in the .rsrc section, whereas LockBit stores\nit in .pdata.\n\n\n-----\n\n[BlackMatter’s config decryption routine (image credit: Chuong Dong)](https://chuongdong.com/reverse%20engineering/2021/09/05/BlackMatterRansomware/)\nAnd LockBit uses a different linear congruential generator (LCG) algorithm for decoding.\n\nLockBit’s config decryption routine\n[Some researchers have speculated that the close relationship between the LockBit and](https://blog.cluster25.duskrise.com/2022/07/06/lockbit-3-0-making-the-ransomware-great-again)\nBlackMatter code indicates that one or more of BlackMatter’s coders were recruited by\nLockBit; that LockBit bought the BlackMatter codebase; or a collaboration between\n[developers. As we noted in our white paper on multiple attackers earlier this year, it’s not](https://assets.sophos.com/X24WTUEQ/at/q6r6n3x43mnrfchn5tfh3qmw/sophos-x-ops-active-adversary-multiple-attackers-wp.pdf)\nuncommon for ransomware groups to interact, either inadvertently or deliberately.\n\nEither way, these findings are further evidence that the ransomware ecosystem is complex,\nand fluid. Groups reuse, borrow, or steal each other’s ideas, code, and tactics as it suits\nthem. And, as the LockBit 3.0 leak site (containing, among other things, a bug bounty and a\n\n\n-----\n\nreward for brilliant ideas ) suggests, that gang in particular is not averse to paying for\ninnovation.\n\n## LockBit tooling mimics what legitimate pentesters would use\n\nAnother aspect of the way LockBit 3.0’s affiliates are deploying the ransomware shows that\nthey’re becoming very difficult to distinguish from the work of a legitimate penetration tester –\naside from the fact that legitimate penetration testers, of course, have been contracted by the\ntargeted company beforehand, and are legally allowed to perform the pentest.\n\nThe tooling we observed the attackers using included a package from GitHub called\n[Backstab. The primary function of Backstab is, as the name implies, to sabotage the tooling](https://github.com/Yaxser/Backstab)\nthat analysts in security operations centers use to monitor for suspicious activity in real time.\nThe utility uses Microsoft’s own Process Explorer driver (signed by Microsoft) to terminate\nprotected anti-malware processes and disable EDR utilities. Both Sophos and other\n[researchers have observed LockBit attackers using Cobalt Strike, which has become a](https://blogs.blackberry.com/en/2022/08/lockbit-3-0-ransomware-abuses-windows-defender-to-load-cobalt-strike)\nnearly ubiquitous attack tool among ransomware threat actors, and directly manipulating\nWindows Defender to evade detection.\n\nFurther complicating the parentage of LockBit 3.0 is the fact that we also encountered\nattackers using a password-locked variant of the ransomware, called lbb_pass.exe, which\nhas also been used by attackers that deploy REvil ransomware. This may suggest that there\nare threat actors affiliated with both groups, or that threat actors not affiliated with LockBit\nhave taken advantage of the leaked LockBit 3.0 builder. At least one group, BlooDy, has\nreportedly used the builder, and [if history is anything to go by, more may follow suit.](https://therecord.media/builder-for-babuk-locker-ransomware-leaked-online/)\n\nLockBit 3.0 attackers also used a number of publicly-available tools and utilities that are now\ncommonplace among ransomware threat actors, including the anti-hooking utility GMER, a\ntool called AV Remover published by antimalware company ESET, and a number of\nPowerShell scripts designed to remove Sophos products from computers where Tamper\nProtection has either never been enabled, or has been disabled by the attackers after they\nobtained the credentials to the organization’s management console.\n\n[We also saw evidence the attackers used a tool called Netscan to probe the target’s network,](https://github.com/hegusung/netscan)\nand of course, the ubiquitous password-sniffer Mimikatz.\n\n## Incident response makes no distinction\n\nBecause these utilities are in widespread use, MDR and Rapid Response treats them all\nequally – as though an attack is underway – and immediately alerts the targets when they’re\ndetected.\n\n\n-----\n\nWe found the attackers took advantage of less-than-ideal security measures in place on the\ntargeted networks. As we mentioned in our Active Adversaries Report on multiple\nransomware attackers, the lack of multifactor authentication (MFA) on critical internal logins\n(such as management consoles) permits an intruder to use tooling that can sniff or\nkeystroke-capture administrators’ passwords and then gain access to that management\nconsole.\n\nIt’s safe to assume that experienced threat actors are at least as familiar with Sophos Central\nand other console tools as the legitimate users of those consoles, and they know exactly\nwhere to go to weaken or disable the endpoint protection software. In fact, in at least one\nincident involving a LockBit threat actor, we observed them downloading files which, from\ntheir names, appeared to be intended to remove Sophos protection:\n**sophoscentralremoval-master.zip and sophos-removal-tool-master.zip. So protecting**\nthose admin logins is among the most critically important steps admins can take to defend\ntheir networks.\n\n[For a list of IOCs associated with LockBit 3.0, please see our GitHub.](https://github.com/sophoslabs/IoCs/blob/master/Ransomware-Lockbit3-IOCs.csv)\n\n## Acknowledgments\n\nSophos X-Ops acknowledges the collaboration of Colin Cowie, Gabor Szappanos, Alex\nVermaning, and Steeve Gaudreault in producing this report.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-30 - LockBit 3.0 ‘Black’ attacks and leaks reveal wormable capabilities and tooling.pdf"
    ],
    "report_names": [
        "2022-11-30 - LockBit 3.0 ‘Black’ attacks and leaks reveal wormable capabilities and tooling.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535560,
    "ts_updated_at": 1743041313,
    "ts_creation_date": 1672273249,
    "ts_modification_date": 1672273249,
    "files": {
        "pdf": "https://archive.orkl.eu/66a81cd042a3d6ba1f79043fe4036c054114ba3b.pdf",
        "text": "https://archive.orkl.eu/66a81cd042a3d6ba1f79043fe4036c054114ba3b.txt",
        "img": "https://archive.orkl.eu/66a81cd042a3d6ba1f79043fe4036c054114ba3b.jpg"
    }
}