{
    "id": "df346f8d-db51-4a89-abcb-a10993df3b8a",
    "created_at": "2023-01-12T15:05:21.273822Z",
    "updated_at": "2025-03-27T02:05:29.181707Z",
    "deleted_at": null,
    "sha1_hash": "1a3d8aec9b1406b115cb9769a40892e173019126",
    "title": "2020-12-21 - Understanding -Solorigate-'s Identity IOCs - for Identity Vendors and their customers.",
    "authors": "",
    "file_creation_date": "2022-05-29T01:25:56Z",
    "file_modification_date": "2022-05-29T01:25:56Z",
    "file_size": 444696,
    "plain_text": "# Solorigate AzureAd IOCs\n\n**techcommunity.microsoft.com/t5/azure-active-directory-identity/understanding-quot-solorigate-quot-s-identity-iocs-for-**\nidentity/ba-p/2007610\n\nDecember 21, 2020\n\n## Understanding \"Solorigate\"'s Identity IOCs - for Identity Vendors and their customers.\n\nDec 21 2020 11:46 AM\n\n[Microsoft recently disclosed a set of complex techniques used by an advanced actor to](https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/)\nexecute attacks against several key customers. While we detected anomalies by analyzing\nrequests from customer environments to the Microsoft 365 cloud, the attacks generalize to\nany Identity Provider or Service provider. For this reason, we want to detail what we know\nabout these attacks from an Identity specific lens, so Identity vendors, IAAS, PAAS, and\nSAAS vendors (and organizations who use these products) can detect them, remediate\nthem, and most importantly, prevent them. This document is broadly intended to support the\nsecurity teams who are focused on protection, hunting, and remediation in Identity vendors in\nthe interest of protecting our mutual customers. It generally assumes an advanced\nunderstanding of identity infrastructure and related components.\n\n\n-----\n\nAs part of our ongoing security processes, we leverage threat intelligence and monitor for\nnew indicators that could signal attacker activity. There are two anomalies pertinent to this\n[report, and discussed at https://aka.ms/solorigate:](https://aka.ms/solorigate)\n\n1. Anomalies in SAML tokens being presented for access. In some impacted tenants, we\n\ndetected anomalous SAML tokens - signed with customer certificates - being presented\nfor access to the Microsoft Cloud. The anomalies indicate that the customer SAML\ntoken signing certificates may have been compromised, and that an attacker could be\nforging SAML tokens to access any resources that trust those certificates. Because\ncompromise of a SAML token signing certificate typically requires administrative\naccess, there is a high probability the presence of forged tokens implies customer on\npremises infrastructure may be compromised. Because the signing certificate is the\nroot of trust for the federated trust relationship, it is unlikely Service Providers would\ndetect the forgeries.\n2. Anomalies in Microsoft 365 API access patterns in a tenant. We have detected such\n\nanomalies in some impacted tenants which originate from an existing applications and\nservice principals. This pattern indicates that an attacker with administrative credentials\n– possibly related to the SAML issues above - has added their own credentials to\nexisting applications and service principals. The Microsoft 365 application program\ninterfaces (APIs) can be used to access email, documents, chats, and configuration\nsettings, such as email forwarding. Because highly privileged Azure AD administrative\naccounts are required to add credentials to service principals, these changes imply that\none or more such privileged accounts have been compromised and may have made\nother significant changes within the impacted tenant.\n\nBuilt-in security and monitoring capabilities provided by the Microsoft Cloud detected these\nanomalies, but such anomalies could present at any Identity Provider or Resource Provider,\nregardless of vendor. Any resource which trusts a customer’s compromised SAML token\nsigning certificate should be considered at risk. The SAML attack is not specific to any\nparticular identity system or identity vendor you use. It impacts any vendor’s on-premises or\ncloud identity system, and any resources that depend on industry-standard SAML identity\nfederation. Likewise, while the specific mechanism for impersonating applications may vary\nfrom vendor to vendor, the pattern is vendor independent. We are not aware of any Microsoft\nsoftware or cloud service vulnerability that has led to the exposure of customer SAML token\nsigning certificates, the change in API usage, addition of credentials to service principals, or\nexposure of administrative credentials on premises or in the cloud. The traffic detected did\nnot impact our production cloud environment\n\nElements of the activity we have detected and discuss in this blog suggest it was\norchestrated by a sophisticated attacker. We believe over time this activity may be\ndetermined to be state-sponsored, but we do not have sufficient evidence to support that\nconclusion at this time.\n\n\n-----\n\nIt is important to emphasize – these attacks were criminal in nature, and so sophisticated\nthat even top security companies fell victim to them. The fault lies with the criminal actor, not\nthe victims. Further, these attacks leveraged broadly used patterns that impact many levels\nof the IT industry – focusing on any one technology type or vendor limits our ability to see\nsystemic problems. By studying them and learning from these broad issues together, we can\nimprove security throughout the industry.\n\nWe are sharing this information to help vendors who provide Identity Providers and Service\nProvider software and services, as well as their customers, hunt for activity and better defend\nagainst similar attacks. We will update this information as our investigations evolve.\n\n## First things first – understanding typical environments\n\n_Identity experts may skip this section, but it may help level set terminology and_\n_understanding of key components of the attack._\n\nThe following describes a typical environment. However, several caveats are worth\nmentioning:\n\n1. Most customers run on premises identity infrastructure. Microsoft offers popular\n\nversions of all such infrastructure, but several other vendors offer similar infrastructure.\n2. Not all components of this infrastructure are present in all environments.\n3. The sophisticated actor adapted their attack to specific environments.\n\nFor these reasons, it is important that you consider how elements of the attack pattern can\nimpact your organization, even if your organization varies from the typical elements\ndescribed below.\n\nComponents pertinent to this attack typically include:\n\nA SAML Identity Provider (IDP), which brokers authentication requests from\napplications to that directory. Applications and other identity providers – called Service\nProviders, or SPs – refer clients to federation servers to acquire access tokens which\nare signed by the SAML token signing certificate.\nSAML Service Providers (SP), also called Relying Parties, which are applications told\nto trust the tokens coming from a federation server, and which accept claims made in\nSAML tokens because they are signed by the trusted federation server’s SAML token\nsigning certificate.\nCloud Identity Providers (Cloud IDPs), which would typically act as a Service Provider\nto the SAML Identity Provider but acts as an identity provider to applications which\nhave been told to use it. (This is called Identity Provider chaining – where one Identity\nprovider delegates authentication to another if so configured). Azure AD is an example\nof a Cloud IDP.\n\n\n-----\n\nCloud Service Providers (Cloud SPs), which rely on the tokens issued by a cloud IDP\nto validate requests.\nApplications and Service Principals in Azure AD are two types of code that authenticate\nto Azure AD using certificates, keys, or passwords and to other applications or APIs\nusing OAuth 2.0 access tokens granted Azure AD in order to talk to other applications,\nincluding Microsoft 365 Graph APIs.\n\nTypical Components\n\nIf this is new to you, you can think of tokens as a ticket to a show, the SP as the ticket taker,\nand the IDP as the box office, and the signature as the little holograph on the ticket. If\nsomeone wants to go to the show, they go to the IDP, get a token, then present it to the SP\nwho validates the holograph then lets them into the show.\n\nIn terms of a typical email interaction with Microsoft 365 with federated auth, think in terms of\na user going to their on premises federation server to get a signed token, then presenting\nthat token to Microsoft 365 (via Azure AD as a chained IDP) to get access after the signature\nis validated. If an application is trying to access that data, it will be pre-configured to know\nthe IDP location, so it will always come to Azure AD first to get the token, but otherwise the\nOAUTH flows are similar.\n\nFor SAML federation relationships where Azure AD has been configured to trust a tenantconfigured SAML token signing certificate from a customer-configured federation server, the\nfederation server is the Identity Provider (IDP)and Azure AD is the Service Provider (SP).\n\nApplications and Service Principals in Azure AD don’t use SAML or delegate trust to on\npremises federation servers; credentials must be managed directly in Azure AD.\n\n## Attacker Patterns\n\n\n-----\n\nOK, let s lay all of this out in terms of the typical attack patterns, and how you might go about\nlooking for them. The actions were targeted in nature and varied from target to target. Not all\nindicators of compromise or methodologies are present in all cases.\n\n[A rough overview of an indicative attack is as follows (see also https://aka.ms/solorigate).](https://aka.ms/solorigate)\nEach attack varied in details, but this pattern emerged repeatedly:\n\nThe attacker compromises network management vendor software which is typically\ndeployed with high privileges in on premises networks.\nThe attacker uses the on premises administrative access to extract SAML Token\nSigning certificate.\nThe attacker uses the stolen SAML Token Signing certificate to forge SAML tokens\nrepresenting privileged cloud users.\nThe attacker uses the forged token to sign in impersonating the privileged user and add\ncredentials to an existing application or service principal.\nThe attacker uses the added credentials to impersonate the existing application or\nservice principal, and call Microsoft 365 APIs to extract mail.\n\nAttacker Patterns\n\nThe details of each phase of the attack are described below.\n\n## Pattern 1: Forged SAML tokens using Stolen SAML Token Signing Material\n\n\n-----\n\nThe first significant pattern we have seen is evidence of forged SAML tokens. It is worth\nnoting that we don’t retain logs for very long. We do this in accordance with our data\nretention and privacy policies. It varies by agreement, but is generally is 30 days, and we\nnever log complete tokens, so we can’t see every aspect of a SAML token. Customers who\nwant longer retention are encouraged to configure storage in Azure Monitor or other\nsystems. What token anomalies we did detect were tokens which were anomalous in\nlifetime, usage location, or claims (particularly MFA claims). The anomalies were sufficient to\nconvince us that the tokens were forged. We did not find this pattern in all cases.\n\n### What we found\n\nTokens with expiration instant exactly 3600 seconds or 144000 seconds (no\nmilliseconds value) – note 144000 (40 hours) is exceptionally long\nTokens which were received at the same time as the issuance time– no latency\nbetween creation and usage\nTokens which were received BEFORE the issuance time – falsified issuance time after\ntoken received\nTokens used from outside normal user locations\nTokens which contained claims which were not previously seen from the tenant’s\nfederation server\nTokens indicating MFA used when token claimed auth from within corporate boundary\nwhere MFA not required\n\n### What it implies\n\nSAML token signing certificate was exfiltrated from the customer environment and used\nto forge tokens by the actor.\nAdministrative access to SAML Token Signing Certificate storage compromised, either\nvia service administrative access or by direct device storage or memory inspection.\nDeep penetration of the customer environment, with administrative access to identity\ninfrastructure or the hardware environment on which it executes.\n\n### What to look for\n\nSAML Tokens received by the SP with configurations which deviate from the IDP’s\nconfigured behavior.\nSAML Tokens received by the SP without corresponding issuing logs at the IDP.\nSAML Tokens received by the SP with MFA claims but without corresponding MFA\nactivity logs at the IDP.\nSAML Tokens which are received from IP addresses, agents, times, or for services\nwhich are anomalous for the requesting identity represented in the token.\nEvidence of unauthorized administrative activity.\n\n### What to do\n\n\n-----\n\nDetermine mechanism of certificate exfiltration and remediate (see below)\nRoll all SAML token signing certificates\nConsider reducing your reliance on prem SAML trust where possible\nConsider using an HSM to manage your SAML Token Signing Certificates\n\n## Pattern 2: Illegitimate registrations of SAML Trust Relationships\n\nIn some cases, the SAML token forgeries described above correspond to configuration\nchanges in the Service Provider. By impersonating a user with valid administrative\ncredentials, the actor can change the configuration of the SAML Service Provider (in our\ncase, Azure AD). In this case, the actor tells Azure AD to trust their certificate by, in effect,\nsaying to the SP “There’s another SAML IDP you should trust, validate it with this public key.”\n\n### What we found\n\nAddition of federation trust relationships at the SP done which later resulted in SAML\nauthentications of users with administrative privileges. The attacker took care to follow\nnaming conventions of or impersonate existing federation server names (e.g.\nFED_SERVER01 exists, and they add FED_SERVERO1). The impersonated users\nlater took actions consistent with attacker patterns described below.\nToken forgeries consistent with pattern 1, above.\nThese calls came from different IP addresses for each call and user, but generally\ntracked back to anonymizing VPN servers.\n\n### What it implies\n\nAdministrative access to the Azure AD was gained.\nAttacker may have been unable to gain a toe-hold on premises, or was experimenting\nwith other persistence mechanisms.\nAttacker may have been unable to exfiltrate tokens, possibly due to use of HSM.\n\n### What to look for\n\nAnomalous administrative session associated with modification of federation trust\nrelationships.\n\n### What to do\n\nReview all federation trust relationships, ensure all are valid.\nDetermine mechanism of administrative account impersonation (see below).\nRoll administrative account credentials.\n\n## Pattern 3: Adding credentials to existing applications\n\n\n-----\n\nOnce the attacker was able to impersonate a privileged Azure AD admin account, they\nadded credentials to existing applications or service principals, usually with the permissions\nthey wanted already associated and high traffic patterns (e.g. mail archival applications).\nThere are some cases in which we see the attacker add permissions to existing applications\nor service principals. We also see cases in which a new application or service principal was\nset up for a short while and used to add the permissions to the existing applications or\nservice principals, possibly to add a layer of indirection (e.g. using it to add a credential to\nanother service principal, then deleting it).\n\n### What we found\n\nAddition of federation trust relationships at the SP done which later resulted in SAML\nauthentications of users with administrative privileges. The impersonated users later\ntook actions consistent with attacker patterns described below.\nService Principals added into well known administrative roles such as Tenant Admin or\nCloud Application Admin.\nReconnaissance to identify existing applications with application roles that have\npermissions to call Microsoft Graph.\nThe applications or service principals impersonated were different from customer to\ncustomer – the actor did not have a “go to” target.\nThe applications or service principals included both customer developer and vendor\ndeveloped software.\nNo Microsoft 365 applications or service principals were used impersonated (customer\ncredentials cannot be added to these applications and service principals).\nToken forgeries consistent with pattern 1, above.\n\n### What it implies\n\nAdministrative access to the Azure AD was gained.\nAttacker did extensive recon to find unique applications which could be used to\nobfuscate their activity.\n\n### What to look for\n\nAnomalous administrative session associated with modification of federation trust\nrelationships.\nUnexpected service principals added to privileged roles in cloud environments.\n\n### What to do\n\nReview all applications and service principals for credential modification activity.\nReview all applications and service principals for excess permissions.\nRemove all inactive service principals from your environment.\nRegularly roll creds for all applications and service principals.\n\n\n-----\n\n## Pattern 4: Queries impersonating existing applications\n\nWith credentials added to an existing application or service principal, the actor proceeded to\nacquire an OAUTH access token for the application using the forged credentials, and call\nAPIs with the permissions which had been assigned to that applications. Most of the API\ncalls we detected were focused on email and document extraction, but in some cases API\ncalls added users, or added permissions to other applications or service principals. Calls\nwere generally very targeted, synchronizing then monitoring email for specific users.\n\n### What we found\n\nApplication calls attempting to authenticated to Microsoft Graph resource with\napplicationID: \"00000003-0000-0000-c000-000000000000\"\nImpersonated calls to the Microsoft Graph Mail.Read and Mail.ReadWrite endpoints.\nImpersonating calls came from anomalous endpoints. These endpoints were not\nrepeated from customer to customer. The endpoints were usually Virtual Private Server\n(VPS) vendors.\n\n### What it implies\n\nAttacker was primarily interested in persistence and reconnaissance.\nAttacker was attempting to obfuscate their activity.\n\n### What to look for\n\nAnomalous requests to your resources from trusted applications or service principals.\nRequests from service principals that added or modified groups, users, applications,\nservice principals, or trust relationships.\n\n### What to do\n\nReview all federation trust relationships, ensure all are valid.\nDetermine mechanism of administrative account impersonation (see below).\nRoll administrative account credentials.\n\n## Other Observations\n\nThis section relates other observations of attacker behavior.\n\n### Attacker access to on premises resources\n\nOur optics into on premises behavior are limited, but here are the indicators we have as to\nhow on premises access was gained. We recommend using on premises tools like Microsoft\nDefender for Identity (formerly Azure ATP) to detect other anomalies:\n\n\n-----\n\nCompromised network management software used as command and control to place\nmalicious binaries which exfiltrated SAML token signing certificate.\nCompromised vendor credentials with existing administrative access (vendor network\ncompromised).\nCompromised service account credentials associated with compromised vendor\nsoftware.\nUse of non-MFA service account.\n\n### Attacker access to cloud resources\n\nFor administrative access to the Microsoft 365 cloud, we observed:\n\nForged SAML tokens impersonating accounts with cloud administrative privileges.\nAccounts without MFA required – these are easily compromised (see\n[https://aka.ms/yourpassworddoesntmatter)](https://aka.ms/yourpassworddoesntmatter)\nAccess from trusted vendor accounts where the attacker had compromised the vendor\nenvironment.\n\n## Identity Attack Graph\n\nThis graph summarizes the vectors and combinations tracked in this document.\n\n## Other Guidance\n\nThe following guidance may assist customers in protecting their environments.\n\n[We published an Azure AD Workbook to help you hunt for the behaviors described in](https://aka.ms/solorigateazureadworkbook)\nthis document.\n\n\n-----\n\nTo protect Microsoft 365 resources from a compromise of on-premises environments:\n[https://aka.ms/protectm365](https://aka.ms/protectm365)\nIf your organization has been compromised, review recovery guidance from DART at\n[https://aka.ms/dartrecoveryguide](https://aka.ms/dartrecoveryguide)\nTo configure for Zero Trust to increase explicit request verification, least privileged\n[access, and assumed breach protection: https://aka.ms/ztguide](https://aka.ms/ztguide)\n\n## Stay up to date\n\nThe Solarwinds attack is an ongoing investigation, and our teams continue to act as first\nresponders to these attacks. As new information becomes available, we will make updates\n[through our Microsoft Security Response Center (MSRC) blog at https://aka.ms/solorigate.](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcomm.microsoft.com%2FPoliteMail245%2Fdefault.aspx%3Fpage%3DmOgDA41300uL7Q32_8nsGA%26ref_id%3DKI8WohcEM0KIdOtHZj3pQw&data=04%7C01%7Cadhall%40microsoft.com%7Ca48f35f285d94ccd698f08d8a3956502%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C637439209352849256%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=Xebz37S3gWRu3E8WvV1FRMz6vDhcBRDY0uQCZi9ogEc%3D&reserved=0)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-21 - Understanding -Solorigate-'s Identity IOCs - for Identity Vendors and their customers..pdf"
    ],
    "report_names": [
        "2020-12-21 - Understanding -Solorigate-'s Identity IOCs - for Identity Vendors and their customers..pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535921,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653787556,
    "ts_modification_date": 1653787556,
    "files": {
        "pdf": "https://archive.orkl.eu/1a3d8aec9b1406b115cb9769a40892e173019126.pdf",
        "text": "https://archive.orkl.eu/1a3d8aec9b1406b115cb9769a40892e173019126.txt",
        "img": "https://archive.orkl.eu/1a3d8aec9b1406b115cb9769a40892e173019126.jpg"
    }
}