{
    "id": "df34ff02-9e03-4d04-8c62-c743d123a58c",
    "created_at": "2023-01-12T15:08:15.23568Z",
    "updated_at": "2025-03-27T02:09:30.143963Z",
    "deleted_at": null,
    "sha1_hash": "f5b538303018f83a5ab66c50945d63d056bccfc4",
    "title": "2018-09-03 - .lockymap Files Virus (PyLocky Ransomware) – Remove and Restore Data",
    "authors": "",
    "file_creation_date": "2022-05-28T04:06:57Z",
    "file_modification_date": "2022-05-28T04:06:57Z",
    "file_size": 1903260,
    "plain_text": "# .lockymap Files Virus (PyLocky Ransomware) – Remove and Restore Data\n\n**[sensorstechforum.com/lockymap-files-virus-pylocky-ransomware-remove-restore-data/](https://sensorstechforum.com/lockymap-files-virus-pylocky-ransomware-remove-restore-data/)**\n\nVentsislav Krastev September 3, 2018\n\nThis article is made with the goal of explaining\nwhat is the .lockymap PyLocky ransomware\nvirus and how you can remove it from Windows\nplus how you can restore files, encrypted by it\non your PC.\n\nA new ransomware virus, going by the name of\n**PyLocky ransomware has been detected to infect actively and encrypt files on the**\ncomputers infected by it. The .lockymap variant of PyLocky ransomware then adds a\nransom note whose main goal is to show you how you can pay a hefty ransom in order to get\nthe cyber-criminals to recover your files. In the event that your computer has been infected\nby PyLocky ransomware virus, we recommend that you read this article as it will help you\nto remove this ransomware from your PC and restore your files.\n\n## Threat Summary\n\nName .lockymap Ransomware\n\nType Ransomware, Cryptovirus\n\n\nShort\nDescription\n\n\nFiles are encrypted and the virus leaves a ransom note extorting victims\nto pay ransom in order to get their files to work once again.\n\n\nSymptoms The files on your computer have the .lockymap extension added to them\nand cannot be opened.\n\n\nDistribution\nMethod\n\n\nSpam Emails, Email Attachments, Executable files\n\n\n-----\n\nDetection\nTool\n\nUser\nExperience\n\nData\nRecovery\nTool\n\n\nSee If Your System Has Been Affected by malware\nDownload\nMalware Removal Tool\n\n[Join Our Forum to Discuss .lockymap Ransomware.](https://sensorstechforum.com/forums/malware-removal-questions-and-guides/)\n\n[Windows Data Recovery by Stellar Phoenix Notice! This product scans](https://sensorstechforum.com/stellar-phoenix-windows-data-recovery-software-review/)\nyour drive sectors to recover lost files and it may not recover 100% of the\nencrypted files, but only few of them, depending on the situation and\nwhether or not you have reformatted your drive.\n\n\n## PyLocky .lockymap Ransomware – Distribution\n\nIn order to infect a certain computer, the .lockymap files virus may be embedded as an\nattachment in a spam e-mail sent to you by the cyber-criminals themselves or via a spam\nbot. This e-mail may contain deceptive tactics to convince you that the attachment should\nimmediately be opened:\n\n\n-----\n\nBesides via e-mail, the PyLocky ransomware virus may also use other methods of infection.\nThe crooks may upload the infection file in compromised WordPress sites, that may pretend\nas if they offer different programs the user needs for free download, such as:\n\nSoftware installers.\nPortable versions of programs.\nCracks.\nA patch.\nLicense activation software.\nKeygens.\n\n## PyLocky .lockymap Ransomware – Analysis\n\n\n-----\n\nOnce the .lockymap ransomware virus has already infected your computer, the ransomware\nmay start to download and run it’s payload. The payload of PyLocky ransomware, consists of\nseveral files, the main of which has the following information:\n\n→ Name: facture_4739149_08.26.2018.exe\nSHA256:8655f8599b0892d55efc13fea404b520858d01812251b1d25dcf0afb4684dce9\nSize: 5.3 MB\n\nIn addition to the main infection file, other files may also be dropped on the victim’s computer\nand they are likely located in the following directories:\n\n%Temp%\n%AppData%\n%Local%\n%LocalLow%\n%Roaming%\n\nAmong the files dropped on the user’s computer is also the ransom note file, called LOCKY**README.txt file. It has the following contents:**\n\n\n-----\n\nPlease be adviced:\n\nAll your files, pictures document and data has been encrypted with Military Grade\nEncryption RSA ABS-256.\nYour information is not lost. But Encrypted.\n\nIn order for you to restore your files you have to purchase Decrypter.\n\nFollow this steps to restore your files.\n\n1* Download the Tor Browser. ( Just type in google “Download Tor“\n\n2‘ Browse to URL : https://4wcgqlckaazungm.onion/index.php\n\n3* Purchase the Decryptor to restore your files.\n\nIt is very simple. If you don’t believe that we can restore your files, then you can restore\n1 file of image format for free.\nBe aware the time is ticking. Price will be doubled every 96 hours so use it wisely.\n\nYour unique ID :\n\nCAUTION:\n\nPlease do not try to modify or delete any encrypted file as it will be hard to restore it.\n\nSUPPORT:\n\nYou can contact support to help decrypt your files for you.\n\nClick on support at https://4wcgqlckaazungm.onion/index.php\n\nIn addition to this, the PyLocky ransomware may also modify the Windows Registry Editor,\nprimarily the Run and RunOnce registry sub-keys of it, creating values in them with the\nlocation of the malicious .exe file of PyLocky. This may ultimately result in the malicious files\nrunning automatically when you log in Windows:\n\n→ HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nBut this is not all that happens after infection with PyLocky ranomware, because the virus\nmay also modify the volume shadow copies of the infected computer by executing the\nfollowing commands:\n\n\n-----\n\n→ sc stop VVS\nsc stop wscsvc\nsc stop WinDefend\nsc stop wuauserv\nsc stop BITS\nsc stop ERSvc\nsc stop WerSvc\ncmd.exe /C bcdedit /set {default} recoveryenabled No\ncmd.exe /C bcdedit /set {default} bootstatuspolicy ignoreallfailures\nC:\\Windows\\System32\\cmd.exe” /C vssadmin.exe Delete Shadows /All /Quiet\n\nThese commands may result in the .lockymap file version of PyLocky to delete all of the files\nyou have backed up on your computer.\n\n## .lockymap PyLocky Virus – Encryption Process\n\nThe .lockymap variant of PyLocky virus may scan for the following types of files on your PC,\nafter it infects it:\n\n→ “PNG .PSD .PSPIMAGE .TGA .THM .TIF .TIFF .YUV .AI .EPS .PS .SVG .INDD .PCT\n.PDF .XLR .XLS .XLSX .ACCDB .DB .DBF .MDB .PDB .SQL .APK .APP .BAT .CGI .COM\n.EXE .GADGET .JAR .PIF .WSF .DEM .GAM .NES .ROM .SAV CAD Files .DWG .DXF GIS\nFiles .GPX .KML .KMZ .ASP .ASPX .CER .CFM .CSR .CSS .HTM .HTML .JS .JSP .PHP\n.RSS .XHTML. DOC .DOCX .LOG .MSG .ODT .PAGES .RTF .TEX .TXT .WPD .WPS .CSV\n.DAT .GED .KEY .KEYCHAIN .PPS .PPT .PPTX ..INI .PRF Encoded Files .HQX .MIM .UUE\n.7Z .CBR .DEB .GZ .PKG .RAR .RPM .SITX .TAR.GZ .ZIP .ZIPX .BIN .CUE .DMG .ISO\n.MDF .TOAST .VCD SDF .TAR .TAX2014 .TAX2015 .VCF .XML Audio Files .AIF .IFF .M3U\n.M4A .MID .MP3 .MPA .WAV .WMA Video Files .3G2 .3GP .ASF .AVI .FLV .M4V .MOV .MP4\n.MPG .RM .SRT .SWF .VOB .WMV 3D .3DM .3DS .MAX .OBJ R.BMP .DDS .GIF .JPG\n..CRX .PLUGIN .FNT .FON .OTF .TTF .CAB .CPL .CUR .DESKTHEMEPACK .DLL .DMP\n.DRV .ICNS .ICO .LNK .SYS .CFG”\n\nAfter this, the ransomware may encrypt the files, setting two different file extensions –\n**.lockedfile and .lockymap. The encrypted files start to appear like the following:**\n\n\n-----\n\n## Remove PyLocky Ransomware and Restore .lockymap Files\n\nFor the removal of this ransomware virus, we would suggest that you follow the removal\ninstructions underneath this article. They have been created with the main purpose of\nallowing manual and automatic removal methods. If the manual removal steps do not help\nyou or you cannot fully remove PyLocky by yourself, then researchers strognly recommend\nto download an advanced anti-malware program for the removal. Such software will\ncompletely and effectively remove PyLocky from your computer and make sure that it is\nprotected from all sorts of advanced threats in the future as well.\n\nIf you wish to restore .lockedfile and .lockymap files encrypted by PyLocky ransowmare, we\nsuggest that you try ot the alternative methods for file recovery in step “2. Restore files,\n**encrypted by .lockymap Ransomware”. They may not be 100% effective to restore all of**\nthem but some of them may be able to recover a portion of the files.\n\n### Ventsislav Krastev\n\nVentsislav is a cybersecurity expert at SensorsTechForum since 2015. He has been\nresearching, covering, helping victims with the latest malware infections plus testing and\nreviewing software and the newest tech developments. Having graduated Marketing as well,\nVentsislav also has passion for learning new shifts and innovations in cybersecurity that\n\n\n-----\n\nbecome game changers. After studying Value Chain Management, Network Administration\nand Computer Administration of System Applications, he found his true calling within the\ncybersecrurity industry and is a strong believer in the education of every user towards online\nsafety and security.\n\n[More Posts -](https://sensorstechforum.com/author/vencislav-krustev/) [Website](https://www.sensorstechforum.com/)\n\nFollow Me:\n\n[Previous post](https://sensorstechforum.com/remove-jeff-ransomware-v1-0-restore-data/)\n\n[Next post](https://sensorstechforum.com/remove-search-alivesearch-com-browser-hijacker/)\n\n**Attention! SensorsTechForum strongly recommends that all malware victims should look for**\nassistance only by reputable sources. Many guides out there claim to offer free recovery and\ndecryption for files encrypted by ransomware viruses. Be advised that some of them may\n**only be after your money.**\nAs a site that has been dedicated to providing free removal instructions for ransomware and\nmalware since 2014, SensorsTechForum’s recommendation is to only pay attention to\n**trustworthy sources.**\n\nHow to recognize trustworthy sources:\n\nAlways check \"About Us\" web page.\nProfile of the content creator.\nMake sure that real people are behind the site and not fake names and profiles.\n\nOFFER\nREMOVE IT NOW (PC)\nwith Anti-Malware\nWe recommend you to download SpyHunter and run free scan to remove all virus files on\n**your PC. This saves you hours of time and effort compared to doing the removal yourself.**\n_SpyHunter 5 free remover allows you, subject to a 48-hour waiting period, one remediation_\n_[and removal for results found. Read EULA and](https://www.enigmasoftware.com/spyhunter-eula/)_ _[Privacy Policy](https://www.enigmasoftware.com/enigmasoft-privacy-policy/)_\n\nGuide 1: How to Remove .lockymap Ransomware from Windows.\nGuide 2: Get rid of .lockymap Ransomware from Mac OS X.\n\nWindows Mac OS X\n\n### How to Remove .lockymap Ransomware from Windows.\n\n\n-----\n\nStep 1: Boot Your PC In Safe Mode to isolate and remove .lockymap Ransomware\n\nOFFER\nManual Removal Usually Takes Time and You Risk Damaging Your Files If Not Careful!\nWe Recommend To Scan Your PC with SpyHunter\nKeep in mind, that SpyHunter’s scanner is only for malware detection. If SpyHunter detects\nmalware on your PC, you will need to purchase SpyHunter's malware removal tool to remove\n[the malware threats. Read our SpyHunter 5 review. Click on the corresponding links to check](https://sensorstechforum.com/spyhunter-5-review-advanced-anti-malware/)\n[SpyHunter's EULA,](https://www.enigmasoftware.com/spyhunter5-eula/) [Privacy Policy and](https://www.enigmasoftware.com/enigmasoft-privacy-policy/) [Threat Assessment Criteria](https://www.enigmasoftware.com/spyhunter5-threat-assessment-criteria/)\n\n**1. Hold Windows key()** **+ R**\n\n**2. The \"Run\" Window will appear. In it, type \"msconfig\" and click OK.**\n\n\n-----\n\n**3. Go to the** **Boot tab. There select** **Safe Boot and then click** **Apply and** **OK .**\n\n_Tip: Make sure to reverse those changes by unticking Safe Boot after that, because your_\n_system will always boot in Safe Boot from now on._\n\n**4. When prompted, click on \"Restart\" to go into Safe Mode.**\n\n\n-----\n\n**5. You can recognise Safe Mode by the words written on the corners of your screen.**\n\nStep 2: Uninstall .lockymap Ransomware and related software from Windows\n\n**Here is a method in few easy steps that should be able to uninstall most programs.** **No**\n**matter if you are using Windows 10, 8, 7, Vista or XP, those steps will get the job done.**\nDragging the program or its folder to the recycle bin can be a very bad decision. If you do\nthat, bits and pieces of the program are left behind, and that can lead to unstable work of\nyour PC, errors with the file type associations and other unpleasant activities. The proper\nway to get a program off your computer is to Uninstall it. **To do that:**\n\n**1. Hold the Windows Logo Button and \"R\" on your keyboard. A Pop-up window will appear.**\n\n**2. In the field type in \"appwiz.cpl\" and press ENTER.**\n\n\n-----\n\n**3. This will open a window with all the programs installed on the PC. Select the program that**\nyou want to remove, and press \"Uninstall\"\n\n**Follow the instructions above and you will successfully uninstall most programs.**\n\n\n-----\n\nStep 3: Clean any registries, created by .lockymap Ransomware on your computer.\n\nThe usually targeted registries of Windows machines are the following:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nYou can access them by opening the Windows registry editor and deleting any values,\ncreated by .lockymap Ransomware there. This can happen by following the steps\nunderneath:\n\n**1. Open the Run Window again, type \"regedit\" and click OK.**\n\n**2. When you open it, you can freely navigate to the Run and RunOnce keys, whose locations**\nare shown above.\n\n\n-----\n\n**3. You can remove the value of the virus by right-clicking on it and removing it.**\n\n_Tip: To find a virus-created value, you can right-click on it and click \"Modify\" to see which_\n_file it is set to run. If this is the virus file location, remove the value._\n**IMPORTANT!**\n\n_Before starting \"Step 4\", please boot back into Normal mode, in case you are currently_\n**_in Safe Mode._**\n\n_This will enable you to install and use SpyHunter 5 successfully._\nStep 4: Scan for .lockymap Ransomware with SpyHunter Anti-Malware Tool\n\n**1. Click on the \"Download\" button to proceed to SpyHunter's download page.**\nDownload\n\nMalware Removal Tool\n\n_It is recommended to run a scan before purchasing the full version of the software to make_\n_sure that the current version of the malware can be detected by SpyHunter. Click on the_\n_[corresponding links to check SpyHunter's EULA,](https://www.enigmasoftware.com/spyhunter5-eula/)_ _[Privacy Policy and](https://www.enigmasoftware.com/enigmasoft-privacy-policy/)_ _Threat Assessment_\n_Criteria._\n\n\n-----\n\n**2. After you have installed SpyHunter, wait for it to update automatically.**\n\n**3. After the update process has finished, click on the 'Malware/PC Scan' tab. A new window**\nwill appear. Click on 'Start Scan'.\n\n\n-----\n\n**4. After SpyHunter has finished scanning your PC for any files of the associated threat and**\nfound them, you can try to get them removed automatically and permanently by clicking on\nthe 'Next' button.\n\nIf any threats have been removed, it is highly recommended to restart your PC.\nStep 5 (Optional): Try to Restore Files Encrypted by .lockymap Ransomware.\n\nRansomware infections and .lockymap Ransomware aim to encrypt your files using an\nencryption algorithm which may be very difficult to decrypt. This is why we have suggested a\ndata recovery method that may help you go around direct decryption and try to restore your\nfiles. Bear in mind that this method may not be 100% effective but may also help you a little\nor a lot in different situations.\n\n**1. Download the reccomended Data Recovery software by clicking on the link underneath:**\n[EaseUS Data Recovery Software](https://sensorstechforum.com/ease-us-2020-lp/)\nSimply click on the link and on the website menus on top, choose Data Recovery - Data\n**Recovery Wizard for Windows or Mac (depending on your OS), and then download and run**\nthe tool.\n\n\n-----\n\nWindows Mac OS X\n\n### Get rid of .lockymap Ransomware from Mac OS X.\n\nStep 1: Uninstall .lockymap Ransomware and remove related files and objects\n\nOFFER\nManual Removal Usually Takes Time and You Risk Damaging Your Files If Not Careful!\nWe Recommend To Scan Your Mac with SpyHunter for Mac\nKeep in mind, that SpyHunter for Mac needs to purchased to remove the malware threats.\nClick on the corresponding links to check SpyHunter’s [EULA and](https://www.spyhunter.com/spyhunter-eula/) [Privacy Policy](https://www.spyhunter.com/enigmasoft-privacy-policy/)\n\n1. Hit the ⇧+⌘+U keys to open Utilities. Another way is to click on “Go” and then click\n“Utilities”, like the image below shows:\n\n2. Find Activity Monitor and double-click it:\n\n\n-----\n\n3. In the Activity Monitor look for any suspicious processes, belonging or related to\n.lockymap Ransomware:\n\n\n-----\n\nTip: To quit a process completely, choose the “Force Quit” option.\n\n4. Click on the \"Go\" button again, but this time select Applications. Another way is with the\n⇧+⌘+A buttons.\n\n5. In the Applications menu, look for any suspicious app or an app with a name, similar or\nidentical to .lockymap Ransomware. If you find it, right-click on the app and select “Move to\n**Trash”.**\n\n\n-----\n\n6: Select Accounts, after which click on the Login Items preference. Your Mac will then show\nyou a list of items that start automatically when you log in. Look for any suspicious apps\nidentical or similar to .lockymap Ransomware. Check the app you want to stop from running\nautomatically and then select on the Minus (“-“) icon to hide it.\n\n7: Remove any left-over files that might be related to this threat manually by following the\nsub-steps below:\n\nGo to Finder.\nIn the search bar type the name of the app that you want to remove.\nAbove the search bar change the two drop down menus to “System Files” and “Are\n**Included” so that you can see all of the files associated with the application you want**\nto remove. Bear in mind that some of the files may not be related to the app so be very\ncareful which files you delete.\nIf all of the files are related, hold the ⌘+A buttons to select them and then drive them\nto “Trash”.\n\n_In case you cannot remove .lockymap Ransomware via Step 1 above:_\n\nIn case you cannot find the virus files and objects in your Applications or other places we\nhave shown above, you can manually look for them in the Libraries of your Mac. But before\ndoing this, please read the disclaimer below:\n\n**_Disclaimer! If you are about to tamper with Library files on Mac, be sure to know the name_**\n_of the virus file, because if you delete the wrong file, it may cause irreversible damage to_\n_your MacOS. Continue on your own responsibility!_\n1: Click on \"Go\" and Then \"Go to Folder\" as shown underneath:\n\n\n-----\n\n2: Type in \"/Library/LauchAgents/\" and click Ok:\n\n3: Delete all of the virus files that have similar or the same name as .lockymap Ransomware.\nIf you believe there is no such file, do not delete anything.\n\n\n-----\n\nYou can repeat the same procedure with the following other Library directories:\n\n→ ~/Library/LaunchAgents\n\n/Library/LaunchDaemons\n\n_Tip: ~ is there on purpose, because it leads to more LaunchAgents._\n\nClick the button below below to download SpyHunter for Mac and scan for .lockymap\nRansomware:\nDownload\nSpyHunter for Mac\n\n\n-----\n\nStep 3 (Optional): Try to Restore Files Encrypted by .lockymap Ransomware.\n\nRansomware infections and .lockymap Ransomware aim to encrypt your files using an\nencryption algorithm which may be very difficult to decrypt. This is why we have suggested a\ndata recovery method that may help you go around direct decryption and try to restore your\nfiles. Bear in mind that this method may not be 100% effective but may also help you a little\nor a lot in different situations.\n\n**1. Download the reccomended Data Recovery software by clicking on the link underneath:**\n[EaseUS Data Recovery Software](https://sensorstechforum.com/ease-us-2020-lp/)\nSimply click on the link and on the website menus on top, choose Data Recovery - Data\n**Recovery Wizard for Windows or Mac (depending on your OS), and then download and run**\nthe tool.\n\n## .lockymap Ransomware FAQ\n\n### What is .lockymap Ransomware ransomware and how does it work?\n\n[.lockymap Ransomware is a ransomware infection - the malicious software that enters your](https://sensorstechforum.com/ransomware-virus-what-is-it/)\ncomputer silently and blocks either access to the computer itself or encrypt your files.\n\n\n-----\n\nMany ransomware viruses use sophisticated encryption algorithm how to make your files\ninaccessible. The goal of ransomware infections is to demand that you pay a ransom\npayment to get access to your files back.\n\n### How does .lockymap Ransomware ransomware infect my computer?\n\nVia several ways..lockymap Ransomware Ransomware infects computers by being sent via\n**phishing e-mails, containing virus attachment.**\n\nThis attachment is usually masked as an important document, like an invoice, bank\ndocument or even a plane ticket and it looks very convincing to users.\n\nAfter you download and execute this attachment, a drive-by download occurs and your\ncomputer is infected with the ransomware virus.\n\nAnother way, you may become a victim of .lockymap Ransomware is if you download a fake\ninstaller, crack or patch from a low reputation website or if you click on a virus link. Many\nusers report getting a ransomware infection by downloading torrents.\n\n### How to open ..lockymap Ransomware files?\n\nYou can't. At this point the ..lockymap Ransomware files are **[encrypted. You can only open](https://sensorstechforum.com/ransomware-encryption-explained-why-is-it-so-effective/)**\nthem once they are decrypted.\n\n### Decryptor did not decrypt my data. What now?\n\n[Do not panic and backup the files. If a decryptor did not decrypt your ..lockymap](https://sensorstechforum.com/safely-store-your-important-files-and-protect-them-from-malware/)\n**Ransomware files successfully, then do not despair, because this virus is still new.**\n\nOne way to restore files, encrypted by .lockymap Ransomware ransomware is to use a\n**[decryptor for it. But since it's a new virus, advised that the decryption keys for it may not be](https://sensorstechforum.com/decrypt-ransomware-files/)**\nout yet and available to the public. We will update this article and keep you posted as soon\nas this decryptor is released.\n\n### How Do I restore \"..lockymap Ransomware\" files (Other Methods)?\n\n[Yes, sometimes files can be restored. We have suggested several file recovery methods](https://sensorstechforum.com/restore-files-encrypted-ransomware-without-decryptor/)\nthat could work if you want to restore ..lockymap Ransomware files.\n\nThese methods are in no way 100% guarantee that you will be able to get your files back.\nBut if you have a backup, your chances of success are much greater.\n\n### How do I get rid of .lockymap Ransomware ransomware virus?\n\n\n-----\n\nThe safest way and the most efficient one for the removal of this ransomware infection is the\nuse a **[professional anti malware software. It will scan for and locate .lockymap](https://sensorstechforum.com/spyhunter-5-review-advanced-anti-malware/)**\nRansomware ransomware and then remove it without causing any additional harm to your\nimportant ..lockymap Ransomware files.\n\nAlso, keep in mind that viruses like .lockymap Ransomware ransomware also install\nTrojans and keyloggers that can steal your passwords and accounts. Scanning your\ncomputer with an anti-malware software will make sure that all of these virus components\nare removed and your computer is protected in the future.\n\n### What to Do If nothing works?\n\nThere is still a lot you can do. If none of the above methods seem to work for you, then try\n**these methods:**\n\nTry to find a safe computer from where you can can login on your own line accounts\nlike One Drive, iDrive, Google Drive and so on.\nTry to contact your friends, relatives and other people so that they can check if they\nhave some of your important photos or documents just in case you sent them.\nAlso, check if some of the files that were encrypted it can be re-downloaded from the\n**web.**\nAnother clever way to get back some of your files is to find another old computer, a\n**flash drive or even a CD or a DVD where you may have saved your older documents.**\nYou might be surprised what will turn up.\nYou can also go to your email account to check if you can send any attachments to\nother people. Usually what is sent the email is saved on your account and you can redownload it. But most importantly, make sure that this is done from a safe computer\nand make sure to remove the virus first.\n\n[More tips you can find on our forums, where you can also asks any questions about your](https://sensorstechforum.com/forums/pc-tips-tricks/tips-about-ransomware/)\nransomware problem.\n\n### How to Report Ransomware to Authorities?\n\nIn case your computer got infected with a ransomware infection, you can report it to the local\nPolice departments. It can help authorities worldwide track and determine the perpetrators\nbehind the virus that has infected your computer. Below, we have prepared a list with\n[government websites, where you can file a report in case you are a victim of a cybercrime:](https://en.wikipedia.org/wiki/Cybercrime#Agencies)\n\nCyber-security authorities, responsible for handling ransomware attack reports in different\nregions all over the world:\n\nGermany - [Offizielles Portal der deutschen Polizei](https://www.polizei.de/Polizei/DE/Home/home_node.html)\nUnited States - [IC3 Internet Crime Complaint Centre](https://www.ic3.gov/)\n[United Kingdom - Action Fraud Police](https://www.actionfraud.police.uk/)\n\n\n-----\n\nFrance - [Ministère de l Intérieur](https://www.policia.es/denunweb/denuncias.html)\nItaly - [Polizia Di Stato](https://questure.poliziadistato.it/servizio/dovesiamo)\n[Spain - Policía Nacional](https://www.policia.es/denunweb/denuncias.html)\n[Netherlands - Politie](https://www.politie.nl/mijn-buurt/politiebureaus)\nPoland - [Policja](https://www.policja.pl/pol/kontakt/606,Kontakt.html)\n[Portugal - Polícia Judiciária](https://www.policiajudiciaria.pt/)\nGreece - [Cyber Crime Unit (Hellenic Police)](https://en.wikipedia.org/wiki/Cyber_Crime_Unit_(Hellenic_Police))\n[India - Mumbai Police - CyberCrime Investigation Cell](https://mumbaipolice.gov.in/CCC)\n[Australia - Australian High Tech Crime Center](https://www.afp.gov.au/what-we-do/crime-types/cyber-crime)\n\nReports may be responded to in different timeframes, depending on your local authorities.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-09-03 - .lockymap Files Virus (PyLocky Ransomware) – Remove and Restore Data.pdf"
    ],
    "report_names": [
        "2018-09-03 - .lockymap Files Virus (PyLocky Ransomware) – Remove and Restore Data.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536095,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653710817,
    "ts_modification_date": 1653710817,
    "files": {
        "pdf": "https://archive.orkl.eu/f5b538303018f83a5ab66c50945d63d056bccfc4.pdf",
        "text": "https://archive.orkl.eu/f5b538303018f83a5ab66c50945d63d056bccfc4.txt",
        "img": "https://archive.orkl.eu/f5b538303018f83a5ab66c50945d63d056bccfc4.jpg"
    }
}