{
    "id": "df5c4ad3-8010-4d71-a776-eb89898c9246",
    "created_at": "2023-05-06T02:10:01.519544Z",
    "updated_at": "2025-03-27T02:16:26.245755Z",
    "deleted_at": null,
    "sha1_hash": "f41c68d37ce2fc180115779ff6368ed70d120292",
    "title": "2023-04-19 - Rorschach Ransomware Analysis with Attack Flow",
    "authors": "",
    "file_creation_date": "2023-05-05T02:05:10Z",
    "file_modification_date": "2023-05-05T02:05:10Z",
    "file_size": 122035,
    "plain_text": "# Rorschach Ransomware Analysis with Attack Flow\n\n**[medium.com/@simone.kraus/rorschach-ransomware-analysis-with-attack-flow-7fa5ff613a75](https://medium.com/@simone.kraus/rorschach-ransomware-analysis-with-attack-flow-7fa5ff613a75)**\n\nSimone Kraus April 19, 2023\n\n[Simone Kraus](https://medium.com/@simone.kraus?source=post_page-----7fa5ff613a75--------------------------------)\n\n-\n## How the online attack flow builder can be used for reverse engineering and forensics.\n\nCurious about the new ransomware, which officially caused a sensation in the community for\nthe first time last week under the name Rorschach, I wanted to know how the online attack\nflow builder can be used to design the attack flow from a reverse engineering and forensics\npoint of view. Would it be possible? And what should I say? I’m not sure if everything is\n100% implemented, but it helped me as an analyst to understand the Ransomware.\n\n[So I tried the experiment to graphically display the analysis in Attack Flow another great tool](https://center-for-threat-informed-defense.github.io/attack-flow/overview/)\n[developed by the Center for Threat Informed Defense.](https://mitre-engenuity.org/blog/2022/10/27/attack-flow/)\n\nAttack Flow is an open source tool to graphically display and understand attacks in their\n\n\n-----\n\nsequence.\n\nAttack Flow website MITRE Engenuity: it helps defenders and leaders understand how\nadversaries operate and compose atomic techniques into attacks to better understand\ndefensive posture.\n\nAttack Flow Builder is a free and open source tool for creating, viewing, and editing\nAttack Flows. This web-based tool provides a workspace where you can populate\ninformation about adversary actions and additional context, then weave those items\ninto a flow by drawing arrows to indicate the sequences of adversary techniques\nobserved during an incident or campaign.\n\nThose who have previously had contact with event-oriented process chains or objectoriented programming will also become familiar with Attack Flow relatively quickly.\n\n[While there is an online version that you can use right away, you can also download the tool](https://center-for-threat-informed-defense.github.io/attack-flow/example_flows/)\nfrom [github and install it on your virtual machine.](https://github.com/center-for-threat-informed-defense/attack-flow)\n\nAfter I had first modeled the ransomware group Play as an attack flow, I now wanted to know\n[how Rorschach — also known as BabLock — works and which MITER ATT&CK techniques](https://security.paloaltonetworks.com/PAN-SA-2023-0002)\nare behind it. While at Play, for example, the CTI reports also describe the tools used by the\nransomware group and you can then go deeper into detection engineering and threat hunting\n[with the help of threat intelligence platforms such as Tidal, there are still relatively few](https://www.tidalcyber.com/)\ninformation in the web about from BabLock.\n\nCortex XDR Dump Service Tool with cydump.exe can be used to load untrusted dynamic link\nlibraries (DLLs)\n[Luckily today Trendmicro released an analysis about the ransomware. Perfect timing!](https://www.trendmicro.com/de_de/research/23/d/an-analysis-of-the-bablock-ransomware.html)\n\nAlthough the ransomware was detected as a variant of LockBit, it cannot be clearly assigned\nto the LockBit group. Trendmicro refers to it as a “Frankenstein-like creation” of different\nransomware solutions, however, Rorschach is the fastest variant of encryption ever seen and\nthe automation also seems to be more advanced.\n\n[While I initially assumed an analysis similar to that of Play, it quickly became clear that using](https://www.trendmicro.com/de_de/research/22/i/play-ransomware-s-attack-playbook-unmasks-it-as-another-hive-aff.html)\nAttack Flow can also be used as a kind of assessment for threat actors, malware and where\nthe attacks happened (location).\n\nShort Assessment of the threat actor, the ransomware and where the unkown threat actor\noperates\nThe more I dived deeper into the ransomware itself, the more I realized that Attack Flow is\nan excellent reverse engineering and forensic tool. If you really want to understand the\nattacks in terms of the components of the artifacts a specific attack has, the representation of\nprocesses and procedures within it, attack flow can help you to understand the necessary\ntechnical understanding you’ve missed before. The analyst is more forced to understand the\ntechnical processes and more important: to understand them in the right order.\n\n\n-----\n\nCommand lines can be displayed just like files or software, as well as tools that can be\npictured and sketched separately. The longer I spent time with Attack Flow, the more\nenthusiastic I am about it.\n\nCommand lines, files, processes and action can be added to have the whole overview of the\nprocedures adversary use\nI worked through the Trendmicro report step by step and realized that if I had only read the\nCTI report, half of the information would have been skimmed, but the technical depth for the\nransomware itself only emerged during the modelling itself.\n\nUsing attack flow helps you understand the how the ransomware is deployed without having\nreversed engineered it on your own\n**Conclusion: I recommend every organization to familiarize themselves with such modelling**\ntools and to study attacks graphically shown in a flow chart. Creating an attack flow not only\nhelps to understand the correct course of the attack, but also to understand the technical\ndepth that is necessary in order to then be able to write detection or make statements about\nwhich MITRE ATT&CK techniques are particularly relevant in order to achieve the fastest\npossible so called “choke point”. It means to find an early MITRE ATT&CK technique in the\nkill chain where the attacker can’t get any further.\n\nFor those who write forensic reports it can then be used as existing attack flows to verify own\nanalysis hypotheses and have a basis for own documentation of the incidents. Even artifacts\nand IOCs can be mapped.\n\nBasically, Attack Flow is a simple to use tool that is accessible to everyone, with which\nplaybooks or threat hunting solutions can also be created.\n\nCTI analysts can use Attack Flow to create highly detailed, behavior-based threat\nintelligence products. The langauge is machine-readable to provide for interoperability\nacross organizations and commercial tools. Users can track adversary behavior at the\nincident level, campaign level, or threat actor level. Instead of focusing on indicators of\ncompromise (IOCs), which are notoriously inexpensive for the adversary to change,\nAttack Flow is centered on adversary behavior, which is much more costly to change.\n\n[AttackIQ’s Breach and Attack Simulation tool goes one step further. It integrates the attack](https://www.attackiq.com/)\nflows into the BAS solution and you can then emulate the attack modify steps and define\ndifferent or several choke points as appropriate mitigations are implemented and tests are\nrepeated iteratively, structured, rigid and measurable, rapidly. They’ve got a [blog for the](https://www.attackiq.com/blog/)\ncommunity where you can get the latest attack flows that AttackIQ has developed.\n\nWhat’s next? It would be interesting how to use such reverse engineering attack flows to\n[develop further countermeasures or detections. D3FEND and other threat informed tools](https://d3fend.mitre.org/)\ncould provide to understand the adequate mitigation an organization need.\n\n\n-----\n\nFile Removal of known malicious artifacts could be an adequat countermeasure\n\n\n-----\n\n**Defensive Posture**\n\nThe blue team can use Attack Flow to assess and improve their defensive posture, as\nwell as provide leadership with a data-driven case for resource allocation. Attack Flow\nallows for a realistic risk assessment based on observed adversary sequences of\nattack, allowing defenders to play out hypothetical scenarios (e.g. table top exercises)\nwith high fidelity. Defenders can reason about security controls over chains of TTPs to\ndetermine gaps in coverage, as well as choke points where defenses should be\nprioritized.\n\n**Executive Communications**\n\nFront-line cyber professionals can use Attack Flow to roll up highly complicated,\ntechnical details of an incident into a visual depiction that aids communication with\nnon-technical stakeholders, management, and executives. This format Attack Flow\nallows defenders to present their analysis of an attack and their defensive posture\nstrategically while de-emphasizing raw data, technical jargon, and other information\nthat executives do not need to make a business decision. Defenders can use flows to\ncommunicate the impact of an attack in business terms (i.e. money) and make a\nconvincing case for new tools, personnel, or security controls to prioritize.\n\n**Lessons Learned**\n\nIncident responders can use Attack Flow to improve their incident response (IR)\nplanning and after-action review. After a security incident has occurred, responders\ncan create flows to understand how their defenses failed and where they can apply\ncontrols to reduce future risk and enhance threat containment. Mapping a flow will also\nallow defenders to see where their defenses succeeded and what they should continue\nto do going forward. Creating attack flows is an easy way to ensure the incident is\ndocumented and organizational knowledge is retained for future use. Over time, this\nwill improve defenders’ ability to mitigate and recover from incidents more efficiently.\n\n**Adversary Emulation**\n\nThe red team can use Attack Flow to create adversary emulation plans that focus their\nsecurity testing on realistic sequences of TTPs informed by public as well as\nproprietary intelligence. The red team can leverage a corpus of attack flow to identify\ncommon attack paths and TTP sequences. In purple team scenarios, a flow is a very\nprecise way to communicate between attackers and defenders.\n\n**Threat Hunting**\n\n\n-----\n\nThreat hunters can use Attack Flow to identify common sequences of TTPs observed\nin the wild, then hunt for those same TTP chains in their own environment. These flows\ncan guide investigative searches, piecing together techniques and timestamps to\nconstruct detailed timelines. Attack Flow can showcase the adversary tools and TTPs\nthat are being used, which can help aid in writing detections against common\nbehaviors and/or adversary toolsets, as well as prioritizing those detections.\n\n[An introduction to the Attack Flow project you can find here.](https://medium.com/mitre-engenuity/attack-flow-beyond-atomic-behaviors-c646675cc793)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-19 - Rorschach Ransomware Analysis with Attack Flow.pdf"
    ],
    "report_names": [
        "2023-04-19 - Rorschach Ransomware Analysis with Attack Flow.pdf"
    ],
    "threat_actors": [
        {
            "id": "a7d4fe31-d92f-425a-ba8c-c70219f52fb8",
            "created_at": "2022-10-25T15:50:23.466009Z",
            "updated_at": "2025-03-27T02:00:55.477162Z",
            "deleted_at": null,
            "main_name": "Frankenstein",
            "aliases": [
                "Frankenstein"
            ],
            "source_name": "MITRE:Frankenstein",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "56b3eb1d-6baf-4ee4-a098-ec0081280315",
            "created_at": "2024-09-28T02:05:36.599884Z",
            "updated_at": "2025-03-27T02:05:17.250078Z",
            "deleted_at": null,
            "main_name": "ALUMINUM THORN",
            "aliases": [
                "WIRTE ",
                "Frankenstein "
            ],
            "source_name": "Secureworks:ALUMINUM THORN",
            "tools": [
                " Powershell Empire",
                "FruityC2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1683339001,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1683252310,
    "ts_modification_date": 1683252310,
    "files": {
        "pdf": "https://archive.orkl.eu/f41c68d37ce2fc180115779ff6368ed70d120292.pdf",
        "text": "https://archive.orkl.eu/f41c68d37ce2fc180115779ff6368ed70d120292.txt",
        "img": "https://archive.orkl.eu/f41c68d37ce2fc180115779ff6368ed70d120292.jpg"
    }
}