{
    "id": "df7cb2e2-4557-4a0f-acae-963379357079",
    "created_at": "2023-01-12T15:07:52.395193Z",
    "updated_at": "2025-03-27T02:16:25.595221Z",
    "deleted_at": null,
    "sha1_hash": "114dfcdc1fd9babb83278782a0e2b0c4fc0f84d5",
    "title": "2021-07-21 - The Coper―a new Android banking trojan targeting Colombian users",
    "authors": "",
    "file_creation_date": "2022-05-28T15:22:31Z",
    "file_modification_date": "2022-05-28T15:22:31Z",
    "file_size": 290975,
    "plain_text": "# The Coper―a new Android banking trojan targeting Colombian users\n\n**news.drweb.com/show/**\n\nDoctor Web\n\n[Back to news](https://news.drweb.com/list/?p=0&lng=en&c=5)\n\n**July 21, 2021**\n\n**Doctor Web warns of a newly discovered family of Android banking trojans dubbed**\n**Android.BankBot.Coper. The malicious apps have a modular architecture and a multi-**\n**stage infection mechanism. They also have several protective techniques helping**\n**them withstand removal attempts. That allows the trojans to stay active longer and**\n**perform more successful attacks. All known Coper banker trojan modifications target**\n**Colombian users to date. However, new versions targeting users from other countries**\n**are likely to emerge over time.**\n\nAll Android.BankBot.Coper samples discovered and investigated by our malware analysts\nwere spread as the official Bancolombia financial institution app called Bancolombia\nPersonas. To make them appear more legitimate, the icon of these fake apps was designed\nto follow the looks of genuine software from the targeted bank. For comparison, below is an\nexample of the fake app’s icon (left image) and the genuine Bancolombia app icons (right\nimage) [available on Google Play:](https://play.google.com/store/apps/developer?id=Bancolombia+S.A.)\n\n\n-----\n\nThe infection process itself is divided into several stages. The first step is installing the decoy\nfake app that cybercriminals pass off as banking software. This application is none other\nthan a dropper whose primary task is to spread and install the main malicious module hidden\ninside it onto the targeted Android device. Since the operating logic of the analyzed trojan\nmodifications is practically the same as Android.BankBot.Coper.1, this trojan will be used\nas an example to describe the functioning mechanism.\n\nUpon launch, the dropper decrypts and runs an executable dex file\n(Android.BankBot.Coper.2.origin) located in its resources and disguised as a web\ndocument named o.htm. This trojan component plays a role in the second stage of the\ninfection process. One of its tasks is to obtain access to the Accessibility Services functions.\nUsing these functions, the trojan will have full control over the infected device and imitate\nuser actions like pressing the menu button and closing windows. To do so, it requests\ncorresponding permissions from the victim. If successful, the trojan will perform all further\nmalicious actions on its own. It tries to disable Google Play Protect, built-in malware\nprotection in the operating system; it also tries to allow installing apps from unknown sources\nand to install and run the main malicious module, providing it with access to the Accessibility\nServices.\n\n\n-----\n\nThe trojan decrypts and, using obtained privileges, installs the malicious apk package\n(Android.BankBot.Coper.2) that’s hidden in the second decrypted file, disguised as an\naudio file PViwFtl2r3.mp3. This file contains the trojan module\n**Android.BankBot.Coper.1.origin that performs the main malicious tasks the attackers**\nneed. The trojan module is installed under the guise of a system application called Cache\nplugin that uses a default gearwheel icon normally used by some Android system apps. Such\napp name and the icon increase the chances that users won’t suspect that this software is a\nthreat.\n\nWhen launched, this main module gains access to many important functions. For example,\nthe trojan requests permission from the victim to read and manage notifications and join the\ndevice’s battery optimization white-list. The latter will allow the trojan to operate continuously\nwithout the risk of being terminated by the system. Moreover, the trojan automatically\nbecomes the device administrator and gains access to manage phone calls and SMS.\n\n\n-----\n\nNext, this malicious module conceals its icon from the list of installed apps located on the\nhome screen, hiding from the user. Then, it notifies the C&C server about the successful\ninfection and waits for further commands. The trojan maintains a constant connection to the\nC&C server by sending out requests every minute. If needed, this time interval can be\nchanged with corresponding command. In addition, depending on the answer received from\nthe C&C server, the trojan can also change other settings, including:\n\na list of C&C servers\na list of targeted applications determining which windows will be overlaid by a phishing\nwindow upon launch\na list of applications to delete\n\n\n-----\n\na list of applications that the trojan will prevent from launching, returning the user to the\nhome screen\na list of apps that will have their notifications blocked\nother parameters\n\nUpon receiving the direct commands, the Android.BankBot.Coper.1.origin can perform the\nfollowing malicious actions:\n\nsend USSD requests\nsend SMS\nlock the device screen\nunlock the device screen\nstart intercepting SMS\nstop intercepting SMS\ndisplay a push notification\nre-display phishing window on top of the specified app\nrun a keylogger\nstop a keylogger\nuninstall applications specified in the command\nuninstall itself with the dropper app\n\nMoreover, the trojan intercepts and sends the contents of the incoming push notifications to\nthe C&C server.\n\nTo display a phishing window, the Android.BankBot.Coper.1.origin uses a well-known\ntechnique that has become a standard for Android banking trojans. The contents of such a\nwindow are downloaded from the remote server and placed into WebView, making it imitate\nthe appearance of the targeted application to trick the victim.\n\n**Android.BankBot.Coper trojans are endowed with several defensive mechanisms. One of**\nthem is to control the integrity of the primary malicious component. In case it’s deleted, the\nCopper bankers will try to reinstall it.\n\nThe second protective method is to monitor potentially dangerous actions to the trojan,\nincluding:\n\nopening the Google Play Protect page in the Play Store app\nuser attempts to change the device administrators’ list\nuser access to the trojan’s information page from the system’s list of installed apps\nuser attempts to change the trojan’s access rights for the Accessibility Services\nfunctions\n\nIf the trojans detect any of these events, they use Accessibility Services to simulate pressing\nthe Home button, returning the victim to the home screen. And if they detect that the user is\ntrying to uninstall them they simulate pressing the Back button So the trojans not only\n\n\n-----\n\nprevent their removal but also prevent the owners from normally using their own devices.\n\nIn addition, the Android.BankBot.Coper droppers are equipped with additional protective\nmechanisms. For example, they check if they’re running in a virtual environment, verify if\nthere’s an active SIM card and also check user’s country of residence. If one of these checks\nfails, the droppers will immediately stop running. The purpose of such verifications might be\nto prevent the installation of the main malicious module in conditions unfavorable for the\ntrojans, effectively avoiding early detection. Unfavorable conditions might include installing\nunder the control of security specialists or onto user devices from countries of no interest to\nthe attackers. It’s worth noting that in the analyzed samples, these verifications are not used,\nbut they might be used in future modifications.\n\nDoctor Web recommends Android users to install banking software only from official app\ncatalogs and official financial institutions' websites. That’s if, for some reason, using the\nofficial app store isn’t possible.\n\nDr.Web anti-virus products for Android successfully detect and delete all known modifications\nof the Android.BankBot.Coper banking trojans, so they pose no threat to our users.\n\n[Indicators of compromise](https://github.com/DoctorWebLtd/malware-iocs/blob/master/Android.BankBot.Coper/README.adoc)\n\n[More details on Android.BankBot.Coper.1](https://vms.drweb.com/search/?q=Android.BankBot.Coper.1&lng=en)\n[More details on Android.BankBot.Coper.2.origin](https://vms.drweb.com/search/?q=Android.BankBot.Coper.2.origin&lng=en)\n[More details on Android.BankBot.Coper.2](https://vms.drweb.com/search/?q=Android.BankBot.Coper.2&lng=en)\n[More details on Android.BankBot.Coper.1.origin](https://vms.drweb.com/search/?q=Android.BankBot.Coper.1.origin&lng=en)\n\n[What is the benefit of having an account?](https://www.drweb.com/user/advantages/?lng=en)\n\n## Tell us what you think\n\nTo ask Doctor Web’s site administration about a news item, enter @admin at the beginning\nof your comment. If your question is for the author of one of the comments, put @ before\ntheir names.\n\n### Other comments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-21 - The Coper―a new Android banking trojan targeting Colombian users.pdf"
    ],
    "report_names": [
        "2021-07-21 - The Coper―a new Android banking trojan targeting Colombian users.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536072,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653751351,
    "ts_modification_date": 1653751351,
    "files": {
        "pdf": "https://archive.orkl.eu/114dfcdc1fd9babb83278782a0e2b0c4fc0f84d5.pdf",
        "text": "https://archive.orkl.eu/114dfcdc1fd9babb83278782a0e2b0c4fc0f84d5.txt",
        "img": "https://archive.orkl.eu/114dfcdc1fd9babb83278782a0e2b0c4fc0f84d5.jpg"
    }
}