{
    "id": "dfd4aff4-2c04-4576-9bdb-6211ea0963a2",
    "created_at": "2023-01-12T15:09:43.032832Z",
    "updated_at": "2025-03-27T02:09:29.472014Z",
    "deleted_at": null,
    "sha1_hash": "b93b192da90aa567717728cca459a7cc2cbeafda",
    "title": "2022-03-25 - Cybercriminal Connected to Multimillion Dollar Ransomware Attacks Sentenced for Online Fraud Schemes",
    "authors": "",
    "file_creation_date": "2022-05-28T03:39:39Z",
    "file_modification_date": "2022-05-28T03:39:39Z",
    "file_size": 73883,
    "plain_text": "# Cybercriminal Connected to Multimillion Dollar Ransomware Attacks Sentenced for Online Fraud Schemes\n\n**[justice.gov/opa/pr/cybercriminal-connected-multimillion-dollar-ransomware-attacks-sentenced-online-fraud-schemes](https://www.justice.gov/opa/pr/cybercriminal-connected-multimillion-dollar-ransomware-attacks-sentenced-online-fraud-schemes)**\n\nMarch 25, 2022\n\nDepartment of Justice\n\nOffice of Public Affairs\n\nFOR IMMEDIATE RELEASE\n\nFriday, March 25, 2022\n\nAn Estonian man was sentenced today to 66 months in prison for his years-long role in\nfurthering and facilitating computer intrusions, the movement of fraudulently obtained goods\nand funds, and the monetization of stolen financial account information. He also participated\nin ransomware attacks causing over $53 million in losses and was ordered to pay over $36\nmillion in restitution.\n\nAccording to court documents, Maksim Berezan, 37, of Estonia, who was apprehended in\nLatvia and extradited to the United States, pleaded guilty in April 2021 to conspiracy to\ncommit wire fraud affecting a financial institution and conspiracy to commit access device\nfraud and computer intrusions. Berezan was an active member of an exclusive online forum\ndesigned for Russian-speaking cybercriminals to gather safely and exchange their criminal\nknowledge, tools, and services. From 2009 through 2015, Berezan not only furthered the\ncriminal aims of the forum, but he also worked closely with forum members and other\ncybercriminals for purposes of obtaining and exploiting stolen financial account information.\n\n\n-----\n\nThis case is a prime example of how the Department of Justice can leverage its traditional\ntools – criminal investigations and prosecutions – to combat ransomware,” said Assistant\nAttorney General Kenneth A. Polite Jr. of the Justice Department’s Criminal Division. “Many\nof the world’s ransomware players began as fraudsters engaged in other types of online\ncrimes, and this case demonstrates that their crimes will catch up to them. The United States\nis committed to working with its international partners to hold cybercriminals accountable.”\n\n“Cybercrime has become increasingly more sophisticated, but so have our methods for\ncombatting it,” said U.S. Attorney Jessica D. Aber for the Eastern District of Virginia.\n“Ransomware attacks are devastating to people and organizations alike, and we have honed\nour strategies and techniques to target both the individual actors who perpetrate these\nattacks and the networks that support them. This case is just one example of how EDVA and\nthe Justice Department are tackling this threat.”\n\n“The Secret Service remains committed to ensuring that modern conveniences of today that\nfacilitate our lawful transactions and economic health are not leveraged by criminals for illicit\nactivity and personal gain,” said Special Agent in Charge Matthew Stohler of the U.S. Secret\nService. “While we have long been in the business of protecting money, from the earliest\ndays of coins and paper, to plastic, and today’s more accessible and commonplace digital\ncurrencies, we also remain in parallel footprint to the evolution of criminal behavior into\ncyberspace. Ransomware thieves are not safe in any dark corner of the internet in which\nthey may think they can hide from our highly trained investigators and law enforcement\npartners worldwide. Together with our critical partners we are dedicated to protecting the\npublic and securing every iteration of our money and every part of our national financial\ninfrastructure.”\n\nAccording to court documents, following Berezan’s arrest, investigators uncovered within his\nelectronic devices evidence of his involvement in ransomware activities. The post-extradition\ninvestigation determined that Berezan had participated in at least 13 ransomware attacks,\nseven of which were against U.S. victims, and that approximately $11 million in ransom\npayments flowed into cryptocurrency wallets that he controlled. Berezan used his ill-gotten\ngains to purchase two Porsches, a Ducati motorcycle, and an assortment of jewelry. In\naddition, authorities recovered from Berezan’s residence currency worth more than $200,000\nand electronic devices storing passphrases to bitcoin wallets that contained bitcoin worth\napproximately $1.7 million, which has been forfeited.\n\nAssistant Attorney General Kenneth A. Polite Jr. of the Justice Department’s Criminal\nDivision; U.S. Attorney Jessica D. Aber for the Eastern District of Virginia; Special Agent in\nCharge Matthew Stohler of the Washington Field Office of the U.S. Secret Service and\nSpecial Agent in Charge Jason Kane of the Criminal Investigative Division of the U.S. Secret\nService made the announcement.\n\n\n-----\n\nSenior Trial Attorney Laura Fong and Trial Attorney Alison Zitron of the Criminal Division s\nComputer Crime and Intellectual Property Section, and Assistant U.S. Attorneys Alexander P.\nBerrang, Jonathan Keim, and Zoe Bedell of the Eastern District of Virginia prosecuted the\ncase.\n\nThe Justice Department’s Office of International Affairs provided vital assistance. The\nDepartment of Justice extends its gratitude to authorities in Estonia and Latvia for their\nsignificant cooperation and assistance, in particular, the Latvian State Police and Estonian\nPolice.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-25 - Cybercriminal Connected to Multimillion Dollar Ransomware Attacks Sentenced for Online Fraud Schemes.pdf"
    ],
    "report_names": [
        "2022-03-25 - Cybercriminal Connected to Multimillion Dollar Ransomware Attacks Sentenced for Online Fraud Schemes.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536183,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653709179,
    "ts_modification_date": 1653709179,
    "files": {
        "pdf": "https://archive.orkl.eu/b93b192da90aa567717728cca459a7cc2cbeafda.pdf",
        "text": "https://archive.orkl.eu/b93b192da90aa567717728cca459a7cc2cbeafda.txt",
        "img": "https://archive.orkl.eu/b93b192da90aa567717728cca459a7cc2cbeafda.jpg"
    }
}