{
    "id": "e0476e4d-2504-44b1-ab33-dd8e584ebdee",
    "created_at": "2023-01-12T15:08:07.294063Z",
    "updated_at": "2025-03-27T02:05:41.547077Z",
    "deleted_at": null,
    "sha1_hash": "d0b5a27a8571343ac28881862ec7ed399e5e3ef0",
    "title": "2020-03-31 - Trickbot- A primer",
    "authors": "",
    "file_creation_date": "2022-05-28T16:53:08Z",
    "file_modification_date": "2022-05-28T16:53:08Z",
    "file_size": 360841,
    "plain_text": "# Trickbot: A primer\n\n**blog.talosintelligence.com/2020/03/trickbot-primer.html**\n\nBy [Chris Neal](https://twitter.com/g0jirasan)\n\n## Executive Summary\n\nTrickbot remains one of the most sophisticated banking trojans in the landscape while\nconstantly evolving.\nHighly modular, Trickbot can adapt to different environments with the help of its various\nmodules.\nThe group behind Trickbot has expanded their activities beyond credential theft into\nleasing malware to APT groups.\n\n### Overview\n\nIn recent years, the modular banking trojan known as Trickbot has evolved to become one of\nthe most advanced trojans in the threat landscape. It has gone through a diverse set of\nchanges since it was first discovered in 2016, including adding features that focus on\nWindows 10 and modules that target point of sale (POS) systems. Not only does it function\nas a standalone trojan, Trickbot is also commonly used as a dropper for other malware such\nas the Ryuk ransomware. The wide range of functionality allows this malware to adapt to\ndifferent environments and maximize effectiveness in a compromised network.\n\n\n-----\n\nTrickbot is typically delivered via a spam email containing a malicious document or malicious\nURL. In most cases, the subject of the emails will contain wording that is intended to alarm\nthe person who received it, such as an issue with a credit or debit card, and in recent\nexamples preying on fears of the COVID-19 virus. Once this document has been opened, a\nmacro will execute and download the next stage of the infection process. In some cases, the\nsecond stage of this infection chain is a loader like Emotet which in turn drops Trickbot. In a\nreverse of roles, Trickbot has also been commonly observed to drop other malware families.\n\n### Functionality\n\nA successor to the Dyre trojan, Trickbot was originally designed to steal and exfiltrate\nsensitive information from a compromised host through stealing cookies from browsers or\nperforming webinjects on banking or cryptocurrency trading sites. Over the years, Trickbot\nhas not only expanded that functionality, but also added new features such as the ability to\nbe used as a dropper for other malware. Trickbot is highly modular and can be configured by\nthe threat actor depending on the environment being targeted. Trickbot has a wide range of\ncapabilities enabled by the different modules that can be installed remotely. Here's a\nrundown of a few of the modules:\n\nA recent addition to the Trickbot arsenal of modules is \"rdpScanDll\" which allows the\nmalware to brute-force Remote Desktop Protocol (RDP) credentials. The list of available\nmodules for Trickbot is growing larger with time which shows that the authors are actively\nlooking for new ways to use it for financial gain. The creators have shown repeatedly that\nthey are persistent in regards to improving the functionality of Trickbot and its modules, and\nshould be considered as a significant threat.\n\nTrickbot employs several different techniques for obfuscation and evasion. TLS is used for\ncommand and control (C2) communications and while downloading the various modules for\ninstallation. C2 typically happens on the standard TLS port 443 but has also been observed\nto use port 449 on occasion. TLS is not the only form of encryption used by Trickbot. While\nexfiltrating sensitive information from a compromised host, the Microsoft CryptoAPI is used\nto encrypt the data as an extra layer of obfuscation\n\n\n-----\n\nThere are several different obfuscation and evasion techniques that Trickbot has used\n[throughout its lifetime including process hollowing, Heaven's Gate, custom base64 encoding](https://blog.talosintelligence.com/2019/07/rats-and-stealers-rush-through-heavens.html)\nand bypassing UAC. Trickbot has added functionality that is tailored specifically to Windows\n10 after Microsoft dropped extended support for Windows 7 in early 2020. Earlier this year, a\nnew feature was added which allowed fileless UAC bypass through the use of\n\"WSReset.exe,\" a Microsoft signed binary used to reset Windows Store settings.\n\n### Trickbot Gang\n\nThe actors behind Trickbot are commonly referred to as the \"Trickbot Gang.\" Financial gain\nis the primary motive for this group's actions. The group's operations have grown along with\nthe malware itself. At the time of this writing, the group has ventured into pushing a malicious\nAndroid application to victims whose Windows machines have been infected with Trickbot.\nThe intent is to convince the user to install the application on their Android phone, which\nsteals one-time codes that banks send as part of a 2FA sequence. Currently, this attack has\nonly been observed in Germany, but it is likely the use of this technique will increase if it\nproves to be effective.\n\n[Trickbot Gang also rents a Trickbot variant to state-sponsored APT groups. Not only are they](https://labs.sentinelone.com/the-deadly-planeswalker-how-the-trickbot-group-united-high-tech-crimeware-apt/)\nsupplying the malware, but they are also selling the access they have gained to high profile\nnetworks across the globe. This cooperation reflects the trend in recent years of statesponsored cyber espionage groups interacting with cyber criminal organizations.\n\nOne of the most devastating threats that Trickbot poses is the delivery of the Ryuk\nransomware with the help of Emotet. This has proven to be a dangerously effective\ncombination, generating millions of dollars of income in 2019 alone. The reason for this\ncombination of malware is that the Trickbot modules for lateral movement are an efficient\nmeans to propagate across a network before deploying Ryuk.\n\n### How to defend against Trickbot\n\nTo defend against Trickbot it is important to ensure a well organized, multi-layered\ncybersecurity program is in place within your organization.\n\n1. Email and spam filters are critical in the case of Trickbot as this is the initial infection\n\nvector.\n2. Perform regular updates and system hardening as Trickbot uses known Windows SMB\n\nexploits for propagation.\n3. Give employees regular phishing training and conduct regular awareness programs.\n[4. Employ strong password policies and use multi-factor authentication, such as Duo.](https://duo.com/)\n[5. Ensure updated endpoint security software, such as Cisco's AMP Endpoint, is](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n\ndeployed across your network.\n\n\n-----\n\nPractical security hygiene is critical in any given scenario but in the case of defending\nagainst Trickbot — it is even more important to maintain a strong security posture. Due to the\nmodular nature of Trickbot, it is impossible to predict how it will behave once it has an initial\nfoothold, hence the importance of preventative security measures.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-31 - Trickbot- A primer.pdf"
    ],
    "report_names": [
        "2020-03-31 - Trickbot- A primer.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536087,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653756788,
    "ts_modification_date": 1653756788,
    "files": {
        "pdf": "https://archive.orkl.eu/d0b5a27a8571343ac28881862ec7ed399e5e3ef0.pdf",
        "text": "https://archive.orkl.eu/d0b5a27a8571343ac28881862ec7ed399e5e3ef0.txt",
        "img": "https://archive.orkl.eu/d0b5a27a8571343ac28881862ec7ed399e5e3ef0.jpg"
    }
}