{
    "id": "e05e61cf-6b2c-4e07-9634-bb69e8e453fb",
    "created_at": "2023-01-12T15:05:17.255639Z",
    "updated_at": "2025-03-27T02:12:03.920191Z",
    "deleted_at": null,
    "sha1_hash": "d2e78900869d96bd2529a5444857ab91b6d4ed6f",
    "title": "2021-03-09 - Hafnium Update- Continued Microsoft Exchange Server Exploitation",
    "authors": "",
    "file_creation_date": "2022-05-28T21:44:01Z",
    "file_modification_date": "2022-05-28T21:44:01Z",
    "file_size": 542875,
    "plain_text": "# Hafnium Update: Continued Microsoft Exchange Server Exploitation\n\n**[blog.talosintelligence.com/2021/03/hafnium-update.html](https://blog.talosintelligence.com/2021/03/hafnium-update.html)**\n\n**[Update 3/11: The following OSQuery detects active commands being run through webshells](https://github.com/Cisco-Talos/osquery_queries/blob/7710dde68cd4c2017d69eb1418757e06d21d9c15/win_malware/win_malware_hafnium_cmds.yaml)**\nobserved used by actors on compromised Exchange servers. While systems may have been\npatched to defend against Hafnium and others, threat actors may have leveraged these\nvulnerabilities to establish additional persistence in victim networks. A thorough forensic\ninvestigation will be required to determine additional compromises.\n\n\n-----\n\nIt's been a week since Microsoft first [disclosed several zero-day vulnerabilities in Exchange](https://blog.talosintelligence.com/2021/03/threat-advisory-hafnium-and-microsoft.html)\nServer — and the scope has only grown since then. In its disclosure, Microsoft stated that a\n[new threat actor known as Hafnium was exploiting these vulnerabilities to steal emails.](https://blogs.microsoft.com/on-the-issues/2021/03/02/new-nation-state-cyberattacks/)\n\nSince Microsoft's initial disclosure, Cisco Talos has seen shifts in the tactics, techniques, and\nprocedures (TTPs) associated with this activity. The majority of the activity continues to\nfollow the guidance that was previously provided. We are, however, starting to see other\n[groups' activity in active incidents Cisco Talos Incident Response (CTIR) is responding to.](https://talosintelligence.com/incident_response)\nThese actors appear to be separate from the initial \"HAFNIUM\" actor and include groups that\nare leveraging infrastructure previously attributed to cryptocurrency mining campaigns,\ngroups creating or accessing web shells using notepad.exe or notepad++.exe and large\namounts of scanning activity without successful exploitation.\n\nWe have also identified organizations that may be involved in post-exploitation activity. The\nvictimology shows that financial services have been disproportionately affected by\nexploitation, with a few other notable verticals following including health care, education and\nlocal/state governments. This shows that, although the initial activity may have followed\nclosely with the guidance provided by Microsoft, as time passes, the amount of groups\nexploiting these vulnerabilities is only going to increase. This compounds the importance of\npatching these vulnerabilities as soon as possible.\n\nTalos also has some new additions to the IOCs to look out for and other forms of coverage in\nCisco Secure products.\n\n\n-----\n\nAs the days have passed the amount of victims and scope of the compromise has grown\nsignificantly. As more actors move into the space, it's likely going to get worse. We\nencourage everyone to patch as soon as possible. However, it may be too late for any users\nwho had a Microsoft Exchange server exposed. In those cases, it's important to hunt for\npotential exploitation and any consequences. First, we'll walk through Cisco Secure Orbital\nqueries and how they can help users who fear they could be targets.\n\n## Hunting Hafnium using OSQuery and Orbital\n\nCisco Secure Endpoint customers have access to Orbital queries. These leverage osquery\nto allow customers to query their endpoints directly. There are several ways a customer can\nleverage this to identify potential Hafnium incidents.\n\nLet's start by looking for the backdoors that may be present on servers. We'll begin by\nexecuting a query looking for them. These payloads can include things like web shells and\npotentially other utilities like powercat. After the user has logged into the Orbital portal, they\ncan select the endpoints they want to run the queries against, which in this case, may be the\napplicable Exchange servers. Then, you provide a custom SQL looking for the web shells,\nwhich has been provided below.\n\nSELECT script_path, script_text, DATETIME(time, \"unixepoch\", \"UTC\") AS\ncreation_time FROM orbital_powershell_events WHERE regex_match(script_text,\n\"New-Object\\s+System\\.Net\\.Sockets\\.TCPClient.+.GetStream\\s*\\(\\s*\\).*\\[\\s*byte\\s*\\\n\n[\\s*\\]\\s*\\].*0\\.\\.65535\\|:ASCII\\)\\.GetBytes.+.Write\\s*\\(.+.Flush\\s*\\(\\s*\\)\\s*\\}.+.Close\\s*\\\n(\\s*\\)\",0);\n\nOne thing of note here is that the orbital_powershell_events table is being used. Those\nfamiliar with osquery may have been expecting powershell_events, but the Orbital team has\nbuilt their own version and that is what the query is based on. If you are attempting more\ngeneral osquery requests outside of orbital, please use powershell_events instead. This\nparticular regex will match on the web shells that have been attributed to these campaigns.\nAny results should be triaged and responded to accordingly.\n\n\n-----\n\nThe example above is an example of how to search for the webshells. Now, let's focus on\nsome of the other payloads like powercat. Here is a second query that is specifically looking\nfor powercat, one of the other non-webshell based payloads, which is provided below:\n\nSELECT script_path, script_text, DATETIME(time, \"unixepoch\", \"UTC\") AS\ncreation_time FROM orbital_powershell_events WHERE script_path LIKE\n\"%raw.githubusercontent.com/besimorhino/powercat%\" OR script_path LIKE\n\"%powercat.ps1%\"\n\nAgain, this query makes use of orbital_powershell_events and should be modified if applying\nit to non-orbital-based systems. This query, once executed, should also provide customers\nwith the systems where this activity is likely to be found.\n\n\n-----\n\nLet's move past the initial compromise and start looking for some of the post-exploitation\nactivity. One of the most common post-exploitation activities was for the adversaries to\nexport mailboxes. This can also be found using the same Orbital interface with another\nquery, provided below.\n\nSELECT script_path, script_text, DATETIME(time, \"unixepoch\", \"UTC\") AS\ncreation_time FROM orbital_powershell_events WHERE regex_match(script_text,\n\"Add-PSSnapin Microsoft.Exchange.Management.Powershell.SnapIn;(GetMailboxExportRequest|Get-Mailbox&#x0A)\", 0);\n\nThis query will identify the mailbox export requests that are part of the TTPs associated with\nthese campaigns. Again, if executed properly, it should show the customer what systems\nhave potentially been affected and whether or not a mailbox export has already occurred.\nThese types of queries can be invaluable to a security organization trying to identify, not only\nif they were a victim, but how severe the effects may be. These queries are an excellent\nresource for security organizations, but it isn't the only way you can identify the activity in\nyour environment.\n\n\n-----\n\n## Hunting Hafnium using Cisco Secure IPS\n\nPart of our coverage includes NGIPS signatures that can identify the scanning and\nexploitation activity, as well as the post exploitation activity of web shells. As such, it can be\nleveraged to see if and how your enterprise may have been affected. Start by logging into\nyour console and then browsing to intrusion events and editing a search (shown below).\n\nNow you can focus the search for just the applicable signatures associated with Hafnium\n(57233-57246, 57251-57253). This will allow only the events associated with Hafnium and\napplicable webshells to be shown, this can be achieved by searching by Snort ID (shown\nbelow). Please note that some of these signatures do require TLS decryption to be in place\n[with Exchange servers similar to how it was required for Blue Keep detection.](https://blog.talosintelligence.com/2019/05/firepower-encrypted-rdp-detection.html)\n\n\n-----\n\nAfter adjusting the search to cover the applicable time frame, there will be a list of the\nsignatures that fired in the environment during that period. If you click through, you can get\ndetails about the systems that are affected and review any packet capture data obtained.\n\nShown below are the details provided for the events that triggered the signature, including\nsource and destination information and country of origin.\n\nAt this point, defenders can use the IOCs derived from these events to potentially focus any\nadditional investigations or as potential support of investigations already underway.\n\nOne of the most important takeaways for defenders is around the web shell signatures. Just\nbecause you found a web shell does not mean you were a Hafnium target Web shells are a\ncommon payload and may be the result of other actors leveraging other vulnerabilities.\nRegardless of their origins, they should be thoroughly investigated and remediated.\n\nThese are just a few examples of ways that Cisco Secure products can be leveraged to\nidentify if your enterprise was potentially affected and what payloads may have been\ndropped by the adversary. Customers could also search for other relevant IOCs such as\ndomains and IPs in other Cisco Secure solutions like Umbrella and Cisco Secure Network\nAnalytics.\n\nIf you find yourself a victim to this campaign or others that have dropped webshells and think\n[you may need incident response help. CTIR has already been dealing with multiple incidents](https://talosintelligence.com/incident_response)\nand stands ready to help remediate any issues that may have been uncovered.\n\n## Conclusion\n\nAs the days have passed, the effect of Hafnium has only grown. Patching is the first order of\nbusiness for any organization, but shortly thereafter, or concurrently, investigation into if and\n\n\n-----\n\nhow you were compromised is going to be paramount. Talos intelligence provides many\navenues for defenders to not only prevent compromise from occurring as the amount of\nactors leveraging these vulnerabilities increases, but also hunt for any activity that may have\nalready occurred. As we learn more about the nature of these attacks and the end goals, we\nwill continue to provide updates on what we are seeing in the field from the perspective of\nour threat intelligence researchers and incident responders.\n\n## Coverage\n\nSnort SIDs:\n\nCVE-2021-26857 — 57233-57234\nCVE-2021-26855 — 57241-57244\nCVE-2021-26858 & CVE-2021-27065 — 57245-57246\nCVE-2021-24085 — 57251\nCVE-2021-27065 — 57252-57253\nHtml.Webshell.Hafnium — 57235-57240\n\n***Please note that TLS Decryption is required for detection of the Exchange related SIDs.\n[This is similar to what was required for blue keep.*** ClamAV coverage:](https://blog.talosintelligence.com/2019/05/firepower-encrypted-rdp-detection.html)\n\nWin.Trojan.MSExchangeExploit-9838898-0\nWin.Trojan.MSExchangeExploit-9838899-0\nWin.Trojan.MSExchangeExploit-9838900-0\nAsp.Trojan.Webshell0321-9839392-0\nAsp.Trojan.Webshelljs0321-9839431-0\nAsp.Trojan.Webshell0321-9839771-0\n\nAdditional AMP Cloud IOCs for tools and malware related to these attacks:\n\nPowercat:\n\nSignature name: 20200719101800-3: PowerShell Download String\nSignature name: 20190301175656-4: Raw GitHub Argument\n\nLsass dumping:\n\nSignature name: 20201124100140-2: RunDLL32 Suspicious Process\n\n\n-----\n\n[Cisco Secure Endpoint (AMP for Endpoints) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware detailed in this post. Try AMP for free [here.](https://cisco.com/go/tryamp)\n\n[Cloud Web Security (CWS) web scanning prevents access to malicious websites and detects](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nmalware used in these attacks.\n\n[Cisco Secure Email Email Security can block malicious emails sent by threat actors as part](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\nof their campaign.\n\n[Cisco Secure Firewall/Secure IPS (Network Security) appliances such as Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Firewall (NGFW), Next-Generation Intrusion Prevention System (NGIPS),](https://www.cisco.com/c/en/us/products/security/firewalls/index.html) [Cisco ISR, and](https://www.cisco.com/c/en/us/products/routers/branch-routers/index.html)\n[Meraki MX can detect malicious activity associated with this threat.](https://meraki.cisco.com/products/appliances)\n\n[Cisco Secure Network/Cloud Analytics (Stealthwatch / Stealthwatch Cloud)](https://www.cisco.com/c/en/us/products/security/stealthwatch/index.html)\n\n[Cisco Secure Malware Analytics (Threat Grid) helps identify malicious binaries and build](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Security products.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\n[Cisco Secure Web Appliance (Web Security Appliance)](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\n\nAdditional protections with context to your specific environment and threat data are available\n[from the Firepower Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n\n-----\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## Indicators of Compromise (IOCs)\n\nDomains (Previously associated with Powerghost):\n\nowa[.]conf1g[.]com\n\nbox[.]conf1g[.]com Suspicious Powershell download activity:\n\nhxxp://cdn.chatcdn[.]net/p?hig190509\n\nhxxp://cdn.chatcdn[.]net/p?hig190521\n\nhxxp://cdn.chatcdn[.]net/p?hig200720\n\nhxxp://cdn.chatcdn[.]net/p?hig210304\n\nhxxp://cdn.chatcdn[.]net/p?hig210305\n\nhxxp://cdn.chatcdn[.]net/p?low190617\n\nhxxp://p.estonine[.]com/low?ipc\n\nhxxp://p.estonine[.]com/p?e\n\nhxxp://p.estonine[.]com/p?smb\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-09 - Hafnium Update- Continued Microsoft Exchange Server Exploitation.pdf"
    ],
    "report_names": [
        "2021-03-09 - Hafnium Update- Continued Microsoft Exchange Server Exploitation.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535917,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653774241,
    "ts_modification_date": 1653774241,
    "files": {
        "pdf": "https://archive.orkl.eu/d2e78900869d96bd2529a5444857ab91b6d4ed6f.pdf",
        "text": "https://archive.orkl.eu/d2e78900869d96bd2529a5444857ab91b6d4ed6f.txt",
        "img": "https://archive.orkl.eu/d2e78900869d96bd2529a5444857ab91b6d4ed6f.jpg"
    }
}