{
    "id": "e1062610-170b-42c8-bc51-eb2b69171e58",
    "created_at": "2022-10-25T16:48:17.798643Z",
    "updated_at": "2025-03-27T02:11:40.007388Z",
    "deleted_at": null,
    "sha1_hash": "142d4447504e30012d98fea16831f2363c62c5ca",
    "title": "Energetic Bear _ Crouching Yeti",
    "authors": "Kaspersky",
    "file_creation_date": "2014-07-31T14:59:38Z",
    "file_modification_date": "2014-07-31T15:00:41Z",
    "file_size": 1650687,
    "plain_text": "# Energetic Bear – Crouching Yeti\n\n## Global Research and Analysis Team\n\n### July 2014\n\n Version 1.0\n\n\n-----\n\n### 1. Executive Summary\n\nEnergetic Bear/Crouching Yeti is an actor involved in several advanced persistent threat (APT)\ncampaigns that have been active going back to at least the end of 2010. Targeted sectors\ninclude:\n\n  - Industrial/machinery\n\n  - Manufacturing\n\n  - Pharmaceutical\n\n  - Construction\n\n  - Education\n\n  - Information technology\n\nMost of the victims we identified fall into the industrial / machinery building sector, indicating this\nis of special interest.\n\nTo infect the victims, the attackers rely on three methods:\n\n  - Spearphishing using PDF documents embedded with a flash exploit (CVE-2011-0611)\n\n  - Trojanized software installers\n\n  - Waterhole attacks using a variety of re-used exploits\n\nDuring the attacks, the Crouching Yeti uses several malware / Trojans, which exclusively infect\nWindows systems:\n\n  - Havex Trojan\n\n  - Sysmain Trojan\n\n  - The ClientX backdoor\n\n  - Karagany backdoor and related stealers\n\n  - Lateral movement and second stage tools\n\nFor command and control, these connect to a large network of hacked websites. These sites\nhost malware modules, victim information and issue commands to infected systems.\n\nThe dozens of known Yeti exploit sites and their referrer sites were legitimate, compromised\nsites. They ran vulnerable content management systems or vulnerable web applications. None\nof the exploits used to compromise the servers were known to be zero-day. None of the client\nside exploits re-used from the open source metasploit framework were zero-day.\n\nOverall, we observed about 2,800 victims worldwide, the most prevalent attack tool being the\nHavex Trojan.\n\n\n**TLP: Green** 2\n\n\n-----\n\nWe believe this group is highly determined and focused on a very specific industrial sector of\nvital interest. It uses a variety of ways to infect its victims and exfiltrate strategic information.\nThe analyzed data seems to suggest the following points:\n\n  - It is not currently possible to determine the Country of origin The attackers’ global focus\nis much broader than power producers\n\n  - Their toolset has remained stable over time\n\n  - Managed, minimal, methodical approach to sustained operation\n\n  - Appropriate use of encryption (symmetric key protected with attackers public key for\nencrypted log file exfiltration)\n\nThis report provides technical details on how they perform their operations.\n\n\n**TLP: Green** 3\n\n\n-----\n\n#### Table of contents\n\n**1. Executive Summary ..................................................................................................................... 2**\n**2. Analysis ...................................................................................................................................... 5**\n\n2.1. Delivery ................................................................................................................................ 5\n2.2. Malware ............................................................................................................................. 12\n\n2.2.1 The Havex Loader ........................................................................................................... 12\n2.2.2 The Ddex Loader ............................................................................................................ 16\n2.2.3 The Sysmain backdoor .................................................................................................... 16\n2.2.4 The ClientX backdoor ...................................................................................................... 17\n2.2.5 The Karagany Backdoor .................................................................................................. 18\n2.3. C&C servers and victims ....................................................................................................... 20\n\n2.3.1. Victims ......................................................................................................................... 24\n2.3.2. Victims-C&C relationship ............................................................................................... 32\n**3. Attribution ................................................................................................................................ 33**\n\n3.1. Non-specific Data ............................................................................................................. 33\n3.2. Exploit server activity ....................................................................................................... 36\n3.3. Victim characteristics and categories ................................................................................. 36\n**4. Conclusions ............................................................................................................................... 37**\n\nContact information\n\n[For any inquire please contact mailto:intelreports@kaspersky.com](mailto:intelreports@kaspersky.com)\n\n\n**TLP: Green** 4\n\n\n-----\n\n### 2. Analysis\n\nThis section analyzes all the aspects we could find about how this actor performs its campaigns.\n\nThe Crouching Yeti actor performed a massive surveillance operation targeting strategic victims,\nmany of them in the industrial/manufacturing sector.\n\nThere were different ways of delivering of its malware including waterholing, spearphishing and\nadding malware to legitimate installers. Once the victims were infected, Crouching Yeti selected\ndifferent RATs for its operations. These RATs communicated with Command and Control\nservers on compromised servers around the world, using a simple PHP backend.\n\nWe were able to identify several victims, including high-profile ones and dozens of domains\nused in the campaign.\n\n##### 2.1. Delivery\n\nAs far as we know the group behind Crouching Yeti delivers its malware using at least three\ndifferent methods.\n\n**1. Legitimate software installers**\n\nThe first method uses a legitimate software installer repackaged to contain the malicious DLL.\nSuch modified self-extracting archives could have been uploaded directly to a compromised\nserver, replacing the original file, or sent to the victim by email.\n\nOne example of this method was a hijacked SwissRanger camera driver (libMesaSR version\n1.0.14.706) that was used to drop the Sysmain backdoor to:\n```\n%APPDATA%\\sydmain.dll\n\n```\nand set the Run registry value to load malicious DLL upon next system startup.\n\n\n**TLP: Green** 5\n\n\n-----\n\n**Figure 1. MESA Camera description**\n\nIn a similar manner, as early as January 2014, Havex version 038 appears to have been\ndropped by a legitimate ~40MB software installer from the eWon web site:\n\nhxxp://www.ewon.biz/software/eCatcher/eCatcherSetup.exe\n\n“eWon” is a Belgian producer of SCADA and industrial network equipment, which helps define\nthis attack method as a watering hole attack:\n\n###### “Breaking the barrier between industrial applications and IT standards, the mission of eWON is to connect\n_industrial machines securely to the Internet, enabling easy remote access and gathering all types of_\n_technical data originating from industrial machines...Connecting machines across the Internet is our_\n_mission.”_\n\nSometimes, the Havex loader was dropped from “eCatcherSetup_v4.exe”, so it seems that the\nsite operators may have removed a previous file and the attackers replaced it with their\ntrojanized installer, and so on. Likely, the attackers gained access to eWon’s ftp site and\nreplaced the legitimate file with one that is bound with the Havex dropper several times.\n\n\n**TLP: Green** 6\n\n\n-----\n\n**Figure 2. eWon website screenshot**\n\nAnother example that involves a hijacked application from a PLC-related vendor is a Trojanized\nmbCHECK installer which replaced the original legitimate version freely downloadable from the\nvendor's website. The legitimate version can be downloaded for free from the vendor’s website.\nThe vendor - MB Connect Line - is a company which specializes in software for remote\nmaintenance of PLC systems: MB Connect Line\nGmbH(hxxp://www.mbconnectline.com/index.php/en/).\n\n\n**TLP: Green** 7\n\n\n-----\n\n**Figure 3. MB Connect Line website**\n\nIn this case, the dropped DLL was Havex version 043.\n\n**2. Malicious XDP file – spear-phishing**\n\nThe second method relies on a malicious XDP file containing the PDF/SWF exploit (CVE-20110611) and was most probably used in spear-phishing attacks. This exploit drops the Havex\n**loader DLL, which is stored in an encrypted form in the XDP file.**\n\nThe exploit is delivered as an XDP file (XML Data Package) which is actually a PDF file\npackaged within an XML container. This is a known the PDF obfuscation method and serves as\nan additional anti-detection layer.\n\nThe XDP file contains an SWF exploit and two files (encrypted with XOR) stored in the invalid\nsection of the PDF. One of the files is Havex DLL (version 038), the other is a small JAR file\nwhich is used to copy and run the DLL by executing the following command:\n```\ncmd /c copy <fname_passed_as_param> %TEMP%\\\\explore.dll /y &\nrundll32.exe %TEMP%\\\\explore.dll,RunDllEntry\n\n```\n\n**TLP: Green** 8\n\n\n-----\n\nSWF executes the action script, which contains another SWF file which in turn uses the CVE2011-0611 vulnerability to run the shellcode.\n\nThe shellcode then looks for a specific signature in the memory (which signs the start of\nencrypted DLL), decrypts and loads it.\n\n**3. Malicious JAR/Html files – waterholing**\n\nFinally, this actor actively compromises legitimate websites for watering hole attacks. These\nhacked websites in turn redirect to malicious JAR or html files hosted on other sites maintained\nby the group (exploiting CVE-2013-2465, CVE-2013-1347, and CVE-2012-1723 in Java 6, Java\n7, IE 7 and IE 8), which then drop the Havex loader, the Karagany backdoor and helper\n**tools. These sites run an exploit kit known as “LightsOut”. It appears that the “LightsOut”**\nexploit kit is exclusively used by Energetic Bear/Crouching Yeti.\n\nFrom the dozens of Yeti exploit sites we reviewed, the malicious code was nothing more than\nslightly modified metasploit java exploits delivering the Havex loader. Some sort of internal\nreview must have pushed them towards the LightsOut EK. KSN data records help provide a list\nof Crouching Yeti related exploit delivery from dozens of these sites.\n\nIn earlier cases (July 2013), successful Java exploitation served from nahoonservices.com\nwould cascade into more Yeti components planted on victim systems. The java exploit\ndownloaded Karagany backdoors, which in turn downloaded stealers from 91.203.6.71:\n\n\n**TLP: Green** 9\n\n\n-----\n\n**Figure 4. Infection diagram**\n\nKsn data recorded at least 20 victim sites that were compromised and injected with Yeti iframes,\nredirecting hundreds of visitors to compromised Yeti exploit sites. Most of these redirector sites\nwere owned by western and Eastern European power players, investors, legal advisors and\nadvocates, and European and US industrial IT equipment makers. The compromised sites\nhosting the LightsOut Exploit Kit were fairly trafficked, legitimate sites. Their content varies\nwidely, from California winemakers to Cuban travel agencies and Iranian general\ninterest/religious inspiration sites.\n\n\n**TLP: Green** 10\n\n\n-----\n\nFinally, other second stage tools were simply retrieved by the downloaders over http from various servers. Some of these Yeti sites, like kinoporno.org,\nserved both Havex and these tools. KSN events recorded the sites serving Windows Credential Editor and custom credential and document stealing\ntools.\n\n**TLP: Green** 11\n\n\n-----\n\n##### 2.2. Malware\n\nThe Crouching Yeti group has different tools of choice for their operations. This section\ndescribes them from a technical perspective.\n\n###### 2.2.1 The Havex Loader\n\n**1. Description**\n\nThe main functionality of this component is to download and load additional DLL modules into\nthe memory. These are stored on compromised websites that act as C&C servers. In order to\ndo that, the malware injects itself into the EXPLORER.EXE process, sends a GET/POST request\nto the PHP script on the compromised website, then reads the HTML document returned by the\nscript, looking for a base64 encrypted data between the two \"havex\" strings in the comment tag\n```\n<!--havexhavex--> and writes this data it to a %TEMP%\\<tmp>.xmd file (filename is generated\n\n```\nby GetTempFilename function).\n\nIn the meantime, another routine is constantly checking the %TEMP% folder for all *.xmd files. For\neach file it finds, it decompresses the content, decrypts (if encrypted) and loads into the memory\nas the DLL.\n\nIn order to run on each system boot, malware copies itself to: <path>\\TMPprovider0XX.dll\nand creates the autorun registry key.\n\nAll samples of this component contain a statically linked bzip2 library. Versions >= 01B also\ncontain an RSAeuro library, used to encrypt log files and decrypt downloadable modules. Public\nkeys for encryption are hardcoded in the binary and/or stored in the configuration section. In\nsome cases, these keys are written to the registry values.\n\nIn total, we identified 124 different samples of Havex loaders, belonging to 27 different versions.\nAs of June 2014, the latest version number we have is 044.\n\n**2. C&C communication**\n\nThe URL addresses of the C&C servers (which are indeed compromised websites) are either\nhardcoded in the binary, or - in versions => 038 - specified in the configuration section inside the\nICT resource. This resource is compressed with bzip2 and encrypted with XOR.\n\nThere are usually 2-4 URLs per binary, different for each malware version and sometimes also\ndifferent between samples of the same version.\n\n\n**TLP: Green** 12\n\n\n-----\n\nMalware sends a GET request (versions < 017) or POST request to the first available URL. The\nrequest contents depends on the malware version and it may include such information as\nunique bot id, malware version number, OS version number, and some other data from\nconfiguration, as well as the harvested information logged into the *.yls file (if any). Then the\nmalware searches the HTML code of each returned page for havex markers and saves the data\nbetween the markers into a temporary file.\n\n**3. Downloadable modules - common characteristics**\n\nThese modules are hosted between the havex markers in the HTML code of compromised\nwebsites. The module code is usually XORed with ”1312312” then compressed with BZIP2 and\nfinally base64 encoded. Once downloaded into the %TEMP%\\*.xmd file by the main Havex DLL,\nthe code is decoded, decompressed, saved into the temporary DLL file and loaded into the\nmemory.\n\nThe modules perform a variety of different actions, including collecting information about the\nvictim’s system and other machines in the local network, harvesting passwords, listing\ndocuments, etc. In order to do that, some of the modules make use of additional 3rd stage 3rd\nparty executables.\n\nEach module contains configuration information stored in an encrypted and compressed form\ninside a resource. Configuration data includes 29-byte UID (unique ID), a 1024-bit RSA Public\nkey (base64 encoded) and other necessary info (like file paths, etc.). All harvested data is\ncompressed, encrypted and written into the %TEMP%\\*.yls files, which are then sent to the\nC&C by the main Havex/Sysmain module.\n\nThe “yls” files are encrypted with the 3DES crypto algorithm using a random 192-bit key (168 bit\neffective). The 3DES key is encrypted using the public RSA 1024 key and therefore never\ntransferred in plain text to attackers.\n\nIn-depth analysis of the cryptography used by log files is presented in Appendix 2\n\n**4. List of known modules**\n\nOPC scanner\n\nThis module is designed to collect detailed data about the OPC servers running in the local\nnetwork and save them to a %TEMP%\\{rand}.yls file. To query the OPC servers, it uses the\nfollowing interfaces:\n\n  - `IID_IOPCEnumGUID`\n\n  - `IID_IOPCServerList`\n\n\n**TLP: Green** 13\n\n\n-----\n\n  - `IID_IOPCServerList2`\n\n  - `IID_IOPCServer`\n\n  - `IID_IOPCBrowsr`\n\n  - `IID_IOPCBrowseServerAddressSpace`\n\n  - `IID_IOPCItemProperties`\n\n  - `CATID_OPCDAServer10`\n\n  - `CATID_OPCDAServer20`\n\n  - `CATID_OPCDAServer30`\n\nSysinfo module\n\nThis module collects basic information about the system it's running on, and saves it to the\n```\n%TEMP%\\{rand}.yls file. Harvested data includes: \n\n```\n  - Unique system ID\n\n  - OS version\n\n  - Username\n\n  - Computer name\n\n  - Country\n\n  - Language\n\n  - Current IP\n\n  - List of drives\n\n  - Default Browser\n\n  - Running Processes\n\n  - Proxy Setting\n\n  - User Agent\n\n  - Email Name\n\n  - BIOS version and date\n\n  - Lists of files and folders (non-recursive) from Desktop, My Documents and Program\nFiles folders and root directories on all drives.\n\nContact stealer module\n\nThis module collects contact details stored in all outlook.nk2 files and writes them to the\n```\n%TEMP%\\{rand}.yls file.\nOutlook.nk2 is the file where Outlook (version since 2007) keeps contact details in order to use\n\n```\nthem with the AutoComplete feature.\n\nPassword stealer module\n\nThis module uses the embedded BrowserPasswordDecryptor 2.0 tool\n(hxxp://securityxploded.com/browser-password-decryptor.php) to dump login credentials stored\nby the password managers of various browsers. Decrypted passwords are saved into the\n```\n%TEMP%\\~tmp1237.txt file, which is then copied by the parent module into an encrypted\n*.tmp.yls file.\n\n```\n\n**TLP: Green** 14\n\n\n-----\n\nList of browsers supported by the tool (from the product’s website):\n\n  - Firefox\n\n  - Internet Explorer\n\n  - Google Chrome\n\n  - Google Chrome Canary/SXS\n\n  - CoolNovo Browser\n\n  - Opera Browser\n\n  - Apple Safari\n\n  - Comodo Dragon Browser\n\n  - SeaMonkey Browser\n\n  - SRWare Iron Browser\n\n  - Flock Browser\n\nNetwork scanner module\n\nThis module is designed to scan the local network and look for all hosts listening on ports\nrelated to OPC/SCADA software. Information about these hosts is then saved to the\n```\n%TEMP%\\~tracedscn.yls file. \n\n```\n**Port number** **Software that uses this port**\n\nport 44818 Rslinx\n\nport 502 Modbus\n\nport 102 Siemens PLC\n\nport 11234 Measuresoft ScadaPro\n\nport 12401 7-Technologies IGSS SCADA\n\nIn-depth analysis of the Havex loader and its related modules is presented in Appendix 2.\n\n|Port number|Software that uses this port|\n|---|---|\n|port 44818|Rslinx|\n|port 502|Modbus|\n|port 102|Siemens PLC|\n|port 11234|Measuresoft ScadaPro|\n|port 12401|7-Technologies IGSS SCADA|\n\n\n**TLP: Green** 15\n\n\n-----\n\n###### 2.2.2 The Ddex Loader\n\n**1. Description**\n\nThis component is a simple downloader with a functionality similar to the Havex component.\n\nIt sends requests to the PHP script at the C&C (compromised website) and looks for specific\ndata in the returned HTML code.\n\nIt writes the data (some ASCII strings) from between <I6></I6> tags to the file in\n```\n%TEMP%\\Low\\~task.tmp and the data (binary data XORed with 0x0A) from between <B6></B6>\n\n```\ntags into the %TEMP%\\Low\\~ldXXXX.TMP file.\n\nThen it decrypts the ldXXXX.TMP file and loads it into memory.\n\nBased on the compilation times, we may assume that this loader was used to download and run\nmodules before it was replaced by Havex.\n\nThe Ddex loader is analyzed in more detail in Appendix 4.\n\n###### 2.2.3 The Sysmain backdoor\n\n**1. Description**\n\nThis malware can be described as a classical RAT (Remote Access Trojan), since it gives the\nattacker a wide range of opportunities to control and interact with the victim machine.\n\nThe autonomous part of Sysmain installs and registers itself to be persistent in the system.\n\nThen it gathers general information about the victim system, like\n\n  - User- and computer names\n\n  - Locale information\n\n  - Network- and drive status\n\n  - Default browsers\n\n  - Running processes\n\n  - File listing from the user profile directory.\n\nWhen ready, this data is submitted to one of the C&C-servers. After that, it checks periodically\nfor new commands from C&C (pulling via HTTP).\n\n\n**TLP: Green** 16\n\n\n-----\n\nWith a set of 11 commands, the malware is able to:\n\n  - Execute shell-commands\n\n  - Launch additional executables or libraries (sent by the attacker)\n\n  - Collect arbitrary files for later exfiltration\n\n  - Examine the victim’s file system.\n\nThere are also commands used for maintenance purposes. Among others, there are commands\nto change the pubkey for C&C-communication or delete its traces in the registry.\n\n**2. C&C communication**\n\nIt receives its commands from one of four static command-and-control servers. Every variant of\nthis malware has its own set of servers.\n\nAs usual, the attackers are using webservers - most likely compromised ones - as part of their\nC&C-infrastructure. To communicate with the C&C-server, the Trojan makes use of asymmetric\nencryption with a hardcoded pair of private and public keys.\n\nAnother public key is used to encrypt files, which are collected in a local dropzone on the\nvictim’s file system. The files in that dropzone will be submitted to the attacker later, all in one\ngo.\n\nAppendix 3 provides in-depth analysis of the Sysmain backdoor.\n\n###### 2.2.4 The ClientX backdoor\n\n**1. Description**\n\nThis component is written in .NET and is very similar to The Sysmain backdoor.\nThe settings of the RAT are stored in the registry as BASE64 encoded values.\n\nThe RAT gets its commands by sending a request to a PHP script on the C&C (compromised\nserver) as usual, and looks for specific data in the returned HTML code. The data in this case is\nstored between the havexhavex tags, it is then decrypted and decoded (base64).\n\nThe RAT supports 13 commands including:\n\n   - Screen capture\n\n   - Trojan Update\n\n   - Loading DLLs\n\n\n**TLP: Green** 17\n\n\n-----\n\n   - Starting executables\n\n   - Running shell commands\n\n   - Listing directories\n\nEach time a command (task) is executed, the result of that command is stored in the registry\nunder a subkey named “done” or “doneEXT”.\n\nThe results (which are called “answers” by the authors) are then POSTED to the C&C server.\n\nThe ClientX backdoor is analyzed in depth in Appendix 5.\n\n###### 2.2.5 The Karagany Backdoor\n\n**1. Description**\n\nKaragany is a simple backdoor that connects to the C&C and keeps waiting for commands. It\ncan download and run additional executables, load/delete modules, read file content, reboot the\ncomputer, update itself and remove all components.\n\nBesides backdoor functionality, it also extracts credentials from Internet Explorer’s password\nmanager to the prx.jpg file and injects a small DLL into the processes of web browsers. This\nDLL keeps listening to outgoing network traffic and looking for basic access authentication\ndetails sent over unencrypted HTTP. Affected browsers include Internet Explorer, Firefox,\nMozilla and Opera.\n\nWhen executed, it copies itself to the folder under %APPDATA% and creates a .lnk file in the\n```\n%STARTUP% directory. The folder name and filename are chosen from a list of strings hardcoded\n\n```\nin the binary:\n\n|Folder name|File name|\n|---|---|\n|Microsoft WCF services|SearchIndexer|\n|Broker services|ImeBroker|\n|Flash Utilities|fsutil|\n|Media Center Programs;|PnPutil|\n|Policy Definitions|BdeUISrv|\n|Microsoft Web Tools|WinSAT|\n\n\n**TLP: Green** 18\n\n\n-----\n\n|Reference Assemblies|pwNative|\n|---|---|\n|Analysis Services|SnippingTool|\n|InstallShield Information|DFDWizard|\n|IIS SQL Server|PrintBrmEngine|\n|Diagnostics;|WbemMonitor|\n|NTAPI Perfomance|dxpserver|\n|WPF Platform|PowerMng|\n\n\nIt also creates the C:\\ProgramData\\Mail\\MailAg\\ folder, where the information harvested by\ndownloaded modules will be stored.\n\nAfter checking if a connection to the Internet is up, it sends an initial POST request to the C&C\nserver. Known parameters used in C&C communication are:\n\n  - `&identifiant=<victim_uid>, which is calculated based on system version, system`\ninstall date, username and system metrics\n\n  - `&version=<bot_version_nr>`\n\n  - `&fichier=<file_content>`\n\n**2. List of known modules:**\n\nScreenshot module\n\nThis module is used to drop and run the DuckLink CmdCapture tool - a 3rd party freeware\nAutoIt application for capturing screenshots (hxxp://www.ducklink.com/).\n\nA screenshot of the desktop is saved into the C:\\ProgramData\\Mail\\MailAg\\scs.jpg file.\nAdditionally, other system information - such as the date and time of capture, computer name,\nusername, cpu architecture, os version, IP address, logon domain and logon server, desktop\ndetails (height, width, depth, refresh rate) and environmental variables - are logged in\n```\nC:\\ProgramData\\Mail\\MailAg\\scs.txt file.\n\n```\nModule listing documents and other files\n\nThis module is used to list all files and documents with specified extensions, or which have\nnames containing specified strings in the C:\\ProgramData\\Mail\\MailAg\\fls.txt file.\nSaved information includes path, size and modification time.\n\n\n**TLP: Green** 19\n\n\n-----\n\nFile matching patterns:\n```\n         *pass*.* *.rtf *.xls *.pdf\n         *secret*.* *.pst *.doc *.vmdk\n         *.pgp *.p12 *.mdb *.tc\n\n##### 2.3. C&C servers and victims\n\n```\nThe Command and Control Servers are compromised legitimate websites, like Blogs, from\ndifferent countries.\n\nIn total we have identified 219 unique domain names for these C&C servers hosted in 21\ndifferent countries.\n\nWe found most hosted C&Cs in the United States (81 servers), Germany (33 servers), the\nRussian Federation (19 servers) and the United Kingdom (7 servers).\n\n**Figure 5. C&C country distribution**\n\nThe table below shows the distribution of victims affected by the samples identified according to\nour KSN data.\n\n|*pass*.*|*.rtf|*.xls|*.pdf|\n|---|---|---|---|\n|*secret*.*|*.pst|*.doc|*.vmdk|\n|*.pgp|*.p12|*.mdb|*.tc|\n\n\n-----\n\nVictims infected with samples from any of the Crouching Yeti group’s malware were found in:\n\n\n**TLP: Green** 21\n\n\n-----\n\n**65 of these C&C servers, in the following countries, were monitored during our investigation.**\n\n**Figure 6. Monitored C&C servers country distribution**\n\nThis monitoring enabled us to get a list of the victims connected to them.\n\n**1. C&C backend**\n\nThe C&C Backend is written in PHP, consisting of 3 files:\n\n  - **“log.php” is a Web-Shell, used for file level operations.**\n\n  - **“testlog.php” is not a PHP-script but it contains the C&C Server logfile of Backdoor-**\nconnections. Please see “source.php” below for further information.\n\n  - **“source.php”**\n\nThe Backdoors interact with “source.php”, which is the control script. These are its functions on\nexecution:\n\n\n-----\n\n1. Collect the following information:\n\n**Information** **Syntax/content** **Used**\n**(written to log)**\n\nTimestamp day-month-year hour: minute- Yes\nsecond\n\nIP-address checks and returns a valid IP- Yes\naddress from HTTP-Request\n(“HTTP_CLIENT_IP”,\n“HTTP_X_FORWARDED”,\n“HTTP_X_FORWARDED_FOR”,\n“REMOTE_ADDR”)\n\nHost reverse lookup of IP-address No\n(gethostbyaddr)\n\nProxy Proxy-IP-address if Bot connected No\nthrough Proxy\n\nUserAgent UserAgent from HTTP-Request Yes\n\nRequest-URI string of URI requested by Bot Yes\n\nBotID BotID transferred with HTTP- Yes\nrequest\n\n2. Write the above information to “testlog.php”, separated by “Tabulator” and base64encoded, with the following syntax:\n\n_<timestamp>\\t<victim ip-address>\\t<proxy>\\t<botID>\\t<request-uri>\\t<useragent>_\n\n3. Write all transferred HTTP-GET Variables to “<botID>.log”, separated by “Tabulator” and\nbase64-encoded.\n\n4. If the bot executes an HTTP-POST-request, the transferred data is written to the file\n_“<botID>.ans”, enclosed in “xdata”-Tag with timestamp. (“ans” is the acronym for_\n“Answer”).\n\n5. Check for any “<botID>_*.txt” files\n\na. If found the first step is to append the timestamp, filename and a “sent” Status\nindicated to “<botID>.log”. Then the file content is transferred to the bot,\nembedded into HTML with the HTML-Body “No data!” and the HTML-Comment\n\n|Information|Syntax/content|Used (written to log)|\n|---|---|---|\n|Timestamp|day-month-year hour: minute- second|Yes|\n|IP-address|checks and returns a valid IP- address from HTTP-Request (“HTTP_CLIENT_IP”, “HTTP_X_FORWARDED”, “HTTP_X_FORWARDED_FOR”, “REMOTE_ADDR”)|Yes|\n|Host|reverse lookup of IP-address (gethostbyaddr)|No|\n|Proxy|Proxy-IP-address if Bot connected through Proxy|No|\n|UserAgent|UserAgent from HTTP-Request|Yes|\n|Request-URI|string of URI requested by Bot|Yes|\n|BotID|BotID transferred with HTTP- request|Yes|\n\n\n**TLP: Green** 23\n\n\n-----\n\n“havex”, which contains the data to be transferred. Finally the file on the server is\nremoved. If this removal fails it is logged to “<botID>.log”.\n\nb. If no matching file is found, an HTML-Response is sent with an empty “havex”\nHTML-Comment and HTML-Body text “Sorry, no data corresponding to your\n_request.”_\n\n###### 2.3.1. Victims\n\nThe term “victim” in this section refers to a botID (unique String of the Backdoor), connecting to\none or more C&C Servers. Based on the 45 C&C Servers wemonitored, a total of 2,811 unique\nVictims were discovered.\n\nThe average number of victims per C&C is 70:\n\n**Figure 7. Number of victims (Y) per C&C server instance (X)**\n\nThe following chart depicts the first (red line) and last (blue line) appearance of each victim on\nthe C&C.\n\nThe “FirstHit” shows how the rate of accumulating new victims has accelerated over the course\nof 2014. “LastHit” shows how the last connection of victims to C&C servers also increases over\ntime. This could mean victims are disinfecting their computers, or it may be that they simply\nreport to a different C&C server that we do not monitor.\n\n\n-----\n\n**Figure 8. Evolution of \"FirstSeen\" and \"LastSeen\" victims**\n\nMapping the unique hits of victims per day also indicates a decrease of “active” infections. The\nfollowing chart clearly shows a difference between weekdays (groups of five higher bars) and\nweekends (two lower bars). The daily unique hit-rate fell by about half from around 800\nconnections at the beginning of 2014 to around 400 connections per week-day by the middle of\nthe year:\n\n**Figure 9. Unique victims per day reporting to C&Cs**\n\nMore than half of the victims always connect from the same IP address. Fewer than half of the\nvictims connect from two or more different IP addresses as the following graph shows.\n\n\n-----\n\n**Figure 10. Number of different IPs per victim**\n\nThis might indicate that some of the victims are behind proxies, which makes sense for\ncorporate environments. Victims using many different IP addresses may indicate laptops.\n\nThe following chart visualizes all the unique victims connecting to C&C servers. The main C&C\nServers can be clearly seen in Russia and the USA. The victims are distributed across 99\ndifferent countries.\n\n\n**TLP: Green** 26\n\n\n-----\n\n**Figure 11. Connection between victims and C&C**\n\nFrom the total of 2,811 victims, it was possible to accurately identify 106 of them. Appendix 8\ncontains a brief description about the sector/company in which these victims operate.\n\nThe table below summarizes the distribution of the identified victims by sector.\n\n|Sector|Number of victim organizations|\n|---|---|\n|Educational|32|\n|Research|14|\n|Mechanical Engineering|10|\n|Information Technology|10|\n|Construction|9|\n|Government|8|\n|Health|5|\n|Network Infrastructure|3|\n\n\n**TLP: Green** 27\n\n\n-----\n\n|Pharmaceutical|2|\n|---|---|\n|Electrical Engineering|2|\n|Packaging|2|\n|Financial|2|\n|Energy|2|\n|Cleaning|1|\n|Automotive|1|\n|Structural Engineering|1|\n|Transportation|1|\n|Chemical|1|\n\n\n**1. Havex Victims**\n\nBased on our monitoring, the most widespread Backdoor is Havex with a total of 2,470 infected\nsystems, mostly based in USA and Spain:\n\n**Figure 12. Havex victims per country**\n\n\n-----\n\n32 different versions of Havex are used among all victims, with 51 victims left without any\nidentifiable Havex version. Havex Version 024, compiled at the end of 2012, is the most\nwidespread.\n\n**Figure 13. Havex version distribution**\n\nBesides the Havex version, the OS Version of the victim computer is also communicated to the\nC&C server. The most common Operating System among victims is Windows XP, but Windows\n8.1 is also on the list.\n\n\n-----\n\n**Figure 14. OS distribution among victims**\n\n\n**TLP: Green** 30\n\n\n-----\n\n**2. Sysmain Victims**\n\nThe Sysmain victims connect to six of the monitored C&C servers, where 261 unique victims\nwere counted, located in 38 different countries.\n\n**Figure 15. Sysmain victims per country**\n\n**3. ClientX Victims**\n\nVictims of the Clientx backdoor connect to 2 of the monitored C&C Servers, where 10 unique\nVictims were counted in 5 different countries.\n\n**Figure 16. ClientX victims per country**\n\n\n**TLP: Green** 31\n\n\n-----\n\n###### 2.3.2. Victims-C&C relationship\n\nBased on the analysis of the monitored C&C Servers we can identify some clusters based on\nmalware versions and the victims.\n\nThis graph visualizes these relations. Every dot represents a victim, different Backdoors and\nversions are colored differently. The C&C Servers are also represented as dots where several\nclients connect. Grey lines are connections from a victim to its C&C Server.\n\n**Figure 17. Clusters of victim-C&C relationships**\n\nSome C&C Servers are dedicated to a given version of a backdoor (big Cluster). Others share\nconnections with different backdoor versions and different backdoors.\n\nBreaking this down to the sectors of the identified victims, we cannot see any correlation\nbetween C&Cs and victims. The same sectors are targeted with different backdoor versions.\n\n\n-----\n\n### 3. Attribution\n\n###### 3.1. Non-specific Data\n\nCompared to our other APT research the available data is more non-specific than usual. There\nsimply is no one piece or set of data that would lead to the conclusion that the threat actor is\nBear, Kitten, Panda, Salmon, or otherwise. Significant data points below.\n\n**File timestamp analysis and unique strings**\n\nIt is rare to see file timestamps used as a precise, primary source of information when it comes\nto threat actor attribution. In previous reports, these timestamps have been used as supporting,\nor secondary pieces of data. They may help to suggest or support a time range for attacker\nactivity, but they are very easily modified. So it is not very helpful to focus on this data set.\n\nThe strings present in the backdoors, web components, and exploits are in English. Almost 200\nmalicious binaries and the related operational content all present a complete lack of Cyrillic\ncontent, the opposite of our documented findings from researching Red October, Miniduke,\nCosmicduke, Snake, and TeamSpy.\n\nThe OPC module strings include typos and bad grammar. Some are so bad they are almost silly\nand there doesn’t seem to be a consistent pattern here:\n```\nProgramm was started at %02i:%02i:%02i\nStart finging of LAN hosts...\nFinding was fault. Unexpective error\nWas found %i hosts in LAN:\nHosts was't found.\n\n```\nThere are also three interesting strings inside the Karagany backdoor:\n```\nidentifiant (which is French for identifier), fichier (French for file) and\nliteliteliteskot (lite scot is Swedish for little sheet)\n\n```\n**Timestamp details**\n\nTimestamp analysis is based on a total of 154 collected binaries:\n\n  - 124 Havex loader samples (versions 01 - 044) + 7 downloaded modules\n\n  - 7 Sysmain backdoor samples\n\n  - 4 Ddex loader samples\n\n  - 1 ClientX backdoor sample\n\n  - 4 Karagany Trojan samples + 2 downloaded modules\n\n  - 3 samples of Trojanized installers\n\n\n**TLP: Green** 33\n\n\n-----\n\nHighlights:\n\n  - The earliest samples related to this campaign are the Ddex loader binaries with\ncompilation timestamps between October and November 2010.\n\n  - The first Havex loader samples, version 01 and version 02, have compilation timestamps\nfrom 28th September 2011.\n\n  - The latest known samples are Havex loader version 044, compiled on 7th May 2014,\nand all OPC modules compiled in April and May 2014.\n\n  - Most samples were compiled on weekdays, although there are a couple of samples with\nthe compilation timestamp from a Saturday.\n\n  - Most samples were compiled between 6:00 and 16:00 UTC with a peak between 6:00\n**and 8:00 UTC.**\n\n      - Earliest compilation time:  02:15:23 UTC (Wed, 28 Sep 2011)\n\n     - Latest time:  23:39:34 UTC (Thu, 02 Jun 2011)\n\nActivity / Year (all samples):\n\n**Figure 18. Activity per year on different components**\n\n\n-----\n\nActivity / Weekdays based on compilation time:\n\n**Figure 19. Activity per weekday distribution**\n\nActivity / Hours (UTC) based on compilation time:\n\n**Figure 20. Activity per hour distribution**\n\n\n**TLP: Green** 35\n\n\n-----\n\n###### 3.2. Exploit server activity\n\nAll the exploit servers delivered slightly modified ripped content from open source repositories.\nAll the servers appear to be hacked servers. According to the available data, no zero-day\nexploits were used in any of these attacks, either to compromise the servers in the first place, or\ndelivered as client side attack exploits by the Lights Out Exploit Kit.\n\nWhile this purely malicious re-use of metasploit PoC highlights the danger that these attack\ntools pose, it is also unusual to see an exclusively metasploit attack toolset effectively used in\nthis way, delivered from what appear to be a chain of higher value compromised sites.\n\nAll of these compromised web applications were vulnerable to freely available offensive security\ntools. We acknowledge that many of the compromised referrer servers were related to power\nproducers in some way. However, these targets almost seem an afterthought, as the exploit\nservers themselves were compromised web servers from Cuban travel agency sites, a\nCalifornian winery site, a US based women’s fashion site, an Iranian general interest/religious\ninspiration site, a number of dating and adult content websites, and a variety of others.\nAlthough, we note that the known Trojanized software packages were ICS/SCADA related as\nwell, possibly because those victim sets or environments required special attention. So, while\nthere was a strong set of offensive activities on power producers during the campaigns, it was\nby no means the full focus of them.\n\n###### 3.3. Victim characteristics and categories\n\nWhile it may be “shocking” to observe power producers around the world targeted by any one\nthreat actor, this actor’s attack activity does not appear to be constrained to power producers.\nThe related industries of interest show a much broader global scope than previously discussed,\nand the geographic regions of interest have gone completely undiscussed. For example, Spain\nhad the highest number of victims. However, it appears that there was no significant correlation\nbetween the victim location and the C&C geolocation. And, according to our data, the list also\nincludes victim organizations fitting the following additional categories:\n\n  - Pharmaceuticals\n\n  - Health\n\n  - Cleaning\n\n  - Education\n\n  - Automotive\n\n  - Transportation\n\n  - Packaging\n\n  - Network Infrastructure\n\n  - Information Technology\n\n  - Structural Engineering\n\n  - Mechanical Engineering\n\n\n**TLP: Green** 36\n\n\n-----\n\n### 4. Conclusions\n\nThe Crouching Yeti actor has been performing massive surveillance campaigns in recent years,\nsince at least 2010. Their targets included thousands of victims of which we were able to identify\na few, confirming Crouching Yeti’s interest in several strategic sectors.\n\nThe distribution strategy of the group focuses on methods following this targeted philosophy,\nincluding spear phishing and waterholing. Noticeably, they also compromised legitimate\nsoftware packages from strategic actors in the SCADA sector in order to infect their final victims.\nThe victim list confirms that the tactic proved successful.\n\nThere is nothing especially sophisticated in their exploits, or in the malware they used to infect\nvictims. Their RATs are flexible enough to perform surveillance and data exfiltration efficiently.\nThey used dozens of compromised servers as Command and Control domains with a simple,\nbut effective, PHP backend.\n\nHowever there is an interesting connection with this group and the LightsOut Exploit Kit for the\ndistribution of its malware in some waterholing attacks. We believe they are likely its only\noperators as of June 2014.\n\nThanks to the monitoring of several of the Command and Control domains used by the group,\nwe were able to identify several victims. This victims’ list reinforces the interests shown by the\nCrouching Yeti actor in strategic targets, but also shows the interest of the group in many other\nnot-so-obvious institutions. We believe they might be collateral victims, but it might also be fair\nto redefine the Crouching Yeti actor not only as a highly targeted one in a very specific area of\ninterest, but a broad surveillance campaign with interests in different sectors.\n\nWe will continue monitoring this actor.\n\n\n**TLP: Green** 37\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/z0apbug9w1ztt8ex0pe99sq0d2u9r3nu",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.07.31.Energetic_Bear/EB-YetiJuly2014-Public.pdf"
    ],
    "report_names": [
        "EB-YetiJuly2014-Public"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d8dd2ca-5592-482e-b89d-6a7e1a49f4f6",
            "created_at": "2023-01-06T13:46:38.408359Z",
            "updated_at": "2025-03-27T02:00:02.826069Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "TeamSpy",
                "Team Bear",
                "Anger Bear",
                "IRON LYRIC"
            ],
            "source_name": "MISPGALAXY:TeamSpy Crew",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041500,
    "ts_creation_date": 1406818778,
    "ts_modification_date": 1406818841,
    "files": {
        "pdf": "https://archive.orkl.eu/142d4447504e30012d98fea16831f2363c62c5ca.pdf",
        "text": "https://archive.orkl.eu/142d4447504e30012d98fea16831f2363c62c5ca.txt",
        "img": "https://archive.orkl.eu/142d4447504e30012d98fea16831f2363c62c5ca.jpg"
    }
}