{
    "id": "e10c7b8f-7558-426a-aa15-ad6dccd42ce8",
    "created_at": "2023-01-12T15:06:58.819153Z",
    "updated_at": "2025-03-27T02:05:38.940865Z",
    "deleted_at": null,
    "sha1_hash": "efe6d1f9e1bbdae3acf138c5985a1686d01a51bc",
    "title": "2020-05-26 - Falcon Complete Disrupts Malvertising Campaign Targeting AnyDesk",
    "authors": "",
    "file_creation_date": "2022-05-28T22:04:49Z",
    "file_modification_date": "2022-05-28T22:04:49Z",
    "file_size": 1032460,
    "plain_text": "# Falcon Complete Disrupts Malvertising Campaign Targeting AnyDesk\n\n**[crowdstrike.com/blog/falcon-complete-disrupts-malvertising-campaign-targeting-anydesk/](https://www.crowdstrike.com/blog/falcon-complete-disrupts-malvertising-campaign-targeting-anydesk/)**\n\nFalcon Complete Team May 26, 2021\n\n[Although malvertising has been around for quite a while, it continues to be an effective way](https://www.crowdstrike.com/cybersecurity-101/malware/malvertising/)\nto lure unsuspecting users to install malware. In this blog, we describe a clever malvertising\ncampaign that led to the discovery of a weaponized AnyDesk installer that was being\ndelivered via targeted Google ad searches for the keyword “anydesk.”\n\nBeginning as early as April 21, 2021, the CrowdStrike Falcon Complete™ team observed a\nsuspicious file masquerading as AnyDesk called “AnyDeskSetup.exe” being written to disk\nand exhibiting suspicious behavior. However, this was not the legitimate AnyDesk Remote\nDesktop application — rather, it had been weaponized with additional capabilities. The initial\ndetection described below kicked off an internal collaboration across CrowdStrike’s Falcon\nOverWatch™ threat hunting, Intelligence, and Threat Detection and Response teams to\npiece everything together and respond to this emerging activity across the CrowdStrike\ncustomer base.\n\nFalcon Complete used this combined effort to provide a quick and effective response by\nquickly triaging and remediating the affected hosts and notifying affected customers in a\ntimely manner.\n\n## The Initial Detection\n\n\n-----\n\nThe initial activity triggered a detection within the CrowdStrike Falcon platform, tagged with\nMITRE’s technique T1036, “Masquerading.” An executable appeared to have been\nmanipulated to evade detection and was attempting to launch a PowerShell script with the\nfollowing command line:\n\n```\n\"C:\\Intel\\rexc.exe\" -exec bypass \\Intel\\g.ps1\n\n```\n\nDuring a review of the process tree, we noticed that “rexc.exe” appeared to be a renamed\nPowerShell binary in an attempt to bypass and avoid detections.\n\nFigure 1. Initial detection\n\nFurther reviewing the process tree, Falcon captured “AnydeskSetup.exe” running from the\nuser’s Downloads directory. A quick review of the file and the behavior observed from its\nexecution revealed that this was not a normal AnyDesk installer due to several reasons:\n\n1. The file observed was signed by “Digital IT Consultants Plus Inc.” and not by the\n\ncreators of AnyDesk, “philandro Software GmbH.”\n2. The network activity generated by the application was to a domain (anydeskstat[.]com)\n\nregistered on April 9, 2021, and hosted at a Russian IP address with the following\nregistrant information:\n\nFigure 2. Registrant information for anydeskstat[.]com\n\n3. Upon execution, a PowerShell implant was written to %TEMP/v.ps1 and executed with\n\na command line switch of “-W 1” to hide the PowerShell window.\n\n1. C:\\Windows\\System32\\cmd.eXe /c powershell -exec bypass -W 1\n```\n      \"C:\\Users\\redacted.user\\AppData\\Local\\Temp\\v.ps1”\n\n```\nAt this point in the investigation, we knew this was not a legitimate AnyDesk install and felt\nconfident that the activity was malicious in nature, meaning that a thorough investigation was\nwarranted Additionally we reached out to the OverWatch and Intelligence teams for parallel\n\n\n-----\n\ncollaboration as we continued our deep-dive investigation into this detection.\n\nWe then proceeded to remotely connect to the affected host using Falcon Real Time\nResponse (RTR) to gather additional insights into the detection. We were able to capture and\nacquire a copy of the PowerShell script “v.ps1” that was initially observed. The script had\nsome obfuscation and multiple functions that resembled an implant as well as a hardcoded\ndomain (zoomstatistic[.]com) to “POST” reconnaissance information such as user name,\nhostname, operating system, IP address and the current process name. In addition to the\nhardcoded domain, the script also had a specific user-agent string and URI to connect to, as\nseen in the snippet below:\n\nFigure 3. v.ps1 PowerShell script snippet\n\nThe rest of the script contains a while loop that runs and posts recon data to its C2 while\nwaiting for a response from the server. The logic we observed is very similar to logic\n[observed and published by Inde, where a masqueraded Zoom installer dropped a similar](http://www.inde.nz/blog/different-kind-of-zoombomb)\nPowerShell script from an external resource. In this scenario, we noticed this PowerShell\nscript being dropped from: `https://anydeskstat[.]com/statistic/statistics.php?w=`\n```\n<HOSTNAME>\n\n```\n\n-----\n\nFigure 4. URLDownloadToFile function (Click to enlarge)\n\nPseudocode describing execution capabilities of v.ps1:\n```\nfunction yrfed - C2 function to receive and upload tasking\nfunction ughrz - Recon function - UserDomainName, UserName, MachineName, IP Address,\nOperating System Version, True/False if user is System, Current Process Name\nfunction vnzmt - Command Handling - Dir, GetPID, Whoami, Hostname, or execute code\nvia Powershell IEX (with or without additional arguments) \nfunction jufsd - Gets current directory that the script is running in\nMain execution while loop:\n  Runs the Recon function and posts to the C2\n  Receives SessionID to track unique implants \n  Loop and check in with C2 and execute commands based on the response\n\n```\nDuring execution of v.ps1, Falcon captured the follow net commands being executed:\n```\nC:\\windows\\system32\\net.exe user redacted.user /dom\nC:\\windows\\system32\\net.exe user /dom\n\n```\nIn some instances, there were additional commands, which makes us believe that there was\nsome network and domain user profiling such as:\n```\nC:\\WINDOWS\\system32\\systeminfo.exe\nC:\\WINDOWS\\system32\\ipconfig.exe\nC:\\WINDOWS\\system32\\PING.EXE -n 1\nC:\\windows\\system32\\net.exe net group \"domain admins\" /domain\nC:\\WINDOWS\\system32\\cmd.exe /C systeminfo\nC:\\WINDOWS\\system32\\cmd.exe /C arp -a\n\n```\nThe CSharp compiler was also seen writing a DLL to %TEMP%. However, this DLL was not\npresent during the investigation. We believe this to be a Cobalt Strike beacon DLL due to\nsimilar activity observed leveraging a PowerShell Cobalt Strike payload against a different\ncustomer.\n\nThe weaponized AnyDesk installer also wrote persistence into the Startup directory:\n```\nC:\\Users\\\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\AnyDesk.exe\n\n```\n\n-----\n\nAt this point in the investigation, our initial thought was that the delivery mechanism was\nthrough a phishing or social engineering attempt. It was now time to pivot the investigation\ninto Endpoint Activity Monitoring (EAM) to gain further context and determine the origin of the\nactivity.\n\n### Investigation with Endpoint Detection and Response Data\n\nWhen investigating a detection seemingly dropping from a Setup or Installer file, one of the\nfirst investigative steps to address is to understand how that installer was written to disk.\n\nBy querying Falcon endpoint detection and response (EDR) data, we were able to see the\nfollowing pattern:\n```\n   DnsRequest: adservice.google[.]com\n   DnsRequest: googleadservices[.]com\n   DnsRequest: domohop[.]com\n   DnsRequest: anydesk.s3-us-west-1.amazonaws[.]com\n   PeFileWritten to Google Chrome User Data Cache\n   ProcessRollup2: \\Users\\redacted.user\\Downloads\\AnydeskSetup.exe\n   NewExecutableWritten:\n   \\Users\\redacted.user\\AppData\\Roaming\\Microsoft\\Windows\\Start\n   Menu\\Programs\\Startup\\AnyDesk.exe\n\n```\n```\nDirectoryCreate: Users\\redacted.user\\AppData\\Roaming\\AnyDesk\n\n```\n```\nProcessRollup2: \"C:\\Users\\redacted.user\\Downloads\\AnydeskSetup.exe\" -\n```\n```\nlocal-control\n\n```\n```\nProcessRollup2: \"C:\\Users\\redacted.user\\Downloads\\AnydeskSetup.exe\" \n```\n```\n-local-service\n\n```\n\nThe DnsRequests and PeFileWritten via Google Chrome confirmed our suspicion that the\nactivity started with a user-initiated download, but when diving deeper to investigate the\ncause, we made a fascinating finding in the user’s web traffic: The user had been attempting\nto search for “AnyDesk” using Google Chrome and was served up a malicious advertisement\nthat forced a redirect to domohop[.]com, leading to the trojanized version of AnyDesk.\n\nFigure 5. User’s web traffic (Click to enlarge)\n\n## Hunting Across Customers With OverWatch\n\nOnce the Falcon Complete team had determined the initial access vector and the extent of\ncompromise, and had fully remediated the first host, the next step in the scoping process\nwas to search across our customer base and identify additional compromises. By performing\n\n\n-----\n\na hunt using a combination of network and host-based indicators of attack, the Falcon\nOverWatch team was able to identify additional customers impacted by the same activity.\nFalcon Complete was then able to follow the same analysis and remediation process for\neach of our Falcon Complete customers to contain the threat.\n\n## Malvertising Campaign\n\nThe malicious Google ads placed by the threat actor have been served to people using\nGoogle to search for “AnyDesk” since at least April 21, 2021. This malvertising uses\nintermediary sites that then redirect to a social engineering page hosted at the following\nURL:\n\n```\nhttps[:]//domohop[.]com/anydesk-download/\n\n```\n\nFigure 6. Clone of AnyDesk website\n\nThe page hosted at this URL is a clone of the legitimate AnyDesk website, and it provides a\ndownload for the trojanized installer from the following url:\n\n```\nhttps://anydesk.s3-us-west-1.amazonaws[.]com/AnydeskSetup.exe\n\n```\n\nAt this time, Falcon Complete has observed three intermediary websites used in this effort,\nthe first of which can be seen advertised under a Google search result in Figure 7:\n\n```\ncuraduria3[ ]com\n\n```\n\n-----\n\nFigure 7. AnyDesk search result\n\nIt was also identified that the ad may have been targeting specific geographic regions, as the\nad was not being consistently delivered and depended on the region where the search\nrequest originated.\n\nFigure 8. Google ad information\n\nComparing Google Ads search results, it is noticeable that the threat actor’s ad is getting\nbetter search results than AnyDesk’s.\n\n\n-----\n\nFigure 9. Google keyword search ad comparison\n\nFigure 10 shows that the “Top of Page bid” is $2.56 AUD, meaning that the threat actor\nwould have likely paid that to beat AnyDesk’s own ad bid.\n\nFigure 10. Top of page bid for “anydesk” keyword (Click to enlarge)\n\nUsing Google’s ad forecast for a two-week time period (just targeting the U.S.) for the single\nkeyword “anydesk,” the threat actor could have easily spent ~$3,500 USD to get some\n2,000 clicks. The threat actor is still spending approximately $1.75 USD per click, but this\ndoesn’t equate to getting a shell on a target they are interested in.\n\n\n-----\n\nFigure 11. Google’s ad forecast\n\nCrowdStrike’s internal available data suggests that 40% of clicks on this malicious ad turned\ninto installations of this trojanized AnyDesk binary, and 20% of installations included followon hands-on-keyboard activity.\n\nWhile it is unknown what percentage of Google searches for AnyDesk resulted in clicks on\nthe ad, a 40% Trojan installation rate from an ad click shows that this is an extremely\nsuccessful method of gaining remote access across a wide range of potential targets.\n\n## Conclusion\n\nOur Intelligence team continues to investigate, and at this time does not attribute this activity\nto a specific threat actor or nexus. However, given the popularity of AnyDesk, we believe that\nthis was a widespread campaign affecting a wide range of customers. This malicious use of\nGoogle Ads is an effective and clever way to get mass deployment of shells, as it provides\nthe threat actor with the ability to freely pick and choose their target(s) of interest. Because of\nthe nature of the Google advertising platform, it can provide a really good estimate of how\nmany people will click on the ad. From that, the threat actor can adequately plan and budget\nbased on this information. In addition to targeting tools like AnyDesk or other administrative\ntools, the threat actor can target privileged/administrative users in a unique way. For this\nreason, the CrowdStrike team notified Google about the observed activity so they could take\naction against the malvertising campaign. It appears that Google expeditiously took\nappropriate action, because at the time of this blog, the ad was no longer being served.\n\nDuring our investigation, we were able to leverage CrowdStrike Falcon EDR telemetry and\nRTR to quickly and efficiently identify the scope of activity as well as the initial infection\nvector. Additionally, leveraging the real-time threat hunting capabilities of OverWatch allowed\nus to identify multiple affected customers and remediate the activity before the attacker was\nable to accomplish their mission. Falcon Complete recommends hunting for the indicators of\ncompromise (IOCs) listed below to see if you were affected.\n\n### Indicators of Compromise\n\n**IP Address:**\n\n\n-----\n\n176.111.174[.]126\n176.111.174[.]125\n\n**Domains:**\n\nDomohop[.]com\nAnydesk.s3-us-west-1.amazonaws[.]com\nzoomstatistic[.]com\nanydeskstat[.]com\nTurismoelsalto[.]cl\nRockministry[.]org\ncuraduria3[.]com\n\n**User Agents:**\n\nMozilla/5.0 (Windows NT 10.0; Win64; x64; rv:78.0) Gecko/20100111 Firefox/78.0\n\n**Hashes:**\n\n357e165be7a54e49f04cccc6d79678364394e33f10a6b3b73705823f549894b5\n5fe992b5a823b6200a1babe28db109a3aae1639f0a8b5248403ee1266088eac4\n0c1ec49bf46f000e8310ec04ff9f5a820cbb18524acf8e39482ae3ffca14fb59\n780a02755873350ceef387fd9ea8c9614d847d5ba7ae3f89d32777b6ec7ee601\n\n**Additional Resources**\n\n_[Learn more by visiting the Falcon Complete product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-complete/)_\n_[Read the blog “Getting the Bacon from the Beacon.“](https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/)_\n_Read a white paper: CrowdStrike Falcon Complete: Instant Cybersecurity Maturity for_\n_Organizations of All Sizes._\n_Test CrowdStrike next-gen AV for yourself:_ _[Start your free trial of Falcon Prevent™.](https://go.crowdstrike.com/try-falcon-prevent.html)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-26 - Falcon Complete Disrupts Malvertising Campaign Targeting AnyDesk.pdf"
    ],
    "report_names": [
        "2020-05-26 - Falcon Complete Disrupts Malvertising Campaign Targeting AnyDesk.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536018,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653775489,
    "ts_modification_date": 1653775489,
    "files": {
        "pdf": "https://archive.orkl.eu/efe6d1f9e1bbdae3acf138c5985a1686d01a51bc.pdf",
        "text": "https://archive.orkl.eu/efe6d1f9e1bbdae3acf138c5985a1686d01a51bc.txt",
        "img": "https://archive.orkl.eu/efe6d1f9e1bbdae3acf138c5985a1686d01a51bc.jpg"
    }
}