{
    "id": "e10e58fe-c9a4-4345-9fcc-c9564df82da5",
    "created_at": "2022-10-25T16:48:16.487173Z",
    "updated_at": "2025-03-27T02:14:57.441017Z",
    "deleted_at": null,
    "sha1_hash": "996c6758dc8d45f0d66a5f085bab854d4aa260de",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-12-24T23:16:55Z",
    "file_modification_date": "2016-12-24T23:16:55Z",
    "file_size": 282214,
    "plain_text": "# THE ELEPHANT IN THE ROOM\n## Marion Marschalek Cyphort Inc., Austria\n\n Email marion@cyphort.com\n\n ABSTRACT\n\nAt the beginning of 2015, the fi rst espionage software\ndesigned for large-scale operations with allegedly European\nroots was reported. Researchers uncovered malware dubbed\n‘Babar’ by its creators and determined that it fi tted the profi le\nof an espionage campaign initially documented by the\nCommunications Security Establishment Canada (CSEC).\n_PowerPoint slides created by CSEC and leaked through_\nwhistleblower Edward Snowden link Babar to an operation\nnamed ‘SNOWGLOBE’ and attribute it ‘with moderate\ncertainty’ to French intelligence.\n\nThis paper puts the spotlight on Babar and other malware\nfamilies related to SNOWGLOBE, including NBOT, Bunny\nand Casper. The technical fi nesse of the espionage toolkit will\nbe examined, outlining implementation details and\npeculiarities. In the second part the paper will discuss\npossibilities and impossibilities of attribution, explaining the\ninter-family relations between the different binaries as well as\nanalysing the link to the CSEC documents and the credibility\nof attribution conducted by CSEC.\n\nFinally, the examination will close with a proposal for future\nresearch on what more is to uncover of the SNOWGLOBE\noperation.\n\n## INTRODUCTION\n\nIn the past year more and more cases of nation-state espionage\ninvolving malware have surfaced and have been discussed\npublicly. The United States, United Kingdom, Russia and\nChina, among others, are known to operate a cyber espionage\napparatus in order to aid military operations. At the beginning\nof 2015, researchers uncovered a collective of malware\nfamilies which is potentially one of the rare approaches to\nmalware-aided espionage conducted by a European nationstate actor outside of the ‘Five Eyes’ alliance. The uncovered\nmalware fi ts the profi le of an operation dubbed\n‘SNOWGLOBE’, fi rst mentioned in a leaked presentation of\nthe Communications Security Establishment Canada (CSEC).\n\nThe slides describe a CNO (covert network operation)\ninvolving different malware strains which were used to target\nentities of political interest in Canada, Norway and Iran among\nother nations. Of special interest to SNOWGLOBE seems to\nhave been Iran, where a number of universities along with the\nAtomic Energy Organization were among the targets.\nFurthermore, CSEC documents malware with the internal\nproject name ‘Babar’, which happens to be a French cartoon\ncharacter. CSEC assesses ‘with moderate certainty’ that\noperation SNOWGLOBE is likely to be conducted by a\nFrench intelligence agency.\n\nThe mystery around Babar was fi rst brought to the public by\nFrench newspaper Le Monde, which published an article\nreferencing the CSEC slides in March 2014 [1]. Almost a year\nlater, researchers fi nally identifi ed what comes close to the\nBabar malware mentioned by CSEC. Babar is an espionage\n\n\ntool, the most sophisticated one among a menagerie of related\nfamilies. Other SNOWGLOBE tools are NBOT, Bunny and\nCasper, all of which were uncovered along with Babar. The\nSNOWGLOBE malware has previously been analysed by\nsecurity company Kaspersky Lab, which dubbed it ‘Animal\nFarm’ [2]. Next to the malware discussed in this paper,\n_Kaspersky reports two more ‘cartoonesque’ miscreants,_\nnamely Tafacalou and Dino.\n\n## SNOWGLOBE’S MALWARE FAMILIES\n\nThe fi rst family examined was NBOT, a simple denial of\nservice bot which was active from around 2010 to 2012. The\nmalware includes modules to perform fl ooding of a specifi ed\nURL with packages of different protocols, such as plain TCP,\nHTTP GET or POST with different confi gurations. Besides\nthat, not much functionality can be found in NBOT binaries.\n\nWhat makes NBOT interesting is the way it is implemented, as\nit does not give the impression of regular crimeware. The\nsamples are well designed, come with a handful of clear text\nstrings and have no binary protection whatsoever. On deeper\ninspection it becomes clear that this family really sticks out\nfrom the norm, and on following the breadcrumbs one\neventually stumbles over related samples with very similar\ntraits.\n\nThe second identifi ed family was Bunny, a multi-threaded bot\nwith an integrated scripting engine [3]. The family name is\nderived from a project name embedded in the malware\ndropper. Bunny incorporates a Lua interpreter and downloads\nand executes Lua scripts to reach a certain level of\npolymorphism. The Lua scripts can call back into the C++\ncode of the malware and alter its behaviour at runtime. Bunny\nwas seen being spread in a spear-phishing campaign in\nDecember 2011, in which a PDF document exploiting\nCVE-2011-4369 was used to install the malware [4].\n\nAlso among the stash of related binaries we discovered a DLL,\nitself part of a fairly sophisticated piece of espionage malware.\nFurther investigation led to the dropper of said DLL, which\ncame with the internal project name Babar64 [5]. Babar is a\nFrench cartoon character (an elephant), as well as the name of\na malware family mentioned in a classifi ed slide deck from\nCSEC [1]. The slides were leaked by Edward Snowden and\nfi rst discussed in an article published by French newspaper Le\n_Monde [6] in April 2014. The CSEC slides mention_\nSNOWGLOBE as the internal name of the campaign involving\nBabar and related malware and attribute it ‘with moderate\ncertainty’ [1, p.22] to an unspecifi ed French intelligence\nagency.\n\nFrom an analyst’s perspective, Babar is somewhat more\ncomplex than the other families. It comes with solid espionage\ncapabilities, it performs keylogging and invades Windows\nprocesses to steal data from instant messengers, softphones,\nbrowsers and offi ce applications. The Babar implant comes\nwith a userland rootkit component in order to hook APIs of\ninterest in dedicated remote processes and steal data on the fl y.\n\nWhile Babar could be called the crown jewel within the\nespionage toolset, it is not the latest creation. CSEC mentioned\nBabar for the fi rst time in 2009, the analysed binaries were\nprobably compiled at a later point in time, but probably not\nlater than 2012. It is assumed that the Babar binaries at hand\nare a later version of the malware described by CSEC.\nResearchers uncovered one of the newer malware families of\n\n\n-----\n\nthe same group in March 2015 [7]. Casper (as in Casper the\nFriendly Ghost) matches with TFC, Bunny and Babar on a\nbinary level and doubtlessly comes from the same authors. It\nis so-called reconnaissance malware, used to collect data\nfrom an infected machine in order to identify the owner and/\nor machine-specifi c settings.\n\nCasper is known to have been spread through a watering hole\nattack. The attackers had taken control of the server hosting the\nwebsite of the Syrian Ministry of Justice in April 2014 to deploy\ntheir malicious infrastructure. Two Flash zero-day exploits were\ninvolved in spreading Casper to potential targets [8].\n\nAll uncovered families can be linked with each other, and\nseveral binary attributes match with traits described in the\nCSEC documents.\n\n## THE ACTORS IN THE SPOTLIGHT\n\n NBOT\n\nNBOT is a family of denial-of-service bots which, according\nto compilation time stamps, was created in 2010. The binaries\nare well structured and multi-threaded, written in C++ and\nnot heavily protected as one would expect non-targeted\nmalware to be. The bots connect to a C&C server and\nexchange data in clear text via HTTP. The C&C domains are\nhard coded in the binaries. Currently, two different domains\nare known, http://callientefever.info/ and http://fullapple.net/,\nboth of which were registered in 2009 and active until 2010.\nFrom 2010 onwards, the domains were sinkholed by security\nvendor Kaspersky Lab.\n\nAs a means of stealth, the bots create an svchost.exe process\nand inject a remote thread to execute their binary payload in\nthe context of svchost.exe. NBOT also implements a\nmechanism to dynamically load APIs at runtime, identifi ed by\nhashes of API names. The hash function is simple, using\nleft-sided rotation and XOR with the key AB34CD77h to\ncalculate the hashes:\n\nfor (i=0; i<expcount; i++) {\nelen = strlen(exports[i]);\nresult = 0;\notherresult = 0xAB34CD77;\nfor (j=0; j<elen; j++) {\nresult = (rotl(result,7) ^ exports[i][j]);\n}\notherresult ^= result;\notherresult ^= 0xAB34CD77;\nprintf(“%8x\\t\\t%s\\n”, otherresult, exports[i]);\n}\n\nThe bots come with a custom confi guration embedded as\nstrings in the binaries, which will be stored as a linked list in\n\n\nmemory during start up. A large portion of the confi guration\nattributes’ names start with the string ‘NBOT_’ (see Table 1).\nIt is notable that two confi guration terms start with ‘TFC_’,\nan abbreviation for ‘Tafacalou’, according to another piece of\nmalware used by the same actors [2]. Tafacalou is\nreconnaissance malware, a platform used in the fi rst stage of\nan attack, dedicated to installing high-profi le malware on\nselected target machines. It is assumed that NBOT inherited\nthese values from the TFC code base.\n\nThe binaries are written in C++, and for every action the bots\ncan take they generate an object of an ‘action class’ at start\ntime. NBOT shows extensive fl ooding capabilities, as well as\nfunctionality to generate statistics on performance and a\nmeans for self-update. The dedicated actions can be of the\nkinds shown in Table 2.\n\nATCLEAR TCPFLOOD SET\n\nPING WEBFLOOD UPLOAD\n\nEXEC POSTFLOOD UPDATE\n\nHTTPF STATISTICS PLUGIN\n\nASPFLOOD KILL\n\n_Table 2: Dedicated actions._\n\nNBOT does not show capabilities of espionage or data\nexfi ltration, and no system reconnaissance is performed. It is\nnot perfectly clear what the intentions of the attackers were.\nBuilding a botnet out of unprotected binaries implies it will be\na short-lived one. Also, denial-of-service attacks are not known\nto meet the common interests of nation-state attackers. An\ninteresting side note to NBOT is that the binaries come with\nthe Accept-Language of all HTTP requests set to ‘fr’ (French).\n\n## Bunny\n\nThe Bunny malware family got its name from a link to debug\ninformation embedded in the dropper malware. The path to\nthe associated .pdb fi le contains the respective project name\n‘bunny 2.3.2’. The malware is multi-threaded with an\nintegrated Lua engine, making it a scriptable bot which can\nchange its behaviour to a certain extent. Bunny shows a\nnumber of interesting anti-analysis features, most of which\nseem intended for evasion of anti-virus engine emulators and\nsandboxes. The following features were found:\n\n - An emulator check is made by searching the module fi le\nname for strings such as ‘TESTAPP’ (known to be used\nby the Bitdefender engine), ‘klavme’, ‘myapp’ and\n‘afyjevmv.exe’ (assumed to be used by Kaspersky).\n\n - The module path name must be more than fi ve characters\nlong and contain either ‘msapps\\’ or ‘Perf Manager\\’,\n\n|ATCLEAR|TCPFLOOD|SET|\n|---|---|---|\n|PING|WEBFLOOD|UPLOAD|\n|EXEC|POSTFLOOD|UPDATE|\n|HTTPF|STATISTICS|PLUGIN|\n|ASPFLOOD|KILL||\n\n|NBOT_VER|NBOT_PORT|NBOT_BOOL_SEND_DATA|\n|---|---|---|\n|NBOT_ACTION|NBOT_MAX_REQ|NBOT_DATA|\n|NBOT_URL|NBOT_MAX_DATA|NBOT_COMMAND_LINE|\n|NBOT_FORCE_ACTION|NBOT_LAST_IMAGE|TFC_Confi g_Key|\n|NBOT_TIME|NBOT_UUID|TFC_Confi g_Name|\n|NBOT_TIMEOUT|NBOT_STATS_END|NotifUrl|\n|NBOT_HOST|NBOT_STATS_URL|SyncUrl|\n\n\n_Table 1: Confi guration attribute names._\n\n\n-----\n\nwhich is the directory into which the Bunny dropper\ndrops its payload.\n\n - The creation timestamp of the dropped payload is\nchanged to the creation timestamp of the system’s\nexplorer.exe to hinder forensic analysis.\n\n - Using the EnumProcesses API, Bunny checks whether\nfewer than 15 processes are running on the system. If\nthat is the case, execution is aborted.\n\n - Bunny performs hook detection on time retrieval APIs,\nnamely NtQuerySystemTime, GetSystemTimeAsFileTime\nand GetTickCount. Every API is called twice to calculate\na delta, while performing a sleep(1000) operation between\niteration one and iteration two. The fi nal condition is that,\nif any of the three deltas is below 998 milliseconds,\nexecution will abort. This can only be the case if any of\nthe three APIs’ return values is modifi ed by a system\nmonitoring solution, like a sandbox.\n\n - A subset of API names is obfuscated using the same\nhashing algorithm and key as NBOT.\n\n - Installed anti-virus products are enumerated by querying\nthe Windows Management Interface (WMI) and\nadapting the system infi ltration method, for example,\neither injecting the malicious payload into an existing\nsvchost.exe process or creating a new process into which\nto inject.\n\n - The dropped implant is not started by the dropper, merely\na registry key for loading at boot time is created. This is\neffective in tricking sandboxes, as a reboot is required to\ninvoke the implant. This is curious though, as the fact that\ndeletion of the dropper is the implant’s task means that the\ndropper will remain on the system until reboot as well.\n\nThe Bunny implant is compiled with Visual Studio compiler,\nwith performance optimization options set. It is not clear\nwhether this was intended for purposes of obfuscation or if\nthe authors did indeed aim for performance-optimized\nbinaries. Clearly, though, a tremendous amount of inlined\ncode and repeated constants make analysis of the binaries\nsignifi cantly more diffi cult than usual.\n\n## Remote servers and confi guration\n\nAt initialization Bunny decrypts an XML-format\nconfi guration fi le stored in its resource section, revealing\nthree URLs among timeout settings and encryption keys:\n\n\n\n - http://le-progres.net/images/php/test.php?rec=11206-01\n\n - http://ghatreh.com/skins/php/test.php?rec=11206-01\n\n - http://www.usthb-dz.org/includes/php/test.\nphp?rec=11206-01\n\nAll three of these URLs served as C&C contacts, sending\ncommands or Lua scripts to the infected host. It is interesting\nthat two of the domains are actually fake domains resembling\nlegitimate websites (le-progres.net and usthb-dz.org), while\none is a legitimate domain (ghatreh.com).\n\n## Multi-threading model and operation mode\n\nThe Bunny implant comes with a solid multi-threading\nmodel. The malware runs a main thread, which manages four\nworker threads and performs C&C command parsing and Lua\nscript execution. The worker threads are dedicated to\nreceiving commands and scripts. Each worker has a dedicated\nmethod for receiving instructions, which is either separately\nvia HTTP from the server, aggregated through a downloaded\ndata fi le or as tasks to be confi gured as scheduled tasks. Next\nto that, the main thread also runs sub threads to maintain log\nfi les created by the malware during execution and to keep\ntrack of the overall system load created by the malware.\n\nThe threads are coordinated via named events, global fl ag\nvariables, and in some cases mutexes or semaphores are also\nused. The main action of the malware is carried out in the\nmain thread, which parses commands and executes Lua\nscripts provided by the worker threads via command fi les.\n\n## Commands & Lua integration\n\nThe bot supports a total of 20 commands (see Table 3), which\nare received from the C&C as encrypted data but contained in\nthe binaries in clear text.\n\nmainfrequency restarthearer crontaskr\n\ngetconfi g Restart crontaskl\n\nftpput cleanhearer Maxpostdata\n\nftpget timeout seturl\n\nsendfi le Waitfor Stop\n\ngetfi le updatedietime setcpulimit\n\nuninstall crontaska\n\n_Table 3: Commands supported by the bot._\n\n|mainfrequency|restarthearer|crontaskr|\n|---|---|---|\n|getconfi g|Restart|crontaskl|\n|ftpput|cleanhearer|Maxpostdata|\n|ftpget|timeout|seturl|\n|sendfi le|Waitfor|Stop|\n|getfi le|updatedietime|setcpulimit|\n|uninstall|crontaska||\n\n\n_Figure 1: Bunny’s mode of operation._\n\n\n-----\n\nThe most notable actions of the bot can be summarized as\nfollows:\n\n - Downloads and executes Lua scripts to instrument its\nown code.\n\n - Can install managed tasks (named ‘crontask’) for its\nintegrated engine.\n\n - Can maintain FTP connections.\n\n - Can send and receive fi les via HTTP.\n\n - Writes runtime information to local fi les.\n\n - Provides encryption for local data and network\ncommunication.\n\nLua execution is achieved by an integrated Lua 5.1\ninterpreter. C/C++ bindings provided through the C/Invoke\nlibrary enable the Lua scripts to call back into the Lua\ninterpreter and instrument the engine. The Lua interpreter is\nvery small (roughly 180KB compiled), thus it can easily be\nintegrated into an application. The C/Invoke bindings enable\nLua to be completely independent from the C/C++\napplication, so injected scripts can be pure Lua code.\n\nThe Lua interpreter is a powerful code base which enables\nBunny to change functionality on the fl y, as different scripts\nare downloaded and executed. The scripts defi ne the\nfunctionality as they perform callbacks to the C/C++ code in\nthe malware binary. The potential of the Lua interpreter can\nbe investigated on the project homepage [9].\n\n## Babar\n\nBabar is a fully fl edged piece of espionage software, able to\ninvade running processes on the machine, hook API calls to\nsteal sensitive data on the fl y, log keystrokes and exfi ltrate the\nstolen information to its remote server. The dropper binary\ncontains a link to debug information, giving away the internal\nproject name ‘Babar64’.\n\nBabar, like all other related binaries, is not packed or\nprotected by a crypter. For C&C communication and for data\nhandling the malware uses 128-bit AES encryption, while the\nkeys are hard coded in the binaries. Interestingly, Babar uses\nthe same technique as Bunny for obfuscation of a subset of\nAPIs, which are loaded dynamically at runtime. A different\nhashing algorithm is used though: the authors have adapted\n\n\nthe SHA-1 algorithm to generate 32-bit hashes instead of the\nusual 160-bit hashes.\n\nAs seen before in Bunny, enumeration of installed security\nsolutions is performed by querying WMI. The SHA-256\nhashes of the names of installed products are compared\nagainst a hard-coded set of hashes.\n\n## System infi ltration\n\nThe Babar dropper drops an implant to the application data\nfolder of the current user and spawns a regsvr32.exe process\nto load the implant. The implant will inject itself into a\nrandomly chosen desktop process, and from there propagate\nfurther to a maximum of two more victim processes as a\nmeans of persistence. Babar operates from a main instance\nwhich will be the fi rst invaded process, and keeps two backup\ninstances. Should the carrier process of the main instance be\nterminated, one of the child instances will take over as the\nmain one.\n\nCode injection is performed in the classical fi le infector way,\nby mapping a shared object to the memory of the victim\nprocess and invoking a function stub as remote thread. The\nfunction stub loads the Babar DLL and calls one of its\nexports, with the export name communicated via shared\nmemory. This way the Babar DLL can propagate silently\namong remote processes.\n\nRegsvr32.exe, along with the according parameters to load\nthe Babar implant, will be invoked through a registry key at\nstartup. It is curious, though, that the loading process remains\nin memory and is never terminated.\n\n## Functionality\n\nThe spying activities are performed either locally through the\nBabar instance or via a global Windows hook invading all\nprocesses running on the same desktop. Instance-local\ncapabilities are basic, spying on window names or snooping\non the clipboard data, while the global hooks manage to steal\ninformation directly from Windows API calls.\n\nA summary of the capabilities is as follows:\n\n - Logging keystrokes\n\n - Taking screenshots\n\n - Capture of audio streams from softphone applications\n\n\n_Figure 2: Babar’s mode of operation._\n\n\n-----\n\n - Stealing of clipboard data\n\n - Capture of system and user default language, keyboard\nlayout\n\n - Capture of names of desktop windows.\n\n## The rootkit component\n\nThe Babar implant applies a global Windows hook to load its\nDLL into the process space of other processes. This\neffectively means that code provided by the hooking DLL\ngets executed whenever an arbitrary desktop process receives\nan event of a type specifi ed by the hook.\n\nBabar installs hooks for types 2 and 3, which are\nWH_KEYBOARD and WH_GETMESSAGE. This way\nBabar has control over all keyboard and message events\nreceived by any application on the same Windows desktop.\n\nOnce in the context of a desired target process, the malware\ngoes on to hook specifi c APIs of interest. This is achieved by\napplying the detours technique, which implements trampoline\nfunctions to be invoked every time a hooked API is called\n\n[10]. To achieve this, Babar rewrites the in-memory code for\ntarget APIs. A call to a hooked API then results in the calling\napplication invoking a trampoline function, which performs\nthe malicious activity and then passes control on to the\nlegitimate API.\n\nBabar supports trampoline functions for APIs involved in\nInternet communication, fi le creation and sound processing.\n\nWSARecv DirectSoundCaptureCreate waveOutClose\n\nDirectSoundCreate8 waveOutWrite\n\nClosesocket DirectSoundCaptureCreate8 waveInOpen\n\nCreateFileW CoCreateInstance waveInClose\n\nDirectSoundCreate waveOutOpen waveInAddBuffer\n\n_Table 4: Supported functions._\n\nBabar’s hooking attempts are limited to a list of processes and\ndocument extensions, defi ned in the malware confi guration:\n\n - Internet communication: iexplore.exe, fi refox.exe, opera.\nexe, chrome.exe, Safari.exe, msnmsgr.exe\n\n\n\n - File creation: excel.exe, winword.exe, powerpnt.exe,\nvisio.exe, acrord32.exe, notepad.exe, wordpad.exe.txt,\n.rtf, .xls, .xlsx, .ppt, .pptx, .doc, .docx, .pdf, .vsd\n\n - Media: skype.exe, msnmsgr.exe, oovoo.exe, nimbuzz.exe,\ngoogletalk.exe, yahoomessenger.exe, x-lite.exe.\n\n## Calling home\n\nThe Internet communication module of Babar is located in a\nseparate export, which will be invoked through remote thread\ninjection at runtime. The analysed sample of Babar comes\nwith two hard-coded C&C server domains:\n\n - http://www.horizons-tourisme.com/_vti_bin/_vti_msc/\nbb/index.php\n\n - http://www.gezelimmi.com/wp-includes/misc/bb/index.\nphp\n\nAt the time of analysis the server pointed to by horizonstourisme.com was still hosting bits of C&C infrastructure\nused by Babar. With directory traversal activated, researchers\nfrom ESET were able to pull a minimalistic directory\nstructure, showing directories named as follows:\n\n - bb28\n\n - d13\n\n - tfc422\n\nClearly, the directory belonging to Babar is ‘bb28’. Meanwhile,\n‘tfc422’ matches with strings found in the NBOT malware, i.e.\n‘TFC_’. The purpose of the ‘d13’ directory remains unknown,\nalthough it is assumed that it serves for requests of a third\nmalware family named ‘Dino’. The only script inside the bb28\ndirectory is a .php script named confi g.inc, which contains\nvariables that look familiar from Babar’s confi guration, such as\n‘user’, ‘id’ or ‘seq’ (see Figure 3).\n\n## Casper\n\nThorough investigation led to the discovery of a handful of\nother related binaries, among which was an implant which\nobviously carries the signature of the infamous cartoonists.\nAfter Bunny and Babar, a third family with a cartoon\ncharacter name caught our attention, named Casper, as in\nCasper, the Friendly Ghost.\n\nThe analysed binaries share several parts of source code with\nthe other cartoon families and also show some techniques we\n\n|WSARecv|DirectSoundCaptureCreate|waveOutClose|\n|---|---|---|\n|Send|DirectSoundCreate8|waveOutWrite|\n|Closesocket|DirectSoundCaptureCreate8|waveInOpen|\n|CreateFileW|CoCreateInstance|waveInClose|\n|DirectSoundCreate|waveOutOpen|waveInAddBuffer|\n\n\n_Figure 3: Excerpt from PHP script found on Babar’s C&C._\n\n\n-----\n\nhave already seen before. The list of features that some or all\nof the families have in common is as follows:\n\n - Proxy bypass code\n\n - Enumeration of installed anti-virus solutions through WMI\n\n - Embedded and encrypted confi guration in XML format\n\n - Partial API name hashing, Casper sharing the algorithm\nwith NBOT and Bunny\n\n - Payload deployment by remote thread injection through\nmapping of section objects\n\n - Use of unhandled exception fi lters, calling ExitProcess in\nthe case of an exception.\n\nAn interesting twist to Casper is that its binaries have been\nseen before, spread in a watering hole attack in Syria in April\n2014. Researchers from Kaspersky have reported on the\nwatering hole and two zero-day exploits that were involved\n\n[8], and researchers from ESET provided the necessary link\nbetween Casper and the watering hole [7]. The attack had\nbeen launched from http://jpic.gov.sy/, a website operated by\nthe Syrian Ministry of Justice.\n\nPlainly spoken, Casper is reconnaissance malware aiming to\ngather sensitive information about the target system and loading\nsecond-stage malware should the target be of interest. It is a\ntypical approach in targeted attacks to operate in several stages\nwhile using dedicated types of malware for different tasks.\n\nIn fact, the analysed binaries have a very similar mode of\noperation to related families. The malware dropper will place\nan infector binary named ‘aiomgr.exe’ into a directory named\n‘INTEL Audio Interface Device Manager’, which is located\nin the system’s common program fi les folder. The naming\nconvention, which resembles that of Windows services and\napplications, has been seen before in related families, with\nartefact names such as ‘netmgr’, ‘ntrass’, ‘IPSec’ and\n‘MSSecurity’. Once started, the Casper infector spawns a\nsvchost.exe process and injects its malicious payload. This is\nachieved by mapping a shared memory object to the remote\nprocess, which is then invoked as a remote thread. Casper\nthen goes on to collect information about the target system,\nincluding the following:\n\n\n\n - Operating system version and system architecture\n\n - Default web browser\n\n - Country and organization info from the system settings\n\n - Running processes\n\n - Applications registered for auto-run\n\n - Installed applications.\n\nCasper’s C&C server is the same as the watering hole server,\nhttp://jpic.gov.sy/. This is a rather uncommon practice, but\ngiven that acquisition of compromised web servers in a\nregion like Syria is considerably diffi cult, the decision of the\nattackers seems plausible.\n\nCasper, like Bunny and Babar, comes with the ‘AV strategy’\nfeature, where the installed anti-virus product is queried through\nWMI and, based on the specifi c product, a dedicated system\ninfi ltration technique is chosen. This means the process injection\ntechnique differs between strategies, as well as persistence\ntechnique implementation and the overall decision as to\nwhether or not to proceed with infection. A detailed analysis of\nCasper’s strategy can be found at ESET’s research blog [7].\n\n## INTER-FAMILY RELATIONS\n\nFrom a binary analyst’s perspective, there is little room for\ndoubt that all the discussed binaries stem from the same\nauthors. In practice, this is hard to prove though – explanation\nof relationships among binaries is often tedious and hard to\nunderstand, even for individuals with expertise in binary\nanalysis.\n\nIn general, a binary itself does not give away who wrote it,\nwho controlled it, who the infected victims were or what the\naim of the operation that involved it was. A standalone binary\ndoes not even give away which operation involved it. We\ncannot conclude from a binary its context. What we can do,\nthough, is determine related binaries, which in most cases\nhelps a great deal in the investigation.\n\nIn the case of the SNOWGLOBE malware, a number of binary\nattributes from different domains can be derived, which in\nconjunction proves that the families all stem from the same\nauthors. The matrix shown in Table 5 provides an overview.\n\n|Col1|Attribute|NBOT|Bunny|Babar|Casper|\n|---|---|---|---|---|---|\n|Shared code|Proxy bypass|x|x|x|x|\n||AV enumeration|-|x|x|x|\n||Timestamp formatting|x|x|x|x|\n|Shared techniques|Encrypted confi g|-|x|x|x|\n||Partial API hashing|x|x|x|x|\n||Dynamic API loading technique|x|x|x|x|\n||AV evasion ‘strategies’|-|x|x|x|\n||Persistence technique|x|x|x|-|\n||Exception handling|x|x|x|x|\n|String constants|Typo in WMI handling error message|-|x|x|-|\n||English grammar mistakes|x|x|x|x|\n||Capital letter string constants|x|x|-|x|\n|Artefacts|File/Regkey naming scheme|x|x|x|x|\n||Shared C&Cs|x|x|x|-|\n||French-language domains/websites|-|x|x|-|\n\n\n_Table 5: Overview of attributes shared between families._\n\n\n-----\n\nThe families share code, which despite differences in compiler\nsettings can certainly be identifi ed as identical on a source-code\nlevel. The discovery of proxy settings, enumeration of antivirus products via WMI, and the formatting of timestamps for\nlog fi les are three modules which were frequently found. On\nthe list of shared techniques are: the hashing of a subset of\nAPIs, occasionally even with the same algorithm and key; the\n‘strategies’ in system infi ltration based on installed anti-virus\nproducts; and the habit of encrypted confi gurations hard coded\nin the binaries, which in clear text resemble XML format.\nString constants formatted in the same fashion or coming with\nequally misspelled vocabularies are considered a strong link as\nwell. Last but not least, shared C&C server domains are a clear\nindication that not only the same authors but also the same\noperators are behind the malware families.\n\nAs seen in this example, the attribute extraction and matching\ntechnique shows an obvious link among the families. This is\nperhaps as close as research can get to binary stylometry, the\nobjective of prooving that a set of binaries stems from the\nsame authors. A credible link can only be built by leveraging\nattributes from different domains. By choosing attributes from\ndomains such as implementation details, techniques used,\ncoding habits and operational infrastructure, the risk of being\ncaught up in comparing unrelated entities such as compiler\nbehaviour or sole infrastructure is minimized.\n\n## ATTRIBUTION ASPECTS\n\nLittle doubt remains that the analysed binaries match with\ndescriptions of operation SNOWGLOBE, conducted by\nCanadian intelligence [1]. CSEC mentions that one of the\nimplants comes with the internal name ‘Babar’, which\nmatches with the .pdb path in the Babar64 binaries at hand.\nAlso, the beaconing contains the misspelled ‘MSI’ instead of\n‘MSIE’ in the User-Agent string, as outlined in the leaked\ndocument. Furthermore, the slides mention a ‘locale option of\nartefact within spear-phishing attack set to “fr_FR”’. While\nno details of spear-phishing attacks are known, the same\nlocale has been found within the NBOT binaries as a setting\nfor HTTP request headers.\n\nSlide number 10 of the CSEC document says that the C&C\ninfrastructure ‘seems to be found primarily, but not\nexclusively on French-language sites’. This holds true for a\nnumber of domains, especially for Bunny’s and Babar’s\nremote servers. Keep in mind though, that this helps solely in\nunderlining the statement that CSEC was analysing the same\nbinaries, not that the actor was French.\n\nAll three families give the impression of having been\ndeveloped by a team of skilled software developers, rather\nthan being the product of a malware author operating in the\ncriminal underground. What’s more, none of the binaries\nmakes any attempt to hide its intentions, which is a common\ntrait among targeted malware. Heavy obfuscation or the use\nof crypters easily raises the suspicions of heuristics-based\nmalware scanners. Another interesting fact is that the\nattackers used at least one 0-day exploit in the spreading of\nBunny in 2011 and at least two more in 2014 in the spreading\nof Casper. The use of 0-day exploits itself does not indicate\nwhether or not a nation state is involved, but it does suggest\nthat the actor had a good amount of resources available, as\nwell as a certain amount of determination.\n\nHowever, besides the CSEC document there was no obvious\nindication that the discussed malware families were created by\n\n\nor for French intelligence services. As is often the case with\ndigital crime, the chances are high that no proof will ever be\nfound and research will be limited to educated guesses.\n\n## PECULIARITIES AND FUN FACTS\n\nBunny possesses the capability to upload and download fi les\nvia HTTP. Successful downloads are handled with status code\n418, which is not defi ned in the RFC of HTTP, but is\nspecifi ed in the RFC April Fools Day edition RFC2324.\nHTTP status code 418 says ‘I’m a teapot’.\n\nThe partial obfuscation of API names with a weak hashing\nalgorithm does not serve well as protection from binary\nanalysts as it is easy to bypass. However, it does make sense\nto trick malware detection solutions which apply heuristics\nbased on static analysis of imports.\n\nThere is a typo in the registry key name\n‘isakmpAutoNegociate’ (should be ‘isakmpAutoNegotiate’),\nwhich gives away the non-legitimate use of what seems to be\na standard Windows key. For malware writers it makes sense\nto use legitimate-looking names for artefacts on the system to\ntrick analysts. In order to make full use of the stealth effect\nthough, correct spelling of the names is crucial.\n\nOne of the Babar C&C domains is an Algerian travel agency,\nwith offi ce in Bir Mourad Raïs. A contact with close ties to\nAlgeria has noted that the existence of this travel agency is\nhighly unlikely, and that even if it did exist, the possession of\na domain hosted in the United States is highly unlikely for an\nAlgerian company. Thus we conclude that this domain, and\nmaybe other seemingly legitimate domains, are fake web\nrepresentations not operated by real-world companies.\n\n## FUTURE RESEARCH\n\nBits of information from the leaked CSEC slides indicate the\nexistence of so far unknown malware and that the entire\noperation SNOWGLOBE is much bigger than currently\nknown. It is clear that further investigation will eventually\nlead to the uncovering of more pieces of the puzzle.\n\nAlso, the analysis of Tafacalou, Dino and the likely related\nNGBD malware remains for future research. Further\nvictimology needs to be conducted in order to determine the\noutreach of the SNOWGLOBE operation and currently\ntargeted individuals.\n\n## ACKNOWLEDGEMENTS\n\nMy deepest gratitude goes to a number of fellow researchers\ninvolved in the investigation of the SNOWGLOBE malware:\nPaul Rascagnéres, Joan Calvet, Morgan Marquis-Boire,\nSebastien Larinier, Matthieu Suiche, Alexandre Dulaunoy,\nRaphäel Vinot, Fred Arbogast, Alexei Bulazel and Michael\nShalyt.\n\n## REFERENCES\n\n[1] SNOWGLOBE: From Discovery to Attribution.\nCommunications Security Establishment Canada.\nhttp://www.spiegel.de/media/media-35683.pdf.\n\n[2] Animals in the APT Farm. Kaspersky Securelist.\nhttps://securelist.com/blog/research/69114/animalsin-the-apt-farm/.\n\n\n-----\n\n[3] Marschalek, M. EvilBunny: Suspect #4.\nhttps://drive.google.com/fi le/d/0B9Mrren8FX4M2lXN1B4eElHcE0/view.\n\n[4] Dillon, B. Analysing CVE-2011-4369.\nhttp://blog.9bplus.com/analysing-cve-2011-4369part-one/\n\n[5] Marschalek, M. Shooting Elephants.\nhttps://netzpolitik.org/wp-upload/Elephantosis.pdf.\n\n[6] Untersinger, M.; Follorou, J. Quand les Canadiens\npartent en chasse de « Babar ». Le Monde.\nhttp://www.lemonde.fr/international/\narticle/2014/03/21/quand-les-canadiens-partent-enchasse-de-babar_4387233_3210.html.\n\n[7] Calvet, J. Casper Malware: After Babar and Bunny\nanother Espionage Cartoon.\nhttp://www.welivesecurity.com/2015/03/05/caspermalware-babar-bunny-another-espionage-cartoon/.\n\n[8] Zakorzhevsky, V. New Flash Player 0-day\n(CVE-2014-0515) used in watering-hole attacks.\nKaspersky Securelist. http://old.securelist.com/en/\nblog/8212/New_Flash_Player_0_day_CVE_2014_\n0515_used_in_watering_hole_attacks.\n\n[9] The Lua Project. http://www.lua.org/.\n\n[10] Hunt, G.; Brubacher, D. Detours: Binary Interception\nof Win32 Functions. Proceedings of Usenix\nconference ‘99. http://research.microsoft.com/\npubs/68568/huntusenixnt99.pdf.\n\n## APPENDIX\n\n Sample hashes\n\n**MD5** **SHA-256**\n**Nbot**\n8132ee00f64856cf10930fd72505cebe 82daadf1558692587f82d6ad545b7e6ba2c98a88a20604e2f074f39248aa2712\n2a64d331964dbdec8141f16585f392ba a1973790e277b489110ae8ed625c13c2e9a79afaa2aed5d27904dcfa46481ae3\ne8a333a726481a72b267ec6109939b0d 4f4b484acc053687d6e4365f0f19e926b1a44cc665182aa6b9417fa43264b240\n51cd931e9352b3b8f293bf3b9a9449d2 43861501e7e7bb546b55a9323d1cff132dddb750b3e86823af7ea08d45357e28\nd5a80844c54059654688ae7abfc1fad9 5ef78d7c2d3b7201e540e6c1909174c7133fca8bafc44ac53ce275e04559c393\n**Bunny**\n3bbb59afdf9bda4ffdc644d9d51c53e7 be14d781b85125a6074724964622ab05f89f41e6bacbda398bc7709d1d98a2ef\nb8ac16701c3c15b103e61b5a317692bc 7d1e5c4afb1682087d86e793b3fc5a8371dc7c28e27e7196e3b258934f6bafb5\nc40e3ee23cf95d992b7cd0b7c01b8599 c6a182f410b4cda0665cd792f00177c56338018fbc31bb34e41b72f8195c20cc\neb2f16a59b07d3a196654c6041d0066e c9197a1fa5f911d11c51a66cfc1424063ed80547ca3f8637b77d06f36fc96e7d\n**Babar**\n4525141d9e6e7b5a7f4e8c3db3f0c24c aa73634ca325022dd6daff2df30484ec9031939044cf4c2a004cbdb66108281d\n9fff114f15b86896d8d4978c0ad2813d c72a055b677cd9e5e2b2dcbba520425d023d906e6ee609b79c643d9034938eb\n8b3961f7f743daacfd67380a9085da4f 82e6f9c10c7ba737f8c79deae4132b9ff82090ccd220eb3d3739365b5276c3c8\n4582D9D2120FB9C80EF01E2135FA3515 57437a675cae8e71ac33cd2e001ca7ef1b206b028f3c810e884223a0369d2f8a\n4592f10c654d613080fe9fa3c1591f20 213bddc35d737867bb168aaf0fb4165bf1afd2216d7662344402f08318650038\n**Casper**\n4d7ca8d467770f657305c16474b845fe 8e6402c8703e9f10493222a26afeb0fc575bb879d6c82d89c1a79aa75be645d0\ncc87d090a1607b4dde18730b79b78632 daa56e7acd5fb69ecefdbf5179c5ef4776ccc41ebe7e14920f11b84678c83a00\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.virusbulletin.com/uploads/pdf/conference/vb2015/Marschalek-VB2015.pdf"
    ],
    "report_names": [
        "Marschalek-VB2015.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e09a7338-fb16-4e39-b579-c3bfc3140c47",
            "created_at": "2022-10-25T16:07:24.207294Z",
            "updated_at": "2025-03-27T02:02:10.140203Z",
            "deleted_at": null,
            "main_name": "Snowglobe",
            "aliases": [
                "ATK 8",
                "Animal Farm",
                "SIG20",
                "Snowglobe"
            ],
            "source_name": "ETDA:Snowglobe",
            "tools": [
                "Babar",
                "Casper",
                "Chocopop",
                "Dino",
                "EvilBunny",
                "Nbot",
                "TFC",
                "Tafacalou"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "548a4081-aa8f-4e2a-bcb3-0c9dfa61944f",
            "created_at": "2023-01-06T13:46:38.443779Z",
            "updated_at": "2025-03-27T02:00:02.835042Z",
            "deleted_at": null,
            "main_name": "SNOWGLOBE",
            "aliases": [
                "Snowglobe",
                "ATK8",
                "Animal Farm"
            ],
            "source_name": "MISPGALAXY:SNOWGLOBE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041697,
    "ts_creation_date": 1482621415,
    "ts_modification_date": 1482621415,
    "files": {
        "pdf": "https://archive.orkl.eu/996c6758dc8d45f0d66a5f085bab854d4aa260de.pdf",
        "text": "https://archive.orkl.eu/996c6758dc8d45f0d66a5f085bab854d4aa260de.txt",
        "img": "https://archive.orkl.eu/996c6758dc8d45f0d66a5f085bab854d4aa260de.jpg"
    }
}