{
    "id": "e149c1ce-227e-4f15-8b16-3316126bd32d",
    "created_at": "2023-06-23T02:08:42.231088Z",
    "updated_at": "2025-03-27T02:16:55.568665Z",
    "deleted_at": null,
    "sha1_hash": "8ce93803b9037887944791861ce4616502fe54c6",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-06-01T11:22:18Z",
    "file_modification_date": "2023-06-01T11:22:18Z",
    "file_size": 954546,
    "plain_text": "_Co-Authored by:_ **TLP:CLEAR** Product ID: CSA-20230601-1\n\n\n# North Korea Using Social Engineering to Enable Hacking of Think Tanks, Academia, and Media \n\n## SUMMARY\n\nThe Federal Bureau of Investigation (FBI), the U.S. Department of State, and the National Security\nAgency (NSA), together with the Republic of Korea’s National Intelligence Service (NIS), National\nPolice Agency (NPA), and Ministry of Foreign Affairs (MOFA), are jointly issuing this advisory to\nhighlight the use of social engineering by Democratic People’s Republic of Korea (DPRK a.k.a. North\nKorea) state-sponsored cyber actors to enable computer network exploitation (CNE) globally against\nindividuals employed by research centers and think tanks, academic institutions, and news media\norganizations. These North Korean cyber actors are known to conduct spearphishing campaigns\nposing as real journalists, academics, or other individuals with credible links to North Korean policy\ncircles. The DPRK employs social engineering to collect intelligence on geopolitical events, foreign\npolicy strategies, and diplomatic efforts affecting its interests by gaining illicit access to the private\ndocuments, research, and communications of their targets.\n\n## BACKGROUND\n\nNorth Korea’s cyber program provides the regime with broad intelligence collection and espionage\ncapabilities. The Governments of the United States and the Republic of Korea (ROK a.k.a. South\nKorea) have observed sustained information-gathering efforts originating from these North Korean\ncyber actors. North Korea’s primary military intelligence organization, the Reconnaissance General\nBureau (RGB), which has been sanctioned by the United Nations Security Council, is primarily\nresponsible for this network of actors and activities.\n\nWe assess the primary goals of the DPRK regime’s cyber program include maintaining consistent\naccess to current intelligence about the United States, South Korea, and other countries of interest to\nimpede any political, military, or economic threat to the regime’s security and stability.\n\nCurrently, the U.S. and ROK Governments, and private sector cyber security companies, track a\nspecific set of DPRK cyber actors conducting these large-scale social engineering campaigns as\n\n**_Disclaimer: This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR_**\n_when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and_\n_procedures for public release. Subject to standard copyright rules, TLP:CLEAR information may be distributed_\n_[without restriction. For more information on the Traffic Light Protocol, see https://www.cisa.gov/tlp.](https://www.cisa.gov/tlp)_\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\nKimsuky, Thallium, APT43, Velvet Chollima, and Black Banshee. Kimsuky is administratively\nsubordinate to an element within North Korea’s RGB and has conducted broad cyber campaigns in\nsupport of RGB objectives since at least 2012. Kimsuky actors’ primary mission is to provide stolen\ndata and valuable geopolitical insight to the North Korean regime.\n\nSome targeted entities may discount the threat posed by these social engineering campaigns, either\nbecause they do not perceive their research and communications as sensitive in nature, or because\nthey are not aware of how these efforts fuel the regime’s broader cyber espionage efforts. However,\nas outlined in this advisory, North Korea relies heavily on intelligence gained by compromising policy\nanalysts. Further, successful compromises enable Kimsuky actors to craft more credible and effective\nspearphishing emails that can be leveraged against more sensitive, higher-value targets. The\nauthoring agencies believe that raising awareness of some of these campaigns and employing basic\ncyber security practices may frustrate the effectiveness of Kimsuky spearphishing operations. This\nadvisory provides detailed information on how Kimsuky actors operate; red flags to consider as you\nencounter common themes and campaigns; and general mitigation measures for entities worldwide to\nimplement to better protect against Kimsuky’s CNE operations.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n**If you believe you have been targeted in one of these spearphishing campaigns, whether or not**\n**it resulted in a compromise (particularly if you are a member of one of the targeted sectors),**\n**[please file a report with www.ic3.gov and reference #KimsukyCSA in the incident description.](https://www.ic3.gov/)**\n\n**Please include as much detail as you can about the incident including the sender email address**\n**and the text of the email message, specifying any links/URLs/domains. Please specify whether**\n**you responded to the email, clicked on any links, or opened any attachments. Please retain the**\n**original email and attachments in case you are contacted by an investigator for further**\n**information.**\n\n  - Please visit **[www.ic3.gov](https://www.ic3.gov/)** and use #KimsukyCSA in your submission.\n\n  - The U.S. Government also encourages victims to report suspicious activities, including any\nsuspected DPRK cyber activities, to local FBI field offices.\n\n  - For the ROK government, you can report suspicious activities to the National Intelligence\nService (www.nis.go.kr, 111), the National Police Agency (ecrm.police.go.kr, 182), or the Korea\nInternet & Security Agency (boho.or.kr, 118)\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n## KIMSUKY OPERATIONS: SOCIAL ENGINEERING \n\nIn a cybersecurity context, social engineering is a broad term referring to the use of deception to\nexploit human error and manipulate a target into unwittingly exposing confidential or sensitive\ninformation for fraudulent purposes. DPRK cyber actors employ social engineering techniques to\nenable much of Pyongyang’s malicious CNE. Among social engineering techniques, Kimsuky actors\nuse spearphishing—or the use of fabricated emails and digital communications tailored to deceive a\ntarget—as one of their primary vectors for initiating a compromise and gaining access into a target’s\ndevices and networks. For over a decade, Kimsuky actors have continued to refine their social\nengineering techniques and made their spearphishing efforts increasingly difficult to discern.\n\nA Kimsuky spearphishing\ncampaign begins with\nbroad research and\npreparation. DPRK cyber Input Settings – Set specific input.\nactors often use open- Caution: Check input settings for errors.\nsource information to\nidentify potential targets of Sender Name\nvalue and then tailor their\nonline personas to appear Sender Address\nmore realistic and Recipient Address\nappealing to their victims.\n\nSubject\n\nThe Kimsuky actors will Date and Time\ncreate email addresses\n\nDestination Link\n\nthat resemble email\naddresses of real Creator Name\nindividuals they seek to\n\nSample of a program for generating DPRK spearphishing emails.\n\nimpersonate and generate\ndomains that host the\nmalicious content of a spearphishing message. DPRK actors often use domains that resemble\ncommon internet services and media sites to deceive a target.\n\n     - For example, Kimsuky actors are known to impersonate well-known news outlets and\njournalists using a domain such as “@XYZkoreas.news” spoofing a real news station while\nactual emails from the news service appear as “@XYZnews.com.”\n\n     - DPRK cyber actors commonly take on the identities of real people to gain trust and establish\nrapport in their digital communications. Kimsuky actors may have previously compromised the\nemail accounts of the person whom they are impersonating. This allows the actors to search\nfor targets while scanning through compromised emails, with a particular focus on workrelated files and personal information pertaining to retirees, social clubs, and contact lists.\nThey craft convincing spearphishing emails by repurposing the person’s email signature,\ncontact list, and past email exchanges. DPRK cyber actors are also known to compromise\n\n\nInput Settings – Set specific input.\n\nCaution: Check input settings for errors.\n\nSender Name\n\nSender Address\n\nRecipient Address\n\nSubject\n\nDate and Time\n\nDestination Link\n\nCreator Name\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\nemail accounts belonging to foreign policy experts and subsequently create a secondary email\naccount, using the email account and identity of the expert to communicate with other\nsignificant targets.\n\n     - In other cases, a Kimsuky actor will use multiple personas to engage a target; one persona to\nconduct initial outreach and a second persona to follow-up on the first engagement to distract\na potential victim from discerning the identity of the original persona. Another tactic is to\n“resend” or “forward” an email from a source trusted by a target.\n\n     - The initial phishing email occasionally contains a malicious link or document, often purporting\nto be a report or news article. These attached malicious documents are frequently passwordprotected, which helps them evade detection by antivirus software and other security\nmeasures. However, more often, the initial spearphishing email does not contain any\nmalicious links or attachments and is instead intended to gain the trust of the victim.\n\n     - Once DPRK cyber actors establish engagement with a target, the actors attempt to\ncompromise the account, device, or network belonging to the target by pushing malicious\ncontent in the form of a malicious macro embedded within a text document. This document is\neither attached directly to the email, or stored in a file hosting service, such as Google Drive or\nMicrosoft OneDrive. These malicious macros, when enabled, quietly establish connections\nwith Kimsuky command and control infrastructure, and result in the provision of access to the\ntarget’s device.\n\n     - In some cases, Kimsuky actors have developed “spoofed” or fake but realistic versions of\nactual websites, portals, or mobile applications, and directed targets to input credentials and\nother information that are harvested by the DPRK. Compromise of a target account can lead\nto persistent access to a victim’s communications, often through a malware used by Kimsuky\n[actors called BabyShark. Kimsuky actors have also been known to configure a victim’s email](https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-301a)\naccount to quietly auto-forward all emails to another actor-controlled email.\n\nNotably, victim responses to spearphishing lures also provide Pyongyang with the added benefit of\ninsight into foreign policy circles. This covert collection against the community of DPRK watchers is\nprobably of high value to the Kim regime and provides another channel of information on top of what it\ngains through computer network operations.\n\nAlthough all DPRK advanced persistent threat groups employ social engineering techniques, the\ncampaigns and themes described in this advisory are specific to Kimsuky.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n## RED FLAG INDICATORS\n\nSector targets should be aware of the following activity that may be indications or behaviors of\nmalicious DPRK cyber actors.\n\n     - Initial communications are often seemingly innocuous with no malicious links/attachments;\nfollow-on communications usually contain malicious links/documents to facilitate exploitation\nof a computer or network.\n\n     - Email content may include real text of messages recovered from previous victim engagement\nwith other legitimate contacts.\n\n     - Emails in English may sometimes have awkward sentence structure and/or incorrect\ngrammar.\n\n     - Email content may contain a distinct Korean dialect exclusively used in North Korea.\n\n     - Victims/targets with both direct and indirect knowledge of policy information i.e., U.S. and ROK\ngovernment employees/officials working on North Korea, Asia, China, Southeast Asia matters;\nU.S. and ROK government employees with high clearance levels; and members of the\nmilitary, are approached with common themes and questions as referenced in this advisory.\n\n     - Email domains look like a legitimate news media site, but do not match the domain of the\ncompany’s official website. The domains also may be identified as such in open-source\nmalware repositories like Virus Total.\n\n     - Spoofed email accounts have subtle incorrect misspellings of the names and email addresses\nof the legitimate ones listed in a university directory or an official website.\n\n     - Malicious documents require the user to click “Enable Macros” to view the document.\n\n     - Actors are persistent if the target does not respond to the initial spearphishing email. They will\nlikely send a follow-up email within 2-3 days of initial contact.\n\n     - Emails purporting to be from official sources but sent using unofficial email services.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n## CAMPAIGNS AND THEMES\n\nKimsuky cyber actors craft their spearphishing campaigns around themes characterizing the target,\nmessage content, and the malicious mechanism, or lure, through which a compromise is initiated.\nThe main themes to beware of are impersonations and targeting of journalists, academic scholars,\nand think tank researchers to:\n\n     - solicit responses to foreign policy-related inquiries,\n\n     - conduct a survey,\n\n     - request an interview,\n\n     - review a document,\n\n     - request a resume, or\n\n     - offer payment for authoring a research paper.\n\nKimsuky actors tailor their themes to their target’s interests and will update their content to reflect\ncurrent events discussed among the community of North Korea watchers.\n\nThe following are examples of real Kimsuky spearphishing attempts that illustrate variations of the\ncommon themes. In some instances, the cyber actor poses as a journalist and targets a think tank\nresearcher, while at other times, the DPRK actor may take on the persona of an academic scholar to\ntarget other scholars—virtually every combination of these themes and lures has been previously\nobserved.\n\n### 1. Impersonation of journalists\n\nKimsuky actors often spoof real journalists and broadcast writers to craft a credible front and make\ninquiries to prominent individuals working North Korea matters. Usually, the questions will revolve\naround current events and whether U.S. experts believe North Korea will re-join talks with the U.S.,\nwhether they believe North Korea will resume testing its missiles, and how they see China\nresponding. In many instances, Kimsuky actors do not attach malware to their initial email. Instead,\nthey first send an introductory email to inquire about interview opportunities.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 1:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: <name of legitimate Korean journal program>\n\nGreetings,\n\nMy name is <name of writer>, and I am a writer for <name of legitimate Korean journal\n**program>.**\n\nI am writing to you today because I am currently preparing for a program related to North\nKorean issues. Professor <name of professor> of <actual Korean university>, whom I\ncontacted earlier, recommended you as an expert on this issue. I would be grateful if you\ncould spare some time to answer a few questions.\n\nThank you for considering my request. I look forward to hearing from you soon.\n\nBest regards,\n\n\n**Follow-on email: If the targets agree to the interview, the actors will then follow up with a second**\nemail containing malicious content.\n\n\nTitle: RE: RE: <name of legitimate Korean journal program>\n\nDear <name of expert>,\n\nAs promised, I am sending you a questionnaire. It would be greatly appreciated if you could\nanswer each question in 4-5 sentences. Thank you for your cooperation.\n\nBest regards,\n\n@ attached file: [<name of legitimate Korean journal program>] questionnaire.docx\n\n\nAdditionally, we have seen Kimsuky actors spoof legitimate journalists to specifically target think tank\nemployees. Kimsuky actors commonly pose questions in their spearphishing emails about current\nevents, such as issues regarding Russia’s invasion of Ukraine; U.S.-DPRK relations; DPRK nuclear\nand security topics; policymaker stances on the Asian region; and thoughts on current China-North\nKorea and Russia-North Korea relations.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 2:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nGreetings,\n\nI hope you've been well! This is <name of real journalist> with <legitimate U.S. news\n**organization>.**\n\nNorth Korea Fires Powerful Missile on 4 Oct using Old Playbook in a New Worlds. The last\ntime Pyongyang launched a weapon over Japan was in 2017, when Donald J. Trump was\npresident and Kim Jong-un seemed intent on escalating conflict with Washington.\n\nI have some questions regarding this:\n\n1) Would Pyongyang conduct its next nuclear test soon after China’s Communist Party\nCongress in mid-October?\n\n2) May a quieter approach to North Korean aggression be warranted?\n\n3) Would Japan increase the defense budget and a more proactive defense policy?\n\nI would be very grateful if you could send me your answers within 5 days.\n\nHave a good weekend.\n\nSincerely,\n\n<name of legitimate journalist>\n\n\n### 2. Impersonation of academic scholars\n\nKimsuky actors impersonate South Korean academic scholars to send spearphishing emails to\nresearchers at think tanks. In these emails, the targets are asked to participate in a survey, such as\non North Korean nuclear issues and denuclearization on the Korean Peninsula or requesting an email\ninterview.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 3:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: <name of legitimate Korean think tank institute> Request for survey\n\nHello,\n\nI am <name of an academic scholar> from <name of legitimate Korean think tank>.\n\nI am reaching out to ask if you would be willing to participate in a survey on North Korea’s\nnuclear development titled, “A survey on the perception on experts on the advancement of\nNorth Korean nuclear weapons and the denuclearization of the Korean Peninsula”. Our goal\nis to find ways to resolve North Korean nuclear issues and achieve denuclearization on the\nKorean Peninsula. Rest assured that all answers will be kept confidential and used solely for\nresearch purpose. As a token of appreciation, we would like to offer 300,000 won to those\nwho participate in the survey. If you’re interested in participating, please reply to this\nmessage, and we will send you the survey questionnaire. Looking forward to hearing from\nyou soon.\n\nBest regards,\n\n\n**Follow-on email: Once targets respond to inquiries, Kimsuky actors send them a survey**\nquestionnaire and a document form for payment, which contains malicious content.\n\n\nTitle: RE: RE: <name of legitimate Korean think tank institute> Request for survey\n\nThank you for your response.\n\nWe will send you a document form for payment, which includes a personal information\nusage agreement. If possible, please fill out your affiliation, name, ID number, bank account,\nand signature, and attach copies of your bankbook and ID card.\n\nBest regards,\n\nP.S. The attached document is password-protected, and I will send you the password in a\n‘password.txt file’\n\n@ attached file: PersonalInformationUsageAgreement\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 4:**\n\nBelow is an example of Kimsuky actors pursuing responses to questions on sector targets by posing\nas a university professor and research student. Once an initial response is received, actors will\nrequest an email interview with a list of questions and request that targets access documents via a\nmalicious link to a cloud-hosted service.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTo: <name of foreign affairs expert>\n\nSubject: Re: Request for an interview\n\nDear <name of foreign affairs expert>, Sorry for my late response because of the Profs\nbusy time and thanks so much for replying me your kind answers. I did confer with\n<legitimate U.S. University Professor >about it and modified a bit. Please find the link below\nand let me know if you have the different opinions.\n\nhttps: <malicious drive link>\n\nPWD: <redacted>\n\nBest, <fictitious university student>\n\n\nTo: <foreign affairs expert>\n\nCc: <scholar>\n\nDear <foreign affairs expert>, Thanks so much for your fast feedback. I did confer with\n<legitimate U.S. university professor> again and complete it as your request. Please find\nthe updated below. https: <malicious drive link>\n\nPWD: <redacted>\n\nWe're planning to upload it on our website within a week after final review. Please feel free\nto contact with me if you have any questions.\n\nBest, <fictitious university student>\n\n\n### 3. Impersonation of think tank researchers\n\nKimsuky actors impersonate researchers from legitimate South Korean think tanks to send\nspearphishing emails to political and North Korean experts. They initiate communication by sending\ngenuine emails to establish rapport and seek opinions on various topics, such as “North Korea’s\nforeign policy and our response.”\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 5:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: [Request for opinion] I’m <name of legitimate Korean think tank> <name of deputy\n**director>**\n\nGreetings,\n\nI am <name of legitimate Korean think tank>, deputy director of the <name of deputy\n**director>.**\n\nI am reaching out to you to discuss an article I am currently working on.\n\nThe topic, “North Korea’s foreign policy and South Korea’s response” is somewhat distant\nfrom my expertise, so I would greatly appreciate hearing the opinions of experts like you.\n\nI would kindly request your comments on my writing, as I believe you are the most\nappropriate person to provide valuable insights on the subject. Your earlier article caught my\nattention, and I found myself nodding in agreement with each sentence. That is why I feel\nconfident in asking for your opinion.\n\nI am eagerly awaiting your reply and appreciate your willingness to assist me. Thank you for\nyour time and consideration.\n\n\n**Follow-on email: After receiving replies from their targets, the Kimsuky actors exchange multiple**\nemails, which may include attachments containing malicious links or files and instructions on how to\nopen the attached files. Even after stealing the account information of their victims and infecting their\ndevices with malware, they sometimes continue to send “thank you” emails to their targets.\n\n\nTitle: RE: RE: [Request for opinion] I’m <name of legitimate Korean think tank> <name of\n**deputy director> <attached large size file>**\n\nThank you for agreeing to provide your opinion. Please find the attached files.\n\nWe greatly appreciate your input. To ensure security in the face of increasing hacking\nactivity, we have set a password (<password string>) for the attached file.\n\nWe look forward to hearing your valuable feedback.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 6:**\n\nBelow is an example of Kimsuky actors spoofing a think tank employee and utilizing a spoofed think\ntank domain in order to target another think tank employee. Once the target responds with input, the\nKimsuky actor sends a follow-on email with a malicious attachment.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nDear <think tank employee>,\n\nHope you are doing well. On behalf of <another think tank>, it is my pleasure to invite you\nto write a 1,200-word piece on the recent NK's provocation.\n\nNorth Korea’s latest missile launches, including the launch of an intermediate-range ballistic\nmissile (IRBM) over Japan on October 4 and two short-range ballistic missiles (SRBMs) on\nOctober 6, provide a stark reminder of the numerous missile programs it is pursuing.\n\nSubject is as follows:\n\n1) Would Pyongyang conduct its next nuclear test soon after China’s Communist Party\nCongress in mid-October?\n\n2) May a quieter approach to North Korean aggression be warranted?\n\n3) Would Japan increase the defense budget and a more proactive defense policy?\n\nYou can send me this email by Oct 21. You can make your own title for your article. We can\nprovide you with a small honorarium of around USD 480.00.\n\nI would really appreciate it if you can contribute.\n\nBest,\n\n<Redacted>\n\nSenior Fellow, <think tank>\n\nDirector, <think tank>\n\n\n**Follow-on email:** The Kimsuky actor then sent a second communication with malicious content.\n\n\nDear <think tank employee>,\n\n\nSorry for my late response.\n\nAs promised, I’m writing to send our result of the review. Please find the attached and let me\nknow if any problems.\n\nPW: <redacted>\n\nBest,\n\n<Redacted>\n\nSenior Fellow, <think tank>\nDirector, <think tank>\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n### 4. Impersonation of government officials, law enforcement, web administrators\n\nBelow is an example of how Kimsuky actors approach their targets by impersonating individuals\nresponsible for North Korean policies in government agencies, such as the South Korean National\nAssembly or the presidential office. These impersonated individuals may have already had their\naccounts compromised through a previous attack. Kimsuky actors may mention specific information\nabout the target’s position or schedule, which they obtained from the target’s email exchanges or\naddress book.\n\n**Sample email communication 7:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: Office of <member of the National Assembly>/Seminar “Proposal for the Unification\nPolicies of the Yoon Government”\n\nHello, this is <name of secretary> from the office of <member of the National Assembly>.\n\nLet me express our gratitude for your attendance and participation at the seminar we hosted\nyesterday. Your presence and insights contributed greatly to the success of the event.\n\nIf it’s not too much trouble, could you kindly provide us with a brief summary of the remarks\nyou made during the seminar? We would like to keep it as an internal reference material.\n\nAdditionally, we would greatly appreciate it if you could fill out the attached form and send it\nback to us. This will serve as an evidence document for the speaking fee payment\nprocedure.\n\nPassword: <redacted>\n\nThank you again for your participation and we hope to see you at future events. Have a\ngreat weekend.\n\n\nKimsuky actors may also impersonate investigative agencies or law enforcement officials to deceive a\ntarget into believing that their email account has been involved in an illegal incident. They use the\nauthority of investigative agencies to approach the target, implying that their account may have been\nstolen and that they could be involved in a criminal or national security-related incident.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 8:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: <legitimate Investigator> of <legitimate investigation agency>.\n\nI am <legitimate Investigator> of <legitimate investigation agency>.\n\nI’m writing to inform you that someone has published content on YouTube using your email\naccount that violates the National Security Law.\n\nLink: https:// HYPERLINK \"https://%3cyoutube/\"< HYPERLINK\n\"https://%3cyoutube/\"YouTube video link>. The video was posted on <Date: 0000. 0. 00.>\nby <target>\n\nWe also suspect that the same user has posted content that slanders North Korean\ndefectors. We need your cooperation to identify the real publisher of these posts.\n\n1. Provide us with your computer media access control address (MAC address) and\nEthernet hardware address, as they are needed to track any illegal access to your email\naccount.\n\n2. If you cannot locate these addresses in your computer system, please run the program\nbelow and send us the resulting document: <check tool.zip>\n\n3) Please respond to this email within 24 hours and delete it immediately after sending your\nreply.\n\nThanks you for your cooperation\n\n\nAdditionally, Kimsuky actors impersonate operators or administrators of popular web portals and\nclaim that a victim’s account has been locked following suspicious activity or fraudulent use. Victims\nare advised to protect their personal information and unlock their account by clicking a link attached to\nthe email and changing their password. The link leads to a phishing site that mimics a legitimate web\nportal login page where victims are directed to input personal information, including their usernames\nand passwords, for harvesting by DPRK cyber actors.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 9:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: Your Password for <legitimate portal site> Account Has Been Compromised\n\nWe regret to inform you that we have detected an attempt to log into your account (<email\n**address>) from an unauthorized application. The incident occurred on <date> at <time>**\n(Korea Standard Time), and the IP address used was <IP address> located in Washington,\nthe U.S.\n\nIn order to prevent any further unauthorized access to your account, we recommend that\nyou change your password immediately. You can do this by clicking on the following link:\n<link to change password - legitimate>\n\nPlease note that if you fail to change your password, we may have to permanently delete or\nclose your account in accordance with our security policy.\n\n\n## POTENTIAL MITIGATION MEASURES\n\n### For email recipients:\n\n  - Implement basic cyber hygiene to include robust passwords, multifactor authentication, and\n[installation of antivirus tools. See NSA’s Best Practices for Securing Your Home Network](https://media.defense.gov/2023/Feb/22/2003165170/-1/-1/0/CSI_BEST_PRACTICS_FOR_SECURING_YOUR_HOME_NETWORK.PDF) or\nNIS’s guidance for email security for more details.\n\n  - Do not enable macros on documents received via email, unless the source is verified.\n\n  - Do not open documents from cloud hosting services when shared via email, unless the source\nis verified.\n\n  - Closely scrutinize identities and associated social media or credentials for fraud. Be especially\ncautious of:\n```\n     o Official messages coming from unofficial or personal email accounts using commercial\n\n```\nproviders.\n```\n     o Domain/subdomain variations, as DPRK cyber actors have been known to register\n\n```\nspoofed domains (e.g., johndoe@abccompany.live vs. johndoe@abccompany.com).\n\n  - If you were previously in communication with the individual, use the known legitimate contact\ninformation instead of the new, potentially malicious email or account.\n\n  - When in doubt, consult the organization’s official website for correct contact information.\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n     - If you are still not sure, verify identities via phone or video call before engaging further. DPRK\ncyber actors are not known to engage outside of the virtual environment and will avoid\nvoice/video communications.\n\n     - If you cannot verify the source of an email inquiry, consider the risks before responding.\n\n     - Consider navigating to websites using a search engine’s non-sponsored results instead of\nclicking on URLs provided in the email(s).\n\n     - Be cautious of a request to move communications to a separate messaging platform.\n\n     - If sending documents, only send to verified email addresses.\n\n### For potential recipients’ systems administrators:\n\n     - Implement a user training program and phishing exercises to raise awareness among users\nabout the risks of visiting websites, clicking on links, and opening attachments. Reinforce the\nappropriate user response to phishing and spearphishing emails.\n\n     - [Require phishing-resistant multi-factor authentication (MFA) for as many services as](https://www.cisa.gov/sites/default/files/publications/fact-sheet-implementing-phishing-resistant-mfa-508c.pdf)\npossible—particularly for webmail, virtual private networks (VPNs), accounts that access\ncritical systems, and privileged accounts that manage backups.\n\n     - Regularly use port checking capabilities to determine if your network is being accessed\nremotely via desktop sharing software or a VPN or VPS, particularly if usage of remote\ndesktop sharing software or VPN services to access accounts is not standard practice.\n\n     - If you allow the use of Remote Desktop Protocol (RDP), or other potentially risky remote\n[services, secure and monitor them closely.](https://media.defense.gov/2023/Jan/25/2003149873/-1/-1/0/JOINT_CSA_RMM.PDF)\n```\n        o Limit access to resources over internal networks, especially by restricting RDP and\n\n```\nusing virtual desktop infrastructure. After assessing risks, if RDP is deemed\noperationally necessary, restrict the originating sources and require phishing-resistant\nMFA to mitigate credential theft and reuse. If RDP must be available externally, use a\nVPN, virtual desktop infrastructure, or other means to authenticate and secure the\nconnection before allowing RDP to connect to internal devices. Monitor remote\naccess/RDP logs, enforce account lockouts after a specified number of attempts to\nblock brute force campaigns, log RDP login attempts, and disable unused remote\naccess/RDP ports.\n```\n        o Ensure devices are properly configured and that security features are enabled. Disable\n\n```\nports and protocols not in use for a business purpose (e.g., RDP Transmission Control\nProtocol port 3389).\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n```\n        o Restrict the Server Message Block (SMB) protocol within the network to only access\n\n```\nnecessary servers and remove or disable outdated versions of SMB (i.e., SMB version\n1). Threat actors use SMB to propagate malware across organizations.\n```\n        o Review the security posture of third-party vendors and those interconnected with your\n\n```\norganization. Ensure all connections between third-party vendors and outside software\nor hardware are monitored and reviewed for suspicious activity.\n```\n        o Implement application control policies that only allow systems to execute known and\n\n```\npermitted programs.\n\n     - Open document readers in protected viewing modes to help prevent active content from\nrunning.\n\n     - Install updates for operating systems, software, and firmware as soon as they are released.\nTimely patching is one of the most efficient and cost-effective steps an organization can take\nto minimize its exposure to cybersecurity threats. Regularly check for software updates and\nend-of-life notifications and prioritize patching [known exploited vulnerabilities. Consider](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\nleveraging a centralized patch management system to automate and expedite the process.\n\n     - Install and regularly update antivirus and antimalware software on all hosts.\n\n     - Consider requiring administrator credentials to install software.\n\n     - Add an email banner to messages coming from outside your organizations indicating that they\nare higher risk messages.\n\n     - Consider adding rules to block emails that match the sample emails provided in this advisory.\nEnsuring that you know how to scan for malicious undelivered email messages on email\nservers is a critical step for preparing to understand the scope of this type of targeting once\nmalicious email identifiers are discovered.\n\n     - Enabling DMARC and DKIM on email domains generally makes certain forms of email\nspoofing more difficult, though it may not directly mitigate the tactics described above.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n### DPRK Rewards for Justice\n\nThe U.S. and ROK Governments encourage victims to report suspicious activities, including those\nrelated to suspected DPRK cyber activities, to relevant authorities. If you provide information about\nillicit DPRK activities in cyberspace, including past or ongoing operations, you may be eligible for a\nreward. If you have information about illicit DPRK activities in cyberspace, including past or ongoing\noperations, providing such information through the Department of State’s Rewards for Justice\nprogram could make you eligible to receive an award of up to $5 million. For further details, please\n[visit https://rewardsforjustice.net/.](https://rewardsforjustice.net/)\n\n### Disclaimer\n\nThe information in this report is being provided “as is” for informational purposes only. The authoring\nagencies do not endorse any commercial product or service, including any subjects of analysis. Any\nreference to specific commercial products, processes, or service by service mark, trademark,\nmanufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring\nby the co-authors.\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n## APPENDIX: ADDITIONAL SPEARPHISHING SAMPLES\n\n**Sample email communication 10:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\n“This is <name of legitimate journalist> from <legitimate non-U.S. news\n**organization>**\n\nI’m writing to know your thoughts on North Korea’s future direction after the Beijing\nWinter Olympics are over. Many believe a recent absence of North Korean\nprovocations is due to Pyongyang’s decision not to hurt Olympic vibes held in its lone\nmajor ally, but with the Games in the books, speculation is growing that North Korea\nis likely to pick up where it left off in January, or a series of missile tests.\n\n-Do you believe North Korea will resume testing its missile launches? If so, when is\nthe best time for it and what kind of missiles it will opt?\n\n-China is scheduled to hold the National People’s Congress, and the Chinese\nPeople’s Political Consultative Conference from March 4 to 13 and do you think the\nschedule will further defer North Korea’s possible missile testing?\n\n-North Korea has indicated that it will lift its moratorium on missile and nuclear tests,\nbut do you think there is the possibility that Pyongyang will offer to talk with the U.S.,\nputting the moratorium on the line? If so, what would be the U.S. response? I’d be\nvery grateful if you could send me your answers within this week\n\n\n**Sample email communication 11:**\n\n\nTitle: Documents for the Policy Advisory Committee.\n\nHello, <member of the committee>,\n\nI am <name of government employee> from <government department>.\n\nI am writing to inform you that I have attached the filed related to the recent visit of Special\nRepresentative Biegun to this email.\n\nAs this email contains sensitive information, please treat it as confidential.\n\n<file name.pdf>\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 12:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nDear <university professor>:\n\nI hope you are safe and well.\n\nThis is <legitimate journalist> from <legitimate non-U.S. news organization>. I am\nsending e-mail to you because I would like to hear your opinions about how Russia’s\ninvasion of Ukraine will affect the situation surrounding North Korea. Would you like to give\nme your opinions about the questions below?\n\n1) Some analysts argue that Russia’s invasion of Ukraine may make North Korea much\nmore reluctant to give up nuclear weapons, given that Ukraine has been eventually invaded\nby Russia after it abandoned its nuclear arsenal in exchange for security guarantees under\nthe Budapest Memorandum. This certainly looks similar to an agreement made between\nTrump and Kim Jong Un in Singapore in 2018. What do you think about this kind of\nargument?\n\n2) While the Biden administration is concentrated on the evolving circumstances surrounding\nUkraine, possibly lowering its guard in the Asia-Pacific region, North Korea Launches New\nICBM and may try to carry out nuclear tests. What do you think about North Korea’s future\ndevelopments?\n\n3) Do you think North Korea believes that Biden is already a “lame duck” and sees this as a\ngood chance to concentrate on developing new weapons?\n\n4) Do you expect China will tolerate North Korea’s spate of ballistic missile launches and\npossible nuclear tests? Do you think North Korea can or will maintain stable and amicable\nrelations with China? Does Russia not afford to care about North Korea?\n\nI would be very grateful if you could send me your answers within 5 days. Thanks for your\nconsideration and time in advance.\n\nbest regards.\n\n<legitimate journalist>\n\n\n-----\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n**Sample email communication 13:**\n\n\n**TLP:CLEAR** FBI | DOS | NSA| NIS | NPA | MOFA\n\n\nTitle: Your email account has been suspended\n\nWe are writing to inform you that your email account has been suspended because emails\nyou sent appear to have violated relevant laws and in some cases you may be held legally\nliable. If you did not send any spam mails from your <portal site> mail account, it is possible\nthat your account may have been compromised and used by someone else for spamming.\nWe recommend checking your email settings to ensure that your POP/IMAP options have\nnot ‘Enabled’ others to use your account.\n\nIf you are still unable to identify any problems with your email settings, it is possible that your\naccount has been hacked and your personal information was stolen. To regain access to\nyour email account, please follow the steps provided by our investigation department by\nclicking the button below.\n\n<Button linking to phishing website disguised as a normal portal login page>\n\n\n**Sample email communication 14:**\n\n\nTitle: Notification regarding your fraudulent account registration\n\nThis is the <legitimate portal site> operation team, and we regret to inform you that your ID\n<redacted> has been registered as a fraudulent account. To prevent any further harm, we\nrecommend that you take immediate action.\n\nWe kindly request you to verify your identity as soon as possible to ensure the safety and\nsecurity of your account. You can do this by visiting the member information page and\nchecking the registered name. We also advise you to change your password to keep your\naccount protected. Please be aware that the fraudulent account registration occurred on\n00:00, 00/00/0000.\n\nTo unlock your account, please follow the link provided below:\n\n<unlock your account: malicious link>\n\nThank you for choosing <legitimate portal site> as your trusted platform. We are committed\nto providing you with the best possible service and support.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://media.defense.gov/2023/Jun/01/2003234055/-1/-1/0/JOINT_CSA_DPRK_SOCIAL_ENGINEERING.PDF"
    ],
    "report_names": [
        "JOINT_CSA_DPRK_SOCIAL_ENGINEERING.PDF"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c306e698-3b48-46d7-b571-3dfa0c828379",
            "created_at": "2023-05-16T02:02:09.957677Z",
            "updated_at": "2025-03-27T02:00:03.129777Z",
            "deleted_at": null,
            "main_name": "APT43",
            "aliases": [],
            "source_name": "MISPGALAXY:APT43",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1687486122,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1685618538,
    "ts_modification_date": 1685618538,
    "files": {
        "pdf": "https://archive.orkl.eu/8ce93803b9037887944791861ce4616502fe54c6.pdf",
        "text": "https://archive.orkl.eu/8ce93803b9037887944791861ce4616502fe54c6.txt",
        "img": "https://archive.orkl.eu/8ce93803b9037887944791861ce4616502fe54c6.jpg"
    }
}