{
    "id": "e161bca9-39e2-4289-8843-1c582ec46310",
    "created_at": "2022-10-25T16:48:20.096624Z",
    "updated_at": "2025-03-27T02:16:01.185418Z",
    "deleted_at": null,
    "sha1_hash": "0e3b9cb55a2c2e2de02a26ea58283ad37e893b69",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-10-13T09:02:43Z",
    "file_modification_date": "2019-05-21T17:23:50Z",
    "file_size": 3178432,
    "plain_text": "### Attackers That Target Critical Infrastructure Providers in Japan\n\n## VOL.2 [2 0 1 6]\n\n\n-----\n\n-----\n\n##### Attackers That Target Critical Infrastructure Providers in Japan\n\n###### T A B L E O F C O N T E N T S\n\nIntroduction--------------------------------------------------------------------------------------------4\n\nDaserf: What is it and how is it being used in targeted attacks?--------------5\n\nDaserf: Operating environment and overview-------------------------------------------------------------------------------------------6\n\nCharacteristics of Daserf traffic----------------------------------------------------------------------------------------------------------------6\n\nDetecting Daserf---------------------------------------------------------------------------------------------------------------------------------------8\n\nDaserf: Who uses it?-----------------------------------------------------------------------------10\n\n\n-----\n\n# I N T R O D U C T I O N\n\n######  This report provides information on the results of analysis regarding\n\n Daserf (a type of malware that is used in targeted attacks aimed at\n\n critical infrastructure providers in Japan) and the attackers using it.\n\n  Japan has seen an increase in targeted attacks that use\n\n sophisticated methods to relentlessly attack the companies targeted.\n\n Especially, in June 2015, the Japan Pension Service sustained a\n\n targeted attack, resulting in the leakage of a huge amount of personal\n\n information. Thereafter, similar attacks against many organizations\n\n and companies in Japan, including local governments and universities,\n\n have been exposed, and the term \"targeted attack\" became widely\n\n known to the public. At the time of writing (June 2016), a large travel\n\n agency had sustained damage due to a targeted attack, announcing\n\n that it was very possible that personal information was leaked. The\n\n methods used in these targeted attacks have become more and\n\n more sophisticated. Thus, there is not just the risk that information is\n\n stolen from the company—there is also the serious risk of increased\n\n repercussions affecting business continuity.\n\n  NISC[i] has reported that the number of attacks against critical\n\n infrastructure providers, including those related to information\n\n communication, finance, aviation, and electric power, has increased\n\n significantly from 124 in FY2014 to 401 in FY2015. As the Tokyo\n\n Olympics and Paralympics are scheduled for 2020, it is more likely\n\n that attacks against critical infrastructure providers and infrastructure\n related companies will further increase. Under these circumstances,\n\n through this report, more or less, we hope to contribute to the\n\n consideration of countermeasures against Daserf attacks.\n\n\n-----\n\n###### Daserf: What is it and how is it being used in targeted attacks?\n\nDaserf is a type of malware that features a backdoor which is also known as a \"Nioupale.\"\n\nAlthough Symantec made a report on Daserf in May 2016 in its blog,[ii] until then, Daserf was\n\nnot widely known, as it had rarely been reported by security vendors. On the other hand, we\n\nconfirmed the presence of Daserf in targeted attack incidents from around January 2013, and\n\nwe have been continuing to analyze those incidents. Our analysis has revealed that Daserf\n\nwas being used by attackers targeting critical infrastructure in Japan and that there is a high\n\npossibility that Daserf has been active while hiding in target organizations for a long period of\n\ntime.\n\n**Figure 1 shows a graph that classifies the industries where Daserf was used in LAC-handled**\n\nincidents. The right frame indicates critical infrastructure-related industries,[iii] accounting for\n\nthe majority, at 56%. The left frame indicates the manufacturers of equipment used in critical\n\ninfrastructure, and the graph shows that all the incidents are directly or indirectly related to\n\ncritical infrastructure. Furthermore, this shows a high possibility that, at least in Japan, attackers\n\nhave used Daserf to target critical infrastructure and their related companies.\n\n**Transportation●** **●Electric power, gas,**\n\n**22%** **23%** **and energy**\n\n**Critical infrastructure-related** **44%** **56%** **Critical infrastructure provider**\n**equipment vendors** **11%**\n\n**22%**\n\n**11%** **●Aviation and railroads**\n\n**Machinery●** **11%**\n\n**●Public administration**\n\n**●Information communication**\n\n**Figure 1 Organizations in LAC-handled targeted attack incidents**\n\n**Figure 2 shows a timeline of Daserf-related incidents. In the timeline, the upper figure (in black)**\n\nindicates a date (year and month) that an incident was handled, and the lower figure (in red)\n\nindicates a date (year and month) when the malware was compiled or when the starting time of\n\nthe malware activities was recorded in the communications log. That is, the figure at the bottom\n\nindicates an estimated date when the intrusion occurred. By comparing these two rows of dates,\n\nit shows that it took a much longer time, from several months to approximately two and a half\n\nyears, for the targeted companies to identify any damage caused by the Daserf.\n\n\n-----\n\nThe reason why it took a longer time to identify any damage is because Daserf disguised itself\n\n(via a file name) as an official Windows program (such as msupdata.exe or mshelp.exe) or as an\n\nAdobe product program (such as AdobeARM.exe or reader_sl.exe). It is difficult to distinguish such\n\nprograms running on a PC from illegitimate programs. For all the incidents detected, we found\n\nRAR compressed files[1] containing confidential information, and attackers seemed to attempt to\n\nsteal confidential information from companies before any attacks are revealed.\n\n###### Daserf: Operating environment and overview\n\nDaserf runs on the Windows OS. As it features a variety of functions, such as file operations\n\n(creation, deletion, search, etc.) and command prompt (cmd.exe) operation, it can perform any\n\noperation on the infected PC. These capabilities are represented by file names (xxxxx.asp) hard\ncoded into the malware, and the operation performed depends on the instructions from the\n\nattacker’s Command & Control (C2) server.\n\n**Figure 3 File names hard-coded into malware**\n\n###### Characteristics of Daserf traffic\n\nDaserf mainly uses the HTTP POST request for communication with the C2 server, and it also\n\nuses an HTTP GET request to establish a session. The procedure, from establishing a session\n\nto starting communication, is as follows. First, Daserf uses an HTTP GET request to download a\n\nGIF file from the C2 server (Figure 4). In reality, this GIF file does not contain any image that the\n\nextension implies. Instead, it contains an XOR-encoded (exclusive OR) URL[2] using one byte.\n\n**Figure 4 HTTP GET request used by Daserf to establish a session with a C2 server**\n\n**1 Data compression file format  2 The XOR key depends on the type of malware used.**\n\n\n-----\n\nThen, it sends data to the C2 server by combining the URL with a file name hard-coded into the\n\nmalware (Figure 5).\n\n\n###### 05\n\n\n**Decoded URL** **File name**\n\n\n**Figure 5 Destination of a C2 server communication identified by the decoded URL**\n\n\n**Figure 6 shows the first HTTP POST traffic that occurs after the HTTP GET request in Figure**\n\n**4. The sent data contains the ID of the infected PC and the Base64-encoded infected PC**\n\ninformation (boxed text). By decoding the sent data, we can see that the character string includes\n\nspecific information, such as the host name and the IP address of the infected PC (Figure 7). The\n\ncharacter string contains an OS version of 6.1, which indicates Windows 7, and a locale ID of\n\n1041, which indicates use of the Japanese language.\n\n\n###### 06\n\n\n**Figure 6 First Daserf HTTP POST traffic that occurred after establishing a session**\n\n\n**Host name** **IP address** **OS version Locale ID** **Daserf version**\n\n\nAs LAC investigates several Daserf incidents, a special feature has emerged. Figure 8 (next\n\npage) represents an excerpt from the results of Maltego[iv]-based analysis by identifying the IP\n\naddresses of the Daserf traffic destination based on the domain names. It shows that multiple\n\narrows are directed toward two ellipses.[3] Both of the ellipses indicate an IP addresses managed\n\nby South Korean carriers. The left one is managed by LG DACOM Corporation, and the right\n\none is managed by Korea Telecom. As far as LAC has confirmed, approximately 65% of the IP\n\naddresses of C2 servers that Daserf communicates with, including this case, are owned by South\n\nKorean companies. Based on this, there is a high possibility that the attackers using Daserf\n\nutilized South Korean Internet service providers as their C2 server infrastructure. In addition, it\n\nhas been confirmed that there were a few IP addresses involving Japanese VPS (virtual private\n\nserver) service providers that were also used as C2 servers.\n\n**3 The IP addresses identified at the time of the investigation may be different from the IP addresses being used**\n**currently.**\n\n\n-----\n\nIn addition, it was confirmed that there is a possibility that some of the C2 servers are likely\n\nto have been designed to return contents only to users with the IP addresses that are being\n\ntargeted. As shown in Figure 9, a LAC PC intentionally infected with Daserf could resolve the C2\n\nserver domain name into an IP address, but it could not establish a TCP connection with the C2\n\nserver via C2 traffic (HTTP GET request). The attacker might have denied a connection request\n\nfrom any non-target IP address on the C2 server to prevent contents from being downloaded so\n\nthat the C2 server was not easily recognized.\n\n\n###### 09\n\n\nFigure 9 C2 server name resolution\n\n\n###### Detecting Daserf\n\nA PC or server infected with Daserf can be relatively easily identified. Daserf generates HTTP\n\nPOST traffic to a specific ASP file on the C2 server approximately once every 10 seconds, in\n\norder to establish a connection with a C2 server.[4] This results in a large amount of POST traffic\n\nbeing generated from the same PC and being recorded in the proxy log, thus the infected PC,\n\netc., can be easily identified by periodically checking the proxy log for such traffic.\n\n\n-----\n\nA user agent assigned to the HTTP header for communication is hard-coded into the malware,\n\nand a recent Daserf version uses \"Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; SV1).\"[5] It\n\nappears to be an official user agent for Internet Explorer (IE) 8, but if closely examined, it does not\n\nhave a character string of \"Trident 4\" assigned to it when IE8 is used.[v] Checking the proxy log for\n\nthe presence of such a user agent is another effective method.\n\nIf a PC that generates traffic to the C2 server is successfully identified, traces of Daserf could\n\npossibly be detected by using the following means; that is, to use Autoruns[6] etc., in order to\n\ncheck the registry values for startups[7] and the services[8] automatically executed upon Windows\n\nstartup. Figure 10 shows that Daserf uses a file name of Adobe ARM to execute AdobeARM.exe\n\nupon startup.\n\nFigure 10 Registry checking via Autoruns\n\n**4 If a GIF file containing a URL is not obtained from the C2 server, Daserf will generate an HTTP GET request to the**\n\n**GIF file approximately once every minute. The frequency of traffic generation depends on the type of malware used.**\n\n**5 An older Daserf version uses “Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1).”**\n\n**6 Autoruns is a tool used to display a list of programs automatically executed when Windows starts up, and it is**\n\n**distributed as part of Windows Sysinternals.**\n\n**(https://technet.microsoft.com/ja-jp/sysinternals/default)**\n\n**7 HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run or HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\**\n\n**Run**\n\n**8 HKLM\\SYSTEM\\CurrentControlSet\\Services**\n\n\n-----\n\n###### Daserf: Who uses it?\n\nThe iDefence Research Report (Wicked Rose and the NCPH Hacking Group)[vi] of 2007 from\n\nVeriSign iDefense is only one of very few reports on Daserf. The report identifies Daserf (Daserf. A)\n\nas one of the malware types used in a targeted attack in June 2006 by a Chinese hacking group\n\nknown as the \"Network Crack Program Hacker (NCPH) Hacking Group,\" and the report suggests\n\nthat the hacking group is involved in creating Daserf.\n\nSome of our investigations also revealed a vague image of who is attacking. Figure 11 shows\n\nan official website of an overseas trading company that handles LED products, and it was used\n\nas a C2 server by an attacker using Daserf. The displayed list of files in a CSS directory at the\n\nwebsite contains CSS files as well as PHP files. The attacker was able to somehow penetrate into\n\nthe trading company's Web server and install one or more files that the server administrator did\n\nnot intend to install.\n\nFigure 11 List of files in the mentioned CSS directory\n\nOur investigation showed that the feedcom.php file in the CSS directory was actually an\n\nencrypted file, not a PHP file. In addition, decoding the encrypted file revealed that it was an\n\nexecutable file, as shown in Figure 12.\n\n\n###### Decoded\n\n\n-----\n\nThe executable file that was decoded from the PHP file was not a malicious program such as\n\na malware, it was simply Notepad, which is included as standard (5.1.2600.5512 (xpsp.080413\n2105)) in the Chinese version of Windows OS (Figure 13). We don't know the reason why the\n\nattacker put the encrypted Notepad on the C2 server.\n\nIt should be noted that the comment.php file in the same CSS directory was likely to have been\n\nused as some type of an access log, as it recorded dates and times, IP addresses, and user agents.\n\n\n###### 13\n\n\nFigure 13 Chinese version of Notepad\n\n\nNext, let’s look at an overview of the attacker based on suspicious traffic that has been\n\ninfected with malware, including Daserf and Daserf-related malware. Figure 14 shows a summary\n\nof the unauthorized communication in chronological order between September 15 and October\n\n16, 2015. Of the two rows of arrows, the upper row indicates Japanese holidays, and the lower\n\nrow indicates Chinese holidays. The graph shows that an almost constant and small amount of\n\ntraffic occurred between September 28 and October 9, 2015. The period corresponds to the\n\n2015 National Day of the People's Republic of China (October 1 to October 7), and the attacker\n\nmight have taken days off during that period, following Chinese culture and customs. We assume\n\nthe constant and small amount of traffic was caused by some beacon traffic generated by the\n\nmalware even though the infected PC was not controlled by the attacker during that period.\n\n\nJapanese holiday\n\nChinese holiday\n\n**Number of times that**\n**suspicious traffic occurred**\n\n\n###### 14\n\n|Col1|Col2|Col3|\n|---|---|---|\n||||\n|National Day o|f the||\n|People's Republic of C|hina||\n||||\n||||\n||||\n\n\nFigure 14 Number of times infected traffic occurred between\nthe middle of September and the middle of October 2015\n\nUp to here, we have focused on how the trends in traffic infected with Daserf-type malware\n\nhave changed over time. Next, look at how such infected traffic changed, depending on the\n\nhour of day. Figure 15 (next page) shows a graph indicating how the amount of traffic changed,\n\ndepending on the hour of day, [9] between September 15 and October 16, 2015. The amount\n\nof traffic was remarkably higher during the hours between 9:00 and 17:00 (enclosed in lines),\n\nand the attacker is likely to have been operating the infected PC during that period. The hours\n\nenclosed in lines are from 8:00 to 16:00, China Standard Time, and this almost corresponds to\n\nwork hours for general workers in China.\n\nFor the hours during which the attacker was active, the attacker might have adapted to\n\nJapanese work hours. However, considering that days with a very small amount of traffic\n\ncorrespond to Chinese holidays, the attacker is likely to have been following the local schedule.\n\n\n-----\n\nIn addition, as will be mentioned in a later section, \"Types of malware used by attackers,\" some\n\nmalware types used by attackers for a series of attacks are encrypted with a tool released\n\nvia a Chinese site. Although this is only speculative, we can say that such an accumulation of\n\nfragmentary evidence provides a glimpse of who is attacking with Daserf.\n\n###### Daserf: Modus operandi of attackers\n\nIn a targeted attack, the attacker uses various attack methods to penetrate a target\n\norganization. An attacker sends an e-mail attaching Daserf disguised as a seasonal greeting to a\n\ntarget and tricks the recipient to open the e-mail, thus causing an infection with malware. If the\n\ne-mail recipient opens the attached file, a Flash animation as shown in Figure 16 will appear, and\n\nbehind the scenes, the malware (downloader type) will be executed.\n\nSome of our investigations have revealed that the files attached to the e-mails are most\n\ncommonly a .zip file, which is uncompressed into an .exe file. The .exe file is disguised as a Flash\n\nicon file for a New Year greeting, named \" 新年アニメーション.exe\" (Figure 17 on the next page).\n\nIf the file is executed, a Flash animation will appear, and behind the scenes, Daserf or another\n\ndifferent type of malware will be downloaded from a C2 server and executed (Figure 18, CASE A,\n\non the next page).\n\nFor all cases, the e-mail body text is unknown.\n\nLargely, the downloader was compiled in late December. It is possible that the attackers sent\n\ntargeted e-mails, taking advantage of events like Christmas or New Years.\n\n\n###### 16\n\n\n**Figure 16 will appear, and behind the scenes, the malware (downloader type) will be executed.**\n\n\n-----\n\n###### 17\n\n\n**Figure 17 Executable file named “新年アニメーション.exe”**\n\n\nMalware infection is not limited to the method of sending a .zip file with a compressed .exe to\n\ntargeted users. We consider it likely that attackers also use a method of exploiting CVE-2015\n2545, a Microsoft Office vulnerability (Figure 18, CASE B). This is because Gofarer, which\n\nSymantec Corporation reported as a type of malware for downloading Daserf, is similar to the\n\ntype of malware (downloader) dropped after exploiting the CVE-2015-2545 vulnerability. Figure\n\n**19 shows the results of comparison between Gofarer and the code that creates a Mutex of**\n\nthe dropped malware type. The Mutex naming conventions are similar. In addition, each type of\n\nmalware uses code to obtain access to the startup folder via the SHGetSpecialFolderPathAv[iii]\n\nWindows API for obtaining a special folder path, and creates malware in the startup folder, as\n\nshown in Figure 20 (next page). Therefore, these two different downloaders seem to have likely\n\nbeen used by the same attackers.\n\n\n**Gofarer**\n\n**Downloder after application of CVE-2015-2545**\n\n\n-----\n\n###### 20\n\n\n**Figure 20 Obtaining access to the startup folder via SHGetSpecialFolderPathA**\n\n\nKaspersky Lab[ix] reported that the attacking code exploiting the CVE-2015-2545 vulnerability\n\nwas used by more than one attacker. As reported by FireEye,[x] also in Japan, an Office document\n\nfile exploiting the vulnerability was confirmed at the end of November 2015. LAC also confirmed\n\nthat an organization of a specific industry received a copy of the same Office document file at the\n\nsame time, and most likely, it’s a targeted attack against a specific industry.\n\n###### Types of malware used by attackers\n\nAn attacker using Daserf uses more than one type of malware, downloader, or hacking tool for\n\ncommand control. DATPER, [xi] which is a type of malware for command control, uses an HTTP\n\nGET request for communication with a C2 server. Command execution results and information\n\nabout infected PCs are encrypted, and then the data is sent as a query string to the C2 server\n\n(Figure 21).\n\n\n###### 21\n\n\n**Figure 21 HTTP GET request from DATPER**\n\n\nDATPER encodes the data to be sent with XOR encoding and custom Base64 encoding, and\n\nthen compresses the data via the RtlCompressBuffer[xii] Windows API used for data compression.\n\nThe XOR encoding uses a key[10] based on data (enclosed in lines in the figure), as shown in\n\n**Figure 22, and the custom Base64 encoding uses the Base64 conversion table shown in Figure**\n\n**23. Depending on the type of malware, the data to be sent may only be encoded with XOR**\n\nencoding and custom Base64 encoding, without being compressed with RtlCompressBuffer.\n\n**Figure 22 XOR key table**\n\n**10 This may vary, depending on the type of malware.**\n\n\n-----\n\n**Figure 24 shows the result of decoding a portion of the character string as shown enclosed in**\n\nlines in Figure 21. The VMPC-123 that appears in the portion enclosed in lines within the figure\n\nindicates the host name of an infected PC.\n\n**Figure 23 Custom Base64 conversion table**\n\n**Figure 24 Result of decoding the sent data**\n\nFor downloaders, in addition to Gofarer, a VB script-based malware type has also been\n\nconfirmed. This malware type is encrypted as shown in Figure 25, with an encryption tool\n\nreleased at a sitexiii in China. Figure 26 on the next page shows part of the result of decoding\n\nthe VB script, and it indicates that an Internet Explorer object is used to generate traffic.\n\n\n-----\n\nFor hacking tools, in addition to a publicly available tools such as mimikatz and gsecdump, there\n\nis also the possibility of upload or tunnel tools being independently created by the attacker.\n\nSuch an upload tool, as per our confirmation, searches the current directory for files with the\n\n.rar extension. The upload tool uploads a found .rar file to a URL (www.lac.co.jp, in this example)\n\nspecified for an argument (Figure 27).\n\n\n###### 27\n\n\n**Figure 27 Execution of upload tools independently created by an attacker**\n\n\nThe upload tool uses HTTP POST traffic to upload data to www.lac.co.jp (Figure 28). The sent\n\ndata consists of \"file name###file contents\" and is encoded with both XOR encoding and custom\n\nBase64 encoding. The decoded data is \"lac.rar###lac\". The attacker is likely to have used Daserf\n\nin combination with their own tool and to have sent an RAR file containing stolen confidential\n\ninformation to a C2 server managed by the attacker.\n\n\n###### 28\n\n\n**Figure 28 HTTP POST traffic used by an upload tool**\n\n\n-----\n\n#### Conclusion\n\nAs described above, an attacker using Daserf uses multiple malware types including Daserf itself\n\nand can continue to be active while hiding for a long period of time, in order to steal confidential\n\ninformation from a target organization. As far as we can guess, based on Daserf incidents\n\nhandled by LAC, attackers have launched attacks against critical infrastructure at least once a\n\nyear, and will not stop attacking in the future. We hope that this report helps our customers to\n\nconsider future countermeasures under these circumstances.\n\nYou can identify the scope of damage and leaked data caused by Daserf. We recommend that\n\nyou make daily records of the logs of proxy server traffic and DNS server traffic[xiv], etc., as these\n\nare needed to analyze the malware type for which a trace can be identified in incident handling\n\nand to decode the traffic encrypted by the malware type being used. In addition, traffic packets\n\nshould also be logged via a switching hub or router port mirroring, although there are disk space\n\nand system load concerns.\n\nLAC will continue to investigate the attackers behind Daserf and will widely share helpful\n\ninformation with our customers.\n\n###### Indicator of Compromise（IOC）\n\n MD5\n\n\n11c5664bb5ea536676735efff333e2e2\n\n27ad4f54563038b7a90e66444bf7146e\n\n422450b14ad728a3b40dee3c4a48b53f\n\n48efa1dbc5dfc59df0c34b13a96cbd5c\n\n491b4a8912cf5c1554ce8807f7889d4b\n\n5c242fab2d222848755dadfbd29f7176\n\n5dd701d2df35c2a75d1ed5ad75ded06d\n\n765017e16842c9eb6860a7e9f711b0db\n\n7c91dcc66f6d0c31d6e36bb2869c0622\n\n80cc4ac026fa5d5b6f0ae82d19126ea4\n\n8979b840eb5a9a5d84f3da7843859bd5\n\n975f512e59ae2e592ba8e2c657bcb3fc\n\n9b7ccca8af5fd30e8e3706fdf4419653\n\n###### Traffic destinations\n\n\n9be919143ed3d33e713242ebe5923a89\n\n9faf0d22bbb0e837ed750435d4c01431\n\na77a25fb8112dc5f8a2feac0413d5f58\n\nb2ef0baef194f5c0044cfe5b6c5f321b\n\nbbd6fceba90efdbdbe22f11af9199321\n\nc35e99e48a4e81d43e66355a202f8902\n\ncaafc4b6154022e7d50869d50d67148a\n\nd3031438d80913f21ec6d3078dc77068\n\ndbb4415b7ba646fd6272e18311f43c10\n\ndf44fab5096630133b4159e5c196e9b4\n\nf4ab35f4f8569a446eba63df68ab8d97\n\n\n-----\n\n###### Sources\n\n**[i… ……… http://www.nisc.go.jp/active/kihon/pdf/jseval_2015.pdf](http://www.nisc.go.jp/active/kihon/pdf/jseval_2015.pdf)**\n\n**[ii………… http://www.symantec.com/connect/ja/blogs/tick](http://www.symantec.com/connect/ja/blogs/tick)**\n\n**[iii………… http://www.nisc.go.jp/active/infra/pdf/cc_ceptoar.pdf](http://www.nisc.go.jp/active/infra/pdf/cc_ceptoar.pdf)**\n\n**[iv………… https://www.paterva.com/web7/buy/maltego-clients.php](https://www.paterva.com/web7/buy/maltego-clients.php)**\n\n**[v………… https://msdn.microsoft.com/ja-jp/library/dd371735%28v=vs.85%29.aspx](https://msdn.microsoft.com/ja-jp/library/dd371735%28v=vs.85%29.aspx)**\n\n**[vi………… http://krebsonsecurity.com/wp-content/uploads/2012/11/WickedRose_andNCPH.pdf](http://krebsonsecurity.com/wp-content/uploads/2012/11/WickedRose_andNCPH.pdf)**\n\n**[vii… …… https://www.cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2015-2545](https://www.cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2015-2545)**\n\n**[viii……… https://msdn.microsoft.com/en-us/library/windows/desktop/bb762204(v=vs.85).aspx](https://msdn.microsoft.com/en-us/library/windows/desktop/bb762204(v=vs.85).aspx)**\n\n**[ix………… https://securelist.com/analysis/publications/74828/cve-2015-2545-overview-of-current-](https://securelist.com/analysis/publications/74828/cve-2015-2545-overview-of-current-threats/)**\n\n**[threats/](https://securelist.com/analysis/publications/74828/cve-2015-2545-overview-of-current-threats/)**\n\n**[x………… https://www.fireeye.com/blog/threat-research/2015/12/the-eps-awakens-part-two.html](https://www.fireeye.com/blog/threat-research/2015/12/the-eps-awakens-part-two.html)**\n\n**[xi………… http://about-threats.trendmicro.com/Malware.aspx?name=BKDR_DATPER.A](http://about-threats.trendmicro.com/Malware.aspx?name=BKDR_DATPER.A)**\n\n**[xii… …… https://msdn.microsoft.com/en-us/library/windows/hardware/ff552127(v=vs.85).aspx](https://msdn.microsoft.com/en-us/library/windows/hardware/ff552127(v=vs.85).aspx)**\n\n**[xiii……… http://www.52pojie.cn/thread-147071-1-1.html](http://www.52pojie.cn/thread-147071-1-1.html)**\n\n**[xiv……… http://www.lac.co.jp/blog/category/security/20160316.html](http://www.lac.co.jp/blog/category/security/20160316.html)**\n\n\n-----\n\n-----\n\n###### LAC Co., Ltd. CYBER GRID Laboratory\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.lac.co.jp/english/report/pdf/cgview_vol2_en.pdf"
    ],
    "report_names": [
        "cgview_vol2_en.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1476349363,
    "ts_modification_date": 1558459430,
    "files": {
        "pdf": "https://archive.orkl.eu/0e3b9cb55a2c2e2de02a26ea58283ad37e893b69.pdf",
        "text": "https://archive.orkl.eu/0e3b9cb55a2c2e2de02a26ea58283ad37e893b69.txt",
        "img": "https://archive.orkl.eu/0e3b9cb55a2c2e2de02a26ea58283ad37e893b69.jpg"
    }
}