{
    "id": "e1ae6f32-b1b6-4edc-89e5-448bc58d186c",
    "created_at": "2023-01-12T15:10:38.102356Z",
    "updated_at": "2025-03-27T02:16:57.907414Z",
    "deleted_at": null,
    "sha1_hash": "dd292ad0fef27eff1a38732bf4629f566c3534f7",
    "title": "2018-12-05 - The Dark Side of the ForSSHe",
    "authors": "",
    "file_creation_date": "2022-05-28T16:10:40Z",
    "file_modification_date": "2022-05-28T16:10:40Z",
    "file_size": 548372,
    "plain_text": "# The Dark Side of the ForSSHe\n\n**welivesecurity.com/2018/12/05/dark-side-of-the-forsshe/**\n\nDecember 5, 2018\n\nESET researchers discovered a set of previously undocumented Linux malware families\nbased on OpenSSH. In the white paper, “The Dark Side of the ForSSHe”, they release\nanalysis of 21 malware families to improve the prevention, detection and remediation of\nsuch threats\n\n[Marc-Etienne M.Léveillé](https://www.welivesecurity.com/author/marc-etienne/)\n5 Dec 2018 - 02:57PM\n\nESET researchers discovered a set of previously undocumented Linux malware families\nbased on OpenSSH. In the white paper, “The Dark Side of the ForSSHe”, they release\nanalysis of 21 malware families to improve the prevention, detection and remediation of\n\n\n-----\n\nsuch threats\n\nSSH, short for Secure SHell, is a network protocol to connect computers and devices\nremotely over an encrypted network link. It is generally used to manage Linux servers using\na text-mode console. SSH is the most common way for system administrators to manage\nvirtual, cloud, or dedicated, rented Linux servers.\n\n[The de facto implementation, bundled in almost all Linux distributions, is the portable](https://www.openssh.com/portable.html)\n[version of OpenSSH. A popular method used by attackers to maintain persistence on](https://www.openssh.com/)\ncompromised Linux servers is to backdoor the OpenSSH server and client already installed.\nThere are several reasons why creating malware based on OpenSSH is popular:\n\nIt doesn’t require a new TCP port to be opened on the compromised machine. SSH\nshould already be there and likely reachable from the internet.\nThe OpenSSH daemon and client see passwords in clear text, providing the attacker\nthe potential to steal credentials.\nOpenSSH source code is freely available, making it easy to create a “customized”\n(backdoored) version.\nOpenSSH is built to make it difficult to implement a man-in-the-middle attack and\nsnoop on its users’ activity. Attackers can leverage this to stay under the radar while\nthey conduct their malicious activities on the compromised server.\n\nTo better combat Linux malware threats, ESET researchers went on the hunt for in-the-wild\nOpenSSH backdoors, both known and unknown. We started our investigation on\nknowledge gleaned from one of our previous research efforts, [Operation Windigo. In that](https://www.welivesecurity.com/wp-content/uploads/2014/03/operation_windigo.pdf)\nwhite paper, we described in detail Windigo’s multiple malware components and how they\nwork together. At its core was [Ebury, an OpenSSH backdoor and credential stealer that was](https://www.welivesecurity.com/2014/02/21/an-in-depth-analysis-of-linuxebury/)\ninstalled on tens of thousands of compromised Linux servers worldwide.\n\nSomething that wasn’t originally discussed in the Operation Windigo paper, but that ESET\nresearchers have talked about at conferences, is how those attackers try to detect other\nOpenSSH backdoors prior to deploying their own (Ebury). They use a Perl script they have\ndeveloped that contains more than 40 signatures for different backdoors.\n\nJavaScript\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n\n@sd = gs( 'IN: %s@ \\(%s\\) ', '-B 2' );\n\n@sc = gc( 'OUT=> %s@%s \\(%s\\)', '-B 1' );\n\nif ( $sd[1] =~ m|^/| or $sc[0] =~ m|^/| ) {\n\nprint\n\n\"mod_sshd29: '$sd[0]':'$sd[1]':'$sd[2]'\\nmod_sshc29: '$sc[0]':'$sc[1]'\\n\";\n\nssh_ls( $sd[1], $sc[0] );\n\n}\n\n\n_Example signature found in Windigo Perl script to detect OpenSSH backdoor (tidied output)_\n\nWhen we looked into these signatures, we quickly realized that we did not have samples\nmatching most of the backdoors described in the script. The malware operators actually had\nmore knowledge and visibility into in-the-wild SSH backdoors than we did. To cope with this\nsituation, we started hunting for the missing malware samples using their signatures. This\nhelped us to find samples previously unknown to the computer security industry and to\nreport detailed research findings.\n\nToday, ESET researchers are publishing a paper focused on 21 in-the-wild OpenSSH\nmalware families. While some of these backdoors have already been analyzed and\ndocumented online, no analysis of most of them was available until now. The intent of this\npaper is to provide an overview of the current OpenSSH backdoor landscape. It is the result\nof a long-term research project involving writing rules and detections, deploying custom\nhoneypots, classification of samples, and analysis of the different malware families.\n\n[The Dark Side of the ForSSHe: A landscape of OpenSSH backdoors](https://www.welivesecurity.com/wp-content/uploads/2018/12/ESET-The_Dark_Side_of_the_ForSSHe.pdf)\n\n[Download Research Paper](https://www.welivesecurity.com/wp-content/uploads/2018/12/ESET-The_Dark_Side_of_the_ForSSHe.pdf)\n\n## Unveiling the dark side\n\nSoon after the Windigo research, we translated the signatures from the aforementioned Perl\n[script into YARA rules (now available on GitHub) and used them to find likely new malware](https://github.com/eset/malware-ioc/tree/master/sshdoor)\nsamples from our various feeds. We collected new samples for more than three years and,\n\n\n-----\n\nafter filtering out false positives, obtained a few hundred trojanized OpenSSH binaries. The\nanalysis of this collection highlights the use of a set of common features across the different\nbackdoors. Two of them really stand out:\n\n18 out of the 21 families feature a credential-stealing feature, making it possible to\nsteal passwords and/or keys used by the trojanized OpenSSH client and server.\n17 out of the 21 families feature a backdoor mode, allowing the attacker a stealthy\nand persistent way to connect back to the compromised machine.\n\nMore details about the common features of these OpenSSH backdoors are provided in the\nwhite paper.\n\nIn parallel with the analysis of the collected samples, we set up a custom honeypot\narchitecture (detailed in-depth in the white paper) to extend our results. The idea was to\nprovide (i.e. intentionally leak) credentials to the attackers using exfiltration techniques\nreverse-engineered from the samples. This would allow us to observe the behavior of the\nattackers once they compromise a server, and hopefully get the most recent samples.\n\nCombining our passive hunting with the YARA ruleset and the interaction of attackers with\nour honeypot gives us insight into both how active the attackers are and what their skillsets\nare.\n\n\n-----\n\nThis graphic sums up the OpenSSH backdoor families from this research. Some of our\nreaders will surely have recognized these names as corresponding to planets from the Star\nWars saga. Note that they do not correspond to ESET’s detection names; it is just a\nconvenient way to identify them in our research. Their detection names and various IoC\n[data are provided in the white paper and on our GitHub IoC repository.](https://github.com/eset/malware-ioc)\n\nEvaluating complexity for a family could be subjective. We have tried to be as objective as\npossible and base our classification on several factors, including:\n\nThe presence of an exfiltration technique – presence of C&C server, network protocol,\nencryption in transport or storage, etc.\n\n\n-----\n\nThe implementation of modules providing features additional to OpenSSH – additional\ncommands, cryptocurrency mining, etc.\nThe use of encryption or obfuscation to make analysis more difficult.\n\nEach family has its own complete description in the full report, but the galaxy representation\nstill gives some takeaways:\n\nAccording to our sample set, code complexity is increasingly important for the most\nrecent families.\nWe collected more samples for the older and simpler (often off-the-shelf) families. This\ncan be explained by the fact that more sophisticated ones are more difficult to detect\nand less prevalent.\n\n## Visiting some interesting planets\n\nSome of the backdoors we found aren’t particularly new or interesting from a technical\npoint-of-view. There are, however, quite a few exceptions showing that some attackers are\nputting a lot of effort into maintaining their botnets.\n\nOne of these is Kessel. Kessel stands out for its multiple methods of communicating with its\nC&C server. It implements HTTP, raw TCP and DNS. Besides asking for stolen credentials,\nthe C&C server also has the ability to send additional commands such as downloading from\nor uploading files to the compromised machine. All communication with its C&C server is\nalso encrypted. It is also quite new: the C&C server domain was registered in August 2018.\n\nKessel DNS exfiltration\n\nAnother such example is Kamino. From analysis of the samples, we discovered this threat\nhas existed for a long time and evolved, both in its obfuscation techniques and usage. It\nwas first used by a crimeware campaign known to leverage the DarkLeech malware to\n\n\n-----\n\nredirect traffic, as [documented by ESET researchers in 2013. Interestingly, it is the same](https://www.welivesecurity.com/2013/01/24/linux-sshdoor-a-backdoored-ssh-daemon-that-steals-passwords/)\nbackdoor that was used on attacks against Russian banks by a group called Carbanak\nyears later, as [described by Group-IB. This shift from crimeware to more targeted attacks is](https://www.group-ib.com/blog/renaissance)\nintriguing. It is tempting to think both attacks are from the same group, but it could also be\nexplained by the original authors selling their code to multiple crime groups.\n\nDetailed analyses of Chandrila (passing data in passwords) and Bonadan (cryptocurrency\nmining features) are also provided in the white paper.\n\n## Mitigation and detection\n\nSince the data we analyzed were mostly malware samples taken out of their context, it is\ndifficult to identify their original infection vectors. Techniques could include: using\ncredentials stolen after a victim used a compromised SSH client, brute force or exploitation\nof a vulnerable service exposed by the server.\n\nAny of the mentioned attack vectors might be used in future attacks, thus all good practices\naimed at preventing a system from being compromised should be followed:\n\nKeep the system up-to-date.\nFavor key-based authentication for SSH.\nDisable remote root login.\nUse a multi-factor authentication solution for SSH.\n\nESET products detect the analyzed OpenSSH backdoors as Linux/SSHDoor variants.\nAdditionally, the [YARA ruleset we used can help to classify the potential samples. The](https://github.com/eset/malware-ioc/tree/master/sshdoor)\npaper gives more details about validating OpenSSH files using Linux package managers to\nverify the integrity of installed executables.\n\n## Conclusion\n\nWith this research, we hope to shed light on OpenSSH backdoors and, by extension, on\nLinux malware in general. As observed through the diversity of code complexity, some\nattackers simply reuse available source code, while others put real effort into their bespoke\nimplementations. Moreover, the active hunt via our custom honeypot structure shows that\nsome attackers are still active and are very cautious when deploying their backdoors.\n\nAfter reading the paper you may feel that there is more Linux malware now than before; that\nthis is a rising trend. We don’t think this is necessarily the case: there has always been\nLinux malware but due to a lack of visibility it stays under the radar for a longer period.\n\nThere are still a lot of unanswered questions: how prevalent is each of these families? How\nare compromised systems used by the attackers? Besides stealing credentials, do they use\nadditional techniques to propagate?\n\n\n-----\n\nESET researchers believe that system administrators and malware researchers can help\neach other in the fight against server-side malware. Feel free to reach us at\n[threatintel@eset.com if you have additional details about the backdoors we have described](http://10.10.0.46/mailto:threatintel@eset.com)\n(or have not described) or if you have any questions.\n\n5 Dec 2018 - 02:57PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-05 - The Dark Side of the ForSSHe.pdf"
    ],
    "report_names": [
        "2018-12-05 - The Dark Side of the ForSSHe.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3844202f-b24a-4e16-b7b9-dfe8c0a44d5d",
            "created_at": "2022-10-25T16:07:24.526179Z",
            "updated_at": "2025-03-27T02:02:10.27234Z",
            "deleted_at": null,
            "main_name": "Operation Windigo",
            "aliases": [],
            "source_name": "ETDA:Operation Windigo",
            "tools": [
                "CDorked",
                "CDorked.A",
                "Calfbot",
                "Ebury"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1934b371-2525-4615-a90a-772182bc4184",
            "created_at": "2022-10-25T15:50:23.396576Z",
            "updated_at": "2025-03-27T02:00:55.460522Z",
            "deleted_at": null,
            "main_name": "Windigo",
            "aliases": [
                "Windigo"
            ],
            "source_name": "MITRE:Windigo",
            "tools": [
                "Ebury"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536238,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653754240,
    "ts_modification_date": 1653754240,
    "files": {
        "pdf": "https://archive.orkl.eu/dd292ad0fef27eff1a38732bf4629f566c3534f7.pdf",
        "text": "https://archive.orkl.eu/dd292ad0fef27eff1a38732bf4629f566c3534f7.txt",
        "img": "https://archive.orkl.eu/dd292ad0fef27eff1a38732bf4629f566c3534f7.jpg"
    }
}