{
    "id": "e1d5021e-a8d9-4c13-979e-8b8366a09bac",
    "created_at": "2023-01-12T15:07:59.160535Z",
    "updated_at": "2025-03-27T02:16:55.773959Z",
    "deleted_at": null,
    "sha1_hash": "ae78d41deecb7112c523e8dcbda49a7f58f9c2df",
    "title": "2021-10-22 - Advanced IP Scanner- the preferred scanner in the A(P)T toolbox",
    "authors": "",
    "file_creation_date": "2022-05-28T16:04:53Z",
    "file_modification_date": "2022-05-28T16:04:53Z",
    "file_size": 521369,
    "plain_text": "# Advanced IP Scanner: the preferred scanner in the A(P)T toolbox\n\n**[huntandhackett.com/blog/advanced-ip-scanner-the-preferred-scanner-in-the-apt-toolbox](https://www.huntandhackett.com/blog/advanced-ip-scanner-the-preferred-scanner-in-the-apt-toolbox)**\n\n[Krijn de Mik @](https://www.huntandhackett.com/blog/author/krijn-de-mik)\nOct 22, 2021 10:23:58 AM\n\n## 1. Introduction\n\nHunt & Hackett has been working on a wide variety of targeted ransomware cases. During these targeted ransomware\ncases, ‘Advanced IP Scanner’ (AIS) 1 [was regularly used as reconnaissance tool for Active Scanning (T1595) and Network](https://attack.mitre.org/techniques/T1595/)\n[Service Scanning (T1046). This has not only been observed by Hunt & Hackett, but also by other incident response parties.](https://attack.mitre.org/techniques/T1046/)\n\nGroups that have (had) used Advanced IP Scanner include:\n\n\nConti2\nDarkside/UNC2465\nEgregor4\nHades/ Evilcorp5\nREvil6\nRyuk/ UNC18787\nUNC24477\nUNC Iranian actor8\nDharma9\n\n\n3\n\n\nThis small write-up focuses on some of the forensic traces left by AIS that Hunt & Hackett observed during Incident\nResponse cases. The artefacts might be useful during an investigation, and can shine some (minor) light on threat actors’\nactivities. Furthermore, this blogpost provides some pointers related to detecting Advanced IP Scanner.\n\n## 2. Advanced IP Scanner\n\nAdvanced IP Scanner (AIS) is freely available online1 and can be executed as an installer and as a portable version. Both\nhave been used by threat actors. After the installation / execution of AIS, the end user is presented with an overview as\nshown in Figure 1.\n\n\n-----\n\n_Figure 1 - GUI of Advanced IP Scanner._\n\nAIS is a simple and user-friendly IP scanner, which provides the end user with a concise overview of the systems found in\nthe network. From a high-level perspective, AIS provides the user with the following functionality:\n\n1. IP scanning: scan the given range for systems that are alive, or dead;\n2. Tools: provide functionality to ping an IP, perform a Tracert, or connect with Telnet / SSH;\n3. Remote connections: connect to the corresponding IP address via HTTP, HTTPS, FTP, RDP, or RADMIN (only works if\n\nRADMIN is installed).\n4. (Re)boot/ Wake-On-Lan: the user can boot / reboot a system if the user is authorized to do so, or can send Wake-On\nLan (WOL) packages to a system. If enabled, this provides the user with functionality to remotely boot a system.\n\nThe fact that there is a portable version of Advanced IP Scanner, that it has a GUI and that the tool supports a variety of\nways to interact with identified systems probably contributes to it popularity.\n\n## 3. Forensic traces\n\nAIS leaves traces on a host system when it is executed. This section describes the traces that are created during usage of\nthe AIS tool and more specifically, the Windows registry keys that are being created. Do note that for both the portable\nversion as well as the installer version, the same traces are created in the Windows registry.\n\n### 3.1 AIS registry keys\n\nAfter the installation of AIS, keys and subkeys are created in the `HKEY_USERS hive of the user under which account AIS`\nwas installed. Data is more specifically stored at the following location:\n\n```\nComputer\\HKEY_USERS\\<SID>\\SOFTWARE\\famatech\\advanced_ip_scanner\n\n```\n\nThe mentioned registry keys are created, by both the installer version of AIS and the portable version, after the first usage of\nthe application and subsequently some (sub)keys are updated after using AIS. While looking at it graphically, multiple keys\nand subkeys are created as shown in Figure 2. The most relevant traces from a forensic perspective are either stored under\nthe ‘ advanced_ip_scanner ’, or the ‘ State ’ key.\n\n\n-----\n\n_Figure 2 – Overview of keys created with regards to AIS._\n\n### 3.2 The ‘advanced_ip_scanner’ keys and subkeys\n\nIf we look at the subkeys of the `advanced_ip_scanner key, we are presented with the keys as shown in Table 2. This table`\nshows the name and type of the subkeys, together with the value (data) of the subkey, a comment with what the subkey\nrepresents and what the function is within AIS. Especially the `locale subkey might be of relevance, since this could`\npotentially reveal something about the background of the threat actor, as well as the `locale_timestamp key since this`\ngives an indication of when the application has been used for the first time.\n\n**Name** **Type** **Data** **Comment**\n\n`locale` REG_SZ en_us Concerns the language settings of AIS as set by the user.\n\n`locale_timestamp` REG_SZ 1629953831432 The first time the application has been started in epoch time, which\ntranslates to UTC +0. After starting the application for the first time,\nHunt & Hackett hasn’t observed any updates to this value in\nsubsequent restarts of the application.\n\n`show_alive` REG_SZ true Indicates whether found hosts, which are probably reachable, with\nthe status ‘alive’ should be represented in the GUI. This is an option\nin the ‘View’ menu.\n\n`show_dead` REG_SZ true Indicates whether found hosts, which aren’t reachable, with the\nstatus ‘alive’ should be represented in the GUI. This is an option in\nthe ‘View’ menu.\n\n`show_unknown` REG_SZ false Indicates whether found hosts with the status ‘unknown’ should be\nrepresented in the GUI. This is an option in the ‘View’ menu.\n\n_Table 2: Overview of the AIS registry key ‘advanced_ip_scanner’ under HKEY_USERS hive._\n\n### 3.3 The ‘advanced_ip_scanner\\State’ keys and subkeys\n\nA variety of subkeys are listed under the key `advanced_ip_scanner/State, as shown in Table 3. This table shows the`\nname of subkeys together with the type of subkeys, the value (data) of the subkey, a comment with what the subkey\nrepresents and what the function is within AIS. All the keys, except for `LastRangeUsed are created upon the first time the`\napplication is started. The key `LastRangeUsed is created upon the first time a scan is performed with AIS.`\n\nThe three registry keys `IpRangesMruList,` `LastRangeUsed and` `SearchMruList under the key`\n```\nadvanced_ip_scanner\\State are especially interesting, as they could be of relevance during an IR assignment.\n   LastRangeUsed : this key represents the last scan that is being performed and shows the range that has been\n\n```\nscanned.\n\n\n-----\n\n```\n   IpRangesMruList : this key represents all ranges scanned by AIS, including the frequency. Every range scanned has\n\n```\na prefix of `[digit]-[digit], followed by` `[start IP address]-[IP range] . The first digit of the prefix represents`\nthe number of times a range has been scanned, which will be increased after every subsequent scan. The range\n```\n   192.168.227.1-254 in Table 3 has for example been scanned five times. It’s unknown what the second digit\n\n```\nrepresents, since this digit remained ‘static’ throughout the different tests performed. The scanned IP-range is stored in\nmemory while the application is still running. Upon closure of the application, the data is written from a buffer in\nmemory to the registry. The order in which the scanned IP ranges are stored is unknown.\n```\n   SearchMruList : This key contains an overview of all IP-addresses searched for by the user. These are added upon\n\n```\nclosure of the AIS application. Besides the last searched IP address, also other historical searches are saved here. Do\nnote that a similar prefix is added to IP address, just like for the key `IpRangesMruList . However, it’s unknown what`\nthis prefix represents.\n\n**Name** **Type** **Data** **Comment**\n\n\n`IpRangesMruList` REG_SZ 5-1\n192.168.227.1254\n\n2-1\n192.168.250.1254\n\n1-1\n192.168.116.1254\n\n1-1\n192.168.228.1254\n\n1-1\n192.168.240.1254\n\n1-1\n192.168.230.1254\n\n`LastActiveTab` REG_DWORD 0x00000000\n(0)\n\n`LastRangeUsed` REG_SZ 192.168.226.1254\n\n\nAll ranges scanned by the tool are stored in this subkey.\nAdditionally, the first digit of the prefix indicates how\nfrequent the range has been scanned.\n\nThe tab (either ‘results’ or ‘favorites’) that was active upon\nclosure of AIS process.\n\n\n`SearchMruList` REG_SZ (empty) The IP-addresses searched for via the GUI search field. A\nprefix is added to the searched IP represented as\n```\n                                [digit]-[digit] . It’s unknown to Hunt & Hackett what\n\n```\nthe prefix represents.\n\n\n`window_state` REG_BINARY 40 00 42 00 79\n00 74 00 64 00\n41 00 …\n\n\nHolds the state (dimensions) of the application windows\nupon closure of the application.\n\n\n_Table 3 - Overview of the AIS registry State key under HKEY_USERS hive._\n\n\n-----\n\n## 4. Detection\n\nDetection of the Advanced IP Scanner process is trivial. Here at Hunt & Hackett, we also try to come up with better,\nbehavioral detection methods that do not rely on static signatures for individual applications.\n\n### 4.1 Port scanning detection using Chronicle\n\nDetection should not only focus on the characteristics of individual pieces of software, but also on behavior of applications.\nThis means we also try to identify internal port scanning itself, and not merely the execution of Advanced IP Scanner. As part\nof our detection engineering efforts, we experiment with custom YARA-L10 rules for Chronicle11 to detect internal port scans.\n\n**Experimenting with horizontal port scanning detection**\n\nInternal port scanning of entire ranges results in a large number of network connections from the scanning machine to other\nmachines in a corporate network. We can use build-in functionality of Chronicle to experiment with YARA-L rules capable of\ndetecting internal scanning behavior.\n\nIn large enough networks, we can attempt to detect hosts that have performed a large number of connection attempts to\nother internal machines, which is indicative of internal port scans.\n\nThe experimental YARA-L rule depicted in Figure 3 for example triggers when a machine has made more than 100 internal\nconnections or connection attempts within 10 minutes. Real-world testing shows that this approach can detect (some)\ninternal port scans, though heavy tuning is required to filter out benign machines / processes that perform internal network\ndiscovery for legitimate reasons.\n\n_Figure 3 - Experimental YARA-L_\n\n_rule for detecting internal port scans_\n\n\n-----\n\n**Limitations of detection attempts**\n\nWith some filtering effort, we can use Chronicle to detect internal port scans at customers, though this approach is\nimpractical and requires heavy tuning. Additionally, our detection attempt is not foolproof and can be circumvented by a\ndetermined attacker.\n\nSome methods of bypassing this detection attempt include:\n\nSlow scanning to circumvent any time-based detection thresholds.\nScanning of small IP blocks at a time to bypass any count-based thresholds.\n\n### 4.2 Port scanning detection using Canary tokens\n\nIn the previous section, we concluded that it is not feasible to detect all internal port scans using only network connections\ndata and threshold-based detection rules. To enhance detection, we can place canary tokens at strategic places in an\norganization’s network. Whenever a canary token is scanned, the cyber defense center will receive an alert and an analyst\ncan investigate why a canary token was triggered.\n\nWhenever an alert is deemed malicious, this indicates an attacker is performing active reconnaissance in an organization’s\nnetwork. Though, whenever a canary token is triggered, this does not automatically mean a network has been breached.\nCanary tokens can also be triggered by benign activities, including:\n\nMisspelled IP addresses or server names\nApplications that (for various reasons) contain network discovery functionality\nSystem administrators or other users performing network scans for legitimate reasons\n\n## 5. Detection rules\n\nThis section contains an overview of different rules in both Carbon Black as well as Yara-L format.\n\nAdditionally, you can find an already existing Sigma rule in the Sigma rule repository\n```\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/win_advanced_ip_scanner.yml .\n\n```\nFor completeness the Sigma rules is listed in this section as well.\n\n### 5.1 Sigma\n\n```\naction: global\n\n```\n```\ntitle: Advanced IP Scanner\n\n```\n```\nstatus: experimental\n\n```\n```\ndescription: Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware\ngroups.\n\n```\n```\nreferences:\n\n```\n```\n  - https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-tobypass-protection/\n  - https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associatedwith-maze-ransomware-incidents.html\n\n```\n```\n  - https://labs.f-secure.com/blog/prelude-to-ransomware-systembc\n\n```\n```\n  - https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc01062021.pdf\n\n```\n```\n  - https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer\n\n```\n```\nauthor: '@ROxPinTeddy'\n\n```\n```\ndate: 2020/05/12\n\n```\n```\nmodified: 2021/05/11\n\n```\n```\ntags:\n\n```\n\n-----\n\n```\ny\n\n```\n```\n  - attack.t1046\n\n```\n```\nfalsepositives:\n\n```\n```\n  - Legitimate administrative use\n\n```\n```\nlevel: medium\n\n```\n```\n--\n```\n```\nid: bef37fa2-f205-4a7b-b484-0759bfd5f86f\n\n```\n```\nlogsource:\n\n```\n```\n  category: process_creation\n\n```\n```\n  product: windows\n\n```\n```\ndetection:\n\n```\n```\n  selection:\n\n```\n```\n    Image|contains: '\\advanced_ip_scanner'\n\n```\n```\n  condition: selection\n\n```\n```\n--\n```\n```\nid: fed85bf9-e075-4280-9159-fbe8a023d6fa\n\n```\n```\nlogsource:\n\n```\n```\n  category: file_event\n\n```\n```\n  product: windows\n\n```\n```\ndetection:\n\n```\n```\n  selection:\n\n```\n```\n    TargetFilename|contains: '\\AppData\\Local\\Temp\\Advanced IP Scanner 2'\n\n```\n```\n  condition: selection\n\n```\n\n### 5.2 CarbonBlack\n\n**Action** **CarbonBlack query**\n\n\n**Advanced**\n**IP**\n**Scanner**\n**execution**\n\n**Advanced**\n**IP**\n**Scanner**\n**registry**\n**access**\n\n```\n(process_name:advanced_ip_scanner.exe OR process_publisher:\"Famatech Corp.\") OR\n(process_file_description:\"Advanced IP Scanner\" OR\nprocess_original_filename:advanced_ip_scanner.exe OR process_internal_name:\"Advanced IP\nScanner\" OR process_product_name:\"Advanced IP Scanner\")\n\n```\n\n### 5.3 Chronicle\n\n\n-----\n\n```\nrule advanced_ip_scanner_execution {\n\n```\n```\n  meta:\n\n```\n```\n    author = \"Hunt & Hackett\"\n\n```\n```\n    description = \"Detects execution of Advanced IP Scanner\"\n\n```\n```\n  events:\n\n```\n```\n    $event.metadata.event_type = \"PROCESS_LAUNCH\"\n\n```\n```\n    ($event.principal.process.file.full_path = /Advanced_IP_Scanner/ nocase or\n\n```\n```\n    $event.principal.process.command_line = /Advanced_IP_Scanner/ nocase or\n\n```\n```\n    $event.target.process.file.full_path = /Advanced_IP_Scanner/ nocase or\n\n```\n```\n    $event.target.process.command_line = /Advanced_IP_Scanner/ nocase)\n\n```\n```\n   condition:\n\n```\n```\n    $event\n\n```\n```\n}\n\n```\n```\n   $e.principal.ip = $src_ip\n\n```\n```\n   // Filter on internal source IPs\n\n```\n```\n   (net.ip_in_range_cidr($e.principal.ip, \"10.0.0.0/8\") or\n   net.ip_in_range_cidr($e.principal.ip, \"172.16.0.0/12\") or\n   net.ip_in_range_cidr($e.principal.ip, \"192.168.0.0/16\"))\n\n```\n```\n   net.ip_in_range_cidr($e.target.ip, \"192.168.0.0/16\"))\n\n```\n```\n   $src_port > 20000\n\n```\n\n-----\n\n## Sources\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-22 - Advanced IP Scanner- the preferred scanner in the A(P)T toolbox.pdf"
    ],
    "report_names": [
        "2021-10-22 - Advanced IP Scanner- the preferred scanner in the A(P)T toolbox.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f7f836-b77f-4f95-aa02-9e99d32faf1d",
            "created_at": "2024-12-21T02:00:02.857057Z",
            "updated_at": "2025-03-27T02:00:03.472472Z",
            "deleted_at": null,
            "main_name": "UNC2465",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2465",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536079,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1653753893,
    "ts_modification_date": 1653753893,
    "files": {
        "pdf": "https://archive.orkl.eu/ae78d41deecb7112c523e8dcbda49a7f58f9c2df.pdf",
        "text": "https://archive.orkl.eu/ae78d41deecb7112c523e8dcbda49a7f58f9c2df.txt",
        "img": "https://archive.orkl.eu/ae78d41deecb7112c523e8dcbda49a7f58f9c2df.jpg"
    }
}