{
    "id": "e1d5bd71-a01d-45e2-ab6a-e4302b58e642",
    "created_at": "2022-10-27T08:36:04.71984Z",
    "updated_at": "2025-03-27T02:15:46.055707Z",
    "deleted_at": null,
    "sha1_hash": "dffdc55468ce4dca3b7449db8ae7a6121e310df5",
    "title": "AR-16-20173 - The Increasing Threat to Network Infrastructure Devices and Recommended Mitigations",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 500300,
    "plain_text": "National Cybersecurity and\nCommunications Integration Center\n\n\n**ANALYSIS REPORT**\n\n\n**_DISCLAIMER: This report is provided “as is” for informational purposes only. The Department of Homeland_**\n_Security (DHS) does not provide any warranties of any kind regarding any information contained within. DHS_\n_does not endorse any commercial product or service referenced in this advisory or otherwise. This document is_\n_distributed as TLP:WHITE: Subject to standard copyright rules, TLP:WHITE information may be distributed_\n_[without restriction. For more information on the Traffic Light Protocol, see https://www.us-cert.gov/tlp.](https://www.us-cert.gov/tlp)_\n\n**Reference Number: AR-16-20173** **August 30, 2016**\n\n# The Increasing Threat to Network Infrastructure Devices and Recommended Mitigations \n\n**Table of Contents**\n\n**The Increasing Threat to Network Infrastructure Devices and Recommended Mitigations .............. 2**\n\nSystems Affected ...................................................................................................................................... 2\n\nOverview ................................................................................................................................................... 2\n\nDescription ................................................................................................................................................ 2\n\nImpact ....................................................................................................................................................... 4\n\nPrevention and Mitigations Recommendations ........................................................................................ 4\n\nReferences ................................................................................................................................................. 9\n\n**Technical Annex 1: Cisco Adaptive Security Appliance (ASA) ............................................................ 10**\n\nAgency Action Items/Reporting Requirements ...................................................................................... 11\n\n**Technical Annex 2: Cisco ROMMON Integrity ..................................................................................... 12**\n\nAgency Action Items/Reporting Requirements ...................................................................................... 12\n\n**Technical Annex 3: Hacking Tools Targeting Firewalls ....................................................................... 14**\n\nAgency Action Items/Reporting Requirements ...................................................................................... 15\n\n\n-----\n\n## Alert—The Increasing Threat to Network Infrastructure Devices and Recommended Mitigations\n\n**Systems Affected**\n\nNetwork Infrastructure Devices\n\n**Overview**\n\nThe advancing capabilities of organized hacker groups and cyber adversaries create an increasing\nglobal threat to information systems. The rising threat levels place more demands on security\npersonnel and network administrators to protect information systems. Protecting the network\ninfrastructure is critical to preserve the confidentiality, integrity, and availability of\ncommunication and services across an enterprise.\n\nTo address threats to network infrastructure devices, this Alert provides information on recent\nvectors of attack that advanced persistent threat (APT) actors are targeting, along with prevention\nand mitigation recommendations.\n\n**Description**\n\nNetwork infrastructure consists of interconnected devices designed to transport communications\nneeded for data, applications, services, and multi-media. Routers and firewalls are the focus of\nthis alert; however, many other devices exist in the network, such as switches, load-balancers,\nintrusion detection systems, etc. Perimeter devices, such as firewalls and intrusion detection\nsystems, have been the traditional technologies used to secure the network, but as threats change,\nso must security strategies. Organizations can no longer rely on perimeter devices to protect the\nnetwork from cyber intrusions; organizations must also be able to contain the impact/losses\nwithin the internal network and infrastructure.\n\nFor several years now, vulnerable network devices have been the attack-vector of choice and one\nof the most effective techniques for sophisticated hackers and advanced threat actors. In this\nenvironment, there has never been a greater need to improve network infrastructure security.\nUnlike hosts that receive significant administrative security attention and for which security tools\nsuch as anti-malware exist, network devices are often working in the background with little\noversight—until network connectivity is broken or diminished. Malicious cyber actors take\nadvantage of this fact and often target network devices. Once on the device, they can remain\nthere undetected for long periods. After an incident, where administrators and security\nprofessionals perform forensic analysis and recover control, a malicious cyber actor with\npersistent access on network devices can reattack the recently cleaned hosts. For this reason,\nadministrators need to ensure proper configuration and control of network devices.\n\n\n-----\n\n**PROLIFERATION OF THREATS TO INFORMATION SYSTEMS**\n\n**_SYNful Knock_**\n\nIn September 2015, an attack known as SYNful Knock was disclosed. SYNful Knock silently\nchanges a router’s operating system image, thus allowing attackers to gain a foothold on a\nvictim’s network. The malware can be customized and updated once embedded. When the\nmodified malicious image is uploaded, it provides a backdoor into the victim’s network. Using a\ncrafted TCP SYN packet, a communication channel is established between the compromised\ndevice and the malicious command and control (C2) server. The impact of this infection to a\nnetwork or device is severe and most likely indicates that there may be additional backdoors or\ncompromised devices on the network. This foothold gives an attacker the ability to maneuver\nand infect other hosts and access sensitive data.\n\nThe initial infection vector does not leverage a zero-day vulnerability. Attackers either use the\ndefault credentials to log into the device or obtain weak credentials from other insecure devices\nor communications. The implant resides within a modified IOS image and, when loaded,\nmaintains its persistence in the environment, even after a system reboot. Any further modules\nloaded by the attacker will only exist in the router’s volatile memory and will not be available for\nuse after the device reboots. However, these devices are rarely or never rebooted.\n\nTo prevent the size of the image from changing, the malware overwrites several legitimate IOS\nfunctions with its own executable code. The attacker examines the functionality of the router and\ndetermines functions that can be overwritten without causing issues on the router. Thus, the\noverwritten functions will vary upon deployment.\n\nThe attacker can utilize the secret backdoor password in three different authentication scenarios.\nIn these scenarios the implant first checks to see if the user input is the backdoor password. If so,\naccess is granted. Otherwise, the implanted code will forward the credentials for normal\nverification of potentially valid credentials. This generally raises the least amount of suspicion.\nCisco has provided an alert on this attack vector. For more information, see the [Cisco SYNful](http://www.cisco.com/c/en/us/about/security-center/event-response/synful-knock.html)\nKnock Security Advisory.\n\nOther attacks against network infrastructure devices have also been reported, including more\ncomplicated persistent malware that silently changes the firmware on the device that is used to\nload the operating system so that the malware can inject code into the running operating system.\n[For more information, please see Cisco's description of the evolution of attacks on Cisco IOS](http://blogs.cisco.com/security/evolution-of-attacks-on-cisco-ios-devices)\ndevices.\n\n**_Cisco Adaptive Security Appliance (ASA)_**\n\nA Cisco ASA device is a network device that provides firewall and Virtual Private Network\n(VPN) functionality. These devices are often deployed at the edge of a network to protect a site’s\nnetwork infrastructure, and to give remote users access to protected local resources.\n\n\n-----\n\nIn June 2016, NCCIC received several reports of compromised Cisco ASA devices that were\nmodified in an unauthorized way. The ASA devices directed users to a location where malicious\nactors tried to socially engineer the users into divulging their credentials.\n\n[It is suspected that malicious actors leveraged CVE-2014-3393](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-3393) to inject malicious code into the\naffected devices. The malicious actor would then be able to modify the contents of the Random\nAccess Memory Filing System (RAMFS) cache file system and inject the malicious code into the\n[appliance’s configuration. Refer to the Cisco Security Advisory Multiple Vulnerabilities in Cisco](https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa)\nASA Software for more information and for remediation details.\n\nIn August 2016, threat actors publicly released a large number of files, including exploitation\ntools for both old and newly exposed vulnerabilities. Cisco ASA devices were found to be\nvulnerable to the released exploit code. In response, Cisco released an update to address a newly\ndisclosed Cisco ASA Simple Network Management Protocol (SNMP) remote code execution\n[vulnerability (CVE-2016-6366). In addition, one exploit tool targeted a previously patched Cisco](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6366)\n[vulnerability (CVE-2016-6367). Although Cisco provided patches](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6367) to fix this Cisco ASA\ncommand-line interface (CLI) remote code execution vulnerability in 2011, devices that remain\nunpatched are still vulnerable to the described attack. Attackers may target vulnerabilities for\nmonths or even years after patches become available.\n\n**Impact**\n\nIf the network infrastructure is compromised, malicious hackers or adversaries can gain full\ncontrol of the network infrastructure enabling further compromise of other types of devices and\ndata and allowing traffic to be redirected, changed, or denied. Possibilities of manipulation\ninclude denial-of-service, data theft, or unauthorized changes to the data.\n\nIntruders with infrastructure privilege and access can impede productivity and severely hinder reestablishing network connectivity. Even if other compromised devices are detected, tracking\nback to a compromised infrastructure device is often difficult.\n\nMalicious actors with persistent access to network devices can reattack and move laterally after\nthey have been ejected from previously exploited hosts.\n\n**Prevention and Mitigations Recommendations**\n\nNCCIC encourages users and network administrators to implement the following\nrecommendations to provide a more secure and efficient network infrastructure:\n\n1. Segregate networks and functions.\n2. Limit unnecessary lateral communications.\n3. Harden network devices.\n4. Secure access to infrastructure devices.\n5. Perform Out-of-Band network management.\n6. Validate integrity of hardware and software.\n\n\n-----\n\n**1. Segregate Networks and Functions**\n\nProper network segmentation is a very effective security mechanism to prevent an intruder from\npropagating exploits or laterally moving around an internal network. On a poorly segmented\nnetwork, intruders are able to extend their impact to control critical devices or gain access to\nsensitive data and intellectual property. Security architects must consider the overall\ninfrastructure layout, segmentation, and segregation. Segregation separates network segments\nbased on role and functionality. A securely segregated network can contain malicious\noccurrences, reducing the impact from intruders, in the event that they have gained a foothold\nsomewhere inside the network.\n\n**_Physical Separation of Sensitive Information_**\n\nLocal Area Network (LAN) segments are separated by traditional network devices such as\nrouters. Routers are placed between networks to create boundaries, increase the number of\nbroadcast domains, and effectively filter users’ broadcast traffic. These boundaries can be used\nto contain security breaches by restricting traffic to separate segments and can even shut down\nsegments of the network during an intrusion, restricting adversary access.\n\n**_Recommendations:_**\n\n- Implement Principles of Least Privilege and need-to-know when designing network\n\nsegments.\n\n- Separate sensitive information and security requirements into network segments.\n\n- Apply security recommendations and secure configurations to all network segments and\n\nnetwork layers.\n\n**_Virtual Separation of Sensitive Information_**\n\nAs technologies change, new strategies are developed to improve IT efficiencies and network\nsecurity controls. Virtual separation is the logical isolation of networks on the same physical\nnetwork. The same physical segmentation design principles apply to virtual segmentation but no\nadditional hardware is required. Existing technologies can be used to prevent an intruder from\nbreaching other internal network segments.\n\n**_Recommendations:_**\n\n- Use Private Virtual LANs to isolate a user from the rest of the broadcast domains.\n\n- Use Virtual Routing and Forwarding (VRF) technology to segment network traffic over\n\nmultiple routing tables simultaneously on a single router.\n\n- Use VPNs to securely extend a host/network by tunneling through public or private\n\nnetworks.\n\n\n-----\n\n**2. Limit Unnecessary Lateral Communications**\n\nAllowing unfiltered workstation-to-workstation communications (as well as other peer-to-peer\ncommunications) creates serious vulnerabilities, and can allow a network intruder to easily\nspread to multiple systems. An intruder can establish an effective “beach head” within the\nnetwork, and then spread to create backdoors into the network to maintain persistence and make\nit difficult for defenders to contain and eradicate.\n\n**_Recommendations:_**\n\n- Restrict communications using host-based firewall rules to deny the flow of packets from\n\nother hosts in the network. The firewall rules can be created to filter on a host device, user,\nprogram, or IP address to limit access from services and systems.\n\n- Implement a VLAN Access Control List (VACL), a filter that controls access to/from\n\nVLANs. VACL filters should be created to deny packets the ability to flow to other VLANs.\n\n- Logically segregate the network using physical or virtual separation allowing network\n\nadministrators to isolate critical devices onto network segments.\n\n**3. Harden Network Devices**\n\nA fundamental way to enhance network infrastructure security is to safeguard networking\ndevices with secure configurations. Government agencies, organizations, and vendors supply a\nwide range of resources to administrators on how to harden network devices. These resources\ninclude benchmarks and best practices. These recommendations should be implemented in\nconjunction with laws, regulations, site security policies, standards, and industry best practices.\nThese guides provide a baseline security configuration for the enterprise that protects the\nintegrity of network infrastructure devices. This guidance supplements the network security best\npractices supplied by vendors.\n\n**_Recommendations:_**\n\n- Disable unencrypted remote admin protocols used to manage network infrastructure (e.g.,\n\nTelnet, FTP).\n\n- Disable unnecessary services (e.g. discovery protocols, source routing, HTTP, SNMP,\n\nBOOTP).\n\n- Use SNMPv3 (or subsequent version) but do not use SNMP community strings.\n\n- Secure access to the console, auxiliary, and VTY lines.\n\n- Implement robust password policies and use the strongest password encryption available.\n\n- Protect router/switch by controlling access lists for remote administration.\n\n- Restrict physical access to routers/switches.\n\n- Backup configurations and store offline. Use the latest version of the network device\n\noperating system and update with all patches.\n\n- Periodically test security configurations against security requirements.\n\n- Protect configuration files with encryption and/or access controls when sending them\n\nelectronically and when they are stored and backed up.\n\n\n-----\n\n**4. Secure Access to Infrastructure Devices**\n\nAdministrative privileges on infrastructure devices allow access to resources that are normally\nunavailable to most users and permit the execution of actions that would otherwise be restricted.\nWhen administrator privileges are improperly authorized, granted widely, and/or not closely\naudited, intruders can exploit them. These compromised privileges can enable adversaries to\ntraverse a network, expanding access and potentially allowing full control of the infrastructure\nbackbone. Unauthorized infrastructure access can be mitigated by properly implementing secure\naccess policies and procedures.\n\n**_Recommendations:_**\n\n- **Implement Multi-Factor Authentication – Authentication is a process to validate a user’s**\n\nidentity. Weak authentication processes are commonly exploited by attackers. Multi-factor\nauthentication uses at least two identity components to authenticate a user’s identity. Identity\ncomponents include something the user knows (e.g., password); an object the user has\npossession of (e.g., token); and a trait unique to the specific person (e.g., biometric).\n\n- **Manage Privileged Access – Use an authorization server to store access information for**\n\nnetwork device management. This type of server will enable network administrators to assign\ndifferent privilege levels to users based on the principle of least privilege. When a user tries\nto execute an unauthorized command, it will be rejected. To increase the strength and\nrobustness of user authentication, implement a hard token authentication server in addition to\nthe AAA server, if possible. Multi-factor authentication increases the difficulty for intruders\nto steal and reuse credentials to gain access to network devices.\n\n- **Manage Administrative Credentials – Although multi-factor authentication is highly**\n\nrecommended and a best practice, systems that cannot meet this requirement can at least\nimprove their security level by changing default passwords and enforcing complex password\npolicies. Network accounts must contain complex passwords of at least 14 characters from\nmultiple character domains including lowercase, uppercase, numbers, and special characters.\nEnforce password expiration and reuse policies. If passwords are stored for emergency\naccess, keep these in a protected off-network location, such as a safe.\n\n**5. Perform Out-of-Band Management**\n\nOut-of-Band (OoB) management uses alternate communication paths to remotely manage\nnetwork infrastructure devices. These dedicated paths can vary in configuration to include\nanything from virtual tunneling to physical separation. Using OoB access to manage the network\ninfrastructure will strengthen security by limiting access and separating user traffic from network\nmanagement traffic. OoB management provides security monitoring and can implement\ncorrective actions without allowing the adversary who may have already compromised a portion\nof the network to observe these changes.\n\nOoB management can be implemented physically or virtually, or through a hybrid of the two.\nBuilding additional physical network infrastructure is the most secure option for the network\nmanagers, although it can be very expensive to implement and maintain. Virtual implementation\nis less costly, but still requires significant configuration changes and administration. In some\n\n\n-----\n\nsituations, such as access to remote locations, virtual encrypted tunnels may be the only viable\noption.\n\n**_Recommendations:_**\n\n- Segregate standard network traffic from management traffic.\n\n- Enforce that management traffic on devices only comes from the OoB.\n\n- Apply encryption to all management channels.\n\n- Encrypt all remote access to infrastructure devices such as terminal or dial-in servers.\n\n- Manage all administrative functions from a dedicated host (fully patched) over a secure\n\nchannel, preferably on the OoB.\n\n- Harden network management devices by testing patches, turning off unnecessary services on\n\nrouters and switches, and enforcing strong password policies. Monitor the network and\nreview logs Implement access controls that only permit required administrative or\nmanagement services (SNMP, NTP SSH, FTP, TFTP).\n\n**6. Validate Integrity of Hardware and Software**\n\nProducts purchased through unauthorized channels are often known as “counterfeit,”\n“secondary,” or “grey market” devices. There have been numerous reports in the press regarding\ngrey market hardware and software being introduced into the marketplace. Grey market products\nhave not been thoroughly tested to meet quality standards and can introduce risks to the network.\nLack of awareness or validation of the legitimacy of hardware and software presents a serious\nrisk to users’ information and the overall integrity of the network environment. Products\npurchased from the secondary market run the risk of having the supply chain breached, which\ncan result in the introduction of counterfeit, stolen, or second-hand devices. This could affect\nnetwork performance and compromise the confidentiality, integrity, or availability of network\nassets. Furthermore, breaches in the supply chain provide an opportunity for malicious software\nor hardware to be installed on the equipment. In addition, unauthorized or malicious software can\nbe loaded onto a device after it is in operational use, so integrity checking of software should be\ndone on a regular basis.\n\n**_Recommendations:_**\n\n- Maintain strict control of the supply chain; purchase only from authorized resellers.\n\n- Require resellers to implement a supply chain integrity check to validate hardware and\n\nsoftware authenticity.\n\n- Inspect the device for signs of tampering.\n\n- Validate serial numbers from multiple sources.\n\n- Download software, updates, patches, and upgrades from validated sources.\n\n- Perform hash verification and compare values against the vendor’s database to detect\n\nunauthorized modification to the firmware.\n\n- Monitor and log devices, verifying network configurations of devices on a regular schedule.\n\n- Train network owners, administrators, and procurement personnel to increase awareness of\n\ngrey market devices.\n\n\n-----\n\n**References**\n\n  - [Cisco SYNful Knock Security](http://www.cisco.com/c/en/us/about/security-center/event-response/synful-knock.html) Advisory\n\n  - [Cisco Security Advisory Multiple Vulnerabilities in Cisco ASA Software](https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa)\n\n  - [Cisco Evolution of Attacks on Cisco IOS Devices](https://blogs.cisco.com/security/evolution-of-attacks-on-cisco-ios-devices)\n\n  - [Cisco IOS Software Integrity Assurance](https://cisco.com/c/en/us/about/security-center/integrity-assurance.html)\n\n  - [Information Assurance Advisory NO. IAA U/OO/802097-16 “Recommendations to](https://www.iad.gov/iad/library/ia-advisories-alerts/recommendations-to-mitigate-unauthorized-cisco-rommon-access-and-validate-boot-roms.cfm)\n[Mitigate Unauthorized Cisco ROMMON Access and Validate Boot ROMs”](https://www.iad.gov/iad/library/ia-advisories-alerts/recommendations-to-mitigate-unauthorized-cisco-rommon-access-and-validate-boot-roms.cfm)\n\n  - Information Assurance Advisory NO. IAA U/OO/802488-16 “Vulnerabilities in Cisco\nAdaptive Security Appliances Identified in Open-Source – Version 1”\n\n  - Information Assurance Directorate Network Mitigations Package – Infrastructure\n\n**Contact Information**\n\nRecipients of this report are encouraged to contribute any additional information that they may\nhave related to this threat. For any questions related to this report, please contact NCCIC at:\n\n**_NCCIC:_**\nPhone: +1-888-282-0870\nEmail: ncciccustomerservice@hq.dhs.gov\n\n**Feedback**\n\nDHS strives to make this report a valuable tool for our partners and welcome feedback on how\nthis publication could be improved. You can help by answering a few short questions about this\nreport at the following URL: https://www.us-cert.gov/forms/feedback\n\n\n-----\n\n## Technical Annex 1: Cisco Adaptive Security Appliance (ASA)\n\n**Overview**\n\n[Cisco identified CVE-2014-3393, Cisco ASA Clientless SSL VPN Portal Customization](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-3393)\nIntegrity Vulnerability, published 08 October 2014, affecting Adaptive Security Appliances.\n\n**Description**\n\nVulnerability CVE-2014-3393 is a security issue that allows a remote attacker to alter content on\nthe logon page viewed by VPN users. Successful exploitation may result in a compromise of the\nClientless SSL VPN portal, which may lead to several types of attacks, which are not limited to\ncross-site scripting (XSS), stealing of credentials, or redirection of users to malicious web pages\n\n[1].\n\n**Impact**\n\nThe impact of this vulnerability is significant due to the risk of credentials being stolen and later\nbeing used by adversaries to legitimately log into agency networks. This also affects two-factor\nauthentication with the possibility of replay attacks and session hijacking.\n\nCustomers running a vulnerable configuration, regardless of the software release, should verify\nthat the portal customization has not been compromised. While upgrading to a fixed version of\n**Cisco ASA Software prevents this vulnerability from being exploited further, it will not**\n**modify any customization objects that have already been compromised and are present on**\n**the system. If an attacker has already compromised a customization object, the**\n**compromised object will stay persistent after the upgrade [1].**\n\n**Solution**\n\n1. Upgrade ASA IOS image to a non-vulnerable version.\n2. The Clientless SSL VPN portal is not enabled by default. To confirm if the Clientless\nSSL VPN portal is enabled, use the **show running-config webvpn** command and verify\nthat webvpn is enabled at least on one interface. The following example shows a Cisco\nASA with Clientless SSL VPN portal enabled on the outside interface:\n\na. ciscoasa# show running-config webvpn\nb. webvpn\nc. enable outside\n3. Agencies can verify that the portal has not been compromised by exporting the\ncustomization objects and manually verifying that the objects do not include malicious\ncode. Examples of malicious code are unauthorized iframes, scripts, embedded objects,\nencoded links, JavaScript, etc.\n\na. From the command line interface, use the export webvpn customization <object\n**name> <destination filename> command.**\n\n\n-----\n\nb. From the ASDM GUI, navigate to CLIENTLESS SSL VPN ACCESS ->\n\n**PORTAL -> CUSTOMIZATION. Inspect any listed objects.**\n4. Agencies are recommended to develop internal policies to periodically review all objects\nwithin the SSL VPN Portal Customization section.\n\n**Agency Action Items/Reporting Requirements**\n\n1. Verify Department and Agencies (D/As) ASA devices are utilizing the patched IOS\nversion that fixes the vulnerability.\n2. Notify NCCIC for discovered ASA devices with compromised objects.\n\na. Submit an incident report and open a Remedy ticket with NCCIC.\nb. Copy compromised object string(s) into a text file. Submit this text file in a\npassword protected zip file attached to the incident report, including the password\nto the zip file.\nc. Remove/Delete any compromised objects from the Clientless SSL VPN portal.\n3. Report total number of ASA devices that were checked and verified, including Model.\n4. No later than 30 days from receipt of this technical annex, complete reporting\nrequirements to NCCIC through the OMB MAX Connect portal.\n\n**References:**\n\n[1] http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa\n\n\n-----\n\n## Technical Annex 2: Cisco ROMMON Integrity\n\n**Overview**\n\nNew attack methods have been observed targeting networking devices running Cisco\nInternetwork Operating System (IOS). There is no CVE ID assigned to this attack method.\n\n**Description**\n\nIt has been observed that attackers, after gaining remote administrative or physical access to a\nCisco IOS device, loaded malicious code into the Cisco IOS ROM Monitor (ROMMON). The\nROMMON acts as an IOS boot-loader, so the malicious code will run at device startup and can\naffect the IOS image and configuration. No exploit is leveraged in this attack, and the attacker\nrequires valid administrative credentials or physical access to the system to be successful [1].\n\n**Impact**\n\nThe impact of this attack is significant due to the fact that network infrastructure is critical to the\nmission of Department and Agencies (D/As). Utilizing a malicious ROMMON provides\n**attackers an additional advantage because infection will persist through a reboot [1].**\n\n**Solution**\n\n1. D/As should identify which ROM the device boots from:\n\na. Use the Cisco IOS command: <show version>\nb. If the text “Currently running in ROMMON from Upgrade region” or\n_“ROMMON from Upgrade region is selected for next boot” is present in the_\ncommand output, further inspection should be conducted.\nc. For devices that contain the above output text, Administrators should make sure\nthat the ROM monitor upgrade was a scheduled and legitimate action and also do\na hash comparison (md5/SHA512) of a known good ROM image.\n2. It is imperative that D/As implement network device hardening strategies to protect their\nnetwork infrastructure. D/As should follow NSA Information Assurance Directorate\n(IAD) guidance detailed in “Recommendations to Mitigate Unauthorized Cisco\nROMMON Access and Validate Boot ROMs” [A1] and vendor guidance detailed in the\n“Cisco Guide to Harden Cisco IOS Devices” [2].\n3. For network devices that are End of Life or do not support newer security features,\nAgencies are recommended to develop replacement life cycle plans.\n\n**Agency Action Items/Reporting Requirements**\n\n1. Verify D/As Cisco routers ROMMON integrity using guidance in this report and\nreferenced material.\n\n\n-----\n\n2. Notify NCCIC for discovered Cisco routers with changed ROM boot options and\nsuspicion of ROM image integrity compromise.\n\na. Submit an incident report and open a Remedy ticket with NCCIC.\nb. Be prepared to support follow-on actions from NCCIC.\n3. Report total number of Cisco routers that were checked and verified, including Model.\n4. No later than 14 days from receipt of this technical annex, complete reporting\nrequirements to NCCIC through the OMB MAX Connect portal.\n\n**References:**\n\n[1. http://tools.cisco.com/security/center/viewAlert.x?alertId=40411](http://tools.cisco.com/security/center/viewAlert.x?alertId=40411)\n[2. http://www.cisco.com/c/en/us/support/docs/ip/access-lists/13608-21.html](http://www.cisco.com/c/en/us/support/docs/ip/access-lists/13608-21.html)\n3. http://www.cisco.com/c/en/us/about/security-center/integrity-assurance.html\n\n\n-----\n\n## Technical Annex 3: Hacking Tools Targeting Firewalls\n\n**Overview**\n\nIn August 2016, threat actors publicly released a large number of files, including exploitation\ntools for both old and newly exposed vulnerabilities. The tools appear to target firewalls from\ndifferent vendors (Cisco, Fortinet, Juniper, Huawei, WatchGuard, and TOPSEC). Cisco, Fortinet,\nand Juniper have released advisories to address this threat.\n\n**Description**\n\nVulnerable network devices have been the attack-vector of choice and one of the most effective\ntechniques for sophisticated hackers and advanced threat actors. The released exploitation tools\nare targeting firewall devices from different manufacturers.\n\n**Cisco**\nCisco ASA devices were found to be vulnerable to the released exploit code. In response, Cisco\nreleased an update to address a newly disclosed Cisco ASA SNMP remote code execution\n[vulnerability (CVE-2016-6366). In addition, one exploit tool targeted a previously patched Cisco](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6366)\n[vulnerability (CVE-2016-6367). Although Cisco provided patches to fix this Cisco ASA CLI](https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6367)\nremote code execution vulnerability in 2011, devices that remain unpatched are still vulnerable.\nFor additional information, see the Cisco Advisory.\n\n**Fortinet**\nIn August 2012, Fortinet provided security updates for its FortiGate firmware to address a cookie\nparser buffer overflow vulnerability. However, unpatched systems remain vulnerable, and the\n[released exploit code targets the vulnerability. For more information, see the Fortinet Advisory.](http://fortiguard.com/advisory/FG-IR-16-023)\n\n**Juniper**\nJuniper is investigating exploits targeting NetScreen devices running ScreenOS. However,\n[Juniper’s initial analysis does not indicate a ScreenOS vulnerability. See the Juniper Advisory](https://forums.juniper.net/t5/Security-Incident-Response/Shadow-Brokers-Release-of-Hacking-Code/ba-p/296128)\nfor additional information.\n\n**WatchGuard**\nOne released exploitation tool targets a command injection vulnerability in RapidStream\nappliances. WatchGuard acquired RapidStream in 2002, and stated that the vulnerability was not\n[carried over to WatchGuard appliances. For more information, see the WatchGuard article.](https://www.secplicity.org/2016/08/16/nsa-equation-group-exploit-leak-mean/)\n\n**TOPSEC and Huawei**\nThe released tools target TOPSEC and Huawei firewall devices. However, both vendors have not\nmade a public acknowledgement or comment on the newly released exploit tools.\n\n\n-----\n\n**Impact**\n\nThe tools are fully functional and may compromise targeted devices. The malicious use of these\ntools are significant risks and may affect the confidentiality, integrity, and availability of network\ninfrastructure critical to the mission of Department and Agencies (D/As).\n\n**Solution**\n\n1. Apply vendor updates/patches to software and firmware, when available.\n2. Disable unused/unneeded services (e.g. telnet, cisco-telnet, etc.).\n3. Use multi-factor authentication to the greatest extent possible (e.g. PKI-based\nauthentication to SSH).\n4. Restrict access to device management and remote access services to authorized systems\nor management subnets. This can be enforced by both local device configurations (e.g.\nCisco IOS access lists) as well as upstream/downstream network and security\ninfrastructure device ACLs.\n5. For SNMP:\n\na. Restrict SNMP traffic to device management interfaces with access control list to\nfurther limit accessibility.\nb. Maximize use of SNMPv3 to gain the benefit of encryption.\nc. If network devices do not support SNMPv3, implement a robust “community\nstring” management policy; while SNMP community strings are not equivalent to\nsystem passwords, similar policies for length, complexity, diversity and rotation\nshould be employed.\n6. Use separate passwords/passphrases for device access and privileged functions (e.g.\nCisco IOS’s “enable” password). Some exploitation tools only establish access at a\ncertain level.\n7. Enable detailed logging of login activity and device configuration, with logs sent to a\nseparate system for review and archiving.\n\n**Agency Action Items/Reporting Requirements**\n\n1. Verify Department and Agencies (D/As) are utilizing the patched vendor software for\ntheir specific network device.\n2. Notify NCCIC for discovered network devices that show indications of compromise.\n\na. Submit an incident report and open a Remedy ticket with NCCIC.\nb. Be prepared to support follow-on actions from NCCIC.\n3. Report total number of network devices that were checked and verified, including Vendor\nand Model.\n4. No later than 7 days from receipt of this technical annex, complete reporting\nrequirements to NCCIC through the OMB MAX Connect portal.\n\n**References:**\n\n[[1] http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa](http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://cyber.dhs.gov/assets/report/ar-16-20173.pdf"
    ],
    "report_names": [
        "ar-16-20173.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666859764,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/dffdc55468ce4dca3b7449db8ae7a6121e310df5.pdf",
        "text": "https://archive.orkl.eu/dffdc55468ce4dca3b7449db8ae7a6121e310df5.txt",
        "img": "https://archive.orkl.eu/dffdc55468ce4dca3b7449db8ae7a6121e310df5.jpg"
    }
}