{
    "id": "e38f32de-5e2f-4171-be5a-ae66616563db",
    "created_at": "2023-01-12T15:05:01.48563Z",
    "updated_at": "2025-03-27T02:15:49.277409Z",
    "deleted_at": null,
    "sha1_hash": "cd0652f9007f4b90f1abba3df5454bd5d985ce3c",
    "title": "2016-09-17 - A few notes on SECONDDATE's C&C protocol",
    "authors": "",
    "file_creation_date": "2018-03-26T13:19:05Z",
    "file_modification_date": "2018-03-26T13:19:05Z",
    "file_size": 597577,
    "plain_text": "# CSS CYBER DEFENSE PROJECT\n\n Hotspot Analysis:\n\n Stuxnet\n\n### Zürich, October 2017\n\n Version 1\n\n Risk and Resilience Team Center for Security Studies (CSS), ETH Zürich\n\n\n-----\n\nAuthors: Marie Baezner, Patrice Robin\n\n© 2017 Center for Security Studies (CSS), ETH Zürich\nContact:\nCenter for Security Studies\nHaldeneggsteig 4\nETH Zürich\nCH-8092 Zürich\nSwitzerland\nTel.: +41-44-632 40 25\n_css@sipo.gess.ethz.ch_\n_www.css.ethz.ch_\n\nAnalysis prepared by: Center for Security Studies (CSS),\nETH Zürich\n\nETH-CSS project management: Tim Prior, Head of the\nRisk and Resilience Research Group; Myriam Dunn\nCavelty, Deputy Head for Research and Teaching;\nAndreas Wenger, Director of the CSS\n\nDisclaimer: The opinions presented in this study\nexclusively reflect the authors’ views.\n\nPlease cite as: Baezner, Marie; Robin, Patrice (2017):\nHotspot Analysis: Stuxnet, October 2017, Center for\nSecurity Studies (CSS), ETH Zürich.\n\n\n-----\n\n# Table of Contents\n\n**1** **Introduction** **5**\n\n**2** **Background and chronology** **6**\n\n**3** **Description** **7**\n3.1 Tool 7\n3.2 Target 8\n3.3 Attribution and actors 8\n\n**4** **Effects** **9**\n4.1 Social and political effects 9\n4.2 Economic effects 10\n4.3 Technological effects 10\n4.4 International effects 11\n\n**5** **Policy Consequences** **11**\n5.1 Improving Cybersecurity 11\n5.2 Integration of critical infrastructures in cyber\nstrategy 11\n5.3 Establishment of cybersecurity standards for\nindustrial equipment 12\n5.4 Promotion of international Confidence Building\nMeasures (CBMs) 12\n\n**6** **Annex 1** **13**\n\n**7** **Glossary** **13**\n\n**8** **Abbreviations** **14**\n\n**9** **Bibliography** **14**\n\n\n-----\n\n# Executive Summary\n\nTarget: Centrifuges [1] used in the uranium\nenrichment process in a nuclear plant in\nNatanz in Iran.\nTool: Stuxnet: a worm using four zero-day\nvulnerabilities and infecting computer\nnetworks through USB flash drives.\nEffects: Damage to the centrifuges;\nmodification or/and creation of cyber\nstrategies in the world; increase in\nawareness of cybersecurity issues.\nTimeframe 2009 - 2011\n\nThe discovery of Stuxnet raised awareness of\ncybersecurity issues all around the world. Through this\npiece of malware, states realized that critical\ninfrastructures were vulnerable to cyberattacks and that\nthe potential consequences could be disastrous. The aim\nof this hotspot analysis is to better understand the case\nof the Stuxnet worm and its effects. The objective is also\nto understand how Iran managed the situation and how\nit reacted.\n\nThis analysis focuses on the specific case of the\nStuxnet worm and the effects of its discovery in Iran and\namong the international community. In this report, a\nhotspot is defined as a precise event that occurs in\ncyberspace and impacts on the physical world.\n\n**Description**\n\nThe Stuxnet worm was discovered in an Iranian\ncomputer in 2010. This piece of malware surprised\ncomputer experts due to its sophistication and the use\nof four zero-day exploits. It was later found that the\nmalware was not designed to spy, but rather to\nsabotage centrifuges in the power facilities of Natanz in\nIran. It is believed that the USA built Stuxnet with the\nsupport of Israel with the goal of stopping or delaying\nthe Iranian nuclear program. The worm was probably\nimplanted in the Natanz power plant’s network by using\na compromised USB drive. This technique enabled the\nworm to penetrate a network that is normally isolated\nfrom other networks.\n\n**Effects**\n\nThe hotspot analysis shows that Stuxnet had an\nimpact on Iranian society and politics by making it look\nweak for not securing its critical infrastructures\nproperly. The effects were also felt in the Iranian\neconomy as the state had to spend money to replace the\n\n1 Technical terms are explained in a glossary in Section 7 at the end of\nthe document.\n\n\nbroken centrifuges and needed to create a new\ncybersecurity unit. The technological findings of this\ncase study show that malware can be designed\nspecifically to sabotage a very precise piece of industrial\nequipment. They also reveal new zero-day\nvulnerabilities and that driver certificates can be stolen\nand used for malicious intents.\n\nAt the international level, Stuxnet had the effect\nof being a wakeup call for states, which suddenly\nrealized that they needed to enhance their cybersecurity\npolicies and/or strategies. They also recognized that\nthey required a comprehensive cybersecurity strategy\nthat extends to critical infrastructures and the private\nactors that manage them. Stuxnet also had the effect of\ndecreasing tensions in the Middle East, as the Iranian\nnuclear program was no longer perceived as an\nimmediate threat. There was also concern among the\ninternational community that new versions of Stuxnet\nmight appear in the wild and in cybercrime circles.\nHowever, no modified versions of Stuxnet have been\nfound since 2010.\n\n**Consequences**\n\nVarious consequences can be derived from the\ndiscovery of Stuxnet and its effects. First, states may\nwish to enhance their cybersecurity by raising\nawareness of the fact that even air-gapped networks are\nat risk. States also need to integrate private actors\nmanaging critical infrastructures in their cybersecurity\nprocesses. Second, states should develop plans or\nprocesses for responding to cyberattacks such as\nStuxnet. Relevant plans should include infrastructure\nresilience as well as ways to respond to state actors\nbehind the attacks. Third, states could develop\ncybersecurity norms and standards for industrial assets\nto ensure a minimum level of security in networked\nequipment. Fourth, at the international level, states\nshould try to promote international cooperation on\ncybersecurity and international norms on states’\nconduct in cyberspace. This could help to reduce both\nmistrust and the risk of misinterpretation among states\nin regard to cyberspace.\n\n\n-----\n\n## 1 Introduction\n\nStuxnet is a computer worm[2] discovered in 2010,\nwhich affected nuclear installations in Iran. This cyberincident provoked sweeping changes in states’ cyber\npolicies and strategies.\n\nThis hotspot analysis of Stuxnet is relevant\nbecause the discovery of the worm constituted a\nwatershed in terms of how states perceive cyberthreats.\nThere is a clear distinction in cyber strategies before and\nafter Stuxnet. There is a wealth of literature on the\nworm, but the time that has elapsed since the Stuxnet\nincident has allowed researchers to investigate the\nevents from a different perspective and with a more\ndeliberate approach, eliminating opportunistic and\nunfounded comments made in the immediate\naftermath of the discovery of the worm.\n\nThe analysis of hotspots helps to understand\ntheoretical and abstract cybersecurity concepts by using\nclear examples. The aim of this hotspot analysis is to\nexamine how victims of cyberattacks were impacted and\nhow they responded to attacks. This report also serves\nas a basis for a broader comparative analysis of various\nhotspots. This broader document will also provide\nsuggestions on how states may wish to revise their\npolicies and responses if faced with similar situations.\n\nThis document may be updated in the future to\naccurately reflect any new developments. This may\noccur if and when new aspects of relevant events are\ndisclosed or important changes occur.\n\nThe analysis is organized as follows. Section 2\ndescribes the historical background and chronology of\nthe events in the lead-up to the discovery of Stuxnet and\nits investigation. It also examines the events that shaped\nthe specific context of the tensions between Iran and\nthe USA.\n\nSection 3 of the analysis details the technical\nspecificities of the Stuxnet worm, what it was targeting\nand who may have developed it. It shows that this\nparticular piece of malware only targeted a specific type\nof centrifuge located in the Iranian nuclear facility of\nNatanz and describes its effects. It additionally looks at\nwho may have been capable of developing a tool such as\nStuxnet and possible reasons for its creation.\n\nSection 4 examines the effects of Stuxnet on\nIranian politics and society, on the country's economy,\nin the technological realm and at the international level.\nThe impact of the Stuxnet worm on Iranian society and\npolitics was characterized by a resulting feeling of\ninsecurity and an indecisive stance from the Iranian\ngovernment. Any state falling victim to such an intrusion\nwould feel insecure and concerned about potential\nsimilar attacks. This was also the case in Iran, and the\nIranian government also seemed unsure how to respond\n\n2 Technical terms written in italics are explained in a glossary in\nSection 7 at the end of the document.\n\n\nto the attack. Economic impacts were mostly marked by\nthe material costs of replacing the broken centrifuges\nand building new cyberdefense capabilities.\n\nStuxnet also had some repercussions in the\ntechnological realm, as it was the first time that malware\nof this type was designed to target a highly specific\nobject. The discovery of Stuxnet also brought to light\nnew zero-day vulnerabilities and the fact that driver\ncertificates can be stolen and used in malware.\n\nAt the international level, the discovery of\nStuxnet provoked a wave of new national cybersecurity\nstrategies as states realized that cybertools can be used\nagainst critical infrastructures. Also, states were gravely\nconcerned that modified versions of Stuxnet might\nflourish among cybercriminals. At the same time, the\ndelays caused by the worm in the Iranian nuclear\nprogram alleviated regional tensions among neighbors.\n\nThis hotspot analysis concludes with\nrecommendations derived from the effects of Stuxnet in\nSection 5. These show how states can improve their\ncybersecurity through awareness campaigns and\ncomprehensive cyber strategies that integrate private\npartners in charge of critical infrastructures. States could\nalso enhance their cybersecurity by producing\ncybersecurity guidelines or standards for networked\nindustrial equipment, and they can work towards\nreducing mistrust and the risk of misperceptions in\ncyberspace on the international level by promoting\nconfidence building measures (CBMs)[3].\n\n3 Abbreviations are listed in Section 8 at the end of the document.\n\n\n-----\n\n## 2 Background and chronology\n\nThis section explores the historical background\nand the chronology of the events in the lead-up to the\ndiscovery of the Stuxnet worm and subsequent\ninvestigations. This analysis of events is important for\nunderstanding the context in which Stuxnet was\ndeveloped and used against the Iranian nuclear program\nand why it was used at that particular moment.\n\nStuxnet was discovered in the difficult context of\nexisting tensions between Iran and the USA. The\nsituation was strained by Iran trying to develop nuclear\nenergy and possibly nuclear weapons, with\ncircumstances even deteriorating to the point that Israel\nwas ready to physically intervene to stop the Iranian\nnuclear program.\n\n**Date** **Events**\n29.01.2002 George Bush gives his famous state-ofthe-union speech to US Congress\ndescribing North Korea, Iran and Iraq as\nan “axis of evil” for seeking to develop\nweapons of mass destruction (The\nEconomist, 2002).\n08.2002 An Iranian dissident group discloses\nthat their government is enriching\nuranium in its nuclear facility at Natanz.\nThe USA reacts by asserting that Iran is\ntrying to develop nuclear weapons.\n02.2003 Iran acknowledges that it is enriching\nuranium at Natanz. Inspectors from the\nInternational Atomic Energy Agency\n(IAEA) subsequently visit the nuclear\nplant for the first time and continue to\nvisit the facility on a regular basis\nafterwards.\n2006 The international community launches\ndiplomatic discussions to encourage\nIran to stop its nuclear program.\nHowever, Iran proves uncooperative\nand is subjected to new international\nsanctions as a result. These in turn\nexacerbate the existing tensions\nbetween the USA and Iran (Davenport,\n2016).\n\n\n06.2010 VirusBlockAda, an antivirus company\nbased in Belarus, discovers the Stuxnet\nworm after the company receives a\nsample of malware causing a computer\nin Iran to continually reboot itself. This\nmalicious software surprises the\nspecialists because of its use of a zeroday exploit, which is unusual for a\ncomputer worm (Zetter, 2011a).\nNormally, worms exploit flaws in\nwebpages or bugs in genuine software\nto infect a computer (Barwise, 2010).\n12.07.2010 The news of the discovery of a\ncomputer worm using a zero-day\nexploit goes public, and the antivirus\nand technology communities start to\nreverse-engineer and investigate this\npeculiar malware. At this time, it is\nbelieved that Stuxnet is a tool for\nindustrial espionage. Its sophistication\nsuggests that significant resources\nwere invested in its development\n(Zetter, 2011a).\n08.2010 The antivirus firm Symantec reveals\nthat the purpose of the worm is to\nsabotage and not to spy (Zetter,\n2011a), noting also that about 60% of\ninfected computers worldwide are\nlocated in Iran, which leads them to\nbelieve that the worm’s spread may\nhave originated there (Matrosov et al.,\n2010, p. 15). Indeed, experts retrace\nthe origin of the spread to five\norganizations in Iran, confirming that\nthe country was the starting point and\nprobably also the target of the\ninfections (Lindsay, 2013, p. 380).\nDuring the same period, it is also found\nthat Stuxnet’s Command and Control\n(C&C) servers lose connection with the\ninfected computers in Iran. Experts\nbelieve that this disconnection means\nthat Iran is trying to deal with the worm\nand to contain its spread (Zetter,\n2011b).\nThe Bushehr power plant in Iran is\nsupposed to launch its nuclear energy\nsection but is delayed. According to\nIranian officials, the delay is caused by\nan unspecified technical problem\n(Collins and McCombie, 2012, p. 85).\n\n|Date|Events|\n|---|---|\n|29.01.2002|George Bush gives his famous state-of- the-union speech to US Congress describing North Korea, Iran and Iraq as an “axis of evil” for seeking to develop weapons of mass destruction (The Economist, 2002).|\n|08.2002|An Iranian dissident group discloses that their government is enriching uranium in its nuclear facility at Natanz. The USA reacts by asserting that Iran is trying to develop nuclear weapons.|\n|02.2003|Iran acknowledges that it is enriching uranium at Natanz. Inspectors from the International Atomic Energy Agency (IAEA) subsequently visit the nuclear plant for the first time and continue to visit the facility on a regular basis afterwards.|\n|2006|The international community launches diplomatic discussions to encourage Iran to stop its nuclear program. However, Iran proves uncooperative and is subjected to new international sanctions as a result. These in turn exacerbate the existing tensions between the USA and Iran (Davenport, 2016).|\n\n|06.2010|VirusBlockAda, an antivirus company based in Belarus, discovers the Stuxnet worm after the company receives a sample of malware causing a computer in Iran to continually reboot itself. This malicious software surprises the specialists because of its use of a zero- day exploit, which is unusual for a computer worm (Zetter, 2011a). Normally, worms exploit flaws in webpages or bugs in genuine software to infect a computer (Barwise, 2010).|\n|---|---|\n|12.07.2010|The news of the discovery of a computer worm using a zero-day exploit goes public, and the antivirus and technology communities start to reverse-engineer and investigate this peculiar malware. At this time, it is believed that Stuxnet is a tool for industrial espionage. Its sophistication suggests that significant resources were invested in its development (Zetter, 2011a).|\n|08.2010|The antivirus firm Symantec reveals that the purpose of the worm is to sabotage and not to spy (Zetter, 2011a), noting also that about 60% of infected computers worldwide are located in Iran, which leads them to believe that the worm’s spread may have originated there (Matrosov et al., 2010, p. 15). Indeed, experts retrace the origin of the spread to five organizations in Iran, confirming that the country was the starting point and probably also the target of the infections (Lindsay, 2013, p. 380). During the same period, it is also found that Stuxnet’s Command and Control (C&C) servers lose connection with the infected computers in Iran. Experts believe that this disconnection means that Iran is trying to deal with the worm and to contain its spread (Zetter, 2011b). The Bushehr power plant in Iran is supposed to launch its nuclear energy section but is delayed. According to Iranian officials, the delay is caused by an unspecified technical problem (Collins and McCombie, 2012, p. 85).|\n\n\n-----\n\n## 3 Description\n\nThis Section first describes the specificities and\nfeatures of the Stuxnet worm and looks into the\ntechnical details that make this piece of malware so\nspecial. Second, it describes the particularities of\nStuxnet’s target and how it was infected. Finally, it looks\nat the identity and origin of the possible developers of\nStuxnet and why they would have created such a tool.\n\n### 3.1 Tool\n\nStuxnet is the name of a specific worm, i.e. a\npiece of computer malware that targets supervisory\ncontrol and data acquisition (SCADA) systems in\nindustrial controllers. It is difficult, if not impossible, to\nknow exactly how the malware was developed, but\nthere can be no doubt that its development required\nconsiderable resources in manpower, time and finance.\nSpecialists evaluating the development of the worm\nestimate it must have required a team of five to ten\nprogrammers working full-time for at least six months\n(Chen and Abu-Nimeh, 2011, p. 92).\n\nStuxnet is sizeable – larger than comparable\nworms – and it was written in several different\nprogramming languages with some encrypted\ncomponents[4] (Chen, 2010, p. 3). It exploited not one but\nfour zero-day vulnerabilities to infect computers: an\nautomatic process from connected USB drives, a\nconnection with shared printers, and two other\nvulnerabilities concerning privilege escalation. The latter\nis a computer process that allowed the worm to execute\nsoftware in computers even when they were on lockdown (Naraine, 2010). Stuxnet looked to infect\ncomputers running the Microsoft Windows operating\nsystem via one of these vectors. When it identified an\nopening, it used valid, but stolen, driver certificates from\nRealTek and JMicron to download its rootkit. Using\nthese driver certificates, the worm was then able to\nsearch for the Siemens Simatic WinCC/Step-7 software,\na program used to control industrial equipment (Falliere\net al., 2011, p. 33; Matrosov et al., 2010, p. 68). By\ninfecting files used by this software, the worm was able\nto access and control the Programmable Logic\nControllers (PLCs), i.e. small computers used to regulate\npower in industrial devices (De Falco, 2012, p. 6).\nFurthermore, the worm was also able to communicate\nwith other infected machines and C&C servers in\nDenmark and Malaysia in order to update itself and\ntransmit information about what it had found (Chen and\nAbu-Nimeh, 2011, p. 93).\n\nOnce all these requirements were met, Stuxnet\nlaunched its attack by changing the speed of the\n\n|09.2010|Iranian officials admit that some personal computers from employees at the Bushehr nuclear plant are infected by a computer virus. They accuse Western countries of being behind the attack (Farwell and Rohozinski, 2011, p. 25).|\n|---|---|\n|11.2010|Iran stops its enrichment of uranium in the nuclear plant of Natanz completely without giving any reason (Farwell and Rohozinski, 2011). It is later assumed that this was an attempt to purge the power plant of Stuxnet. Later, the head of Iran’s Atomic Energy Organization, and acting Foreign Minister at the time, admits that a computer virus has infected Iranian nuclear installations (Albright et al., 2010).|\n|12.2010|The Institute for Science and International Security (ISIS), a US-based non-profit institution that has monitored the evolution of the Iranian nuclear program since the 1990s, confirms that the Stuxnet worm is programmed to target elements configured in the same manner as the Natanz centrifuges.|\n\n\n4 See the annex 1 in Section 6 for a comparison table between the\ntechnical nature of a conventional worm and Stuxnet.\n\n\n-----\n\ncentrifuges’ rotors, causing irreparable damage\n(Langner, 2013, p. 5).\n\n### 3.2 Target\n\nThe target of Stuxnet appears to have been the\nIranian nuclear plant and uranium enrichment site in\nNatanz. The fact that Stuxnet was programmed to target\ndevices organized in groups of 164 objects and Natanz’s\ncascades were arranged in 164 centrifuges was probably\nnot a coincidence (Albright et al., 2010; Broad and\nSanger, 2010). The power plant in Bushehr may also\nhave been a major target, but it enriches plutonium and\ntherefore requires a different configuration of\ncentrifuges (Farwell and Rohozinski, 2011, p. 25). Iran\nuses IR-1 centrifuges, a European model from the late\n1960s and early 1970s, which are both inefficient and\nnow obsolete (Langner, 2013, pp. 5–6). These\ncentrifuges are also fragile, and an abrupt change of\nspeed can cause damage or even breakage. The creators\nof Stuxnet were aware of this flaw and exploited it.\n\nThe nuclear plant of Natanz has an air-gapped,\nclosed computer network, which means that it does not\nhave a connection to the Internet or other networks. It\nis therefore highly probable that Stuxnet infected the\nnetwork through the vector of a removable USB drive\n(De Falco, 2012, p. 3), meaning that the creators of the\nworm required a person to deliver the worm and infect\nthe network.\n\n### 3.3 Attribution and actors\n\nSeveral antivirus experts have asserted that only\na state could have developed Stuxnet because of its level\nof complexity, resource investment, and the fact it\nseemed to be specifically designed to target the\ncentrifuges in Natanz (De Falco, 2012, p. 26). What is\ncertain is that the creators of the worm had extensive\nknowledge about the Iranian facilities, machines and\ncomputer programs. They also needed a testing ground\nto be able to verify that their target-oriented malware\nwas doing what it was designed to do (Langner, 2013, p.\n20).\n\nThe Iranians accused the West and more\nprecisely NATO of being behind the attack (Collins and\nMcCombie, 2012, p. 87). Nevertheless, experts claimed\nthat both the evidence and the motive pointed to the\nUSA and Israel as the perpetrators (Lindsay, 2013, p.\n366; Nakashima and Warrick, 2012; Rosenbaum, 2012;\nZetter, 2011a). There is speculation as to whether Israel\nwas involved in the development of the malware, with\nexperts from Symantec claiming they saw some\nevidence of the country’s involvement in the coding\nlines (Zetter, 2011a). This was suggested by the\npresence of the word “myrtus” in the code, for example,\nwhich was the name of the file where the worm was\nstored while it was being developed. This word is\n\n\nbelieved to be a reference to Queen Esther, who saved\nthe Jews from a massacre by the Persians according to\nthe Bible and whose name in Hebrew refers to the word\n“myrtle” (Zetter, 2011a). The involvement of Israel in the\ndevelopment of Stuxnet remains uncertain, and any\nevidence pointing in that direction may have been\nplanted to mask the identity of the real perpetrator.\nHowever, Richard Clarke, the former US National\nCoordinator for Security, Infrastructure Protection and\nCounter-terrorism, argued that if the USA had\ndeveloped Stuxnet, Israel may have assisted in the\nproject by providing a testing site with a sample similar\nto the IR-1 centrifuge (De Falco, 2012, p. 26;\nRosenbaum, 2012).\n\nThe New York Times journalist David E. Sanger\nreported in his book that the USA conducted a covert\ncyber-campaign, named Operation Olympic Games,\nagainst Iranian nuclear facilities. It is believed that\nStuxnet was one piece of malware developed and\nlaunched in the context of this operation. The campaign\nmost likely began in 2006 under the Bush administration\nand would have been intensified under US President\nObama (Zetter, 2011a). The operation was unlikely to\nhave been limited to cyberspace. The assassinations of\nIranian scientists in 2010 and 2011 that were attributed\nto the USA and Israel suggest that Stuxnet was only one\ncomponent of a larger operation aimed at slowing down\nor stopping Iran’s development of nuclear technology\n(De Falco, 2012). It is also believed that the covert cyberoperation was an agreed concession to avoid an Israeli\nairstrike on Iranian nuclear facilities. Previously,\nPresident Bush had refused to allow Israeli jets to cross\nthe Iraqi border to strike Iranian nuclear installations (De\nFalco, 2012, p. 54; Lindsay, 2013, p. 366).\n\nAlternatively, Farwell and Rohozinski (2011)\nargue that Stuxnet’s patchwork design indicates that\nStuxnet could have been developed, at least in part, by\nthe cybercrime sector, specifically the Russian offshore\nprogramming community. They explain that some\nelements of the worm’s code feature the same design as\ncode written by the cybercrime community. They assert\nthat the USA still would have been the main developer,\nbut that it could have outsourced the development of\ncertain parts of Stuxnet to these groups.\n\nThere is also the possibility that Russia\nperpetrated the attack. Russian workers had access to\nnuclear facilities in Iran as part of a Russo-Iranian\ncooperation at the Bushehr nuclear site. Russia has the\ncapabilities to develop such malware, and its motive\nmay have been to prevent Iran from enriching its own\nuranium by damaging the country’s nuclear sites with\nStuxnet. As a consequence, Iran would have had no\nchoice but to buy enriched uranium from Russia (De\nFalco, 2012, p. 28).\n\nThere will always be uncertainties when it comes\nto attribution in cyberspace. Attribution would normally\nfollow the “cui bono” (to whose benefit) logic. However,\nit is difficult, if not impossible, to prove that a particular\n\n\n-----\n\nactor that seems to be the perpetrator is indeed the\nperpetrator. In the case of Stuxnet, most evidence\npoints towards the USA as the main instigator of the\ndevelopment and release of Stuxnet. Indeed, the USA\nwould have delayed the uranium enrichment program\nand avoided a war between Iran and Israel with Stuxnet.\nEven so, the involvement of Israel or Russia remains a\npossibility and, as is often the case in covert operations\nand cyberattacks, nothing can be confirmed beyond any\ndoubt.\n\n\n## 4 Effects\n\nFirst, this Section analyzes the social and\ndomestic political effects resulting from the Stuxnet\nattack on the Natanz power plant. Second, it examines\nhow the malware impacted the Iranian economy. Third,\nit studies the effects of the worm in the technological\nrealm. Finally, it looks into the impacts of the discovery\nof Stuxnet at the international level.\n\n### 4.1 Social and political effects\n\nOn the domestic political level, the cyberattack\ndiscredited the Iranian government, as the Iranian\nauthorities were not able to protect their nuclear\nfacilities against a foreign cyberattack. The Iranian\ngovernment seemed indecisive on how to officially react\nto the news that a computer worm might have infected\nits nuclear facilities. In September 2010, the Iranian\nauthorities first played down the impact of the attack in\ntheir discourse, probably to avoid blame from the\nIranian population, by stating that only personal\ncomputers without connections to the nuclear facility of\nBushehr were infected and by designating the West and\nNATO as perpetrators. Two months later, they admitted\nthat the worm had been active in their nuclear plants for\nmore than a year. However, they did not stay passive\nand worked intensively to contain and remove the\nworm, and to identify the attackers (Zetter, 2011b). At\nthe same time, Iranian authorities did not retaliate\nagainst the cyberattacks because the identity of the\nperpetrators was unknown or unclear and because\nthere was no precedent on how a state should respond\nto such an attack. This inaction made the Iranian\ngovernment look weak and appear as an easy target.\n\nStuxnet had almost no direct effects on the\nIranian population or society itself. The worm was\ndesigned to avoid collateral damage (Rosenbaum,\n2012). If the attack had caused collateral damage or had\nhad more powerful effects, including the potential loss\nof human lives, it might have been interpreted as a use\nof force and might have led to an escalation of violence\nbetween Iran and the countries it believed to be\nresponsible (Collins and McCombie, 2012, p. 88;\nRosenbaum, 2012). The biggest impact of Stuxnet on\nsociety was likely a feeling of insecurity, as an intrusion\ninto a private domain is never taken lightly, and it can\ntherefore be assumed that Iranians felt betrayed by the\ncountry’s ineffective cybersecurity measures and its\nweak stance in regard to the perpetrators. The infection\nof Iranian networks proved that even though air-gapped\nnetworks are usually more secure than other networks,\nthey cannot be considered secure enough (Zetter,\n2014). Although the worm only targeted Iranian nuclear\nfacilities the fact that the malware spread to other\n\n\n-----\n\ncomputers around the world contributed to a global\nfeeling of insecurity.\n\n### 4.2 Economic effects\n\nThis attack also had direct economic effects for\nIran. As Iran is subject to international embargoes, it\ndoes not have access to international markets for buying\nnuclear-related materials. In particular, it cannot buy\ncentrifuges and therefore builds them itself, sometimes\nwith foreign components. The resulting patchwork of\nmaterials may be one of the reasons for the quick\ndeterioration of the centrifuges. Being under embargo\nalso means that Iran has very limited resources, and the\nbreakage of almost 1,000 centrifuges added pressure on\nstocks of materials and budgets. From a cost-benefit\nperspective, the poor returns in terms of productivity of\nthe Natanz nuclear plant may also have added pressure\non government finances, as enriched uranium needed to\nbe purchased from other countries.\n\nThe cyberattack also had long-term economic\nrepercussions for Iran as it needed to manage delays in\nthe production of low-enriched uranium. Establishing\nnew security and cybersecurity measures in nuclear\nfacilities to avoid the recurrence of an attack such as\nStuxnet would also have required a significant financial\ninvestment. For example, Iran created a new cyberunit\nin the Revolutionary Guard Corps to address\ncyberattacks in November 2011 (Fogarty, 2011). This\nunit is likely to have been behind the cyberattacks of\nMarch 2011 in the USA. A US company selling digital\nauthentication certificates, Comodo, accused Iran of\nattempted cyberattacks on several US companies,\nincluding Google and Microsoft (Lindsay, 2013, p. 397;\nMorton, 2013; Peckham, 2011). This attack may have\nbeen in retaliation for the Stuxnet attack, but even\nthough it seemed to originate from Iran, there was\nnothing to prove that it was perpetrated by the new\ncyberunit. According to the NSA, Iran may also have\nbeen behind the Shamoon attack, which involved a\nworm launched in August 2012 to wipe computers\ninside the Saudi oil company Aramco (Zetter, 2015).\n\n### 4.3 Technological effects\n\nThe most direct and only physical effect of\nStuxnet was the damage caused to the centrifuges. The\nmalware, which was clearly designed to affect the\nnuclear facility in Natanz, was believed to affect the\nspeed of the centrifuges, causing them to alternate\nbetween high and low speeds (Farwell and Rohozinski,\n2011, pp. 24–25). This change in speed was masked by\nthe worm’s rootkit, making the operators believe that\nthe centrifuges were operating at their normal speed.\nThe change of speed would have caused the centrifuges\nto wear out faster and suffer damage beyond repair.\nNatanz had between 6,000 and 9,000 operating\n\n\ncentrifuges at the time, about 1,000 of which needed to\nbe replaced (De Falco, 2012, p. 23; Nakashima and\nWarrick, 2012). IAEA experts assessing the plants noted\nthat Iran replaced about 10% of its centrifuges each year\ndue to breakage, but exchanged slightly more\ncentrifuges than usual between mid-2009 and mid-2010\n(Nakashima and Warrick, 2012). ISIS reported that the\nlevel of production of low enriched uranium remained\nsteady and even increased during the period of the\nStuxnet attack. However, production levels were less\nefficient as they could have been with fully working\ncentrifuges. In other words, the output of low enriched\nuranium only increased because of accelerated working\ncycles to compensate for the loss of the damaged\ncentrifuges. Even by February 2010, production levels\nwere still lower than before the attack in November\n2009. It took Iran approximately one year to recover\nfully from the effects of the Stuxnet attack and to return\nto a level of production comparable to November 2009\n(Albright et al., 2010).\n\nTaking these observations into account, the\nphysical consequences of Stuxnet were rather limited,\nbut it was probably designed to remain hidden for a\ncertain amount of time, damage the centrifuges and\nthen disappear (Nakashima and Warrick, 2012). Its\ndiscovery probably interrupted the process and\nterminated the operation prematurely. However, the\nfact that the number of damaged centrifuges was only\nslightly higher than usual lends strength to the\npossibility that the damage might have been caused by\npoor manufacturing or normal wear (Albright et al.,\n2010).\n\nThe Stuxnet attack also directly affected the\ntechnology sector. Companies that had developed\nsoftware with vulnerabilities that were exploited to\ninfect and control the computers in Iran were forced to\nreact in order to contain the malware. Microsoft issued\npatches to solve the relevant zero-day exploits, and\nSiemens offered patches and removal tools to\ncustomers to remove Stuxnet in the months following\nthe discovery of the malware (Langner, 2011, p. 50;\nLindsay, 2013, p. 391). Verisign also reacted within\nweeks by revoking the stolen RealTek and JMicron\ncertificates that were used to trick infected computers\ninto accepting the worm as a legitimate program\n(Lindsay, 2013, p. 394; Matrosov et al., 2010, p. 19).\nInaction by these multinational companies would have\ncaused their customers to lose confidence in their ability\nto produce secure software and technologies.\nMoreover, stricter rules for the management of driver\ncertificates and other digital key systems have since\nbeen issued to prevent the recurrence of malware using\nstolen certificates (De Falco, 2012, p. 37).\n\nLong-term technological consequences of\nStuxnet are evident in Iranians approaching technical\nmalfunctions in their facilities with a greater degree of\nmistrust, as any bug or breakdown may raise suspicion\nabout another cyberattack on Iranian systems. Iran later\n\n\n-----\n\ndiscovered two additional pieces of malware operating\nstealthily in its networks, namely Duqu and Flame.\n\n### 4.4 International effects\n\nAt the international level, the cyberattack\nsucceeded in delaying the Iranian uranium-enrichment\nprogram for a short period of time and thus slightly\nalleviated associated international tensions. Indeed, it\nseems that the resulting delays in the program\nreassured Israel sufficiently so that it would not risk\nlaunching an airstrike to physically halt enrichment\n(Lindsay, 2013, p. 385).\n\nAt the international level, the developer of\nStuxnet, even if its identity remains uncertain, showed\nthat it is possible to build a highly sophisticated,\noffensive cybertool, and that perpetrators have the\nresources to accomplish such an attack. Moreover, this\ncase demonstrates that separating a critical\ninfrastructure network from the internet can no longer\nbe considered an adequate security measure. States\nhave realized that they need to take action in order to\navoid falling victim to attacks of this nature. Several\nstates, including Iran, subsequently invested in\ncybersecurity or created military cyberunits and/or\ncenters to build up their capabilities in case of an\nupcoming cyberwar. Some states also started to review\nand update their cyber strategies to cover critical\ninfrastructures and strengthen their ability to legally\nrespond to cyberattacks (Dunn Cavelty, 2012, pp. 150–\n151).\n\nAnother consequence of the Stuxnet cyberattack\nwas the fact that the worm leaked and spread to other\ncomputers outside Iran. Having the malware in the wild\nmeant that anybody with the right competences would\nbe able to reverse-engineer it, modify it to suit other\npurposes, sell it or use it (Collins and McCombie, 2012,\np. 89). The possibility of criminal or terrorist groups\nstarting to use such tools for their own purposes has\nbeen particularly concerning. As a result, the ability to\nactively protect systems has also been included in\nstates’ defense policies, strategies, expenses and\ndiscourses. However, this threat has never materialized\nto date. Stuxnet’s code has not been modified and used\nfor other purposes since it was discovered in 2010.\nModified versions of Stuxnet have not emerged because\nit is not possible to simply copy a piece of malware; it\nrather needs to be reprogrammed to match new targets,\nand finding the necessary resources to achieve this is a\nmajor challenge. Moreover, zero-day exploits used by\nStuxnet ceased to be zero-day vulnerabilities the\nmoment they were discovered. As a consequence, if\nperpetrators wanted to reuse Stuxnet’s code, they\nwould have to find new zero-day exploits, which would\ntake time and resources.\n\n\n## 5 Policy Consequences\n\nThis Section examines the consequences that can\nbe derived from the discovery of Stuxnet. These\nconsequences are presented as recommendations for\nstate actors.\n\n### 5.1 Improving Cybersecurity\n\nStates may wish to focus on improving their\ncybersecurity to avoid situations such as Stuxnet\nreoccurring. The case of the Stuxnet worm showed that\ninfecting computers by means of a USB drive is effective\nas a means of targeting air-gapped networks. Therefore,\nstates should particularly focus on computer users and\nthe issue of using unknown USB drives. States can run\nspecific awareness-building campaigns on this issue for\nworkers in critical infrastructures in order to improve\nusers’ understanding of the risks and possible damage\nthat such behavior can cause. This would hopefully\npromote a more cautious approach to this issue.\n\nStates can also improve their cybersecurity by\ncreating a standard operating procedure for a simplified\nand adequate way to respond to a cyberattack. A\nrelevant procedure could address the technical level\nwith cybersecurity experts acting rapidly to solve\ntechnical problems resulting from an attack and to\nreturn work cycles to normal as quickly as possible after\nan attack. Also, when Iran recognized that it had been\ntargeted by a cyberattack, there seemed to have been\nconfusion among the Iranian authorities on how to\nrespond to the attack politically. Therefore, a standard\noperating procedure at the political level could also\nprovide useful guidance for authorities on how to\nrespond to a cyberattack perpetrated by another state,\nprovided that attribution can be confirmed and the\nrequired resources are available.\n\n### 5.2 Integration of critical infrastructures in cyber strategy\n\nThe damage caused by Stuxnet to the Iranian\ncentrifuges showed that critical infrastructures can be\ntargeted by cyberthreats. The fact that the Natanz\nnetworks were separated from other networks did not\nsufficiently protect them against the malware. As a\nconsequence, states should take into account that\ncritical infrastructures should be integrated in\ncybersecurity strategies. Relevant considerations would\nresult in increased protection against cyberthreats and\nhigher cybersecurity standards and at the same time\npromote closer cooperation between governments and\nactors - whether public or private – who manage these\ninfrastructures. The goal would be to increase\nprotection against cyberthreats, while also increasing\nresilience in case of cyberattacks.\n\n\n-----\n\n### 5.3 Establishment of cybersecurity standards for industrial equipment\n\nStates may wish to promote international\ncybersecurity standards for industrial equipment. The\nincident of the Stuxnet worm has shown that industrial\nequipment such as SCADA systems often suffers from\nweak cybersecurity standards and is open to attack\nwhen connected to the internet. To diminish the risk of\nthese vulnerabilities being exploited, states could\npromote technical standards indicating the level of\ncybersecurity of connected equipment at the\ninternational level. States could then decide to only use\nconnected equipment that meets the most stringent\nstandards in critical infrastructures. States could also\nrecommend that operators of critical infrastructures not\nconnect SCADA systems to the internet, as air-gapped\nnetworks remain appropriate for avoiding infection.\n\n### 5.4 Promotion of international Confidence Building Measures (CBMs)\n\nStates may wish to reduce mistrust and\nmisperceptions in cyberspace by promoting\ninternational CBMs. These measures could subsequently\nalso be used to support the development of\ninternational norms for cyberspace. So far, states have\nonly agreed to apply international law to states’\nactivities in cyberspace, respecting principles such as\nproportionality or avoiding civilian casualties. However,\nthe difficulties inherent in the attribution of cyber\nactivities increase ambiguities and mistrust among\nstates. CBMs could be a first step towards more\ntransparency and better international relations. CBMs\ncould be developed at the bilateral level or at regional\nor international levels in fora or international\norganizations. Stauffacher and Kavanagh (2013)\nsuggested a series of such measures for cybersecurity,\nwhich consist of: transparency measures, compliance\nindicators and transparency monitoring measures,\ncooperative measures, communication and\ncollaborative mechanisms and restraint measures.\nStates could then expand such measures into\ninternational norms or treaties.\n\n\n-----\n\n## 6 Annex 1\n\nComparison table between Stuxnet and other worms\n(Chen and Abu-Nimeh, 2011, p. 91):\n\n**Features** **Stuxnet** **Usual worm**\n\nOnly Siemens\n\nComputers\n\nTarget Simatic/Step-7\n\nIndiscriminately\n\nsoftware\n\nApprox. 100\nSize 500 kilobytes\nkilobytes\n\nRemovable\n\nInfection\n\nUSB drives or Internet\n\nvectors\n\nshared printers\n\nExploited\n\nFour zero-day One zero-day\n\nvulnerability\n\nexploits exploit\n\nto infect\n\nMost of the time\n\nAffect Iranian\nPurpose spread or install\ncentrifuges\n\na backdoor\n\n## 7 Glossary\n\nAir-gapped network: A security measure that implies\nphysical separation between a network and the\nInternet or other unsecure local networks\n(Zetter, 2014).\nCascade: Centrifuges are organized in groups that are\ncalled “cascades” in uranium enrichment\nprocesses (Langner, 2013).\nCentrifuge: A centrifuge is a cylinder with a rotating\nrotor into which uranium is fed in the form of\nisotopic gas. The goal is to use centrifugal force\nto separate heavier from lighter gas. The former\nbecomes depleted and the latter enriched\nuranium (Institute for Science and international\nSecurity, n.d.).\nCommand and Control (C&C): A server through which\nthe person controlling malware communicates\nwith it in order to send commands and retrieve\ndata (QinetiQ Ltd, 2014, p. 2).\nConfidence Building Measures (CBMs): Various\nprocedures that can be established to build trust\nand prevent escalation between state actors\n(United Nations, n.d.).\nDriver certificate: Certification issued by firms to\nauthenticate their drivers and let computers\nknow that software is genuine (Matrosov et al.,\n2010).\nDuqu: Worm discovered in 2011, whose goal was to\nsteal information (Kushner, 2013).\nFlame: Worm discovered in 2012 used to gather\ninformation in countries in the Middle East\n(Kushner, 2013).\n\n\nLow enriched uranium: Essential element to make\nnuclear fuel (International Atomic Energy\nAgency, 2017).\nMalware: Malicious software that can take the form of a\nvirus, a worm or a Trojan horse (Collins and\nMcCombie, 2012).\nPatch: An update for software that repairs one or more\nidentified vulnerability(ies) (Ghernaouti-Hélie,\n2013, p. 437).\nPrivilege escalation: Function allowing a remote\ncomputer user to access another computer’s\nsystem by using a guest account (Matrosov et al.,\n2010).\nProgrammable Logic Controllers (PLCs): Small\ncomputers controlling electrical functions in\nhardware such as switches (Collins and\nMcCombie, 2012).\nRootkit: Program downloading itself in an infected\nsystem and taking control of certain functions\n(Lindsay, 2013).\nShamoon: Computer virus targeting computers from the\nenergy sector in the Middle East. The Saudi\nArabian national oil company Aramco was\nparticularly affected by the attack. The virus\nwipes the files from an infected computer\nrendering it unusable (BBC News, 2012).\nSiemens Simatic WinCC/Step-7 software: Industrial\nsoftware serving as human-machine interface\n(Lindsay, 2013)\nSupervisory Control And Data Acquisition (SCADA):\nComputer programs used to control industrial\nprocesses (Langner, 2013, p. 9)\nWorm: Standalone, self-replicating program infecting\nand spreading to other computers through\nnetworks (Collins and McCombie, 2012).\nZero-day exploit / vulnerabilities: Security vulnerabilities\nof which software developers are not aware and\nwhich can be used to hack a system (Karnouskos,\n2011).\n\n|Features|Stuxnet|Usual worm|\n|---|---|---|\n|Target|Only Siemens Simatic/Step-7 software|Computers Indiscriminately|\n|Size|500 kilobytes|Approx. 100 kilobytes|\n|Infection vectors|Removable USB drives or shared printers|Internet|\n|Exploited vulnerability to infect|Four zero-day exploits|One zero-day exploit|\n|Purpose|Affect Iranian centrifuges|Most of the time spread or install a backdoor|\n\n\n-----\n\n## 8 Abbreviations\n\n\n## 9 Bibliography\n\nAlbright, D., Brannan, P., Walrond, C., 2010. Did\nStuxnet take out 1,000 Centrifuges at the\nNatanz Enrichment plant? Institute for Science\nand International Security.\nBarwise, M., 2010. What is an internet worm? [WWW\nDocument]. Webwise. URL\nhttp://www.bbc.co.uk/webwise/guides/intern\net-worms (accessed 20.10.16).\nBBC News, 2012. Shamoon virus targets energy sector\ninfrastructure [WWW Document]. BBC News.\nURL http://www.bbc.com/news/technology19293797 (accessed 8.11.16).\nBroad, W.J., Sanger, D.E., 2010. Worm Was Perfect for\nSabotaging Centrifuges [WWW Document]. N.\nY. Times. URL\nhttp://www.nytimes.com/2010/11/19/world/\nmiddleeast/19stuxnet.html (accessed\n20.10.16).\nChen, T., 2010. Stuxnet, the real start of cyber warfare?\n\n[Editor’s Note. IEEE Netw. 24, 2–3.\nhttps://doi.org/10.1109/MNET.2010.5634434\nChen, T.M., Abu-Nimeh, S., 2011. Lessons from Stuxnet.\nComputer 44, 91–93.\nhttps://doi.org/10.1109/MC.2011.115\nCollins, S., McCombie, S., 2012. Stuxnet: the emergence\nof a new cyber weapon and its implications. J.\nPolic. Intell. Count. Terror. 7, 80–91.\nhttps://doi.org/10.1080/18335330.2012.6531\n98\nDavenport, K., 2016. Timeline of nuclear Diplomacy\nWith Iran [WWW Document]. Arms Control\nAssoc. URL\nhttps://www.armscontrol.org/factsheet/Timel\nine-of-Nuclear-Diplomacy-With-Iran#2006\n(accessed 19.10.16).\nDe Falco, M., 2012. Stuxnet Facts Report: A Technical\nand Strategic Analysis. NATO Cooperative\nCyber Defence Centre of Excellence, Tallinn.\nDunn Cavelty, M., 2012. The Militarisation of\nCyberspace: Why Less may Be Better, in: 2012\n4th International Conference on Cyber Conflict\n(CYCON 2012): Tallinn, Estonia, 5 - 8 June\n2012. IEEE, Piscataway, NJ, pp. 141–153.\nFalliere, N., O Murchu, L., Chien, E., 2011. W32.Stuxnet\nDossier (No. 1.4). Symantec Security Response.\nFarwell, J.P., Rohozinski, R., 2011. Stuxnet and the\nFuture of Cyber War. Survival 53, 23–40.\nhttps://doi.org/10.1080/00396338.2011.5555\n86\nFogarty, K., 2011. Iran responds to Stuxnet by\nexpanding cyberwar militia [WWW\nDocument]. ITworld. URL\nhttp://www.itworld.com/article/2746341/sec\nurity/iran-responds-to-stuxnet-by-expandingcyberwar-militia.html (accessed 19.10.16).\n\n|C&C|Command and Control|\n|---|---|\n|CBMs|Confidence Building Measures|\n|IAEA|International Atomic Energy Agency|\n|IP|Internet Protocol|\n|ISIS|Institute for Science and international Security|\n|NATO|North Atlantic Treaty Organization|\n|PLCs|Programmable Logic Controllers|\n|SCADA|Supervisory Control And Data Acquisition|\n\n\n-----\n\nGhernaouti-Hélie, S., 2013. Cyberpower: crime, conflict\nand security in cyberspace, 1. ed. ed, Forensic\nsciences. EPFL Press, Lausanne.\nInstitute for Science and international Security, n.d.\nWhat is a Gas Centrifuge? [WWW Document].\nInst. Sci. Int. Secur. URL\nhttp://exportcontrols.info/centrifuges.html\n(accessed 20.10.16).\nInternational Atomic Energy Agency, 2017. What is\nLEU? [WWW Document]. Int. At. Energy\nAgency. URL\nhttps://www.iaea.org/topics/leubank/what-isleu (accessed 12.7.17).\nKarnouskos, S., 2011. Stuxnet worm impact on\nindustrial cyber-physical system security. IEEE,\npp. 4490–4494.\nhttps://doi.org/10.1109/IECON.2011.6120048\nKushner, D., 2013. The Real Story of Stuxnet [WWW\nDocument]. IEEE Spectr. URL\nhttp://spectrum.ieee.org/telecom/security/th\ne-real-story-of-stuxnet (accessed 18.10.16).\nLangner, R., 2013. To kill a centrifuge: a technical\nanalysis of what Stuxnet’s creators tried to\nachieve.\nLangner, R., 2011. Stuxnet: Dissecting a Cyberwarfare\nWeapon. IEEE Secur. Priv. Mag. 9, 49–51.\nhttps://doi.org/10.1109/MSP.2011.67\nLindsay, J.R., 2013. Stuxnet and the Limits of Cyber\nWarfare. Secur. Stud. 22, 365–404.\nhttps://doi.org/10.1080/09636412.2013.8161\n22\nMatrosov, A., Rodionov, E., Harley, D., Malcho, J., 2010.\n\nStuxnet Under the Microscope (No. 1.31).\nESET LLC.\nMorton, C., 2013. Stuxnet, Flame, and Duqu - the\nOLYMPIC GAMES, in: A Fierce Domain: Conflict\nin Cyberspace, 1986 to 2012. Cyber Conflict\nStudies Association, Vienna, VA, pp. 212–232.\nNakashima, E., Warrick, J., 2012. Stuxnet was work of\nU.S. and Israeli experts, officials say [WWW\nDocument]. Wash. Post. URL\nhttps://www.washingtonpost.com/world/nati\nonal-security/stuxnet-was-work-of-us-andisraeli-experts-officialssay/2012/06/01/gJQAlnEy6U_story.html\n(accessed 18.10.16).\nNaraine, R., 2010. Stuxnet attackers used 4 Windows\nzero-day exploits [WWW Document]. ZDNet\nEur. URL\nhttp://www.zdnet.com/article/stuxnetattackers-used-4-windows-zero-day-exploits/\n(accessed 18.10.16).\nPeckham, M., 2011. Iranian Government Accused in\nSerious Net Attack [WWW Document]. Time.\nURL\nhttp://techland.time.com/2011/03/24/iranian\n-government-accused-in-serious-net-attack/\n(accessed 19.10.16).\n\n\nQinetiQ Ltd, 2014. Command & Control:\nUnderstanding, denying, detecting. QinetiQ\nLtd.\nRosenbaum, R., 2012. Richard Clarke on Who Was\nBehind the Stuxnet Attack [WWW Document].\nSmithsonianmag.com. URL\nhttp://www.smithsonianmag.com/history/rich\nard-clarke-on-who-was-behind-the-stuxnetattack-160630516/?no-ist (accessed 19.10.16).\nStauffacher, D., Kavanagh, C., 2013. Confidence\nBuilding Measures and International Cyber\nSecurity. ICT4Peace, Geneva, Switzerland.\nThe Economist, 2002. George Bush and the axis of evil\n\n[WWW Document]. The Economist. URL\nhttp://www.economist.com/node/965664\n(accessed 18.10.16).\nUnited Nations, n.d. Military Confidence-building\n\n[WWW Document]. U. N. Off. Disarm. Aff. URL\nhttps://www.un.org/disarmament/cbms/\n(accessed 16.3.17).\nZetter, K., 2015. The NSA Acknowledges What We All\nFeared: Iran Learns From US Cyberattacks\n\n[WWW Document]. The Wired. URL\nhttps://www.wired.com/2015/02/nsaacknowledges-feared-iran-learns-uscyberattacks/ (accessed 19.10.16).\nZetter, K., 2014. Hacker Lexicon: What Is an Air Gap?\n\n[WWW Document]. Wired. URL\nhttps://www.wired.com/2014/12/hackerlexicon-air-gap/ (accessed 4.11.16).\nZetter, K., 2011a. How Digital Detectives Deciphered\nStuxnet, the Most Menacing Malware in\nHistory [WWW Document]. Wired. URL\nhttps://www.wired.com/2011/07/how-digitaldetectives-deciphered-stuxnet/ (accessed\n18.10.16).\nZetter, K., 2011b. Stuxnet Timeline Shows Correlation\nAmong Events [WWW Document]. Wired. URL\nhttps://www.wired.com/2011/07/stuxnettimeline/ (accessed 18.10.16).\n\n\n-----\n\nThe Center for Security Studies (CSS) at ETH Zurich is a center of competence for Swiss and\ninternational security policy. It offers security policy expertise in research, teaching and\nconsulting. The CSS promotes understanding of security policy challenges as a contribution\nto a more peaceful world. Its work is independent, practice-relevant, and based on a sound\nacademic footing.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Stuxnet/Hot Spot - Analysis of Stuxnet.pdf"
    ],
    "report_names": [
        "Hot Spot - Analysis of Stuxnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d7c5a1bf-85c9-4d2f-bdbd-1455f5f2ae65",
            "created_at": "2022-10-25T16:07:23.978074Z",
            "updated_at": "2025-03-27T02:02:10.059972Z",
            "deleted_at": null,
            "main_name": "Operation Olympic Games",
            "aliases": [
                "GOSSIPGIRL"
            ],
            "source_name": "ETDA:Operation Olympic Games",
            "tools": [
                "Stuxnet",
                "W32.Stuxnet"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535901,
    "ts_updated_at": 1743041749,
    "ts_creation_date": 1522070345,
    "ts_modification_date": 1522070345,
    "files": {
        "pdf": "https://archive.orkl.eu/cd0652f9007f4b90f1abba3df5454bd5d985ce3c.pdf",
        "text": "https://archive.orkl.eu/cd0652f9007f4b90f1abba3df5454bd5d985ce3c.txt",
        "img": "https://archive.orkl.eu/cd0652f9007f4b90f1abba3df5454bd5d985ce3c.jpg"
    }
}