{
    "id": "e3ba5ad4-c919-442e-b0db-9a4a8240ccfd",
    "created_at": "2023-01-12T15:03:49.908924Z",
    "updated_at": "2025-03-27T02:14:43.641155Z",
    "deleted_at": null,
    "sha1_hash": "e39a17e99954a19dda0fa3f7f32c133bf25fc161",
    "title": "2022-02-02 - Arid Viper APT targets Palestine with new wave of politically themed phishing attacks, malware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:29:15Z",
    "file_modification_date": "2022-05-28T15:29:15Z",
    "file_size": 1083746,
    "plain_text": "# Arid Viper APT targets Palestine with new wave of politically themed phishing attacks, malware\n\n**[blog.talosintelligence.com/2022/02/arid-viper-targets-palestine.html](https://blog.talosintelligence.com/2022/02/arid-viper-targets-palestine.html)**\n\nBy [Asheer Malhotra and](https://twitter.com/asheermalhotra) [Vitor Ventura.](https://twitter.com/_vventura)\n\nCisco Talos has observed a new wave of Delphi malware called Micropsia developed\nand operated by the Arid Viper APT group since 2017.\nThis campaign targets Palestinian entities and activists using politically themed lures.\nThe latest iteration of the implant contains multiple RAT and information gathering\ncapabilities.\n\n## Executive summary\n\nCisco Talos has identified a new wave of what is believed to be an ongoing campaign using\nthe Delphi malware since 2017. Talos believes with high confidence that this is the work of\nthe Arid Viper threat actor. This is a group believed to be based out of Gaza that's known to\ntarget organizations all over the world. The actor uses the Micropsia implant in the most\nrecent wave that started around October 2021.\n\nThis actor uses their Delphi-based Micropsia implant to target Palestinian individuals and\norganizations, using politically themed file names and decoy documents. The most recent\n[wave uses content originally published on the Turkish state-run news agency Anadolu and](https://www.aa.com.tr/en)\n[on the Palestinian MA'AN development center to target activists and Palestinian institutions.](https://www.maan-ctr.org/en/article/22/What-is-MA%25E2%2580%2599AN)\n\n\n-----\n\nThe tactics, techniques and procedures (TTPs) used in the most recent samples found by\nTalos lead us to believe this is a campaign linked to the previous campaign we reported on in\n[2017. Meta exposed this actor in an April 2021 report that focused mainly on mobile](https://about.fb.com/news/2021/04/taking-action-against-hackers-in-palestine/)\ntargeting operations. However, that did not stop the group, as they've continued to target\nWindows-based systems. Although this group hasn't technologically evolved, it has the\nmotivation and means to operate longstanding campaigns against the same targets. This\nlevel of motivation makes them particularly dangerous to organizations that may come into\ntheir crosshairs. An in-depth defense using protections against the several layers of their\ninfection chain is the best strategy to defend against this kind of threat. This should include\nemail security to detect and prevent their most common initial attack vector, along with Cisco\nSecure Endpoint if the implant is successfully delivered using novel attack vectors. On the\nnetwork side, Cisco Secure Firewall and Umbrella can be used to detect command and\ncontrol (C2) communications performed with new versions and variants of their implants.\n\n## Arid Viper threat actor\n\n[Arid Viper, also known as Desert Falcon or APT C-23, was first exposed in 2015. This threat](https://malpedia.caad.fkie.fraunhofer.de/actor/aridviper)\nactor's main motivation is espionage and information theft, and has been attributed to\nmalicious operators politically motivated towards the liberation of Palestine. Its victimology is\ndispersed all over the world, including Palestinian organizations and individuals. Arid Viper is\nnot a technically evolved actor, however, it is known to target mobile and desktop platforms,\nincluding Apple iOS. Their toolkit consists of Delphi packers and compilers around their\nstaple malware, Micropsia. This implant has also been ported to other platforms with\nversions based on Python and an Android version.\n\n## Campaign\n\nTalos has identified new waves of this campaign against Palestinian individuals and\norganizations. It uses the same TTPs that we published in our first report on this actor back\nin 2017. The image below shows an example of a lure used in 2019 — while the file name\nrefers to an annual report from 2018, the contents actually mention 2014 and 2015.\n\n\n-----\n\nExample of the decoy document from 2019.\n\nThe table below shows a small chronology of malicious implants masquerading as\ndocuments of interest being created with the same themes, which we associate with high\n\n\n-----\n\nconfidence to the same ongoing campaign.\n\nThe use of politically themed lures reduced during 2018 and 2019, but we observed a\ndefinite increase in their usage in 2020 and 2021. Talos also observed other themes being\nused by this group (to deliver Micropsia) during 2018 and 2019 and into 2020/21, but they\nwere not considered as part of this campaign in analysis and are beyond the scope of this\nresearch.\n\n### Most recent decoys\n\nThe politically motivated content in the decoy documents, along with the use of the Arabic\nlanguage, point to the victims being Palestinian individuals and organizations.\n\nThe most recent decoy document from September 2021 contains an article about the\n[reunification of Palestinian families, originally published by the Anadolu Agency on Sept. 3,](https://www.aa.com.tr/ar/%25D8%25A5%25D8%25B3%25D8%25B1%25D8%25A7%25D8%25A6%25D9%258A%25D9%2584/%25D9%2581%25D9%2584%25D8%25B3%25D8%25B7%25D9%258A%25D9%2586%25D9%258A%25D9%2588%25D9%2586-%25D9%258A%25D8%25AA%25D8%25B1%25D9%2582%25D8%25A8%25D9%2588%25D9%2586-%25D8%25AD%25D9%2584%25D9%2585-%25D8%25A7%25D9%2585%25D8%25AA%25D9%2584%25D8%25A7%25D9%2583-%25D9%2587%25D9%2588%25D9%258A%25D8%25A9-%25D8%25A8%25D8%25B9%25D8%25AF-%25D8%25B3%25D9%2586%25D9%2588%25D8%25A7%25D8%25AA-%25D9%2585%25D9%2586-%25D8%25A7%25D9%2584%25D8%25A5%25D9%2586%25D9%2583%25D8%25A7%25D8%25B1-%25D8%25AA%25D9%2582%25D8%25B1%25D9%258A%25D8%25B1/2354275)\n2021.\n\n\n-----\n\nDecoy document containing text on Palestinian reunification.\n\nAnother decoy, also from September 2021, consists of an article on social and economically\nsustainable development in Palestine by the [MA'AN development center — a Palestinian](https://www.maan-ctr.org/en/article/22/What-is-MA%25E2%2580%2599AN)\ndevelopment and training institution aimed at community development.\n\nDecoy document containing an article on Palestinian sustainable development.\n\nAnother decoy from July 2021 consisted of a patient's report containing affidavits from the\n\n\n-----\n\nState of Palestine s Ministry of Health. During March and February 2021, we observed the\nuse of politically themed decoys. One of these decoys consisted of a list of questions from a\nPalestinian activist on the Presidential decree issued on Feb. 20, 2021, ordering the respect\nof freedom of expression ahead of legislative elections in May.\n\nDecoy containing a list of questions from a Palestinian activist.\n\n### Deployment\n\nDuring this investigation, Talos could not find any email or social media posts that were\nsomehow linked to the Micropsia implants. However, we found the implants and compressed\nfiles containing the implants. This follows the same pattern that we described in our 2017\n[post about this actor. It is highly likely that the threat actor has continued to use the email](https://blog.talosintelligence.com/2017/06/palestine-delphi.html)\nvector to deliver their lures and implants.\n\n### Implant analysis\n\nThe implant used to target Palestinian entities consists of Delphi-based versions of\nMicropsia. This implant consists of a Delphi form with four buttons and four timers\n\n\n-----\n\nimplemented to carry out different malicious activities described below.\n\nForm1 containing the four timers.\n\n\n-----\n\nForm1 contents\n\nAll the malicious functionalities are implemented through the timers configured in the implant.\n\n**Deploying the decoy document**\n\n\n-----\n\nOne of these timers is responsible for extracting the decoy document and saving it to the\n%TEMP% folder and then displaying it via ShellExecute:\n\nDecoy document extracted and displayed to the target.\n\nNow, if the implant is started with the \"-start\" command-line switch, it will skip the process for\ndropping and displaying the decoy document and jump straight to its RAT functionalities.\n\n**Establishing persistence**\n\nAnother timer is used to establish persistence for the implant on the endpoint.\n\nHere, the implant will establish persistence by obtaining its current command line, which is\nthen used to create a shortcut for itself in the %TEMP% directory. The shortcut to run the\nimplant contains the \"-start\" switch (used to skip the displaying of the decoy document). This\nshortcut is then moved over to the currently logged-in user's Startup folder to complete\npersistence across reboots and re-logins.\n\n**Information Gathering**\n\nThe remaining two timers will gather preliminary system information and activate the RAT\ncapabilities of the implant.\n\n\n-----\n\nThe sequence of actions followed for gathering system information from the endpoint are as\nfollows:\n\n1. Generate a pc ID for the infected endpoint. Save this value into a data file, such as:\n\n\"%APPDATA%\\dsfjj45k.tmp\"\n\n2. Gather the Computername and username from ENV. Concatenate the computername,\n\nusername and pcid into format: <COMPNAME>_<username>_<pcid>\n\n3. Gather installed AV information from the endpoint via\n\n\"winmgmts:\\\\localhost\\root\\SecurityCenter2\" using query \"SELECT * FROM\nAntiVirusProduct\". From the AV information obtained, record the DisplayName.\n\n4. Get OS information specifically the installed product name.\n\n5. Get the current implant's command line and record it.\n\nAll this data gathered from the system is individually base64-encoded and assigned to HTTP\nform query variables with the following name-value pairs:\n\nvcqmxylcv= base64 encoded <COMPNAME>_<username>_<pcid>\nvcnwaapcv= base64 encoded AV Name list.\nvcllgracv= base64 encoded OS version string.\nvcwjlxycv= base64 encoded implant command line.\nvccodwfcv= base64 encoded hardcoded flag.\n\nThe data is then sent to the implant's C2 server via an HTTP POST request, which is fairly\nstandard in Micropsia implants.\n\n**RAT capabilities**\n\nOnce the preliminary information has been sent, the implant now begins its remote access\ntrojan (RAT) activity and waits for command codes from the C2 server.\n\nThe implant now uses two additional HTTP form variables to transmit the output of the\ncommands executed on the endpoint:\n\nvcgqjdlrcv = hardcoded value 0.\n\nmugnaq = base64 encoded screenshot or command output.\n\nThe C2 issues distinct command codes to the implant to carry out various actions on the\ninfected endpoint.\n\nThe commands follow the format: ;<cmd_code>;<base64_encoded_supporting_data>;\n\n\n-----\n\nField nameField name cmd_codecmd_code supporting_datasupporting_data\n\nExample cmd aXBjb25maWc\n\nThe above example would run the ipconfig command on the endpoint.\n\nThe command codes accepted by the implant are listed here:\n\n\nCommand\ncode\n\n\"1\" or \"2\" or\n\"sh\"\n\n\nDescription\n\nCapture screenshots to the %TEMP% directory and exfiltrate.\n\n\n\"log\" Send the current activity log (recorded in an internal Memo) to the C2.\n\n\"cmd\" Execute the command specified and send output to C2.\n\n\"df\" Download file from a specified remote location into a local path specified\nby the C2.\n\n\"zero\" Exit execution.\n\n\"lehar\" Ask for the next command from the C2.\n\nWe have observed implants using two distinct URLs to instrument communications with the\nC2, one for exfiltration of screenshots and the other for all the other RAT commands.\n\nFor example one of the implants used a distinct URL for screenshots:\n\nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/ZCgbo9EVhYMA8PX\n\nWhile another URL was used for all other commands:\n\nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/bu5EmpJE7DUfzZD\n\n## Conclusion\n\nSince its initial disclosure by Talos in 2017, this campaign from Arid Viper has become a\nlong-standing offensive cyber attack spanning well into 2021.\n\n[State-sponsored actors and privateer groups rely heavily on stealth in their operations. The](https://blog.talosintelligence.com/2021/05/privateer-groups.html)\npublic disclosures of campaigns and targeted attacks are usually followed by the actors\ntaking down their infrastructure and revamping their implants to avoid discovery of their\n\n\n-----\n\nmalicious assets.\n\nHowever, in the case of Arid Viper, the continued use of the same TTPs over the past four\nyears indicates that the group doesn't feel affected by the public exposure of its campaigns\nand implants, and continues to operate business as usual. This complete lack of deterrence\nmakes them a dangerous group once they decide to target an organization or individual.\n\nThe lack of change also points to a certain level of success with their current TTPs. The new\ncampaign and accompanying versions of Arid Viper's Micropsia implant disclosed in this\nresearch by Talos brings the spotlight back to their politically themed campaign to remind\npotential victims that the group is still very active.\n\nArid Viper is a prime example of groups that aren't very advanced technologically, however,\nwith specific motivations, are becoming more dangerous as they evolve over time and test\ntheir tools and procedures on their targets. Implants such as Micropsia come in various\nforms such as Delphi, Python and Android. Such RATs proliferated and operated by a highly\nmotivated threat actor who refuses to back down, consist of a variety of functionalities and\nare constantly evolving. These RATs can be used to establish long-term access into victim\nenvironments and additionally deploy more malware purposed for espionage and stealing\ninformation and credentials.\n\nIn-depth defense strategies based on a risk analysis approach can deliver the best results in\nthe prevention. However, this should always be complemented by a good incident response\n[plan which has been not only tested with tabletop exercises, but also reviewed and improved](https://talosintelligence.com/incident_response/tabletop)\nevery time it is put to the test on real-world engagements.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\nthreat actors as part of their campaign. You can try Secure Email for free [here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Dcmd-free-trial-request%26utm_term%3Dpgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nsuch as [Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html) [Adaptive Security Appliance and](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html) [Meraki MX can detect](https://meraki.cisco.com/products/appliances)\nmalicious activity associated with this threat.\n\n\n-----\n\n[Cisco Secure Network/Cloud Analytics (Stealthwatch/Stealthwatch Cloud) analyzes network](https://www.cisco.com/c/en/us/products/security/stealthwatch/index.html)\ntraffic automatically and alerts users of potentially unwanted activity on every connected\ndevice.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a\n[free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Dumbrella-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Dautomated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are available\nfrom the [Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are](https://signup.duo.com/?utm_source%3Dtalos%26utm_medium%3Dreferral%26utm_campaign%3Dduo-free-trial)\naccessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCS\n\n**Hashes**\n\nd4e56e3a9dec89cc32df78aa4ba8b079aa5e697ed99a1e21e9bd31e85d5d1370\n\n1d4e54529feef53850f97f39029a906d53f3d4b2aea8373e27c413324a55681c\n\nbc03948ce4d88f32017d4a1725a05341d3ff72a616645d9893b8f5d11068217f\n\n8a730266c62fa79435497b1d7db38011e63b6c53b48593d65c24c36044d92dba\n\nf2f36a72cfb25cef74ff0ea8e3ad1c49c6dc3e128fd60a2717f4c5a225e20df2\n\n895adb54a13d9ebf3f7215f1bad77c0c548e7dd4c58c3a338d440520efcb8fc9\n\n27eaeb7f0195230e22d5beacc05b7d944aaec4894fbc02824f59b172e360713f\n\n7b9087d91a31d03dd2c235d8debf8ed10f4b82c430a236d159e06e7fb47464a9\naa507bbe5d2a32f6e1e3f311c1baf93fd4707def8596083f26683e85972f5ac0\nc9d7b5d06cd8ab1a01bf0c5bf41ef2a388e41b4c66b1728494f86ed255a95d48\n\n0a55551ade55705d4be6e946ab58a26d7cf8087558894af8799931b09d38f3bc\nc7e74330440fcf8f6b112f5493769de6cdbdea5944ab78697ab115c927cbd0a1\n\n2d03ff4e5d4d72afffd9bde9225fe03d6dc941982d6f3a0bbd14076a6c890247\n\ne288d7e42c8cdbf0156f008ff7d663f8c8e68faa2e902d51f3287f1bceae79b2\n\n5463b3573451d23f09cb3f6f3c210de182ed0dd8a89459381a7f69aa7f8ac9b4\n\n\n-----\n\n**Hostnames**\n\ndeangelomcnay[.]news\n\njuliansturgill[.]info\n\nearlahenry[.]com\n\nnicholasuhl[.]website\n\ncooperron[.]me\n\ndorothymambrose[.]live\n\nruthgreenrtg[.]live\n\n**URLs**\n\nhxxp://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/ZCgbo9EVhYMA8PX\n\nhxxp://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/bu5EmpJE7DUfzZD\n\nhxxps://cooperron[.]me/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/\n\nhxxps://cooperron[.]me/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/\n\nhxxps://dorothymambrose[.]live/hx3FByTR5o3zNZYD/sYkaiHz0Mse13C79dy1I/\n\nhxxp://dorothymambrose[.]live/hx3FByTR5o3zNZYD/sYkaiHz0Mse13C79dy1I/\n\nhxxps://nicholasuhl[.]website/X2EYSWlzSZgSUME210Zv/YPPV6kFl2PwwF0TEVHMy/\n\nhxxp://nicholasuhl[.]website/X2EYSWlzSZgSUME210Zv/YPPV6kFl2PwwF0TEVHMy/\n\nhxxps://earlahenry[.]com/Ct2azbEP57LtWgmK/lWaPwemAJ3LPFmDH/\n\nhxxp://earlahenry[.]com/Ct2azbEP57LtWgmK/lWaPwemAJ3LPFmDH/\n\nhxxp://juliansturgill[.]info/um2NxySaF4L5mSYE/KY1hNeVvrE1XCrKP/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-02 - Arid Viper APT targets Palestine with new wave of politically themed phishing attacks, malware.pdf"
    ],
    "report_names": [
        "2022-02-02 - Arid Viper APT targets Palestine with new wave of politically themed phishing attacks, malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b1979c55-037a-415f-b0a3-cab7933f5cd4",
            "created_at": "2024-04-24T02:00:49.561432Z",
            "updated_at": "2025-03-27T02:00:55.493381Z",
            "deleted_at": null,
            "main_name": "APT-C-23",
            "aliases": [
                "APT-C-23",
                "Arid Viper",
                "Desert Falcon",
                "TAG-63",
                "Grey Karkadann",
                "Big Bang APT",
                "Two-tailed Scorpion"
            ],
            "source_name": "MITRE:APT-C-23",
            "tools": [
                "Micropsia"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "77c08a4a-b3f9-43ee-9d84-04ba572b7564",
            "created_at": "2024-05-01T02:03:07.927023Z",
            "updated_at": "2025-03-27T02:05:17.248836Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SHADYSIDE",
            "aliases": [
                "Arid Viper ",
                "Desert Falcon ",
                "APT-C-23 "
            ],
            "source_name": "Secureworks:ALUMINUM SHADYSIDE",
            "tools": [
                " SpyC23",
                "Micropsia"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "efe6ff9a-822d-41a6-90c3-45265cac696b",
            "created_at": "2024-05-01T02:03:07.920302Z",
            "updated_at": "2025-03-27T02:05:17.246342Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SARATOGA",
            "aliases": [
                "Arid Viper",
                "Desert Falcon",
                "Extreme Jackal ",
                "Gaza CyberGang",
                "Gaza CyberGang",
                "Molerats ",
                "Operation DustySky ",
                "TA402",
                "APT-C-23"
            ],
            "source_name": "Secureworks:ALUMINUM SARATOGA",
            "tools": [
                " BrittleBush",
                " DarkComet",
                " LastConn",
                " Micropsia",
                " NimbleMamba",
                " PoisonIvy",
                " QuasarRAT",
                " XtremeRat",
                "BlackShades"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535829,
    "ts_updated_at": 1743041683,
    "ts_creation_date": 1653751755,
    "ts_modification_date": 1653751755,
    "files": {
        "pdf": "https://archive.orkl.eu/e39a17e99954a19dda0fa3f7f32c133bf25fc161.pdf",
        "text": "https://archive.orkl.eu/e39a17e99954a19dda0fa3f7f32c133bf25fc161.txt",
        "img": "https://archive.orkl.eu/e39a17e99954a19dda0fa3f7f32c133bf25fc161.jpg"
    }
}