{
    "id": "e3e2ad2e-5431-4d21-bab0-6407321cddae",
    "created_at": "2023-01-12T15:02:53.204922Z",
    "updated_at": "2025-03-27T02:05:46.18965Z",
    "deleted_at": null,
    "sha1_hash": "d350e4c76a8bc3b5166bc1cd4e52563968ad3bd6",
    "title": "2021-09-03 - Netwalker ransomware full analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T21:48:29Z",
    "file_modification_date": "2022-05-28T21:48:29Z",
    "file_size": 111197,
    "plain_text": "# Netwalker ransomware full analysis\n\n**seguranca-informatica.pt/netwalker-ransomware-full-analysis/**\n\nmaxtrilha\n\n\nSeptember 3, 2021\n\n\n[Netwalker is a data encryption malware that represents an evolution of the well-known Kokoklock ransomware and has been active since](https://www.infosecinstitute.com/skills/learning-paths/malware-analysis-reverse-engineering/)\nSeptember 2019. This article will detail the specific technical features of the Netwalker ransomware. We will analyze what Netwalker is, how it\nworks, and how you can avoid falling victim to this threat.\n\nIn the new version of this piece of ransomware, the threat is not compiled into a PE file. Threat actors are using PowerShell scripts to load the\nthreat into the memory (using a well-known technique called reflective loading) and make it a fileless threat, more difficult to detect and\nanalyze. For that, malware operators achieve persistence and evade detection by abusing tools that are already in the system to initiate\nattacks.\n\nRecent samples of Netwalker are not distributed via social engineering attacks. Instead, it is loaded into the memory via DLL injection during a\ntargeted attack. Thus, it doesn’t need a Windows loader to execute. This is a technique used for several PowerShell scripts, such as\nPowerSploit’s Invoke-Mimikatz, during Red Team operations. Figure 1 shows the PowerShell script used to initiate the infection process.\n\n**_Figure 1: PowerShell script with the malicious payload encoded in Base64._**\n\n\n-----\n\nte decod g t e t a pay oad, a byte a ay s obta ed s s o gu e, a O ca s used t t e ey 0 9 o de to obta t e\nnext stage.\n\n**_Figure 2: Byte array and XOR call executed during the ransomware infection process._**\n\nWhen the task is terminated, the obfuscation phase is skipped. Now, a readable form of the script is obtained. Two DLL files are coded in twobyte arrays along with the source code responsible for executing the encryption process. Notice that the code is quite obfuscated in order to\nmake its analysis difficult.\n\n\n-----\n\n**_Figure 3: Part of the source code with two DLL files — for x64- and x86-bit OS._**\n\nDuring the infection process, the script determines the system version — x64 or x86 — to execute the correct DLL version.\n\n\n-----\n\n**_Figure 4: The right DLL version is executed (x64 or x32) depending on the target OS._**\n\nThe reflective DLL injection is performed after some API addresses are resolved from kernel32.dll.\n\n\n-----\n\n**_Figure 5: API addresses resolved from kernel32.dll during the reflective DLL injection._**\n\nBefore starting the loading task, the script deletes shadow volume copies and prevents the victim from using shadow volumes to recover the\nencrypted files. Next, the DLL is loaded onto the memory system and the encryption process is initiated.\n\n\n-----\n\n**_Figure 6: Shadow Copies deleted during the ransomware loading process._**\n\n## Ransomware execution and config\n\nThe ransomware uses some cryptographic functions including SHA256, CRC32 and RC4 KSA to decrypt the malware config and to resolve all\nthe needed functions dynamically.\n\n\n-----\n\n**_Figure 7: Offsets of cryptographic functions found._**\n\nAfter decoding the obfuscated config hardcoded inside the DLL loaded in the memory, the config data can be analyzed (Figure 8).\n\n\n-----\n\n**_Figure 8: Netwalking config decoded in runtime._**\n\nThis variant of Netwalker is similar to the past versions in terms of behavior. In detail, it terminates some target and hardcoded processes and\nservices depicted in the following figures.\n\n\n-----\n\n**_Figure 9: Processes terminated during the Netwalker execution._**\n\n**_Figure 10: Services terminated during the Netwalker execution._**\n\nIn addition, some file extensions and folders are also ignored as a way of keeping the operating system operating.\n\n\n-----\n\n**_Figure 11: File extensions and folders ignored and not encrypted during Netwalker execution._**\n\nThe JSON file with the ransomware configuration also has the ransom note available and the onion’s links to the dark web forum maintained\nby the operators of this threat.\n\n\n-----\n\n**_Figure 12: Ransom note and onion links available on the JSON configuration._**\n\nThe ransom note is encoded in Base64 and can be observed in Figure 13.\n\n\n-----\n\n**_Figure 13: Ransom note extracted and decoded from the config loaded in memory._**\n\nAfter encrypting all the files, the text file with the ransom note is dropped by Netwalker with the fields coded in the config now populated.\n\n\n-----\n\n**_Figure 14: Ransom note dropped after Netwalker executio._**\n\nAt the end of the encryption process, it is interesting to look at the file on the left side above. It is a sample encrypted during the malware\nexecution. Comparing this file with the original file (Figure 15), at first glance, this ransomware does not encrypt the files in their entirety.\n\n\n-----\n\n**_Figure 15: Block of data not encrypted by Netwalker ransomware._**\n\n## Dark web forum and ransom payment\n\nLike other modern pieces of ransomware, criminals, before executing the encryption process, exfiltrate organization data as a way of\nincreasing the caused damage. The data is published online if the ransom request has not been paid. Netwalker operators began publishing\nvictim data in a public blog accessible via TOR, similar to Maze, DoppelPaymer, REvil, Ragnar and others that list “non-compliant” victims\nalong with download links to the leaked data.\n\n\n-----\n\n-----\n\n**_Figure 16: Ransom payment gateway and leaked data on the Netwalker blog on the dark web._**\n\n## Preventative and protective measures\n\nThe first and principal recommendation in these cases of data encryption incidents is to never pay the ransom requested by the cybercriminals.\nAmong the preventative measures to be taken, it is important to highlight the following:\n\n\n-----\n\no t do oaded a d e ecute susp c ous es o u o sou ces\nUse PowerShell commands such as ConstrainedLanguageMode to secure systems from malicious code\nMake backups periodically and be ensure that system can be re-established quickly with the minimal loss of information\nImprove network segmentation to prevent massive propagation threats this nature\nReview and reinforce security policies\nCreate awareness programs educating employees on the dangers of social engineering\n\n**The article was initially published by Pedro Tavares on** **[resources.infosecinstitute.com.](https://resources.infosecinstitute.com/topic/netwalker-malware-what-it-is-how-it-works-and-how-to-prevent-it-malware-spotlight/)**\n\n**All rights reserved ®** **[infosecinstitute.com](http://infosecinstitute.com/)**\n\n[Pedro Tavares](https://seguranca-informatica.pt/author/pipocaz/)\n**[Pedro Tavares is a professional in the field of information security working as an Ethical Hacker/Pentester, Malware Researcher and also a](https://www.linkedin.com/in/sirpedrotavares/)**\n[Security Evangelist. He is also a founding member at CSIRT.UBI and Editor-in-Chief of the security computer blog seguranca-informatica.pt.](https://seguranca-informatica.pt/)\n\nIn recent years he has invested in the field of information security, exploring and analyzing a wide range of topics, such as pentesting (Kali\nLinux), malware, exploitation, hacking, IoT and security in Active Directory networks. He is also Freelance Writer (Infosec. Resources Institute\n[and Cyber Defense Magazine) and developer of the 0xSI_f33d – a feed that compiles phishing and malware campaigns targeting Portuguese](https://feed.seguranca-informatica.pt/)\ncitizens.\n\n[Read more here.](https://seguranca-informatica.pt/contacto/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-03 - Netwalker ransomware full analysis.pdf"
    ],
    "report_names": [
        "2021-09-03 - Netwalker ransomware full analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535773,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653774509,
    "ts_modification_date": 1653774509,
    "files": {
        "pdf": "https://archive.orkl.eu/d350e4c76a8bc3b5166bc1cd4e52563968ad3bd6.pdf",
        "text": "https://archive.orkl.eu/d350e4c76a8bc3b5166bc1cd4e52563968ad3bd6.txt",
        "img": "https://archive.orkl.eu/d350e4c76a8bc3b5166bc1cd4e52563968ad3bd6.jpg"
    }
}