{
    "id": "e4201560-0d32-481e-bb93-598d01e2ef69",
    "created_at": "2022-10-25T16:48:18.848862Z",
    "updated_at": "2025-03-27T02:05:34.207694Z",
    "deleted_at": null,
    "sha1_hash": "5cac1187b758faac5a0874c199b4ff928590b8ed",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-04-21T06:49:16Z",
    "file_modification_date": "2021-04-21T06:49:16Z",
    "file_size": 1500353,
    "plain_text": "# Hackers Flood the Web with 100,000 Malicious Pages, Promising Professionals Free Business Forms, But Delivering Malware, Reports eSentire\n\n**esentire.com/security-advisories/hackers-flood-the-web-with-100-000-malicious-pages-promising-professionals-**\nfree-business-forms-but-are-delivering-malware-reports-esentire\n\n×\n\n## Search\n\nSecurity advisories | Apr 13, 2021\n\n**_Business professionals search google for free office forms (invoices,_**\n**_questionnaires, and receipts) but get served a RAT_**\n\neSentire, a leading cybersecurity solutions provider, reported today that business\nprofessionals are currently being lured to hacker-controlled websites, hosted on Google\nSites, and inadvertently installing a known, emerging Remote Access Trojan (RAT).\neSentire has detected several incidents in the past week. The attack starts with the\npotential victim performing a search for business forms such as invoices, questionnaires,\n[and receipts. Unlike the LinkedIn spearphishing campaign eSentire reported last week](https://www.esentire.com/security-advisories/hackers-spearphish-professionals-on-linkedin-with-fake-job-offers-infecting-them-with-malware-warns-esentire)\nthat utilized email and LinkedIn channels, this campaign lays long-standing traps for\nvictims using Google search redirection and the drive-by- download method. Once\nthe RAT is on the victim’s computer and activated, the threat actors can send commands\nand upload additional malware to the infected system, such as ransomware, a credential\nstealer, a banking trojan, or simply use the RAT as a foothold into the victim’s network.\n\nUpon attempting to download the alleged document template, users are redirected,\nunknowingly, to a malicious website where the RAT malware is hosted. eSentire’s Threat\nResponse Unit (TRU) discovered over 100,000 unique web pages that contain popular\nbusiness terms/particular keywords: template, invoice, receipt, questionnaire, and\nresume. In a precursory search, 70,000 unique web pages included the mention of either\n_template or invoice. These common business terms serve as keywords for the threat_\nactors’ search optimization strategy, convincing Google’s web crawler that the intended\ncontent meets conditions for a high PageRank score.\n\nOnce the target lands on a site controlled by the hacker, the page shows download buttons\nfor the document template they were searching. When clicked, the business professional\nis redirected (unknowingly) to a malicious website which serves up an executable\ndisguised as a pdf document or a word document. In the incident which eSentire\ninvestigated, when the executable (disguised as a pdf) was launched by the user, they\nsimultaneously installed the SolarMarker RAT (also referred to as Yellow Cockatoo\n\n\n-----\n\nJupyter, and Polazert) and a complimentary copy of the Slim PDF reader application.\nSlim PDF is a legitimate application for reading pdfs. The pdf reader application is\ninstalled by the threat actors, either in an effort to convince the victim of the legitimacy of\nthe document they were seeking or as a distraction from the installation of the RAT. As\nwith any RAT, once SolarMarker is active, the threat actors can send commands and\nupload additional files to the infected system. The TRU has not yet observed actions-onobjectives following a SolarMarker infection, but suspect any number of possibilities,\nincluding ransomware, credential theft, fraud, or as a foothold into the victim networks\nfor espionage or exfiltration operations.\n\n## Key Takeaways\n\nA Remote Access Trojan (RAT) with many names: Tracked as SolarMarker, Jupyter,\nYellow Cockatoo and Polazert\nThe threat actors behind SolarMarker have added Slim PDF to their list of decoy\napplications\nSwitched from search redirection, via Shopify, to search redirection via Google Sites\n\n## Comment from Spence Hutchinson, Manager of Threat Intelligence for eSentire\n\n“Security leaders and their teams need to know that the threat group behind SolarMarker\nhas gone to a lot of effort to compromise business professionals, spreading a wide net and\nusing many tactics to successfully disguise their traps,” said Spence Hutchinson, Manager\nof Threat Intelligence for eSentire. “For instance, the Solar Marker group has:\n\n:\n\nDeployed over 100,000 web pages via Google Sites. The benefits of being hosted on\nGoogle’s infrastructure are several. First, Google is trusted by both security\nappliances and human eyes. Secondly, it probably doesn't hurt your PageRank score\nwith Google to use Google’s infrastructure. The pages are also padded with\ngenerated text keywords, a tactic likely used to further influence search results.\nThe threat actors have created tens of hundreds of web pages with popular business\nterms, such as invoice, statement, receipt, questionnaire, so that when a business\nprofessional is searching the Internet for a specific business template, then there is\na chance that the top search results will include one of their malicious pages.\nThe infection process relies on exploiting the user, not an application. The user\nsimply executes a binary disguised as a PDF to infect the machine. This is an\nincreasingly common trend with malware delivery, which speaks to the improved\nsecurity of applications such as browsers that handle vulnerable code.\nUnfortunately, it reveals a glaring blindspot in controls which allow users to execute\nuntrusted binaries or script files at will.\n\n\n-----\n\nThe SolarMarker campaign utilizes a variety of decoy applications. Most recently,\nTRU observed that the Slim PDF reader software was the decoy being downloaded\nonto the victim’s computer. This serves as a distraction, as well as an additional\nelement to help convince the victim that they are downloading a pdf.\n\n“Another troubling aspect of this campaign is that the SolarMarker group has populated\nmany of their malicious web pages with keywords relating to financial documents, e.g.,\nstatements, receipts, invoices, etc.,” continued Hutchinson.. “A financial cybercrime\ngroup would consider an employee, working in the finance department of a company, or\nan employee, working for a financial organization, a high value target. In fact, the\nSolarMarker incident which eSentire disrupted involved an employee of a financial\nmanagement company. Once a remote access trojan (RAT) has been installed on a\nvictim’s computer, the threat actors can upload additional malware to the device, such as\na banking trojan, which could be used to hijack the online banking credentials of the\norganization. Or a credential stealer could be installed, which could be used to steal the\nemployee’s email credentials, enabling the hackers to launch a business email\ncompromise scheme. Unfortunately, once a RAT is comfortably installed, the potential\nfraud activities are numerous.”\n\n## How the Attack Works\n\nThe emerging RAT is written with the .NET software framework, and tracked as Jupyter,\n_Yellow Cockatoo, SolarMarker, and now being tracked as Polazert on twitter [1]._\nSolarMarker was first observed by eSentire in early October 2020. The eSentire Threat\nResponse Unit (TRU) tracks this threat as SolarMarker due to the observed tracking file\ndropped for host identification. Throughout October and November 2020, SolarMarker\nutilized docx2rtf.exe as a decoy to distract users as the .NET silently installed itself in the\nbackground. Red Canary reports SolarMarker changing this decoy application throughout\nthe following months [4] using in September 2020 photodesigner7_x86-64.exe and\nExpert_PDF.exe in November 2020, while the TRU continued to see docx2rtf.exe. The\nTRU has now discovered that the SolarMarker group is using Slim PDF Reader. See\nFigure 1 and Figure 2.\n\n\n-----\n\nFigure 1. The attack chain starts with a google search and ends in the installation of\nSolarMarker and lesser-known PDF viewer.\n\nFigure 2: Process tree outlining the installation of SolarMarker. Note the Adobe icon on\nthe installer file. The RAT, labeled (unknown), then goes on to install the decoy document\nand make malicious PowerShell calls.\n\n\n-----\n\nSolarMarker captures victims via Google Search redirect. Often, clients are looking for a\nfree version or template of a document. In the latest incident observed by TRU, the\nvictim, who works in the financial industry, was redirected to a Google Sites page\ncontrolled by the threat actor with an embedded download button. The download button,\nhosted at passiondiamond[.]site, is easy to customize. The TRU team was able to generate\na document named “this is a test” for download (Figure 3). Note the search redirect\ncontent (see Figure 4) populated on the malicious web page just below the download\nbuttons in Figure 3.\n\nFigure 3: The Download button that is embedded in the Google Site\n\nFigure 4: The search redirect content populated on the malicious web page just below the\ndownload buttons in figure 3.\n\n\n-----\n\nFigure 5: Examining the source of the embedded button page reveals a link to a .tk\ndomain and icon sources\n\nThe decoy program, Slim PDF, serves as an important visual cue for potential victims of\nSolarMarker but also helps to lower suspicion of malicious intent. The attached\nscreenshot (Figure 6) is from the Slim PDF website\n\nFigure 6: Screenshot from the Slim PDF reader website\n\n## Evolution of Distribution Method\n\neSentire's TRU first saw SolarMarker utilizing Shopify for its search redirection method\nin October 2020. In that case, the redirection infrastructure was embedded in a hosted\nPDF that provided links to the threat actor’s maliciously controlled infrastructure where\nthe RAT (and its decoy payloads) is hosted. In 2021, the redirection method shifted to\nGoogle Sites.\n\nThe redirection method for Shopify was highlighted by Security Magic [5] who also\nmentioned the usage of Google Sites. To capture search results, the threat actors loaded\nthe redirection content with keywords. In the case of Shopify, the keywords were hidden\nas white text at the bottom of the PDF (Figure 7). In recent attacks, however, Google Sites\n\n\n-----\n\nis being leveraged with an embedded download button (Figure 3) that leads to attackercontrolled infrastructure. As with the Shopify PDF, a block of text with keywords is\nincluded. In the case of Google Sites, the keyword content is placed directly in the site,\nbelow the landing button and some white space (Figure 4).\n\nFigure 7: Highlighting the second page of the Shopify-hosted PDF reveals the hidden text\nused to rank high in Google results\n\n## Redirection\n\nThe redirection infrastructure passes through a series of .tk TLDs before landing on the\nfinal .ml TLD domain. See Figure 8. Upon visiting the infrastructure with a VM, no such\nredirects are experienced. Upon inspecting the source code of the embedded download\nbutton at passiondiamond.site, researchers found an entirely different .tk domain,\nindicating a possibility that these redirect pathways are dynamic and can be changed for\neither operational security or delivery efficacy. It’s possible that any number of checks are\nbeing performed on the visiting browser and operating system to ensure they are being\noperated by victims, not security researchers.\n\n\n-----\n\nFigure 8: SolarMarker’s redirect path from the search result to the final payload site\n\n## Four Names, One Malware\n\n[[1] Mar 09, 2021 - https://twitter.com/JAMESWT_MHT](https://twitter.com/JAMESWT_MHT)\n\nBeing tracked as #Polazert\n\n[2] Feb 08, 2021 - https://www.crowdstrike.com/blog/solarmarker-backdoor-technicalanalysis/\n\nGoogle Sites mentioned\n\nInfection Chain Shown\n\nDetailed Reversing / Snippets\n\n[3] Dec 12, 2020 - http://security5magics.blogspot.com/2020/12/tracking-jupytermalware.html\n\nShows Shopify Method\n\nGoogle Sites mentioned\n\n[[4] Dec 04, 2020 - https://redcanary.com/blog/yellow-cockatoo/](https://redcanary.com/blog/yellow-cockatoo/)\n\nOverview of Decoys used\n\n[5] Nov 12, 2020 - https://blog.morphisec.com/jupyter-infostealer-backdoorintroduction\n\nFirst Public Report on SolarMarker\n\n## SolarMarker Incident Dissection:\n\n1. Victim uses Google to search for an ethics questionnaire\n\n\n-----\n\n2. Business professional visits sites.google.com (Google’s generic site hosting offering)\n\n1. Web Page is controlled by threat actor\n2. Includes content from passiondiamond.site\n\n1. Can put any arbitrary text in passiondiamond component\n3. When the victim downloads, several v6 IPs are contacted to fetch the payload\n\ndisguised as a PDF.\n\n1. Mostly .tk T\n2. A single .ml TLD\n3. Client detonates questionnaire from Downloads folder\n\n1. Opens a lesser- known free PDF reader\n2. Installs the core .NET functionality of the RAT as .tmp executable\n3. RAT calls powershell\n4. PowerShell Beacons to potential C2\n\n1. Last updated: 2021-03-23 RIPE Network Coordination Centre\n\n## An example of the number of web pages, where the body copy of the page, contains the following search terms: excel, invoice, template.\n\n\n-----\n\n## Web pages in which the alleged document title included the search terms: template, invoice, statement, excel, and hansard (a Canadian legal document).\n\n\n-----\n\n**For more information about this threat and how to protect against it go to**\n**[https://www.esentire.com/get-started](https://www.esentire.com/get-started?utm_source=Security-Advisory&utm_medium=Hackers-Flood-the-Web-with-Malicious-Pages)**\n\n2021 eSentire, Inc. All rights reserved.\n\n2021 eSentire, Inc. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.04.13.Hackers_Flood/eSentire%20_%20Hackers%20Flood%20the%20Web%20with%20100%2C000%20Malicious%20Pages%2C%E2%80%A6.pdf"
    ],
    "report_names": [
        "eSentire _ Hackers Flood the Web with 100,000 Malicious Pages,…"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1618987756,
    "ts_modification_date": 1618987756,
    "files": {
        "pdf": "https://archive.orkl.eu/5cac1187b758faac5a0874c199b4ff928590b8ed.pdf",
        "text": "https://archive.orkl.eu/5cac1187b758faac5a0874c199b4ff928590b8ed.txt",
        "img": "https://archive.orkl.eu/5cac1187b758faac5a0874c199b4ff928590b8ed.jpg"
    }
}