{
    "id": "e4ab5c15-e844-4b6e-8af0-392ed818e7c6",
    "created_at": "2023-01-12T15:06:39.922727Z",
    "updated_at": "2025-03-27T02:17:02.31445Z",
    "deleted_at": null,
    "sha1_hash": "dca1a2d0e7bedd02ac8c9e1c35f213ec95a28770",
    "title": "2022-09-29 - Bad VIB(E)s Part One- Investigating Novel Malware Persistence Within ESXi Hypervisors",
    "authors": "",
    "file_creation_date": "2022-10-02T12:26:33Z",
    "file_modification_date": "2022-10-02T12:26:33Z",
    "file_size": 3536471,
    "plain_text": "# Bad VIB(E)s Part One: Investigating Novel Malware Persistence Within ESXi Hypervisors\n\n**[mandiant.com/resources/blog/esxi-hypervisors-malware-persistence](https://www.mandiant.com/resources/blog/esxi-hypervisors-malware-persistence)**\n\nAs endpoint detection and response (EDR) solutions improve malware detection efficacy on Windows\nsystems, certain state-sponsored threat actors have shifted to developing and deploying malware on systems\nthat [do not generally support EDR such as network appliances, SAN arrays, and VMware ESXi servers.](https://www.mandiant.com/resources/blog/unc3524-eye-spy-email)\n\nEarlier this year, Mandiant identified a novel malware ecosystem impacting VMware ESXi, Linux vCenter\nservers, and Windows virtual machines that enables a threat actor to take the following actions:\n\n1. Maintain persistent administrative access to the hypervisor\n2. Send commands to the hypervisor that will be routed to the guest VM for execution\n3. Transfer files between the ESXi hypervisor and guest machines running beneath it\n4. Tamper with logging services on the hypervisor\n5. Execute arbitrary commands from one guest VM to another guest VM running on the same hypervisor\n\nThis malware ecosystem was initially detected during an intrusion investigation when Mandiant identified\nattacker commands sourced from the legitimate VMware Tools process, `vmtoolsd.exe, on a Windows`\n[virtual machine hosted on a VMware ESXi hypervisor. Mandiant analyzed the boot profile for the ESXi](https://docs.vmware.com/en/VMware-vSphere/6.7/vsphere-esxi-vcenter-server-672-host-profiles-guide.pdf)\nhypervisors and identified a never-before-seen technique in which a threat actor leveraged malicious\n[vSphere Installation Bundles (“VIBs”) to install multiple backdoors on the ESXi hypervisors. We call these](https://blogs.vmware.com/vsphere/2011/09/whats-in-a-vib.html)\nbackdoors VIRTUALPITA and VIRTUALPIE (Figure 1).\n\n\n-----\n\nFigure 1: Visualization of ESXi attack path\nIt is important to highlight that this is not an external remote code execution vulnerability; the attacker needs\nadmin-level privileges to the ESXi hypervisor before they can deploy malware. Mandiant has no evidence of\na zero-day vulnerability being used to gain initial access or deploy the malicious VIBs at the time of writing\nthis post.\n\nDetails on how to manually detect if malicious or anomalous VIBs are currently installed in your ESXi\n[environment are outlined in our hardening blog post. VMware has released additional information on](https://www.mandiant.com/resources/blog/esxi-hypervisors-detection-hardening)\nprotecting vSphere.\n\n## vSphere Installation Bundles (VIB)\n\nMandiant identified two (2) new malware families installed through malicious vSphere Installation Bundles\n(VIBs), which we have named VIRTUALPITA and VIRTUALPIE.\n\nVMware VIBs are collections of files that are designed to facilitate software distribution and virtual system\nmanagement. Since ESXi utilizes an in-memory filesystem, file edits are not saved across reboots. A VIB\npackage can be used to create startup tasks, custom firewall rules, or deploy custom binaries upon the\nrestart of an ESXi machine. These packages are generally utilized by administrators to deploy updates and\nmaintain systems; however, this attacker was seen leveraging the packages as a persistence mechanism to\nmaintain access across ESXi hypervisors.\n\nVIBs can be broken down into three (3) components:\n\nAn XML descriptor file\nA “VIB payload” (.vgz archive)\nA signature file – A digital signature used to verify the host acceptance level of a VIB\n\nThe XML Descriptor File is a config which contains references to the following:\n\nThe payload to be installed\nVIB metadata, such as the name and install date\nThe signature file that belongs to the VIB\n\n\n-----\n\nThe VIB payload is a .vgz archive which contains directories and files that will be created on the ESXi\nmachine through the VIB. These files can then be called on to execute on boot when the VIBs are loaded.\n\nThe signature file is used to verify the host acceptance level of a VIB. The acceptance level is the digital\nsignature system used by VMware to specify what testing has been done by VMware or partners before a\nVIB is published. Acceptance levels are set for hosts, image profiles, and individual VIBs. The four (4)\nacceptance levels along with their XML Descriptor short names are listed below:\n\nVMWareCertified (certified)\nVMwareAccepted (accepted)\nPartnerSupported (partner)\nCommunitySupported (community)\n\nPer [VMware documentation, the default minimum acceptance level a VIB needs to be installed on a ESXi](https://docs.vmware.com/en/VMware-vSphere/6.5/com.vmware.vsphere.install.doc/GUID-6ED55C6B-E2FA-4DAB-B98D-E80FE1B8F1D9.html)\nhost is `PartnerSupported . This acceptance level indicates the VIBs are published by a partner that`\nVMware trusts. While this is the default acceptance level, it can be changed manually by an ESXi\nadministrative account. The command used to install VIBs `esxcli software vib install does not`\nnormally allow installations below the minimum acceptance level, but the --force flag can be used to ignore\nany systems acceptance level requirements when installing the VIB.\n\nThe malicious VIBs observed were labelled as `PartnerSupported . Mandiant’s review of the Signature`\nFiles determined they were empty, and that an attacker modified the XML descriptor file to change the\n```\nacceptance-level field from community to partner . A CommunitySupported acceptance-level\n\n```\nindicates that the VIB was created by a third party which was not reviewed nor signed by VMware or its\ntrusted partners. This indicated the attacker masqueraded these VIB files as `PartnerSupported even`\nthough they only met the requirements of a `CommunitySupported VIB. This also indicated that the VIB was`\ncreated by an individual or company outside of VMware partner programs and has not gone through any\nVMware-approved testing program. Figure 2 contains an excerpt of the modified XML descriptor file that was\nidentified.\n\n\n-----\n\nFigure 2: Modified Descriptor XML\nWhile the `acceptance-level field was modified in the Descriptor XML by the attacker, the ESXi system`\nstill did not allow for a falsified VIB file to be installed below the minimal set acceptance level. To circumvent\nthis, the attacker abused the `--force flag to install malicious` `CommunitySupported VIBs.`\n\nTesting confirmed that modified fields from the XML descriptor file reflected the changes made in the output\nof commands used to list and verify VIBs. This included the modification of the `<acceptance-level> field`\nwhich tricks the command, `esxcli software vib list, into displaying the incorrect acceptance level of`\nthe installed VIBs. The VMware command, `esxcli software vib signature verify, verifies the`\nsignatures of installed VIB packages and displays the following fields:\n\nVIB Name\nVersion\nVendor\nAcceptance Level\nThe result of the VIB’s signature verification\n\nMandiant confirmed that this command detected when these acceptance levels were falsified, which\nidentified the malicious VIBs. This command displays the acceptance level specified by the XML descriptor\nfile, but the `Signature Verification column clarifies if the signature file did not match the respective`\nDescriptor XML. If the signature cannot be verified, the `Signature Verification column will contain the`\nvalue `Signature Not Available: Host may have been upgraded from an older ESXi version . An`\nexample of this can be seen in Figure 3.\n\n\n-----\n\nFigure 3: Example of falsified VIB acceptance level being seen in esxcli software vib signature verify\n\n## VIRTUALPITA (VMware ESXi)\n\nVIRTUALPITA is a 64-bit passive backdoor that creates a listener on a hardcoded port number on a VMware\nESXi server. The backdoor often utilizes VMware service names and ports to masquerade as a legitimate\nservice. It supports arbitrary command execution, file upload and download, and the ability to start and stop\n```\nvmsyslogd . During arbitrary command execution, the malware also sets the environmental\n\n```\nvariable `HISTFILE to` `0 to further hide activity that occurred on the machine. Variants of this malware were`\nfound to listen on a Virtual Machine Communication Interface (VMCI) and log this activity to the file\n```\nsysclog .\n\n## VIRTUALPIE (VMware ESXi)\n\n```\nVIRTUALPIE is a lightweight backdoor written in Python that spawns a daemonized IPv6 listener on a\nhardcoded port on a VMware ESXi server. It supports arbitrary command line execution, file transfer\ncapabilities, and reverse shell capabilities. Communications use a custom protocol and are encrypted using\nRC4.\n\nThe first malicious VIB named `lsu-lsi-lsi-mrarpid-plugin referenced the payload` `lsu_lsi_.v05`\n(MD5: 2716c60c28cf7f7568f55ac33313468b) which contained the following three (3) files for which details\ncan be found in Table 1:\n\n/etc/rc.local.d/vmware_local.sh (MD5: bd6e38b6ff85ab02c1a4325e8af29ce4)\n/bin/rdt (MD5: 8e80b40b1298f022c7f3a96599806c43)\n/bin/vmsyslog.py (MD5: 61ab3f6401d60ec36cd3ac980a8deb75)\n\nTable 1: Lsu-lsi-lsi-mrarpid-plugin Malicious VIB contents\n\n**File Name** **Description**\n\nvmware_local.sh A bash installation script to be placed into `/etc/rc.local.d/ to ensure its actions`\nwill be executed upon each bootup of ESXi. Uses the `esxcli command line utility to`\nenable a firewall rule for backdoor traffic, execute both backdoors, and remove every\nfile created by the VIB from the disk.\n\nrdt An ELF backdoor (VIRTUALPITA) that creates a listener on the hard coded TCP port\n2233. Capable of arbitrary command execution, file transfer capabilities and the ability\nto start/stop `vmsyslogd . VMWare documentation recorded this port is normally`\n[utilized by the vSAN reliable datagram transport (RDT) service on the ESXi version](https://kb.vmware.com/s/article/52959)\nwhich was reviewed.\n\n\n-----\n\nvmsyslog.py A lightweight backdoor (VIRTUALPIE) written in Python that spawns a daemonized\nIPv6 listener the hardcoded port 546. Capable of arbitrary command line execution, file\ntransfer capabilities, and reverse shell capabilities. Communications use a custom\nprotocol and are encrypted using RC4.\n\nThe second malicious VIB named `ata-pata-pdc20211 referenced the payload` `payload1.v00 (MD5:`\n9ea86dccd5bbde47f8641b62a1eeff07) which contained the following two (2) files for which details can be\nfound in Table 2:\n\n/etc/rc.local.d/vmware_rhttpio.sh (MD5: 9d5cc1ee99ccb1ec4d20be1cee10173e)\n/usr/lib/vmware/weasel/consoleui/rhttpproxy-io (MD5: 2c28ec2d541f555b2838099ca849f965)\n\nTable 2: Lsu-lsi-lsi-mrarpid-plugin Malicious VIB contents\n\n**File Name** **Description**\n\nvmware_rhttpio.sh A bash installation script to be placed into `/etc/rc.local.d/ to ensure its actions`\nwill be executed upon each bootup of ESXi. This script executes the ELF backdoor\n\nrhttpproxy-io An ELF backdoor (VIRTUALPITA) that creates a listener on the hard coded VMCI\nsocket port 18098. Capable of arbitrary command execution, file transfer capabilities\nand the ability to start/stop vmsyslogd. The following sample generates an additional\nlog not seen in other samples which fetches the systems context ID (CID).\n\nThe generated log `/var/log/sysclog records in the following format`\n```\n           [<date/timestamp>]\\n\\r[!]<<PID>>:<CID>:<port>\\n\\n\n\n## VIRTUALPITA (LINUX)\n\n```\nMandiant discovered two (2) additional VIRTUALPITA samples listening on TCP port 7475 that were\npersistent as an `init.d startup service on Linux vCenter systems. To disguise themselves, the binaries`\nshared the name of the legitimate binary `ksmd . KSMD (Kernel Same-Page Merging Daemon) is normally in`\ncharge of memory-saving de-duplication on Linux and would not be listening on this port. The samples were\nfound under the following directories:\n\n/usr/libexec/setconf/ksmd (MD5: 744e2a4c1da48869776827d461c2b2ec)\n/usr/bin/ksmd (MD5: 93d50025b81d3dbcb2e25d15cae03428)\n\nThese backdoors were capable of arbitrary command execution, file transfer capabilities and the ability to\nstart/stop vmsyslogd.\n\n## VIRTUALGATE (Windows)\n\nThe Windows guest virtual machines which were hosted by the infected hypervisors also contained a unique\nmalware sample located at `C:\\Windows\\Temp\\avp.exe . This malware, which we refer to as`\nVIRTUALGATE, is a utility program written in C that is comprised of two (2) parts, a dropper, and the payload.\nThe memory only dropper deobfuscates a second stage DLL payload that uses VMware's virtual machine\ncommunication interface (VMCI) sockets to run commands on a guest virtual machine from a hypervisor host,\nor between guest virtual machines on the same host.\n\n\n-----\n\n## Command Execution through vmtoolsd.exe\n\nReviewing the ESXi hypervisors during an active attacker event, Mandiant identified an attacker executed\ncommands to the guest machines through the process `/bin/rdt (VIRTUALPITA). The parent process`\n```\n/bin/rdt spawned a bash shell which called on a python script specifying the target guest machine and\n\n```\ncommands to run as seen in Figure 4.\n\nFigure 4: Commands executed by attacker on ESXi Hypervisor\n\n```\n-> /bin/rdt -i\n\n```\n```\n....-> sh -c /bin/sh\n\n```\n```\n........-> /bin/sh\n\n```\n```\n ...........-> python e.py 127.0.0.1 vpxuser <password> <target guest machine>\n C:\\Windows\\system32\\cmd.exe /c dir /od /s /a c:\\ > C:\\Windows\\Temp\\TS_<REDACTED>.tmp\n 2>nul\n\n```\nCommands passed as arguments into e.py were also seen being executed by the targeted Windows guest\nmachine, running as a child process under `vmtoolsd.exe . This execution chain can be seen in Figure 5.`\nThe parent binary `/bin/rdt was not present on disk but was able to be recovered by dumping the`\nprocesses memory of the ESXi hypervisor. The python script that sent out commands to the guest machines,\n```\ne.py, was unable to be recovered.\n\n```\nFigure 5: vmtoolsd.exe executing commands passed by ESXi\nThe commands the attacker ran through `vmtoolsd.exe on the guest virtual machines were primarily`\nfocused on the enumeration and compression of files across both the system and connected file shares\nutilizing the native tools “dir” and “makecab” Samples of these redacted commands can be seen in Figure 6\n\n\n-----\n\nFigure 6: File enumeration and compression commands utilized by attacker on Guest Virtual Machines\n```\n C:\\Windows\\system32\\cmd.exe\" /c dir /od /s /a s:\\ > C:\\Windows\\Temp\\ts_<REDACTED>.tmp\n 2>null\n C:\\Windows\\System32\\cmd.exe makecab /F C:\\Windows\\Temp\\TS_<REDACTED>.txt /D\n compressiontype=lzx /D compressionmemory=21 /D maxdisksize=1024000000 /D\n diskdirectorytemplate=C:\\Windows\\Temp\\  /D cabinetnametemplate=TS_<REDACTED>.cab\n\n```\nMandiant also identified the attacker targeting a virtualized system for credential harvesting. The attacker\nused MiniDump to dump process memory and search for cleartext credentials. Figure 7 shows an excerpt of\nthese commands.\n\nFigure 7: Credential Dumping on Guest Machine\n```\n -- “ C:\\Program Files\\VMware\\Vmware Tools\\vmtoolsd.exe”\n ---- “C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe”\n ------ rundll32.exe C:\\windows\\System32\\comsvcs.dll MiniDump <Process ID>\n C:\\Windows\\Temp\\TS_<REDACTED>.tmp full\n\n```\nOnce the process memory was dumped, a powershell script was used to parse the resultant file for any\ncleartext credentials. Figure 8 shows the contents of script used for credential harvesting. The attacker also\ntargeted KeyPass password database files.\n\nFigure 8: PowerShell Password Search Script\n```\n $b = New-Object System.IO.streamReader(\"C:\\windows\\Temp\\<REDACTED>.tmp\",\n [Text.Encoding]::UTF8)\n\n```\n```\n$n = 0\n\n```\n```\nwhile (($b1 =$b.ReadLine()) -ne $null)\n\n```\n```\n{\n\n```\n```\n  if($b1 -like '*&password=*'){\n\n```\n```\n  $n++\n\n```\n```\n   Write-Host \"YES $n\"\n\n```\n```\n   Write-Host $b1\n\n```\n```\n  }\n\n```\n```\n}\n\n```\n```\nif($n -eq 0){Write-Host \"NO!\"}\n\n```\n```\n$b.Dispose()\n\n```\n\nThe attacker cleared the `C:\\Windows\\Temp directory following most activity, but small errors were made`\nwhich left behind trace artifacts. As shown in Figure 9, the attacker sent the output of a `dir listing to a`\n```\n.tmp file. Since the attacker used the Linux syntax (2>null) to suppress errors instead of the Windows\n\n```\n\n-----\n\nsyntax (2>nul), all errors were forwarded to the file null in the working directory\n```\nC:\\Windows\\System32\\null . This file was only created if a file enumerated with the dir command had a\n\n```\ndirectory path too long to be displayed.\n\nFigure 9: Failed writing Error to Null in Windows Command\n```\n C:\\Windows\\system32\\cmd.exe\" /c dir /od /s /a s:\\ > C:\\Windows\\Temp\\TS_<REDACTED>.tmp\n 2>null\n\n## Attribution\n\n```\nMandiant has begun tracking this activity as UNC3886. Given the highly targeted and evasive nature of this\nintrusion, we suspect UNC3886 motivation to be cyber espionage related. Additionally, we assess with low\nconfidence that UNC3886 has a China-nexus. Each investigation conducted by Mandiant includes analysts\nfrom our Advanced Practices team who work to correlate activity observed in the thousands of investigations\nto which Mandiant responds. At times, we do not have the data available to directly attribute intrusion activity\nto a previously known group. In these cases, we create a new UNC group to track the activity that we\nobserved. An UNC group is a cluster of related cyber intrusion activity, which includes observable artifacts\nsuch as adversary infrastructure, tools, and tradecraft, that we are not yet ready to give a classification such\nas APT or FIN. For more details on how Mandiant uses UNC groups, see our blog post: DebUNCing\nAttribution: How Mandiant Tracks Uncategorized Threat Actors.\n\n## Conclusion\n\nWhile we noted the technique used by UNC3886 requires a deeper level of understanding of the ESXi\noperating system and VMWare’s virtualization platform, we anticipate a variety of other threat actors will use\nthe information outlined in this research to begin building out similar capabilities. Mandiant recommends\norganizations using ESXi and the VMware infrastructure suite follow the hardening steps outlined in this blog\npost to [minimize the attack surface of ESXi hosts.](https://www.mandiant.com/resources/blog/esxi-hypervisors-detection-hardening)\n\n## MITRE ATT&CK Techniques\n\n### Collection\n\nT1560: Archive Collected Data\nT1560.001: Archive via Utility\n\n### Execution\n\nT1059: Command and Scripting Interpreter\nT1059.001: PowerShell\nT1059.003: Windows Command Shell\nT1059.004: Unix Shell\nT1059.006: Python\nT1129: Shared Modules\n\n### Command and Control\n\nT1105: Ingress Tool Transfer\nT1573.001: Symmetric Cryptography\n\n\n-----\n\n### Defense Evasion\n\nT1027: Obfuscated Files or Information\nT1070: Indicator Removal on Host\nT1070.003: Clear Command History\nT1070.004: File Deletion\nT1140: Deobfuscate/Decode Files or Information\nT1202: Indirect Command Execution\nT1218.011: Rundll32\nT1497: Virtualization/Sandbox Evasion\nT1497.001: System Checks\nT1620: Reflective Code Loading\n\n### Discovery\n\nT1016: System Network Configuration Discovery\nT1083: File and Directory Discovery\n\n### Lateral Movement\n\nT1021: Remote Services\nT1021.004: SSH\n\n### Credential Access\n\nT1003: OS Credential Dumping\nT1003.001: LSASS Memory\n\n### Persistence\n\nT1547: Boot or Logon Autostart Execution\n\n## Indicators of Compromise\n\n**Type** **Value** **Description**\n\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\n\n2716c60c28cf7f7568f55ac33313468b\n\n5ffa6d539a4d7bf5aacc4d32e198cc1607d4a522\n\n2be5f4520846bf493b4694789841907d058fe08d59fff6bad7abe1db8ed96e7d\n\nbd6e38b6ff85ab02c1a4325e8af29ce4\n\n17fb90d01403cb3d1566c91560f8f4b7dd139aa8\n\ne68872c49aaedeb3bde3ff5fd2ad6f70658687dc02d04f12ebc7cb28e821cc88\n\n\nMalicious VIB\n.vgz Payload\n\nMalicious VIB\nDeployment\nScript\n\n\n-----\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nDescriptor\nXML\nName\n\n\n8e80b40b1298f022c7f3a96599806c43\n\ne9cbac1f64587ce1dc5b92cde9637affb3b58577\n\nc2ef08af063f6d416233a4b2b2e991c177fc72d70a76c24bca9080521d41040f\n\n61ab3f6401d60ec36cd3ac980a8deb75\n\n93d5c4ebec2aa45dcbd6ddbaad5d80614af82f84\n\n4cf3e0b60e880e6a6ba9f45187ac5454813ae8c2031966d8b264ae0d1e15e70d\n\n9ea86dccd5bbde47f8641b62a1eeff07\n\nb90b19781fde2c35963eb3eac4ce2acc6f5019fb\n\n23eb8d056f18e7c69ec3568f2833c9d09e91df98d11b11de235331ef42756fe5\n\n9d5cc1ee99ccb1ec4d20be1cee10173e\n\n9d191849d6c57bc8a052ec3dac2aa9f57c3fe0cd\n\n4d995eb87b0685124b7f1640d1ab431f5a1ab991ade02750b876ed5c523234bb\n\n2c28ec2d541f555b2838099ca849f965\n\ne35733db8061b57b8fcdb83ab51a90d0a8ba618c\n\n505eb3b90cd107cf7e2c20189889afdff813b2fbb98bbdeab65cde520893b168\n\n744e2a4c1da48869776827d461c2b2ec\n\na3cc666e0764e856e65275bd4f32a56d76e51420\n\n4a6f559426493abc0d056665f23457e2779abd3482434623e1f61f4cd5b41843\n\n93d50025b81d3dbcb2e25d15cae03428\n\nabff003edf67e77667f56bbcfc391e2175cb0f8a\n\n13f11c81331bdce711139f985e6c525915a72dc5443fbbfe99c8ec1dd7ad2209\n\nfe34b7c071d96dac498b72a4a07cb246\n\n0962e10dc34256c6b31509a5ced498f8f6a3d6b6\n\n5731d988781c9a1d2941f7333615f6292fb359f6d48498f32c29878b5bedf00f\n\n\nVIRTUALPITA\n\nVIRTUALPIE\n\nMalicious VIB\nPayload\n\nMalicious VIB\nDeployment\nScript\n\nVIRTUALPITA\n\nVIRTUALPITA\n\nVIRTUALPITA\n\nVIRTUALPITA\n\n\nlsu-lsi-lsi-mrarpid-plugin VIB Name\n\n\n-----\n\nFilename lsu_lsi_.v05 VIB .vgz\npayload\n\nFullpath /etc/rc.local.d/vmware_local.sh VIB\nDeployment\nScript\n\nFullpath /bin/rdt VIRTUALPITA\n\nFullpath /bin/vmsyslog.py\n\n\nDescriptor\nXML\nName\n\n\nata-pata-pdc20211 VIB Name\n\n\nFilename payload1.v00 VIB .vgz\npayload\n\nFullpath /etc/rc.local.d/vmware_rhttpio.sh VIB\nDeployment\nScript\n\nFullpath /usr/lib/vmware/weasel/consoleui/rhttpproxy-io VIRTUALPITA\n\nFullpath /usr/libexec/setconf/ksmd VIRTUALPITA\n(Linux)\n\nFullpath /usr/bin/ksmd VIRTUALPITA\n(Linux)\n\nFullpath C:\\Windows\\Temp\\avp.exe VIRTUALGATE\n\n\nFullpath\nand Hash\n(MD5)\n\n\nC:\\Windows\\Temp\\Silverlight\\wmpd.exe\n\n76df41ee75d5077f2c5bec70747b3c99\n\n\nDeleted File\ncreated by\nvmtoolsd.exe\nand executed\nby\nvmtoolsd.exe\nchild process\n\n\n## Yara Detections\n\n\n-----\n\n```\nrule M_APT_VIRTUALPITA_1\n\n```\n```\n{\n\n```\n```\n    meta:\n\n```\n```\n       author = \"Mandiant\"\n\n```\n```\n       md5 = \"fe34b7c071d96dac498b72a4a07cb246\"\n\n```\n```\n       description = \"Finds opcodes to set a port to bind on 2233, encompassing\nthe setsockopt(), htons(), and bind() from 40973d to 409791 in\nfe34b7c071d96dac498b72a4a07cb246\"\n\n```\n```\n   strings:\n\n```\n```\n      $x = {8b ?? ?? 4? b8 04 00 00 00 [0 - 4] ba 02 00 00 00 be 01 00 00 00 [0\n- 2] e8 ?? ?? ?? ?? 89 4? ?? 83 7? ?? 00 79 [0 - 50] ba 10 00 00 00 [0 - 10] e8}\n\n```\n```\n   condition:\n\n```\n```\n      uint32(0) == 0x464c457f and all of them \n\n```\n```\n}\n\n```\n```\nrule M_APT_VIRTUALPITA_2\n\n```\n```\n{\n\n```\n```\n    meta:\n\n```\n```\n       author = \"Mandiant\"\n\n```\n```\n       md5 = \"fe34b7c071d96dac498b72a4a07cb246\"\n\n```\n```\n       description = \"Finds opcodes to decode and parse the recieved data in the\nsocket buffer in fe34b7c071d96dac498b72a4a07cb246. Opcodes from 401a36 to 401adc\"\n\n```\n```\n   strings:\n\n```\n```\n      $x = {85 c0 74 ?? c7 05 ?? ?? ?? ?? fb ff ff ff c7 8? ?? ?? ?? ?? 00 00 00\n00 e9 ?? ?? ?? ?? 4? 8b 05 ?? ?? ?? ?? 4? 83 c0 01 4? 89 05 ?? ?? ?? ?? c7 4? ?? 00 00\n00 00 e9 ?? ?? ?? ?? 8b 4? ?? 4? 98 4? 8d 9? ?? ?? ?? ?? 4? 8d ?? e0 4? 8b 0? 4? 89 0?\n4? 8b 4? ?? 4? 89 4? ?? 8b 4? ?? 4? 98 4? 8d b? ?? ?? ?? ?? b? ?? ?? ?? ?? e8 ?? ?? ??\n?? c7 4? ?? 00 00 00 00 eb ?? 8b 4? ?? 8b 4? ?? 01 c1 8b 4? ?? 03 4? ?? 4? 98 0f b6 9?\n?? ?? ?? ?? 8b 4? ?? 4? 98 0f b6 8? ?? ?? ?? ?? 31 c2 4? 63 c1 88 9? ?? ?? ?? ?? 83 4?\n?? 01}\n\n```\n```\n   condition:\n\n```\n```\n      uint32(0) == 0x464c457f and all of them \n\n```\n```\n}\n\n```\n\n-----\n\n```\nrule M_APT_VIRTUALPITA_3\n\n```\n```\n{\n\n```\n```\n    meta:\n\n```\n```\n       author = \"Mandiant\"\n\n```\n```\n       md5 = \"fe34b7c071d96dac498b72a4a07cb246\"\n\n```\n```\n       description = \"Finds opcodes from 409dd8 to 409e46 in\nfe34b7c071d96dac498b72a4a07cb246 to set the HISTFILE environment variable to 'F' with a\nputenv() after loading each character individually.\"\n\n```\n```\n   strings:\n\n```\n```\n      $x = {4? 8b 4? ?? c6 00 48 4? 8b 4? ?? 4? 83 c0 05 c6 00 49 4? 8b 4? ?? 4?\n83 c0 01 c6 00 49 4? 8b 4? ?? 4? 83 c0 06 c6 00 4c 4? 8b 4? ?? 4? 83 c0 02 c6 00 53 4?\n8b 4? ?? 4? 83 c0 07 c6 00 45 4? 8b 4? ?? 4? 83 c0 03 c6 00 54 4? 8b 4? ?? 4? 83 c0 08\nc6 00 3d 4? 8b 4? ?? 4? 83 c0 04 c6 00 46 4? 8b 4? ?? 4? 83 c0 09 c6 00 00 4? 8b 7? ??\ne8}\n\n```\n```\n   condition:\n\n```\n```\n      uint32(0) == 0x464c457f and all of them   \n\n```\n```\n}\n\n```\n```\nrule M_APT_VIRTUALPITA_4\n\n```\n```\n{\n\n```\n```\n    meta:\n\n```\n```\n       author = \"Mandiant\"\n\n```\n```\n       md5 = \"fe34b7c071d96dac498b72a4a07cb246\"\n\n```\n```\n       description = \"Finds opcodes from 401f1c to 401f4f in\nfe34b7c071d96dac498b72a4a07cb246 to decode text with multiple XORs\"\n\n```\n```\n   strings:\n\n```\n```\n      $x = {4? 8b 4? ?? 4? 83 c1 30 4? 8b 4? ?? 4? 8b 10 8b 4? ?? 4? 98 4? 8b 04\n?? ?? ?? ?? ?? 4? 31 c2 4? 8b 4? ?? 4? 83 c0 28 4? 8b 00 4? c1 e8 10 0f b6 c0 4? 98 4?\n8b 04}\n\n```\n```\n   condition:\n\n```\n```\n      uint32(0) == 0x464c457f and all of them\n\n```\n```\n}\n\n```\n\n-----\n\n```\nrule M_Hunting_Script_LaunchAndDelete_1\n\n```\n```\n{\n\n```\n```\n    meta:\n\n```\n```\n       author = \"Mandiant\"\n\n```\n```\n       md5 = \"bd6e38b6ff85ab02c1a4325e8af29ce4\"\n\n```\n```\n       description = \"Finds scripts that launch and then delete files,\nindicative of cleaning up tracks and remaining in-memory only.\"\n\n```\n```\n   strings:\n\n```\n```\n      $ss = /setsid[^\\n\\r]{,250}-i[\\r\\n]{,5}rm/\n\n```\n```\n   condition:\n\n```\n```\n      all of them\n\n```\n```\n}\n\n```\n```\nrule M_Hunting_Python_Backdoor_CommandParser_1\n\n```\n```\n{\n\n```\n```\n   meta:\n\n```\n```\nauthor = \"Mandiant\"\n\n```\n```\n      md5 = \"61ab3f6401d60ec36cd3ac980a8deb75\"\n\n```\n```\n      description = \"Finds strings indicative of the vmsyslog.py python\nbackdoor.\"\n\n```\n```\n   strings:\n\n```\n```\n      $key1 = \"readInt8()\" ascii wide\n\n```\n```\n      $key2 = \"upload\" ascii wide\n\n```\n```\n      $key3 = \"download\" ascii wide\n\n```\n```\n      $key4 = \"shell\" ascii wide\n\n```\n```\n      $key5 = \"execute\" ascii wide\n\n```\n```\n      $re1 = /def\\srun.{,20}command\\s?=\\s?self\\.conn\\.readInt8\\(\\).{,75}upload.\n{,75}download.{,75}shell.{,75}execute/s\n\n```\n```\n   condition:\n\n```\n```\n      filesize < 200KB and all of them\n\n```\n```\n}\n\n```\n\n## Acknowledgements\n\nSpecial thanks to Brad Slaybaugh, Joshua Kim, Zachary Smith, Kirstie Failey, Nick Simonian, and Charles\nCarmakal for their assistance with the investigation, technical review, and creating detections for the malware\nfamilies discussed in this blog post. In addition, we would also like to thank VMware for their collaboration on\n\n\n-----\n\nthis research.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-29 - Bad VIB(E)s Part One- Investigating Novel Malware Persistence Within ESXi Hypervisors.pdf"
    ],
    "report_names": [
        "2022-09-29 - Bad VIB(E)s Part One- Investigating Novel Malware Persistence Within ESXi Hypervisors.pdf"
    ],
    "threat_actors": [
        {
            "id": "ff183540-67fb-4514-bd30-b4a264795901",
            "created_at": "2022-10-25T16:07:24.367762Z",
            "updated_at": "2025-03-27T02:02:10.192778Z",
            "deleted_at": null,
            "main_name": "UNC3524",
            "aliases": [],
            "source_name": "ETDA:UNC3524",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1c91699d-77d3-4ad7-9857-9f9196ac1e37",
            "created_at": "2023-11-04T02:00:07.663664Z",
            "updated_at": "2025-03-27T02:00:03.15027Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3886",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a08d93aa-41e4-4eca-a0fd-002d051a2c2d",
            "created_at": "2024-08-28T02:02:09.711951Z",
            "updated_at": "2025-03-27T02:02:10.193557Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "ETDA:UNC3886",
            "tools": [
                "BOLDMOVE",
                "CASTLETAP",
                "LOOKOVER",
                "MOPSLED",
                "RIFLESPINE",
                "TABLEFLIP",
                "THINCRUST",
                "Tiny SHell",
                "VIRTUALGATE",
                "VIRTUALPIE",
                "VIRTUALPITA",
                "VIRTUALSHINE",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "94890f31-3a6c-447b-8995-5c5958efea28",
            "created_at": "2023-01-06T13:46:39.352776Z",
            "updated_at": "2025-03-27T02:00:03.05845Z",
            "deleted_at": null,
            "main_name": "UNC3524",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3524",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535999,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1664713593,
    "ts_modification_date": 1664713593,
    "files": {
        "pdf": "https://archive.orkl.eu/dca1a2d0e7bedd02ac8c9e1c35f213ec95a28770.pdf",
        "text": "https://archive.orkl.eu/dca1a2d0e7bedd02ac8c9e1c35f213ec95a28770.txt",
        "img": "https://archive.orkl.eu/dca1a2d0e7bedd02ac8c9e1c35f213ec95a28770.jpg"
    }
}