{
    "id": "e4e0abf3-43b9-4b6a-8861-3e0834ea4cc8",
    "created_at": "2023-01-12T15:10:23.716494Z",
    "updated_at": "2025-03-27T02:05:21.745187Z",
    "deleted_at": null,
    "sha1_hash": "bd860786dcd224f3b624fba1d661189c913751fd",
    "title": "2021-04-29 - Leaping Down a Rabbit Hole of Fraud and Misdirection",
    "authors": "",
    "file_creation_date": "2022-05-28T19:40:53Z",
    "file_modification_date": "2022-05-28T19:40:53Z",
    "file_size": 211988,
    "plain_text": "# Leaping Down a Rabbit Hole of Fraud and Misdirection\n\n**[domaintools.com/resources/blog/leaping-down-a-rabbit-hole-of-fraud-and-misdirection](https://www.domaintools.com/resources/blog/leaping-down-a-rabbit-hole-of-fraud-and-misdirection)**\n\n## Background\n\nWhile much security research and analysis focuses on active, disruptive attacks such as\nransomware or state-directed espionage operations, computer-facilitated fraud remains one\nof the most impactful threats in terms of financial cost to most organizations. Although many\n[varieties of fraud exist, the most prevalent at present is Business Email Compromise (BEC).](https://www.fbi.gov/scams-and-safety/common-scams-and-crimes/business-email-compromise)\nIn BEC events, fraudsters seek to breach or subvert trust relationships between\norganizations and vendors, suppliers, or other entities with which they may have a financial\nor similar relationship.\n\n\n-----\n\nMultiple avenues exist for malicious entities to subvert trust relationships to execute BEC\nactivity:\n\nUtilize compromise of an entity to capture legitimate email communications to spoof or\ninject into existing conversations.\nInitiate communications posing as a likely trusted entity to build trust leading to a\nfinancial transaction.\nLeverage a combination of communication mechanisms—such as blending emails\nwith phone calls to personnel at the victim organization—to both build trust and\nurgency around an item.\n\nOverall, the goal remains the same: build trust and confidence on the victim side leading to\nan eventual fraudulent financial transaction. While seemingly non-technical and\n“unsophisticated” in nature, BEC activity leads to significant financial losses. Recent reports\n[indicate per-incident BEC events average over $80,000, with](https://docs.apwg.org//reports/apwg_trends_report_q2_2020.pdf) aggregate costs to victims\nexceeding $2 billion in 2020.\n\nWhile there are multiple avenues to achieve BEC-related activity, the remainder of this post\nwill focus on spoofing legitimate entities through domain registrations. Although directly\ncorrelating registration activity with fraud is difficult absent viewing actual emails, analysis of\ninfrastructure characteristics can reveal tendencies aligned with BEC-like actions and\nidentify likely malicious infrastructure.\n\n## It Started with a Domain\n\nDomainTools researchers identified an interesting domain created in late April 2021,\n[spoofing the legitimate industrial supply company Grainger:](https://www.grainger.com/)\n\n\n-----\n\nWhile the domain, graianger[.]com, is associated with historical hosting data going back to\n2014, the item was dormant until it was re-registered on 19 April 2021. At the time of this\nanalysis, the domain redirects to a “parking” IP, 193.239.84[.]207, that is associated with\nover a thousand other domains. At first glance, it would appear this item is inactive or inert\n[—except further exploration of DNS records identifies a Mail Exchange (MX) record](https://www.cloudflare.com/learning/dns/dns-records/dns-mx-record/)\n[associated with third-party mail provider MailHostBox.](https://support.mailhostbox.com/getting-started/)\n\nAlthough at this stage no “smoking gun” exists clearly linking this domain to malicious\nactivity, a number of prerequisites for doing so are satisfied:\n\nCreating a network item spoofing an organization with which a victim would likely\nconduct some financial transactions and linked communication.\nWhile the domain remains effectively unhosted for HTTP/HTTPS purposes (e.g., there\nis no active webpage of interest), the domain does have an active MX record through\na third-party provider, enabling sending and receiving of email.\n\n\n-----\n\nWith the above in place, a fraudulent actor could send invoice or purchase order themed\nmessages posing as the legitimate industrial supplier to victims. While the industrial supplier\nis not harmed through this action (except potentially loss of reputation), the violation or\nsubversion of implicit vendor-purchaser trust can enable subsequent fraudulent financial\ntransactions.\n\nTo gain more context on the activity in question, we can explore the characteristics of the\n[domain—viewing it as a composite network object—to develop a better understanding for](https://www.domaintools.com/content/formulating-a-robust-pivoting-methodology.pdf)\nhow such items are created, as well as potentially identifying linked registrations.\n\n## Expanding on Selectors\n\nAs seen in the original screenshot of the spoofing domain above, there are several\nobservations that can be leveraged to look for linked infrastructure:\n\nA registrant email address, mcdonaldservice[AT]gmail[.]com.\nA registrant name, “Mark Grabill.”\nA registrant organization, “McDonald Service Inc.”\n\n[Using DomainTools Iris investigation platform, we can quickly identify a list of 249 additional](https://www.domaintools.com/products/iris)\ndomains that share one or more of these observations, listed in Appendix A. Aside from just\nidentifying additional indicators, we also reveal more fundamental aspects of how a given\npersona registers, hosts, and potentially uses infrastructure. While we certainly discover\nnew discrete observations through this process that can be used for immediate defense,\nthis type of [behavior-centric pivoting also allows us to understand behaviors moving forward](https://www.domaintools.com/content/formulating-a-robust-pivoting-methodology.pdf)\nfor future-oriented defense.\n\nWhile some underlying variation exists, the majority of records cluster around the following\ncharacteristics:\n\nUsing the PublicDomainRegistry registrar for domain creation.\nAssociation with either foundationapi[.]com or monovm[.]com as authoritative name\nservers.\nTypical hosting on domain “parking” locations associated with M247 Europe SRL,\nConfluence Networks, or YHC Corporation.\nTypical use of the MailHostBox third-party email hosting service.\nAssociation with the following email addresses: mcdonaldservice[AT]gmail[.]com,\nmark.grabill001[AT]gmail[.]com, gracechen793[AT]gmail.com,\nm.ilenradumilo[AT]gmail[.]com, or bmillner129[AT]gmail[.]com.\n\nAgain, while there are a number of exceptions to the above observations in the identified\ndata set, the items listed previously account for over 80% of the observed domains. From\nthese more general characteristics, we can apply more refined searching via DomainTools\n\n\n-----\n\nIris to unearth additional observations, and improve our understanding of how this particular\nentity or actor creates network infrastructure.\n\nThe above relationships—including outliers and variations—can be seen in the following\nDomainTools Iris visualization:\n\n## Exposing Likely Campaigns\n\nUtilizing these characteristics described in the previous section, we can identify over 6,000\nadditional domains featuring a combination of these observables. More importantly, through\nsome investigation and further analysis, definite “themes” emerge which likely represent\ntypes of activity, lures, or even particular targets for fraudulent activity.\n\n### Industrial Supply Companies\n\nThe initial item prompting this investigation related to an industrial supply company based in\nthe United States. Further review of the list of domains identifies several other examples of\nsimilar activity:\n\n**Suspicious Domain** **Likely Spoofed Entity**\n\n\n-----\n\n**Suspicious Domain** **Likely Spoofed Entity**\n\nbeckeelectric[.]com Beck Electric Supply (beckelectric.com)\n\ncolonailelectric[.]com Colonial Electric (colonialelectric.com)\n\ndililonsupply[.]com Dillon Supply (dillonsupply.com)\n\ndilllonsupply[.]com Dillon Supply (dillonsupply.com)\n\neaton-us[.]com Eaton Corporation (eaton.com)\n\neliottelectricsupply[.]com Elliott Electric Supply (elliottelectric.com)\n\nfatesnal[.]com Fastenal (fastenal.com)\n\nfranklinelectrics[.]com Franklin Electric (franklin-electric.com)\n\ngraianger[.]com Grainger (grainger.com)\n\nhdssupply[.]com Home Depot Supply (hdsupply.com)\n\njohnosoncontrols[.]com Johnson Controls (johnsoncontrols.com)\n\npttsupply[.]com Power & Tel Supply (ptsupply.com)\n\nIt is possible that these domains could be used to phish the spoofed organization as a\nmeans to gain initial access to these environments. Yet, given the overall characteristics of\nthe registering entities so far, a more likely scenario is spoofing these various industrial\nsuppliers for the purpose of sending fake invoices or other correspondence leading to\npayout to the malicious actor. The above list is extensive, ranging from multinational\nindustrial component manufacturers to diversified national supply companies to regional\nelectric component sellers. Similarly, the risk from such activity would extend from very\nlarge organizations—such as major manufacturers, or industrial entities—to smaller\ncontractors or specialized manufacturing concerns.\n\n### US Government Entities\n\nA similar pattern of widespread, geographically diverse (although focused exclusively on the\nUnited States) domain creation appears with spoofing of various national, state, and local\ngovernment authorities:\n\n**Suspicious Domain** **Likely Spoofed Entity**\n\nazdoa-gov[.]org Arizona Department of Administration\n\ndas-nh-gov[.]org New Hampshire Department of Administrative Services\n\n\n-----\n\n**Suspicious Domain** **Likely Spoofed Entity**\n\ndas-nhgov[.]org New Hampshire Department of Administrative Services\n\ndelaware-gov[.]us Delaware State Government\n\ndfa-arkansas-gov[.]us Arkansas Department of Finance and Administration\n\ndgs-ca-gov[.]us California Department of General Services\n\ndhs-state-il[.]us Illinois Department of Human Services\n\ndir-tx-gov[.]us Texas Department of Information Resources\n\ndms-my-florida[.]com Florida Department of Management Services\n\ngsa-gov[.]org US General Services Administration\n\n\nmmd-admin-statemn[.]us\n\n\nMinnesota Office of State Procurement\n\n\nnasssaucountyfl[.]com Nassau County, Florida\n\nnebraska-gov[.]org Nebraska State Government\n\nnjstart-nj-gov[.]org Division of New Jersey State Purchase and Property\nDepartment\n\noa-mo-gov[.]us Missouri Office of Administration\n\nohio-gov[.]us Ohio State Government\n\nomes-ok-gov[.]org Oklahoma Office of Management and Enterprise Services\n\nstate-de[.]us Delaware State Government\n\ntarannttcounty[.]com Tarrant County, Texas\n\ntn-gov[.]us Tennessee State Government\n\nvita-virginia-gov[.]us Virginia IT Agency\n\nwyo-gov[.]us Wyoming State Government\n\nWhile a number of general, state-level domains are spoofed in the above list, the observed\nfocus is on items related to purchasing, procurement, or IT services. From the perspective\nof an actor committing fraud, these represent ideal entities to impersonate when initiating\ncommunications with a business, contractor, or similar entity to mimic government\nprocurement authorities. While DomainTools unfortunately does not have an example of a\n\n\n-----\n\nspecific email related to the above items, the likely use for any of the above would be to\nimpersonate the given agency while attempting to recover costs, reconcile billing, or\nperform some other financial activity.\n\n### Educational Institutions\n\nFinally, DomainTools researchers noted a number of educational institutions in the list of\nmimicked items:\n\n**Suspicious Domain** **Likely Spoofed Entity**\n\nmaricopa-edu[.]us Maricopa County (AZ) Community Colleges\n\nmarionsschools[.]net Marion County (GA) School District\n\nprocurement-utoronto[.]ca University of Toronto\n\nschoolhaelth[.]com Health Supplies Provider for Educational Institutions\n\nucsc-edu[.]org University of California, Santa Cruz\n\numn-edu[.]us University of Minnesota\n\nunf-edu[.]org University of North Florida\n\nunfedu[.]org University of North Florida\n\nunimanchester[.]co[.]uk University of Manchester\n\nuniwestminister[.]co[.]uk University of Westminster, London\n\nvirgina-edu[.]org University of Virginia\n\nwisc-edu[.]us University of Wisconsin\n\nSimilar to the government-spoofing entities identified above, these educational items could\nbe used for a variety of purposes. Yet given the overall registration characteristics and\ndetails, likely application would be injection into existing or starting new conversations\naround potential cost and payment corrections resulting in a transfer of funds from a\nbusiness, vendor, or contractor that already has a legitimate relationship with the institution\nto the fraudulent entity.\n\n## Implications and Defense\n\nOverall, the set of identified domains leverage common registration and communication\ntechniques to subvert existing trust relationships between vendors and customers of various\ntypes. Although superficially unsophisticated in a technical sense, the combination of\n\n\n-----\n\nrequired organizational understanding, social engineering, and ultimate cost to victims\nmake these sorts of incidents extremely problematic. Even more worrying for defenders,\nsuch events do not need to leverage obviously malicious items such as malware or\nweaponized documents to be effective—so long as mail is delivered and responded to, the\nfraudsters responsible can begin building trust leading to a financial transaction.\n\nOne potential mechanism to respond to or mitigate such events is through real-time, rapid\nenrichment of observations to determine when they match malicious patterns. For example,\nutilizing a Security and Information Event Management (SIEM) system combined with autoenrichment of observations from data sources such as the DomainTools Application\nPrograming Interface (API) or [DomainTools PhishEye can allow for rapid disposition of](https://www.domaintools.com/resources/user-guides/phisheye)\nsuspicious items such as fraudulent emails.\n\nExamples can range from the relatively simplistic to the complex. On the simplistic end,\ndefenders can implement detection logic in their environment to identify patterns such as\n“double TLDs” which frequently occur in the dataset examined in this blog. Examples\ninclude domains ending in “edu” or “gov” but then followed by another TLD such as “org” or\n[“us.” Similar to malware using “double extensions” and other forms of masquerading, such](https://attack.mitre.org/techniques/T1036/)\npatterns attempt to trick human interpretation to mimic a legitimate or otherwise benign\nitem. Flagging such circumstances (or blocking them outright, if the risk is deemed\nsufficient) can reduce the threat of such activity.\n\nOn a more complex level, automated enrichment and evaluation can enable powerful\nmechanisms to detect patterns of malicious behavior. For example, most of the items\nidentified in this report—along with a multitude of similar malicious domains—utilize the\nsame pattern of authoritative name server, hosting provider, and MX record. When an\norganization can identify these characteristics of a new sender mail domain on receipt\nthrough automated enrichment, defenders can rapidly disposition these items to either flag\nthem for further review or block them outright. Given the multitude of potential character\n[combinations to produce typosquatting domains, being able to alert or act on the](https://www.mcafee.com/blogs/consumer/what-is-typosquatting/)\ncharacteristics of the given sender domain as opposed to just the domain itself can be vital\nin architecting a robust and sustainable defensive posture.\n\n## Conclusions\n\nBEC remains a significant risk to many organizations, with the possibility of severe financial\nloss resulting from successful iterations of this activity. Yet while the activity in question is\npurportedly “unsophisticated” by the assessment of many information security practitioners\n(given its reliance on social engineering and relationship spoofing as opposed to pure\ntechnical acumen), actually detecting and defeating such activity remains quite difficult.\n\nIn this posting, DomainTools researchers identified not just a methodology for uncovering\nlikely campaigns or at least consistent actors involved in such operations, but also\ndefensive advice for how to meet the challenge of BEC. Through understanding and\n\n\n-----\n\nanalysis of adversary tendencies in creating infrastructure designed to mimic legitimate\norganizations, defenders can focus on the fundamental behaviors behind such activity to\nbuild defenses against future instantiations of such patterns.\n\nBy taking this forward-looking approach, which requires the ability to analyze newlyobserved network infrastructure in near real-time, defenders can migrate beyond constant\n“backward looking” defense against fraud (and other threats). In doing so, defenders can\nenable sustainable, effective defense while preserving fundamental organizational value.\nWhether BEC or state-sponsored espionage, understanding how adversaries operate,\nenriching data to draw out fundamental aspects of technical observations, and creating\nsecurity alerts or blocks around such an enriched perspective represent the requirements\nfor modern, sustainable network defense.\n\n## Appendix A - Initial Domains\n\n[Download the full .csv file here.](https://info.domaintools.com/rs/132-OHD-785/images/leaping-down-a-rabbit-hole-of-fraud-and-misdirection-initial-domains-appendix-a.csv)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - Leaping Down a Rabbit Hole of Fraud and Misdirection.pdf"
    ],
    "report_names": [
        "2021-04-29 - Leaping Down a Rabbit Hole of Fraud and Misdirection.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536223,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653766853,
    "ts_modification_date": 1653766853,
    "files": {
        "pdf": "https://archive.orkl.eu/bd860786dcd224f3b624fba1d661189c913751fd.pdf",
        "text": "https://archive.orkl.eu/bd860786dcd224f3b624fba1d661189c913751fd.txt",
        "img": "https://archive.orkl.eu/bd860786dcd224f3b624fba1d661189c913751fd.jpg"
    }
}