{
    "id": "e4f72796-978d-4a41-b671-5c591a5bd9b8",
    "created_at": "2023-01-12T15:04:42.033728Z",
    "updated_at": "2025-03-27T02:05:39.561338Z",
    "deleted_at": null,
    "sha1_hash": "09f7ace27f31a54852ec3275099125d6010d2e79",
    "title": "2016-07-30 - Luminosity RAT - Re-purposed",
    "authors": "",
    "file_creation_date": "2022-05-28T17:49:25Z",
    "file_modification_date": "2022-05-28T17:49:25Z",
    "file_size": 810357,
    "plain_text": "# Luminosity RAT - Re-purposed\n\n**[malwarenailed.blogspot.com/2016/07/luminosity-rat-re-purposed.html](http://malwarenailed.blogspot.com/2016/07/luminosity-rat-re-purposed.html)**\n\nmalwarenailed\n\nSo I came across a sample which was sent inside a .7z file and strangely was detected by a\nfile filter and not any spam or antivirus filter. The file was interestingly named as\nEmiratedNBD.exe, which indicates that this attack is targeted to the region as Emirates NBD\nis one of the biggest financial entities in the GCC region. The sample was not identified by\nany antivirus and also unknown to Virustotal till today.\n\nMD5: 9b2da7bfb9dedaba7e4d14d623081d7f\n\nSHA1: cfa3ce2a7743181775870d00f4f418efdd737a31\n\nMoreover, the file seem encrypted as there were not many strings found and only a few\nlibraries were visible in the import directory. The sample is coded in .NET C#.\n\nI have performed basic static and dynamic analysis of the sample and inital findings strongly\nindicates that the sample is an encrypted payload of Luminosity RAT which is infecting the\nendpoint and performing a C2 communication with its server (C2 ip address: 204.45.103.37).\nTill date there is not much OSTI available on this ip address.\n\nThe sample when starts as a process, seems to start a child process in suspended mode\nand writes its memory space with the decrypted payload. The decrypted payload is\nresponsible for all Botnet communication with the C2 server. The original parent process\nterminates after spawning the child process. I was able to extract many useful strings from\nthe memory of the running child process. I also noticed another artifact left by the sample\n\"explorer.exe\" in the temp folder and placed in the startup as an IE shortcut.\n\nThe sample bot beaconing is periodic and seems to be utilizing a custom network protocol\nwhereby destination port is 19881 and the information sent to the C2 server comprise of\ninformation on analysis tools running and the GUI processes which are running, the domain\nand user information, OS version, something \"True\", Antivirus running, a hash of some sort,\ncurrent date, an \"N\" and lastly 8_=_8 in the end. It is noticeable that the request sent across\n\n\n-----\n\nis always preceded by a ping to the ip address. The communication from the client starts with\n\"CONNECT\" and each message is preceded by \"=P4CK3T\". The response from the server\nis \"ACT=P4CK3T=8_=_8\".\n\nFireEye detects the communication protcol as Trojan Luminosity Link.\n\nAttempting to decompile the sample with .NET Reflector and JetBrains dotPeek yields no\nresults obviously as the sample is encrypted. DEbugging with DILE also yields no results as\nthe execution never stops at the entry point mentioned in the optional headers of the PE.\n\nI had to resort on ILSPY to decompile to CIL opcode and see what is going on. Currently, I\nam also searching for some other ways to successfully debug the sample. The decompiled\nopcode shows the entry point of the code is the module lohnfraz(\"lohnfraz.NN v5.5.5\").\n\nThe sample looks for certain config and ini files as well in the same directory as the sample,\nindicating that it was accompanied by some configuration and I am guessing that the threat\nactors have re-purposed the Luminosity RAT, encrypted the client payload and delivered\nthrough inside a weaponized .7z archive, aimed to target the GCC region.\n\nThe sample detection by file filter\n\n\n-----\n\nThe email header\n\nThe delivery\n\nContained communication\n\nProcess spawning the child process\n\n\n-----\n\nProc Mon Activity output\n\nLooking for config file\n\nLooking for INI configuration\n\nMalware can check if there are any unusual entries under the IFEO key(s) as a way of\ndetermining if it has landed on an analysts machine and change its behavior accordingly.\n\nThis file is created in the temp folder with the MD5 hash value of the original binary. I am\n\nguessing this is an integrity check being done by the sample of itself\n\nSome of the interesting strings extracted from the decrypted child process memory space:\n\n\n-----\n\nThe explorer.exe artifact left by the sample\n\n\n-----\n\nSome more strings showings various commands to be received from the server and\nexecuted on the client. We can also see reference to Luminosity in some of the detected\nstrings\n\n\n-----\n\nnet user and net localgroup commands to add local users and to add them to most probably\nlocal admin group.\n\n\n-----\n\nip address of C2 server hard coded\n\n\n-----\n\nOne of client message (hello to C2 server)\n\nping before every request\n\nClient communications\n\n\n-----\n\nServer replies\n\nDe-compile failure\n\nDe-compile failure\n\n\n-----\n\nReversing the CIL opcode\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-07-30 - Luminosity RAT - Re-purposed.pdf"
    ],
    "report_names": [
        "2016-07-30 - Luminosity RAT - Re-purposed.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535882,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653760165,
    "ts_modification_date": 1653760165,
    "files": {
        "pdf": "https://archive.orkl.eu/09f7ace27f31a54852ec3275099125d6010d2e79.pdf",
        "text": "https://archive.orkl.eu/09f7ace27f31a54852ec3275099125d6010d2e79.txt",
        "img": "https://archive.orkl.eu/09f7ace27f31a54852ec3275099125d6010d2e79.jpg"
    }
}