{
    "id": "e5013596-c425-4b02-a638-ea915112197e",
    "created_at": "2023-01-12T15:08:25.17202Z",
    "updated_at": "2025-03-27T02:15:59.298823Z",
    "deleted_at": null,
    "sha1_hash": "4ec374a288e8e8acf27346b66821931bfd1da053",
    "title": "2019-09-24 - REvil-Sodinokibi Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T22:01:17Z",
    "file_modification_date": "2022-05-28T22:01:17Z",
    "file_size": 1327938,
    "plain_text": "# REvil/Sodinokibi Ransomware\n\n**secureworks.com/research/revil-sodinokibi-ransomware**\n\nCounter Threat Unit Research Team\n\n## Summary\n\nThe [REvil (also known as Sodinokibi) ransomware was first identified on April 17, 2019. It is used](https://twitter.com/VK_Intel/status/1143544498913456128)\nby the financially motivated GOLD SOUTHFIELD threat group, which distributes ransomware via\nexploit kits, scan-and-exploit techniques, RDP servers, and backdoored software installers.\n\n\n-----\n\nSecureworks® Counter Threat Unit (CTU) analysis suggests that REvil is likely associated with\nthe GandCrab ransomware due to similar code and the emergence of REvil as GandCrab activity\ndeclined. CTU™ researchers attribute GandCrab to the GOLD GARDEN threat group.\n\nREvil can perform the following tasks. Most of these capabilities are configurable, which allows an\nattacker to fine-tune the payload.\n\n[Exploit the CVE-2018-8453 vulnerability to elevate privileges](https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2018-8453)\nTerminate blacklisted processes prior to encryption to eliminate resource conflicts\nWipe the contents of blacklisted folders\nEncrypt non-whitelisted files and folders on local storage devices and network shares\nExfiltrate basic host information\n\n## Configuration\n\nThe REvil sample analyzed by CTU researchers stored the encoded configuration as a resource\nnamed .m69 (see Figure 1) within the unpacked binary. The first 32 bytes of this resource form the\nkey used to decode the configuration. The remaining bytes are the encoded configuration.\n\n\n-----\n\n_Figure 1. REvil executable resource containing the encoded configuration and the decode key._\n_(Source: Secureworks)_\n\nThe decoded value is a JSON-formatted string that contains the configurable REvil elements. In the\nsample shown in Figure 2, word-wrapping was disabled due to the value length within the \"dmn\"\nand \"nbody\" configuration keys. As a result, the values in these keys are truncated.\n\n\n-----\n\n_Figure 2. REvil decoded configuration JSON. (Source: Secureworks)_\n\nTable 1 lists the configuration keys and their purpose. An additional REvil configuration parameter\nnot located within the configuration JSON is the \"-nolan\" switch, which can be passed to the\nransomware executable at runtime. By default, REvil attempts to identify attached network shares\nand encrypt their contents. Passing the -nolan switch to the REvil executable disables this\nfunctionality.\n\n**Key** **Definition**\n\ndbg True/false value used by the malware author during development (referenced only when\ndetermining if the victim is Russian)\n\ndmn Semicolon-delimited list of fully qualified domain names that represent REvil command\nand control (C2) servers\n\nexp True/false value that determines if REvil should attempt to elevate privileges by\nexploiting a local privilege escalation (LPE) vulnerability\n\nfast True/false value that determines how files larger than 65535 bytes are encrypted\n\nimg Base64-encoded value of the text placed at the top of the background image created\nand set by REvil\n\nnbody Base64-encoded value of the ransomware note text dropped in folders where files were\nencrypted\n\nnname Filename string of the ransomware note dropped in folders where files were encrypted\n\n\n-----\n\n**Key** **Definition**\n\nnet True/false value that determines if REvil should attempt to exfiltrate basic host and\nmalware information to the configured C2 servers listed in the dmn key\n\npid Integer value that is only referenced if the \"net\" key is set to send basic host and\nmalware information to the C2 server; likely associated with the sub key and could be a\ncampaign or affiliate identifier\n\nsub Integer value that is only referenced when sending basic host and malware information\nto the C2 server if configured to do so via the net key; likely associated with the \"pid\"\nconfig key and could be a campaign or affiliate identifier\n\npk Base64-encoded value representing the attacker's public key used to encrypt files\n\nprc An array of strings representing process names that REvil attempts to terminate prior to\nencrypting and/or wiping folders to prevent resource conflicts\n\nwipe True/false value that determines if REvil attempts to wipe blacklisted folders specified in\nthe wfld key\n\nwfld An array of strings representing blacklisted folder name values; if the wipe key is\nconfigured, then REvil attempts to delete (wipe) these folders prior to encrypting\n\nwht Contains the following subkeys representing whitelisted values that REvil will not\nencrypt:\n\next — Whitelisted file extensions\nfld — Whitelisted folder name values\nfls — Explicit whitelisted filenames\n\n_Table 1. REvil configuration keys and definitions._\n\n## Delivery\n\nWhen REvil was first discovered, it was delivered to targets via exploitation of Oracle WebLogic\nvulnerabilities. Since then, the threat actors have expanded delivery to include malicious spam\ncampaigns, [RDP attacks, and other attack vectors. There are](https://twitter.com/VirITeXplorer/status/1133302287491842049) [reports that the threat actors](https://www.drcommodore.it/2019/06/20/hackerato-winrar-it-malware-al-posto-del-programma/)\nleveraged a strategic web compromise (SWC) to deliver REvil by compromising the Italian WinRAR\n. it website and replacing the WinRAR installation executable with an instance of the malware. The\n[SWC resulted in the infection of unsuspecting WinRAR customers' systems. In other reports, threat](https://www.reddit.com/r/msp/comments/c2wls0/kaseya_weaponized_to_deliver_sodinokibi_ransomware/)\nactors breached at least three managed service providers (MSPs) and used the access to deploy\nREvil to the MSPs' customers. The diversity and complexity of delivery mechanisms employed by\nthe REvil threat actors in a short period of time suggest a high level of sophistication.\n\n## Execution flow\n\nFigure 3 highlights the execution flow of REvil's core functionality. Subsequent sections describe\neach of these tasks.\n\n\n-----\n\n_Figure 3. REvil execution flow. (Source: Secureworks)_\n\n### Create mutex and validate runtime privileges\n\nFigure 4 depicts the initial high-level functionality REvil exhibits when executed. The malware\ndynamically resolves the system library functions that it leverages by comparing the CRC32 hash of\nfunction names for a given library to a list of precalculated hashes stored within the REvil binary.\nREvil then loads functions whose CRC32-hashed name matches precalculated hashes. This control\nevades detection via static analysis.\n\n_Figure 4. REvil decompiled pseudocode depicting initial high-level functionality. (Source:_\n_Secureworks)_\n\n\n-----\n\nOnce all functions are resolved, REvil verifies that there are no other instances of itself running on\nthe host by attempting to create a mutex using a hard-coded value as its name (e.g., C19C0A84FA11-3F9C-C3BC-0BCB16922ABF). Because the value is hard-coded rather than determined by a\nconfiguration variable or dynamically generated at runtime based on the host's characteristics, it can\nbe used as an indicator to detect or prevent a REvil infection.\n\nIf mutex creation is successful, REvil queries the \"exp\" key within its configuration and attempts to\nelevate privileges using an LPE exploit if this key is enabled. REvil executes either 32-bit or 64-bit\nshellcode depending on the host's architecture. The code appears to exploit CVE-2018-8453 using\n[a method similar to one detailed by researchers.](https://securelist.com/cve-2018-8453-used-in-targeted-attacks/88151/)\n\nRegardless of whether exploitation is configured to run, REvil verifies that it is currently running with\nadministrative rights by ensuring its TokenElevationType is set to TokenElevationTypeFull and its\nintegrity level is set to a minimum level of High. If the process is running with Low integrity, REvil\nterminates the current process and launches another instance of itself via ShellExecute using the\n\"runas\" command, which executes the new instance with administrative rights.\n\nREvil performs another privilege-related validation within its main function prior to profiling host\ninformation. If REvil's current process is running with system-level integrity, then the process\nattempts to impersonate the security context of the first explorer.exe process it finds running on the\ncompromised system.\n\n### Prepare for encryption\n\nThis phase of REvil's execution flow generates and stores encryption configuration and victim\nmetadata elements.\n\n**Generate unique ID (UID)**\n\nREvil generates a unique identifier (UID) for the host using the following process. The UID is part of\nthe payment URL referenced in the dropped ransom note.\n\n1. Obtains the volume serial number for the system drive\n2. Generates a CRC32 hash of the volume serial number using the hard-coded seed value of\n\n0x539\n[3. Generates a CRC32 hash of the value returned by the CPUID assembly instruction using the](https://c9x.me/x86/html/file_module_x86_id_45.html)\n\nCRC32 hash for the volume serial number as a seed value\n4. Appends the volume serial number to the CPUID CRC32 hash\n\nFor example, the volume serial number F284306B results in a CRC32 hash value of 6EBCF131.\nThe CPUID value of \"Intel(R) Core(TM) i7-4850HQ CPU @ 2.30GHz\" results in a CRC32 hash\nvalue of F3FD1FCF. REvil appends the volume serial number (F284306B) to the CPUID CRC32\nhash (F3FD1FCF) to create the UID string \"F3FD1FCFF284306B\".\n\n**Generate encryption keys**\n\n\n-----\n\nREvil determines if it has already generated and stored the session encryption keys in the host s\nregistry. Table 2 lists the registry key/value pairs generated within either the\nHKEY_LOCAL_MACHINE (HKLM) or HKEY_CURRENT_USER (HKCU) hives. The malware\ndefaults to using the HKLM registry hive. However, if writing to this hive is unsuccessful (likely due\nto lack of privileges), it uses HKCU. All REvil samples observed by CTU researchers as of this\npublication use the hard-coded \"Software\\recfg\" registry subkey. The presence of this key or the\nassociated values could indicate a REvil infection.\n\n\n**Registry**\n**value**\n\n\n**Registry value description**\n\n\npk_key Session public key\n\nsk_key Session private key encrypted with the attacker's public key in REvil's\nconfiguration\n\n0_key Session private key encrypted with the public key embedded in REvil's binary\n\n_Table 2. Registry values containing REvil session encryption keys._\n\nREvil generates a session public/private keypair if the registry values do not exist. The 32-byte\nsession public key is stored as pk_key within the recfg registry without encoding or encryption. The\nsession private key is encrypted using the attacker's public key, which is stored in the pk_key of\nREvil's JSON configuration. The resulting 88-byte encrypted value is then stored as sk_key within\nthe recfg registry subkey.\n\nFinally, the original unencrypted session private key is encrypted using a different public key that is\nhard-coded within the REvil binary. In the analyzed sample, the ASCII representation of this\nembedded 32-byte key is\n79CD20FCE73EE1B81A433812C156281A04C92255E0D708BB9F0B1F1CB9130635. The\nresulting 88-byte encrypted session private key is stored as 0_key within the recfg registry subkey.\n\n**Generate random file extension**\n\nREvil checks the Software\\recfg registry key for the presence of the rnd_ext value. This value\ncontains the random extension generated at runtime that is appended to encrypted files. If this\nregistry value does not exist, the malware generates a random string of lowercase letters (a-z) and\nnumbers (0-9) ranging from five to ten characters in length (inclusive) and preceded by a period\n(e.g., .9781xsd4). This string is assigned to the rnd_ext value within the recfg registry subkey.\n\n**Profile host information**\n\nREvil profiles the compromised host by collecting the following information:\n\nCurrent username\nHostname\nWorkgroup/domain name\nLocale\nRussian keyboard layout (true/false)\n\n\n-----\n\nOperating system product name\nFixed drive details\nCPU architecture\n\nThe malware converts the information into a \"stat\" JSON data structure and adds additional keys\nassociated with the malware. The values assigned to these keys are specific to the campaign and\nhost, but the following data includes example variables:\n```\n{\n \"bit\": 86,\n \"bro\": false,\n \"dsk\": \"QwADAAAAAPDf/xgAAAAA0LxsFQAAAA==\",\n \"grp\": \"WORKGROUP\",\n \"lng\": \"en-US\",\n \"net\": \"VICTIM-HOSTNAME\",\n \"os\": \"Windows 8.1 Pro\",\n \"pid\": \"7\",\n \"pk\": \"nAjfiPcoIyeIwwCkM1hLhXo5HUQMtrAB+7m8eHzerho=\",\n \"sk\":\n\"ww8h065kK3Tm7Thg/Y0nT3tSLReYMJUoaVVIkkDq8/L/5k1IcaoVFKkDtKcrdap6Q1mzZd+B6oAD2McVjLnWu6F/w0VV\n \"sub\": \"3\",\n \"uid\": \"F3FD1FCFF284306B\",\n \"unm\": \"VICTIM-USERNAME\",\n \"ver\": 257\n}\n\n```\nTable 3 defines the keys used in the stat JSON data structure.\n\n**Key** **Description**\n\nbit CPU architecture of the host (86 refers to x86 or 32-bit CPU)\n\nbro True/false value indicating if a Russian keyboard layout was detected\n\ndsk Base64-encoded binary value describing the host's fixed drive, including the drive letter,\ndrive type, total size, and free space\n\ngrp Host's workgroup name\n\nlng Host's locale information\n\nnet Host's hostname\n\nos Host's operating system\n\npid Unknown integer value obtained from the ransomware's configuration; likely associated\nwith the sub key and could be a campaign or affiliate identifier\n\npk Base64-encoded attacker's public key obtained from the ransomware's configuration and\nused in the file encryption process\n\n\n-----\n\n**Key** **Description**\n\nsk Base64-encoded encrypted session private key generated at runtime and encrypted using\nthe attacker's public key\n\nsub Unknown integer value obtained from the ransomware's configuration; likely associated\nwith the pid key and could be a campaign or affiliate identifier\n\nuid UID value generated at runtime comprised of the CRC32 hash of both the host's volume\nserial number and CPUID\n\nunm Victim's username\n\nver Unknown hard-coded value that could be the ransomware executable version number\n\n_Table 3. REvil stat JSON data structure keys and definitions._\n\nREvil encrypts the stat JSON data structure with the same algorithm used to encrypt the session\nprivate key stored to the registry. However, a different hard-coded public key is dedicated to\nencrypting this host profile information. In the analyzed sample, the ASCII representation of these\nembedded key bytes is\n\"367D49308535C2C368604B4B7ABE8353ABE68E42F9C662A5D06AADC6F17DF61D\". The\nresulting encrypted data is then stored within a registry value named \"stat\" located in the\n\\Software\\recfg\\ registry subkey. Figure 5 shows all registry values stored by REvil during this\nexecution phase.\n\n_Figure 5. Registry key and values created by REvil. (Source: Secureworks)_\n\n**Configure ransom note**\n\nFigure 6 shows the Base64-decoded ransom note template stored in the nbody key of REvil's\nconfiguration. As indicated by the red arrows, the variable placeholders {EXT}, {UID}, and {KEY}\nappear on lines 5, 20, 24, 31, and 36.\n\n\n-----\n\n_Figure 6. REvil's Base64-decoded ransom note template with variable placeholders. (Source:_\n_Secureworks)_\n\nFigure 7 shows contents of the ransomware note template with the variable placeholders populated\nwith their corresponding values:\n\n\n-----\n\n{EXT} — Replaced with the random extension (e.g., 9781xsd4) that was generated at runtime,\nstored within the rnd_ext registry value, and appended to encrypted filenames\n{UID} — Replaced with the UID value comprised of the host's volume serial number and\nCPUID (The inclusion of this UID in the URIs provided to victims post-encryption indicates that\nthe threat actors can use it to identify and track unique victims.)\n{KEY} — Replaced with the Base64-encoded representation of the encrypted stat data in\nTable 3\n\n\n-----\n\n_Figure 7. REvil's ransom note populated with values calculated at runtime. (Source: Secureworks)_\n\nREvil generates the ransom note's filename using a similar process. It obtains the value stored\nwithin the \"nname\" key in its configuration and replaces the {EXT} variable placeholder with its\ncorresponding value. In the analyzed sample, the nname key value \"{EXT}-HOW-TO-DECRYPT.txt\"\nled to the ransom note filename 9781xsd4-HOW-TO-DECRYPT.txt.\n\n**Configure background image text**\n\n\n-----\n\nREvil formats the text placed in the upper center of the new background image displayed after\nencryption occurs. REvil obtains the value stored within its img key, Base64-decodes it, and\nreplaces the {EXT} variable placeholder with the resulting value. In the analyzed sample, \"You are\ninfected! Read {EXT}-HOW-TO-DECRYPT.txt!\" became \"You are infected! Read 9781xsd4-HOWTO-DECRYPT.txt!\"\n\n**Check for command-line switches**\n\nREvil checks for command-line switches passed to the executable when it was launched. The\nanalyzed sample supports a single command-line switch: -nolan. By default, REvil encrypts the\ncontents of local fixed hard drives and network-attached shares. If the -nolan command-line switch\nis passed when the binary is launched, REvil ignores network-connected resources.\n\n### Validate target is whitelisted\n\n[The malware calls User32.dll's GetKeyboardLayoutList function, inspects the keyboard identifier,](https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/windows-language-pack-default-values)\nand returns true if the result ends in a value between \\x18 thru \\x44 inclusive. This result means the\ncompromised host is whitelisted based on the host's configured keyboard layout. The malware\ninspects only the lower byte of the full keyboard identifier, so all systems using the keyboard locales\nlisted in Table 4 are immune to REvil. Despite the large number of potential matches, CTU\nresearchers suspect that the malware author intended to identify Russian keyboards based on\nseveral other links to the Russia-based GandCrab ransomware.\n\n**Keyboard locale** **Identifier** **Keyboard locale** **Identifier**\n\nAlbanian 0x0000041c Persian (Standard) 0x00050429\n\nArmenian Eastern 0x0000042b Romanian (Legacy) 0x00000418\n\n\nArmenian Phonetic 0x0002042b Romanian\n(Programmers)\n\n\n0x00020418\n\n\nArmenian Typewriter 0x0003042b Romanian (Standard) 0x00010418\n\nArmenian Western 0x0001042b Russian 0x00000419\n\nAzerbaijani (Standard) 0x0001042c Russian - Mnemonic 0x00020419\n\nAzerbaijani Cyrillic 0x0000082c Russian (Typewriter) 0x00010419\n\n\nAzerbaijani Latin 0x0000042c Sami Extended FinlandSweden\n\n\n0x0002083b\n\n\nBelarusian 0x00000423 Sami Extended Norway 0x0001043b\n\nBosnian (Cyrillic) 0x0000201a Serbian (Cyrillic) 0x00000c1a\n\nCentral Kurdish 0x00000429 Serbian (Latin) 0x0000081a\n\nCroatian 0x0000041a Setswana 0x00000432\n\nDevanagari-INSCRIPT 0x00000439 Slovak 0x0000041b\n\n\n-----\n\n**Keyboard locale** **Identifier** **Keyboard locale** **Identifier**\n\nEstonian 0x00000425 Slovak (QWERTY) 0x0001041b\n\nFaeroese 0x00000438 Slovenian 0x00000424\n\nFinnish with Sami 0x0001083b Sorbian Extended 0x0001042e\n\nGeorgian 0x00000437 Sorbian Standard 0x0002042e\n\n\nGeorgian (Ergonomic) 0x00020437 Sorbian Standard\n(Legacy)\n\n\n0x0000042e\n\n\nGeorgian (QWERTY) 0x00010437 Swedish 0x0000041d\n\n\nGeorgian Ministry of Education and\nScience Schools\n\n\n0x00030437 Swedish with Sami 0x0000083b\n\n\nGeorgian (Old Alphabets) 0x00040437 Tajik 0x00000428\n\nHindi Traditional 0x00010439 Tatar 0x00010444\n\nKazakh 0x0000043f Tatar (Legacy) 0x00000444\n\nKyrgyz Cyrillic 0x00000440 Thai Kedmanee 0x0000041e\n\n\nLatvian (Standard) 0x00020426 Thai Kedmanee (nonShiftLock)\n\n\n0x0002041e\n\n\nLatvian (Legacy) 0x00010426 Thai Pattachote 0x0001041e\n\n\nLithuanian 0x00010427 Thai Pattachote (nonShiftLock)\n\n\n0x0003041e\n\n\nLithuanian IBM 0x00000427 Turkish F 0x0001041f\n\nLithuanian Standard 0x00020427 Turkish QoETO.exe 0x0000041f\n\nMacedonia (FYROM) 0x0000042f Turkmen 0x00000442\n\nMacedonia (FYROM) - Standard 0x0001042f Ukrainian 0x00000422\n\nMaltese 47-Key 0x0000043a Ukrainian (Enhanced) 0x00020422\n\nMaltese 48-key 0x0001043a Urdu 0x00000420\n\nNorwegian with Sami 0x0000043b Uzbek Cyrillic 0x00000843\n\nPersian 0x00000429 Vietnamese 0x0000042a\n\n_Table 4. Keyboard locales immune to REvil._\n\nThe malware authors likely leverage REvil's dbg configuration key during development to bypass\nthe whitelisting control, so the value will typically be set to false. If the target host is whitelisted and\nthe dbg value is set to false, REvil terminates its execution. If the dbg configuration key value is set\n\n\n-----\n\nto true or the target host is not whitelisted, REvil executes the next phase of its infection.\n\n### Terminate blacklisted processes\n\nTo eliminate potential resource conflicts that could impede REvil's ability to wipe or encrypt files, the\nmalware attempts to terminate blacklisted processes. It retrieves the list of blacklisted process\nnames stored within the prc configuration key, iterates though all currently running processes, and\ncompares the lowercase process names to the list of blacklisted process names. If it identifies a\nmatch, REvil attempts to terminate the running process using the kernel32.dll TerminateProcess\nfunction. In the analyzed sample, the only blacklisted process listed in the prc configuration key is\nmysql.exe. This key is a configurable object, so it can contain one or more attacker-supplied values.\n\n### Delete shadow copies\n\nTo ensure that the compromised system is unable to restore from backup, REvil deletes shadow\ncopies and disables recovery mode by executing the following command via ShellExecute. The\nlength and uniqueness of this command allow for the development of high-fidelity detection controls.\n```\ncmd.exe /c vssadmin.exe Delete Shadows /All /Quiet & bcdedit /set {default} recoveryenabled\nNo & bcdedit /set {default} bootstatuspolicy ignoreallfailures\n\n### If configured, wipe blacklisted folders\n\n```\nREvil wipes the contents of blacklisted folders if the wipe key is set to true. The malware obtains the\nlist of blacklisted folder names from the wfld key, searches local fixed drives and network shares for\nfolder names that match the blacklisted names, and then erases the file contents of blacklisted\nfolders and subfolders. The folder is not deleted.\n\nIn the analyzed sample, the wfld configuration key contained a single value of \"backup\", which\nwiped the contents of folders with this name. REvil only wipes folders whose name exactly equals a\nblacklisted value. In this case, it would wipe the contents of folders named \"backup\" but would skip\nfolders named \"backup1\" or \"database backup\".\n\n### Encrypt files\n\nREvil's encryption process starts by iterating through all folders and files residing on local fixed\ndrives and verifying that they are not whitelisted. The malware compares subkeys located within the\nwht configuration key to the folder name (using the fld subkey), filename (using the fls subkey), or\nfile extension (using the ext subkey) (see Figure 8).\n\n\n-----\n\n_Figure 8. REvil configuration excerpt depicting whitelisted folders, filenames, and file extensions_\n_that should not be encrypted. (Source: Secureworks)_\n\nIf a folder is whitelisted, REvil ignores the entire contents of that folder. If a file is not whitelisted,\nREvil queues it and performs the following encryption process:\n\n1. Reads the file contents into a buffer\n2. Encrypts the contents of the buffer\n3. Writes the encrypted contents of the buffer to the original file, overwriting the original file\n\ncontent\n4. Renames the original file with the previously generated random extension\n\n[When encrypting files, REvil uses I/O completion ports (IOCPs) to efficiently manage simultaneous](https://docs.microsoft.com/en-us/windows/desktop/fileio/i-o-completion-ports)\nasynchronous activities such as file reading, encrypting, and writing. This implementation results in\nextremely fast encryption, as IOCPs and multi-threaded processing let REvil fully leverage all of the\nhost's available processing resources.\n\n[The malware appears to encrypt files with the Salsa20 stream cipher. The encryption uses a unique](https://en.wikipedia.org/wiki/Salsa20)\nkey for each file based on the session public key in the Software\\recfg\\pk_key registry key/value.\nThe only way to decrypt files encrypted by REvil is to obtain one of the following keys from the\nthreat actor:\n\nThe unencrypted session private key that was generated, encrypted, and stored within the\nsk_key and 0_key registry values\nThe attacker's private key associated with the public key stored in the REvil configuration (The\npublic key was used to encrypt the session private key.)\n\nOnce encrypting all applicable files in a folder, the malware drops the ransom note in that folder and\nmoves to another folder. After REvil encrypts of all eligible files on local fixed drives, it checks if the nolan switch was passed to the binary when launched. If so, REvil does not encrypt mapped\nnetwork shares. If not, REvil encrypts all non-whitelisted files on mapped network shares.\n\n### Change desktop wallpaper\n\nIf the encryption process is successful, REvil changes the desktop background to make the victim\naware of the compromise. The malware generates a bitmap image one pixel at a time using semirandom integer values for pixel color that results in a grainy blue background that is unique for each\n\n\n-----\n\ninfection. The previously generated message (e.g., You are infected! Read 9781xsd4-HOW-TODECRYPT.txt!) is placed at the top center of the image in white text. REvil saves the finished image\nto the host's %Temp% directory using a random filename consisting of lowercase letters and\nnumbers between 3 and 13 characters in length appended with the \".bmp\" extension (e.g.,\nC:\\Users\\<user>\\AppData\\Local\\Temp\\cd2sxy.bmp). REvil calls the user32.dll\nSystemParametersInfoW function to set the image as the desktop background (see Figure 9).\n\n_Figure 9. Example desktop background displayed on a victim's host post-encryption. (Source:_\n_Secureworks)_\n\n### If configured, contact C2 server\n\nREvil can send the victim's stat information to one or more C2 servers. The malware queries the net\nconfiguration key value to determine if C2 communication should take place. If the value is true,\nREvil iterates through all of the C2 domains specified within the dmn configuration key and builds a\nsemi-random URL for each C2 server using the following pattern, in which the protocol is hardcoded as \"https\":\n\nhttps://<c2_domain>/<URI_sub1>/<URI_sub2>/<random_resource_name>.<ext>\n\nThe C2 domain is followed by two URI subpaths. The first is set to a value randomly chosen from\nthe following array of hard-coded values: [\"wp-content\", \"static\", \"content\", \"include\", \"uploads\",\n\"news\", \"data\", \"admin\"]. The second is set to a value randomly chosen from the following array of\nhard-coded values: [\"images\", \"pictures\", \"image\", \"temp\", \"tmp\", \"graphic\", \"assets\", \"pics\",\n\"game\"].\n\n\n-----\n\nREvil generates a random resource name between 2 and 18 characters in length consisting of only\nlowercase letters ranging from a-z. Characters are generated two at a time, so the resource name\nlength is always an even number. The extension is set to a value randomly chosen from the\nfollowing array of hard-coded values: [\"jpg\", \"png\", \"gif\"]. Figure 10 depicts several examples of\ngenerated C2 URLs.\n\n_Figure 10. Example C2 server URLs generated by REvil. (Source: Secureworks)_\n\nREvil sends the encrypted stat data containing the host profile and malware information to the C2\nURL via the HTTP POST method. Detection of the associated network traffic is challenging because\nREvil uses the HTTPS protocol, which encrypts the network communication. The malware reads the\nsubsequent C2 server response but implements no logic to act on the received data. This deficit\neliminates the possibility for remote access trojan (RAT) functionality. Finally, REvil terminates\nexecution.\n\n## Decryption website\n\nThe ransom note instructs the victim to use a unique URL to decrypt their files. The URL leads to an\nattacker-controlled website that displays the form shown in Figure 11. Victims must provide the key\nand extension name included in the ransom note. The key specified in the ransom note is the\nBase64-encoded representation of the encrypted stat data stored in the registry.\n\n\n-----\n\n_Figure 11. REvil ransom payment key and extension form. (Source: Secureworks)_\n\nThe victim is then informed of the cost in Bitcoin to decrypt their files (see Figure 12).\n\n\n-----\n\n_Figure 12. REvil ransom payment details and instructions. (Source: Secureworks)_\n\nThe site provides instructions for how to purchase Bitcoin and chat with support. It also offers a trial\ndecryption (see Figure 13) to prove that the victim can decrypt the files.\n\n\n-----\n\n_Figure 13. REvil ransom trial decryption offer. (Source: Secureworks)_\n\nThe analyzed sample requested that payment be sent to the Bitcoin address\n3E9F7gE3upQ8rgsPjwiKH7ugfdneypPjqj. No payments have been made as of this publication (see\nFigure 14).\n\n_Figure 14. Contents of Bitcoin wallet associated with REvil infection. (Source: Secureworks)_\n\n## The GandCrab connection\n\nBased on several similarities between REvil and GandCrab, CTU researchers assess that the\nGOLD SOUTHFIELD and GOLD GARDEN threat groups overlap or are linked.\n\n### Nearly identical string decoding function\n\n\n-----\n\nThe strongest characteristic linking the REvil and GandCrab malware families is the nearly identical\nfunctions used for decoding strings at runtime. Figure 15 shows the decompiled pseudocode for the\nstring decoding function in both malware families. CTU researchers focused on the FOR-loop\nsections outlined in red.\n\n_Figure 15. Decompiled pseudocode for string decoder function in REvil (left) and GandCrab (right)._\n_(Source: Secureworks)_\n\nBecause these functions have no unique characteristics that obviously confirm code sharing and\nthe REvil and GandCrab FOR-loops are identical, CTU researchers extracted the opcodes (outlined\nin red in Figure 16) and searched the VirusTotal dataset for samples containing this opcode pattern.\nThis search yielded 286 unique samples, and all matches were confirmed to be either GandCrab or\nREvil (including REvil's decryptor). CTU researchers have not identified other malware families\nusing this opcode pattern, suggesting that the logic is unique to REvil and GandCrab and\nsupporting the theory that these malware families share code.\n\n\n-----\n\n_Figure 16. Opcodes for FOR-loop within REvil and GandCrab string decoder function. (Source:_\n_Secureworks)_\n\n### Similar URL building logic\n\nREvil and GandCrab also use the same method to build URLs. There are similarities between the\ndecompiled pseudocode for REvil's BuildURL function (see Figure 17) and GandCrab's BuildURL\nfunction (see Figure 18).\n\n\n-----\n\n_Figure 17. Decompiled pseudocode for REvil's BuildURL function. (Source: Secureworks)_\n\n\n-----\n\n_Figure 18. Decompiled pseudocode for GandCrab's BuildURL function. (Source: Secureworks)_\n\n### Circumstantial evidence\n\nCircumstantial evidence also suggests that the same threat actors could be responsible for REvil\nand GandCrab:\n\n[The REvil file decryptor executable reportedly contains a](https://twitter.com/noblebarstool/status/1146079158096687105)\n\"D:\\\\gc6\\\\core\\\\src\\\\common\\\\debug.c\" debug path that reflects the folder structure created by\nthe malware author during development. Some researchers view \"gc6\" to be a reference to\nGandCrab v6, which could indicate that REvil is GandCrab v6.\nREvil was dropped on hosts in conjunction with GandCrab on April 17, 2019. The GandCrab\nthreat actors [announced their retirement on May 31. After May 31, REvil activity increased](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/)\nand the delivery methods expanded and became more sophisticated.\nBoth REvil and GandCrab whitelisted similar keyboard locales to prevent infection of Russiabased hosts. Malware authors commonly whitelist regions where they reside to prevent\nscrutiny from local law enforcement, so the REvil and GandCrab malware authors likely reside\nin the same region.\n\n## Conclusion\n\nGiven the diverse and advanced delivery mechanisms, code complexity, and resources utilized by\nREvil, CTU researchers assess that this ransomware will replace GandCrab as a widespread\nthreat. As of this publication, REvil does not contain worm-like features that would enable it to\nspread laterally during an infection. It would need to be dropped or downloaded via malware with\nthis capability.\n\n\n-----\n\nThe best way to limit the damage from ransomware is to maintain and verify current backups of\n[valuable data. CTU researchers recommend that organizations employ a 3-2-1 backup strategy to](https://www.us-cert.gov/sites/default/files/publications/data_backup_options.pdf)\nensure successful restoration of data in the event of a ransomware attack.\n\n## Threat indicators\n\nThe threat indicators in Table 5 can be used to detect activity related to REvil ransomware. The\ntable does not include the C2 servers configured within the analyzed sample due to the large\nnumber of domains.\n\n**Indicator** **Type** **Context**\n\n\n512b538ce2c40112009383ae70331dcf MD5\nhash\n\nd3a0c325121ab4775ab48bbb7b2ef21c0f123109 SHA1\nhash\n\n25ac4873ae4f955032f8f0e8ed4ec78df2e2ce814454b7b5abd9489feb4e30c3 SHA256\nhash\n\n\nREvil\nexecutable\n\nREvil\nexecutable\n\nREvil\nexecutable\n\n\n112983B0-B4C9-4F9B-96C4-E5394FB8A5B4 Mutex Created\nby REvil\n\n1DB960B8-E5C3-F077-5D68-EEE2E637EE0B Mutex Created\nby REvil\n\n206D87E0-0E60-DF25-DD8F-8E4E7D1E3BF0 Mutex Created\nby REvil\n\n3555A3D6-37B3-0919-F7BE-F3AAB5B6644A Mutex Created\nby REvil\n\n552FFA80-3393-423d-8671-7BA046BB5906 Mutex Created\nby REvil\n\n6CAC559B-02B4-D929-3675-2706BBB8CF66 Mutex Created\nby REvil\n\n859B4E91-BAF1-3DBB-E616-E9E99E851136 Mutex Created\nby REvil\n\n879EBE58-4C9F-A6BE-96A3-4C51826CEC2F Mutex Created\nby REvil\n\n95B97D2B-4513-2041-E8A5-AC7446F12075 Mutex Created\nby REvil\n\nBF29B630-7648-AADF-EC8A-94647D2349D6 Mutex Created\nby REvil\n\nC126B3B3-6B51-F91C-6FDF-DD2C70FA45E6 Mutex Created\nby REvil\n\n\n-----\n\n**Indicator** **Type** **Context**\n\nC19C0A84-FA11-3F9C-C3BC-0BCB16922ABF Mutex Created\nby REvil\n\nC817795D-7756-05BF-A69E-6ED0CE91EAC4 Mutex Created\nby REvil\n\nD382D713-AA87-457D-DDD3-C3DDD8DFBC96 Mutex Created\nby REvil\n\nDAE678E1-967E-6A19-D564-F7FCA6E7AEBC Mutex Created\nby REvil\n\nFB864EC7-B361-EA6D-545C-E1A167CCBE95 Mutex Created\nby REvil\n\nFDC9FA6E-8257-3E98-2600-E72145612F09 Mutex Created\nby REvil\n\n_Table 5. Indicators for this threat._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-24 - REvil-Sodinokibi Ransomware.pdf"
    ],
    "report_names": [
        "2019-09-24 - REvil-Sodinokibi Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "70268431-11ed-474f-9fbc-96f894684201",
            "created_at": "2023-01-06T13:46:39.26058Z",
            "updated_at": "2025-03-27T02:00:03.034054Z",
            "deleted_at": null,
            "main_name": "GOLD GARDEN",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD GARDEN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "02ef8063-7ad4-42ba-a646-97210000f6b5",
            "created_at": "2024-06-19T02:03:08.117993Z",
            "updated_at": "2025-03-27T02:05:17.397211Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                ""
            ],
            "source_name": "Secureworks:GOLD SOUTHFIELD",
            "tools": [
                "REvil"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "404bb014-d051-447e-90d8-1a4adc3409b0",
            "created_at": "2024-06-19T02:03:08.058292Z",
            "updated_at": "2025-03-27T02:05:17.370545Z",
            "deleted_at": null,
            "main_name": "GOLD GARDEN",
            "aliases": [
                ""
            ],
            "source_name": "Secureworks:GOLD GARDEN",
            "tools": [
                "GandCrab"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7961bf6e-e429-484c-93e2-bd1d36fa5588",
            "created_at": "2023-01-06T13:46:39.275053Z",
            "updated_at": "2025-03-27T02:00:03.037764Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD SOUTHFIELD",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536105,
    "ts_updated_at": 1743041759,
    "ts_creation_date": 1653775277,
    "ts_modification_date": 1653775277,
    "files": {
        "pdf": "https://archive.orkl.eu/4ec374a288e8e8acf27346b66821931bfd1da053.pdf",
        "text": "https://archive.orkl.eu/4ec374a288e8e8acf27346b66821931bfd1da053.txt",
        "img": "https://archive.orkl.eu/4ec374a288e8e8acf27346b66821931bfd1da053.jpg"
    }
}