{
    "id": "e54151ed-4654-4849-88d9-3d8e92d46465",
    "created_at": "2023-01-12T15:10:53.879371Z",
    "updated_at": "2025-03-27T02:06:12.069198Z",
    "deleted_at": null,
    "sha1_hash": "1e0f529d66de975fc5e60616bf6d23bf62a0ec27",
    "title": "2021-07-17 - Ecuador's state-run CNT telco hit by RansomEXX ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T02:09:19Z",
    "file_modification_date": "2022-05-27T02:09:19Z",
    "file_size": 1166352,
    "plain_text": "# Ecuador's state-run CNT telco hit by RansomEXX ransomware\n\n**[bleepingcomputer.com/news/security/ecuadors-state-run-cnt-telco-hit-by-ransomexx-ransomware/](https://www.bleepingcomputer.com/news/security/ecuadors-state-run-cnt-telco-hit-by-ransomexx-ransomware/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nJuly 17, 2021\n09:53 AM\n0\n\nEcuador's state-run Corporación Nacional de Telecomunicación (CNT) has suffered a\nransomware attack that has disrupted business operations, the payment portal, and\ncustomer support.\n\nCNT is Ecuador's state-run telecommunication carrier that offers fixed-line phone service,\nmobile, satellite TV, and internet connectivity.\n\nStarting this week, the CNT website began displaying an alert warning that they suffered an\nattack and that customer care and online payment are no longer accessible.\n\n\n-----\n\n**Announcement on the website about the cyberattack**\n\"Today, July 16, 2021, the National Telecommunications Corporation, CNT EP, filed a\ncomplaint with the State Attorney General's Office for the crime of “attack on computer\nsystems \"so that the preliminary investigation is carried out and the responsible,\" read the\nalert translated into English.\n\n\"This attack affected the care processes in our Integrated Service Centers and Contact\nCenter; In this regard, we indicate to our users that their services will not be suspended for\nnon-payment.\"\n\n\"We must inform our clients, massive and corporate, that their data is They are duly\nprotected. We also inform that services such as calls, internet and television, operate\nnormally.\"\n\nIf you have first-hand information about this or other unreported cyberattacks, you can\n[confidentially contact us on Signal at +16469613731 or on Wire at @lawrenceabrams-bc.](http://10.10.0.46/tel:+16469613731)\n\n## CNT suffers RansomEXX ransomware attack\n\n\n-----\n\nWhile CNT has not officially stated that they suffered a ransomware attack,\nBleepingComputer has learned that the attack was conducted by a ransomware operation\nknown as RansomEXX.\n\n[Security researcher Germán Fernández shared with BleepingComputer a hidden link to the](https://twitter.com/1ZRR4H)\ngroup's data leak site that warns CNT that the gang would leak data stolen during the attack\nif CNT did not pay a ransom.\n\n\"Your time is LIMITED!\nWhen this time will come to end, there are two ways: we will RAISE the ransom\namount or PUBLISH your files.\nYou will lose the opportunity to contact us after the data PUBLICATION.\nIf you REALLY WANT to prevent data leak, contact us RIGHT NOW.\n\nWe have downloaded 190GB+ of your files and we are ready to publish it.\" RansomEXX.\n\n\n-----\n\n**Hidden RansomEXX data leak page for CNT**\nThis page is currently hidden from the public and can only be accessed via the direct link.\nThese hidden pages are commonly included in ransom notes to prove that a ransomware\noperation stole data during an attack.\n\nIn CNT's press statement, the company states that corporate and customer data are secure\nand have not been exposed.\n\nHowever, the RansomEXX gang claims to have stolen 190 GB of data and shared\nscreenshots of some of the documents on the hidden data leak page.\n\nThe screenshots seen by BleepingComputer, include contact lists, contracts, and support\nlogs.\n\n\n-----\n\nThe ransomware operation originally launched under the name Defray in 2018 but became\nmore active in June 2020 when it rebranded as RansomEXX and began to target large\ncorporate entities.\n\nLike other ransomware gangs, RansomEXX will compromise a network through purchased\ncredentials, brute-forced RDP servers, or by utilizing exploits.\n\nOnce they gain access to a network, they will quietly spread throughout the network while\nstealing unencrypted files to be used for extortion attempts.\n\nAfter gaining access to an administrator password, they deploy the ransomware on the\nnetwork and encrypt all of its devices.\n\nAs is becoming common among ransomware operations, RansomEXX created a Linux\nversion to ensure they can target all critical servers and virtual machines.\n\nThe RansomEXX gang's has a history of high-profile attacks, including Brazil's government\nnetworks, [Texas Department of Transportation (TxDOT),](https://www.bleepingcomputer.com/news/security/ransomware-attack-impacts-texas-department-of-transportation/) [Konica Minolta,](https://www.bleepingcomputer.com/news/security/business-technology-giant-konica-minolta-hit-by-new-ransomware/) [IPG Photonics, and](https://www.bleepingcomputer.com/news/security/leading-us-laser-developer-ipg-photonics-hit-with-ransomware/)\n[Tyler Technologies.](https://www.bleepingcomputer.com/news/security/government-software-provider-tyler-technologies-hit-by-ransomware/)\n\nBleepingComputer has contacted CNT with further questions but has not received a\nresponse at this time.\n\n### Related Articles:\n\n[Luxury fashion house Zegna confirms August ransomware attack](https://www.bleepingcomputer.com/news/security/luxury-fashion-house-zegna-confirms-august-ransomware-attack/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Google shut down caching servers at two Russian ISPs](https://www.bleepingcomputer.com/news/technology/google-shut-down-caching-servers-at-two-russian-isps/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-17 - Ecuador's state-run CNT telco hit by RansomEXX ransomware.pdf"
    ],
    "report_names": [
        "2021-07-17 - Ecuador's state-run CNT telco hit by RansomEXX ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536253,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653617359,
    "ts_modification_date": 1653617359,
    "files": {
        "pdf": "https://archive.orkl.eu/1e0f529d66de975fc5e60616bf6d23bf62a0ec27.pdf",
        "text": "https://archive.orkl.eu/1e0f529d66de975fc5e60616bf6d23bf62a0ec27.txt",
        "img": "https://archive.orkl.eu/1e0f529d66de975fc5e60616bf6d23bf62a0ec27.jpg"
    }
}