{
    "id": "e54b6c23-c0ed-41df-af99-37b87ae14422",
    "created_at": "2023-01-12T15:09:42.572402Z",
    "updated_at": "2025-03-27T02:06:13.529349Z",
    "deleted_at": null,
    "sha1_hash": "aecb0092fe34c45513586528d1648e8244494d32",
    "title": "2022-09-01 - No Honor Among Thieves - Prynt Stealer’s Backdoor Exposed",
    "authors": "",
    "file_creation_date": "2022-09-12T12:02:55Z",
    "file_modification_date": "2022-09-12T12:02:55Z",
    "file_size": 3390024,
    "plain_text": "# Prynt Stealer’s Backdoor Exposed | Zscaler Blog\n\n**[zscaler.com/blogs/security-research/no-honor-among-thieves-prynt-stealers-backdoor-exposed](https://www.zscaler.com/blogs/security-research/no-honor-among-thieves-prynt-stealers-backdoor-exposed)**\n\nStealing information is fundamental to cybercriminals today to scope and gain access to systems, profile\norganizations, and execute bigger payday schemes like ransomware. Information stealer malware families\nincluding Prynt Stealer are often configured through a builder to facilitate the process for less sophisticated\nthreat actors. However, Zscaler ThreatLabz researchers have uncovered the Prynt Stealer builder, also\nattributed with WorldWind, and DarkEye, has a secret backdoor in the code that ends up in every derivative\ncopy and variant of these malware families. The backdoor sends copies of victims' exfiltrated data gathered by\nother threat actors to a private Telegram chat monitored by the builder’s developers. While this untrustworthy\nbehavior is nothing new in the world of cybercrime, the victims' data end up in the hands of multiple threat\nactors, increasing the risks of one or more large scale attacks to follow.\n\n## Key Points\n\n**_Prynt Stealer is an information stealer that has the ability to capture credentials that are stored on_**\n**a compromised system including web browsers, VPN/FTP clients, as well as messaging and**\n**gaming applications**\n**The Prynt Stealer developer based the malware code on open source projects including**\n**_AsyncRAT and StormKitty_**\n**Prynt Stealer uses Telegram to exfiltrate data that is stolen from victims**\n**The Prynt Stealer malware author added a backdoor Telegram channel to collect the information**\n**stolen by other criminals**\n**The informational stealer malware families known as DarkEye and WorldWind are near identical**\n**to Prynt Stealer**\n\nPrynt Stealer is a relatively new information stealer malware family that is written in .NET. The malware has\n[previously been analyzed in-depth including the data harvesting capabilities and the targeted applications.](https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/)\nZscaler ThreatLabz has since uncovered additional details about the malware including the codebase being\nderived from at least two other open source malware families: AsyncRAT and StormKitty. This blog will focus\non these shared codebases, the modifications introduced by the Prynt Stealer author (including a backdoor),\nand the very close relationship with WorldWind and DarkEye.\n\n\n-----\n\n## Prynt Stealer Origins\n\nPrynt Stealer is not just inspired from open source malware families, but shares code that appears to have\nbeen directly copy and pasted from these repositories. Many parts of the Prynt Stealer code that have been\nborrowed from other malware families are not used, but are still present in the binary as dead unreachable\n[code. The Prynt Stealer code is primarily derived from AsyncRAT (a versatile RAT) and](https://github.com/NYAN-x-CAT/AsyncRAT-C-Sharp) [StormKitty (an](https://github.com/swagkarna/StormKitty/)\ninformation stealer). The AsyncRAT code is used as the main module with a modified entry point that calls the\nStormKitty stealer method. Prynt Stealer executables are configured using a builder that has no options to\nmodify the embedded AsyncRAT components, which are pre-configured primarily just to run the StormKitty\nstealer module. Most of AsyncRAT’s functionality in Prynt Stealer is disabled and the command-and-control\n(C&C) URLs are configured to 127.0.0.1. While the AsyncRAT’s network component of Prynt Stealer is\ndisabled, the malware contains the following embedded certificate shown below:\n\n_\"issuer\": \"CN=WorldWind Stealer\",_\n\n_\"subject\": \"CN=WorldWind Stealer\",_\n\n_\"to_date\": \"9999-12-31T23:59:59\",_\n_\"version\": \"v3\",_\n\n_\"from_date\": \"2021-07-13T04:51:06\",_\n\n_\"serial_number\": 852016614067188563094399707801818649_\n\nNote that the common name for this certificate is WorldWind Stealer, which is also sold by the Prynt Stealer\nmalware author.\n\n## AsyncRAT/StormKitty Code Comparison\n\nThe Prynt Stealer author added two new fields (highlighted in Figure 1) to the AsyncRAT configuration\ncodebase for data exfiltration via Telegram.\n\nFigure 1: Side-by-side comparison of a Prynt Stealer configuration (left) with an original AsyncRAT\nconfiguration (right)\n\nThe main code responsible for sending information to Telegram is copied from StormKitty with a few minor\nchanges in text as shown in Figure 2.\n\n\n-----\n\nFigure 2: Side-by-side comparison of Prynt Stealer’s UploadFile with StormKitty’s SendSystemInfo function\n\nThe main difference is the field names and order have changed, and a field related to detecting porn websites\nis missing from Prynt.\n\n## A Detailed look at Prynt Stealer Modifications\n\n Anti-Detection Techniques\n\nPrynt Stealer does not use the anti-analysis code from either AsyncRAT or StormKitty with one exception: the\nmalware creates a thread that invokes the function named processChecker (shown in Figure 3) in AsyncRAT’s\nstatic constructor. The thread execution is started at the end of the main function after stolen logs are sent.\n\n\n-----\n\nFigure 3: Prynt Stealer process checker thread's code\n\nPrynt Stealer uses this thread to continuously monitor the victim’s process list. If any of the following processes\nare detected, the malware will block the Telegram C&C communication channels:\n\ntaskmgr\nprocesshacker\nnetstat\nnetmon\ntcpview\nwireshark\nfilemon\nregmon\ncain\n\n## Telegram Command Thread\n\n[Prynt Stealer creates a thread that will poll for a file to download using the Telegram getUpdates API as shown](https://core.telegram.org/bots/api#getupdates)\nin Figure 4. Of note, this download command only saves the file on the target system and does not take any\nfurther actions that might be expected like executing a second-stage payload or updating the malware.\n\n\n-----\n\nFigure 4: Prynt Stealer Telegram download command\n\n## Crowdsourcing Stolen Logs\n\nPrynt Stealer steals data from a wide array of applications, and the information is sent to a Telegram channel\nthat is configured using the builder shown in Figure 5.\n\nFigure 5: Prynt Stealer builder\n\nThe Prynt Stealer logs are sent to the operator’s Telegram. However, there is a catch: a copy of the log files is\nalso sent to a Telegram chat presumably embedded by the Prynt Stealer author as shown below in Figure 6.\n\n\n-----\n\nFigure 6: Prynt Stealer backdoor sending log files to two different Telegram chats\n\n[ThreatLabz has observed similar tactics employed by malware authors in the past as well, where the malware](https://www.zscaler.com/blogs/security-research/cobian-rat-backdoored-rat)\nhas been given away for free. This enables a malware author to benefit from unsuspecting cybercriminal\nclients who perform the heavy lifting of infecting victims. The fact that all Prynt Stealer samples encountered by\nThreatLabz had the same embedded telegram channel implies that this backdoor channel was deliberately\nplanted by the author. Interestingly, the Prynt Stealer author is not only charging some clients for the malware,\nbut also receiving all of the data that is stolen. Note that there are cracked/leaked copies of Prynt Stealer with\nthe same backdoor, which in turn will benefit the malware author even without direct compensation.\n\n## Prynt Stealer / WorldWind / DarkEye: Multiple Faces of the Same Malware\n\nThreatLabz has identified at least two more Prynt Stealer variants dubbed WorldWind and DarkEye that\nappear to be written by the same author. All three strains are nearly identical with a few minor differences.\nPrynt Stealer is the most popular brand name for selling the malware, while WorldWind payloads are the most\ncommonly observed in-the-wild. DarkEye is not sold or mentioned publicly, however, it is bundled as a\nbackdoor with a “free” Prynt Stealer builder. Figure 7 shows a pie chart of the percentage of samples by name\nobserved by ThreatLabz over the last year.\n\n\n-----\n\nFigure 7: Distribution of Prynt Stealer, WorldWind and DarkEye payloads in-the-wild over the last year\n\nBoth Prynt and WorldWind have been sold by the same author on the following websites:\n\n**Market Website** **Malware name** **Status**\n\nhttp://shop.prynt[.]market WorldWind Inactive\n\nhttp://market.prynt[.]market Prynt Stealer Inactive\n\nhttp://venoxxxx[.]xxx Prynt Stealer Active\n\nScreenshots of these websites (offline at the time of publication) are shown in Figure 8.\n\n\n-----\n\nFigure 8: market.prynt[.]market selling Prynt Stealer and shop.prynt[.]market selling WorldWind side-by-side\n\nVarious websites and criminal forums have offered cracked versions of Prynt Stealer and the code has been\nuploaded on GitHub for free under different names. Prynt (with the same Telegram backdoor) has also been\noffered for free on Telegram channels used by cybercriminals as shown in Figure 9.\n\nFigure 9: Prynt Stealer offered for free on a cybercriminal Telegram channel\n\nThe distributed builder is backdoored with DarkEye Stealer and Loda RAT. This may be a deliberate leak by\nthe Prynt Stealer threat actor since they will benefit from the data stolen from victims.\n\n## Feature/Code Comparison\n\nTable 1 shows a feature parity between Prynt, WorldWind and DarkEye. Overall, there are few very minor\ndifferences such as the text in the log report, code and settings placement. However, functionality-wise all\nthree are almost identical.\n\n**Prynt** **WorldWind** **DarkEye**\n\n\n**AsyncRAT** Present\n(Not\nUsed)\n\n\nPresent\n(Not Used)\n\n\nUsed\n\n\n-----\n\n**Clipper** Present\n(Not\nUsed)\n\n**Keylogger** Present\n(Not\nUsed)\n\n\nPresent\n(Not Used)\n\nPresent\n(Not Used)\n\n\nUsed\n\nUsed\n\nNot\nPresent\n\n\n**ProcessChecker Anti-Analysis** Used Not\nPresent\n\n\n**StomKitty Stealing** Used Used Used\n\n\n**HideConsoleWindow** Used Not\nPresent\n\n**Elevate privileges by running as admin** Used Not\nPresent\n\n**Copy itself to a specified path** Used Not\nPresent\n\n**Persist using task creation (e.g., “Chrome Update”)** Used Not\nPresent\n\n**Self delete using a .bat file** Used Not\nPresent\n\n**Check for an Internet connection** Used Not\nPresent\n\n**Protect the process using RtlSetProcessIsCritical** Used Not\nPresent\n\n\n**Prevent sleep by setting SetThreadExecutionState to 0x80000003**\n**(ES_CONTINUOUS | ES_DISPLAY_REQUIRED |**\n**ES_SYSTEM_REQUIRED)**\n\n\nUsed Not\nPresent\n\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\nNot\nPresent\n\n\nTable 1. Some notable similarities and differences in functionality between Prynt Stealer, WorldWind and\nDarkEye\n\nTable 2 compares the field names between StormKitty, Prynt Stealer, WorldWind and DarkEye.\n\n**StormKitty** **Prynt** **WorldWind** **DarkEye**\n\n\n-----\n\n😹 *StormKitty Report:*\n\n🏦 *Banking\nservices*\n\n💰\n*Cryptocurrency\nservices*\n\n🍓 *Porn\nwebsites*\n\n\n\\ud83d\\udc63 *Prynt Stealer New Results:* \\ud83c\\udf2a\n*WorldWind\nPro Results:*\n\n\\ud83c\\udfe6 *Banks* \\ud83c\\udfe6\n*Bank Logs*\n\n\\ud83d\\udcb0 *Crypto* \\ud83d\\udcb0\n*Crypto\nLogs*\n\n**N/A** \\ud83c\\udf53\n*Freaky\nLogs*\n\n\n🌐 *Browsers:* \\ud83d\\udcb5 *Stealer Data:* \\ud83c\\udf10\n*Logs:*\n\n🗃 *Software:* \\ud83d\\udc63 *Installed Software:* \\ud83d\\uddc3\n*Software:*\n\n🧭 *Device:* \\ud83d\\udc63 *Local Device:* \\ud83e\\udded\n*Device:*\n\n\n\\ud83d\\ude39\n*DARK-EYE Report:*\n\n\\ud83c\\udfe6\n*Banking\nservices*\n\n\\ud83d\\udcb0\n*Cryptocurrency\nservices*\n\n\\ud83c\\udf53\n*Porn websites*\n\n\\ud83c\\udf10\n*Browsers:*\n\n\\ud83d\\uddc3\n*Software:*\n\n\\ud83e\\udded\n*Device:*\n\n\\ud83d\\udcc4\n*File Grabber:*\n\n**N/A**\n\n\n📄 *File\nGrabber:*\n\n\n\\ud83d\\udc63 *Files:* \\ud83d\\udcc4\n*File\nGrabber:*\n\n\n**N/A** \\ud83d\\udc63 Solen Useing Prynt Stealer\\n\\n\n\\ud83d\\udc63 Developed By\n@FlatLineStealerUpdated\\n\\n \\ud83d\\udc63 Or Join\nThe Channel @pryntdotmarket\n\n\nTelegram\nChannel:\n@x0splinter\n\n\nTable 2. Comparison of field names between StormKitty, Prynt Stealer, WorldWind and DarkEye\n\n## Leaked Prynt Stealer Builder\n\nThreatlabz has acquired a copy of the Prynt Stealer builder that is backdoored with DarkEye being circulated\nin-the-wild. Figure 10 illustrates the “free” Prynt Stealer builder’s backdoor execution process.\n\n\n-----\n\nFigure 10: Prynt Stealer builder backdoor execution and infection flow\n\nThe Prynt Stealer builder package includes the following files:\n\n_Stub.exe - Prynt stub used by the builder_\n_Prynt Stealer.exe - Builder executable_\n_Prynt Stealer sub.exe - Unmanaged PE_\n_Prynt.exe - Backdoor that downloads and executes DarkEye Stealer_\n\n## Stub.exe - The Prynt Stealer Stub\n\nThis is the actual Prynt Stealer stub that is used by the builder to build payloads based on the configuration.\nThe stub simply enumerates the resources in the file Prynt Stealer sub.exe and performs actions based on the\nsettings in the RCData resource section, as shown in Figure 11.\n\n\n-----\n\nFigure 11. Celesity Binder resource enumeration method\n\nThe Prynt Stealer sub.exe is generated using Celesty Binder as indicated by the presence of the string\n_C:\\Users\\DarkCoderSc\\Desktop\\Celesty Binder\\Stub\\STATIC\\Stub.pdb. This binary stores embedded payloads_\nunder the “RBIND” resource in plaintext. This sample was configured to drop and execute the payloads in the\n_%TEMP% folder as shown in Figure 12._\n\nFigure 12. Celesity Binder stub settings in resources\n\nOther valid options for the “DROPIN” value include the following:\n\n_%APPDATA%_\n_%PROGFILES%_\n_%DEFDRIVE%_\n_%STARTUPDIR%_\n_%LAPPDATA%_\n_%USERDIR%_\n\nThe Prynt Stealer builder stub contains two payloads:\n\n**“PRYNT STEALER.EXE” - The builder binary explained below**\n**“SVCHOST.EXE” - LodaRAT backdoor**\n\n## Prynt Stealer.exe - The Builder\n\nThe Prynt Stealer builder is a modified version of the AsyncRAT builder with modified forms to change the UI\nand an additional line was added in the main method to run the loader mentioned above from {Builder\n_Path}/Stub/Prynt.exe._\n\n## Prynt.exe - The Loader\n\nThis is a very basic loader written in .NET, which simply downloads the payload from a hardcoded URL and\nruns the payload as shown in Figure 13.\n\n\n-----\n\nFigure 13. Loader obfuscated vs deobfuscated\n\nThe downloaded payload is DarkEye Stealer, a variant of Prynt Stealer. Based on a hardcoded Telegram token\nshared by DarkEye, Prynt and WorldWind stealer, they are all likely from the same author(s).\n\n### DarkEye Stealer\n\nThis malware is essentially Prynt Stealer with some minor differences in code placement. Most settings related\nto the clipper, keylogger, etc are moved under the AsyncRAT constructor as shown in Figure 14.\n\n\n-----\n\nFigure 14. Example AsyncRAT settings configured by DarkEye Stealer\n\nThe main factor differentiating DarkEye from Prynt and Worldwind is that the AsyncRAT part of the code is\nweaponized by configuring the related settings. Note that there were some earlier versions of DarkEye stealer\nin-the-wild without the AsyncRAT components.\n\n## Loda RAT\n\nLoda RAT is an Autoit based RAT first [documented in 2017 that has been active since and has evolved over](https://www.proofpoint.com/us/threat-insight/post/introducing-loda-malware)\nthe years. This is a fairly capable malware that can steal a variety of information, remotely control an infected\nsystem and deploy additional payloads.\n\n## Conclusion\n\nThe free availability of source code for numerous malware families has made development easier than ever for\nless sophisticated threat actors. As a result, there have been many new malware families created over the\nyears that are based on popular open source malware projects like NjRat, AsyncRAT and QuasarRAT. The\nPrynt Stealer author went a step further and added a backdoor to steal from their customers by hardcoding a\nTelegram token and chat ID into the malware. This tactic is not new by any means; there have been several\n[similar instances, including CobianRAT. As the saying goes, there is no honor among thieves.](https://www.zscaler.com/blogs/security-research/cobian-rat-backdoored-rat)\n\n## Cloud Sandbox Detection\n\n\n-----\n\nFigure 15: Zscaler Cloud Sandbox Report\n\nIn addition to sandbox detections, Zscaler’s multilayered cloud security platform detects indicators related to\nthe campaign at various levels with the following threat names:\n\n[Win32.Backdoor.PryntStealer](https://threatlibrary.zscaler.com/threats/fce35e17-14e0-4ca7-a58f-9de390c31122)\n\n[Win32.Backdoor.WorldWind](https://threatlibrary.zscaler.com/threats/c0443642-bcfb-4321-ad7f-9843a78693d5)\n\n[Win32.Backdoor.DarkEyeStealer](https://threatlibrary.zscaler.com/threats/0681bde1-d432-4b2c-82ee-31760b73032a)\n\n[Win32.Backdoor.LodaRat](https://threatlibrary.zscaler.com/threats/bb80639e-841e-493f-9ff7-a771a78ddd0e)\n\n## Indicators of Compromise (IOCs)\n\n[Prynt Stealer IOCs are available in our GitHub repository.](https://github.com/threatlabz/iocs/tree/main/pryntstealer)\n\n**SHA256** **Malware**\n\nd8469e32afc3499a04f9bcb0ca34fde63140c3b872c41e898f4e31f2a7c1f61f Prynt Stealer\n\nf15e92c34dd8adfcd471d726e88292d6698217f05f1d2bcce8193eb2536f817c Prynt Stealer\n\n3b948a0eb0e9bbca72fc363b63ffd3a5983e23c47f14f8296e8559fd98c25094 WorldWind Stealer\n\nbb96db7406566ec0e9305acde9205763d4e9d7a65f257f3d5c47c15f393628ec DarkEye Stealer\n\ne48179c4629b5ab9e53ccb785ab3ee5eeb2e246e1897154a15fec8fd9237f44b DarkEye Stealer (old\nversion without AsyncRAT)\n\n9678ca06068b705da310aa2f76713d2d59905b12b67097364160857cd1f90c58 Celesty Binder payload\n\n\n-----\n\n654f080d5790054f0cd1a0f9b31cd7a82a4722ff3ce5093acdc31ff154f1ae24 Builder\n\ncb132691793e93ad8065f857b4b1baba92e937cfc3d3a8042ce9109e12d32b4c LodaRAT\n\nd37d0ae4c5ced373fe1960af5ea494a6131717d1c400da877d9daa13f55439bb Prynt Stealer Stub\n\nc79aed9551260daf74a2af2ec5b239332f3b89764ede670106389c3078e74d1a Loader\n\n**Telegram Token** **Chat ID** **Comment**\n\n1119746739:AAGMhvpUjXI4CzIfizRC--VXilxnkJlhaf8 1096425866 WorldWind (hardcoded)\n\n1784055443:AAG-bXLYtnFpjJ_L3ogxA3bq6Mx09cqh8ug 1937717367 Prynt Stealer (hardcoded)\n\n5292408150:AAHAPbTr2Jc9L4hgsfkDkvfw_hISg6lPMMI 5038570348 Prynt Stealer\n\n5292408150:AAHAPbTr2Jc9L4hgsfkDkvfw_hISg6lPMMI 1856525476 Prynt Stealer\n\n1916193181:AAHhdcx3k6mHbnJ6JLfyWtJBMChny-la8Xs 849561191 Prynt Stealer\n\n**URL** **Description**\n\nhttps://cdn.discordapp[.]com/attachments/523238636561629190/890007970207907871/vltn.exe DarkEye\nStealer\nHosting\n\nbigdaddy-service[.]biz:6606 DarkEye\nStealer\nC&C\n\nbigdaddy-service[.]biz:7707 DarkEye\nStealer\nC&C\n\nbigdaddy-service[.]biz:8808 DarkEye\nStealer\nC&C\n\ndaddy.linkpc[.]net:1199 LodaRAT\nC&C\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-01 - No Honor Among Thieves - Prynt Stealer’s Backdoor Exposed.pdf"
    ],
    "report_names": [
        "2022-09-01 - No Honor Among Thieves - Prynt Stealer’s Backdoor Exposed.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536182,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1662984175,
    "ts_modification_date": 1662984175,
    "files": {
        "pdf": "https://archive.orkl.eu/aecb0092fe34c45513586528d1648e8244494d32.pdf",
        "text": "https://archive.orkl.eu/aecb0092fe34c45513586528d1648e8244494d32.txt",
        "img": "https://archive.orkl.eu/aecb0092fe34c45513586528d1648e8244494d32.jpg"
    }
}