{
    "id": "e552acba-ee03-45fd-9829-17d616d05a75",
    "created_at": "2023-01-12T15:00:26.260368Z",
    "updated_at": "2025-03-27T02:14:05.269701Z",
    "deleted_at": null,
    "sha1_hash": "a2477765423a6d38907992301130e6e38dcbfa01",
    "title": "2016-08-01 - CrowdStrike’s New Methodology for Tracking eCrime",
    "authors": "",
    "file_creation_date": "2022-05-28T15:59:39Z",
    "file_modification_date": "2022-05-28T15:59:39Z",
    "file_size": 626147,
    "plain_text": "# Read Featured Research & Threat Intel Article by Adam Meyers\n\n**crowdstrike.com/blog/ecrime-ecosystem/**\n\nAugust 1, 2016\n\n## CrowdStrike’s New Methodology for Tracking eCrime\n\nAugust 1, 2016\n\n[Adam Meyers](https://www.crowdstrike.com/blog/author/adamm/) [Research & Threat Intel](https://www.crowdstrike.com/blog/category/threat-intel-research/)\n\nAt our inception, CrowdStrike coined the phrase, “You don’t have a malware problem, you\n_have an adversary problem.” Behind every attack — whether it is the most advanced nation_\nstate conducting espionage, opportunistic criminal activity, or highly visible hacktivism —\nare human actors. Those humans have preferences, patterns, and flaws. Intelligence\nanalysts who study these actors can piece little parts of the story together to first categorize\n— and then ultimately understand — the human actors behind these attacks. Models can\nhelp analysts organize their thoughts and observations into a transferable or communicable\nstructure so that others may understand what they believe and why. In the cyber domain,\nmilitary models such as the “kill chain,” are often adopted to suit the analyst’s needs. At\nCrowdStrike, we thought long and hard about how various models might help us convey to\nour customers the behaviors and organization of eCrime actors. What we found was that\nthese actors and their interdependent relationships did not fit into an existing model.\n\n\n-----\n\nThe eCrime actor s operational profile differs greatly from that of an espionage-focused\ntargeted intrusion actor. Historically the kill chain, derived from military targeting models,\nhas been applied to disrupt the activity of an adversary. Approaches such as F3EAD (Find,\nFix, Finish, Exploit, Analyze, Disseminate) have been applied to disrupt the adversary’s kill\nchain in the cyber realm. The thought behind implementing this model is that an espionage\nactor generally operates in a closed cell: that is, they conduct their own reconnaissance,\nsource or build their exploit, deliver/attack the target using data from the reconnaissance\nphase, create a beachhead to maintain persistence, and execute their actions on\nobjectives. Disrupting the attacker at any link of this “chain” has consequences on the rest\nof the activities they may attempt to accomplish. Ideally, finding the link in the chain that is\nhardest or most expensive to change will create a negative impact for the attacker, and they\nwill need to retool or regroup before the next attack.\n\nIn the criminal domain, this is not necessarily true, as eCrime is a vast ecosystem of\ninterconnected services and schemes. There are complex relationships between varied\nindividuals and groups, whose primary goal is to generate revenue. A banking trojan may\nbe designed and built by one group that intends to build a reliable and feature-rich piece of\nsoftware, and they may choose to monetize this via an affiliate model (partnerkas). With this\napproach, they don’t necessarily know or care how their customers use the tool, how they\ndistribute it, or what they do with the data they collect – only that they use the tool in\naccordance with their guidelines and pay them. The developers of such a tool may be\ncategorized differently than their customers, but the fact remains they must rely on various\ncriminal underground elements to be successful. They generally will market their tool to\npotential customers, they likely will need some resilient infrastructure to host their service,\nand they will potentially need to use monetization schemes to enjoy their revenue. The\ncombination of what activities these actors engage in can be organized into a series of\nbreadcrumbs to identify that actor. An eCrime actor’s profile is a cross section of the\nservices they offer, the services they utilize, crimes they engage in, means to monetize their\nactivities, customers that they support, how they market themselves and to whom, the\nvictims that they target, and ultimately their identity which they closely protect. Through the\njudicious investigation and analysis of these actors, CrowdStrike analysts piece together\nthese breadcrumbs into the profile of an eCrime actor. The relationships between these\nactors becomes a sort of social network, a graph database of sorts where different groups\nand individuals are nodes with overlapping edges where they conduct commerce with each\nother.\n\nAs an example of this structure, CrowdStrike fully evaluated the CoreBot banking trojan\nmalware and the people who maintain it, who we track as BOSON SPIDER. The adversary\nbehind this threat, which was first identified in 2015, recently and inexplicably went dark in\nthe spring of 2016, appears to be a tightly knit group operating out of Eastern Europe. They\nhave used a variety of distribution mechanisms such as the infamous (and now defunct)\nangler exploit kit, and obfuscated JavaScript to reduce the detection by antivirus solutions.\nIn addition to outsourcing their exploitation/delivery, they used bulletproof hosting services\n\n\n-----\n\nsuch as Avalanche or Kol. Their key value proposition in the underground economy is\nproviding a well-designed, man-in-the-middle browser hijacking trojan which can be used to\nhijack sessions or steal banking credentials. This service is delivered through an affiliate\nmodel that allows the actor to resell their malware with custom configurations to suit the\nneeds of the affiliate customer. In one configuration, we observed the targeting of U.S. and\nCanadian banks, while in another smaller configuration, the customer targeted Japanese\nbanks exclusively. As far as crimes committed, the primary purpose of the tool was to steal\ncredentials to facilitate bank fraud against unsuspecting victims when they attempted to\nauthenticate to a targeted financial institution. This was monetized by the actors as a\nbotnet-as-a-service, and perhaps they too used the botnet to steal credentials for their own\nusage, in which they may have employed money mules from the eCrime ecosystem to\nextract the funds. They used some clever technical tradecraft including Domain Generating\nAlgorithms (DGA) and disguising malicious JavaScript as legitimate Microsoft Office\ndocuments. Finally, in order to attract potential users or customers, they advertised in at\nleast one criminal forum.\n\nThe story of BOSON SPIDER is certainly an interesting one, but for victims such as\nfinancial institutions who wish to understand the capabilities of this actor, and to monitor for\nchanges in their behavior, a kill chain or diamond representation of their activities doesn’t\nshow the whole picture. This is the reason CrowdStrike has expanded our eCrime offerings\nto deliver to our eCrime Intelligence subscribers a more comprehensive understanding of\nthe threat actors that they must deal with and ultimately how they can more effectively\ndisrupt the activities of these actors to protect their businesses.\n\nConceptually the CrowdStrike eCrime ecosystem model takes into account the elements of\nthe adversary that are important to understand who they are, as well as the interrelationships with the eCrime ecosystem. CrowdStrike utilizes this model to deliver best-inclass eCrime intelligence reporting to our customers, and to fuel the CrowdStrike Falcon\nPlatform with eCrime intelligence to protect the endpoints of customers all over the world.\n[We have recently launched our eCrime premium intelligence subscription for customers](https://www.crowdstrike.com/products/falcon-intelligence/intelligence-subscriptions-offerings/)\nwho are plagued by financial, reputational, and data losses at the hands of the myriad of\neCrime actors operating with impunity today.\n\nFor more information on the CrowdStrike Falcon Intelligence eCrime offering contact us at\n[intelligence@crowdstrike.com. If you think you are up to the challenge of analyzing and](http://10.10.0.46/mailto:intelligence@crowdstrike.com)\ninvestigating the motivations of malicious adversaries, check our job listings to join the\nmission!\n\n\n-----\n\nRelated Content\n\nWho is EMBER BEAR?\n\n\n-----\n\nA Tale of Two Cookies: How to Pwn2Own the Cisco RV340 Router\n\nPROPHET SPIDER Exploits Citrix ShareFile Remote Code Execution Vulnerability CVE-2021-22941 to\nDeliver Webshell\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-08-01 - CrowdStrike’s New Methodology for Tracking eCrime.pdf"
    ],
    "report_names": [
        "2016-08-01 - CrowdStrike’s New Methodology for Tracking eCrime.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a95ead6e-d506-4929-a0dd-1a7afb19b84e",
            "created_at": "2022-10-25T16:07:24.461901Z",
            "updated_at": "2025-03-27T02:02:10.239942Z",
            "deleted_at": null,
            "main_name": "Boson Spider",
            "aliases": [],
            "source_name": "ETDA:Boson Spider",
            "tools": [
                "CoreBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab35254c-b3f8-4b45-9413-01591ba7b5f4",
            "created_at": "2023-01-06T13:46:39.231425Z",
            "updated_at": "2025-03-27T02:00:03.026773Z",
            "deleted_at": null,
            "main_name": "BOSON SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:BOSON SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535626,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1653753579,
    "ts_modification_date": 1653753579,
    "files": {
        "pdf": "https://archive.orkl.eu/a2477765423a6d38907992301130e6e38dcbfa01.pdf",
        "text": "https://archive.orkl.eu/a2477765423a6d38907992301130e6e38dcbfa01.txt",
        "img": "https://archive.orkl.eu/a2477765423a6d38907992301130e6e38dcbfa01.jpg"
    }
}