{
    "id": "e592daa3-f1a6-4a1b-afaf-63d68640a1fb",
    "created_at": "2023-01-12T15:05:37.987987Z",
    "updated_at": "2025-03-27T02:09:29.4414Z",
    "deleted_at": null,
    "sha1_hash": "a4acda47d8835361e7133287b7abb73ed144f2cc",
    "title": "2022-05-04 - Fresh Phish- Britain’s National Health Service Infected by Massive Phishing Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T03:48:32Z",
    "file_modification_date": "2022-05-28T03:48:32Z",
    "file_size": 1350959,
    "plain_text": "# Fresh Phish: Britain’s National Health Service Infected by Massive Phishing Campaign\n\n**[inky.com/en/blog/fresh-phish-britains-national-health-service-infected-by-massive-phishing-campaign](https://www.inky.com/en/blog/fresh-phish-britains-national-health-service-infected-by-massive-phishing-campaign)**\n\nPosted by Roger Kay\n\n[Tweet](https://twitter.com/share)\n\nOver a period beginning last fall and continuing into April, the National Health Service (NHS)\nof the United Kingdom fell prey to a large phishing operation. What had been sporadic use of\nlegitimate NHS accounts to send phishing emails to unsuspecting third parties became a\nmassive campaign in March.\n\nThe true scope of the attack could have been much larger, as INKY detected only those\nattempts made on our customers. But given how many we found, it’s safe to say that the\ntotal iceberg was much bigger than the tip we saw.\n\nINKY shared its findings with the NHS, which sent the following response:\n\n“We have processes in place to continuously monitor and identify these risks. We address\nthem in collaboration with our partners who support and deliver the national NHSmail\nservice.\n\n\"NHS organisations running their own email systems will have similar processes and\nprotections in place to identify and coordinate their responses, and call upon NHS Digital\nassistance if required.\"\n\nBetween background statements by the NHS and our investigations, we were able to\ndetermine that the breach was not a compromised mail server but rather individually hijacked\naccounts.\n\nAs of April 19, INKY mostly stopped receiving phishing reports from the NHS domain, likely\ndue to the messaging team’s efforts to mitigate the incursion. One exception was the author,\nwho received a simple request to reply to a Gmail account, sent from the NHS domain. Our\ndata analysts found a few others scattered about our user base.\n\n### Quick Take: Attack Flow Overview\n\nType: phishing\nVector: emails sent from NHS servers\nPayload: credential harvesting links\nTechniques: [brand impersonation, credential harvesting,](https://www.inky.com/the-top-25-most-phished-brands) [hijacked accounts](https://www.inky.com/product/account-takeover-protection)\nPlatform: Microsoft 365\n\n\n-----\n\nTarget: Microsoft 365 users\n\n## The Attack\n\nStarting in October 2021 and escalating dramatically in March 2022, INKY detected 1,157\nphishing emails originating from NHSMail, the NHS email system for employees based in\nEngland and Scotland. Last year, this service was migrated from an on-premise installation\nto Microsoft Exchange Online. This migration, with its changed security environment, could\nhave been a factor in the attack.\n\nWe reported our initial findings to the NHS on April 13, and as of April 14, the volume of\nattacks decreased dramatically, as the NHS took measures to stop them. However, INKY\nusers were still receiving a few phishing emails from the NHS mail domain (nhs[.]net) after\nthat time.\n\n_Graph of NHS phish sent per month_\n\nDuring the study period, the phishing emails originated from email accounts that belonged to\n139 NHS employees.\n\nINKY data analysts validated the email accounts via two methods:\n\nLinkedIn profiles and NHS staff directory links confirmed that these accounts belonged\nto real NHS employees.\n\n\n-----\n\n_Search results confirmed the identity of NHS employees with compromised accounts_\n\nPinging the SMTP server drew replies of “250 OK,” establishing that the email\naddresses existed. Although our spot checks were statistical rather than exhaustive,\nwe got a “250 OK” response for every email that we checked.\n\n_Example of SMTP ping results_\n\nAll phishing emails were sent from two IP addresses (213.161.89.71 and 213.161.89.103)\nused by the NHS. They also passed email authentication for nhs.net. The NHS confirmed\nthat the two addresses were relays within the mail system used for a large number of\naccounts.\n\n\n-----\n\n_All phishing emails authenticated to nhs.net_\n\nThe majority were fake new document notifications with malicious links to credential\nharvesting sites that targeted Microsoft credentials. All emails also had the NHS email footer\nat the bottom.\n\n_Sample phishing email with NHS footer_\n\nSome emails impersonated Adobe and Microsoft by using their logos in phishing emails.\n\n\n-----\n\n_Example of an Adobe impersonation_\n\nA few were advance-fee scams.\n\n_Advance-fee scam example_\n\nWhen the author replied to a phish he received from this broad campaign, he got a reply\nfrom “Shyann Huels,” who purported to be Jeff Bezos’s secretary. Apparently, he was the\nlucky recipient of $2 million (for a small handling fee).\n\n\n-----\n\n## Broader Implications\n\nAs to the question of why there might still be a few phishes slipping through the net, even\nafter the NHS took steps to mitigate this campaign, the answer might be found in the\nnumbers. The NHS is a national organization in Great Britain, and as such, it has\ntremendous scope. Not only does nhs[.]net serves tens of millions of individual email users, it\nalso provides an infrastructure for 27,000 organizations, each with its own technology staff.\nThese organizations include hospitals, clinics, doctor’s offices, public bodies, suppliers,\nservices, social-care organizations, and many other related entities.\n\nWe found 139 compromised accounts, which may sound like a lot, but that number\nrepresents only a few ten-thousandths of one percent of the total. Given the huge number of\nNHS accounts, this tiny percentage could still be expected to produce a few newly\ncompromised accounts every day.\n\nPerhaps this is a moment to introduce the idea that phish can be like a leak in the boat. It\ndoesn’t matter that the hole is small. It will still sink the boat eventually. Even if only a few\nbad emails get through, with a malicious enough payload, a single successful attack can be\nlife-altering. The NHS has been lucky so far. Credential harvesting by itself is small potatoes.\nBut, of course, those credentials can be recycled in subsequent attacks with more dangerous\nresults.\n\n## Recap of Techniques\n\n[Brand impersonation — uses brand logos and trademarks to impersonate well-known](https://www.inky.com/the-top-25-most-phished-brands)\nbrands.\n[Credential harvesting — occurs when a victim thinks they are logging in to one of their](https://www.inky.com/understanding-phishing-credential-harvesting-doj-scam)\nresource sites but are in fact entering credentials into a dialogue box owned by the\nattackers.\n[Hijacked accounts — are used by phishers to make their emails appear to come from](https://www.inky.com/product/account-takeover-protection)\nlegitimate senders\n\n## Best Practices: Guidance and Recommendations\n\nEmail users should always check a sender’s email address carefully and scrutinize any links\nin an email by hovering over them. Most emails in this campaign claimed to be from Adobe\nor Microsoft, but nhs[.]net is not an Adobe or Microsoft domain. The links in them did not\nbelong to these organizations, either.\n\nRecipients should also be cautious with unfamiliar new document notifications and decline to\nrespond to or click any links in an email from a sender who has never been in touch before.\n\n[Ready to see INKY in action? Request a free trial or a demo today.](https://www.inky.com/get-inky)\n\n\n-----\n\n---------------------\n_INKY is an_ _[award-winning, cloud-based email security solution developed to proactively](https://www.inky.com/awards-recognition)_\n_eliminate phishing emails and malware while simultaneously providing real-time assistance_\n_to employees handling suspicious emails so they can make safer decisions. INKY’s patented_\n_technology incorporates sophisticated computer vision, machine learning models, social_\n_profiling, and stylometry algorithms to effectively sanitize emails, rewrite malicious links,_\n_detect and block security threats, mitigate sender impersonation, and more. Cost-effective_\n_and powerful, the INKY platform was developed for mobile-first IT organizations and works_\n_seamlessly on any device, operating system, and mail client. Learn more about INKY™ or_\n_[request an online demonstration today.](https://www.inky.com/get-inky)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-04 - Fresh Phish- Britain’s National Health Service Infected by Massive Phishing Campaign.pdf"
    ],
    "report_names": [
        "2022-05-04 - Fresh Phish- Britain’s National Health Service Infected by Massive Phishing Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535937,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653709712,
    "ts_modification_date": 1653709712,
    "files": {
        "pdf": "https://archive.orkl.eu/a4acda47d8835361e7133287b7abb73ed144f2cc.pdf",
        "text": "https://archive.orkl.eu/a4acda47d8835361e7133287b7abb73ed144f2cc.txt",
        "img": "https://archive.orkl.eu/a4acda47d8835361e7133287b7abb73ed144f2cc.jpg"
    }
}