{
    "id": "e5aecda6-9f88-47ff-88ab-9919773a5bad",
    "created_at": "2023-01-12T15:08:46.529755Z",
    "updated_at": "2025-03-27T02:05:46.287255Z",
    "deleted_at": null,
    "sha1_hash": "6b306869b0433b5c69619726bda1adb8f8b9beaf",
    "title": "2022-03-02 - DanaBot Launches DDoS Attack Against the Ukrainian Ministry of Defense",
    "authors": "",
    "file_creation_date": "2022-05-28T19:11:53Z",
    "file_modification_date": "2022-05-28T19:11:53Z",
    "file_size": 793598,
    "plain_text": "# Using DDoS, DanaBot targets Ukrainian Ministry of Defense\n\n**[zscaler.com/blogs/security-research/danabot-launches-ddos-attack-against-ukrainian-ministry-defense](https://www.zscaler.com/blogs/security-research/danabot-launches-ddos-attack-against-ukrainian-ministry-defense)**\n\n## March 7, 2022 Update\n\nDanaBot affiliate ID 5 has stopped DDoSing the Ukrainian Ministry of Defense’s webmail server\n[and started DDoSing a hardcoded IP address, 138.68.177[.]158. According to Passive DNS data,](https://www.virustotal.com/gui/ip-address/138.68.177.158/relations)\nthis IP address has recently been associated with invaders-rf[.]com. This site claims to be (Google\ntranslated):\n\n“...an information resource of the Office of the National Security and Defense Council of Ukraine,\nwhich provides information about prisoners of war of the Russian Armed Forces who have invaded\nthe territory of Ukraine since February 24, 2022. The portal will be available to Russian citizens,\nincluding soldiers' families or acquaintances, to obtain information on the condition and\nwhereabouts of prisoners.”\n\nGiven the threat actor’s previous targeting, this seems like the likely target. The DDoS attack\npayload was written and distributed similarly to the Ukrainian Ministry of Defense DDoS payload\non March 2, 2022:\n\n## Key Points\n\nA threat actor using DanaBot has launched a Distributed Denial of Service (DDoS) attack\nagainst the Ukrainian Ministry of Defense’s webmail server.\nThe DDoS attack was launched by leveraging DanaBot to deliver a second-stage malware\npayload using the download and execute command.\nIt is unclear whether this is an act of individual hacktivism, state-sponsored, or possibly a\nfalse flag operation.\n\n\n-----\n\n[DanaBot, first discovered in 2018, is a malware-as-a-service platform where threat actors, known](https://malpedia.caad.fkie.fraunhofer.de/details/win.danabot)\nas affiliates are identified by affiliate IDs. These affiliates purchase access to the platform from\nanother threat actor who develops the malware and command and control (C2) panel, sets up and\nmaintains the shared C2 infrastructure, and provides sales and customer support. Affiliates then\ndistribute and use the malware as they see fit--mostly to steal credentials and commit banking\nfraud.\n\nOn Wednesday March 2, 2022, in the midst of the 2022 Russian invasion of Ukraine, the threat\nactor identified by the affiliate ID 5 launched an HTTP-based Distributed Denial of Service (DDoS)\nattack against the Ukrainian Ministry of Defense’s webmail server with the URL\nhxxps://post.mil.gov[.]ua as shown in Figure 1:\n\n_Figure 1: Hardcoded DDoS Target Attacked by DanaBot With Affiliate ID 5_\n\nAt the time of publication, the webmail server is still online and reachable as shown in Figure 2.\n\n\n-----\n\n_Figure 1: Ukrainian Ministry of Defense’s Webmail Server Targeted by DanaBot Affiliate ID 5_\n\nThe DDoS attack was launched using DanaBot's download and execute (command 2048 /\nsubcommand 9) to deliver a new executable with the SHA-256 hash:\n[b61cd7dc3af4b5b56412d62f37985e8a4e23c64b1908e39510bc8e264ebad700](https://www.virustotal.com/gui/file/b61cd7dc3af4b5b56412d62f37985e8a4e23c64b1908e39510bc8e264ebad700?nocache=1)\n\nSimilar to DanaBot, the downloaded DDoS executable is written in the Delphi programming\nlanguage. Its sole functionality is to implement a bare-bones HTTP-based DDoS attack on a\nhardcoded target. The executable is very similar to the one used in another DanaBot DDoS attack\nthat was documented in November 2021. In that attack, the DanaBot affiliate ID 4 launched a\nDDoS attack against a Russian language electronics forum.\n\n## Conclusion\n\nWhile the timing and targeting certainly suggest this new attack is related to the 2022 Russian\ninvasion of Ukraine, it is unclear whether this is an act of individual hacktivism, something statesponsored, or possibly a false flag operation. If the threat actor’s motive is to attack Ukraine, it is\nquite likely that in addition to the DDoS attack, the actor is using DanaBot’s more typical\nfunctionality such as credential theft and document theft against any relevant victims as well.\n\n## Cloud Sandbox Detection\n\n\n-----\n\n-----\n\n## Indicators of Compromise\n\n**IOC** **Notes**\n\n7ea65c1cb2687be42f427571e3223e425d602d043c39f690d0c3c42309aff513 SHA256 hash for\nthe affiliate ID 5\nDanaBot loader\ncomponent\n\n192.236.161[.]4 DanaBot affiliate\nID 5 C2 server\n\n23.106.122[.]14 DanaBot affiliate\nID 5 C2 server\n\n5.9.224[.]217 DanaBot affiliate\nID 5 C2 server\n\nockiwumgv77jgrppj4na362q4z6flsm3uno5td423jj4lj2f2meqt6ad[.]onion DanaBot affiliate\nID 5 C2 server\n\nb61cd7dc3af4b5b56412d62f37985e8a4e23c64b1908e39510bc8e264ebad700 SHA256 hash for\nthe DDoS attack\ntool targeting the\nUkrainian Ministry\nof Defense\n\nfd217dde8d03cfb9179f5ad783665bb67c47a92278971e28c3d399e7ac6f0a54 SHA256 hash for\nthe DDoS attack\ntool\ntargeting invadersrf\\.com\n\nc732d57f5b3354c368e54a16b193457d6f06b707c0388c5643677a9de13e04db SHA256 hash for\nthe DDoS attack\ntool\ntargeting invadersrf\\.com\n\n\n-----\n\n9706a9d8aacea34071f6f1691dc3c1af3d01868fc17deb83a4b8f33e2342a9d3 SHA256 hash for\nthe DDoS attack\ntool\ntargeting invadersrf\\.com\n\n**About ThreatLabz**\n\nThreatLabz is the security research arm of Zscaler. This world-class team is responsible for\nhunting new threats and ensuring that the thousands of organizations using the global Zscaler\nplatform are always protected. In addition to malware research and behavioral analysis, team\nmembers are involved in the research and development of new prototype modules for advanced\nthreat protection on the Zscaler platform, and regularly conduct internal security audits to ensure\nthat Zscaler products and infrastructure meet security compliance standards. ThreatLabz regularly\n[publishes in-depth analyses of new and emerging threats on its portal, research.zscaler.com.](https://research.zscaler.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-02 - DanaBot Launches DDoS Attack Against the Ukrainian Ministry of Defense.pdf"
    ],
    "report_names": [
        "2022-03-02 - DanaBot Launches DDoS Attack Against the Ukrainian Ministry of Defense.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536126,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653765113,
    "ts_modification_date": 1653765113,
    "files": {
        "pdf": "https://archive.orkl.eu/6b306869b0433b5c69619726bda1adb8f8b9beaf.pdf",
        "text": "https://archive.orkl.eu/6b306869b0433b5c69619726bda1adb8f8b9beaf.txt",
        "img": "https://archive.orkl.eu/6b306869b0433b5c69619726bda1adb8f8b9beaf.jpg"
    }
}