{
    "id": "e5e2fb68-e82d-4db9-b576-1735ab67191a",
    "created_at": "2023-01-12T15:09:37.402668Z",
    "updated_at": "2025-03-27T02:13:34.362402Z",
    "deleted_at": null,
    "sha1_hash": "977498dd66dbc119a42a5ac7acda26521b83de2d",
    "title": "2018-02-08 - UDPoS - exfiltrating credit card data via DNS",
    "authors": "",
    "file_creation_date": "2022-05-28T16:55:32Z",
    "file_modification_date": "2022-05-28T16:55:32Z",
    "file_size": 579691,
    "plain_text": "# UDPoS - exfiltrating credit card data via DNS\n\n**[forcepoint.com/blog/x-labs/udpos-exfiltrating-credit-card-data-dns](https://www.forcepoint.com/blog/x-labs/udpos-exfiltrating-credit-card-data-dns)**\n\nFebruary 8, 2018\n\nIn the current era of mass malware it's becoming increasingly rare to find something beyond\nthe ‘usual suspects’ we see being spread by high-profile botnets on a regular basis: Dridex\n[spread by Necurs, the ever-increasing number of ransomware](https://www.forcepoint.com/blog/security-labs/massive-email-campaign-spreads-scarab-ransomware) [families, cryptocurrency](https://www.forcepoint.com/blog/security-labs/notnotpetya-bad-rabbit)\nminers, credential stealers… the list goes on. These sorts of malware generally make up the\nmajority of incoming malicious samples and are, from a researcher's standpoint, typically not\n[very interesting. However, in amongst the digital haystack there exists the occasional needle:](https://www.virustotal.com/en/statistics)\nwe recently came across a sample apparently disguised as a LogMeIn service pack which\ngenerated notable amounts of 'unusual' DNS requests. Deeper investigation revealed\nsomething of a flawed gem, ultimately designed to steal magnetic stripe payment card data:\na hallmark of PoS malware.\n\n[Point of Sale malware has been around for some time and has been deployed against a](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-evolution-of-point-of-sale-pos-malware)\nbroad range of businesses from retailers to hotel groups. However, this appears to be a new\nfamily which we are currently calling 'UDPoS' owing to its heavy use of UDP-based DNS\ntraffic. At the time of writing, it's unclear whether the malware is currently being used in\ncampaigns in the wild, although the coordinated use of LogMeIn-themed filenames and C2\nURLs, coupled with evidence of an earlier Intel-themed variant, suggest that it may well be.\n\n**_Note: We have been in contact with LogMeIn throughout this investigation to help determine_**\n_whether their services or products may have been abused as part of the malware_\n_deployment process. No evidence of this was found and it appears that the use of LogMeIn-_\n_themed filenames and C2 domain by the actors behind the malware is a simple ‘camouflage’_\n_technique._\n\n**_Update: LogMeIn have published an advisory notice to their customers re-iterating the_**\n_[above. You can read their statement here.](https://blog.logmein.com/products/central/phishing-alert-pos-malware-mimic-logmein-software-updates)_\n\n## A set of two - service & monitor\n\nBehavioural analysis of the initial sample we discovered, a file named logmeinumon.exe,\nshowed it contacting a similarly LogMeIn-themed C2 server hosted by a Swiss-based VPS\nprovider (details below - note the use of an ‘L’ rather than an ‘I’ in the spelling of logmeln).\n\nInvestigation of the C2 revealed it also to be hosting the original dropper file, update.exe.\nThis file is a 7-Zip self-extracting archive containing\n_LogmeinServicePack 5.115.22.001.exe and logmeinumon.exe. Details of these files are in_\n\n\n-----\n\nthe table below.\n\nBoth of the LogMeIn-themed files have a compilation timestamp of 25 October 2017,\nsuggesting that this is a relatively recent campaign.\n\nUpon executing update.exe, its content is extracted to the %TEMP% directory and\n_LogmeinServicePack_5.115.22.001.exe automatically launched using 7-Zip's built in_\nRunProgram feature.\n\n_LogmeinServicePackLogmeinServicePack_5.115.22.001.exe – which we have called the_\nservice component – is responsible for setting up the malware by placing files into the\n_System32\\LogMeInUpdService directory and creating a new system service for persistence._\nIt does this via a batch file with a semi-random filename embedding standard Windows\ncommands for file and service operations. Once finished it passes over execution to the\nmonitoring component by launching logmeinumon.exe.\n\nThis monitoring component has an almost identical structure to the service component. It's\ncompiled by the same Visual Studio build and uses the same string encoding technique: both\nexecutables contain only a few identifiable plain-text strings, and instead use a basic\nencryption and encoding method to hide strings such as the C2 server, filenames, and hardcoded process names.\n\n## Evasive manoeuvres\n\nDespite maintaining a small footprint – only 88kb in size – the monitor component is a multithreaded application which creates five different threads after its initialisation code is\ncompleted. This initialisation code is mainly responsible for decrypting and decoding the\nmalware's internal strings, attempting to carry out an anti-AV/VM check, and either creating\nor loading an existing ‘Machine ID’ stored in a file called hdwid.dat in the same directory\nwhere the executables are deployed. This randomly generated identifier is used as {Machine\nID} in all of the DNS queries detailed within this blog.\n\nFor the anti-AV and anti-VM solution, there are four DLL and three Named Pipe identifiers\nstored in both service and monitor components:\n\n\n-----\n\nHowever, only the monitor component makes use of these and, moreover, the code\nresponsible for opening module handles is flawed: it will only try to open cmdvrt32.dll – a\nlibrary related to Comodo security products – and nothing else.\n\nIt is unclear at present whether this is a reflection of the malware still being in a relatively\nearly stage of development/testing or a straightforward error on the part of the developers.\n\n## Initialisation & evasion\n\nAfter initialisation, including after reboots, the monitor component performs a DNS query on\nthe embedded C2 address and retrieves the external IP address of the infected machine via\nan HTTP GET request:\n```\n{C2URL}/index.php/?udpool={Machine ID}\n\n```\n\n-----\n\nThe first time the malware is run, it also generates a batch file called infobat.bat which is\nsimilar in structure to the one examined for the service component. Again, this file uses a\nnumber of standard Windows commands to create a comprehensive fingerprint of the\ninfected machine containing network, system, route, and process related information. This\ndata is written to a local file called PCi.jpg and sent to the C2 server via DNS. Once\ncomplete, a flag is set in hdwid.dat.\n\nWhether this is intended for use later for lateral movement is unclear, but this information\nalone would be sufficient to treat this executable as malicious: the network map, list of\nrunning processes and list of installed security updates is highly valuable information.\n\n## DNS comms & post setup functionality\n\nAfter the initial HTTP request to determine its external IP address, the monitor component\nappears to communicate exclusively via fake DNS requests, all of which follow the format\n```\n{Machine ID}.{Message Type}.xxxx.xxxx.xxxx.xxxx\n\n```\nwhere {Machine ID} is always 15 characters long, {Message Type} is taken from a set of predefined strings, and the actual message components 'xxxx' can vary in length, but never\nexceed 31 characters.\n\nOur analysis identified five possible values for the {Message Type} field: bin, info, ping, trp,\nand note.\n\nThe bin messages are used to transmit the initial burst of data gathered into PCi.jpg by the\n_infobat.bat process, while ping is a heartbeat message sent to the C2 every 60 minutes._\n\n\n-----\n\n_Info messages - as the name suggests - are purely informational and are despatched_\nalongside ping messages:\n```\n{PCNAME}; {USERNAME}; [NS:IP {C2URL}:{C2IP}]\n\n```\nThe note and trp message types required further analysis and relate to the core functionality\nof the malware. Investigating the functionality spread across the additional threads revealed\n[a process designed to collect Track 1 and Track 2 payment card data by scraping the](https://en.wikipedia.org/wiki/ISO/IEC_7813)\nmemory of running processes. These processes are checked against an embedded and predefined blacklist of common system process and browser names with only ones not present\non the list being scanned.\n\nIf Track 1/2 data is found in memory it will be extracted as is, converted to and sent as a\n_trp message. A note message will be also generated and transmitted with the following_\ncontent:\n```\n[IP : {ipaddr} ] - String found in: {processname} \n```\nThe malware further logs this process name to a file called sinf.dat, the number of total\nprocesses with successful extraction to hdwid.dat and saves a hash of the trp message to\n_udwupd.kdl, presumably for the purpose of keeping track of what has already been_\nsubmitted to the C2 server.\n\nAll five message types are logged to the {Machine ID}.dat file prior to transmission.\n\n\n-----\n\n## Timelines\n\nAs the underlying intent of the malware became clear to us, we attempted to identify further\nsamples from the same family to determine whether this was something new (and possibly\nstill being tested before deployment) or part of an ongoing campaign.\n\nThese efforts revealed another service component, but unfortunately not the corresponding\nmonitor nor the parent 7-Zip SFX archive. Interestingly, this second service component was\nnamed ‘Intel Upgrade Services’ and apparently intended to masquerade as an Intel update\nas opposed to a LogMeIn update.\n\nBased on the compilation dates of the executables, the Intel-themed sample was created two\nweeks prior to the LogMeIn-themed one on 11 October 2017. Whether this is a sign that\nauthors of the malware were not successful in deploying it at first or whether these are two\ndifferent campaigns cannot be fully determined at this time due to the lack of additional\nexecutables.\n\n## Design decisions and detection rate\n\nThe coding style and techniques seen within the malware can hardly be described as\noutstanding. Beyond the faulty evasion code noted above, using data files written to disk\ninstead of working predominantly in memory – besides leaving unnecessary trails – is rarely\nthe trademark of bleeding edge malware and, equally, there are more advanced ways of\nfingerprinting a PC and generating a report. That said, the method used in this sample does\nappear to get the job done.\n\n[On the other hand, DNS-based communication and data exfiltration is genuinely unusual –](https://www.forcepoint.com/cyber-edu/data-exfiltration)\n[although not unique – and can be quite effective. Nearly all companies have firewalls and](https://www.fireeye.com/blog/threat-research/2016/04/multigrain_pointo.html)\nother protections in place to monitor and filter TCP- and UDP-based communications,\nhowever DNS is still often treated differently providing a golden opportunity to leak data.\n\nThe overall impression is of a piece of malware inspired by the success of (and some of the\nbetter ideas and techniques employed by) its predecessors.\n\n\n-----\n\nDetection rates for the malware are still very low for the monitor component at the time of\nwriting. Visibility is always an issue when it comes to non-traditional malware: samples which\ndo not target standard endpoints or servers can quite easily be missed because of the lack of\nfocus on protecting these sorts of systems.\n\n## Conclusion\n\nDiscovering a unique piece of malware is a rare event these days and UDPoS, while\n[unusual, is not a new concept. There have been several Point of Sale malware](https://www.darkreading.com/attacks-breaches/new-magikpos-malware-targets-point-of-sale-systems-in-us-and-canada-/d/d-id/1328434?) [families](https://www.trustwave.com/Resources/SpiderLabs-Blog/JackPOS-%E2%80%93-The-House-Always-Wins/)\nidentified over the past few years, all with the same goal: harvesting credit card data on a\nlarge scale – consider how many different cards may be used in stores, bars, or restaurants\nacross the course of a day, let alone weeks or months.\n\nFrom a consumer standpoint, protecting oneself against this sort of threat can be a tricky\nproposition for individuals: a PoS terminal could conceivably remain infected for significant\nlengths of time. However, enabling reporting on your credit card activity (many banks offer\nSMS, Push, and email alerts) can greatly reduce the time of discovery – and therefore\nrecovery – if abuse does occur.\n\nFor many businesses, the situation may not be much better: legacy PoS systems are often\nbased on variations of the Windows XP kernel and, in large retailers, may be present on\nhundreds or even thousands of devices. While Windows POSReady is in extended support\nuntil January 2019, it is still fundamentally an operating system which is seventeen years old\nthis year.\n\nAs UDPoS highlights, exfiltrating stolen credit card data can and will result in unusual\npatterns of activity on the machines (DNS traffic in this case). By identifying and reacting to\nthese patterns, businesses – both PoS terminal owners and suppliers - can close down this\nsort of attack sooner.\n\n## Protection statement\n\nForcepoint customers are protected against this threat at the following stages of attack:\n\n**Stage 5 (Dropper File) - Malicious files are prevented from being downloaded.**\n**Stage 6 (Call Home) - Attempts to contact the C2 server are blocked.**\n\n## Indicators of Compromise\n\n**C2 Server**\n```\nhxxp://service-logmeln[.]network/10/update.exe\nservice-logmeln.network\n\n```\n**SHA1 File Hashes**\n\n\n-----\n\n```\n195453b2dc788d393670db611116dcbc3994a1b4\nba3dc114f848a60f7af83533580b08c682d6f280\nd9f58b3c17a2a7b689bb3ed42bce6a5eb7855569\naab16598debb234a9a3732e45d1d1ef369da27d1\n\n### About Forcepoint\n\n```\nForcepoint is the leading user and data protection cybersecurity company, entrusted to\nsafeguard organizations while driving digital transformation and growth. Our solutions adapt\nin real-time to how people interact with data, providing secure access while enabling\nemployees to create value.\n\n[Learn more about Forcepoint](https://www.forcepoint.com/company/about-us)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-08 - UDPoS - exfiltrating credit card data via DNS.pdf"
    ],
    "report_names": [
        "2018-02-08 - UDPoS - exfiltrating credit card data via DNS.pdf"
    ],
    "threat_actors": [
        {
            "id": "e7d03ac8-7d6f-4ea0-83a9-10dff2ea1486",
            "created_at": "2022-10-25T16:07:24.158325Z",
            "updated_at": "2025-03-27T02:02:10.127249Z",
            "deleted_at": null,
            "main_name": "Scarab",
            "aliases": [
                "UAC-0026"
            ],
            "source_name": "ETDA:Scarab",
            "tools": [
                "Scieron"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9099912b-a00a-4afb-8294-c6d35af421a1",
            "created_at": "2023-01-06T13:46:39.338108Z",
            "updated_at": "2025-03-27T02:00:03.054726Z",
            "deleted_at": null,
            "main_name": "Scarab",
            "aliases": [],
            "source_name": "MISPGALAXY:Scarab",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536177,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653756932,
    "ts_modification_date": 1653756932,
    "files": {
        "pdf": "https://archive.orkl.eu/977498dd66dbc119a42a5ac7acda26521b83de2d.pdf",
        "text": "https://archive.orkl.eu/977498dd66dbc119a42a5ac7acda26521b83de2d.txt",
        "img": "https://archive.orkl.eu/977498dd66dbc119a42a5ac7acda26521b83de2d.jpg"
    }
}