{
    "id": "e62e4cc8-5680-4297-923f-ef216809cc18",
    "created_at": "2023-01-12T15:02:01.504855Z",
    "updated_at": "2025-03-27T02:10:28.507689Z",
    "deleted_at": null,
    "sha1_hash": "c128edb75372376520d67a4c098e7a27e49b145e",
    "title": "2021-12-29 - OverWatch Exposes AQUATIC PANDA in Possession of Log4Shell Exploit Tools During Hands-on Intrusion Attempt",
    "authors": "",
    "file_creation_date": "2022-08-18T03:44:58Z",
    "file_modification_date": "2022-08-18T03:44:58Z",
    "file_size": 2337061,
    "plain_text": "# AQUATIC PANDA in Possession of Log4Shell Exploit Tools\n\n**[crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools](https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools)**\n\nBenjamin Wiley and the Falcon OverWatch Team December 29, 2021\n\nFollowing the Dec. 9, 2021, announcement of the Log4j vulnerability, [CVE 2021-44228,](https://nvd.nist.gov/vuln/detail/CVE-2021-44228)\nCrowdStrike Falcon OverWatch™ has provided customers with unrivaled protection and\n24/7/365 vigilance in the face of heightened uncertainty.\n\nTo OverWatch, [Log4Shell is simply the latest vulnerability to exploit — a new access vector](https://www.crowdstrike.com/blog/log4j2-vulnerability-analysis-and-mitigation-recommendations/)\namong a sea of many others. Adversarial behavior post-exploitation remains substantially\nunchanged, and it is this behavior that OverWatch threat hunters are trained to detect and\ndisrupt. OverWatch’s human-driven hunting workflows and patented tooling make it uniquely\nagile in the face of rapidly evolving cyber threats.\n\nSince the vulnerability was announced, OverWatch threat hunters have been continuously\ningesting the latest insights about the Log4j vulnerability as well as publicly disclosed exploit\nmethods to influence their continuous hunting operations. On Dec. 14, 2021, VMware issued\nguidance around elements of VMware’s Horizon service found to be vulnerable to Log4j\nexploits. This led OverWatch to hunt for unusual child processes associated with the VMware\nHorizon Tomcat web server service during routine operations.\n\n\n-----\n\nOn the back of this updated hunting lead, OverWatch uncovered suspicious activity\nstemming from a Tomcat process running under a vulnerable VMware Horizon instance at a\nlarge academic institution, leading to the disruption of an active hands-on intrusion. Thanks\nto the quick action of OverWatch threat hunters, the victim organization received the contextrich alerts they needed to begin their incident response protocol.\n\n## OverWatch’s Rapid Notification Process Disrupts AQUATIC PANDA\n\n[OverWatch threat hunters observed the threat actor performing multiple connectivity checks](https://www.crowdstrike.com/cybersecurity-101/threat-actor/)\nvia DNS lookups for a subdomain under `dns[.]1433[.]eu[.]org, executed under the`\nApache Tomcat service running on the VMware Horizon instance. OverWatch has observed\nmultiple threat actors utilizing publicly accessible DNS logging services like\n```\ndns[.]1433[.]eu[.]org during exploit attempts in order to identify vulnerable servers\n\n```\nwhen they connect back to the attacker-controlled DNS service.\n\nFigure 1. Initial suspicious reconnaissance commands identified by OverWatch\n\nThe threat actor then executed a series of Linux commands, including attempting to execute\na bash-based interactive shell with a hardcoded IP address as well as curl and wget\ncommands in order to retrieve threat actor tooling hosted on remote infrastructure. Our\nCrowdStrike Intelligence team later linked the infrastructure to the threat actor known as\nAQUATIC PANDA. (Read more about AQUATIC PANDA at the end of this post.)\n\nThe execution of Linux commands on a Windows host under the Apache Tomcat service\nimmediately drew the attention of OverWatch threat hunters. After triaging this initial burst of\nactivity, OverWatch immediately sent a critical detection to the victim organization’s\nCrowdStrike Falcon® platform and shared additional details directly with their security team.\n\nFigure 2. Failed attempts to execute Linux commands on a Windows host\n\nBased on the telemetry available to OverWatch threat hunters and additional findings made\nby CrowdStrike Intelligence, CrowdStrike assesses that a modified version of the Log4j\nexploit was likely used during the course of the threat actor’s operations.\n\n\n-----\n\nFigure 3. Suspected Log4j exploits found in AQUATIC PANDA’s possession\n\nUsing the telemetry discovered through intelligence analysis of the `JNDI-Injection-`\n\n`Exploit-1.0.jar` file, OverWatch was able to confirm that the same file was released on a\npublic GitHub project on Dec. 13, 2021, as seen in Figure 4 below, and was potentially\nutilized in order to gain access to the vulnerable instance of VMware Horizon based on\nfollow-on activity observed by OverWatch.\n\n\n-----\n\nFigure 4. GitHub project with Log4j exploit — hxxps[:]//github[.]com/dbgee/log4j2_rce (Click to enlarge)\n\nAQUATIC PANDA continued their reconnaissance from the host, using native OS binaries to\nunderstand current privilege levels as well as system and domain details. OverWatch threat\nhunters also observed an attempt to discover and stop a third-party endpoint detection and\nresponse (EDR) service.\n\nOverWatch continued to track the threat actor’s malicious behavior as they downloaded\nadditional scripts and then executed a Base64-encoded command via PowerShell to1\nretrieve malware from their toolkit.\n\nOverWatch observed the threat actor retrieve three files with VBS file extensions from\nremote infrastructure. These files were then decoded using `cscript.exe into an EXE, DLL`\nand DAT file respectively. Based on the telemetry available, OverWatch believes these files\n\n\n-----\n\nlikely constituted a reverse shell, which was loaded into memory via DLL search-order\nhijacking.2\n\nFinally, OverWatch observed AQUATIC PANDA make multiple attempts at credential\nharvesting by dumping the memory of the LSASS process using living-off-the-land binaries3\n\n`rdrleakdiag.exe and` `cdump.exe` — a renamed copy of `createdump.exe . The threat`\nactor used winRAR to compress the memory dump in preparation for exfiltration before\nattempting to cover their tracks by deleting all executables from the `ProgramData and`\n\n`Windows\\temp\\` directories.\n\nFigure 5. Example command line used in attempted memory dump\n\nFigure 6. Falcon platform telemetry capturing threat actor actions\n\nThroughout the intrusion, OverWatch tracked the threat actor’s activity closely in order to\nprovide continuous updates to the victim organization. Based on the actionable intelligence\nprovided by OverWatch, the victim organization was able to quickly implement their incident\nresponse protocol, eventually patching the vulnerable application and preventing further\nthreat actor activity on the host.\n\n\n-----\n\nThe discussion globally around Log4j has been intense, putting many organizations on edge.\nNo organization wants to hear about such a potentially destructive vulnerability affecting its\nnetworks. It is in these times of great uncertainty that the true value of continuous threat\nhunting is brought to light. OverWatch searches for evidence of malicious behavior — not\nadversary entry points. Although new vulnerabilities present adversaries with a new entry\nvector, they do not change the hands-on-keyboard activity OverWatch threat hunters are\ntrained to detect and disrupt.\n\nTo stay current on how to protect against this latest vulnerability, CrowdStrike’s overall\n[mitigation advice for Log4j is being updated as new information comes to light.](https://www.crowdstrike.com/blog/log4j2-vulnerability-analysis-and-mitigation-recommendations/)\n\n## AQUATIC PANDA\n\nAQUATIC PANDA is a China-based targeted intrusion adversary with a dual mission of\nintelligence collection and industrial espionage. It has likely operated since at least May\n2020. AQUATIC PANDA operations have primarily focused on entities in the\ntelecommunications, technology and government sectors. AQUATIC PANDA relies heavily\non Cobalt Strike, and its toolset includes the unique Cobalt Strike downloader tracked as\nFishMaster. AQUATIC PANDA has also been observed delivering njRAT payloads to targets.\n\n### Endnotes\n\n[1. Learn more about this technique at https://attack.mitre.org/techniques/T1132/001/ and](https://attack.mitre.org/techniques/T1132/001/)\n\n[https://attack.mitre.org/techniques/T1059/001/.](https://attack.mitre.org/techniques/T1059/001/)\n[2. Learn more about this technique at https://attack.mitre.org/techniques/T1574/001/.](https://attack.mitre.org/techniques/T1574/001/)\n[3. Learn more about this technique at https://attack.mitre.org/techniques/T1003/001/.](https://attack.mitre.org/techniques/T1003/001/)\n\n**Additional Resources**\n\n_Visit the_ _[CrowdStrike Log4j Vulnerability Learning Center.](https://www.crowdstrike.com/log4j2/)_\n_Access the_ _[CrowdStrike Archive Scan Tool (CAST).](https://github.com/CrowdStrike/CAST)_\n_[Download the CrowdStrike Log4j Quick Reference Guide.](https://www.crowdstrike.com/resources/guides/quick-reference-guide-log4j-remote-code-execution-vulnerability/)_\n_[Learn about the powerful, cloud-native CrowdStrike Falcon® platform.](https://www.crowdstrike.com/endpoint-security-products/)_\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ to see for yourself how](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_true next-gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-29 - OverWatch Exposes AQUATIC PANDA in Possession of Log4Shell Exploit Tools During Hands-on Intrusion Attempt.pdf"
    ],
    "report_names": [
        "2021-12-29 - OverWatch Exposes AQUATIC PANDA in Possession of Log4Shell Exploit Tools During Hands-on Intrusion Attempt.pdf"
    ],
    "threat_actors": [
        {
            "id": "ba3eea09-ce30-4cfa-ae3a-b5992c4b81f8",
            "created_at": "2022-10-25T15:50:23.441443Z",
            "updated_at": "2025-03-27T02:00:55.469723Z",
            "deleted_at": null,
            "main_name": "Aquatic Panda",
            "aliases": [
                "Aquatic Panda"
            ],
            "source_name": "MITRE:Aquatic Panda",
            "tools": [
                "Wevtutil",
                "Winnti for Windows",
                "njRAT",
                "Cobalt Strike",
                "ShadowPad",
                "Winnti for Linux"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "19935e32-f1a5-462d-8934-8b1c3bf3b5f2",
            "created_at": "2022-10-25T16:07:23.36465Z",
            "updated_at": "2025-03-27T02:02:09.760568Z",
            "deleted_at": null,
            "main_name": "Aquatic Panda",
            "aliases": [],
            "source_name": "ETDA:Aquatic Panda",
            "tools": [
                "Agentemis",
                "Bladabindi",
                "Cobalt Strike",
                "CobaltStrike",
                "Fishmaster",
                "JollyJellyfish",
                "Jorik",
                "cobeacon",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535721,
    "ts_updated_at": 1743041428,
    "ts_creation_date": 1660794298,
    "ts_modification_date": 1660794298,
    "files": {
        "pdf": "https://archive.orkl.eu/c128edb75372376520d67a4c098e7a27e49b145e.pdf",
        "text": "https://archive.orkl.eu/c128edb75372376520d67a4c098e7a27e49b145e.txt",
        "img": "https://archive.orkl.eu/c128edb75372376520d67a4c098e7a27e49b145e.jpg"
    }
}