{
    "id": "e6950bfb-7826-4f8c-8d2c-8a3fc191869e",
    "created_at": "2023-05-06T02:08:29.839625Z",
    "updated_at": "2025-03-27T02:16:14.043483Z",
    "deleted_at": null,
    "sha1_hash": "e9380431f116a50219e89925936203026472e0db",
    "title": "2023-04-07 - MERCURY and DEV-1084- Destructive attack on hybrid environment",
    "authors": "",
    "file_creation_date": "2023-05-05T01:58:07Z",
    "file_modification_date": "2023-05-05T01:58:07Z",
    "file_size": 1142796,
    "plain_text": "# MERCURY and DEV-1084: Destructive attack on hybrid environment\n\n**[microsoft.com/en-us/security/blog/2023/04/07/mercury-and-dev-1084-destructive-attack-on-hybrid-environment/](https://www.microsoft.com/en-us/security/blog/2023/04/07/mercury-and-dev-1084-destructive-attack-on-hybrid-environment/)**\n\nApril 7, 2023\n\n**April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy**\naligned around the theme of weather. MERCURY is now tracked as Mango Sandstorm and DEV-1084 is\nnow tracked as Storm-1084.\n\nTo learn more about the new taxonomy represents the origin, unique traits, and impact of threat actors, to\nget complete mapping of threat actor names, read this blog: Microsoft shifts to a new threat actor\n**naming taxonomy.**\n\n[Microsoft Threat Intelligence has detected destructive operations enabled by MERCURY, a nation-state actor](https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/)\nlinked to the Iranian government, that attacked both on-premises and cloud environments. While the threat\nactors attempted to masquerade the activity as a standard ransomware campaign, the unrecoverable actions\nshow destruction and disruption were the ultimate goals of the operation.\n\nPrevious MERCURY attacks have been observed targeting on-premises environments, however, the impact in\nthis case notably also included destruction of cloud resources. Microsoft assesses that MERCURY likely worked\nin partnership with another actor that Microsoft tracks as DEV-1084, who carried out the destructive actions after\nMERCURY’s successful operations had gained access to the target environment.\n\nMERCURY likely exploited known vulnerabilities in unpatched applications for initial access before handing off\naccess to DEV-1084 to perform extensive reconnaissance and discovery, establish persistence, and move\nlaterally throughout the network, oftentimes waiting weeks and sometimes months before progressing to the\nnext stage. DEV-1084 was then later observed leveraging highly privileged compromised credentials to perform\nen masse destruction of resources, including server farms, virtual machines, storage accounts, and virtual\nnetworks, and send emails to internal and external recipients.\n\nIn this blog post, we detail our analysis of the observed actor activity and related tools. We also share\ninformation to the community and industry partners on ways to detect these attacks, including detection details\nof MERCURY and DEV-1084’s tools in Microsoft 365 Defender, Microsoft Defender for Identity, Microsoft\nDefender for Cloud Applications, Microsoft Defender Antivirus, and Microsoft Defender for Endpoint. As with any\nobserved nation-state actor activity, Microsoft has directly notified targeted or compromised customers, providing\nthem with important information needed to secure their environments.\n\nMicrosoft uses DEV-#### designations as a temporary name given to an unknown, emerging, or a developing\ncluster of threat activity, allowing Microsoft to track it as a unique set of information until we reach high\nconfidence about the origin or identity of the actor behind the activity.\n\n## Who is DEV-1084?\n\nMicrosoft tracks the destructive actions documented in this blog post as DEV-1084. DEV-1084 likely worked in\npartnership with MERCURY—an Iran-based actor that the US Cyber Command has publicly linked to Iran’s\nMinistry of Intelligence and Security (MOIS). DEV-1084 publicly adopted the DarkBit persona and presented\nitself as a criminal actor interested in extortion, likely as an attempt to obfuscate Iran’s link to and strategic\nmotivation for the attack.\n\nThe link between the DEV-1084 cluster and MERCURY was established based on the following evidence:\n\n\n-----\n\nDEV 1084 operators were observed sending threatening emails from 146.70.106[.]89, an IP address\npreviously linked to MERCURY.\nDEV-1084 used MULLVAD VPN, the same VPN provider historically used by MERCURY.\nDEV-1084 used Rport and a customized version of Ligolo. MERCURY has also been observed using Rport\nand a similar version of Ligolo in previous attacks.\nDEV-1084 used the vatacloud[.]com domain for command and control (C2) during this incident. Microsoft\nassesses with high-confidence that the vatacloud[.]com domain is controlled by MERCURY operators.\n\nMicrosoft assesses that MERCURY gains access to the targets through remote exploitation of an unpatched\ninternet-facing device. MERCURY then handed off access to DEV-1084. It is not currently clear if DEV-1084\noperates independently of MERCURY and works with other Iranian actors or if DEV-1084 is an ‘effects based’\nsub-team of MERCURY that only surfaces when MERCURY operators are instructed to carry out a destructive\nattack.\n\n## Early activities, related attacker tools and techniques\n\nMicrosoft assesses with moderate confidence that the threat actors attempted several times and succeeded to\nperform initial intrusion leveraging exposed vulnerable applications, for example, continuing to exploit Log4j 2\nvulnerabilities in unpatched systems in July 2022.\n\nAfter gaining access, the threat actors deploy several tools and leverage techniques to maintain persistence,\nwhich provide effective and continued access to compromised devices, such as the following:\n\nInstalling web shells\nAdding a local user account and elevating privileges to local administrator\n[Installing legitimate remote access tools, such as RPort, Ligolo and eHorus](https://rport.io/)\nInstalling a customized PowerShell script backdoor\nStealing credentials\n\nOnce the persistence is established, the threat actors perform extensive discovery leveraging common native\nWindows tools and commands such as netstat and nltest. Such reconnaissance activities were seen leveraged\nthroughout the attack chain.\n\nThe threat actors consistently perform extensive lateral movement actions using the acquired credentials within\na targeted environment. These actions mainly involved:\n\nRemote scheduled tasks to launch their customized PowerShell backdoor\nWindows Management Instrumentation (WMI) to launch commands on devices\nRemote services to run encoded PowerShell commands\n\nAfter infecting the new devices, the threat actors often installed the same persistence mechanisms as described\nabove. Interestingly, after each main attack step, the actors did not always immediately continue their operations\nbut would wait weeks and sometimes months before moving to the next step.\n\nFor execution and communication, the threat actors leverage several C2 servers and sometimes deploy\n[tunnelling tools, such as Ligolo and](https://github.com/nicocha30/ligolo-ng) [OpenSSH, commonly leveraged to stay under the radar of security teams](https://www.openssh.com/)\nand solutions.\n\n## On-premises destructive impact\n\nIn observed activity, the threat actors leveraged highly privileged credentials and access to domain controllers on\non-premises destructive operations to prepare for large-scale encryption of targeted devices.\n\n\n-----\n\nTo do so, they first interfered with security tools using Group Policy Objects (GPO). With defenses impaired, the\nthreat actors proceeded to stage the ransomware payload in the NETLOGON shares on several domain\ncontrollers.\n\nGPO was leveraged again to register a scheduled task used to launch the ransomware payload. Finally, the\nransomware payload encrypted files found on the file system of the targeted devices by changing the file name\nextension to DARKBIT and dropped ransom notes.\n\nFigure 1. On-premises attack flow\n\n## Moving from on-premises to cloud\n\nTo move from on-premises to the cloud, the threat actors had to first compromise two privileged accounts and\nleverage them to manipulate the Azure Active Directory (Azure AD) Connect agent. Two weeks before the\nransomware deployment, the threat actors first used a compromised, highly privileged account to access the\ndevice where the Azure Active Directory (Azure AD) Connect agent is installed. We assess with high confidence\nthat the threat actors then used the AADInternals tool to extract the plaintext credentials of a privileged Azure\nAD account. The threat actors then used these credentials to pivot from the on-premises environment to the\nAzure AD environment.\n\n[Azure AD Connect is an on-premises application for managing hybrid identities through features like password](https://learn.microsoft.com/azure/active-directory/hybrid/whatis-azure-ad-connect)\nhash synchronization, [pass-through authentication,](https://learn.microsoft.com/azure/active-directory/hybrid/how-to-connect-pta) [objects synchronization, and others. As part of the express](https://learn.microsoft.com/azure/active-directory/hybrid/how-to-connect-sync-whatis)\nsettings installation process, multiple accounts are created both in the on-premises (Windows Server Active\nDirectory) and cloud (Azure AD) environments. The first account is the AD DS Connector Account. The account\nname is prefixed with MSOL_ and it is created with a long complex password.\n\nFigure 2. Example of AD DS Connector account\n\n\n-----\n\nThis account s permissions are set based on features enabled during the service s installation, but in most\ncommon scenarios, the account has permissions to replicate directory changes, modify passwords, modify\n[users, modify groups, and so on (see all the permissions here). In addition, during installation, an Azure AD](https://learn.microsoft.com/azure/active-directory/hybrid/reference-connect-accounts-permissions#create-the-ad-ds-connector-account)\naccount called the Azure AD Connector Account is also created. This account is used by the synchronization\nservice to manage Azure AD objects. The account is created with a long complex password as well, and by\ndefault (if using the express settings) prefixed with Sync_[ServerName]. This user is assigned with the Directory\n[Synchronization Accounts role (see detailed permissions of this role here). In older versions, this account might](https://learn.microsoft.com/azure/active-directory/roles/permissions-reference#directory-synchronization-accounts)\nbe assigned with the Global Administrator role.\n\nFigure 3. Example of an Azure AD Connector account\n[There are other entities detailed here that are created but are less relevant to this topic.](https://learn.microsoft.com/azure/active-directory/hybrid/reference-connect-accounts-permissions)\n\n### Extracting credentials\n\nTwo weeks before the ransomware deployment, the threat actors were observed using compromised credentials\nto access the Azure AD Connect device. Next, they set up an SSH tunnel to an attacker-controlled device. On a\nseparate attacker-controlled compromised device, evidence indicates cloning of the AADInternals tool. One of\n[the functions available in this tool’s library is Get-AADIntSyncCredentials, which allows any local administrator](https://github.com/Gerenios/AADInternals/blob/master/AADSyncSettings.ps1#L97)\non a device where Azure AD Connect is installed to extract the plaintext credentials of both the Azure AD\nConnector account and the AD DS Connector account.\n\nShortly before the ransomware deployment, we observed authentication from a known attacker IP address into\nthe Azure AD Connector cloud account. Investigating this sign-in showed that the threat actors were able to\naccess the account on the first attempt without any guessing or modification of the password, indicating that the\nactors possessed the password for this account. The Azure AD Connector account is configured with singlefactor authentication, making it easier for the attacker to gain entry and elevate privileges.\n\n## Cloud destructive impact\n\nOn the day of the ransomware attack, the threat actors executed multiple actions in the cloud using two\nprivileged accounts. The first account was the compromised Azure AD Connector account, which had Global\nAdministrator permissions as it was set up for an old solution (DirSync). For the second account, which also had\nGlobal Administrator permissions, the threat actors leveraged RDP for access into the account. Even though this\naccount had MFA in place, the threat actors accessed it through RDP, which is an open session that evades\nMFA blocking their activities.\n\nFigure 4. Pivoting to the cloud\n\n### Mass Azure resource deletion\n\n\n-----\n\nOn the same day, a successful sign in to the Microsoft Azure environment was observed. The threat actors\n[claimed the Global Administrator permission through Azure Privileged Identity Management (PIM) and](https://learn.microsoft.com/azure/active-directory/privileged-identity-management/pim-configure) [elevated](https://learn.microsoft.com/azure/role-based-access-control/elevate-access-global-admin)\naccess to get permissions to the target’s management groups and Azure subscriptions. The Azure AD\nConnector account and the compromised administrator account were then used to perform significant\ndestruction of the Azure environment—deleting within a few hours server farms, virtual machines, storage\naccounts, and virtual networks. We assess that the attacker’s goal was to cause data loss and a denial of\nservice (DoS) of the target’s services.\n\n### Exchange Web Server API abuse\n\nThe actors went on to provide an existing legitimate OAuth application with both the full_access_as_app\npermission and administrator consent, which granted the threat actors full access to mailboxes through\nExchange Web Services.\n\nFigure 5. Adding access permission to the existing application\nWith the obtained cloud administrator privileges, the threat actors updated the OAuth application with certificates\nto conduct malicious activities. These newly added credentials could then be used to issue access tokens and\nauthenticate on behalf of the application to access cloud resources.\n\n[We then observed the threat actors using this application’s permissions to perform GetItem operations over](https://learn.microsoft.com/exchange/client-developer/web-service-reference/getitem-operation-email-message)\nmany mailboxes in the target environment. They also performed thousands of search activities, which we\nsuspect were attempts to dump mailboxes and/or search for sensitive data in them.\n\n### Email impersonation\n\nThe threat actors used the compromised administrator account to grant SMTP Send on behalf permissions to\nthe Azure AD Connector account over a high-ranking employee’s mailbox, using the Set-Mailbox PowerShell\ncmdlet.\n\n\n-----\n\nFigure 6. Threat actors granting access to\n\nsend emails on behalf of the target’s account\nEmails were then created and sent both internally and externally.\n\nFigure 7. Threat actors successfully sent email through the targeted account\nThe timeline below summarizes the sequence of events:\n\n\n-----\n\nFigure 8. Cloud attack flow timeline\n\n## Mitigations for destructive attacks\n\nThe techniques used by the actors and described in this blog can be mitigated by adopting the following security\nmeasures:\n\n**Recommendations to secure your on-prem environment**\n\nRefer to Microsoft’s blog Ransomware as a service: Understanding the cybercrime gig economy and how\nto protect yourself for recommendations on building strong credential hygiene and other robust measures\nto defend against ransomware and human operated attacks.\n[Enable tamper protection – Tamper protection is a feature in Microsoft Defender for Endpoint that prevents](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection?view=o365-worldwide)\nantivirus tampering and misconfiguration by malicious apps and actors. Customers running Intune can\n[enable DisableLocalAdminMerge to prevent modification of antivirus exclusions via GPO.](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/manage-tamper-protection-intune?view=o365-worldwide#tamper-protection-for-antivirus-exclusions)\n\n**Recommendations to secure your Azure AD environment**\n\n[Enable Conditional Access policies – Conditional Access policies are evaluated and enforced every time](https://learn.microsoft.com/azure/active-directory/conditional-access/overview)\nthe user attempts to sign in. Organizations can protect themselves from attacks that leverage stolen\ncredentials by enabling policies such as device compliance or trusted IP address requirements.\n[Enable continuous access evaluation – Continuous access evaluation (CAE) revokes access in real time](https://learn.microsoft.com/azure/active-directory/conditional-access/concept-continuous-access-evaluation)\nwhen changes in user conditions trigger risks, such as when a user is terminated or moves to an untrusted\nlocation.\nSearch unified audit logs for the SendAs operation to identify and track emails sent on behalf of a user\nmailbox.\nFurther steps and recommendation to manage, design, and secure your Azure AD environment can be\n[found by referring to Azure Identity Management and access control security best practices.](https://learn.microsoft.com/azure/security/fundamentals/identity-management-best-practices)\n\n## Detections\n\n### Microsoft 365 Defender\n\n[The following alerts in Microsoft 365 Defender can be used to detect suspicious operations in Azure related to](https://www.microsoft.com/security/business/threat-protection/microsoft-365-defender)\nthe attacker activities described in this blog, including destructive activity:\n\nAccess elevation by risky user\nSuspicious Azure resource deletions\nSuspicious Addition of an Exchange related App Role\n\nIn addition, the following alert can help detect compromised Azure AD Connect accounts:\n\nUnusual activities by Azure AD Connect sync account\n\n### Microsoft Defender for Cloud Apps\n\n\n-----\n\n[For Microsoft Defender for Cloud Apps with Azure Connector enabled, the following alerts can be used to detect](https://learn.microsoft.com/defender-cloud-apps/connect-azure)\ndestructive operations in Azure:\n\nMultiple storage deletion activities\nMultiple delete VM activities\n\n### Azure AD Identity Protection\n\nMonitor medium and high severity alerts for highly privileged accounts as they can indicate malicious activity. For\nexample:\n\nUnfamiliar sign-in properties\n\n[Find details of Azure AD Identity Protection alerts here.](https://learn.microsoft.com/azure/active-directory/identity-protection/concept-identity-protection-risks#premium-detections)\n\n### Microsoft Defender for Identity\n\nThe following Microsoft Defender for Identity alerts can indicate associated threat activity:\n\nSuspicious additions to sensitive groups\n\nFor relevant accounts with Honeytoken configured, the following alert can indicate malicious activity:\n\nHoneytoken activity\n\n### Microsoft Defender Antivirus\n\nMicrosoft Defender Antivirus detects attempted exploitation and post-exploitation activity and payloads. Turn on\ncloud-delivered protection to cover rapidly evolving attacker tools and techniques. Cloud-based machine\n[learning protections block most new and unknown threats. Refer to the list of detection names related to](https://www.microsoft.com/security/blog/2021/12/11/guidance-for-preventing-detecting-and-hunting-for-cve-2021-44228-log4j-2-exploitation/#AV)\nexploitation of Log4j 2 vulnerabilities. Detections for the IOCs listed above are listed below:\n\nBackdoor:PHP/Remoteshell.V\nHackTool:Win32/LSADump\nVirTool:Win32/RemoteExec\nTrojan:PowerShell/Downloader.SB\nTrojan:Win32/Nibtse.G!tsk\nBackdoor:ASP/Shellman.SA\nRansom:Win64/DarkBit\nVirTool:Win32/AtExecCommand\n\n### Microsoft Defender for Endpoint\n\nMicrosoft Defender for Endpoint alerts with the following titles can indicate possible presence of the indicators of\ncompromise listed below.\n\nMercury actor activity detected\nRansomware-linked emerging threat actor DEV-1084 detected\n\n**Reducing the attack surface**\n\nMicrosoft Defender for Endpoint customers can turn on the following attack surface reduction rule to block or\naudit some observed activity associated with this threat:\n\nBlock executable files from running unless they meet a prevalence, age, or trusted list criterion.\n\n\n-----\n\n[Implement controlled folder access and add folders to the protected folders list to help prevent files from](https://support.microsoft.com/topic/ransomware-protection-in-windows-security-445039d6-537a-488a-ad53-48906f346363)\n[being altered or encrypted by ransomware. Set controlled folder access to Enabled.](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/enable-controlled-folders?view=o365-worldwide)\n\n**Detecting Log4j 2 exploitation**\n\nAlerts that indicate threat activity related to the exploitation of the Log4j 2 exploitation should be immediately\ninvestigated and remediated. Refer to our Log4j related blogs to learn about this vulnerability and for a list of\n[Microsoft Defender for Endpoint alerts that can indicate exploitation and exploitation attempts.](https://www.microsoft.com/security/blog/2021/12/11/guidance-for-preventing-detecting-and-hunting-for-cve-2021-44228-log4j-2-exploitation/#MDE)\n\n**Detecting post-exploitation activity**\n\nAlerts with the following titles may indicate post-exploitation threat activity related to MERCURY activity\ndescribed in this blog and should be immediately investigated and remediated. These alerts are supported on\nboth Windows and Linux platforms:\n\nAny alert title related to web shell threats, for example:\n\n‘WebShell’ backdoor was prevented on an IIS Web server\n\nAny alert title that mentions the DarkBit ransomware threat or DEV-1084, for example:\n\n‘DarkBit’ ransomware was blocked\n‘DarkBit’ ransomware was detected\n‘DarkBit’ ransomware was prevented\nRansomware-linked emerging threat actor DEV-1084 detected\n\nAny alert title that mentions suspicious scheduled task creation or execution, for example:\n\nSuspicious scheduled task\n\nAny alert title that mentions suspected tunneling activity, for example:\n\nSuspicious SSH tunneling activity\n\nAny alert title that mentions suspected tampering activity, for example:\n\nSuspicious Microsoft Defender Antivirus exclusion\nMicrosoft Defender Antivirus tampering\n\nAny alert title that mentions PowerShell, for example:\n\nSuspicious process executed PowerShell command\nA malicious PowerShell Cmdlet was invoked on the machine\nSuspicious PowerShell command line\nSuspicious PowerShell download or encoded command execution\nSuspicious remote PowerShell execution\n\nAny alert title related to suspicious remote activity, for example:\n\nSuspicious RDP session\nAn active ‘RemoteExec’ malware was blocked\nSuspicious service registration\n\nAny alert related to persistence:\n\nAnomaly detected in ASEP registry\n\n\n-----\n\nUser account created under suspicious circumstances\n\nAny alert title that mentions credential dumping activity or tools, for example:\n\nMalicious credential theft tool execution detected\nCredential dumping activity observed\nMimikatz credential theft tool\n‘DumpLsass’ malware was blocked on a Microsoft SQL server\n\n### Microsoft Defender Vulnerability Management\n\nIn addition to the mitigations above being presented and managed through Microsoft Defender Vulnerability\nManagement, Microsoft 365 Defender customers can use threat and vulnerability management to identify and\nremediate devices that are vulnerable to Log4j 2 exploitation. More comprehensive guidance on this capability\ncan be found on this blog: Guidance for preventing, detecting, and hunting for exploitation of the Log4j 2\nvulnerability.\n\n## Advanced hunting queries\n\n### Microsoft 365 Defender\n\nTo locate related activity, Microsoft 365 Defender customers can run the following advanced hunting queries:\n\n// Advanced Hunting Query to surface potential Mercury PowerShell script backdoor installation\n```\nDeviceFileEvents\n\n| where InitiatingProcessFileName =~ \"powershell.exe\"\n\n| where FolderPath in~ (@\"c:\\programdata\\db.ps1\", @\"c:\\programdata\\db.sqlite\")\n\n| summarize min(Timestamp), max(Timestamp) by DeviceId, SHA256, InitiatingProcessParentFileName\n\nDeviceProcessEvents\n\n| where InitiatingProcessFileName =~ \"powershell.exe\"\n\n| where InitiatingProcessCommandLine has_cs \"-EP BYPASS -NoP -W h\"\n\n| summarize makeset(ProcessCommandLine), min(Timestamp), max(Timestamp) by DeviceId\n\n\n```\n// Advanced Hunting Query to surface potential Mercury PowerShell script backdoor initiating commands\n```\nDeviceProcessEvents\n\n| where InitiatingProcessFileName =~ \"powershell.exe\"\n\n| where InitiatingProcessCommandLine contains_cs @\"c:\\programdata\\db.ps1\"\n\n| summarize makeset(ProcessCommandLine), min(Timestamp), max(Timestamp) by DeviceId\n\n\n```\n//Advanced Hunting Query for Azure resource deletion activity\n```\nlet PrivEscalation = CloudAppEvents\n\n| where Application == \"Microsoft Azure\"\n\n| where ActionType == \"ElevateAccess Microsoft.Authorization\"\n\n| where ActivityObjects has \"Azure Subscription\" and ActivityObjects has \"Azure Resource Group\"\n\n| extend PrivEscalationTime = Timestamp\n\n| project AccountObjectId, PrivEscalationTime,ActionType;\n\nCloudAppEvents\n\n| join kind = inner PrivEscalation on AccountObjectId\n\n| extend DeletionTime = Timestamp\n\n| where (DeletionTime - PrivEscalationTime) <= 1h\n\n| where Application == \"Microsoft Azure\"\n\n| where ActionType has \"Delete\"\n\n|summarize min(DeletionTime), TotalResourcersDeleted =count(), CountOfDistinctResources=\ndcount(ActionType), DistinctResources=make_set(ActionType) by AccountObjectId\n\n```\n\n-----\n\n//AHQ used to detect attacker abusing OAuth application during the attack\n```\nCloudAppEvents\n\n  | where Application == \"Office 365\"\n\n  | where ActionType == \"Consent to application.\"\n\n  | where RawEventData.ResultStatus =~ \"success\"\n\n  | extend UserId = tostring(RawEventData.UserId)\n\n  | mv-expand AdminConsent = RawEventData.ModifiedProperties\n\n  | where AdminConsent.Name == \"ConsentContext.IsAdminConsent\" and AdminConsent.NewValue == \"True\"\n\n  | project ConsentTimestamp =Timestamp, UserId, AccountObjectId, ReportId, ActionType\n\n  | join kind = leftouter (CloudAppEvents \n\n    | where Application == \"Office 365\"   \n\n    | where ActionType == \"Add app role assignment to service principal.\" \n    | extend PermissionAddedTo = tostring(RawEventData.Target[3].ID)\n\n    | extend FullAccessPermission = RawEventData.ModifiedProperties\n\n    | extend OuthAppName = tostring(FullAccessPermission[6].NewValue) // Find app name\n\n    | extend OAuthApplicationId = tostring(FullAccessPermission[7].NewValue) // Find appId\n\n    | extend AppRoleValue = tostring(FullAccessPermission[1].NewValue) // Permission Level\n\n    | where AppRoleValue == \"full_access_as_app\"\n\n    | project PermissionTime=Timestamp, InitiatingUser=AccountDisplayName, OuthAppName,\nOAuthApplicationId, AppRoleValue, AccountObjectId, FullAccessPermission\n\n  ) on AccountObjectId\n\n\n### Microsoft Sentinel\n\n```\nMicrosoft Sentinel has a range of detection and threat hunting content that customers can use to detect the post\nexploitation activity detailed in this blog in addition to Microsoft Defender detections list above.\n\nMicrosoft Sentinel customers can use the TI Mapping analytic (a series of analytics all prefixed with “TI map”) to\nautomatically match the indicators mentioned in this blog post with data in their workspace. If the TI Map\nanalytics are not currently deployed, customers can install the Threat Intelligence solution from the Microsoft\nSentinel Content Hub to have the analytics rule deployed in their Sentinel workspace. More details on the\n[Content Hub can be found here: https://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy](https://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy)\n\n## Indicators of compromise (IOCs)\n\nThe below list provides IOCs observed during our investigation. We encourage our customers to investigate\nthese indicators in their environments and implement detections and protections to identify past related activity\nand prevent future attacks against their systems.\n\n**Indicator** **Type** **Description**\n\n\n9107be160f7b639d68fe3670de58ed254d81de6aec9a41ad58d91aa814a247ff DEV-1084\nransom payload\n\n80bd00c0f6d5e39b542ee6e9b67b1eef97b2dbc6ec6cae87bf5148f1cf18c260 DEV-1084\nbatch script\n\n8dd9773c24703e803903e7a5faa088c2df9a4b509549e768f29276ef86ef96ae DEV-1084\nbatch script\n\n486eb80171c086f4d184423ed7e79303ad7276834e5e5529b199f8ae5fc661f2 DEV-1084\nbatch script\n\nf1edff0fb16a64ac5a2ce64579d0d76920c37a0fd183d4c19219ca990f50effc DEV-1084\nbatch script\n\n887ae654d69ac5ccb8835e565a449d7716d6c4747dc2fbff1f59f11723244202 DEV-1084\nbatch script\n\n\n8thCurse.exe\n\n\n-----\n\n3fba459d589cd513d2478fb4ae7c4efd6aa09e62bc3ff249a19f9a233e922061 DEV-1084\nbatch script\n\n0dde13e3cd2dcda522eeb565b6374c97b3ed4aa6b8ed9ff9b6224ea97bf2a584 DEV-1084\nbatch script\n\nafd16b9ad57eb9c26c8ae347c379c8e2b82361c7bdff5b189659674d5614854c DEV-1084\nbatch script\n\n3e59d36faf2d5e6edf1d881e2043a46055c63b7c68cc08d44cc7fc1b364157eb DEV-1084\nbatch script\n\n786bd97172ec0cef88f6ea08e3cb482fd15cf28ab22d37792e3a86fa3c27c975 DEV-1084\nbatch script\n\n36c71ce7cd38733eb66f32a8c56acd635680197f01585c5a2a846cc3cb0a8fe2 DEV-1084\nbatch script\n\n016967de76382c674b3a1cb912eb85ff642b2ebfe4e107fc576065f172c6ef80 DEV-1084\nbatch script\n\n3059844c102595172bb7f644c9a70d77a198a11f1e84539792408b1f19954e18 DEV-1084\nbatch script\n\n194.61.121[.]86 Command and\ncontrol\n\nhxxps://pairing[.]rport[.]io/qMLc2Wx Download Rport\nsoftware from it\n\n141.95.22[.]153 Command and\ncontrol\n\n193.200[.]16.3 Command and\ncontrol\n\n192.52.166[.]191 Command and\ncontrol\n\n45.56.162[.]111 Command and\ncontrol\n\n104.194.222[.]219 Command and\ncontrol\n\n192.169.6[.]88 Command and\ncontrol\n\n192.52.167[.]209 Command and\ncontrol\n\nwebstore4tech[.]uaenorth.cloudapp.azure[.]com Command and\ncontrol\n\nvatacloud[.]com Actor-owned\nRport domain\n\n\n-----\n\n146.70.106[.]89 DEV-1084\noperators were\nobserved\nsending\nthreatening\nemails to the\nvictim after the\nattack from\n146.70.106[.]89,\nan IP address\npreviously\nlinked to\nMERCURY\n\nb9cf785b81778e2b805752c7b839737416e3af54f64f1e40e008142e382df0c4 Rport Legit\nremote access\ntool\n\nab179112caadaf138241c43c4a4dccc2e3c67aeb96a151e432cfbafa18a4b436 Customized\nLigolo tunneling\ntool\n\n46.249.35[.]243 Command and\ncontrol\n\n45.86.230[.]20 Command and\ncontrol\n\n6485a68ba1d335d16a1d158976e0cbfad7ab15b51de00c381d240e8b0c479f77 db.ps1\nCustomized\nScript Backdoor\n\nb155c5b3a8f4c89ba74c5c5c03d029e4202510d0cbb5e152995ab91e6809bcd7 db.sqlite\nCustomized\nObfuscated\nScript Backdoor\n\n**NOTE: These indicators should not be considered exhaustive for this observed activity.**\n\n### Microsoft Defender Threat Intelligence\n\n\nrport.exe\n\n\nCommunity members and customers can find summary information and all IOCs from this blog post in the linked\n[Microsoft Defender Threat Intelligence article.](https://ti.defender.microsoft.com/articles/20f3aba0)\n\n## References\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-07 - MERCURY and DEV-1084- Destructive attack on hybrid environment.pdf"
    ],
    "report_names": [
        "2023-04-07 - MERCURY and DEV-1084- Destructive attack on hybrid environment.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0321f048-2313-42dd-b10c-08a99ae98f2a",
            "created_at": "2024-02-02T02:00:04.06752Z",
            "updated_at": "2025-03-27T02:00:03.305585Z",
            "deleted_at": null,
            "main_name": "Storm-1084",
            "aliases": [
                "DEV-1084"
            ],
            "source_name": "MISPGALAXY:Storm-1084",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6d33349a-812e-4123-afe7-9c0d4f59a619",
            "created_at": "2024-06-04T02:03:07.757327Z",
            "updated_at": "2025-03-27T02:05:17.303639Z",
            "deleted_at": null,
            "main_name": "COBALT AZTEC",
            "aliases": [
                "GOLD AZTEC",
                "Storm-1084 ",
                "DEV-1084 "
            ],
            "source_name": "Secureworks:COBALT AZTEC",
            "tools": [
                "DarkBit ransomware"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338909,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1683251887,
    "ts_modification_date": 1683251887,
    "files": {
        "pdf": "https://archive.orkl.eu/e9380431f116a50219e89925936203026472e0db.pdf",
        "text": "https://archive.orkl.eu/e9380431f116a50219e89925936203026472e0db.txt",
        "img": "https://archive.orkl.eu/e9380431f116a50219e89925936203026472e0db.jpg"
    }
}