{
    "id": "e6bf48fe-c85b-449a-8581-0bf01132ed87",
    "created_at": "2023-01-12T15:05:43.848262Z",
    "updated_at": "2025-03-27T02:05:36.850466Z",
    "deleted_at": null,
    "sha1_hash": "e09629c6e04020be07aa3c2b0925d933ddef3535",
    "title": "2021-01-05 - ‘I Was Running Two Parallel Lives’- An Ex-Secret Service Agent Opens Up About Going Undercover To Catch Cybercriminals",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:51Z",
    "file_modification_date": "2022-05-28T19:41:51Z",
    "file_size": 931755,
    "plain_text": "# ‘I Was Running Two Parallel Lives’: An Ex-Secret Service Agent Opens Up About Going Undercover To Catch Cybercriminals\n\n**therecord.media/i-was-running-two-parallel-lives-an-ex-secret-service-agent-opens-up-about-going-undercover-to-**\ncatch-cybercriminals/\n\nJanuary 5, 2021\n\n[Dmitry Smilyanets](https://therecord.media/author/dmitry-smilyanets/)\nJanuary 5, 2021\n\n_Editor’s Note: When many people think of the U.S. Secret Service, they picture the unruffled_\n_agents who protect the president and other dignitaries. But the agency’s founding mission—_\n_and one that it still carries out—is to safeguard the U.S. financial system from counterfeiting_\n_and other crimes. Over the last few decades, many of those crimes have shifted online:_\n_Hackers breach companies for financial information, sell stolen credit card numbers, encrypt_\n_corporate data until a ransom is paid, and trick victims into wiring funds to scam accounts. As_\n_a result, cybercrime has become the focus of much of the Secret Service’s work, and the_\n_agency plays a key role in investigating a range of computer-related incidents._\n\n_The details of this work sometimes emerge in court cases and law enforcement actions._\n_[Secret Service agents are often the ones who investigate and arrest high-profile hackers,](https://www.dhs.gov/news/2014/07/07/us-secret-service-arrests-one-worlds-most-prolific-traffickers-stolen-financial)_\n_[darknet vendors, and other perpetrators of computer-related crime. But much of their work](https://www.secretservice.gov/newsroom/releases/2020/06/russian-national-sentenced-prison-operating-websites-devoted-fraud-and)_\n_[happens in the shadows, with undercover agents, million-dollar bounties, and other methods](https://www.rferl.org/a/u-s-offers-2-million-reward-in-global-search-for-ukrainians-accused-of-hacking-sec-database/30741867.html)_\n_that can sound like they’re lifted from the pages of a spy thriller._\n\n\n-----\n\n_Until recently, Richard LaTulip was one of the Secret Service s special agents who went_\n_undercover to better understand cybercriminals. On occasion, he would even befriend_\n_hackers. “I opened the door and there on the other side was the target standing with a liter of_\n_vodka… a gift from their home country,” he recalled. LaTulip, who left the agency in July to_\n_join the private sector, opened up about his experiences at the Secret Service in a recent_\n_interview with Recorded Future expert threat intelligence analyst Dmitry Smilyanets. The two_\n_first met in 2012, when Smilyanets himself was interviewed by LaTulip in relation to his_\n_involvement in a major data breach investigation. The interview below was conducted via_\n_email, and has been lightly edited for clarity._\n\n**Dmitry Smilyanets: You recently retired and are now a civilian after 22 years of service**\n**with the U.S. Secret Service. Do you miss your badge yet?**\n\n**Richard LaTulip: When I reflect back and contemplate my career, I can honestly say it was**\na rewarding and meaningful experience. Along the way, I was able to contribute at all levels,\ngained a lot of invaluable knowledge, and traveled extensively. During this time period, I met\na wide range of people, professionally and privately. These opportunities left an impression\nin my life and it was regardless of the length of time spent with these people. For example,\nsome I may only have spent hours with, others were moments in time, and still others whom\nI now consider friends impacted my life because I learned from their experiences, gained an\nunderstanding from their perspective, understood more about their cultures and this allowed\nme the unique opportunity to grow as a person and to mature. Far too often we move\nthrough life; experience unique things and forget to stop and truly appreciate the experience\nand opportunity. This prepared me for the other adventures in my life I had yet to know or\nunderstand or even knew were coming my way. During my career, I learned how to better\nappreciate people, places, cultures, and countries. This has made me a better person and I\nam forever thankful for this chance. But your question was do I already miss the badge? To\nsome degree, I will always miss the badge. Working as a special agent was a large part of\nwho I am and what I represented. However, because I was fortunate enough to be employed\nby the U.S. Secret Service, I feel I can now take these experiences and share them with\nothers. This is a new page in a long novel, and I am looking forward to meeting new people\nand continuing to grow and share.\n\n**DS: What were some of your most exciting experiences at the Secret Service? Which**\n**were most challenging?**\n\n\n-----\n\nLaTulip (right) engaging with a\n\nsuspect on a 2006 undercover mission in Thailand. Courtesy of Richard LaTulip\n**RL: My career spanned 25 years, but 22 years were with the U.S. Secret Service so as one**\ncan imagine I had a lot of exciting experiences. But I can say the most exciting was working\nthe various cybercrime investigations and of course this included my time working on the\nvarious underground online forums. From 2005 through approximately 2009, I worked online\nas an undercover U.S. Secret Service agent who purported to be a buyer of stolen data. In\norder to establish a level of credibility, I relied on the guidance of an informant. This informant\nwas and had been working in the underground community for a period of time and became\nestablished within a specific group of online cybercriminals. The informant provided a level of\nbona fides within the community and I was able to seize this opportunity and expand upon it.\nThe informant was by my side often, then not too much, and then at various points in time to\nassist in the investigation, but we’ll come back to this later.\n\nWorking online as a cybercriminal by night and then a U.S. Secret Service agent by day\nrepresented challenges that are not easy to explain. I had to translate the successes from\nthe online world to understandable and meaningful language to those who have not\nexperienced nor understood the challenges. In addition, and unlike what is seen at times in\nthe movies or TV, I was writing reports, recording evidence, documenting online\n\n\n-----\n\nconversations, participating in conference calls with USSS headquarters representatives.\nYou know, all the nitty-gritty work that is not as glamorous but was required to ensure a\nsuccessful investigation and eventual successful prosecution.\n\nAnyhow, the informant and I worked odd hours because the case was global. We needed to\nmatch time zones and seize on the opportunities when others, the target of the investigation,\nwere online and working. Now talking online and creating rapport behind a computer\nrepresented challenges but our goal was different. Our goal was to be the first investigation,\nat that time, to take our online behind the computer undercover world, the digital world, and\nturn this into real-world operations. We planned and designed the case so we would travel,\nas needed, too far away destinations and meet face-to-face with those with whom I was\nspeaking to online on a regular basis. Obviously, this presented unique challenges—we\ncontemplated “the Who” to meet, “the where” to meet, and tempered this with “Where” we\nwere able to meet. The planning and preparing for this style of operation was exciting,\ndemoralizing, interesting, stressful, and rewarding all at the same time.\n\nBecause I was able to establish a positive relationship with the informant—one that, in my\nopinion, was based on mutual respect and understanding of each other—I feel because I\ngained the respect of the informant this translated to a higher level of devotion and more\nenergy was invested to meet the investigative goals. Again, we speak of challenges, on one\nhand you have those that live in the world of law enforcement, those who chose an opposite\npath than those in law enforcement, and then the rest of the world. So, if you were going to\nbe successful, you needed to have a unique personality, in order to bridge the gap between\nthe rest of the world and those who chose the other side of law enforcement. One needed to\nestablish a level of mutual respect. I will say not everyone is geared for this and to be able to\nwork between these worlds is not easy. But for me, I saw it differently. I saw everyone,\nprobably because of my fortitude to travel extensively, as good people—some just chose a\ndifferent direction, but still they are good people. Therefore, I did everything in my power to\nnever treat anyone differently or treat them in a way I would not want to be treated. For me,\nthis worked well because when I spoke with a member of law enforcement—U.S. or\nInternational, a citizen or a “cybercriminal”—I treated them all with the same level of respect.\n\nBut where is this all going or where did it end within three months, we were able to arrange\nthe first International meetings which are a completely different and interesting story on their\nown.\n\nNow, I spoke about a lot of what I did but let’s not forget everything I did or accomplished\nrelied on the guidance, assistance, goodwill, hard work, and determination of my colleagues\nin the USSS, other U.S. government agencies, and international partners. Without this\nassistance and goodwill, I would not have been able to achieve this level of success.\nHowever, what I described to you was the most exciting and challenging time in my career.\n\n\n-----\n\n**DS: You were not just a Special Agent—you were one of the most experienced in the**\n**Service’s Cyber Intelligence Section. Can you please explain the significance of CIS?**\n**What are the main differences between CIS and the Criminal Investigative Division?**\n\n**RL: So, to understand the significance I should start by explaining the CID. In the U.S.**\nSecret Service, there are several different divisions, and CID is one of the divisions. CIS is\nan investigative section within CID. Over time, CIS has gone through several name branding\nchanges. However, the assessment was that the USSS field offices had a lot of\nresponsibilities, management identified a gap, and determined the USSS needed a group of\ndedicated professionals who either assist or manage the USSS’s most significant\ninvestigations. From the beginning, management’s vision was that CIS will be reserved for\nthe USSS’s most accomplished investigators and specifically designed to investigate, locate,\nidentify, and arrest the advanced persistent threat. This same group of dedicated\nprofessionals is not only tasked with managing significant investigations, but these agents\nwere also tasked with debriefing the arrested top-tiered cybercriminals, building relationships\nwith international partners, managing significant operations, act as liaisons with federal\nprosecutors, working with federal, state, and local partners and ultimately crunch the data.\nReality is inside the data, and from the data is how the APT is eventually identified and\narrested. With this group focusing on top-tiered cybercriminals, they quickly established\nthemselves as subject matter experts. This elevated the status, added value, and over time\ngained the respect from our partners specifically as it relates to investigative matters\nperformed by members from CIS. I spent just over three years at CIS, and during this time I\nwas fortunate enough to participate at all levels in a variety of significant investigations. This\nprovided opportunities to debrief a wide range of cybercriminals and liaison with our many\ninternational partners. My knowledge expanded, interview techniques were sharpened, and\nmy analytical skills refined. With this additional experience, I again continued to progress and\ngain a higher level of personal and professional growth. I believe this growth was key to help\nsolidify relationships, and guided me through some of the most interesting results and\nexperiences of that time.\n\n**DS: If you were the director of USSS, how would you improve the cyber intelligence**\n**process and cybercrime investigations?**\n\n**RL: This is an interesting question and one that is not easy to answer. To be Director of the**\nUSSS’ would be challenging, rewarding, and an honor. The USSS has a long and prestigious\nhistory. Along the way there have been some missteps, but the USSS learned from this and\nultimately became a better organization. When I think back on my career, I know the men\nand women who served in the USSS take pride in their work, understand the magnitude of\nthe responsibility, know the importance of properly implementing the mission, represent the\norganization with pride, and carry out its mission with honor. Ultimately, when we speak of\nthe USSS we must recognize this organization is charged with and required to successfully\nmanage two distinctly different missions. On one hand, we have the mission the USSS is\nmost known for: protection. This mission means the USSS is responsible to protect the U.S.\n\n\n-----\n\nPresident, Vice President—current and former—those designated by the U.S. President, and\ninternational heads of state while in the United States. When we speak of investigation within\nthe USSS, it is unique. I say this because we are ultimately an agency with two missions,\nboth of which are very important, and neither can be forgotten when we contemplate the\norganization as a whole. Since the USSS has the responsibility of a dual mission, I believe\nan approach that will holistically help the organization is to create three verticals: protection,\ninvestigation, and support. Each vertical will have domains, but ideally protection and\ninvestigations only focus on that specific mission. Protection, the larger of the verticals, along\nwith those who work within this vertical, only are assigned protective missions that support\nthe vertical. The agents would be regionally positioned, in fewer locations but located in the\nlarger cities. Ideally, these larger cities have regional airport hubs, which can lower travel\ncosts, and then the Agents work and travel from there to support the region.\n\nThe concept is the same for investigations, however the investigative vertical is smaller and\nwill have more postings in the U.S. Of course, the support vertical is just that—support. But\nthis will provide support for both the investigative and protective vertical. Another experience\nI had during my career is the USSS statistically does not promote or seek out opinions of\npersonnel who devote their career to the investigative mission. I believe if verticals were\ncreated, then those who work in those verticals will promote within the vertical. This will\nassist in development as management will be more aligned to the concerns of an\ninvestigative agent. Diversity was always a focus but, in my opinion, this rarely included a\ndifference of thought. To be truly diverse I would believe we need to have different positions,\nexperiences, and thoughts. I saw mostly that promotions focused mainly on a similar line of\nthoughts. Again, this is just an opinion and frankly, some items are easier said than\nimplemented, but I truly believe to holistically move an organization forward we must include\nmore well-thought-out ideas which include at times a difference of thought. This, in turn, can\nhave a positive effect on an organization’s morale and for a period of time, the USSS\nsuffered a moral issue.\n\n**DS: I know one of the areas you investigated was Eastern-European hackers. If you**\n**can, please share a couple of the more exciting stories from your undercover days.**\n**What are some of the most important skills for successful undercover operatives**\n**online?**\n\n\n-----\n\nIn Ukraine on a 2018 assignment to\n\ndebrief cybercriminals. Courtesy of Richard LaTulip.\n**RL: So, I have reflected on this over time and of course my thoughts change along with the**\nopinions. What is or were some of the most important skills that assisted me during my\nundercover days? Was I successful because I was that believable? Was it my upbringing?\nWas it luck? Or was it because I was social enough and experienced enough to be able to\nstraddle the line between being a special agent during the day and a cybercriminal during the\nevening? Actually, it could have been one, two, a combination, or none of them. Bottom line,\nthis is historical because everything is different today. However, at that time, this was\nsomething not so well known to law enforcement in general. Cybercrime as we think of it\ntoday was much different during this time. Yes, a computer was involved, so you had the\ntechnology. And of course online instant messaging was not new, but as widely distributed as\nthis technology is in today’s environment, the answer, at that time, was no.\n\nSo we looked for a skimmer, which was popular at the time but dangerous for those who\nworked this type of criminal activity. I say dangerous because of how closely connected an\nindividual was to the stolen credit card data. But to now see in the wild people using full track\ndata that was compromised via a network intrusion? This was new to law enforcement, and\nto be honest we had to get caught up. Luckily for everyone involved, the cybercriminal was\nhaving just a difficult time. Can you imagine: “Hey world, I have just hacked a company and\n\n\n-----\n\nstole full credit card track data. I am offering $5.00 per track. Anyone? I recall in some of the\ndebriefs with hackers, them telling me how in the early days they were having trouble\nvending the stolen data. People were not so trusting. Can you imagine? “Let me understand,\nyou want me to send money to I do not know who or where, oftentimes halfway around the\nworld to a city I never heard of and in exchange I will get full credit card track data? Yeah\nright.” That was often the answer. Most people, during those initial days, were not trusting\nhackers. So to counter, the hackers gave away data. The hacker received, as payment,\ncigarettes, alcohol, or very insignificant amounts of money. This did not last long. When you\nconsider what is in the news today, one can now understand how far we have progressed\nand imagine how much a hacker earns today.\n\nSo, going back to when I started and proposed undercover operations specifically to move\nfrom the digital world, which was the most common type of undercover operation, and to\nmove that operation to the real world… This was not something most organizations were\ncontemplating, especially at a global level. I would say from the introduction—early 2000s—\nto when we operated—mid-2000s—we knew more, understood the areas the cybercriminals\noperated, so this operation was not a simple move into our “backyard.” In order to be\nsuccessful, we were getting on airplanes and going to far-off distant locations. This was a big\ndeal, not just for the USSS, but for everyone in law enforcement, and so we put our heads\ntogether, thought about what we needed, and focused on the task at hand. Remember, this\nwas new to law enforcement. The USSS had a policy, but this policy was not designed for\ninternational in-person real-life undercover operations. At that time, the USSS had no official\ntraining program, so everything we did was going to be groundbreaking, exciting,\nchallenging, stressful, and extremely dangerous. We, in fact, heavily relied on our\ninternational partners, and fortunately for me and those involved we had reliable, dedicated,\nand trustworthy partners.\n\nTo set the stage we needed to brainstorm and answer all types of questions and come up\nwith answers. One of the bigger questions—please remember we were not always dealing\nwith individuals who had the highest set of morals—was related to the consumption of drugs.\nFor example, if offered, do I accept, take, and consume drugs? Well, this was easy for me, I\nhave never taken drugs, therefore I was not going to start today. But I needed to develop\nrapport so this meant I could not be the first one to bed. So, I focused on other areas in order\nto develop that required level of rapport. Understanding the cultures helped focus on the plan\nof action. If the target was from an Asian culture, then we focused on gambling, eating, and\nhanging at nightclubs. If the target was from a Western culture, then we focused on beaches,\neating, and hanging at nightclubs. Small difference, but one had to understand the audience.\nFollowing that we needed to find that place in which the target wanted to go. This often\nmeant tropical resorts and those that can supply the typical things most cultures and people\nwould want. Gambling, girls, booze, bars, sandy beaches, warm weather, and clear clean\nblue water. Sometimes you could not get everything on the list—but gambling, bars, good\nfood, and girls were a must, and easier to check off the list.\n\n\n-----\n\nNow, this dovetails into an interesting side note. Of course, everyone wanted to go to tropical\nresorts. I mean how many people are interested in going to some far-off destination and not\ndoing anything interesting? Well, some management started complaining and indicating why\nwe are always going on these types of operations. So as the relationships grew and were\nbecoming more popular, I was invited to a destination that was not a resort. More of a city\ntour but not so popular with tourists. I thought to myself, excellent! Here is the opportunity to\nshow we are not only seeking what is considered by some as a government-paid holiday.\nHowever, the response by the same who complained was now why would anyone go here\non a holiday. So, this message was clear—no way of winning, so let’s just keep focusing on\nwhat works and go to the beach resorts.\n\nIn essence, I was running two parallel lives; these lives had to intersect at times, just so I\ncould keep everything straight in my own mind but reflect back on what I was just\nmentioning. This will all make sense soon. On one of the operations, we decided to meet and\nhang out at one of the beach resorts. Of course, nothing was running smoothly, and we were\nwaiting for the target’s arrival. Delays and timing were not matching to what was spoken or\nplanned for earlier in the planning stages. As you can imagine, some people were getting\nnervous. Thoughts raced through some minds—maybe the operation was compromised or\nmaybe the target just decided, last minute, to not travel. Anything was possible, but then out\nof nowhere a knock at the door. I opened the door and there on the other side was the target\nstanding with a liter of vodka. The vodka was a gift from their home country. This was not\nexpected, as I thought—really everyone thought—I would get an instant message or similar\ntype of notification. Regardless, none of that mattered, we were in play and moving.\nThankfully, we did not move too far, just to the lobby for a late dinner along with some drinks.\nFinished with that, one thought was, “Ok, this is ending, everyone from the flight must be\ntired and in need of some sleep.” Just as I thought this, there was an invitation to continue\ndrinking in the room. Who was I to say no? It can’t be me who goes to bed first, so off to the\ntarget’s suite. This was not optimal, however it was a positive sign I was to be trusted. And\ntrust is the place we wanted to be specifically with this target. Once inside, it was right back\nto a good conversation and drinks. This was going on now for a while and the minibar was\ngetting low, so it was on to stronger drinks. Regarding the conversation, it was my intention\nto speak about new topics, old topics, and ensure we intertwined business into the\ndiscussions. Anyhow, I was relating a personal story—of course, the names and locations\nwere changed but nonetheless still something that occurred in real life. The target keenly\nlistening to my story immediately understood it was not something that aligned with what I\nspoke about online. So he called me out and challenged my story and asked why there was\na difference. At this point, one can say, I was uncovered and exposed. Remember as well\nthat it was late, we had more than one drink, and I was for the most part alone with the\ntarget. Thinking quickly or being a magician of words could have been the difference\nbetween success and failure. And failure was not an option. Another topic to consider, which\nat times is beyond a person’s control, is nonverbal communication. What did I look like from\nthe target’s perspective? Was I sweating, twitching, or did my eye blink one too many times?\nMoments may have seemed longer than they actually were, but then again we did have\n\n\n-----\n\nmore than one drink, so this all could have been normal. Regardless, in the end none of it\nmattered. In retrospect, I was too quick to respond and everything I stated just resonated.\nEverything I stated was the truth, plain and simple. I lied. To understand completely, the\nonline world is what you want it to be. Trust is as deep as all the 1s and 0s that make up the\ninternet. I can be what I want to be when I want to be it and how I want to be. So deeper than\nmere words, “I lied” was the second stage of the conversation. The reason for the lie was\nsimple—we spoke online. Today we sit in front of each other and have an opportunity to\nreally know each other. The online world is filled with lies, and misstatements. This is real life\nnow, face-to-face. Now is the time to build real trust and understanding of each other.\nEverything was true and the target knew it, participated in it, and understood it. So on to\nmore important items. More conversation drifted on into the night and early morning hours.\nWe watched the sun come up and after there was no more to drink it was off to bed. I think\nthis was when everyone decided it was time to work the other more hidden aspects of the\noperation in shifts. No one was interested in staying up all night.\n\nNow I know you asked for a few, but I will save the other stories for another time and place.\n\n**DS: Who are the top five cybercriminals on your list? Which hacking groups do you**\n**think are the most dangerous currently?**\n\nIn Bangladesh, while teaching a\n\ncybersecurity and digital evidence collection class to the Bangladeshi police. Courtesy of\n_Richard LaTulip._\n**RL: I do not really prescribe to or have a “top five” cybercriminal list. I have seen and**\nexperienced a lot to know that at any moment, any number of people can be today’s most\nhighly sophisticated and successful hacker. As you know, there are a lot of intelligent and at\ntimes self-taught programmers, analysts, and cybersecurity penetration testers, and the list\ngoes on and on. Some have chosen to use these skills to ensure the internet is a safer place\nfor everyone. Others, for their own reason, have chosen a different path. I was fortunate\nenough, during my career, to arrest and debrief some of whom we termed as the most\n\n\n-----\n\nsuccessful online cybercriminals. With this success, some believed we made an impact. And\nto some extent, we did make an impact. These cases—and a lot I was not involved with in\nany capacity—were impactful. However, I knew it was only a matter of time before any\ncybercriminal’s position was filled by another cybercriminal. Also, the world is highly\ncompetitive. Some want a level of fame and fortune, add in that today’s world is also\ndependent on social media, which translates to status. This status is where some seek to be\nconfirmed and validated. Move from the open social media and dive deeper into the “dark\nweb” and we find forums. These forums have all types of members—some are legendary,\nsome are ok with being amongst the crowd, and then others want to become legendary.\nWhen I was working online undercover, I thought most, not all, aligned with me, about the\nforums. The forums were more or less social media websites but in another format.\n\nWhat I just spoke about extends to criminal hacking groups—they are all potentially\ndangerous. Hacking groups all have various levels of talented coders, programmers, or\nsupport personnel. These groups have time on their side and can slowly examine networks,\nfind weaknesses, can leverage off-the-shelf penetration testing programs to assist in\nexploitation, and eventually over time are successful. When I was working in law\nenforcement, some took it personally; I never took this type of crime personally. They had\nchosen their career path and I had chosen mine. Their job was to be successful and create\nhavoc online, exfiltrate something of value, and monetize the item of value. My job, at that\ntime, was to correlate the intrusion to the individual who I needed to identify, locate, and\narrest. As you know, this was without regard to where the person was located, so long as\nthey compromised or utilized infrastructure in the U.S Regardless, I enjoyed my career, and I\nhad a lot of success.\n\n**DS: What is your opinion of state-sponsored hackers and groups? How does the**\n**Russian GRU and FSB recruit new talent, in your opinion? Do they run these recruits**\n**or do they control them in other ways?**\n\n**RL: I have many opinions about state-sponsored hackers or groups. However, I think**\neveryone has an opinion and most probably the answer is “it depends.” Regardless you can\nbe sure that talent is everywhere and just like in most nations, there are those who desire to\nserve their respective countries. National pride is something I have seen interwoven into the\nunderground community. For example, when online one can sense an “Us-vs-Them”\nideology. Some will immediately think “us” means the online criminal community and “them”\nmost definitely can mean law enforcement, the corporate world, or other injustices, perceived\nor real. However, this is not entirely what I am speaking about. The way some criminal actors\nwrite—in the online posts, links to articles—one can feel at times the “us” is them and their\ncountry and the “them” means most other countries. I gather from this information that to a\ndegree they believe they are serving their country. I have even read, from historical chats, of\nonline cybercriminals who claim by day to be hacking Western companies, but at night\nreceive direction and are working on campaign X or Y for their country. Ultimately, the pride\nof the nation can be a method of recruitment.\n\n\n-----\n\nOther recruitment methods can be very simple—for example, conducting investigations that\nwill cross paths with top-tier talent. I also know from experience top tier talent will\ninadvertently post a “here I am” sign right on their homes. Not literally, but if you are from a\nsmall village and typically are seen cruising around on public transportation or driving an\noutdated vehicle, and then tomorrow everyone in the town sees you driving a brand-new\nMercedes, Porsche or BMW… Well, this attracts the attention of everyone in the town, which\nincludes those who work in security services. From here the next steps are not too difficult for\nan inquisitive and well-trained investigator to understand something is afoot.\n\nRegarding the direction of a new recruit, I would surmise the officer or agent provides\nguidance, including over-the-shoulder direction. In addition, the person could be brought into\nthe larger group, including a place to work from and operational funding. It is not a secret that\noftentimes nation-state cybercriminal actors are well-funded and trained and—since the task\nis mission-specific—patient.\n\n**DS: In your view, how sophisticated are ransomware operators and their affiliates?**\n\n**RL: My opinion is they are very adaptive, are able to adjust tactics, and overcome various**\nobstacles. Yes of course you will have your one-offs, but overall the groups are very well\norganized. All of this leads to one conclusion: Certain ransomware groups are sophisticated.\nWe have seen over time, referring to what I previously mentioned, an adjustment to tactics\nand deployment methodologies. This transformation did not happen overnight. For example,\nwhen ransomware was first deployed, it was encryption followed by a ransom demand. The\ndemand was preset and pretty much this was forwarded to any victim. This lasted for a\nperiod of time, but the groups were successful, and they were successful at getting rather\nhandsome cryptocurrency payments. So, companies prepared for the possible ransomware\ndeployment cross-network. This assisted corporations specifically when the victim\ncorporation refused to pay the ransom demand. So, as the pendulum swings from one side\nto the other this meant the advantage was to the corporation’s benefit. The ransomware\ngroups added a new fold that could not be so easily ignored. Groups started exfiltrating\ncorporate data followed by an encryption event and ransom demand. This demand usually\nidentified the theft of proprietary data, but as with before the demand was for a\npredetermined amount of cryptocurrency. And the cat-and-mouse game continued as each\nside postured and adjusted. In today’s environment, we are seeing specifically-crafted\nransom demands, a key indicator of pre-attack victim research. Also comes threats to\nrelease or vend data to competitors, as well as the burning of infrastructure. Some\nransomware groups even have blogs where they name and shame the latest victims, provide\nlevels of decryption support and allow for “victim” feedback related to the successful\ndecryption of data. With their success, the techniques translate to other less sophisticated\ngroups entering the market. Inside the dark web community, the information is shared, which\nincludes profits. Profits other cybercriminals imagine or desire to have, and so they join the\nalready crowded field of ransomware. I even know of hacking groups changing the entire\nbusiness platform, switching the gears so-to-speak, and moving wholly to ransomware\n\n\n-----\n\ndeployment. Anyhow, this is not something to be ignored and corporations must account for\nthe potential compromise. Otherwise, when the music stops, the unprepared will be left with\nvery few options.\n\nIn Israel on a 2019 assignment to\n\ndebrief cybercriminals. Courtesy of Richard LaTulip.\n**DS: You are currently working in cybersecurity for the private sector—does your**\n**experience as a federal agent help you? What are the biggest threats to your industry,**\n**and what will be your major focus in the new role? Are you prepared for the new**\n**challenges?**\n\n**RL: I spent a long time working for the government, almost exclusively conducting**\ninvestigations related to financial and computer crimes. Over my career, I worked undercover\ntargeting cybercriminals, investigated online cybercriminals, debriefed vendors of stolen data\nor products, hackers, bot herders, and others, worked as a diplomat in Europe and in the\nU.S. Secret Service’s Cyber Intelligence Section. I also participated in the U.S. Secret\nService’s critical systems protection program. Along the way, I picked up several advanced\ncertifications which include the ISC2 Certified Information Systems Security Professional\n(CISSP) and ISACA’s Certified Information Security Manager (CISM). So, I feel I am\nprepared for new challenges and look forward to them. I know I have a lot to still learn and\nthis is exciting for me. I feel when you stop learning, sit back, and relax you are already\n\n\n-----\n\nmissing the issues. Missing an issue can be the difference between successfully thwarting or\nsuccumbing to a cybersecurity event. I also know part of my responsibility is to share my\nexperiences with industry leaders, provide the information that can be leveraged to make a\nwell-informed decision. As I have learned, providing the wrong information at the wrong time\nleads to incorrect decisions. To be valuable, the information has to be timely, informative, and\nrelevant otherwise the information becomes useless. Our leaders need honest, at times\nblunt, evaluations of the current state. Otherwise, decisions may not include a holistic\napproach that positively affects the company. My new role or mission will be to support\nbusiness leaders and I know, as I explained, that my past experiences will be essential for\nthis success. In addition, I will say it does not matter where you work—the threat landscape\nis applicable to all parts of the industry. Corporations that ignore or believe it will not happen\nto them are simply ignoring the facts and the data. Whether working in the government or\nprivate industry we must be serious, understand the adversaries, apply best practices,\nincorporate defense-in-depth, and diligently review, analyze, and interpret the data. In the\ndata will be the artifacts and these artifacts tell the story to the analyst or forensic investigator\nwho then needs to dig deeper and interrogate the network.\n\n**DS: Tell me a secret.**\n\n**RL: I should have been a cryptocurrency millionaire… I guess I need to give some context**\nfor you to understand completely. While working undercover I was involved in, among other\nthings, moving money. This, of course, was used to purchase stolen data. And to move\nmoney I used all types of methods, which included traditional—such as bank transfers—and\nnon-traditional methods—such as e-Gold, Liberty Reserve, or cryptocurrency. These were,\ndepending on the time period, the accepted forms of payment. But working in the\ngovernment meant this was extra work. I had to account for every dollar and how one day I\ncould be up and then the next day I was down. It was frustrating and time-consuming to say\nthe least. Anyhow, I participated in the community and the community was all-in when the\nmarket shifted to cryptocurrency. So just like everyone online I positioned myself as a “true\nbeliever” in cryptocurrency. Behind the scenes, I did not trust cryptocurrency. I had many\nchances to invest and instead I did the opposite. I mean I was following the rise of\ncryptocurrency, but I felt, “Where is the value? Where is this going? What coin do I buy?” And\nso time got away and my trust or lack thereof did not change. Thus, as opposed to investing\na few thousand dollars, not much really, and get say 20 or 30 coins, I purchased none of\nthem. Not to mention probably many other opportunities to continue and purchase additional\ncoins. Anyhow, the cryptocurrency bus pulled up and asked me to get on board. I saw the\ndestination but, not being a true believer, I did not get on board. Today one can see the\nrecord prices for cryptocurrencies, and I think back—I should have boarded that\ncryptocurrency bus.\n\n\n-----\n\nMission-driven and Russian-speaking intelligence analyst with type A personality. Dmitry\nhas twenty years of experience and expertise in cybercrime activity that includes being a\nformer member of an elite Russian-based hacking organization.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-05 - ‘I Was Running Two Parallel Lives’- An Ex-Secret Service Agent Opens Up About Going Undercover To Catch Cybercriminals.pdf"
    ],
    "report_names": [
        "2021-01-05 - ‘I Was Running Two Parallel Lives’- An Ex-Secret Service Agent Opens Up About Going Undercover To Catch Cybercriminals.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535943,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653766911,
    "ts_modification_date": 1653766911,
    "files": {
        "pdf": "https://archive.orkl.eu/e09629c6e04020be07aa3c2b0925d933ddef3535.pdf",
        "text": "https://archive.orkl.eu/e09629c6e04020be07aa3c2b0925d933ddef3535.txt",
        "img": "https://archive.orkl.eu/e09629c6e04020be07aa3c2b0925d933ddef3535.jpg"
    }
}