{
    "id": "e6c2a0ed-0dbd-43c6-98a2-37fd0da45a3e",
    "created_at": "2023-01-12T15:09:25.027392Z",
    "updated_at": "2025-03-27T02:09:54.195534Z",
    "deleted_at": null,
    "sha1_hash": "aa009b413972ac3aae5ef1703f085dce2592bb6e",
    "title": "2012-07-26 - The Madi Campaign – Part II",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:49Z",
    "file_modification_date": "2022-05-28T01:59:49Z",
    "file_size": 252106,
    "plain_text": "# The Madi Campaign – Part II\n\n**securelist.com/the-madi-campaign-part-ii-53/33701/**\n\nAuthors\n\nGReAT\n\nIn our [previous blogpost, we discussed the Madi campaign, uncovered through joint research](https://securelist.com/the-madi-campaign-part-i-5/33693/)\nwith our partner Seculert (http://blog.seculert.com/2012/07/mahdi-cyberwar-savior.html).\n\nIn this blogpost, we will continue our analysis with information on the Madi infrastructure,\ncommunications, data collection, and victims.\n\nThe Madi infrastructure performs its surveillance operations and communications with a\nsimple implementation as well. Five command and control (C2) web servers are currently up\nand running Microsoft IIS v7.0 web server along with exposed Microsoft Terminal service for\nRDP access, all maintaining identical copies of the custom, C# server manager software.\nThese servers also act as the stolen data drops. The stolen data seems to be poorly\norganized on the server side, requiring multiple operators to log in and investigate the data\nper each of the compromised systems that they are managing over time.\n\n\n-----\n\nThe services at these IP addresses have been cycled through by the operators for unknown\nreasons. There does not appear to be a pattern to which malware reports to which server\njust yet. According to sinkhole data and other reliable sources, the approximate locations of\nMadi victims are distributed mainly within the Middle East, but some are scattered lightly\nthroughout the US and EU. It seems that some of the victims are professionals and\nacademia (both students and staff) running laptops infected with the Madi spyware, travelling\nthroughout the world:\n\nHere is an approximate global map representing the approximate location of Madi victims,\ndependent on GeoIP data. While the overwhelming percentage of Madi victims in the middle\neast is not best visualized in this graphic, it helps to understand the Madi reach:\n\nSome related domains not under our sinkhole were quickly sinkholed by other security\ngroups the day after our post. But the problem with the timing and approach by these\nnewcomers is that the spyware and downloaders currently active do not “speak” with those\n\n\n-----\n\ndomains, for the most part. Instead, they speak directly with the web servers running\naccording to their hard-coded IP addresses, avoiding any DNS name resolution. To help with\nthis process, the malware authors built update functionality into the downloaders. If they\nwere switching their pool of infected systems to another domain or IP address, a Madi\ndownloader or infostealer would communicate with its assigned C2 server and then retrieve\nthe IP or domain of its new C2, store the new locator in a plain text file on the drive, and then\nswitch over and begin communicating with the new C2. This approach also seems crude in\ncomparison to other resilient cybercrime infrastructure.\n\nWhen source IP addresses are examined from systems checking in to the C2 by hand and\nmatched up with their ASN, the most activity is clearly coming from within Iran:\n\nIran 84%\n\nPakistan 6%\n\nUS 3%\n\nIL 1%\n\nUAE <1%\n\nSaudi Arabia <1%\n\nWe distributed the largest collection of related samples so far to multiple vendors and\nincident response handlers. Only a couple of vendors have responded in kind with only a few\nbinaries that are new to our collection. Accordingly, these numbers are the most accurate\nthat research has to offer at this point, even as new Madi samples are uploaded to our\nbackend services:\n\n**C2 locators hard-coded into Madi downloaders**\n\nA timeline of new activity can be scoped out for the group, with the greatest number of\nrelated downloaders created by the developers in December 2011, Feb and March of 2012,\nfollowed by June of 2012. Also, the oldest Madi trojan currently in the collection was created\nin Sept. 2011, most likely during the testing phase of the project. The domain that it reports to\nwas created on August 10, 2011.\n\n\n-----\n\nThis information tends to make sense, as other researchers discussed privately that spearphishing campaign volumes appeared to be heaviest in February 2012, but this information\nwas collected from the targets outside of Iran. We don-t know about any sort of activity\nintensity timeline within Iran, although the trends above may help inform those questions.\n\nWe also know that the infostealers are a much smaller pool of code, and were released on a\nseparate timeline. We have discovered five months in which the Madi infostealers were\ncreated, and the matching URL that they communicated with for instructions and to upload\nvictim screenshots, keylogged data, stolen documents and contracts:\n\nIn addition to the information we presented here, our partner Seculert posted their own\nanalysis of the Madi C2 infrastructure here: http://blog.seculert.com/2012/07/mahdi-numbersand-flame-connection.html.\n\n**Note: On July 25, we received a** [new variant of Madi which connects to a new C2 server in](https://securelist.com/madi-is-back-new-tricks-and-a-new-commandcontrol-server-5/33709/)\nCanada. We are still investigating it and the data from this post does not include this new C2\nserver.\n\n[Adobe](https://securelist.com/tag/adobe/)\n[Adobe PDF](https://securelist.com/tag/adobe-pdf/)\n[APT](https://securelist.com/tag/apt/)\n[Malware Statistics](https://securelist.com/tag/malware-statistics/)\n[Microsoft](https://securelist.com/tag/microsoft/)\n\n\n-----\n\n[Microsoft Windows](https://securelist.com/tag/microsoft-windows/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n\nAuthors\n\nGReAT\n\nThe Madi Campaign – Part II\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2012/2012-07-26 - The Madi Campaign – Part II.pdf"
    ],
    "report_names": [
        "2012-07-26 - The Madi Campaign – Part II.pdf"
    ],
    "threat_actors": [
        {
            "id": "ca292585-950c-400f-b632-c19fa3491fe1",
            "created_at": "2022-10-25T15:50:23.599765Z",
            "updated_at": "2025-03-27T02:00:55.504509Z",
            "deleted_at": null,
            "main_name": "MONSOON",
            "aliases": null,
            "source_name": "MITRE:MONSOON",
            "tools": [
                "TINYTYPHON",
                "BADNEWS",
                "Unknown Logger",
                "AutoIt backdoor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b07fec96-80cd-4d92-aa52-a26a0b25b7c2",
            "created_at": "2022-10-25T16:07:23.826594Z",
            "updated_at": "2025-03-27T02:02:09.994638Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [
                "Mahdi"
            ],
            "source_name": "ETDA:Madi",
            "tools": [
                "Madi"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "322a0ef1-136b-400e-89d0-0d62ee2bd319",
            "created_at": "2023-01-06T13:46:38.662109Z",
            "updated_at": "2025-03-27T02:00:02.885938Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [],
            "source_name": "MISPGALAXY:Madi",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536165,
    "ts_updated_at": 1743041394,
    "ts_creation_date": 1653703189,
    "ts_modification_date": 1653703189,
    "files": {
        "pdf": "https://archive.orkl.eu/aa009b413972ac3aae5ef1703f085dce2592bb6e.pdf",
        "text": "https://archive.orkl.eu/aa009b413972ac3aae5ef1703f085dce2592bb6e.txt",
        "img": "https://archive.orkl.eu/aa009b413972ac3aae5ef1703f085dce2592bb6e.jpg"
    }
}