{
    "id": "e70fdbc9-769a-44a8-90e1-0fd0d7021a4a",
    "created_at": "2023-01-12T14:59:08.235741Z",
    "updated_at": "2025-03-27T02:05:40.642917Z",
    "deleted_at": null,
    "sha1_hash": "ab2cca2ae87569848a20be608a74aff9c1cd0b44",
    "title": "2016-05-03 - The Continuing Evolution of Samas Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T21:35:39Z",
    "file_modification_date": "2022-05-28T21:35:39Z",
    "file_size": 381923,
    "plain_text": "# The Continuing Evolution of Samas Ransomware\n\n**secureworks.com/blog/samas-ransomware**\n\nKevin Strickland\n\n_Continued development of this malware indicates the threat actors are persistent Tuesday,_\nMay 3, 2016 By: Kevin Strickland\n\n## Ransomware has evolved from single-system infections to enterprise compromises.\n\nIn some of the more well-known and better publicized ransomware cases, a user either\nreceives and executes a malicious attachment or is the victim of an exploit kit such as\nAngler, resulting in one system being infected with ransomware. The ransomware encrypts\nspecific files on the system and may encrypt files on mapped network drives. Some\nransomware variants also target and encrypt files on unmapped, open network shares that\ncan be accessed using the user's credentials.\n\nIn the first quarter of 2016, SecureWorks analysts identified a trend of more extensive,\nenterprise-wide ransomware infections. Instead of only one system being affected, a\nsignificant percentage of systems within the compromised infrastructure exhibited signs of\nransomware infection. This type of ransomware attack has had a significant impact on\norganizations in several verticals, including hospitality, healthcare, education, and\nmanufacturing. No single industry appears to be targeted more than another. During one\nincident, SecureWorks analysts found that more than 30% of the organization's systems\nwere infected with ransomware, including a server hosting the cloud backup application. The\nclient could not properly restore encrypted documents, causing a significant strain on the\ncompany and its employees. The threat actors used tactics and techniques popular with\ndedicated adversaries and infected the systems with the ransomware variant known as\nSamas (also known as SamSam).\n\nSamas ransomware is documented in several security articles, blogs, and forums, including\na [blog post published by the SecureWorks Counter Threat Unit™ (CTU) research team on](https://www.secureworks.com/blog/ransomware-deployed-by-adversary)\nMarch 30, 2016. Threat actors established a foothold within the infrastructure, harvested\ncredentials, used the stolen credentials to conduct reconnaissance and map the\ncompromised infrastructure, and later deployed and executed the Samas ransomware on\n[multiple systems. The damage inflicted by this malware prompted the U.S. Federal Bureau of](http://fortune.com/2016/03/28/fbi-ransomware-extortion-hackers/)\nInvestigation (FBI) to “[ask] business and software security experts for emergency assistance\nin its investigation.”\n\nAs the Samas ransomware has become more prevalent, low-level indicators such as file\nhashes, ransom note “help” files, and encrypted filename extensions have been publicly\nreleased Additionally the antivirus industry is attempting to keep pace with updates to detect\n\n\n-----\n\nthe ransomware. The release of this information benefits two groups: victims and the Samas\nmalware author(s). Affected organizations can more efficiently identify the ransomware,\ndecreasing the time spent on containment and eradication. The malware authors react to the\npublicized information by modifying their code, effectively nullifying many of the published\nindicators, in some cases, avoiding detection by traditional antivirus applications.\nSecureWorks analysts have identified updated versions of the Samas ransomware,\nindicating that the authors have been modifying their code.\n\nThe Samas ransomware is a .NET compiled binary, and the primary filename associated with\nthe ransomware is samsam.exe. An initial samsam.exe variant analyzed by SecureWorks\ncontained a compile date in January 2016 and a file description field of “MicrosoftSAM.”\nSecureWorks analysts identified three additional variants of the Samas ransomware (see\nTable 1).\n\n**Name** **Compile date** **File description field**\n\nmikoponi.exe March 2016 MiCro Oragns\n\nRikiRafael.exe Early April 2016 Microsoft BenchMark CPU\n\nshowmehowto.exe April 24, 2016 Adobe Flash Player\n\n_Table 1. Samas variants identified by SecureWorks analysts._\n\nAs illustrated in Figures 1-4, each of the four variants were identified by a unique Program\nDatabase (PDB) file string embedded within the file. The PDB file stores debugging\ninformation for an application and often indicates the original name of the program.\n\n_Figure 1. PDB file string for samsam.exe. (Source: SecureWorks)_\n\n_Figure 2. PDB file string for mikoponi.exe. (Source: SecureWorks)_\n\n_Figure 3. PDB file string for RikiRafael.exe. (Source: SecureWorks)_\n\n\n-----\n\n_Figure 4. PDB file string for showmehowto.exe. (Source: SecureWorks)_\n\nThe older Samas variants contained two hidden executables within the portable executable\n(PE) resource section: del.exe and selfdel.exe. The del.exe file is the legitimate Microsoft\nSysInternals SDelete application. Tests of the ransomware indicate that selfdel.exe is used to\ndelete both samsam.exe and del.exe from the infected system.\n\nIn the more recent mikoponi.exe and RikiRafael.exe variants, both executables contained\none binary (SDelete) hidden in the resource section. Instead of using two executables, these\nvariants create a Windows batch script (see Figure 5) to delete itself.\n\n_Figure 5. Extracted batch script from Samas sample. (Source: SecureWorks)_\n\nThe batch script sets three variables: the Samas executable name (EXE), SDelete (DEL),\nand the Samas executable process path (PEXE). A FOR loop is created, executing ‘tasklist'\nin search of the running Samas process. If the process is still running, the batch script\ncontinues to run in a loop, creating a delay by pinging the local host five times and the\nrepeating the search process. If the process is not found, SDelete (DEL) executes and\ndeletes the Samas ransomware. The batch script then deletes both SDelete and itself.\n\nAs an additional forensic indicator, a registry key is created when SDelete executes with the\n“-accepteula” parameter (which is required the first time it is executed on any system), which\nindicates that the end-user license agreement (EULA) was accepted. The key is created\nwithin the profile of the user who executed SDelete (e.g.,\nHKEY_CURRENT_USER\\Software\\Sysinternals\\SDelete).\n\nThe most recent Samas variant observed by SecureWorks analysts as of this publication\n(showmehowto.exe) uses a batch script but forgoes the use of SDelete, leaving the malware\non the system. Within one month, the Samas authors developed two variants, and each\niteration made past low-level threat indicators obsolete.\n\n\n-----\n\nAll of the Samas variants analyzed by SecureWorks are .NET compiled binaries with code\nobfuscation. Using a decompiler tool, several attributes of the recent variants can be\nidentified, notably the ransom note filenames and the extension of the encrypted files. The\nsamsam.exe variant created ransom note files labeled HELP_DECRYPT_YOUR_FILES and\nused the extension .encryptedRSA.\n\nFigure 6 shows code extracted from the RikiRafael variant's binary, including several\nvariables used throughout the program. The variables contain an unusual amount of\ncharacters, and the values of these variables are stored as hexadecimal (HEX) values (see\nFigures 7 and 8). This style of coding is often described as obfuscation and is used to hide a\nprogram's true intent from security tools and analysts. The ASCII representation of the HEX\nvalue in Figure 7 is HOW_TO_DECRYPT_FILES, and the ASCII representation of Figure 8\nis .justbtcwillhelpyou.\n\n_Figure 6. Code from RikieRafael.exe. (Source: SecureWorks)_\n\n_Figure 7. RikiRafael.exe hexadecimal representation of the HOW_TO_DECRYPT_FILES_\n_string. (Source: SecureWorks)_\n\n_Figure 8. RikiRafael.exe hexadecimal representation of the justbtcwillhelpyou string. (Source:_\n_SecureWorks)_\n\nBoth the mikoponi and RikiRafael Samas variants label their ransom note files\nHOW_TO_DECRYPT_FILES. The files encrypted by the mikoponi variant use the extension\n.encryptedAES, while files encrypted by the RikiRafael variant use the extension\n.justbtcwillhelpyou. The showmehowto.exe variant labels ransom note files\nHELP_FOR_DECRYPT_FILE and uses the .btc-help-you extension.\n\nBased on the analyzed Samas samples, the core code of the Samas ransomware has not\ndrastically changed. However, the continued development of the ransomware binaries\nindicate that the threat actors are persistent and will continue to deliver updated versions to\nevade detection and continue their campaign. Endpoint detection mechanisms such as the\nSecureWorks [Advanced Endpoint Threat Detection (AETD) service goes beyond the](https://www.secureworks.com/404?item=web%3a%7b74EA957A-E2EC-410B-8532-73C744ABCAFC%7d%40en)\ndetection of low-level threat indicators, applying behavioral analysis and human intelligence\n[to detect the adversary and protect your endpoints.](https://www.secureworks.com/centers/endpoint-security)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-05-03 - The Continuing Evolution of Samas Ransomware.pdf"
    ],
    "report_names": [
        "2016-05-03 - The Continuing Evolution of Samas Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535548,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653773739,
    "ts_modification_date": 1653773739,
    "files": {
        "pdf": "https://archive.orkl.eu/ab2cca2ae87569848a20be608a74aff9c1cd0b44.pdf",
        "text": "https://archive.orkl.eu/ab2cca2ae87569848a20be608a74aff9c1cd0b44.txt",
        "img": "https://archive.orkl.eu/ab2cca2ae87569848a20be608a74aff9c1cd0b44.jpg"
    }
}