{
    "id": "e72109b7-5ed5-4031-ab40-83a9102df38a",
    "created_at": "2023-01-12T15:10:16.887633Z",
    "updated_at": "2025-03-27T02:10:10.674499Z",
    "deleted_at": null,
    "sha1_hash": "b2f5e3a88ca0832039332a6ead5ca62eb4b74d96",
    "title": "2022-12-14 - Royal Rumble- Analysis of Royal Ransomware",
    "authors": "",
    "file_creation_date": "2022-12-29T00:29:36Z",
    "file_modification_date": "2022-12-29T00:29:36Z",
    "file_size": 1456280,
    "plain_text": "# Royal Rumble: Analysis of Royal Ransomware\n\n**cybereason.com/blog/royal-ransomware-analysis**\n\nWritten By\nCybereason Global SOC & Cybereason Security Research Teams\n\nDecember 14, 2022\n|\n7 minute read\n\nThe Royal ransomware group emerged in early 2022 and has gained momentum since the middle of the\nyear. Its ransomware, which the group deploys through different TTPs, has impacted multiple\norganizations across the globe. The group itself is suspected of consisting of former members of other\nransomware groups, based on similarities researchers have observed between Royal ransomware and\nother ransomware operators.\n\n## Key Findings\n\nUnique approach to evade anti-ransomware defenses: Royal ransomware expands the concept of\npartial encryption, which means it has the ability to encrypt a pre-determined portion of the file\ncontent and base its partial encryption on a flexible percentage encryption, which makes detection\nmore challenging for anti-ransomware solutions.\n\nMulti-threaded ransomware: Royal ransomware employs multiple threads in order to accelerate the\nencryption process.\n\nGlobal ransomware operation: Royal ransomware operates around the world, and reportedly on its\nown. The group doesn’t appear to use ransomware-as-a-service or to target a specific sector or\ncountry.\n\n\n-----\n\nDifferent methods of deployment: Royal ransomware initially starts and deploys in different ways, as\ndescribed in this report.\n\n## INTRODUCTION\n\n[The Royal ransomware group was first discovered in early 2022. At the time, it utilized third-party](https://www.bleepingcomputer.com/news/security/new-royal-ransomware-emerges-in-multi-million-dollar-attacks/)\nransomware, such as BlackCat and custom Zeon ransomware. Since September 2022, the group has\n[started to use its own ransomware. In November 2022, Royal ransomware was reported to be the most](https://twitter.com/ido_cohen2/status/1599404888617758721?t=AasRHMIDIIunfLRi4TEuiA&s=31)\nprolific ransomware in the e-crime landscape, overtaking Lockbit for the first time in more than a year.\n\nRoyal ransomware operations start in different ways. One method is through phishing campaigns and\n[uses one of the common e-crime threat loaders, reportedly BATLOADER and Qbot. The threat loader](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\nthen downloads a Cobalt Strike payload to continue the malicious operation within the infected\nenvironment. This tactic is commonly used by other ransomware operations, including Qbot and\nBlackBasta.\n\nSince mid-September, the ransomware group has gained momentum and added dozens of victims to its\nwebsite. The group does not seem to focus on a specific sector, and its victims vary from industrial\ncompanies to insurance companies, and more. Although the majority of the group’s victims are based in\n[the U.S., one of its higher profile victims was the Silverstone Circuit, a motor racing circuit in England.](https://cybernews.com/news/silverstone-formula-one-ransomware/)\n\n_Screenshot from Royal Ransomware website showing Silverstone Circuit as a victim_\n\n[Multiple reports have noted resemblances between the Royal Ransomware group and Conti, including](https://blog.bushidotoken.net/2022/11/the-continuity-of-conti.html)\nsimilarities between the ransom notes each group uses (particularly in Royal’s early stages) and the use\nof [callback phishing attacks. In our research, we have identified additional similarities, such as](https://www.bleepingcomputer.com/news/security/callback-phishing-attacks-evolve-their-social-engineering-tactics/)\nresemblances in the encryption process decision factors. However, these similarities are not yet clear\nenough to confirm a direct connection between the two groups.\n\n## TECHNICAL ANALYSIS\n\n**Setting up the ransomware**\n\nWhen executing, Royal ransomware can take three arguments in its command line:\n\n\n-----\n\n-path [optional]: The path to be encrypted\n\n-ep [optional]: The number that represents the percentage of the file that will be encrypted\n\n-id: A 32-digit array\n\nThe encryption process decision tree is dependent on the command line arguments. Therefore, factors\nsuch as encryption speed, file corruption, and potential detection are directly affected. If no “-id”\nparameter is given in the command line, the ransomware won’t run.\n\n_Royal ransomware_\n\n_command line arguments_\n\nAfter validating the command line, Royal ransomware will attempt to delete shadow copy backups using\nthe process Vssadmin.exe, with the command line “delete shadows /all /quiet”.\n\n_Royal ransomware deleting shadow copies_\n\nThe deletion of the shadow copy can also be seen via the Cybereason Defense Platform, which identifies\nthe activity as ransomware behavior in the image below.\n\n\n-----\n\n_Cybereason Defense Platform identifies deletion of shadow copies_\n\nOnce the backups have been deleted, Royal ransomware will set its exclusion paths (the files or\ndirectories spared from file encryption). The following file extensions will be excluded from being\nencrypted:\n\n.exe\n\n.dll\n\n.bat\n\n.lnk\n\nREADME.TXT\n\n.royal\n\n\n-----\n\n>Royal ransomware setting the extension exclusion list\n\nNext, the ransomware will set the list of directories to be excluded from the encryption process. These\ndirectories are the ones that contain the following strings:\n\nWindows\n\nRoyal Perflogs\n\nTor browser\n\nBoot $recycle.bin\n\nWindows.old\n\n$window.~ws\n\n$windows.~bt\n\nMozilla\n\nGoogle\n\n\n-----\n\n_Royal ransomware setting the_\n\n_directories exclusion list_\n\nAfter setting the directories to be excluded from encryption, the ransomware then uses the API call\nSocket to establish a TCP socket and WSAIoctl to invoke a handler for LPFN_CONNECTEX to use the\nConnectEx function.\n\n_Royal_\n\n_Ransomware retrieving ConnectEx function_\n\nAfter the initial part of setting the ransomware, Royal ransomware will create two threads: one for writing\nthe ransom note on non-excluded directories and another for file encryption, in addition to a network\nscanning option.\n\n**NETWORK SCANNER**\n\nAs mentioned, if no path is given in the command line arguments, Royal ransomware will start with the\nfollowing steps:\n\nFirst, the ransomware will scan the network interfaces, and if possible, retrieve the different IP addresses\nfor the target machine(s), using the API call GetIpAddrTable. It will specifically search for IP addresses\nthat start with “192. / 10. / 100. / 172.”\n\n\n-----\n\n_Network scanning_\n\nSecond, Royal ransomware will establish a socket using the API WSASocketW and will associate it with a\ncompletion port using CreateIoCompletionPort. It then will use the API call htons to set the port to SMB,\nand eventually try to connect to the instructed IP addresses via the LPFN_CONNECTEX callback\nfunction.\n\n_Using ConnectEx_\n\nThird, the ransomware will enumerate the shared resources of the given IP addresses using the API call\nNetShareEnum. If a shared resource is one of “\\\\<IP_Address>\\ADMIN$” or “\\\\<IP_Address>\\IPC$”, the\nransomware will not encrypt it.\n\n\n-----\n\n_Enumerating network resources and avoiding ADMIN$ and IPC$ file shares_\n\n**ENCRYPTION THREAD**\n\nRoyal ransomware encryption is multi-threaded. To choose the number of running threads, the\nransomware will use the API call GetNativeSystemInfo to collect the number of processors in a machine.\nIt will then multiply the result by two and will create the appropriate number of threads accordingly.\n\n_Creating_\n\n_encryption threads_\n\nNext, the ransomware will set the RSA public key, which is embedded in the binary in plain text and will\nbe used for encrypting the AES key.\n\n\n-----\n\n- _RSA public key_\n\nBefore starting the encryption process, Royal ransomware uses the Windows Restart Manager to check if\nany of the targeted files to be encrypted are being used or blocked by other applications or services.\n[Notably, other ransomware groups including Conti,](https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9895237) [Babuk, and](https://chuongdong.com/reverse%20engineering/2021/01/03/BabukRansomware/) [Lockbit use Restart Manager for the same](https://chuongdong.com/reverse%20engineering/2022/03/19/LockbitRansomware/)\npurpose. Royal then uses the API calls RmStartSession to start the session, RmRegisterResources to\nregister the resources (i.e., the targeted files), RmGetList to verify which applications or services are\nusing the resource (excluding “explorer.exe”), and RmShutDown to kill those applications and services\nusing the resource.\n\n_Royal_\n\n_ransomware killing processes_\n\n\n-----\n\nFinally, the encryption method will be determined by the size of the file that will be encrypted and in\nconsideration of the -ep parameter.\n\nIf the file size is smaller than 5.245 MB or the -ep argument equals 100:, the entire file will be\nencrypted.\n\nIf the file size is larger than 5.245 MB and the -ep argument is not equal to 100:, the file will be\nencrypted approximately by the percentage of the -ep argument.\n\nIf the file size is larger than 5.245 MB and no -ep argument is given, 50% of the file will be\nencrypted.\n\n_Decision_\n\n_making in encryption_\n\nWhen a targeted file is being encrypted, the ransomware calculates the percentage to encrypt and divides\nthe file content (encrypted and unencrypted) into equal segments. The fragmentation and possibly low\npercentage of encrypted file content that results lowers the chance of being detected by anti-ransomware\nsolutions.\n\nIn the following test, we can see the comparison between the encryption of the same file (larger than\n5.245 MB) with different encryption percentages (-ep argument). The image on the left represents an -ep\nargument of 50 and the image on the right represents an -ep argument of 10.\n\n\n-----\n\n_[PortexAnalyzer ep 50 vs. ep 10](https://github.com/struppigel/PortEx)_\n\nIn addition to the file being encrypted, Royal ransomware will save 532 bytes at the end of each file and\nwrites the following:\n\n512 bytes for randomly generated encryption key\n\n8 bytes for file size of the encrypted file\n\n8 bytes for the used ep parameter\n\n\n-----\n\n[While partial encryption is not new, most ransomware base their partial encryption only on the file size,](https://www.esecurityplanet.com/threats/ransomware-intermittent-encryption/)\nthen encrypt a set percentage of the file the same way, each time. In contrast, Royal ransomware lets the\noperator choose a specific percentage and lower the amount of encrypted data even if the file size is\nlarge. This ability to change the amount of the file to be encrypted gives Royal ransomware an advantage\nwhen it comes to evading detection by security products.\n\nIt’s worth highlighting that Conti ransomware also chooses the file size of 5.24 MB as its threshold for\npartial encryption. When a file was larger than 5.24MB, Conti would encrypt 50% of the file in a divided\nmanner, much like Royal ransomware. This similarity raises the question of whether the Royal\nransomware authors have a connection to the Conti group, but on its own, it is not strong enough to\nsuggest a direct or definitive connection.\n\nAs for the encryption algorithm, Royal ransomware uses the OpenSSL library and the AES256 algorithm.\nSimilar to other ransomware, it first reads the targeted file using ReadFile, then it encrypts the content\nand writes the encrypted data in the designated location using WriteFile and SetFilePointerEx. After\nfinishing encryption, the file extension changes to “.royal” using the API call MoveFileExW.\n\n\n-----\n\n_Royal ransomware appending .royal extension to the files it encrypts_\n\n**WRITING THE RANSOM NOTE**\n\nDuring the entire Royal ransomware process, the ransomware creates an additional thread to retrieve the\nlogical drives using the API call GetLogicalDrives. It then writes the ransom note with the name\n“README.TXT” in every directory that is not in its exclusion list.\n\n_Royal Ransomware creating the ransom note_\n\nEventually, an encrypted directory will look like this\n\n\n-----\n\n_Example of a folder affected by royal ransomware_\n\n**OVERVIEW**\n\nThe image below illustrates the entire encryption process decision tree:\n\n\n-----\n\n_Royal ransomware encryption process decision tree_\n\n## CONCLUSION\n\nWhen it comes to partial encryption, Royal ransomware seems to give the ransomware operator a more\nflexible solution for evading detection compared to most ransomware. We assume this flexibility and the\nevasion potential it enables was a design goal for the creators of Royal ransomware.\n\nAs with some reports mentioned above, some ideas that were implemented in Conti ransomware can be\nfound in Royal ransomware.\n\n### CYBEREASON DEFENSE PLATFORM: DETECTION AND PREVENTION\n\n\n-----\n\nThe [Cybereason Defense Platform is able to detect and prevent Royal ransomware infections using multi-](https://www.cybereason.com/platform)\nlayer malware protection that leverages threat intelligence, machine learning, anti-ransomware, next-gen\nantivirus (NGAV), and [Variant Payload Prevention capabilities.](https://www.youtube.com/watch?v=GOswitXwSPI)\n\n_Cybereason Defense Platform showing the Royal ransomware triggered a “MalOp”_\n\n## RECOMMENDATIONS\n\nThe Cybereason GSOC & Security Research teams recommend the following actions in the Cybereason\nDefense Platform:\n\nEnable Application Control to block the execution of malicious files.\n\nEnable Anti-Ransomware in your environment’s policies, set the [Anti-Ransomware mode to](https://www.cybereason.com/platform/ransomware-protection)\nPrevent, and enable Shadow Copy detection to ensure maximum protection against ransomware.\n\nEnable Variant Payload Prevention with prevent mode on Cybereason Behavioral execution\nprevention.\n\nTo hunt proactively, use the Investigation screen in the Cybereason Defense Platform and the\nqueries in the Hunting Queries section to search for machines that are potentially infected with\nRoyal Ransomware.\n\nBased on the search results, take further remediation actions, such as isolating the infected\nmachines and deleting the payload file.\n\nCybereason is dedicated to teaming with defenders to end cyber attacks from endpoints to the enterprise\nto everywhere. [Schedule a demo today to learn how your organization can benefit from an operation-](https://www.cybereason.com/request-a-demo)\ncentric approach to security.\n\n## MITRE ATT&CK MAPPING\n\n\n-----\n\nTactic Technique or Sub-technique\n\n[TA0005: Discovery](https://attack.mitre.org/tactics/TA0005) [T1083: File and Directory Discovery](https://attack.mitre.org/techniques/T1083/)\n\n[TA0007: Discovery](https://attack.mitre.org/tactics/TA0007/) [T1016: System Network Configuration Discovery](https://attack.mitre.org/techniques/T1016/)\n\n[TA0007: Discovery](https://attack.mitre.org/tactics/TA0007/) [T1046: Network Service Discovery](https://attack.mitre.org/techniques/T1046/)\n\n[TA0007: Discovery](https://attack.mitre.org/tactics/TA0007/) [T1057: Process Discovery](https://attack.mitre.org/techniques/T1057/)\n\n[TA0007: Discovery](https://attack.mitre.org/tactics/TA0007/) [T1082: System Information Discovery](https://attack.mitre.org/techniques/T1082/)\n\n[TA0007: Discovery](https://attack.mitre.org/tactics/TA0007/) [T1135: Network Share Discovery](https://attack.mitre.org/software/S0575/)\n\n[TA0040: Impact](https://attack.mitre.org/tactics/TA0040) [T1486: Data Encrypted for Impact](https://attack.mitre.org/techniques/T1486/)\n\n[TA0040: Impact](https://attack.mitre.org/tactics/TA0040) [T1489: Service Stop](https://attack.mitre.org/techniques/T1489/)\n\n[TA0040: Impact](https://attack.mitre.org/tactics/TA0040) [T1490: Inhibit System Recovery](https://attack.mitre.org/techniques/T1490/)\n\n[TA0002: Execution](https://attack.mitre.org/tactics/TA0002/) [T1059: Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/)\n\n## IOCS\n\nIndicators Indicator\ntype\n\n\nDescription\n\n\n250bcbfa58da3e713b4ca12edef4dc06358e8986cad15928aa30c44fe4596488 SHA256 Royal\nRansomware\nBinary\n\n9db958bc5b4a21340ceeeb8c36873aa6bd02a460e688de56ccbba945384b1926 SHA256 Royal\nRansomware\nBinary\n\nc24c59c8f4e7a581a5d45ee181151ec0a3f0b59af987eacf9b363577087c9746 SHA256 Royal\nRansomware\nBinary\n\n5fda381a9884f7be2d57b8a290f389578a9d2f63e2ecb98bd773248a7eb99fa2 SHA256 Royal\nRansomware\nBinary\n\n\n-----\n\n312f34ee8c7b2199a3e78b4a52bd87700cc8f3aa01aa641e5d899501cb720775 SHA256 Royal\nRansomware\nBinary\n\nf484f919ba6e36ff33e4fb391b8859a94d89c172a465964f99d6113b55ced429 SHA256 Royal\nRansomware\nBinary\n\n7cbfea0bff4b373a175327d6cc395f6c176dab1cedf9075e7130508bec4d5393 SHA256 Royal\nRansomware\nBinary\n\n2598e8adb87976abe48f0eba4bbb9a7cb69439e0c133b21aee3845dfccf3fb8f SHA256 Royal\nRansomware\nBinary\n\n## ABOUT THE RESEARCHERS\n\nEli Salem, Security & Malware Researcher, Cybereason Global SOC\n\nEli is a lead threat hunter and malware reverse engineer at Cybereason. He has worked in\n\nthe private sector of the cybersecurity industry since 2017. In his free time, he publishes articles about\nmalware research and threat hunting.\n\nAlon Laufer, Senior Security Analyst, Cybereason Global SOC\n\nAlon Laufer is a Senior Security Analyst with the Cybereason Global SOC team. Alon\n\nanalyzes critical incidents. He began his career in the Israeli Air Force where he was responsible for\nprotecting critical infrastructure. Alon is interested in malware analysis, digital forensics, and incident\nresponse.\n\nMark Tsipershtein, Security Operations Analyst at Cybereason\n\n\n-----\n\nMark Tsipershtein, a cyber security analyst at the Cybereason Security Research Team,\n\nfocuses on analysis automation and infrastructure. Mark has more than 20 years of experience in SQA,\nautomation, and security testing.\n\nAbout the Author\n\n**Cybereason Global SOC & Cybereason Security Research Teams**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-14 - Royal Rumble- Analysis of Royal Ransomware.pdf"
    ],
    "report_names": [
        "2022-12-14 - Royal Rumble- Analysis of Royal Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf4d333d-ef79-40aa-b233-886e6de875a3",
            "created_at": "2023-12-08T02:00:05.754609Z",
            "updated_at": "2025-03-27T02:00:03.266797Z",
            "deleted_at": null,
            "main_name": "DEV-0569",
            "aliases": [
                "Storm-0569"
            ],
            "source_name": "MISPGALAXY:DEV-0569",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536216,
    "ts_updated_at": 1743041410,
    "ts_creation_date": 1672273776,
    "ts_modification_date": 1672273776,
    "files": {
        "pdf": "https://archive.orkl.eu/b2f5e3a88ca0832039332a6ead5ca62eb4b74d96.pdf",
        "text": "https://archive.orkl.eu/b2f5e3a88ca0832039332a6ead5ca62eb4b74d96.txt",
        "img": "https://archive.orkl.eu/b2f5e3a88ca0832039332a6ead5ca62eb4b74d96.jpg"
    }
}