{
    "id": "e75f2b25-e489-4da1-8684-f16a50f6935d",
    "created_at": "2023-01-12T15:00:25.293667Z",
    "updated_at": "2025-03-27T02:06:12.431464Z",
    "deleted_at": null,
    "sha1_hash": "e808b0da5089a63e518d4ac19a7309e420c0a8f3",
    "title": "2021-09-10 - PhishingJS- A Deep Learning Model for JavaScript-Based Phishing Detection",
    "authors": "",
    "file_creation_date": "2022-05-28T02:47:17Z",
    "file_modification_date": "2022-05-28T02:47:17Z",
    "file_size": 11334109,
    "plain_text": "# PhishingJS: A Deep Learning Model for JavaScript-Based Phishing Detection\n\n**unit42.paloaltonetworks.com/javascript-based-phishing/**\n\nLucas Hu September 10, 2021\n\nBy [Lucas Hu](https://unit42.paloaltonetworks.com/author/lucas-hu/)\n\nSeptember 10, 2021 at 6:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Cybercrime,](https://unit42.paloaltonetworks.com/tag/cybercrime/) [deep learning,](https://unit42.paloaltonetworks.com/tag/deep-learning/) [JavaScript,](https://unit42.paloaltonetworks.com/tag/javascript/) [Machine Learning,](https://unit42.paloaltonetworks.com/tag/machine-learning/) [Phishing,](https://unit42.paloaltonetworks.com/tag/phishing/) [Scams,](https://unit42.paloaltonetworks.com/tag/scams/) [URL filtering](https://unit42.paloaltonetworks.com/tag/url-filtering/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/javascript-based-phishing/)\n\n## Executive Summary\n\nMany traditional phishing detection systems rely on the presence of login forms within the HTML of the webpage to classify pages\n[as phishing. Client-side cloaking is an increasingly common technique that attackers use to evade phishing detection systems by](http://www.public.asu.edu/~pzhang57/papers/crawlphish.pdf)\nrequiring complex user interaction before revealing the webpage’s phishing content, or by using JavaScript to inject phishing content\ninto the page only after the page renders in the user’s browser.\n\nTo combat these evasion techniques, we trained a deep learning model to detect phishing webpages based on the JavaScript\ncontent contained within the script tags of an HTML page. The model, dubbed PhishingJS, runs in the Palo Alto Networks cloud[delivered Advanced URL Filtering service. It currently detects an additional 15,000 phishing URLs per week on sophisticated](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\nJavaScript-based attacks that many existing phishing detection systems struggle to detect.\n\n[Palo Alto Networks customers with the Next-Generation Firewall and the Advanced URL Filtering security subscription are protected](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\nagainst the sophisticated types of phishing attacks discussed here.\n\n## Client-Side Cloaking\n\nMany existing phishing detection systems rely on the presence of login forms, brand logos and similar signals within the HTML of a\nwebpage to determine whether the page is a phishing page.\n\n[Client-side cloaking is an increasingly common evasion technique used by cybercriminals to evade these phishing detection](http://www.public.asu.edu/~pzhang57/papers/crawlphish.pdf)\nsystems. These attackers often use JavaScript to dynamically render phishing content (the same types of content often picked up by\ndetection systems) on the client side, sometimes requiring user interaction before revealing any signs of attempted credential theft.\nSince the phishing content does not appear in the HTML document until after the page renders, these phishing pages can be difficult\nfor traditional phishing detection engines to catch.\n\nIn Figures 1-2, we can see an example of a phishing webpage employing client-side cloaking techniques. This page claims that\nthere has been some unusual activity on the user’s Apple ID account and that the user needs to process a refund related to the\nactivity.\n\n\n-----\n\nUpon first visiting the webpage, there is no phishing form immediately apparent. Only after the user clicks the Confirm Refund\nRequest” button is the credential-stealing form revealed. Since many crawler-based phishing detection systems cannot handle these\nsorts of interactions, these types of phishing pages can often pass undetected.\n\nFigure 1. https://appleid[.]uber[.]space/LoginFailed.php?\nsslchannel=true&sessionid=VRqELCgYcqDhDQ2KGKMPYt4FcEX0XO7Kz1wi2xZyCCQiA5fz9smSqmoWfnsEn9znu4ixcl3RkVzwRW5f.\nA phishing page employing client-side cloaking techniques.\n\nFigure 2. Same URL as Figure 1, with the credential-stealing form revealed after clicking “Confirm Refund Request.”\nAfter investigating the source code behind the page, we see that most of the page content does not exist directly within the main\nbody of the HTML. Rather, there is a large script tag at the bottom of the HTML source that uses the document.write(...) API to inject\nthe bulk of the page content into the HTML document; this happens only after the page is rendered in the browser.\n\n\n-----\n\nNote that this script is also highly obfuscated, likely in an attempt to avoid phishing detection engines. The obfuscated code runs\nthrough AES decryption before being passed into the document.write(...) call.\n\nFigure 3. HTML source code for the page in Figures 1-2.\nSophisticated phishing pages like these may pose problems to traditional phishing detection engines. Therefore, we need to\ninvestigate additional machine learning (ML) techniques to classify pages like these as phishing.\n\n## How We Trained Our Model to Detect JavaScript-Based Phishing\n\nWe first created a training data collection pipeline to continuously gather phishing JavaScript samples from recent phishing URLs.\nWe collected these samples from phishing URLs discovered from third-party sources and our phishing detection systems.\n\nOnce enough samples were collected, we trained a deep learning model on ~120,000 phishing and ~300,000 benign JavaScript\nsamples. We validated the model in a staging environment before promoting it to production.\n\nTraditional ML relies on subject matter experts to design a set of handcrafted features for the model to use as indicators of phishing\nor benign activity. On the other hand, our deep learning model iterates through the dataset to learn what patterns in the JavaScript\ncode may indicate phishing (or otherwise suspicious) behavior. This ML-based pattern-matching makes the model more flexible than\npurely signature-based detection techniques, and also more robust to newer or lesser-known JavaScript-based phishing tactics that\nsome researchers may not have seen before.\n\nFor each script tag, the model produces a score from 0 to 1, where 1 indicates high confidence in the script being related to some\nsort of phishing behavior, and 0 indicates high confidence in the script being benign. For example, highly obfuscated JavaScript\ncode, or code that injects credential-stealing forms into the page, may cause the model to output a high phishing score. Benign\nJavaScript code will pass through the model without raising any red flags.\n\nOnce we have a phishing score from the model, we apply various thresholds to make our final verdict regarding whether to publish\nthe given URL as phishing or not. The PhishingJS model contributes roughly 15,000 new phishing detections weekly, meaning that\n[Palo Alto Networks customers – specifically those who subscribe to Advanced URL Filtering – will be protected from these](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\nsophisticated phishing attacks in the real world.\n\n## PhishingJS in the Real World\n\nHere are some sample detections that our model has generated.\n\n\n-----\n\nFirst, we can see that the model can detect phishing pages employing client side cloaking, such as when the page requires the user\nto click a button before actually revealing the credential-stealing form. In Figures 4-5, we see an example of a phishing webpage\nimpersonating a Dropbox login page. The user must first click a “Sign in with Gmail” or “Sign in with Outlook” button before being\npresented with a modal asking for their login information. This particular URL was detected as phishing with a score of 0.99998,\nmeaning that the model was very confident in marking this page as phishing.\n\nFigure 4. cooking4kor[.]ru/cvfd/?onstoreid=40uti89763. A phishing page employing client-side cloaking that our PhishingJS model\ndetected.\n\nFigure 5. cooking4kor[.]ru/cvfd/?onstoreid=40uti89763. After user interaction.Next, we show that the model can also detect highly\nobfuscated JavaScript code responsible for generating phishing webpages. In Figure 6, we present a phishing webpage that is\nattempting to impersonate a SharePoint login site. This may look like a relatively straightforward phishing page upon first glance.\n\n\n-----\n\nHowever, upon inspecting the page s source code, we see that the entire page is generated using a single JavaScript script tag.\nSimilar to the example in Figure 3, this JavaScript snippet takes a highly obfuscated string, decodes it and then calls\ndocument.write(...) to inject the output into the webpage.\n\nFigure 6. https://555305[.]selcdn[.]ru/564377/kc.htm#. A phishing webpage that uses JavaScript to dynamically render the content of\nthe page.Since the HTML of the page lacks any immediately apparent body text or input forms, this page might evade many\ntraditional phishing detection engines. However, by analyzing the JavaScript snippet itself, our PhishingJS model detected this\nmodel as phishing with a high-confidence score of 1.00000.\n\nFigure 7. HTML source code for the phishing page in Figure 6.\nWe find that the model is capable of detecting highly interactive scam pages as well. In Figures 8-10, we show a scam page\nclaiming that the user has won a free Samsung Galaxy S2; all the user needs to do to claim the prize is share the page with five\ngroups or 20 friends on WhatsApp.\n\n\n-----\n\nFigure 8. http://coffeeshop[.]store/janjijiwa?t=1621831119257. A highly interactive scam page that was detected by our PhishingJS\nmodel.Each time the user clicks the “Share” button, the page opens the user’s WhatsApp app and asks the user to share the page\nwith another WhatsApp number. After each time the page is “shared,” the blue bar is incremented farther toward the right.\n\nFigure 9. Same URL as Figure 8, after clicking the “Share” button.\nOnce the user has shared the page with the requisite number of friends, the user is prompted to complete the final registration step.\nPresumably, after clicking “Complete registration,” the user will be shown a form asking for some sensitive information so that the\nscammers can “ship the free phone” (which, to be clear, does not exist) to the user.\n\n\n-----\n\nFigure 10. Same URL as Figure 8. After sharing the page with enough WhatsApp users, the user is prompted to “Complete\nregistration.”\nAs seen in the figures above, this scam page requires very complex user interactions before explicitly revealing any credentialstealing forms. By analyzing the JavaScript of the page and using deep learning to look for suspicious patterns that may be\nindicative of phishing or credential-stealing activity, we can detect these pages as phishing and prevent our customers from falling\nprey to these sorts of attacks in the real world.\n\n## Conclusion\n\nTraditional phishing detection engines can often struggle to detect the increasingly sophisticated phishing webpages that\ncybercriminals are now crafting. Specifically, they are often unable to detect instances of client-side cloaking, wherein the phishing\npage may require some user interaction before revealing the actual phishing content, or wait until the page is rendered in the\nbrowser before injecting phishing content into the HTML document.\n\nBy training a deep learning model to directly analyze the JavaScript contained within the webpage, we can catch these sophisticated\nJavaScript-based phishing attacks and prevent them from reaching our customers.\n\n[The Palo Alto Networks ML-powered Advanced URL Filtering service for the Next-Generation Firewall, which now has this](https://www.paloaltonetworks.com/network-security/advanced-url-filtering)\nJavaScript-based phishing detection capability, can help protect against these attacks.\n\n### Indicators of Compromise\n\nhxxps://appleid[.]uber[.]space\n\ncooking4kor[.]ru/cvfd/?onstoreid=40uti89763\n\nhxxps://555305[.]selcdn[.]ru\n\nhxxp://coffeeshop[.]store/janjijiwa\n\n### Additional Resources\n\n Acknowledgments\n\nThe author would like to thank Wei Wang for helping to guide the PhishingJS project from start to finish; Wayne Xin and Jingwei Fan\nfor helping to get the model into production; Brody Kutt for the original model architecture; and Seokkyung Chung, Yu Zhang, Zeyu\nYou and Ziqi Dong for helping to review the model detections.\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\n\n-----\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-10 - PhishingJS- A Deep Learning Model for JavaScript-Based Phishing Detection.pdf"
    ],
    "report_names": [
        "2021-09-10 - PhishingJS- A Deep Learning Model for JavaScript-Based Phishing Detection.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535625,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653706037,
    "ts_modification_date": 1653706037,
    "files": {
        "pdf": "https://archive.orkl.eu/e808b0da5089a63e518d4ac19a7309e420c0a8f3.pdf",
        "text": "https://archive.orkl.eu/e808b0da5089a63e518d4ac19a7309e420c0a8f3.txt",
        "img": "https://archive.orkl.eu/e808b0da5089a63e518d4ac19a7309e420c0a8f3.jpg"
    }
}