{
    "id": "e76ed6f2-3610-4a8c-b5fe-f1616c614c8f",
    "created_at": "2023-01-07T02:06:33.528489Z",
    "updated_at": "2025-03-27T02:17:00.405251Z",
    "deleted_at": null,
    "sha1_hash": "3d5cd57669dbf049fa1633aac72bb4fc1114a09d",
    "title": "Threat Horizons - July 2022",
    "authors": "Google's Cybersecurity Action Team (GCAT)",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1765061,
    "plain_text": "Threat Horizons\nCloud Threat Intelligence\nJuly 2022. Issue 3\n\nProviding Strategic Threat Intelligence to Those in the\nCloud\nGoogle’s Cybersecurity Action Team (GCAT) is pleased to publish another issue of our Threat\nHorizons Report. The report is based upon strategic risks, threat intelligence, and various\nsecurity observations from Google’s Threat Analysis Group (TAG), Trust & Safety, Cloud Threat\nIntelligence teams, and various other internal teams. The goal of this report is to provide\nsecurity leaders and other executives strategic, actionable information that enables\norganizations to better understand emerging risks and further secure their cloud environments\nagainst ever changing threats.\n\nSummary of Observations\nIn this issue, we provide an update on the evolution of cloud misconfiguration, cryptomining,\nand phishing. While these have been covered in previous reports, we will share our latest\nobservations on how attack methods have evolved over time.\nIt is often not enough to just understand how attackers are changing; it is just as important to\nunderstand what the most effective defense and mitigation strategies are. As such we will also\nshare a Cloud Security Checklist to help organizations establish a baseline for their Cloud\ndefenses. This checklist will be an ongoing series to provide operational guidance to better\nsecure your Cloud infrastructure. We will also go in-depth on a few actionable programs (such\nas Web Risk) organizations can implement to mitigate their risks.\n\nThreat Trends\n01\n\n02\n\n03\n\n04\n\nBeyond the 1st Click:\nEstablishing Trust in\nPhishing Attempts\n\nAn Update on Cyber\nActivities Related to the\nWar in Ukraine\n\nBrute Force and\nVulnerable Software\nAttacks Drive Continued\nDiligence in Cloud\n\nTrending Abuse Tactics\nAnd How To Defend\n\nDefensive Strategies\n05\n\n06\n\n07\n\n08\n\n09\n\nOpen Source\nSupply Chain\nSecurity\n\nCloud Security\nChecklist: When\nwas your last\ncheckup?\n\nZero Trust: Lessons\nand\nMisconceptions\n\nGoing Deeper:\nLogging\n\nReminders and\nRecommendations\n\nThreat Trends\n\n01 Beyond the 1st Click: Establishing Trust in Phishing\nAttempts\nIn the industry, phishing continues to be an area where bad actors adapt their techniques.\nWhile phishing is not a cloud-only threat, it can introduce vulnerabilities to cloud-hosted\napplications. For example, domains similar to a company’s cloud-hosted domains can be\npurchased by a threat actor to launch different phishing attacks. In previous Threat Horizons\nreports, we covered specific phishing campaigns that had been identified by Google’s Threat\nAnalysis Group. In this report, the latest trends show phishing emails are being designed to\nlook more benign and that bad actors are establishing trust by increasing seemingly legitimate\ninteractions with victims before compromise.\nSimilar Domains\nA resurgent trend we’re observing is the purchasing of similar-sounding or similar-spelled\ndomains by bad actors. Purchasing domains similar to a company’s domain (such as using a\ndifferent Top Level Domain suffix, i.e., “.us”, “.co”, or “.biz” instead of “.com”) continues to be a\npopular tactic along with “typo-squatting” where slightly misspelled domains are used. Many\norganizations do not own domains that are similar sounding or similarly spelled to their\norganization, nor do they keep track of similar domain names that have been purchased by\nbad actors. Attackers send phishing emails from the “same” domain, and host phishing web\npages that look identical to a company's website with the explicit goal of stealing sensitive\ndata.\nAn example of this was observed In March 2022, where Google’s Threat Analysis Group (TAG)\nobserved ancillary domains of various companies being purchased by threat actor Exotic Lily1.\nA dozen of these domains were identified to be very similar to current Workspace customers.\nExotic Lily used these ancillary domains to send phishing emails to other companies. It also\nsent malicious payloads to its victims using legitimate, well-known file hosting services to\nfurther limit suspicion by the victims.\nRelationship Building\nAnother common tactic that continues to be observed is when bad actors actively\nimpersonate legitimate sounding organizations (especially in journalism or education) with the\nobjective of interacting with the target in a trusted manner before launching an attack.\nTAG analyzed such trust-building activities by a threat actor called Kimsuky. Kimsuky has been\ntargeting North Korean experts with fake news interview requests. Their phishing campaigns\ntypically start as a non-malicious email impersonating a journalist, asking if the target would\nlike to comment on an article or participate in an interview. If the target agrees, they are\n\nemailed a link directing them to a site containing additional interview questions which also tries\ncapturing their credentials.\nRecommended Mitigations\nCustomers operating in Google Cloud or Workspace can continue to protect themselves\nagainst phishing threats through adopting a multi-layer approach:\n●\n\n●\n\n●\n●\n\n●\n\n●\n●\n\nCompanies should consider using a brand protection service, or purchasing domains\nancillary to their domain(s) themselves to prevent domain spoofing. Additionally,\nactive monitoring should be set up for domains that sound similar, are spelled similarly,\nand ccTLDs of company names for bad actors.\nCompanies may also consider using Google Cloud’s Web Risk service. Companies can\ncheck any impersonating sites against the Web Risk Evaluate API, which returns\nconfidence scores based on the maliciousness of webpages. In addition, urls can be\nsent to Google through the Submission API, which, after a Google review, will be added\ninto the Safe Browsing service if they fall under Safe Browsing policies. The offending\nsites will be blocked or trigger warnings on major Google products, including Google\nSearch, Android apps, Chrome, Gmail, and several other major browsers.\nCompanies should configure SPF, DKIM, and DMARC capabilities for their email to\nprevent email spoofing.\nTurn on free Advanced phishing and malware protections within Workspace. These\nprotections scan attachments and links in email bodies, protect against spoofing of\nemployee names, quarantine emails for further analysis, and offer other features.\nCustomers should consider enrolling in Google’s free Advanced Protection Program\n(APP). APP uses an even more rigorous version of Safe Browsing in Chrome to protect\nagainst malicious file downloads; permits only Google apps and verified third-party\napps to access a user’s Google Account data, and only with their permission; and offers\nother protections.\nIndividuals should always verify an outreach from a previously unknown contact\nthrough another trusted method (i.e. contacting the company directly to verify).\nCustomers may also use Google’s Work Safer (WS) program, which provides firms with\naccess to leading security for emails, meetings, files, and other assets. The security\nprovided includes zero-trust access for corporate resources; endpoint protection for\nBYOD or company-owned devices; and physical security keys to prevent account\ntakeover.\n\n02 An Update on Cyber Activities Related to the War in\nUkraine\nGoogle continues to partner closely with government and industry partners in response to the\nRussian invasion of Ukraine. During the course of the conflict, we have observed threat actors\ntargeting Ukrainian critical infrastructure entities including oil and gas, telecommunications\nand manufacturing.\nKey attack trends include DDoS, data destruction, and credential phishing. For DDoS, there has\nbeen a large uptick in DDoS as a service offerings which has enabled less sophisticated actors\nwith sufficient funds access to capabilities to disable large enterprise services. The observed\nservices utilize attack methods targeting layer 4 and layer 7. This situation is being closely\nmonitored in partnership with Google Cloud Armor and Google Safe Browsing teams.\nAdditionally, Google takes enforcement action against GCP resources that are not operating\nwithin Google Cloud’s Acceptable Use Policy.\nIn addition, please refer to this recent blog post by Google’s Threat Analysis Group for a deep\ndive on individual threat actors and IoCs related to the war in Ukraine.\nJournalists, media organizations, human rights entities, elections-related entities, and\ngovernment organizations impacted by the war in Ukraine should consider applying for\nGoogle’s free DDoS protection service - Project Shield. Project Shield has helped defend over\n180 Ukrainian websites that provide critical information like current news and evacuation\nresources from DDOS attacks.\n\n03 Brute Force and Vulnerable Software Attacks Drive\nContinued Diligence in Cloud\nAs covered in previous Threat Horizons reports, Google continues to observe in the cloud\nindustry overall that attackers are automatically scanning for and compromising misconfigured\nCloud resources. The primary goal for attackers in compromising Cloud resources has not\nchanged; cryptomining and ransomware continue to be the most common purposes of\ncompromise. In Threat Horizons Issue #1, we list out the most common actions after\ncompromise. While our focus in the previous issue was what the attacker does with\ncompromised instances, we are following up with an assessment of how attackers are getting\nin to install cryptominers, and our recommendations for mitigation.\n\nCommon Attack Vectors\nIn recent months (Q1 2022), one of the most common attack vectors used across cloud\nproviders was brute force of cloud services that are exposed to the internet and have a\nweak or default password. Due to the large number of public breaches in the past few years\nand the continued use of weak passwords in many organizations, bad actors are aggregating\nlogin information and launching brute-force logins against cloud admin accounts and\nprivileged users. Advances in automation and computing speed in recent years have led bad\nactors to be able to launch these brute-force attacks intelligently and at a significant scale.\nClose behind brute force attacks was the exploitation of vulnerable software. Beyond\nattackers exploiting vulnerable software, many organizations continue to struggle to patch and\nupdate their systems with the latest versions to protect themselves from compromise. With\nthe continued increase in industry-wide vulnerabilities such as Log4J coinciding with an\nincreasingly complex technology supply chain, known vulnerabilities which are not addressed\nin time will continue to be a common vector for compromise.\nZero-days continue to proliferate as new research emerges and technologies reveal latent\nrisks. Google’s Project Zero has recently published a report indicating the highest ever number\nof zero-day vulnerabilities reported in 2021. Despite the large increase in zero-days reported,\nGoogle has not observed significant wide-scale exploitation prior to patches being released.\nFinally, the third most common attack vector we’ve seen in cryptomining is the leveraging of\nstolen credentials which may have been inadvertently leaked to public code repositories. This\nis most often due to human error, where keys may be hardcoded into a code commit, or are\naccidentally leaked from a test environment. As more engineering teams work together via\n\npublicly-hosted code repositories, these human errors will continue to lead to additional\ncompromises.\nWeak firewall rules played a small role in cryptomining compromises, however it did act as a\ngateway to other common attack vectors such as brute force.\nShifts in Targets\nThere has been a distinct shift in ransomware targets post-initial compromise. Previously, the\nprimary focus was specific files or file systems in general. Attackers are now moving on from\nfile systems to databases where there may be a higher chance of hitting critical\ncorporate data. The most common technique observed was where attackers were seen brute\nforcing SQL databases, cloning a database table into a new table, encrypting the data, and\nproceeding to drop the original table. Attackers have been observed leaving instructions in the\nnew table that instruct the victim to transfer funds to a specified crypto wallet to recover their\ndata. Similar tactics have been seen around cloud project takeover, with threats to delete data\n& resources. These attacks were most commonly observed in developer and proof of concept\n(POC) instances. In many instances, these were targeted due to fewer security controls\nbeing placed in non-production environments due to their perceived lower risk.\nRecommended Mitigations\nWe see Google Cloud customers substantially mitigating these and other risks by adopting\nthese practices:\n●\n\n●\n\n●\n●\n\nImplement detective and preventive controls to ensure Cloud resources are not being\ninadvertently exposed to the internet. GCP’s Security Command Center provides a\nconsolidated view into overall security health/risk of your assets, as well as what is\ncurrently publicly accessible. Org policies can also be used to provide preventative\ncontrols.\nTo help detect and mitigate crypto mining, Google has added Virtual Machine Threat\nDetection (VMTD) to Security Command Center Premium. VMTD is a detection\ncapability that provides agentless memory scanning to help detect threats like\ncrypto mining malware inside your virtual machines running in Google Cloud. To\nget started with VMTD, open the Settings page in Security Command Center Premium.\nClick on “MANAGE SETTINGS'' under Virtual Machine Threat Detection. You can then\nselect a scope for VMTD. To confirm that VMTD is working for your environment, you\ncan download and execute a test binary that simulates cryptomining activity.\nEnable the detection of security keys to prevent improper storage of secrets like tokens\nand private keys. Consider using Secret manager to securely store secrets.\nSet up container and web security scanning to help detect insecure configurations and\nvulnerabilities to reduce the exploitable attack surface.\n\n04 Trending Abuse Tactics And How To Defend\nThere continues to be an increasing trend of cryptomining abuse across cloud providers and\non-prem environments, including a shift from typical Proof of Work (PoW) to other new forms\nof mining such as Proof of Capacity (PoC), Proof of Space and Time (PoST) and bandwidth\nbased miners. These trends directly mirror shifts in the crypto market as it continues to evolve.\n“Proof of” Overview\nThe most common type of cryptomining is based on a concept called “Proof of Work”. Proof\nof Work is where, in order to “mine” or derive the underlying value that a cryptocurrency is\nbased on (bitcoin, for example), a mathematical puzzle must be solved successfully in order to\nbe added to the blockchain. Solving this mathematical problem requires significant\ncomputational power, and is the basis for cryptocurrency mining, both legitimate and\nillegitimate. Most of the well known cryptocurrencies are based on Proof of Work.\nThe difference, at a high level, between Proof of Work, Proof of Capacity and Proof of Space\nand Time is how the “solve” for the problem is less compute-intensive and more based on\nvarious other factors, such as available hard drive capacity (Proof of Capacity), the\nunchanged capacity used to solve it over a period of time (Proof of Space and Time), or\navailable internet bandwidth. Many of these were designed with the legitimate use of reducing\nthe power consumption and environmental impact of traditional Proof of Work mining, but are\nused by bad actors during compromises to mine cryptocurrency from victims.\n\nObservations\nProof of Work (PoW)\nOver 85% of all cryptocurrency mining cases in the cloud are based on the Proof of Work\n(PoW) consensus mechanism resulting in high resource utilization often seen as a spike in CPU\nusage.\n\nProof of Capacity (PoC) / Proof of Space and Time (PoST)\nPoC requires storage to be allocated to the mining network, which can impact overall\navailability of cloud storage capacity.\nThe emergence of Proof of Space and Time (PoST) first started as early as June 2021. In both\ninstances of storage based mining, Google was able to rapidly deploy detections & mitigations.\nBandwidth based mining\nIn 2022, actors have attempted to commit cloud network resources to mine cryptocurrencies\nthat require network bandwidth.\nCryptocurrency mining impacts customer resource availability, spans from compute to\nstorage, and now bandwidth. This can consequently result in reduced performance or even\ndowntime if resources are exhausted as a result of a compromised instance used for mining.\nRecommended Mitigations\nWe see Google Cloud customers substantially mitigating these and other risks by adopting the\nfollowing practices:\n● Become familiar with how to handle and invalidate compromised credentials which is\noften the precursor to cryptocurrency mining.\n● Google Cloud’s Security Command Center (SCC) Premium includes Virtual Machine\nThreat Detection, which provides agentless runtime threat detection for cryptomining,\nas well as Event Threat Detection (ETD) which alerts when there are network detections\nindicative of mining activity.\n● Use the Cloud Monitoring functionality within Google Cloud's Operations suite to\ncollect metrics and alert based on resource consumption such as CPU, network, and\nstorage.\n● Set up budget and budget alerts within Billing to detect spikes in costs that are often an\nindicator of compromise.\n● Continue to stay updated on the latest crypto mining trends, as the crypto industry\ncontinues to shift away from computationally intensive resources to more readily\navailable resources which will lead to shifts in incidents and abuse.\n\nDefensive Strategies\nAs we evolve the Threat Horizons Report, we have received feedback that our Google Cloud\nCustomers want not only information on the latest threats, but recommendations and more\ninformation on how better to defend their environments. As such, we will be adding this\n“Defensive Strategies” section to further inform and remind customers and security\nprofessionals alike of best practices and recommendations.\n\n05 Open Source & Supply Chain Security\nA little over a year ago we published Know, Prevent, Fix, which laid out a framework for how the\nsoftware industry could address vulnerabilities in open source software and improve software\nsupply-chain security.\nThe landscape has changed greatly since then:\n● Prominent attacks and vulnerabilities in critical open source libraries such as Log4j,\nCodecov, and a 650% year-over-year increase in cyberattacks aimed at open source\nsuppliers made headline news, bringing a new level of awareness to the issue and\nunifying the industry to address the problem.\n● The US government formalized the push for higher security standards in the May\n2021 Executive Order on Cybersecurity. The release of the Secure Software Development\nFramework, a set of guidelines for national security standards on software development,\nsparked an industry-wide discussion about how to implement them.\n● Last August, technology leaders including Google, Apple, IBM, Microsoft, and Amazon\ninvested in improving cybersecurity — and Google alone pledged $10 billion over the\nnext five years to strengthen cybersecurity, including $100 million to support third-party\nfoundations, like OpenSSF, that manage open source security priorities and help fix\nvulnerabilities.\n\nThe figure above details the many stages of the software supply chain for an open source\ndependency. Organizations may approach this many different ways - some may build\npackages from source themselves, while others pull packages from repos that they trust.\nA few organizations including Google centralize control and actively secure each step of the\nend-to-end process. In our case, we start by maintaining separate secured copies of the\nsource code for our dependencies and perform our own vulnerability scanning. We\ncontinuously fuzz 550 of the most commonly-used open source projects, and as of January\n2022 have found more than 36,000 vulnerabilities. This makes us one of the largest\ncontributors to the OSV.\nGoogle manages an end-to-end build, deploy, and distribution process that includes\nintegrated integrity, provenance, and security checks. Based on our internal security practices,\nwe have created the SLSA framework to enable organizations to assess the maturity of their\nsoftware supply chain security and understand key steps to progress to the next level.\nWe recognize that most organizations do not have the resources or experience to construct\nand operate such a comprehensive program. Instead, their development teams might\nindividually decide where they get third-party source code and packages, how they are built,\nand how to redistribute them within their own organizations according to their goals, threat\nand risk model, and resources. However, the lack of an end-to-end process creates risk\nexposure each step of the way.\nThis month Google joined the Open Source Security Foundation (OpenSSF), Linux Foundation\nand industry leaders for a meeting to continue progressing the open source software security\ninitiatives discussed during January’s White House Summit on Open Source Security. During\nthis meeting, Google announced the creation of its new “Open Source Maintenance Crew” — a\ndedicated staff of Google engineers who will work closely with upstream maintainers on\nimproving the security of critical open source projects.\nIn addition, to help organizations Google will be introducing Google Cloud’s Assured Open\nSource Software service. Assured OSS allows enterprise and public sector users of open\nsource software to directly benefit from the in-depth, end-to-end security capabilities and\npractices we apply to our own OSS portfolio by providing access to the same OSS packages\nthat Google depends on. Users will also be able to submit packages from their own OSS\nportfolio to be secured and managed through the Google Cloud managed service.\nPackages curated by the Assured OSS service:\n● are regularly scanned, analyzed, and fuzz-tested for vulnerabilities\n● have corresponding enriched metadata incorporating Container/Artifact Analysis data\n● are built with Cloud Build including evidence of verifiable SLSA-compliance\n● are verifiably signed by Google\n● are distributed from an Artifact Registry secured and protected by Google\nAs a result, Assured OSS lets organizations benefit from Google’s extensive security\nexperience and can reduce their need to develop, maintain, and operate complex processes to\nsecure their open source dependencies. Assured OSS is expected to enter Preview in Q3 2022.\n\n06 Cloud Security Checklist: When was your last\ncheckup?\nOne of the most common questions Cloud customers ask us is “What should I be doing\noperationally, day to day, to address security risk?”\nWhile there are general strategies and recommendations that can address large enterprise\nrisks, it is often the smaller operational checks that can have the largest impact on the overall\ncloud risk of an organization.\nBelow we provide a short checklist of some operational Cloud defensive controls, strategies\nand considerations that will help security leaders and cloud teams more effectively address\nthe risks and attack trends. While not comprehensive, this list should provide ways of taking\nimmediate action to increase security posture.\nWhile we provide Google Cloud specific mitigations at the end of this section, these questions\nfor CISOs and security teams to consider are universal and are not specific to Google Cloud.\nThe Cloud Security Checklist will be an ongoing series in the Threat Horizons report, focusing\non often overlooked controls & methods of reducing risk.\n\nDoes your organization mandate the use of an enterprise-wide\nbrowser, and enforces a version standard?\nWhy do you ask?\n\nMany organizations do not enforce the use of one common\nenterprise-wide browser leading to insecure and risky browsing\nsessions by users\nThere has been a record number of browser-based vulnerabilities found\nin the past two years; outdated browsers pose a significant risk to\norganizations.\nGoogle’s Work Safer Program enables multi-layered defenses, including\nChrome Enterprise which offers\n○ Continuous and automatic updates\n○ Centralized policy management to reduce risk across endpoints\n○ Increased end-user warnings and safe browsing capabilities\n○ Mandatory patching & updates\n○ Protect your data with site isolation\n\nDoes your organization perform periodic recertification of critical\nadmin/legal/support/security contacts, and work with vendors &\nCSPs to ensure they’re accurately reflected in their systems?\nWhy do you ask?\n\nA common trend that has been observed is a lack of long term\nmaintenance around critical account contacts - ensuring that leavers are\npromptly replaced so that security alerts can be reviewed in a timely\nmanner.\n\nDoes your organization enforce strong access control policies?\nWhy do you ask?\n\nMany organizations do not consistently enforce strong access policies\nacross their devices and environments. This can lead to increased\nimpact during a compromise. Two-factor authentication and solutions\nsuch as Context Aware Access can significantly reduce the blast radius\nduring an attack.\n\nDo your security operations teams test triggering & receipt of\nalerts? Work with your vendors and CSP account teams if needed to\nrun synthetic tests to ensure critical notifications/alerts reach their\nintended audience.\nWhy do you ask?\n\nDuring an incident it is critical to have internal playbooks to define key\ndecision makers and points of contact.\nConduct tabletop drills (bi-anual to start) to ensure teams know who to\nreach out to and what the process for communication/escalation is. Is\nthere a number to call upon discovery of an incident? A console to\nsubmit a ticket to? An email DL that should be cc’d?\nAssure key stakeholders receive notifications in order to ensure\nimportant information from Google Cloud reaches the right people.\nGoogle provides monitoring & alerting functionality, such as the\ndetection of leaked credentials. Timely receipt and action of such alerts\nare crucial to minimizing potential impact.\n\nHave you recently reviewed your application/system/service\nlogging to ensure it is consistently and sufficiently enabled?\nWhy do you ask?\n\nWhen a security incident arises, the first place your Incident Response\nteam will want to look is at relevant log data. Ensuring both enablement\nand familiarity with log sources where critical services & data sit can\ndramatically reduce overall time to respond.\nHaving security champions embedded in your SWE teams can help\nreinforce consistent practices in both logging critical security events,\nand assuring that privacy of your data is protected by not over-logging\nsensitive fields (consider a DLP product to detect any sensitive data\nleaking into logs).\n\n07 Zero Trust: Foundational Lessons and\nMisconceptions\nAs more employees return to the office in 2022, securing a hybrid workforce that blends\nlessons from before and after the pandemic continues to be critical.\nAs the world eases back to work in the offices, organizations continue to allow employees to\nuse their own devices (BYOD) to access corporate resources. In addition, they are faced with\nthe challenge of allowing the extended workforce (3rd parties contractors, customer support\nagents, and others) to access corporate resources from non-corporate devices that are\nunmanaged. With the increase in complexity comes the need for access controls to be context\nand content aware, and for the securing of data not to be at the authentication layer but at the\nauthorization layer without adding friction.\nZero Trust (and BeyondCorp) models were created in response to the threats and attacks\nGoogle experienced directly. As part of our “Shared Fate” model, it has become critical to\nproviding our customers and partners with the lessons learned and tools to increase their\nsecurity via the Zero Trust model. Key zero trust principles of BeyondCorp include\n1.\n\nNo privileged networks – do not rely on the network location to be the primary factor\nto determine trust. This is the case for most VPN-based security models.\n2. Understand identities and devices – instead of relying on privileged networks,\nauthorization should be based on deep understanding of the user identities and the\ndevices they are using.\n3. Continuous authorization – instead of authorizing only once at login time, to the extent\npossible, continuously validate the context of the identities and devices for every\nrequest.\n\nAccess and data inventory: It’s 10pm, do you know who’s accessing your data?\nOne of the most common challenges organizations face (and Google faced during its\ntransition) is the importance of access models that consider data and device inventories. In\norder for Zero Trust to work, there must be a continuous authorization model that can\ndetermine who is authorized to access what data using which devices. This requires an\naccurate account of all users and devices that need to access an organization’s resources and\ndata, and also having a proper accounting of the location and sensitivities of your data and\nresources. Therefore creating an accurate inventory of data, users and devices is a critical\ncomponent of creating a Zero Trust Architecture.\n\nAs previously mentioned, having a deep understanding of the devices that are accessing\ncorporate resources is one of the key principles of zero trust. A common pitfall is that many\nassume that simply having an inventory of devices in a CMDB is sufficient to enable zero trust.\nCreating an accurate and authoritative device inventory is an iterative process. Organizations,\nespecially in this hybrid work environment, must also consider\n1.\n\nUnmanaged devices that are used by employees (BYOD) or the extended workforce\nmust also be accounted for. Traditional CMDBs typically only have company-owned\nassets.\n2. Device security postures must be collected continuously so access policies can be\nconstructed based on the contextual knowledge. Traditional access control policies are\nmostly network-based and do not consider device context.\n3. Device and user risks must be analyzed continuously so that access authorization can\nbe allowed or denied based on the latest information. Traditional solutions typically do\nnot take risk analysis into consideration for access control.\n\n08 Going Deeper: Log Generation, Collection, and\nManaging Costs\nLogging is an integral part of an organization’s security posture, particularly in regards to\ndetection and incident response. Logging failures were identified in the OWASP Top 10 for\n2021 among the most critical security risks. There are recent additional legal and regulatory\nrequirements such as Executive Order 14028 - sec 8 that compel government agencies to\nimplement standardized logging, and provide a roadmap for the private sector to follow.\nMany organizations understand the core ideas behind logging and enable logging for their\ncritical systems. However with a deeper look most would likely agree there are opportunities\nto improve the effective analysis and actionable nature of the logs they collect.\nTo address this gap and help your organization think of its logging strategy, this series,\nreleased over the next several issues, will cover the lifecycle of logging, monitoring, and\nalerting on GCP. Google Cloud’s Operation Suite integrates logging and monitoring for\nservices on GCP and beyond with the logging API. GCP’s Security Command Center provides\na centralized vulnerability and threat reporting service, which paired with logging will help\nstrengthen security. In this first installment, we’ll focus on log enablement highlighting log\ngeneration, collection, and how to manage costs.\nThe National Institute of Standards and Technology (NIST publication 800-92 sec 2.4) outlines\nkey practices organizations can follow to navigate challenges in log management:\n●\n●\n●\n●\n\nPrioritize log management appropriately throughout the organization.\nEstablish policies and procedures for log management.\nCreate and maintain a secure log management infrastructure.\nProvide adequate support for all staff with log management responsibilities.\n\nIn this issue, we focus on the following basic concepts: log entries, logs, and log types. Log\nentries record events and often include a timestamp, the monitored resource, the message,\nand the name of the log. Logs are a collection of log entries. Logging can be found in all layers\nof an organization's hierarchy such as at the resource, project, folder, and organization level.\nCentralizing these logs across your organization is not only critical to investigations, but will\nalso make it easier for you to monitor your Cloud environment.\n\nSome security logs are enabled by default on GCP and cannot be modified or disabled, while\nother logs require an organization to enable, configure, and fine tune. There are various types\nof logs on GCP and can be categorized as:\nGoogle Cloud platform logs\n\nUser-written logs\n\nVPC flow, Firewall rules, Cloud NAT gateways, and Load\nbalancer\n\nWritten to Cloud Logging using the logging agent, the\nCloud Logging API, or the Cloud.\n\nMore platform logs found in this table.\n\nSecurity logs\nAudit logs:\n● Admin Activity\n● Data Access\n● System Event\n● Policy Denied\n● Access Transparency logs\n\nMulti-cloud and hybrid-cloud logs\nSupports:\nMulti-cloud, ingesting logs from other cloud service\nproviders\nHybrid clouds,integrating your on-premise\ninfrastructure and apps.\n\nGCP’s Cloud Logging ingests audit logs and platform logs by default. Audit logs help answer\nthe question of \"Who did what, where, and when?\" Among the audit logs: Admin Activity,\nSystem Event, and Policy Denied audit logs are enabled by default and cannot be configured,\nor disabled. Data access logs are disabled by default due to high volumes and personally\nidentifiable information potentially being present in the logs, and require configuration. It is\nrecommended to explicitly enable VPC flow logs platform logs and to take the needed steps to\nenable Data Access Audit logs to aid your organization with forensics and real-time security\nanalysis.\nYou can collect telemetry from your Google Compute Engine instances by installing the Ops\nAgent. When operating a multi-cloud model, you can use the Cloud Logging agent to collect\ntelemetry from your Amazon Elastic Compute instances. These agents can be deployed at\nscale with automation tools such as Terraform, Ansible, Chef, Puppet, and Agent Policy using\nthe gcloud CLI.\nWhen creating custom application logs, use structured logging to significantly simplify\nsearching and querying for logs as this nested structure integrates with logging tools.\nAdditionally if you have embedded security champions within your organization, discuss\nopportunities with them to enrich your custom application logs to best serve your needs for\nmonitoring and response.\nIt is important to ensure that critical & actionable logs are prioritized to help ensure a balanced\nsignal-to-noise ratio and minimize costs around ingestion and storage. An example from\nGoogle’s SRE book Building Secure and Reliable Systems chapter 15: Investigating Systems\nnotes that firewalls routinely block many packets, many of which are harmless and may not be\nworth paying attention to. Over-enablement of such logs can not only unnecessarily increase\ncost but also make investigations more challenging by introducing noise along with alert\nfatigue for analysts.\nCloud Billing Reports allow you to filter on a project and the Cloud Logging service to see how\nmuch logging charges have been incurred and the metrics explorer in Cloud Monitoring will\nallow you to see the volume of logs ingested by your project. One method of reducing logging\ncosts includes using filters such as log exclusion filters or sampling flow logs\nIn summary, we discussed various logs that are available on the platform, strategies for\ncollecting relevant logs, and suggestions on how to manage your logging costs. In future\nreports we’ll cover other aspects of the logging, monitoring, and alerting lifecycle and how it\ncan be used to secure your organization.\n\n09 Reminders and Recommendations\nGoogle Cloud continues to operate with a “shared fate” model that exemplifies a true\npartnership with its customers. We will continue to provide our customers and the general\npublic with reminders of some of the best practices they can implement to secure their\nenvironments. Many of these recommendations are straightforward and have been covered in\nother whitepapers and industry publications in greater detail, but are good reminders\nnevertheless for everyone.\n\nThreat\n\nSpear-phishing\n\nRecommended Countermeasures\n●\n●\n●\n●\n●\n\nEngage in email best practices.\nEmploy 2-Step Verification.\nEnroll in the Advanced Protection Program..\nUse Google’s Work Safer and BeyondCorp Enterprise.\nDeploy Context-Aware Access.\n\n●\n\nFollow password best practices and best practices for\nconfiguring Cloud environments.\nUpdate third-party software prior to a Cloud instance\nbeing exposed to the web.\nAvoid publishing credentials in GitHub\nprojects.\nUse Container Analysis to perform vulnerability scanning\nand metadata storage.\nLeverage Web Security Scanner in the\nSecurity Command Center to identify\nsecurity vulnerabilities in App Engine,\nGoogle Kubernetes Engine, and Compute\nEngine.\nUse service accounts with Compute Engine to\nauthenticate apps instead of using user credentials.\nImplement Policy Intelligence tools to help understand\nand manage policies.\nUse predefined configurations through Assured\nWorkloads to reduce misconfigurations.\nSet up conditional alerts in the Cloud Console to send\nalerts upon high resource consumption.\nEnforce and monitor password requirements for users\nthrough the Google Admin console.\n\n●\n●\n●\n●\n\nCloud instance vulnerabilities\n●\n●\n●\n●\n●\n\n●\nDownloading software updates\n\n●\n\nEstablish a strong chain of custody by hashing, verifying\nand security testing software downloads.\nGoogle has also published the SLSA framework, which is\ncomplimented by the Software Bill Of Materials\n(SBOM)--both of which help organizations secure\n\ndifferent parts of the software supply chain.\n●\n\nEnsure sensitive credentials are not in source code\n\n●\n●\n●\n\nAudit projects published on GitHub and other sites to\nensure credentials and certificates were not included.\nNote that with Google’s current partnership with GitHub,\nrepositories are automatically scanned for secrets, and\ncustomer are notified if found.\nScan code as part of a CI/CD pipeline, or perform code\nreviews to look for hardcoded keys or other credentials.\nProvide more awareness to developers on proper use of\nsuch credentials during development.\nIf credentials are leaked, follow GCP best practices to\nrecover.\n\nFor additional information about Google’s Cybersecurity Action Team and best practices,\nplease visit gcat.google.com.\n\n1\n\nStolyarov, Vlad, and Benoit Sevens. Exposing initial access broker with ties to Conti. 17 March 2022.\nGoogle Threat Analysis Group [web blog],\nhttps://blog.google/threat-analysis-group/exposing-initial-access-broker-ties-conti/",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/blogs/gcat_threathorizons_full_july2022.pdf"
    ],
    "report_names": [
        "gcat_threathorizons_full_july2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4594f985-865e-4862-8047-2e80226e246a",
            "created_at": "2022-10-27T08:27:12.984825Z",
            "updated_at": "2025-03-27T02:00:55.424827Z",
            "deleted_at": null,
            "main_name": "EXOTIC LILY",
            "aliases": [
                "EXOTIC LILY"
            ],
            "source_name": "MITRE:EXOTIC LILY",
            "tools": [
                "Bazar"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "56384d06-abc2-4853-8440-db4d7b7d1b5f",
            "created_at": "2023-01-06T13:46:39.367122Z",
            "updated_at": "2025-03-27T02:00:03.064071Z",
            "deleted_at": null,
            "main_name": "EXOTIC LILY",
            "aliases": [
                "DEV-0413"
            ],
            "source_name": "MISPGALAXY:EXOTIC LILY",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673057193,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/3d5cd57669dbf049fa1633aac72bb4fc1114a09d.pdf",
        "text": "https://archive.orkl.eu/3d5cd57669dbf049fa1633aac72bb4fc1114a09d.txt",
        "img": "https://archive.orkl.eu/3d5cd57669dbf049fa1633aac72bb4fc1114a09d.jpg"
    }
}