{
    "id": "e78d19b2-b78b-4a96-974d-61481c1e6a7d",
    "created_at": "2023-01-12T15:05:10.269385Z",
    "updated_at": "2025-03-27T02:07:59.973864Z",
    "deleted_at": null,
    "sha1_hash": "40ec593493c32612175880f35e5098ed9d316064",
    "title": "2020-07-31 - MassLogger- An Emerging Spyware and Keylogger",
    "authors": "",
    "file_creation_date": "2022-05-27T23:22:05Z",
    "file_modification_date": "2022-05-27T23:22:05Z",
    "file_size": 694610,
    "plain_text": "# MassLogger: An Emerging Spyware and Keylogger\n\n**[seqrite.com/blog/masslogger-an-emerging-spyware-and-keylogger/](https://www.seqrite.com/blog/masslogger-an-emerging-spyware-and-keylogger/)**\n\nAniruddha Dolas July 31, 2020\n\n31 July 2020\nWritten by [Aniruddha Dolas](https://www.seqrite.com/blog/author/aniruddha/)\n\nEstimated reading time: 7 minutes\n\n## Summary:\n\nWe have been dealing with a new spyware for the past two months, named MassLogger.\nThis advanced keylogger and spyware are distributed via MalSpam attachments and has\nmore features than other present keylogger tools. It has been observed that this campaign is\nusing several different file types as malicious attachments as an initial infection vector. Also,\nthe dynamic behaviour of this camping is not constant across multiple samples. It comes with\nseveral functionalities like keylogger, Windows Defender exclusion, taking Screenshots,\nspreading via USB, clipboard stealing, VM detection, etc.\n\n**Technical Details:**\n\nHere are different file types used as spam attachments in this campaign:\n\nzip\nrar\ngz\n\n\n-----\n\n7z\nimg\niso\ndoc\narj\nxz\nace\ndocm\nz\nxlsm\ncab\n\nAfter looking at the above list, we can see two major categories of attachment— first is\narchive file and second is a document file. In the case of archive files, there is .NET\nmasslogger payload after extraction, while in the case of document file it contains VBA\nmacro and exploit which downloads masslogger payload from a remote server.\n\n## Polymorphic Process Chain:\n\nWe have seen different variants of dynamic behaviour across multiple samples in this\ncampaign. Below are snapshots of a few process chains:\n\n**Fig 1: Process Chain. Ref. https://app.any.run/**\n\n\n-----\n\n**Fig 2: Process Chain. Ref. https://app.any.run/**\n\n**Fig 3: Process Chain. Ref. https://app.any.run/**\n\n\n-----\n\n**Fig 4: Process Chain. Ref. https://app.any.run/**\n\n## Document analysis:\n\nIn some cases, threat actors have used office document file as initial infection vector with\nVBA macro and equation editor exploit. The following figure shows the extraction of Excel\ndocument having embedded OLE storage containing 2 VBScripts and 1 file of CVE-201711882 exploit and VBA Project stream containing VBA macros.\n\n**Fig 5: OLE Streams and Storages**\nThe following figure shows multiple OLE streams each containing different data.\n\n**Fig 6:**\n\n**Ole Embeddings**\nThe first stream oleObject1.bin is a VB script file contains renamer code and after which it\nexecutes VBS file using Wscript.\n\n\n-----\n\n**Fig 7: VBS Job**\nOleObject2.bin stream is also a VB script which is highly obfuscated and having code to\ndownload a payload from C2 server.\n\n**Fig 8: VBS downloader**\nThe excel sheet containing stack-based buffer overflow editor exploit of the equation editor\nrenames and executes VB Scripts using WinExec api (0x00430C12) post-exploitation.\n\n**Fig**\n\n**9: Shellcode**\n“1C00” is the header of Equation Editor, in the right side, the shellcode is present containing\ncmd.exe initially renames the VB script and passes it to Wscript to execute that VB Script.\nAfter overflow occurs, this whole data is passed to WinExec function which does the further\n[activity. For more info related to CVE-2017-1182 exploit, please refer our blog post.](https://blogs.quickheal.com/malspam-campaigns-exploiting-recent-ms-office-vulnerability-cve-2017-11882/)\n\nTo increase to chances of payload delivery, the attacker uses both exploit and VBA macros.\nWhen exploit fails on a patched system, another component, VBA macros are also present in\nthe document file. The similar VBS code is present in VBA macros and macro code has the\n\n\n-----\n\nresponsibility of dropping the VBS file in C:\\programdata\\ folder and execute it as VBS Job\nwhich does further similar activity as that of the Equation Native exploit.\n\n## Payload Analysis:\n\nThe payload is downloaded from different initial attack vectors as discussed above when it\nexecutes and goes in sleep for a few seconds. There is a lot of sleep code present in this\nbinary. There are a total of 4 components present with 2 layers of the packed file.\n\n## Stage 1 layer:\n\nIn the 1 layer, when it gets executed it has a simple code hidden in a Form() component.st\nThis code is responsible to extract a dll file from resource directory in present in reverse data\nin Base64 format which further gets resolved and dumps a dll with name AndroidStudio.dll.\n\n**Fig 10: Fetch data from resources**\nAndroidStudio.dll have a responsibility to decompress and decrypt a buffer which passes to\nit.\n\n\n-----\n\n**Fig 11: Android Studio code**\nGZip decompression method is used to decompress the buffer passed from the resource\ndirectory. This dll is used to dump another PE file which is responsible for further activity.\n\n## Stage 2 Layer: Lazarus.exe\n\nThe Lazarus.exe gets dumped which is highly obfuscated .NET file which is now unpacked\nfrom the parent file. We have decoded this file using de4dot tool successfully. In execution, it\ngoes in sleep for a few seconds, it checks if it’s own copy is present at “%appdata%”\nlocation. If not, it drops a self-copy at “%appdata%” location. After that, to stay persistent in\nthe system, it creates an entry in task scheduler. For this, it creates and drops a.XML config\nfile at “%temp%” location which is the input for creating task scheduler. The metadata for\nXML file is hardcoded and stored in PE resource. All data gets replaced at runtime.\n\n**Fig 12: Task Scheduler XML**\nThe name of starts with string “Update\\” followed by file name dropped at %appdata%\nlocation.\n\n\n-----\n\nFollowing command gets executed to add an entry in task scheduler.\n\n_“C:\\Windows\\System32\\schtasks.exe” /Create /TN “Updates\\<filename>” /XML “C:\\Users\\_\n_<username>\\AppData\\Local\\Temp\\tmp<USERID>.tmp”_\n\nNow time to move to the final payload which is MassloggerBin.exe. Using Process Hollowing\ntechnique, it injects code into its own process. Following image shows the use of the selfhollowing technique to do its further activity.\n\n**Fig 13: Process Hollowing**\nWhen it successfully writes and creates a new process, the parent process gets terminated\nand code injected process runs as an orphan. The code of this process is also highly\nobfuscated. All function and class names are modified to random/obfuscated string.\n\n## Stage 3 layer: MassLoggerBin.exe\n\nWith the start, it extracts a dll file having name “Ionic.Zip.Reduced.dll” from its resources.\nThe Ionic.Zip.Reduced.dll is a DotNetZip free fast class library used for manipulating zip files.\n[The code used by the attacker in Masslogger is available on this site. The main motive of](https://archive.codeplex.com/?p=DotNetZip)\nusing this dll is to create a zip file containing a compressed package of files like snapshots,\nkeyloggers, user info etc.\n\nThe internal config-based functionality is used by MassLogger to fetch the required\naccordingly which is then assigned to a specific variable.\n\nFollowing are the variables that fetch data stored in its internal config fig — by going to\nparticular offset is the first parameter and the config array from where data gets fetched is\nthe second parameter\n\n\n-----\n\n**Fig 14: Retrieves Config data**\n\n**Fig 15: Config Data**\nIt starts collecting system information like name of the system, Windows version, CPU, GPU,\nAV installed, Public IP which it gets from URL: “hxxp[:]//api[.]ipify[.]org”, also gets running\nprocess information.\n\n**Fig 16: Running Processes**\nMassLogger also stores a running process windows name in its log file.\n\n## MassLogger Functionality:\n\n\n-----\n\n**1. Application Data Stealer:**\n\nFollowing are some list of applications where it tries to steal user data and which further\nsends to its C2 server.\n\nBy checking data from hardcoded path stored in this binary, it checks for particular data and\ninstallation of these applications, if it does not find any details, it creates an entry in the\nfollowing format,\n\n_<|| Application-name ||>_\n\n_Not Installed_\n\nThe following modules are present in MassLogger binary. Following is the list of that:\n\n2. Windows Defender Exclusion\n\nIt has a module named as “WD Exclusion” which is a Windows Defender Exclusion. Using\ncommand “Add-MpPreference –ExclusionPath <path>“, it exclude it-self from Windows\nDefender Anti-Virus.\n\n**3. USB Spread**\n\n[Another module, USB Spread, it uses an open-source code of LimeUSB available on](https://github.com/NYAN-x-CAT/LimeUSB-Csharp/blob/master/LimeUSB-Csharp/Resources/Source.cs)\nGitHub. It is used to infect files stored on the USB drive. When files on USB gets executed, it\nexecutes its own code as well as infected code.\n\n\n-----\n\n**Fig**\n\n**17: USB Spread Module**\n**4. Keylogger and Clipboard**\n\nIt has a key log capture module, using “SetWindowHookEx” api it captures all keyboard keys\nand logs it.\n\n**Fig 18: Keyboard Hooking**\n**5. Anti VM**\n\nIt also has Anti-VM techniques by checking for Video_Controller adapter using WMI “Select *\n_from Win32_VideoController” which retrieves which information related to the graphics card._\nIf the process is executing on Virtual Box then it returns “Virtual Box Graphics Adapter”.\n\n\n-----\n\n**Fig 19: Video Adapter**\n**6. Search And Upload**\n\nAs per config file, it searches for some file which it wants to send to the C2 server that stores\nin “SearchAndUpload.zip” archive.\n\nAll data is stored and retrieved from its config file. Following is the view of MassLogger config\nfile.\n\n**Fig 20: Config File**\nOnce all data collection is done, it creates a log file containing all data like when Masslogger\nProcess is started and ended and other collected details. After that, it compresses using ZIP\nand gets stored at the location “C:\\Users\\<USERNAME>\\AppData\\Local”.\n\nFollowing is an image showing MassLogger log file.\n\n\n-----\n\nFig 21: MassLogger log file\n**Conclusion:**\n\nMasslogger is a highly configurable and modular keylogger and spyware. The author behind\nMasslogger tried to make it more sophisticated in features than other keyloggers, these\nfeatures make it hard to detect this advanced malware.\n\n**IoCs:**\n\n4A199C1BA7226165799095C2C2A90017 (XLSM)\n\nD1FFF0C0782D08ED17387297369797E0 (XLSM)\n\n31B65A54940B164D502754B09E3E9B63 (PE)\n\n37958546CB6DC41F505FDCB3430CEE3B (PE)\n\n**Subject Matter Experts:**\n\nAniruddha Dolas\n\nPawan Chaudhari\n\nAniruddha Dolas is part of the HIPS (Host-based Intrusion Prevention System) team in Quick\nHeal Security Labs. He has worked on various security vulnerabilities...\n\n[Articles by Aniruddha Dolas »](https://www.seqrite.com/blog/author/aniruddha/)\n\n### No Comments\n\n\n-----\n\nLeave a Reply.Your email address will not be published.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-31 - MassLogger- An Emerging Spyware and Keylogger.pdf"
    ],
    "report_names": [
        "2020-07-31 - MassLogger- An Emerging Spyware and Keylogger.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535910,
    "ts_updated_at": 1743041279,
    "ts_creation_date": 1653693725,
    "ts_modification_date": 1653693725,
    "files": {
        "pdf": "https://archive.orkl.eu/40ec593493c32612175880f35e5098ed9d316064.pdf",
        "text": "https://archive.orkl.eu/40ec593493c32612175880f35e5098ed9d316064.txt",
        "img": "https://archive.orkl.eu/40ec593493c32612175880f35e5098ed9d316064.jpg"
    }
}