{
    "id": "e82229dd-230d-459d-bebf-a6675c1f9072",
    "created_at": "2023-01-12T15:02:04.086253Z",
    "updated_at": "2025-03-27T02:06:09.536776Z",
    "deleted_at": null,
    "sha1_hash": "f7357fa6c4ae88ecda7c1bc7f559ac64849da59b",
    "title": "2019-04-09 - Say hello to Baldr, a new stealer on the market",
    "authors": "",
    "file_creation_date": "2022-05-28T04:57:28Z",
    "file_modification_date": "2022-05-28T04:57:28Z",
    "file_size": 2585298,
    "plain_text": "# Say hello to Baldr, a new stealer on the market\n\n**[blog.malwarebytes.com/threat-analysis/2019/04/say-hello-baldr-new-stealer-market/](https://blog.malwarebytes.com/threat-analysis/2019/04/say-hello-baldr-new-stealer-market/)**\n\nMalwarebytes Labs April 9, 2019\n\n_By_ _[William Tsing,](https://blog.malwarebytes.com/author/wtsing)_ _[Vasilios Hioureas, and](https://blog.malwarebytes.com/author/vhioureas)_ _[Jérôme Segura](https://blog.malwarebytes.com/author/jeromesegura)_\n\nOver the past few months, we have noticed increased activity and development of new\nstealers. Unlike many banking Trojans that wait for the victim to log into their bank’s website,\nstealers typically operate in grab-and-go mode. This means that upon infection, the malware\nwill collect all the data it needs and exfiltrate it right away. Because such stealers are often\nnon-resident (meaning they have no persistence mechanism) unless they are detected at the\ntime of the attack, victims will be none-the-wiser that they have been compromised.\n\nThis type of malware is popular among criminals and covers a greater surface than more\nspecialized bankers. On top of capturing browser history, stored passwords, and cookies,\nstealers will also look for files that may contain valuable data.\n\nIn this blog post, we will review the Baldr stealer which first appeared in underground forums\n[in January 2019, and was later seen in the wild by Microsoft in February.](https://twitter.com/WDSecurity/status/1099061949625597952)\n\n## Baldr on the market\n\nBaldr is likely the work of three threat actors: Agressor for distribution, Overdot for sales and\npromotion, and LordOdin for development. Appearing first in January, Baldr quickly\ngenerated many positive reviews on most of the popular clearnet Russian hacking forums.\n\n\n-----\n\nPreviously associated with the Arkei stealer (seen below), Overdot posts a majority of\nadvertisements across multiple message boards, provides customer service via Jabber, and\naddresses buyer complaints in the reputational system used by several boards.\n\nOf interest is a forums post referencing Overdot’s previous work with Arkei, where he claims\nthat the developers of both Baldr and Arkei are in contact and collaborate on occasion.\n\nUnlike most products posted on clearnet boards, Baldr has a reputation for reliability, and it\nalso offers relatively good communication with the team behind it.\n\nLordOdin, also known as BaldrOdin, has a significantly lower profile in conjunction with Baldr,\nbut will monitor and like posts surrounding it.\n\n\n-----\n\nHe primarily posts to differentiate Baldr from competitor products like Azorult, and vouches\nthat Baldr is not simply a reskin of Arkei:\n\nAgressor/Agri_MAN is the final player appearing in Baldr’s distribution:\n\nAgri_MAN has a history of selling traffic on Russian hacking forums dating back roughly to\n2011. In contrast to LordOdin and Overdot, he has a more checkered reputation, showing up\non a blacklist for chargebacks, as well as getting called out for using sock puppet accounts to\ngenerate good reviews.\n\nUsing the alternate account Agressor, he currently maintains an automated shop to generate\nBaldr builds at service-shop[.]ml. Interestingly, Overdot makes reference to an automated\ninstallation bot that is not connected to them, and is generating complaints from customers:\n\n\n-----\n\nThis may indicate Agressor is an affiliate and not directly associated with Baldr development.\nAt presstime, Overdot and LordOdin appear to be the primary threat actors managing Baldr.\n\n## Distribution\n\nIn our analysis of Baldr, we collected a few different versions, indicating that the malware has\nshort development cycles. The latest version analyzed for this post is version 2.2, announced\nMarch 20:\n\nWe captured Baldr via different distribution chains. One of the primary vectors is the use of\nTrojanized applications disguised as cracks or hack tools. For example, we saw a video\nposted to YouTube offering a program to generate free Bitcoins, but it was in fact the Baldr\nstealer in disguise.\n\n\n-----\n\nWe also caught Baldr via a drive-by campaign involving the Fallout exploit kit:\n\n## Technical analysis (Baldr 2.2)\n\nBaldr’s high level functionality is relatively straight forward, providing a small set of malicious\nabilities in the version of this analysis. There is nothing ground breaking as far as what it’s\ntrying to do on the user’s computer, however, where this threat differentiates itself is in its\nextremely complicated implementation of that logic.\n\nTypically, it is quite apparent when a malware is thrown together for a quick buck vs. when it\nis skillfully crafted for a long-running campaign. Baldr sits firmly in the latter category—it is\nnot the work of a script kiddie. Whether we are talking about its packer usage, payload code\nstructure, or even its backend C2 and distribution, it’s clear Baldr’s authors spent a lot of time\ndeveloping this particular threat.\n\n**Functionality overview**\n\nBaldr’s main functionality can be broken down into five steps, which are completed in\nchronological order.\n\n**Step 1: User profiling**\n\n\n-----\n\nBaldr starts off by gathering a list of user profiling data. Everything from the user account\nname to disk space and OS type is enumerated for exfiltration.\n\n**Step 2: Sensitive data exfiltration**\n\nNext, Baldr begins cycling through all files and folders within key locations of the victim\ncomputer. Specifically, it looks in the user AppData and temp folders for information related\nto sensitive data. Below is a list of key locations and application data it searches:\n```\nAppData\\Local\\Google\\Chrome\\User Data\\Default\nAppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data\nAppData\\Local\\Google\\Chrome\\User Data\\Default\\Cookies\nAppData\\Local\\Google\\Chrome\\User Data\\Default\\Web Data\nAppData\\Local\\Google\\Chrome\\User Data\\Default\\History\nAppData\\Roaming\\Exodus\\exodus.wallet\nAppData\\Roaming\\Ethereum\\keystore \nAppData\\Local\\ProtonVPN \nWallets\\Jaxx \nLiberty\\ \nNordVPN\\ \nTelegram \nJabber \nTotalCommander \nGhisler\n\n```\nMany of these data files range from simple sqlite databases to other types of custom\nformats. The authors have a detailed knowledge of these target formats, as only the key data\nfrom these files is extracted and loaded into a series of arrays. After all the targeted data has\nbeen parsed and prepared, the malware continues onto its next functionality set.\n\n**Step 3: ShotGun file grabbing**\n\nDOC, DOCX, LOG, and TXT files are the targets in this stage. Baldr begins in the\nDocuments and Desktop directories and recursively iterates all subdirectories. When it\ncomes across a file with any of the above extensions, it simply grabs the entire file’s\ncontents.\n\n**Step 4: ScreenCap**\n\nIn this last data-gathering step, Baldr gives the controller the option of grabbing a screenshot\nof the user’s computer.\n\n**Step 5: Network exfiltration**\n\nAfter all of this data has been loaded into organized and categorized arrays/lists, Baldr\nflattens the arrays and prepares them for sending through the network.\n\n\n-----\n\nOne interesting note is that there is no attempt to make the data transfer more\ninconspicuous. In our analysis machine, we purposely provided an extreme number of files\nfor Baldr to grab, wondering if the malware would slowly exfiltrate this large amount of data,\nor if it would just blast it back to the C2.\n\nThe result was one large and obvious network transfer. The malware does not have built-in\nfunctionality to remain resident on the victim’s machine. It has already harvested the data it\ndesires and does not care to re-infect the same machine. In addition, there is no spreading\nmechanism in the code, so in a corporate environment, each employee would need to be\nmanually targeted with a unique attempt.\n\n**Packer code level analysis**\n\nWe will begin with the payload obfuscation and packer usage. This version of Baldr starts off\nas an AutoIt script built into an exe. Using a freely available AIT decompiler, we got to the\nfirst stage of the packer below.\n\nAs you can see, this code is heavily obfuscated. The first two functions are the main\nworkhorse of that obfuscation. What is going on here is simply reordering of the provided\nstring, according to the indexes passed in as the second parameter. This, however, does not\npose much of a problem as we can easily extract the strings generated by simply modifying\nthis script to ConsoleWrite out the deobfuscated strings before returning:\n\n\n-----\n\nThe resulting strings extracted are below:\n\n\n-----\n\n```\nExecute\nBinaryToString\n@TempDir\n@SystemDir\n@SW_HIDE\n@StartupDir\n@ScriptDir\n@OSVersion\n@HomeDrive\n@CR\n@ComSpec\n@AutoItPID\n@AutoItExe\n@AppDataDir\nWinExists\nUBound\nStringReplace\nStringLen\nStringInStr\nSleep\nShellExecute\nRegWrite\nRandom\nProcessExists\nProcessClose\nIsAdmin\nFileWrite\nFileSetAttrib\nFileRead\nFileOpen\nFileExists\nFileDelete\nFileClose\nDriveGetDrive\nDllStructSetData\nDllStructGet\nDllStructGetData\nDllStructCreate\nDllCallAddress\nDllCall\nDirCreate\nBinaryLen\nTrayIconHide\n:Zone.Identifier\nkernel32.dll\nhandle\nCreateMutexW\nstruct*\nFindResourceW\nkernel32.dll\ndword\nSizeofResource\nkernel32.dll\nLoadResource\nkernel32.dll\n\n```\n\n-----\n\n```\nLockResource\nbyte[\nVirtualAlloc\nbyte shellcode [\n\n```\nIn addition to these obvious function calls, we also have a number of binary blobs which get\ndeobfuscated. We have included only a limited set of these strings as to not overload this\nanalysis with long sets of data.\n\nWe can see that it is pulling and decrypting a resource DLL from within the main executable,\nwhich will be loaded into memory. This makes sense after analyzing a previous version of\nBaldr that did not use AIT as its first stage. The prior versions of Baldr required a secondary\nfile named Dulciana. So, instead of using AIT, the previous versions used this file containing\nthe encrypted bytes of the same DLL we see here:\n\nMoving forward to stage two, all things essentially remain equal throughout all versions of the\nBaldr packer. We have the DLL loaded into memory, which creates a child process of the\nmain Baldr executable in a suspended state and proceeds to hollow this process, eventually\nreplacing it with the main .NET payload. This makes manually unpacking with ollyDbg nice\nbecause after we break on child Baldr.exe load, we can step through the remaining code of\nthe parent, which writes to process memory and eventually calls ResumeThread().\n\n\n-----\n\nAs you can see, once the child process is loaded, the functions that it has set up to call\ncontain VirtualAlloc, WriteProcessMemory, and ResumeThread, which gives us an idea what\nto look out for. If we dump this written memory right before resume thread is called, we can\nthen easily extract the main payload.\n\n[Our colleague @hasherezade has made this step-by-step video of unpacking Baldr:](https://twitter.com/hasherezade)\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/E2V4kB_gtcQ\n\n**Payload code analysis**\n\nNow that we have unpacked the payload, we can see the actual malicious functionality.\nHowever, this is where our troubles began. For the most part, malware written in any\ninterpreted language is a relief for a reverse engineer as far as ease of analysis goes. Baldr,\non the other hand, managed to make the debugging and analysis of its source code a\ndifficult task, despite being written in C#.\n\n\n-----\n\nThe code base of this malware is not straight forward. All functionality is heavily abstracted,\nencapsulated in wrapper functions, and utilizes a ton of utility classes. Going through this\ncode base of around 80 separate classes and modules, it is not easy to see where the key\nfunctionality lies. Multiple static passes over the code base are necessary to begin making\nsense of it all. Add in the fact that the function names have been mangled and junk\ninstructions are inserted throughout the code, and the next step would be to start debugging\nthe exe with DnSpy.\n\nNow we get to our next problem: threads. Every minute action that this malware performs is\nexecuted through a separate thread. This was obviously done to complicate the life of the\nanalyst. It would be accurate to say that there are over 100 unique functions being called\ninside of threads throughout the code base. This does not include the threads being called\nrecursively, which could become thousands.\n\n\n-----\n\nLuckily, we can view local data as it is being written, and eventually we are able to locate the\nkey sections of code:\n\n\n-----\n\nThe function pictured above gathers the user’s profile, as mentioned previously. This\nincludes the CPU type, computer name, user accounts, and OS.\n\nAfter the entire process is complete, it flattens the arrays storing this data, resulting in a\nstring like this:\n\n\n-----\n\nThe next section of code shows one of the many enumerator classes used to cycle\ndirectories, looking for application data, such as stored user accounts, which we purposely\nsaved for testing.\n\n\n-----\n\nThe data retrieved was saved into lists in the format below:\n\nIn the final stage of data collection, we have the threads below, which cycle the key\ndirectories looking for txt and doc files. It will save the filename of each txt or doc it finds, and\nstore the file’s contents in various arrays.\n\n\n-----\n\nFinally, before we proceed to the network segment of the malware, we have the code section\nperforming the screen captures:\n\n\n-----\n\n**Class 2d10104b function 1b0b685() is one of the main modules that branches out to do the**\nmajority of the functionality, such as looping through directories. Once all data has been\ngathered, the threads converge and the remaining lines of code continue single threaded. It\nis then that the network calls begin and all the data is sent back to the C2.\n\nThe zipped data is encrypted via XOR with a 4 byte key and version number obtained from\ncontacting the C2 via a first network request. The second request sends the cyphered data\nback to the C2.\n\n## Panel\n\nLike other stealers, Baldr comes with a panel that allows the customers (criminals that buy\nthe product) to see high-level stats, as well as retrieve the stolen information. Below is a\npanel login page:\n\n\n-----\n\nAnd here, in a screenshot posted by the threat actor on a forum, we see the inside of the\npanel:\n\n## Final analysis\n\nBaldr is a solid stealer that is being distributed in the wild. Its author and distributor are active\nin various forums to promote and defend their product against critics. During a short time\nspan of only a few months, Baldr has gone through many versions, suggesting that its author\n\n\n-----\n\nis fixing bugs and interested in developing new features.\n\nBaldr will have to compete against other stealers and differentiate itself. However, the\ndemand for such products is high, so we can expect to see many distributors use it as part of\nseveral campaigns.\n\nMalwarebytes users are protected against this threat, detected as Spyware.Baldr.\n\n_Thanks to_ _[S!Ri for additional contributions.](https://twitter.com/siri_urz)_\n\n## Indicators of compromise\n\nBaldr samples\n```\n5464be2fd1862f850bdb9fc5536eceafb60c49835dd112e0cd91dabef0ffcec5 -> version 1.2\n1cd5f152cde33906c0be3b02a88b1d5133af3c7791bcde8f33eefed3199083a6 -> version 2.0\n7b88d4ce3610e264648741c76101cb80fe1e5e0377ea0ee62d8eb3d0c2decb92 > version 2.2\n8756ad881ad157b34bce011cc5d281f85d5195da1ed3443fa0a802b57de9962f (2.2 unpacked)\n\n```\nNetwork traces\n```\nhwid=\n{redacted}&os=Windows%207%20x64&file=0&cookie=0&pswd=0&credit=0&autofill=0&wallets=0&i\nhwid=\n{redacted}&os=Windows%207%20x64&file=0&cookie=0&pswd=0&credit=0&autofill=0&wallets=0&i\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-09 - Say hello to Baldr, a new stealer on the market.pdf"
    ],
    "report_names": [
        "2019-04-09 - Say hello to Baldr, a new stealer on the market.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535724,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653713848,
    "ts_modification_date": 1653713848,
    "files": {
        "pdf": "https://archive.orkl.eu/f7357fa6c4ae88ecda7c1bc7f559ac64849da59b.pdf",
        "text": "https://archive.orkl.eu/f7357fa6c4ae88ecda7c1bc7f559ac64849da59b.txt",
        "img": "https://archive.orkl.eu/f7357fa6c4ae88ecda7c1bc7f559ac64849da59b.jpg"
    }
}