{
    "id": "e83030cc-f669-43e9-9d8f-ac5d99c7d27d",
    "created_at": "2023-01-12T15:00:48.800249Z",
    "updated_at": "2025-03-27T02:16:25.676143Z",
    "deleted_at": null,
    "sha1_hash": "b11f79f4e67f2ea496d63d5614a8927235f1b2ba",
    "title": "2021-09-29 - Evaluating the Value of Security Intelligence Feeds with Silent Push",
    "authors": "",
    "file_creation_date": "2022-07-18T18:23:30Z",
    "file_modification_date": "2022-07-18T18:23:30Z",
    "file_size": 658520,
    "plain_text": "# Evaluating the Value of Security Intelligence Feeds with Silent Push\n\n**[silentpush.com/blog/evaluating-the-value-of-security-feeds-with-silent-push](https://www.silentpush.com/blog/evaluating-the-value-of-security-feeds-with-silent-push)**\n\nSeptember 29, 2021\n\nSep 29\nWritten By [Seth Hamlin](http://10.10.0.46/blog?author=60b8ed5420b2d07bb7437271)\n\nThe value of cyber security, threat intelligence feeds can’t be overstated. However, like all\nsecurity measures, not all cyber threat intelligence feeds are created equal. So what are\nsome of the differences between a good and a great security feed?\n\nThere are of course a variety of factors that play into the value of any particular security\nfeed. Some common considerations are relevancy and usability.\n\n## Unmeasurable Factors in Cyber Threat Intelligence Feeds\n\nGenerally speaking, a security feed that provides highly relevant data is providing data that\nis closely related to the target business or organization. Nowadays, many threats are\ntargeted at specific businesses, which makes relevancy a critical factor in evaluating\n\n\n-----\n\nfeeds.\n\nUsability refers to how likely it is that information supplied by the security feed can lead to\ndecisions that improve security. One of the end goals of a security feed is to allow for\ndecisions that improve security policy making. If feed items only contain domains, IPs or\nhashes without any reasoning or clues as to why they are there, then they are not so useful.\nEach item needs to come with clues as to why it is suspicious and some information about\nhow the feed is compiled in the first place so you know what you are looking at. Most\nimportantly, this context will help you know how to use the information.\n\nThese factors are rare enough. One of the problems is, any given company may pay for a\nlarge number of security feeds. These feeds are quite expensive and may supply data that\nis repetitive. In the worst cases, one feed may simply be copying another. However, security\nfeed analysts at the company may never know.\n\nExpanding upon that, it’s also helpful to know which feeds are the first to share any\npotentially useful information. If we have five security feeds that all detected the same\npotential risk, we want to know which detected it first and which last. In this way, one can\nidentify which feeds are the most valuable and which could be cut.\n\n## Evaluating Cyber Threat Intelligence Feeds with Silent Push\n\nSilent Push provides two unique metrics to address the above issues to identify the best\ncyber threat intelligence feeds.\n\nOne of these metrics is called overlapping percentage. This refers to the proportion of\nindicators (IoCs) on that feed that are also seen on other feeds. Of course, a feed that\nprovides unique data, data that isn’t seen on other feeds, can provide valuable insights.\n\nAnother percentage-based metric is originality percentage. Originality percentage means\nthe proportion of indicators on any particular feed which were first shared by that feed. A\nfeed that provides a large amount of original intelligence is a valuable asset to a business or\norganization.\n\nTo determine the value of a CTI feed against another, or many others, these two metrics are\nquite useful. Relevancy and usability are more closely connected to the information within a\nsingular feed. But if a company is paying for many feeds, it’s possible that all of them can\nscore high on relevancy and usability.\n\nBy employing these two additional metrics, unique to Silent Push, companies can save\nmoney and time by easily determining which feeds are the most valuable.\n\n\n-----\n\nValue can translate into more than just spending less on repetitious security feeds. By\nidentifying which feeds supply the best information the fastest, it may also be possible to\nreact to targeted threats before they cause any damage. The concept of proactive threat\ndetection, rather than reactive, is core to the Silent Push mission.\n\n[There’s an interesting paper here on ways on how some academics evaluated security](https://www.researchgate.net/publication/341385656_Quality_Evaluation_of_Cyber_Threat_Intelligence_Feeds)\nintelligence feeds and some of their results.\n\n[Seth Hamlin](http://10.10.0.46/blog?author=60b8ed5420b2d07bb7437271)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-29 - Evaluating the Value of Security Intelligence Feeds with Silent Push.pdf"
    ],
    "report_names": [
        "2021-09-29 - Evaluating the Value of Security Intelligence Feeds with Silent Push.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535648,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1658168610,
    "ts_modification_date": 1658168610,
    "files": {
        "pdf": "https://archive.orkl.eu/b11f79f4e67f2ea496d63d5614a8927235f1b2ba.pdf",
        "text": "https://archive.orkl.eu/b11f79f4e67f2ea496d63d5614a8927235f1b2ba.txt",
        "img": "https://archive.orkl.eu/b11f79f4e67f2ea496d63d5614a8927235f1b2ba.jpg"
    }
}