{
    "id": "e843f0e2-a4ee-43c1-ba26-e4482dbd96a1",
    "created_at": "2023-01-12T15:06:43.416739Z",
    "updated_at": "2025-03-27T02:05:37.958151Z",
    "deleted_at": null,
    "sha1_hash": "dd26f621b214879d955be6d349746ab81ff2e343",
    "title": "2019-07-10 - How We Seized 15 Active Ransomware Campaigns Targeting Linux File Storage Servers",
    "authors": "",
    "file_creation_date": "2022-05-28T19:04:58Z",
    "file_modification_date": "2022-05-28T19:04:58Z",
    "file_size": 3664412,
    "plain_text": "# How We Seized 15 Active Ransomware Campaigns Targeting Linux File Storage Servers\n\n**[intezer.com/blog-seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/](https://www.intezer.com/blog-seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/)**\n\nWritten by Ignacio Sanmillan - 10 July 2019\n\n## Get Free Account\n\nJoin Now\n\n## Top Blogs\n\n**[How to Write YARA Rules That Minimize False Positives](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)**\n\n\nJuly 10, 2019\n\n\nGenerate Advanced YARA Rules Based on Code Reuse Incorporating YARA into daily\nsecurity operations can... [Read more](https://www.intezer.com/blog/threat-hunting/yara-rules-minimize-false-positives/)\n\n**[Top Cyber Threats to the Manufacturing Sector](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)**\n\nManufacturers are building automated workflows for alert triage, incident response, and\nthreat hunting to meet... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)\n\n**[New Conversation Hijacking Campaign Delivering IcedID](https://www.intezer.com/blog/research/conversation-hijacking-campaign-delivering-icedid/)**\n\n\n-----\n\nThis post describes the technical analysis of a new campaign detected by Intezer s\nresearch team,... [Read more](https://www.intezer.com/blog/research/conversation-hijacking-campaign-delivering-icedid/)\n\n**Introduction**\n\nIt is rare to see ransomware being used to target the Linux operating system. However,\ncyber criminals seem to adapt to this emerging environment and use a variety of creative\nmethods to gain profits from this landscape.\n\nWe at Intezer have detected and temporarily DoS’d the operation ofa ransomware\ntargeting Linux-based file storage systems (NAS servers).\n\nWe have named the ransomware QNAPCrypt, as this is the name the authors have\nappeared to label the malware. QNAP is a well-known vendor for selling NAS servers,\nwhich the malware was intended to infect and encrypt the containing files for ransom. NAS\nservers normally store large amounts of important data and files, which make them a\nvaluable target for attackers and especially a viable target for ransomware campaigns.\n\nThis malware currently has very low detection rates in all major security solutions.\n\nThe first two sections of this blog post will explain in brief how QNAPCrypt operates and\nhow we were able to take advantage of two design flaws in the ransomware infrastructure in\norder to temporarily stop the campaign—preventing the malware from infecting additional\nvictims and forcing the authors behind this malware to deploy new instances. Lastly, we will\npresent a detailed technical analysis of the malware and the investigation of the entire\ncampaign.\n\nFor reference, here is the genetic analysis of the QNAPCrypt malware:\n\n**[ARM variant](https://analyze.intezer.com/#/files/3d7ebe73319a3435293838296fbb86c2e920fd0ccc9169285cc2c4d7fa3f120d)**\n**[x86 variant](https://analyze.intezer.com/#/files/076a6fa4e051c061e19b9e3e37da9c63a9bc7c1a99111ac13b32eb2f70b7fa5c)**\n\n**How the Ransomware Works**\n\nThe QNAPCrypt ransomware works similarly to other ransomware, including encrypting all\nfiles and delivering a ransom note. However, there are several important differences:\n\n\n-----\n\n1. The ransom note was included solely as a text file, without any message on the screen—\nnaturally, because it is a server and not an endpoint.\n\n2. Every victim is provided with a different, unique Bitcoin wallet—this could help the\nattackers avoid being traced.\n\n3. Once a victim is compromised, the malware requests a wallet address and a public RSA\nkey from the command and control server (C&C) before file encryption.\n\n**How We Seized the Campaign**\n\nIn order to further research the malware and its operation, we wrote a script to simulate\ninfections on a wide scale to see how the wallet generation mechanism worked in the\nattackers’ back end.\n\nAfter simulating the infections of hundreds of virtual “victims”, we discovered two major\ndesign flaws in the ransomware infrastructure which led us to seize the operation:\n\n1. The list of bitcoin wallets was created in advance and it was static. Therefore, it does not\ncreate a new wallet for each new victim in real time, but rather it pulls a wallet address from\na fixed, predetermined list.\n\n\n-----\n\n2. Once all of the wallets are allocated (or sent), the ransomware would not be able to\ncontinue its malicious operation in the victim’s machine.\n\nAfter simulating the infection of more than 1,091 victims from 15 different campaigns, we\nencountered that the attackers ran out of unique Bitcoin wallets to supply to their victims. As\na result, any future infection will be unsuccessful and the authors behind this malware were\nforced to update their implants in order to circumvent this design flaw in their infrastructure\nto continue with their malicious operations.\n\nAfter several days of continuously DoS’ing their infrastructure, we have observed a newer\n[variant in the wild that shares a significant amount of code with previous QNAPCrypt](https://analyze.intezer.com/#/files/076a6fa4e051c061e19b9e3e37da9c63a9bc7c1a99111ac13b32eb2f70b7fa5c)\ninstances and Linux.Rex. This time, the newer variant uses an embedded static wallet and\nRSA public key in contrast to previous instances.\n\n**Technical Analysis**\n\nThe initial implant we found came in the form of a statically linked Golang binary built with\nthe Go linker for ARM architecture. Throughout our research, we were able to confirm that\nother variants exist for additional architectures such as x86 / x64.\n\nGo binaries may seem difficult to analyze when they come stripped, since trying to make\nsense of stripped statically linked binaries is usually a more difficult task than analyzing\nstripped dynamically linked binaries.\n\nWe can observe that this binary is indeed a Go executable by looking at the section names\nin its section header table.\n\n\n-----\n\nIf we know the location of these sections, in particular the .gopclntab section, we will be\nable to reconstruct symbol names and offsets. This methodology is illustrated in the\nfollowing diagram:\n\nFor further insights into populating function names in Go binaries we highly recommend to\n[view Tim Strazzere’s presentation and scripts in GitHub which document this technique.](https://github.com/strazzere/golang_loader_assist)\n\nAfter retrieving Go function names, analyzing the binary becomes much less complex since\nwe can highlight the relevant functions of the application. Let’s not forget that the binary is\n4MB in size.\n\n\n-----\n\nAfter several cryptography algorithm initializations and parsing of arguments for directory\nwhitelisting and alike functionalities, the malware will send a GET request to the CNC as a\nmeans to communicate that a new victim has been compromised and that system locking is\ntaking place:\n\nAfter sending this GET request, the malware will attempt to retrieve victim keys\nconfiguration using a client for the SOCKS proxy protocol version 5.\n\nThis proxy will request to connect to an onion domain name. The following represents the\nrelevant packets for this connection:\n\nAfter successful connection through the proxy to the onion domain, an additional GET\nrequest to the ransomware REST API is completed in order to retrieve the RSA public key\nthat will be used to encrypt the file system—a unique Bitcoin wallet and the ransom note\nspecific to the victim. All of these artifacts seem to be retrieved based on a specific\ncampaign ID.\n\n\n-----\n\nThe response from the server is the following:\n\nAfter victim configuration has been retrieved, the malware will proceed to remove itself and\nthen it will parse the retrieved RSA public key.\n\n\n-----\n\nThis RSA public key will be used to encrypt a random sequence of bytes that would be\nused to encrypt the file system later on. This encrypted key will be base64 encoded and it\nwill be written at the end of the ransom note file called README_FOR_DECRYPT.txt. We\nalso noted that the ransomware distributes a different Bitcoin wallet per each compromised\nsystem:\n\nAfter this file is created, the malware will proceed to execute the locking mechanism by\nwalking the file system encrypting files using AES CFB with the derived encrypted key,\navoiding to encrypt the ransom note just created:\n\n\n-----\n\nThe malware will target files with the following extensions:\n\nAfter encryption, the malware will rename the affected files so that they will be prefixed with\n‘.encrypt’:\n\nIn order for system decryption to take place the base64 encoded random sequence\nencrypted with the RSA public key will be needed to be sent to the ransomware operator via\nthe onion domain site after paying the demanded ransom:\n\n\n-----\n\nAfter system locking has taken place, the ransomware will communicate that it has finished\nwith the victim once again to the CNC:\n\n**Looking Outside of the Binary**\n\nOne of our intended goals that we wanted to achieve when analyzing QNAPCrypt was to\nassess the scale of victims the ransomware was dealing with.\n\n[We were able to find a Reddit thread in which we contacted some of the affected victims:](https://www.reddit.com/r/linux/comments/bucepu/linux_ransomware/)\n\n\n-----\n\nWhile talking to some of the victims related to the various campaigns of this malware, we\nwere able to identify the initial attack vector as SSH brute force attacks and that they were\ntargeting mainly NAS server providers, which corresponds to how the attacker has chosen\nto label this malware:\n\n\n-----\n\nAfter making these findings we studied their infrastructure to determine if there was\nanything we could do to interact with this threat actor’s operations.\n\nWhile researching the ARM instance of the malware, we observed that there was a request\nthrough their REST API in order to retrieve new victim configuration keys as previously\ndiscussed. The following diagram is a high level overview of the ransomware operation:\n\nThe connection to the SOCKS5 proxy is completed without any authentication enforced,\nand anyone would have the capability to connect to it.\n\nTherefore, we decided to interact with the ransomware infrastructure in order to retrieve\nconfiguration keys and potentially temporarily shut down the operation of the ransomware to\nprevent infection of future victims that were compromised by instances of the ransomware\nthat followed the previous design architecture:\n\nThis idea simply abuses the fact that no authentication is enforced to connect to the\nSOCKS5 proxy as previously mentioned. Since the authors behind this ransomware were\ndelivering one Bitcoin wallet per victim from a static pool of already generated wallets, we\ncould replicate the infection packets to retrieve all of the wallets until they had no further\nwallets under their control. Therefore, when a genuine infection would occur, the ransom\nclient would not be able to retrieve configuration artifacts.\n\nWe wrote the following script in order to implement the methodology described above:\n\n\n-----\n\n```\nimport socket\nimport hexdump\nimport json\nimport sys\nHOST = '192.99.206.61' \nPORT = 65000    \nfor i in range(15):\n  BTC_WALLETS = list()\n  while True:\n    s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)\n    s.connect((HOST, PORT))\n    s.send(b'\\x05\\x01\\x00')\n    data = s.recv(1024)\n    hexdump.hexdump(data)\n    s.send(b'\\x05\\x01\\x00\\x03\\x16' + b'sg3dwqfpnr4sl5hh.onion\\x00' + b'\\x50')\n    data = s.recv(1024)\n    hexdump.hexdump(data)\n    s.send(b'GET /api/GetAvailKeysByCampId/%.2d HTTP/1.1\\x0d\\x0a' % i +\n        b'Host: sg3dwqfpnr4sl5hh.onion\\x0d\\x0a' +\n        b'User-Agent: http/2\\x0d\\x0a' +\n        b'Accept-Encoding: gzip\\x0a\\x0d\\x0a')\n    data = s.recv(1024)\n    print '[+] Campaign id %.2d' % i\n    hexdump.hexdump(data)\n    try:\n      data = json.loads(data[data.find('{'):])\n      print data['BtcPublicKey']\n      s.close()\n      if data['BtcPublicKey'] not in BTC_WALLETS:\n        BTC_WALLETS.append(data['BtcPublicKey'])\n      else:\n        sys.exit()\n    except ValueError as e:\n      print \"[+] CAMPAIN HAS NO WALLETS LEFT\"\n      with open(\"wallets_%0d.txt\" % i, 'w+') as fd:\n        for wallet in BTC_WALLETS:\n          fd.write(wallet+'\\n')\n      break\n\n```\nWe were able to collect a total of 1,091 unique wallets meant to be delivered to new victims\ndistributed among 15 different campaigns.\n\n\n-----\n\nFurthermore, by depleting the attacker s stored Bitcoin wallets we were able to stop this\nmalware from infecting new victims temporarily, since if there is a failure to parse the RSA\npublic key the client will just exit:\n\nThe following screenshot shows the packets that the onion domain will retrieve after the\nentire static Bitcoin wallet pool was depleted:\n\nThe HTTP request returns a 200 but with a content length of 0, therefore failing to retrieve\nconfiguration, and thus the ransomware client stops execution. This implies that we were\nable to identify an easy method to prevent further infections of this ransomware by\nconstantly depleting its static bitcoin wallet pool.\n\n**Attribution and Attackers Reaction**\n\nAfter several days of continuously DoS’ing QNAPCrypt clients, we encountered another\nQNAPCrypt sample—but this time targeting x86 systems.\n\n\n-----\n\nBased on Genetic Malware Analysis, we observed that this specific implant reused a large\nportion of code with old instances of x86 Linux.Rex builds. Linux.Rex is known for\n[deploying exploits against Drupal servers in 2016, in order to conduct ransomware and](http://news.softpedia.com/news/crooks-used-sql-injections-to-hack-drupal-sites-and-install-web-ransomware-504300.shtml)\nDDoS operations.\n\nThe following represents some of the code similarities between Linux.Rex and newer\nQNAPCrypt variants:\n\n\n-----\n\nAlthough both implants implement different functionality, it is noticeable that both were\nwritten in a similar manner.\n\nFurthermore, we can observe similarities with the ARM instance of QNAPCrypt but with a\nmajor difference—the RSA public key, Bitcoin wallet and ransom note are hardcoded in the\nbinary:\n\n\n-----\n\nWe can also see that the hardcoded onion domain is exactly the same as in the ARM\nvariant, and the site design to pay the ransom is also the same, although the demanded\nransom in Bitcoin seems to be lower than in previous variants:\n\nWe interpret the discovery of these newer instances with hardcoded configuration to be a\nresponse from the threat actors behind this campaign to attempt to circumvent the DoS that\ntheir non connectionless instances were suffering. This implied that they were forced to\nchange their implants and to centralize their bitcoin wallets, making the tracking of their\nincome via their ransomware campaigns more convenient.\n\n**Conclusion**\n\nWe have covered the operation of the QNAPCrypt ransomware, and how we were able to\nfind design flaws to prevent the malware from running in newer victims’ machines and\nforcing the attackers behind the malware to update their implants in order to circumvent\nthese flaws.\n\n\n-----\n\nAdditionally, Golang malware seems to be on the rise, since it appears to be a very\nconvenient language to create cross-platform malware.\n\nFurthermore, we have discussed how Linux ransomware has slightly different targets than\nWindows ransomware, in this case targeting NAS servers rather than Linux endpoints.\n\nUnfortunately detection rates of QNAPCrypt are low, and the ransomware could create\nsignificant monetary losses and economic damage in comparison to other types of Linux\nthreats.\n\n[We have created a custom YARA signature for detecting future variants of QNAPCrypt.](https://github.com/intezer/yara-rules/blob/master/QNAPCrypt.yar)\n\n**Genetic Analysis**\n\nThe QNAPCrypt malware variants are now indexed in Intezer’s genetic database. If you\nhave a suspicious file that you suspect to be QNAPCrypt or other malware from the Rex\ngroup, you can upload it to Intezer Analyze to detect code reuse to this threat family and\n[many others. You are welcome to try it for free in our community edition.](https://analyze.intezer.com/#/)\n\n_[Genetic Analysis of the QNAPCrypt ARM variant](https://analyze.intezer.com/#/files/3d7ebe73319a3435293838296fbb86c2e920fd0ccc9169285cc2c4d7fa3f120d)_\n\n**IOCs**\n\n\n-----\n\nsg3dwqfpnr4sl5hh[.]onion\n192.99.206[.]61\n[3d7ebe73319a3435293838296fbb86c2e920fd0ccc9169285cc2c4d7fa3f120d](https://analyze.intezer.com/#/files/3d7ebe73319a3435293838296fbb86c2e920fd0ccc9169285cc2c4d7fa3f120d)\n[076a6fa4e051c061e19b9e3e37da9c63a9bc7c1a99111ac13b32eb2f70b7fa5c](https://analyze.intezer.com/#/files/076a6fa4e051c061e19b9e3e37da9c63a9bc7c1a99111ac13b32eb2f70b7fa5c)\n\n**Ignacio Sanmillan**\nNacho is a security researcher specializing in reverse engineering and malware analysis.\nNacho plays a key role in Intezer\\'s malware hunting and investigation operations, analyzing\nand documenting new undetected threats. Some of his latest research involves detecting\nnew Linux malware and finding links between different threat actors. Nacho is an adept ELF\nresearcher, having written numerous papers and conducting projects implementing state-ofthe-art obfuscation and anti-analysis techniques in the ELF file format.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-10 - How We Seized 15 Active Ransomware Campaigns Targeting Linux File Storage Servers.pdf"
    ],
    "report_names": [
        "2019-07-10 - How We Seized 15 Active Ransomware Campaigns Targeting Linux File Storage Servers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536003,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653764698,
    "ts_modification_date": 1653764698,
    "files": {
        "pdf": "https://archive.orkl.eu/dd26f621b214879d955be6d349746ab81ff2e343.pdf",
        "text": "https://archive.orkl.eu/dd26f621b214879d955be6d349746ab81ff2e343.txt",
        "img": "https://archive.orkl.eu/dd26f621b214879d955be6d349746ab81ff2e343.jpg"
    }
}