{
    "id": "e8544c08-fd82-49db-b0c5-704886d96469",
    "created_at": "2023-01-12T15:05:04.18697Z",
    "updated_at": "2025-03-27T02:06:12.439155Z",
    "deleted_at": null,
    "sha1_hash": "96bd481a30576976afa3cf3033007cfa4a133239",
    "title": "2022-04-25 - INDUSTROYER.V2- Old Malware Learns New Tricks",
    "authors": "",
    "file_creation_date": "2022-05-29T10:36:26Z",
    "file_modification_date": "2022-05-29T10:36:26Z",
    "file_size": 5730294,
    "plain_text": "# INDUSTROYER.V2: Old Malware Learns New Tricks\n\n**[mandiant.com/resources/industroyer-v2-old-malware-new-tricks](https://www.mandiant.com/resources/industroyer-v2-old-malware-new-tricks)**\n\nOn April 12, 2022, [CERT-UA and](https://cert.gov.ua/article/39518) [ESET reported that a cyber physical attack impacted](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\noperational technology (OT) supporting power grid operations in Ukraine. The attack\n[leveraged different pieces of malware including a variant of INDUSTROYER, a well-known](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\npiece of attack-oriented ICS malware originally deployed in December 2016 to cause power\noutages in Ukraine.\n\nThe attack is significant not only because OT-targeted attacks are rare, but also because this\nis the first instance in which code from broadly known attack-oriented OT malware was\nredeployed against a new victim. Despite five years of substantial analysis into\nINDUSTROYER from a variety of researchers, the actor still attempted to repurpose the tool\nand customized it to reach new targets. INDUSTROYER.V2 (Mandiant’s name for the new\nvariant) reinforces the notion that OT malware can be tailored for use against multiple\nvictims, which has serious implications for other publicly known OT malware families like\n[INCONTROLLER.](https://www.mandiant.com/resources/incontroller-state-sponsored-ics-tool)\n\n\n-----\n\nWhile much of the story surrounding INDUSTROYER.V2 s deployment is already publicly\navailable, Mandiant further analyzed the malware to share additional insights for defenders\nand the OT community. In this blog post we document additional technical details of\nINDUSTROYER.V2 based on our analysis of two different samples. We also provide\ndetection rules to identify related activity.\n\n_If you need support responding to related activity, please contact_ _[Mandiant Consulting.](https://www.mandiant.com/services/incident-response)_\n_Further analysis of related threats—including additional malware that was deployed_\n_alongside INDUSTROYER.V2—is available as part of Mandiant Advantage Threat_\n_Intelligence._\n\n## INDUSTROYER.V2 In a Nutshell\n\nINDUSTROYER.V2 is similar to its predecessor, however this variant contains more targeted\nfunctionality. Unlike the original INDUSTROYER, which was a framework that leveraged\nexternal modules to implement four different OT protocols, this variant is self-contained and\nonly implements the IEC 60870-5-104 (IEC-104) communications protocol. IEC-104 is used\nfor power system monitoring and control over TCP and is mainly implemented in Europe and\nthe Middle East.\n\nMost importantly, the new malware variant enables the actor to embed customized\nconfigurations that modify the malware’s behavior to specific intelligent electronic devices\n(IEDs) (e.g., protection relays, merging units, etc.) within the target environment. The design\nchange to embed custom configurations in INDUSTROYER.V2 reduces the effort required by\nthe actor to reproduce the attack against different victim environments and enables the actor\nto contain the impact to specific targeted IEDs.\n\n## Two Custom INDUSTROYER.V2 Samples Show the Breadth of the Attack\n\nTo fully understand the implications of the new customization capabilities in\nINDUSTROYER.V2, we analyzed and compared two different samples. The second sample,\nwhich is likely a recompiled version, is publicly available and in online malware scanning\nplatforms (MD5: 7c05da2e4612fca213430b6c93e76b06).\n\nWe believe both samples are related to the same operation. The compilation\ntimestamps were within minutes of each other and about two weeks before the\nintended attack. It is possible the actor was modifying the malware’s configuration to\ncustomize the payload for different targets.\nEach sample contains different configurations hardcoded within the binary. One sample\ncontains eight unique hardcoded target IP addresses, whereas the other only contains\nthree.\n\n\n-----\n\nIn both samples the malware terminated a specific process. However, the defined\nfilepath used to concatenate with the process differed between the two samples. This\nshows a nuanced understanding of the victim environment.\nFigure 1 shows an example of INDUSTROYER.V2 configuration for the publicly\navailable sample.\n\nFigure 1: Example INDUSTROYER.V2 configuration for publicly available sample\nBased on the slight differences between both samples, we can infer additional details about\nthe scale of the attack, the likely level of access that the actor had within the victim networks,\nand the reconnaissance likely performed by the attacker prior to the deployment of the\nmalware.\n\nAs shown by the details embedded in the malware configurations, the actor conducted\nat least some internal network reconnaissance to identify specific IEDs in the victim\nenvironments and understand how to access them.\nThe malware configurations target devices across specific subnets, highlighting that the\nactor succeeded in identifying and penetrating surrounding networks.\nThe actor’s successful implementation of IEC-104 to interact with the targeted devices\nindicates a robust understanding of the protocol and knowledge of the victim\nenvironment. For example, in the samples we analyzed the actor manipulated a\nselected list of Information Object Addresses (IOAs), which are used to interact with\npower line switches or circuit breakers in a remote terminal unit (RTU) or relay\nconfiguration.\nConversely, the malware code itself shows some degree of carelessness or potential\ntime constraints. For example, the INDUSTROYER.V2 samples contain limited\nobfuscation and defense evasion methods. The lack of obfuscation in the binaries\nprovides defenders with quick hints on its functionality and ability to target OT assets.\n\n## Outlook\n\nExtensible frameworks, such as the original INDUSTROYER and INCONTROLLER, are\noften preferred by threat actors due to the flexibility of their modular design, allowing\ndeployment of specific payloads to target different victim assets or communication protocols.\nHowever, in the case of INDUSTROYER.V2, the actor reimplemented only one of the original\ncomponents from the earlier framework and created a new self-contained executable.\n\nIt is unclear why the threat actor made the particular modifications to INDUSTROYER.V2.\nPerhaps the actor wanted to develop a more streamlined version to target a very specific\nenvironment, or they did not want to expose more valuable or capable tools, or they simply\nbelieved this approach would be efficient since it would not require additional resources to\nimpact the target.\n\n\n-----\n\nRegardless of the motivations, the reuse of code from known OT malware highlights the\nvalue of hunting and detections based on known indicators. For instance, some detections\nwe built for the original INDUSTROYER successfully identified INDUSTROYER.V2 in the\nwild. While it is often believed that OT malware is not likely to be utilized in more than one\nenvironment, tools that take advantage of insecure by design OT features—such as\nINDUSTROYER.V2 does—can be employed multiple times to target multiple victims. The\nOT security community should recognize these tools as frameworks or capabilities, and not\nmerely features of isolated cyber security incidents and one time use tools.\n\n## Technical Analysis of INDUSTROYER.V2\n\nINDUSTROYER.V2 is written in C++ and implements the IEC-104 protocol to modify the\nstate of remote terminal units (RTUs) over TCP. IEC-104 protocol TCP clients are called\ncontrol stations and the TCP servers are called remote stations. The malware crafts\nconfigurable IEC-104 Application Service Data Unit (ASDU) messages, also known as\ntelegrams, to change the state of a remote station’s Information Object Addresses (IOAs) to\nON or OFF. IOAs identify a specific data element on a device and may correspond to power\nline switches or circuit breakers in an RTU or relay configuration.\n\nThe malware is a self-contained executable where the operator can set up configuration\nparameters to target specific remote stations, define execution options, and craft ASDU\nmessages. It also accepts the optional command line arguments (-o) to print debug\nmessages to an output file or (-t) to create a time delay before execution.\n\n### Configuration Capabilities\n\nAfter the command line interface arguments are parsed, INDUSTROYER.V2 iterates through\nembedded configuration entries. The execution of the program is highly configurable. Based\non our analysis of two INDUSTROYER.V2 samples, the malware contains configuration\nentries structured as strings in the order shown in Table 1.\n\nTable 1: Configuration Structure\n\n**Position** **Configuration Entry Description**\n\n1 Station IP Address\n\n2 Station Port\n\n3 Entry Index Value\n\n\n-----\n\n4 Enable Hard-Coded Telegrams with specified Range\n\n5 Enable Configuration Options 6 - 14\n\n5b If Entry 4 is Enabled, Telegram Start Range\n\n6 Enable Process Termination\n\n6b If entry 4 is Enabled, Telegram End Range\n\n7 Process Name to Terminate\n\n8 Enable File Rename\n\n9 Directory Path for File Rename\n\n10 Sleep Prior to IEC-104 functionality\n\n11 Sleep Duration Seed Value\n\n12 Execution Control\n\n13 Sleep Duration Seed Value\n\n14 Unused\n\n15 Command State – ON/OFF\n\n16 Change Option – Send Inverted ON/OFF commands\n\n17 Number of ASDU Data Entries\n\n18 First ASDU Data Entry\n\nAn example extracted configuration entry from sample\n7c05da2e4612fca213430b6c93e76b06 is presented in Figure 2.\n\n\n-----\n\nFigure 2: Example configuration entry\n```\n 192.168.XXX.XXX 2404 2 0 1 1 Example StoppedProcess.exe 1 \"Example PATH\"\n 0 1 0 0 1 0 0 8 1104 0 0 0 1 1 1105 0 0 0 1 2 1106 0 0 0 1 3 1107 0 0 0 1\n 4 1108 0 0 0 1 5 1101 0 0 0 1 6 1102 0 0 0 1 7 1103 0 0 0 1 8\n\n```\nIf configuration entry #4 is enabled, the malware crafts ASDU telegrams to deliver Select and\nExecute commands and modify the state of a remote station's IOA to OFF. The IOA ranges\nwhich these telegrams are sent to are provided by configuration entries #5 and #6. However,\nthis option was not enabled in recovered samples. A configuration mapping against the\nexample in Figure 2 is included in the Appendix.\n\nAll the configurations we examined had the following options enabled: process termination,\nfile rename, and use of ASDU data entries. The ASDU data entries are used to craft specific\nASDU messages to the remote station and the data entry is structured in the format shown in\nTable 2.\n\nTable 2: ASDU Entry Structure\n\n**Position** **ASDU Data Entry Description**\n\n1 Station Information Object Address (IOA)\n\n2 Set Message Type – Single or Double Command\n\n3 Set Command Type – Select or Execute\n\n4 Invert Default ON/OFF State\n\n5 Execution Control\n\n6 ASDU Entry Index\n\nAfter parsing each configuration entry, INDUSTROYER.V2 enumerates running processes to\nidentify if a specific hard-coded process is running and terminates it. Once this process is\nstopped, the malware enumerates running processes again and terminates whichever\nprocess is specified by the operator in the configuration.\n\nIf the file rename option is enabled, the malware creates a file path using its configuration\ndata and adds a .MZ extension to this file. This may be a technique to prevent the specified\nprocess terminated earlier from relaunching.\n\n\n-----\n\nFor each configuration entry, a thread is created that implements IEC-104 communication\nwith the controlled system. IEC-104 uses the Application Protocol Data Unit (APDU)\nspecification.\n\nAn APDU frame can be composed of either just an Application Protocol Control Information\n(APCI) frame; or an APCI header and a subsequent Application Service Data Unit (ASDU)\nframe.\n\nFigure 3: APDU frame format by [Brno University of Technology](https://www.fit.vut.cz/research/publication-file/11570/TR-IEC104.pdf)\n\n### Execution\n\nINDUSTROYER.V2 first sends control function messages, which are contained within an\nAPCI frame. The first control message is a Test Frame (TESTFR). The malware sends a\nTESTFR ACT to the remote station which verifies an established connection. If one exists, a\nremote station responds with a corresponding TESTFR CON.\n\nNext, the malware opens a data transfer channel with the remote station using a subsequent\ncontrol message type of Start Data Transfer (STARTDT). By default, data transfer is not\nenabled on an active connection between a control station and remote station. Therefore, the\nmalware sends a STARTDT ACT to activate a data transfer channel and a remote station\nsends a corresponding STARTDT CON, to confirm a successful activation.\n\n\n-----\n\nWith data transfer enabled, the malware utilizes an ASDU frame to send subsequent\ncommands to the remote station. ASDU messages, also known as telegrams, are a set of\napplication functions defined by IEC-104 to monitor and control remote stations. Further\n[information describing the ASDU frame is available for reference here.](https://www.fit.vut.cz/research/publication-file/11570/TR-IEC104.pdf)\n\nThe malware sends a General Interrogation command, which allows it to obtain the current\nstatus of monitored digital and analog signals of the remote station. The malware then uses\nembedded ASDU data entries to craft a specific command to modify the target’s IOA to either\nON or OFF.\n\nThese commands are crafted using options defined within its configuration and the individual\nASDU data entry. For example, in the configuration we extracted from sample\n7c05da2e4612fca213430b6c93e76b06 (presented in Figure 2) the first ASDU data entry is:\n\n1104 0 0 0 1 1\n\nBased on configuration entry 15 (OFF state), entry 16 (Disable Change option), and its\nASDU entry values (described in Table 2), the malware crafts an ASDU packet with the\nfollowing characteristics:\n\nInformation Object Address: 1104\nASDU message type: C-DC_NA_1 (Double Command)\nASDU command type: Execute\nSet state value: OFF\n\nThe ASDU message is shown in decoded network traffic in Figure 4.\n\n\n-----\n\nFigure 4: Crafted ASDU message\nFor each targeted remote station in a configuration entry, the malware iterates through\ncorresponding ASDU data entries, crafting specified telegrams, and sends it to the remote\nstation. The malware’s configuration settings may direct it to craft an additional ASDU\nmessage, which inverts the ON/OFF state in a command and sends this additional message\nto the remote station’s IOA.\n\nA high-level description of the communication sequence is the following:\n\n1. Send Test Frame messages to verify an established connection\n2. Send Start Data Transfer messages to open a data transfer channel\n3. Send a General Interrogation command retrieving the status of the remote station\n4. Send crafted Single or Double command types to modify the state of the remote\n\nstation’s IOA\n\nFigure 5 illustrates the described message sequence, captured between INDUSTROYER.V2\nand a lab emulated IEC-104 remote station. It displays the initial TESTFR, STARTDT, and\nInterrogation commands, followed by the crafted ASDU commands delivered to specific\nremote station IOAs.\n\n\n-----\n\nFigure 5: INDUSTROYER.V2 message sequence with emulated IEC-104 Remote Station\nThe detailed nature of how a specific remote station is targeted, down to the unique IOAs\nand the state each IOA must be modified to create an intended effect, demonstrates a\ncomprehensive understanding of, or visibility into the victim environment.\n\nWe note that although the IOAs targeted by the malware can provide important context to the\nactor's precise intent, IOA mappings often differ between manufacturers, devices, and even\nusers. For this reason, accurate interpretation of the actions intended by the actor requires\nadditional knowledge about the targeted assets.\n\nWhile at this moment we do not have such information, we explored possible IOA matches\nbased on publicly available documentation about specific products. For example, knowing\nthat ABB RTU's and relays are heavily deployed in the targeted region we performed open\nsource analysis. In our earlier example we observed an IOA equivalent to 1104, which we\nthen mapped to public product documentation from an ABB Distribution Recloser\nRelay corresponding to \"50BFT:InStr status\".\n\nIn this status, 50 is the ANSI number for circuit breaker, which is how relay elements are\nnumbered when setting a protection relay. Then 50BFT stands for circuit breaker failure\nprotection. We provide an appendix illustrating additional mapping of IOAs extracted from the\nconfiguration of the public INDUSTROYER.V2 sample against the same distribution recloser\nrelay.\n\n### Overlaps With Previous INDUSTROYER Variant\n\nThe two versions of INDUSTROYER contain overlaps in code and similarities in execution\nflow and functionality. We identified the following shared features in execution and\nfunctionality:\n\n\n-----\n\nBoth versions contain code that first terminates a specific process on the victim\ncontroller station, prior to establishing IEC-104 communication.\nBoth versions craft specific ASDU messages according to provided configuration\nsettings.\nBoth versions contain an ability to deliver pre-defined ASDU messages to a specified\nIOA range.\nBoth versions contain an option to direct the malware to craft an additional ASDU\nmessage which inverts the previous ON/OFF command and sends it to the target\nremote station.\n\nOne difference we identified between both variants is that, unlike its predecessor,\nINDUSTROYER.V2 contains altered debugging messages which obfuscate the meaning of\nthe outputs. However, we note these debugging messages are formatted and printed at\nsimilar execution points of key functions. Further, the obfuscation was not implemented in\nkey portions of IEC-104 code which are reused in both versions, which enables us to\nvisualize the overlaps.\n\nFor example, both INDUSTROYER versions use very similar code to parse APDU traffic and\nprint specific parsed fields. Figure 6 is a screenshot of INDUSTROYER.V2 on the left and on\nthe right a screenshot of the original INDUSTROYER.\n\nFigure 6: APDU traffic handling in INDUSTROYER.V2 (Left) and INDUSTROYER.104\n(Right)\nAdditional notable code overlaps between the two versions exist in implementation of ASDU\nframe creation, sending of APDU messages, change option execution, and thread setup for\nIEC-104 functionality.\n\n## Appendix: YARA Rules\n\n\n-----\n\n```\nrule MTI_Hunting_INDUSTROYERv2_Bytes {\n\n```\n```\n  meta:\n\n```\n```\n    author = \"Mandiant\"\n\n```\n```\n    date = \"04-09-2022\"\n\n```\n```\n    description = \"Searching for executables containing bytecode\nassociated with the INDUSTROYER.V2 malware family.\"\n\n```\n```\n  strings:\n\n```\n```\n    $bytes = {8B [2] 89 [2] 8B 0D [4] 89 [2] 8B 15 [4] 89 [2] A1 [4]\n89 [2] 8B 0D [4] 89 [2] 8A 15 [4] 88 [2] 8D [2] 5? 8B [2] E8}\n\n```\n```\n  condition:\n\n```\n```\n    filesize < 3MB and\n\n```\n```\n    uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550 and\n\n```\n```\n    $bytes\n\n```\n```\n}\n\n```\n```\nrule MTI_Hunting_INDUSTROYERv2_Strings {\n\n```\n```\n  meta:\n\n```\n```\n    author = \"Mandiant\"\n\n```\n```\n    date = \"04-09-2022\"\n\n```\n```\n    description = \"Searching for executables containing strings\nassociated with the INDUSTROYER.V2 malware family.\"\n\n```\n```\n  strings:\n\n```\n```\n    $a1 = \"M%X - %02d:%02d:%02d\" nocase ascii wide\n\n```\n```\n    $a2 = \"%02hu:%02hu:%02hu:%04hu\" nocase ascii wide\n\n```\n```\n    $a3 = \"%s M%X \" nocase ascii wide\n\n```\n```\n    $a4 = \"%s: %d: %d\" nocase ascii wide\n\n```\n```\n    $a5 = \"%s M%X %d (%s)\" nocase ascii wide\n\n```\n```\n    $a6 = \"%s M%X SGCNT %d\" nocase ascii wide\n\n```\n```\n    $a7 = \"%s ST%X %d\" nocase ascii wide\n\n```\n\n-----\n\n```\n    $a8 Current operation : %s nocase ascii wide\n\n```\n```\n    $a9 = \"Sent=x%X | Received=x%X\" nocase ascii wide\n\n```\n```\n    $a10 = \"ASDU:%u | OA:%u | IOA:%u | \" nocase ascii wide\n\n```\n```\n    $a11 = \"Cause: %s (x%X) | Telegram type: %s (x%X\" nocase ascii\nwide\n\n```\n```\n    $b1 = \"Length:%u bytes | \" nocase ascii wide\n\n```\n```\n    $b2 = \"Unknown APDU format !!!\" nocase ascii wide\n\n```\n```\n    $b3 = \"MSTR ->> SLV\" nocase ascii wide\n\n```\n```\n    $b4 = \"MSTR <<- SLV\" nocase ascii wide\n\n```\n```\n  condition:\n\n```\n```\n    filesize < 3MB and\n\n```\n```\n    uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550 and\n\n```\n```\n    (1 of ($a*) and 1 of ($b*))\n\n```\n```\n}\n\n```\n\n## Appendix: Mapped Configuration Example\n\n3: Mapped configuration example\n\n\nTable\n\n\n## Appendix: Example IOAs From Publicly Available Sample Mapping to An ABB Distribution Recloser Relay\n\n\n-----\n\n**IOA** **Description**\n\n1101 50BFT:InPosCIsA Status\n\n1102 50BFT:InPosCIsB Status\n\n1103 50BFT:InPosCIsC Status\n\n1104 50BFT:InStr status\n\n1105 50BFT:InStrA status\n\n1106 50BFT:InStrB status\n\n1107 50BFT:InStrC status\n\n1108 50BFT:general\n\n\n1201\n\n\n1202\n\n\n1203\n\n\n1204\n\n\n1250\n\n\n1251\n\n\n1252\n\n\n1253\n\n\n1254\n\n\n-----\n\n1255\n\n\n1256\n\n\n1257\n\n\n1258\n\n\n1259\n\n\n1260\n\n\n1261\n\n\n1262\n\n\n1263\n\n\n1264\n\n\n1265\n\n\n1301\n\n\n1302\n\n\n1304\n\n\n1401\n\n\n1402\n\n\n1403\n\n\n1404\n\n\n-----\n\n130202\n\n\n160921\n\n\n160923\n\n\n160924\n\n\n160925\n\n\n160927\n\n\n160928\n\n\n190202\n\n\n260202\n\n\n260901\n\n\n260902\n\n\n260903\n\n\n260904\n\n\n260905\n\n\n260906\n\n\n260907\n\n\n260908\n\n\n260909\n\n\n-----\n\n260910\n\n\n260911\n\n\n260912\n\n\n260914\n\n\n260915\n\n\n260916\n\n\n260918\n\n\n260920\n\n\n290202\n\n\n338501\n\n\n## Acknowledgements\n\nThis research was made possible thanks to the hard work of many people not listed on the\nbyline. A huge thanks to CERT UA and ESET. Special thanks to Josh Triplett, Conor Quigley,\nand Wesley Mok.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-25 - INDUSTROYER.V2- Old Malware Learns New Tricks.pdf"
    ],
    "report_names": [
        "2022-04-25 - INDUSTROYER.V2- Old Malware Learns New Tricks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535904,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653820586,
    "ts_modification_date": 1653820586,
    "files": {
        "pdf": "https://archive.orkl.eu/96bd481a30576976afa3cf3033007cfa4a133239.pdf",
        "text": "https://archive.orkl.eu/96bd481a30576976afa3cf3033007cfa4a133239.txt",
        "img": "https://archive.orkl.eu/96bd481a30576976afa3cf3033007cfa4a133239.jpg"
    }
}