{
    "id": "e8eca007-9475-4d76-8e06-0be356c3d309",
    "created_at": "2023-01-12T15:10:41.441102Z",
    "updated_at": "2025-03-27T02:05:39.526932Z",
    "deleted_at": null,
    "sha1_hash": "a434133a7aca1e4bcd078a9067017be31611eda8",
    "title": "2022-03-23 - LokiLocker Ransomware May Use False Flag to Avoid Identification",
    "authors": "",
    "file_creation_date": "2022-05-28T03:45:32Z",
    "file_modification_date": "2022-05-28T03:45:32Z",
    "file_size": 133172,
    "plain_text": "# LokiLocker Ransomware May Use False Flag to Avoid Identification\n\n**[msspalert.com/cybersecurity-research/lokilocker-ransomware-may-use-false-flag-to-avoid-identification/](https://www.msspalert.com/cybersecurity-research/lokilocker-ransomware-may-use-false-flag-to-avoid-identification/)**\n\nMarch 23, 2022\n\nA relatively new ransomware-as-a-service (RaaS) family known as LokiLocker is targeting\nMicrosoft Windows users globally, BlackBerry threat researchers said.\n\nby D. Howard Kass • Mar 23, 2022\n\nA relatively new ransomware-as-a-service (RaaS) family known as LokiLocker is targeting\nMicrosoft Windows users globally through a small, distributed network of affiliates,\nBlackBerry threat researchers said.\n\nThe malware, most likely in a beta stage release, encrypts files similar to other notables but\nalso may have the ability to display a false flag tactic that blames Iranian actors, BlackBerry\n[said in a recent blog post. The security provider compared LokiLocker to its namesake in](https://blogs.blackberry.com/en/2022/03/lokilocker-ransomware)\nNorse mythology, which often was an enemy to other gods and also acted as a hijacker of\nsorts.\n\nLokiLocker was first seen in the wild in mid-August 2021. This LokiLocker is not a\nreconstituted version of the older ransomware family called Locky, which was notorious in\n2016, or LokiBot, which is an infostealer. Most of the attacks thus far have occurred in\nEastern Europe and Asia but there are other geographic instances as well. At this point,\nBlackBerry has not been able to determine the hackers’ country of origin.\n\n## LokiLocker Ransomware Tactics\n\nThis is how LokiLocker works:\n\nThe bug enters the victim’s network, encrypts files, and demands a monetary ransom\nto restore access.\n\n\n-----\n\nThe malware is written in .NET and protected with NETGuard (modified ConfuserEX)\nusing an additional virtualization plugin called KoiVM that is publicly available on\nGitHub but not widely used in malware.\nEncrypts victim’s files on local drives and network shares with a standard combination\nof AES for file encryption and RSA for key protection.\nThe crew then asks the victim to email them to obtain instructions on how to pay the\nransom.\n\nShould the victim refuse to pay, LokiLocker also has wiper functionality to delete non-system\nfiles to make the system unusable. “With a single stroke, everyone loses,” BlackBerry’s\nresearchers said. At this point, there is no free tool to decrypt files encrypted by LokiLocker.\n\nLokiLocker is spread by about 30 vetted affiliates, based on samples that BlackBerry has\nfound in the wild. Each affiliate is identified by a chosen username and is assigned a unique\nchat-ID number, BlackBerry said. It’s possible that the LokiLocker version via brute-checker\nhacking tools used to automate validation of stolen accounts and gain access to other\naccounts with credential stuffing. This may be part of a beta testing stage, which would\nexplain the current ties with so few affiliates, the analysts said.\n\nOf particular interest, some of the cracking tools used to distribute the first samples of\nLokiLocker seem to be developed by an Iranian cracking team called AccountCrack. Still, it’s\nnot clear if the bug actually originates from Iran or the authors are trying to feint tracking.\n\n“LokiLocker ransomware is adept at causing mayhem on the user’s endpoints, and, like its\nnamesake Norse god, can prove to be vengeful and destructive if not appeased with a\n(financial) offering,” BlackBerry wrote. “LokiLocker’s use of KoiVM as a virtualizing protector\nfor .NET applications is an unusual method of complicating analysis. We haven’t seen a lot\nof other threat actors using it yet, so this may be the start of a new trend.”\n\nBlackBerry is cautioning victims not to pay a ransom should an infection strike them. “Quite\napart from the fact that every victim who pays the ransom perpetuates the global growth of\nransomware, remember that you’re dealing with criminals here, and there is no guarantee\nthat you’ll regain access to your data, even if you pay up,” BlackBerry wrote. “Even if your\ndata is restored, there is no way to know whether the threat actor planted a backdoor\nsomewhere on your machine, for easy future access. After all, people who pay one ransom\ncan often be persuaded to pay another.”\n\n## How to Protect Against Ransomware Attacks\n\nThe FBI’s general guidance vs. ransomware attacks includes these 10 recommendations:\n\n1. Back-up critical data offline.\n2. Ensure copies of critical data are in the cloud or on an external hard drive or storage\n\ndevice. This information should not be accessible from the compromised network.\n\n\n-----\n\n3. Secure back-ups and ensure data is not accessible for modification or deletion from the\n\nsystem where the data resides.\n4. Use multi-factor authentication with strong passwords, including for remote access\n\nservices.\n5. Keep computers, devices and applications patched and up-to-date.\n6. Monitor cyber threat reporting regarding the publication of compromised VPN login\n\ncredentials and change passwords and settings.\n7. Consider adding an email banner to emails received from outside your organization.\n8. Disable unused remote access/Remote Desktop Protocol (RDP) ports and monitor\n\nremote access/RDP logs.\n9. Audit user accounts with administrative privileges and configure access controls with\n\nleast privilege in mind.\n10. Implement network segmentation.\n\n## How MSPs and MSSPs Can Respond to and Recover From Ransomware Attacks\n\nIf a ransomware incident occurs, then the CISA, FBI and NSA recommend the following four\nactions:\n\n1. Follow the Ransomware Response Checklist on p. 11 of the CISA-Multi-State\n\nInformation Sharing and Analysis Center (MS-ISAC) Joint Ransomware Guide.\n2. Scan your backups. If possible, scan your backup data with an antivirus program to\n\ncheck that it is free of malware.\n3. Report incidents immediately to CISA at [https://us-cert.cisa.gov/report, a](https://us-cert.cisa.gov/report) local FBI\n\nField Office, or [U.S. Secret Service Field Office.](http://www.secretservice.gov/contact/field-offices/)\n4. Apply incident response best practices found in the joint Advisory, Technical\n\nApproaches to Uncovering and Remediating Malicious Activity, developed by CISA and\nthe cybersecurity authorities of Australia, Canada, New Zealand, and the United\nKingdom.\n\n[Return Home](https://www.msspalert.com/)\n\n## No Comments\n\n### Leave a Reply\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-23 - LokiLocker Ransomware May Use False Flag to Avoid Identification.pdf"
    ],
    "report_names": [
        "2022-03-23 - LokiLocker Ransomware May Use False Flag to Avoid Identification.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536241,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653709532,
    "ts_modification_date": 1653709532,
    "files": {
        "pdf": "https://archive.orkl.eu/a434133a7aca1e4bcd078a9067017be31611eda8.pdf",
        "text": "https://archive.orkl.eu/a434133a7aca1e4bcd078a9067017be31611eda8.txt",
        "img": "https://archive.orkl.eu/a434133a7aca1e4bcd078a9067017be31611eda8.jpg"
    }
}