{
    "id": "e9361efa-4b21-49cc-994d-45a1a0f2bf9a",
    "created_at": "2023-01-12T15:00:43.174691Z",
    "updated_at": "2025-03-27T02:05:23.888872Z",
    "deleted_at": null,
    "sha1_hash": "27e3fa3676c4330edd99ed31d9746e6a8f1a0505",
    "title": "2015-11-11 - AbaddonPOS- A new point of sale threat linked to Vawtrak",
    "authors": "",
    "file_creation_date": "2022-05-28T02:49:16Z",
    "file_modification_date": "2022-05-28T02:49:16Z",
    "file_size": 591545,
    "plain_text": "# AbaddonPOS: A new point of sale threat linked to Vawtrak\n\n**[proofpoint.com/us/threat-insight/post/AbaddonPOS-A-New-Point-Of-Sale-Threat-Linked-To-Vawtrak](https://www.proofpoint.com/us/threat-insight/post/AbaddonPOS-A-New-Point-Of-Sale-Threat-Linked-To-Vawtrak)**\n\nNovember 11, 2015\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nAbaddonPOS: A new point of sale threat linked to Vawtrak\n\n\n-----\n\nNovember 11, 2015 Darien Huss\n\nUPDATED 11/24/2015\n\nPoint of sale (PoS) malware has been implicated in some of the biggest recent data\nbreaches, striking retailers, restaurants, hospitality and organizations from a variety of\nindustries, and often targeting consumers in the US. [1] Once considered too difficult to carry\nout to be practical for cybercriminals, the retail breaches of late 2013 demonstrated that\nthese attacks are both feasible and highly profitable for cybercriminals, and PoS malware\nhas since continued to evolve and grow in both variety and sophistication. [2]\n\nProofpoint threat researchers recently detected a new addition to PoS malware landscape.\nNamed AbaddonPOS by Proofpoint researchers, this sample was initially discovered as it\nwas being downloaded in the process of a Vawtrak infection. This use of additional payloads\nto enhance attack capabilities offers another example of efforts by threat actors to expand\ntheir target surfaces through the delivery of multiple payloads in a single campaign, in this\ncase by including potential PoS terminals. This post will analyze AbaddonPOS; discuss the\nobserved infection vectors; and expose, details on the downloader used to retrieve this new\nPoS malware. We will also provide evidence to demonstrate that the downloader malware\nand PoS malware are closely related, perhaps even written by the same actor or actors.\n\n**Known infection vectors**\n\nOn October 8, Proofpoint researchers observed Vawtrak [3] (project ID 5) downloading\nTinyLoader, a downloader that uses a custom protocol for downloading executable payloads\nfrom its command and control (C2) server. TinyLoader was then used to download another\ndownloader in the form of shellcode, which then downloaded AbaddonPOS. Although this\ninfection vector was initially specific to Vawtrak’s project ID 5, we have also since observed it\ndelivered in project IDs 6, 9, 10, 12, and 13. The project ID’s are most easily observed with\n\n\n-----\n\nVawtrak C2 traffic, as they are stored encoded in the PHPSESSID cookie value. Using the\ncookie value we provided as an example in our research on Vawtrak enables us to see it in a\ndecoded state (Fig. 1). Bytes 4-7 contain the project ID in little-endian byte order.\n\n_Figure 1: Decoded Vawtrak cookie displaying campaign/project ID_\n\nIn addition to observing AbaddonPOS as it was delivered by an Angler EK\n→ Bedep → Vawtrak infection (Cyphort, [4]) and Angler EK → Bedep (bypassing Vawtrak),\nProofpoint researchers have also observed this infection behavior delivered by weaponized\nMicrosoft Office documents downloading Pony → Vawtrak (Fig. 2).®\n\n\n-----\n\n_Figure 2: AbaddonPOS infection chain_\n\n**TinyLoader**\n\nTinyLoader’s sole purpose in this infection chain is to retrieve executable instructions from\nthe C2, which allows the attackers to execute their own custom shellcode on infected\nmachines in addition to downloading and executing additional malware payloads. True to its\nname, TinyLoader is typically 2-5KB in size. One notable characteristic of TinyLoader is that\nprior to contacting its single hardcoded C2 IP address, the malware will first check to see if it\nis running as an x64 or x86 process using the IsWow64Process Windows API (Fig 3.).\nTinyLoader selects a value based on the result of this API call, and the result is then used to\ntell the C2 which executable code should be downloaded to the infected client.\n\n_Figure 3: TinyLoader API call checking for x86 or x64_\n\nAs shown in Figure 3 above, 0x84 is used with x86 processes while 0xBA is used with x64\nprocesses; however, the values used for each architecture vary depending on the variant.\nOnce the correct architecture is selected, TinyLoader builds a packet to send to the C2 to\ninitiate the payload download process. Prior to retrieving the downloader that downloads\nAbaddonPOS, we have observed TinyLoader first retrieve a copy of itself (this step may vary\nslightly), which is then used as a persistence method by adding a registry key to\n\n\n-----\n\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run (Fig. 4). TinyLoader may also\ndownload a DLL version of itself, in which case the registry key observed is similar to the\nfollowing: regsvr32.exe /s “C:\\PROGRA~2\\[a-zA-Z0-9]+\\.dll”\n\n_Figure 4: Example of TinyLoader persistence registry key_\n\nOnce the persistent payload is written to disk, another payload is downloaded by TinyLoader\nin the form of shellcode (Fig. 5), the purpose of which is to manually craft a HTTP request\nthat is then used to download an AbaddonPOS payload (Fig. 6).\n\n_Figure 5: TinyLoader binary protocol retrieving shellcode_\n\n_Figure 6: HTTP request retrieving AbaddonPOS variant crafted by shellcode_\n\n\n-----\n\n**AbaddonPOS**\n\nAbaddonPOS is another addition to the PoS malware category, which has attracted a\nsignificant amount of attention from malware authors over the years. [4] Similar to\nTinyLoader, AbaddonPOS is a relatively small package, with most samples being 5KB in\nsize. While the core functionality of this new addition is fairly simple, it contains several\nfeatures that merit analysis and further discussion: anti-analysis, code obfuscation,\npersistence, locating credit card data, and a custom protocol for exfiltrating data.\n\n**Anti-analysis and obfuscation**\n\nAbaddonPOS implements several basic anti-analysis and obfuscation techniques to hinder\nmanual and automated analysis techniques. For example, AbaddonPOS employs a CALL\ninstruction to push a function parameter onto the stack rather than simply using, for instance,\nthe more common PUSH instruction. A CALL instruction pushes the next address onto the\nstack, which is typically used as a return address following a RETN instruction. In this case,\nthe CALL instruction is used to push the address containing a string (Fig. 7): specifically, the\naddress containing the string “devil_host” is pushed onto the stack, which is then used as a\nmutex.\n\n_Figure 7: AbaddonPOS using CALL instruction to hinder static analysis_\n\nMost of AbaddonPOS’ code is not obfuscated or packed, with the exception of the code used\nto encode and transmit stolen credit card data. This shellcode is encoded using a 4-byte\nXOR key; however the key is not hardcoded. Instead, using the first 4-bytes of the decoded\nshellcode, the malware iterates over all possible 4-byte XOR keys until the correct one is\nfound by checking the result against the hardcoded instructions: 0x5589E58B (Fig. 8). Once\nthe XOR result matches the hardcoded instructions, then the correct key has been found and\nthe malware continues to decode the shellcode using that key.\n\n_Figure 8: AbaddonPOS shellcode decoding routine_\n\n**Locating credit card data**\n\n\n-----\n\nAbaddonPOS searches for credit cards by reading the memory of all processes except itself\nby first blacklisting its own PID using the GetCurrentProcessId API. To find credit card data,\nAbaddonPOS roughly follows this process:\n\n1. Search for 3, 4, 5, or 6 string characters, indicating the first number of a potential credit\n\ncard\n2. Credit card number length >= 13 and <= 19\n3. Valid track delimiter (track 1: “^”, track 2: “=”, or “D”)\n4. Track 1 max length: 120, Track 2 max length: 60\n5. Additional checks based on whether track 1 or track 2 delimiters were found\n6. Check credit card number with the Luhn algorithm\n\nThe AbaddonPOS sample with md5 hash: f63e0a7ca8349e02342c502157ec485d was\nanalyzed for the process above. The slightly older version of AbaddonPOS may contain\nslightly modified functionality, including not allowing “D” as a track 2 delimiter.\n\n**Exfiltrating stolen credit card data**\n\nAlthough many of the different PoS malware families rely on HTTP to exfiltrate data,\nAbaddonPOS uses a custom binary protocol. Communication and exfiltration of credit card\ndata is carried out by the decoded shellcode discussed above. A single hardcoded IP\naddress is used as the C2 address, as well as the encoding routine that is used to obfuscate\nexfiltrated data. An example of the network traffic generated during a single credit card data\nexfiltration attempt is shown in Figure 9.As a result of this analysis, Proofpoint created and\npublished ET Pro IDPS signatures (ID’s 2814677-2814680) to detect exfiltration attempts on\nOctober 30.\n\n_Figure 9: AbaddonPOS exfiltrating encoded credit card data to C2_\n\nThe first four bytes of the network traffic are the length of the encoded data, while the\nfollowing four bytes are the value of the process handle returned by OpenProcess. The\nsubsequent bytes are the encoded exfiltrated data, which in a decoded state follows this\nformat:\n\n[credit card data] ***[process name]\n\nTo encode the data, the malware first XORs four bytes of the plaintext with the process\nhandle, followed by a second XOR with a hardcoded 4-byte key. The exfiltration network\ntraffic in Figure 9 is shown in its plaintext state in Figure 10\n\n\n-----\n\n_Figure 10: Plaintext exfiltrated credit card data and process name_\n\nThe following Python script can be used to decode the network traffic, provided it has been\nencoded using the technique described above:\n```\nimport sys,struct,hexdump\nfilename = sys.argv[1]\nwith open(filename, 'rb') as f:\n    c2_traffic = f.read()\nencoded_size = struct.unpack('<I',c2_traffic[:4])[0]\nopenprocess_handle = c2_traffic[4:8]\nencoded = c2_traffic[8:]\nkey = [0x22,0x11,0xAA,0xFF]\ndecoded = ''\nfor i in range(encoded_size):\n    decoded += chr((ord(encoded[i])^key[i%4])^ord(openprocess_handle[i%4]))\nprint 'Decoded AbaddonPOS exfiltration network traffic:'\nhexdump.hexdump(decoded)\n\n```\n**AbaddonPOS Variations**\n\nOf the samples Proofpoint researchers have discovered and analyzed so far, very few\nsamples seem to have had any functionality added or removed. While “devil_host” is the\nmost prominent mutex used by this malware, we have also found a sample that uses\n“devil_kor” (md5, a55843235cd8e36c7e254c5c05662a5b), and another that uses\n“DeviL_Task” (md5, ac03e0e9f70136adede78872e45f6182). We also observed a slightly\nupdated version of AbaddonPOS (see IOCs) where almost all functionality was relocated to\nthe encoded shellcode. In these updated samples the mutex “MG_REX” was used and the\ncredit card search algorithm was also modified by adding ‘D’ as a valid track 2 delimiter.\n\n**Connecting the dots**\n\n\n-----\n\nTinyLoader has now been in development for at least a year, with a first sighting reported on\nJanuary 16, 2015. Over the past year, TinyLoader has undergone several developmental\nchanges, including:\n\nSwitching from UDP protocol to TCP\nRemoving process and UUID reporting\nAdding different anti-analysis\nAdding obfuscation and encoding\n\nWith the emergence of AbaddonPOS, it was quickly apparent that TinyLoader and\nAbaddonPOS are closely connected, and not simply because TinyLoader was used as the\ndownloader. The code of TinyLoader and AbaddonPOS share some important similarities,\nincluding:\n\nAnti-analysis (CALL to push strings onto stack)\nObfuscation (encoding shellcode using exact same encoding routine)\n\nThe similarities with code excerpts including a timeline according to Proofpoint data are\nprovided below (Fig. 11).\n\n\n-----\n\n_Figure 11: Code history comparison for TinyLoader and AbaddonPOS_\n\n**Conclusion**\n\nThe practice of threat actors to increase their target surfaces by leveraging a single\ncampaign to deliver multiple payloads is by now a well-established practice. While using this\ntechnique to deliver point of sale malware is less common, the approach of the US holiday\nshopping season gives cybercriminals ample reason to maximize the return on their\ncampaigns by distributing a new, powerful PoS malware that can capture the credit and debit\ncard transactions of holiday shoppers.\n\n**UPDATE November 24, 2015**\n\n\n-----\n\nFurther research on TinyLoader and AbaddonPOS turned up samples indicating that this\nthreat has been in the wild since at least August 2015. The current earliest known samples of\nAbaddonPOS include:\n\n266ce6d907a90e83da0083eee06af123 -> svchost_bin -> 50.7.138.138:13131 ->\nCompilation timestamp 2015-08-19 22:29:46\n\n91992a1cac7f15e899b22d9a53cabf71 -> svchost_bin -> 50.7.124.172:13131\n\n538482356b4eb4e0552d16b08d5c2908 -> svchost_bin -> 50.7.124.172:13131\n\n05134cd6a50440b2c6d9ef62d2c2c3a3 -> svchost_bin -> 50.7.124.172:13131\n\n7b137055fd40c39bdc76d27ff4fc82ed -> 50.7.124.172:15151 -> Location:\n\n[hxxp://50.7.71[.]99/970/ad06b6e922623e436c7a.exe], downloaded by TinyLoader.C (md5:\n4aa0ca129358b82a285e0d069a36e7fb)\n\n7e49d646cb74718dcce21d3d3ad948d1 -> svchost_bin -> 50.7.124.172:14141 -> Location:\n\n[hxxp://50.7.71[.]99/upload/7e49d646cb.exe], downloaded by TinyLoader.C (md5:\n3733bb7a96e3091183d80b7a4914c830)\n\nc7db01ba6b73188640e0fb65aab0d535 -> svchost_bin -> 50.7.124.172:15151\n\nThe earliest versions of AbaddonPOS are distinguished primarily by fact that it first targets\ntrack data delimiters (\"=\" and \"^\") for finding potential credit card data instead of a beginning\nnumber (\"3\", \"4\", \"5\", and \"6\").\n\nThree earlier versions of AbaddonPOS have been identified (credit: Nick Hoffman):\n\n81055d3e6ab2f349f334a87b090041dc -> svchost_bin -> 50.7.138[.]138:13030\n\nda0cd8228745081b58594103163d22b8 -> svchost_sin -> 50.7.138[.]138:13030\n\n04b68e4f4c7583201397d6674a3e2503 -> svchost_ghost -> 50.7.138[.]138:14040\n\nThe primary difference between these versions and the AbaddonPOS version analyzed in\nthe original post is that these other versions contain a process blacklist: these processes will\nnot be scanned for credit card data. The implementation is unique in that it searches only the\nfirst four bytes of each process; if those four bytes match, then it will search two more; and if\nthose match as well, that process will be skipped. (Fig. 12) The blacklist contained the\nfollowing partial process names:\n\nsvchso\n\niexplo\n\nsmss.e\n\n\n-----\n\ncsrss.\n\nwinlog\n\nlsass.\n\nspools\n\nalg.ex\n\nfirefo\n\nchrome\n\nwinini\n\nsteam.\n\nskype.\n\ndwm.ex.\n\n_Figure 12: AbaddonPOS svchost.exe blacklist instructions_\n\nProofpoint researchers discovered the following additional hashes for AbaddonPOS:\n\n4a85feef07d4aed664624331cdbcdd66 -> DeviL_TasK -> 5.8.60[.]23:21920\n\n6ac78bc0bd16273c654cec105567c73e -> no startup mutex -> 5.8.60[.]23:21930\n\n6b02efef0580dce8e49d27196cff6825 -> M_RAY -> 193.28.179[.]13:20930\n\n6f1d8ca36190668163f005c7f2c9007f -> M_RAY -> 193.28.179[.]13:20950\n\n421dfc4856262445d12fe110bf4f2c56 -> DeviL_TasK -> 5.8.60[.]23:21940\n\n9646e0a87be71c225f2aa8639354bd4f -> M_RAY -> 193.28.179[.]13:20940\n\n46810f106dbaaff5c3c701c71aa16ee9 -> no startup mutex -> 176.114.0[.]165:21940\n\ne9aeb88d393e6259b5fb520bc7a49ac0 -> M_REX -> 193.28.179[.]105:20910\n\nOther malware that are likely used by these actor(s) include:\n\n\n-----\n\nTinyLoader.C (md5: aa7897623f64576586e4b6ec99d8ccc6) was used to download\nFleercivet/Bagsu, a Trojan used to commit adfraud (md5:\n79dc1ce122f7bddd730d886df1a4739a, location: [hxxp://50.7.71[.]99/file/bin86crypt_full.exe])\n\nTinyLoader.B (md5: a94c51c5e316d6e3b1cde1f80f99eb94) downloaded Fleercivet (md5:\n637b764c78ddda0e1d5351a10b19bcb8, location: [hxxp://50.7.71[.]214/upload/7777.exe])\n\nTinyLoader.C (md5: 739cea68598ae347fae1d983e16a7d27) downloaded ReactorBot/Rovnix\n(md5: c755c9532c1ee517b25f98719968e154 and md5:\n9a2fb9aa94d78313420c4106108b5fef, location: [hxxp://80.79.123[.]98/aurum/c.work.exe]\n\nTinyLoader.C (md5: 19516ab9a7169c53bd811c975d5fea7d) was used to download\nFleercivet (md5: 227e6b1f3e66f00a4fc683d4f39da904, location:\n\n[hxxp://50.7.143[.]61/id_1123.exe]) and a packed TinyLoader.C (md5:\na86b91fda7ec634e44e4b6b7e69ed659, location: [hxxp://50.7.143[.]61/40930.exe] )\n\nThese actors may have also employed CryptoWall at some point, as the imphash for\n227e6b1f3e66f00a4fc683d4f39da904 matches the imphash for a known CryptoWall sample\n(md5: 2af149845f4d1ce8e712622d3f1ec46e). Both samples are packed, so it is possible that\ntwo actors utilized the same packer/crypter or packing/crypting service.\n\n**References**\n\n[1] https://www.washingtonpost.com/news/the-switch/wp/2014/08/22/secret-serviceestimates-type-of-malware-that-led-to-target-breach-is-affecting-over-1000-u-s-businesses/\n\n[2] http://www.cio.com/article/2910024/data-breach/history-repeats-itself-as-pos-breachescontinue-in-2015.html\n\n[3] [https://www.proofpoint.com/us/threat-insight/post/In-The-Shadows](https://www.proofpoint.com/us/threat-insight/post/In-The-Shadows)\n\n[4] http://www.cyphort.com/psychcental-com-infected-with-angler-ek-installs-bedep-vawtrakand-pos-malware/\n\n[5] http://researchcenter.paloaltonetworks.com/2015/10/understanding-and-preventing-pointof-sale-attacks/\n\n**Indicators of Compromise (IOCs)**\n\n_IDS/IPS Detection (ET signature IDs)_\n\n_TinyLoader:_\n\n2020150-2020153,2020849-2020852,2812523,2812524,2814778,2814779,2814803\n\n_TinyDownloader (downloader shellcode HTTP request):_\n\n\n-----\n\n2814810\n\n_AbaddonPOS:_\n\n2814677-2814680\n\nTinyLoader Samples:\n\n0c77886a3ea42b75fcd860d4d97e72c5\n\na3ea1a008619687bdfef08d2af83f548\n\na53d8212a47bf25eeca87c1e27042686\n\na7a666ab9548fd1f0a8eb8050d8ca483\n\na9cc6736e573ad9e77359062e88114e2\n\naaac35389c9be79c67c4f5c4c630e5d5\n\nb3a057f55a8fa2aad5b8d212a42b4a88\n\nbcf271e83c964eb1fd89e6f1a7b7a62f\n\nc42f20e2a68b8829b52b8399b7b33bf2\n\nd785592932323f6ddaa121bcdcbceba0\n\ne08aeb0bfcbae33b851af9f8be413111\n\ne92254f9ce7d6f45e907e77de146ef37\n\nec322598eec364a755b5aea70d2a2da8\n\n1c02f2f3fa15cc6a472119389d25983e\n\n1c2a757c63ee418135e89cc8ef0d6e63\n\n2b3704e0acbcbc265d0d08502a9bf373\n\n3a7ac0c907b2c406ab480d4ed2f18161\n\n3f71031ce8ecb0f48847ccb8be86a5fe\n\n4b86cbb2e9f195bef3770d877206068d\n\n6ee164908a94a881032d0649e2bd2505\n\n6f7fabeb9ce76a1d52dbf5a40cbc74e8\n\n\n-----\n\n7b7ffdd46d1f7ccea146fd9d5a2412ae\n\n7c69dc17977b3431ff15c1ae5927ed0d\n\n7eddbf17a3d1e398621194b0f22402a7\n\n8d6d7a7d77215370d733bda57ef029f4\n\n8df542e35225e0708cd2b3fe5e18ac79\n\n9b340ac013c052ffb2beb29d26009a24\n\n47e5c290f3f443cca027aa344cbf194f\n\n54f1cda856ae921846e27f6d7cc3d795\n\n77f124332a17b3ef6c0b6a799ad0c888\n\n89a19ccb91977d8b1a020f580083d014\n\n9320175f8af07503a2b2eb4d057bac07\n\n885829081f91c6baf458166c3f42e281\n\na1d1ba04f3cb2cc6372b5986fadb1b9f\n\nTinyLoader C2 IP addresses:\n\n91.234.34[.]44\n\n50.7.138[.]138\n\n149.154.64[.]167\n\n5.8.60[.]23\n\n176.114.0[.]165\n\nAbaddonPOS Samples:\n\n5bf979f90307bac11d13be3031e4c6f9\n\na168fef5d5a3851383946814f15d96a7\n\na55843235cd8e36c7e254c5c05662a5b\n\n1c19494385cb21b7e18252b5abd104f6\n\n2b58f7cb4df18509a743226064b30675\n\n\n-----\n\n752dcae6eb492263608a06489546098f\n\n976275965fcf19a98da824b1959500c1\n\n227e6b1f3e66f00a4fc683d4f39da904\n\n8ca1278e2821fd2dd19c28725f754577\n\nac03e0e9f70136adede78872e45f6182\n\n12cd4df2264624578919596371edee81\n\n317f9c57f7983e2608d5b2f00db954ff\n\nf63e0a7ca8349e02342c502157ec485d\n\n0900582ba65c70a421b5d21d4ed21f16\n\n4b0db5398f02dae5315f0baff1475807\n\n703f492b2624899ec47b929f65265bbb\n\n5e33b1273b2e2d4cd0986b9873ab4bc4\n\nd11c4a4f76b2bea502b80229a83c30bc\n\ne50edb61e796c6ead88cac53719e2d00\n\ndc1a975e20eca705c6c78dc24f1290b5\n\n6a6977ea317f0240a3dacc0753257518\n\n5e06563f6303eab10c3cd46f0fd5c2d6\n\n7ef654cdc7c2b54772400e26eb292caf\n\n946be7ddd511ff9f49b5073896346eab\n\nAbaddonPOS Exfiltration C2 IP addresses:\n\n5.8.60[.]23:21910\n\n5.8.60[.]23:21930\n\n50.7.138[.]138:13030\n\n50.7.138[.]138:15050\n\n91.234.34[.]44:20940\n\n\n-----\n\n91.234.34[.]44:20970\n\n149.154.64[.]167:20910\n\n149.154.64[.]167:20920\n\n149.154.64[.]167:20940\n\n149.154.64[.]167:20940\n\n176.114.0[.]165:20910\n\n176.114.0[.]165:21910\n\n176.114.0[.]165:21940\n\nObserved AbaddonPOS Location URLs:\n\n[hxxp://50.7.143[.]61/f_p/f_940.exe]\n\n[hxxp://50.7.143[.]61/n_p/n_940.exe]\n\n[hxxp://50.7.143[.]61/kor_up.exe]\n\n[hxxp://50.7.143[.]61/f_p/f_910.exe]\n\n[hxxp://50.7.143[.]61/f_p/15050.exe]\n\n[hxxp://50.7.143[.]61/a_p/a_970.exe]\n\n[hxxp://50.7.143[.]61/x_file/x_910.exe]\n\n[hxxp://50.7.143[.]61/x_file/x_930.exe]\n\n[hxxp://50.7.143[.]61/files/p_910.exe]\n\n[hxxp://50.7.143[.]61/a_p/a_970.exe]\n\n[hxxp://50.7.138[.]138/file_x/x_910.exe]\n\n[hxxp://50.7.138[.]138/file_x/x_930.exe]\n\n[hxxp://50.7.138[.]138/n_940.exe]\n\n[hxxp://50.7.138[.]138/n_910.exe]\n\n[hxxp://50.7.71[.]99/explorer.exe]\n\nAbaddonPOS Yara signature:\n\n\n-----\n\n_rule AbaddonPOS_\n\n_{_\n\n_meta:_\n\n_description = \"AbaddonPOS\"_\n\n_author = \"Darien Huss, Proofpoint\"_\n\n_reference = \"md5,317f9c57f7983e2608d5b2f00db954ff\"_\n\n_strings:_\n\n_$s1 = \"devil_host\" fullword ascii_\n\n_$s2 = \"Chrome\" fullword ascii_\n\n_$s3 = \"SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" fullword ascii_\n\n_$i1 = { 31 ?? 81 ?? 55 89 E5 8B 74 }_\n\n_condition:_\n\n_uint16(0) == 0x5a4d and (all of ($s*) or $i1) and filesize <= 10KB_\n\n_}_\n\nCode Comparison Samples\n\nTinyLoader.A,1e4906b4cfcad2e8d34a4937fa0c93e2\n\nTinyLoader.B1,c0d530c9724d7c42adab3c7030a2383b\n\nTinyLoader.B2,bd69714997e839618a7db82484819552\n\nTinyLoader.C,739cea68598ae347fae1d983e16a7d27\n\nTinyLoader.D1,7eddbf17a3d1e398621194b0f22402a7\n\nTinyLoader.X64,b10444fcb83c03a5d6395831721fe750\n\nAbaddonPOS,f63e0a7ca8349e02342c502157ec485d\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-11-11 - AbaddonPOS- A new point of sale threat linked to Vawtrak.pdf"
    ],
    "report_names": [
        "2015-11-11 - AbaddonPOS- A new point of sale threat linked to Vawtrak.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535643,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653706156,
    "ts_modification_date": 1653706156,
    "files": {
        "pdf": "https://archive.orkl.eu/27e3fa3676c4330edd99ed31d9746e6a8f1a0505.pdf",
        "text": "https://archive.orkl.eu/27e3fa3676c4330edd99ed31d9746e6a8f1a0505.txt",
        "img": "https://archive.orkl.eu/27e3fa3676c4330edd99ed31d9746e6a8f1a0505.jpg"
    }
}