{
    "id": "e98271c1-e9f9-4e30-9cf8-474d426eb194",
    "created_at": "2023-01-12T14:59:32.490998Z",
    "updated_at": "2025-03-27T02:05:49.651012Z",
    "deleted_at": null,
    "sha1_hash": "da4655da36d9c811ee1857ff34d5f5cdad153414",
    "title": "2017-10-24 - Bad Rabbit ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T15:37:19Z",
    "file_modification_date": "2022-05-28T15:37:19Z",
    "file_size": 555548,
    "plain_text": "# Bad Rabbit ransomware\n\n**securelist.com/bad-rabbit-ransomware/82851/**\n\nAuthors\n\n[Orkhan Mamedov](https://securelist.com/author/orkhanmamedov/)\n\nFedor Sinitsyn\n\nAnton Ivanov\n\n\n-----\n\n**UPDATE 27.10.2017. Decryption opportunity assessment. File recovery possibility.**\n**Verdicts**\n\n## What happened?\n\nOn October 24th we observed notifications of mass attacks with ransomware called Bad\nRabbit. It has been targeting organizations and consumers, mostly in Russia but there have\nalso been reports of victims in Ukraine. Here’s what a ransom message looks like for the\nunlucky victims:\n\n## What is Bad Rabbit?\n\nBad Rabbit is a previously unknown ransomware family.\n\n## How is Bad Rabbit distributed?\n\n[The ransomware dropper was distributed with the help of drive-by attacks. While the target is](https://encyclopedia.kaspersky.com/glossary/dropper/)\nvisiting a legitimate website, a malware dropper is being downloaded from the threat actor’s\ninfrastructure. No exploits were used, so the victim would have to manually execute the\nmalware dropper, which pretends to be an Adobe Flash installer. However, our analysis\nconfirmed that Bad Rabbit uses the EternalRomance exploit as an infection vector to spread\nwithin corporate networks. The same exploit was used in the ExPetr.\n\nWe’ve detected a number of compromised websites, all of which were news or media\nwebsites.\n\n\n-----\n\n## Whom does it target?\n\nMost of the targets are located in Russia. Similar but fewer attacks have also been seen in\nother countries – Ukraine, Turkey and Germany. Overall, there are almost 200 targets,\naccording to the KSN statistics.\n\n## Since when does Kaspersky Lab detect the threat?\n\nWe have been proactively detecting the original vector attack since it began on the morning\nof October 24. The attack lasted until midday, although ongoing attacks were detected at\n19.55 Moscow time. The server from which the Bad rabbit dropper was distributed went\ndown in the evening (Moscow time).\n\n## How is it different to ExPetr? Or it is the same malware?\n\nOur observations suggest that this been a targeted attack against corporate networks, using\n[methods similar to those used during the ExPetr attack. What’s more, the code analysis](https://securelist.com/schroedingers-petya/78870/)\nshowed a notable similarity between the code of ExPetr and Bad Rabbit binaries.\n\n## Technical details\n\nAccording to our telemetry, the ransomware is spread via a drive-by attack.\n\nThe ransomware dropper is distributed from hxxp://1dnscontrol[.]com/flash_install.php\n\n\n-----\n\nAlso according to our telemetry data, victims are redirected to this malware web resource\nfrom legitimate news websites.\n\nThe downloaded file named install_flash_player.exe needs to be manually launched by the\nvictim. To operate correctly, it needs elevated administrative privileges which it attempts to\nobtain using the standard UAC prompt. If started, it will save the malicious DLL as\n**C:Windowsinfpub.dat and launch it using rundll32.**\n\n\n-----\n\n**_Pseudocode of the procedure that installs the malicious DLL_**\n\n**infpub.dat appears to be capable of brute-forcing NTLM login credentials to Windows**\nmachines that have pseudo-random IP addresses.\n\n\n-----\n\n**_The hard-coded list of credentials_**\n\n**infpub.dat will also install the malicious executable dispci.exe into C:Windows and create a**\ntask to launch it.\n\n**_Pseudocode of the procedure that creates the task which launches the malicious_**\n**_executable_**\n\n\n-----\n\nWhat s more, infpub.dat acts as a typical file encrypting ransomware: it finds the victim s\ndata files using an embedded extension list and encrypts them using the criminal’s public\nRSA-2048 key.\n\n**_The public key of the criminals and the extension list_**\n\nThe criminal’s public key parameters:\n\nPublic-Key: (2048 bit)\n\nModulus:\n\n00:e5:c9:43:b9:51:6b:e6:c4:31:67:e7:de:42:55:\n\n6f:65:c1:0a:d2:4e:2e:09:21:79:4a:43:a4:17:d0:\n\n37:b5:1e:8e:ff:10:2d:f3:df:cf:56:1a:30:be:ed:\n\n93:7c:14:d1:b2:70:6c:f3:78:5c:14:7f:21:8c:6d:\n\n95:e4:5e:43:c5:71:68:4b:1a:53:a9:5b:11:e2:53:\n\na6:e4:a0:76:4b:c6:a9:e1:38:a7:1b:f1:8d:fd:25:\n\n4d:04:5c:25:96:94:61:57:fb:d1:58:d9:8a:80:a2:\n\n1d:44:eb:e4:1f:1c:80:2e:e2:72:52:e0:99:94:8a:\n\n1a:27:9b:41:d1:89:00:4c:41:c4:c9:1b:0b:72:7b:\n\n59:62:c7:70:1f:53:fe:36:65:e2:36:0d:8c:1f:99:\n\n59:f5:b1:0e:93:b6:13:31:fc:15:28:da:ad:1d:a5:\n\nf4:2c:93:b2:02:4c:78:35:1d:03:3c:e1:4b:0d:03:\n\n8d:5b:d3:8e:85:94:a4:47:1d:d5:ec:f0:b7:43:6f:\n\n47:1e:1c:a2:29:50:8f:26:c3:96:d6:5d:66:36:dc:\n\n0b:ec:a5:fe:ee:47:cd:7b:40:9e:7c:1c:84:59:f4:\n\n81:b7:5b:5b:92:f8:dd:78:fd:b1:06:73:e3:6f:71:\n\n84:d4:60:3f:a0:67:06:8e:b5:dc:eb:05:7c:58:ab:\n\n1f:61\n\nExponent: 65537 (0x10001)\n\n\n-----\n\nThe executable dispci.exe appears to be derived from the code base of the legitimate utility\nDiskCryptor. It acts as the disk encryption module which also installs the modified bootloader\nand prevents the normal boot-up process of the infected machine.\n\nAn interesting detail that we noticed when analyzing the sample of this threat: it looks like the\ncriminals behind this malware are fans of the famous books & TV show series Game Of\nThrones. Some of the strings used throughout the code are the names of different characters\nfrom this series.\n\n**_Dragon names from Game Of Thrones_**\n\n\n-----\n\n**_Character name from Game Of Thrones_**\n\n## Encryption scheme\n\nAs we mentioned, the Bad Rabbit ransomware encrypts a victim’s files and disk. Files are\nencrypted with the following algorithms:\n\n1. AES-128-CBC\n2. RSA-2048\n\nIt is a default encryption scheme for ransomware.\n\nAn interesting fact is that the ransomware enumerates all running processes and compares\nthe hashed name of each process with embedded hash values. It is important to mention\nthat the hashing algorithm is similar to the ExPetr one.\n\nComparing of Bad Rabbit and ExPetr hashing routines\n\nSpecial branch\n\n\n-----\n\nRuntime flags initialization routine\n\nThe full list of embedded hashes of process names:\n\n**Hash** **Process name**\n\n0x4A241C3E dwwatcher.exe\n\n0x923CA517 McTray.exe\n\n\n-----\n\n0x966D0415 dwarkdaemon.exe\n\n0xAA331620 dwservice.exe\n\n0xC8F10976 mfevtps.exe\n\n0xE2517A14 dwengine.exe\n\n0xE5A05A00 mcshield.exe\n\nThe partitions on the victim’s disks are encrypted with the help of the DiskCryptor driver\ndcrypt.sys (which is installed into C:Windowscscc.dat). The ransomware sends the\nnecessary IOCTL codes to this driver. Some functions are taken as is from the sources of\nDiskCryptor (drv_ioctl.c), others seem to be implemented by the malware developers.\n\nThe disk partitions on the infected machine are encrypted by the DiskCryptor driver using the\nAES cipher in XTS mode. The password is generated by dispci.exe using the WinAPI\nfunction CryptGenRandom and has a length of 32 symbols.\n\n## Decryption opportunity assessment\n\nUnlike ExPetr, the evidence suggests that Bad Rabbit is not intended as a wiper. Previously,\n[in our article we wrote that the threat actors behind ExPetr were technically unable to decrypt](https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/)\nMFT that was encrypted with the GoldenEye component. In the case of Bad Rabbit,\nhowever, the malware algorithm suggests that the threat actors have the technical means to\ndecrypt the password necessary for disk decryption.\n\nThe data shown on the screen of an infected machine as “personal installation key#1” is an\nencrypted by RSA-2048 and base64-encoded binary structure that contains the following\ninformation gathered from the infected system:\n\nThe threat actors can use their own private RSA key to decrypt this structure. After\ndecryption they can send this information to the victim.\n\n\n-----\n\n**Please note that, despite what it says in other vendors reports, the value of the id**\n**field which is passed to dispci.exe is just a 32-bit number used to distinguish different**\n**infected machines, and not the AES key which is used for disk encryption.**\n\nAs part of our analysis, we extracted the password generated by the malware during a\ndebugging session and attempted to enter this password when the system was locked after\nreboot. The password indeed worked and the boot-up process continued.\n\nUnfortunately, we have to conclude that at this point there’s no way to decrypt disk and victim\nfiles without the threat actor’s RSA-2048 private key. The symmetric encryption keys are\nsecurely generated on the ransomware side which makes attempts to guess the keys\nunfeasible in practice.\n\nHowever, we found a flaw in the code of dispci.exe: the malware doesn’t wipe the generated\npassword from the memory, which means that there is a slim chance to extract it before the\ndispci.exe process terminates. In the picture below, note that while the variable dc_pass\n(which will be passed to the driver) is securely erased after use, that’s not the case for the\nvariable rand_str which holds the original copy of the password.\n\n\n-----\n\nPseudocode of the procedure that generates the password and encrypts the disk partitions\n\n## File encryption\n\nAs we wrote before, the trojan uses a common file encryption scheme. It generates a\nrandom 32-bytes-length string and uses it in the key derivation algorithm. Unfortunately, the\ntrojan uses the CryptGenRandom function when generating this string.\n\n\n-----\n\nKey derivation algorithm\n\nThe encrypted password, along with information about the infected system is written into\nReadme file as “personal installation key#2”.\n\n\n-----\n\nRansom note creation routine\n\nAn interesting fact is that the trojan cannot encrypt files which have a Read-only attribute.\n\n## File recovery possibility\n\nWe have discovered that Bad Rabbit does not delete shadow copies after encrypting the\nvictim’s files. It means that if the shadow copies had been enabled prior to infection and if the\nfull disk encryption did not occur for some reason, then the victim can restore the original\nversions of the encrypted files by the means of the standard Windows mechanism or 3rdparty utilities.\n\n\n-----\n\nShadow copies remain unharmed by Bad Rabbit\n\n## Recommendations\n\nKaspersky Lab corporate customers are also advised to:\n\nmake sure that all protection mechanisms are activated as recommended; and that\nKSN and System Watcher components (which are enabled by default) are not disabled.\nupdate the antivirus databases immediately.\n\nThe abovementioned measures should be sufficient. However, as additional precautions we\nadvise the following:\n\nrestricting execution of files with the paths c:windowsinfpub.dat and\n**C:Windowscscc.dat in Kaspersky Endpoint Security.**\nconfiguring and enabling Default Deny mode in the Application Startup Control\ncomponent of Kaspersky Endpoint Security to ensure and enforce proactive defense\nagainst this and other attacks.\n\nKaspersky Lab products detect this threat with the following verdicts:\n\nTrojan-Ransom.Win32.Gen.ftl\nTrojan-Ransom.Win32.BadRabbit\nDangerousObject.Multi.Generic\n\n\n-----\n\nPDM:Trojan.Win32.Generic\nIntrusion.Win.CVE-2017-0147.sa.leak\n\n**IOCs:**\nhttp://1dnscontrol[.]com/\nfbbdc39af1139aebba4da004475e8839 – install_flash_player.exe\n1d724f95c61f1055f0d02c2154bbccd3 – C:Windowsinfpub.dat\nb14d8faf7f0cbcfad051cefe5f39645f – C:Windowsdispci.exe\n\n[BadRabbit](https://securelist.com/tag/badrabbit/)\n[Drive-by attack](https://securelist.com/tag/drive-by-attack/)\n[Encryption](https://securelist.com/tag/encryption/)\n[ExPetr](https://securelist.com/tag/expetr/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n\nAuthors\n\n[Orkhan Mamedov](https://securelist.com/author/orkhanmamedov/)\n\nFedor Sinitsyn\n\nAnton Ivanov\n\nBad Rabbit ransomware\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-24 - Bad Rabbit ransomware.pdf"
    ],
    "report_names": [
        "2017-10-24 - Bad Rabbit ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535572,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653752239,
    "ts_modification_date": 1653752239,
    "files": {
        "pdf": "https://archive.orkl.eu/da4655da36d9c811ee1857ff34d5f5cdad153414.pdf",
        "text": "https://archive.orkl.eu/da4655da36d9c811ee1857ff34d5f5cdad153414.txt",
        "img": "https://archive.orkl.eu/da4655da36d9c811ee1857ff34d5f5cdad153414.jpg"
    }
}