{
    "id": "ea014078-a56f-4d4b-be1d-1f5cd4f8939e",
    "created_at": "2023-01-12T15:03:51.760802Z",
    "updated_at": "2025-03-27T02:16:01.137884Z",
    "deleted_at": null,
    "sha1_hash": "176cd4a98a3bad0ed26c77cfb15f9df5ab1a7cef",
    "title": "2017-10-12 - BRONZE BUTLER Targets Japanese Enterprises",
    "authors": "",
    "file_creation_date": "2022-05-28T21:55:17Z",
    "file_modification_date": "2022-05-28T21:55:17Z",
    "file_size": 484916,
    "plain_text": "# BRONZE BUTLER Targets Japanese Enterprises\n\n**[secureworks.com/research/bronze-butler-targets-japanese-businesses](https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses)**\n\nCounter Threat Unit Research Team\n\n_Secureworks® Counter Threat Unit™ Threat Intelligence Thursday, October 12, 2017 By: Counter_\n_Threat Unit Research Team_\n\n## Summary\n\n\n-----\n\nSecureworks® incident responders and Counter Threat Unit (CTU) researchers investigated\n[activities associated with the BRONZE BUTLER (also known as Tick) threat group, which likely](http://www.symantec.com/connect/ja/blogs/tick)\noriginates in the People's Republic of China (PRC). BRONZE BUTLER's operations suggest a longstanding intent to exfiltrate intellectual property and other confidential data from Japanese\norganizations. Intrusions observed by CTU™ researchers indicate a focus on networks involved in\ncritical infrastructure, heavy industry, manufacturing, and international relations.\n\n[CTU researchers divided the threat intelligence about this threat group into two sections: strategic and](https://www.gartner.com/doc/2487216/definition-threat-intelligence)\ntactical. Executives can use the strategic assessment of the ongoing threat to determine how to reduce\nrisk to their organization's mission and critical assets. Computer network defenders can use the tactical\ninformation gathered from incident response investigations and research to reduce the time and effort\nassociated with responding to the threat group's activities.\n\n## Key points\n\nAnalysis of BRONZE BUTLER's operations, targeting, and capability led CTU researchers to\nassess that it is likely that the group is located in the PRC.\nThe group has used spearphishing, strategic web compromises (SWCs), and an exploit of a zeroday vulnerability to compromise targeted systems.\nAfter exfiltrating targeted data from a network, BRONZE BUTLER typically deletes evidence of its\nactivities. However, it maintains access to compromised environments when possible, periodically\nrevisiting compromised sites to identify new opportunities for data exfiltration.\nThe threat actors seemingly have the capability to develop and deploy their own proprietary\nmalware tools. The group's command and control (C2) protocols are encrypted, presenting\nchallenges for network defenders and incident responders.\n\n## Strategic threat intelligence\n\nAnalysis of a threat group's targeting, origin, and competencies can determine which organizations\ncould be at risk. This information can help organizations make strategic defensive decisions regarding\nthis threat.\n\n### Intent\n\nCTU analysis indicates that BRONZE BUTLER primarily targets organizations located in Japan. The\nthreat group has sought unauthorized access to networks of organizations associated with critical\ninfrastructure, heavy industry, manufacturing, and international relations. Secureworks analysts have\nobserved BRONZE BUTLER exfiltrating the following categories of data:\n\nIntellectual property related to technology and development\nProduct specification\nSensitive business and sales-related information\nNetwork and system configuration files\nEmail messages and meeting minutes\n\n\n-----\n\nThe focus on intellectual property, product details, and corporate information suggests that the group\nseeks information that they believe might be of value to competing organizations. The diverse targeting\nsuggests that BRONZE BUTLER may be tasked by multiple teams or organizations with varying\npriorities.\n\n### Attribution\n\nThe following characteristics led CTU researchers to assess that it is likely that BRONZE BUTLER\noriginates in the PRC:\n\nUse of T-SMB Scan tools published on a Chinese developer's website\nChinese characters in the installation service name of an early version of the xxmm backdoor\n[Documented links between BRONZE BUTLER's Daserf tool and the PRC-based NCPH hacking](https://www.lac.co.jp/english/report/pdf/cgview_vol2_en.pdf)\ngroup, and a decrease in BRONZE BUTLER activity during PRC national holidays\n\nPRC-based cyberespionage groups have historically sought intellectual property and economic\nintelligence from competing economies to deliver information which can provide a competitive\nadvantage domestically. The demand for this type of intelligence gathering could be influenced by\n[China’s ambitious economic growth goals.](http://www.nytimes.com/2013/06/05/opinion/global/xi-jinpings-chinese-dream.html)\n\n### Capability\n\nBRONZE BUTLER has used a broad range of publicly available (Mimikatz and gsecdump) and\nproprietary (Daserf and Datper) tools. It appears to have been sufficiently resourced to continuously\ndevelop and replace its proprietary tools over a long period of time. The threat actors developed remote\naccess tools and malware that generate and use encrypted C2 communication, presumably to\ncomplicate detection and mitigation. The threat actors are also fluent in Japanese, crafting phishing\nemails in native Japanese and operating successfully within a Japanese-language environment.\n\nCTU analysis indicates that BRONZE BUTLER purchases a subset of its C2 infrastructure. A large\npercentage of this infrastructure is hosted in Japan, possibly to avoid scrutiny from security agencies\nthat monitor international communications. The group periodically changes the C2 IP addresses and\ndomains for each compromised network, which can limit the effectiveness of blacklisting the group's\ninfrastructure. The group also supplements its operational infrastructure with access to compromised\nwebsites. The breadth and complexity of BRONZE BUTLER's operational infrastructure suggests that\nthe group may have access to a dedicated infrastructure acquisition function.\n\nThe group has demonstrated the ability to identify a significant zero-day vulnerability within a popular\nJapanese corporate tool and then use scan-and-exploit techniques to indiscriminately compromise\nJapanese Internet-facing enterprise systems. The threat actors appear to use these initial footholds to\nselect organizations of interest for further compromise. The group is attentive to changes in\ncompromised networks and proactively attempts to avoid scrutiny from network defenders by modifying\ntools and methods. It has remained undetected in several compromised networks for up to five years.\n\n## Tactical threat intelligence\n\nIncident response engagements have given CTU researchers insight into the tools and tactics that\nBRONZE BUTLER employs during intrusions.\n\n\n-----\n\n### Tools\n\nCTU researchers have observed BRONZE BUTLER leveraging the following tools that appear to be\nexclusive to the group. Figure 1 shows the threat group's use of some proprietary tools between 2012\nand 2017.\n\n_Figure 1. Timeline of malware used by BRONZE BUTLER. (Source: Secureworks)_\n\nDaserf — This backdoor has the functionality of a remote shell and can be used to execute\ncommands, upload and download data, capture screenshots, and log keystrokes. It uses RC4\nencryption and custom Base64 encoding to obfuscate HTTP traffic. CTU researchers identified\ntwo versions of Daserf written in Visual C and Delphi. Analysis of the compile timestamps suggest\nthat Delphi version is the successor to the Visual C version. CTU analysis suggests that the\nfollowing registry entry is an indication of a Delphi-based Daserf infection:\n\nKey: HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\n\nValue: MMID = <random hex string>\nDatper — BRONZE BUTLER likely created this Delphi-coded RAT to replace Daserf. Datper uses\nan RC4-encrypted configuration to obfuscate HTTP traffic.\n\n\n-----\n\nxxmm (also known as Minzen) — This RAT and likely successor to Daserf AES-encrypts HTTP\ncommunications using a one-time encryption key. As of this publication, BRONZE BUTLER\ndemonstrates a preference for concurrently using Datper and xxmm in its operations. CTU\nresearchers identified an xxmm builder for xxmm (see Figure 2), which suggests that the threat\nactors customize the xxmm malware settings based on the target.\n\n_Figure 2. Customizable settings in an xxmm builder. (Source: Secureworks)_\n\nxxmm downloader (also known as KVNDM) — This simple downloader's code is similar to the\nmain xxmm payload.\nGofarer — This downloader uses the “Mozilla/4.0+\n(compatible;+MSIE+8.0;+Windows+NT+6.1;+Trident/4.0;” User-Agent in its HTTP communication\n(see Figure 3).\n\n_Figure 3. Gofarer HTTP GET request. (Source: Secureworks)_\n\nMSGet — This persistent downloader uses a dead-drop resolver (DDR) to download and execute\nanother malicious payload. MSGet typically downloads encoded binaries from hard-coded URLs.\nAfter decoding, MSGet saves the binary as %TEMP%\\ms<hex string>.exe and executes it.\n\n\n-----\n\n[DGet — This simple downloader (see Figure 4) is similar to the wget web server retrieval tool.](https://en.wikipedia.org/wiki/Wget)\n\n_Figure 4. DGet usage. (Source: Secureworks)_\n\nScreen Capture Tool— This tool can capture the desktop of a victim's system (see Figure 5).\n\n_Figure 5. Screen Capture Tool usage. (Source: Secureworks)_\n\nRarStar — This custom tool uploads RAR archives to a specified URL as POST data (see Figure\n6). RarStar encodes the POST data using Base64 and a custom XOR algorithm.\n\n_Figure 6. RarStar HTTP POST request. (Source: Secureworks)_\n\nBRONZE BUTLER has also used the following publicly available tools, but CTU researchers\ndetermined that the group modified most of them. Analysis of the files identified the use of\nmultiple packers, adjusted functionality in the source code, and recompilation.\n\nMimikatz — This tool retrieves passwords from memory.\nWindows Credential Editor (WCE) — This tool obtains passwords from memory.\ngsecdump — This tool obtains passwords from memory.\nT-SMB Scan — This SMB scanning tool was originally published on a Chinese programsharing website (pudn.com). BRONZE BUTLER removed its help message functionality.\nWinRAR — This tool extracts tools for lateral movement and compresses data for\nexfiltration.\n\n### Tactics, techniques, and procedures\n\nIncident response engagements have given CTU researchers insight into the tactics that\nBRONZE BUTLER employs during intrusions\n\n\n-----\n\n**Delivery**\n\nBRONZE BUTLER uses spearphishing emails and SWCs to compromise target networks, often\nleveraging Flash. The group has used phishing emails with Flash animation attachments to\n[download and execute Daserf malware, and has also leveraged Flash exploits for SWC attacks.](https://www.symantec.com/connect/blogs/tick-cyberespionage-group-zeros-japan)\n\nCTU researchers observed BRONZE BUTLER using compromised websites, typically located in\nJapan and South Korea, as part of its attack infrastructure. The group has demonstrated a\ncapability to compromise and leverage a large number of websites in its campaigns. Based on\nthe large quantity of C2 servers and varying IP addresses used during the same operation, the\ngroup also appears to purchase attack infrastructure. BRONZE BUTLER has leveraged a distinct\nattack infrastructure for different targets, suggesting that the group proactively segments\noperational infrastructure to minimize the risk of attribution by security researchers.\n\n**Exploitation**\n\nWhile investigating a 2016 intrusion, Secureworks incident responders identified BRONZE\nBUTLER exploiting a then-unpatched remote code execution vulnerability (CVE-2016-7836) in\n[SKYSEA Client View, a popular Japanese product used to manage an organization's IT assets.](http://www.skyseaclientview.net/)\n[SKY Corporation announced the vulnerability on December 21, 2016, but entries in the victim's](http://www.skygroup.jp/security-info/161221.html)\nSKYSEA Client View default log (CtlCli.log) show that the group had exploited the issue since at\nleast June 2016 (see Figure 7).\n\n_Figure 7. SKYSEA Client View log entries resulting from CVE-2016-7836 exploitation. (Source:_\n_Secureworks)_\n\nThis vulnerability can be exposed when a portable connection device, such as an LTE USB\nmodem, is connected to corporate devices. It is common for remote Japanese workers to use\nportable connection devices to connect to the Internet and corporate VPNs. However, some of\nthese devices assign the ISP's global IP address to the connected laptop. Threat actors could\nexploit the vulnerability to impersonate the management console, and compromise the laptop's\nSKYSEA agent that is exposed on the Internet.\n\nBRONZE BUTLER conducted periodic Internet scans to find vulnerable hosts. CTU researchers\nverified that some exploited systems were not subject to further compromise or lateral movement.\nThis outcome suggests that the group may deploy malware to all identified vulnerable systems,\nbut then pursues specific targets after validating the system's association with organizations of\ninterest.\n\n**Installation**\n\nThe threat actors use multiple custom downloaders that rely on executable files (Gofarer, MSGet,\nand xxmm downloader), PowerShell scripts, or VBS/VBE scripts. These downloaders use HTTP\ntraffic, download an additional payload such as Daserf, Datper, or xxmm in a compressed and\nencoded format, and typically execute the downloaded malware after decoding the file.\n\n\n-----\n\nCTU researchers identified the code in Figure 8 within a downloader program. This code inserts\n‘0' characters at the end of the executable file to inflate the file size to 50-100 MB, likely to evade\nantivirus software detection. When analyzing BRONZE BUTLER incidents, CTU researchers\nobserved several antivirus tools skip scanning of inflated files.\n\n_Figure 8. Downloader malware code used to inflate payload file size. (Source: Secureworks)_\n\nCTU researchers also observed BRONZE BUTLER copying downloader source code to a file\n(do.cs) on a compromised system and then compiling it into an executable file (do.exe). The\ndecrypted proxy log shows the threat actors compiling custom code on the compromised system\n(see Figure 9).\n\n_Figure 9. Decrypted proxy log showing compilation of custom code on compromised endpoint._\n_(Source: Secureworks)_\n\n**Command and control (C2) communication**\n\nDaserf, Datper, and xxmm communicate with C2 servers via HTTP, encrypting commands and\ndata using the algorithms in Table 1. The tools use an Internet Explorer component to bypass\nproxy authentication as long as the compromised system communicates during the authorized\ntimes defined by the proxy server.\n\n**Malware** **HTTP methods** **Encryption algorithm**\n\nDaserf (Visual C) POST RC4\n\nDaserf (Delphi) GET (POST for large data) RC4\n\nDatper GET (POST for large data) RC4\n\nxxmm GET (POST for large data) RC4\n\nAES with one-time encryption key\n\n_Table 1. Daserf, Datper, and xxmm encryption algorithms._\n\n\n-----\n\nBRONZE BUTLER uses unique C2 servers for each tool and changes C2 servers periodically. A\nlarge proportion of the group's C2 servers are hosted in Japan. The presence of certain URL\npatterns in proxy logs (see Table 2) can reveal BRONZE BUTLER activity.\n\n**Malware** **URL pattern** **User-Agent**\n\n\nDaserf http://<domain/path>.gif\nhttp://<domain/path>.asp\nhttp://<domain/path>.php?id=<8-digit hex string>&<4\n_lowercase characters>=<string similar to Base64-encoded_\n_string>_\n\nDatper http://<domain/path>.php?<lowercase characters>=<16_digit hex string>1<random string>_\nhttp://<domain/path>.php?<lowercase characters>=<16_digit hex string>2<string similar to Base64-encoded_\n_string>_\n\nxxmm http://<domain/path>.php?t0=<8-digit hex string>>&t1=\n_<number>&t2=<8-digit hex string>&t3=<number>&t6=_\n_<number>_\nhttp://<domain/path>.php?id0=<8-digit hex string>&id1=\n_<number>&id2=<8-digit hex string>id3=<number>&id6=_\n_<number>_\nhttp://<domain/path>.php?idcard0=<8-digit hex\n_string>idcard1=<number>&idcard2=<8-digit hex_\n_string>&idcard3=<number>&idcard6=<number>_\nhttp://<domain/path>.php?item0=<8-digit hex\n_string>&item1=<number>&item2=<8-digit hex_\n_string>&item3=<number>&item6=<number>_\nhttp://<domain/path>.php?ps0=<8-digit hex string>&ps1=\n_<number>&ps2=<8-digit hex string>&ps3=_\n_<number>&ps6=<number>_\nhttp://<domain/path>.php?h=<8-digit hex string>&o=\n_<number>&w=<8-digit hex string>&a=<number>&y=_\n_<number>_\nhttp://<domain/path>/id0/<8-digit hex\n_string>/id1/<number>/id2/<8-digit hex_\n_string>/id3/<number>/id6/<number>/<random filename>_\n\n_Table 2. URL patterns related to BRONZE BUTLER activity._\n\n\nMozilla/4.0\n(compatible; MSIE 8.0;\nWindows NT 6.0; SV1)\nInternet Explorer\nversion number may\nvary\n\nMozilla/4.0\n(compatible; MSIE 8.0;\nWindows NT 6.0; SV1)\n\n\nBRONZE BUTLER leverages the remote access capabilities in these tools, often using existing\nPC vendors' directories such as C:\\DELL and C:\\HP as working directories in compromised\nenvironments. CTU researchers have also observed threat actors using the following working\ndirectories:\n\nC:\\Intel\\\nC:\\Intel\\Logs\\\nC:\\Intel\\ExtremeGraphics\\CUI\\\nC:\\PerfLogs\\Admin\\\n\n**Credential access**\n\n\n-----\n\nBRONZE BUTLER uses credential theft tools such as Mimikatz and WCE to steal authentication\ninformation from the memory of compromised hosts. Several xxmm samples analyzed by CTU\nresearchers incorporate Mimikatz, allowing the threat actors to issue Mimikatz commands directly\nfrom xxmm (see Figure 10). In addition, xxmm incorporates a UAC bypass tool for privilege\nescalation prior to stealing passwords.\n\n_Figure 10. Mimikatz command in xxmm. (Source: Secureworks)_\n\nCTU analysis revealed BRONZE BUTLERcreating forged Kerberos Ticket Granting Ticket (TGT)\nand Ticket Granting Service (TGS) tickets (also called golden and silver tickets, respectively) to\nmaintain administrative access. Figure 11 shows an example of the threat actors creating a\ngolden ticket.\n\n_Figure 11. Kerberos golden ticket created by BRONZE BUTLER. (Source: Secureworks)_\n\nGolden tickets require a username, but the domain controller does not validate that it is\nlegitimate. CTU researchers detected BRONZE BUTLER using the following usernames for\ngolden tickets:\n\nbgtras\nbgtrs\nkkir\nkisetr\nnetkin\norumls\nwert\n\n**Host enumeration**\n\nThe threat actors typically use built-in Windows ping and net commands for network and host\nenumeration activity to eventually contact the file-share server (see Figure 12). BRONZE\nBUTLER also uses the T-SMB Scan tool to list available SMB hosts, and screen-capture tools to\nobtain additional information.\n\n\n-----\n\n_Figure 12. Host enumeration by BRONZE BUTLER. (Source: Secureworks)_\n\n**Lateral movement**\n\nAfter compromising a host, the threat actors attempt to compromise other connected systems to\nmove within the network. BRONZE BUTLER typically uses the following procedure for lateral\nmovement:\n\n1. Use ‘net use' and ‘copy' commands to transfer a malicious file (such as malware) from the\n\ncompromised host to a target system on the same network.\n2. Use the ‘net time' command to check the local time on the target system.\n3. Use the ‘at' or ‘schtask' commands to register a scheduled task to be executed in a few minutes.\n4. After a few minutes, execute the malicious file on the system.\n\nThe malicious file is typically a batch file that downloads malware and registers the malware's\nautomatic execution in the registry. Figure 13 shows the scheduled task that executes zrun.bat (a batch\nfile) using the at command.\n\n_Figure 13. Scheduled task registration. (Source: Secureworks)_\n\nFigure 14 shows the batch file (zrun.bat) executing, which adds a registry entry that auto-executes the\nmalware.\n\n_Figure 14. Registry entry added to auto-execute malware. (Source: Secureworks)_\n\nCTU researchers have also observed BRONZE BUTLER giving malware the same name as an\nexisting document file on the file share server to cause users to unwittingly launch and install the\nmalware on additional systems (see Figure 15).\n\n\n-----\n\n_Figure 15. Malware given the same name as an existing document file. (Source: Secureworks)_\n\n**Exfiltration**\n\nBRONZE BUTLER typically creates a list of files (i.e., a shopping list) from compromised hosts and fileshare servers. If the list is short, the group exfiltrates the files directly. For large lists, the threat actors\nuse the following procedure:\n\n1. Use malware to upload the large list of enumerated files to the C2 server.\n2. Select specific files to steal, creating a new list.\n3. Use downloaders or other malware to send the new list to a compromised host.\n4. Use archiving software to collect files in a password-protected archive.\n5. Use an uploader or other malware to send the archived files to an attacker-controlled server. The\n\nuploader software is proprietary to this group, but Datper and xxmm also contain an uploading\nfeature. When exfiltration is complete, the uploader (or Datper or xxmm) immediately uses the del\ncommand to delete the RAR archives.\n\nFigure 16 shows BRONZE BUTLER extracting a new list of files and archiving a specific file into RAR\nformat for exfiltration.\n\n_Figure 16. Extracting a new file list and archiving a targeted file for exfiltration. (Source: Secureworks)_\n\nThe group uses a password to encrypt files for RAR archiving. CTU researchers have observed the\nfollowing passwords used in BRONZE BUTLER network compromises:\n\n1234qwer\n1234qwer!\n1234$%qwer\n1qazxsw2\n1qazxcde32ws\n\n\n-----\n\n## Conclusion\n\nBRONZE BUTLER compromises organizations to conduct cyberespionage, primarily focusing on\nJapanese enterprises. Initial attack vectors include spearphishing emails, SWCs, and exploiting\nvulnerability in software commonly used by Japanese businesses. The group can override security\ncontrols to exfiltrate intellectual property, and victims should formulate a solid eviction plan before\nengaging with the threat actors to prevent them from reentering the network.\n\nCTU researchers recommend that organizations, particularly those whose assets and intellectual\nproperty could be valuable to BRONZE BUTLER, implement the following security practices:\n\nReview proxy log settings to ensure they capture information such as HTTP parameters and\nUser-Agents for future analysis. Search proxy log files for evidence of web server scanning using\nthe URL patterns associated with BRONZE BUTLER activity.\n[Use an advanced endpoint threat detection (AETD) solution to monitor activity on network](https://www.secureworks.com/capabilities/managed-security/endpoint-security/endpoint-threat-detection)\n[endpoints. Install a background monitor tool (e.g., Sysmon) to log detailed Windows event](https://technet.microsoft.com/en-us/sysinternals/sysmon)\ninformation to assist with incident response.\nImplement timely vulnerability patching and system updates. Update SKYSEA Client View\nimplementations to the latest version as soon as possible.\nReview network access control. In particular, review network access for use of mobile USB\nmodems on corporate systems. Also implement strict security controls for privileged accounts\nsuch as Active Directory administrator to prevent access by an unauthorized user.\n\n## Threat indicators\n\nThe indicators in Table 3 are associated with BRONZE BUTLER activity. The URLs may contain\nmalicious content, so consider the risks before opening them in a browser.\n\n**Indicator** **Type** **Context**\n\n\n795327de450e7f1e371a019a3d43673b60df4b7bf91138afa9ddc3913384f913 SHA256\nhash\n\nc043c28ea0d767055a8f8d4e94a9acdf62a81927b0ae63b8a9f16288f92cd093 SHA256\nhash\n\n4d7ce20a8d5bc05b7d4b1e147174f486033805260db1edbbc2516fced7558bcc SHA256\nhash\n\n1ca3b1b259681bca70956139d25a559ccd0b0c04d4f45f08fb954e569aabf9ae SHA256\nhash\n\n08e49c1d476aefb4c590cf135229d6da7981c7425e547d4f2877d79c1a1ab601 SHA256\nhash\n\n6a63cb7089480fa76b784ca7043e147332768bccc39b84249af11f05b0dde66f SHA256\nhash\n\n026f5c37f0d633ab27b83082dd0e818edbd80c27f86ba12b5cf32b425edb92d0 SHA256\nhash\n\n\nMSGet\ndownloader\n\nMSGet\ndownloader\n\nMSGet\ndownloader\n\nMSGet\ndownloader\n\nVBE\ndownloader\n\nVBE\ndownloader\n\nVBE\ndownloader\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n21111136d523970e27833dd2db15d7c50803d8f6f4f377d4d9602ba9fbd355cd SHA256\nhash\n\n15abe7b1355cd35375de6dde57608f6d3481755fdc9e71d2bfc7c7288db4cd92 SHA256\nhash\n\n2bdb88fa24cffba240b60416835189c76a9920b6c3f6e09c3c4b171c2f57031c SHA256\nhash\n\n85544d2bcaf8e6ca32bbc0a9e9583c9db1dce837043f555a7ff66363d5858439 SHA256\nhash\n\nf8f31f73157bf049b318429c1d60ad7ff2851e62535d95cf8d121216b95c8602 SHA256\nhash\n\nb1690facbce9bcc66ebf18f138dbbc10c3662a2034c211e0c414e47c7e208b4a SHA256\nhash\n\ne620c9d19d7d1f609e0bb08465e4c58db97fd0158fb286d938542fc1f03a2302 SHA256\nhash\n\n2dc24622c1e91642a21a64c0dd31cbe953e8f77bd3d6abcf2c4676c3b11bb162 SHA256\nhash\n\na4afd9df1b4cc014c3a89d7b4a560fa3e368b02286c42841762714b23e68cc05 SHA256\nhash\n\ndab557bae0eb93475c2c2639f186fd717dd57d8d6354232838f44ba6b6a07172 SHA256\nhash\n\ndb6a6a4f675cba87405c9c7b016713d3e65b052ffc6c8963764a3d3788f432fa SHA256\nhash\n\n4b8ca82e6f407792cfb51de881f06b86bd4b59f85746b29c3287aee0015b1683 SHA256\nhash\n\ndb8b494de8d897976288c8ccee707ff7b7967fb48caef99d75687584191c2411 SHA256\nhash\n\ne2fd17445d81df89f7a9c1ff1c69c9b382215f597db5e4730f5c76557a6fd1f9 SHA256\nhash\n\n0a031665d05e82038d620facf9d4a86a89e78544f2f770f579c980dae2e252bf SHA256\nhash\n\nfa9a3341649e798bbc340ce9b2fe69791fe733aa9e46da666ce13b8cf7ca8f4d SHA256\nhash\n\nf06b440052bd2c2eb127c33c35a80c4eca34a06360d3ee1bb37348d6029dc955 SHA256\nhash\n\n2a39372dea901665ab9429d2f15b3f4fb10706423e177226539047ee1ac3e4a3 SHA256\nhash\n\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\nDaserf\n(Visual C)\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n4e15392553ca8e7d06f9f592eb04cf6dbfed18c98c56afc0ccd132465b270e12 SHA256\nhash\n\n89a80ca92600af64eb9c32cab4e936c7d675cf815424d72438973e2d6788ef64 SHA256\nhash\n\nb1bd03cd12638f44d9ace271f65645e7f9b707f86e9bcf790e0e5a96b755556b SHA256\nhash\n\n22e1965154bdb91dd281f0e86c8be96bf1f9a1e5fe93c60a1d30b79c0c0f0d43 SHA256\nhash\n\nb1fdc6dc330e78a66757b77cc67a0e9931b777cd7af9f839911eecb74c04420a SHA256\nhash\n\n67e32df3a460f005e7aec83b903f6d47d5533ff3843a97d186ad02316dff9fa9 SHA256\nhash\n\n2c449b562dfce53cf98acaddf37286cfb2d1e9da1536511a08bbd24ed93624a6 SHA256\nhash\n\n236848e301d71cab6e17a0503fb268f25412838eccb5fb17e78580d2d0a3a31d SHA256\nhash\n\nb0966e89eae36a309d89a0c15c8a07677f58130fdc76bc98c16968376ec80626 SHA256\nhash\n\n68e5013a8147e77e892dcd06687e5e815c3837fb83fbff16bac442c65b2f3e73 SHA256\nhash\n\ne2f174f8368b46054e6ec2feec00b878b63e331ba3628374d584b238a95fd770 SHA256\nhash\n\n7afb8082822bf3e55c6639ed2e272846c6be0e5c1fd40402b8b0f69e37402461 SHA256\nhash\n\n630aa710bb7080143498d7fafbb152bbfe581bf690d9bfad041e4e285f152de2 SHA256\nhash\n\nefa68fcbd455a72276062fb513b71547ea11fedf4db10a476cc6c9a2fa4f67f7 SHA256\nhash\n\n90ac1fb148ded4f46949a5fea4cd8c65d4ea9585046d66459328a5866f8198b2 SHA256\nhash\n\n331ac0965b50958db49b7794cc819b2945d7b5e5e919c185d83e997e205f107b SHA256\nhash\n\n12d9b4ec7f8ae42c67a6fd030efb027137dbe29e63f6f669eb932d0299fbe82f SHA256\nhash\n\n303b75a7c350d26116fe341d77105a33c8cb1da3dc82424c3eac401820e868dd SHA256\nhash\n\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDaserf\n(Delphi)\n\nDatper\n\nDatper\n\nDatper\n\nDatper\n\nDatper\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\n340906b6b3a4149875dea37221843cb8b67c51eb4520b39956cb6761ef0a3c5d SHA256\nhash\n\nb3cc83978bbc4f5603e93ec8c687a7007a3f7dbfbae01bff0a30332b06ea44d9 SHA256\nhash\n\n18e896a7547aacb33aa3941ab1b61659ed099c0f6fbb924068f81b4289b05f12 SHA256\nhash\n\n4d208c86c8331b7f1f6dd53f83af9ee4ec700a74792b419f663a3ce105d15d1c SHA256\nhash\n\n28894a78bc00d6774d1242925787d35c5c2ae2563f5f7f1ff38dc0b441a15812 SHA256\nhash\n\n747041d73b3eb29dde5c9e31efdd5e675f16f182c23999ed5613be0e9be12351 SHA256\nhash\n\n15b4c1d29b41531b255e41d39d194a52bdc98a3b65a13771d8caf92372b324ce SHA256\nhash\n\nac501bb7e9e1bc57dd027d152f4a7c473f108e37023aae4bad64117241963b5c SHA256\nhash\n\n7197de18bc5a4c854334ff979f3e4dafa16f43d7bf91edfe46f03e6cc88f7b73 SHA256\nhash\n\nfe06b99a0287e2b2d9f7faffbda3a4b328ecc05eab56a3e730cfc99de803b192 SHA256\nhash\n\ne94a7e835c657dd8a82dab5705db0ec279d1de97a3524f0e25e1e3d78f0561b8 SHA256\nhash\n\n09df0591a885b8d16767820c9eac51a5dd8099a4b17a46bffe38b315a6e29d0b SHA256\nhash\n\n7333f4601379d5877ec1416e4d82654d312210d5bcf4d628b98207a737bdb654 SHA256\nhash\n\n425616f2958ba176662eb9bd66259fb38ca513b5831f0a07956b22839d915306 SHA256\nhash\n\n46eae3931334468246c728a7e0ab3bbfafe40c9f73f80bf0544b8aa649227d60 SHA256\nhash\n\nde18ebedc5b29d66244773dda80b22ecf2c453cdbeaa85149c4ff0e96bdc4478 SHA256\nhash\n\n70ef2e2fa3ac2c44a34963aca5dfe79e2b4f51795181374cca63bbf789f8a7f0 SHA256\nhash\n\nb11941e0510e02283e7732a72f853027ea9271a2d4dc87d736ae33275eab2806 SHA256\nhash\n\n\nDatper\n\nDatper\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\n\nxxmm\ndownloader\n\nxxmm\ndownloader\n\nxxmm\ndownloader\n\n\n-----\n\n**Indicator** **Type** **Context**\n\n\nbd81521445639aaa5e3bcb5ece94f73feda3a91880a34a01f92639f8640251d6 SHA256\nhash\n\n0fc1b4fdf0dc5373f98de8817da9380479606f775f5aa0b9b0e1a78d4b49e5f4 SHA256\nhash\n\n\nDGet\n\nRarStar\n\n\nhttp://115.144.166.240/ URL Daserf\n(Delphi) C2\nserver\n\nhttp://203.111.252.40/ URL Daserf\n(Delphi) C2\nserver\n\nhttp://27.255.69.209/ URL Daserf\n(Delphi) C2\nserver\n\nhttp://27.255.91.238/ URL Daserf\n(Delphi) C2\nserver\n\nhttp://106.184.5.30/ URL Daserf\n(Delphi) C2\nserver\n\nhttp://airsteel.co.jp/cgi-bin/search/02/06_cgi.php URL Datper C2\nserver\n\nhttp://gigasolar.jp/images/blog/20131011news-3.php URL Datper C2\nserver\n\nhttp://www.atnet-photo.com/japan/themes/default/themes.php URL Datper C2\nserver\n\nhttp://www.primeob.com/include/mpage/store.php URL Datper C2\nserver\n\nhttp://baby.ests.jp/Templates/themes.php URL Datper C2\nserver\n\nhttp://www.kamomeza.net/coppermine/images/thumb_dom.php URL xxmm C2\nserver\n\nhttp://noukankyo.org/images/about/soshikizu.php URL xxmm C2\nserver\n\nhttp://jmta.co.jp/module/Template/Plugin/Math.php URL xxmm C2\nserver\n\nhttp://i-frontierasia.com/shiryoku/link.php URL xxmm C2\nserver\n\nhttp://leadoffnet.com/img/top/top_12.php URL xxmm C2\nserver\n\n\n-----\n\n**Indicator** **Type** **Context**\n\nhttp://www.concierge.com.cn/public_html/wp-content/themes/comment.php URL xxmm C2\nserver\n\nhttp://www.wco-kyousai.com/ex-engine/themes/xe_default/conf/info.php URL xxmm C2\nserver\n\nhttp://angelbaby.jpn.cm/html/images/deleteComments.php URL xxmm C2\nserver\n\nhttp://www.infomiracle.info/TwitterQuest/image/ser.dat URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://160.16.243.147/images/CUI.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://160.16.243.147/images/ns.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://oan.jp/photo/logo_new.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://oan.jp/photo/logo_old.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://s-city.net/sport/pic1612.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://sha-sigma.com/led/aa.dat URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://www.s-city.net/images/beach6.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://www.stylmartin.co.jp/bdflashinfo/ns12.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\n\n-----\n\n**Indicator** **Type** **Context**\n\nhttp://www.stylmartin.co.jp/bdflashinfo/pageicons/6.jpg URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://www.slvcx.com/t.rar URL Used by\nBRONZE\nBUTLER to\nhost tools\n\nhttp://www.sinwa-jp.com/works/logo-unix.php URL BRONZE\nBUTLER\nexfiltration\npoint\n\nhttp://www.baiya.jp/2014dressnumber/images/logo-unix.php URL BRONZE\nBUTLER\nexfiltration\npoint\n\n_Table 3. BRONZE BUTLER indicators._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-12 - BRONZE BUTLER Targets Japanese Enterprises.pdf"
    ],
    "report_names": [
        "2017-10-12 - BRONZE BUTLER Targets Japanese Enterprises.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535831,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1653774917,
    "ts_modification_date": 1653774917,
    "files": {
        "pdf": "https://archive.orkl.eu/176cd4a98a3bad0ed26c77cfb15f9df5ab1a7cef.pdf",
        "text": "https://archive.orkl.eu/176cd4a98a3bad0ed26c77cfb15f9df5ab1a7cef.txt",
        "img": "https://archive.orkl.eu/176cd4a98a3bad0ed26c77cfb15f9df5ab1a7cef.jpg"
    }
}