{
    "id": "ea268041-513b-48df-a4b2-75e351c74122",
    "created_at": "2023-01-12T14:58:48.621337Z",
    "updated_at": "2025-03-27T02:13:34.254366Z",
    "deleted_at": null,
    "sha1_hash": "79d306e7a46d06a65ede75907afb15259600a933",
    "title": "2018-07-17 - Blackgear Cyberespionage Campaign Resurfaces, Abuses Social Media for C&C Communication",
    "authors": "",
    "file_creation_date": "2022-05-27T22:34:08Z",
    "file_modification_date": "2022-05-27T22:34:08Z",
    "file_size": 338840,
    "plain_text": "# Blackgear Cyberespionage Campaign Resurfaces\n\n**blog.trendmicro.com/trendlabs-security-intelligence/blackgear-cyberespionage-campaign-resurfaces-abuses-social-**\nmedia-for-cc-communication/\n\nJuly 17, 2018\n\nBlackgear (also known as Topgear and Comnie) is a cyberespionage campaign dating back\nto [2008, at least based on the Protux backdoor used by its operators. It targets organizations](http://www.theregister.co.uk/2013/03/01/sinkhole_research_uncovers_cyberspy_victims/)\nin Japan, South Korea, and Taiwan, leveling its attacks on public sector agencies and\n[telecommunications and other high-technology industries. In 2016, for instance, we found](https://blog.trendmicro.com/trendlabs-security-intelligence/blackgear-espionage-campaign-evolves-adds-japan-target-list/)\ntheir campaigns attacking Japanese organizations with various malware tools, notably the\nElirks backdoor. Blackgear’s operators are well-organized, developing their own tools, which\nwe observed to have been recently fine-tuned, based on their latest attacks.\n\nA notable characteristic of Blackgear is the degree to which its attacks are taken to evade\ndetection, abusing blogging, microblogging, and social media services to hide its commandand-control (C&C) configuration. Compared to when C&C information is embedded within\nthe malware, where it’s preset and can thus be easily blocked, this tactic lets Blackgear’s\noperators to quickly change C&C servers as needed. It can, in turn, prolong the campaign’s\nfoothold in the system and enable attackers to carry out further lateral movement.\n\nAnalyzing the Marade downloader (detected by Trend Micro as TSPY_MARADE.ZTBC) and\nthe version of Protux (BKDR_PROTUX.ZTBC) employed by Blackgear’s latest campaigns,\nwe found their encrypted configurations on blog and social media posts (see Figure 1). This\ncan be an indication that these malware tools were developed by the same group.\n\n\n-----\n\n_Figure 1. Marade s encrypted configuration on a Facebook post_\n\n_Figure 2. Infection chain of Blackgear’s attack_\n\n**Attack chain**\n\nTo paint a bigger picture of Blackgear’s attacks, we correlated the tools and tactics they used\nagainst their targets. Here’s a summary of Blackgear’s latest campaign:\n\n1. Use a decoy document or fake installer file, sent via spam email to lure a potential\n\nvictim into clicking it.\n2. The decoy document will extract the Marade downloader. It drops itself in the\n\nmachine’s Temp folder and increases its file size to over 50MB in order to bypass\ntraditional sandbox solutions.\n3. Marade will check if the infected host can connect to the internet and if it is installed\n\nwith anti-virus (AV) software.\n4. If the affected system can connect online and doesn’t have AV software, Marade will\n\nconnect to a Blackgear-controlled public blog or social media post to retrieve an\nencrypted C&C configuration. Otherwise, Marade will use the C&C information\nembedded in its code.\n5. The encrypted strings will pose as a magnet link to keep its malicious traffic from being\n\ndetected by AV software. Marade will then decrypt the encrypted strings and retrieve\nthe C&C server information.\n6. The C&C server will send Protux to the victim’s host and execute it. Protux, a known\n\nbackdoor, is executed by abusing the rundll32 dynamic-link library (DLL). It tests the\nhost’s network, retrieves the C&C server from another blog, and uses the RSA\nalgorithm to generate the session key and send information to the C&C server.\n\nBlackgear’s malware tools are delivered to targets using RAR self-extracting executable\n(SFX) files or office Visual Basic Script (VBScript) to create a decoy document. Below is a\nscreenshot of the SFX files and document used by the latest campaigns:\n\n_Figure 3. Contents of malicious SFX file used by Blackgear, posing as a Flash Player_\n_installer_\n\n_Figure 4. Malicious document used by Blackgear (top) and how VBScript is used to_\n_execute Marade (bottom)_\n\n_Figure 5. Encrypted configurations of Protux (top) and Marade (bottom) in the same blog_\n_post_\n\n**Correlating Marade and Protux**\n\n\n-----\n\nThe encrypted configurations of Marade and Protux can both be found on a single blog post.\nAs shown in Figure 5, the strings highlighted in red function as a search tag to identify the\nlocation of the configuration information; those highlighted in orange pertain to the encrypted\nconfiguration that Protux will retrieve.\n\nIn Blackgear’s previous campaigns, Protux’s configuration format had to be changed to\nanother version. For instance, Protux’s older iteration will look for the “++a++” tag, as shown\nin Figure 5. The format used by Protux’s latest version is now similar to Marade’s, as shown\nin Figure 6.\n\n_Figure 6. Protux’s encrypted configuration on a public blog (note the six magnet URLs; the_\n_third is Protux’s latest configuration format)_\n\nReverse analysis of Protux’s latest version also allowed us to determine how to decrypt the\nC&C information, which is done in the Python code shown below. This can also be used by\nresearchers, system administrators, and information security professionals when decrypting\nProtux’s latest version.\n\n#!/usr/bin/env python2\n\n#-*-coding:utf-8 -*\n**import os, sys, datetime, operator, base64**\n\n**def decrypt():**\n\n**if len(sys.argv) != 2:**\n\n**print \"Usegae : ./decrypt_protux_magnet.py <Full magnet strings>\"**\n\nsys.exit(0)\n\nstr = sys.argv[1]\n\nhead = str.find(\"magnet:?xt=urn:bhih:\")\n\ntail = str.find(\"&xl=\")\n\n**if -1 ==tail:**\n\ntail = str.find(\"&amp;xl=\")\n\n**if -1 == head or -1 == tail:**\n\n**print(\"can't find delimiter\")**\n\nsys.exit()\n\n\n-----\n\nb64_data = str[len( magnet:?xt=urn:bhih: ): tail]\n\nb64_decode = base64.b64decode(b64_data)\n\nkey = ord(b64_decode[2])\n\ndata = b64_decode[4:]\n\noutput_file = open(\"C2_info\", \"wb\")\n\n**for single_byte in data:**\n\noutput_file.write(chr(ord(single_byte) ^ key))\n\noutput_file.close()\n\n**if __name__ == '__main__':**\n\ndecrypt ()\n\n**A new remote controller tool**\n\nWe were also able to source a sample of Protux’s remote controller tool. This provides a user\ninterface (UI) that allows attackers to send instructions to and monitor any compromised\nendpoint host. This tool can also remotely control Marade in the affected system.\n\n_Figure 7. The controller retrieving the Marade-related information (top) and collecting_\n_Protux-related information (bottom)_\n\nBased on the controller’s behavior, we can posit that both Marade and Protux were authored\nby the same threat actors. Each serves a specific role once in the system. Marade acts as\nthe first stage of attack, sending the compromised system’s information to the C&C server\nand then awaiting commands from the controller. This allows threat actors to monitor and\ncheck whether the affected system is of interest to them. If so, the attack moves to the\nsecond stage by deploying Protux. The tool can also control the communication between the\nbackdoor and attacker in real time. The following is a list of Protux’s notable components and\ntheir functions:\n\n_FileManage - Lists all of the system’s drives and folders._\n_ProcManage - Lists all of the processes, modules, threads, and ports in the_\ncompromised host.\n_ServiceManage - Lists all of the services in the compromised host._\n_RegManage - Lists all of the registries in the compromised host._\n_ScreenManage - Takes a screenshot._\n_ShellManage - Creates a shell._\n\n\n-----\n\n**Protux: An old dog learning new tricks**\n\nProtux is an old backdoor, with its first version developed in 2005. It uses DLL injection to\nexecute its routines. Based on this behavior, we can map out a pattern, from the downloader\nto the decoy documents used. The trigger format is: %system32/rundll32.exe <PROTUX file\n_name> <export name>._\n\nWe saw two notable changes throughout Protux’s history: its export name and how it\nfunctions:\n\n\n**Export**\n**name**\n\n\n**Year** **How C&C information is retreieved**\n\n\n_TStartUp_ 2005 –\n2012\n\n_CRestart_ 2009 –\n2014\n\n_CReset_ 2013 –\n2018\n\n\nDirectly connect to the C&C server and use DNS server to retrieve\nthe C&C IP address.\n\nUse web DNS query to retrieve the C&C IP address, e.g.,\nip138[.]com.\n\nFind the encrypted configuration through keywords on blog\nservices.\n\n\nOur research into and correlation of Protux led us to several samples that have version\nnumbers embedded in them. The highlighted portions in Figure 8 show the backdoor’s\nversion number and timestamp with the “with encrypt” strings. We also found that these\nversions encrypt the communication to its C&C servers.\n\nProtux’s latest version, 3.7, uses the open-source compiler OpenCSP to generate a session\nkey with the RSA algorithm.\n\n_Figure 8. Different versions of Protux used by Blackgear_\n\n_Figure 9. Protux with the OpenCSP encryption function_\n\n**Building a proactive incident response strategy**\n\nBlackgear has been targeting various industries since its emergence a decade ago. Its\napparent staying power stems from the furtive ways with which its attacks can evade\ntraditional security solutions. For instance, Blackgear employs two stages of infection for\neach of its attacks. The potential victim may not be able to notice the intrusions as the first\nstage involves only profiling and reconnaissance. And once infection with a backdoor occurs,\ntypical red flags may not be raised as it abuses microblogging and social media services to\nretrieve information needed for C&C communication.\n\nIndeed, Blackgear’s attacks exemplify the need for organizations to develop and implement\n[security strategies that can proactively respond to threats. A robust threat hunting strategy,](https://blog.trendmicro.com/en_us/business/products/detection-response/managed-xdr-mdr.html)\nfor instance helps validate indicators of attack to ascertain if the intrusions threats or\n\n\n-----\n\nsuspicious system activities are one-off attacks or part of a larger campaign. This further\n[visibility equips organizations with actionable threat intelligence, context, and insights that](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/how-managed-detection-and-response-provides-effective-threat-intelligence)\ncan be used to delve deeper into an attack — which security gaps are exploited, if the attack\nhas multiple payloads, or if the malware has already spread within the network.\n\n[Organizations can also consider managed detection and response, which provides in-depth](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/managed-detection-and-response)\nthreat analysis and correlation — from networks to servers and endpoints — to obtain a\ncomplete picture of and further understand a targeted attack. Managed detection and\nresponse also helps make better sense of system- and network-level activities that an\norganization may not have the time or resources to do.\n\n[A list of indicators of compromise (IoCs) related to Blackgear is in this appendix.](https://documents.trendmicro.com/assets/appendix-blackgear-cyberespionage-campaign-resurfaces-abuses-social-media-for-c&c-communication.pdf)\n\n**Trend Micro solutions**\n\nThe [Trend Micro™ Deep Discovery™ solution provides detection, in-depth analysis, and](https://blog.trendmicro.com/en_us/business/products/network/advanced-threat-protection.html)\nproactive response to today’s stealthy malware and targeted attacks in real time. It provides\na comprehensive defense tailored to protect organizations against targeted attacks and\n[advanced threats through specialized engines, custom sandboxing, and seamless](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/security-technology/how-can-advanced-sandboxing-techniques-thwart-elusive-malware)\ncorrelation across the entire attack life cycle, allowing it to detect threats delivered by\nBlackgear even without any engine or pattern update.\n\nBlackgear’s campaigns also use email as an entry point, which is why it’s important to secure\nthe email gateway. The [Trend Micro™ Hosted Email Security no-maintenance cloud solution](https://blog.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-security.html)\ndelivers continuously updated protection to stop spam, malware, spear phishing, and\nadvanced targeted attacks before they reach the network. The Trend Micro™ Deep\nDiscovery™ Email Inspector and [InterScan™ Web Security solutions prevent malware from](https://blog.trendmicro.com/en_us/business/products/user-protection/sps.html)\never reaching end users. At the endpoint level, the Trend Micro™ Smart Protection\nSuites deliver several capabilities that minimize the impact of attacks.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-17 - Blackgear Cyberespionage Campaign Resurfaces, Abuses Social Media for C&C Communication.pdf"
    ],
    "report_names": [
        "2018-07-17 - Blackgear Cyberespionage Campaign Resurfaces, Abuses Social Media for C&C Communication.pdf"
    ],
    "threat_actors": [
        {
            "id": "6750d709-9153-4e90-baa3-04883a9b762b",
            "created_at": "2022-10-25T16:07:23.397596Z",
            "updated_at": "2025-03-27T02:02:09.778738Z",
            "deleted_at": null,
            "main_name": "Blackgear",
            "aliases": [
                "Topgear"
            ],
            "source_name": "ETDA:Blackgear",
            "tools": [
                "Comnie",
                "Elirks",
                "Protux"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ad59becc-29c2-4b7a-a958-d7f242d222ea",
            "created_at": "2023-01-06T13:46:38.956494Z",
            "updated_at": "2025-03-27T02:00:02.962214Z",
            "deleted_at": null,
            "main_name": "Blackgear",
            "aliases": [
                "Topgear",
                "Comnie",
                "BLACKGEAR"
            ],
            "source_name": "MISPGALAXY:Blackgear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535528,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653690848,
    "ts_modification_date": 1653690848,
    "files": {
        "pdf": "https://archive.orkl.eu/79d306e7a46d06a65ede75907afb15259600a933.pdf",
        "text": "https://archive.orkl.eu/79d306e7a46d06a65ede75907afb15259600a933.txt",
        "img": "https://archive.orkl.eu/79d306e7a46d06a65ede75907afb15259600a933.jpg"
    }
}