{
    "id": "ea2a4826-dcec-46f1-abd4-ebdb11e72f94",
    "created_at": "2023-01-12T15:02:32.572959Z",
    "updated_at": "2025-03-27T02:15:49.261654Z",
    "deleted_at": null,
    "sha1_hash": "7ac96b19ba20f1a7979195a876b39863f7f4ac1c",
    "title": "2022-04-18 - Enter KaraKurt- Data Extortion Arm of Prolific Ransomware Group",
    "authors": "",
    "file_creation_date": "2022-05-28T04:46:24Z",
    "file_modification_date": "2022-05-28T04:46:24Z",
    "file_size": 1090887,
    "plain_text": "# Enter KaraKurt: Data Extortion Arm of Prolific Ransomware Group\n\n**[advintel.io/post/enter-karakurt-data-extortion-arm-of-prolific-ransomware-group](https://www.advintel.io/post/enter-karakurt-data-extortion-arm-of-prolific-ransomware-group)**\n\nAdvIntel April 18, 2022\n\nApr 18\n\n7 min read\n\n_By Vitali Kremez & Yelisey Boguslavskiy_\n\n\n-----\n\n_This redacted report is based on our actual proactive victim technical breach intelligence and_\n_subsequent incident response (not a simulated or sandbox environment) identified via unique_\n_high-value Conti ransomware collections at AdvIntel via our product “Andariel.”_\n\nOn January 27, 2022, AdvIntel utilized its **_adversarial visibility into Conti ransomware to_**\ndiscover and then internally alert our customers and partners that a novel extortion group,\n“Karakurt”, was actually a side-operation of the Conti sub-group.\n\nThis is not the first time AdvIntel had discovered Conti using side-groups or even third-party\n_groups in order to adjust their monetization model. Just a portion of the ransomware_\ncollectives found to have been working under Conti in some respect include AvosLocker,\n_BlackCat/AlphV, BlackByte, HIVE, HelloKitty/FiveHands, and the former affiliates of Babuk._\nUtilizing our exclusive primary-source intelligence of Conti’s internal structure, AdvIntel was\n**then able to identify multiple instances of Conti offering exclusive data access to**\n**these accomplice groups.**\n\nThe Conti syndicate had a range of rationales for offering this, which differed heavily\ndepending on the group it presented them to. In certain cases, this endowment was a way\nfor Conti to outsource the low-profile accesses that it was uninterested in spending time to\n\n\n-----\n\nprocess themselves. For others, the business agreement was a form of subtle espionage—a\nway to better understand its competitor’s inner workings while gaining their favor.\n\nHowever, out of all of the external arrangements and alliances Conti has created, Karakurt\nstands out, both as the structured and the pervasive connection to Conti itself.\n\n**The Old Guard—Trapped Between Tradition and Innovation**\n\n_AdvIntel publicly confirmed the Karakurt-Conti liaison on April 13, 2022, after extensively_\n_reviewing the scope of our ransomware prevention ‘initial attack collections’._\n\nSince its early days as the now-defunct organization Ryuk, theConti syndicate has always\nhad a clear approach to the money-making aspect of its business model—a pure focus on\n**_data encryption._**\n\nIn late 2019 and early 2020, when large and small ransomware gangs alike were starting to\ncreate shame blogs (in order to practice a new trend of data brokering that was quickly being\ndubbed “double extortion”), Conti chose to remain loyal to its roots. Their tried-and-true\n\n\n-----\n\nmethod of locking targets data and demanding money for decryption had been reliably\nsuccessful for them up until that point, and Conti saw no need to fix something that they\ndidn’t think was broken. At the time, the group did not even have their own website.\n\n**2021 was the year of change for Conti. Their competitors started to rapidly die out one-by-**\none: REvil, Advaddon, Darkside, BlackMatter, Egregor, Babuk, and numerous others exited\nthe criminal ring, which not only eliminated Conti’s direct competition but made the group’s\nedge in resilience and strategy immediately obvious to others. A sweeping change seemed\nto take over the syndicate’s mindset overnight: change that would make Conti not only the\n_sole survivor of the war for data supremacy, but the more advanced group that the field had_\n_known._\n\n**One of these main vectors of change involved rethinking the concept of data**\n**_monetization. In July 2021, Conti created an entire division to process, investigate, and_**\n**_weaponize stolen files, in order to apply maximum pressure against their targets._**\n\n[New and more sophisticated methods were developed for more targeted data exfiltration,](https://www.advintel.io/post/hunting-for-corporate-insurance-policies-indicators-of-ransom-exfiltrations)\n[and new tools were weaponized to make that exfiltration seamless, more concealed. But](https://www.advintel.io/post/secret-backdoor-behind-conti-ransomware-operation-introducing-atera-agent)\nthese steps were not sufficient for Conti to overcome their internal traditionalism, which was\nheld over from a time when groups had exclusively based their operations around data\n_denial—not data exfiltration. This internal strife between Conti’s goals and values are what_\nultimately led them to seek a separate solution to monetize data exfiltration—enter Karakurt.\n\n\n-----\n\n_Conti had developed a well-set data exfiltration model but was not able to monetize it_\n_properly due to their original locker-centric approach._\n\n\n-----\n\n**Karakurt - A Solution for Data Monetization**\n\nThe key reason for Conti initially creating Karakurt was thatat the time, Conti was bound to\n_the locker build model. This meant that the group’s reputation, their branding, and the fabric_\nof their operations were related to encryption exclusively—not theft. The Conti backend was\neven developed so that the chat hash was created only after the locker build was created. In\nother words, without proper locker build with chat identified, there was no way for Conti to\n_even begin to negotiate with their prospective targets._\n\nAs a result, if data was successfully taken (using all of the above-described methods) but the\nlocker was not executed properly, the stolen files simply remained on FTP/Google\nDrive/MEGA drives before they would eventually disappear. The group experienced recurring\nscenarios in which a network infiltration was completed and data was stolen, but due to\nissues solely related to the locker execution (no sufficient access privileges, detection, build\n_failure), the entire operation yielded zero revenue for them._\n\nConti wasn’t just attached to their locker: In a sense, they were their locker, at least to their\npotential targets and business associates, and few had reason to ever think of them outside\nthe context of that locker’s operations.\n\nTo address these issues without rebuilding the entire syndicate, Conti introduced a\n**solution—a sub-group, Karakurt.** In December 2021, Karakurt quickly amassed record\nnumbers, with over forty victims to its name.\n\nReports noted that, unlike other notable ransomware groups, Karakurt had an approach of\n_moving quickly through its hit list of targets,_ _steering clear of major business interruptions in_\nfavor of soliciting paltry ransoms from small businesses before quickly shifting focus to their\nnext victim. These quick movements suggested that Karakurt came already supplied with\nnetwork access and intelligence information, even prior to the compromises they were being\ncredited for.\n\n**_BazarLoader -> BazarBackdoor -> Cobalt Strike -> Karakurt Extortion_**\n\n\n-----\n\nIndeed, these initial accesses were coming from Conti, for whom Karakurt had become a tool\nto make money in cases where data had been stolen from victims, but not locked. According\nto an AdvIntel-exclusive source, Conti’s distinctive Cobalt Strike beacons were often the\n_initial vector in Karakurt’s attacks, but what’s even more compelling is that the so-called_\n“Patient Zero” of a number of breaches attributed to Karakurt was BazarBackdoor— a\nbackdoor malwarenearly exclusive to Conti operations and especially well-geared for big_game hunting, the exact opposite of what Karakurt was known for at the time._\n\nAlthough it may sound counter-intuitive, the usage of BazarBackdoor likely explains\n**Karakurt’s aforementioned “pattern” of targeting small entities. As often happens in**\nransomware victimology, the entities that are reported are those that have declined to pay\nransom, or that have restored their systems themselves after the attack. Since Karakurt likely\nactually specializes in larger entities, which they extort via data theft, most of the\n**negotiation failures that are disclosed and reported are likely those ofthe smaller**\n**companies that are simply not a priority for them.**\n\n**Conclusion**\n\n**Karakurt was not a way to diversify Conti’s capabilities, they were a way to resolve the**\n**systemic contradictions that were built in the foundation of the group, by**\nsimultaneously giving them a path to leak monetization while outwardly keeping up the\ngroup’s traditional values. By delegating Karakurt with cases in which data locking was\nunsuccessful, Conti opened up a stream of revenue for themselves, all while keeping up the\nappearance of business as usual. Once it was clear that Karakurt was a successful venture,\nthis became a precedent that was then repeated with other approaches.\n\nConti began to create and attach sub-groups that do not interfere with their major workflow,\nbut rather complement _and expand it. These subsidiary groups, similar to Karakurt, are able_\nto take a new approach (Log4Shell exploitation, new botnet infection paths, new social\n_engendering operations such as BazarCall) and continue to develop it on their own right,_\nable to accomplish greater financial success for the group members than a typical locker\nmodel.\n\n**Recommendations & Mitigations**\n\n\n-----\n\nKarakurt is a data-stealing venture, therefore, most mitigations should be directed at\nthe detection of abnormal network presence. Special emphasis should be placed on\nnetwork investigation tools typical for Karakurt: Cobalt Strike sessions opened,\n**Metasploit, and customized PowerShell commands since all these tools are**\nubiquitous for Conti attacks, whereas these attacks are initiated via BazarCall or not.\n\n**Rclone is Karakurt’s main data exfiltration command-line interface. Rclone activity can**\nbe captured through proper logging of process execution with command-line\narguments. Rclone commands can be tracked via the Andariel Cobalt Strike index.\n\n**[For AdvIntel Customers]: Detailed instructions on how to search for data exfiltration**\ncommands can be found in AdvIntel’s [Andariel Cookbook] Tracking Adversarial Data\nExfiltration Attempts Using Andariel’s “Cobalt Strike Ransomware Breach Logs”\n\nAction and monitoring for network segmentation, network hierarchy, and abnormal\n**in-network behavior. Karakurt focuses on extensive lateral movement to be able to**\nfind the most important shares containing data.\n\nKarakurt will most likely utilize legitimate tools, including RMM software, or more\nimportantly, remote desktop software (RDS) such as AnyDesk and Zoho.\n\n**Adversarial Assessment Summary [Karakurt]**\n\n**Karakurt [Threat Group]**\n\nMalware Type: Ransomware\n\nOrigin: Eastern Europe\n\nIntelligence Source: High-Confidence\n\nFunctionality:\n\nData exfiltration\n\nUtilization of legitimate software agents (especially remote desktop agents)\n\nRansom extortion\n\nMITRE ATT&CK Framework:\n\nTA0001 - Initial Access\n\n\n-----\n\nTA0003 - Persistence\n\nT1140 - Deobfuscate/Decode Files or Information\n\nT1083 - File and Directory Discovery\n\nTA0008 - Enterprise\n\nDistribution:\n\nCobalt Strike beacon\n\nBazarBackdoor\n\nVulnerability exploitation\n\nPersistency: High\n\nDecrypter: Not Released\n\nAvg Ransom Demand: $500,000 - $1,000,000 USD (⅔ of Conti payment if the operation is a\njoint effort of Karakurt-Conti)\n\nAvg Ransom Payment: $500,000 USD\n\nAvg Operation Time: 3-5 days\n\n**Threat Assessment: Critical**\n\nThe threat group Karakurt, taking its name from a type of “black wolf” spider from Europe,\nAsia, and northern Africa, emerged in 2021—and quickly garnered attention for amassing\nrecords of over forty victims. Early reports noted that unlike other notable ransomware\ngroups, Karakurt had an approach of moving quickly through targets, avoiding major\nbusiness interruptions in favor of soliciting small ransoms from small businesses. AdvIntel\ndiscovered a connection between Karakurt and ransomware group Conti in early 2022,\nnoting its use of Cobalt Strike and BazarBackdoor as the group’s initial attack vectors. The\ncurrent consensus on Karakurt’s operational structure is that the group is actually a\n_subsidiary within the larger Conti conglomerate, and that it is conducting data exfiltration (not_\n_data encryption) attacks targeting larger entities, which go generally unreported to the public._\n\n**_For more information on Karakurt, or the connections between Conti and other known_**\n**_threat groups, please reach out directly to_** **_[support@advintel.tech.](http://10.10.0.46/mailto:support@advintel.tech)_**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-18 - Enter KaraKurt- Data Extortion Arm of Prolific Ransomware Group.pdf"
    ],
    "report_names": [
        "2022-04-18 - Enter KaraKurt- Data Extortion Arm of Prolific Ransomware Group.pdf"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5f6ade4c-e2db-46f0-b1b4-529ea52d040b",
            "created_at": "2022-10-25T16:07:23.611546Z",
            "updated_at": "2025-03-27T02:02:09.886928Z",
            "deleted_at": null,
            "main_name": "FIN4",
            "aliases": [
                "FIN4",
                "Wolf Spider"
            ],
            "source_name": "ETDA:FIN4",
            "tools": [
                "UpDocX"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3571da12-0890-45e7-85d3-04fac7070b52",
            "created_at": "2023-01-06T13:46:38.414772Z",
            "updated_at": "2025-03-27T02:00:02.827631Z",
            "deleted_at": null,
            "main_name": "WOLF SPIDER",
            "aliases": [
                "FIN4",
                "G0085"
            ],
            "source_name": "MISPGALAXY:WOLF SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535752,
    "ts_updated_at": 1743041749,
    "ts_creation_date": 1653713184,
    "ts_modification_date": 1653713184,
    "files": {
        "pdf": "https://archive.orkl.eu/7ac96b19ba20f1a7979195a876b39863f7f4ac1c.pdf",
        "text": "https://archive.orkl.eu/7ac96b19ba20f1a7979195a876b39863f7f4ac1c.txt",
        "img": "https://archive.orkl.eu/7ac96b19ba20f1a7979195a876b39863f7f4ac1c.jpg"
    }
}