{
    "id": "ea34e7b4-74ab-425f-b1aa-792951b42360",
    "created_at": "2023-01-12T15:07:45.86437Z",
    "updated_at": "2025-03-27T02:15:55.226315Z",
    "deleted_at": null,
    "sha1_hash": "e4d7fe6c594295cf2527f8d6dd258b72c7b70c8a",
    "title": "2022-05-10 - Info-stealer Campaign targets German Car Dealerships and Manufacturers",
    "authors": "",
    "file_creation_date": "2022-05-27T22:33:47Z",
    "file_modification_date": "2022-05-27T22:33:47Z",
    "file_size": 853267,
    "plain_text": "# Info-stealer Campaign targets German Car Dealerships and Manufacturers\n\n**[blog.checkpoint.com/2022/05/10/a-german-car-attack-on-german-vehicle-businesses/](https://blog.checkpoint.com/2022/05/10/a-german-car-attack-on-german-vehicle-businesses/)**\n\nMay 10, 2022\n\n## Introduction:\n\nIt started with a seemingly benign email, dealing with the purchase of a vehicle, and ended\nin a reveal of a months’ long campaign targeting German organizations. Most of the targets\nare related to the German auto-industry sector and the attacks were designed to deploy\nvarious types of info-stealing malware. The threat actors behind the operation registered\nmultiple lookalike domains, all imitating existing German auto businesses that they later\nused to send phishing emails and to host the malware infrastructure.\n\nIn the following publication, we review the details of this operation, from the initial\ninfrastructure preparations, through the different infection-chain stages, to the details of the\nfinal payloads.\n\n## Key findings:\n\nDedicated campaign targeting German companies with a focus on German car\ndealerships and manufacturers.\nExtensive infrastructure designed to look like existing German car dealerships and\nmanufacturers.\nEmails with receipts and contracts in German, designed to instill confidence and lure\nrecipients were sent to carefully selected targets.\nThe main malware hosting site is an Iranian hosted non-governmental website with a\ndouble connection to the campaign.\n\n## Detailed description:\n\n\n-----\n\nGermans love their cars, goes the cliché, which might have been the inspiration for a\nmalicious email received by a German business.\n\nThe email was designed to look as if it had been sent from a car dealership, autohous[.]lips,\nwith the subject line “re: order.” Written in German, the email includes an ISO file\nattachment labeled as “vehicle invoice.” When the recipient double clicked the ISO\nattachment, a short warning message appeared, after which the user was required to open\nan .HTA (HTML Applications) file.\n\nThe use of ISO disk image archives is a known technique used to bypass NTFS Mark-ofthe-Web trust control (MOTW). (See MITRE ref. [here)](https://attack.mitre.org/techniques/T1553/005/)\n\nFiles extracted from ISO archives are not tagged as MOTW, and therefore, even if they are\ndownloaded from the internet, no warning is displayed to the user.\n\nFigure 3 – Alert pop-up for opening an email attachment\n\n\n-----\n\nArchived in the ISO file is an .HTA file, which is opened by the Mshta.exe utility in Windows\nOS. It is often used by threat-actors to execute HTML files with embedded JavaScript or\nVBScript. Even advanced threat groups such as APT29 were recently reported to use this\ncombination of ISO and HTA files against European diplomats.\n\nFigure 4 – Infection chain\n\nThe HTA file includes HTML code to display a purchase contract in German\n\n\n-----\n\nFigure 5 – Car purchase contract displayed to victim\n\nWhile Mshta.exe displays a decoy car purchase contract, in the background it executes a\nVBScript code. We found several versions of these scripts, some triggering PowerShell\ncode, some obfuscated and others in plain text. All of them download and execute various\nMaaS (Malware as a Service) info-stealers.\n\nFigure 6 – .HTA file content\n\nWith later versions of the HTA file, PowerShell code is used to change registry values to\nenable Office macros and run Outlook attachments and files downloaded from the internet\nin non-protected mode.\n\n\n-----\n\nFigure 7 – Deobfuscated PowerShell code for registry setup\n\n## Infrastructure\n\nThe first email we examined was sent from autohous-lips[.]de. It is a lookalike domain which\nwas registered and resolved shortly before it was used to send the email. Another email\nwhich carried a similar .ISO archive was sent from fiat-amenn[.]de.\n\nBoth email address impersonate existing car-related businesses in Germany.\n\nMapping the domains to their hosting server IP addresses, we encountered more than 30\nother domains, all registered in recent months, all of whom imitate existing German autoindustry related businesses with a single character variation.\n\n\n-----\n\nFigure 9 – Mapping of domains to hosting servers’ IPs\n\nUsing these domains as our starting point, we tracked more emails on VirusTotal that were\npart of this campaign. These additional emails were sent from 6 of the previously\ndiscovered\n\nFigure 10 – Impersonated domains and websites and their lookalike domains\n\ndomains. In one case, auto-falkanhahn[.]de, the threat actors used this domain as a\nmalware-hosting site for their final payload. Although the first malicious email we tracked\ndated back to the end of July 2021, most of the emails we found were sent in three waves:,\nat the end of October 2021, the end of November 2021 and mid-March 2022.\n\nThe attackers began registering domains before the attacks and we noticed this trend\ncontinued as we tracked the operation.\n\n\n-----\n\nFigure 11 – Gradual resolution periods of lookalike domains\n\n## Dropped payloads\n\nWe encountered three methods of hosting the payloads. In the first wave of emails, the\nmalware-hosting sites used DuckDNS URLs. In one case we found a direct URL to one of\nthe lookalike domains. The majority of cases used a single website hosted in Iran –\nbornagroup[.]ir.\n\nWe encountered several executables hosted on this site, which frequently changed its\nlocation and type. (See Appendix). The payloads were MaaS (Malware as a Service) infostealers: AZORult, BitRAT and Raccoon. All are available for purchase in various markets\nand groups.\n\n## Victimology and attribution\n\nWe traced 14 targeted entities. All of the targets are German or related to German\nbusinesses, and most of them connected to the auto-industry, ranging from car dealerships\nto manufacturers. and the targets we located complies with these characteristics.\n\nThe identity of who is behind this operation is not clear. We found certain connections to\nIranian non-state entities but it is unclear whether they were legitimate sites that were\ncompromised or have a more substantial connection to this operation.\n\nBornagroup[.]ir is the main site used in this campaign to host various info-stealers. It was\n[registered using the email address [email protected][.]com by an “Amir Heidari Forooshani.”](https://blog.checkpoint.com/cdn-cgi/l/email-protection)\nThis persona is connected to the campaign from two distinct sources. On one side,\n\n\n-----\n\nFigure 12 – Hosting site double relation to German operation\n\nbornagroup[.]ir is used to host various info-stealers, and it is used in multiple emails sent\nfrom a net of dedicated lookalike domains.\nFrom another side, the sub-domain santandbnkplc[.]turbocell[.]ir, registered by the same\nregistrant (Heidari), was used in a phishing operation targeting customers of a subsidiary of\na Spanish bank in South America (Santander Bank). Another part of this “Santander”\ncampaign is hosted on the same Iranian ISP. Its domain is registered under a name\nimpersonating another German vehicle entity “Kfz – Sauter GmbH & Co. KG”. This same\nentity “Kfz – Sauter GmbH & Co. KG” was used to register a lookalike domain,\ngroupschumecher[.]com, which is part of the main German-Auto campaign. This double\nconnection may imply a more substantial Iranian link to the campaign.\n\n## Top 5 Anti-Phishing Principles\n\n**Inform Employees About Corporate Email Policies :**\n\n[Every organization should have an email security policy, including anti-phishing](https://www.checkpoint.com/cyber-hub/threat-prevention/what-is-email-security/)\nprinciples defining acceptable use of email (and other communications solutions). This\npolicy should describe acceptable and unacceptable use and how to respond to\npotential attacks (i.e. reporting suspicious emails to IT and deleting any known\nphishing content)\n\n\n-----\n\n**Review Password Security Best Practices:**\nUser credentials are one of the primary targets of cybercriminals. If an attacker has an\nemployee’s password, it can be much more difficult to detect ongoing attacks since\nthey can masquerade as a legitimate user. Additionally, employees commonly use the\nsame password for multiple online accounts, meaning that a single breached\npassword can grant an attacker access to a number of the employee’s online\naccounts. For this reason, credential theft is a common target of phishing emails. It is\nimportant to educate employees about the threat posed by phishing emails and about\npassword security best practices.\n**Deploy an Automated Anti-Phishing Solution:**\nDespite an organization’s best efforts, employee cybersecurity education will not\nprovide perfect protection against phishing attacks. These attacks are growing\nincreasingly sophisticated and can even trick cybersecurity experts in some cases.\nWhile phishing education can help to reduce the number of successful phishing\nattacks against the organization, some emails are likely to sneak through. Minimizing\nthe risk of phishing attacks to the organization requires AI-based anti-phishing\n**_software capable of identifying and blocking phishing content across all of the_**\norganization’s communication services (email, productivity applications, etc.) and\n[platforms (employee workstations,](http://10.10.0.46/about:blank) **_[mobile devices, etc.). This comprehensive](http://10.10.0.46/about:blank)_**\ncoverage is necessary since phishing content can come over any medium, and\nemployees may be more vulnerable to attacks when using mobile devices.\n**Educate Employees About Current Phishing Threats:**\nPhishing attacks use human nature to trick people into doing something that the\nattacker wants. Common techniques include creating a sense of urgency and offering\nthe recipient of the email something that they desire, which increases the probability\nthat the target will take action without properly validating the email. By offering\ninformation, goods, or opportunities related to a current event or creating a situation\nwhere the recipient believes that something has gone wrong (like a fake package\ndelivery notification), these emails increase their probability of getting clicks. Phishing\ntechniques and the pretexts used by cybercriminals to make their attacks seem\nrealistic change regularly. Employees should be trained on current phishing trends to\nincrease the probability that they can identify and properly respond to phishing\nattacks. The organization’s email policy should be regularly reviewed as part of the\norganization’s cybersecurity awareness training.\n\n## Conclusion\n\nWe discovered a targeted attack being aimed at German businesses, mainly car dealers.\nThe threat actors are using a vast infrastructure designed to mimic existing German\ncompanies. The attackers used phishing emails, with a combination of ISO\\HTA payloads\nthat, if opened, would infect victims with various info stealing malware.\n\nWe do not have conclusive evidence of the attackers’ motivation, but we believe it was\nmore than simply harvesting credit card details or personal information We have evidence\n\n\n-----\n\nthat this is an ongoing campaign that has been conducted since at least July 2021 (or\npossibly even earlier, since March). It may be related to industrial espionage or business\nfraud, but more information is required to establish the attackers’ exact motivation.\nThe targets are carefully selected and the way the phishing emails were sent would allow\ncorrespondence between the victims and attackers. One possibility is that the attackers\nwere trying to compromise car dealerships and use their infrastructure and data to gain\naccess to secondary targets like larger suppliers and manufacturers. That would be useful\nfor BEC (Business, Email Compromise) frauds or industrial espionage.\nThe social engineering attracted our attention, like how the threat actors selected the\nbusinesses to impersonate, also the phrasing of the emails and the attached documents.\nThis type of attack is all about convincing the recipient of the authenticity of the lure.\nGaining access to several victims at the same time gives a significant advantage to the\nattacker.\n\n**Check Point customers are protected against this attack.**\n\n**Appendix – IoC**\n\n**Domains:**\n\n1. autohous-lips[.]de\n\n2. fiat-amenn[.]de\n\n3. autohuas-hesse[.]de\n\n4. fa-automobilie[.]de\n\n5. yereto[.]de\n\n6. bundauto[.]com\n\n7. car-place-rhienland[.]de\n\n8. autozantrum-cloppenburg[.]de\n\n9. cramer-schmits[.]de\n\n10. kfzrieter[.]de\n\n11. weissner-tuning[.]de\n\n12. autohaus-buschgbr[.]de\n\n13. auto-viotel[.]de\n\n14. lm-classiccars[.]de\n\n15. auto-centers[.]eu\n\n\n-----\n\n16. autohuas-e-c[.]de\n\n17. groupschumecher[.]com\n\n18. caravan-spezialistan[.]de\n\n19. ostgotahusbilsuthynring[.]de\n\n20. eh-loc[.]de\n\n21. autohaus-landharr[.]de\n\n22. atlasautomobiles[.]de\n\n23. skode-auto[.]de\n\n24. autohause-meissner[.]de\n\n25. auto-kerl-gmbh[.]de\n\n26. autohausnords[.]com\n\n27. sueverkreup[.]de\n\n28. [asa-automobilie[.]com](https://community.riskiq.com/search/asa-automobilie.com)\n\n29. autohaus-schreoter[.]info\n\n30. autoland-ls[.]de\n\n31. carnextauction[.]com\n\n32. timachinary[.]nl\n\n33. rommacaravanservice[.]nl\n\n34. carnextauction[.]com\n\n35. stopke-essen[.]de\n\n36. globel-auto[.]de\n\n37. auto-falkanhahn[.]de\n\n38. bornagroup[.]ir\n\n39. Turbocell[.]ir\n\nHashes\n\n**File name** **Hash**\n\n\n-----\n\na-p.exe 328a984d512e3083df9d93b427b6967c\n\naz.exe 10aa6a55a4f15064eb4a88278c41adbf\n\na.exe 3702037393f33c2dfe37ffdb2d91f8e1\n\nd.exe f52e56a246eed27f5aadb3260af1c340\n\ns.exe 9e342a138b0c75165b98fb21f2f8db3d\n\nd-clouded.exe 27429d579a6cbe009e08c2c61ede96ef\n\nt.exe a3ae5849d97598b908935a7d02757b4b\n\na.exe 43d590ddfe558c1c103b2f2c6cc18d87\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-10 - Info-stealer Campaign targets German Car Dealerships and Manufacturers.pdf"
    ],
    "report_names": [
        "2022-05-10 - Info-stealer Campaign targets German Car Dealerships and Manufacturers.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536065,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1653690827,
    "ts_modification_date": 1653690827,
    "files": {
        "pdf": "https://archive.orkl.eu/e4d7fe6c594295cf2527f8d6dd258b72c7b70c8a.pdf",
        "text": "https://archive.orkl.eu/e4d7fe6c594295cf2527f8d6dd258b72c7b70c8a.txt",
        "img": "https://archive.orkl.eu/e4d7fe6c594295cf2527f8d6dd258b72c7b70c8a.jpg"
    }
}