{
    "id": "ea5625f0-ea35-4920-917d-5c74b76671e5",
    "created_at": "2023-01-12T15:00:07.514469Z",
    "updated_at": "2025-03-27T02:15:55.564031Z",
    "deleted_at": null,
    "sha1_hash": "c41d142ef253fe24e0dc847d5d65afe0d9ea4a45",
    "title": "2020-09-17 - Analysis of WellMail malware's Command and Control (C2) server",
    "authors": "",
    "file_creation_date": "2022-05-29T00:58:08Z",
    "file_modification_date": "2022-05-29T00:58:08Z",
    "file_size": 128232,
    "plain_text": "# Analysis of WellMail malware's Command and Control (C2) server\n\n**[pwc.co.uk/issues/cyber-security-services/insights/wellmail.html](https://www.pwc.co.uk/issues/cyber-security-services/insights/wellmail.html)**\n\nCopy link\n\n17/09/20\n\n[Earlier this year, we published analysis of WellMess malware that had been used to target](https://www.pwc.co.uk/issues/cyber-security-services/insights/cleaning-up-after-wellmess.html)\norganisations involved in COVID-19 vaccine development. In a follow up article, we gave\n[further technical analysis of its Command and Control (C2) server.](https://www.pwc.co.uk/issues/cyber-security-services/insights/wellmess-analysis-command-control.html)\n\nOur investigation into WellMess has also included a second C2 server from a closely related\nmalware family called WellMail.\n\nAgain the threat actor behind the tool has demonstrated strong operational security\nconsiderations as part of its development and usage of the backdoor, but left a small amount\nof evidence which indicates it has been targeting COVID-19 research. The malware also\nfollows in WellMess’s footsteps of utilising a two-tier C2 protocol to distance the threat actor\nfrom any of its backdoors.\n\n\n-----\n\nIn this article we look at the capabilities of WellMail – the analysis is taken from our private\nintelligence reporting services.\n\n## WellMail analysis\n\nOur previous WellMess reporting found common strings in the client and server code of:\n```\nC:/Server/BotUI/App_Data/Temp\n\n```\nBy carrying out a similar analysis on a WellMail backdoor sample from the July NCSC\nadvisory, we identified another file not included in the advisory.\n\n**Filename** mail.sh\n\n**Filetype** ELF 64-bit\n\n**SHA-256** 93e71fa0f4c5909a5b69033ac39b4664d10e9ed35fa995cf797e3a9990fbb751\n\n**First seen** 2020-05-04 03:41:50\n\nBoth the WellMail backdoor and this new sample contain the string:\n```\nC:/Server/Mail/App_Data/Temp\n\n```\nThis new file is written in Go and is highly likely a first stage C2 for receiving and sending\ndata to the WellMail backdoor. This C2 only supports communication via mutual TLS and\ndoes not support communications via unsecured channels. However, just like the WellMess\nC2, the WellMail C2 supports additional commands that are not present in the WellMail\nbackdoor and are highly likely used by the threat actor to manage uploading and\ndownloading of victim data from the C2.\n\nThe similarities between this WellMail C2 and the previously mentioned WellMess C2 go\nbeyond just the environment paths embedded in the binaries, as the way the servers are\ndesigned is also extremely similar. A breakdown of shared details is shown in Table 1.\n\n### Table 1 - C2 similarities\n\n**Feature** **Description**\n\n**Platform** Both servers are written in the Go programming language and compiled as\n64-bit ELF files\n\n\n**Network**\n**protocol**\n\n\nBoth servers implement communication via mutual TLS with HTTP\n\n\n-----\n\n**CA**\n**certificates**\n\n\nBoth servers have hard coded Certificate Authority (CA) certificates with\nsimilar metadata\n\n\n**SSL**\n**certificates**\n\n\nBoth servers require the current working directory to contain an SSL\nprivate key and certificate with filenames of serverkey.pem and server.crt\nrespectively.\n\n\n**Logging** Both servers implement the open source Go library, [lumberjack, to log](https://github.com/natefinch/lumberjack)\nruntime information\n\n\n**Cookie**\n**control**\n\n\nBoth servers use the names and contents of Cookie headers from clients\nto specify commands to execute\n\n\n**Data**\n**storage**\n\n\nBoth servers use specific folders to send and receive data for each\ncommand\n\n\n**Architecture** Both servers work as a staging point to receive data from malicious\nbackdoors and hold it until commands from an upstream device request\nthe data\n\nEach HTTP request received from a connected client is parsed to gather the Cookie headers\nin the request which are used to determine the command to carry out. The name of the\nreceived cookie is used as the command to execute and the contents of the cookie are\noptionally used as a parameter to pass to the command handler. The supported commands\nthat can be received by this WellMail C2 are detailed in Table 2.\n\n### Table 2 - Supported commands\n\n**Cookie**\n**Name** **Description**\n\n**first** Initial beacon from the WellMail backdoor containing victim environment\ninformation\n\n**inbox** Receives data from the WellMail backdoor and saves it to the C2\n\n**dwnmail** Stages the first inbox or error data found to be exfiltrated\n\n**spam** Saves a script file to the C2 ready to be sent on to a WellMail backdoor\n\n\n-----\n\n**new** Searches for data received by the first command and sends it back to the\nclient\n\n**error** Saves the received data as a tmp.error file and stores it in the same place\nas the inbox data\n\n**delete** Deletes a file on the C2 specified by a filepath in the cookie contents\n\n**script** Searches for script files to upload to the WellMail backdoor and sends any\nfound\n\n## WellMail capabilities\n\nThe WellMail backdoor has very limited functionality and the following analysis is taken from\na 64-bit ELF sample.\n\n**Filename** vigrd\n\n**Filetype** ELF 64-bit\n\n**SHA-256** 85e72976b9448295034a8d4c26462b8f1ebe1ca0a4e4b897c7f2404d0de948c2\n\n\n**First**\n**seen**\n\n\n2020-05-25 12:42:22\n\n\nThe malware uses a hardcoded SSL private key, certificate and CA certificate to authenticate\nwith the server via mutual TLS. All communications are carried out using the net.http Go\npackage using a hardcoded C2 IP address and POST requests.\n\nAn initial beacon is sent to the C2 which contains a cookie with a name of first and a value\nthat contains:\n```\nhard_coded_string%2FMD5_hash\n\n```\nThe hardcoded string is taken from the malicious binary and the MD5 hash is generated from\nthe victim’s IP address, USER environment variable and the previously mentioned\nhardcoded string. The content of the POST request consists of a | separated string\ncontaining:\n\nThe victim’s IP address,\nThe victim’s USER environment variable; and\n\n\n-----\n\nThe MD5 hash from the cookie value.\n\nAn example would be:\n```\n1.2.3[.]4|root|MD5_hash\n\n```\nThe response from the C2 is checked to see if it contains any cookies. If there are any, it\nthen attempts to extract and run a gzipped script from the content of the response.\n\nAfter the initial beacon the malware then generates a random number between two and four\nwhich it uses to sleep between subsequent connection attempts to the C2.\n\nEach of these connection attempts creates 1,847 random bytes of data to use as the content\nof the POST request and sets the cookie name as script with a value of the hardcoded string.\nThe response is checked for cookies and runs a script in the same way as the initial beacon.\n\nThe scripts are run by saving the received script from the C2 to disk and passing it into\nos.exec.Command with /bin/sh and running it with the output saved to a .gz file. If any errors\noccur during the command’s execution, then the malware sends a POST request with a\ncookie named error. If no errors occur, then the saved file is sent as the contents of the\nPOST request with a cookie named inbox.\n\nIn summary, the WellMail backdoor supports the commands:\n\nfirst,\ninbox,\nscript; and,\nerror.\n\nThis leaves the following commands, supported by the WellMail C2, unaccounted for:\n\ndwnmail,\nspam,\nnew; and,\ndelete.\n\n## Potential second stage C2\n\nThe functionality of these unused commands matches those expected to assist exfiltration of\ndata from the C2 that was received from WellMail backdoors. Figure 1 shows the expected\nsequence of commands that the WellMail C2 will handle to transfer data between the threat\nactor and a WellMail backdoor.\n\nFigure 1 - WellMail communication flow\n\nFigure 2 - Communication key\n\n\n-----\n\nThe WellMail C2 analysed lacks the capability to send the responses of scripts run by the\nWellMail backdoor onto a further threat actor controlled box. However, looking at the\nimplementation of the dwnmail command, there are suggestions that the threat actor uses\nalternative software running on the WellMail C2 in order to read the data returned from the\nWellMail backdoor.\n\nThe dwnmail command searches for any .gz or .error files on the C2 that have been sent\nfrom a WellMail backdoor by an inbox or error command. If it finds a file, then it copies it to\nthe /var/www/html/mail/ folder and also sends back the fully qualified file path of the new file\nas the contents of the 200 OK response. This folder is one of the default locations that linux\nemail servers use as their root directory. It is possible that the threat actor has set up an\nemail server on the C2 that it logs into in order to retrieve the files stored on the C2. After\naccessing the files by this method, the threat actor can send a delete command with the file\npath returned by the dwnmail command in order to remove the sensitive material from the\nC2.\n\nIt is likely that the threat actor behind WellMail and WellMess accesses its C2 machines from\nbehind Tor and while using a VPN service. We have observed a substantial amount of\nconnections being made to the C2 IP addresses from several different commercial VPN\nproviders. These same C2 IPs also have connections from Tor exit nodes, which could be\noccurring due to a dropped connection from the VPN provider. This would align with the\nstrong OPSEC practices observed from the threat actor behind these tools in having multiple\nlayers of security in case one fails.\n\n## Targeting\n\nWhen looking at the environment paths found in the WellMess and WellMail samples a\npattern emerges. Both of the C2 binaries have /G/ID after the /Temp folder in their strings,\nwhereas the backdoor samples for WellMess and WellMail from 2019 and 2020 both have\njust the /ID in the string. The ID in most samples appears to be a number, which presumably\nincrements with each new target of the malware. We have seen samples with numbers up to\n73, indicating that there have potentially been 73 targets of the WellMess and WellMail\nmalware. When the ID is not a number it contains a string, which is likely related to either the\ndevice or service the malware is masquerading as or the organisation that is being targeted.\n\nThe ID values we observed are:\n\n4\n12\n36\n72\n73\nwatchdogd\nmigration\n\n\n-----\n\nagent.sh\nwdns\nSangForPromote.exe\n\nTwo of the targeted entities likely correspond to a Canadian vaccine research company and\nthe University that stood up the Research Headquarters for Epidemic Prevention and Control\n[with the Chinese Academy of Science. This would align with the claims by NCSC that the](https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccine-development.pdf)\n[threat actor behind WellMess and WellMail has targeted institutions researching a COVID-19](https://www.fiercepharma.com/pharma-asia/china-turns-roche-arthritis-drug-actemra-against-covid-19-new-treatment-guidelines)\nvaccine.\n\n## Conclusion\n\nThe WellMail C2 is extremely similar to the WellMess C2 making it almost certain that the\ntwo tools are developed and deployed by the same threat actor. The WellMail C2 and\nbackdoor have slightly less functionality than the corresponding WellMess malware but are\nstill effective for running malicious scripts on victim machines.\n\nIt is unclear based on the slight differences in functionality whether the two malware families\nare used in tandem or whether one is an evolution of the other and is now preferred by the\nthreat actor.\n\nThe presence of particular file paths in the two malware families point to exploitation of\nCOVID-19 research facilities by the threat actor, which confirms the information previously\nput forward by NCSC with regards to targeting.\n\nWe continue to track the WellMess and WellMail malware.\n\nTTP’s\nIoC's\n\n### TTP’s\n\nCommand and Scripting Interpreter: Unix\n[Shell - https://attack.mitre.org/techniques/T1059/004/](https://attack.mitre.org/techniques/T1059/004/)\n\nApplication Layer Protocol: Web Protocols- [https://attack.mitre.org/techniques/T1071/001/](https://attack.mitre.org/techniques/T1071/001/)\n\n[Data Encoding: Standard Encoding - https://attack.mitre.org/techniques/T1132/001/](https://attack.mitre.org/techniques/T1132/001/)\n\n[Exfiltration Over Command and Control Channel - https://attack.mitre.org/techniques/T1041/](https://attack.mitre.org/techniques/T1041/)\n\n**Indicator** **Type**\n\n85e72976b9448295034a8d4c26462b8f1ebe1ca0a4e4b897c7f2404d0de948c2 SHA256\n\n\n-----\n\n93e71fa0f4c5909a5b69033ac39b4664d10e9ed35fa995cf797e3a9990fbb751 SHA256\n\n52c6651b6bd0c5940fd0de8e885f5ef8d0292142 SHA1\n\n5e0b5869d98c93cd7f7d925f04a49bd638590ec0 SHA1\n\nd5c26128127f2fac6e3ff2c87b473d74 MD5\n\n3293b12b7622f484b69819217ed8af85 MD5\n\nvigrd Filename\n\nmail.sh Filename\n\n111.90.150[.]140 IP\n\n## Contact us\n\n[Form](https://cloud.uk.info.pwc.com/cyber-security-sign-up-to-updates)\n\nHide\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-17 - Analysis of WellMail malware's Command and Control (C2) server.pdf"
    ],
    "report_names": [
        "2020-09-17 - Analysis of WellMail malware's Command and Control (C2) server.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535607,
    "ts_updated_at": 1743041755,
    "ts_creation_date": 1653785888,
    "ts_modification_date": 1653785888,
    "files": {
        "pdf": "https://archive.orkl.eu/c41d142ef253fe24e0dc847d5d65afe0d9ea4a45.pdf",
        "text": "https://archive.orkl.eu/c41d142ef253fe24e0dc847d5d65afe0d9ea4a45.txt",
        "img": "https://archive.orkl.eu/c41d142ef253fe24e0dc847d5d65afe0d9ea4a45.jpg"
    }
}