{
    "id": "ea907c43-50aa-48b9-b038-c5b0ac30e8c2",
    "created_at": "2023-01-12T15:05:18.502599Z",
    "updated_at": "2025-03-27T02:05:53.323011Z",
    "deleted_at": null,
    "sha1_hash": "81f37198fba8776aa76b756d9e31f8a32435a3d9",
    "title": "2022-01-31 - Top-Ranking Banking Trojan Ramnit Out to Steal Payment Card Data",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:43Z",
    "file_modification_date": "2022-05-28T03:52:43Z",
    "file_size": 1638658,
    "plain_text": "# Top-Ranking Ramnit Banking Trojan Looking to Steal Payment Card Data\n\n**[securityintelligence.com/posts/ramnit-banking-trojan-stealing-card-data/](https://securityintelligence.com/posts/ramnit-banking-trojan-stealing-card-data/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nTop-Ranking Banking Trojan Ramnit Out to Steal Payment Card Data\n\n[Advanced Threats January 31, 2022](https://securityintelligence.com/category/x-force/threats/)\n\n\n-----\n\nBy [Limor Kessem co-authored by Itzik Chimino 4 min read](https://securityintelligence.com/author/limor-kessem/)\nShopping online is an increasingly popular endeavor, and it has accelerated since the\nCOVID-19 pandemic. Online sales during the 2021 holiday season rose nearly 9% to a\n[record $204.5 billion. Mastercard says that shopping jumped 8.5% this year compared to](https://www.cnbc.com/2021/12/27/holiday-sales-jumped-8point5percent-as-shoppers-shrugged-off-higher-prices.html)\n2020 and 61.4% compared to pre-pandemic levels.\n\nCyber criminals are not missing this trend. The Ramnit Trojan, in particular, is out for a\nshopping spree that’s designed to take over people’s online accounts and steal their\npayment card data.\n\nIBM X-Force researchers follow malware activity and targeting year-round. They have seen a\ndiverse collection of Ramnit configuration files over the years. Not only was Ramnit the top\nactive banking Trojan for 2021, but this malware has also been a cyber crime tool for well\nover a decade. It continues to target people and service providers when it is the online\nshopping season.\n\nMost recently, the Ramnit malware infected a long list of brands and online retailers, clearly\nswitching into holiday shopping mode. Among the top brands are travel and lodging\nplatforms, with Ramnit targeting people looking to get away for the holidays.\n\n_Figure 1: Top active banking Trojans in 2021_\n\n## Ramnit: Taking Over Accounts Since 2010\n\nRamnit carries out simple yet effective operations on infected devices. While other cyber\ncrime gangs have moved on to larger corporate bounties and ransomware/extortion attacks,\nRamnit continues to focus on consumers. Once it is resident on an infected device, it\nmonitors browsing to target websites and goes into information stealing mode. It typically\nsnatches login credentials, but its web injections can also trick victims into providing payment\ncard details or other personal data.\n\n\n-----\n\nIn the current web injection IBM X-Force analyzed, Ramnit uses an external script that s\npulled into web sessions in real-time from its remote server. The look and feel of the injection\nare identical, and all injections come from the same command and control servers:\n\nhxxps://lillliliiliiilliillil[.]com/cc/js/\n\nhxxps://lillliliiliiilliillil[.]com/ba/js/\n\nThe pop-up victims see on screen when they access a compromised URL asks them to type\nin their payment card details. Typically, this information is used for card-not-present fraud,\nwhether online or over the phone.\n\n_Figure 2: Simplistic injections are used for all targets, asking for payment card data_\n\nThis injection utilizes string literals replacement and encodes them in Hex or Unicode as part\nof the obfuscation process. For example:\n\nvar _0x2f90 = [“”, “\\x64\\x6F\\x6E\\x65”, “\\x63\\x61\\x6C\\x6C\\x65\\x65”,\n“\\x73\\x63\\x72\\x69\\x70\\x74”, “\\x63\\x72\\x65\\x61\\x74\\x65\\x45\\x6C\\x65\\x6D\\x65\\x6E\\x74”,\n“\\x74\\x79\\x70\\x65”, “\\x74\\x65\\x78\\x74\\x2F\\x6A\\x61\\x76\\x61\\x73\\x63\\x72\\x69\\x70\\x74”,\n“\\x73\\x72\\x63”, “\\x3F\\x74\\x69\\x6D\\x65\\x3D”,\n“\\x61\\x70\\x70\\x65\\x6E\\x64\\x43\\x68\\x69\\x6C\\x64”, “\\x68\\x65\\x61\\x64”,\n“\\x67\\x65\\x74\\x45\\x6C\\x65\\x6D\\x65\\x6E\\x74\\x73\\x42\\x79\\x54\\x61\\x67\\x4E\\x61\\x6D\\x65”,\n“\\x76\\x65\\x72”, “\\x46\\x46”,\n“\\x61\\x64\\x64\\x45\\x76\\x65\\x6E\\x74\\x4C\\x69\\x73\\x74\\x65\\x6E\\x65\\x72”,\n“\\x44\\x4F\\x4D\\x43\\x6F\\x6E\\x74\\x65\\x6E\\x74\\x4C\\x6F\\x61\\x64\\x65\\x64”,\n“\\x72\\x65\\x61\\x64\\x79\\x53\\x74\\x61\\x74\\x65”, “\\x63\\x6F\\x6D\\x70\\x6C\\x65\\x74\\x65”,\n“\\x6D\\x73\\x69\\x65\\x20\\x36”, “\\x69\\x6E\\x64\\x65\\x78\\x4F\\x66”,\n“\\x74\\x6F\\x4C\\x6F\\x77\\x65\\x72\\x43\\x61\\x73\\x65”, “\\x75\\x73\\x65\\x72\\x41\\x67\\x65\\x6E\\x74”,\n“\\x49\\x45\\x36”, “\\x6D\\x73\\x69\\x65\\x20\\x37”, “\\x49\\x45\\x37”, “\\x6D\\x73\\x69\\x65\\x20\\x38”,\n“\\x49\\x45\\x38”, “\\x6D\\x73\\x69\\x65\\x20\\x39”, “\\x49\\x45\\x39”, “\\x6D\\x73\\x69\\x65\\x20\\x31\\x30”,\n“\\x49\\x45\\x31\\x30”, “\\x66\\x69\\x72\\x65\\x66\\x6F\\x78”, “\\x4F\\x54\\x48\\x45\\x52”,\n“\\x5F\\x62\\x72\\x6F\\x77\\x73\\x2E\\x63\\x61\\x70”,\n“\\x67\\x65\\x74\\x45\\x6C\\x65\\x6D\\x65\\x6E\\x74\\x42\\x79\\x49\\x64”,\n“\\x64\\x69\\x73\\x70\\x6C\\x61\\x79”, “\\x73\\x74\\x79\\x6C\\x65”, “\\x6E\\x6F\\x6E\\x65”,\n\n\n-----\n\n\\x68\\x74\\x6D\\x6C, \\x70\\x6F\\x73\\x69\\x74\\x69\\x6F\\x6E, \\x66\\x69\\x78\\x65\\x64,\n“\\x74\\x6F\\x70”, “\\x30\\x70\\x78”, “\\x6C\\x65\\x66\\x74”, “\\x77\\x69\\x64\\x74\\x68”,\n“\\x31\\x30\\x30\\x25”, “\\x68\\x65\\x69\\x67\\x68\\x74”, “\\x7A\\x49\\x6E\\x64\\x65\\x78”,\n“\\x39\\x39\\x39\\x39\\x39\\x39”, “\\x62\\x61\\x63\\x6B\\x67\\x72\\x6F\\x75\\x6E\\x64”,\n“\\x23\\x46\\x46\\x46\\x46\\x46\\x46”];\n\nWhen de-obfuscated, this turns out to be:\n\nvar _0x2f90 = [“”, “done”, “callee”, “script”, “createElement”, “type”, “text/javascript”, “src”, “?\ntime=”, “appendChild”, “head”, “getElementsByTagName”, “ver”, “FF”, “addEventListener”,\n“DOMContentLoaded”, “readyState”, “complete”, “msie 6”, “indexOf”, “toLowerCase”,\n“userAgent”, “IE6”, “msie 7”, “IE7”, “msie 8”, “IE8”, “msie 9”, “IE9”, “msie 10”, “IE10”, “firefox”,\n“OTHER”, “_brows.cap”, “getElementById”, “display”, “style”, “none”, “html”, “position”,\n“fixed”, “top”, “0px”, “left”, “width”, “100%”, “height”, “zIndex”, “999999”, “background”,\n“#FFFFFF”];\n\nWith these generic injections, researchers are seeing Ramnit target a plethora of ecommerce brands and accounts with leading retailers. Some hospitality giants are also on\nRamnit’s target list.\n\n## A Top Banking Trojan for Over a Decade\n\nRamnit is a top-ranking banking malware that has been active in the wild since 2010. Ramnit\nstarted out as a self-replicating worm, leveraging removable drives and network shares to\nspread to new endpoints. As the project evolved, Ramnit morphed into a banking Trojan.\n\nIn 2011, Ramnit’s developer apparently decided to borrow chunks of code from the leaked\nZeus Trojan v2 source, which effectively turned Ramnit into a banking Trojan that steals user\ncredentials and deploys in session web injections.\n\nBetween 2011 and 2014, the Ramnit Trojan gained momentum in the cyber crime arena,\nranking in the top 10 list of the most prevalent financial malware codes. Ramnit infections\nwere rampant in North America, Europe and Australia, where its local targets included a\nmultitude of recruitment sites, likely for the purpose of recruiting mules.\n\nRamnit configurations were typically very long and characterized by a rather exhaustive list\nof online anti-malware scans, antivirus products’ websites, cyber crime information sites and\nsecurity blogs. This list was designed to keep victims away from security controls that would\nidentify the infection. In some cases, the mere use of the word “cyber crime” or “police” in the\nURL typed by victims triggered a redirection effect to a different website.\n\nIn late February 2015, a Europol operation, in collaboration with information security vendor\nSymantec, attempted to [dismantle the Ramnit project by taking down botnets operated by](https://www.zdnet.com/article/ramnit-botnet-assaulted-by-europol-operation/)\nthe Ramnit gang. A few days later, another vendor (Dr. Web) released a blog post indicating\n\n\n-----\n\nthat the [Ramnit botnet was still alive. By December 2015, IBM X-Force reported renewed](http://news.drweb.com/show/?i=9310&lng=en&c=5)\nRamnit activity that targeted banks and e-commerce in Canada, Australia, the United States\nand Finland.\n\nIn the most recent campaigns, Ramnit is delivered in booby-trapped productivity files, most\noften through malicious macros.\n\nAccording to IBM X-Force threat intelligence, Ramnit’s source code remains the property of\nthe gang that operates it and continues to be active as we move into 2022.\n\nTo keep up to date about malware campaigns and tactics, techniques and procedures, follow\nIBM X-Force research at: [securityintelligence.com/category/x-force/](https://securityintelligence.com/category/x-force/)\n\nIf your organization requires help in securing customers against banking Trojans, please visit\n[the IBM Trusteer page: www.ibm.com/security/fraud-protection/trusteer](https://www.ibm.com/security/fraud-protection/trusteer)\n\n## IOCs\n\nC2 Servers\n\nhxxps://lillliliiliiilliillil[.]com/cc/js/\n\nhxxps://lillliliiliiilliillil[.]com/ba/js/\n\nSample\n\nMD5 Ramnit: d194da95c851f252e496229a90353bc9\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-31 - Top-Ranking Banking Trojan Ramnit Out to Steal Payment Card Data.pdf"
    ],
    "report_names": [
        "2022-01-31 - Top-Ranking Banking Trojan Ramnit Out to Steal Payment Card Data.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535918,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1653709963,
    "ts_modification_date": 1653709963,
    "files": {
        "pdf": "https://archive.orkl.eu/81f37198fba8776aa76b756d9e31f8a32435a3d9.pdf",
        "text": "https://archive.orkl.eu/81f37198fba8776aa76b756d9e31f8a32435a3d9.txt",
        "img": "https://archive.orkl.eu/81f37198fba8776aa76b756d9e31f8a32435a3d9.jpg"
    }
}