{
    "id": "eb077751-0ef7-4809-9157-95c2e5684798",
    "created_at": "2022-10-25T16:48:15.722492Z",
    "updated_at": "2025-03-27T02:16:25.746803Z",
    "deleted_at": null,
    "sha1_hash": "37038ce5c99a65d72834f36ebad9316b52386779",
    "title": "Configuring and Managing Remote Access for Industrial Control Systems",
    "authors": "",
    "file_creation_date": "2017-05-02T12:55:11Z",
    "file_modification_date": "2017-05-02T13:18:21Z",
    "file_size": 1951472,
    "plain_text": "###### Configuring and Managing Remote Access for Industrial\n\n Control Systems\n\n_November 2010_\n\n###### CPNI\n\nCentre for the Protection\n###### Homeland Security of National Infrastructure\n\n\n-----\n\n###### Disclaimer\n\nThis report was prepared as an account of work sponsored by an agency of the U.S.\nGovernment. Neither the U.S. Government nor any agency thereof, nor any employee, makes\nany warranty, expressed or implied, or assumes any legal liability or responsibility for any third\nparty’s use, or the results of such use, or any information, apparatus, product, or process\ndisclosed in this publication, or represents that its use by such third party would not infringe\nprivately owned rights.\n\n\n-----\n\n###### Executive summary\n\nIndustrial control systems play a vital role in critical infrastructure. The requirements\nfor their high availability and proper functioning demand that the systems be\nprotected from both intentional and unintentional incidents that can impact their\noperation. In the past, the risk to these systems was mitigated by ensuring complete\nseparation of operational domains from external networks and access to the control\nfunction was limited to authorised users with physical access to a facility. Today,\nbusiness demands (such as increased and faster online access to real-time data,\nusing less resources) has led to the rapid deployment of modern networking\ntechnologies, which has accelerated the interconnectivity of these once isolated\nsystems. This new connectivity has empowered asset owners to maximise business\noperations and reduce costs associated with equipment monitoring, upgrading and\nservicing, whilst creating a new security paradigm for protecting control systems from\ncyber incident.\n\nPart of the security equation involves how operational assets are accessed and\nmanaged and how the cyber security posture of a control system can be impacted if\nthe management of remote access is not understood by business or is conducted\npoorly. However, as is the case with modern cyber security countermeasures, the\napplication of proven and accepted remote access solutions may not map perfectly\nto control systems environments. Requirements for availability and integrity,\ncombined with the unique nuances and attributes often found in ‘purpose built’\nsystems, drive new demand for guidance as it pertains to creating secure remote\naccess solutions for industrial control systems environments.\n\nThis good practice document provides support for developing remote access\nsolutions for industrial control systems. Common good practices from standard\ninformation technology solutions will be presented in the context of control systems\nenvironments, along with insight into how remote access solutions can be deployed\nin a manner to mitigate cyber risk unique to control systems architectures. The goal\nof this practice document is to provide guidance regarding the development of\nsecure remote access strategies for industrial control systems environments.\n\nIn using this practice guide, no two control systems will be identical. As such, no\nsingle secure remote access solution is applicable to all possible architectures and\nno single remote access solution can provide adequate security without a defence­\nin-depth approach. However, by exercising caution and generating and implementing\nconcise requirements based on good analysis, secure remote access solutions can\nbe deployed and maintained.\n\n###### Keywords\n\nIndustrial control systems, SCADA, remote access, role-based access control,\nremote connectivity, monitoring, secure vendor access, defence-in-depth, firewall,\nintrusion detection, encryption, demilitarised zones, security zones, policy and\nprocedures, patch management.\n\n\n-----\n\n###### Contents\n\n**Executive summary ....................................................................................................................2**\n\n**Keywords.....................................................................................................................................2**\n\n**Recommended practice: configuring and managing remote access for control**\n**systems**\n\nIntroduction and definition............................................................................................................. 5\n\nRemote access in industrial control system architectures......................................................8\nRoles and remote access in control system architectures .....................................................9\n\nSystem operators and engineers for local systems .......................................................10\nSystem operators and engineers for remote systems ...................................................10\nVendors .....................................................................................................................10\nIntegrators and system support specialists....................................................................11\nField technicians ............................................................................................................12\nBusiness partners ..........................................................................................................12\nCustomers .....................................................................................................................13\nSupply chain operations.................................................................................................13\nManaged service providers............................................................................................13\nOther considerations......................................................................................................14\nUnintentional entry points ..............................................................................................15\n\n**Remote access in modern ICT architectures .........................................................................17**\n\nRequirements .......................................................................................................................17\nTypes of remote access solutions ........................................................................................18\nSecurity Considerations .......................................................................................................22\n\nDetermining requirements..............................................................................................23\nAttack vectors ................................................................................................................23\nSecure communications.................................................................................................25\nAccess control................................................................................................................25\nLogging and reporting....................................................................................................26\nNetwork architecture security.........................................................................................28\nImproving security..........................................................................................................29\n\n**Remote access in control systems architectures .................................................................32**\n\nRemote access security considerations unique to control systems .....................................33\nApplying good practices .......................................................................................................35\n\nPeriodically undertake formal threat and risk assessments...........................................36\nEliminate all direct connections......................................................................................37\nSecure modem access ..................................................................................................38\nCreate a physical and logical DMZ separating corporate and IT environments ...........38\nCreate separate authentication servers for separate roles (vendors/integrators)..........39\nEnforce a security assurance policy for all remote access ............................................40\nFull tunnels.....................................................................................................................40\nPassword policy.............................................................................................................42\nTwo form factor authentications.....................................................................................43\nAuthorisation levels........................................................................................................44\n\n\n-----\n\nDedicated client hardware and software........................................................................45\nSession termination .......................................................................................................45\n**Managing remote access in control systems environments................................................47**\n\nCase study: Marstad municipal operations...........................................................................48\n\nBackground....................................................................................................................49\nControl system architecture ...........................................................................................49\nRisk factors ....................................................................................................................51\nSolutions for securing the municipality’s remote access................................................53\n\n**Conclusion ................................................................................................................................56**\n\n**Glossary**\n\nAcronyms ..........................................................................................................................58\n\nNomenclature ....................................................................................................................59\n\nFigures and tables.............................................................................................................61\n\n**Further reading .........................................................................................................................62**\n\n**References.................................................................................................................................65**\n\n\n-----\n\n###### Recommended practice: configuring and managing remote access for control systems\n\n Introduction and definition\n\nInformation infrastructures across many public and private domains share several common\nattributes regarding information and communication technology (ICT). This is particularly true in\nthe industrial control systems domain, where an increasing number of organisations are using\nmodern networking to enhance productivity and reduce costs by increasing the integration of\nexternal, business and control system networks. However, these integration strategies often\nlead to vulnerabilities that can greatly reduce the cyber security posture of an organisation and\ncan expose mission-critical industrial control systems to cyber threats. The opportunities for\nenhancing business operations are seemingly endless, with one of the major advantages being\nthe ability to increase the command and control function by leveraging remote access\ncapabilities. Without applying appropriate security safeguards, remote access functionality can\ncreate opportunities for cyber adversaries wishing to cause harm or damage to critical\nprocesses that may seriously affect the lives of people, health, society, the economy and the\nenvironment.\n\nThis document provides guidance for developing secure remote access strategies for\norganisations that use industrial control systems. This document is to be used in developing or\nupdating strategies related to managing remote connectivity between operational assets, peers,\nvendors, operators and other elements that require access to critical information, devices or\nprocess data.\n\nFrom a definition perspective, this document will assume that remote access is defined, in its\nsimplest form, as ‘the ability for an organisation’s users to access its non-public computing\nresources from external locations other than the organisation’s facilities.’[1] To extend this to\ncontrol systems, consider that remote access also includes ‘accessing data, a system, or a\nservice inside a physically and/or logically protected network from a system or device outside\nthat network.’ Combining the two, the definition of remote access for this practice guide is:\n\n‘The capability for an organisation’s users and operators to access its non-public computing\nresources, data and systems that reside inside a physically and/or logically protected network\nfrom external locations that may be considered outside that organisation’s network.’\n\nThis definition is useful in many circumstances,[a] in particular in control system domains and has\nseveral security elements that are applicable to this practice guide:\n\n- It provides allowances for the fact that a single operator may have administrative oversight\nover several disparate systems that are considered to be within an organisation’s\ninformation enclave.\n\n- It implicitly acknowledges that remote access can be interrupted, prevented, captured or\nhijacked through deliberate actions of a separate party without that party having to\ncircumvent physical or logical security controls, even when the communications are\ntravelling across media owned and operated by the data/system owner.\n\na. A more rigorous definition is ‘data communications from one network enclave to another network enclave; where a network\nenclave refers to a networked group of one or more systems partially isolated from other systems using some protection\nmechanism, either logical, physical, or both.’\n\n\n-----\n\n- It can exclude communications within physically protected areas, such as compounds or\nbuildings, reducing the scope of the discussion (security of communications within physically\nprotected boundaries is still an important issue, but should be considered separate from and\nbeyond the scope of remote access).\n\n- It includes all communications over equipment whose physical and logical security cannot\nbe validated explicitly by the organisation using the equipment in an area of communications\nsecurity that traditionally does not receive enough attention, even today.\n\nThis definition expands the scope of remote access to include examples that traditionally have\nnot been considered ‘remote access.’ For example, connections between geographically\ndisparate sites using private third-party telecommunications lines are not normally considered\nremote access, despite the fact that the telecommunications lines are owned by a separate\ntelecommunications company and leased by the organisation looking for a communication\nmechanism between two sites. However, they are included in this definition. The definition\nencompasses long-range communication channels, such as fibre or microwave, where the\nequipment is owned by the data or service owner, but the physical security of the transmission\nmedia is outside the direct control of the data owner.\n\nRemote access security functionality and features help create electronic pathways to grant\nauthorised and authenticated access into a trusted network from a location that would otherwise\nbe considered untrusted. In this definition, the non-public (trusted) network would be considered\nthe control system network.\n\nAlthough this document is titled Configuring and Managing Remote Access for Control Systems,\nthe material is intended to be applicable to any architecture involving industrial control systems,\nprocess control systems, Supervisory Control and Data Acquisition (SCADA), or distributed\ncontrol systems. The term industrial control systems is to be considered a general term applying\nto all these system types sharing similar characteristics and is in line with the definitions used by\nthe contemporary communities of interest and other standards bodies.\n\n###### Background\n\nThe critical infrastructure systems that support major industries, such as manufacturing, water,\ntransportation and energy, are highly dependent on information systems for their command and\ncontrol. While a high dependence on legacy industrial control systems still exists, critical\nindustrial control systems are migrating to new communication technologies. As a result,\ncommon communications protocols and open architecture standards are replacing the diverse\nand disparate proprietary mechanics of industrial control systems. This replacement can have\nboth positive and negative impacts, especially in the areas of system integration and support.\nWhile the traditional isolation of the control system demanded onsite maintenance from\nintegrators and vendors, modern communication mechanisms can facilitate remote connectivity\nfrom almost anywhere. In addition, this new interoperability provides for operators and asset\nowners to allow their own disparate resources to remotely connect to their control systems from\nanywhere on an as-needed basis. As is the case with any contemporary ICT architecture, the\ncyber risk is proportional to the security countermeasures deployed to protect against\nunauthorised remote access.\n\nThe protocols and communication standards that provide increased interoperability in the\nindustrial control systems community build on and use, in many cases, the same technologies\nthat have been exploited and compromised on the internet and corporate networking domains.\nThe same is true for those technologies associated with remote access and this can often\n\n\n-----\n\ncreate situations that cause industrial control systems to inherit undesirable security\nvulnerabilities. Research indicates that the mitigation strategies used in contemporary ICT\nsystems may not always align perfectly to the industrial control systems domain. The unique\nnuances associated with both availability and integrity within control system architectures\nrequire that contemporary security countermeasures be deployed with a specific purpose.\n\nFigure 1 provides a notional diagram that illustrates the traditional isolation of a control system\nenvironment from supporting corporate architectures and peer sites. This simplified view\nshowcases that access to the control system domain, be it for system operation or system\nsupport, was either by physical access to the facility or remote access via telephonic means\n(modem). This illustration is a very good approximation of traditional legacy architectures and\nshowcases traditional vendor access provided by a dial-in capability. Onsite support, which was\noften the norm, would tend to be expensive due to time and materials and organisations looked\nfor ways to reduce costs wherever possible. With regard to security, access policies and\ncontrols were developed based on the assumption that external environments contained threats\nthat were both malicious and hostile.\n\n_(Figure 1: Traditional isolation of corporate and control domains)_\n\nBut as interoperability also provided solutions for cost reduction and ease-of-use, access into\nthe control systems environment was extended beyond simple modem and physical access. As\norganisations grew, the requirements related to reporting and business oversight also expanded\nand continued to expand. This drives the need to facilitate operational information to different\nareas of the business and that could include regulatory authorities, remote operations, peer\n\n\n-----\n\nsites, partners and even application and hardware vendors as well as third parties providing\nservices.\n\n###### Remote access in industrial control system architectures\n\nFigure 2 shows an integrated architecture that has connections from external sources such as\nthe corporate local area network (LAN), peer sites, vendor sites and the internet. This graphic\nalso illustrates the concept of an external communications infrastructure, an element common in\ncontrol systems architectures, be they localised or disparate across large geographic areas. It is\nthis external communications infrastructure that supports connectivity to elements of remote\noperations, remote facilities, business partners and vendors. The external communications\ninfrastructure could also be considered a connection point to the internet, the current de facto\nmechanism for remote users to gain access to business or control system operations (i.e.\ntelecommuting).\n\n_(Figure 2: Integrated networks)_\n\nFrom figure 2, the integrated architectures, if compromised, clearly could provide an attacker\nwith various avenues for accessing critical systems, especially if remote access mechanisms\nare taken into consideration. The issue of convergence raises concerns regarding how attackers\ncould create vectors into trusted control architectures simply by compromising trusted resources\nin remote operations, remote facilities, remote business partners and even vendors. These\n\n\n-----\n\nissues clearly showcase the importance of creating effective and secure remote access\nsolutions when dealing with mission critical control systems. But as discussed above, the\nimplementation of secure remote access strategies can in many cases be nontrivial as the\nrequirements regarding availability and integrity make standard solution deployments\nimpractical and ineffective. More importantly, the deployment of a secure remote access\nsolution may not only increase the cyber risk profile of a control system environment but may\nnegatively impact the necessary attributes of high availability and data integrity.\n\n###### Roles and remote access in control system architectures\n\nBecause securing remote access is an integral part of any defence-in-depth strategy, the\nfoundation of creating usable guidance as it pertains to control systems environments must\ninclude both users and the technology to be accessed remotely. To generalise control system\narchitectures is difficult and to develop a recommended practice for securing remote access that\nis applicable to all architectures is impossible. The uniqueness and diversity of both vendor and\npurpose-built systems create a landscape of diversity that simply cannot be addressed with a\nsingle solution. However, common elements, such as users, roles, existing technology and\narchitecture types, can be reviewed and their attributes can be leveraged. It may help\norganisations to shape their remote access strategy by determining who requires access to\ncertain resources as well as understanding attack vectors that can be created unintentionally.\n\nUnderstanding both users and roles can have a significant impact on how the remote access\nstrategy evolves. In most control systems operations, the roles that would require remote\naccess to control assets may include, but are not limited to:\n\n    - System operators and engineers for local systems\n\n    - System operators and engineers for remote systems\n\n    - Vendors\n\n    - System integrators\n\n    - System support specialists and maintenance engineers\n\n    - Field technicians\n\n    - Business partners\n\n    - Reporting or regulatory entities\n\n    - Customers\n\n    - Supply chain representatives\n\n    - Managed service providers\n\nDeveloping a list that is complete for all systems in all sectors is not possible and the list should\nbe augmented as needed. The roles of the users that would require remote access to missioncritical operations can be extensive and the assignment of specific access depending on those\nroles can be complicated at best. The assignment of remote access roles and credentials is\nexpected to be embedded in the organisational cyber security policy supported by the remote\naccess methodologies discussed in this paper. Here, some of the more common roles are\nreviewed in developing a control system remote access strategy.\n\n\n-----\n\n**System operators and engineers for local systems**\n\nThe people who have the most need for access into a control system environment are going to\nbe the regular system operators and the system maintenance engineers. The requirements for\nremote access to local systems are best understood when the growth or expansion of a control\nsystem will require an operator or engineer to have oversight over disparate (but connected)\nresources. Modern networking does not always facilitate connectivity that automatically creates\naccess control permission structures and if it does, it certainly will incur a cost. Asset owners\nrely on the concept of flat networking to allow operators and engineers to have both local and\nremote access to mission-critical systems.[b] Local systems, by definition, include information\nresources that are not actually situated on the control system network. But, they are located on\nconjoined domains that are, for example, responsible for aggregating operational data or\npreparing content for a customer web-based service.\n\nAccess to and from critical control system assets in the modern environment is usually LANbased, but still should be considered remote if the operator is traversing across different\nnetworks. Virtual Private Networking (VPN) is often considered the best approach in securing\ntrans-network communication. Surprisingly, many organisations feel that these\ncountermeasures are often unnecessary due to the trust relationship that exists between\noperator consoles and services requiring access. Trust relationships inherent in most control\nsystem domains not only involve operators but also field device technologies. The foundation of\ncontrol system operations incorporated exclusive trust between operators and field devices,\nwhich was a capability well suited for completely isolated networks. Unfortunately, this trust has\nbeen carried over into modern control system architectures and this inherent trust is easily\nexploited by an adversary that has managed to compromise the control system or administrative\nnetworks.\n\n**System operators and engineers for remote systems**\n\nAs control systems environments continue to grow both in terms of size and capability, asset\nowners will be faced with the challenges of maximising operations while managing expenses\nrelated to personnel. These requirements will introduce demands for an organisation to have an\noperator administer more than one system in order to optimise operations. More importantly,\nasset owners need to consider the emerging complexity of distributed environments that\nfacilitate single operators having responsibility over many disparate elements. In many cases,\nthe operator will not need the same levels of authoritative access across all environments.\nObviously, this can impact the access profiles an engineer can have when managing operations\nacross several system domains.\n\n**Vendors**\n\nTraditionally, asset owners were not concerned about remote access activities from vendors.\nWhen systems were completely and totally isolated from any external connectivity and the only\naccess to the network was either physical or by modem, entities felt comfortable with the risk\nassociated with vendor remote access. In modern control systems environments, vendors often\ndeploy their technology complete with remote access (e.g., a modem) embedded into the\n\nb. To enhance productivity, it is not uncommon for asset owners to assign processes and procedures specific access capabilities\nacross flat networks.\n\n\n-----\n\nsolution to expedite timely support operations, operations that can include system restoration,\nsystem upgrades and performance monitoring. Vendors can perform these functions as part of\na larger support services contract. In many cases, these contracts demand that remote vendor\naccess be available and not necessarily include operator interaction.\n\nThe impact of vendor access on control system security posture is interesting. The electronic\nsecurity perimeter associated with protecting ingress and egress data streams becomes very\nethereal and hard to qualify. Whereas the traditionally isolated model allowed the asset owner to\nclearly define the security perimeter, the protection of the information enclave is now the\nresponsibility of the vendor with the remote access. Technically, all the points of presence the\nvendor has on the internet could conceivably expose the asset owner, thereby changing the risk\nprofile of the control system dramatically as soon as remote access is obtained. This issue is\nthe cornerstone of the argument that control system solution vendors must provide adequate\nsecurity countermeasures for remote access into the systems they are supporting and that the\nhistorical trust relationship shared between a vendor and an operator can no longer be assumed\nto be safe and uncompromised.\n\nAsset owners that rely on remote access from vendors to support their operations should\nconsider a number of different factors in developing their overall remote access strategy. These\ncan include, but are not limited to:\n\n    - The procurement guidance language (see Reference 1) may be used to agree on the\n\nestablishment of a guaranteed secure remote connection between the vendor and the\nowner’s control system.\n\n    - Asset owners should be aware that the vendors could be exposed to untrusted and\nhostile environments. A compromised vendor network could enable an attacker to\npiggyback on a trusted connection into the control system.\n\n    - Vendors will usually require remote access for two reasons: emergency operational\nsupport and system maintenance. Asset owners should recognise that the latter of\nthese two can be scheduled and definitive protocols for remote access connections can\nbe established and monitored.\n\n    - Asset owners need to be aware of the possibility that a vendor can deploy their remote\nconnectivity solutions (i.e., modems) in a standardised manner and as such the\nauthorisation credentials used to access a large number of control systems may be very\nsimilar if not identical.\n\n**Integrators and system support specialists**\n\nGenerally speaking, integrators differ from vendors in several ways. With regard to remote\naccess, the most critical difference is the presence of an integrator in solution provisioning that\noften prevents the asset owner from directly interacting with the vendor. Although it is not\nuncommon for an integrator to also be a vendor, this single degree of separation can greatly\ninfluence the cyber risk posture of an organisation. Indeed, the remote access issues relevant to\nvendors may also be applicable to integrators.\n\nSecurity carries a nontrivial cost associated with it. Some integrators are unwilling to take the\nnecessary steps to ensure secure remote access above and beyond activating default\ncountermeasures embedded in the remote access technology. More often than not, integrators\nwill have a standardised solution for remote access that usually involves either a modem or\nsome other economical means of providing support from an offsite facility.\n\n\n-----\n\n**Field technicians**\n\nOne of the emerging areas is how field technician’s access critical systems either for operations,\nmaintenance, or the provisioning of performance metrics. As many sectors begin to deploy\nprograms that ensure rapid collection of field operations data, the methods used for remote\nconnectivity to facilitate this data transfer requires investigation. Traditionally, technicians that\noperated in the field usually provided operational data at the end of the shift, usually by physical\nmeans and at a central location. New requirements to support advanced business needs, such\nas those that relate to grid operations or drinking water safety, demand that technicians are in\nconstant communication with engineers administering control system operations.\n\nMany asset owners use modern communications technologies to facilitate field technician’s\nrequirements to submit data to utility management systems. In many cases, these management\nsystems are contained in the corporate or business environments even though the data are\nused to optimise control systems operations. Some methods for the remote communication,\nwhich allows for the timely data exchange between business and field technicians, need to be\nreviewed from a security perspective, because the compromise of these communication\nchannels can provide an adversary with significant access to core system operations. In\naddition, as field data are a critical component in meeting the demands for high availability,\nremote access for field technicians must also be maintained to allow access as needed.\n\nAsset owners supporting sectors that require constant support from field technicians have\nseveral opportunities to leverage modern secure remote access solutions. In addition to\nproviding field technicians access to remote facilities that share a trusted network, remote\naccess solutions involving virtual networking and multifactor mutual authentication to centralised\nservers can provide a significant amount of protection of critical communications paths while\nmaintaining business objectives.\n\nRemote access policies for field workers also must include consideration for physical security.\nOrganisations need to assume that the computing resources used by field technicians will be\ntargets and an increased risk exists pertaining to field technician computing devices being\nstolen. If the remote access solution for the organisation empowers the user of the field\ncomputer to gain access to control devices, then it should be assumed that a thief or attacker\nwho is in physical possession of the stolen computing device may also get access to control\nsystem assets unless proper security measures are taken.\n\n**Business partners**\n\nThe risk associated with business partners has always received attention and whether the\nrelationship between an asset owner and a business partner is young or old, there is a constant\nconcern about information theft and the exfiltration of proprietary data.\n\nWith the advent of modern network connectivity, the accessibility available to business partners\nto extract information from peers has grown considerably. This accessibility, unfortunately, is\noften granted by default based on the historical relationships between business partners and\nasset owners.\n\nWith a business partner having access directly into a control system environment, asset owners\nmust take responsibility for ensuring that this access is managed and secured. In addition to\nproviding dedicated lines and cyber security policies associated with the accessibility a business\npartner can have, constraints limiting the business partner’s access to control system operations\nneed to be deployed.\n\n\n-----\n\nAlthough it becomes very easy to understand the consequences associated with a cyber attack\nfrom a hacker or a disgruntled insider, sometimes organisations fail to appreciate the\nconsequences associated with a critical control systems failure that is a result of poorly\nmanaged remote access from a business partner. In addition to impacts that can, for example,\nrange from failure in a batch mixing process to an event causing death, cyber incidents involving\nbusiness partners can have catastrophic impact that could (in a worst case) lead to the\nextinction of the business itself. When considering remote access solutions, situations that\ndemand business partners to have access to mission-critical operations require a fresh look\nfrom a consequence analysis perspective. The output of that analysis can provide insight to\nappropriate controls associated with a remote access capability.\n\n**Customers**\n\nAlthough the provision of access to customers into control systems environments has\nhistorically been quite rare, recent developments in data aggregation methods and rapidly\nemerging service requests from the customer community are changing this. Using ideals from\nsmart grid innovations, with the end state aiming to empower users with choices regarding\nbetter energy usage (and in turn allow utilities to make better choices for energy management);\nthe traditional separation between end users and critical control system operations is becoming\nblurred. In essence, the separation between critical energy distribution operations and the\ncustomer home may simply be a utility network and a farm of web presentment servers. Taking\nthis simplified approach, it is clear that the remote access provided by asset owners to their\ncustomers requires a substantial review from a cyber security perspective.\n\n**Supply chain operations**\n\nSupply chain operations is often one of the most overlooked elements when considering remote\naccess solutions. In many modern business environments where control systems are involved\nin manufacturing, the supply chain is responsible for ensuring the timely and accurate delivery\nof raw materials and services. Many asset owners in the manufacturing domain, as well as\nsome in the utility space, would be unable to succeed if not for the provisioning of materials and\nsupport from their supply chain. Because the success of a business operation is tied to the\nspeed at which they can create products or service, it is critical that supply chain operations\nhave access to information that allows for the timely replenishment of materials. Often this\naccess involves direct communication to control systems environments, with particular focus on\nmonitoring stock levels and production outputs. Supply chain operations do not just impact the\nbusiness from a pre-manufacturing phase but also provide post-manufacturing support with\nthings like quality assurance, transportation and safety monitoring.\n\n**Managed service providers**\n\nAsset owners are including the capability for managed service providers (traditionally only used\nwithin ICT domains) to have access directly into control system operations. Interestingly\nenough, these services are often presented from the perspective of cyber security and the\nservice providers require access into the control system to assess security postures. These\nservices are also sold by the vendor community, where the vendors are given full-time access to\nthe control systems environment to ensure operational stability.\n\nFrom a financial perspective, it makes good business sense to outsource system operations to\na trusted third party, offsetting the cost associated with having to staff certain operational\n\n\n-----\n\nrequirements. If the managed service provider can augment traditional support services with\nservices that support integrity and availability of the system, the benefit could greatly outweigh\nthe risk. That said, the remote access provided to the managed service entity needs to be\ncarefully crafted under an extended security agreement and the burden of responsibility for\nsecuring the communication path lies with the service provider. Although the entity could help in\nestablishing the remote-access function of the management and protection of that remote\naccess pathway, security needs to be cared for by the provider.\n\nThe emerging interest in managed security service providers having access to control systems\nenvironments raises concerns in many areas, especially those that involve the service provider\nactively trying to mitigate threat in production environments. Often, many service providers are\ngranted full authority to actively try and mitigate cyber incidents using their remote access\ncapability. In many circumstances, this could be a plausible and desirable activity, but the\nsensitivity of and unique nuances associated with control systems environments creates a\nsituation where the access can have adverse impact. A simple example of this would be the\nintroduction of antivirus upgrades into a production environment or the mitigation of\nvulnerabilities associated with control system peer-to-peer communications. In addition to\nensuring the access path is limited to only the managed service provider, there can be\nsignificant negative impact on production environments because of the implementation of\nuntested security patches and mitigation strategies.\n\n**Other considerations**\n\nAsset owners required to provide remote access to any of the elements discussed in the\nprevious section will have a number of options available, including tunnelling; providing direct\naccess to applications, access portals; and remote desktop access. Considering the availability\nand integrity demands usually required of control systems, asset owners must be rigorous in\nensuring that the remote access solutions are balanced appropriately with business\nrequirements. When considering the options available for provisioning remote access,\norganisations should be cautious so that no unintentional entry points are created when during\nimplementation. Regardless of the solution, several common elements are pervasive across all\nremote access technologies:\n\n    - Remote access allows users to store critical information locally on their computer or\ndevice.\n\n    - Remote access solutions are not restricted to using single modes of authentication.\nThe risk associated with information disclosure or compromise can sometimes\ndemand several modes of authentication combined with several different modes of\nserver access.\n\n    - Cryptography has and will continue to be part of the remote access solution, but\ncryptographic communications may impact the timeliness of communications expected\nand the processing capacity of control system elements within some critical\noperational environments.\n\n    - All remote access solutions depend on the physical security of the devices and\nauthentication elements (e.g. passwords, tokens) initiating the remote connection.\n\nIn establishing the different types of roles required for access into control systems domains, the\nrisks are unique to industrial automation environments. Organisations cannot be expected to\n\n\n-----\n\ndevelop a secure remote access strategy without fully understanding some of the complexities\nassociated with high availability networks that are often composed of both modern and legacytype architecture elements. Issues, such as the interconnected IP and serial networks, as well\nas other communication mechanisms that are naturally devoid of security countermeasures,\nplay a significant role in prioritising issues. Generally, several issues should be considered as\npart of the foundation used to create control system remote access solutions.\n\n**Unintentional entry points**\n\nThe convergence of control systems with other architectures has historically occurred at a rate\nthat allows for unintentional and unsecured access to survive. Technological capabilities that\nwere commonplace in isolated systems often remain in updated environments either because\nthe removal of the technology apparently impedes productivity or the technology needs to be\nmaintained to meet cultural requirements. Two of the more common examples of this are data\nservers and printers, both of which tend to be network enabled and are often considered benign\nfrom a cyber risk perspective.\n\nMost common environments today have updated modern server and printer solutions and these\ncomplex machines possess considerable computational horsepower that can easily be\nleveraged to support various activities, including those that benefit a cyber attacker. Printers\nhave and continue to be considered a vital element in control system operations and are used\nfor network diagrams, productivity reports and other operational functions that require printed\nhard-copy materials. Printing devices are usually accessible by everyone by default and often\nare deployed as a trusted information resource that can connect to more than one network. This\nis common practice, as the risk element of the printer has usually been considered low.\nSignificant cost savings occurs in having only one printer serve several networks. But, with the\nmodern printer having all the capability of a modern desktop computer, the compromise of it\n(compounded by the access it has across conjoined domains) can provide an attacker with\nsignificant access into the operational environment.\n\nUnintentional entry points can also be created with the deployment of cost-saving\ninteroperability solutions such as wireless. The entry points into the operational domain need\nnot necessarily come from the control system directly. Rather, the compromise of a wireless\nconnection that provides trusted access into an automation environment can have an equally\nnegative impact on an organisation's cyber risk stature. The countermeasures associated with\nsecuring wireless networks often extend beyond the default standard recommendations as\nprovided by the vendor. Because several different types of wireless solutions exist, such as\nthose for business, control operations and data sharing, organisations tend to limit the amount\nof rigor that is required to protect wireless communications environments where availability is of\nutmost importance.\n\nThe advent of modern networking technology has provided control systems operators with new\ncapabilities that increase their effectiveness in managing day-to-day operations. Vendors have\nbeen able to meet the needs of asset owners by incorporating web-based capabilities in control\nsystems and field devices, allowing operators to manage many assets over a broad area.\nHowever, a rapidly emerging problem exists in how unused or mismanaged communications\nfunctionality can be leveraged by an attacker, especially when the asset owner either doesn’t\nknow the functionality exists or the default deployment demands that the capabilities are\nenabled. Embedded systems in field devices are becoming exceptionally powerful and new\ncapabilities, such as remote monitoring, system diagnostics and firmware updates, can now\neasily be executed from a distance. This can create unintentional entry points into a system\nthat, if left unguarded, can create an access vector for an attacker.\n\n\n-----\n\nThe creation of unintentional access pathways by a remote access solution is a critical concern.\nOrganisations need to be prepared to deploy intrusion detection and intrusion prevention\nmechanisms to mitigate the risk. Fortunately, a long history of successful ICT centric remote\naccess solutions can be leveraged for control system operations. The success of the\ndeployment becomes a function of how those traditional solutions are tuned for the control\nsystems environment and how the cyber security mitigation strategies are appropriately\nbalanced with business requirements.\n\n\n-----\n\n###### Remote access in modern ICT architectures\n\nIn this section, traditional remote access for business networks is described, as are the\ntechniques that have been developed to secure corporate remote access.\n\n###### Requirements\n\nTo properly understand the foundational requirements for establishing remote access programs,\nassessing the requirements, resources and critical information and how information is accessed\nis critical. In the control systems environment, access into and out of mission-critical\nenvironments may not always be limited to automation processes. In many cases, legitimate\nelements of the entire business operation infrastructure require access to data in resources\ninvolved in control systems operations. To help shape what these requirements look like,\nremote access requirements are viewed from an ICT perspective.\n\nThe following list presents some of the more common priorities that traditional ICT\ninfrastructures concern themselves with regarding remote access. The solution must provide\neasy and meaningful[c] access to critical information and essential services to those who require\nit to perform their duties.\n\n    - The solution must ensure that resources[d] can access their information and essential\nservices from any location if required and allowed by policy.\n\n    - The solution must ensure that resources can access their information and essential\nservices from multiple device categories.\n\n    - The solution must ensure that critical information is available for use at a moment’s\nnotice (according to expected service level), that the critical information is always\naccurate and complete and that confidential information is provided only to those who\nrequire it.[e ]\n\nCritical, confidential information requires appropriate protection from abuse or disclosure. When\nexamining data sets, security personnel consider the confidentiality, integrity and availability\nrequirements of such data. These security requirements are always dependent on the business\nimpact of failing to maintain them for the data set under examination. As has been discussed,\ncyber risk is a function of consequence and this may have a different meaning among sectors\nusing industrial control systems.\n\nc. Meaningful access in this sense refers to the information that is generally limited in nature and is presented to the user’s own and\nneed-to know basis. This principle of least privilege is a recommended security practice and is usually found when developing\nstrategies to disperse information to users accessing systems remotely. Although a recommended best practice, the security\ncountermeasure is (unfortunately) not always deployed in production environments.\n\nd. The user is reminded that a resource can be a person or a service and that remote access solutions need to include consideration\nfor both people and computing assets that need to share information across domains.\n\ne. This requirement has specific applicability to control systems environments. However, as it pertains to mission-critical control\nsystems (especially those supporting critical infrastructure), in many cases the elements of availability and integrity supersede the\nrequirements for confidentiality.\n\n\n-----\n\n###### Types of remote access solutions\n\nAs mentioned earlier, all remote access solutions are essentially the same at their core, as they\nprovide a connection over a distance between a user (or system) and a system (or information\nasset). Just as there are differences in access requirements, there are technological differences\nbetween solutions. Some organisations use third-party telecommunication links and rely on the\nservice provider’s ability to secure communications over their infrastructure without question.\nExamples of this include leased lines, Multi Protocol Label Switching (MPLS), Frame Relay,\nSatellite and Plain Old Telephone Service (POTS) modems. Other entities use infrastructure\nowned by the communicating party such as microwave links, long-range fibre optics and copper\nlines. Interestingly, the technologies are the same in this example as in the previous example;\nthe only difference is they are owned and operated by the communicating party. Still others use\nexisting computer networks and tunnel connection between locations such as VPNs, telnet,\nsecure shell (SSH) and others.\n\nModern application technology has blurred the definition of remote access in recent years. As\nboth people and services can require remote access, the suitability of technological solutions\nbecomes hard to discern. Many communications protocols are being encapsulated in web traffic\nand web-based applications are managing increasingly complex communications inside HTTP\nand HTTPS channels.[f] Further, internet-facing web-based applications are becoming universally\naccessible; yet, they manage the security of the data that they are presenting to various user\ncommunities, in some respects the data are being brought to the consumer.\n\nTable 1 shows a sample of different remote access solutions that have been used over the\nyears in the ICT domain that has found applicability in control systems environments.\n\nf. These communication channels are often embedded by default in modern field device equipment.\n\n\n-----\n\n_(Table 1: Different remote access solutions)_\n\nBasic User Target Technology Description\nMethod\n\nPOTS or Single User Direct to Modem A single user has a modem connected to\nIntegrated System Target either a POTS, or ISDN line and directly\nServices System calls a computer system, which also is\nDigital connected to a POTS or ISDN modem. This\nNetwork is a direct connection, which usually only\n(ISDN) allows a single user at a time to gain\nDial-Up access to a single system. This method of\nremote access was very common prior to\nwidespread use of the internet and is still in\nuse today for accessing legacy systems.\n\nPOTS or Single User Remote Modem A single user has a modem connected to\nISDN Dial- System Access either a POTS or ISDN line and calls a\nUp Server (RAS) RAS. This RAS does not provide\nand network application services to the user. Rather, it is\nof systems it a gateway to other systems that do provide\nserves the user with services and authorisation can\n\nbe done at any number of access points.\nThis method extends network connectivity\nto the user. The RAS server becomes,\nessentially, a router on the network, which\nhas a network on one side and a single\nendpoint on the other.\n\n|Basic Method|User|Target|Technology|Description|\n|---|---|---|---|---|\n|POTS or Integrated Services Digital Network (ISDN) Dial-Up|Single User System|Direct to Target System|Modem|A single user has a modem connected to either a POTS, or ISDN line and directly calls a computer system, which also is connected to a POTS or ISDN modem. This is a direct connection, which usually only allows a single user at a time to gain access to a single system. This method of remote access was very common prior to widespread use of the internet and is still in use today for accessing legacy systems.|\n|POTS or ISDN Dial- Up|Single User System|Remote Access Server (RAS) and network of systems it serves|Modem|A single user has a modem connected to either a POTS or ISDN line and calls a RAS. This RAS does not provide application services to the user. Rather, it is a gateway to other systems that do provide the user with services and authorisation can be done at any number of access points. This method extends network connectivity to the user. The RAS server becomes, essentially, a router on the network, which has a network on one side and a single endpoint on the other.|\n|POTS or ISDN Dial- Up|Site LAN and associated network of systems|RAS Server and network of systems it serves|Modem|A packet routing device uses a modem to connect to either a POTS or ISDN line and calls a RAS. This RAS does not provide application services to the calling device. Rather, it acts as a packet routing device (or bridge) to allow network traffic to pass from one network to the other. The phone line becomes a wide area network (WAN) link and packets are routed across it as needed. This method extends network connectivity between two arbitrary-sized networks, just like any other WAN network technology. In this example, the distinguishing factor is that the connection is usually temporary - established on demand and torn down when not in use. This is not a requirement and permanent WAN connections have been established over POTS and ISDN. However, this was the exception.|\n\n\n-----\n\nA single user applies VPN technology to\ncreate a layer of protection for the user’s\ncommunications and then sends that\ncommunication over any of the previously\nmentioned links. The VPN technology\nessentially creates a tunnel, where the data\ninside the tunnel are protected using\ncryptographic techniques. It can be\nconsidered a virtual WAN link, which is\nencapsulated within typical WAN traffic.\nA VPN link is always dynamic in that it is\nestablished on demand and torn down when\nno longer desired. VPN links need to\nchange their cryptographic keys regularly,\nso tunnels are re-established with new keys\noften, usually more quickly than any single\n\n|Basic Method|User|Target|Technology|Description|\n|---|---|---|---|---|\n|WAN Links|Site LAN and associated network of systems Single User System (rare)|Router/bridg e and network of systems behind it|Varies|A WAN link is any telecommunications method to encapsulate network traffic and transport it over long distances. In the previous example, this was accomplished using POTS or ISDN lines from a telephone company. Other long-haul communications links are available. Some are wired such as leased Telco circuits (T1, T3, DS0-3, Frame Relay, ATM, MPLS, Broadband cable, DSL). Others are wireless (802.11, WiMax, Satellite uplink, other line-of-sight microwave, short-wave). Single user and point-to-point links using these technologies are possible, but very rare because of expense. In this example, the distinguishing factor is that these links are mostly permanent, rather than established on demand.|\n|Local Wireless|Single User System|Wireless router and the network of systems behind it|802.11|A single individual with a wireless access card, or wireless local area network (WLAN) card, is connecting the one system to an organisation’s wired network through a wireless access point. The wireless access point acts as a bridge, allowing the wireless- enabled device to connect to the local LAN, as though it were connected directly using a network cable. This connection method is not yet widely considered remote access. However, the wireless signals are not bound to remain inside a space under the physical control of the network owner. Therefore, it has all the vulnerabilities of any other type of remote access and should be included in remote access technology.|\n|VPN (Virtual Private Network)|Single User System|Remote VPN Concentrator and the network of systems behind it|IPSec, SSL- VPN, L2TP, SSH Tunnelling|A single user applies VPN technology to create a layer of protection for the user’s communications and then sends that communication over any of the previously mentioned links. The VPN technology essentially creates a tunnel, where the data inside the tunnel are protected using cryptographic techniques. It can be considered a virtual WAN link, which is encapsulated within typical WAN traffic. A VPN link is always dynamic in that it is established on demand and torn down when no longer desired. VPN links need to change their cryptographic keys regularly, so tunnels are re-established with new keys often, usually more quickly than any single|\n\n\n-----\n\nsession of use.\nHowever, the session time for single user\nVPNs is usually limited. The user will use\nthe session for a short time, then disconnect\nwhen they no longer require the link.\n\nA network routing device creates the VPN\ntunnel to another network routing device.\nThis creates a virtual route, or tunnel,\nbetween the two devices. The routing\ndevices use this tunnel the same way they\nwould use any direct WAN link between the\ntwo devices. Network traffic at either\nlocation can now route to systems on the\nnetwork at the other location as though they\nwere directly connected. As with single user\nVPNs, these virtual WAN links are dynamic\nand are torn down and re-established\nregularly while in use. This is to keep the\ncryptographic keys refreshed.\nThe session for site-to-site VPNs is also\nlimited by their use, as with single user\nVPNs. Generally, they are torn down when\nnot in use. However, they are automatically\nre-established any time a new\ncommunication begins that needs to\ntraverse the tunnel.\n\nThis type of ‘remote’ connection is included\nwhere the communications are travelling\nacross media with a lower security\nclassification than the highest classified\nparticipant. For example, a user connecting\nto a critical system from the corporate LAN\nto manage that system is considered in\nscope here. This is because, just like when\ncommunicating across WiMax microwave\nlinks, systems or people can access or\ninterrupt the communication between the\nparticipants. In this example, that includes\nevery user and system connected to the\ncorporate network.\nHowever, it would not include corporate\nusers accessing their e-mail from the e-mail\nserver. It is assumed that incidental contact\nby people on the corporate network would\nbe of minimal impact to the business; thus it\nis not considered here.\n\n|Basic Method|User|Target|Technology|Description|\n|---|---|---|---|---|\n|||||session of use. However, the session time for single user VPNs is usually limited. The user will use the session for a short time, then disconnect when they no longer require the link.|\n|VPN|Site LAN and associated network of systems|Remote VPN Concentrator and the network of systems behind it|IPSec, SSL- VPN, L2TP|A network routing device creates the VPN tunnel to another network routing device. This creates a virtual route, or tunnel, between the two devices. The routing devices use this tunnel the same way they would use any direct WAN link between the two devices. Network traffic at either location can now route to systems on the network at the other location as though they were directly connected. As with single user VPNs, these virtual WAN links are dynamic and are torn down and re-established regularly while in use. This is to keep the cryptographic keys refreshed. The session for site-to-site VPNs is also limited by their use, as with single user VPNs. Generally, they are torn down when not in use. However, they are automatically re-established any time a new communication begins that needs to traverse the tunnel.|\n|Network Connectio n|Single User|Critical System|Telnet, web based administrati on software, ftp, SSH, Citrix, Terminal Server|This type of ‘remote’ connection is included where the communications are travelling across media with a lower security classification than the highest classified participant. For example, a user connecting to a critical system from the corporate LAN to manage that system is considered in scope here. This is because, just like when communicating across WiMax microwave links, systems or people can access or interrupt the communication between the participants. In this example, that includes every user and system connected to the corporate network. However, it would not include corporate users accessing their e-mail from the e-mail server. It is assumed that incidental contact by people on the corporate network would be of minimal impact to the business; thus it is not considered here.|\n\n\n-----\n\n###### Security considerations\n\nCyber security can be associated with many goals, but the goals of protecting an asset’s data\nintegrity and availability are the de-facto key reasons that organisations try and protect their\ncontrol network assets. Indeed, confidentiality also requires adequate attention, but the goal of\nthis practice is to provide remote access programmatic support for the control system\ncommunity. Thus, integrity and availability remain the highest priorities. In order to accomplish\nthis goal, two basic principles are universally applicable to aid in the preservation of data\nsecurity.\n\nThe first principle is the principle of least privilege, which states, ‘One must provide access to\ninformation or services only to those who need it.’ Alternately, this can be inverted and stated as\n‘One must restrict access to data or a service to only those people or systems which need to\nuse it’. This principle assumes or implies several things:\n\n   - One or more robust protection mechanisms must be in place to restrict access to data\nand services.\n\n   - The requesting users and systems can identify themselves in some fashion to\nwhatever protection mechanisms are in place.\n\n   - The protection mechanism must be able to authenticate the identity provided to it. This\nis a proof mechanism, where the claimant must prove beyond a reasonable doubt that\nthey are the owner of the identity presented for consideration.\n\n   - The protection mechanism(s) must control access to only the information sets and\nservices that the authenticated user or system is permitted to access or use.\n\nThe principle of least privilege also requires an organisation to evaluate the access mechanisms\nto critical field equipment and in some cases requires a mandatory review of default remote\naccess mechanisms. As stated before, default configurations can inadvertently create access\npaths to critical equipment. Organisations are always encouraged to do a preliminary risk\nanalysis associated with embedded remote access technologies in field devices.\n\nThe second principle, which is in support of the first principle, is defence in depth. Every access\nvector to data or services should be considered when building defences, especially those that\nsegregate business operations from mission critical control systems. Three essential\ncomponents are available for defence in depth, each of which is broken down into a series of\ngranular controls. They are:\n\n    - Prevention - a series of controls to ensure the security of information, systems, or\nservices;\n\n    - Detection and response - controls to detect when prevention fails and respond\naccordingly;\n\n    - Security management system - a set of practices designed to continually evaluate and\nadjust security controls to more closely meet the requirements of a particular\nenvironment, industry, or organisation.\n\n\n-----\n\n**Determining requirements**\n\nOrganisations must always understand the criticality of the system or service to which a remote\nuser wishes to connect. A security classification system is required so that every system or\ninformation asset has a level of protection that is commensurate with the value of the asset.\nThis ensures that the level of effort required to establish and manage the controls for a\nparticular asset is aligned with the business impact resulting from compromise or disruption.\nThis approach has specific applicability in the control system domain where compromise of\ncritical assets is understood and has its roots in hazard operation management.\n\nAn understanding of resources (different types of people) the organisation is willing to assign\naccess to for a particular system or information asset also needs to be considered.\nUnderstanding critical asset classification, combined with who needs access to those assets\nand under what conditions, provides the foundation for using zone and conduit models.[2]\n\nThe third consideration to understand is the controls necessary to comply with the security\nprinciples discussed above. To understand the controls required, one must understand the\nthreats and possible attack vectors. Figure 3 provides a notional diagram that illustrates attach\nvector access points. Now that remote access is determined to be the combination of three\ndifferent topics, namely access control, secure communications and reliant communications, the\ncomponents will be broken down and addressed separately, then combined to discuss second\norder issues.\n\n**Attack vectors**\n\nBeginning at the remote user and following the connection to the data or service, remote access\ncan be compromised at any of the following points:\n\n- The user or system can be impersonated to fool the target system;\n\n- The attacker can use captured or guessed credentials to impersonate the user;\n\n- The attacker can intimidate or coerce the user to provide valid credentials, or to perform\nactivities at the attacker’s demand;\n\n- The user’s access device (laptop, PDA, etc.) can be attacked and compromised and used to\naccess the control system network;\n\n- The target system can be impersonated by an attacker to fool the user and thus gain\ncredentials or other information from the user system;\n\n- The communication can be listened to by third parties anywhere along the communication\nchain;\n\n- The communication can be interrupted or jammed;\n\n- Communications can have data injected into them by an attacker;\n\n- The communication can be hijacked after it has been initiated (does not rely on\nimpersonation) or intercepted during initiation (impersonate both user and target, also\nknown as a man-in-the-middle attack);\n\n- Parts of a communication can be replayed to a target, even if the attacker cannot decipher\nthe content (also known as a replay attack);\n\n\n-----\n\n          - The target communication software listening for requests can be attacked and potentially\ncompromised;\n\n          - An attacker can impersonate a valid communications node and gain access to the\nunderlying communications medium;\n\n          - Denial-of-service attack to authentication server (e.g. radius server or RAS);\n\n          - Denial-of-service attack to outward communication device (e.g., modem bank, outside router\nfor remote access).\n\nAttacker\n\nAttack. the Access Method\n\nl[nl)etSCll'lateawe, ]\n\nI[IY1)9rsonateaoorrrnunicalior.$ ]\n:> \\. lHij;ick an •ltis6ng M5$ion -[n:errupt/Jarn corrmuricatiOM ]\n). l[iied,c:omflll.ril:alionl ]\n; Capti.,e tdormetion\n} Replay po,liOns Ctl a C<llM'luhcalion\n\n**External**\n**Communications**\n**Infrastructures**\n\nVendor Support\n\n_(Figure 3 . Attack vectors when using remote access)_\n\n\n-----\n\n**Secure communications**\n\nCommunications media are not generally secure. Anyone with access to electronic equipment\ncan eavesdrop on unprotected communications anywhere along its physical route. Wired\ncommunications are susceptible to taps on the wire and wireless communications can be\ncaptured with a simple antenna, protocol analysers and other technologies. More sophisticated\nattackers can mimic part or all the communication, inject false data in the communication stream\nand even assume the identity of either or both of the communicating parties during the middle of\na communication. Though technically more difficult, even fibre optics are vulnerable to taps,\ninterruption and forging.\n\nThese vulnerabilities require several preventative controls to remedy them.\n\n    - Secure Channel - a mechanism to prevent a third party from capturing the\ncommunication in an intelligible format. This is accomplished using advanced\ncryptographic capabilities.\n\n    - Robust Channel - a mechanism to ensure the integrity of the communications so that\nthe communication cannot be altered in transit without detection. This is accomplished\nusing advanced cryptographic capabilities.\n\n    - Available Channel - a mechanism to ensure the availability and timeliness of the\ncommunications so that a reliable data channel can be established. This is\naccomplished using various anti-distributed-denial-of-service techniques, load limiters\nand anomaly detection.\n\n    - Device Hardening - mechanisms to enhance and ensure the security of the systems at\neither end of the communication, so that they cannot be compromised. This includes\nrobust access controls (see next section), patch management, configured according to\nthe principle of least privilege, etc.\n\n**Access control**\n\nSystems that must protect some information and services, or must allow only certain people or\nsystems access to information and services, require access control capabilities configured in\ncompliance with the principle of least privilege. Traditionally, ICT architectures have had little\nproblem in trying to allocate least privilege to users. Control system architectures are different in\nthe sense that, historically, single users would have authoritative access across the entire\ninfrastructure and access was limited by physical countermeasures. When a system does not\nhave an inherent access control capability, functionality to provide access control should be\nadded somewhere in the communication chain. For example, network firewalls protect systems\nfrom inbound communications by preventing all communication methods except those required\nfor the desired functionality.\n\nThe following list describes the basic security features required from any system to protect\naccess to critical resources, services, data, or communications. Although reused from the good\npractices associated with ICT, the principles can be extended to the control system domain.\nEvery system in the chain of communication between a user and the end goal should possess\nall these capabilities. Although these capabilities can be deployed in ICT architectures with little\nor no complexity, the requirements associated with availability and integrity (often combined\nwith non-standard technologies) demand that deployment in control system domains could be\nnontrivial.\n\n\n-----\n\n    - _Identity establishment - a framework for providing or exchanging unique identities. User_\nIDs are a common method, but are difficult to make both unique and meaningful in large\nenvironments and are not portable. E-mail addresses are portable because they\nincorporate the organisation name, but are difficult to make both unique and meaningful\nin large environments. Certificates are the preferred method. They can be federated\n(are portable) and the identity is an amalgam of many bits of identity data, rather than a\nlimited user ID string, allowing them to be both unique and meaningful for very large\ngroups.\n\n    - _Identity validation - a mechanism designed to ensure the identity of each party to the_\nothers and one that cannot easily be forged. This can be as simple as a user password\n(called a ‘shared secret’ in the case of systems), but passwords are easily guessed,\ndivined, or stolen; and therefore, identities that rely on them are easily forged. The\npreferred method is a one-time-password token or a password protected private key\nassociated with the subject’s signed, public certificate.[g]\n\n    - _Duress alerting (optional, but recommended where available) - an Identity Validation_\nsolution that provides secondary credentials to users who can supply them to an\nattacker when needed. The use of secondary credentials will provide access to\nsystems, data and services, but will alert operators and authorities that the user is under\nduress so that they may take appropriate action. This allows the user to protect\nthemselves from a physical attacker who demands credentials to gain access to critical\nservices.\n\n    - _Roles - groups of users or systems organised according to their responsibilities. This_\ncan be centralised or distributed. Modern systems are centralising this function more\nand more, though there are designs that can provide decentralised role management.\n\n    - _Access rules - lists of access rules that govern which groups and individuals are_\nallowed access to certain resources at what times. These should be carefully planned\nto ensure that they follow the principle of least privilege. This function can be\ncentralised or distributed. Modern systems are centralising this function more and more,\nthough designs can provide decentralised access rule management.\n\n**Logging and reporting**\n\nThis practice document, thus far, has focused on preventative security measures. Yet this is but\none element of secure operations. Critical to any security architecture is the detection and\nreporting of anomalous activities. Preventative measures usually cannot be exhaustively\nimplemented and certain environments present difficulties for some of the techniques mentioned\nabove. Even though control system domains have been designed to detect anomalous activity\n(usually by events and alarm management), the incorporation of anomaly detection for users\nand services has traditionally been the responsibility of IT and not the automation group. For\nexample, an organisation may not have the resources to deploy a completely federated identity\n\ng. ‘Strong authentication’ is a poorly defined term and generally means authentication that is better than passwords. Authentication\ncan be done in several ways that are independent of one another. Each method uses a different property of the user - something\nthey know, such as a password; something they have, like a token or certificate; and something they are, as in some form of\nbiometric, like a fingerprint or retina print. Adding a second password to secure access is the same as one password that is as long\nas the two combined and requires only a marginal increase in effort in order to crack it. However, using multiple factors, such as a\npassword protected certificate, or a retina scan and PIN, requires an attacker to successfully attack two separate mechanism which\nare dissimilar. For a more thorough treatment of authentication mechanisms and their relative strength, please refer to the DHS\nPractice document entitled Improving Industrial Control Systems Cyber Security with Defense-in-Depth Strategies.\n\n\n-----\n\nmanagement solution and ensure that it can work with all the legacy systems and applications\nthat are already in place. Sometimes, patch management cannot keep a system up to date\nbecause business critical software will be adversely impacted by an update and thus security\nvulnerabilities may remain in place.[h] Also, network encryption cannot always be deployed on\nWAN links because it introduces too much delay in the communication, which prevents some\nreal-time systems from operating correctly. In some critical infrastructure control system\noperations, real-time or near real-time data acquisition is a mandatory requirement related to\navailability and system sustainability.[i]\n\nTo ensure that preventative measures are not bypassed, or to identify when someone or\nsomething gains access to what they shouldn’t because of a deployed preventative control, it is\nnecessary to monitor activity on or directed toward important assets and services, analyse them\nfor specific content and alert someone when an anomaly is detected. The following list shows\nsome of the types of events that should be identified by your logging system and for which an\nalert should be made to someone or something that can appropriately respond.\n\n    - Monitor failed authentication attempts - all devices or processes that require identity\nauthentication should log and/or alert when an identity validation attempt fails.\n\n    - Monitor successful authentication attempts from different sources - If available, all\ndevices or processes should log and/or alert when the same user logs in\nsimultaneously from two different source locations.\n\n    - Monitor successful authentication under duress - for critical systems, consider\ndeploying an authentication mechanism that supports duress codes. This allows a user\nunder duress to log into a system using a secondary credential, but alerts that the\naccess was performed under duress.\n\n    - Monitor failed access attempts - all devices or processes that manage access control\nto communications, data, or services should log and/or alert when access is requested\nthat is not allowed.\n\n    - Monitor successful access attempts - all devices or processes that manage access\ncontrol to communications, data, or services should log when access is requested and\nallowed.\n\nProcedures should be established for handling these alerts. With regard to modern control\nsystem architectures, the demand from the user community has forced vendors to create\nadvanced monitoring capability in their solution technologies. Generally, the functionality is\npresented from the perspectives of performance monitoring rather than security. Any\nfunctionality that supports the understanding of failed attempts, improper authentication\nattempts, failed connection attempts or any other abnormality can be used to support cyber\nsecurity risk mitigation. At least, the collection of failed authentication or failed access attempts\ncan be used to support a robust remote access policy. As stated before, this approach can be\nused for both users and services within the control systems information architecture.\n\nh. The issues related to patch management in control systems have been researched extensively and the reader is encouraged to\n[review Patch Management for Control Systemscsrp.inl.gov/Documents/PatchManagementRecommendedPractice Final.pdf](http://csrp.inl.gov/Documents/PatchManagementRecommendedPractice_Final.pdf)\n[i. Cryptographic solutions and their impact to industrial automation are well documented in Cryptographic Protection of SCADA](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)\n[Communications, Part 1: Background, Policies and Test Plan http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)\n[5DC877563A0F/0/0603AGAREPORT12.PDF](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)\n\n\n-----\n\n**Network architecture security**\n\nAgain, remote access is a subset of network architecture and the techniques to secure it are the\nsame techniques used for securing the whole network. After putting all the items mentioned\nabove together, an example illustrates how to secure remote access into an ICT infrastructure.\nFirst, create a list of assumptions:\n\n1. Multiple types of 'remote' users require access into the network for different reasons. Some\nrequire access to non-critical systems, others require access to multiple critical systems and\nothers require access to only a single critical system.\n\n2. Multiple WAN connections compose the **_corporate network, so not all critical systems are_**\nnecessarily located in **_the same physical structure._**\n\n3. Attackers are prevented from physically accessing resources that are inside buildings or\n**_compounds. In these examples,_** all attacks are against remote access mechanisms as defined\nearlier.\n\n###### 8\n\n 11\n\n**Wirelffs**\n**Accen**\n**Points**\n\n**External**\n**Communlc.aUons**\n**lnfratlNCtures** **Corporate User**\n\n**Vendor Suppori**\n\n_(Figure 4 . Example of poor network security)_\n\n\n-----\n\nAs shown in figure 4, the network has poor network architecture. The security of this network is\npoor as the following security elements are not present:\n\n    - Segregation of critical systems;\n\n    - Standardised method of remote access;\n\n    - Visible distinction between corporate roles to ensure access rights can be granular;\n\n    - Acknowledgment of the risks associated with unprotected telecommunications that\ntraverse unprotected physical space.\n\nSeveral examples of remote access are shown in figure 4:\n\n    - Vendors connect to individual systems through direct dial-up modem connections to\nprovide support to critical business servers;\n\n    - Satellite offices connect to the main site through telecommunications WAN links that\nare not in the physical control of the organisation;\n\n    - Both modems and VPN tunnels are available to corporate users and vendors;\n\n    - Wireless access is available to different user groups.\n\nEach of these access methods is susceptible to attack.\n\n**Improving security**\n\nUsing the principles and techniques described in the section ‘Applying good practices’, the\nsecurity of this implementation can be significantly improved by tackling each of the\nvulnerabilities one at a time.\n\n_Identify business critical items - This is the single most important part of all security plans,_\nwhether for network security planning, safety, secure application development, or reconfiguring\nsystems to improve their local security posture. Knowing how to classify systems in alignment\nwith the probable business impact if they fail allows one to group them physically, logically and\nconceptually to address their security issues in a coherent manner.\n\n_Organise network architecture - Create zones where systems, data sources and computing_\nservices are placed in groups whose members share similar security requirements. In the\nexample below, web services have been moved to a demilitarized zone (DMZ) to protect them\nfrom both internal and external attackers. Critical services have been segregated to a secured\nzone to reduce susceptibility to attack from the corporate network should an attacker infiltrate\nthe network that far.\n\n_Implement strong and granular access controls - This must be done on business critical_\nsystems and services as well as on network perimeters surrounding groups of systems with\nsimilar security requirements. The principle of least privilege must be followed when\nconstructing these access controls. Granular access controls should be considered on every\nsystem, every application and every network border protection device such as firewalls and\nVPN concentrators. Figure 5 shows how communications into and out of the ‘Business Servers’\nzone can be heavily restricted. For example, users might be granted broad access to the\napplication servers’ web interface, but administrative access could be configured such that\n\n\n-----\n\nadministrators would have to first connect to a special administrative server using a\ncryptographically secured connection and then manage the Business Servers from that one\n‘jump’ server.\n\n_Standardise on one method of single-user remote access - The recommended method is to use_\na modern VPN, because all modern implementations of VPN technology include strong user\nand device authentication mechanisms. They also provide an extra layer of network access\ncontrol, allowing different users to tunnel through to different systems using only allowed\ncommunications protocols. In Figure 5, all modems have been removed and vendor support\naccess has been moved to VPN technology. This has normalised the security protocols for all\nexternal to internal access and reduced the number of possible points of attack.\n\n_Enable remote access only when required - Normal industrial control systems users may require_\non-demand remote access, but vendor support may only require remote access rarely. One can\ndisable vendor user IDs until they are required to be enabled and then disable them once again\nwhen they have completed their task. This technique can be applied to any untrusted group of\nusers who require only intermittent access to corporate resources.\n\n_Use strong authentication credentials – Users_ needing access to critical systems and services\nshould be required to use strong authentication methods, such as one-time password tokens or\ncertificates. These are also known as multifactor authentication methods. Devices such as\nwireless access points and microwave towers should use strong authentication to identify\nthemselves to each other, so that access rules can prevent unauthorised wireless devices from\nparticipating in communications.\n\n_Protect wireless communications - Use modern cryptographic techniques to protect WLAN and_\nmicrowave communications. This makes the wireless communications methods much harder to\nattack. Injection and replay are very difficult and eavesdropping and hijacking become almost\nimpossible. Most microwave implementations and all WLANs have advanced cryptographic\ncapabilities. The communication lightning bolts in the diagram have been changed from yellow\nto green to indicate that the end points use strong authentication to validate their identities and\nuse encryption to scramble communications.\n\n_Logging, monitoring and alerting - Critical devices should log activity and alert on anomalous_\nevents. Devices in this category include all servers, applications, communications equipment\nand network perimeter devices, which are critical to business operations. In addition, the\ndeployment of monitoring devices captures and examines network traffic for anomalous\nbehaviour. They are typically deployed behind network access control devices to ensure that\nchanges to communications behaviour do not go undetected.\n\n\n-----\n\nVendB f Support\n\nAttacker\n\n**Attack the Access Method**\n, knpcrscn111,eauscc\n.-nperaooet.e80!IIWl'lullieetion8\n###### ..... H\\&(kanelC'l!>lir'lg�\n\"'*'ll'\\lptf,lamQ()fflm11111o;t.On$\n\"l.,e(tOOMMl.f'iC8�\nc,ixur,1nform.;,tll)fl\n, Rt!pi.ypcir6onsof II oommurication\n\nExternal\nCommunications CorporateOmbaisK **Corporate**\nInfrastructures **Infrastructure** Corporate User\n\n**Servers**\n\n_(Figure 5: Security countermeasures)_\n\n\n-----\n\n###### Remote access in control systems architectures\n\nWith the growing interconnectivity between control systems architectures, corporate\narchitectures, peer sites and other operational entities, organisations have had to abandon the\ntraditional (and sometimes ideal) concept of total domain isolation. Realistically, industrial\ncontrol systems have always had some aspect of remote access play a part in operations. As\ndiscussed before, vendors have had access to support their systems and the communications\ninfrastructure was traditionally quite extensive so that it supported data control and acquisition\nfrom long distances. The mechanisms for data acquisition involves several different types of\ncommunications media, many of which were not dedicated to a single utility but were shared\namong some number of different entities. A number of the security functionality and concepts\nthat ICT has used can be leveraged in control system architectures. The challenge is how to\napply cyber security good practices to remote access programs such that the solution supports\nthe requirements for business operations.\n\nThis section is designed to examine remote access solutions in industrial control systems\nenvironments and show how the lessons learned in ICT environments can apply here. Attention\nshould also be applied to examine the differences between the environments and how they\nconstrain the choices of security techniques available.\n\nOne of the best ways to understand the differences in requirements for remote access between\nthe business ICT domain and the industrial control system domain is to look at a comparative\nmatrix. These differences are the foundation to address some of the more unique elements that\nimpact strategies for deploying remote access and control system architectures. The following\ntable shows the comparison of key remote access requirements and the differences between\nICT and control systems domains.\n\n\n-----\n\nAuthorisation server Maintained and monitored in a Authorisation servers deployed\nDMZ directly on the control system network\n\nDemilitarized zone Access through DMZ only DMZ not always deployed\nSSL Encryption Commonly deployed Rare\nIPSec Commonly deployed Very rare\n\n_(Table 2: Comparison of control systems and ICT remote access requirements)_\n\n###### Remote access security considerations  unique to control systems\n\nCulture has always played a part in how cyber security is implemented in control systems\nenvironments. When security foundations are based in the complete and total isolation from\nuntrusted domains, the migration toward creating security solutions that account for\ninteroperability can be challenging. Regardless, the basic attributes associated with control\nsystems functionality, attributes that are based on requirements for high availability and data\nintegrity, create opportunities to leverage proven security technologies and adjust for\noperational requirements. The perspective of those responsible for creating remote access\nsolutions that allow for direct connectivity into industrial control system operations may not\nperceive cyber security as a critical concern but rather how the access solution can be managed\nto maintain critical operations. When trying to address the security component, many direct\nconnections are justified by the perceived obscurity of the system and the risk is mitigated by\n\n|Remote Access Requirements|Information & Communication Technology|Industrial Control Systems|\n|---|---|---|\n|Direct internet access|Not common, protected by firewall and intrusion prevention system.|Control system components are sometimes exposed directly to the internet|\n|Modem access|Rare|Common/widely used, legacy equipment|\n|Leased lines|Common/widely used|Common/widely used|\n|Remote access through Firewall with virtual local area network (VLAN) segmentation|Common/widely used|May be segmented from corporate network, little segmentation within control system network|\n|Remote authentication|Multiple form factor|Usually single factor, some multifactor solutions ineffective due to speed or process control reliability requirements|\n|Remote authorisation|Usually role based or based on confidentiality of data|Usually a single level with full authorisation|\n|Access control lists|Usually well defined|Not always utilised or clearly defined. Not maintained as it should be|\n|Audit trail|Robust and actively monitored|Sometimes limited capability, not actively monitored|\n|Authorisation server|Maintained and monitored in a DMZ|Authorisation servers deployed directly on the control system network|\n|Demilitarized zone|Access through DMZ only|DMZ not always deployed|\n|SSL Encryption|Commonly deployed|Rare|\n|IPSec|Commonly deployed|Very rare|\n\n\n-----\n\nthe assumption that little understanding exists of how the system actually works. As has been\nrepeatedly proven, this approach is not only dangerous but can lead to some significant\noperational risk (i.e. the lack of awareness that mission-critical systems are directly connected\nto the internet).\n\nA vast majority of control systems environments are deployed in domains that are considered to\nbe critical infrastructure. Risks to these environments are not limited to the company operating\nthe infrastructure. Remote access to a control system does expose some aspects of the\narchitecture to remote manipulation. Remote access may be an exploitable attack vector that\nadds extra risk regarding the availability of the control system. The introduction of security for\nremote access cannot impede or degrade the normal operational processes that are critical for\nthe control system to function normally.\n\nFor example, the remote access security implementation will have to consider the necessity for\nreal time operations. Surprisingly, many organisations fail to recognise the realistic impact\nsecurity can have on real-time operations and will often discount the possibility of deploying\nsecurity countermeasures without appropriately analysing the impact performance. Many control\nsystems environments need to operate in real time, with some environments requiring submillisecond polling. Any latency that is created due to the deployment of a countermeasure,\nsuch as encryption, may negatively affect the overall process and cause unnecessary delays or\nshutdowns. As well, much of the data on a control system can be deemed non-confidential and\nthus the lack of need for encryption within the communication between critical system\ncomponents.\n\nMany control systems environments are geographically dispersed and may even cross\ninternational boundaries. The nature of these deployments requires that many field locations are\nunmanned and the requirements for availability often make the remote access solution address\nconnectivity more than security. This may limit some procedural-based security protections such\nas allowing only temporary access to the system. Adding security functionally that may slow\ndown the management of the field equipment, such as calling a help desk to enable remote\naccess, may be justification for keeping an ‘always on’ remote connection.\n\nBecause many control systems environments have the requirement to operate in real time, the\ndemand to quickly connect to a system when necessary is crucial. Often, operators may feel\nimpeded by the multiple steps required for remote access and will either want to remove some\nsecurity features that slow down their connection process or create workarounds to expedite\nconnectivity. A good example of this includes an organisation maintaining the use of the default\nadministrative credentials involved in remote access, or the creation of passwords that are not\ncomplex and are not forced to change on a regular basis. As stated before, when operators are\nworking under duress and system survivability is paramount, many users will want to (or be\nrequired to) connect to a remote system as quickly as possible and do not want to have to worry\nabout connecting with a complex password or one that they have not used for many years.\nThese practices, in addition to those that involve using the same password for every field\ndevice, greatly reduce the chances of a remote access capability being secure. The need for\nremote access to be as quick as possible can justify not adhering to added robust security\nprotections.\n\nAdding to the complexity of security requirements for control system architectures is because\nnot all remote connectivity will take place in or from a controlled location but rather from an area\nthat can be impacted by environmental effects. This can create a problem when attempting to\nuse some advanced features for secure remote access, including ones that require operators to\nuse multiform authentication. Many control environments are deployed in factories, large\nprocessing plants, warehouses, isolated stations and even far outside of a six-walled building.\n\n\n-----\n\nThe environmental issues associated with working in these locations can create situations\nwhere an operator is unable to take advantage of advanced authentication technology. Many\norganisations face the challenge in trying to deploy remote access security strategies that are\ncommensurate with the value of the system being administered. However, the usage of\nbiometrics or some other technology that requires a clean environment is useless, or operators\nmay be unable to be free of dirt, grease, oil, or some other element that prohibits the effective\nuse of the technology. For example, two-form factor authentication using advanced biometric\nthumbprint scans can be affected by the dirt or oil and grease that build up in these types of\nenvironments. Taking advantage of voiceprint technology can be very difficult, because some of\nthe background and residual noise of working in a large processing plant or outdoors in an open\nair environment may affect the voice wave length for recognition.\n\nFinally, from a pure technology perspective, many control system devices or implementations\nmay not have the capability to effectively use even basic security features such as\nauthentication or authorisation. With control systems having a larger than average life cycle,\nsome upward of 20 years, the incorporation of effective remote access security\ncountermeasures is just simply not plausible. Even though the asset owner may make repeated\nrequests to the vendor, the cost associated with implementing the effective remote access\nsolution is larger than the purchasing of a new system itself. This situation does not favour the\noperator but rather the vendor, leaving the operator little choice in creating aftermarket\nsolutions. Secure remote access can be accomplished, but asset owners can expect to require\nthe full support of the vendor to help secure existing remote access capabilities.\n\n###### Applying good practices\n\nCurrent interest in secure remote access has created a situation where there are a multitude of\noptions in defining what a good practice should be. Although specific good practices are\nassociated with highly regulated ICT systems, such as those used in the federal government,\nfinancial or health care sectors and these practices are not straightforward. As discussed earlier\nin this document, there is tremendous complexity in trying to create a remote access good\npractice that is going to be applicable to every possible control system architecture. Asset\nowners are in a position, however, to create effective baselines from which secure remote\naccess programs can be derived. By understanding the accessibility requirements in their\norganisation and cross correlating with both the users and services required for remote\nconnectivity, operational mandates can be met in a matter that accommodates for the\nappropriate protection of critical information assets.\n\nMost operational environments have limited choices for the technology that can be used for\nremote connectivity. When combined with the recognition of the critical assets needing to be\naccessed, the task of defining guidelines can be straightforward. Guidelines that are\nimmediately appropriate to control systems environments include:\n\n    - Undertake a formal threat and risk assessment;\n\n    - Eliminate all direct connections to critical operational assets;\n\n    - Secure modem access beyond default means;\n\n    - Use DMZs to segregate business and control architectures;\n\n    - Establish user-specific authentication servers;\n\n\n-----\n\n           - Create a security assurance policy for all remote access;\n\n           - Use only full tunnelling cryptographic technology;\n\n          - Use a password policy specific to remote access elements;\n\n           - Wherever possible, use multifactor authentication;\n\n           - Use role-based authorisation levels;\n\n          - Use dedicated hardware and software to support the remote access solution.\n\nCorporate Web CCKpOn1te W ireless\n\n**-E**\n\n**Lr --l!!iiii•-,�** **·g=** **�Servers**\n\n### �tr�:� f\n\n                                                                - .................... Extetn.alVPN                                                                 -\n\n                                                           - Acce-ss                                                           -\n###### ................ Secondary\n\n**Historian**\n\nI\n###### :I [-----------'-,-_____ ,......;;..;:;.;.;.;.;.;.;:;..=...;:;.�.:;,;;;.=.;..._------]\nI I I .:::�,Z� **Control Room Work.statio** **s .�** **a.-**\nI\nI **�**\n\nOe dica. ted I\nCOmmPatnl CS ':;;\n....... �.��-.:,-:-------' MODEM                       - -P **RTU/PLC**\n\n###### SJ\n**Field Locations**\n\nCS PBX\n\n**Communications External** **Sensors & Actual�** ii\n**Infrastructures**\n\n_(Figure 6 . Basic industrial control systems network with no security)_\n\nFigure 6 shows a basic industrial control systems network with no security. The whole network,\nincluding corporate, is protected from the internet, but there are no security mechanisms in\nplace to protect the industrial control systems environment from the corporate computing\nenvironment, business partners and remote office locations. The next several sections will\nillustrate the different controls in the environment and will conclude with reasonable security\ncontrols in place.\n\n**Periodically undertake formal threat and risk assessments**\n\nOrganisations need to understand their threats and risks. Risk management is a common\nelement of project management and is used by organisational managers everywhere. However,\nproject managers are concerned about on-time delivery and managers are primarily concerned\nabout margins or efficiencies and the risks routinely considered by people in these roles reflect\ntheir perceived priorities. The topic seldom turns to risks that emerge from threats of system\nfailure or deliberate sabotage because of absent security controls. As a result, these topics\n\n\n-----\n\ntypically receive nominal treatment from managers who then do not acquire a deep\nunderstanding of the cyber threats to their industrial control systems infrastructure.\n\nIn order to solidify an organisation’s understanding of these risks so that managers can make\nrisk-aware project or operational decisions, formal Threat and Risk Assessments (TRAs) should\nbe conducted on industrial control systems environments on a regular basis.\n\n**Eliminate all direct connections**\n\nBecause of the security risk and ease of attack path, the elimination of direct connections to\ncontrol system architectures is strongly recommended. Organisations need to consider that the\nprevalence of flat networks control system architectures could create unrecognised direct\nconnections. As many control system architectures trust many operational resources via remote\naccess channels for functionality, the control system could be compromised quite easily by\nexploiting direct connections. Field devices and equipment require special attention and the\naccess requirements associated with these assets make the removal of direct connections\ndifficult. In the event that organisations cannot eliminate direct connections, countermeasures\nthat involve authentication and authorisation should be deployed. At least, wherever possible,\nauthentication and authorisation mechanisms on the field equipment should be enabled; and if\nthere is no requirement for remote access to the field equipment, such capabilities should be\ndisabled.\n\nIn the rapid expansion of control systems environments, some organisations are left with little\nchoice for remote connectivity. Devices, such as relays, intelligent electronic devices, remote\ntelemetry/terminal units (RTUs) and Programmable Logic Controllers (PLCs) should not be\nconnected to the internet even if they have a username and password set. If these devices do\nrequire internet connectivity, organisations should proactively ascertain what functionality can\nbe removed to lower the risk profile and work with vendors to establish unique access\ncapabilities that significantly limit the exposure of the control system. Entities should leverage\nprocurement language guidance to ensure that security capabilities are inherent in the\ntechnology being procured and that vendor assistance is available to support secure remote\naccess to the device. When direct connections are required to critical information assets, a good\npractice is to remove functionality that is not required for operation but, if leveraged by an\nadversary, would result in a security incident.\n\n\n-----\n\n: E•1:::��[PN ] : Data Database Configuration Engineering\n###### ................ Secondary Workstations\n\nHistorian \"��i) � �-\n\n**r----�---'--�����,......;;.CO:;.:N.:..:T.:..:RO.:;,;L::...;:;.: SY..:;S.:..:TE:;::M:....:LA::...::..:.N������**\n\nI CS Control Room\n\n1 MODEM Pool .:;;;�,:V Workatatio �[H][M][I][� ]\n\n-' CommPamJ J\" I [Dedicated I ]: � �\n\nI\n\n###### 0 RTWPLC\n le� Field Locations -r\n\n�\n\nCS PBX\n\n**External**\n**Communications** **d** Sensors & Actuat';!lta **0**\n**Infrastructures**\n\n_(Figure 7: Eliminate_ _'direct connections' by adding firewalls around the industrial control systems_\n_environment.)_\n\nFigure 7 shows an industrial control systems network that is partially isolated from all other\nnetworks. This is similar to the old architecture, where the industrial control systems network\nwas completely isolated from other environments. However, the firewalls can be configured to\npass appropriate traffic into and out of the industrial control systems zone.\n\nThe modem pool, if it continues to be required, is moved outside the industrial control systems\nto a DMZ-like network to prevent the modems from compromising the industrial control systems\nenvironment.\n\n**Secure modem access**\n\nIf modems are not used, they should be either removed or disabled from the device or system. If\na modem is deemed necessary despite the available alternatives, they should not be left on and\nshould be deployed using recommended practice guidance. [3 ]For further guidance on securing\nmodems, please refer to the DHS practice guide entitled _Securing Controls System Modems._\n\n**Create a physical and logical DMZ separating corporate and IT environments**\n\nAll authentication servers and access servers should be placed in a DMZ. This separate logical\nand physical network prevents direct access into the control domain from the corporate or\nexternal environments. Although it does not impede business functionality, it can greatly\nincrease the work effort of an attacker. By locating the authentication servers that must be used\nto gain access to mission-critical assets, additional levels of security can be implemented.\nThese authentication servers should be located on a completely separate VLAN to support the\n\n\n-----\n\nisolation of these networks. When this approach is used in tandem with the isolation of critical\n\noperational assets, such as field devices, specific guidance that provisions in the credentials for\nremote access can be made easier. Much work has been accomplished as it relates to creating\nDMZs within control systems architectures. For further guidance on securing network\narchitecture, please refer to the OHS practice guide entitled Improving Industrial Control\nSystems Cyber Security with Defence-in-Depth Strategies.\n\n**Corporate** **Web** **corporate** **Wirel** **ess**\n## -,[-=] g�\n**1-----IA!iouwiil!�--,** �Servers\n# ���:-�r CORPORATE LAN\n\nACCe88\nSene,\n\n###### -. -.­\n ·-·--·-.. - ··-··-·· .\n\n**Communications External** CSP8X **U e!.o,s & Actuat'!e** **[j**\n**Infrastructures**\n\n_(Figure 8: Add a control systems' DMZ and segregate field devices from industrial control systems network.)_\n\nFigure 8 illustrates network segregation. The network is divided into functional areas and the\narchitecture is similar to that of an internet connection from corporate.\n\n**Create separate authentication servers for separate roles (vendors/integrators)**\n\nAsset owners should recognise that operational assets that contribute to control system\nfunctionality can be considered trusted or untrusted. Operators and engineers have traditionally\nbeen considered trusted elements and when inside the operational domain of the control\nsystem, their access is restricted based on policy. External elements, such as vendors and\nintegrators, create a situation where the electronic boundary is not easily perceived and may be\nconsidered untrusted. Although the trusted operators (internal) and untrusted support entities\n(external) may share the same architecture once connected, the mechanisms for provisioning\nthe access into the environment should be different. Not only will this help with security auditing\nand incident management, but it will also provide a much more granular capability to restrict\naccess based on user profiles.\n\nA separate server should be created for authorised users that come from an external\norganisation such as vendors or integrators. This creates the opportunity to create vendor­\nspecific access levels and they can provide for control mechanisms that limit a number of\n\n\n-----\n\ndifferent factors that range from time of day to traffic patterns. Dedicated authentication servers\nfor different roles allow for swift mitigation and security countermeasures in the event of a cyber\nincident. This will also give the asset owner the ability to dynamically lock down the vendor or\nintegrator access that can be quickly granted back when needed or on a case-by-case basis.\n\nDepending on the architecture that facilitates access into the control system environment\nservers can be deployed at a number of different locations connected to the external\ncommunications infrastructure. Furthermore, the authentication servers can be deployed to\nsupport existing or future media formats and can be deployed such that the external resource\nmust comply based on agreements set up during system procurement. As standard good\npractice would indicate, the authentication servers should have different user names and\npasswords than the user names created on the corporate or ICT network.\n\n**Enforce a security assurance policy for all remote access**\n\nAll users of any remote access system should sign a policy statement that supports the\nexpectations related to the provisioning of remote access. This policy will clearly define legal\nand acceptable use conditions associated with use of the system to which the remote access is\nfacilitating a connection. The security assurance policy should be formalised, documented and\napproved by a senior manager and should have the flexibility to be customised to accommodate\ndifferent users and different requirements.\n\nA good practice is the development life cycle of the remote access policy, which aligns with\nexisting ICT security policies that are mandated by overarching business functions. Modifying\nthe security policy to accommodate control systems architectures helps define the scope under\nwhich remote access users must function and clearly states the organisation has an\nunderstanding of the consequence associated with the misuse of the remote access channel.\n\nSpecific to the remote access policy are detailed definitions on device management and how\ndevices are identified as essential to core operations of the control system architecture. Unless\nspecifically defined, access to critical devices is to be read-only operations and deviations from\nthat standard are restricted to other categories of operators. If the remote access policy and\nthreat model assesses the essential need for remote command, control and change access,\nthen appropriate mitigation techniques should be identified to ensure core operational devices\nare able to be effectively monitored, alerted and archived. The policy should also address the\npurpose, scope, roles, responsibility and management of all remote access requirements. This\nmust be completed before any access is granted.\n\n**Full tunnels**\n\nSecuring remote access communications to ensure availability and integrity demand security\ncountermeasures that prevent an adversary from getting access to the data. In the control\nsystem space, much of the critical data are in real time and a compromise of the command and\ncontrol instructional information could have significant impact on the system. This fact suggests\nthat whenever possible the remote access that supports the operation of the control system\nshould be secured and authenticated by cryptographic means. Although the mathematics\ninvolved with contemporary cryptographic solutions is beyond the scope of this paper, of all the\nmethods for point-to-point encryption that can be used, the best solution in the control system\narena involves ‘full tunnels.’\n\nOrganisations looking to deploy cryptography have many options at their disposal but the\npreferred solution doesn’t always preclude an adversary from injecting himself into what is\n\n\n-----\n\nassumed to be a secure connection. The use of full-time roles prevents this type of attack and\nprohibits the attacker from acting as a gateway between the control system network and the\nnetwork from which the trusted resource is coming. In addition to ensuring that both\nauthentication and authorisation occur, the solution can reduce the risk relating to the injection\nof viruses and worms into the data stream.\n\nMost entities which use full tunnels create a remote access solution where initial authentication\nand authorisation must be to the corporate network first, then to the control system DMZ\nauthorisation server. This provides some protection against a compromised corporate account,\nthereby thwarting one of the more popular methods of control system compromise seen today.\nAs adversaries continue to exploit the relationship between business and control systems\nenvironments, any remote access solution that prohibits the exploitation of corporate trust while\nmaintaining critical access to control operations is a valuable one.\n\n**: : • • • • -���Exte,mal VPN 9 • • • • • : :** **Acee&& SeN�r**\n\n###### , ----\n ::!�a= -----, HMI\n ,11-·�+,/�_,Jc�:�J �\n\n**cs** -� .-- -�J . -\n**MODEM Pool** **I** i.. ___ _\n\nExternal\nCommunications **CS PBX** **D** **& Actuat!e** **fj**\nInfrastructures -!ors\n\n_(Figure 9: VPN Remote Access)_\n\nFigure 9 illustrates the use of encrypted tunnels, or VPN technology. In some cases, as with\nmodems, it can replace the access method with a more secure mechanism. In other cases, as\nwith network-to-network communications, it can add needed security by encrypting traffic or\nrequiring endpoint authentication.\n\nWith regard to cryptographic solutions, the discussion is not complete without paying attention\nto the issues surrounding latency. Indeed, almost every cryptographic solution available that is\ndesigned to secure point-to-point communications has the potential to impact data throughput\n\n\n-----\n\non a network. This latency is a function of not only the type of cryptography being used but the\nalgorithm being used to secure the data. Point-to-point cryptography uses symmetric key\nalgorithms where the key that is used to encrypt the information is the same key used to decrypt\nthe information. By its very nature, symmetric key cryptography is not as secure as asymmetric\nkey cryptography, but the attributes associated with symmetric key cryptography as related to\nminimal key management is attractive for large-scale environments using numerous disparate\ndevices. For control systems operations, these attributes make a symmetric cryptographic\nsolution and the best choice, even though the compromise of the single symmetric key could\nrender the solution useless.[j] Even with this risk in mind, as well as the possibility to increase\nlatency up to 30%, the symmetric solution remains very popular with many vendors deploying\nthe Advanced Encryption Standard (AES) in either the 128 or 256-bit version.\n\nWith regard to remote access, organisations need to recognise that the usage of the algorithm\ndoes not necessarily have to be a limiting factor in choosing a successful solution. In some\ncases, advanced developments in compression algorithms used in cryptographic solutions can\nactually reduce the latency and increased speed of communications beyond what they were\nprior to encryption. Numerous vendors actually provide technologies that were developed to\nsupport field technician remote access into mission critical devices and have extended their\nsolution to create secure channels for remote data acquisition from centralised servers.\n\nThe one caveat associated with these unique solutions is that the algorithms used may not\nnecessarily conform to recognised standards and some of the cryptographic solutions may not\nhave been fully vetted by the research community. Still, for some entities, the comfort of having\nsome data security without impacting the rate at which vital operational data can be acquired is\nmore than enough to justify its implementation.\n\n**Password policy**\n\nIn an ideal deployment, authentication mechanisms should be chosen based on the criticality of\nthe system being accessed and should include not only passwords, but other mechanisms as\nwell (see the section on ‘Two form factor authentication’). When using passwords, a secure\nremote access system should enforce complex passwords of 8 to 25 characters that are a\nmixture of upper and lower case letters, numbers and symbols.[k] In addition, corporate policy\nshould demand that these passwords be changed at a rate that is commensurate with the value\nof the system being protected and regular audits of the strength of these passwords should be\ndone as part of the organisational cyber security program. The corporate cyber security policy\nshould dictate that these passwords are never shared and that each user ID is unique across\nthe entire system.\n\nFor remote access programs, the creation of user ID and associated passwords should be done\nby a process that is unique to the type of user or service and their associated enclave.\nOrganisations are encouraged to classify users and services into levels of trust and deploy a\npassword policy based on the risk level of the user or service.\n\nj. Many security solutions in industrial automation use both symmetric and asymmetric solutions. However, some standards\nmandate that only symmetric solutions can be used (i.e. ANSI C12.19 and C12.22 for smart metering communications). 256-bit AES\nencryption should be implemented from client to corporate DMZ to control system DMZ. Encryption levels into the control system\ndomain should be tested and verified and will be dependent on the capability of the end control system devices to support 256-bit\nAES encryption.\n\nk. This guideline is a recommended best practice for general ICT security and the authors recognise that the creation and use of a\n25-character complex password (although ideal) for day-to-day human machine interface operations may be inappropriate. The\nrecollection and usage of such a password under duress may create circumstances that are unacceptable from a safety perspective.\n\n\n-----\n\nThe password policy needs to extend to the remote access technologies that are provided by\nthe vendors. The passwords must also be applicable to control system technology that may\nprovide for remote connectivity. Stated another way, if the vendor provides remote support\ntechnology, such as modems, as well as manufactures embedded remote access functionality\nin ICT field device technology (i.e. RTU, PLCs), the organisation should have a password policy\nfor the vendor’s remote support access and one that defines the provisioning of username and\npasswords for field equipment. Traditionally, the flexibility of vendor password policies has been\nlimited and changes to their standard procedures have only been considered when requested\nby very large customers. Many vendors do not provide the capability for any customer to\nchange administrative credentials required to access field equipment. Moreover, some vendors\nstill hardcode supervisory passwords into their control system making it impossible for a\ncustomer to change them. These issues, when combined with the historical cultural barriers\nassociated with cyber security and control systems, create situations that elevate the cyber risk\nan organisation can have.\n\nOrganisations developing mature cyber security programs to mitigate the risk associated with\nremote access should work with their vendors. As part of the procurement process, asset\nowners should demand that the capability to update administrative credentials for control\nsystem equipment be embedded in the vendor solution.\n\n**Two form factor authentications**\n\nAuthentication is the process of validating identity. Methods of validation can be broken down\ninto three categories, or factors. They are:\n\n    - Something you know (a secret, like a password or PIN);\n\n    - Something you have (a token or object that is unique);\n\n    - Something you are (biometrics, such as fingerprints, retinas, or gait).\n\nAttempting to improve security controls by using two passwords to access something is similar\nto using one password that is as long as the two combined and the method for ‘cracking’ one is\nthe same as for the other. However, using multiple authentication mechanisms from different\ncategories, or multifactor, means that the different mechanisms are unrelated to each other and\nrequire independent means of ‘cracking’ them.\n\nCritical control system assets, especially those that are only accessible through remote means,\nshould be deployed with dual-factor authentication to protect the link or at least protect access\nto the information resource or device. Today, for remote communications between main control\ncentres and backup facilities to occur across a trusted channel, access into critical operations is\naccomplished by multifactor authentication. This process is also very common in situations\nwhere field technicians are connecting remotely to critical operational resources to support\nsystem continuity, restoration, diagnostics and upgrades. Clearly, the compromise of these\naccess channels by an attacker could result in some significant damage, because once access\nhas been granted, instruction sets will be interpreted as coming from trusted sources.\n\nThe use of centralised servers for multifactor authentication is critical to the success in securing\nremote access. The software, which is loaded on information resources, needs permanent\nservers or mobile tablet computers and should be standardised across all remote connections.\nThis standardisation greatly empowers an organisation to create access control lists for remote\naccess and helps provision the appropriate audit functions that ensure only authorised activity is\nhappening in the operational domain.\n\n\n-----\n\nAlthough it is inappropriate to make the assumption that every organisation needs to prevent\nattackers from capturing static username and passwords, which can be reused by the attacker\nat a later time, organisations must perform appropriate risk assessments to define the level of\nprotection required to secure the credentials involved in remote access. When dealing with\nprimary critical systems, some organisations prefer to use multifactor authentication over\ncryptographic channels and force an initial authentication connection to happen on demilitarized\nservers. This is just one example of how defence-in-depth strategies can be used to secure\nremote access while not impeding business requirements.\n\nWith the deployment of security counter-measures, particularly those that are deployed to\nadminister access control over operational assets, an associated cost of ownership goes with\nmanaging the supporting technology. If a multifactor authentication mechanism is to be used,\nthen good practice dictates that a standardised method be available for administering remote\naccess and that could entail a dedicated server or services. The location of these servers will\ndictate who incurs the costs associated with the ownership and management of this service.\nLike managing firewalls and intrusion detection capabilities, predefined responsibility of the\nservers will help expedite a more robust remote access solution. Failure to do so could result in\nimproperly managed access control capabilities that could be exploited by an attacker.\n\n**Authorisation levels**\n\nDepending on the outcome of the threat and risk assessment, the secure remote access system\nmay require role-based authorisation levels. Read-only access is the default user level and\nshould be the de facto user level in the same way that the access control lists in a newly\ndeployed firewall prohibit access of any kind (until access control lists have been established to\nprovide only authorised connections). Access to the full network is limited and the concept of\nleast privileges is used. Users must escalate their privileges to make authoritative changes on\nthe network, control system devices, or any critical function.\n\nOrganisations should deploy remote access capabilities in a manner that guarantees that the\naccess to a single point will not automatically provide access to multiple points in a control\nsystem environment. Although apparently contradictory to common sense, organisations need\nto recognise that the rapidly emerging interoperability with historically untrusted networks\ndemands that attention be paid to the consequences associated with the exploitation of trust.\nOrganisations that simply provide a single level of authorisation for remote access users,\nespecially ones that need to support operations across different enclaves, risk an unseen\ndegradation in security posture.\n\nBy the simple allocation of identity and value to operational assets, organisations can reuse\nremote access authentication and credentialing capabilities for any operational domain or asset.\nThis would support the policy directive suggesting the secure remote access system does not\nallow access to multiple control networks without re-authentication and authorisation. Where\npossible, identity management techniques should be deployed to separate the identity of the\nsame user’s corporate account from the control system account. Changes to all aspects for\nauthorisation levels and identity data information are auditable and archived for managing\nchange, incident response and forensics. This approach has been proven to work in several\nsectors and in several mission-critical domains.\n\n\n-----\n\n**Dedicated client hardware and software**\n\nOne of the fundamental elements of any remote access solution is that the users of the remote\naccess system will be empowered with both the software and hardware required to connect. Yet\nthreat and risk assessments show that both the hardware and software of a dedicated remote\naccess client is the target of an attacker. Once an attacker has access to client hardware or\nsoftware he or she is only limited by the ability to get past the local security of the system.\nTraditional approaches that provide remote access software on the standard issue mobile\ncomputing device have enabled attackers to not only access operational data, but to access\noperational networks as well. Recommended practices suggest that the technology for doing the\nbusiness and the technology for getting access to the business should be separate.\n\nAs part of the remote access solution, the organisation should provide a dedicated personal\ncomputer (PC) or laptop for VPN access, one that is centrally managed and hardened with a\nbaseline image specific for remote access needs. The PC or laptop will have appropriate cyber\nsecurity counter-measures, such as antivirus or host-based intrusion detection systems\nsoftware and can even include security counter-measures that have been designed to meet the\nunique requirements for field operations and control system functionality. The PC or laptop\npolicy and procedure should be clearly spelled out that the use of this system is for secure\nremote access. Another consideration would be to use the MAC address of the system as an\nadditional authorisation factor. Many organisations have found it helpful to designate remote\naccess resources to be tuned to specific hardware identification metrics that are physically\nattached devices.\n\nIf a PC or laptop cannot be provided, then the investment to provide antivirus and spyware\nremoval tools for a user’s home computer is suggested. If providing dedicated ICT resources to\nremote users is not a viable option, supporting the configuration of personal computers to\naccommodate the specific security needs for remote access should be performed.\nOrganisations which require remote access to control systems operations should be able to\nhave any computer adjusted to a baseline security standard as well as deploy cryptographic and\ndisk encryption security measures to facilitate the protection of operational data. While never\nrecommended, if the user’s home computer is going to be used for remote access to control\noperations, then secondary and tertiary identification/authorisation methods, as well as up-todate antivirus, anti-Trojan and anti-spyware software measures, should be established to\nensure security. Regardless of whether the organisation is going to use dedicated resources or\npersonal home computers, specific education and outreach pertaining to access procedures\nand security safeguards must be taught. Without appropriate cyber security education, covering\nthreats, risk, vulnerabilities, consequence and the appropriate use of remote communication\ntechnology, the security element of the remote access solution is incomplete.\n\n**Session termination**\n\nThe concept of establishing a session is fundamental when discussing remote access. The\nmanagement and protection of that session is fundamental when discussing secure remote\naccess. No discussion of secure remote access is complete without brief mention of session\nand session termination. Although it is conceivable that some remote access sessions will be\nestablished in perpetuity, usually to facilitate communication needs related to availability, remote\naccess solutions need to be deployed with viable and effective mechanisms for terminating\nsessions. Session termination is a mandatory element of any secure remote access solution\nand organisations should be able to facilitate session termination either on request or\nautomatically due to system configurations.\n\n\n-----\n\nSome of the more serious oversights related to remote session termination that have been\nobserved in control systems environments have led to the creation or the unintentional support\nof covert channels and situations of denial of service. Regardless of the method used for remote\nconnectivity, communications channels need to be configured to terminate under certain\nconditions. These can include, but should not be limited to:\n\n    - Termination of the session after a set period of time;\n\n    - Termination of the session upon reaching predefined triggers (time of day, day of\nweek, on request, data type, file size, etc.);\n\n    - Termination of the session based on inactivity;\n\n    - Termination of initial response capability based on number of failed attempts;\n\n    - Termination of session based on cryptographic key exchange failures;\n\n    - Termination of session based on quality service;\n\n    - Termination of session based on confirmed tampering.\n\n\n-----\n\n###### Managing remote access in control systems environments\n\nWhen creating and deploying a secure remote access solution, an organisation will need to\ninvolve both ICT security and infrastructure teams along with control systems engineers and\noperators. In order to ensure security is embedded as early as possible, this cross domain\ncooperation is best started at the design phase of the secure remote access solution.[l] Figure\n10 provides a notional diagram that illustrates secured remote access.\n\nThe purpose, roles and responsibilities should be clearly defined from the outset of the design of\nthe secure remote access solution and should be reviewed, at a minimum, yearly. The\norganisation should clearly define their unique requirements and capabilities of their\ninfrastructure and resources. Operational considerations should define and disseminate areas\nof responsibility that are only for ICT personnel managing the business and external access\nnetworks, only for control systems personnel and those responsibilities that are shared between\nthem. ICT personnel should be responsible for the communication and security configuration of\nall access points and devices from the remote client to the control system DMZ. All remote\naccess and remote communication from the control system DMZ into the control system\nnetwork should be the sole responsibility of control system personnel. The servers, network\nsegment and firewall that separate the control domain from the corporate domain and make up\nthe control DMZ should be a shared responsibility with the control system and the ICT\npersonnel. Proper training and understanding of both domains shall be established for\npersonnel managing the shared responsibility domain.\n\nSecurity management of the remote access solution should follow defence-in-depth techniques\nwith multiple layers of defence and should incorporate best-of-breed elements from standards.\nAlthough not an exhaustive list, examples of layered defence techniques in relation to remote\naccess are the following:\n\n    - Intrusion prevention solutions should be deployed on both the business ICT DMZ and\nthe control system DMZ, leveraging operation-specific signatures and triggers defined\nby the remote access solution parameters.\n\n    - Provisioning of identities, authorisation and authentication should be a separate team\nthat adheres to strict change management policies and procedures.\n\n    - VLAN or physical segmentation within and between the business ICT networks and\ncontrol system networks, connected only through a robust firewall configured\naccording to the principle of least privilege.\n\n    - Centralised log management and 24/7 monitoring of security events and logs for\nproactive incident response and more accurate forensics.\n\n    - Regular reviews and assessments of technologies deployed and policy and procedure\nenforcement.\n\n    - Patch management strategies for all ICT devices that make up the secure remote\naccess solution, including remote clients, untrusted servers and access gateways and\nterminal services.\n\nl. Some organisations have found it very useful to include an option for the creation of a remote access solution into the\nprocurement process, suggesting that vendors will create the solution as part of a value added.\n\n\n-----\n\n          - The use of anti-spyware, anti-malware and anti-virus services that are frequently\nupdated on a scheduled basis.\n\n**Aeeeu**\n**Serve,**\n\n**External**\n**Communications** **CS PBX** **-:!:ors &Actual�** **n**\n\n###### 0\n\n**Infrastructures**\n\n_(Figure 10. Secured remote access)_\n\n###### Case study: Marstad [m ] municipal operations\n\nTo better understand how remote access solutions can have a positive contribution on\nmaintaining critical infrastructure control systems, it is useful to discuss a simplified use case.\nAlthough several different sectors could be used as the basis for an informative discussion on\nremote access, only three or four different sectors would require a solution that could address\nalmost all the issues discussed in this practice guide. Although all the issues discussed in this\npractice guide deserve attention, not every organisation will need to consider each one of them.\nHere, a simple use case involving a municipal water treatment centre has been developed. This\nsimple case study and the remote access elements within it can be extrapolated to any other\nsector as required. In addition, some of the issues related to the demands on a control system\narchitecture regarding meeting growing infrastructure requirements are presented as well.\n\nThis case study is presented from the perspective of security risks, remote access requirements\nand solutions based on risk assessments.\n\nm. Marstad is a fict onal town.\ni\n\n\n-----\n\n**Background**\n\nA municipal water treatment centre in Marstad has a control system architecture that manages\nseveral critical areas of the water supply, including source, treatment centre and distribution.\nThe Marstad municipality is responsible for a large geographic area with a population of\napproximately 50,000 people. The municipality and surrounding areas are rapidly growing and\nnew housing developments and businesses are rapidly increasing demand on the existing water\nsupply. The Marstad municipality is expected to grow to just over 150,000 people in the next ten\nyears. The water source for Marstad is located past the Marstad municipal boundaries that the\nactual treatment centre is in and crosses into two other cities contiguous to Marstad. The\nMarstad water treatment centre is within its own city limits and it runs the water pipeline to a\nstorage facility in addition to remote customer sites.\n\nThe head office for municipal operations (corporate) and government works is located two\nblocks away from the Marstad City Hall building. To effectively manage the water system and\nthe water treatment centre, both which serve very large areas, the municipality uses several\nremote access connections to facilitate water operations, vendor support access and integrator\nmaintenance.\n\n**Control system architecture**\n\nAs with all municipal works companies, the Marstad fresh water system’s annual budget is\npartially dependent on factors outside the control of its management staff. As a result, the\ncontrol system architecture is a mixture of design techniques that have been joined together\nover decades as funds became available.\n\nWhen first installed in 1973, the electronic control systems were not centrally managed. The\nwater treatment facility used its own control room in house. Pump houses, including the water\ntower, used electromechanical components until 1985, when the first PLCs were put in place. At\nthat time, the water treatment facility was upgraded to be completely automated and required\nonly a skeleton crew to monitor the system and troubleshoot problems. Pump houses were\nfitted with telecommunication links back to the head office, typically leased lines or ISDN. The\nwater treatment facility was connected to the head office by a 256-K ISDN link.\n\nBudgets in the 1980s were quite full. The economy was extremely strong; so despite tax cuts,\nthe municipal coffers were well padded. At this time, Marstad water was able to justify and\nacquire approval to include leak-detection capabilities on its water mains. A program was put in\nplace to add leak detection at 17 strategic locations in the existing mains and to include\nstrategic placement of leak detectors during the addition of new community mains and during\nmain replacement. Leak detectors on new installations can be connected through any\ntelecommunications media, but those installed on existing or replacement pipe cannot typically\nbe connected using physical communication lines. As a result, detectors use a mixture of\ncopper, fibre-optic and radio frequency telecommunication methods.\n\nUntil 1992 the town was small enough for its supply to be equilibrated and managed solely by\nthe water tower. In 1987, due to highly fluctuating water levels in the tower, the town recognised\nthe need for a reservoir and it was completed in 1992, despite threats to defund the already\napproved project due to the recession in the early 1990s. The reservoir was built with its own\ncontrol room, but it was unmanned. With the belt-tightening of the recession, all monitoring of\nreservoir systems was centralised to the head office control centre, which then had primary\ncontrol of the reservoir, pump houses and the water tower and also had monitoring capability for\n\n\n-----\n\nthe water treatment centre. However, the control room at the treatment centre has been\nmaintained, such that if necessary it can be used as a backup control centre in the event of an\nemergency.\n\nAs part of the reservoir project, the water delivery control infrastructure was updated to ‘modern’\nPLCs, with a centrally managed DCS in the head office. However, the water treatment centre\nbecame a victim of its own success. Long periods of operation without incident combined with\nthe budget crunch from the recession caused the treatment centre to lose its entire permanent\nstaff and monitoring was moved to the central office, along with the monitoring of the upgraded\npump houses. Consequently, by 1994 all monitoring of fresh water delivery was central,\nproblems were managed centrally and staff was dispatched to remote sites as needed. The only\nemployees who regularly enter facilities do so to remove waste from and supply products to the\nwater treatment centre.\n\nAs the cost of leased lines grew through the 1990s, reprovisioning of telecommunications was\nundertaken, primarily as part of cost recovery efforts. The connections from the water treatment\ncentre, the reservoir and 11 of the pump houses have been moved to the local telephone\ncompany’s MPLS cloud. The remaining four were provisioned with internet connections in 2001\nand small business firewalls with VPN capabilities were installed. The VPNs are used to tunnel\nacross the internet to the head office to allow remote monitoring by the DCS.\n\nThe internal network at Marstad Municipal Operations is flat. The control system and corporate\nsystems all exist within one ‘security zone.’ They have implemented a corporate firewall with a\nDMZ for their public website and customer service web applications, but though the internal\nnetwork has many segments, there are no network access controls within it.\n\nPrior to the advent of VPN technology, modems were used to allow ICT and industrial control\nsystems administration staff to access systems from home. This modem pool has been reduced\nin size since adoption of VPNs for employee use, but they have not been eliminated entirely. In\naddition, the support contract between the industrial control systems system integrator and\nMarstad Water Distribution requires that the integrator has remote access to the DCS. Thus\nmodems are installed on the DCS, the Data Acquisition Server and the Historian database. A\nsimilar contract with IBM has resulted in a modem being installed on the mainframe used for\ncustomer management.\n\nBecause the water source is shared between three political regions, they have all entered into a\nsophisticated resource sharing agreement. Consequently, they must share usage information to\nsupply the data for reconciling actual use and are interconnected through WAN links.\n\n\n-----\n\n|Roiuc,|Col2|\n|---|---|\n\n\nAll Marstad municipal offices use the same LAN. This\nIncl udes city haU, Marstad Wate, Distribut!oo , publ ic\nlibraries, and the Marstad District School Board.\n\nConfiguration\n\nPBX Customer B11Hng Serve,\n\nRouic , Z·OS. Customer·1\n\nEngineering\n\nData Ad:luisition ' HMI Work.stations Historian\nMW/RF !\n\ni\n\nRTUIPLC I i\n\n###### ililWilJ ··-··-··-··-··-··-··-··-··-··-··-··-·· :.·-··-··-··-··.;\n\n**Field Locations**\n\n###### II -!ors & Actual� i]\n\n15 pump houses, 1 water tower. 1 wate, [II � f:i{II l[� ]f .... =... [Sv-tems ] � :II lft [� ]\ntreatment pl ant, 1 re\"Servoir , 26 Jeak detectors\n\n_(Figure 11: Marstad water distribution network -_ _prior to security)_\n\nIn figure 11, the Field Locations represent the pump-houses, the water tower, the reservoir, the\nwater treatment facility and the leak detectors. Some of them connect via WAN links, which can\nbe MPLS or radio frequency. Others connect via site-to-site VPNs over DSL and the internet.\n\nAll the VPN-enabled sites use IP to communicate between the PLCs and the systems at the\nhead office. Those sites connected through the WAN use a combination of IP and serial to\ncommunicate with head office systems.\n\nTo leverage infrastructure and lower costs, the Marstad Municipal Network has been\nprovisioned for use by all city employees. This includes, but is not limited to, City Hall, Marstad\nWater Distribution, Marstad Wastewater Company, public libraries and the Marstad District\nSchool Board. The Marstad emergency services each have their own network.\n\nInternal to Marstad's network environment, administrators make extensive use of Virtual\nNetwork Computing (VNC) to remotely manage systems, including industrial control systems\nthat support it.\n\n**Risk factors**\n\nFor the Marstad operations, multiple network connections to and from myriad field devices are\ncontained in the distributed control system. The steady growth in population has increased\n\n\n-----\n\ndemand for the supply of water to the municipality and as such, the municipal corporate office\n(where control operations are located) is experiencing an increase in demand for remote access\nto the control system. The demand is coming primarily from internal engineering and the\nrequests are to meet the demands of operational requirements that must be met by engineering\nand the occasional vendor support.\n\nTo manage the water operations control system remotely, multiple external connections\n(sourced at different locations) come into the control systems via several pathways. The\nnumerous remote access requirements create increased risk for water operations, but the\nlargest security risk is created by the primary vendor of the control system. To maintain\noperational support and to ensure compliance with service agreements promised to Marstad,\ndirect access to the control system Master PLC farm must be provided.\n\nThe procedure to facilitate this connection is straightforward and is not unlike the mechanism\nused by many organisations requiring remote support for their industrial systems. The switch\nthat the master PLC is connected to, one that is connected to the control LAN, is simply\nconnected to a router that has internet access. When connected, the vendor connects to the\nweb interface of the master PLC and begins remote administration of the device and the other\nsubordinate field equipment connected to it. During this time, the master PLC is connected to\nthe internet and has an IP address that can be accessed from anywhere, thus allowing any\nvendor representative to administer support from any location. Moreover, this configuration can\nfacilitate access to offsite remote Marstad engineers, requiring access to control system\noperations.\n\nThe protocol for establishing this remote access path is manual and unrefined and connections\nare created on an as-needed basis. The procedure does require that once the remote support\nactivity has been completed the connection is terminated. However, recent increases in demand\nfor water operations has created a need for the configuration to stay enabled, as the cost of\nterminating and re-establishing the remote access channel becomes quite high and is a uniononly function. During the last several months, many cyber incidents were observed and many\nsystem abnormalities were attributed to the possibility of cyber attackers exploiting the remote\naccess connection. Management has become concerned that an attack on the Marstad control\nsystem could be significant and could impact that ability for the municipality to perform\nwater/wastewater operations in a safe and resilient manner.\n\nThe second risk to security is based on the fact that corporate and control system networks are\nnot segmented physically and logically. To accommodate the requirements that meet business\nlogistics and financial operations, the municipal network was developed ‘flat’ in nature. Although\nthe control system for municipal water operation was originally separated from any other\nnetwork, the demands associated with the growth in population required that Marstad corporate\nfunctions have oversight into infrastructure operations. As such, both the corporate and the\ncontrol systems operations LAN were connected and now technically reside on the same\nnetwork. The security is performed by trivial access control listing and some rudimentary routing\nand ICT operations are the authoritative entity in charge of networks for both corporate and\ncontrol systems operations.\n\nAlthough users in both domains are considered trusted, a user from the municipality’s city hall or\na user from a building outside the control system network can route to areas within the water\noperations control system network. A main firewall at City Hall provides internet access for all\nMarstad divisions such as human resources, emergency operations, city planning and\ntransportation. Inside the municipal network, however, the control system network for water and\nwastewater is not from other networks and no other firewalls provide cyber protection among\ninformation enclaves.\n\n\n-----\n\nRemote access is provided by VNC. Within the main municipal network, VNC is used\nextensively for remote terminal access. To provide for interoperability, any servers,\nworkstations, or devices that are running VNC on any network are accessible from any IP\naddress within the main city hall network. Passwords on VNC servers are set, but many of the\npasswords are trivial or shared and an unenforced password policy exists for updating user\ncredentials. The network is essentially flat and the compromise of one corporate machine will\nmake routing around and the compromise of other machines fairly simple.\n\nThe two organisations which share water supply with Marstad are connected directly to the\ncontrol system network to share usage data. Compromise at either location, where security is\nnot managed by Marstad, could potentially create a compromise of Marstad systems. Similarly,\na compromise at Marstad could result in a compromise at one of the partner organisations,\nwhich could lead to legal liability.\n\nExisting remote access is not managed with effective security policies and procedures. Remote\naccess is not centrally managed and the administrators of the different networks (including the\ncontrol system network) can create their own remote access solutions. Some users, regardless\nof role, are authenticated fully to the entire information infrastructure. The data and network\nsecurity are non-standardised, with connections using very weak encryption or no encryption at\nall.\n\nHaving provided an overview of the Marstad infrastructure, the recommendations can be\nreviewed using the principles discussed in this practice guide.\n\n**Solutions for securing the municipality’s remote access**\n\nIn order to create a robust remote access solution for the municipal water operations, a list of all\nessential control system devices, processes and services was created. When completed, this\nlist helps asset owners understand what the risk exposure was to control system operations and\npositions it in terms of the impact an incident could have on core operational services. Using\nthat list, critical assets were assessed to determine what security capabilities existed within\nthem and how they align with the current countermeasures in place to protect those assets.\n\nThe risk of exposing the master PLC was considered very high and the procedure was changed\nto not allow any device connected to the control system to have direct connections to the\ninternet. This, of course, had an impact on the mechanism that facilitated timely vendor support.\nHowever, operations had decided that the risk associated with unsecured remote access could\nrender the vendor channel unavailable. In addition, an increased risk for cyber attack was either\ncoming from or going to the vendor and that risk was unacceptable.\n\nFor vendor access, a separate authentication terminal server was created and roles and access\ncontrol lists were created on the server for each and every vendor who needed access. In\nessence, a dedicated authentication server farm was established to validate credentials and\naccess rights to remote users in the vendor group. Because a problem existed with leaving\nvender access channels open, the vendor IDs were automatically disabled after two hours of\ninactivity or three failed login attempts. The credentials were not removed from the\nauthentication server, however. The new procedure for reactivating a vendor ID was to go\nthrough a change control procedure that ordered the reinstatement of the ID and sign-off was\nrequired from both sponsoring IT personnel and control system engineers. This new process\nenhanced the ability to audit vendor connectivity and as each vendor supported different\ntechnologies, the Marstad security group was able to create specific intrusion detection\nsignatures that would trigger in the event a deviation occurred from expected traffic flows.\n\n\n-----\n\nOperational equipment was evaluated in terms of criticality and because of the nature of polling\nand sampling requirements in the water operations (not high sampling or polling rates by any\nmeans), remote access channels were encrypted using a simple commercial off-the-shelf\nsolution. Rather than place the security responsibility of the remote access path on Marstad, this\nsolution was standardised and provided adequate foundation for each vendor to be held\naccountable for managing their secure remote access. Following this deployment that satisfied\nthe need for external remote access connections to be made, Marstad operations created a\nterminal server that would facilitate remote access for internal users.\n\nThe next step for the municipality to secure their remote connections was to create a clear\nsegmentation between the control systems network and all other networks that were connected\nto City Hall. A firewall was installed to protect the main router and the multi-homed solutions\nprovided ample opportunity for the segmentation of municipal departments. To\ncompartmentalise the water operations, VLANs were created using dedicated technology. With\nthese segregated networks, only specific VLANs were allowed to access the router that\nconnects to the control system network. No other traffic was allowed to route around the new\ncontrol system firewall.\n\nSimilarly, the two partner organisations were moved off the control system WAN and connected\nthrough a separate WAN. This WAN terminated at a new Firewall dedicated for the purpose,\nwhich restricts access to all but a usage data stream continuously sending and receiving data\nbetween all the partners.\n\nFollowing the deployment of dedicated firewalls and VLANs, the next step was to create a\nphysical and logical DMZ that was the intermediary between the city hall network and the\ncontrol systems network. All servers that needed to be accessible to the city hall network were\nplaced into the DMZ. The newly built vendor terminal server was placed in the DMZ as well as\nthe new internal terminal server built solely for internal users. A secure client was then installed\non all end devices that could meet the minimal requirements of the software. All VNC software\nwas removed and the secure client software was placed instead on each device that required\naccess from the new internal terminal server. Rule sets for only the necessary ports for the new\nterminal servers, along with any other servers that were on the DMZ were created (Web\nservers, SCADA servers, Historians). All other ports and services were removed from the DMZ\nservers and all users of the core server operating systems were removed (with the exception of\nthe users who manage the server).\n\nThe concept of least privilege was used on the DMZ servers and all users managing the servers\nwould have read-only access. Significant improvements were made regarding change control\nand audit and administrators would have to escalate their privilege with a separate user ID and\npassword in order to make a change on the system.\n\nA full review of all the security policies and procedures was completed and assessed against\nthe control system goals and remote access requirements. The new policy deemed that while\nusing remote access, no other corporate wide services should be required. Access control lists\nand program limits were implemented to prevent rogue activity. Any remote access to the\ncontrol systems architecture was considered totally separate and unique from access to only the\ncorporate network. A limited amount of people have network access to the internal terminal\nserver and fewer still have IDs on the terminal server to manage systems on the control\nnetwork.\n\nA new separate remote access policy was created specifically for the control network. A security\nrequirement was initiated, resulting in the distribution of hardened laptops that would be\ndedicated for control system remote access. Installed on the laptop were only minimal services,\na kernel locking program to prohibit administrative changes in access functionality. The system\n\n\n-----\n\nwas also locked to allow the functioning of only those ports required by the software to manage\nthe control system.\n\nSecure software used to create a VPN full tunnel to the corporate firewall was standardised. In\norder to use the software remotely, a secure token must be used with one-time passwords\nalong with another password that only the user/operator knows. The encryption on the\nconnection from the software to the corporate authentication server on the corporate DMZ was\n256 bits and when the remote access computer was off or in standby mode, the entire disc was\nencrypted. This solution protects the confidentiality and integrity of the data in transit from an\nexternal connection to the corporate network as well as the data at rest. The industrial control\nsystems users were placed on a separate VLAN that only has access to the internal terminal\nserver. The vendor terminal server was also on a separate VLAN. All auditing was turned on at\nthe terminal server and a control system-specific intrusion prevention system was installed\noutside and inside of the new control system firewall.\n\nFinally, in order to monitor for improper activity, intrusion detection systems were installed\nbehind the network.\n\nAll Mars.tad municipal offices use the same LAN This\nincludes city hall, Marstad Water Distribution, publ ic\nlibraries, and the Marstad Oistrict School Board\n\nConfigurabon\n\nServer\n\nHMI\n\nMW/RF Data Ac�uisition His torian\n\nRTUIPLC ' ' -.. -.. -.. -.. -. ·-··-·' -.. -.. -'·-.. -.. • .. . -.. -.. -.. -',.., I :\n\n**Field Locations**\n\n###### IJ e!:o,s & A ctuat'!rra 0\n\n15 pump hovses, 1 water tower. 1 water\ntreatment plant. 1 reservoir. 26 lea)c deteaors\n\n_(Figure 12: Marstad water distribution network - after security updates)_\n\n\n-----\n\n###### Conclusion\n\nThis document illustrates the methods used to secure remote access into control system\nnetworks and demonstrates that existing security techniques deployed in ICT environments are\nalso effective in ICS environments. ICS security staff and ICT security staff each have insights\nthat can be leveraged in either environment. It means that ICS managers do not have to\nreinvent security procedures and technologies - they are already available.\n\nModern ICS environments include many of the same technologies as ICT environments and,\ntherefore, share similar security concerns and solutions. Whether an ICT or ICS environment, or\na secret facility or a school or a space shuttle, security consists of:\n\n    - Preventing unauthorised access to something;\n\n    - Preventing unauthorised changes to that something;\n\n    - Ensuring that something is available when needed.\n\nThe solutions that ensure that these properties of the environment are maintained are the same\nin both types of environments:\n\n    - Direct preventative controls;\n\n    - Direct detection and response controls;\n\n    - Deterrent controls;\n\n    - Compensating controls.\n\nThis document has provided many examples of these controls, how they are deployed and\nmanaged and to what extent they limit operational risks. A proper regimen of identity\nmanagement, access controls and active monitoring of networks and systems for malicious\nactivity provide a complete defence-in-depth.\n\nThe major difference between security in ICT and security in ICS is the pre-eminence of\navailability as an operational requirement in ICS environments. ICS environments typically have\nno tolerance for unplanned downtime, whereas ICT environments, with some notable\nexceptions, are usually more forgiving. The inability to tolerate downtime in ICS environments\nresults in ICS personnel becoming wary of new technologies; updates to existing systems;\nchanges to the system configurations or the ICS architecture, and so on. However, this is a\ncultural issue, not a technological hurdle. The requirement for high availability simply requires\nmore planning, more testing and more resources to ensure that security techniques and\nprocedures can be injected into ICS environments safely and without mishap. Sometimes a\ndirect control is not possible, so compensating controls are instead put in place.\n\nThis process, wherein one assesses risk, remediates risk, accepts residual risk and\ncontinuously improves, is known as a security program and is identical for both ICT and ICS\nenvironments. By borrowing from ICT security programs and technologies, ICS managers can\nappropriately manage their security risks (including remote access risks) without unduly\nimpinging on their operational requirements.\n\n\n-----\n\nIn conclusion, no single secure remote access solution is applicable to all possible architectures\nand no single remote access solution can provide adequate security without a defence-in-depth\napproach. However, by exercising caution and generating and implementing concise\nrequirements based on good analysis, secure remote access solutions can be deployed and\nmaintained.\n\n\n-----\n\n###### Glossary\n\n Acronyms\n\n**AES** Advanced Encryption Standard\n\n**ATM** Asynchronous Transfer Mode\n\n**CPNI** Centre for the Protection of the National Infrastructure\n\n**DHS** U.S. Department of Homeland Security\n\n**DMZ** Demilitarized Zone\n\n**HTTPS** Hyper Text Transfer Protocol (Secure)\n\n**ICT** Information and Communication Technology\n\n**ID** Identification\n\n**IPSec** Internet Protocol Security\n\n**ISDN** Integrated Services Digital Network\n\n**IT** Information Technology\n\n**L2TP** Layer 2 Tunnelling Protocol\n\n**LAN** Local Area Network\n\n**MPLS** Multi Protocol Label Switching\n\n**NIST** National Institute of Standards and Technology\n\n**PC** Personal Computer\n\n**PLC** Programmable Logic Controller\n\n**POTS** Plain Old Telephone Service\n\n**RAS** Remote Access Server\n\n**RTU** Remote Telemetry/Terminal Unit\n\n**SCADA** Supervisory Control and Data Acquisition\n\n**SSH** Secure Shell\n\n**SSL** Secure Sockets Layer\n\n**VLAN** Virtual Local Area Network\n\n**VNC** Virtual Network Computing\n\n**VPN** Virtual Private Network\n\n**WAN** Wide Area Network\n\n**WLAN** Wireless Local Area Network\n\n\n-----\n\n###### Nomenclature\n\n**Access control** The protection of system resources against unauthorised access; a\nprocess by which use of system resources is regulated according to a\nsecurity policy and is permitted by only authorised entities according\nto that policy.\n\n**Asset** Anything that has value to the organisation, its business operations\n\nand its continuity.\n\n**Assurance** The attribute of a system that provides grounds for having confidence\n\nthat the system operates such that the system security policy is\nenforced.\n\n**Authenticate** To verify the identity of a user, user device or other entity, or the\n\nintegrity of data stored, transmitted or otherwise exposed to\nunauthorised modification in an information system, or to establish\nthe validity of a transmission.\n\n**Authentication** The process of authenticating (see ‘Authenticate’ above).\n\n**Authorisation** The process of determining an entity’s rights to perform some action\n\nor gain access to a system resource or data set. Alternately, the right\nor permission that is granted to a system entity to access a system\nresource (i.e. ‘my authorisation is...’).\n\n**Availability** A property of a system, process, resource or asset that indicates its\n\nability to fulfil its function over a stated period of time, or at a given\npoint it time.\n\n**Code of** An agreement on the policy and rules for the connection of internal or\n**connection** external assets that are subject to different management domains.\n**(CoCo)**\n\n\n**Defence-in-** A number of different controls used to mitigate a specific risk (or set\n**depth** of related risks), in order to reduce the residual risk to an acceptable\n\nlevel.\n\n**Discretionary** A means of restricting access to objects based on the identity and\n**access control** need-to-know of the user, process and/or groups to which they\n\nbelong. The controls are discretionary in the sense that a subject with\ncertain access permission is capable of passing that permission\n(perhaps indirectly) on to any other subject.\n\n\n-----\n\n**Encryption** The transformation of plaintext (also called clear- text or that which is\nin an understandable format) into cipher text (unreadable format)\nusing a method that is difficult to decipher without specific,\nindependent information used in the transformation process.\n\n**Impact** The result of an information security incident, caused by a threat,\n\nwhich affects assets.\n\n**Least privilege** This principle requires that each subject in a system be granted the\n\nmost restrictive set of privileges (or lowest clearance) needed for the\nperformance of authorised tasks. The application of this principle\nlimits the damage that can result from accident, error or unauthorised\nuse.\n\n**Likelihood** This is broken down into three factors: capability (degree to which the\n\nattacker possesses the skills, knowledge and resources to be\nsuccessful in attempt), opportunity (combination of access to\norganisation’s assets together with vulnerability of environment) and\n**motive/intent (measure of the determination to carry out the attack).**\n\n**Mitigation** Limitation of the negative consequence of a particular event.\n\n**Motivation** A combination of proven intent to attack and the attractiveness of the\n\ntarget in meeting the aspirations and aims of the adversary.\n\n**Risk** The potential that a given threat will exploit vulnerabilities of an asset\n\nor group of assets and thereby cause harm to the organisation.\n\n**Risk assessment** Assessment of threats to, impacts on and vulnerabilities of\n\ninformation and technology processing facilities and the likelihood of\ntheir occurrence\n\n**Risk** The process of identifying, controlling and minimising or eliminating\n**management** risks at an acceptable cost. In the context of this document, risks\n\ninclude security risks that may affect information systems or industrial\ncontrol systems.\n\n**Security level** The combination of a hierarchical classification and a set of non\nhierarchical categories that represents the sensitivity of information.\n\n**Threat** A potential cause of an incident that may result in harm to a system\n\nor organisation.\n\n**Vulnerability** A weakness of an asset or group of assets that can be exploited by\n\none or more threats.\n\n\n-----\n\n###### Figures\n\nFigure 1: Traditional isolation of corporate and control domains ........................................... 7\n\nFigure 2: Integrated networks. ........................................................................................... 8\n\nFigure 3: Attack vectors when using remote access. .......................................................... 24\n\nFigure 4: Example of poor network security....................................................................... 28\n\nFigure 5: Security countermeasures.................................................................................. 31\n\nFigure 6: Basic industrial control systems network with no security..................................... 36\n\nFigure 7: Eliminate ‘direct connections’ by adding firewalls around the industrial control\nsystems environment......................................................................................... 38\n\nFigure 8: Add a Control Systems' DMZ and segregate field devices from industrial\ncontrol systems network. ................................................................................... 39\n\nFigure 9: VPN Remote Access........................................................................................... 41\n\nFigure 10: Secured Remote Access...................................................................................... 48\n\nFigure 11: Marstad Water Distribution Network - prior to security. ........................................ 51\n\nFigure 12: Marstad Water Distribution Network - after security updates................................. 55\n\n###### Tables\n\nTable 1: Different remote access solutions. ...................................................................... 19\n\nTable 2: Comparison of control systems and ICT remote access requirements.................... 33\n\n\n-----\n\n###### Further reading\n\n_[NIST guide to industrial control systems security csrc.nist.gov/publications/PubsDrafts.html#SP-](http://csrc.nist.gov/publications/PubsDrafts.html#SP-800-82)_\n[800-82](http://csrc.nist.gov/publications/PubsDrafts.html#SP-800-82)\n\n_NIST guide to enterprise telework and remote access security_\n[csrc.nist.gov/publications/nistpubs/800-46-rev1/sp800-46r1.pdf](http://csrc.nist.gov/publications/nistpubs/800-46-rev1/sp800-46r1.pdf)\n\n_Mitigations for security vulnerabilities found in control system networks_\n[csrp.inl.gov/Documents/MitigationsForVulnerabilitiesCSNetsISA.pdf,](http://csrp.inl.gov/Documents/MitigationsForVulnerabilitiesCSNetsISA.pdf)\n\n_Common cyber security vulnerabilities observed in DHS industrial control systems assessments_\n\n[www.uscert.gov/control_systems/pdf/DHS_Common_Vulnerabilities_R1_08-14750_Final_7-1-](http://www.uscert.gov/control_systems/pdf/DHS_Common_Vulnerabilities_R1_08-14750_Final_7-1-09.pdf)\n[09.pdf,](http://www.uscert.gov/control_systems/pdf/DHS_Common_Vulnerabilities_R1_08-14750_Final_7-1-09.pdf)\n\n_Common control system vulnerabilities_\n\n[csrp.inl.gov/Documents/05-00993%20r0%20Common%20Vulnerability.pdf,](http://csrp.inl.gov/Documents/05-00993%20r0%20Common%20Vulnerability.pdf)\n\n_[Cryptographic protection of SCADA communications, part 1: background, policies and test plan](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)_\n[www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)\n[5DC877563A0F/0/0603AGAREPORT12.PDF](http://www.aga.org/NR/rdonlyres/B797B50B-616B-46A4-9E0F-5DC877563A0F/0/0603AGAREPORT12.PDF)\n\n_Catalogue of control systems security: recommendations for standards developers_\n\nwww.uscert.gov/control_systems/pdf/Catalog_of_Control_Systems_Security_Recommendation\ns.pdf\n\n_Cyber security procurement language for control systems_\n\nwww.uscert.gov/control_systems/pdf/SCADA_Procurement_DHS_Final_to_Issue_08-19-08.pdf\n\n_Process control and SCADA security_\n\n[www.cpni.gov.uk/Docs/Overview_of_Process_Control_and_SCADA_Security.pdf](http://www.cpni.gov.uk/Docs/Overview_of_Process_Control_and_SCADA_Security.pdf)\n\n- **Security and SQL Attacks**\n\n_Attack methodology analysis: SQL injection attacks (Abstract)_\n[csrp.inl.gov/Documents/SQL%20Abstract.pdf](http://csrp.inl.gov/Documents/SQL%20Abstract.pdf)\n\n- **Security and OPC/DCOM**\n\n_Understanding OPC and how it is deployed_\n[csrp.inl.gov/Documents/OPC%20Security%20WP1.pdf, Web site last accessed September](http://csrp.inl.gov/Documents/OPC%20Security%20WP1.pdf)\n2009.\n\n_Hardening guidelines for OPC hosts_ csrp.inl.gov/Documents/OPC%20Security%20WP3.pdf,\n\n_Security implications of OPC, OLE, DCOM and RPC in control systems (Abstract)_\n[csrp.inl.gov/Documents/OPC%20Abstract.pdf,](http://csrp.inl.gov/Documents/OPC%20Abstract.pdf)\n\n_Using operational security (OPSEC) to support a cyber security culture in control systems_\n_environments_\n[csrp.inl.gov/Documents/OpSec%20Rec%20Practice.pdf,](http://csrp.inl.gov/Documents/OpSec%20Rec%20Practice.pdf)\n\n\n-----\n\n_[Creating cyber forensics plans for control systems csrp.inl.gov/Documents/Forensics_RP.pdf,](http://csrp.inl.gov/Documents/Forensics_RP.pdf)_\n\n_Patch management for control systems_\ncsrp.inl.gov/Documents/PatchManagementRecommendedPractice_Final.pdf\n\n- **Modems**\n\n_Securing control system modems_\n[csrp.inl.gov/Documents/SecuringModems.pdf,](http://csrp.inl.gov/Documents/SecuringModems.pdf)\n\n_CPNI good practice guide on firewall deployment for SCADA and process control networks_\n[www.cpni.gov.uk/docs/re-20050223-00157.pdf, Backdoors and Holes in Network Perimeters: a](http://www.cpni.gov.uk/docs/re-20050223-00157.pdf)\n_case study for improving your control system security_\n[www.us-cert.gov/control_systems/pdf/backdoors_holes0805.pdf](http://ics-cert.us-cert.gov/pdf/backdoors_holes0805.pdf)\n\n_[NIST firewall guide and policy recommendations csrc.nist.gov/publications/nistpubs/800-](http://csrc.nist.gov/publications/nistpubs/800-41/sp800-41.pdf)_\n[41/sp800-41.pdf](http://csrc.nist.gov/publications/nistpubs/800-41/sp800-41.pdf)\n\n- **Wireless**\n\n_Guide for securing ZigBee wireless networks in process control system environments_\n[csrp.inl.gov/Documents/Securing%20ZigBee%20Wireless%20Networks%20in%20Process%20](http://csrp.inl.gov/Documents/Securing%20ZigBee%20Wireless%20Networks%20in%20Process%20Control%20System%20Environments.pdf)\n[Control%20System%20Environments.pdf,](http://csrp.inl.gov/Documents/Securing%20ZigBee%20Wireless%20Networks%20in%20Process%20Control%20System%20Environments.pdf)\n\n_Securing wireless VLANs with 802.11_\n[csrp.inl.gov/Documents/Wireless%20802.11i%20Rec%20Practice.pdf,](http://csrp.inl.gov/Documents/Wireless%20802.11i%20Rec%20Practice.pdf)\n\n- **Cyber Security Standards**\n\n_[A comparison of oil and gas segment cyber security standards](http://ics-cert.us-cert.gov/pdf/oil_gas1104.pdf)_\n[www.us-cert.gov/control_systems/pdf/oil_gas1104.pdf,](http://ics-cert.us-cert.gov/pdf/oil_gas1104.pdf)\n\n_A comparison of electrical sector cyber security standards and guidelines_\n[www.us-cert.gov/control systems/pdf/electrical comp1004.pdf,](http://www.us-cert.gov/control%20systems/pdf/electrical%20comp1004.pdf)\n\n- **NSA Defence-in-Depth**\n\n_NSA Defence-in-depth_\n[www.nsa.gov/ia/ files/support/defenceindepth.pdf](http://www.nsa.gov/ia/%20files/support/defenceindepth.pdf)\n\n- **Intruder Detection**\n\n_Intruder detection checklist_\n[www.us-cert.gov/reading_room/intruder _det _check.html](http://www.us-cert.gov/reading_room/intruder%20_det%20_check.html)\n\n- **Personnel Security Guidelines**\n\n_[Personnel security guidelines](http://ics-cert.us-cert.gov/pdf/personnel_guide0904.pdf)_\n[www.us-cert.gov/control_systems/pdf/personnel_guide0904.pdf](http://ics-cert.us-cert.gov/pdf/personnel_guide0904.pdf)\n\n\n-----\n\n_[Risk assessment for personnel security guidelines](http://ics-cert.us-cert.gov/pdf/personnel_guide0904.pdf)_\n[www.cpni.gov.uk/Docs/Risk_Assessment_Pers_Sec_Ed_2.pdf](http://www.cpni.gov.uk/Docs/Risk_Assessment_Pers_Sec_Ed_2.pdf)\n\n_[Personnel security – threats, challenges and measures](http://ics-cert.us-cert.gov/pdf/personnel_guide0904.pdf)_\n[www.cpni.gov.uk/Docs/Per_Sec_TCM_v2.pdf](http://www.cpni.gov.uk/Docs/Per_Sec_TCM_v2.pdf)\n\n\n-----\n\n###### References\n\n1. Guide to Enterprise Telework and Remote Access Security, NIST, Special Publication 800-46,\n[Rev.1, csrc.nist.gov/publications/nistpubs/800-46-rev1/sp800-46r1.pdf, Web last accessed](http://csrc.nist.gov/publications/nistpubs/800-46-rev1/sp800-46r1.pdf)\nDecember 7, 2009.\n\n2. Williams, TJ, Purdue Model for Control Hierarchy, ISBN 1-55617-265-6, 1992.\n\n[3. DHS, Securing Control System Modems csrp.inl.gov/Documents/SecuringModems.pdf,](http://csrp.inl.gov/Documents/SecuringModems.pdf)\nJanuary 2008, Web last accessed December 10, 2009.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://us-cert.cisa.gov/sites/default/files/recommended_practices/RP_Managing_Remote_Access_S508NC.pdf"
    ],
    "report_names": [
        "RP_Managing_Remote_Access_S508NC.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1493729711,
    "ts_modification_date": 1493731101,
    "files": {
        "pdf": "https://archive.orkl.eu/37038ce5c99a65d72834f36ebad9316b52386779.pdf",
        "text": "https://archive.orkl.eu/37038ce5c99a65d72834f36ebad9316b52386779.txt",
        "img": "https://archive.orkl.eu/37038ce5c99a65d72834f36ebad9316b52386779.jpg"
    }
}