{
    "id": "eb17e38a-f439-4c22-be42-c6b086f20dd5",
    "created_at": "2023-03-03T02:07:11.486743Z",
    "updated_at": "2025-03-27T02:05:42.41244Z",
    "deleted_at": null,
    "sha1_hash": "239ac03c3e0150d24c584cbb08e6c7305e7afa74",
    "title": "2023-02-13 - Mylobot- Investigating a proxy botnet",
    "authors": "",
    "file_creation_date": "2023-03-01T09:16:05Z",
    "file_modification_date": "2023-03-01T09:16:05Z",
    "file_size": 1816110,
    "plain_text": "# Mylobot: Investigating a proxy botnet\n\n**bitsight.com/blog/mylobot-investigating-proxy-botnet**\n\nWritten by Stanislas Arnoud\nFebruary 13, 2023\nShare\nFacebook\nTwitter\nLinkedIn\n\n[BitSight Security Research](https://www.bitsight.com/blogs?field_topics_target_id=496)\n\nMylobot is a malware that targets Windows systems, it first appeared in 2017 and until now\nhasn’t received much attention over the years. In this article, we'll focus on its main\ncapability, which is transforming the infected system into a proxy. We'll also see how it's\ndistributed and the capabilities of its downloader. We'll try to make a connection between\nMylobot and BHProxies (a residential proxy service), and finally we'll present the telemetry\nwe were able to collect since we started tracking it in 2018.\n\n## Noisy Mylobot (2017 - 2021)\n\nThe first Mylobot sample we found has a size of 106496 bytes and a compilation timestamp\nof October 20, 2017. At that time, the malware had three different stages, with the third stage\nbeing the actual Mylobot proxy bot payload and the one responsible for performing the\nnetwork communications.\n\nBefore going into details, Figure 1 details the execution of Mylobot's samples.\n\n\n-----\n\nFigure 1 - Execution of Mylobot's samples\n\n### First stage - WillExec dropper\n\nThe first stage embeds an encrypted resource and performs some anti-debug checks using\nwindows API CreateTimerQueueTimer and SetUnhandledExceptionFilter that are well[described on Minerva blog post from 2022. After those checks, the sample fetches from its](https://minerva-labs.com/blog/mylobot-2022-so-many-evasive-techniques-just-to-send-extortion-emails/)\nresource a very long base64 encoded string and decodes it. The resulting buffer has the\nfollowing structure:\n\n\n-----\n\nstruct decoded_res\n{\nuint32_t sz_next_stage;\n\nuint32_t sz_shellcode;\n\nchar rc4_key[5];\n\nchar padding[19];\n\nchar encrypted_blob[sz_shellcode + sz_next_stage];\n\n}\n\nIn all samples we found, sz_shellcode was equal to 0x820. The function that decodes and\ndecrypts the resource (figure 2a) and ends with the instructions listed in figure 2b, resulting in\nthe execution of the decoded shellcode.\n\nFigure 2a - Decryption code\n\nFigure 2b - Epilogue of the decrypting function\nThe shellcode is short and straightforward and has the purpose of running the decrypted PE\nfile following it in the decrypted blob. The shellcode creates a new process and does a\nprocess hollowing on it, in order to run the decrypted PE. The concept of process hollowing\nis the way of replacing an executable image at runtime with another executable. All the\nhollowing procedure is detailed in figure 3.\n\n\n-----\n\nFigure 3 - Process hollowing\nOne noticeable thing is that this stage is executing multiple times the following API call\n\nMessageBoxA(0xffffa481, \"Will exec\", 0, 0);\n\nThis call is failing because of the unknown HWND value 0xffffa481. We'll refer to this dropper\nas WillExec in the rest of this document.\n\n### Second stage\n\nThe second stage is quite straightforward as well. It contains 2 resources:\n\nan encrypted resource, this time unencoded (with resource ID equal to 101)\nA very small 4 bytes resource (with resource ID equal to 102)\n\n\n-----\n\nThe 4 bytes resource is a RC4 key that is used by the program to decrypt resource 101. The\ndecrypted resource is a PE file.\n\nOnce the program has mapped the decrypted PE file in memory, it locates one of its\n[exported functions named [email protected], and executes it.](https://www.bitsight.com/cdn-cgi/l/email-protection)\n\nOne interesting thing to notice in this stage is the comparison of the command line argument\nwith the string wusaupdate:\n\nFigure 4 - Command line check\nIf it matches, the program disables Windefender (Figure 5) and adds a firewall rule that\nblocks all outgoing TCP connections trying to connect to the following ports:\n\n2900\n1100\n2200\n3300\n4400\n5500\n6600\n7700\n8800\n9900\n\nThe function responsible for disabling Windefender executes a series of shell commands and\nchanges the registry:\n\n\n-----\n\nFigure 5 - Function disabling windefender\n\n### Third stage\n\nThe third stage is the most interesting one as it's the one turning the infected computer into a\nproxy. Before starting its communication with the remote command and control server, the\nthird stage writes itself on disk, then runs cmd.exe with the attribute\nPROCESSINFORMATION.wShowWindow equal to 0 (the program's window won't appear to\nthe user)\n\nThen, it will inject itself into the newly created process using the APIs WriteProcessMemory\nand CreateRemoteThread. More specifically, the program injects:\n\nitself as a raw file\nan array containing functions pointer to useful ntdll.dll and kernel32.dll apis\na small binary blob that can be seen as a Portable Executable manual mapper.\n\nOnce the manual mapper has mapped the raw file in memory, the original process will run\n[the exported function [email protected] in the newly created process, then terminate itself.](https://www.bitsight.com/cdn-cgi/l/email-protection)\n\nThe binary will achieve persistence by writing itself to the following registry key:\n\nSoftware\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\n\n\n-----\n\nThe value stored in this registry key is the path on disk of the second stage.\n\nThe malware will remove potential other malware presence by changing the filename of\nexecutable files in multiple directories. It checks for the presence of files ending with .exe in:\n\n%APPDATA%\n%APPDATA%\\WindowsAudio\n%APPDATA%\\Windows Live\n%APPDATA%\\Update\n%APPDATA%\\Adobe\n%APPDATA%\\WindowsUpdate\n%APPDATA%\\Identities\n%APPDATA%\\Microsoft\n%APPDATA%\\Microsoft\\Windows\n%APPDATA%\\Microsoft\\Windows\\Themes\n\nIf an executable file is found, it will replace the .exe extension with .local.backup.Moreover,\nthe binary will create a new process of its second stage with the command line argument\nwusaupdate to disable Windows defender and create the firewall rules detailed above.\n\nFinally the binary will store an encoded FILETIME on the filesystem in %TEMP%\\dd.te if the\nfile does not exist. The malware will start communicating with the command and control\nserver only if 12 days have passed since the date written down in this file.\n\n### Communication protocol\n\nThe first version of Mylobot had a very unique network fingerprint. The sample usually\nembeds more than 1000 hard-coded domains, mostly ending with top level domain (TLD) .ru\nor .com. All domains look like they have been generated by some sort of domain generation\nalgorithm (DGA). An overview of some of the hardcoded domains:\n\nzdrussle.ru:2173\npseyumd.ru:5492\nstydodo.ru:2619\ntqzknrx.com:1123\nmdcqrxw.com:4984\ntpwtgyw.com:9631\ncnoyucn.com:9426\nqhloury.com:4759\nfnjxpwy.com:3863\ncsxpzlz.com:5778\nwlkjopy.com:8778\nmynfwwk.com:8427\nuuitwxg com:6656\n\n\n-----\n\nagnxomu.com:8881\nwcagsib.com:3547\nfmniltb.com:9582\noapwxiu.com:3922\n\nFor each of these domains, the sample tries to connect to many of its subdomains. Most\nsubdomains will start with the letter x, w, or m, followed by a number. In this sample, the first\nhardcoded domain is fywkuzp[.]ru:7432, and we could observe a infected machine trying to\nconnect to the following domains:\n\nm1.fywkuzp[.]ru:7432\nm2.fywkuzp[.]ru:7432\n…\nm42.fywkuzp[.]ru:7432\n\nIn the end, Mylobot produces thousands of DNS requests, which makes it quite noisy. If the\nsample successfully connects to one of those domains, it keeps the connection open and\nwaits for an instruction from the command and control server (C2).\n\nWhen Mylobot receives an instruction from the C2, it transforms the infected computer into a\nproxy. The infected machine will be able to handle many connections and relay traffic sent\nthrough the command and control server.\n\nHere's a list of the different instructions supported by Mylobot:\n\n\n**Message ID**\n**(msg_id)**\n\n\n**Description**\n\n\n1 Connect to an IP:port\n\n2 Close connection (specified by its ID (data[0:4])\n\n3 Send data to a connected IP/domain:port (specified by its ID\n(data[0:4])\n\n4 Restart the client networking stuff\n\n5 End all active connections\n\n6 Echo\n\n\n-----\n\n7 Download a binary using HTTP\n\n8 Download multiple binaries using HTTP + delay (8 hours)\n\n17 Connect to an domain:port\n\n19 Force re-read from socket (specified by its ID)\n\nA typical message exchanged between the C2 and the client has the following structure:\n\nstruct msg\n\n{\nuint32_t conn_id;\n\nuint8_t msg_id;\n\nchar* msg_data;\n\n}\n\nThe figure below shows an example of a C2 instruction telling the infected machine to\nconnect to google.com on port 443.\n\nFigure 5a - A message from the command and control\n[It has been reported by Lumen that, at that time, infected computers were receiving samples](https://blog.lumen.com/mylobot-continues-global-infections/)\nof Khalesi or Zusy malwares using the msg_id 7 and 8. We only observed self binary\nupdates through those commands, as well as new versions of its downloader (see section\nbelow).\n\nSince the samples we found contain many hardcoded domain names, we started to monitor\nthem to get infection telemetry and get an idea about the botnet size.\n\n\n-----\n\nIn the end, Mylobot is nothing more than a proxy bot, with some ability to download and run\nother samples. The sample that is implementing the proxy functionality will be referred to as\n\"Mylobot's proxy bot\" in the rest of this post.\n\n## A new downloader (2018 - )\n\nIn 2018, we started seeing Mylobot's proxy bot being distributed by a new malware sample.\n\nThis new binary presents a lot of similarities with Mylobot, but the last stage acts as a\ndownloader. Let's begin by exposing the similarities between this new sample and Mylobot's\nproxy bot sample, and describe how it is downloading Mylobot on an infected system.\n\nThe first thing to note is that the new sample uses WillExec, the same dropper used for\nMylobot samples. The dropped file performs anti virtual machine checks, and tries to remove\nother malware running on the system as well, after that, it connects to its command and\n[control, and downloads the next stages. This sample has been well described by Minerva, so](https://minerva-labs.com/blog/mylobot-2022-so-many-evasive-techniques-just-to-send-extortion-emails/)\nwe won't go into too much detail.\n\nThe downloader has a huge list of hard-coded encrypted command and control domains\n(more than 1000).\n\nFigure 6 - Hardcoded encrypted domain names\nThose domains are AES-ECB encrypted with the key\nGD!brWJJBeTgTGSgEFB/quRcfCkBHWgl, and have probably been generated using the\nsame DGA mentioned in the first part of this post. Indeed, there's a strong similarity between\nMylobot downloader's domain names and Mylobot proxy's ones.\n\n\n-----\n\nFigure 7 - Decryption of domain names\nThe downloader decrypts the domains at runtime, and tries to connect to the subdomain\nbuy1, v1 or up1 (depending on the sample) of those domains. In the end, it tries to connect\nto the following domains:\n\nv1.flkpuod[.]ru:5796\nv1.iqaagar[.]ru:2919\nv1.fchbwme[.]ru:7533\n…\n\nThe command and control server responds with an AES encrypted message that, when\ndecrypted, contains a link to download the next stage.\n\nFigure 8 - Decryption of the response from the command and control\nOnce again, as the sample we found contains many hardcoded domain names, we started to\nmonitor some of them to get an overview of the botnet.\n\nThe downloaded payload is a Mylobot sample, embedded in a WillExec dropper, the same\nway it was distributed in 2017. We've seen Mylobot's downloader distributing other samples\n[than Mylobot's proxy bot (Minerva is showing an example), but it was quite rare.](https://minerva-labs.com/blog/mylobot-2022-so-many-evasive-techniques-just-to-send-extortion-emails/)\n\n\n-----\n\nThe distribution has evolved in the way described in figure 9.\n\n\n-----\n\nFigure 9 - Execution of the downloader sample downloading Mylobot\nRegarding the Mylobot sample that is downloaded, it hasn't evolved much over the years.\nThe only major change is the number of command and control domains hardcoded in the\nbinary, that evolved from ~1000 in the first versions, to only 3 since the beginning of 2022:\n\nfywkuzp[.]ru:7432\ndealpatu[.]ru:8737\nrooftop7[.]ru:8848\n\n## Black Hat Proxies\n\nWe decided to have an overview of Mylobot's infrastructure. We started by looking at the 3\ndomain names used in the last version of the proxy. Starting with the domain fywkuzp[.]ru,\nwe looked at the IP addresses that were pointed by the subdomains from m0.fywkuzp[.]ru to\nm42.fywkuzp[.]ru. We were able to identify 25 IP addresses that were used between 2017\nand 2022, all associated with cloud providers from Netherlands (worldstream.nl), Lithuania\n(cherryservers.com) and Latvia (bite.lv).\n\nWe looked for other domain names pointing to those IP addresses. Unsurprisingly, we found\nother fywkuzp[.]ru subdomains that were using other prefixes (w5.fywkuzp[.]ru,\nx6.fywkuzp[.]ru,...), and other Mylobot domains (pseyumd[.]ru, stydodo[.]ru, zdrussle[.]ru) as\nwell.\n\nOne domain caught our attention in our research because of its name:\nclients.bhproxies[.]com. From June 22, 2016 to September 17, 2017, this domain resolved to\nthe IP address 46.166.173.180. The next day (September 18th 2017),\nclients.bhproxies[.]com started to resolve to 109.236.80.135, and up1.pseyumd[.]ru (which is\na domain used by Mylobot) started to resolve to 46.166.173.180. During the following\nmonths many Mylobot domains will resolve to this IP address\n\n\n-----\n\nFigure 10 - History of reverse DNS lookup for the ip 46.166.173.180\nThe website bhproxies[.]com is pretty explicit: it provides a service of \"Backconnect\nresidential proxies'', with IP addresses from all over the world. They mention that they could\nprovide custom packages to clients, with up to 150,000 unique IP addresses.\n\n\n-----\n\nFigure 11 - BHProxies website\n[When looking for BHProxies on search engines, a post from BlackHatWorld forum shows up.](https://www.blackhatworld.com/seo/bhproxies-com-50-million-residential-backconnect-proxies-unlimited-bandwidth.673490/)\nThis post was written on May 12, 2014. The post author using the alias BHProxies, is still\nvery active on this post, as his last messages were posted in December 2022. The author\n\n\n-----\n\npromotes bhproxies[.]com, and provides a Telegram channel and a Skype account to discuss\nwith the potential customers. He also provides a free trial to convince users to buy his\n[service. The free trial is available at the address http://clients.bhproxies.com/panel/trial.php](http://clients.bhproxies.com/panel/trial.php)\n\nAt this point, we cannot prove that BHProxies is linked to Mylobot, but we have a strong\nsuspicion, since Mylobot and BHProxies used the exact same IP 46.166.173.180 on an\ninterval of 24 hours.\n\nTo confirm our hypothesis, we tested the trial version of BHProxies. Once you enter your\npublic IP address on the service, you receive an IP address and a list of ports to connect to.\n\nFigure 12 - BHProxies free trial\n\n\n-----\n\nFigure 13 - BHProxies trial proxies\nEach of those pairs of IP and port is a frontend for the residential proxies of BHProxies. We\nrecovered the residential proxies IP addresses by performing an HTTP request to a server\nwe control.\n\nOn the 50 frontend proxies provided, we were able to perform a HTTP request for 48 of\nthose. Among these 48 recovered residential proxies IP addresses, 28 (58.3%) of those\nwere already present in our sinkhole systems, associated with the Mylobot malware family.\nThis number is probably higher, but we don't have a full visibility of the botnet. This gave us\nclear evidence that Mylobot infected computers are used by the BHProxies service.\n\nThe trial proxies list is another indicator of the strong ties between BHProxies and Mylobot,\nsince m41.fywkuzp[.]ru, one of Mylobot proxy C2, resolves to IP 89.39.107[.]82:\n\n\n-----\n\n## Telemetry\n\nWe started sinkholing Mylobot in November 2018. At that time, Mylobot's proxy sample\ncontained a lot of hardcoded DGA domains, so we were able to observe the majority of the\nbotnet. It had led us to a maximum of 250,000 unique daily infected machines in the\nbeginning of 2020.\n\nSince the beginning of 2022, we're not able to get infection telemetry from the latest Mylobot\nversion as the sample doesn't contain unregistered DGA domains anymore. Instead, we\nstarted monitoring Mylobot downloader's domains and continue to see the evolution of\nMylobot's botnet.\n\nWe are currently seeing more than 50,000 unique infected systems every day, but we believe\nwe are only seeing part of the full botnet, which may lead to more than 150,000 infected\ncomputers as advertised by BHProxies’ operators.\n\nFigure 14 - Unique mylobot's infected system per day\nFigure 15 shows the countries where the most computers infected with Mylobot are found.\nIndia appears to be the most targeted country, followed by the US, Indonesia, then Iran.\n\n\n-----\n\nFigure 15 - Heat map of infected computers\n\n## IOCs\n\n### Mylobot proxy\n\n84733af3b60b966042d5cd17e12fd8d90650e0731297d203bd913dc5c663b91c\n\n11fc02dd825c8e67d58cc40a47e3f4c572097bd58c6aae80591a5fb73b9167f2\n\n392f1054815c5f805d50b60ea261210012bdda386158a1da92d992a929eb77c2\n\n03b2164da6318fff63b6cad2fc613c3d885bd65432a7b8744c2b1709f2f9a479\n\n69a36e6f12b4e9b9cd15528a068385f2311b0c540336c142aabdd73c2a2e2015\n\na63a5639d0cb6a10f7af5bd0dd30ca1800958a0f5bb47f358b6d37f51d0f0a31\n\n2ae61c8c2a8e83cde33f38b89599032a6fb455256aa414a15f2724c94d3460d2\n\n40cfb7b7fad1602276ebf3fa63514ba91be6186d5d3bd190f593bdec0b6d8d64\n\n### Mylobot downloader\n\ncfde42903367d77ab7d5f7c2a8cfc1780872d6f1bfac42e9c2577dfd4b6cdeb2\n\nfcdb7247aa6e41ff23dc1747517a3682e5a89b41bfd0f37666d496a1d3faa4ba\n\nad53ad1d3e4ac4cc762f596af8855fd368331d9da78f35d738ae026dd778eb9f\n\n### Mylobot proxy C2 IPs\n\n89.39.105.47\n\n89.38.96.140\n\n89.38.96.14\n\n\n-----\n\n217.23.12.80\n178.132.3.12\n\n168.119.15.229\n\n89.38.98.48\n\n49.12.128.181\n\n37.48.112.111\n\n109.236.82.28\n\n49.12.128.180\n\n144.76.8.93\n\n194.88.106.18\n\n95.211.203.197\n\n89.39.104.201\n\n95.168.169.43\n\n95.211.198.102\n\n91.229.23.112\n\n217.23.13.104\n\n95.211.140.149\n\n62.112.11.245\n\n178.132.2.82\n\n116.202.114.236\n\n217.23.12.50\n\n89.39.104.58\n\n89.38.98.47\n\n194.88.105.108\n\n109.236.83.166\n\n109.236.91.239\n\n89.39.107.92\n\n190.2.134.165\n\n217.23.8.12\n\n89.39.104.62\n\n89.39.107.82\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-13 - Mylobot- Investigating a proxy botnet.pdf"
    ],
    "report_names": [
        "2023-02-13 - Mylobot- Investigating a proxy botnet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1677809231,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1677662165,
    "ts_modification_date": 1677662165,
    "files": {
        "pdf": "https://archive.orkl.eu/239ac03c3e0150d24c584cbb08e6c7305e7afa74.pdf",
        "text": "https://archive.orkl.eu/239ac03c3e0150d24c584cbb08e6c7305e7afa74.txt",
        "img": "https://archive.orkl.eu/239ac03c3e0150d24c584cbb08e6c7305e7afa74.jpg"
    }
}