{
    "id": "eb2e8613-be3d-4505-9eeb-a9fc5d0581bc",
    "created_at": "2023-01-12T15:08:37.995382Z",
    "updated_at": "2025-03-27T02:16:34.780697Z",
    "deleted_at": null,
    "sha1_hash": "d233a137747f561820b3364497eb9fcc92f8721b",
    "title": "2020-12-29 - Golden SAML Revisited- The Solorigate Connection",
    "authors": "",
    "file_creation_date": "2022-05-28T18:02:02Z",
    "file_modification_date": "2022-05-28T18:02:02Z",
    "file_size": 296749,
    "plain_text": "# Golden SAML Revisited: The Solorigate Connection\n\n**[cyberark.com/resources/threat-research-blog/golden-saml-revisited-the-solorigate-connection](https://www.cyberark.com/resources/threat-research-blog/golden-saml-revisited-the-solorigate-connection)**\n\nDecember 29, 2020\n\nIn the past few weeks, we’ve been witnessing one of the most elaborate supply-chain attacks unfold with a threat actor that\ninfected SolarWinds Orion source code and used the update process to get to around 18,000 victims all around the globe. One of\nthe most (if not the most) innovative techniques used in this attack, now known as Solorigate, is the “Golden SAML” technique.\nThe threat actor (UNC2452) did a phenomenal job across all stages of the attack — from meticulously planting the backdoor code\nand making it look like yet another legitimate class, to avoiding almost every possible forensics/analysis tool you can name, and\neven hiding data in DNS queries and making all the traffic look as if it’s part of the SolarWinds Orion communication protocol.\nThere’s no doubt the threat actor knew what they were doing and tried to do everything in the best way possible. Still, we believe\nthat performing a Golden SAML attack is the most innovative part of the attack (as of writing this post), having it be the first-ever\n[documentation of such an attack. We (CyberArk Labs) did describe this attack vector at the end of 2017, but this is the first time](https://www.cyberark.com/resources/threat-research-blog/golden-saml-newly-discovered-attack-technique-forges-authentication-to-cloud-apps)\nwe’ve seen it used in the wild. Golden SAML is an attack vector that can serve sophisticated attackers in their post-exploitation\nstages allowing them to maintain persistency and gain access to different services in a convenient and stealthy manner.\n\nIn this blog post, we’ll first have a quick refresh on the basics of Golden SAML. Then we’ll try to illustrate why it can be so powerful\nin the hands of attackers and how it fits the UNC2452 threat actor’s perceived modus operandi like a glove. Finally, we’ll share a\nfew mitigation tactics that can be used by defenders to mitigate this risk.\n\n## Golden SAML Recap\n\nGolden SAML is a technique that allows attackers, once they got privileged access to the victim’s network, to impersonate almost\nany identity in the organization and acquire any type of privilege across almost all services of the organization (this depends on\nwhat services in the organization use SAML as their authentication protocol). You may already be familiar with a similar technique\ncalled – Golden Ticket. Golden SAML introduces to a federation environment the same advantages that golden ticket offers in a\nKerberos environment. It simply applies the same principle in a different environment. If you would like to get into the details of this\n[attack vector, you can find the full details on our blog.](https://www.cyberark.com/resources/threat-research-blog/golden-saml-newly-discovered-attack-technique-forges-authentication-to-cloud-apps)\n\n## Why Do Attackers Want to Use Golden SAML?\n\nIn this section we’ll list a few of the powerful advantages this attack vector can offer for attackers\n\n\n-----\n\n**Flexibility Golden SAML provides a lot of flexibility for attackers, in the sense that they can impersonate any identity they wish**\nin the federation. It is beneficial for two main reasons:\n\n1. Attackers capable of performing a Golden SAML attack can basically get access to every service or asset in the organization\n\n(as long as it’s a part of the federation of course). This means that they are not limited to the credentials/access they were\nlucky enough to stumble upon – they can practically gain access to anything they want.\n2. Being able to do that gives attackers more than just access. In the majority of the cases, sophisticated attackers go to great\n\nlengths in trying to hide their activity and avoid detection. Imagine you’re an attacker and that you have gained the ability to\nperform a Golden SAML attack in your target’s network, which is monitored heavily. Whatever action you choose to perform\nnext, you can do that using the identity of a user that is “known” to take this action from time to time, thus diminishing the\nchances of looking like a suspicious action, and ultimately getting detected and ruining the whole operation. Simply put, you\nare blending malicious actions with normal, legitimate activities. The attackers behind SolarWinds did just that, we can see it\nin the code they’ve planted, the communication protocol they used, and in their usage of legitimate configuration files for the\nbackdoor’s needs. It is very likely that it was this flexibility and the ability to blend in which were the factors that “sold”\nUNC2452 on the idea to use the Golden SAML vector.\n\n**MFA (Multi-Factor Authentication) Bypass – The usage of this technique can potentially make the additional security layer MFA**\n**provides completely useless. Since users get a valid SAML token after they’ve authenticated using MFA, attackers that are**\nusing Golden SAML don’t need to go through that stage at all. The attackers basically skip it altogether and go straight to forging\nan identity using the stolen certificate, without having to know the user’s password or to have other authentication factors. This is a\nvery substantial ability, and it shows that the sense of security MFA provides, might just be a false one in some cases.\n\nThe ability to bypass MFA depends on the specific implementation of MFA an organization might have. MFA bypass can only be\napplied if the integration is on the identity provider side. If the integration is on the service provider side, then multi factor\nauthentication happens only after the SAML token has been generated, thus making Golden SAML ineffective in bypassing it.\nHaving said that, we need to remember that times organizations often use federated service for the sake of convenience in the\nform of SSO, and this could have the potential of damaging the overall security of the organization, as we see in the Golden SAML\ncase.\n\n**Difficulty to Detect – Detection of such an attack can be extremely challenging for defenders. Even though there are methods**\nthat can potentially detect such malicious behavior (which we’ll elaborate on in the next section), many organizations are not\naware of this type of threat and do not monitor SAML authentication (especially not in the pre-Solorigate era).\n\n**Difficulty to Remediate – If an attacker steals your password, it’s relatively easy to change this password and take back control**\nof your identity. But if an attacker steals your SAML token signing certificate, it’s a whole different ballgame. First, if you’ll naively\ntry to change your passwords, the attacker can easily continue to make SAML tokens that impersonate you, without the need to\nknow the actual password (same case as being able to bypass MFA). So, what you really need to do is to change the actual token\nsigning certificate. Which basically means reestablishing the trust across your entire federation.\n\n**Long-Term Persistency – Let’s compare this to passwords again. Passwords are being changed every set period of time (a few**\nweeks if your organization has proper credential management), but a SAML token signing certificate is almost never changed, or.\nThis allows attackers to potentially maintain their access for a long period of time.\n\n## Golden SAML Detection and Mitigation\n\nFollow best practices of your federation Identity Provider (IdP) technology. [Here are, for example, the AD FS (Active](https://docs.microsoft.com/en-us/windows-server/identity/ad-fs/deployment/best-practices-securing-ad-fs)\nDirectory Federation Services by Microsoft) best practices. Some IdP support protecting your token signing certificate in a\nhardware security module (HSM). This should make stealing your token signing certificate a much harder task for attackers.\nDo as much as you can to protect your tier-0 assets (a federation identity provider should be included here). This includes\nhaving proper credential hygiene, deploying a privileged access management solution, an EDR, etc. This will make it very\ndifficult for attackers to gain sufficient privileges for stealing a token signing certificate in the first place.\nExamine SAML tokens to identify suspicious ones (such as tokens with an unusually long lifetime or with unusual claims).\nCorrelate logs between your Identity Provider and your Service Provider. If you see a SAML authentication in your Service\nProvider that doesn’t correlate to a SAML token issuance by the Identity Provider – something is wrong.\nUse third-party security solutions to protect the token signing certificate from being stolen by attackers. CyberArk Endpoint\nPrivilege Manager (EPM) has the ability to do just that.\n\n[For more information on detection and mitigation please see this document by the NSA and this advisory by Sygnia.](https://media.defense.gov/2020/Dec/17/2002554125/-1/-1/0/AUTHENTICATION_MECHANISMS_CSA_U_OO_198854_20.PDF)\n\n## Conclusion\n\n\n-----\n\nAt the time of writing this post, we re still learning new things on Solorigate with every day that passes. This attack has been an\nimportant lesson for everyone in the information security field, whether you were impacted directly or not.\n\nAs for Golden SAML, we do expect to see this tactic become more commonly used for two reasons:\n\nWith more and more services being ported to the cloud, there is a greater need to establish some level of trust between\nthem and between on-premise services – and SAML has become the de facto authentication and authorization standard.\n**Attackers operating in those types of environments will have to adapt their methods to fit the new norm. For**\n**instance, instead of settling on getting the domain’s KRBTGT and forging any identity within that domain, attackers**\n**can now steal the SAML token signing certificate and forge almost any identity across the entire organization.**\nSeeing Golden SAML being used in one of the most sophisticated and elaborate cyber-attacks we have seen in recent years\n(and we are still not aware of the full impact of it), potential future attackers will come to know this tactic and possibly use it\nas well in the future.\n\nWe need to find joy in the rare cases in which defenders beat attackers at their own game and anticipate attack vectors before\nthey’re being used in the wild by malicious threat actors. This timeframe between the discovery of a new attack vector and its use\nby attackers should be utilized by defenders to prepare their network for such an attack as best as they can – setting up\nmonitoring rules to detect this and deploying protection mechanisms that should block it. Golden SAML is a great example of such\nan opportunity, and we hope that as a security community we can learn from that and do better in the future.\n\n## References\n\nhttps://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/\nhttps://media.defense.gov/2020/Dec/17/2002554125/-1/-1/0/AUTHENTICATION_MECHANISMS_CSA_U_OO_198854_20.PDF\nhttps://www.cyberark.com/resources/threat-research-blog/golden-saml-newly-discovered-attack-technique-forgesauthentication-to-cloud-apps\nhttps://www.sygnia.co/golden-saml-advisory\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-29 - Golden SAML Revisited- The Solorigate Connection.pdf"
    ],
    "report_names": [
        "2020-12-29 - Golden SAML Revisited- The Solorigate Connection.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536117,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653760922,
    "ts_modification_date": 1653760922,
    "files": {
        "pdf": "https://archive.orkl.eu/d233a137747f561820b3364497eb9fcc92f8721b.pdf",
        "text": "https://archive.orkl.eu/d233a137747f561820b3364497eb9fcc92f8721b.txt",
        "img": "https://archive.orkl.eu/d233a137747f561820b3364497eb9fcc92f8721b.jpg"
    }
}