{
    "id": "eb2ef0d8-443b-4bcd-8e1f-c734ba80ef58",
    "created_at": "2022-10-25T16:48:11.546195Z",
    "updated_at": "2025-03-27T02:16:53.086302Z",
    "deleted_at": null,
    "sha1_hash": "23f1f9e5771be71725fa19487da59f6779f5ee3f",
    "title": "The Lurid Downloader",
    "authors": "Trend Micro",
    "file_creation_date": "2011-09-23T16:49:42Z",
    "file_modification_date": "2011-09-23T13:05:31Z",
    "file_size": 1115524,
    "plain_text": "|Col1|Col2|\n|---|---|\n\n|T|Col2|\n|---|---|\n|||\n\n|DO|W|\n|---|---|\n\n|LOA|D|\n|---|---|\n\n\n# THE “LURID” DOWNLOADER\n\n#### TrendLabs™\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### CONTENTS\n\n##### ABSTRACT .....................................................................................................3\n\n INTRODUCTION ............................................................................................4\n\n ATTACK VECTOR...........................................................................................6\n\n MALWARE ......................................................................................................6\n\n COMMUNICATION WITH THE COMMAND AND CONTROL SERVER ..........8\n\n COMMANDS ...................................................................................................8\n\n TOOL MARKS ...............................................................................................10\n\n COMMAND AND CONTROL INFRASTRUCTURE .......................................10\n\n COMPROMISED ORGANIZATIONS .............................................................12\n\n MALWARE CAMPAIGNS ..............................................................................13\n\n NOTEWORTHY COMPROMISED ORGANIZATIONS ..................................14\n\n DATA EX-FILTRATION ..................................................................................15\n\n ATTRIBUTION ..............................................................................................16\n\n CONCLUSION ..............................................................................................16\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### ABSTRACT\n\nThis report investigates a campaign of targeted malware attacks that has successfully\ncompromised 1465 computers in 61 different countries. Based on the project path\nembedded in the malware, we have named this specifi c campaign “Lurid Downloader”\nalthough the malware is typically known as “Enfal”. The majority of the victims are\nlocated in Russia and other members of the Commonwealth of Independent States\n(CIS). We were able to identify 47 victims that include numerous government ministries\nand diplomatic missions along with space-related government agencies, companies\nand research institutions in Russia and other members of the CIS along with a smaller\namount of similar entities in Europe.\n\nThe threat actors behind “Lurid Downloader” launched 301 malware campaigns\ntargeting entities in specifi c countries or geographic regions and tracked the success\nof each campaign by embedding a unique identifi er in each instance of malware and\nassociating it with specifi c victims. While some campaigns resulted in numerous\nvictims, others were very specifi c and targeted resulting in only one or two victims.\nWhile previous Enfal activity has been typically associated with threat actors in China, it\nremains unclear who is behind the Lurid Downloader attacks.\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### INTRODUCTION\n\nPrior to the highly publicized “Aurora” attack on Google in late 2009, which also\naffected at least 20 other companies, there was little public awareness regarding\ntargeted malware attacks[1]. However, such attacks have been taking place for years\nand continue to affect government, military, corporate, educational, and civil society\nnetworks today. While such attacks against the U.S. government and related networks\nare now fairly well-known, other governments and an increasing number of companies\nare facing similar threats. Russia and other countries in the Commonwealth of\nIndependent States are also being targeted and compromised. These countries have\nan expertise in the space industry and also have operations in oil & gas, mining and\nother industry areas that have been targeted by malware attacks in the past.\n\nMalware attacks that exploit vulnerabilities in popular software in order to compromise\nspecifi c target sets are becoming increasingly commonplace. These attacks are not\nautomated or indiscriminate nor are they conducted by opportunistic amateurs. Known\nas targeted malware attacks, these attacks refer to computer intrusions staged by\nthreat actors that aggressively pursue and compromise specifi c targets. Targeted\nmalware attacks are typically part of broader campaigns, a series of failed and success\ncompromises, by specifi c threat actors and not isolated attacks.\n\nHowever, the specifi city of the attacker’s prior knowledge of the victim affects the level\nof targeting associated with a single attack. As a result, some attacks appear to be\nless precise, or “noisy”, and are aimed at a broader community. Such “spear phishing”\nattacks are usually “directed toward a group of people with a commonality” as opposed\nto a specifi c target but are useful for gaining an initial foothold in a future target of\ninterest[2].\n\nThe malware used in the “Lurid Downloader” attacks is commonly known as “Enfal”\nand it has been used in targeted attacks as far back as 2006[3]. In 2008, Maarten Van\nHorenbeeck documented a series of targeted malware attacks that made use the Enfal\nTrojan to target non-governmental organizations, non-governmental organizations\n(NGOs) as well as defense contractors and U.S. government employees[4].  In 2009\nand 2010, researchers from the University of Toronto published reports on two cyberespionage networks known as “GhostNet” and “ShadowNet” that included malware\nand command and control infrastructure connected with the Enfal Trojan[5].  The\ndomain names used by Enfal as command and control servers are, according to U.S.\ndiplomatic cables leaked to Wikileaks, linked to a series of attacks known as “Byzantine\nHades.” According to these leaked cables, the activity of this set of threat actors has\nbeen ongoing since 2002 and is known as “Byzantine Hades”, and there are subsets\nof this activity known as “Byzantine Anchor,” “Byzantine Candor” and “Byzantine\nFoothold”[6]. However, it is important to note that other than the use of Enfal itself,\nthere appears to be several distinct sets of command and control infrastructure in use\nand the relationship among the threat actors operating these separate infrastructures\nremains unclear.\n\nThe “Lurid Downloader” attacks appear to be another separate, but related Enfal\nnetwork with a geographic focus. While there is clear evidence that the Tibetan\ncommunity is also target, the victims of this attack are concentrated in Russia and\nother CIS countries. Numerous embassies and government ministries have been\ncompromised as well as research institutions and agencies related to the space\nindustry.\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\nOur investigation began with an analysis of the “Lurid Downloader” malware. Our\nobjective was to document its functionality and map out its command and control\nnetwork. While this malware family is well known, there appear to be various\nassociated threat actors using it to compromise targets in various geographic locations.\nSimilar versions of this malware have been used to target both the U.S. government\nand NGO’s in the past. We could fi nd no direct links between this particular command\nand control network and the previously discovered ones; we believe that it is most likely\na separate, but related network as they appear to each have a regional focus.\n\nWe uncovered a command and control network that consists of 15 domains names\nand 10 IP addresses. We were able to retrieve a listing of the compromised computers\nconnecting to these servers. In total, we found 1465 unique hosts (Hostname + Mac\naddress as stored by the C&C) with 2272 unique external IP addresses connecting to\nthe command and control network primarily from Russia (1063), Kazakhstan (325) and\nUkraine (102) along with numerous other countries in the CIS (former Soviet Union).\n\nWe were able to use reverse DNS and WHOIS lookups to determine the identity\nof 47 compromised hosts. From the victims we were able to identify, there were\nconcentrations of government ministries and diplomatic missions as well as spacerelated government agencies, companies and research institutions.\n\nWe found that the attackers embedded campaign codes inside the malware they\npropagated in order to keep track of the success of their campaigns. In total, we\nfound 301 campaign codes and there are high concentrations of victims within a single\ncountry for each instance of the malware campaign indicating that the distribution of\nthe malware is targeted at specifi c countries or regions. In addition, nearly 60% of the\ncampaigns only affected 1 or 2 victims indicating the precision with which the malware\ncampaigns were conducted.\n\n1 For the attacks on Google, see http://googleblog.blogspot.com/2010/01/new-approach-to-china.html\n\n2 http://www.cisco.com/en/US/prod/collateral/vpndevc/ps10128/ps10339/ps10354/targeted_attacks.pdf\n\n3 http://about-threats.trendmicro.com/ArchiveMalware.aspx?language=us&name=TROJ_SHARP.R\n\n4 http://events.ccc.de/congress/2007/Fahrplan/attachments/1008_Crouching_Powerpoint_Hidden_Trojan_24C3.pdf,\n\nhttp://isc.sans.org/presentations/SANSFIRE2008-Is_Troy_Burning_Vanhorenbeeck.pdf, http://isc.sans.edu/diary.\n\nhtml?storyid=4177\n\n5 While the domain names are present in the GhostNet report, they are not part of GhostNet but a completely different network\n\nof command and control servers that are actually associated with Enfal. http://www.nartv.org/mirror/ghostnet.pdf and\n\nhttp://www.nartv.org/mirror/shadows-in-the-cloud.pdf\n\n6 http://wikileaks.org/cable/2009/04/09STATE32025.html http://cablesearch.org/cable/view.php?id=08STATE116943 and\n\nhttp://www.reuters.com/article/2011/04/14/us-china-usa-cyberespionage-idUSTRE73D24220110414\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### ATTACK VECTOR\n\nIn a typical targeted malware attack, a target typically receives a socially engineered\nmessage – such as an email or instant message – that encourages the target to click\non a link or open a fi le. The links and fi les sent by the attacker contain malicious code\nthat exploits vulnerabilities in popular software such as Adobe Reader (e.g. pdf’s) and\nMicrosoft Offi ce (e.g. doc’s). The payload of these exploits is malware that is silently\nexecuted on the target’s computer. This allows the attackers to take control of the\ncomputer and obtain data from it. The attackers may then move laterally throughout the\ntarget’s network and are often able to maintain control over compromised computers\nfor extended periods of time. Ultimately, the attacks locate and ex-fi ltrate sensitive\ninformation from the victim’s network.\n\nIn this case, the delivery mechanism used was an email with a malicious PDF as an\nattachment. The email had no content, just a subject line and an attachment. The\nemail message was spoofed to appear to be from ohhdl@dalailama.com, the Offi ce\nof the Dalai Lama and had a subject of “Tibetan Losar Event on 6 March 2011”. It also\ncontained an attachment named “LOSAR FLYER_edited-3.pdf”.\n\nThe email was sent using an email provider called Gawab (gawab.com) which is\npopular in the Middle East. The server used was info3.gawab.com (66.220.20.18)\nand the email address was emb107@gawab.com. The originating IP address was:\n96.46.11.88 (INTERNETXTUSA). While this IP address is assigned to the US, it is used\nby a VPN provider in China[7].\n\nIf the attached PDF is opened with older versions of Adobe reader, malicious code\nis executed that drop malware on the target’s system. The malware then connects to\na command and control server under the attacker’s control. At this time, the target’s\ncomputer is compromised and under the full control of the attackers.\n\n7 http://www.ldvpn.cn/us-dongtai.html\n\n### MALWARE\n\n**MD5** **File Name** **Detection**\n\n322fcf1b134fef1bae52fbd80a373ede LOSAR_FLYER_edited-3.pdf TROJ_PIDIEF.SMZX\n\nThis PDF contains a JavaScript stream that exploits the util.printd vulnerability (CVE2009-4324) that affects Adobe Reader 9.x (before 9.3) and 8.x (before 8.2).\n\n**MD5** **File Name** **Detection**\n\n84d24967cb5cbacf4052a3001692dd54 ctfmon.exe TROJ_MECIV.A\n\nThis PDF contains a JavaScript stream that exploits the util.printd vulnerability\n(CVE-2009-4324) that affects Adobe Reader 9.x (before 9.3) and 8.x (before 8.2).\n\n|MD5|File Name|Detection|\n|---|---|---|\n|322fcf1b134fef1bae52fbd80a373ede|LOSAR_FLYER_edited-3.pdf|TROJ_PIDIEF.SMZX|\n\n|MD5|File Name|Detection|\n|---|---|---|\n|84d24967cb5cbacf4052a3001692dd54|ctfmon.exe|TROJ_MECIV.A|\n\n|MD5|File Name|Detection|\n|---|---|---|\n|3447416fbbc65906bd0384d4c2ba479e|mspmsnsr.dll[chars]|TROJ_MECIV.A|\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\nAfter successful exploitation, two malware components are created. One is a dropper\n(ctfmon.exe) that installs a windows service. The service loads the dropped dll fi le\nmspmsnsr.dll<long string of characters>. The malicious Windows service stores its\nconfi guration settings in the registry:\n\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WmdmPmSp\\Parameters\n\nThis malware identifi es itself as version 2.14. During the course of our investigation, we\ndiscovered another version of the malware that identifi es itself as version 2.15.\n\n**MD5** **File Name** **Detection**\n\n856de08a947a40e00ea7ed66b8e02c53 isssync.exe WORM_OTORUN.TMP\n\nInstead of a Windows service, version 2.15 is just a single executable that copies itself\nto the system folder and ensures persistence by changing the common start folder of\nwindows to a special one it creates. It then copies all the usual auto-start items there,\nas well as itself. The existence of this folder is constantly checked and redone if the\nuser or any program switches it back to normal.\n\nThe Trojan collects information from the computer and sends it via HTTP POST. The\ninformation it collects is the following:\n\n- Computer name\n\n- MAC address\n\n- computer OS and version\n\n- IP address and codepage\n\n- language of the operating system.\n\nIt constantly communicates with a C&C server to perform certain info-stealing tasks.\nThe main feature of the Trojan is that all communication is started by the client by http.\nFirewalls and other security devices will never see any communication from outside\nin. Even the interactive command line is built this way so everything is done from the\ninside out. The communication is always encrypted although it’s a simple XOR singlebyte encryption. This means that network security devices won’t readily see anything\nsuspicious going on.\n\n|MD5|File Name|Detection|\n|---|---|---|\n|856de08a947a40e00ea7ed66b8e02c53|isssync.exe|WORM_OTORUN.TMP|\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### COMMUNICATION WITH THE COMMAND AND CONTROL SERVER\n\nWhen malware is executed on the target’s system it “checks in” with one or more\nservers under the control of the attackers. Command and control mechanisms allow the\nthreat actors to confi rm that an attack has succeeded in addition to supplying them with\nsome information about the target’s computer and network. From here on, the client\ncommunicates back to the control server expecting a command, allowing the attackers\nto issue commands to the compromised target.\n\nAll of the connections to the command and control servers use the HTTP protocol and\nrequest specifi c URL paths. On startup, the malware connects to the command and\ncontrol server and requests the path “/trandocs/mm/” (the path may differ with other\nsamples, for example “httpdocs/mm/ or /iupw82/netstate”). This appears to be a LOGIN\nconnection and the server always responds with “123”. The data transmitted to the\ncommand and control server consists of the following:\n\nEncrypted Password/<hostname>:<MAC>/<ip address>\n<OS name>\n<codepage>:<locale>\n<actual exe name>\n<campaign name>\n<y/n> (sys32time.ini exists? Is it 1Mb or bigger?)\n<y/n> (ipop.dll exists?)\n<y/n> (always n in our samples)\n<malware version> (2.14 or 2.15)\n\nThe encrypted password at the beginning of the LOGIN packet only appears on version\n2.15. The sample we analyzed contains the password “hallelujah” and it is encrypted\nwith “ADD +FAh”. The earlier version, 2.14, does not contain a password at all.\n\nAfter the initial connection, the malware makes two kinds of connections to the\ncommand and control server every 2 minutes. The fi rst connection is a KEEPALIVE\nconnection to the URL path “/cgl-bin/Owpq4.cgi”. The malware posts information to the\ncommand and control server that identifi es the compromised machine: OS and version,\n“campaign ID” and malware version. The second connection is an ASKCMD connection\nto a URL with the path “/trandocs/mm/ <machine_name>:<MAC address>/Cmwhite”.\nThe contents of “Cmwhite” contain commands that are sent by the attackers to the\ncompromised computer. The range of possible commands will be discussed below.\n\nWhen the command fi le, “Cmwhite” is downloaded, the malware fi rst acknowledges the\nreceipt of the command by issuing an ACKCMD connection to “/cgl-bin/Clnpp5.cgi”.\nOnce the command is interpreted and performed, the malware issues a CMDDONE\nrequest to “/cgl-bin/Rwpq1.cgi”. It contains the results of the command and, if relevant,\na result code that indicates any error encountered. When there is no command set\nby the attackers for the victim computer, the command and control server returns a\n“404 NOT FOUND” error page. This is never interpreted correctly as a command and\ntherefore ignored.\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### COMMANDS\n\nThe command packet that is contained within the “Cmwhite” response is encrypted. In\nthe samples we analyzed, it is encrypted with XOR 45h. Other communication packets\nobserved suggest that there are other keys in use but they are always a single byte.\nOnce decrypted, this is what a command packet contains:\n\nFirst two bytes: 40 40. (This is just a magic number).\nThird byte: Command code.\nFourth byte: Return code. (This only used in the CMDDONE packet to indicate\nerror/success).\nFrom the Fifth byte on, the command carries parameters, which vary depending\non the nature of the command.\n\nThe range of commands available to the attackers that are enumerated below\ndemonstrate the level of control the attackers have over their victims. In addition to\nfunctionality that allows the attackers to send and receive fi les, they are able to activate\nan interactive remote shell on compromised systems.\n\n|Range of commands|Col2|Col3|\n|---|---|---|\n|Command 01|ECHO|It echoes back the word contained in bytes 5 and 6. There’s another parameter, which is supposed to contain the string “ibme54”. If this is right, it keeps an internal counter of how many of these ECHO packets, it has received.|\n|Command 02|IPOP LOAD CHECK|It checks if the previous check for the fi le c:\\windows\\system32\\ipop. dll was successful. It returns a y/n condition.|\n|Command 03|SEND FILE|When the client receives this command, it retrieves a fi le and sends it to the C&C server. The fi lename is a parameter in the command packet.|\n|Command 04|RECV FILE|This command has two parameters, the fi lename and the data. The client creates the fi le with the data in the packet. It does this by constantly communicating with a Ufwhite URL. This URL is accessed repeatedly in order to keep receiving chunks of the data fi le and appending it to the fi le. When there’s no more data, the fi le is closed and operation is fi nished. After each packet is correctly received, the client sends a report packet to Clnpp5.cgi specifying that it was Ufwhite who started this operation.|\n|Command 05|CMDEXEC|It accepts a single command and executes it in the victim system.|\n|Command 06|DELETE FILE|It accepts a fi lename string as a parameter. It deletes the fi le.|\n|Command 07|MOVE FILE|It accepts two fi lenames. It moves the fi le from source to target destination.|\n|Command 09|LS|When the client receives this command, its proceeds to list the fi les within a specifi ed directory and sends the list back in a response packet.|\n|Command 0A|INTERACTIVE MODE|When the client receives this command, it stays in interactive mode. It starts connecting to Clnpp5.cgi expecting a command. These commands are then executed and error codes sent straight away until an “exit” command is received. The interactive commands have a special tag to set them apart from regular commands. This tag is “1234”. The way this interactive system is implemented is the following: The command is run in the same way as command 05 but the output is redirected to a fi le (c:\\Documents and Settings\\<user>\\ SendTo\\msacm.dat). The contents of the fi le are then sent in the return packet to Clnpp5.cgi. Once the “exit” command has been received, this mode is interrupted. While this mode is going on, the Trojan still sends keepalive and regular command requests packets.|\n\n\n-----\n\n|Command 0B|MKDIR|The client creates a directory|\n|---|---|---|\n|Command 0E|TERMINATE PROCESS|The client tries to terminate a given thread in the system.|\n|Command 10|EXEC NFAL|When this command is received, the client tries to execute the fi le c:\\ windows\\system32\\nfal.exe. This fi le does not exist on an infected system normally so it must be a placeholder for a command fi le uploaded to the victim.|\n|Command 40|PING|When this command is received, the Trojan just sends back an empty packet with a success code condition.|\n\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### TOOL MARKS\n\nThe terms “tool marks” refers to characteristics contained within malware that indicate\nthat they are part of the same campaign or related to specifi c threat actors[8]. In this\ncase, the attackers left the PDB path in the malware samples we analyzed which\nindicate the name of the project:\n\ne:\\programs\\LuridDownLoader\\LuridDownloader for\nFalcon\\DllServiceTrojan\\Release\\DllServiceTrojan.pdb\ne:\\programs\\LuridDownLoader\\LuridDownloader for Falcon\\ServiceDll\\Release\\\nServiceDll.pdb\n\nWe named this campaign of targeted attacks “Lurid DownLoader” based on the project\nname the attackers have given to their own malware.\n\n8 http://mobile.darkreading.com/9287/show/571d636618a7ba35b7e9bae872fc5bfd&t=ebba8420c261102635de4d20bdd772f2\n\n### COMMAND AND CONTROL INFRASTRUCTURE\n\nAttackers often maintain a network of command and control servers, not just a single\none. Often, the malware used in targeted attacks contains one or more command and\ncontrol locations. By linking together the domain names that are present in related\nmalware samples, along with domain names registered by the same email address and\ndomain names hosted on the same web servers we were able to map out the command\nand control infrastructure of the attackers.\n\nIn total, we found 15 domain names associated with the attackers and 10 active IP\naddresses. The domain names were registered by two different email addresses\n“bruce_tuner@yahoo.com” and “icqmaster@163.com”.\n\n\n-----\n\n|DOMAINS|REGISTRATIONS|\n|---|---|\n|mailru-vip.com yandex-vip.com google-offi ceonline.com offi ce-helppane.com foxit-pro.com ymail-vip.com ymail-pro.com yandex-pro.com google-offi ce.com mailru-pro.com|xiaohu wang bruce_tuner@yahoo.com +86.01089464156 fax: +86.01089464156 bei jing shi beijing beijing 102600 CN|\n|hoticq.com redhag.com zadhc.com lasmail.com hotoicq.com|jason bush icqmaster@163.com +86.01062311307 fax: +86.01062311307 No.20 Xueyuan Road,Haidian District,Beijing beijing beijing 100083 CN|\n\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\nRather than use the “root” domains, the attackers use a variety of sub-domains. These\nvarious sub-domains resolve to 10 different IP address spread across 3 different\nIP address ranges assigned to 2 providers: Krypt Technologies in the U.S. and\nUK2/100mb in the U.K.\n\nAdditional malware samples that connect to this command and control infrastructure\nare:\n\n|MD5|Domain|IP ADDRESS|\n|---|---|---|\n|ed69041fbe470fe0f2c1fd837efcb6e7|ace.mailru-vip.com home.mailru-pro.com xphlp.ymail-vip.com|173.212.195.216|\n|d66948e4e90baff08d24c77c93788597|ace.mailru-vip.com home.mailru-pro.com xphlp.ymail-vip.com|173.212.195.216|\n|2d93cbe969d3b5f02d4f9f1a3eb39b85|ace.mailru-vip.com home.mailru-pro.com xphlp.ymail-vip.com|173.212.195.216|\n|465ca2eef82b412949eeaa9fa3cc5c75|setup.mailru-vip.com|109.123.126.143|\n|e1833932053171da15c60e6c2fca708a|superkiller.mailru-vip.com sexinsex.ymail-vip.com|109.123.126.156|\n|e38ccff8e7fb922fe48b54b4032fec50|setup.mailru-vip.com|109.123.126.143 (184.95.36.75)|\n|744670ca4531f7ceb72a75ae456e8215|microsoft.offi ce-helppane.com|109.123.126.151|\n|f0f31112af491f56af7cc0802ba96c0f|microsoft.offi ce-helppane.com win.foxit-pro.com update.ymail-vip.com|109.123.126.151 106.123.126.151|\n|2a21eb36cc2a0a24149a4821aa328b7b|microsoft.offi ce-helppane.com|109.123.126.151|\n|5403e0bda1db72e5e862e9169db4e1d7|led.offi ce-helppane.com|174.139.13.122 (184.95.36.75)|\n|57d99d67c3e8987e812c9332d6774794|press.foxit-pro.com||\n|963e39d8675b5bb3d2f4e6da45c51bb0|press.mailru-pro.com|(184.22.240.174)|\n|166d6cd28c9df20c30fed220a3132345|press.ymail-pro.com|46.23.67.226|\n|89b98f66650cb29d0926713fda3b5bbc|press.ymail-pro.com|46.23.67.226 (184.22.251.12)|\n\n\n-----\n\n|d8815fe64eb5321add412554908da28a|help.lasmail.com|109.123.126.157|\n|---|---|---|\n|22caf76a780c54ddce7fa139100fa54e|mail.lasmail.com|109.123.126.157 (58.64.149.29)|\n|140c69ea9a963100e75497b33820f1da|help.lasmail.com|109.123.126.157 (204.12.197.70)|\n|8f65204d8440b7be2b52908e35d19124|mail.lasmail.com|109.123.126.157 (58.64.149.29) (204.12.197.70)|\n|f993d4cabe5021c96d6a80192f142dca|support.hotoicq.com|109.123.126.157|\n|74bdabd1077d640f7d21c6cfb14a0348||204.12.197.70|\n|22caf76a780c54ddce7fa139100fa54e|mail.lasmail.com|109.123.126.157 (58.64.149.29)|\n|140c69ea9a963100e75497b33820f1da|help.lasmail.com|109.123.126.157 (204.12.197.70)|\n|8f65204d8440b7be2b52908e35d19124|mail.lasmail.com|109.123.126.157 (58.64.149.29) (204.12.197.70)|\n|f993d4cabe5021c96d6a80192f142dca|support.hotoicq.com|109.123.126.157|\n|74bdabd1077d640f7d21c6cfb14a0348||204.12.197.70|\n\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### COMPROMISED ORGANIZATIONS\n\nAfter mapping out and monitoring the command and control network used in this\ncampaign we were able to retrieve a listing of the compromised computers connecting\nto these servers. This list of compromised computers contains 1465 unique hosts\n(Hostname + Mac address as stored by the C&C) with 2272 unique external IP\naddresses connecting to the command and control network primarily from Russia\n(1063), Kazakhstan (325) and Ukraine (102) along with numerous other countries in\nthe CIS (former Soviet Union). There were also signifi cant numbers of compromises\nin Vietnam, India, Mongolia and China. In total, there were victims in 61 different\ncountries.\n\nThe data covers compromised computers that connected to the command and control\nservers in June and July 2011. The top 10 countries of victims (based on the 2272 IP\naddresses) are:\n\nRU 1063\nKZ 325\nUA 102\nVN 93\nUZ 88\nBY 67\nIN 66\nKG 49\nMN 42\nCN 39\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### MALWARE CAMPAIGNS\n\nAs noted earlier, there is a unique identifi er built in to instances of the malware sent\nout by the attackers that allows them to keep track of the computers compromised\nby specifi c campaigns. In total, we found 301 campaign codes. This means that the\nattackers sent out at least 301 different instances of the “Lurid Downloader.” There are\nhigh concentrations of victims within a single country for each instance of the malware\ncampaign indicating that the distribution of the malware is targeted at specifi c countries\nor regions.\n\n**Campaign** **Count** **Countries**\n\nstrong 668 All 68 of the compromised counters were in Vietnam.\n\n5 in Russia, 3 in Ukraine and 1 each in Czech Republic, Kazakhstan,\nejun0708 63\nSwitzerland, Tajikistan and Belarus\n\n27 in Russia, 3 in China, 3 in Kyrgyzstan, 2 in Tajikistan and 1 each in UK,\nejun0614 42\nUS, S. Korea, Czech republic, Pakistan, Germany and Kazakhstan.\n\nstrongNewDns 34 All 34 of the compromised counters were in Vietnam.\n\nejun0509 32 31 in Russia, 1 in Ukraine\n\n21 in Russia, 4 in Ukraine, 2 in Kazakhstan, and 1 each in Czech Republic\nejun0511 29\nand Azerbaijan\n\n7-28 28 24 in Vietnam and one each in UAE, Cambodia,Thailand and China\n\nejun0503 25 23 in Russia and 1 each in Ukraine and Czech Republic\n\n0dayaug12.exe 22 20 in Belarus and 2 in Kazakhstan\n\nC:\\WINDOWS\\ 12 in US, 5 in Russia, 3 in The Netherlands, and 1 each in Switzerland and\nsystem32\\desp.exe [22] the European Union.\n\nThere were also specifi c campaigns that affected a very small number of victims. In\nfact, nearly 60% (59.4%) of all the campaigns affected only 1 or 2 victims. There\nwere 115 campaigns that only compromised 1 victim and 64 campaigns that only\ncompromised 2 victims. This indicates the precision in malware campaigns that target\nspecifi c entities.\n\n|Campaign|Count|Countries|\n|---|---|---|\n|strong|668|All 68 of the compromised counters were in Vietnam.|\n|ejun0708|63|5 in Russia, 3 in Ukraine and 1 each in Czech Republic, Kazakhstan, Switzerland, Tajikistan and Belarus|\n|ejun0614|42|27 in Russia, 3 in China, 3 in Kyrgyzstan, 2 in Tajikistan and 1 each in UK, US, S. Korea, Czech republic, Pakistan, Germany and Kazakhstan.|\n|strongNewDns|34|All 34 of the compromised counters were in Vietnam.|\n|ejun0509|32|31 in Russia, 1 in Ukraine|\n|ejun0511|29|21 in Russia, 4 in Ukraine, 2 in Kazakhstan, and 1 each in Czech Republic and Azerbaijan|\n|7-28|28|24 in Vietnam and one each in UAE, Cambodia ,Thailand and China|\n|ejun0503|25|23 in Russia and 1 each in Ukraine and Czech Republic|\n|0dayaug12.exe|22|20 in Belarus and 2 in Kazakhstan|\n|C:\\WINDOWS\\ system32\\desp.exe|22|12 in US, 5 in Russia, 3 in The Netherlands, and 1 each in Switzerland and the European Union.|\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### NOTEWORTHY COMPROMISED ORGANIZATIONS\n\nWe were able to use reverse DNS queries and WHOIS lookups to determine the\nidentity some of the compromised hosts. There are high profi le diplomatic organizations\nthat have been compromised as well as agencies relating to space and research\ninstitutions.\n\n|Country|Sector|Date|Camapign|\n|---|---|---|---|\n|France|GOV|Sat Jun 18 10:22:22 2011|0dayjun14.exe|\n|Switzerland|GOV|Mon Jul 11 11:28:02 2011|LOGO076|\n|UK|MEDIA|Thu Jun 16 08:18:44 2011|0dayapr13.exe|\n|Germany|SPACE|Mon Jun 20 09:43:48 2011|6-7|\n|Spain|SPACE|Mon Jul 4 11:38:35 2011|6-27|\n|Russia|GOV|Tue Jun 7 12:15:34 2011|lh0603hy|\n|Russia|GOV|Mon Jul 11 07:17:46 2011|ejun0708|\n|Russia|GOV|Tue Jun 28 00:54:16 2011|110608|\n|Russia|SPACE/GOV|Wed Jul 13 04:21:20 2011|aoo526pdf|\n|Russia|SPACE|Wed Jul 13 07:14:38 2011|winupdate712|\n|Russia|SPACE|Mon Jul 25 08:43:40 2011|6-7|\n|Russia|SPACE|Wed Jul 13 02:45:59 2011|coo328xls|\n|Russia|RESEARCH/GOV|Wed Jul 13 06:06:06 2011|aoo0516pdf|\n|Russia|RESEARCH|Wed Jul 20 12:01:00 2011|6-27|\n|Russia|RESEARCH|Mon Jul 11 07:38:14 2011|winupdate0706|\n|Russia|RESEARCH|Tue Jun 14 08:09:23 2011|110303|\n|Russia|RESEARCH|Wed Jul 13 02:46:24 2011|coo0609doc|\n|Russia|RESEARCH|Wed Jul 13 02:47:33 2011|sat0608old|\n|Russia|RESEARCH|Tue Jun 14 02:49:58 2011|winupdate|\n|Russia|RESEARCH|Tue Jun 14 02:38:52 2011|satellite0608|\n|Russia|MEDIA|Tue Jun 14 04:25:12 2011|ejun0125|\n|China (Russia)|BUSINESS|Tue Jun 7 13:17:39 2011|lh0603hy|\n|Russia|BUSINESS|Tue Jun 14 07:28:25 2011|z11apr27aboky|\n|Russia|GOV|Tue Jun 14 11:49:35 2011|z10nov23k|\n|Russia|POLITICAL PARTY|Tue Jun 14 14:05:24 2011|LOGO69|\n|Russia (Ukraine)|GOV|Mon Jul 4 10:36:46 2011|LOGO704|\n|Turkmenistan|GOV|Mon Jun 13 07:28:59 2011|0dayjun09.exe|\n|Kyrgyzstan|GOV|Mon Jun 13 07:33:12 2011|0dayjun09.exe|\n|Kazakhstan|GOV|Mon Jun 13 06:06:47 2011|0daydec08.exe|\n|Kazakhstan|GOV|Mon Jun 27 15:15:42 2011|smross.exe|\n\n\n-----\n\n|Ukraine|GOV|Wed Jun 22 15:43:26 2011|LOGO615|\n|---|---|---|---|\n|Kazakhstan|GOV|Mon Jun 13 06:06:47 2011|0daydec08.exe|\n|Kazakhstan|GOV|Mon Jun 27 15:15:42 2011|smross.exe|\n|Ukraine|GOV|Wed Jun 22 15:43:26 2011|LOGO615|\n|Belarus|GOV|Thu Jul 14 17:58:48 2011|0dayaug12.exe|\n|Germany (Kazakhstan)|GOV|Tue Jun 21 10:07:49 2011|LOGO621|\n|Austria (Kyrgyzstan)|GOV|Mon Jun 13 09:34:45 2011|LOGO524|\n|Russia (Tajikistan)|GOV|Tue Jun 7 12:00:03 2011|lh0526w.exe|\n|Kazakhstan|GOV|Thu Jul 7 05:44:34 2011|LOGO0705|\n|Kyrgyzstan (Kazakhstan)|GOV|Tue Jul 12 10:57:17 2011|z10dec09UP.exe|\n|Kazakhstan (China)|GOV|Tue Jun 14 08:58:53 2011|LOGO69|\n|Kazakhstan|RESEARCH|Thu Jun 16 08:24:31 2011|LOGO616|\n|Belarus|RESEARCH|Wed Jul 13 05:37:40 2011|services712|\n|Armenia|RESEARCH|Fri Jun 24 07:25:18 2011|LOGO624|\n|Kazakhstan|MEDIA|Mon Jun 13 08:17:29 2011|z10nov25knb|\n|Vietnam|GOV|Sun Jul 3 09:06:57 2011|strong|\n|China|BUSINESS|Sun Jun 12 06:02:11 2011|lh0517e.exe|\n|Uzbekistan|GOV|Tue Jun 14 05:41:09 2011|0dayjan27|\n|Vietnam|GOV|Tue Aug 2 12:57:36 2011|7-28|\n\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### DATA EX-FILTRATION\n\nWhile we were unable to recover the data obtained by the attackers, we were able to\ncollect some of the command issued by the attackers that hint at their objectives. We\nfound that the attackers often issued the “LS” command to send a directory listing from\nspecifi c directories on the compromised computers back to the command and control\nserver. We also observed the use of the “SEND FILE” that ordered the compromised\ncomputers to compress, split and upload specifi c fi les (.rar, .xls, .doc) to the command\nand control server. However, we were unable to recover the ex-fi ltrated data.\n\n\n-----\n\n##### THREATS TRENDS AND SECURITY ISSUES DIRECT FROM THE EXPERTS\n\n\n### ATTRIBUTION\n\nDetermining who is ultimately behind targeted malware attacks is diffi cult as it requires\na combination of technical and contextual analysis and the ability to connect disparate\npieces of information together over a period of time. Moreover, any one researcher\ntypically does not necessarily have all these pieces of information and must interpret\nthe available evidence. Too often, the determination of attribution is based on easily\nspoofed evidence such as IP addresses. While many of these attacks are attributed to\nChina, in this case, the IP addresses of the command and control servers were located\nin the United States and the United Kingdom. However, the registration information\nof the domain names used indicates that the owners are in China. In either case, the\ninformation is not diffi cult to manipulate.\n\nThe use of “Enfal”, the family of malware to which “Lurid Downloader” belongs, has\nbeen historically linked with threat actors in China. In this case, the attack vector\nthat we were able to analyze was related to the Tibetan community which indicates\nan association with China. However, China was also a victim of “Lurid Downloader.”\n\n### CONCLUSION\n\nIn this report we have analyzed targeted malware attacks that have compromised\nsensitive locations in Russia, CIS countries and around the world. The focus of the\nattacks appears to be on government networks and diplomatic missions as well and\nresearch institutions and space related agencies. We found that the attackers engaged\nin over 300 campaigns and kept careful records of their victims and to what campaign\ncompromised them. Our analysis of the campaigns reveals that attackers engage\nin attacks that target communities in specifi c geographic locations as well extremely\ntargeted campaigns that only affect one or two victims.\n\nThe precise nature of targeted malware attacks increases the diffi culty of defense. With\nsignifi cant reconnaissance, and possibly information gained from previously successful\nincursions into the target’s network, the threat actors behind targeted malware attacks\nare able to customize their attacks to increase the probability of success. Therefore,\ndefenses against targeted malware attacks need to focus on detection and mitigation\nand not simply on prevention.\n\nThrough the exposure of the “Lurid Downloader” network, we aim to enable a better\nunderstanding of the extent and frequency of such attacks as well as the challenges\nthat targeted malware attacks pose for traditional defenses. Defensive strategies can\nbe dramatically improved by understanding how targeted malware attacks work as well\nas trends in the tools, tactics and procedures of the threat actors behind such attacks.\nBy effectively using threat intelligence derived from external and internal sources\ncombined with security tools that empower human analysts, organizations are better\npositioned to detect and mitigate targeted malware attacks.\n\n\n**TREND MICRO™**\n\nTrend Micro Incorporated is a pioneer in secure content and\nthreat management. Founded in 1988, Trend Micro provides\nindividuals and organizations of all sizes with award-winning\nsecurity software, hardware, and services. With headquarters\nin Tokyo and operations in more than 30 countries, Trend\nMicro solutions are sold through corporate and value-added\nresellers and service providers worldwide. For additional\n\n\n**TRENDLABS[SM]**\n\nTrendLabs is Trend Micro’s global network of research,\ndevelopment, and support centers committed to 24 x 7 threat\nsurveillance, attack prevention, and timely and seamless\nsolutions delivery.\n\n\n©2011 by Trend Micro, Incorporated. All rights reserved. Trend Micro,\nthe Trend Micro t-ball logo are trademarks or registered trademarks of\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/7s9bvquu64vafpi14t8p6w2t6hwls1zi",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2011/2011.09.22.LURID_Downloader/wp_dissecting-lurid-apt.pdf"
    ],
    "report_names": [
        "wp_dissecting-lurid-apt"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1316796582,
    "ts_modification_date": 1316783131,
    "files": {
        "pdf": "https://archive.orkl.eu/23f1f9e5771be71725fa19487da59f6779f5ee3f.pdf",
        "text": "https://archive.orkl.eu/23f1f9e5771be71725fa19487da59f6779f5ee3f.txt",
        "img": "https://archive.orkl.eu/23f1f9e5771be71725fa19487da59f6779f5ee3f.jpg"
    }
}