{
    "id": "ebcd28ee-4d92-4677-b34f-e00f53b1e788",
    "created_at": "2023-01-12T15:09:01.549199Z",
    "updated_at": "2025-03-27T02:05:35.576568Z",
    "deleted_at": null,
    "sha1_hash": "60378ee50ab6eea8672b5b7f42fb51b3f32d8ddb",
    "title": "2021-06-04 - US arrests Latvian woman who worked on Trickbot malware source code",
    "authors": "",
    "file_creation_date": "2022-05-27T22:43:03Z",
    "file_modification_date": "2022-05-27T22:43:03Z",
    "file_size": 655130,
    "plain_text": "# US arrests Latvian woman who worked on Trickbot malware source code\n\n**[therecord.media/us-arrests-latvian-woman-who-worked-on-trickbot-malware-source-code/](https://therecord.media/us-arrests-latvian-woman-who-worked-on-trickbot-malware-source-code/)**\n\nJune 4, 2021\n\nThe US Department of Justice has arraigned in court today a Latvian woman who was part\nof the Trickbot malware crew, where she served as a programmer and wrote code for\ncontrolling the malware and deploying ransomware on infected computers.\n\n**Alla Witte, 55, of Latvia, but who resided in Paramaribo, Suriname, was arrested on**\n[February 6 in Miami, Florida, the DOJ said in a press release today.](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\n\nUS officials said that Witte, who went online as “Max,” has been working with the Trickbot\nmalware gang since the group formed in November 2015, when remnants of the Dyre\nmalware gang assembled to create and distribute a revamped version of the Dyre trojan that\nwas subsequently named Trickbot.\n\n[According to court documents [PDF], Witte was identified as one of 17 suspects behind the](https://www.justice.gov/opa/press-release/file/1401766/download)\nTrickbot malware, which is belived to have infected millions of computers across the world\nsince 2015.\n\nUS investigators said Witte oversaw “the creation of code related to the monitoring and\ntracking of authorized users of the Trickbot malware, the control and deployment of\nransomware, obtaining payments from ransomware victims, and developing tools and\n\n\n-----\n\nprotocols for the storage of credentials stolen and exfiltrated from victims infected by\nTrickbot.”\n\nHer role in the Trickbot gang evolved as the malware also changed—which went from a\nclassic banking trojan focused on stealing funds from bank accounts to a loader for other\nmalware payloads (such as ransomware operations).\n\nUS officials have charged Witte in 19 counts in a 47-count indictment. Public comments from\ncybersecurity professionals suggest that Witte did not did a good job at hiding her identity,\neven hosting in-dev versions of the Trickbot malware on her personal website.\n\n[👋👏Tango down: \"Alla Witte\" aka \"Alla Klimova\" – one known #TrickBot developer](https://twitter.com/hashtag/TrickBot?src=hash&ref_src=twsrc%5Etfw)\nand operator arrested!\n\n📌She previously hosted even TrickBot \"red\" group tag payload on her own website ->\n[see URLhaus https://t.co/8LwtzBSZGRhttps://t.co/Nby4k2jvnt](https://t.co/8LwtzBSZGR)\n[pic.twitter.com/qG977wjgLN](https://t.co/qG977wjgLN)\n\n[— Vitali Kremez (@VK_Intel) June 4, 2021](https://twitter.com/VK_Intel/status/1400939116666179586?ref_src=twsrc%5Etfw)\n\nImage: William Thomas, Cyjax\nWitte is the first member of the Trickbot gang to be arrested. US officials said other Trickbot\nsuspects are still at large in Russia, Belarus, Ukraine, and Suriname.\n\n[In October 2020, US officials filed charges against a criminal group known as QQAAZZ that](https://www.justice.gov/opa/pr/officials-announce-international-operation-targeting-transnational-criminal-organization)\nhelped the Trickbot gang launder funds they stole from victims’ bank accounts.\n\n\n-----\n\nIn the same month, a coalition of tech companies attempted to take down the Trickbot\nbotnet. While the Trickbot gang’s operation were disrupted for a few weeks, the botnet has\nsince recovered and is still active today.\n\n## What is Trickbot\n\nHistorically, the Trickbot botnet is one of the largest and most successful operations to date.\n\nIt began operations in 2015 after members of the Dyre malware gang scattered following a\nseries of high-profile arrests that crippled the group’s leadership structure.\n\nTrickbot was set up as an alternative and initially it continued where Dyre left off, with its\noperators investing most of their time in email spam campaigns aimed at tricking users into\ndownloading and installing the malware on their computers.\n\nIn its early history, Trickbot worked as a classic banking trojan that infected computers and\nthen tampered with users browsers’ to dump and steal credentials, and then show “web\ninjects” that allowed the gang to collect e-banking credentials and interact with e-bank\naccounts in real-time.\n\nHowever, as banks began deploying security features that made the life of banking trojans\nharder, circa 2017, the Trickbot gang followed other malware groups that were active at the\ntime and converted their banking trojan into a simpler and leaner malware strain. Known as a\nloader (from downloader) or dropper, Trickbot would continue to infect victims with the help\nof email spam, but once it infected a host, it’s primary purpose would be to download and\ninstall other malware strains.\n\nThis way, throughout the years, the Trickbot gang built a giant botnet to which they sold\naccess to other criminal groups. Known as a Crimeware-as-a-Service, Trickbot operators\nallowed customers to deploy their own malware or created specialized modules that\ncustomers could deploy for specific tasks.\n\n\n-----\n\nImage: Eclypsium\nDepending on the victims they infected, the Trickbot malware was often used to steal\nbanking credentials, passwords for enterprise networks, give BEC scammers an entry into\nlarge companies, allow data brokers to pilfer secrets and sensitive files from corporate\nnetworks, or even deploy ransomware, such as Ryuk and Conti, for destructive attacks.\n\n[After it survived its takedown last year and after the Emotet takedown earlier this year,](https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nTrickbot is now considered one of the most dangerous botnets active today, together with\n[Dridex, Qbot, and IcedID.](https://therecord.media/icedid-malware-gang-positioning-itself-as-one-of-the-emotet-replacements/)\n\nThe court documents filed in Witte’s case today are heavily redacted to hide the name of the\nother 16 Trickbot operators, suggesting US officials are aware of their identities already and\nthat future arrests and charges are bound to follow.\n\nTags\n\n[banking trojan](https://therecord.media/tag/banking-trojan/)\n[cybercrime](https://therecord.media/tag/cybercrime/)\n[developer](https://therecord.media/tag/developer/)\n[malware](https://therecord.media/tag/malware/)\n\n\n-----\n\n[Ransomware](https://therecord.media/tag/ransomware/)\n[source code](https://therecord.media/tag/source-code/)\n[Trickbot](https://therecord.media/tag/trickbot/)\n\nCatalin Cimpanu is a cybersecurity reporter for The Record. He previously worked at ZDNet\nand Bleeping Computer, where he became a well-known name in the industry for his\nconstant scoops on new vulnerabilities, cyberattacks, and law enforcement actions against\nhackers.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-04 - US arrests Latvian woman who worked on Trickbot malware source code.pdf"
    ],
    "report_names": [
        "2021-06-04 - US arrests Latvian woman who worked on Trickbot malware source code.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536141,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653691383,
    "ts_modification_date": 1653691383,
    "files": {
        "pdf": "https://archive.orkl.eu/60378ee50ab6eea8672b5b7f42fb51b3f32d8ddb.pdf",
        "text": "https://archive.orkl.eu/60378ee50ab6eea8672b5b7f42fb51b3f32d8ddb.txt",
        "img": "https://archive.orkl.eu/60378ee50ab6eea8672b5b7f42fb51b3f32d8ddb.jpg"
    }
}