{
    "id": "ec057fab-7d60-45ce-803c-cd1042bade0b",
    "created_at": "2023-12-19T02:04:47.186438Z",
    "updated_at": "2025-03-27T02:17:27.515413Z",
    "deleted_at": null,
    "sha1_hash": "1c9fb3d84f4702a0ae479b9e8f5c61ed27547d74",
    "title": "OilRig's persistent attacks using cloud service-powered downloaders",
    "authors": "ESET",
    "file_creation_date": "2023-12-18T23:29:48Z",
    "file_modification_date": "2023-12-18T23:29:48Z",
    "file_size": 890911,
    "plain_text": "# OilRig’s persistent attacks using cloud service-powered downloaders\n\n**[welivesecurity.com/en/eset-research/oilrig-persistent-attacks-cloud-service-powered-downloaders](https://www.welivesecurity.com/en/eset-research/oilrig-persistent-attacks-cloud-service-powered-downloaders/)**\n\nESET researchers analyzed a growing series of OilRig downloaders that the group has used in several campaigns throughout 2022,\nto maintain access to target organizations of special interest – all located in Israel. These lightweight downloaders, which we named\nSampleCheck5000 (SC5k v1-v3), OilCheck, ODAgent, and OilBooster, are notable for using one of several legitimate cloud service\nAPIs for C&C communication and data exfiltration: the Microsoft Graph OneDrive or Outlook APIs, and the Microsoft Office\nExchange Web Services (EWS) API.\n\nIn all cases, the downloaders use a shared (email or cloud storage) OilRig-operated account to exchange messages with the OilRig\noperators; the same account is typically shared by multiple victims. The downloaders access this account to download commands\nand additional payloads staged by the operators, and to upload command output and staged files.\n\nWe discovered the earliest of the series, SC5k (v1) downloader, in November 2021, when it was used in OilRig’s Outer Space\n[campaign, documented in our recent blogpost. In the current blogpost, we focus on all of the SC5k successors that OilRig](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/)\ndeveloped throughout 2022, with a new variation introduced every few months; we will also take a closer look at the mechanisms\nemployed by these downloaders. We also compare these downloaders to other OilRig backdoors that use email-based C&C\n[protocols, and that were reported earlier this year by Trend Micro (MrPerfectionManager) and Symantec (PowerExchange).](https://www.trendmicro.com/en_us/research/23/b/new-apt34-malware-targets-the-middle-east.html)\n\n[Finally, this blogpost also expands on our LABScon 2023 presentation, where we drilled down into how OilRig keeps access to](https://events.sentinelone.com/event/1bdc4a79-98f4-4913-a8d6-efb9a6796cce/websitePage:9107aab7-3c7b-47d0-bad4-4f85cf7fcecd)\nselected Israeli organizations: all of the downloaders studied in this blogpost were deployed in networks that were previously\naffected by multiple OilRig tools, which underlines the fact that OilRig is persistent in targeting the same organizations, and\ndetermined to keep its foothold in compromised networks.\n\n**Key points of this blogpost:**\n\n_OilRig actively developed and used a series of downloaders with a similar logic throughout 2022: three new downloaders_\n_– ODAgent, OilCheck, OilBooster – and newer versions of the SC5k downloader._\n_The downloaders use various legitimate cloud service APIs for C&C communication and data exfiltration: Microsoft_\n_Graph OneDrive API, Microsoft Graph Outlook API, and Microsoft Office EWS API._\n_Targets, all in Israel, included an organization in the healthcare sector, a manufacturing company, a local governmental_\n_organization, and other organizations._\n_All targets were previously affected by multiple OilRig campaigns._\n\n## Attribution\n\nOilRig, also known as APT34, Lyceum, Crambus, or Siamesekitten, is a cyberespionage group that has been active since at least\n[2014 and is commonly believed to be based in Iran. The group targets Middle Eastern governments and a variety of business](https://media.defense.gov/2019/Oct/18/2002197242/-1/-1/0/NSA_CSA_TURLA_20191021%20VER%203%20-%20COPY.PDF)\nverticals, including chemical, energy, financial, and telecommunications.\n\n[OilRig carried out the DNSpionage campaign in 2018 and](https://blog.talosintelligence.com/2018/11/dnspionage-campaign-targets-middle-east.html) [2019, which targeted victims in Lebanon and the United Arab Emirates. In](https://blog.talosintelligence.com/2019/04/dnspionage-brings-out-karkoff.html)\n[2019 and 2020, OilRig continued its attacks with the HardPass campaign, which used LinkedIn to target Middle Eastern victims in](https://www.mandiant.com/resources/hard-pass-declining-apt34-invite-to-join-their-professional-network)\n[the energy and government sectors. In 2021, OilRig updated its DanBot backdoor and began deploying the Shark, Milan, and Marlin](https://vblocalhost.com/uploads/VB2021-Kayal-etal.pdf)\n[backdoors, as mentioned in the T3 2021 issue of the ESET Threat Report. In 2022 and 2023, the group carried out several attacks](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf)\n[against local government entities and healthcare organizations in Israel, using its new backdoors Solar and Mango. In 2023, OilRig](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/)\n[targeted organizations in the Middle East with the PowerExchange and](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/crambus-middle-east-government) [MrPerfectionManager backdoors, and related tools to](https://www.trendmicro.com/en_us/research/23/b/new-apt34-malware-targets-the-middle-east.html)\nharvest internal mailbox account credentials and then to leverage these accounts for exfiltration.\n\nWe attribute SC5k (v1-v3), ODAgent, OilCheck, and OilBooster downloaders to OilRig with a high level of confidence, based on\nthese indicators:\n\nTargets:\n\nThese downloaders were deployed exclusively against Israeli organizations, which aligns with typical OilRig targeting.\nThe observed verticals of the victims also align with OilRig’s interests – for example, we have seen OilRig previously\ntargeting the [Israeli healthcare sector, as well as the](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/) [local government sector in Israel.](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset-apt-activity-report-q2-2023-q3-2023.pdf)\n\n\n-----\n\nCode similarities:\n\nThe SC5k v2 and v3 downloaders evolved naturally from the initial version, which was previously used in an OilRig Outer\nSpace campaign. ODAgent, OilCheck and OilBooster share similar logic, and all use various cloud service providers for\n[their C&C communications, as do SC5k,](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/) [Marlin,](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf) [PowerExchange, and](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/crambus-middle-east-government) [MrPerfectionManager.](https://www.trendmicro.com/en_us/research/23/b/new-apt34-malware-targets-the-middle-east.html)\nWhile not unique to OilRig, these downloaders have a low level of sophistication and are often unnecessarily noisy on\n[the system, which is a practice we previously observed in its Out to Sea campaign.](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf)\n\n## Overview\n\nIn February 2022, we detected a new OilRig downloader, which we named ODAgent based on its filename: ODAgent.exe. ODAgent\nis a C#/.NET downloader that, similar to OilRig’s [Marlin backdoor, uses the Microsoft OneDrive API for C&C communications. Unlike](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf)\nMarlin, which supports a comprehensive list of backdoor commands, ODAgent’s narrow capabilities are limited to downloading and\nexecuting payloads, and to exfiltrating staged files.\n\nODAgent was detected in the network of a manufacturing company in Israel – interestingly, the same organization was previously\naffected by OilRig’s [SC5k downloader, and later by another new downloader, OilCheck, between April and June 2022. SC5k and](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/)\nOilCheck have similar capabilities to ODAgent, but use cloud-based email services for their C&C communications.\n\nThroughout 2022, we observed the same pattern being repeated on multiple occasions, with new downloaders being deployed in\nthe networks of previous OilRig targets: for example, between June and August 2022, we detected the OilBooster, SC5k v1, and\n[SC5k v2 downloaders and the Shark backdoor, all in the network of a local governmental organization in Israel. Later we detected](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf)\nyet another SC5k version (v3), in the network of an Israeli healthcare organization, also a previous OilRig victim.\n\nSC5k is a C#/.NET application whose purpose is to download and execute additional OilRig tools using the Office Exchange Web\nServices (EWS) API. The new versions introduced changes to make retrieval and analysis of the malicious payloads harder for\nanalysts (SC5k v2), and new exfiltration functionality (SC5k v3).\n\nAll the downloaders, summarized in Figure 1, share a similar logic but have different implementations and show growing complexity\nover time, alternating C#/.NET binaries with C/C++ applications, varying the cloud service providers misused for the C&C\ncommunication, and other specifics.\n\n_Figure 1. Timeline of OilRig’s downloaders_\n\nOilRig has only used these downloaders against a limited number of targets, all located in Israel and, according to ESET telemetry,\nall of them were persistently targeted months earlier by other OilRig tools. As it is common for organizations to access Office 365\nresources, OilRig’s cloud service-powered downloaders can thus blend more easily into the regular stream of network traffic –\napparently also the reason why the attackers chose to deploy these downloaders to a small group of especially interesting,\nrepeatedly victimized targets.\n\nAs of this writing, the following (exclusively Israeli, as noted above) organizations were affected:\n\na manufacturing company (SC5k v1, ODAgent, and OilCheck),\na local governmental organization (SC5k v1, OilBooster, and SC5k v2),\na healthcare organization (SC5k v3), and\nother unidentified organizations in Israel (SC5k v1).\n\n\n-----\n\nUnfortunately, we don t have information about the initial attack vector used to compromise the targets discussed in this blogpost\nwe can’t confirm whether the attackers have been able to successfully compromise the same organizations repeatedly, or if they\nsomehow managed to keep their foothold in the network in between deploying various tools.\n\n## Technical analysis\n\nIn this section, we provide a technical analysis of OilRig’s downloaders used throughout 2022, with the details of how they abuse\nvarious cloud storage services and cloud-based email providers for their C&C communications. All of these downloaders follow a\nsimilar logic:\n\nThey use a shared (email or cloud storage) account to exchange messages with the OilRig operators; the same account can\nbe used against multiple victims.\nThey access this account to download commands and additional payloads staged by the operators, and to upload command\noutput and staged files.\n\nIn our analysis, we focus on these characteristics of the downloaders:\n\nSpecifics of the network communication protocol (e.g., Microsoft Graph API vs. Microsoft Office EWS API).\nThe mechanism used to distinguish between different attacker-staged and downloader-uploaded messages in the shared\naccount, including the mechanism to distinguish between messages uploaded from various victims.\nSpecifics of how the downloaders process commands and payloads are downloaded from the shared account.\n\nTable 1 summarizes and compares how the individual downloaders implement these characteristics; we then analyze the first\n(SC5k) and the most complex (OilBooster) downloaders in detail as examples of tools abusing cloud-based email services and\ncloud storage services, respectively.\n\n_Table 1. A summary of main characteristics of OilRig’s downloaders abusing legitimate cloud service providers_\n\n**Mechanism** **SC5k v1** **SC5k v2** **SC5k v3** **OilCheck** **OilBooster** **ODAgent**\n\n\n**C&C**\n**protocol**\n\n**Network**\n**communica­-**\n**tions**\n\n**Victim**\n**identification**\n**mechanism**\n\n**Keep-alive**\n**message**\n\n\nA shared Microsoft Exchange email account, C&C communication\nembedded in draft messages.\n\nMicrosoft Office EWS API Microsoft\nGraph\n(Outlook)\nAPI\n\n\nThe sg\nextended\nproperty of\nthe email\ndraft is set\nto\n<victimID>.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 3; the\ncurrent\nGMT time\nis in the\nemail body.\n\n\nA file named\n<victimID>/setting.ini.\n\n\nAn\nunknown\nextended\nemail\nproperty is\nset to\n<victimID>.\n\nAn\nunknown\nextended\nproperty of\nthe email\ndraft is set\nto 0; the\nemail body\nis empty.\n\n\nFrom field has the\nusername portion of the\nemail address set to\n<victimID>.\n\nThe From field of the\nemail draft is set to\n<victimID>@yahoo.com;\nthe current GMT time is\nin the email body.\n\n\nThe zigorat\nextended\nproperty of\nthe email\ndraft is set\nto\n<victimID>.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 3; the\ncurrent\nGMT time\nis in the\nemail body.\n\n\nA shared OneDrive account; files with\nvarious extensions to distinguish action\ntypes.\n\nMicrosoft Graph (OneDrive) API.\n\nAll communication for, and from, the\nspecific victim is uploaded to a victimspecific subdirectory named <victimID>.\n\n\nA file named\n<victimID>/info.ini.\n\n\n-----\n\n**Mechanism** **SC5k v1** **SC5k v2** **SC5k v3** **OilCheck** **OilBooster** **ODAgent**\n\n\n**File for**\n**download**\n\n**Exfiltrated**\n**file**\n\n**Command**\n**for**\n**execution**\n\n**Command**\n**output**\n\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached\nfile has any\nextension\nother than\n.json.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 2; the\nattached\nfile has the\n.tmp1\nextension.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached\nfile has a\n.json\nextension.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 2; the\nattached\nfile has a\n.json\nextension.\n\n\nAn\nunknown\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached file\nhas any\nextension\nother than\n.bin.\n\nAn\nunknown\nextended\nproperty of\nthe email\ndraft is set\nto 2; the\nattached file\nhas a .tmp\nextension.\n\nAn\nunknown\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached file\nhas a .bin\nextension.\n\nAn\nunknown\nextended\nproperty of\nthe email\ndraft is set\nto 2; the\nattached file\nhas a .bin\nextension.\n\n\nThe From field of the\nemail draft is set to\n<victimID>@outlook.com,\nwith the message\ncategory set to file.\n\nThe From field of the\nemail draft is set to\n<victimID>@aol.com,\nwith the file category.\n\nThe From field of the\nemail draft is set to\n<victimID>@outlook.com,\n_without the file category._\n\nThe From field of the\nemail draft is set to\n<victimID>@aol.com,\nwith the text category.\n\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached\nfile has a\n.biz\nextension.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 2; the\nattached\nfile has a\n.biz\nextension.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 1; the\nattached\nfile has any\nextension\nother than\n.biz.\n\nThe type\nextended\nproperty of\nthe email\ndraft is set\nto 2.\n\n\nA file with a .docx\nextension in the\n<victimID>/items\nsubdirectory.\n\nA file with a .xlsx\nextension in the\n<victimID>/items\nsubdirectory.\n\nA file with a .doc\nextension in the\n<victimID>/items\nsubdirectory.\n\nA file with a .xls\nextension in the\n<victimID>/items\nsubdirectory.\n\n\nA non-JSON file\nin the\n<victimID>/o\nsubdirectory.\n\nA non-JSON file\nin the <victimID>/i\nsubdirectory.\n\nA JSON file in the\n<victimID>/o\nsubdirectory.\n\nA JSON file in the\n<victimID>/i\nsubdirectory.\n\n\n### SC5k downloader\n\nThe SampleCheck5000 (or SC5k) downloader is a C#/.NET application, and the first in a series of OilRig’s lightweight downloaders\n[that use legitimate cloud services for their C&C communication. We briefly documented the first variant in our recent blogpost, and](https://www.welivesecurity.com/en/eset-research/oilrigs-outer-space-juicy-mix-same-ol-rig-new-drill-pipes/)\nhave since discovered two newer variants.\n\nAll SC5k variants use the Microsoft Office EWS API to interact with a shared Exchange mail account, as a way to download\nadditional payloads and commands, and to upload data. Email drafts and their attachments are the primary vehicle for the C&C\ntraffic in all the versions of this downloader, but the later versions increase the complexity of this C&C protocol (SC5k v3) and add\ndetection evasion capabilities (SC5k v2). This section focuses on highlighting these differences.\n\n**Exchange account used for C&C communication**\n\nAt runtime, SC5k connects to a remote Exchange server via the EWS API to obtain additional payloads and commands to execute\nfrom an email account shared with the attacker (and usually other victims). By default, a Microsoft Office 365 Outlook account is\naccessed via the https://outlook.office365.com/EWS/Exchange.asmx URL using hardcoded credentials, but some SC5k versions\n\n\n-----\n\nalso have the capability to connect to other remote Exchange servers when a configuration file is present with a hardcoded name\n(setting.key, set.idl) and the corresponding credentials inside.\n\nWe have seen the following email addresses used by SC5k versions for C&C communication, the first of which gave the downloader\nits name:\n\nsamplecheck5000@outlook.com\nFrancesLPierce@outlook.com\nSandraRCharles@outlook.com\n\nIn SC5k v2, the default Microsoft Exchange URL, email address, and password are not included in the main module – instead, the\ndownloader’s code has been split into multiple modules. We have detected only variations of the main application, which logs into a\nremote Exchange server, iterates through emails in the Drafts directory, and extracts additional payloads from their attachments.\nHowever, this application depends on two external classes that were not present in the detected samples and are probably\nimplemented in the missing module(s):\n\nThe class init should provide an interface to obtain the email address, username, and password required to log into the remote\nExchange account, and other configuration values from the other module.\nThe class structure should implement functions used for encryption, compression, executing downloaded payloads, and other\nhelper functions.\n\nThese changes were likely introduced to make retrieval and analysis of the malicious payloads harder for analysts, as the two\nmissing classes are crucial for identifying the Exchange account used for malware distribution.\n\n**C&C and exfiltration protocol**\n\n[In all versions, the SC5k downloader repeatedly logs into a remote Exchange server using the ExchangeService .NET class in the](https://learn.microsoft.com/en-us/dotnet/api/microsoft.exchange.webservices.data.exchangeservice?view=exchange-ews-api)\n[Microsoft.Exchange.WebServices.Data namespace to interact with the EWS API. Once connected, SC5k reads email messages](https://docs.microsoft.com/en-us/dotnet/api/microsoft.exchange.webservices.data?view=exchange-ews-api)\nwith attachments in the Drafts directory to extract attacker commands and additional payloads. Conversely, in each connection,\nSC5k exfiltrates files from a local staging directory by creating new email drafts in the same email account. The path to the staging\ndirectory varies across samples.\n\nOf interest is the way both the operators and various instances of this downloader can distinguish between the different types of\ndrafts in the shared email account. For one, each email draft has a <victimID> incorporated, which allows the same Exchange\naccount to be used for multiple OilRig victims:\n\n[For v1 and v2, the downloader transmits the <victimID> as a custom attribute of the email draft via the SetExtendedProperty](https://learn.microsoft.com/en-us/dotnet/api/microsoft.exchange.webservices.data.item.setextendedproperty?view=exchange-ews-api)\nmethod.\nFor v3, the downloader incorporates the <victimID> into the From field of the email draft.\n\nThe <victimID> is typically generated using the compromised system’s information, such as the system volume ID or the computer\nname, as shown in Figure 2.\n\n_Figure 2. SC5k v3 calculates a <victimID> from the compromised computer’s name_\n\nFurthermore, various email properties can be used to distinguish between messages created by the operators (commands,\nadditional payloads) and messages created by the malware instances (command outputs, exfiltrated files). SC5k v1 and v2 use file\nextensions (of the draft attachments) to make that distinction, while SC5k v3 uses the From and MailItem.Categories fields of the\nemail draft to distinguish between various actions. At each point, the email drafts in the shared email account can serve various\npurposes, as summarized in Table 2 and explained below. Note that the email addresses used in the From field are not genuine;\nbecause SC5k never sends out any actual email messages, these attributes are only used to distinguish between different malicious\nactions.\n\n_Table 2. Types of email messages used by SC5k v3 for C&C communications_\n\n|From|MailItem.Categories|Created by|Details|\n|---|---|---|---|\n|<victimID>@yahoo.com|N/A|SC5k v3 instance|Created to register the victim with the C&C server, and renewed periodically to indicate that the malware is still active.|\n\n\n-----\n\n**From** **MailItem.Categories** **Created by** **Details**\n\n<victimID>@outlook.com file C&C server Attached file is decrypted, decompressed, and dumped on the\nvictim’s computer.\n\n<victimID>@outlook.com Other than file C&C server Attached command is decrypted, decompressed, then passed\nas an argument to a file already present on the compromised\nmachine, presumably a command interpreter.\n\n<victimID>@aol.com file SC5k v3 Created to exfiltrate a file from a staging directory.\ninstance\n\n<victimID>@aol.com text SC5k v3 Created to send command output to the C&C server.\ninstance\n\nMore specifically, SC5k v3 processes (and then deletes) those email messages from the shared Exchange account that have the\nFrom field set to <victimID>@outlook.com, and distinguishes between commands and additional payloads by the message category\n(MailItem.Categories):\n\nFor payloads, the attached file is XOR decrypted using the hardcoded key &5z, then gzip decompressed and dumped in the\nworking directory.\nFor shell commands, the draft attachment is base64 decoded, XOR decrypted, and then executed locally using cmd.exe or, in\nthe case of SC5k v3, using a custom command interpreter located under the name <baseDirectory>\\*Ext.dll. This file is then\nloaded via Assembly.LoadFrom, and its extend method invoked with the command passed as an argument.\n\nTo communicate with the attackers, SC5k v3 creates draft messages with a different From field: <victimID>@aol.com. Attached to\nthese messages are outputs of previously received commands, or contents of the local staging directory. Files are always gzip\ncompressed and XOR encrypted before being uploaded to the shared mailbox, while shell commands and command outputs are\nXOR encrypted and base64 encoded.\n\nFinally, SC5k v3 repeatedly creates a new draft on the shared Exchange account with the From field set to <victimID>@yahoo.com,\nto indicate to the attackers that this downloader instance is still active. This keep-alive message, whose construction is shown in\nFigure 3, has no attachment and is renewed with each connection to the remote Exchange server.\n\n_Figure 3. Keep-alive functionality implemented by the SC5k v3 downloader_\n\n### Other OilRig tools using email-based C&C protocol\n\nBesides SC5k, other notable OilRig tools have been discovered subsequently (in 2022 and 2023) that abuse APIs of legitimate\ncloud-based email services for exfiltration and both directions of their C&C communication.\n\nOilCheck, a C#/.NET downloader discovered in April 2022, also uses draft messages created in a shared email account for both\n[directions of the C&C communication. Unlike SC5k, OilCheck uses the REST-based Microsoft Graph API to access a shared](https://learn.microsoft.com/en-us/graph/use-the-api)\n[Microsoft Office 365 Outlook email account, not the SOAP-based Microsoft Office EWS API. While SC5k uses the built-in](https://learn.microsoft.com/en-us/exchange/client-developer/web-service-reference/ews-reference-for-exchange)\n[ExchangeService .NET class to create the API requests transparently, OilCheck builds the API requests manually. The main](https://learn.microsoft.com/en-us/dotnet/api/microsoft.exchange.webservices.data.exchangeservice?view=exchange-ews-api)\ncharacteristics of OilCheck are summarized in Table 1 above.\n\n[Earlier in 2023, two other OilRig backdoors were publicly documented: MrPerfectionManager (Trend Micro, February 2023) and](https://www.trendmicro.com/en_us/research/23/b/new-apt34-malware-targets-the-middle-east.html)\n[PowerExchange (Symantec, October 2023), both using email-based C&C protocols to exfiltrate data. A notable difference between](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/crambus-middle-east-government)\nthese tools and OilRig’s downloaders studied in this blogpost is that the former use the victimized organization’s Exchange server to\ntransmit email messages from and to the attacker’s email account. In contrast: with SC5k and OilCheck, both the malware and the\noperator accessed the same Exchange account and communicated by creating email drafts, never sending an actual message.\n\n|<victimID>@outlook.com|file|C&C server|Attached file is decrypted, decompressed, and dumped on the victim’s computer.|\n|---|---|---|---|\n|<victimID>@outlook.com|Other than file|C&C server|Attached command is decrypted, decompressed, then passed as an argument to a file already present on the compromised machine, presumably a command interpreter.|\n|<victimID>@aol.com|file|SC5k v3 instance|Created to exfiltrate a file from a staging directory.|\n|<victimID>@aol.com|text|SC5k v3 instance|Created to send command output to the C&C server.|\n\n\n-----\n\nIn any case, the new findings confirm the trend of OilRig shifting away from the previously used HTTP/DNS based protocols to using\nlegitimate cloud service providers as a way to hide its malicious communication and to mask the group’s network infrastructure,\nwhile still experimenting with various flavors of such alternative protocols.\n\n### OilBooster downloader\n\nOilBooster is a 64-bit portable executable (PE) written in Microsoft Visual C/C++ with statically linked OpenSSL and Boost libraries\n[(hence the name). Like OilCheck, it uses the Microsoft Graph API to connect to a Microsoft Office 365 account. Unlike OilCheck, it](https://learn.microsoft.com/en-us/graph/api/overview?view=graph-rest-1.0)\nuses this API to interact with a OneDrive (not Outlook) account controlled by the attackers for C&C communication and exfiltration.\nOilBooster can download files from the remote server, execute files and shell commands, and exfiltrate the results.\n\n**Overview**\n\nUpon execution, OilBooster hides its console window (via the ShowWindow API) and verifies that it was executed with a command\nline argument; otherwise it terminates immediately.\n\nOilBooster then builds a <victimID> by combining the compromised computer’s hostname and username: <hostname><username>. This identifier is later used in the C&C communication: OilBooster creates a specific subdirectory on the shared\nOneDrive account for each victim, which is then used to store backdoor commands and additional payloads (uploaded by the\noperators), command results, and exfiltrated data (uploaded by the malware). This way, the same OneDrive account can be shared\nby multiple victims.\n\nFigure 4 shows the structure of the shared OneDrive account and the local working directory, and summarizes the C&C protocol.\n\n_Figure 4. Overview of OilBooster’s C&C communication protocol using a shared OneDrive account_\n\nAs shown in Figure 4, the OilRig operator uploads backdoor commands and additional payloads to the victim-specific directory on\nOneDrive, as files with the .doc and .docx extensions, respectively. On the other end of the C&C protocol, OilBooster uploads\ncommand results and exfiltrated data as files with the .xls and .xlsx extensions, respectively. Note that these are not genuine\nMicrosoft Office files, but rather JSON files with XOR-encrypted and base64-encoded values.\n\nFigure 5 shows OilBooster spawning instances of two threads in an indefinite loop, sleeping for 153,123 milliseconds after each\niteration:\n\n\n-----\n\n_Figure 5. OilBooster’s main function_\n\nBoth threads interact with the shared OneDrive account:\n\n1. A downloader thread handles C&C communication and executes downloaded payloads.\n2. An exfiltration thread exfiltrates data from the local staging directory.\n\nThe downloader thread connects to the attacker-controlled OneDrive account and iterates through all files with the .doc and .docx\nextensions, which are then downloaded, decrypted, and parsed in order to extract and execute additional payloads on the\ncompromised host. A local subdirectory named items in the current working directory (where OilBooster is deployed) is used to store\nthe downloaded files. As shown in Figure 6, each connection attempt is handled in a separate thread instance, launched once every\n53,123 milliseconds.\n\nThe exfiltration thread iterates over another local subdirectory, named tempFiles, and exfiltrates its contents to the shared OneDrive\naccount, which are uploaded there as individual files with the .xlsx extension. The staging directory is cleared this way once every\n43,123 milliseconds in a separate thread instance, as also seen in Figure 6.\n\n_Figure 6. Each iteration of the downloader and exfiltration loops is spawned in a new thread_\n\n**Network communication**\n\nFor C&C communication and exfiltration, OilBooster uses the Microsoft Graph API to access the shared OneDrive account, using a\nvariety of HTTP GET, POST, PUT, and DELETE requests to the graph.microsoft.com host over the standard 443 port. For brevity,\nwe will also refer to these requests as OneDrive API requests. The encrypted communication is facilitated by the statically linked\n\n\n-----\n\nOpenSSL library, which handles the SSL communication.\n\n[To authenticate with the OneDrive account, OilBooster first obtains the OAuth2 access token from the Microsoft identity platform (the](https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-auth-code-flow)\nauthorization server) by sending a POST request with the following body over port 443 to\nlogin.microsoftonline.com/common/oauth2/v2.0/token, using hardcoded credentials:\n```\nclient_id=860b23a7-d484-481d-9fea-d3e6e129e249\n\n&redirect_uri=https://login.live.com/oauth20_desktop.srf\n\n&client_secret=<redacted>\n\n&refresh_token=<redacted>\n\n&grant_type=refresh_token\n\n```\nOilBooster obtains a new access token this way, which will be used in the Authorization header of the subsequent OneDrive API\nrequests, along with a new refresh token. OilBooster also has a backup channel to request a new refresh token from its C&C server\nafter 10 consecutive unsuccessful connections to the OneDrive server. As shown in Figure 7, the new token can be acquired by\nsending a simple HTTP GET request on port 80 to host1[.]com/rt.ovf (a legitimate, likely compromised website), which should be\nfollowed by the new refresh token in cleartext in the HTTP response.\n\n_Figure 7. OilBooster can request a new refresh token from its fallback C&C server after 10 unsuccessful_\n\n_connection attempts to the abused OneDrive account_\n\nThe various network connections made by OilBooster are summarized in Figure 8.\n\n_Figure 8. Overview of OilBooster’s network communications_\n\n### Downloader loop\n\n\n-----\n\n[In the downloader loop, OilBooster repeatedly connects to the shared OneDrive account to obtain a list of files with the .docx and](https://learn.microsoft.com/en-us/graph/api/driveitem-list-children)\n.doc extensions in the victim-specific subdirectory named <victimID>/items/ by sending an HTTP GET request over port 443 to this\nURL:\n\ngraph.microsoft.com/v1.0/me/drive/root:/<victimID>/items:/children?\n$filter=endsWith(name,'.doc')%20or%20endsWith(name,'.docx')&$select=id,name,file\n\nIf the connection is not successful (the HTTP_STATUS_DENIED response status) after 10 attempts, OilBooster connects to its\nfallback C&C server, host1[.]com/rt.ovf, to acquire a new refresh token, as discussed earlier.\n\nAlternatively, if the specified directory does not yet exist (HTTP_STATUS_NOT_FOUND), OilBooster first registers the victim on the\nshared OneDrive account by sending an HTTP POST request over port 443 to this URL:\ngraph.microsoft.com/v1.0/me/drive/items/root:/<victimID>:/children with the JSON string {\"name\": \"items\",\"folder\":{}} as the request\nbody, as shown in Figure 9. This request creates the whole directory structure <victimID>/items at the same time, which will later be\nused by the attackers to store commands and additional payloads disguised as .doc and .docx files.\n\n_Figure 9. On first connection, OilBooster creates a victim-specific directory on the shared OneDrive account_\n\nOn subsequent connections (with HTTP_STATUS_OK), OilBooster processes these files to extract and execute payloads.\nOilBooster first downloads each file from the OneDrive account and deletes it from OneDrive after processing the file.\n\nFinally, after going through all the .doc and .docx files downloaded from the OneDrive subdirectory, OilBooster records the last\nconnection timestamp (the current GMT time) by creating a new file named setting.ini in the victim’s OneDrive subdirectory, via an\nHTTP PUT request on port 443 made to this URL: graph.microsoft.com/v1.0/me/drive/root:/<victimID>/setting.ini:/content.\n\nProcessing .doc files\n\nFiles with the .doc extension downloaded from the shared OneDrive account are in fact JSON files with encrypted commands to be\nexecuted on the compromised host. Once a <filename>.doc is downloaded, OilBooster parses the values named s (part of the\ndecryption key) and c (encrypted command) from the file content. It first base64 decodes, then XOR decrypts the c value, using a\nkey that is created by appending the last two characters of the s value to the last two characters of <filename>.\n\nAfter decryption, OilBooster executes the command line in a new thread using the CreateProcessW API, and reads the command\nresult via an unnamed pipe connected to the process. OilBooster then uploads the command result to the shared OneDrive account\nas a new file named <filename>.xls by sending an HTTP PUT request over port 443 to\ngraph.microsoft.com/v1.0/me/drive/root:/<victimID>/items/<filename>.xls:/content.\n\nProcessing .docx files\n\n\n-----\n\nFiles with the .docx extension downloaded from the shared OneDrive account are in fact compressed and encrypted files named\n<filename>.<original extension>.docx that will be dropped and unpacked on the compromised system. OilBooster first downloads\nthe encrypted file to the local directory named <currentdir>\\items, using the original full filename.\n\nIn the next step, it reads and decrypts the file content using an XOR cipher with .<original extension> as the decryption key, and\ndrops it in the same directory into a file named <filename>.<original extension>.doc, while the first one is deleted. Finally, OilBooster\nreads and gzip decompresses the decrypted file, drops the result in the same directory as a file named <filename>.<original\nextension>, and deletes the other one.\n\nNote the unnecessary creation of several files in the process – this is typical for OilRig. We previously described the group’s noisy\n[operations on compromised hosts in its Out to Sea campaign.](https://web-assets.esetstatic.com/wls/en/papers/threat-reports/eset_threat_report_t32021.pdf)\n\n**Exfiltration loop**\n\nIn the exfiltration thread, OilBooster loops over the contents of the local directory named <currentdir>\\tempFiles, and uploads the file\ncontents to the victim’s folder on the shared OneDrive account. Each file is processed in this way:\n\nOilBooster gzip compresses the original file <filename>.<original extension> and writes the result to a file named <filename>.\n<original extension>.xlsx in the same directory.\nIt then encrypts the compressed file using an XOR cipher and .<original extension> as the key. If there is no file extension, 4cx\nis used as the default key.\n\nFinally, the encrypted file is uploaded to the OneDrive account, and the local file is deleted.\n\n**ODAgent downloader: OilBooster’s precursor**\n\nODAgent is a C#/.NET application that uses the Microsoft Graph API to access an attacker-controlled OneDrive account for C&C\ncommunication and exfiltration – in short, ODAgent is loosely a C#/.NET precursor of OilBooster. Similar to OilBooster, ODAgent\nrepeatedly connects to the shared OneDrive account and lists the contents of the victim-specific folder to obtain additional payloads\nand backdoor commands.\n\nAs shown in Figure 10, ODAgent then parses the metadata for each remote file. Subsequently, it uses the value of the mimeType\nkey associated with the file to distinguish between backdoor commands (formatted as JSON files) and encrypted payloads – this is\nunlike OilBooster, which uses file extensions for that distinction. After processing a file locally, ODAgent deletes the original from the\nremote OneDrive directory via the OneDrive API.\n\n\n-----\n\n_Figure 10. ODAgent’s code responsible for parsing JSON files obtained from the shared OneDrive account_\n\nIf the downloaded file is a JSON file, ODAgent parses the a1 (command ID), a2 (encrypted backdoor command) and a3 (secret)\narguments. It first derives the session key by XORing the provided secret with the hardcoded value 15a49w@]. Then, it base64\ndecodes and XOR decrypts the backdoor command using this session key. Table 3 lists all backdoor commands supported by\nODAgent.\n\n_Table 3. Backdoor commands supported by ODAgent_\n\n**Backdoor command** **Description**\n\nodt> Returns the path to the current working directory.\n\ndly><delaytime> Configures the number of seconds to wait after each connection to <delaytime>.\n\n<commandline> Executes the specified <commandline> via the native API and returns the command output.\n\nOther (non-JSON) files downloaded from the shared OneDrive account are files and additional payloads, both encrypted. ODAgent\nXOR decrypts these files with the hardcoded key 15a49w@], and drops them in the local <currentdir>\\o directory under the same\nfilename. If the original file has a .c extension, its content is also gzip decompressed (and the extension is then dropped from the\nfilename).\n\nAt the end of each connection, ODAgent uploads the contents of the local directory <currentdir>\\i to the <victimID>/i directory on the\nshared OneDrive account, preserving the original filenames with the added .c extension.\n\n|Backdoor command|Description|\n|---|---|\n|odt>|Returns the path to the current working directory.|\n|dly><delaytime>|Configures the number of seconds to wait after each connection to <delaytime>.|\n|<commandline>|Executes the specified <commandline> via the native API and returns the command output.|\n\n\n-----\n\n_Figure 11. ODAgent’s exfiltration loop_\n\n## Conclusion\n\nThroughout 2022, OilRig developed a series of new downloaders, all using a variety of legitimate cloud storage and cloud-based\nemail services as their C&C and exfiltration channels. These downloaders were deployed exclusively against targets in Israel – often\nagainst the same targets within a few months. As all of these targets were previously affected by other OilRig tools, we conclude\nthat OilRig uses this class of lightweight but effective downloaders as its tool of choice to maintain access to networks of interest.\n\nThese downloaders share similarities with MrPerfectionManager and PowerExchange backdoors, other recent additions to OilRig’s\ntoolset that use email-based C&C protocols – except that SC5k, OilBooster, ODAgent, and OilCheck use attacker-controlled cloud\nservice accounts, rather than the victim’s internal infrastructure. All these activities confirm an ongoing switch to legitimate cloud\nservice providers for C&C communication, as a way to hide the malicious communication and mask the group’s network\ninfrastructure.\n\nOn par with the rest of OilRig’s toolset, these downloaders are not particularly sophisticated, and are, again, unnecessarily noisy on\nthe system. However, the continuous development and testing of new variants, the experimenting with various cloud services and\ndifferent programming languages, and the dedication to re-compromise the same targets over and over again, makes OilRig a group\nto watch out for.\n\nFor any inquiries about our research published on WeLiveSecurity, please contact us at [threatintel@eset.com.](mailto:threatintel@eset.com?utm_source=welivesecurity.com&utm_medium=referral&utm_campaign=autotagging&utm_content=eset-research&utm_term=en)\n\nESET Research offers private APT intelligence reports and data feeds. For any inquiries about this service, visit the ESET\nThreat Intelligence page.\n\n## IoCs\n\n### Files\n\n|SHA-1|Filename|Detection|Description|\n|---|---|---|---|\n|0F164894DC7D8256B66D0EBAA7AFEDCF5462F881|CCLibrary.exe|MSIL/OilRig.A|OilRig downloader - SC5k v1.|\n|2236D4DCF68C65A822FF0A2AD48D4DF99761AD07|acrotray.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|35E0E78EC35B68D3EE1805EECEEA352C5FE62EB6|mscom.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|51B6EC5DE852025F63740826B8EDF1C8D22F9261|CCLibrary.exe|MSIL/OilRig.A|OilRig downloader - SC5k v1.|\n|6001A008A3D3A0C672E80960387F4B10C0A7BD9B|acrotray.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|7AD4DCDA1C65ACCC9EF1E168162DE7559D2FDF60|AdobeCE.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|BA439D2FC3298675F197C8B17B79F34485271498|AGSService.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|BE9B6ACA8A175DF61F2C75932E029F19789FD7E3|CCXProcess.exe|MSIL/OilRig.A|OilRig downloader - SC5k v1.|\n|C04F874430C261AABD413F27953D30303C382953|AdobeCE.exe|MSIL/OilRig.A|OilRig downloader - SC5k v1.|\n\n\n-----\n\n**SHA-1** **Filename** **Detection** **Description**\n\nC225E0B256EDB9A2EA919BACC62F29319DE6CB11 mscom.exe MSIL/OilRig.A\n\nE78830384FF14A58DF36303602BC9A2C0334A2A4 armsvc.exe MSIL/OilRig.D\n\nEA8C3E9F418DCF92412EB01FCDCDC81FDD591BF1 node.exe MSIL/OilRig.D\n\n1B2FEDD5F2A37A0152231AE4099A13C8D4B73C9E consoleapp.exe Win64/OilBooster.A\n\n3BF19AE7FB24FCE2509623E7E0D03B5A872456D4 owa.service.exe MSIL/OilRig.D\n\nAEF3140CD0EE6F49BFCC41F086B7051908B91BDD owa.service.exe MSIL/OilRig.D\n\nA56622A6EF926568D0BDD56FEDBFF14BD218AD37 owa.service.exe MSIL/OilRig.D\n\nAAE958960657C52B848A7377B170886A34F4AE99 LinkSync.exe MSIL/OilRig.F\n\n8D84D32DF5768B0D4D2AB8B1327C43F17F182001 AppLoader.exe MSIL/OilRig.M\n\nDDF0B7B509B240AAB6D4AB096284A21D9A3CB910 CheckUpdate.exe MSIL/OilRig.M\n\n7E498B3366F54E936CB0AF767BFC3D1F92D80687 ODAgent.exe MSIL/OilRig.B\n\nA97F4B4519947785F66285B546E13E52661A6E6F N/A MSIL/OilRig.N\n\n### Network\n\n**IP** **Domain** **Hosting** **First** **Details**\n**provider** **seen**\n\n188.114.96[.]2 host1[.]com Cloudflare, 2017-11- A legitimate, likely compromised website misused by OilRig as a\nInc. 30 fallback C&C server.\n\n## MITRE ATT&CK techniques\n\n[This table was built using version 14 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)\n\n|C225E0B256EDB9A2EA919BACC62F29319DE6CB11|mscom.exe|MSIL/OilRig.A|OilRig downloader - SC5k v1.|\n|---|---|---|---|\n|E78830384FF14A58DF36303602BC9A2C0334A2A4|armsvc.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|EA8C3E9F418DCF92412EB01FCDCDC81FDD591BF1|node.exe|MSIL/OilRig.D|OilRig downloader - SC5k v1.|\n|1B2FEDD5F2A37A0152231AE4099A13C8D4B73C9E|consoleapp.exe|Win64/OilBooster.A|OilRig downloader - OilBooster.|\n|3BF19AE7FB24FCE2509623E7E0D03B5A872456D4|owa.service.exe|MSIL/OilRig.D|OilRig downloader - SC5k v2.|\n|AEF3140CD0EE6F49BFCC41F086B7051908B91BDD|owa.service.exe|MSIL/OilRig.D|OilRig downloader - SC5k v2.|\n|A56622A6EF926568D0BDD56FEDBFF14BD218AD37|owa.service.exe|MSIL/OilRig.D|OilRig downloader - SC5k v2.|\n|AAE958960657C52B848A7377B170886A34F4AE99|LinkSync.exe|MSIL/OilRig.F|OilRig downloader - SC5k v3.|\n|8D84D32DF5768B0D4D2AB8B1327C43F17F182001|AppLoader.exe|MSIL/OilRig.M|OilRig downloader - OilCheck.|\n|DDF0B7B509B240AAB6D4AB096284A21D9A3CB910|CheckUpdate.exe|MSIL/OilRig.M|OilRig downloader - OilCheck.|\n|7E498B3366F54E936CB0AF767BFC3D1F92D80687|ODAgent.exe|MSIL/OilRig.B|OilRig downloader - ODAgent.|\n|A97F4B4519947785F66285B546E13E52661A6E6F|N/A|MSIL/OilRig.N|Help utility used by OilRig's OilCheck downloader - CmEx.|\n\n|IP|Domain|Hosting provider|First seen|Details|\n|---|---|---|---|---|\n|188.114.96[.]2|host1[.]com|Cloudflare, Inc.|2017-11- 30|A legitimate, likely compromised website misused by OilRig as a fallback C&C server.|\n\n|Tactic|ID|Name|Description|\n|---|---|---|---|\n||T1583.001|Acquire Infrastructure: Domains|OilRig has registered a domain for use in C&C communications.|\n||T1583.004|Acquire Infrastructure: Server|OilRig has acquired a server to be used as a backup channel for the OilBooster downloader.|\n||T1583.006|Acquire Infrastructure: Web Services|OilRig has set up Microsoft Office 365 OneDrive and Outlook accounts, and possibly other Exchange accounts for use in C&C communications.|\n\n\n[T1587.001](https://attack.mitre.org/versions/v14/techniques/T1587/001) Develop Capabilities:\nMalware\n\n\nOilRig has developed a variety of custom downloaders for use in its\noperations: SC5k versions, OilCheck, ODAgent, and OilBooster.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n|Col1|T1585.003|Establish Accounts: Cloud Accounts|OilRig operators have created new OneDrive accounts for use in their C&C communications.|\n|---|---|---|---|\n||T1585.002|Establish Accounts: Email Accounts|OilRig operators have registered new Outlook, and possibly other, email addresses for use in their C&C communications.|\n||T1608|Stage Capabilities|OilRig operators have staged malicious components and backdoor commands in legitimate Microsoft Office 365 OneDrive and Outlook, and other Microsoft Exchange accounts.|\n|Execution|T1059.003|Command and Scripting Interpreter: Windows Command Shell|SC5k v1 and v2 use cmd.exe to execute commands on the compromised host.|\n||T1106|Native API|OilBooster uses the CreateProcessW API functions for execution.|\n|Defense Evasion|T1140|Deobfuscate/Decode Files or Information|OilRig’s downloaders use string stacking to obfuscate embedded strings, and the XOR cipher to encrypt backdoor commands and payloads.|\n||T1480|Execution Guardrails|OilRig’s OilBooster requires an arbitrary command line argument to execute the malicious payload.|\n||T1564.003|Hide Artifacts: Hidden Window|Upon execution, OilBooster hides its console window.|\n||T1070.004|Indicator Removal: File Deletion|OilRig’s downloaders delete local files after a successful exfiltration, and delete files or email drafts from the remote cloud service account after these have been processed on the compromised system.|\n||T1202|Indirect Command Execution|SC5k v3 and OilCheck use custom command interpreters to execute files and commands on the compromised system.|\n||T1036.005|Masquerading: Match Legitimate Name or Location|OilBooster mimics legitimate paths.|\n||T1027|Obfuscated Files or Information|OilRig has used various methods to obfuscate strings and payloads embedded in its downloaders.|\n|Discovery|T1082|System Information Discovery|OilRig’s downloaders obtain the compromised computer name.|\n||T1033|System Owner/User Discovery|OilRig’s downloaders obtain the victim’s username.|\n|Collection|T1560.003|Archive Collected Data: Archive via Custom Method|OilRig’s downloaders gzip compress data before exfiltration.|\n||T1074.001|Data Staged: Local Data Staging|OilRig’s downloaders create central staging directories for use by other OilRig tools and commands.|\n\n\n**Command**\n**and Control**\n\n\n[T1132.001](https://attack.mitre.org/versions/v14/techniques/T1132/001) Data Encoding:\nStandard Encoding\n\n\nOilRig’s downloaders base64 decode data before sending it to the C&C\nserver.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n|Col1|T1573.001|Encrypted Channel: Symmetric Cryptography|OilRig’s downloaders use the XOR cipher to encrypt data in C&C communication.|\n|---|---|---|---|\n||T1008|Fallback Channels|OilBooster can use a secondary channel to obtain a new refresh token to access the shared OneDrive account.|\n||T1105|Ingress Tool Transfer|OilRig’s downloaders have the capability to download additional files from the C&C server for local execution.|\n||T1102.002|Web Service: Bidirectional Communication|OilRig’s downloaders use legitimate cloud service providers for C&C communication.|\n|Exfiltration|T1020|Automated Exfiltration|OilRig’s downloaders automatically exfiltrate staged files to the C&C server.|\n||T1041|Exfiltration Over C2 Channel|OilRig’s downloaders use their C&C channels for exfiltration.|\n||T1567.002|Exfiltration Over Web Service: Exfiltration to Cloud Storage|OilBooster and ODAgent exfiltrate data to shared OneDrive accounts.|\n||T1567|Exfiltration Over Web Service|SC5k and OilCheck exfiltrate data to shared Exchange and Outlook accounts.|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/hwalx6d0jzl86zfotki735i40j5a7fr0"
    ],
    "report_names": [
        "ESET_OilRig-cloud-service-powered-downloaders(12-14-2023)"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4632103e-8035-4a83-9ecb-c1e12e21288c",
            "created_at": "2022-10-25T16:07:23.542255Z",
            "updated_at": "2025-03-27T02:02:09.854487Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [],
            "source_name": "ETDA:DNSpionage",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "CACTUSPIPE",
                "DNSpionage",
                "DropperBackdoor",
                "Karkoff",
                "MailDropper",
                "OILYFACE"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cde987a8-c71f-49e2-b761-5b7fa2b4ada6",
            "created_at": "2022-10-25T16:07:23.706646Z",
            "updated_at": "2025-03-27T02:02:09.933918Z",
            "deleted_at": null,
            "main_name": "Hexane",
            "aliases": [
                "ATK 120",
                "Cobalt Lyceum",
                "Lyceum",
                "Operation Out to Sea",
                "Siamesekitten",
                "Yellow Dev 9"
            ],
            "source_name": "ETDA:Hexane",
            "tools": [
                "DanBot",
                "DanDrop",
                "Decrypt-RDCMan.ps1",
                "Get-LAPSP.ps1",
                "James",
                "Milan",
                "kl.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a7df240e-6750-4b71-99de-85831b92faa2",
            "created_at": "2022-10-25T15:50:23.859253Z",
            "updated_at": "2025-03-27T02:00:55.546377Z",
            "deleted_at": null,
            "main_name": "HEXANE",
            "aliases": [
                "Lyceum",
                "Siamesekitten",
                "Spirlin"
            ],
            "source_name": "MITRE:HEXANE",
            "tools": [
                "Milan",
                "netstat",
                "BITSAdmin",
                "DnsSystem",
                "DanBot",
                "ipconfig",
                "Mimikatz",
                "Kevin",
                "PoshC2"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8d76e350-dfb5-4733-800d-876de41f690d",
            "created_at": "2023-01-06T13:46:38.841887Z",
            "updated_at": "2025-03-27T02:00:02.932838Z",
            "deleted_at": null,
            "main_name": "DNSpionage",
            "aliases": [
                "COBALT EDGEWATER"
            ],
            "source_name": "MISPGALAXY:DNSpionage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "fb8f3a5f-01a9-498e-9396-52f844424c33",
            "created_at": "2023-01-06T13:46:39.045338Z",
            "updated_at": "2025-03-27T02:00:02.984648Z",
            "deleted_at": null,
            "main_name": "LYCEUM",
            "aliases": [
                "siamesekitten",
                "Chrono Kitten",
                "Storm-0133",
                "COBALT LYCEUM",
                "UNC1530",
                "Spirlin",
                "MYSTICDOME"
            ],
            "source_name": "MISPGALAXY:LYCEUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1702951487,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1702942188,
    "ts_modification_date": 1702942188,
    "files": {
        "pdf": "https://archive.orkl.eu/1c9fb3d84f4702a0ae479b9e8f5c61ed27547d74.pdf",
        "text": "https://archive.orkl.eu/1c9fb3d84f4702a0ae479b9e8f5c61ed27547d74.txt",
        "img": "https://archive.orkl.eu/1c9fb3d84f4702a0ae479b9e8f5c61ed27547d74.jpg"
    }
}