{
    "id": "ec3f023e-03ff-468b-bee6-b2e2d428ae33",
    "created_at": "2023-01-12T15:02:37.988576Z",
    "updated_at": "2025-03-27T02:05:55.122759Z",
    "deleted_at": null,
    "sha1_hash": "82cdd32f364e40d59e209fa0b389c2222aa1c183",
    "title": "2020-07-31 - The webshells powering Emotet",
    "authors": "",
    "file_creation_date": "2022-05-28T04:51:59Z",
    "file_modification_date": "2022-05-28T04:51:59Z",
    "file_size": 1673312,
    "plain_text": "# The webshells powering Emotet\n\n**[hornetsecurity.com/en/security-informationen-en/webshells-powering-emotet/](https://www.hornetsecurity.com/en/security-informationen-en/webshells-powering-emotet/)**\n\nSecurity Lab July 31, 2020\n\n## Summary\n\nThe Hornetsecurity Security Lab presents details on the webshells behind the Emotet\ndistribution operation, including insights into payload downloads and how from 2020-07-22 to\n2020-07-24 Emotet payloads on Emotet download URLs were replaced with HTML code\ndisplaying GIFs. The analysis shows that the number of downloads of the malicious content\nbehind the Emotet download URLs is significant and has been observed peaking at 50,000\ndownloads per hour. Highlighting that Emotet emails do get clicked. The analysis further\nshows that compromised websites are not just compromised once but multiple times by\ndifferent actors and cleanup efforts by the website administrators are often insufficient\nleading to re-enabling of the malicious Emotet downloads.\n\n## Background\n\nEmotet is one of the most prolific malspam actors. They distribute their malware via malspam\nemails with either a malicious document attachment containing VBA macros or download\nlinks to those malicious documents. These malicious documents will then download the\nEmotet loader from the Emotet download URLs. These downloads are hosted on\ncompromised websites To this end the actors behind Emotet use webshell malware on the\n\n\n-----\n\ncompromised websites. These webshells are used to place new payloads, either malicious\ndocuments distributed via malicious links in emails, or the Emotet loader, on the\ncompromised websites. Because compromised websites get blacklisted or the Emotet\nmalware gets cleaned the actors use up around 300 to 400 URLs a day.\n\n## Technical Analysis\n\nIn this analysis we take a look at the Emotet webshells.\n\n### S.A.P. webshell\n\nIf you have access to the filesystem of a website compromised by Emotet getting the\nwebshell used by Emotet is very simple. However, with a bit of luck, relying on\nmisconfigurations in the compromised websites, and relying on another actor in the webshell\nrealm, everyone Emotet webshell samples can be obtained without access to the\ncompromised webservers.\n\nFirst, the Emotet webshells reside in the directory one level below the directory containing\nthe Emotet download, i.e., either an Emotet maldoc, or the Emotet loader executable\ndownload. So if the Emotet download URL is `https://www.example.com/wp-`\n```\nincludes/LYnUiE/, the webshell will usually reside in https://www.example.com/wpincludes/ . However, we also have seen webshells in other directories. Next, we can hope\n\n```\nfor misconfigurations in the compromised websites and hope the directory containing the\nwebshell is an open directory, i.e., it will list the directory contents as in the following\nexample:\n\nIn this example, `import.php is the Emotet webshell and` `lpyc42 is the directory that will`\ndeliver the Emotet payload. Known filenames of Emotet webshells are `user.php,`\n```\ncommon.php, import.php, update.php, link.php, license.php, menu.php,\nimage.php, options.php, tools.php, core.php, edit.php, functions.php,\nconfig.php, and wp-list.php .\n\n```\n\n-----\n\nObviously, access to the webshell is protected, i.e., when requesting the `import.php file,`\nthe PHP code is executed by the webserver and only its output is served. However, on some\nservers we observed PHP files that had been renamed by adding an additional\n```\n.suspected extension to the file.\n\n```\nThis renaming was actually most likely done by a different malware named Vigilante Malware\nCleaner. Information about Vigilante Malware Cleaner was first discovered and documented\nby Bruce Ediger in 2019 [VigilanteMalwareCleaner]. Existence of this renaming dates back to\nat least 2015. The Vigilante Malware Cleaner malware seems to compromise already\ncompromised websites, then searches existing PHP files for suspected malware, and\ndisabling suspected malicious PHP scripts by appending `.suspected to their filenames`\nand thus excluding the files from the list of files the server will execute as PHP code. This will\ncause the server to serve the file contents, i.e., the PHP source code of the webshell, directly\ninstead. Using this we can download the PHP code of the Emotet webshell. Before being\nable to access the webshell the code queries a parameter `f_pp, which is used to decode`\nthe webshell:\n\n\n-----\n\nThis `f_pp parameter functions as a password to the webshell. Via OSINT research we`\nfound that the encoded webshell is identical to one found and decoded by another\nresearcher in January [EmotetWebshellSamples].\n\nTo illustrate to the reader what someone logging into the this webshell with the correct `f_pp`\nparameter would see, we ran the decoded PHP code on a test system:\n\n\n-----\n\nThe webshell identifies itself as S.A.P. webshell with version v.2.1. The webshell allows an\nattacker to search, upload, and download files. It allows to execute arbitrary commands. It\nfurther offers convenient tools to dump SQL databases from the server, perform network\nscans, and/or brute force passwords.\n\nThe fact that the decoding processes relies on the `f_pp parameter as password and we`\nfound multiple instances of the identical encoded webshell code dating back to January\nstrongly suggests that Emotet reuses passwords for their webshells.\n\n### GIF hijacking\n\nEven though we do not have logs or other forensic artifacts of the systems in question, we,\nbased on our previous outlined findings, agree with the opinion stated by other researchers\nthat the recent incident in which Emotet downloads were replaced with HTML code\ndisplaying GIFs is a result of insufficient security of the Emotet webshells. This hypothesis is\nsupported by the fact that Emotet seems to have changed their webshell on 2020-07-27 and\nthe GIF hijacks stopped. But indications of new GIF hijackings emerged on 2020-07-31. This\ncould be the time it took the GIF replacement actor to figure out the new password. However,\nnew GIF hijackings are not wide spread, which could indicate whatever Emotet is doing to\ndefend itself against the GIF hijackings is working. The used GIFs can be interpreted as a\nstatement towards the actors behind Emotet that the actors behind the GIF replacements are\nstill watching and determined to continue the disruption of the Emotet operation:\n\n\n-----\n\nOn later Emotet compromised websites we also multiple times found variations of the\nfollowing webshell:\n\n\n-----\n\nWe are, however, not certain this is the new Emotet webshell, but would like to point out that\nthe webshell realm is a very crowded space, e.g. we observed one webserver that had two\nGIF hijackings, two (presumably) by Vigilante Malware Cleaner to `.suspected renamed`\nwebshells, as well as, as a new active Emotet download – in just one directory (other parts\nof the server contained even more webshells):\n\nThis means the website was not once, or twice, but at least three times used as a download\nfor Emotet (2020-07-23 and 2020-07-28). The website would likely still server Emotet\npayloads but luckily its bandwidth limit was exceeded.\n\n\n-----\n\nSo there is a possibility that the actors placing the GIFs are gaining access via a vulnerability\nof the website itself, or are even affiliated with the Vigilante Malware Cleaner malware. But\nwe are a email security provider and hence do not have enough visibility into the website\ncompromise landscape to make any definit statements.\n\n### Download statistics\n\nTalking about download quotas, there is a way to externally monitor Emotet payload\ndownload statistics. Emotet uses a PHP script to collect download statistics grouped by\noperating systems given in the downloader’s User-Agent string. These statistics are\ndelivered as an JSON object in a subdirectory of the Emotet payload download directory\nnamed as `$path, '/.' . sha1(basename($path)) :`\n\nSo the statistics for `https://www.example.com/wp-includes/LYnUiE/ could be queried`\nfrom `https://www.example.com/wp-`\n```\nincludes/LYnUiE/.a2dd7d055bb668528c29e16f789755fb3aae277b .\n\n```\n[Going again by previously shared Emotet webshell code [EmotetWebshellSamples] the](https://github.com/NavyTitanium/Misc-Malwares/tree/master/Emotet)\nnumbers correspond to Windows ( 4 ), Linux ( 3 ), Apple ( 2 ), Android ( 1 ) and unknown\n( 0 ) operating systems found in the downloader’s User-Agent string:\n\n\n-----\n\nWe proceeded to scrape these statistics. The counters are reset every time the Emotet Tier 2\nservers push updated maldocs and loader executables to the compromised websites via the\nwebshells. Hence, when a new count was higher than a previous count, we took the\ndifference as the number of downloads happening between scrapes. But in case the count is\nlower then a previous count, we assume the count was reset and take the new count as\nnumber of downloads since our last scrape. This way we also nullify stuck download\nstatistics, i.e., download statistics that do not get reset anymore. We scraped with a\nfrequency of 1 minute. Emotet updated the documents with a frequency of around 10\nminutes. Because Emotet targets the Windows operating system we only consider the\ndownload statistics for the Windows operating system. For 12 hours of 2020-07-29 the\nobtained statistics of 739 Emotet download URLs (533 of which registered active downloads\nin the presented time frame) can be visualized as follows:\n\nThis is a stacked plot, i.e., each URLs download number is plotted individually but their total\nshows the cumulative number of all download URLs. Each different color represents a\ndifferent Emotet download URL. These figures obviously include downloads by security\nresearchers and automated security systems such as sandboxes. We also miss any\ndownloads that happen between one of our scraping runs and Emotet resetting the\n\n\n-----\n\ndownload counter. However, the figures still give an interesting insight into Emotet\ndownloads and hence the click rate of Emotet. In our observation the cumulative number of\nEmotet downloads peaked at 50,000 downloads per hour.\n\nSeparating the download URLs by their served payloads (based on MIME type analysis) we\ncan see that most downloads are for the Emotet maldoc. The Emotet loader is downloaded\nfar less often:\n\nIf we plot the download numbers according to time after the URL was first observed we see\nthat each URL’s download numbers peak within the first hour the URL was first observed. At\nthat time each observed Emotet URL got around 200 downloads per hour. However, URLs\nkeep getting downloads even 12 hours after the URL was first observed. Hence, every\ndownload URL blocked or taken down is potentially one Emotet victim less, even if the\nblocking or take down happens 12 hours too late.\n\nThe following line plot illustrates individual URL download performance:\n\n\n-----\n\nStacking download figures for URLs the falloff trend can clearly be observed. After 9 hours\nthe number of downloads drops to 1/3 of the downloads observed right after the URL was\nnewly observed:\n\n\n-----\n\nWe think a proportion of the initial peak can be attributed to automated security systems\nscanning the Emotet malspam and thus downloading the Emotet maldocs from the Emotet\ndownload URLs. This is confirmed by again separating the data in URLs serving the Emotet\nmaldocs and URLs serving the Emotet loader:\n\n\n-----\n\nThe number of downloads of the Emotet loader has a slower rise to the peak then the\ndownloads of the Emotet maldoc, supporting our hypothesis. Further, there is no steep falloff\nin Emotet loader downloads.\n\nOn average the Emotet loader was downloaded at a rate of around 1500 per hour, while the\nEmotet maldocs were downloaded at a rate of around 7500 per hour.\n\n### Failed cleanup attempts\n\nDuring monitoring the Emotet download URLs more closely we also witnessed failed cleanup\nattempts multiple times. Often site administrators delete the directory containing the Emotet\ndownload. However, they miss cleaning all the webshells. The actors behind Emotet then\nsimply regenerate the deleted files with their next payload update. We also observed Emotet\nusing a previous compromised website again.\n\n### Other observed mistakes\n\nBeing such a large operation it is inevitable that the actors behind Emotet make mistakes.\nWhile allowing another actor to hijack their payload downloads is one mistake, other\nmistakes include (but are not limited to) messing up the replacement regular expression, so\n\n\n-----\n\nwe could observe download URLs delivering Emotet maldocs with broken filenames, such as\n```\nInvJP0732{:REGEX:.doc, INVOICE-Q84{:REGEX:.doc, invoiceUBO7631{:REGEX:.doc, etc. We are certain the {:REGEX: part should be {:REGEX:[0-9]\n{3,6} (or something like that), a special syntax used by the Emotet generation processes to\n\n```\nexpand the filename base on a random but character restrained pattern. These `{:REGEX:`\n```\n[...] patterns have also previously leaked in attachment filenames and are part of Emotets\n\n```\nautomation process. Please note that depending on your Browser the `: in the filenames`\nmay be replaced with `_ because` `: is not a valid character on the Windows operating`\nsystem. Monitoring the Emotet operation very closely reveals a lot of such mistakes overtime\nand the insights gained can be used to strengthen our own defenses against Emotet.\n\n## Conclusion and Countermeasure\n\nAs this analysis by the Hornetsecurity Security Lab shows Emotet is not just sent in large\nvolume but its malicious content is also downloaded in significant large numbers.\n\nOn the network you should block known Emotet URLs. In case browsing to random websites\nis not an activity necessary to fulfill your business, you can block the domains and not just\nthe specific URLs. This provides better protection because, as has been shown, Emotet and\npotentially other actors can misuse the compromised website again, either by regaining\naccess via left behind webshells, or by reinfecting the website via the initial access vector,\ne.g., a WordPress vulnerability or weak password. The block should be kept even if the\nEmotet download is gone, as the site may still be compromised. It is highly likely that you will\nnever actually need to visit any of these websites at all, thus keeping the websites blocked\nshouldn’t cause negativ effects.\n\nHornetsecurity’s [Spam Filtering Service, with the highest detection rates on the market,](https://www.hornetsecurity.com/en/services/spam-filter/)\nalready detects and blocks Emotet emails based on known indicators. Hornetsecurity’s\n[Advanced Threat Protection extends this protection by also detecting yet unknown threats.](https://www.hornetsecurity.com/en/services/advanced-threat-protection/)\n\n## References\n\n[EmotetWebshellSamples] https://github.com/NavyTitanium/MiscMalwares/tree/master/Emotet\n\n[VigilanteMalwareCleaner] https://github.com/bediger4000/php-malwareanalysis/tree/master/vigilante_suspected\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-31 - The webshells powering Emotet.pdf"
    ],
    "report_names": [
        "2020-07-31 - The webshells powering Emotet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535757,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1653713519,
    "ts_modification_date": 1653713519,
    "files": {
        "pdf": "https://archive.orkl.eu/82cdd32f364e40d59e209fa0b389c2222aa1c183.pdf",
        "text": "https://archive.orkl.eu/82cdd32f364e40d59e209fa0b389c2222aa1c183.txt",
        "img": "https://archive.orkl.eu/82cdd32f364e40d59e209fa0b389c2222aa1c183.jpg"
    }
}