{
    "id": "ec571958-c24d-4554-9276-0e49ba13eced",
    "created_at": "2023-01-12T15:10:49.365516Z",
    "updated_at": "2025-03-27T02:11:24.399799Z",
    "deleted_at": null,
    "sha1_hash": "e8bc35278c0c3e7dec11634ee7328a7f320bf779",
    "title": "2021-04-07 - Sowing Discord- Reaping the benefits of collaboration app abuse",
    "authors": "",
    "file_creation_date": "2022-05-27T21:32:07Z",
    "file_modification_date": "2022-05-27T21:32:07Z",
    "file_size": 1995463,
    "plain_text": "# Sowing Discord: Reaping the benefits of collaboration app abuse\n\n**[blog.talosintelligence.com/2021/04/collab-app-abuse.html](https://blog.talosintelligence.com/2021/04/collab-app-abuse.html)**\n\nAs telework has become the norm throughout the COVID-19 pandemic, attackers are\nmodifying their tactics to take advantage of the changes to employee workflows.\nAttackers are leveraging collaboration platforms, such as Discord and Slack, to stay\nunder the radar and evade organizational defenses.\n\n\n-----\n\nCollaboration platforms enable adversaries to conduct campaigns using legitimate\ninfrastructure that may not be blocked in many network environments.\nRATs, information stealers, internet-of-things malware and other threats are leveraging\ncollaboration platforms for delivery, component retrieval and command and control\ncommunications.\n\n## Executive summary\n\nAbuse of collaboration applications is not a new phenomenon and dates back to the early\ndays of the internet. As new platforms and applications gain in popularity, attackers often\ndevelop ways to use them to achieve their mission objectives. Communications platforms\nlike Telegram, Signal, WhatsApp and others have been abused over the past several years\nto spread malware, used for command and control communications, and otherwise\nleveraged for nefarious purposes.\n\nAs the COVID-19 pandemic spread across the globe in 2020, organizations made significant\nchanges to their work routines across virtually every industry. One major shift was the move\nto remote working arrangements which coincided with increased reliance on new interactive\n[communications platforms like Discord and](https://discord.com/) [Slack. While both of these platforms have existed](https://slack.com/)\nfor some time, recent changes to employee workflows have led to an increased reliance\nupon them for conducting business. In many cases, these platforms provide rich\nenvironments that can be used for communication and collaboration professionally and\npersonally. As the pandemic continued, we observed several threat actors changing their\ntactics, techniques and procedures to compensate for these new enterprise workflows. We\npreviously described how many threat actors began taking advantage of public interest in\n[COVID-19 related information here and](https://blog.talosintelligence.com/2020/02/coronavirus-themed-malware.html) [here. Over the past year, we have also observed a](https://blog.talosintelligence.com/2020/03/covid-19-pandemic-threats.html)\nsignificant increase in the abuse of many of these collaboration platforms to facilitate\nmalware attacks against various organizations. Attackers are looking to spread ransomware\nvia these rooms and use the platforms to spread traditional malspam lures used to infect\nvictims.\n\n## Collaboration platforms for malware distribution\n\nAttackers are increasingly abusing the communications platforms that many organizations\nuse to facilitate employee communications. This allows them to circumvent perimeter\nsecurity controls and maximize infection capabilities. Over the past year, adversaries are\nincreasingly relying on these platforms as part of the infection process. In this blog, we will\ndescribe how these platforms are being used across three major phases of malware attacks:\n\nDelivery\n\n\n-----\n\nComponent retrieval\nC2 and data exfiltration\n\nThese platforms provide an attractive option for hosting malicious content, exfiltrating\nsensitive information, and otherwise facilitating malicious attacks. In many cases, these\nplatforms may be required for legitimate corporate activity and, as such, hosting malicious\ncontents or using them to collect sensitive information may allow attackers to bypass content\nfiltering mechanisms.\n\nThe use of applications like Discord and Slack may also provide an additional means to\nperform the social engineering required to convince potential victims to open malicious\nattachments. Potential targets who see a link in a chat room they're used to interacting in on\na regular basis may be more likely to open any files that are attached to those rooms or click\non links that seem like they're from colleagues. These rooms may also provide a direct\ncommunications pathway between adversaries and employees that can be abused to\nfacilitate the delivery process. This itself is not a new phenomena — Discord's been used in\nthe past to [deliver the Thanatos ransomware. More recently, this mechanism has been used](https://blog.talosintelligence.com/2018/06/ThanatosDecryptor.html)\nto deliver a variety of RATs, stealers and other malware including:\nLet's look at ways these platforms are now being used throughout the attack lifecycle.\n\n## Malware delivery\n\nSome of these apps, including Discord, support file attachments, which makes them a target\nfor adversaries. And if these apps are being used in a corporate environment, they become\nmore attractive to adversaries. One of the key challenges associated with malware delivery\nis making sure that the files, domains, or systems don't get taken down or blocked. By\nleveraging these chat applications that are likely allowed, they are removing several of those\nhurdles and greatly increase the likelihood that the attachment reaches the end user. Since\nthese files are uploaded and linked via a URL, there are a lot of different ways they can get\nthese links in front of users. These can include more traditional means like URLs in emails,\nbut they can be sent via any messaging or chat service. They could also link to websites or\nbe placed in any number of places. The versatility of having a malicious URL that is hosted\non a domain unlikely to get blocked is obviously attractive to malicious actors.\n\nOn many collaboration platforms such as Discord and Slack, files are transmitted between\nusers by attaching them in channels. Files are stored within the Content Delivery Network\n(CDN) that the platform provider operates, allowing server members to access these files as\nthey appeared when they were originally attached. As an example, this is what it looks like\nwhen a file is uploaded directly to a channel in a Discord server:\n\n\n-----\n\nWhen files are uploaded and stored within the Discord CDN, they can be accessed using the\nhardcoded CDN URL by any system, regardless of whether Discord has been installed,\nsimply by browsing to the CDN URL where the content is hosted.\n\nThis functionality is not specific to Discord. Other collaboration platforms like Slack have\nsimilar features. Files can be uploaded to Slack, and users can create external links that\nallow the files to be accessed, regardless of whether the recipient even has Slack installed.\n\n\n-----\n\nOnce an external link has been created, the file is now accessible in much the same way as\nfiles uploaded to Discord.\n\nAdversaries have begun taking advantage of this functionality, using it to host their malicious\ncontent and then directing victims to the content using the CDN location within various\nformats like malspam emails. Over the course of 2020, we observed an increase in the\nvolume of malicious email campaigns containing links to files hosted across these CDNs.\nThe graph below shows the volume of emails observed using this technique to facilitate the\ndelivery of various files used to initiate malware infections on victim systems.\n\n\n-----\n\nThe delivery of malicious content in this manner offers two attractive mechanisms that\nattackers can leverage to evade defenses.\n\n1. The content is delivered over HTTPS, meaning that the communications are encrypted\n\nbetween the endpoint accessing the content and the Discord CDN delivering it.\n2. A natural byproduct of the compression process is obfuscation of the contents of the\n\ncompressed archive.\n\nIt is easy to see why this is an attractive mechanism to adversaries. A variety of different file\ntypes have been observed being delivered in this manner. In most cases, these files are\ncompressed archives. Over the past 12 months, we have observed a variety of compression\nalgorithms used, including uncommon formats such as LZH. Below is a list of several of the\nmost common compression types we have observed leveraged across these campaigns.\n\nACE\nGZ\nIMG\nISO\nLZH\nRAR\nTAR\nZIP\n7Z\n\nThe graph below shows a breakdown of how frequently each type of compression was used\nthroughout these malspam campaigns.\n\n\n-----\n\nIn most cases, the emails themselves are consistent with what we have grown accustomed\nto seeing from malspam in recent years. Many of the emails purport to be associated with\nvarious financial transactions and contain links to files claiming to be invoices, purchase\norders and other documents of interest to potential victims.\n\nThe message above was one of the stranger examples we found. It was a COVID-themed\nemail purportedly from the World Health Organization (WHO) requesting the target download\na new COVID prevention document. This document was hosted on Discord for some reason.\nWhen we followed the link, we found a ZIP file containing a batch, or .bat, file. This batch file\nthen downloaded a word document from Google Drive. When opened, the document\ntriggered a macro that activated on close that went out and downloaded the Nymaim trojan\nfrom a compromised website. This is an incredibly convoluted infection process that involved\nmultiple services, including Discord and Google Drive, but also required the victim to open\nmultiple files before the final infection occurred.\n\n\n-----\n\nOne additional thing to note is the wide variety of languages we found when looking at the\nemail messages leveraging Discord, including English, Spanish, French, German and\nPortuguese. One example of the German language campaigns we saw is shown below.\n\nIn this example, the sender offers a 30 percent deposit in the attachment. However, the\nattachment is actually an image made to look like an attachment. The message source\nprovides some additional insight into what the adversary wants to accomplish.\n\nThe bolded text shows that the image is actually a link to an ISO file being hosted on\nDiscord. When the user clicks the image thinking they are opening it locally, it will be\ndownloaded using a web browser. The ISO file, when downloaded, contained a PE32\npayload named \"30 Percento,pdf .exe\", which resulted in the download of the Formbook\nmalware. What is additionally confusing, and potentially lazy on the actor's part, is the\nfilename itself. The email is in German but the attachment uses the Italian word \"percento\"\nand not \"prozent,\" to mean \"percent,\" as would be expected if the file were named in\nGerman. These are just a few of the many examples we found abusing Discord, most of\nwhich were the usual invoice, shipping and fax campaigns we observe constantly.\n\n\n-----\n\nAs previously mentioned, the hyperlinks present within these emails typically point to\ncompressed archives hosted within the CDNs of various collaboration platforms like Discord\nand Slack. These compressed archives contain PE32 files, JavaScript droppers and other\nmalicious components that are used to initiate the infection process, retrieve additional\npayloads, provide remote access capabilities for adversaries, and gather sensitive\ninformation that can be exfiltrated and subsequently monetized by adversaries.\n\n## Component retrieval\n\nWe also observed adversaries leveraging CDNs for the retrieval of additional malicious\ncontent during and after the initial infection process occurs. In many malware infections\nnowadays, the initial executable or script delivered to victims is the first part of a multi-stage\ninfection process that often includes the delivery of additional binaries that function as\nmodules to carry out various portions of the malware's overall functionality.\n\nWe observed several instances of these CDNs being used to host malicious binaries that are\npulled down during various phases of the infection process. Various examples of this\nbehavior can be identified across malware repositories. For example, simply searching for\nsamples that reach out to the Discord CDN results in almost 20,000 results in VirusTotal.\n\nThis technique was frequently used across malware distribution campaigns associated with\nRATs, stealers and other types of malware typically used to retrieve sensitive information\nfrom infected systems. In one example, the first stage payload was responsible for retrieving\nan ASCII blob from the Discord CDN as shown in the screenshot below.\n\nThe data that is retrieved from the Discord CDN is then converted and the final payload is\ninjected into a remote process, in this case created from \"C:\\Program Files (x86)\\Internet\nExplorer\\ieinstal.exe\".\n\n\n-----\n\n[The final malware in this instance was Remcos, a commercially available RAT that is](https://blog.talosintelligence.com/2018/08/picking-apart-remcos.html)\nfrequently used by attackers to gain unauthorized access to systems.\n\nAs is common with Remcos infections, the malware communicated with a C2 and exfiltrated\ndata via an attacker-controlled DDNS server. The attackers achieved persistence through the\ncreation of registry run entries to invoke the malware following system restarts.\n\n[Another example of this behavior was observed across AsyncRAT campaigns. In this](https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat)\ninstance, the initial malware downloader took the form of a Microsoft Word document titled\n[\"Word_Nitro_Kodlari\", likely purporting to be associated with Discord Nitro codes — access](https://discord.com/nitro)\nto a premium version of the service — a common theme across the various malware\ncampaigns we analyzed. In this case, the Word document did not contain any visible\ncontents when opened, but contained embedded macros.\n\n\n-----\n\nThe Word document contains a macro that executes when the document is opened. This\nmacro is shown below.\n\nThis macro deobfuscates and executes PowerShell that is responsible for retrieving the next\nstage payload.\n\nIn this case, the payload was AsyncRAT hosted within the Discord CDN. An example of the\npayload retrieval can be found in the screenshot below:\n\n\n-----\n\nAnother way that we've seen Discord abused is payloads being retrieved from threat actors\nleveraging active exploitation of vulnerabilities. One of the larger botnets that is active today\nis Mirai, which is constructed primarily of internet-of-things (IoT) devices that overwhelmingly\nrun Linux. This botnet is well known and has been associated with a variety of DDoS and\nother campaigns. Mirai may be the most well known, but they are not the only botnet or\n[threat operating in this space, including Qbot. This IoT variant of Qbot behaves much like](https://www.alibabacloud.com/blog/the-qakbot-family-extends-introducing-a-new-qbot-variant_594191)\nother IoT malicious threats providing capabilities to conduct DDoS attacks, download\nadditional payloads, or be used as processing power for things like SSH brute forcing.\n\nWe recently saw an uptick in what appeared to be Mirai activity, but upon further inspection,\nit was actually the IoT-focused QBot variant that affects multiple operating systems. The\npiece that drew our attention was where the x86 version was being stored.\n\nThese types of commands should look familiar to anyone who has been hunting Mirai activity\nand is consistent with the other campaigns we've seen before that have been taking\nadvantage of an unauthenticated command execution vulnerability in YARN. What makes\nthis applicable to our current investigation is yet another abuse of Discord to share or\ndistribute malware, in this case the x86 version of Qbot. This shows yet another avenue\n\n\n-----\n\nadversaries can take advantage of Discord to distribute malware, even to non-standard\noperating systems like Linux, and more specifically, IoT devices.\n\n## C2 and data exfiltration\n\nDiscord and Slack are also platforms that are being leveraged for the exfiltration of sensitive\ninformation and the transmission of information from infected systems. In many cases, this\nactivity is conducted via the Discord API which provides a robust mechanism that\nadversaries can take advantage of. Let's take a look at how the Discord API is being used by\nattackers and some examples of what sort of malware is using it.\n\n### Webhooks\n\nMalware samples that abuse Discord typically rely on the webhook functionality of the\n[Discord API for C2 communications. Webhooks were designed for sending alerts or](https://support.discord.com/hc/en-us/articles/228383668-Intro-to-Webhooks)\nautomated messages to a specified Discord server, commonly integrated with other services\nsuch as GitHub or DataDog. Webhooks are essentially a URL that a client can send a\nmessage to, which in turn posts that message to the specified channel — all without using\nthe actual Discord application.\n\nWebhooks can be used for more than just C2 communications. However, any data can be\nsent to a webhook, allowing for data exfiltration. Using the webhook functionality to exfiltrate\ndata has several benefits, the most apparent being ease of use. The other important\nadvantage to webhooks is the use of the Discord domain for exfiltration over HTTPS,\nallowing the attacker to blend in with other Discord network traffic. The format of a webhook\nwould appear fairly innocuous to most users:\n\nThe versatility and accessibility of Discord webhooks makes them a clear choice for some\nthreat actors. With merely a few stolen access tokens, an attacker can employ a truly\neffective malware campaign infrastructure with very little effort. The level of anonymity is too\ntempting for some threat actors to pass up.\n\n### Status updates\n\nIn some cases, we observed malware leveraging Discord to send alerts to the attacker when\nnew systems are infected. In one example, the malware was communicating via Discord to\nalert the attacker that a new system was available and providing the details where the\nsystem was attempting to communicate to establish a C2 channel. In this case, the\nadversaries used the Portmap service for C2 communications. As highlighted in previous\n\n\n-----\n\n[publications here and](https://blog.talosintelligence.com/2019/08/rat-ratatouille-revrat-orcus.html) [here, Portmap is a common mechanism used by attackers to](https://blog.talosintelligence.com/2020/09/lodarat-update-alive-and-well.html)\nobfuscate their C2 infrastructure.\n\n### System enumeration\n\nIn many cases, malware uses the Discord API to send information about the infected system\nback to the attacker, similar to what is seen in post-compromise C2 traffic during the bot\nregistration process. One example of this was observed where the attacker was executing\nWMI commands on the system, then transmitting the command-line output to the attacker's\nDiscord server, line-by-line, using the Webhook API.\n\nFirst, the malware writes a batch file and an executable called \"DiscordSendWebhook\" into\nthe %TEMP% directory on the infected system. An example of one of the batch files is\nshown below.\n\nNext, the malware executes the batch file, and writes the output of the various commands\ninto text-based log files. It then sends the contents of the log files to the attacker using\n\"DiscordSendWebhook.exe\" which was previously created and executed.\n\n\n-----\n\nThe example below shows one of the API requests made by the infected system. This\nprocess repeats for each line in the WMI command output.\n\nThis demonstrates how abusing the Discord API can provide robust C2 functionality for\nadversaries making use of it in their malware. Additionally, this removes the cost of running\nthe C2 server infrastructure independently and minimizes the resources required to facilitate\nthis activity.\n\n### Pay2Decrypt ransomware\n\nWe also observed ransomware samples leveraging the Discord API for different purposes\nincluding bot registration, data exfiltration and post-infection C2 communications. One\nexample is with a series of campaigns associated with LEAKGAP, a variant of Pay2Decrypt\nransomware that communicates with the attacker using Discord Webhooks. During the\ninfection process, the system is registered with the attacker's Discord instance using an API\nrequest/response similar to the one shown in the screenshot below.\n\nStatus updates regarding the malware's operation on the infected system are also sent back\nto the attacker using the same API.\n\n\n-----\n\nFollowing successful infection, the data stored on the system is no longer available to the\nvictim and the following ransom note is displayed.\n\nNew samples that are leveraging the Discord API for C2 communications are being observed\nregularly, with some RATs being designed specifically to facilitate remote access to infected\nsystems using this same mechanism. This trend will likely continue as more attackers\nleverage these channels to blend in with legitimate network traffic and evade detection in\ncorporate environments.\n\n### Token stealing\n\nOne of the most critical tasks while operating a malware campaign is to stay anonymous.\nOne of the most effective ways to remain anonymous while abusing Discord is to hijack\nanother user's account.\n\nA Discord access token is a unique alphanumeric string that is generated for each user and\nis essentially the \"key\" to that user's account. If another party were to have access to this\ntoken it would allow them to have full control over that account.\n\nAt the time of writing, Discord does not implement client verification to prevent impersonation\nby way of a stolen access token. This has led to a large amount of Discord token stealers\nbeing implemented and distributed on GitHub and other forums. In many cases, the token\n\n\n-----\n\nstealers pose as useful utilities related to online gaming, as Discord is one of the most\nprevalent chat and collaboration platforms in use in the gaming community. Below is a nonexhaustive list of some token stealers hosted on GitHub at the time of this writing:\n\n[https://github.com/notkohlrexo/Discord-Token-Stealer](https://github.com/notkohlrexo/Discord-Token-Stealer)\n[https://github.com/Cazcez/AnarchyGrabber](https://github.com/Cazcez/AnarchyGrabber)\n[https://github.com/iklevente/WebhookDiscordTokenGrabber](https://github.com/iklevente/WebhookDiscordTokenGrabber)\n[https://github.com/Itroublve/Token-Browser-Password-Stealer-Creator](https://github.com/Itroublve/Token-Browser-Password-Stealer-Creator)\n[https://github.com/wodxgod/Discord-Token-Grabber](https://github.com/wodxgod/Discord-Token-Grabber)\n\nThese token stealers are written in several different languages including C# and Python.\nThey can be implemented in script form or a compiled binary, depending on the attacker's\nchoice of language. Creating these stealers is relatively easy as the process for stealing the\naccess token is very simple. All that is required for stealing a token is locating it in the\nappropriate directory, and sending it back to the attacker via a webhook, as discussed in the\n\"Webhooks\" section above. Additionally, well-known information stealers like Masslogger\n[have been observed implementing Discord token-stealing.](https://blog.talosintelligence.com/2021/02/masslogger-cred-exfil.html)\n\nOnce a token has been stolen, the attacker now has the ability to impersonate its owner.\nTypically, these compromised accounts are used in a malware campaign to add a level of\nanonymity to the operation. Common abuses of stolen accounts include uploading payloads\nto the Discord CDN, social engineering of other users and generating webhooks.\n\n**_Growtopia-themed stealer in action._**\n\n## Conclusion\n\nMalicious threat actors are always trying to find new and effective ways to get malware\nexecuting on systems and one of the biggest challenges is distribution. As chat apps like\nDiscord, Slack and many others rise in popularity, organizations need to assess how these\napplications can be abused by adversaries and how many of them should be allowed to\noperate inside your enterprise. As we've shown repeatedly in this blog, these types of\n\n\n-----\n\napplications require content delivery networks (CDNs) to ensure their content is available to\npeople everywhere and malicious actors have noticed. It's likely the abuse of these chat\napps will only increase in the near and long term. As more applications become available\nand some rise and fall in popularity, new avenues will continually be opened for adversaries.\n\nAs defenders, we need to decide what chat applications are allowed and why, while clearly\ncommunicating to management the risk associated with each. If you don't use a chat app\ninternally for business purposes, it may be worth considering blocking some of the domains\nthat can be abused for content delivery or putting other mitigations in place to help reduce\nthe risk. We've continually seen adversaries evolve from including attachments directly in\nemail, to hosting it on their own infrastructure, to using filing sharing services, and now\nabusing chat applications and that is just from email based threats. The name of the game is\ngetting malware onto end systems and as we've seen repeatedly the bad guys will do\nwhatever is necessary to achieve these goals.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware detailed in this post. Below is a screenshot showing how AMP can protect\ncustomers from this threat. Try AMP for free [here.](https://cisco.com/go/tryamp)\n\n\n-----\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Cisco Secure Email Security can block malicious emails sent by threat actors as part of their](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\ncampaign.\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), and](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html) [Meraki MX can detect malicious activity](https://meraki.cisco.com/products/appliances)\nassociated with this threat.\n\n[Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nAdditional protections with context to your specific environment and threat data are available\nfrom the [Firepower Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n## Indicators of Compromise (IOCs)\n\nThe following indicators of compromise have been observed as being associated with\nmalware campaigns.\n\n### Hashes (SHA256)\n\nA list of the SHA256 hashes of files associated with these malware campaigns can be found\n[here.](https://talosintelligence.com/resources/192)\n\n### Domains\n\n[A list of the domains associated with these malware campaigns can be found here.](https://talosintelligence.com/resources/200)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-07 - Sowing Discord- Reaping the benefits of collaboration app abuse.pdf"
    ],
    "report_names": [
        "2021-04-07 - Sowing Discord- Reaping the benefits of collaboration app abuse.pdf"
    ],
    "threat_actors": [
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536249,
    "ts_updated_at": 1743041484,
    "ts_creation_date": 1653687127,
    "ts_modification_date": 1653687127,
    "files": {
        "pdf": "https://archive.orkl.eu/e8bc35278c0c3e7dec11634ee7328a7f320bf779.pdf",
        "text": "https://archive.orkl.eu/e8bc35278c0c3e7dec11634ee7328a7f320bf779.txt",
        "img": "https://archive.orkl.eu/e8bc35278c0c3e7dec11634ee7328a7f320bf779.jpg"
    }
}