{
    "id": "ec5edbc3-1f42-45dd-981e-eebbcca90f77",
    "created_at": "2023-01-12T15:10:26.603909Z",
    "updated_at": "2025-03-27T02:15:26.111967Z",
    "deleted_at": null,
    "sha1_hash": "18e9241d4375d3c5ebd2aa438af98e1782f8f96c",
    "title": "2019-11-15 - New NextCry Ransomware Encrypts Data on NextCloud Linux Servers",
    "authors": "",
    "file_creation_date": "2022-05-28T03:09:27Z",
    "file_modification_date": "2022-05-28T03:09:27Z",
    "file_size": 1486021,
    "plain_text": "# New NextCry Ransomware Encrypts Data on NextCloud Linux Servers\n\n**[bleepingcomputer.com/news/security/new-nextcry-ransomware-encrypts-data-on-nextcloud-linux-servers/](https://www.bleepingcomputer.com/news/security/new-nextcry-ransomware-encrypts-data-on-nextcloud-linux-servers/)**\n\nIonut Ilascu\n\nBy\n[Ionut Ilascu](https://www.bleepingcomputer.com/author/ionut-ilascu/)\n\nNovember 15, 2019\n02:08 PM\n0\n\nA new ransomware has been found in the wild that is currently undetected by antivirus\nengines on public scanning platforms. Its name is NextCry due to the extension appended to\nencrypted files and that it targets clients of the NextCloud file sync and share service.\n\nThe malware targets Nextcloud instances and for the time being there is no free decryption\ntool available for victims.\n\n## Zero detection\n\nxact64, a Nextcloud user, [posted on the BleepingComputer forum some details about the](https://www.bleepingcomputer.com/forums/t/707580/help-needed-decrypting-nextcry/)\nmalware in an attempt to find a way to decrypt personal files.\n\nAlthough his system was backed up, the synchronization process had started to update files\non a laptop with their encrypted version on the server. He took action the moment he saw the\nfiles renamed but some of them still got processed by NextCry, otherwise known as NextCry.\n\n\n-----\n\nI realized immediately that my server got hacked and those files got encrypted. The first\nthing I did was pull the server to limit the damage that was being done (only 50% of my files\ngot encrypted)” - xact64\n\nLooking at the malware binary, [Michael Gillespie said that the threat seems new and pointed](https://twitter.com/demonslay335)\nout the NextCry ransomware uses Base64 to encode the file names. The odd part is that an\nencrypted file's content is also encoded this way, after first being encrypted.\n\n[The malware has not been submitted to the ID Ransomware service before but some details](https://id-ransomware.malwarehunterteam.com/)\nare available.\n\nBleepingComputer discovered that NextCry is a Python script compiled in a Linux ELF binary\nusing pyInstaller. At the moment of writing, not one antivirus engine on the VirusTotal\n[scanning platform detects it.](https://www.virustotal.com/gui/file/027d5f87ab71044a4bbac469b6a3bf5e02571c4661939699d9050a4300d10230/detection)\n\n## Nexcloud servers targeted\n\nThe ransom note is in a file named “READ_FOR_DECRYPT” stating that the data is\nencrypted with the AES algorithm with a 256-bit key. Gillespie confirmed that AES -256 is\nused and that the key is encrypted with an RSA-2048 public key embedded in the malware\ncode.\n\n\n-----\n\nIn the analyzed sample the ransom demanded is BTC 0.025, which converts to about $210\nat the moment of writing. A bitcoin wallet is provided but no transactions have been recorded\nuntil now.\n\n\n-----\n\nAfter another BleepingComputer member named shuum successfully extracted the compiled\nPython script, BleepingComputer could clearly see that this ransomware specifically targets\nNextCloud services.\n\nWhen executed, the ransomware will first find the victim's NextCloud file share and sync data\ndirectory by reading the service's config.php file. It will then delete some folders that could be\nused to restore files and then encrypts all the files in the data directory.\n\n## More than one case spotted\n\n[Another Nexcloud user named Alex posted on the platform’s support page about being hit by](https://help.nextcloud.com/t/nextcry-encrypted-all-files-through-my-instance/64154)\nNextCry ransomware . They say that access to their instance had been locked via SSH and\nran the latest version of the software, suggesting that some vulnerability was exploited to get\nin.\n\nIn a conversation with BleepingComputer xact64 said that their Nextcloud installation runs on\nan old Linux computer with NGINX. This detail may provide the answer to how the attacker\nwas able to get access.\n\n“I have my own linux server (an old thin client I gave a second life) with nginx reverse-proxy”\n\n- xact64\n\n[On October 24, Nextcloud released an urgent alert about a remote code execution](https://help.nextcloud.com/t/urgent-security-issue-in-nginx-php-fpm/62665)\nvulnerability that impacts the default Nextcloud NGINX configuration.\n\n\n-----\n\nTracked as CVE-2019-11043, the flaw is in the PHP-FPM (FastCGI Process Manager)\ncomponent, included by some hosting providers like Nextcloud in their default setup. A public\nexploit exists and has been leveraged to compromised servers.\n\nNextcloud’s recommendation for administrators is to upgrade their PHP packages and\nNGINX configuration file to the latest version.\n\nA representative from Nextcloud told BleepingComputer that they are currently investigating\nthe incidents and will provide more information as it becomes available.\n\n**Update 11/18/19: NextCloud has told BleepingComputer that after conducting an**\ninvestigation they are confident that the attacker is exploiting the PHP -FPM vulnerability that\nthey [issued an advisory on.](https://nextcloud.com/blog/urgent-security-issue-in-nginx-php-fpm/)\n\nWe've been looking into the reports on the forum and source of the virus. We are confident\nthat the attack vector was the nginx+php-fpm security issue that hit the web some time ago.\n\nWhile it was not an issue in Nextcloud itself, we informed our users through all channels we\nhad available, including a direct notification to Nextcloud servers. This likely explains why so\nfew servers were impacted out of the hundreds of thousands of Nextcloud servers on the\nweb.\n\nBleepingComputer advises users to upgrade to PHP 7.3.11 or PHP 7.2.24, depending on\ndevelopment branch being used, to fix this vulnerability.\n\n### Related Articles:\n\n[BlackCat/ALPHV ransomware asks $5 million to unlock Austrian state](https://www.bleepingcomputer.com/news/security/blackcat-alphv-ransomware-asks-5-million-to-unlock-austrian-state/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[SpiceJet airline passengers stranded after ransomware attack](https://www.bleepingcomputer.com/news/security/spicejet-airline-passengers-stranded-after-ransomware-attack/)\n\n[Ionut Ilascu](https://www.bleepingcomputer.com/author/ionut-ilascu/)\n\nIonut Ilascu is a technology writer with a focus on all things cybersecurity. The topics he\nwrites about include malware, vulnerabilities, exploits and security defenses, as well as\nresearch and innovation in information security. His work has been published by Bitdefender,\nNetgear, The Security Ledger and Softpedia.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-15 - New NextCry Ransomware Encrypts Data on NextCloud Linux Servers.pdf"
    ],
    "report_names": [
        "2019-11-15 - New NextCry Ransomware Encrypts Data on NextCloud Linux Servers.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536226,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653707367,
    "ts_modification_date": 1653707367,
    "files": {
        "pdf": "https://archive.orkl.eu/18e9241d4375d3c5ebd2aa438af98e1782f8f96c.pdf",
        "text": "https://archive.orkl.eu/18e9241d4375d3c5ebd2aa438af98e1782f8f96c.txt",
        "img": "https://archive.orkl.eu/18e9241d4375d3c5ebd2aa438af98e1782f8f96c.jpg"
    }
}