{
    "id": "ec782bd2-c578-4f71-8fa1-6410c5de01e5",
    "created_at": "2023-01-12T15:01:40.892971Z",
    "updated_at": "2025-03-27T02:09:29.966204Z",
    "deleted_at": null,
    "sha1_hash": "abc5e40f10b2f573e3297b9b3c32ff6471eb9983",
    "title": "2021-09-10 - S.O.V.A. - A new Android Banking trojan with fowl intentions",
    "authors": "",
    "file_creation_date": "2022-05-28T23:40:00Z",
    "file_modification_date": "2022-05-28T23:40:00Z",
    "file_size": 2057135,
    "plain_text": "# S.O.V.A. - A new Android Banking trojan with fowl intentions\n\n**[threatfabric.com/blogs/sova-new-trojan-with-fowl-intentions.html](https://www.threatfabric.com/blogs/sova-new-trojan-with-fowl-intentions.html)**\n\nSeptember 2021\n\n\n-----\n\n## Intro\n\nIn the beginning of August 2021, during our daily threat hunting, ThreatFabric researchers\ncame across a new Android banking trojan. Based on the login panel of the C2 server, we\ncould see that it was called S.O.V.A. by its own creators.\n\nSova is the Russian word for owl. This name was chosen by the threat actor himself/herself\npossibly because of owl’s nature as nocturnal birds of prey, quiet but efficient in stalking and\ncapturing their victims. This identifies a completely new, to the best of our knowledge, Android\nbanking trojan. The trojan is currently in development and testing phase, and has the\nobjective to add to his overlay and keylogging mechanisms, other higly dangerous features\nlike DDoS and Ransomware in future versions. There are a few interesting aspects that\ndifferentiate this trojan to already existing ones, both in features as well as in development.\n\nS.O.V.A. contains features that are usually available in current Android malware, including:\n\nOverlay attacks;\nKeylogging;\nNotification manipulation.\n\nIn addition, it stands out for a feature that is not as common in Android malware:\n\nSession cookies theft\n\nThis functionality allows the criminals to have access to valid logged in sessions from the\nusers without the need of knowing the banking credentials.\n\nRegardless, this malware is still in its infancy and it is undergoing a testing phase at the time\nof writing, prospecting serious and worrying plans for the near future. This observation is\nconfirmed by a message from its author(s) posted on hacking forums.\n\nThe author publicly advertises for trial of this new product - targeting a large number of banks\n\n- looking to improve the bot’s functionalities, and test on a large variety of mobile devices. In\naddition to testing, the authors have established a clear roadmap of future features to be\nimplemented in the malware.\n\nLike many others, S.O.V.A. is also taking a page out of traditional desktop malware,\nconfirming a trend that has been existing for the past few years in mobile malware. Including\n**DDoS, Man in the Middle, and Ransomware to its arsenal could mean incredible damage to**\nend users, in addition to the already very dangerous threat that overlay and keylogging\nattacks serve.\n\nRegarding the development, S.O.V.A. also stands out for being fully developed in Kotlin, a\ncoding language supported by Android and thought by many to be the future of Android\ndevelopment. If the author promises on future features are kept, S.O.V.A. could potentially be\nthe most complete and advanced Android bot to be fully developed in Kotlin to this day.\n\n\n-----\n\n**NOTE:** **Just one day before the publishing of this blog, two new versions of S.O.V.A.**\n**were found in the wild. The new versions do not change radically from the original, but**\n**do introduce some new features and commands.** **In the following analysis, the**\n**additions brought by the newer version of the malware will be tagged with a (v2) and**\n**(v3) symbols.**\n\n**A ‘Updates’ section was added at the end of the blog to sum up the new features**\n**added.**\n\n## Context\n\nCurrently, ThreatFabric identified five samples of S.O.V.A. in the wild, with a total of three\ndifferent malware versions.\n\nThe following screenshot contains the VirusTotal page for the obfuscated and packed version\nof S.O.V.A..\n\nThe string highlighted, underneath the file’s hash, is the name the file was uploaded to\nVirusTotal with. The file name is ‘vormastor test crypted.apk’. As mentioned in the\nintroduction, we conclude that this malware family is still in its testing phase and has been for\na few weeks. This is confirmed by a post by the author and seller of S.O.V.A., who was\nalready looking for testers at the end of July.\n\n\n-----\n\nAt the beginning of September, this same user published the first post aimed at selling the\nbot. In the same thread, the seller is being criticized by other members for having Russian\nbanks within the list of targets. From this thread it also seems that the future versions of this\nAndroid malware could switch back to Java, to address some compatibility issues with the\nobfuscation software they are using.\n\nAccording to the authors, there are already mutiple overlays available for different banking\ninstitutions from the USA and Spain, but they offer the possibility of creating more in case of\nnecessity from the buyer.\n\n## Commands\n\nThe main objective of S.O.V.A. is to gather the victim’s PII.\n\nS.O.V.A. tries its best to remain undetected. To achieve this, S.O.V.A. abuses the overlay\nmechanic to trick victims into revealing their passwords, and other important private\ninformation. In an overlay attack, users type their credentials in what they think is a legitimate\nbanking app, effectively giving them to a page controlled by the attacker. S.O.V.A. also has\nthe possibility to steal session cookies from the device. This feature is not unheard of but is\ndefinitely not common on modern Android Trojans.\n\nLike most of the banking trojans, S.O.V.A. heavily relies on Accessibility Services. When it is\nstarted for the first time, the malware hides its app icon and abuses the Accessibility Services\nto obtain all the necessary permissions to operate properly.\n\nFunctionalities of the bot, as advertised by its authors, include:\n\n\n-----\n\nSteal Device Data.\nSend SMS.\nOverlay and Cookie injection.\nOverlay and Cookie injection via Push notification.\nUSSD execution.\nCredit Card overlays with validity check.\nHidden interception for SMS.\nHidden interception for Notifications.\nKeylogger.\nUninstallation of the app.\nResilience from uninstallation from victims.\n\nThe features that S.O.V.A. offers are in line with the standard for Android malware that we are\nused to see in 2021. However, as previously mentioned, the criminals behind this bot are very\nproactive and have also released a detailed roadmap of the features to be included in the\nfuture releases of S.O.V.A.:\n\nAutomatic 3 stage overlay injections.\nAutomatic cookie injections.\nClipboard manipulation.\nDDoS\nImproved Panel Health.\nRansomware (with overlay for card number).\nMan in the Middle (MitM).\nNormal Push notifications.\nMore overlays.\nVNC.\n2FA interception.\n\nIt is very interesting to note how this group has a roadmap for their product, including a phase\nwith early adopters to test the bot and the infrastructure. The second set of features, added in\nthe future developments, are very advanced and would push S.O.V.A. into a different realm\nfor Android banking malware. If speculations will become real, it will make S.O.V.A. potentially\none of the most advanced bots in circulation combining banking malware with automation and\nbotnet capabilities.\n\nNonetheless, this behavior indicates that the authors have a lot of ambitions regarding this\nmalware, making it a very dangerous threat for the Android banking ecosystem.\n\n### Commands list\n\nThe following list includes all the commands that can be send by the C2 to the bot:\n\n**Command** **Description**\n\n\n-----\n\n**Command** **Description**\n\nstartddos Start DDoS service\n\nstealer Steal session cookie of specific app\n\nhidensms Hide received SMS\n\nstarthidenpush Hide push notifications\n\ndelbot Delete the bot from device\n\ngetlog Send key logged data\n\nstartkeylog Clears key logged data\n\nscaninject Adds new injects to injects list\n\nstopkeylog Same as startkeylog\n\nopeninject Open WebView with link provided\n\nstophidenpush Stop hiding push notifications\n\nsendpush Display Push notification to start WebView Injection\n\nstophidensms Stops hiding received SMS\n\nstopddos Stop DDoS service\n\nstopscan Stops injects\n\nstealerpush Same as sendpush\n\nsendsms Send SMS\n\nscancookie Adds package to cookie stealing list (v2)\n\nstopcookie Removes package names from cookie stealing list (v2)\n\nget2fa Obtains 2 factor Authentications tokes from Google Authenticatos (v3)\n\nAs expected, not all the commands function properly, a few are not implemented fully or are\ncopies of existing ones. This can be a result of the bot being still in the testing and\ndevelopment phase.\n\n## Capabilities\n\nHere is a brief description of the main and most interesting functionalities of S.O.V.A.\n\n### Overlay Attack\n\n\n-----\n\nLike the large majority of Android banking trojans, S.O.V.A. relies on Overlay attacks to steal\nPII from its victims. If the user is trying to access a banking application included in S.O.V.A.’s\nactive target list, the malware will be notified with Accessibility Services, and will display a\nWebView overlay posing as the intended banking application.\n\nIn addition, the author claims that future S.O.V.A. releases will have what a so-called 3-stageoverlay. In the screenshots below you can see a demonstration of this 3-stage-overlay, taken\nfrom a demonstration video released in early September by the criminals themselves. It is not\nclear what the 3 stages imply, but it could mean more advances and realistic process, maybe\nimplying download of additional software to the device.\n\nThe target list is contained in an asset file called ‘packageList.txt’. This list is quite extensive,\nand contains banking applications, cryptocurrency wallets, and shopping applications that\nrequire credit card access to operate.\n\nIn the following graph you can observe the country distribution of the targets:\n\n\n-----\n\nAs mentioned before, the authors declared in their online advertisement that at the moment\nthey only have mobile banking overlays for banks Spain and USA, but as we have seen\nbefore with many other Android banking trojans, it is very easy for criminals to add new\noverlays in a very short amount of time.\n\n### Session Stealer\n\nAnother interesting feature of S.O.V.A., which is uncommon in Android malware, is the ability\nto steal cookies. Cookies are a vital part of web functionality, which allow users to maintain\nopen sessions on their browsers without having to re-input their credentials repeatedly. A\nmalicious actor in possession on a valid session cookie has effectively access to the victim’s\nlogged in web session.\n\n\n-----\n\nS.O.V.A. will create a WebView to open a legitimate web URL for the target application and\nsteal the cookies once the victim successfully logs in, using the Android CookieManager.\n\nThe following code fragment shows how the overlay WebView is created:\n```\n  this.setContentView(0x7F070001); // layout:activity_web_view\n  WebView v1 = (WebView)this.a(0x7F05001D); // id:web_view\n  Checks.checkNotNullWithName(v1, \"web_view\");\n  WebSettings webSettings = v1.getSettings();\n  Checks.checkNotNullWithName(webSettings, \"web_view.settings\");\n  webSettings.setJavaScriptEnabled(true);\n  ((WebView)this.a(0x7F05001D)).setLayerType(2, null); // id:web_view\n  String link = this.getIntent().getStringExtra(\"link\");\n  boolean getCookieFlag = this.getIntent().getBooleanExtra(\"getCookie\", false);\n  CookieManager cookieManager = CookieManager.getInstance();\n  CookieSyncManager.createInstance(this.getApplicationContext());\n  cookieManager.setAcceptThirdPartyCookies(((WebView)this.a(0x7F05001D)), true); //\nid:web_view\n  cookieManager.acceptCookie();\n  CookieSyncManager.getInstance().startSync();\n  WebView webView2 = (WebView)this.a(0x7F05001D); // id:web_view\n  Checks.checkNotNullWithName(webView2, \"web_view\");\n  Checks.checkNotNullWithName(cookieManager, \"cookieManager\");\n  webView2.setWebViewClient(new CustomWebViewClient(this, ((boolean)\n(((int)getCookieFlag))), cookieManager));\n  if(link != null) {\n    ((WebView)this.a(0x7F05001D)).loadUrl(link); // id:web_view\n  }\n\n```\nThe malware does not require specific permissions to run this code, and ThreatFabric has\nconfirmed that it is capable of stealing session cookies from major websites like Gmail or\nPayPal with ease. In the newer version of S.O.V.A., criminals added the option to create a list\nof applications to monitor for cookies automatically\n\n\n-----\n\n### DDoS\n\nDDoS stands for Distributed Denial of Service. It is a type of attack whose objective is to\nexhaust the resources of a device to make it unavailable to its intended users. Based on the\nadvertisement post, this feature is a work in progress and will be available in the future.\nS.O.V.A. is not the first malware to incorporate DDoS capabilities, but it is an uncommon\nfeature in the current Android malware ecosystem.\n\nDespite being part of the features to be released, the bot has a startddos command, that will\nexecute the following code, within a Kotlin coroutine:\n```\n  do {\n    retrofitManager v3 = this.mRetrofitManager;\n        if(!v3.isActive) {\n          return l.a;\n        }\n        Objects.requireNonNull(v3.retrofitClient);\n        this.i = v1_1;\n        this.j = 1;\n  }\n  while(retrofitClient.ddosEndpoint.request(this.link, this) != v0);\n\n```\nCurrently, this functionality is listed by the authors as a work in progress. Despite this, the bot\nis actually able to create requests for the given URL using RetroFit.\n```\n  RetroFitBuilder DDOSretroFitBuilder = new RetroFitBuilder();\n  DDOSretroFitBuilder.setHTTPClient(okHTTPClient);\n  DDOSretroFitBuilder.setBaseUrl(\"http://google.com/\");\n  myConverterFactory DDoSConverterFactory = myConverterFactory.c();\n  DDOSretroFitBuilder.converterFactories.add(DDoSConverterFactory);\n  retrofitClient.ddosEndpoint =\n(ddosEndpoint)DDOSretroFitBuilder.buildRetrofit().getProxyClass(ddosEndpoint.class);\n\n```\nDespite setting ‘google.com’ as base URL, by using the @Url annotation from RetroFit, the\nauthors are able to dynamically input a completely new URL. As DDoS is not listed in the bot\ncapabilities, it is likely that the criminals do not fully trust this implementation to consider it a\ncomplete feature yet.\n\n### Clipper & Cryptocurreny wallets\n\nAnother feature that is incorporated in S.O.V.A., that we observed in other malware like\nMedusa, is the ability of altering the data in the system clipboard. The bot sets up an event\nlistener, designed to notify the malware whenever some new data is saved in the clipboard. If\nthe string of data is potentially a cryptocurrency wallet address, S.O.V.A. substitutes it with a\nvalid address for the corresponding cryptocurrency.\n\n\n-----\n\nThe supported cryptocurrencies are Bitcoin, Ethereum, Binance coin, and TRON. The relative\naddresses can be found in the IOC section. The following code snippet shows the checks for\nBinance Coin:\n```\nString v1 = v0.substring(0, 3);\nChecks.checkNotNullWithName2(v1, \"(this as java.lang.Strin…ing(startIndex,\nendIndex)\");\nif(Checks.nullOrEqual(v1, \"bnb\")) {\n  this.b.setText(clipboardManager.bnbAddress);\n}\n\n```\nCurrently, the corresponding wallets are either empty or almost empty. Here in the following\nimage, you can see the Bitcoin related wallet:\n\nThe wallet does have a relative high number of transactions, and a zero balance, indicating\nthat they could be part of a network of wallets used to redirect stolen cryptocurrencies from\nthe victims to the criminals.\n\n## C2 Communication\n\nS.O.V.A. relies on the open-source project of RetroFit for its communication with the C2\nserver.\n\nRetrofit is a type-safe REST client for Android, Java and Kotlin developed by Square. The\nlibrary provides a powerful framework for authenticating and interacting with APIs and\nsending network requests with OkHttp.\n\n\n-----\n\n**NOTE : ThreatFabric wants to explicitly mention that RetroFit is a legitimate and legal**\n**product. The developers that created this project have no control over the misuse of**\n**their software.**\n\n### C2 methods\n\nBelow is a complete list of the methods supported by the bot through its RetroFit client. These\nare the commands that the bot can send to the C2 to request, or to send back, information.\nThe methods can be sent to API endpoint using a GET message in the form “/api/?method=\",\nplus the parameters required.\n\n**Message** **Description**\n\nbots.update send ping message\n\npush.new send notification text\n\nnumber.update send phone number\n\nsms.new send sms text\n\nbots.new registration (gets back the cryptowallet addresses)\n\ncommand.delete deletes session cookie with c2\n\n### C2 Endpoints\n\nThese are the endpoints reachable on the C2:\n\n**Endpoint** **Description**\n\n/api Main API endpoint\n\n/keylog.php where Keylog stolen is sent\n\n/testpost.php send keylog and cookie stolen. Used for testing\n\n/logpost.php send logs (v2)\n\n## Updates\n\nAs expected with under-development malware, new versions surface very quickly, often\nadding new features or correcting malfunctions.\n\nS.O.V.A. is no different: in the span of the 24 hours before the planned publishing of this\nblogpost, the bot passed from version 1 to version 3, adding 3 new commands and some new\nfeatures. This is already an extensive blog, so we will try to briefly sum up the most important\n\n\n-----\n\nmodifications and additions.\n\n### New commands\n\nThree new commands were added to S.O.V.A.:\n\n**scancookie (v2)**\n**stopcookie (v2)**\n\nThese first two commands add an automation layer to the cookie stealing mechanism. In the\nfirst iteration, session stealing could happen only when prompted by a command by the C2. if\nthe command ‘stealer’ was sent, a cookie stealing overlay would be started. With the\nintroduction of this two commands, the criminals can now add applications to a list of\n“session-stealer targets”, creating a more automatized and scalable option.\n\n**get2fa (v3)**\n\nThe third command allows criminals to steal 2 Factor Authentication codes from the “Google\nAuthenticator” app, abusing Accessiblility services to launch and log valid codes.\n\n### New Features\n\nTwo main features were added in the new versions of the malware. These features are the\ndirect effect of open critics suffered by the authors of S.O.V.A. from other malware authors in\nthe forum thread created to sell this bot.\n\nThe first feature was added to address the accusation of targeting the CIS region, caused by\nhaving some russian institutions in the ‘packageList.txt’ target list. The authors added a\ncountry check based on the devices locale and on IP checks, to avoid targeting devices from\nthe following regions:\n\nAzerbaijan\nArmenia\nBelarus\nKazakhstan\nKyrgyzstan\nMoldova\nRussia\nTajikistan\nUzbekistan\n\nHere is a snippet of the corresponding code:\n\n\n-----\n\n```\n  // safe country List: AZ, AM, BY, KZ, KG, MD, RU, TJ, UZ \n  private final void checkCountry() {\n    Timber.d(\"Running country check\", new Object[0]);\n    String v1 = this.getResources().getConfiguration().locale.getCountry();\n    Intrinsics.checkNotNullExpressionValue(v1,\n\"resources.configuration.locale.country\");\n    if(ConstantsKt.getListCountry().contains(v1)) { \n      Timber.d(\"Invalid locale. Exit...\", new Object[0]);\n      this.finish();\n      return;\n    }\n    Function1 v2 = (Function1)new LauncherActivity.checkCountry.1(this);\n    this.retrofitUtil.checkCountry(v2);\n  }\n\n```\nin addition, the malware also makes sure to not run whenever the following two Russian\nbanks applications are installed on the device:\n\n**Package** **App Name**\n\ncom.idamob.tinkoff.android Tinkoff\n\nru.sberbankmobile СберБанк Онлайн\n\nThe second feature correspond to a more extensive support for Chinese phone\n**manufacturers, again following requests from fellow criminals. For these manufactures, the**\nauthors added more extensive accesibility service support, to increase the effectiveness of\nthe malware to a wider number of devices.\n\n### Future Features\n\nDespite them not being yet advertised or used, the new version also sports some in-the-works\ncode that suggests what new features might be added in the future.\n\n**Telegram API support**\n\nA new Endpoint API class was added to support Telegram communication. From what we can\nsee, the authors might be inspired by Aberebot, as it looks like this endpoint will be used by\nthe author to monitor any new information gathered by the malware. Here is the definition of\nthe RetroFit Endpoint:\n```\n  @GET(\"/bot{botId}/sendMessage\")\n  Object sendInfo(@Path(\"botId\") String arg1, \n          @Query(\"chat_id\") String arg2, \n          @Query(\"parse_mode\") String arg3, \n          @Query(\"text\") String arg4, \n          Continuation arg5);\n\n```\n\n-----\n\nThere are also another endpoint, called CheckCriptaAPI. This endpoint is not used at the\nmoment, but considering that the author have admitted to have had issues with the ecnryption\nand obfuscation of their product, this might be a debugging class used for that purpose.\n\n## Conclusion\n\nThis current year we have observed an explosion of Android banking malware families; in\nnumber and volume. The global pandemic has changed the way we interact and resulted in a\neven sharper increase of mobile payment usage. For this reason, it comes to no surprise that\nthreat actors have followed the massive shift to mobile banking, and are finding ways to\nexploit newly emerging technologies and changing behaviour.\n\nS.O.V.A. - a new sophisticated malware - is the clear example of this trend. It is still a project\nin its infancy, and now provides the same basic features as most other modern Android\nbanking malware. However, the author behind this bot clearly has high expectations for his\nproduct, and this is demonstrated by the author’s dedication to test S.O.V.A. with third parties,\nas well as by S.O.V.A.’s explicit feature roadmap.\n\nThe current version of S.O.V.A. is capable of stealing credentials and session cookies through\noverlay attacks, keylogging, hiding notifications, and manipulating the clipboard to insert\nmodified cryptocurrency wallet addresses. If the authors adhere to the roadmap, it will also be\nable to feature on-device fraud through VNC, DDoS capabilities, Ransomware, and advanced\noverlay attacks. These features would make S.O.V.A. the most feature-rich Android malware\non the market and could become the ‘new norm’ for Android banking trojans targeting\nfinancial institutions.\n\n## How we help our customers\n\nThreatFabric makes it easier than it has ever been to run a secure mobile payments\nbusiness. With the most advanced threat intelligence for mobile banking, financial institutions\ncan build a risk-based mobile security strategy and use this unique knowledge to detect fraudby-malware on the mobile devices of customers in real-time.\n\nTogether with our customers and partners, we are building an easy-to-access information\nsystem to tackle the ever growing threat of mobile malware targeting the financial sector. We\nespecially like to thank the Cyber Defence Alliance (CDA) for collaborating and proactively\nsharing knowledge and information across the financial sector to fight cyber-threats.\n\nThreatFabric has partnerships with TIPs all over the world.\n\nIf you want to request a free trial of our MTI-feed, or want to test our own MTI portal for 30\ndays, feel free to contact us at: [sales@threatfabric.com](http://10.10.0.46/mailto://sales@threatfabric.com)\n\nIf you want more information on how we detect mobile malware on mobile devices, you can\ndirectly contact us at: [info@threatfabric.com](http://10.10.0.46/mailto://info@threatfabric.com)\n\n\n-----\n\n## Appendix\n\n### S.O.V.A. Samples\n\n**Obfuscation** **Hash**\n\n\nUnobfuscated\nv1\n\nObfuscated\nv1\n\nObfuscated\nv2\n\nObfuscated\nv3\n\n### C2 URL\n\n**URL**\n\n\n8a6889610a18296e812fabd0a4ceb8b75caadc5cec1b39e8173c3e0093fd3a57\n\nefb92fb17348eb10ba3a93ab004422c30bcf8ae72f302872e9ef3263c47133a7\n\ndd8a5a1a8632d661f152f435b7afba825e474ec0d03d1c5ef8669fdc2b484165\n\nb2e592c5cf8ccc944c06a11ff156efdfa4233fe46e2281bab3fd238f03b505e3\n\n\nhxxp://l8j1nsk3j5h1msal973nk37[.]fun\n\nhxxp://a0545193.xsph[.]ru\n\n### Cryptocurrency wallets\n\nDuring our analysis, we were able to obtain the following cryptocurrency wallet addresses\nfrom S.O.V.A.’s C2. After a few days, the C2 stopped sending these as valid responses, and\nstarted sending back only placeholder strings.\n\n**Crypto** **Address**\n\nBTC 18PJPLZutdZUV16uiXkX9KXX1kHw5UiJHV\n\nETH 0xbD1bB3101fCc1A2724C3c5c4F10Fa062DF87E134\n\nBNB bnb1lwf4kzw74wuf0zmsg25fjh44pzpdwhavn3n9dq\n\nTRX TUGyDe7eGJi2DVDMxc2KExksF29vHsZcQm\n\n### Targets\n\nThis is a list of the institutions or applications that are targeted via overlay:\n\n**Institution / Application**\n\n\n-----\n\n**Institution / Application**\n\nmail.com\n\nDeutsche Bank\n\nNetflix\n\nBBVA Net Cash ES & PT\n\nCaixa Geral de Depósitos\n\nBankia\n\nCajalnet\n\nBi en Línea\n\nUnicajaMovil\n\nBankinter Móvil\n\nSantander Empresas\n\nPibank\n\nIbercaja\n\nABANCA Empresas\n\nBanca Móvil Laboral Kutxa\n\nKutxabank\n\nNBapp Spain\n\nBBVA Spain\n\nimaginBank - Your mobile bank\n\nCajasur\n\nSantander\n\nGoole Passwords\n\nGmail\n\npassword\n\nyahoo mail\n\nAT&T\n\n\n-----\n\n**Institution / Application**\n\nVerizon\n\nBlockhchain\n\nTrust Wallet\n\nCoinbase\n\nBBVA\n\nSuntrust\n\nPNC Bank\n\nBank of America\n\nCapital ONE\n\nCiti Bank\n\nCitizen\n\nSunCorp\n\nUSAA Bank\n\nWells Fargo\n\nPayPal\n\nUber\n\nEVO banco\n\nIn case any of the following packages is present in the victim’s device, the criminals are\nnotified:\n\n**PackageName** **AppName**\n\ncom.google.Android.apps.authenticator2 Google Authenticator\n\ncom.bankaustria.Android.olb Bank Austria MobileBanking\n\ncom.cibc.Android.mobi CIBC Mobile Banking®\n\ncom.rbc.mobile.Android RBC Mobile\n\ncz.airbank.Android My Air\n\ncom.kutxabank.Android Kutxabank\n\n\n-----\n\n**PackageName** **AppName**\n\nes.lacaixa.mobile.Android.newwapicon CaixaBank\n\ncom.mtel.Androidbea BEA 東亞銀行\n\njp.co.aeonbank.Android.passbook イオン銀行通帳アプリ かんた\nんログイン＆残高・明細の確\n認\n\ncom.barclays.ke.mobile.Android.ui Barclays Kenya\n\nnz.co.anz.Android.mobilebanking ANZ goMoney New Zealand\n\nalior.bankingapp.Android Usługi Bankowe\n\nwit.Android.bcpBankingApp.millenniumPL Bank Millennium\n\ncom.idamobile.Android.hcb Мобильный банк - Хоум\nКредит\n\nru.rosbank.Android ROSBANK Online\n\ncom.vkontakte.Android VK — live chatting & free\ncalls\n\nru.taxovichkof.Android Taxovichkof\n\nhr.asseco.Android.jimba.mUCI.ro Mobile Banking\n\nmay.maybank.Android Maybank2u\n\ncom.amazon.mShop.Android.shopping Amazon Shopping - Search,\nFind, Ship, and Save\n\nru.alfabank.mobile.Android Альфа-Банк (Alfa-Bank)\n\ncom.idamob.tinkoff.Android Tinkoff\n\nru.vtb24.mobilebanking.Android VTB-Online\n\ncom.akbank.Android.apps.akbank_direkt Akbank\n\ncom.akbank.Android.apps.akbank_direkt_tablet Akbank Direkt Tablet\n\ncom.akbank.Android.apps.akbank_direkt_tablet_20 \ncom.ykb.Android Yapı Kredi Mobile\n\ncom.ykb.Android.mobilonay Y apı Kredi Corporate-For\nFirms\n\n\n-----\n\n**PackageName** **AppName**\n\ncom.ykb.Androidtablet Yapı Kredi Mobil Şube\n\nbiz.mobinex.Android.apps.cep_sifrematik Garanti BBVA Cep Şifrematik\n\ncom.matriksmobile.Android.ziraatTrader Ziraat Trader\n\nde.comdirect.Android comdirect mobile App\n\nde.fiducia.smartphone.Android.banking.vr VR Banking Classic\n\nfr.creditagricole.Androidapp Ma Banque\n\ncom.boursorama.Android.clients Boursorama Banque\n\ncom.caisseepargne.Android.mobilebanking Banque\n\nfr.lcl.Android.customerarea Mes Comptes - LCL\n\ncom.paypal.Android.p2pmobile PayPal Mobile Cash: Send\nand Request Money Fast\n\ncom.usaa.mobile.Android.usaa USAA Mobile\n\ncom.chase.sig.Android Chase Mobile\n\ncom.grppl.Android.shell.BOS Bank of Scotland Mobile\nBanking: secure on the go\n\ncom.rbs.mobile.Android.natwestoffshore NatWest International\n\ncom.rbs.mobile.Android.natwest NatWest Mobile Banking\n\ncom.rbs.mobile.Android.natwestbandc NatWest Business Banking\n\ncom.rbs.mobile.Android.rbs Royal Bank of Scotland\nMobile Banking\n\ncom.rbs.mobile.Android.rbsbandc RBS Business Banking\n\ncom.rbs.mobile.Android.ubr Ulster Bank RI Mobile\nBanking\n\ncom.grppl.Android.shell.halifax Halifax: the banking app that\ngives you extra\n\ncom.grppl.Android.shell.CMBlloydsTSB73 Lloyds Bank Mobile Banking:\nby your side\n\ncom.barclays.Android.barclaysmobilebanking Barclays\n\ncom.unionbank.ecommerce.mobile.Android Union Bank Mobile Banking\n\n\n-----\n\n**PackageName** **AppName**\n\nau.com.ingdirect.Android ING Australia Banking\n\ncom.cba.Android.netbank CommBank app for tablet\n\ncom.anz.Android.gomoney ANZ Australia\n\ncom.anz.Android ANZ Mobile Taiwan\n\nde.fiducia.smartphone.Android.banking.vr VR Banking Classic\n\nit.volksbank.Android Volksbank · Banca Popolare\n\nde.fiducia.smartphone.Android.securego.vr VR-SecureGo\n\ncom.starfinanz.smob.Android.sfinanzstatus Sparkasse Ihre mobile Filiale\n\ncom.starfinanz.mobile.Android.pushtan S-pushTAN\n\ncom.starfinanz.smob.Android.sfinanzstatus.tablet Sparkasse fürs Tablet\n\ncom.starfinanz.smob.Android.sbanking Sparkasse+ Finanzen im Griff\n\ncom.palatine.Android.mobilebanking.prod ePalatine Particuliers\n\nes.cm.Android Bankia\n\nes.cm.Android.tablet Bankia Tablet\n\ncom.bestbuy.Android Best Buy\n\ncom.latuabancaperAndroid Intesa Sanpaolo Mobile\n\ncom.latuabanca_tabperAndroid La tua banca per Tablet\n\nit.copergmps.rt.pf.Android.sp.bmps Banca MPS\n\ncom.ykb.Android Yapı Kredi Mobile\n\naib.ibank.Android AIB Mobile\n\ncom.jpm.sig.Android J.P. Morgan Mobile\n\npinacleMobileiPhoneApp.Android PINACLE®\n\ncom.fuib.Android.spot.online PUMB Online\n\ncom.ukrsibbank.client.Android UKRSIB online\n\nru.alfabank.mobile.ua.Android Alfa-Mobile Ukraine\n\nua.aval.dbo.client.Android Raiffeisen Online Ukraine\n\n\n-----\n\n**PackageName** **AppName**\n\nua.com.cs.ifobs.mobile.Android.otp OTP Smart\n\nua.com.cs.ifobs.mobile.Android.pivd Pivdenny MyBank\n\nio.getdelta.Android Delta - Bitcoin &\nCryptocurrency Portfolio\nTracker\n\ncom.coinbase.Android Coinbase – Buy & Sell\nBitcoin. Crypto Wallet\n\npiuk.blockchain.Android Blockchain Wallet. Bitcoin,\nBitcoin Cash, Ethereum\n\ncom.thunkable.Android.santoshmehta364.UNOCOIN_LIVE UNOCOIN LIVE\n\ncom.thunkable.Android.manirana54.LocalBitCoins LocalBitCoins\n\ncom.thunkable.Android.manirana54.LocalBitCoins_unblock UNBLOCK Local BitCoins\n\ncom.citizensbank.Androidapp Citizens Bank Mobile Banking\n\ncom.navyfederal.Android Navy Federal Credit Union\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-10 - S.O.V.A. - A new Android Banking trojan with fowl intentions.pdf"
    ],
    "report_names": [
        "2021-09-10 - S.O.V.A. - A new Android Banking trojan with fowl intentions.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "97dc332f-2241-4755-ae33-54e5eff3990a",
            "created_at": "2023-01-06T13:46:39.307201Z",
            "updated_at": "2025-03-27T02:00:03.046734Z",
            "deleted_at": null,
            "main_name": "TA2541",
            "aliases": [],
            "source_name": "MISPGALAXY:TA2541",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "878ce40c-9fbc-4cff-a5c4-771086979fa7",
            "created_at": "2022-10-25T16:07:24.264056Z",
            "updated_at": "2025-03-27T02:02:10.154595Z",
            "deleted_at": null,
            "main_name": "TA2541",
            "aliases": [],
            "source_name": "ETDA:TA2541",
            "tools": [
                "AVE_MARIA",
                "AgenTesla",
                "Agent Tesla",
                "AgentTesla",
                "AsyncRAT",
                "Ave Maria",
                "AveMariaRAT",
                "DarkRAT",
                "H-Worm",
                "H-Worm RAT",
                "Houdini",
                "Houdini RAT",
                "Hworm",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Iniduoh",
                "Jenxcus",
                "Kognito",
                "Luminosity RAT",
                "LuminosityLink",
                "Negasteal",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Njw0rm",
                "Origin Logger",
                "Parallax",
                "Parallax RAT",
                "ParallaxRAT",
                "Recam",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "WSHRAT",
                "ZPAQ",
                "avemaria",
                "dinihou",
                "dunihi"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535700,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653781200,
    "ts_modification_date": 1653781200,
    "files": {
        "pdf": "https://archive.orkl.eu/abc5e40f10b2f573e3297b9b3c32ff6471eb9983.pdf",
        "text": "https://archive.orkl.eu/abc5e40f10b2f573e3297b9b3c32ff6471eb9983.txt",
        "img": "https://archive.orkl.eu/abc5e40f10b2f573e3297b9b3c32ff6471eb9983.jpg"
    }
}