{
    "id": "ec93f203-59c3-4df2-8137-d6cc4787d06d",
    "created_at": "2022-10-25T16:48:12.861114Z",
    "updated_at": "2025-03-27T02:17:23.150578Z",
    "deleted_at": null,
    "sha1_hash": "718ee3a33c76162ea35d568bcb423f1a17e94931",
    "title": "North Korea Bitten by Bitcoin Bug: Financially motivated campaigns reveal new dimension of the Lazarus Group",
    "authors": "",
    "file_creation_date": "2017-12-20T15:27:07Z",
    "file_modification_date": "2017-12-20T15:27:18Z",
    "file_size": 6463779,
    "plain_text": "#  North Korea Bitten by   Bitcoin Bug\n\n## Financially motivated campaigns reveal new dimension of the Lazarus Group\n\n\n#### Darien Huss\n\n\n**[www proofpoint com](http://www.proofpoint.com)**\n\n\n-----\n\n## Table of Contents\n\n**EXECUTIVE SUMMARY........................................................................................................................................................... 3**\n\n**OVERVIEW............................................................................................................................................................................... 4**\n\n**INTRODUCTION...................................................................................................................................................................... 4**\n\n**PowerRatankba Downloaders......................................................................................................................................5**\n\nCampaign Timeline.................................................................................................................................................................... 5\n\nPowerSpritz................................................................................................................................................................................ 6\n\nWindows Shortcut (LNK)............................................................................................................................................................ 8\n\nMicrosoft Compiled HTML Help (CHM)..................................................................................................................................... 9\n\nJavaScript Downloaders.......................................................................................................................................................... 11\n\nVBScript Macro Microsoft Office Documents.......................................................................................................................... 13\n\nBackdoored PyInstaller Applications....................................................................................................................................... 15\n\n**Implant Description and Analysis..............................................................................................................................18**\n\nPowerRatankba Description..................................................................................................................................................... 18\n\nPowerRatankba.A C&C Description......................................................................................................................................... 19\n\nPowerRatankba.B C&C Description........................................................................................................................................ 20\n\nPowerRatankba Persistence.................................................................................................................................................... 20\n\nPowerRatankba.B Stage2 - Gh0st RAT.................................................................................................................................... 21\n\nGh0st RAT Purpose.................................................................................................................................................................. 23\n\nShopping Spree: Enter RatankbaPOS..................................................................................................................................... 23\n\nRatankbaPOS Analysis............................................................................................................................................................ 23\n\nRatankbaPOS Targeted Region............................................................................................................................................... 28\n\n**Attribution to Lazarus Group......................................................................................................................................28**\n\nEncryption................................................................................................................................................................................ 28\n\nObfuscation.............................................................................................................................................................................. 30\n\nFunctionality............................................................................................................................................................................. 30\n\nCode Overlap........................................................................................................................................................................... 31\n\nDecoys..................................................................................................................................................................................... 32\n\nC&C.......................................................................................................................................................................................... 32\n\n**CONCLUSION........................................................................................................................................................................ 33**\n\nResearch Contributions........................................................................................................................................................... 33\n\nIndicators of Compromise (IOCs)............................................................................................................................................ 34\n\nET and ETPRO Suricata/Snort Signatures............................................................................................................................... 37\n\n\n-----\n\n## Executive Summary\n\nWith activity dating at least to 2009, the Lazarus Group has consistently ranked among the most disruptive, successful,\nand far-reaching state-sponsored actors. The March 20, 2013 attack in South Korea, the Sony Pictures hack in 2014,\nthe successful theft of $81 million from the Bangladesh Bank in 2014, and perhaps most famously this year’s WannaCry\nransomware attack and its global impact have all been attributed to the group. The Lazarus Group is widely accepted as\nbeing a North Korean state-sponsored threat actor by numerous organizations in the information security industry, law\nenforcement agencies, and intelligence agencies around the world.\n\nThe Lazarus Group’s arsenal of tools, implants, and exploits is extensive and under constant development. Previously,\nthey have employed DDoS botnets, wiper malware to temporarily incapacitate a company, and a sophisticated set of\nmalware targeting the SWIFT banking system to steal millions of dollars. In this report we describe and analyze a new,\ncurrently undocumented subset of the Lazarus Group’s toolset that has been widely targeting individuals, companies, and\norganizations with interests in cryptocurrency.\n\nThreat vectors for this new toolset, dubbed PowerRatankba, include highly targeted spearphishing campaigns using\nlinks and attachments as well as massive email phishing campaigns targeting both personal and corporate accounts of\nindividuals with interests in cryptocurrency. We also share our discovery of what may be the first publicly documented\ninstance of a state targeting a point-of-sale related framework for the theft of credit card data, again using a variant of\nmalware that is closely related to PowerRatankba.\n\n\n-----\n\n## Overview\n\nThe Lazarus Group has increasingly focused on financially motivated attacks and appears to be capitalizing on both the\nincreasing interest and skyrocketing prices for cryptocurrencies. Proofpoint researchers have uncovered a number of\nmultistage attacks that use cryptocurrency-related lures to infect victims with sophisticated backdoors and reconnaissance\nmalware. Victims of interest are then infected with additional malware including Gh0st RAT to steal credentials for\ncryptocurrency wallets and exchanges, enabling the Lazarus Group to conduct lucrative operations stealing Bitcoin and\nother cryptocurrencies. We also discovered what appears to be the first publicly documented instance of a state targeting a\npoint-of-sale related framework for the theft of credit card data in a related set of attacks. Moreover, the timing of the pointof-sale related attacks near the holiday shopping season makes the potential financial losses considerable.\n## Introduction\n\n[It is already well-known that Lazarus Group has targeted and successfully breached several prominent cryptocurrency](https://www.fireeye.com/blog/threat-research/2017/09/north-korea-interested-in-bitcoin.html)\ncompanies and exchanges. From these breaches, law enforcement agencies suspect that the group has amassed nearly\n[$100 million worth of cryptocurrencies based on their value today. We hypothesize that many of these previously reported](http://www.bbc.com/news/world-asia-42378638)\noperations targeting cryptocurrency organizations have actually been conducted by the espionage team of the Lazarus\nGroup based on evidence we provide in the “Attribution” section. Further, we assess that until today, many of Lazarus\nGroup’s traditional financially motivated team have remained largely in the shadows as they conduct these operations\nadding to their already impressive stockpile of various cryptocurrencies.\n\n[Several watering hole attacks targeting the banking and financial industries that occurred at the end of 2016 and beginning](https://www.symantec.com/connect/blogs/attackers-target-dozens-global-banks-new-malware-0)\n[of 2017 utilized a first stage downloader implant dubbed Ratankba. During those incidents, Lazarus Group primarily used](https://www.symantec.com/security_response/writeup.jsp?docid=2017-020908-1134-99)\n[Ratankba as a reconnaissance tool, described by colleagues at Trend Micro as a utility to “survey the lay of the land.” In](https://blog.trendmicro.com/trendlabs-security-intelligence/ratankba-watering-holes-against-enterprises/)\nthis research we detail a new implant dubbed PowerRatankba, a PowerShell-based malware variant that closely resembles\nthe original Ratankba implant. We believe that PowerRatankba was likely developed as a replacement in Lazarus Group’s\nstrictly financially motivated team’s arsenal to fill the hole left by Ratankba’s discovery and very public documentation\n[earlier this year.](https://blog.trendmicro.com/trendlabs-security-intelligence/ratankba-watering-holes-against-enterprises/)\n\nIn this report, we first provide a brief timeline of events related to the malicious activity. Next, we describe the various\ndelivery methods that Lazarus Group utilized to infect victims with PowerRatankba (Figure. 1). We then detail the inner\nworkings of PowerRatankba and how it is utilized to deliver a more fully capable backdoor to interesting victims (Figure. 1).\nFollowing that, we share details on a new and emerging threat targeting the South Korean point-of-sale industry that we\nhave dubbed RatankbaPOS (Figure. 1). Finally, we explain our high-confidence attribution to Lazarus Group.\n\n\n-----\n\nFigure 1: Flow of PowerRatankba activity from victims to the Lazarus Group operators\n\n## PowerRatankba Downloaders\n\nIn this section we will detail each of the different attack vectors and campaigns we have discovered that eventually lead to\nthe delivery of PowerRatankba. In total we have discovered six different attack vectors:\n\n- A new Windows executable downloader dubbed PowerSpritz\n\n- A malicious Windows Shortcut (LNK) file\n\n- Several malicious Microsoft Compiled HTML Help (CHM) files using two different techniques\n\n- Multiple JavaScript (JS) downloaders\n\n- Two macro-based Microsoft Office documents\n\n- Two campaigns utilizing backdoored popular cryptocurrency applications hosted on internationalized domain (IDN)\ninfrastructure to trick victims into thinking they were on a legitimate website\n\n### Campaign Timeline\n\nThe campaigns discussed in this research began on or around June 30th, 2017. According to our data those campaigns\nwere highly targeted spearphishing attacks targeting at least one executive at a cryptocurrency organization to deliver a\nPowerRatankba.A variant. All other campaigns utilized PowerRatankba.B variants. We currently have no visibility into how\nthe LNK, CHM, and JS campaigns were delivered to users, but given common Lazarus modus operandi, we can speculate\nthat they may have been delivered through attachments or links in emails. We gained visibility again during the massive\nemail campaigns utilizing BTG- and Electrum-themed applications to ultimately deliver PowerRatankba. The timeline below\nillustrates the exact dates of campaigns where we are aware of them. Where exact dates are unknown, we based estimates\non first campaign observations and metadata (Figure. 2).\n\n\n-----\n\nFigure 2: Timeline of campaigns ultimately related to PowerRatankba\n\n### PowerSpritz\n\nPowerSpritz is a Windows executable that hides both its legitimate payload and malicious PowerShell command using\na non-standard implementation of the already rarely used Spritz encryption algorithm (see the “Attribution” section for\nadditional analysis of the Spritz implementation). This malicious downloader has been observed being delivered via\n[spearphishing attacks using the TinyCC link shortener service to redirect to likely attacker-controlled servers hosting the](https://tiny.cc/)\n[malicious PowerSpritz payload. In early July 2017 an individual on Twitter shared an attack they observed targeting them](https://twitter.com/LeoAW/status/881761293874610176)\n(Figure. 3) utilizing a fake Skype update lure to trick users into clicking on a link to hxxps://skype.2[.]vu/1. The TinyCC link\nredirected to a server that, at the time, would have likely returned a PowerSpritz payload: hxxp://201.211.183[.]215:8080/\nupdate.php?t=Skype&r=update\n\nFigure 3: PowerSpritz spearphishing email shared on Twitter by @LeoAW, abusing Skype name and branding\n\n\n-----\n\nWe have since discovered three additional TinyCC URLs utilized to spread PowerSpritz: one with a Telegram theme (hxxp://\ntelegramupdate.2[.]vu/5 -> hxxp:// 122.248.34[.]23/lndex.php?t=Telegram&r=1.1.9) and two more with Skype theme\n(hxxp:// skypeupdate.2[.]vu/1 -> hxxp:// 122.248.34[.]23/lndex.php?t=SkypeSetup&r=mail_new and hxxp:// skype.2[.]\nvu/k -> unknown). Some of the PowerSpritz payloads were previously hosted on Google Drive; however, we were unable to\ndetermine if that service was actually used to spread the payloads in-the-wild (ITW).\n\nPowerSpritz decrypts a legitimate Skype or Telegram installer using a custom Spritz implementation with the key “Znxkai@\nif8qa9w9489”. PowerSpritz then writes the legitimate installer to disk in the directory returned by GetTempPathA either as\na hardcoded filename such as SkypeSetup.exe or, in some versions, as the filename returned by GetTempFileNameA.\nThe installer is then executed to trick the potential victim into thinking they downloaded a legitimate, working application\ninstaller or update. Finally, Spritz uses the same key to decrypt a PowerShell command that downloads the first stage of\nPowerRatankba (Figure. 4). All three PowerSpritz samples we discovered executed the identical PowerShell command.\n\nFigure 4: Script output showing PowerSpritz PowerShell encoded and decoded command\n\n\n-----\n\nAs shown in the above decoded script (Figure. 4), PowerSpritz attempts to retrieve a payload from hxxp://dogecoin.\ndeaftone[.]com:8080/mainls.cs that is expected to be a Base64-encoded PowerShell script. After decoding mainls.cs, a\nPowerRatankba.A implant is revealed (Figure. 5) with hxxp://vietcasino.linkpc[.]net:8080/search.jsp as its command and\ncontrol (C&C).\n\nFigure 5: PowerSpritz retrieving Base64-encoded PowerRatankba\n\n### Windows Shortcut (LNK)\n\nA LNK masquerading as a PDF document was discovered on an antivirus\nscanning service. The malicious “Scanned Document Part 1.pdf.lnk” LNK\nfile, along with a corrupted PDF named “Scanned Document Part 2.pdf,”\nwere compressed in a ZIP file named “Scanned Documents.zip” (Figure.\n6). It is unclear if the PDF document was tampered with intentionally to\nincrease the chances a target would open the malicious LNK or if the\nactor(s) unintentionally used a corrupted document. We currently are not\naware of how the LNK or compressed ZIP files were utilized ITW.\n\n\nFigure 6: ZIP file with decompressed\nmalicious LNK and corrupted PDF\n\n\n[The malicious LNK uses a known AppLocker bypass to retrieve](https://www.theregister.co.uk/2016/04/22/applocker_bypass/)\n[its payload from a TinyURL shortener link hxxp://tinyurl[.]com/](https://tinyurl.com/)\ny9jbk8cg (Figure. 7). This shortener previously redirected to\nhxxp://201.211.183[.]215:8080/pdfviewer.php?o=0&t=report&m=0 . At\nthe time of analysis the C&C server was no longer returning payloads.\nHowever, the same IP was used in the PowerSpritz campaigns. Based\non the same C&C usage and similar URI structure, we assess with low\nconfidence that the LNK campaign would have delivered PowerRatankba\nvia PowerSpritz.\n\n\nFigure 7: Malicious LNK AppLocker bypass to retrieve payload\n\n\n-----\n\n### Microsoft Compiled HTML Help (CHM)\n\nSeveral malicious CHM files were uploaded to a multi antivirus scanning service in October, November, and December. We\ninspected the compressed ZIP metadata to better understand the likely chronological order in which the CHMs were used.\nUnfortunately we have been unable to determine how these infection attempts were delivered to victims ITW. The themes of\nthe malicious CHMs include:\n\n- A confusing, poorly written request for assistance with creating a website with possible romantic undertones (Figure. 8-1)\n\n- Documentation on a blockchain technology called ALCHAIN from Orient Exchange Co. (Figure. 8-2)\n\n[• A request for assistance in developing an initial coin offering (ICO) platform (Figure. 8-3)](https://en.wikipedia.org/wiki/Initial_coin_offering)\n\n- White paper on the Falcon Coin ICO (Figure. 8-4)\n\n- A request for applications to develop a cryptocurrency exchange platform (Figure. 8-5)\n\n- A request for assistance in creating an email marketing tool (Figure. 8-6)\n\nFigure 8: CHM lures utilized in attempts to deliver PowerRatankba\n\n[All of the CHM files use a well-known technique to create a shortcut object capable of executing malicious code and then](https://github.com/samratashok/nishang/blob/master/Client/Out-CHM.ps1)\ncausing that shortcut object to be automatically clicked via the “x.Click();” function. Two different methods were used\nacross the CHMs to retrieve the malicious payload.\n\nThe first method uses a VBScript Execute command and BITSAdmin tool to download a malicious VBScript file (Figure.\n9). The payload is downloaded (Figure. 10) from hxxp://www.businesshop[.]net/hide.gif and saved to C:\\windows\\temp\\\nPowerOpt.vbs. Once the downloaded VBScript (Figure. 10) is executed, it will attempt to download PowerRatankba from\nhxxp://158.69.57[.]135/theme.gif, saving the expected PowerShell script to C:\\Users\\Public\\Pictures\\opt.ps1.\n\n\n-----\n\nFigure 9: Malicious code embedded in CHM to download a VBScript PowerRatankba downloader\n\nFigure 10: BITSAdmin retrieving malicious payload over HTTP\n\n\n-----\n\nThe second method downloads a similar VBScript-based PowerRatankba downloader using PowerShell directly in the CHM\n(Figure. 11). A similar VBScript Execute command is utilized to call PowerShell’s DownloadString to execute the payload\ndirectly from hxxp://92.222.106[.]229/theme.gif\n\nFigure 11: PowerShell utilized in CHM to retrieve PowerRatankba downloader VBS\n\nThe 5_6283065828631904327.chm (030b4525558f2c411f972d91b144870b388380b59372e1798926cc2958242863)\ncontains notable pieces of unused code as well as code pointing to an RFC1918 private IP address in the decompressed\ndoc.htm file (Figure. 12). The first excerpt of unused code consists of a more traditional PowerShell command that\ndownloads a script from hxxp://192.168.102[.]21/power.ps1. The next block of code adds an obfuscation technique (also\npresent in other related CHMs) where the quotes are replaced with the “*” character. This obfuscated code downloads\na PowerShell payload from the same RFC1918 address but from a different URI: hxxp://192.168.102[.]21/pso.ps1. We\nassess that this is likely a remnant of the author developing the malicious CHM method using their local environment rather\nthan using code stolen from an unrelated CHM, tool, or other malicious payload. Additionally, another piece of commented\ncode follows which executes a VBScript file “C:\\Users\\dolphinePC\\Downloads\\run_32.vbs”. This may offer another clue\nto the developer’s environment that has a possible username of dolphinePC. Finally, a PowerRatankba.B implant was\nembedded in the same CHM as aa.ps1 and conFigured with C&C servers of 92.222.106[.]229 and 158.69.57[.]135.\n\nFigure 12: Leftover code in 5_6283065828631904327.chm\n\nAs a final note on the CHM campaigns, the following three samples contain an email address of either\nrobert_mobile@gmail[.]com or robert_mobile@mail[.]com, which we assess with some confidence are related to\nthe threat actor:\n\n- 772b9b873100375c9696d87724f8efa2c8c1484853d40b52c6dc6f7759f5db01\n\n- 6cb1e9850dd853880bbaf68ea23243bac9c430df576fa1e679d7f26d56785984\n\n- 9d10911a7bbf26f58b5e39342540761885422b878617f864bfdb16195b7cd0f5\n\n### JavaScript Downloaders\n\nThroughout November several compressed ZIP files containing a JavaScript (JS) downloader were observed being hosted\non likely attacker-controlled servers. We are not currently aware if or how these files were delivered to potential victims. The\nnaming of the files and the decoy PDF documents they retrieve provide some clues about the nature of the lures. Themes\n[include the cryptocurrency exchanges Coinbase and Bithumb, the Falcon Coin ICO, and a list of Bitcoin transactions.](https://www.coinbase.com/?locale=en)\n\n[Each JavaScript downloader is obfuscated (Figure. 13) using JavaScript Obfuscator (see “Attribution” section for additional](https://javascriptobfuscator.com/Javascript-Obfuscator.aspx)\nanalysis) or a similar tool. After de-obfuscating (Figure. 14), the logic of the malicious downloader is very straightforward. First,\nan obfuscated PowerRatankba.B PowerShell script is downloaded from a fake image URL such as: hxxp://51.255.219[.]82/\ntheme.gif. Next, the PowerShell script is saved to C:\\Users\\Public\\Pictures\\opt.ps1 and then executed.\n\n\nThe 5_6283065828631904327.chm (030b4525558f2c411f972d91b144870b388380b59372e1798926cc2958242863)\ncontains notable pieces of unused code as well as code pointing to an RFC1918 private IP address in the decompressed\ndoc.htm file (Figure. 12). The first excerpt of unused code consists of a more traditional PowerShell command that\ndownloads a script from hxxp://192.168.102[.]21/power.ps1. The next block of code adds an obfuscation technique (also\npresent in other related CHMs) where the quotes are replaced with the “*” character. This obfuscated code downloads\na PowerShell payload from the same RFC1918 address but from a different URI: hxxp://192.168.102[.]21/pso.ps1. We\nassess that this is likely a remnant of the author developing the malicious CHM method using their local environment rather\nthan using code stolen from an unrelated CHM, tool, or other malicious payload. Additionally, another piece of commented\ncode follows which executes a VBScript file “C:\\Users\\dolphinePC\\Downloads\\run_32.vbs”. This may offer another clue\nto the developer’s environment that has a possible username of dolphinePC. Finally, a PowerRatankba.B implant was\nembedded in the same CHM as aa.ps1 and conFigured with C&C servers of 92.222.106[.]229 and 158.69.57[.]135.\n\n\n-----\n\nFigure 13: Obfuscated falconcoin.js\n\nFigure 14: Deobfuscated falconcoin.js revealing PowerRatankba and decoy PDF URLs\n\nThe last step in execution is to retrieve the decoy PDF from hxxp://51.255.219[.]82/files/download/falconcoin.pdf and open\nit using rundll32.exe and shell32.dll,OpenAs_RunDLL (Figure. 15-1). Samples using Coinbase and Bithumb themes also\ndownloaded PDF decoys (Figure. 15-2,15-3). Additionally we discovered that the content from the Coinbase decoy has\nbeen used in Lazarus group-attributed espionage campaigns (see Attribution for more details).\n\n\n-----\n\nFigure 15: Decoys downloaded or sent along with PowerRatankba JavaScript downloaders\n\n### VBScript Macro Microsoft Office Documents\n\nTwo VBScript macro-laden Microsoft Office documents have been observed associated with this activity: one Word\ndocument and one Excel spreadsheet. The Word document (b3235a703026b2077ccfa20b3dabd82d65c6b5645f7f1\n5e7bbad1ce8173c7960) uses an Internal Revenue Service (IRS) theme and was sent as an attachment named “report\nphishing.doc”. The spearphishing email was sent from an @mail.com address with the subject of “Phishing Warnning”[sic].\nIronically, the sender email address was spoofed as phishing@irs.gov (Figure. 16) while the content of the lure (Figure. 17)\n[was likely copied from an official IRS webpage.](https://www.irs.gov/privacy-disclosure/report-phishing)\n\nFigure 16: (Left) Spearphishing email spoofed sender\nand subject\n\nFigure 17: (Left) IRS themed Word document\nPowerRatankba downloader\n\nThe IRS-themed malicious document uses a macro\nto download a PowerRatankba VBScript from\nhxxp://198.100.157[.]239/hide.gif (Figure. 18), save it to C:\\\nUsers\\Public\\Pictures\\opt.vbs, and execute it with wscript.\nexe. It in turn downloads the PowerRatankba.B from\nhxxp://198.100.157[.]239/theme.gif, saving the downloaded\npayload to C:\\Users\\Public\\Pictures\\opt.ps1, and finally\nexecuting it with powershell.exe.\n\n\n-----\n\nFigure 18: IRS-themed malicious document macro\n\n[The second malicious Office document we discovered is an Excel spreadsheet named bithumb.xls. It uses a Bithumb lure](https://www.irs.gov/privacy-disclosure/report-phishing)\n(Figure. 19) and includes stolen branding. The spreadsheet was found compressed in a ZIP file named Bithumb.zip along\nwith a decoy PDF document named “About Bithumb.pdf” (Figure. 20).\n\nFigure 19: Malicious Bithumb Excel spreadsheet with English option shown, with stolen branding\n\nFigure 20: “About Bithumb.pdf decoy” document inside Bithumb.zip archive, with stolen branding\n\nThe Excel spreadsheet contains a macro with an embedded Base64-encoded PowerRatankba VBScript downloader\n(rather than retrieving it from a C&C using HTTP (Figure. 21)). The embedded VBScript is first dropped to disk at c:\\Users\\\nPublic\\Documents\\Proxy.vbs and then executed using wscript.exe. The dropped VBScript file is conFigured to download\nPowerRatankba from hxxp://www.energydonate[.]com/images/character.gif while saving the downloaded payload to C:\\\nUsers\\Public\\Documents\\ProxyAutoUpdate.ps1.\n\n\n-----\n\nFigure 21: Base64 encoded PowerRatankba downloader embedded in bithumb.xls\n\n### Backdoored PyInstaller Applications\n\nMost recently, several large email phishing campaigns attempted to trick unsuspecting victims into visiting fake webpages\nto download or update cryptocurrency applications. The copycat websites were mirror images of legitimate websites with\nsoftware download links pointing to the correct installers hosted on the legitimate websites. The only exception was the\n[link to download the Windows version of the application, which was hosted on the copycat websites. These PyInstaller](http://www.pyinstaller.org/)\nexecutables were backdoored with a few lines of Python code added to download the PowerRatankba implant.\n\nThe first campaign that utilized this technique used a Bitcoin Gold (BTG) theme to trick the targets into visiting an\n[internationalized domain name (IDN) website (Figure. 22). An email was sent to targets offering a BTG wallet application](https://en.wikipedia.org/wiki/Internationalized_domain_name)\nalong with a link to the malicious website: hxxps://xn--bitcoingld-lcb[.]org/. However, web browsers and email clients would\ndisplay the link as follows: hxxps://bitcoingöld[.]org/. Emails in this BTG campaign were sent between approximately\nNovember 10-16, 2017. Some of the known sender emails include but are not limited to: info@xn--bitcoingod-8yb[.]com,\ninfo@xn--bitcoigold-o1b[.]com, and tech@xn--bitcoingld-lcb[.]org. Campaigns using IDN can be difficult to recognize as\nmalicious because they are typically very similar to the mimicked legitimate domains except for a single character (Figure.\n23). (see IOC section for more likely related IDNs)\n\n\n-----\n\nFigure 22: (Left) Sample email containing a URL to malicious\nIDN hosting PyInstaller PowerRatankba downloader. The IDN\nemail address is emphasized in a red box.\n\nFigure 23: Excerpt from phishing email showing the IDN link\nwith red arrow pointing to internationalized character\n\n[Many thanks to Yonathan Klijnsma (@ydklijnsma) of RisqIQ,](https://twitter.com/ydklijnsma)\nwhose assistance allowed us to analyze a historical scrape of\none of the web pages hosting the malware at xn--bitcoingldlcb[.]org. In the scrape, an additional text and a button were\ninserted in place of the BTG logo. The button used JavaScript to\ndownload a payload from hxxps://bitcoingöld[.]org/bitcoingold.\nexe (IDN: xn--bitcoingld-lcb[.]org) (Figure. 24). Additional\ndifferences are likely the result of changes to the legitimate\nwebsite (Figure. 25) since the malicious campaign.\n\nFigure 24: Malicious BTG website hosting Figure 25: Legitimate BTG website showing difference\nPowerRatankba downloader. Credit: RisqIQ between legitimate and malicious websites (note: this\nscreenshot was not taken on the same day as the\nscreenshot of the malicious website)\n\n\n-----\n\nOnce clicked, the button on the malicious BTG page would have directed a victim to download a payload\nfrom hxxps://bitcoingöld[.]org/bitcoingold.exe. At the time of our analysis, this URL was not returning content.\nHowever, we discovered from a comment on a multiple anti-virus scanning service that someone targeted\nby this campaign had uploaded a payload downloaded from the fake website. The file in that case was\nnamed ElectronGold-1.1.1.exe (eab612e333baaec0709f3f213f73388607e495d8af9a2851f352481e996283f1).\nWe also found a similar payload with unknown origin named ElectronGold-1.1.exe\n(b530de08530d1ba19a94bc075e74e2236c106466dedc92be3abdee9908e8cf7e).\n\n[The second campaign we discovered used a fake Electrum update as the lure to similarly direct victims to a malicious IDN](https://electrum.org/#home)\nresembling the legitimate electrum.org website (Figure. 26). The emails in this case were sent, based on our visibility, using\na unique @mail.com email address for each recipient, and at least some of the emails were sent between November 1821, 2017. A subject of “New Electrum Wallet Released” was used to trick victims into thinking that they needed to download\nan update for Electrum to be able to use Segwit2X and Bitcoin Gold. If a victim clicked on the malicious link, they were\npresented with what appeared to be a normal version of Electrum’s official website (Figure. 27).\n\nFigure 26: Phishing email with fake Electrum Figure 27: A fake website with links to backdoored installation\nwallet application update announcement packages highlighted in red boxes and internationalized\ncharacter noted by red arrow\n\nEach of the links highlighted in red led to a malicious payload hosted directly on the same server: hxxps://xn--electrm-s2a[.]\norg/electrum-3.0.3.exe (Figure. 28). The electrum-3.0.3.exe is a backdoored PyInstaller that is conFigured to download a\nVBScript PowerRatankba downloader.\n\n\n-----\n\nFigure 28: HTML code from malicious Electrum webpage\n\nIn both campaigns, the same malicious Python code was injected into the PyInstallers, specifically into \\gui\\qt\\installwizard.\npy. The backdoor code in each campaign is nearly identical except for the target URL and the file name to which the\ndownloaded VBScript is saved (Figure. 29).\n\nFigure 29: Side-by-side comparison of backdoored installwizard.py scripts. Left: BTG, Right: Electrum\n\nThe BTG campaign was conFigured to download a VBScript from hxxp://www.btc-gold[.]us/images/top_bar.gif while\nsaving the downloaded script to C:\\Users\\Public\\Documents\\diff.vbs. We were unable to retrieve this file but suspect a\nPowerRatankba variant would have been downloaded based on other campaigns.\n\nThe Electrum campaign was similarly conFigured to download a VBScript; however, in this case we were able to analyze\nthe downloaded payload. The backdoored installwizard.py downloaded a script from hxxp://trade.publicvm[.]com/\nimages/top_bar.gif (see “Attribution” section for more commentary) while saving the downloaded script to C:\\Users\\Public\\\nDocuments\\Electrum_backup.vbs. The downloaded Electrum_backup.vbs was a PowerRatankba downloader with a target\nURL of hxxp://trade.publicvm[.]com/images/character.gif, which ultimately delivered a PowerRatankba implant with a C&C\nof trade.publicvm[.]com.\n\n## Implant Description and Analysis\n\nThree key implants were used at various points in these campaigns. The implants -- PowerRatankba, Gh0st RAT, and\nRatankbaPOS -- and specific variations are described in detail below.\n\n### PowerRatankba Description\n\nPowerRatankba is used for the same purpose as Ratankba: as a first stage reconnaissance tool and for the deployment\nof further stage implants on targets that are deemed interesting by the actor. Similar to its predecessor, PowerRatankba\nutilizes HTTP for its C&C communication.\n\nOnce executed, PowerRatankba first sends detailed information about the infected device to its C&C server via the\nBaseInfo HTTP POST (Figure. 30), including the computer name, IP address(es), OS boot time and installation date,\nlanguage, if ports 139, 3389, and/or 445 are open/closed/filtered, a process list, and (PowerRatankba.B only) output from\ntwo WMIC commands (Figure. 31).\n\n\n-----\n\nFigure 30: Initial HTTP POST containing infected device information to PowerRatankba.A C&C\n\nFigure 31: WMIC command output sent via same initial HTTP POST\n\nThere are only slight variations between the initial BaseInfo HTTP POST, such as the process list is retrieved by\nPowerRatankba.A using “tasklist /svc” while PowerRatankba.B uses just “tasklist”.\n\n### PowerRatankba.A C&C Description\n\nAfter the initial C&C check-in, PowerRatankba.A issues What HTTP GET requests (Figure. 32) to retrieve commands from\nthe C&C server. All PowerRatankba.A HTTP requests contain a randomly generated numeric UID passed in the u HTTP URI\nparameter.\n\nFigure 32: PowerRatankba.A What HTTP GET Request\n\nThis variant receives commands and sends responses in plaintext. This variant only has four commands (Table 1) including\na sleep, exit, and two different execute code functions.\n\n\n-----\n\nTable 1: PowerRatankba.A C&C commands\n\n**Command** **Description**\n\nsuccess Sleep and send request after sleep\n\nkillkill Exit\n\nExecute Download payload from provided URL and execute via memory injection\n\nDownExec Download payload from provided URL, save to disk, then execute\n\n### PowerRatankba.B C&C Description\n\nSimilar to its predecessor, PowerRatankba.B issues What HTTP requests to its C&C server after the initial check-in. Instead\nof a numeric UID, this variant uses the infected device’s double-Base64-encoded MAC address (Figure. 33).\n\nFigure 33: PowerRatankba.B What HTTP GET Request\n\nCommands from the C&C are still expected as plaintext but command parameters for all commands except interval are\nencrypted with DES using “Casillas” as both the key and initialization vector (IV) and then Base64-encoded. The response\nof the cmd command is the only data that is sent DES encrypted to the C&C whilst all other network traffic sent from the\ninfected device to the C&C is either plaintext or Base64-encoded.\n\nSeveral new commands were added to this variant (Table 2) while Execute and DownExec were replaced. The command\nexe was eventually changed to inj while functionality remained the same. Additionally, some earlier variants did not contain\nall of the commands listed below but the overall capabilities of the backdoor remained largely the same, therefore for the\npurpose of this research all variants with DES encryption are considered variant PowerRatankba.B.\n\nTable 2: PowerRatankba.B C&C commands\n\n**Command** **Description**\n\nsuccess Sleep and send request after sleep\n\nkillkill Exit\n\ninterval Change default sleep length\n\ncmd Execute command using “cmd.exe /c $cmdInst” . Command response is sent back to the\nC&C DES encrypted and Base64 encoded\n\ncf_sv Replace SCH, VBS, PS1 files with provided server location and pre-determined URI (e.g.,\n\nrrr Download payload from provided URL, write to C:\\Users\\Public\\Documents\\000.exe, and\nthen execute payload.\n\nexe or inj [Download payload from provided URL, inject into process memory using Invoke-](https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1)\n[ReflectivePEInjection](https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1)\n\n### PowerRatankba Persistence\n\nFor persistence, PowerRatankba.A saves a JS file to the victim’s Startup folder as appView.js that will\nbe executed every time the victim’s user account logs in. The persistence JS (Figure. 34) contains a\nXOR encoded PowerShell script to retrieve a Base64 encoded PowerShell from a hardcoded URL (e.g.,\nhxxp://macintosh.linkpc[.]net:8080/mainls.cs ). The encoded PowerShell script used a XOR key of\n“ZWZBGMINRQLUSVTGHWVYANJHTVUHTLTUGKOHIYOXQEFEIPHNGACNKMBWGRTJIHRANIIZJNNZHVF”.\n\n|Command|Description|\n|---|---|\n|success|Sleep and send request after sleep|\n|killkill|Exit|\n|Execute|Download payload from provided URL and execute via memory injection|\n|DownExec|Download payload from provided URL, save to disk, then execute|\n\n|Command|Description|\n|---|---|\n|success|Sleep and send request after sleep|\n|killkill|Exit|\n|interval|Change default sleep length|\n|cmd|Execute command using “cmd.exe /c $cmdInst” . Command response is sent back to the C&C DES encrypted and Base64 encoded|\n|cf_sv|Replace SCH, VBS, PS1 files with provided server location and pre-determined URI (e.g.,|\n|rrr|Download payload from provided URL, write to C:\\Users\\Public\\Documents\\000.exe, and then execute payload.|\n|exe or inj|Download payload from provided URL, inject into process memory using Invoke- ReflectivePEInjection|\n\n\n-----\n\nFigure 34: appView.js persistence JS\n\nPowerRatankba.B is capable of using two different persistence methods while only one will be used based on whether\nor not the executing user has Administrator privileges. PowerRatankba first checks if the account has administrator\nprivileges by executing the following command: “whoami /groups | findstr /c:”S-1-5-32-544” | findstr /c:”Enabled group”\n&& goto:isadministrator’’. If the user account does have administrator privileges then PowerRatankba will download a\nPowerShell script from a hardcoded location (e.g., “$BaseServer + ‘images/character.gif’”), save it to a hardcoded location\n(e.g., C:/Windows/System32/WindowsPowerShell/v1.0/Examples/detail.ps1), and finally create a scheduled task to execute\nthe downloaded PowerShell script on system startup. If the user account does not have administrator privileges then a\nVBScript file is downloaded from a hardcoded location (e.g., “$BaseServer + ‘images/top_bar.gif’”) and saved to the\nexecuting user’s Startup folder as, for example, PwdOpt.vbs or ProxyServer.vbs.\n\n### PowerRatankba.B Stage2 - Gh0st RAT\n\n[A Gh0st remote access Trojan/tool (RAT) was delivered via PowerRatankba.B to several devices running common](http://download01.norman.no/documents/ThemanyfacesofGh0stRat.pdf)\ncryptocurrency-related applications. The Gh0st RAT samples were delivered via the memory injection exe/inj command\n(Figure. 35). After decrypting the command with DES the target URL was revealed to be hxxp://180.235.133[.]235/img.gif\n(Figure. 36).\n\nFigure 35: Exe command delivered from PowerRatankba.B C&C to infected device\n\nThe fake image was actually a Base64-encoded custom\nencryptor with the embedded, encrypted Gh0st RAT as the\nfinal payload. The encryptor utilized AES in CBC-mode with\n[the NIST Special Publication 800-38A example key of](http://cryptome.info/0001/bcm/sp800-38a.htm)\n“2B7E151628AED2A6ABF7158809CF4F3C” and IV of\n“000102030405060708090A0B0C0D0E0F” (Figure. 37).\n\nFigure 36: PowerRatankba.B retrieving Base64-encoded Gh0st dropper\n\n\n-----\n\nFigure 37: AES key and IV in custom encryptor downloaded by PowerRatankba.B\n\nThe decrypted Gh0st implant is a custom variant with magic bytes of RFC18 (Figure. 38). This variant was likely based on\nversion 3.4.0.0 of Gh0st/PCRat, however we consider it likely that the author(s) have given their implants an internal version\nof 1.0.0.1 as can be observed in the decompressed initial check-in to the C&C (as well as hardcoded in the binaries) (Figure.\n39).\n\nFigure 38: Magic RFC18 value in unpacked Gh0st RAT sample\n\nFigure 39: Version 1.0.0.1 RFC18 Gh0st RAT\n\nMuch of the 3.4.0.0 code remains the same, including the usage of Zlib compression and the infamous \\x78\\x9c default\n[Zlib compression header bytes (Figure. 40) observed in countless Gh0st RAT samples over the years.](http://download01.norman.no/documents/ThemanyfacesofGh0stRat.pdf)\n\nFigure 40: Initial Gh0st check-in depicting RFC18 magic bytes and Zlib header\n\n\n-----\n\n### Gh0st RAT Purpose\nDuring our research we discovered that long-term sandboxing detonations of PowerRatankba not running cryptocurrencyrelated applications were never infected with a Stage2 implant. This may indicate that the PowerRatankba operator(s)\nwere only interested in infecting device owners with an obvious interest in various cryptocurrencies. In one case, a RFC18\nGh0st RAT was delivered to a PowerRatankba.B infected device within twenty minutes of the initial infection. From analyzing\nC&C traffic logs we assess that a Lazarus operator almost immediately viewed the screen of the infected device and then\nproceeded to take over full remote control, giving them the ability to interact with applications on the infected device,\nincluding a password-protected Bitcoin wallet application.\n\n### Shopping Spree: Enter RatankbaPOS\n\n[Beyond stealing millions of US dollars worth of cryptocurrency, we have discovered a Lazarus operation to steal point-](http://www.bbc.com/news/world-asia-42378638)\nof-sale (POS) data primarily targeting POS terminals of businesses operating in South Korea. Considering the time of\nyear, most retail businesses around the world report their highest volume of sales between November and December so\nnaturally POS is a popular target for criminals. Enter RatankbaPOS, possibly the first publicly documented state-sponsored\ncampaign to steal POS data from a POS-related framework.[1]\n\nAt this time we have been unable to determine how RatankbaPOS is being delivered; however, based on its sharing of\nC&C with PowerRatankba implants we hypothesize that Lazarus operators infiltrated at least one organization’s networks\nutilizing PowerRatankba to deploy later stage implants (including the possibility of RFC18 Gh0ST RAT) to ultimately deploy\nRatankbaPOS. Based on the fact that the file was hosted on the C&C in plaintext, and not Base64 encoded, we assess that\nRatankbaPOS was more likely deployed with a later stage implant other than PowerRatankba.\n\n### RatankbaPOS Analysis\n\nRatankbaPOS is deployed through a process injection dropper that is also capable of installing itself persistently, checking\na C&C for either an update or a command to delete itself, dropping the RatankbaPOS implant to disk, and finally searching\nfor the targeted POS process and module for injection and ultimately the theft of POS data.\n\nThe dropper first sets up persistence by creating a registry key in HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\\n_CurrentVersion\\Run\\igfxgpttray. It uses its own module file name for the registry key value. Next, it makes an HTTP request_\nto a hardcoded URL hxxp://www[.]webkingston[.]com/update.jsp?action=need_update using a hardcoded User-Agent\n(UA) of “Nimo Software HTTP Retriever 1.0” (Figure. 41) to request either instruction from the C&C to delete itself and\nremove the persistence registry key or to download an updated implant with which to replace itself. If no response is\nreturned from the C&C, RatankbaPOS will begin the process injection search.\n\nFigure 41: RatankbaPOS dropper requesting and receiving update from C&C\n\n[1 We acknowledge the excellent work from @ashley_shen_920, @051R15, and @kjkwak12 with their documentation of North Korean-related attacks on VANXATM](https://twitter.com/ashley_shen_920)\nwhich was targeting ATM devices and not directly POS.\n\n\n-----\n\nThe process injection search begins by taking a snapshot of the process list using CreateToolhelp32Snapshot. The implant\ndropper/injector will then case-insensitive search for a process named xplatform.exe which we assess is likely associated\n[with Tobesoft’s XPLATFORM UI/UX design software. If a process name match is found then a TH32CS_SNAPMODULE](http://www.nexacro.com/product/Xplatform.do)\nCreateToolhelp32Snapshot call is used to make a snapshot of xplatform.exe’s running module list. Loaded modules are\nthen iterated using Module32First and Module32Next while converting each result to lowercase by adding 0x20 to any\nuppercase letters and then finally comparing the string to ksnetadsl.dll (Figure. 42) that we assess is associated with a\n[KSNET POS framework . Finally, the filesize of ksnetadsl.dll is checked to make sure it is 98,304 bytes (Figure. 42). If a](https://www.crunchbase.com/organization/ksnet)\nsuccessful match is found then the process ID (PID) of xplatform.exe is returned. Lastly, RatankbaPOS will be written to\ndisk as c:\\windows\\temp\\hkp.dll and the PID of xplatform.exe process will be used to inject hkp.dll into xplatform.exe using\nLoadLibraryA and CreateRemoteThread (Figure. 43).\n\nFigure 42: Dropper/injector searching for ksnetadsl.dll and correct filesize\n\n\n-----\n\nFigure 43: Injecting RatankbaPOS into xplatform.exe\n\nRatankbaPOS will first hook the KSNETADSL.dll module at offset 0xB146 (Figure. 44). Interestingly there is code for\nRatankbaPOS to check KSNETADSL.dll for an exported function named 1000B146, which seems like an unusual export\nname for which to check, but this code will never be used because ‘!strcmp(“1000B146”, “1000B146”)’ will always be true.\nWe hypothesize that this feature was included either by mistake or was previously used for debugging. RatankbaPOS will\nalso log messages to a file stored in c:\\windows\\temp\\log.tmp.\n\nFigure 44: RatankbaPOS setting KSNETADSL.dll injection offset\n\nAt this point in the reverse engineering process, we would naturally begin reversing the KSNETADSL.dll module; however,\nwe have only been able to find two such modules with a filesize of 98,304 bytes:\n\n- f2f6b4770718eed349fb7c77429938ac1deae7dd6bcc141ee6f5af9f4501a695\n\n- 6c8c801bb71b2cd90a2c1595092358e46cbfe63e62ef6994345d6969993ea2d6\n\n\n-----\n\nAfter analyzing both KSNETADSL.dll modules, our preliminary assessment is that neither of the modules are the correct\ntarget for RatankbaPOS. We can at least gain some insight into the purpose of KSNETADSL.dll, which appears to be the\nhandling of encrypted and decrypted credit card numbers for a KSNET-related POS framework system (Figure. 45). Further\nanalysis of RatankbaPOS focusing on the code used for C&C revealed the likely purpose of this implant\n\nFigure 45: Screenshot showing KSNET module interaction with CARD_NO registry key\n\nOnly one HTTP POST request is programmed in RatankbaPOS for the communication to a C&C that is called via\nCreateThread in the hook handler (DoC2, Figure. 46).\n\nFigure 46: Hook handler creating new thread for C&C then hooking KSNETADSL.dll\n\nOur analysis of the C&C communication revealed a number of clues as to what was being exfiltrated. Initially, the implant\nuses strchr to find the first occurrence of “=” in the string data that is received from the hook of KSNETADSL.dll. Next,\n37-bytes beginning at 16-bytes before the position of the “=” are copied to a buffer. Finally, that buffer is compared\nto a substitution buffer that was created at the beginning of RatankbaPOS’ execution (Figure. 47). The substitution\nalgorithm uses the values starting at offset 0x30-0x39 in the “E”-filled buffer to substitute the ASCII values of “0-9” for\n“ZCKOADBLNX” as well as at offset 0x3D for substitution of ASCII “=” to “Y”. Therefore, values “0-9” will be obfuscated to\n“ZCKOADBLNX” while “=” will be obfuscated to “Y” (Figure. 48).\n\nFigure 47: Obfuscation substitution buffer created in RatankbaPOS\n\n\nOnly one HTTP POST request is programmed in RatankbaPOS for the communication to a C&C that is called via\nCreateThread in the hook handler (DoC2, Figure. 46).\n\n\n-----\n\nFigure 48: Obfuscation substitution buffer in memory\n\nTo obfuscate the data, RatankbaPOS simply uses the hex value of the cleartext ASCII string to substitute itself for a value\nin the substitution buffer. For instance, a value of “0” would be substituted to “Z” while any equals signs (“=”) will be\nsubstituted for “Y”. This method is used to likely obfuscate the data so it is harder to detect by simply glancing at network\ntraffic or through the use of heuristic-based detection of plaintext credit card data transmitted over the network. Once\nthe stolen data has been obfuscated, it is sent in a POST HTTP request to the URL /list.jsp?action=up using the same\nhardcoded UA as the injector: “Nimo Software HTTP Retriever 1.0” (Figure. 49). So far we have observed the following C&C\ndomains: www.energydonate[.]com and online-help.serveftp[.]com.\n\nFigure 49: DoC2 function that obfuscates stolen data and exfiltrates to a C&C\n\n\n-----\n\n[Based on documentation we have found online,](http://www.wisepos.net/common/down.jsp?clips=softcamp_setup_guide_20101123.doc)\nRatankbaPOS is possibly targeting plaintext track data in\nthe first 16 bytes followed by a “=” and finally followed by\nencrypted POS-related data beginning with “99” (Figure.\n50). According to the document, this is an encrypted form\nof the track data. Based on this, there is the possibility that\nthis campaign may be targeting a SoftCamp POS-related\nsoftware application, framework, or device. If we are correct\nand the values “99” always follow the “=” sign then one\ncould potentially find exfiltrated data in network traffic by\nsearching for the string “YXX” starting at offset 16 in the\nclient body of an HTTP POST request. However, more logic\nwill likely be necessary to reduce false positives but this\nopens up several options for detection.\n\nFigure 50: (Left) Documentation on South Korean POS\nsoftware depicting POS data that matches the pattern\nRatankbaPOS is searching for (markings not ours)\n\n### RatankbaPOS Targeted Region\n\nBased on the fact that RatankbaPOS is targeting a South Korean software vendor’s POS framework, including clues that\n[the length of exfiltrated data matches related POS data (document here, and another document here), we assess with high](http://www.wisepos.net/common/down.jsp?clips=softcamp_setup_guide_20101123.doc)\nconfidence that this threat is primarily targeting devices in South Korea.\n\n## Attribution to Lazarus Group\n\nAttribution is a controversial topic and arguably one of the most difficult tasks threat intelligence analysts face. However,\nbased on our research, we assess with a high level of confidence given the information available to us that the operations\nand activity discussed in this research are attributed to Lazarus Group and ultimately North Korea.\n\nIn consideration of the controversial and difficult task at hand, we are providing an above and beyond summary of just\nsome of the key pieces and overlaps to validate our assessment. Key reasons, discussed in detail below, are Encryption,\nObfuscation, Functionality, Code Overlap, Decoys, and C&C.\n\n### Encryption\n\n[In October 2016 Lazarus Group pulled off a major operation that allegedly compromised at least 20 banks in Poland as](https://badcyber.com/several-polish-banks-hacked-information-stolen-by-unknown-attackers/)\n[well as banks in other countries around the world. The attacks have been well documented by BAE, Kaspersky, ESET,](https://baesystemsai.blogspot.com/2017/02/lazarus-watering-hole-attacks.html)\n[TrendMicro, and Symantec. The attribution of this attack to Lazarus (aka, Bluenoroff) and ultimately North Korea is widely](https://blog.trendmicro.com/trendlabs-security-intelligence/ratankba-watering-holes-against-enterprises/)\n[accepted across the industry. What has not been documented publicly, to our knowledge, are the specifics behind the](https://www.nytimes.com/2017/03/25/technology/north-korea-hackers-global-banks.html)\n[implementation of the Spritz encryption cipher utilized in some of the implants surrounding the banking incidents in late](https://www.schneier.com/blog/archives/2014/10/spritz_a_new_rc.html)\n2016 and early 2017.\n\n[Spritz is self-described as a spongy RC4-like stream cipher that was designed by Ronald Rivest and Jacob Schuldt.](https://people.csail.mit.edu/rivest/pubs/RS14.pdf)\n[Multiple implementations of Spritz exist on Github in languages like C and Python. Anyone researching Lazarus Group’s](https://github.com/edwardcunningham/spritz)\nversion of Spritz will quickly find out that neither of the previously mentioned implementations will successfully decrypt\nhidden payloads in either banking related implants nor PowerSpritz’s legitimate installer payload and malicious\nPowerShell commands.\n\nThe issue, or possibly feature, in Lazarus Group’s implementation of Spritz can be found buried in a single paragraph\n[on page five of the original Spritz publication (Figure. 51). It states that addition and subtraction may be substituted for](https://people.csail.mit.edu/rivest/pubs/RS14.pdf)\nexclusive-or (XOR) and is referred to Spritz-xor.\n\n\n-----\n\nFigure 51: (Left) Excerpt from Spritz publication\nExamining Lazarus Group’s implementation of Spritz in one of the original implants utilized to compromise banks in late 2016\nand 2017 via watering hole attacks, it quickly becomes apparent that they have actually implemented Spritz-xor instead of\nthe normal Spritz algorithm (Figure. 52).\n\nFigure 52: (Left) Spritz-xor decrypt implementation in Lazarus Group’s implant from compromised banks\n\nPowerSpritz utilizes the same exact Spritz-xor implementation as the older Lazarus Group-attributed implant (Figure. 53).\nWe assess that due to how rare Spritz usage is ITW, in addition to the implemented deviation from the standard, that it is\nunlikely a different threat actor is also using this specific implementation.\n\nFigure 53: (Left) Spritz-xor decrypt implementation in PowerSpritz\n\n\n-----\n\n### Obfuscation\n\nEarlier this year several watering hole attacks targeting South Korea utilized an ActiveX 0day exploit in M2Soft to deliver\nLazarus-connected FBI-RAT and Charon implants. Some of the techniques observed in these attacks overlap with the\nJS downloader and CHM PowerRatankba campaigns. One such overlap was through the usage of a well-known JS\nobfuscation technique in both the M2Soft exploit and PowerRatankba JS downloader campaigns. The method is a public\nand widely used technique of masking strings using their hexadecimal values and placing them in an array assigned to a\nvariable with a naming structure of _0x[a-f0-9]{4} (Figure. 54).\n\nFigure 54: ActiveX M2Soft exploit utilizing JS obfuscation also observed in a PowerRatankba campaign\n\n### Functionality\n\nSeveral features in the original Ratankba implants are similar or identical when compared to PowerRatankba and\nRatankbaPOS. Furthermore, the usage of a common directory c:\\windows\\temp\\ for the storage of implants and logs are\nseen across a wide array of Lazarus Group’s toolset. A brief overview of similar features is shown in below (Table 3) while a\ndetailed description of each overlap may be found below.\n\nTable 3: Feature comparison table\n\n**Feature** **Ratankba** **PowerRatankba** **RatankbaPOS** **M2Soft Exploit** **FEIB Spreader**\n\nJSP C&C similarities X X X\n\nCommands: X X\nsuccess,killkill\n\nSleep 15 minutes loop X X\n\nc:\\windows\\temp\\ X X X X\n\nFirst consider the C&C protocols utilized in all Ratankba, PowerRatankba, and RatankbaPOS. Ratankba’s initial POST to\nC&C to divulge compromised system information uses the same BaseInfo parameter as PowerRatankba. Additionally, a\nRatankba sample (bd7332bfbb6fe50a501988c3834a160cf2ad948091d83ef4de31758b27b2fb7f) utilizes a C&C of list.jsp\nwhile RatankbaPOS utilizes an identical URIfile name for allegedly exfiltrating credit card information to a C&C. Second,\nRatankba’s supported commands include success and killkill that function identically to the respective PowerRatankba\ncommands. Furthermore, a sleep loop of 900 seconds (15 minutes) is utilized in both Ratankba and RatankbaPOS’\ndropper (Figure. 56,56).\n\nFigure 55: Ratankba command loop sleep\n\n|Feature|Ratankba|PowerRatankba|RatankbaPOS|M2Soft Exploit|FEIB Spreader|\n|---|---|---|---|---|---|\n|JSP C&C similarities|X|X|X|||\n|Commands: success,killkill|X|X||||\n|Sleep 15 minutes loop|X||X|||\n|c:\\windows\\temp\\||X|X|X|X|\n\n\n-----\n\nFigure 56: RatankbaPOS dropper target process search loop\n\nLastly, while further analyzing the M2Soft exploit discussed in the Obfuscation section, a familiar destination directory of C:\\\nwindows\\temp\\ was spotted in the deobfuscated JS (Figure. 57,58). This destination directory was also used during the\nPowerRatankba CHM campaign, by RatankbaPOS for log and implant storage, and by the FEIB spreader.\n\nFigure 57: Deobfuscated M2Soft exploit used to deliver Lazarus FBI-RAT implant\n\nFigure 58: Deobfuscated M2Soft exploit used to deliver Lazarus Charon implant\n\n### Code Overlap\n\nOn or before October 3rd, 2017, the Far Eastern International Bank (FEIB) in Taiwan was\n[hacked by Lazarus Group to steal money via the SWIFT system. One of the implants](https://baesystemsai.blogspot.com/2017/10/taiwan-heist-lazarus-tools.html)\n(9cc69d81613285352ce92ec3cb44227af5daa8ad4e483ecc59427fe23b122fce) utilized in that attack was a loader and\nspreader that writes itself to the Windows temp directory: c:\\windows\\temp\\. This directory is also used by numerous other\nLazarus Group implants including by the RatankbaPOS dropper for the payload drop location as well as for RatankbaPOS\nlogging. Additionally, there are several instances of code overlap between RatankbaPOS and the FEIB spreader implant. One\nsuch overlap includes the way in which each implant sets up persistence in almost precisely the same way (Figure. 59).\n\nFigure 59: Registry key persistence. Left: FEIB spreader, Right: RatankbaPOS dropper\n\n\nFigure 57: Deobfuscated M2Soft exploit used to deliver Lazarus FBI-RAT implant\n\n\n-----\n\n### Decoys\n\nContent found in a PowerRatankba JS downloader decoy (transaction.pdf downloaded by transaction.js) was previously\nutilized in Lazarus campaigns using techniques that have more traditionally, to our knowledge, been used for espionage\nrather than for financial gain. The campaign occurred on August 4th, 2017, where Lazarus Group impersonated a National\npolice officer of South Korea along with a malicious Microsoft Office Excel document. The malicious Excel attachment\n[utilized a macro-based VBScript XOR dropper technique that has been very well documented in public already.](https://researchcenter.paloaltonetworks.com/2017/04/unit42-the-blockbuster-sequel/)\n\nThe document used in this attack was named 비트코인 거래내역.xls\n(b46530fa2bd5f9958f664e754ae392dc400bd3fcb1c5adc7130b7374e0409924), which roughly translates to “Bitcoin\ntransaction history.” Using the macro-based VBScript XOR dropper technique a CoreDn downloader implant is dropped\nto disk with a C&C of www.unsunozo[.]org. The interesting overlap with the PowerRatankba campaigns can be found in\nthe lure used by the Excel spreadsheet (Figure. 60). The highlighted transactions, after the “Final bitcoin Address” section\nmatch with the beginning of the transactions used in the PowerRatankba decoy transaction.pdf.\n\nFigure 60: Excel CoreDn ~tmp001.xls decoy on the left, PowerRatankba transaction.pdf decoy on the right\n\nOn a final note for this aspect of the actor attribution, campaigns utilizing the VBScript XOR macro technique have\nhistorically been used for attacks more closely associated with espionage than for direct financial gain, as was the case\n[when several campaigns targeted the personal accounts of employees at US defense contractors. This behavior may offer](https://researchcenter.paloaltonetworks.com/2017/08/unit42-blockbuster-saga-continues/)\n[a clue as to the desperation North Korea has for procuring currency through illicit means, possibly due to the economic](https://en.wikipedia.org/wiki/Room_39)\nsanctions imposed on the regime. This may indicate that there has been a significant shift in directives for the Lazarus\nteam(s) that historically conducted espionage campaigns. Furthermore, several of the campaigns utilizing the old VBScript\nXOR macro technique have direct or within-one-week overlap with PowerRatankba campaigns alluding to the possibility\nthat there is in fact more than one team working under the North Korean umbrella as other companies have suggested\n[(e.g., Kaspersky’s excellent write-up on Bluenoroff).](https://securelist.com/files/2017/04/Lazarus_Under_The_Hood_PDF_final.pdf)\n\n### C&C\n\nA report was found in a Facebook post from mickeyfintech that listed a domain\nutilized in several PowerRatankba campaigns as being associated with infrastructure\nutilized in the breach of the FEIB (Figure. 61). The domain, trade.publicvm[.]com,\nwas allegedly connected to the FEIB hack. That domain was also used by several\nPowerRatankba downloaders and payloads for hosting as well as C&C. This is a low\nconfidence indicator as we have been unable to corroborate if that domain was in\nfact utilized by Lazarus in the hacking of the FEIB.\n\nFigure 61: Facebook post listing PowerRatankba domain as being associated\nwith FEIB breach\n\n\n-----\n\n## Conclusion\n\nThis report has introduced several new additions to Lazarus Group’s ever-growing arsenal, including a variety of different\nattack vectors, a new PowerShell implant and Gh0st RAT variant, as well as an emerging point-of-sale threat targeting\nSouth Korean devices. In addition to insight into Lazarus’ emerging toolset, there are two key takeaways from this research:\n\n- Analyzing a financially motivated arm of a state actor highlights an often overlooked or underestimated aspect of statesponsored attacks; in this case, we were able to differentiate the actions of the financially motivated team within Lazarus\nfrom those of their espionage and disruption teams that have recently grabbed headlines.\n\n- This group now appears to be targeting individuals rather than just organizations: individuals are softer targets, often\nlacking resources and knowledge to defend themselves and providing new avenues of monetization for a statesponsored threat actor’s toolkit.\n\n- Moreover, both the explosive growth in cryptocurrency values and the emergence of new point-of-sale malware near the\npeak holiday shopping season provide an interesting example of how one state-sponsored actor is following the money,\nadding direct theft from individuals and organizations to the more “traditional” approach of targeting financial institutions\nfor espionage that we often observe with other APT actors.\n\n## Research Contributions\n\n**Proofpoint**\n\nKafeine (@kafeine)\n\nMatthew Mesa (@mesa_matt)\n\nKimberly (@StopMalvertisin)\n\nJames Emory-Callcott (@sudosev)\n\n**External**\n\nMalc0de (@malc0de)\n\nAdam (@infosecatom)\n\nJacob Soo (@_jsoo_)\n\n**Special Thanks**\n\nWe would like to thank Yonathan Klijnsma (@ydklijnsma) and RisqIQ (@RisqIQ) for supporting\nthis research by sharing data and assisting with some of the infrastructure analysis.\n\n\n-----\n\n### Indicators of Compromise (IOCs)\n\n**PowerSpritz ITW URLs**\nhxxp://skype.2[.]vu/1\nhxxp://skype.2[.]vu/k\nhxxp://skypeupdate.2[.]vu/1\nhxxp://telegramupdate.2[.]vu/5\nhxxps://doc-00-64-docs.googleusercontent[.]com/docs/securesc/\nha0ro937gcuc7l7deffksulhg5h7mbp1/39cbphg8k5qve4q5rr6nonee\n1bueiu8o/1499428800000/13030420262846080952/*/0B63J1WTZC49h\nX1JnZUo4Y1pnRG8?e=download\n\nhxxps://drive.google[.]com/uc?export=download&id=0B63J1WTZC49hdDR0clR3cFpITVE\nhxxp://201.211.183[.]215:8080/update.php?t=Skype&r=update\nhxxp://122.248.34[.]23/lndex.php?t=SkypeSetup&r=mail_new\nhxxp://122.248.34[.]23/lndex.php?t=Telegram&r=1.1.9\n\n**PowerSpritz Hashes**\ncbebafb2f4d77967ffb1a74aac09633b5af616046f31dddf899019ba78a55411\n9ca3e56dcb2d1b92e88a0d09d8cab2207ee6d1f55bada744ef81e8b8cf155453\n5a162898a38601e41d538f067eaf81d6a038268bc52a86cf13c2e43ca2487c07\n\n**PowerSpritz C&C**\nhxxp://dogecoin.deaftone[.]com:8080/mainls.cs\nhxxp://macintosh[.]linkpc[.]net:8080/mainls.cs\n\n**Microsoft Compiled HTML Help (CHM) Hashes**\n81617bd4fa5d6c1a703c40157fbe16c55c11260723b7f63de022fd5dd241bdbf\nd5f9a81df5061c69be9c0ed55fba7d796e1a8ebab7c609ae437c574bd7b30b48\n4eb2dd5e90bda6da5efbd213c8472775bdd16e67bcf559f58802a8c371848212\n01b047e0f3b49f8ab6ebf6795bc72ba7f63d7acbc68f65f1f8f66e34de827e49\n3e91f399d207178a5aa6de3d680b58fc3f239004e541a8bff2cc3e851b76e8bb\n9d10911a7bbf26f58b5e39342540761885422b878617f864bfdb16195b7cd0f5\n85a263fc34883fc514be48da2d814f1b43525e63049c6b180c73c8ec00920f51\n6cb1e9850dd853880bbaf68ea23243bac9c430df576fa1e679d7f26d56785984\n772b9b873100375c9696d87724f8efa2c8c1484853d40b52c6dc6f7759f5db01\n6d4415a2cbedc960c7c7055626c61842b3a3ca4718e2ac0e3d2ac0c7ef41b84d\n030b4525558f2c411f972d91b144870b388380b59372e1798926cc2958242863\n\n**Microsoft Compiled HTML Help (CHM) C&C**\nhxxp://92.222.106[.]229/theme.gif\nhxxp://www.businesshop[.]net/hide.gif\n\n**MS Shortcut Link (LNK) Hashes**\nbeecb33ef8adec99bbba3b64245c7230986c3c1a7f3246b0d26c641887387bfe\n8f0b83d4ff6d8720e134b467b34728c2823c4d75313ef6dce717b06f414bdf5c\n\n**MS Shortcut Link (LNK) C&C**\nhxxp://tinyurl[.]com/y9jbk8cg\nhxxp://201.211.183[.]215:8080/pdfviewer.php?o=0&t=report&m=0\n\n**JavaScript Hashes**\ne7581e1f112edc7e9fbb0383dd5780c4f2dd9923c4acc09b407f718ab6f7753d\n7975c09dd436fededd38acee9769ad367bfe07c769770bd152f33a10ed36529e\n100c6400331fa1919958bed122b88f1599a61b3bb113d98b218a535443ebc3a7\n8ff100ca86cb62117f1290e71d5f9c0519661d6c955d9fcfb71f0bbdf75b51b3\n97c6c69405ed721a64c158f18ab4386e3ade19841b0dea3dcce6b521faf3a660\n\n41ee2947356b26e4d8aca826ae392be932cd8800476840713e9b6c630972604f\n25f13dca780bafb0001d521ea6e76a3bd4dd74ce137596b948d41794ece59a66\n\n**JavaScript C&C**\nhxxp://51.255.219[.]82/files/download/falconcoin.zip\nhxxp://51.255.219[.]82/theme.gif\nhxxp://51.255.219[.].82/files/download/falconcoin.pdf\n\n\n-----\n\nhxxp://apps.got-game[.]org/images/character.gif\nhxxp://apps.got-game[.]org/files/download/transaction.pdf\nhxxp://www.energydonate[.]com/files/download/bithumb.zip\nhxxp://www.energydonate[.]com/images/character.gif\nhxxp://www.energydonate[.]com/files/download/bithumb.pdf\n\n**MS Office Docs Hashes**\nb3235a703026b2077ccfa20b3dabd82d65c6b5645f7f15e7bbad1ce8173c7960\nb9cf1cba0f626668793b9624e55c76e2dab56893b21239523f2a2a0281844c6d\n972b598d709b66b35900dc21c5225e5f0d474f241fefa890b381089afd7d44ee\n\n**MS Office Docs C&C**\n198.100.157[.]239\nhxxp://www.energydonate[.]com/files/download/Bithumb.zip\nhxxp://www.energydonate[.]com/images/character.gif\n\n**PyInstaller Hashes**\nb530de08530d1ba19a94bc075e74e2236c106466dedc92be3abdee9908e8cf7e\neab612e333baaec0709f3f213f73388607e495d8af9a2851f352481e996283f1\neb372423e4dcd4665cc03ffc384ff625ae4afd13f6d0589e4568354be271f86e\n\n**PyInstaller Hosting or Email IDNA**\nxn--bitcin-zxa[.]org\nxn--electrm-s2a[.]org\nxn--bitcingold-hcb[.]org\nxn--bitcoigold-o1b[.]com\nxn--bitcoingld-lcb[.]com\nxn--bitcoingld-lcb[.]org\nxn--bitcoingod-8yb[.]com\nxn--btcongold-54ad[.]com\nxn--btcongold-g5ad[.]com\n\n**Likely Related IDNA**\nxn--6fgp[.]com\nxn--bitcingold-5bb.[]com\nxn--bitcingold-jbb[.]com\nxn--bitcingold-t3b[.]com\nxn--bitcoingol-4kb[.]com\nxn--bitoingold-1ib[.]com\nxn--btcoingold-v8a[.]com\nxn--bitcoingldwallet-twb[.]org\n\n**PyInstaller C&C**\nhxxp://www.btc-gold[.]us/images/top_bar.gif\nhxxp://trade.publicvm[.]com/images/top_bar.gif\n\n**PowerRatankba Hashes**\n41f155f039448edb42c3a566e7b8e150829b97d83109c0c394d199cdcfd20f9b\n20f7e342a5f3224cab8f0439e2ba02bb051cd3e1afcd603142a60ac8af9699ba\ndb8163d054a35522d0dec35743cfd2c9872e0eb446467b573a79f84d61761471\n3cd0689b2bae5109caedeb2cf9dd4b3a975ab277fadbbb26065e489565470a5c\nb265a5d984c4654ac0b25ddcf8048d0aabc28e36d3e2439d1c08468842857f46\n1768f2e9cea5f8c97007c6f822531c1c9043c151187c54ebfb289980ff63d666\n99ad06cca4910c62e8d6b68801c6122137cf8458083bb58cbc767eebc220180d\nf7f2dd674532056c0d67ef1fb7c8ae8dd0484768604b551ee9b6c4405008fe6b\nd844777dcafcde8622b9472b6cd442c50c3747579868a53a505ef2f5a4f0e26a\n\nNOTE: Several of these domains reflect themes and brands (only BTG) that are confirmed to have been used in phishing attacks. Additionally, they were\nregistered in the same timeframe, at the same registrar, with matching server characteristics that were observed in the confirmed IDNA infrastructure domains.\nThese domains in no way indicate that they have been used for attacks, nor that the themes utilized indicate that the entity in question has been targeted or\ncompromised. We simply assess that this infrastructure is related to Lazarus Group and currently do not know how or if it was utilized for campaigns.\n\n\n-----\n\n**PowerRatankba C&C**\n51.255.219[.]82\n144.217.51[.]246\n158.69.57[.]135\n198.100.157[.]239\n201.139.226[.]67\n92.222.106[.]229\napps.got-game[.]org\ntrade.publicvm[.]com\nwww.businesshop[.]net\nvietcasino.linkpc[.]net\n\n**Related Unknown Purpose C&C**\ncoinbases[.]org\nafricawebcast[.]com\nbitforex.linkpc[.]net\nmacintosh.linkpc[.]net\ncoinbroker.linkpc[.]net\nmoneymaker.publicvm[.]com\n\n**RFC18 Gh0st RAT**\n3a856d8c835232fe81711680dc098ed2b21a4feda7761ed39405d453b4e949f6\n\n**RFC18 Gh0st RAT Download Locations**\nhxxp://180.235.133[.]235/img.gif\nhxxp://180.235.133[.]121/images/img.gif\n\n**RFC18 Gh0st RAT C&C**\n180.235.133[.]235:443\n180.235.133[.]121:443\n51.255.219[.]82:443\n158.69.57[.]135:443\n\n**RatankbaPOS ITW**\nhxxp://www.webkingston[.]com/top.gif\n\n**RatankbaPOS Hashes**\nb66624ab8591c2b10730b7138cbf44703abec62bfc7774d626191468869bf21c\n79a4b6329e35e23c3974960b2cecc68ee30ce803619158ef3fefcec5d4671c98\nd334c40b42d2e6286f0553ae9e6e73e7e7aaec04a85df070b790738d66fd14fb\n2b05a692518a6102c540e209cb4eb1391b28944fdb270aef7ea47e1ddeff5ae2\n\n**RatankbaPOS Loader C&C**\nhxxp://www.webkingston[.]com/update.jsp?action=need_update\n\n**RatankbaPOS Exfiltration C&C**\nhxxp://www.energydonate[.]com/list.jsp?action=up\nhxxp://online-help[.]serveftp[.]com/list.jsp?action=up\n\n\n-----\n\n## ET and ETPRO Suricata/Snort Signatures\n\n2824864,ETPRO TROJAN Ratankba Recon Backdoor/Module CnC Beacon 1\n\n2828904,ETPRO TROJAN RatankbaPOS Dropper CnC Checkin M1\n\n2828905,ETPRO TROJAN RatankbaPOS Dropper CnC Checkin M2\n\n2828906,ETPRO TROJAN RatankbaPOS CnC Checkin\n\n2828921,ETPRO TROJAN PowerRatankba DNS Lookup 1\n\n2828922,ETPRO TROJAN PowerRatankba DNS Lookup 2\n\n2828923,ETPRO TROJAN PowerRatankba DNS Lookup 3\n\n2828924,ETPRO TROJAN PowerRatankba DNS Lookup 4\n\n2828925,ETPRO TROJAN PowerRatankba DNS Lookup 5\n\n2828926,ETPRO TROJAN PowerRatankba DNS Lookup 6\n\n2828927,ETPRO TROJAN PowerRatankba DNS Lookup 7\n\n2828928,ETPRO TROJAN PowerRatankba DNS Lookup 8\n\n2828929,ETPRO TROJAN PowerRatankba DNS Lookup 9\n\n2828930,ETPRO TROJAN PowerRatankba DNS Lookup 10\n\n2828931,ETPRO TROJAN PowerRatankba DNS Lookup 11\n\n2828932,ETPRO TROJAN PowerRatankba DNS Lookup 12\n\n2828933,ETPRO TROJAN PowerRatankba DNS Lookup 13\n\n2828934,ETPRO TROJAN PowerRatankba DNS Lookup 14\n\n2828935,ETPRO TROJAN PowerRatankba DNS Lookup 15\n\n2828936,ETPRO TROJAN PowerRatankba DNS Lookup 16\n\n2828937,ETPRO TROJAN PowerRatankba DNS Lookup 17\n\n2828938,ETPRO TROJAN PowerRatankba DNS Lookup 18\n\n2828939,ETPRO TROJAN PowerRatankba DNS Lookup 19\n\n2828940,ETPRO TROJAN PowerRatankba DNS Lookup 20\n\n2828941,ETPRO TROJAN PowerRatankba DNS Lookup 21\n\n2828942,ETPRO TROJAN PowerRatankba DNS Lookup 22\n\n2828943,ETPRO TROJAN PowerRatankba DNS Lookup 23\n\n2828944,ETPRO TROJAN PowerRatankba DNS Lookup 24\n\n2828945,ETPRO TROJAN PowerRatankba DNS Lookup 25\n\n2828946,ETPRO TROJAN PowerRatankba DNS Lookup 26\n\n2828947,ETPRO TROJAN PowerRatankba DNS Lookup 27\n\n2828948,ETPRO TROJAN PowerRatankba DNS Lookup 28\n\n2828949,ETPRO TROJAN PowerRatankba DNS Lookup 29\n\n2828950,ETPRO TROJAN PowerRatankba DNS Lookup 30\n\n2828951,ETPRO TROJAN PowerRatankba DNS Lookup 31\n\n2828952,ETPRO TROJAN PowerRatankba DNS Lookup 32\n\n2828953,ETPRO TROJAN PowerRatankba DNS Lookup 33\n\n2828971,ETPRO TROJAN RatankbaPOS POS Exfiltration\n\n\n-----\n\n##### ABOUT PROOFPOINT\nProofpoint, Inc. (NASDAQ:PFPT), a next-generation cybersecurity company, enables organizations to protect the way their people\nwork today from advanced threats and compliance risks. Proofpoint helps cybersecurity professionals protect their users from\nthe advanced attacks that target them (via email, mobile apps, and social media), protect the critical information people create,\nand equip their teams with the right intelligence and tools to respond quickly when things go wrong. Leading organizations of\nall sizes, including over 50 percent of the Fortune 100, rely on Proofpoint solutions, which are built for today’s mobile and\nsocial-enabled IT environments and leverage both the power of the cloud and a big-data-driven analytics platform to combat\nmodern advanced threats.\n\n[www.proofpoint.com](http://www.proofpoint.com) ©Proofpoint, Inc. Proofpoint is a trademark of Proofpoint, Inc. in the United States and other countries. All other trademarks contained herein are property of their respective owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.proofpoint.com/sites/default/files/pfpt-us-wp-north-korea-bitten-by-bitcoin-bug-180129.pdf"
    ],
    "report_names": [
        "pfpt-us-wp-north-korea-bitten-by-bitcoin-bug-180129.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1513783627,
    "ts_modification_date": 1513783638,
    "files": {
        "pdf": "https://archive.orkl.eu/718ee3a33c76162ea35d568bcb423f1a17e94931.pdf",
        "text": "https://archive.orkl.eu/718ee3a33c76162ea35d568bcb423f1a17e94931.txt",
        "img": "https://archive.orkl.eu/718ee3a33c76162ea35d568bcb423f1a17e94931.jpg"
    }
}