{
    "id": "ed026d5b-52da-48ef-aa6b-ac0a1d770d5a",
    "created_at": "2023-01-12T15:00:20.863009Z",
    "updated_at": "2025-03-27T02:13:58.361824Z",
    "deleted_at": null,
    "sha1_hash": "4a6403856189d79551844cc09fd6d9d6c46c3709",
    "title": "2021-11-18 - Intelligence Insights- November 2021",
    "authors": "",
    "file_creation_date": "2022-05-28T23:18:03Z",
    "file_modification_date": "2022-05-28T23:18:03Z",
    "file_size": 206037,
    "plain_text": "# See what it's like to have a partner in the fight.\n\n**[redcanary.com/blog/intelligence-insights-november-2021/](https://redcanary.com/blog/intelligence-insights-november-2021/)**\n\n_Each month, the Intel team provides Red Canary customers with an analysis of trending,_\n_emerging, or otherwise important threats that we’ve encountered in confirmed threat_\n_detections, intelligence reporting, and elsewhere over the preceding month. We call this_\n_report our “Intelligence Insights” and share a public version of it with the broader infosec_\n_community._\n\n## Highlights\n\nIn October 2021, we observed the same threats we’ve grown accustomed to seeing each\nmonth. Though the relative rankings largely remained the same, the volume of activity\n[associated with Yellow Cockatoo and](https://redcanary.com/blog/yellow-cockatoo/) [TA551 respectively decreased. Despite its ranking,](https://redcanary.com/threat-detection-report/threats/TA551/)\nTA551 affected approximately 1.1% of customers in October, compared to 2.5% of\ncustomers in September. Similarly, Yellow Cockatoo affected approximately 1.1% of\ncustomers in October, compared to 2.7% in September. Lest you get complacent and think\nthese prevalent threats are waning, the end of the month saw a surge from a previously\n[prolific phisher pushing a familiar foe: Qbot is on the rise again, propelled by TR campaigns](https://redcanary.com/threat-detection-report/threats/qbot/)\nleveraging SquirrelWaffle. More on that and other interesting insights from the month are\nbelow.\n\n\n-----\n\nAs we ve done for the past few months, we again looked at the 10 most prevalent threats\nencountered in the environments that Red Canary monitors. These prevalence rankings are\nbased on the number of unique customer environments in which we observed each threat.\n[For more information on any of these threats, check out Intelligence Profiles. Here’s how](https://help.redcanary.com/hc/en-us/sections/1500000175842-Intelligence-Profiles)\nthe numbers shook out for October 2021:\n\nTOP THREATS IN OCTOBER 2021\n\n**October rank** **Threat name** **Percent of customers affected**\n\n\nOctober rank :\n⬆ 1\n\nOctober rank :\n⬇ 2*\n\nOctober rank :\n➡ 2*\n\nOctober rank :\n⬆ 2*\n\nOctober rank :\n➡ 5*\n\nOctober rank :\n⬆ 5*\n\nOctober rank :\n⬆ 7*\n\nOctober rank :\n⬇ 7*\n\nOctober rank :\n➡ 9*\n\nOctober rank :\n⬆ 9*\n\n\nThreat name:\n[Mimikatz](https://redcanary.com/threat-detection-report/threats/mimikatz/)\n\nThreat name:\n[Yellow Cockatoo](https://redcanary.com/blog/yellow-cockatoo/)\n\nThreat name:\n[TA551](https://redcanary.com/threat-detection-report/threats/TA551/)\n\nThreat name:\n[Gamarue](https://redcanary.com/threat-detection-report/threats/gamarue/)\n\nThreat name:\n[Cobalt Strike](https://redcanary.com/threat-detection-report/threats/cobalt-strike/)\n\nThreat name:\nImpacket\n\nThreat name:\n[Qbot](https://redcanary.com/threat-detection-report/threats/qbot/)\n\nThreat name:\nSocGholish\n\nThreat name:\nMetasploit\n\nThreat name:\nWannacry\n\n\nPercent of customers affected :\n1.6%\n\nPercent of customers affected :\n1.1%\n\nPercent of customers affected :\n1.1%\n\nPercent of customers affected :\n1.1%\n\nPercent of customers affected :\n1.0%\n\nPercent of customers affected :\n1.0%\n\nPercent of customers affected :\n0.7%\n\nPercent of customers affected :\n0.7%\n\nPercent of customers affected :\n0.5%\n\nPercent of customers affected :\n0.5%\n\n\n-----\n\n⬆ = trending up from previous month\n⬇= trending down from previous month\n➡ = no change in rank from previous month\n\n*Denotes a tie\n\n## NodeJS with a side of XMRig\n\nThird-party developer libraries and packages are an inescapable part of modern\ndevelopment, and the compromise of one package can cascade and affect multiple\nsubsequent packages that depend on a single one. While fallout from a compromise of a\npopular NPM package last month appears relatively limited, the incident was a stark\nreminder of how adversaries can exploit organizations’ reliance on trusted development\ntools. In fact, as we’re getting ready to publish this, we’re investigating a new potentially\ncompromised package.\n\nIn October 2021, Red Canary identified a compromised package in NPM, a package\ndistribution and management utility for JavaScript libraries. The compromised version of the\npackage, `ua-parser-js, distributed an XMRig cryptominer to Windows and Linux`\nsystems, as well as an infostealer (likely DanaBot) to Windows systems. Though the\npackage is downloaded nearly 8 million times each week and the impact could have been\n[widespread, GitHub quickly issued an advisory warning users that updating that package,](https://github.com/advisories/GHSA-pjwm-rvh2-c87w)\nor anything that depended on it, would initiate malicious behavior on affected systems.\n\nIn this case, we detected the compromised version of `ua-parser-js with detectors`\ndesigned to identify the cryptominer and infostealer it distributed. Detection opportunities for\nthis category of threat inherently depend on which malware a poisoned package contains.\n\n### Detection opportunity: Certutil downloading a file\n\nThis detection opportunity will identify instances of Certificate Authority Utility\n( certutil.exe ) with command-line arguments to download an arbitrary file. This\nbehavior is commonly observed across multiple threats and is one reliable way adversaries\nuse to download tools on Windows.\n\nprocess == `certutil.exe`\n\n&&\ncommand_line_contains == `urlcache`\n\n## When TR delivers SquirrelWaffle, ransomware precursors may soon follow…\n\n\n-----\n\n[In late October 2021, Red Canary observed an uptick in detections involving TR (a delivery](https://www.binarydefense.com/icedid-gziploader-analysis/)\n[affiliate) and SquirrelWaffle. In some cases where we detected TR delivering SquirrelWaffle,](https://www.zscaler.com/blogs/security-research/squirrelwaffle-new-loader-delivering-cobalt-strike)\nwe observed additional payloads and domain reconnaissance beginning within minutes.\n[The short dwell time, combined with recent external reporting that suggests new TR](https://twitter.com/GossiTheDog/status/1455204386834206729?s=20)\ntradecraft can bypass certain email protections, highlights the need to detect and respond\nto these behaviors in near real time to avoid late-stage activity such as ransomware.\n\n**Recent initial access tradecraft may allow adversaries to bypass certain**\n**protections provided by secure email gateways, increasing the odds that a**\n**malicious email is delivered to users’ inboxes. In early November, security**\nresearchers **[reported that TR used compromised, on-premises Exchange servers to](https://twitter.com/GossiTheDog/status/1455204386834206729?s=20)**\nsend malicious emails to potential victims. As context, successful exploitation of\n[Microsoft Exchange on-premises products enables system access, control of an](https://www.ic3.gov/Media/News/2021/210310.pdf)\nenterprise email server, and **[access to enterprise email accounts. This access](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)**\neffectively allows an adversary to send and receive email from a victim’s account with\nthe legitimacy of a trusted, internal sender.\n**Decreased dwell time underscores the criticality of detecting and responding to**\n**ransomware precursor activity quickly. In one incident, operators executed Cobalt**\nStrike and BloodHound—hallmark ransomware precursors—only 75 minutes after a\nuser first opened the malicious XLS phishing lure that initiated SquirrelWaffle. Short\ndwell times necessitate a clear understanding of adversary behavior and a robust\ntoolbox of detection analytics to identify this behavior.\n\n### Detection opportunity: Excel spawning Regsvr32\n\nThis detection opportunity will identify instances of `regsvr32.exe spawning as a child`\nprocess of Microsoft Excel. This behavior is commonly observed in malicious documents\nwith macros or Dynamic Data Exchange (DDE) execution, notably SquirrelWaffle XLS\ndocuments delivered by TR.\n\nparent_process == `excel.exe`\n\n&&\nprocess == `regsvr32.exe`\n\n## With a twinkle in its eyes, Gamarue makes the ascent\n\nWhile most of us were reaching for our favorite pumpkin spice latte this past month,\nGamarue’s spot in our rankings suggests that many others opted to reach for their thumb\ndrives instead. Gamarue is a malware family used as part of a botnet. Some variants of\nGamarue are worms and frequently spread via infected USB drives. Gamarue has also\n\n\n-----\n\nbeen used to spread other malware, steal information, and perform other activities such as\nclick fraud. This malware was first seen more than 10 years ago and evolved into multiple\n[variants before the operator was arrested in 2017.](https://www.recordedfuture.com/ar3s-behind-andromeda/)\n\nThough Gamarue is no longer actively developed, it remains a pervasive threat. This\n[highlights the notion that even if a threat is no longer active, it still warrants consideration](https://docs.google.com/document/d/1L9LZlKc-QKMCFUbEGsk2JrEkD7RgtvJ6lUXm3gN3qJQ/edit#:~:text=https%3A//www.virusbulletin.com/virusbulletin/2018/02/review-evolution-andromeda-over-years-we-say-goodbye/)\nfrom defenders tasked with responding to threats and building new detection logic.\n\n### Detection opportunity: Rundll32 Gamarue CLI\n\nWhile we love to focus on detection opportunities that can identify multiple different threats\nby identifying uncommon types of behavior, this detection opportunity focuses on activity\nthat is specific to multiple different Gamarue variants. Below you will find various examples\nthat can be used to identify these variants executing.\n\n1.\n\n1.\n\n1.\n\n1.\n\n1. `\\--_--_--_-__--_-__-__-__-_--__---_--_--_--_.--_--`\n```\n              _--_-__--_-__-__-__-_--__---_--_--_-              _,LFoRW4dX01fM8FeX\n\n```\n2. `\\_--_____--__----__--____---_----.{0B5C7B4B-7F44-`\n```\n              02BE-99D4-8C4E124562AD},qwertyuiop123456\n\n```\n3. `\\\\\\\\\\\\\\\\\\\\\\~%%@@~%%@@~%%@@~.2,1abcDEfgHIJ2klM4`\n\nIn conjunction with this detection opportunity, you may be able to identify the name of an\ninfected thumb drive that was plugged into the endpoint by looking for registry modifications\nto [UserAssist registry keys containing the ROT13 encoded string](https://docs.google.com/document/d/1L9LZlKc-QKMCFUbEGsk2JrEkD7RgtvJ6lUXm3gN3qJQ/edit#:~:text=Windows-userassist-keys) `.yax at the same time.`\nThese registry values can be decoded to look something like `f:\\usb drive (8gb).lnk,`\nwhich may be indicative of a USB drive being the culprit.\n\nprocess == `rundll32.exe`\n\n&&\ncommand_line_matches == `\\\\[-_.]+\\,\\w+`\n\nprocess == `rundll32.exe`\n\n&&\ncommand_line_matches == `\\\\[-_]+\\.\\{[A-Z0-9-]{36}\\}\\,\\w+`\n\nprocess == `rundll32.exe`\n\n&&\ncommand_line_matches == \\\\+[~$%@]+\\.\\d\\,\\w+\n\n\n-----\n\n### Detection opportunity: Rundll32 spawning Explorer\n\nThis detection opportunity hinges on the likelihood of `rundll32.exe spawning`\n```\nexplorer.exe . Red Canary often observes Gamarue spawning the explorer.exe\n\n```\nprocess in an unusual way.\n\nparent_process == `rundll32.exe`\n\n&&\nprocess == `explorer.exe`\n\n### Detection opportunity: Msiexec No CLI + External Netconn\n\n[As we mentioned in our 2021 Threat Detection Report, Gamarue can still be detected by](https://redcanary.com/threat-detection-report/)\nidentifying instances of the Windows Installer ( msiexec.exe ) into which it has been\ninjected. This type of activity can be identified by creating a detection analytic that focuses\non instances of Msiexec that have no associated command-line options or an external\nnetwork connection.\n\nprocess == `msiexec.exe`\n\n&&\ncommand_line == “”\n\n&&\n\n```\nhas_external_netconn?\n\n```\n\n_*Note: Double quotes (“”) within the command line means null._\n\n## New opportunities for detecting ransomware precursors\n\nIn October, we observed Conti and Lockbit affecting multiple customer environments.\nFortunately, there are several opportunities to detect precursor behavior for these threats.\n\n**Conti precursor activity**\n\n[In October, we observed several new Qbot TTPs in environments ultimately encrypted with](https://twitter.com/redcanary/status/1448006713240547328?s=20)\nConti. Notably, we saw Qbot inject into Microsoft Synchronization Center ( mobsync.exe )\nand drop Conti DLLs. Additionally, we saw Qbot inject into Windows Error Reporting\n( werfault.exe ) with no command-line parameters. Following this, the adversary used the\n```\nxcopy utility to copy the malicious DLLs to different locations on the system. There are\n\n```\nmultiple opportunities to detect this activity in your environment:\n\n### Detection opportunity: Mobsync creating unusual DLL files\n\n\n-----\n\nThis detection analytic will identify an unusual file modification stemming from the\n```\nmobsync.exe process. We determined this file was Conti ransomware in one incident.\n\n```\nprocess == `mobsync.exe`\n&&\nfile_modification_create == `*.dll`\n\n### Detection opportunity: Werfault spawning with no command-line parameters\n\nThis detection analytic will identify unusual activity originating from the `werfault.exe`\nprocess. Werfault typically spawns with command-line parameters when a process crashes,\nproviding the program with input to create an error report.\n\nprocess == `werfault.exe`\n\n&&\ncommand_line == `“”`\n\n### Detection opportunity: Xcopy moving files from Group Policy Object (GPO) storage folder\n\nQbot created malicious files within the GPO storage folder during execution. Then, it used\nthe Extended Copy Utility ( xcopy.exe ) to copy malicious DLLs, including Conti. The\nfollowing analytic will identify this activity:\n\nprocess == `xcopy.exe`\n\n&&\ncommand_line_contains == `\\Policies\\{31B2F340-016D-11D2-945F-00C04FB984F9}\\`\n\n&&\nfile_modification_create == `*.dll`\n\n_*Note:_ `31B2F340-016D-11D2-945F-00C04FB984F9 is the default domain policy GUID`\n\n**Lockbit precursor activity**\n\nDuring a recent Lockbit infection, the operators used PsExec to launch a batch script, which\ninitiated several commands designed to prepare the environment for encryption. The batch\nscript displayed the following actions:\n\nset antivirus exclusion paths for `C:\\Programdata\\ and` `C:\\Windows\\ that allowed`\nmalicious binaries to exist in these paths without interference\ndeleted the Windows Defender service\ndisabled Windows Defender, User Account Control (UAC), and Windows Recovery\n\n\n-----\n\nturned off all firewall rules\ncleared multiple System and Security logs\n\nThe defense evasion and system recovery commands initiated by the script offer multiple\ndetection opportunities.\n\n### Detection opportunity: Disabling Windows Recovery via bcedit\n\nIn combination with the other commands witnessed in the same timeframe, the use of the\nBoot Configuration editing tool ( bcdedit.exe ) to set specific recovery options helped us\nidentify malicious activity.\n\nprocess == `bcdedit.exe`\n\n&&\nParent_process == ( “rundll32.exe” || `“regsvr32.dll” )`\n\n&&\ncommand_line_contains == `“recoveryenabled No”`\n\n### Detection opportunity: Wevtutil clearing System and Security logs\n\nThe Windows Event Log Utility Tool ( wevtutil.exe ) process deleted both System and\nSecurity event logs. This behavior is atypical in most environments.\n\nprocess == `wevtutil.exe`\n\n&&\ncommand_line_contains == `cl`\n\n&&\n(command_line_contains == `Security`\n\n||\n\ncommand_line_contains == `System )`\n\n### Detection opportunity: Netsh turning off all firewall rules\n\nSetting all of the system firewall rules to a state of “off” should be considered suspicious\nand investigated further. While this may be a “normal” system administration function in\nsome cases, it merits close review when observed with other activity associated with\nLockbit.\n\nprocess == `netsh.exe`\n\n&&\ncommand_line_contains == `advfirewall set allprofiles state off`\n\n\n-----\n\nLook familiar?\n\n[If you've run into any of these behaviors on your environment, let us know!](http://10.10.0.46/mailto:blog@redcanary.com)\n\nRelated Articles\n\nDetection and response\n\n### ChromeLoader: a pushy malvertiser\n\nDetection and response\n\n### Intelligence Insights: May 2022\n\nDetection and response\n\n### The Goot cause: Detecting Gootloader and its follow-on activity\n\nDetection and response\n\n### Marshmallows & Kerberoasting\n\n**Subscribe to our blog**\n\nOur website uses cookies to provide you with a better browsing experience. More\n[information can be found in our Privacy Policy.](https://redcanary.com/privacy-policy)\n\nX\n\n**Privacy Overview**\n\nThis website uses cookies to improve your experience while you navigate through the\nwebsite. Out of these cookies, the cookies that are categorized as necessary are stored on\nyour browser as they are essential for the working of basic functionalities of the website. We\nalso use third-party cookies that help us analyze and understand how you use this website.\nThese cookies will be stored in your browser only with your consent. You also have the\noption to opt-out of these cookies. But opting out of some of these cookies may have an\neffect on your browsing experience.\n\n\n-----\n\nNecessary cookies are absolutely essential for the website to function properly. This category\nonly includes cookies that ensures basic functionalities and security features of the website.\nThese cookies do not store any personal information.\n\nAny cookies that may not be particularly necessary for the website to function and is used\nspecifically to collect user personal data via analytics, ads, other embedded contents are\ntermed as non-necessary cookies. It is mandatory to procure user consent prior to running\nthese cookies on your website.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - Intelligence Insights- November 2021.pdf"
    ],
    "report_names": [
        "2021-11-18 - Intelligence Insights- November 2021.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535620,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1653779883,
    "ts_modification_date": 1653779883,
    "files": {
        "pdf": "https://archive.orkl.eu/4a6403856189d79551844cc09fd6d9d6c46c3709.pdf",
        "text": "https://archive.orkl.eu/4a6403856189d79551844cc09fd6d9d6c46c3709.txt",
        "img": "https://archive.orkl.eu/4a6403856189d79551844cc09fd6d9d6c46c3709.jpg"
    }
}