{
    "id": "ed0b55f2-f637-41cc-b901-d827e6d6b37c",
    "created_at": "2023-01-12T15:05:30.277657Z",
    "updated_at": "2025-03-27T02:08:40.705141Z",
    "deleted_at": null,
    "sha1_hash": "93aad1d6dd9b03aa4cfb19947ca0e0e683709a1f",
    "title": "2016-09-08 - The Philadelphia Ransomware offers a Mercy Button for Compassionate Criminals",
    "authors": "",
    "file_creation_date": "2017-09-17T19:55:22Z",
    "file_modification_date": "2017-09-17T19:55:22Z",
    "file_size": 388611,
    "plain_text": "### The digital destruction\n\n A case study of Stuxnet within the theory of new and old wars\n\nHana Hamdouni\nSwedish Defense University\nMaster's Program in War Studies\nSpring term 2017\n\nSupervisor: Fredrik Doeser\n\n\n-----\n\n## Abstract\n\nThe aim of this study is to examine the extent to which Stuxnet can be characterized as a new\n\nwar, if at all. The cyber-attack is studied within the theoretical framework of Mary Kaldor’s\n\n‘New and Old Wars’, where the case has been analysed through the perspective of both\n\nconventional and modern wars. Stuxnet is the first cyber-attack that has managed to act in\n\ncomplete secrete during a long period of time and causing its target physical destruction, while\n\nhiding all the evidence that could lead to the malware. The significance with Stuxnet is not\n\nmerely based on its sophisticated operation but rather to the selection of its target, which is the\n\nIranian nuclear enrichment program. The cyber-attack has raised questions of vulnerability and\n\nlack of securitization that the world faces in these situations. Nonetheless, it is rather difficult to\n\nprepare and secure ourselves from such attacks, if we do not understand their nature.\n\nAfter examining the aim, the actors involved and the method of Stuxnet, it becomes clear that\n\nthat the cyber-attack contain features from both old and new wars.\n\n_Keywords: Stuxnet, cyber-attack, nuclear program, new wars, old wars_\n\n\n-----\n\n# Contents\n\n### 1. Introduction                                               4\n\n1.2 Research problem                                                    5\n\n1.3 Disposition                                                         6\n\n### 2. Theory                                                   7\n\n2.1 Old wars                                                           8\n\n2.2 New wars                                                          10\n\n2.2.1 Globalization                                                      11\n\n2.2.2 Identity politics                                                    12\n\n2.2.3 The Method of Warfare                                              13\n\n### 3. Method                                                   15\n\n3.1 Research design                                                     15\n\n3.2 Qualitative content analysis                                            15\n\n3.3 Material                                                            17\n\n3.4 Operationalization                                                    17\n\n### 4. Stuxnet: new or old war?                                     20\n\n4.1 The Aim                                                           21\n\n4.2 The Actors involved                                                  26\n\n4.3 The Method of Stuxnet                                                29\n\n### 5. Discussion                                                33\n\n6. Conclusion                                                35\n\n### 7. Bibliography                                              36\n\n\n-----\n\n# 1. Introduction\n\nMankind have since the beginning of time fought with each other for various reasons, calculated\n\nstrategies to maximize their benefits and used numerous of tools to defeat their enemy.\n\nDestruction, espionage and sabotage are common concepts in warfare and are as essential parts\n\nof war today as they were over thousands of years ago. Nevertheless, there are significant\n\ndifferences on the adaption of these approaches that have evolved over time.[1]\n\nCausing destruction in a state and accessing valuable information through espionage, has usually\n\nrequired crossing the enemy’s borders. Protecting territorial borders is therefore one of the most\n\nfundamental elements of securing a state's existence as the borders work as a barrier between\n\nthemselves and potential threats.[2] However, if the enemy can cause states severe destruction\n\nwithout crossing their territory, the protection of borders, along with the understanding of the\n\nthreats we might face, must be reviewed.\n\nCyber-attacks have caused several damages on numerous countries in the recent decade and none\n\nof these states were necessarily prepared for these attacks. In 2007 Estonia was the victim of a\n\nwage of cyber-attacks, lasting for three weeks and targeting the Estonian government, Internet\n\ninfrastructure, banking and media[3]. Georgia faced similar cyber-attacks against their media and\n\nsome of their main communications channels in 2008[4]. In 2009 China was accused of releasing a\n\ncyber-spying program targeting over 100 countries and accessing valuable information.[5]\n\nHowever, in 2010 a revolutionary cyber-attack took place and was later referred to as the world's\n\nfirst digital weapon.[6] Iran discovered in 2010 that their nuclear program had been attacked for at\n\nleast a year without their knowledge by a cyber worm, later known as Stuxnet. The cyber worm\n\n1 Hamdouni, Hana (2017), \"Iran’s military cyber capability after Stuxnet\", p.3\n2 Williams, John (2016). “The Ethics of Territorial Borders: Drawing Lines in the Shifting Sand”, Palgrave\nMacmillan, p.1\n3 Geers, Kenneth (2011), “Strategic Cyber Security”, ISBN, p.84\n4 Shackelford, Scott J (2014), “Managing Cyber Attacks in international Law, Business and Relations: In search for\nCyber Space”, Kelly School of Business, Indiana University, p.171\n5 Sood, Aditya and Enbody, Richard (2014),” Targeted Cyber Attacks: Multi-staged Attacks Driven by Exploits and\nMalware”, p.5\n6 Zetter, Kim (2014) “Countdown to Zero Day: Stuxnet and the Launch of the World's First Digital Weapon. Crown\nBuisness”\n\n\n-----\n\naimed at destroying the uranium enrichment in Iran to limit the capabilities of their nuclear\n\nprogram, and thus prevent a potential nuclear weapon.[7] Even though several countries have been\n\nvictims to diverse cyber-attacks prior to the attacks against Iran in 2010, Stuxnet is argued to be\n\nthe beginning of a new war era.[8]\n\n## 1.2 Research problem \n\nMary Kaldor argues that war has adapted a new character in the post-Cold war era. She\n\naddresses several features that characterizes new wars, where one of the main targets is to\n\nachieve political goals instead of attaining geographical territories, which is usually the aim of\n\nconventional wars.[9] Not to forget one of the key arguments of Kaldor's, which is that these wars\n\nneed to be understood within the context of globalization.\n\nNumerous studies have been conducted on cyber-attacks and their relatively new role in\n\nconflicts. There are several articles and researches about Stuxnet that discusses various aspects\n\nand issues regarding the cyber worm. Some researchers, like Ronald C. Dodge, Lynn Futcher\n\n(2013)[10] and James Barret (2015)[11] discussed Stuxnet as a digital phenomenon that derives from\n\nthe increasing dependence on technological means. Others, such as George Loukas (2015)[ 12] and\n\nDorothy E. Denning (2012)[13], have instead focused on the impact of the cyber worm[14].\n\nHowever, there are no studies concerning the character of Stuxnet from the new and old war\n\nperspective. In the era of globalization and advanced technological developments, it is important\n\nto understand that the threats we are facing today are different from what they used to be.\n\nIf we do not understand the nature of contemporary threats we will not be able to neither prepare\n\nnor protect ourselves from them.\n\n7 ibid, p.3\n8 Stuxnet: Computer Worm Opens New Era of Warfare”, 60 Minutes\nhttp://www.cbsnews.com/news/stuxnet-computer-worm-opens-new-era-of-warfare-04-06-2012/ (viewed Apr 1[st,]\n2017)\n9 Kaldor, 2013, pp.73–74\n10 Dodge C. Ronald, Futcher, Lynn(Ed.) (2013) ““Information Assurance and Security Education and Training”\n11 Barret, James. Our Final Invention: Artificial Intelligence and the End of the Human Era, 2015\n12 Loukas, George (2015), “Cyber-Physical Attacks: A Growing Invisible Threat”\n13\nDenning E. Dorothy, “Stuxnet: What has changed?”, Future Internet 2012, 4(3), 672-687;\ndoi:10.3390/fi4030672\n14\nJournal of International Affairs, Dorothy E. Denning, 2012, “Stuxnet: What Has Changed?”,\nhttp://www.mdpi.com/1999-5903/4/3/672/htm (viewed Apr 1[st,] 2017)\n\n\n-----\n\nAs mentioned in the previous section, several countries have been victims of cyber-attacks prior\n\nto Iran in 2010. Nevertheless, none of these attacks have drawn as much attention as Stuxnet did.\n\nThe uniqueness of the cyber worm is not merely related to the way it was implemented but also\n\nto the physical destruction it caused the target. Stuxnet had been destroying over a 1000\n\ncentrifuges and attained valuable information from the Iranian nuclear program for at least a\n\nyear, while Iran had not the slightest suspicion of being attacked.[15] Stuxnet is therefore an\n\ninteresting case to study in relation to Kaldor’s theory of new and old wars. The research\n\nquestion that in this study is the following: To what extent can Stuxnet be categorized as a New\n\n_War, if at all?_\n\n##   1.3 Disposition\n\nThe following section is discussing the theoretical framework for this paper and is divided into\n\ntwo main parts; old wars and new wars. The section that engages new wars has four\n\nsubcategories and consists of a short introduction of the concept, followed by three\n\ncharacteristics of new wars; globalization, identity politics and method of warfare.\n\nThe next section is discussing the methodological framework for this paper. This section is\n\ndescribing the way the study is conducted, the choice of data collecting strategy and a short\n\nreview of both strengths and weaknesses of the applied method.\n\nThe fourth chapter is a presentation of the applied theoretical framework and includes a sample\n\nof previous research that is relevant for this study. The empirical analysis is divided into three\n\nsections based on Mary Kaldor's characterization of old and new wars. Kaldor divides the\n\nconcept of new wars in different categories, where each category consists of different attributes,\n\nwhile old wars are mainly based on Clausewitz perception of war. The empirical study contains\n\nof the following three categories: The aim, the actors involved and the method of warfare. Each\n\npart of the material will then be analyzed in the relevant category, for example; the material\n\nregarding the aim/s of Stuxnet will be presented in the first category. The final section is a\n\nconclusion of the study and will address an answer to the research question.\n\n15 Zetter, 2015, pp.2-3\n\n\n-----\n\n## 2. Theory\n\nAs mentioned previously, it is of great importance to identify and understand the new threats the\n\nworld might face along with the technological and political changes of our time. Mary Kaldor’s\n\ntheory of new and old wars is identifying and distinguishing traditional and modern wars. This is\n\nto provide a broader understanding of war in the modern era, which is a relevant theoretical\n\nframework for this study. New wars are a combination of wars (usually described as violence\n\nbetween political organizations and/or states for political purposes), the use of force between\n\ncriminal organizations for private motives and the abuse of human-rights (states and/or political\n\norganizations using force against individuals).[16] [17]\n\nHowever, there are opponents to the concept of ‘new wars’, such as Errol Henderson and David\n\nSinger, who argues that there are different types of warfare but that the essence of war is still the\n\nsame. ‘New wars’ are discussed to be merely the result of combined warfare’s, which has\n\ndeveloped throughout the time due to technological developments amongst other circumstances.\n\nThere are thus only one category of war and that is ‘old wars’.[18] Kaldor agrees to this description\n\nto a certain extent and more specifically in relation to the use of different warfare’s within new\n\nwars. Nonetheless, the combination of a variety of warfare methods is far from the mere feature\n\nof the concept. Kaldor argues that the concept of ‘new war’ mirrors the new reality that has\n\nemerged due to globalization and must therefore be understood within its context.[19]\n\n16 Kaldor (2013), p.2\n17 This should not be confused with the concept of ‘Hybrid war’ (introduced by Frank Hoffman, Conflict in the 21st\nCenturary: The Rise of Hybrid Wars, 2011), which is more concerned with the different types of war and the\ncombination of warfare’s. The concept suggests that wars today mainly has the same objectives as conventional\nwars, but what distingushies ‘hybrid wars’ is the variety of actors involved and the mixture of war methods. An\nexample of a hybrid war is the conflict between Hezbollah and Israel in 2006, involving a state and a non-state actor,\nwhich acted in some degree on behalf of another state. The conflict contained a variety of warfare’s including\nconventional and unconventional warfare’s such as the use of guerrilla fighters.\nDeep, Alex. Hybrid War: Old concept, New Techniques, Small War Journal, Mar 2[nd], 2015\nhttp://smallwarsjournal.com/jrnl/art/hybrid-war-old-concept-new-techniques (viewed May 11th, 2017)\n18 Henderson, Errol., Singer, David. “New Wars\" and Rumours of \"New Wars”, International Interactions: Empirical\nand Theoretical Research in International Relations 28:2, 2002, Abstract\n19 Kaldor, 2013, p.3\n\n\n-----\n\nKaldor argues that there are two timeframes that divides the concepts of new and old war, which\n\nare the post-Cold war era and the era prior to it. The wars in the post-Cold war era are conducted\n\nwithin the globalization process, they entail capabilities and aims that differ from conventional\n\nwars and requires therefore to be studied differently.[20] To understand and thus prepare for such\n\nconflicts, it is rather important to distinguish old wars from new ones and not the least to define\n\nwhat war is. According to Kaldor, the aims, involved actors and the methods of warfare are the\n\nmain differentiations between old and new wars.[21] This will be explained further in 2.2 New\n\nwars, where the different aspects of the concept are presented.\n\nIn this study Kaldor's theory of new and old wars will be applied on the case of Stuxnet, to\n\nunderstand the cyber-attack that has been argued to be the world's first cyber weapon.[22]\n\nHowever, one cannot examine if Stuxnet can be defined as a new war, according to Kaldor's\n\ntheory, without the understanding of what old wars are in the first place. The following section\n\nwill therefore present Kaldor's definition of old wars, followed by her characterization of new\n\nwars.\n\n##   2.1 Old wars \n\nKaldor's description of old wars is mainly established from Carl von Clausewitz perception of\n\nwar. According to Clausewitz, war is a social activity that is managed and coordinated mainly by\n\nmen who aim to impose physical violence towards the enemy. He argued that wars have their\n\nown unique logic and that all societies have their specific distinctive form of war.[23] The most\n\ncommon definition of war, used by military leaders and policy makers amongst others, is based\n\non a certain phenomenon that evolved in Europe in the 1400[th- ]1900[th ]century. This phenomenon\n\nis connected to the development of the modern state and has been through several changes\n\nthroughout time. Some of the most significant phases it went through was the beginning of the\n\n20 ibid, p.1-2\n21 Kaldor (2013), p.7\n22 Joshua Alvarez, Center for International Security and Cooperation, \"Stuxnet: The world's first cyber weapon\",\nFeb 3 [rd., ]2015 http://cisac.fsi.stanford.edu/news/stuxnet (viewed 18[th] Apr)\n23 Clausewitz, 1968, p. 202\n\n\n-----\n\nrather small wars between the 1500[th] -1700[th]centenary that was connected to the absolute state\n\nand the arousing of power it brought with it, to the revolutionary wars such as the American\n\nCivil War and the Napoleonic War in the 1800[th] century that were associated with the creation of\n\nnation-states, to the total wars in the beginning of the 1900[th] century and later to the \"imaginary\"\n\nCold War in the late 1900[th] century that consisted of wars of alliances and blocks.[24]\n\nAll the above-mentioned changes are different types of warfare with variations of strategies,\n\nrelations and military means. However, war was still acknowledged as the same phenomena and\n\nthe different phases it went through were merely a diversity of shapes the event could adapt. The\n\ncharacterization of the phenomena of war is as cited by Kaldor: \"...a construction of the\n\ncentralized, `rationalized', hierarchically ordered, territorialized modern state.\"[25]\n\nNevertheless, the modern state as described above is leaving room for new shapes of sovereignty\n\nthat have evolved from modern global developments and thus, making war an anachronism. [26]\n\nBut what characterizes old wars? According to Clausewitz definition, war is a violent act that\n\naims to enforce ones will over the enemy. Clausewitz defines actors in this context as states, and\n\nmerely states, thus, the will that is imposed on the enemy using force, is representing the\n\ninterests of the state. In other words, wars are fought due to state interests. [27] Although the aims\n\nin war might vary, due to the interests and the political motives that the states are seeking, the\n\nwarfare is always the same. Clausewitz argues that combat is the only way of conducting a war\n\nand thus, absolute war is simply the solely method of defeating the enemy[28]\n\nAs previously mentioned, the perception of war that most people have today began along the\n\nformation of the modern state. Prior to that, citizen militias fought battles since there were no\n\nclear distinction between the state and the civilians. In the beginning of the European stage\n\nformation, armies were created and uniforms were made to distinguish the military from the\n\ncivilians. This was mainly to distinguish criminal actors that used violence, from the state whom,\n\nwere also using violence acts. The formation of the absolute state and their armies was the\n\n24 Kaldor, 2013, pp.15–16\n25 ibid, p.17\n26 ibid, pp.16–17\n27 Clausewitz, 1968, p. 101\n28 ibid, pp.646–647\n\n\n-----\n\nfoundation of the justification of war. What justified wars is therefore the interests of the states,\n\nif a state sought certain benefits that could be achieved through war, the act was legitimized.[29]\n\n## 2.2 New wars\n\nNew wars contain features from the pre-modern era (such as the features of war described in 2.1)\n\nand modernity/post-modernity and is a phenomenon that mainly evolved in the post-Cold War\n\nera. According to Kaldor, the purpose for distinguishing old and new wars is to change the\n\ngeneral conception of war. It is necessary to identify and recognize new wars since the world is\n\nfacing a new reality. This reality, along with the new wars, needs to be understood within the\n\ncontext of globalization. Globalization is a comprehensive concept that portrays the diverse\n\nchanges of the contemporary era, which consequently has affected the nature of war.[30] The\n\nprocess of globalization has contributed to a stronger interdependence between states in many\n\nregards. Two of the main sources to the interdependence in the international arena, is the spread\n\nof democracy and the financial cooperation’s. This has led to fewer wars between nation-states,\n\nsince war could risk more than it could benefit. [31] Herfried Münkler, in agreement with the\n\nabove-mentioned argument, complements with emphasizing on the important role that both\n\nethnicity and religion has in new wars. Münkler argues that the cultural, ethnic and religious\n\nmovements are adapting the shape of social-ideologies and has been a way for mobilizing\n\nsupport for warring groups. This, amongst other events within the contemporary political realm,\n\nhas decreased the presence of military interventions and is thus one of the main distinguishes of\n\nnew wars.[32]\n\nThe following chapters are describing three of the main aspects within Kaldor’s concept of new\n\nwars, namely: globalization, identity politics and method of warfare.\n\n29 Kaldor, 2013, p.19\n30 ibid, pp. 2–3\n31Baylis, John., Smith, Steve., Owens, Patricia. The Globalization of World Politics. Oxford University Press 4th ed,\n2008, pp.211-212\n32\nMünkler, Herfried. The New Wars. 2004, pp. 1-2\n\n\n-----\n\n##    2.2.1 Globalization\n\nAccording to Kaldor, globalization is a paradoxical concept since it covers the complicated\n\nprocess that includes localization, fragmentation, homogenization and integration as well as\n\nglobalization, at the same moment. [33] However, in a more specific definition of globalization,\n\nKaldor describes it as an increased global interrelation in cultural, financial, political, military\n\nmanners and finally, the developed nature of political authority. She argues that the globalization\n\nof the 1980's and 1990's was a new phenomenon, although globalization can be traced back to\n\nmodernity or even prior to that. It has been debated that new wars are the outcome of the Cold\n\nWar, which represents a void in power. The phenomenon can also be regarded as the result of the\n\nrevolution in data processing, communication and information technologies and as the\n\nfoundation for the interconnected world we know of today. [34]\n\nAccording to Emile Simpson the inter-connectivity of globalization might destabilize the classic\n\nstrategies of war. The fundamental aspects of Clausewitz definition of war can be challenged\n\nthrough the era of globalization. One of these challenges is the increasing distinction between\n\nmilitary and political activities, which relays on the rising attention of the global audiences. The\n\nstrategies in war are becoming more thoughtful of the global audience’s judgement and is thus\n\nadjusting to suit such opinions. [35]\n\nThe new wars are evidently effected by globalization in a variety of aspects. Some of these\n\nchanges includes the humanitarian and political involvement of non-governmental organization\n\n(NGO's) and international reporters, to mention but a few. However, what seems to be one of the\n\nmain uncertainties in the debates of globalization, is the question of the future of \"territorially\n\nbased sovereignty\"[36], in other words, the absolute state. States capability to be violent towards\n\nother states unilaterally has been vastly reduced and this is due to various reasons, among them\n\nbeing the interconnections between states such as military alliances and international arms trade\n\n33 Kaldor, 2013, p. 73\n34 ibid, p. 4\n35 Simpson, Emile. War from the Ground Up: Twenty-first Century Combat as Politics, 2012, p.68\n36 Kaldor, 2012, p. 5\n\n\n-----\n\nand global norms that limits certain war acts in relation to international treaties. Thus, one could\n\nargue that the sovereignty of states is weakened, if not threatened by globalization.[37] But there\n\nare also other aspects that could threaten the absolute state in relation to globalization. If\n\nglobalization has evolved the world through technological and ethical connections, the threats\n\nthat the world faces must have changed as well in equivalence to its context.\n\n##   2.2.2 Identity politics\n\nIn old wars, political motives (argued to be one of the main reasons for states involvement in\n\nwars) were essentially linked to ideologies[38]. Political motives are still argued to be one of the\n\nmain reasons for the use of force, even in new wars. However, it is the definition of political\n\nmotives that varies from the perhaps more traditional descriptions of the term. Kaldor presents\n\ntwo features of the new wave of identity politics in the context of globalization. The first one is\n\nglobal, local, national and transnational. There are for example Diaspora communities that\n\nincrease their influences through the modern channels of communication and by the facilities of\n\ntravel and can thus share and enforce their ideas. The second feature of identity politics is\n\nbenefiting from the modern technology, where the media both delivers and constructs political\n\nand cultural norms. Horizontal cultures are evolving within the process of globalization, through\n\nnew transnational networks that are established on transnational languages such as English,\n\nwhich is connected to well recognized companies like Mc Donald’s or Coca-Cola ™ and Arabic\n\nthat nurtured modern TV channels such as Al Jazeera. [39] However, Kaldor makes a distinction\n\nbetween “Identity politics” and “Identity” in the context of conflicts in the globalization process.\n\nWhile the concept of “identity politics” is referring to religious, ethnical and racial movements,\n\n“identity” is a usage of labelling that are used as a source in political claims.[40]\n\n37 ibid, p. 6\n38 ibid, p. 8\n39 ibid, pp. 8–9\n40 ibid, p.79\n\n\n-----\n\n## 2.2.3 The Method of Warfare \n\nAnother difference between new and old wars is the type of warfare used. In old wars the aim\n\nwas more than often to occupy territories through military power and the use of force was\n\ntherefore a crucial part of war. Although the use of force is still recognized in new wars, it is not\n\na necessity to achieve the objectives. Battles are rather avoided, although used when necessary,\n\nin new wars and territories are sought to be controlled through political power instead. This\n\nmight be implemented through i.e. the imposement of a certain political identity over a\n\npopulation while demolishing the other identities.[41] This can be correlated to the concept of\n\nsmart power strategy, explained by Joseph Nye. He argues that in an increasingly decentralized\n\npolitical system, it is essential to combine soft and hard power strategies to achieve political\n\naims. However, smart power strategies must be understood within its context for it to succeed. In\n\nother words, it is vital to study the tactics in relation to the aim.[42]\n\nIn the globalization era, the aims of war are not necessarily the same as in conventional wars and\n\nrequires therefore requires a different method of warfare. Michael Sheehan argues that new wars\n\nare a product of the globalization process and consists of mainly two types of warfare. The first\n\nmethod of warfare in new wars can be found in countries like the U.S, where advanced\n\ntechnological means has been used towards traditional armies and resulted in dramatic\n\nconquests. This has led to debates regarding an eventual transformation of the conventional\n\nmilitary affairs. The second type of warfare involves mainly non-state actors and the role of\n\ntraditional military armies is therefore not as significant as they are in conventional wars.[43]\n\nNew wars can also be fought through the media, where a framework of a certain perception is\n\ncreated and widespread through i.e. televisions. In this regard, the media is a rather powerful\n\ninstrument that can change and create the moral of the public opinion. Covering a specific aspect\n\n41 ibid, p. 9\n42 Nye, Joseph S. The Powers to Lead, 2008, p.84\n43\nBaylis, John., Smith, Steve., Owens, Patricia. The Globalization of World Politics. Oxford University Press, 2008\np.211\n\n\n-----\n\nof a conflict, where one part is portrayed as the victim, while the other part as the villain, sets the\n\nground of what characterizes good and evil. Another aspect of new wars through the media is the\n\nfrequent coverages of violent conflicts in wars, which weakens the moral and political\n\nrestrictions of war since it appears as a regularity. [44] This brings us back to Nye’s argument\n\nregarding the necessity of combining soft and hard power strategies in the globalization era,\n\nwhere both policies are significant depending on the context. Soft power as described above, can\n\ntake shape in media coverage and shapes the moral discourse of the public and can thus\n\ncontribute to a certain political control, whereas hard power might be relevant in inevitable\n\nbattles.\n\n### Table 1. \n\nAs presented above, there are certain similarities yet crucial differences between new and old\n\nwars. The following table is a conclusion of the most distinctive and fundamental features of new\n\nand old wars:\n\nComponents New War Old war\n\nThe aim of war - Political control - State interests, such\n\n                - Private motives as: territory\n\n                - Identity politics: expansion, political\n\nethnic, racial and control and financial\nreligious objectives gains\n\nThe actor/s involved - States (the target can - States against other\n\nvary, i.e. against states\nindividuals or other\nstates)\n\n                - Political\n\norganizations\n\n                - Criminal\n\norganizations\n\nThe method of warfare - Avoiding the use of - Use of force\n\nforce (although used                     - Battles\nif necessary)\n\n44 ibid, p.215\n\n|and old wars:|Col2|Col3|\n|---|---|---|\n|Components|New War|Old war|\n|The aim of war|• Political control • Private motives • Identity politics: ethnic, racial and religious objectives|• State interests, such as: territory expansion, political control and financial gains|\n|The actor/s involved|• States (the target can vary, i.e. against individuals or other states) • Political organizations • Criminal organizations|• States against other states|\n|The method of warfare|• Avoiding the use of force (although used if necessary)|• Use of force • Battles|\n\n\n-----\n\n## 3. Method\n\nThis chapter is presenting the applied research design for this study, the strategy of data\n\ncollection and the methodological framework for analyzing the data.\n\n##   3.1 Research design \n\nThis study applies the case study design, where the case of Stuxnet will be analyzed as a single\n\ncase within the theoretical framework. The characterization of case study design demands an\n\nintensive and in-depth analysis, while focusing on the complexity and the character of the\n\nstudied case.[45] One of the distinguishing features of case studies, is that the researcher is\n\ngenerally concerned with identifying and illuminating the unique features of the studied case.[46]\n\nThis research has a deductive approach, meaning that it is a theory-driven study where the\n\npropositions are deduced within the theoretical framework and a general knowledge of the\n\ncase.[47]\n\nSince the aim of this paper is to study the nature of Stuxnet in a detailed manner while examining\n\nto what extent it can be characterized as Kaldor's description of new wars, the case study design\n\nis a suitable method for conducting the study. Nonetheless, as much as this research design is\n\nappropriate for studying a case in detail, it is problematic to generalize the result.[48] This study is\n\ntherefore aiming to be a contribution to this research field.\n\n## 3.2 Qualitative content analysis\n\nThe approach of qualitative content analysis will be applied in the case study, meaning that the\n\ncollected data will be studied in-depth to provide a profound understanding of the event. The\n\npurpose of qualitative data analysis is to interpret the meaning of the material in a\n\n45 Bryman, Alan. Social research methods, 4th edition, 2012, p.66\n46 ibid, pp.68-69\n47 Bryman, Bell, 2010, p.23\n48\nHamel, Jacques. Dufour, Stephane. Fortin, Dominic. Case Study Methods, 1993, p.27\n\n\n-----\n\nmethodological manner. Nevertheless, the strategy of qualitative content analysis is not able to\n\nprovide an interpretation that covers all the material and the researcher is therefore required to\n\nfocus on a specific aspect of the material that they desire to analyse.[49]\n\nThe research question is the compass that directs the qualitative content analysis towards a\n\ncertain aspect of the collected material and it is this specific feature of the strategy that differs\n\nqualitative content analysis from other qualitative methods. Although qualitative content analysis\n\ncannot cover the meaning of all the material, it is an excellent method for analysing a specific\n\nmatter in detail. Another beneficial attribute of this method is that it provides the possibility to\n\nanalyse a large amount of data, since the researcher is usually concerned with a limited aspect of\n\nthe information. [50] Qualitative research emphasizes on description and context[51] and is therefore\n\na relevant approach for examining Stuxnet in the context of Kaldor's theory, which stresses that\n\nnew wars requires to be studied within the context of globalization.\n\nAccording to Margrit Schreier all methods of qualitative data analysis has their own method for\n\novercoming the shortcomings of common understandings. The method of qualitative content\n\nanalysis uses a two-stepped strategy. First, the researcher needs to explain the meaning of the\n\nmaterial and divide the material into different sections of a coding frame. This will consequently\n\nlead to the second part of the strategy, which is the identification of the valuable parts of the\n\nmaterial.[52] This methodological strategy is applied on this study, where the collected material is\n\ndivided into different coding sections and analysed in relation to the aim of this paper. I will\n\nintentionally collect the relevant information in the collected material regarding Stuxnet, in\n\nrelation to the theoretical framework, to answer the research question. As mentioned in the\n\ndisposition, the empirical analysis is divided into three categories; the aim, the actors involved,\n\nand the method of warfare. The strategy of qualitative content analysis will assist in conducting\n\nan organized structure, since one of its characteristics, according to Schreier, is to focus on the\n\nrelevant information of the material and classify it into different categories while using a coding\n\nframe. The three categories in the empirical section will therefore be used as the coding frame\n\nthat will determine the relevance of the information in the collected material.\n\n49 Schreier, Margrit. Qualitative Content Analysis in Practice,2012, p.3\n50 Schreier, 2012, p.4\n51 Bryman, Bell, 2010, pp.392–293\n52 Schreier, 2012, p.5\n\n\n-----\n\n#   3.3 Material\n\nThe data collection will be gathered from already existing material, which will consist of both\n\nprimary and secondary sources. The primary sources consist of interviews and governmental\n\nprotocols. One of the main primary sources in this paper is the documentary “Zero days”,\n\ndirected by Alex Gibley. The documentary includes numerous interviews with a diversity of\n\ncyber-security experts, decision-makers and government officials. The secondary sources include\n\nprevious research, governmental documents, public sources and articles.\n\nThe sampling of the data is based on the relevance of the content in relation to the aim of the\n\nresearch. This is a relatively common sampling strategy in case studies since the purpose is to\n\ninvestigate the case in a detailed manner.[53] However, since the data is collected through what I\n\nfind is relevant to this research, which is a form of a subjective sampling strategy, the result\n\ncannot be generalized.[54] It is therefore of great significance to aim at collecting data from various\n\nreliable sources to minimalize the possibility of distortion. Nevertheless, the aim of this research\n\nis not to prove a certain assumption, but rather to examine if the new war theory can provide a\n\nsuitable explanation of the cyber-attack in 2010. Due to this, I believe that the probability of\n\nbeing bias when collecting the data is rather low, although I am aware of the possibility.\n\n##   3.4 Opalization\n\nThe reason for selecting to study the case of Stuxnet is mentioned in the previous chapters.\n\nNonetheless, I have yet not explained why Stuxnet is examined as a war in the first place. To\n\nunderstand the nature of Stuxnet, it is rather essential to identify the different classifications of\n\ncyber-attacks as a term.\n\n53\nBryman, Alan., Bell, Emma. Business Research Methods, Published by Oxford University Press, 2010, p.12\n54 David, Matthew & Sutton, Carole. Social Research: An Introduction, 2011, p.197\n\n\n-----\n\nAccording to Richard Clarke, former national US security director, there are four different\n\nphenomena’s regarding cyber-attacks:\n\n  - Cybercrime: the theft of money.\n\n  - Cyber hacktivism: Includes groups like Anonymous and WikiLeaks that steals\n\ninformation from the original publisher for political reasons, or organized groups who are\n\nhacking for amusements.\n\n  - Cyber espionage: Arguably the most serious matter in the cyber realm and is the digital\n\nmethod of stealing valuable information.\n\n  - Cyber war: Although it is not that common yet, the US-led sabotage against the Iranian\n\nnuclear facilities, leading to physical destruction of the centrifuges through cyber-attacks,\n\ncan be described as a war. [55]\n\nIn similarity with Clarke, Eugene Kaspersky argues that the physical destruction caused by the\n\ncyber worm and the political conflict between Iran and the US-Israeli alliance, can define\n\nStuxnet as a cyber war.[56] I am conceptualizing Stuxnet in this study accordingly to the above\npresented arguments.\n\nThe analyzation of the collected material is as previously mentioned divided into three categories\n\nbased on the theoretical framework. These categories are adapted from Kaldor’s conceptual\n\ndefinitions of new wars. Although Kaldor mentions a variety of features of new wars, I have\n\nchosen to focus on the purpose of war, the actors involved and the way of warfare. This selection\n\nis based on the belief that the above-mentioned categories are fundamental aspects that will assist\n\nin defining and characterizing Stuxnet in relation to the research question. As presented in\n\ntable.1, new and old wars have different parameters in the description of wars. I will now present\n\nhow these parameters and concepts are operationalized during this study.\n\n55 A. Clarke, Richard, The Economist’s World in 2013 Festival, Dec 8th, 2012,\nhttps://www.youtube.com/watch?v=6_ek8mugOUc (viewed May 13[th], 2017)\n56 Kaspersky, Eugene, “Cybercrimes with Ben Hammersley”. BBC news\nhttps://www.youtube.com/watch?v=4oNnSStrc38 (viewed May 13[th], 2017)\n\n\n-----\n\n_Identity politics is as mentioned in the theory chapter, one of the main goals in new wars. This_\n\nconcept is not difficult to measure since Kaldor has a rather concreate definition of the term,\n\nnamely; a movement that claim power in relation to racial, ethnic and/or religious objectives.[57]\n\n_Private motives and political motives on the other hand, are perhaps more diffuse. Both concepts_\n\nare directly linked to the actors behind the war act, which makes it essential to define whom they\n\nare in the first place. The word ‘private’ in this context refers to the privately organized criminal\n\ngroups and the private motives are thus the aims of such organizations. According to Kaldor the\n\naims of criminal groups are usually concerning financial benefits[58]. In relation to cyberattacks,\n\nthis definition is rather identical Clark’s description of ‘cybercrime’ and I will thus measure the\n\n‘private motives’ with the same parameters.\n\nKaldor refers to the ‘political motives’ as the aim of states and/or political organizations. This\n\nconcept differs from the political motives in old wars, which refers to state interests and is\n\nusually concerned with territorial expansion, economical gains and political power through a\n\nstate perspective[59]. In new wars however, the word ‘politics’ is understood within the context of\n\nglobalization and is connected to the concept of identity politics. ‘Politics’ in this perspective is\n\ntherefore related to culture, nation-tribes and/or religion[60] and will thus be used with these\n\nmeasures when conducting this study.\n\n57 Kaldor, 2013, p.7\n58 ibid., p.2\n59 Clausewitz, Carl Von. On War, 1968, pp. 119-120\n60 Kaldor, 2013, p.71\n\n\n-----\n\n## 4. Stuxnet: New or old war?\n\nFormer U.S. Secretary of Defense, Leon E. Panetta argued that cyberspace have changed the way\n\nwe live, providing people across the world to access information through various of\n\ncommunication channels, broadening the international economic sphere and contributed to a\n\nworld full of possibilities. Along with these possibilities however, comes responsibilities and\n\nnew risks. The internet is accessible for everyone, an open space which connects the world with\n\na single click. Along with this openness, a new ground of war has evolved creating a new and\n\nlimitless battlefield that makes it possible for enemies to harm states, citizens and their economy.\n\n61\n\nIn January 2009, officials from the International Atomic Energy Agency (IAEA) observed\n\nunusual circumstances at the uranium enrichment plant in Natanz, Iran. The centrifuges in\n\nNatanz were expected to remain working for about ten years, however due to the sensibility of\n\nthe centrifuges Iran replaced up to ten percent each year. It was therefore relatively usual for\n\nIran to replace around 800 centrifuges per year due to a variety of product defects and concerns\n\nregarding the maintenance.[62] Officials from the IAEA believes that approximately 2,000\n\ncentrifuges were replaced by Iran between 2009-2010, and although the cause of the damaged\n\ncentrifuges was right in front of them it took them almost a year to detect it. [63]\n\nLater in 2010, a Belarusian computer security firm detected a new type of malware, later known\n\nas Stuxnet. Although the discovery of a new type of malware was neither unexpected nor\n\nuncommon, the character and sophistication of Stuxnet was certainly different.[64]\n\nIn previous sections, the characterizations of new and old wars were presented within the\n\ntheoretical framework. The following sections will be divided into the three main features of the\n\nwars, presented in table.1, where each category will be analysed in relation to Stuxnet.\n\nBy defining and analysing the aims, the method and the actors involved in Stuxnet, I will be able\n\nto investigate if the cyber worm can be characterized as a new or old war.\n\n61Remarks by Secretary Panetta on Cybersecurity and Business Executives of National Security, New York, U.S.\nOct 11[th], 2012, Department of Defense, http://archive.defense.gov/transcripts/transcript.aspx?transcriptid=5136\n(view May 13[th], 2017)\n62 Zetter, Kim. 2014, Countdown to Zero Day: Stuxnet and the Launch of the World’s First Digital Weapon, p.1\n63 ibid, pp.2-3\n64 Rosenzweig, Paul. 2013, Thinking about Cybersecurity: From Cyber Crime to Cyber Warfare, p.3\n\n\n-----\n\n##  4.1 The aim of Stuxnet\n\nThe first reports claiming that Iran was developing nuclear weapons came in the 1970’s and\n\nsince then numerous of similar reports have accused the Iranian nuclear program for being a\n\ncamouflage for a productive and advanced base for the creation of mass destruction weapons.\n\nIran has since the time of the Shah, where the first accusations emerged, denied having the\n\nintentions of building nuclear weapons and argued that their nuclear activities are nothing but\n\npeaceful. Nonetheless, despite the large number of alarming reports against their nuclear\n\nactivities, no conclusive evidence has been presented.[65]\n\nHowever, after the fall of the Shah there has not been much data regarding Iran’s nuclear\n\nfacilities and the lack of transparency generated further accusations. Iran on the other hand,\n\ndefended itself by claiming that they were act in accordance with arms control agreements and\n\njustified each new finding by referring to the development of a peaceful national nuclear power\n\nprogram. The outcome of these developments was a series of nuclear facilities and programs\n\nwith unclear purposes. The suspicions against Iran’s nuclear weapon program grew along with\n\ntheir nuclear achievements.[66]\n\nIran’s nuclear program has been the victim of industrial sabotages for a long period of time. Due\n\nto its dependence on certain foreign modules, the nuclear program is in a particularly exposed\n\nsituation. Despite the large amount of sabotages towards Iran’s nuclear program, Stuxnet is by\n\nfar the most advanced and destructive attack of them all. [67]\n\nIn June 2009, a vicious digital weapon was secretly unleashed on computers in Iran, finding its\n\nway into the vital systems in Natanz.[ 68] This digital weapon is now more known as Stuxnet.\n\nStuxnet is a cyber worm constructed to target a certain service on a very exact sort of Siemens\n\nsoftware that are used in the crucial systems of Iran’s nuclear facilities. The software systems\n\nthat were targeted are in control of the frequency converts, which regulates the speed of the\n\ncentrifuges in the enrichment program. The cyber worm made these software systems command\n\nthe equipment to speed in a destructive manner, leading to the centrifuges destroying themselves.\n\n65 Anthony H. Cordesman, 2005,” Iran’s Developing Military Capabilities”, p. 94\n66 ibid p. 94-95\n67\n(2011) Stuxnet: targeting Iran's nuclear programme, Strategic Comments, 17:2, p.2\n68 Zetter, 2014, p.3\n\n\n-----\n\nStuxnet is therefore argued to be specifically made with the intention to sabotage Iran enrichment\n\nprogram. [69]\n\nAccording to the article “Stuxnet: targeting Iran’s nuclear programme”, the aim of Stuxnet is to\n\nmainly postpone Iran’s nuclear program through hindering their facilities to function, all this\n\nwhile acting in complete secret. The aim of Stuxnet is therefore not to sabotage Iran’s nuclear\n\nprogram in a manner that would eliminate its existence, but rather to delay it to buy the\n\nInternational community some time to pressure Iran through sanctions and negotiations and\n\nperhaps to plan for complementary policy measures. Instead of developing their already\n\nadvanced nuclear facilities Iran would be occupied with reconstructing their damaged centrifuges\n\nand reviewing their cyber defense system. The vulnerable situation of Iran after Stuxnet, would\n\ntherefore facilitate for the International community to impose their requirements. However,\n\nthere has been other, more violent, methods for delaying the Iranian nuclear facilities than cyber\nattacks. Several Iranian nuclear scientists have been assassinated through severe means such as\n\nbomb-explosions and mysterious traffic “accidents”. Cyber-attacks could therefore be argued to\n\nbe a rather unconventional but un-lethal method for delaying the developments Iran’s nuclear\n\nprogram. [70]\n\nIn similarity with the article from IISS Strategic Comments, Kim Zetter argues that Stuxnet was\n\nspecifically designed to target Iran’s nuclear facilities. Nevertheless, Zetter claims that the cyber\n\nworm was not merely constructed for delaying Iran’s nuclear program, rather it was unleashed\n\nfor one purpose and that was to damage their uranium enrichment program in such a destructive\n\nmanner that would hinder President Mahmoud Ahmadinejad from creating a potential nuclear\n\nweapon. [71]\n\nZetter is not alone with this explanation. Siemens cyber-security experts declared that Stuxnet\n\nwas found in America, Australia, parts of Africa and all over Europe. Nonetheless, over 60% of\n\nthe cyber-attack was targeting Iran alone. The geo-political situation of Iran was studied with the\n\naim of finding correlations between the cyber-attack and the political circumstances. The\n\n69 (2011) Stuxnet: targeting Iran's nuclear programme, Strategic Comments, 17:2, pp.2-3\n70 ibid, p.3\n71 Zetter, 2014, pp.3-4\n\n\n-----\n\nrelatively brief research showed that Iran had recently suffered from unexplained gas pipeline\n\nexplosions and mysterious assassinations of nuclear scientists. This in relation to the fact that the\n\nmalware destroyed the Iranian nuclear centrifuges, made it rather evident that the aim of Stuxnet\n\nwas to sabotage the development of Iran’s nuclear program. [72]\n\nMariarosaria Taddeo and Ludovica Glorioso are in accordance with the above-mentioned\n\nopinions, arguing that the specific design of Stuxnet and the way it damaged the Iranian uranium\n\nenrichment specifically, are clear indications of the aim of the cyber worm- preventing Iran from\n\nbuilding a potential nuclear weapon by sabotaging their nuclear program. According to Taddeo\n\nand Glorioso, this goal is something that the clear majority of the international community would\n\nregard as beneficial since it could prevent Iran from building a nuclear weapon and in that sense,\n\nStuxnet has contributed to a safer world.[73]\n\nBoth security experts and diplomats have stated that Israel and Western governments believes\n\nthat one of the most effective ways for slowing the Iranian nuclear program is through damaging\n\nit. By sabotaging crucial parts of the nuclear program, such as the uranium enrichment, Iran will\n\nbe prevented from building nuclear weapons. The cyber security firm Symantec has conducted a\n\nstudy that confirms the sabotage theory based on the way Stuxnet is controlling the behavior of\n\nthe equipment (the frequency converts). The aim of unleashing a cyber worm that specifically\n\ntargets one of the world’s most feared nuclear programs by systematically and secretively\n\ndestroying the most crucial part of its developing system, cannot be other than eliminating the\n\nrisk of Iran building nuclear weapons.[74]\n\nRegardless of the criticism and tributes of Stuxnet’s purpose, the majority, if not all, agree that\n\nthe aim of the cyber worm was to sabotage the Iranian uranium enrichment program and thus\n\nprevent a potential nuclear weapon. This makes the aim of the cyber-attack highly political,\n\nwhich is a common denominator in both new and old war’s in regard of the objectives of war.\n\n72 Symantec cyber-security experts: Chien, Eric. O’Murchu, Liam. Zero Days (2016), (DVD) United States,\nMagnolia Pictures\n73 Taddeo and Glorioso, 2017, Ethics and Policies for Cyber Operations: A NATO Cooperative Cyber Def4ence\n_Centre of Excellence Initiative, pp.215_\n74 Maclean, William. Stuxnet study suggests Iran enrichment aim: experts. Reuters, Nov 16th, 2010\nhttp://www.reuters.com/article/security-cyber-stuxnet-idUSLDE6AF0FX20101116 (viewed May 5[th,] 2017)\n\n\n-----\n\nHowever, as presented in the theory section, political aims have different meanings in new and\n\nold wars. Limiting the capabilities of a state and preventing them from constructing and\n\ndeveloping their military means, can be explained as political targets through a variety of\n\naspects.\n\nAs the article from the IISS Strategic Comment and Taddeo and Glorioso argued, most of the\n\ninternational community would like to see a less developed Iranian nuclear program and are\n\ntherefore more likely to approve of the aim of Stuxnet (dismissing its unconventional method).\n\nHowever, ‘international community’ as a term has been widely debated. The fundamental, yet\n\nsomewhat unsatisfactory definition of the terms, is referring to a group of countries acting\n\ntogether as a unit.[75] This is in accordance with the United Nations definition of the term, where\n\nthey explain it as a unity between states, intergovernmental organization and NGO’s in the\n\nglobalization era. The result of the international community can be seen in international law,\n\nglobal cooperation’s such as economic, environmental and peacekeeping treaties. The\n\ninternational community is facing the same threats from nuclear weapons, climate change yet\n\nshare the common benefits from the social and technological developments.[76]\n\nHowever, not everyone agrees with this description. One of the debates regarding the term is\n\nmade by Noam Chomsky who argues that the term is merely used by the US and their allies,\n\nwhile referring to themselves while aiming to increase their credibility and power.[77] Martin\n\nJacques shares Chomsky’s explanation and argues that ‘international community’ is a synonym\n\nto the West and is used by them to exalt and globalize their image. [78]\n\nRegardless of which definition of the term one prefers, both explanations agree that it entails\n\nstates. In this regard, the aim of Stuxnet can be argued to be linked to the interest of states, since\n\nthe international community, according to the sources mentioned above, would like for Iran to\n\nhave limited nuclear facilities. This would be in accordance to Clausewitz, who argued that states\n\n75 Cambridge Dictionary,” International community”\nhttp://dictionary.cambridge.org/dictionary/english/international-community (viewed May 10th, 2017)\n76 Secretary- General Examines ‘meaning of international community’ in address to DRP/NGO Conference, 15th\nSep, 1999,\nhttp://www.un.org/press/en/1999/19990915.sgsm7133.doc.html (viewed May 12th, 2017)\n**77** Poellinger, Clemens., Stort publiktryck på Chomsky-föreläsning. Svenska Dagbladet, Sep 20th, 2002,\nhttps://www.svd.se/stort-publiktryck-pa-chomsky-forelasning (viewed May 10th, 2017)\n78 Jacques, Martin. What the hell is the international community?. The Guardian, Aug 24th, 2006\nhttps://www.theguardian.com/commentisfree/2006/aug/24/whatthehellistheinternati (viewed May 12[th], 2017)\n\n\n-----\n\ninterest is the main aim of war. Furthermore, Clausewitz argument regarding states interest is\n\ndivided into different sections, among them being the power, financial gains and territorial\n\nexpansions. Though territorial expansion is not relevant in the case of Stuxnet, since the target\n\nwas the Iranian nuclear program, both political power and financial gains can be discussed.\n\nThe international communities interest in limiting Iran’s nuclear facilities, is argued to be\n\ndirectly linked to defence policies since they want to eliminate the risk of new nuclear weapons.\n\nIf that is the mere reason, one might ask why other nuclear programs and facilities such as\n\nPakistan[79], North Korea[80] or Israel[81], have not been targeted in the same manner. It has been\n\nargued that the US and their allies’ role in the Middle East is threatened by the dominating\n\npresence of Iran and if Iran develops nuclear weapons, the international community, assuming it\n\nis Chomsky’s definition of the term, will not be as influential as they would like to be.[ 82]\n\nIn this aspect, the aim of Stuxnet can be interpreted as a way of achieving more power and can\n\ntherefore be connected to both new and old wars. Nonetheless, it is the means of achieving\n\npower that distinguishes the wars from each other. In Clausewitz’s explanation, power is usually\n\nconnected with physical targets such as territorial expansions, which again, is not relevant in this\n\ncase. New wars on the other hand, associates power to political control, which is aimed to be\n\nachieved without the use of force. It could be argued that the attacker imposed their will, which\n\nis to limit the Iranian nuclear facilities, and thus achieving a certain level of political control on\n\nthe victim. In this regard, there might be more similarities with the characterizations of new wars\n\nsince the political aim was achieved without the use of force. Nonetheless, the aspect of identity\n\npolitics where movements of ethnic, religious and racial identities organizes to claim state\n\npower[83], is absent in the case of Stuxnet.\n\n79 Joseph V. Micallef, Jul 2nd, 2016, The Huffington Post “The other bomb: Pakistan’s Dangerous Nuclear Strategy”\nhttp://www.huffingtonpost.com/joseph-v-micallef/the-other-bomb-pakistans_b_9180504.html (viewed 7[th] May\n2017)\n80 North Korea's nuclear programme: How advanced is it?. BBC news, Jan 6th, 2017,\nhttp://www.bbc.com/news/world-asia-pacific-11813699 (viewed May 7th, 2017)\n\n81 Borger, Julian. The truth about Israel’s secret nuclear arsenal. The Guardian, Jan 15th, 2014,\nhttps://www.theguardian.com/world/2014/jan/15/truth-israels-secret-nuclear-arsenal (viewed May 7th, 2017)\n82 The Middle East: Abstracts and index. Library Information and Research Service, 2006, p.225\n83 Kaldor, 2013, p.79\n\n\n-----\n\n## 4.2 The actors involved \n\nAccording to the computer security experts that have studied Stuxnet, it is most likely that a\n\nnation state/s is behind the attack and this is due to the amount of recourses, complexity and the\n\nrisks of the cyber worm. [84] Vitaly Kamluk a director at Kaspersky Lab, agrees with this\n\nexplanation and argues that criminals are usually interested in stealing money, while hacktivists\n\nusually have political agendas. Nation states on the other hand, are interested in valuable\n\ninformation or sabotage activities. Due to the target of Stuxnet, the cyber-attack is most likely\n\nthe result of one or more nation states.[85] As mentioned in the previous section, several sources\n\nclaim that Stuxnet is the result of an US-Israeli cooperation. However, despite these accusations\n\nagainst the US and Israel, none of them has admitted to the crime, which can only be expected in\n\nsuch a situation where the secret weaponized codes, like in the case of Stuxnet, can be deniable\n\nunlike the dropping of bombs.[86]\n\nNonetheless, there are some indications in the malware that supports these speculations.\n\nOne of these indications is the number “19790509” which was found in the code of Stuxnet. This\n\nnumber is argued to be the date of Persian Jewish businessman and head of Tehran’s Jewish\n\ncommunity’s Habib Elghanian’s execution in Iran. [87] Another, although rather weak, indication\n\nis the name “Myrtus” that appears in the code. It is believed that Myrtus is a reference to the Old\n\nTestament and more specifically to the Book of Esther, where Esther was described as the one\n\nwho saved the Jews from the Persians. Nonetheless, the letter combination RTU found in\n\nMyRTUs, can also be defined as “Remote Terminal Unit”, which is a common device that is\n\nfrequently linked to Siemens controlling systems, also known as Supervisory Control and Data\n\nAcquisition (SCADA) systems. Nonetheless, the aim of Stuxnet and the political circumstances\n\nin the region makes Israel a natural suspect. Israel has both the motives, capability and\n\n84 Falkenrath, Richard on Bloomberg News\nhttps://www.youtube.com/watch?v=VAXOTJkzGL8 (view May 13[th], 2017)\n85 Zero Days (2016), (DVD) United States, Magnolia Pictures\n86 Hammersley, Ben. Cybercrimes with Ben Hammersley. BBC News\nhttps://www.youtube.com/watch?v=4oNnSStrc38 (viewed May 13[th], 2017)\n87 Bryen, D. Stephen. Technology Security and National Power: Winners and Losers, 2015, p.1-2\n\n\n-----\n\nopportunity to conduct the cyber-attack towards the Iranian nuclear facilities, and so does the\n\nUS.[88]\n\nThe New York Times reported that Stuxnet was developed by both the US and Israel who aimed\n\nat slowing the Iranian nuclear facilities. According to the article, members from the former US\n\npresident Obama’s national security team, confirms the suspicion of an US-Israeli cooperation\n\nbehind Stuxnet.[89] Another indication of Israel’s involvement in the launch of the cyber-attack,\n\nwas on Israeli general Gabi Ashkenazi’s last day at work where a video that included references\n\nto Stuxnet was presented. The video was a presentation of his achievements during his service,\n\nwhich fuelled the speculation towards Israel’s involvement in the cyber-attacks even further. [90]\n\n\nIn 2016, the US government accused Iran for being behind several cyber-attacks between 2011\n\n2013, targeting a New York dam and U.S banks, which led to economic loses. The US claimed\n\nthat the attacks were persistent and strategic and could therefore not be the work of individual\n\nIranian hackers but rather the Iranian administration. Security experts have argued that these\n\ncyber-attacks are direct consequences of Stuxnet and that both the US and Israel might be\n\nvictims of such attacks in the future due to their debated involvement in the cyber sabotage in\n\nNatanz 2010.[91]\n\nThis indicates that Stuxnet has created a counterattack, which resembles the perhaps more\n\nconventional features of war. According to Clausewitz wars craves counterattacks, where the\n\ndefender is aiming to use counterattacks to primarily achieve victory but also to deter and protect\n\nthe state from potential attacks.[92] However, it is not merely the counterattacks that resembles the\n\nperception of old wars but also the actors involved. Even though there are no official statements\n\nconfirming the responsible actors behind Stuxnet, most sources agree that it is an US-Israeli\n\n88\nRosenzweig, Paul (2013), Cyber Warfare: How Conflicts in Cyberspace are challenging America and the World,\n9-10\n89 Sanger, E. David. Obama ordered wave of cyberattacks against Iran. The New York Times, Jun 1, 2012\nhttp://www.nytimes.com/2012/06/01/world/middleeast/obama-ordered-wave-of-cyberattacks-against-iran.html\n(viewed May 13th, 2017)\n90 Zorz, Zeljka. Israeli general claims Stuxnet attacks as one of his successes. Help Net Security, Feb 15th, 2011\nhttps://www.helpnetsecurity.com/2011/02/15/israeli-general-claims-stuxnet-attacks-as-one-of-his-successes/ (view\nMay 13[th], 2017)\n91 Volz, Dustin., Finkle, Jim. U.S. indicts Iranians for hacking dozens of banks, New York dam. Reuters, Mar 25th,\n2016\nhttp://www.reuters.com/article/us-usa-iran-cyber-idUSKCN0WQ1JF (viewed May 13[rd] 2017)\n\n92 Clausewitz, 1984, p. 391\n\n\n-----\n\ncooperation. It therefore seems reasonable to assume that all the primary actors involved in\n\nStuxnet are states. In this regard, the involvement of actors in Stuxnet is in accordance with the\n\nperception of old wars, which argues that the main actors in wars are states.\n\nNew wars do recognize states involvements in wars as well, although within the context of\n\nglobalization. According to Kaldor, government organizations are changing in the globalization\n\nprocess, where government activities within different departments are entailing privatized or\n\nsemi-privatized arrangements. This has challenged the perhaps more conventional perception of\n\na nation state. Governments in the contemporary globalization era are developing horizontal and\n\ntransnational connections, which means that the decentralization of power that is usually seen in\n\nNGO’S can also be found in nation states. This means that the global political structure is\n\nevolving, where the link between nation states, NGO’s and companies are more interconnected.[93]\n\nThis can be correlated to Iran’s accusations towards the engineering firm Siemens (the industrial\n\ncontrol system for the Iranian nuclear program) for assisting the US and Israel to launch Stuxnet.\n\nCarey Nachenberg, Vice president at Symantec Corp, referred to Stuxnet as a wake-up call for\n\nthe world. Stuxnet bypassed all the acknowledged cyber security companies, which stresses the\n\nfact that it is extremely difficult to protect ourselves from such attacks. Seven different\n\nmechanisms were used in Stuxnet to spread its virus, these mechanisms are from Siemen’s and\n\nare used for programing industrial systems, such as the PLC. Nonetheless, one of these\n\nsoftware’s had a default password that came from the manufacturer; Siemen’s. Stuxnet broke\n\nthrough the defaulted password and could thus access the system. [94]\n\nIran's civil defence chief, Gholamreza Jalali requested a legally investigation of Siemens\n\nSCADA software’s role in the case of Stuxnet. He argues that there are vital indications that the\n\nUS and Israel could not have obtained the necessary information to target the SCADA software\n\non their own and more specifically, without the assistance of Siemens. Siemens was accused for\n\nproviding valuable information regarding the control system, such as maintaining a defaulted\n\n93 Kaldor, 2013, p.76\n94 Nachenberg, Carey. How a computer virus foiled Iran’s nuclear program, CISAC Science Seminar, Apr 23rd,\n2012. https://www.youtube.com/watch?v=DDH4m6M-ZIU (viewed May 18[th], 2017)\n\n\n-----\n\npassword, of the Iranian nuclear program to the US and Israel, which facilitated the cyber-attack.\n\n95\n\nReviewing Stuxnet from this aspect, provides a possible recognition of the characterization of\n\nnew wars that entails the involvement of both states and other global actors in war. The Iranian\n\nnuclear program and crucial information regarding its survival is dependent on an internet-based\n\ncontrol system. Due to the nature of the internet, its openness and speed, the interconnection\n\nbetween a diversity of actors is not only inevitable, but also essential. The cooperation between\n\nnation states and a variety of other global actors, such as international companies and NGO’s, is\n\nequally inevitable in the sphere of globalization. It could therefore be argued, despite the\n\naccuracy of the accusations regarding Siemens involvement in Stuxnet, that nation states and\n\nother global actors are interconnected in the cyber-attacks towards the Iranian nuclear facilities.\n\n##   4.3 The Method of Stuxnet\n\nA Zero-day vulnerability is a hole in the software that the owner or developer is not aware of.\n\nWhen hackers find this hole before the owner has the chance to even discover and repair it, it is\n\nreferred to as a zero-day attack. The Zero-day attacks are used for espionage, instructing\n\nmalwares and accessing valuable and classified information. The term itself is a referent to the\n\nanonymous character of the hole for everyone besides the hackers.[96]\n\nAdvanced cyber-attacks that are conducted by criminals and hackers has at the most one zero\nday. Stuxnet on the other hand, had four zero-days in one single malware, which has never been\n\nseen before nor after Stuxnet. [97]In the case of Stuxnet, the zero-day vulnerability was used to\n\nspread a malware, which is a malicious software that is capable of undermining, stealing and\n\nsabotaging data. In this context data is defined as zeros and ones, meaning that malware is\n\nelectrons undermining other electrons. The destruction of these electrons does not mean the mere\n\n95 Dehghan, Saeed Kamali. Iran accuses Siemens of helping launch Stuxnet cyber-attack. The Guardian, Apr 17th,\n2011https://www.theguardian.com/world/2011/apr/17/iran-siemens-stuxnet-cyber-attack (viewed May 14th, 2017)\n\n96 “What is a Zero-Day Vulnerability?” PC tools by Symantec,\nhttp://www.pctools.com/security-news/zero-day-vulnerability/ (Viewed May 16[th], 2017)\n97 Cybersecurity expert: Kaspersky, Eugene. Zero Days (2016), (DVD) United States, Magnolia Pictures\n\n\n-----\n\ndestruction of valuable data, but that actual physical objects that are managed by electricity\n\nmight be equally sabotaged. [98]\n\nStuxnet attacked a Microsoft operating system, called SCADA. The computers that controls\n\nSCADA are usually not directly connected to the Internet, due to the valuable information it\n\ncontains. This connection is usually avoided through an air gap between the SCADA controlled\n\ncomputer and the internet. Nonetheless, there are certain methods to avoid this air gap. There is a\n\npossibility to insert the malware on the sensitive side of the air gap, this however, can only be\n\ndone by a spy. This is argued to be the case with Stuxnet, where the Siemens SCADA system is\n\nbelieved to have been infiltrated through a memory thumb drive. Stuxnet was deliberately\n\navoiding attacking the non-centrifuges SCADA’s since it could reveal its cover. This indicates\n\nthat the developers of Stuxnet had significant information regarding the Natanz plant and the\n\nSiemens SCADA system, since the cyber worm could tactically avoid the gaps that could exploit\n\nits presence. [99]\n\nStuxnet is 20 times larger than an average code and contains almost no bugs, which is extremely\n\nrare. All the digital codes within Stuxnet were actively working towards a certain target to\n\nconduct the attack. It took the cyber-security experts months to even detect the secret codes,\n\nwhich is a process that usually takes a few minutes to implement with regular cyber-attacks.\n\nViruses usually spreads through additional devices, such as damaged disks or files, Stuxnet was\n\nhowever different in that regard. One of the significant aspects of Stuxnet is that it spread and\n\nevolved the virus on its own, which means that the victim has no chance to protect themselves.\n\nThe actors behind the attack could not go to companies such as Microsoft and ask them for\n\ndigital codes, since that would expose them. Instead, the digital codes used in Stuxnet were\n\nstolen and could later be tracked back to two companies in Taiwan.[100]\n\nRalph Langner, one of the control security experts who analysed Stuxnet during the attack,\n\nargues that the malware was directly targeting Siemens computers and more specifically the\n\nProgrammable Logic Controllers (PLC), which is a small computer that is connected to physical\n\n98 Hafemeister, David. (2016), Nuclear Proliferation and Terrorism in the Post-9/11 World, p. 314\n99 ibid, p. 14\n100 Symantec cyber-security experts: Chien, Eric. O’Murchu, Liam. Zero Days (2016), (DVD) United States,\nMagnolia Pictures\n\n\n-----\n\nequipment’s. This small computer runs a digital program, which controls the speed and actions\n\nof the equipment’s. In the case of Stuxnet, it was used to control the speed of the motors of\n\nIranian centrifuges in Natanz. Although the advanced malware had the ability to break through\n\nvarious of codes and thus control a variety of equipment’s, it only targeted the codes that were\n\ndirectly linked to the motors of the Iranian nuclear centrifuges and ending up with destroying\n\nover a thousand centrifuges.[101] Stuxnet was therefore not designed to steal information or money,\n\nit was simply trained to infiltrate the Iranian industrial program and to literally explode their\n\nengines. [102]\n\nIt is rather evident to say that Stuxnet was not implemented using force and thus the method of\n\nwarfare within the concept of old war, is not relevant in this specific case. New wars on the other\n\nhand, suggests that the method of warfare has changed since the Clausewitzian war era. Violence\n\nis avoided in new wars since the aim of these wars does not usually require force to be achieved.\n\nInstead of using force to attack the Iranian nuclear centrifuges, the damages were implemented\n\nthrough technical channels while avoiding anything that could draw attention to the malware.\n\nThe cyber worm was specifically designed to hide its tracks while attacking, which indicates that\n\nthe Clausewitizian understanding regarding the significance of battle in wars, was not just\n\navoided but also unnecessary for the attacker to reach their aim.\n\nSince globalization is a vital aspect of new wars, it is of great essence to understand the way\n\nStuxnet was conducted within the context of globalization. The interconnected technological\n\nnetworks provide a unified platform of services, that most modern nation states depend on.\n\nNonetheless, these very services might cause severe damages that can be conducted with a\n\nsimple click. The computer software that Stuxnet was spread through is a common Microsoft\n\ndevice that is used by both individuals for private purposes and by nations states for critical and\n\nclassified matters. Although the attackers could not use the original Microsoft codes to access the\n\nIranian Siemen’s computers, due to the risks, they were easily able to steal the appropriate digital\n\n101 Langer, Ralph. Att knäcka Stuxnet, 2000-talets cybervapen. TED Talk, Mar 2011\nhttps://www.ted.com/talks/ralph_langner_cracking_stuxnet_a_21st_century_cyberweapon?language=sv (viewed\nMay 18th, 2017)\n102 Gibney, Alex. The Secret Cyberwar is Here: Director Alex Gibney on 'Zero Days' Documentary, Stuxnet &\nCyberweapons (Video). Reasons, July 8, 2016 http://reason.com/reasontv/2016/07/08/the-secret-cyberwar-is-heredirector-ale (viewed May 18th, 2017)\n\n\n-----\n\ncodes from other companies that are located on the other side of the world. This is simply\n\nbecause most actors, individuals, companies and nation states, use the same devices.\n\nIn this regard, it could be argued that the way Stuxnet was implemented is in accordance with\n\nnew wars, both in relation to the method of warfare and within the context of globalization.\n\n\n-----\n\n# 5. Discussion\n\nThe first section described the aim of Stuxnet, which according to the majority of the sources\n\nwas to sabotage crucial parts of the Iranian nuclear program and thus hinder the construction of\n\nnuclear weapons. According to the article from IISS Strategic comments, the attackers were\n\naware of the fact that the malware could not sabotage the Iranian nuclear program to the extent\n\nthat it would deter them from developing the it. Stuxnet was rather a method that bought the\n\ninternational community some time to pressure Iran through i.e. sanction, to decrease their\n\nuranium enrichment and be more transparent in regard of their nuclear program. This would be\n\nmore successful to conduct\n\nwhile the Iranians were focused on their setbacks and could thus not afford further loses. Both\n\narguments agree that Stuxnet targeted one of the most crucial part of the Iranian nuclear program\n\nand that the aim was to sabotage and hinder the development of their nuclear program and thus\n\nprevent the construction of potential nuclear weapons. In this regard, the aim is political since it\n\nis in the interests of nation states, sabotaging parts of another state’s nuclear program to hinder\n\nthem from developing what is feared to be nuclear weapons, can be argued to be a way of\n\nimposing the will of the attacker on the victim. This is in accordance with the concept of ‘old\n\nwar’ since the main aim of war is to attain political objectives, although not in the sense of\n\nexpanding territories but rather in aspect of increasing the state’s political power.\n\nMost cyber-security experts that has analysed Stuxnet, agrees that the cyber worm was not the\n\nresult of common hacktivism or cyber-criminality but the consequence of a distinctive and\n\nauthoritative state-cooperation. As mentioned above, the empirical analysis presented that\n\nStuxnet is most likely conducted by two nation states, namely; the US and Israel. Neither of the\n\nstates has admitted to the crime, which can only be expected in such situation. The signs within\n\nthe malware, the geo-political situation between Iran and the allies US and Israel, along with\n\nstatements from governmental officers, like in the case of Israeli general Gabi Ashkenazi, fuelled\n\nthe suspicions towards and US-Israeli cooperation. The main actors in Stuxnet is therefore nation\n\nstates, which is again in accordance with the concept of ‘old war’. ‘New wars’ do recognize the\n\ninvolvement of states in wars, but argues that modern wars rarely involve just state actors. Iran\n\n\n-----\n\nhas however, accused the software company SIEMENs for providing valuable information to the\n\nUS and Israel, which made the cyber-attack possible. This can in a sense be argued to be in\n\nfavour of new wars, since an international non-state actor might be included in this attack.\n\nNonetheless, even if SIEMENs did contribute to the attack by providing information to the US\n\nand Israel, the main actors are still the nation states.\n\nAlthough Stuxnet is neither the first nor the last cyber-attack, it is unique in many regards.\n\nStuxnet is argued to have been implemented with a thumb drive by a spy, the cyber worm then\n\nevolved on its own and infected software’s all over the world, where 60% of the virus were\n\nfound in Iran alone. It operated under complete secrecy and hid all the traces that could expose\n\nits existence, which made the victim unaware of the attack. This led to severe damages of critical\n\nequipment’s in the Iranian enrichment program and although Iran did eventually recover from\n\nthe damages, approximately 2,000 centrifuges were sabotaged through the cyber-attack.\n\nClausewitz argued that the aim of war cannot be reached without the use of violence and battles\n\nare thus a necessary component in war. Kaldor on the other hand, claim that the use of force is\n\navoided in new wars and that the purposes of war can be achieved through other means. Stuxnet\n\nachieved its aim in relation to causing physical damages on crucial parts of the Iranian nuclear\n\nenrichment program, without the use of violence and is thus in accordance with Kaldor’s\n\ndescription of method of warfare in new wars.\n\n\n-----\n\n## 6. Conclusion \n\nThe purpose of this study was to examine the extent to which Stuxnet can be characterized as a\n\nnew war, if at all. This has been of interest since defining the nature of Stuxnet is vital for both\n\npreparing and protecting ourselves from future destructive cyber-attacks. The material used in\n\nthis study has been collected through a variety of sources, such as statements from cyber-security\n\nexperts and decision-makers, public sources and previous research. Although the objectivity of\n\npublic sources can be discussed, I believe that the wide range of varied material has contributed\n\nto a perhaps more nuanced description of the case than it would have if one merely used one\n\ncertain sort of data. The empirical analysis has then been divided into three sections, where each\n\npart focuses on different aspects of the attack within the theoretical framework of new and old\n\nwars. The first section of the empirical analysis conducted that the aim of Stuxnet was political\n\nand highlighted the absence of both the private (criminal objectives) and political (ethnic, tribal\n\nor religious) purposes in new wars. The second part presented that the main actors involved in\n\nStuxnet were nation states, including the attackers and the victim. This is again in accordance\n\nwith the concept of ‘old wars’, that argues that wars entail merely nation state actors. Although\n\nstates are believed to be involved in ‘new wars’, the theory argues that other actors, such as\n\ncriminal organizations or non-governmental are part of the war as well. The third and final\n\naspect, is discussing the method of Stuxnet. Stuxnet was implemented digitally and caused\n\nsevere physical damages on the target, without the victim even realizing that it was under attack.\n\nThis contradicts the concept of ‘old war’, which argues that the objective of war can only be\n\napplied through the use of force. Stuxnet did reach its goal in the sense that it sabotaged crucial\n\nparts of the Iranian nuclear program without using violence. In this regard, Stuxnet was\n\nconducted in accordance with the theory of ‘new wars’ that argues that violence is avoided and\n\neven unnecessary in new wars.\n\nIt is therefore evident to conclude that Stuxnet cannot be characterized as either an old nor new\n\nwar, but rather a combination of both. In regard of the research question; Stuxnet can be\n\ncharacterized as a new war in the extent of the method of warfare and the globalized context that\n\ncontributes to the interconnected world, which assisted in spreading the digital weapon through\n\ndevices located in all over the globe.\n\n\n-----\n\n# 8. Bibliography \n\nAlvarez, Joshua. Stuxnet: The world's first cyber weapon. Center for International Security and\nCooperation, Feb 3[rd,] 2015 http://cisac.fsi.stanford.edu/news/stuxnet (viewed 18[th] Apr)\n\nBaylis, John., Smith, Steve., Owens, Patricia (red.). The Globalization of World Politics: An\nIntroduction to International Relations. 4[th] edition. Oxford: Oxford University Press, 2008\n\nBarret, James. Our Final Invention: Artificial Intelligence and the End of the Human Era, St.\nMartin's Griffin, 2015\n\nBryan, D. Stephen. Technology Security and National Power: Winners and Losers. Piscataway,\nNJ: Transaction Publishers, 2015\n\nBryman, Alan. Social research methods, Oxford University Press; 4th edition, 2012\n\nBryman, Alan., Bell, Emma. Business Research Methods, Published by Oxford University Press,\n\n2010\n\nBorger, Julian. The truth about Israel’s secret nuclear arsenal. The Guardian, Jan 15[th,] 2014\nhttps://www.theguardian.com/world/2014/jan/15/truth-israels-secret-nuclear-arsenal (viewed\nMay 7th, 2017)\n\nCambridge Dictionary, “International community”\nhttp://dictionary.cambridge.org/dictionary/english/international-community (viewed May 10th,\n2017)\n\nCordesman, Anthony H. Iran’s Developing Military Capabilities, Centre for Strategic &\nInternational Studies, 2005\n\n“Cybercrimes with Ben Hammersley”. BBC News\nhttps://www.youtube.com/watch?v=4oNnSStrc38 (viewed May 13[th], 2017)\n\nDavid, Matthew., Sutton, Carole. Social Research: An Introduction, Sage Publications Ltd; 2[nd]\n\nedition, 2011\n\nDeep, Alex. Hybrid War: Old concept, New Techniques, Small War Journal, Mar 2[nd], 2015\n\n\n-----\n\nhttp://smallwarsjournal.com/jrnl/art/hybrid-war-old-concept-new-techniques (viewed May 11th,\n2017)\n\nDehghan, Saeed Kamali. Iran accuses Siemens of helping launch Stuxnet cyber-attack. The\nGuardian, Apr 17[th], 2011 https://www.theguardian.com/world/2011/apr/17/iran-siemens-stuxnetcyber-attack (viewed Mat 14th, 2017)\n\nDenning, E. Dorothy. Stuxnet: What has changed? Future Internet 2012, 4(3), 672-687;\ndoi:10.3390/fi4030672\n\nDodge, C. Ronald., Futcher, Lynn (Ed.). Information Assurance and Security Education and\nTraining, Springer-Verlag Berlin Heidelberg, 2013\n\nEnbody, Richard., Aditya Sood. Targeted Cyber Attacks: Multi-staged Attacks Driven by\n\nExploits and Malware, Syngress; 1 edition, 2014\n\nFalkenrath, Richard. Bloomberg https://www.youtube.com/watch?v=VAXOTJkzGL8 (view\n\nMay 13[th], 2017)\n\nGeers, Kenneth. Strategic Cyber Security, Kenneth Geers, 2011. ISBN\n\nGibney, Alex. The Secret Cyberwar is Here: Director Alex Gibney on 'Zero Days' Documentary,\n\nStuxnet & Cyberweapons, (Online video), Reason, July 8[th], 2016\n\nhttp://reason.com/reasontv/2016/07/08/the-secret-cyberwar-is-here-director-ale (viewed May\n\n18th, 2017)\n\nHafemeister, David. Nuclear Proliferation and Terrorism in the Post-9/11 World, Springer; 1st\n\ned. 2016 edition, 2016\n\nHamel, Jacques., Dufour, Stephane., Fortin, Dominic. Case Study Methods (Qualitative Research\nMethods)”, SAGE Publications, Inc;1 edition, 1993\n\nHenderson, Errol., Singer, David. “New Wars\" and Rumours of \"New Wars”, International\nInteractions: Empirical and Theoretical\n\n\n-----\n\nHoffman, Frank. Conflict in the 21[st] Century: The Rise of Hybrid Wars, Potomac Institute for\nPolicy Studies, 2011.\n\nJacques, Martin. “What the hell is the international community”. The Guardian, Aug 24[th], 2006\nhttps://www.theguardian.com/commentisfree/2006/aug/24/whatthehellistheinternati (viewed\nMay 12th, 2017)\n\nKaldor, Mary. New and Old Wars: Organized Violence in a Global Era. Stanford University\nPress; 3[rd] edition, 2013\n\nLanger, Ralph. ”Att knäcka Stuxnet, 2000-talets cybervapen”. TED Talk, March 2011\nhttps://www.ted.com/talks/ralph_langner_cracking_stuxnet_a_21st_century_cyberweapon?langu\nage=sv (viewed May 18th, 2017)\n\nLoukas, George. Cyber-Physical Attacks: A Growing Invisible Threat, Butterworth-Heinemann;\n1 edition 2015\n\nMaclean, William. Nov 16[th,] 2010, Reuters “Stuxnet study suggests Iran enrichment aim:\n_experts”_ http://www.reuters.com/article/security-cyber-stuxnet-idUSLDE6AF0FX20101116\n(viewed May 5[th,] 2017)\n\nMicallef, Joseph V. The other bomb: Pakistan’s Dangerous Nuclear Strategy. The Huffington\nPost, Jul 2[nd,] 2016. http://www.huffingtonpost.com/joseph-v-micallef/the-other-bombpakistans_b_9180504.html (viewed 7[th] May 2017)\n\nMünkler, Herfried. The New Wars. Polity; 1 edition, 2004\n\nNachenberg, Carey, How a computer virus foiled Iran’s nuclear program, CISAC Science\nSeminar, Apr 23[rd], 2012. https://www.youtube.com/watch?v=DDH4m6M-ZIU (viewed May\n18[th], 2017)\n\nNorth Korea's nuclear programme: How advanced is it?. BBC News, Jan 6th, 2017\n\nhttp://www.bbc.com/news/world-asia-pacific-11813699 (viewed May 7th, 2017)\n\nNye, Joseph S. “The Power to Lead”, Offord University Press, Inc. 2008\n\nPoellinger, Clemens. Stort publiktryck på Chomsky-föreläsning. Svenska Dagbladet, Sep 20th,\n2002, https://www.svd.se/stort-publiktryck-pa-chomsky-forelasning (viewed May 10th, 2017)\n\n\n-----\n\nRemarks by Secretary Panetta on Cybersecurity and Business Executives of National Security.\nDepartment of Defense, New York, U.S. Oct 11[th], 2012\nhttp://archive.defense.gov/transcripts/transcript.aspx?transcriptid=5136 (view May 13[th], 2017)\n\nRichard A. Clarke, The Economist’s World in 2013 Festival, Dec 8[th], 2012,\nhttps://www.youtube.com/watch?v=6_ek8mugOUc (viewed May 13[th], 2017)\n\nRosenzweig, Paul. Thinking about Cybersecurity: From Cyber Crime to Cyber Warfare, The\n\nGreat Courses, 2013\n\nSanger, David E. Obama ordered wave of cyberattacks against Iran, The New York Times, Jun\n1[st], 2012 http://www.nytimes.com/2012/06/01/world/middleeast/obama-ordered-wave-ofcyberattacks-against-iran.html (viewed May 13th, 2017)\n\nSchreier, Margrit. Qualitative Content Analysis in Practice, SAGE Publications Ltd; 1 edition,\n2012\n\nSecretary- General Examines ‘meaning of international community’ in address to DRP/NGO\nConference, 15[th] Sep 1999, http://www.un.org/press/en/1999/19990915.sgsm7133.doc.html\n(viewed May 12th, 2017)\n\nShackelford, Scott J. Managing Cyber Attacks in International Law, Business, and Relations: In\n\nsearch for Cyber Space. Kelley School of Business, Indiana University 2014\n\nSimpson, Emile. War from the Ground Up: Twenty-first Century Combat as Politics, Oxford\n\nUniversity Press; 1 edition, 2012\n\nSood, Aditya., Enbody, Richard, Targeted Cyber Attacks: Multi-staged Attacks Driven by\nExploits and Malware, Syngress; 1 edition, 2014.\n\nTaddeo, Mariarosaria, Glorioso, Ludovica (Eds.). Ethics and Policies for Cyber Operations: A\nNATO Cooperative Cyber Defence Centre of Excellence Initiative, Springer International\nPublishing, 2017\n\nThe Middle East: Abstracts and index. Library Information and Research Service,\n\nNorthumberland Press 2006, University of Michigan.\n\n\n-----\n\nVolz, Dustin., Finkle, Jim. U.S. indicts Iranians for hacking dozens of banks, New York dam.\nReuters, Mar 25[th,] 2016\nhttp://www.reuters.com/article/us-usa-iran-cyber-idUSKCN0WQ1JF (viewed May 13[rd] 2017)\n\nWhat is a Zero-Day Vulnerability?, PC tools by Symantec,\n\nhttp://www.pctools.com/security-news/zero-day-vulnerability/ (Viewed May 16[th], 2017)\n\nWilliams, John. The Ethics of Territorial Borders: Drawing Lines in the Shifting Sand, Palgrave\n\nMacmillan; 1st ed. 2006\n\nWired https://www.wired.com/author/kimzetter/ (viewed 26[th] Apr 2017)\n\nZorz, Zeljka. Israeli general claims Stuxnet attacks as one of his successes. Help Net Security,\nFeb 15[th], 2011\nhttps://www.helpnetsecurity.com/2011/02/15/israeli-general-claims-stuxnet-attacks-as-one-ofhis-successes/ (view May 13[th], 2017)\n\n60 Minutes, \"Stuxnet: Computer Worm Opens New Era of Warfare”\n\nhttp://www.cbsnews.com/news/stuxnet-computer-worm-opens-new-era-of-warfare-04-06-2012/\n\n(viewed Apr 1[st,] 2017)\n\n(2011) Stuxnet: targeting Iran's nuclear programme. Strategic Comments, 17:2,1-3, DOI:\n\n10.1080/13567888.2011.575612\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Stuxnet/A case study of Stuxnet within the theory of new and old wars.pdf"
    ],
    "report_names": [
        "A case study of Stuxnet within the theory of new and old wars.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535930,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1505678122,
    "ts_modification_date": 1505678122,
    "files": {
        "pdf": "https://archive.orkl.eu/93aad1d6dd9b03aa4cfb19947ca0e0e683709a1f.pdf",
        "text": "https://archive.orkl.eu/93aad1d6dd9b03aa4cfb19947ca0e0e683709a1f.txt",
        "img": "https://archive.orkl.eu/93aad1d6dd9b03aa4cfb19947ca0e0e683709a1f.jpg"
    }
}