{
    "id": "ed16244b-2970-4f6b-8ce9-517a14ae8b7e",
    "created_at": "2023-01-12T15:05:14.193362Z",
    "updated_at": "2025-03-27T02:13:16.700519Z",
    "deleted_at": null,
    "sha1_hash": "918062ac5b98532d9d8515afadbf084a0fa6158d",
    "title": "2022-02-23 - Sanctions Be Damned - From Dridex to Macaw, The Evolution of Evil Corp",
    "authors": "",
    "file_creation_date": "2022-05-28T17:39:04Z",
    "file_modification_date": "2022-05-28T17:39:04Z",
    "file_size": 934823,
    "plain_text": "# Sanctions Be Damned | From Dridex to Macaw, The Evolution of Evil Corp\n\n**[sentinelone.com/labs/sanctions-be-damned-from-dridex-to-macaw-the-evolution-of-evil-corp/](https://www.sentinelone.com/labs/sanctions-be-damned-from-dridex-to-macaw-the-evolution-of-evil-corp/)**\n\nAntonio Pirozzi\n\n**By Antonio Pirozzi, Antonis Terefos and Idan Weizman**\n\n## Executive Summary\n\nSince OFAC sanctions in 2020, the global intelligence community has been split into\ndifferent camps as to how Evil Corp is operating.\nSentinelLabs assesses with high confidence that WastedLocker, Hades, Phoenix\nLocker, PayloadBIN belong to the same cluster. There are strong overlaps in terms of\ncode similarities, packers, TTPs and configurations.\nSentinelLabs assesses with high confidence that the Macaw ransomware variant is\nderived from the same codebase as Hades.\nOur analysis indicates that Evil Corp became a customer of the CryptOne packer-as-aservice from March 2020. We created a static unpacker, [de-CryptOne for CryptOne and](https://github.com/Tera0017/de-CryptOne)\nidentified different versions of this cryptor which have never previously been reported.\n\nRead the Full Report\n\n## Introduction\n\n\n-----\n\nEvil Corp (EC) is an advanced cybercrime operations cluster originating from Russia that has\n[been active since 2007. The UK National Crime Agency called it “the world’s most harmful](https://twitter.com/NCA_UK/status/1202618928209498114?s=20&t=y0N5vw32CKNwHEwECIoMDg)\ncyber crime group.” In December 2019, the U.S. Treasury Department’s Office of Foreign\n[Assets Control (OFAC) issued a sanction against 17 individuals and seven entities related to](https://home.treasury.gov/news/press-releases/sm845)\nEC cyber operations for causing financial losses of more than 100 million dollars with Dridex.\n\nAfter the indictments, the global intelligence community was split into different camps as to\nhow Evil Corp was operating. Some assessed that there was a voluntary transition of EC\noperations to another ‘trusted’ partner while the core group remained the controller of\noperations. Some had theories that Evil Corp had stopped operating and that another\nadvanced actor operated Hades, trying to mimic the same modus operandi as Evil Corp to\n[mislead attribution. Others claimed possible attribution to the HAFNIUM activity cluster.](https://awakesecurity.com/blog/incident-response-hades-ransomware-gang-or-hafnium/)\n\nSentinelLabs has conducted an in-depth review and technical analysis of Evil Corp activity,\nmalware and TTPs. Our full report has a number of important findings for the research\ncommunity. We relied heavily on our analysis of a crypter tool dubbed “CryptOne”, which\nsupports our wider clustering of Evil Corp activity. Our research also argues that the original\noperators continue to be active despite the sanctions, continuously changing their TTPs in\norder to stay under the radar.\n\nIn this post, we summarize some key observations from our technical analysis on the\nevolution of Evil Corp from Dridex through to Macaw Locker and, for the first time, publicly\ndescribe CryptOne and the role it plays in Evil Corp malware development. For the full\ntechnical analysis, comprehensive IOCs and YARA hunting rules, please see the full report.\n\n## Overview of Recent Evil Corp Activity\n\nAfter the OFAC indictment, we witnessed a change in Evil Corp TTPs: from 2020, they\nstarted to frequently change their payload signatures, using different exploitation tools and\nmethods of initial access. They switched from Dridex to the SocGholish framework to\nconfuse attribution and distance themselves from both Dridex and Bitpaymer, which fell\nwithin the scope of the sanctions. During this period, they started relying more heavily on\nCobalt Strike to gain an initial foothold and perform lateral movement, rather than PowerShell\nEmpire.\n\n[In May 2020, a new ransomware variant appeared in the wild dubbed WastedLocker.](https://www.sentinelone.com/labs/wastedlocker-ransomware-abusing-ads-and-ntfs-file-attributes/)\n[WastedLocker (S0612) employed techniques to obfuscate its code and perform tasks similar](https://attack.mitre.org/software/S0612/)\nto those already seen in BitPaymer and Dridex. Those similarities allowed the threat\n[intelligence community to identify the connections between the malware families.](https://news.sophos.com/en-us/2020/08/04/wastedlocker-techniques-point-to-a-familiar-heritage/)\n\nIn December 2020, a new ransomware variant named Hades was first seen in the wild and\n[publicly reported. Hades is a 64-bit compiled version of WastedLocker that displays](https://twitter.com/demonslay335/status/1339324224029274118?s=20)\n[important code and functionality overlaps. A few months later, in March 2021, a new variant](https://www.bleepingcomputer.com/news/security/evil-corp-switches-to-hades-ransomware-to-evade-sanctions/)\n\n\n-----\n\nPhoenix Locker appeared in the wild. Our analysis suggests this is a rebranded version of\n[Hades with little to no changes. Later, a new variant named PayloadBIN appeared in the](https://twitter.com/fwosar/status/1401110845820747797?s=20)\nwild, a continuation from Phoenix Locker.\n\n## A Unique Cluster: BitPaymer, WastedLocker, Hades, Phoenix Locker, PayloadBIN\n\nFrom our analysis, we discovered evidence of code overlaps, as well as shared\nconfigurations, packers and TTPs leading us to assess with high confidence that Bitpaymer,\nWastedLocker, Hades, PhoenixLocker and PayloadBIN share a common codebase. Our full\nreport goes into the evidence in fine detail. The following section presents a brief summary.\n\n**From BitPaymer to WastedLocker**\n\nPrevious [research shows a sort of knowledge reuse between BitPaymer and WastedLocker.](https://news.sophos.com/en-us/2020/08/04/wastedlocker-techniques-point-to-a-familiar-heritage/)\nSentinelLabs analysis shows that Hades and WastedLocker share the same codebase.\n\nAmong other similarities, detailed in the full report, we observe that the RSA functions –\nresponsible for asymmetrically encrypting the keys which were used in the AES phase to\nencrypt files – are identical in both ransomware variants, hinting that the same utility library\nwas used.\n\n**From WastedLocker to Hades**\n\nPrevious [research assessed the main similarities and differences between the two](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/)\nransomware families. SentinelLabs analysis shows that Hades and WestedLocker share the\nsame codebase.\n\nAgain we see the same RSA functions in both families. Both also implement file and\ndirectory enumeration logic identically. Comparing the logic and the Control Flow Graph of\nboth routines, we conclude that both ransomware use the same code for file and directory\nenumeration. We also found similarities between the functions responsible for drive\nenumeration.\n\n**From Hades to Phoenix Locker**\n\nIn the samples we analyzed, we discovered that Phoenix Locker was a reused and newlypacked Hades payload. Hades and Phoenix samples were compiled at the same time. We\nconfirmed that they reused a ‘clean’ Hades version each time, statically introducing junk\ncode with the help of a script in order to alter the signature. The compiler and linker versions\nare also the same. This technique of payload reuse was also seen in BitPaymer in order to\nmake the ransomware polymorphic and more evasive.\n\n**From Phoenix Locker to PayloadBIN**\n\n\n-----\n\nWe observed that the majority of PayloadBIN functions overlap with PhoenixLocker. File\nenumerating functions are practically identical.\n\nWe conducted further similarity analysis by analyzing the TTPs of the different variants. We\ndid this by extracting the main command lines from all the ransomwares and comparing\nthem. We distinguished two distinct clusters.\n\nFrom Hades onwards, we found a unique self-delete implementation including the `waitfor`\ncommand.\n```\ncmd /c waitfor /t 10 pause /d y & attrib -h\n\"C:\\Users\\Admin\\AppData\\Roaming\\CenterLibrary\\Tip\" & del\n\"C:\\Users\\Admin\\AppData\\Roaming\\CenterLibrary\\Tip\" & rd\n\"C:\\Users\\Admin\\AppData\\Roaming\\CenterLibrary\\\"\n\n```\nThis command is not present in WastedLocker, where the `choice command is used`\ninstead:\n```\ncmd /c choice /t 10 /d y & attrib -h \"C:\\Users\\Admin\\AppData\\Roaming\\Wmi\" & del\n\"C:\\Users\\Admin\\AppData\\Roaming\\Wmi\"\n\n```\nWhilst syntax difference may seem like a significant difference, these two implementations\nare very similar: the logic is the same, only the signature changes.\n\nAll ransomwares have the same implementation of Shadows copy deletion:\n```\nC:\\Windows\\system32\\vssadmin.exe Delete Shadows /All /Quiet\n\n```\nThe evidence of this code reuse supports the assessment that it is almost certain these\nransomware families are related to the same ‘factory’.\n\n## Analysis of the Cypherpunk Variant\n\n[A new, possibly experimental, variant dubbed “Cypherpunk” – first reported in June 2021-](https://www.secureworks.com/blog/hades-ransomware-operators-use-distinctive-tactics-and-infrastructure)\nwas analyzed and linked to the same lineage.\n```\nC:\\Users\\Lucas\\Documents\\OneNote Notebooks\\Personal\\General.one.cypherpunk\nC:\\Users\\Lucas\\Documents\\OneNote Notebooks\\Personal\\CONTACT-TO-DECRYPT.txt\nC:\\Users\\Lucas\\Documents\\awards.xls.cypherpunk\nC:\\Users\\Lucas\\Desktop\\ZoneMap.dwf.cypherpunk\nC:\\Users\\Administrator\\Searches\\Everywhere.search-ms.cypherpunk\nC:\\Users\\Lucas\\Desktop\\th (2).jpg.cypherpunk\nC:\\Users\\Lucas\\Documents\\pexels-photo-46710.jpeg.cypherpunk\nC:\\Users\\Lucas\\Desktop\\ppt_ch10.ppt.cypherpunk\nC:\\Users\\Lucas\\Desktop\\WEF_Future_of_Jobs.pdf.cypherpunk\n\n```\nCode similarity analysis shows that the Cypherpunk version (SHA1\n[e8d485259e64fd375e03844c03775eda40862e1c) is the same as the previous PayloadBIN](https://www.virustotal.com/gui/file/1526fc970cdb0e5a69f0ca2284d12312c6f7c9d0e77aa264aa4260411a4f03e7)\nvariant. It was compiled on 2021-04-01 17:15:24, 20 days after the PayLoadBIN sample. It is\n\n\n-----\n\npossible that this is another attempt at rebranding. Although this variant was reported, it was\n[improperly flagged as Hades.](https://www.secureworks.com/blog/hades-ransomware-operators-use-distinctive-tactics-and-infrastructure)\n\nSentinelLabs assesses this new finding is likely an indication that Evil Corp is still working on\nupdating their tradecraft in order to change their signature and stay under the radar.\n\n## Evil Corp Pivots to Macaw Locker Ransomware\n\nIn October 2021, a new ransomware variant named ‘Macaw Locker’ appeared in the wild, in\n[an attack that began on October 10th against Olympus. A few days later](https://techcrunch.com/2021/10/12/olympus-confirms-us-cyberattack-weeks-after-blackmatter-ransomware-hit-emea-systems/) Sinclair Broadcast\n[Group was also attacked, causing widespread disruption. Some researchers claimed a](https://www.bleepingcomputer.com/news/security/evil-corp-demands-40-million-in-new-macaw-ransomware-attacks/)\npossible connection with WastedLocker, but to date no further details have emerged.\n\nMacaw ransom note\nThe ransomware presents anti-analysis features like API hashing and indirect API calls with\nthe intention of evading analysis. One aspect that immediately sets Macaw apart is that it\nrequires a custom token, provided from the command line, which appears to be specific to\neach victim; without it, the ransomware won’t execute.\n```\nmacaw_sample.exe -k \n\n```\n[The use of a custom token is also seen in Egregor and](https://www.sentinelone.com/labs/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone/) [BlackCat ransomware families, and is](https://www.sentinelone.com/labs/blackcat-ransomware-highly-configurable-rust-driven-raas-on-the-prowl-for-victims/)\n[a technique used to aid anti-analysis (T1497.002).](https://attack.mitre.org/techniques/T1497/002/)\n\nAnother new addition to Macaw is a special function that acquires the imports for APIs at\nruntime, instead of when the executable is started via the PE import section. Below, we can\nsee the function that is used before each API call to get its address prior to the call itself.\n\n\n-----\n\nMacaw function to dynamically fetch addresses\nThe function gets a 32-bit value that uniquely represents the required API and searches for it\nthrough a data structure created beforehand. The data structure can be described as an\narray with small binary search trees in each of its entries.\n\nWe assessed the similarity of two core functions between Hades and Macaw. In both strains,\nthe implementation is the same. The only minor differences are from the imports fetched at\nruntime.\n\n## CryptOne: One Packer To Rule Them All\n\nCryptOne (also known as HellowinPacker) was a special packer used by Evil Corp up until\nmid-2021.\n\n[CryptOne appears to have first been noticed in 2015. Early versions were used by an](https://blog.malwarebytes.com/threat-analysis/2015/12/malware-crypters-the-deceptive-first-layer/)\n[assortment of different malware families such as NetWalker, Gozi, Dridex,](https://www.sentinelone.com/labs/netwalker-ransomware-no-respite-no-english-required/) [Hancitor and](https://www.sentinelone.com/blog/hancitor-loads-gozi-isfb-banking-malware/)\n[Zloader. In 2019, Bromium analyzed and reported it as in use by Emotet. In June 2020,](https://www.bromium.com/wp-content/uploads/2019/07/Bromium-Emotet-Technical-Analysis-Report.pdf) NCC\nGroup reported that CryptOne was used to pack WastedLocker. In 2021, [researchers](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/paas-or-how-hackers-evade-antivirus-software/)\nobserved CryptOne being advertised as a Packer-as-a-Service on various crime-oriented\nforums.\n\nCryptOne has the following characteristics and features:\n\nSandbox evasion with `getInputState() or` `GetKeyState() API;`\nAnti-emulation with `UCOMIEnumConnections and the`\n```\n   IActiveScriptParseProcedure32 interface;\n\n```\nCode-flow obfuscation;\n\n\n-----\n\nWe created a static unpacker, [de-CryptOne, which unpacks both x86 and x64 samples. It](https://github.com/Tera0017/de-CryptOne)\noutputs two files:\n\n1. the shellcode responsible for unpacking\n2. the unpacked sample.\n\nWe collected CryptOne packed samples, and with the use of the above tool, unpacked and\ncategorized them at scale.\n\n## Unpacking CryptOne\n\nCryptOne unpacking method consists of two stages:\n\n1. Decrypts and executes embedded shellcode.\n2. Shellcode decrypts and executes embedded executables.\n\nCryptOne gets chunks of the encrypted data, which are separated by junk.\n\nCryptOne junk data\nExample Memory Dump:\n\n0x5EE00, Encrypted size\n0x4011CA, Address of encrypted data\n0x4D/”M”, Junk data\n0x14, Junk size\n0x7A, Chunk Size\n\n\n-----\n\nAfter removal of the junk data, the decryption starts with a simple XOR-Key which increases\nby 0x4 in each round. The initial XOR-Key is `0xA113 .`\n\nCryptOne XOR Key\nOnce the shellcode is decrypted, we can partially observe the string “This program cannot be\nrun in DOS mode” where this data contains an executable which requires a second\ndecryption.\n\nCryptOne partially\n\ndecrypted shellcode\nSimilar to previous decryption, this time the shellcode decrypts the embedded binary.\n\n\n-----\n\nFastcall\n\nShellcode XOR\nThe shellcode allocates and copies the encrypted executable and starts the decryption loop;\nonce it finishes, it jumps to the EntryPoint and executes the unpacked sample.\n\nCryptOne\n\nexecuting the unpacked sample\nAt this stage we can observe strings related to the unpacked sample.\n\n\n-----\n\nCryptOne embedded\n\nstrings after unpacking\n\n## A Unique Factory\n\nHunting for CryptOne led us to identify different implementations of the stub, some of which\nhave never been reported previously. Each version is identified by a certain signature, listed\nbelow:\n\n111111111\\\\{aa5b6a80-b834-11d0-932f-00a0c90dcaa9}\n1nterfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\n444erfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\n555erfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\n5nterfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\n987erfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\nInterfac4\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\nInterfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\naaaerfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\ninterfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\nrrrerfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07}\n\nThe first part of the string is composed of a custom string (111111111, 1nterfacE,\n444erfacE,…) which is replaced at runtime by the ‘interface’ keyword, creating the following\nregistry key:\n```\nHKEY_CLASSES_ROOT\\interface\\{b196b287-bab4-101a-b69c-00aa00341d07}\n\n```\nThe registry keys are related to the `UCOMIEnumConnections and`\n\n\n-----\n\nOnce executed, the cryptor checks for the presence of those keys before loading the next\nstage payload. If it does not find the keys, then the malware goes into an endless loop\nwithout doing anything as an anti-emulation technique. This works because some emulators\ndo not implement the full Windows registry.\n\nIn reviewing two different versions of CryptOne:\n```\naaerfacE\\\\{b196b287-bab4-101a-b69c-00aa00341d07} \n111111111\\\\{aa5b6a80-b834-11d0-932f-00a0c90dcaa9}\n\n```\nwe noticed that in order to update the signature, the actor needs to re-compile the cryptor as\nthe cryptor implementation changes.\n\n## CryptOne Timeline\n\nOur analysis shows that it is likely Evil Corp started being a customer of the CryptOne\nservice from March 2020. From March to May 2020 we found WastedLocker, gozi_rm3\n(version:3.00 build:854) and Dridex (10121) samples were all packed and compiled in the\nsame timeframe using the same CryptOne stub signature(InterfacE).\n\nFor a limited period of time between May 2020 and August 2020, we observed different\nversions of CryptOne overlaps.\n\nCryptOne overlaps between May 2020 and August 2020\nIt seems that from a specific point in time, around September 2020, Hades, PhoenixLocker\nand PayloadBIN started adopting a specific CryptOne stub identified by the signature:\n\n\n-----\n\n```\n111111111\\\\{aa5b6a80 b834 11d0 932f 00a0c90dcaa9}\n\n```\nFrom December 2020, the CryptOne version ‘111111111’ appeared in the wild without any\noverlap.\n\n## Conclusion\n\nClustering Evil Corp activity is demonstrably difficult considering that the group has changed\nTTPs several times in order to bypass sanctions and stay under the radar. This is in addition\nto the overall trend of actors receding back into secrecy. In this research, we connect the\ndots in the Evil Corp ecosystem, cluster Evil Corp malware, document the group’s activities\nand provide insight into their TTPs.\n\nSentinelLabs assesses with high confidence that WastedLocker, Hades, PhoenixLocker,\nMacaw Locker and PayloadBIN belong to the same cluster. Our assessment is based on\ncode similarity and reuse, timeline consistency and nearly identical TTPs across the\nransomware families indicating there is a consistent modus operandi for the cluster. In\naddition, we assess that there is a likely evolutionary link between WastedLocker and\nBitPaymer, and suggest that it can be attributed to the same Evil Corp activity cluster.\n\nWe fully expect that Evil Corp will continue to evolve and target organizations. In addition, we\nassess it is likely they will also continue to advance their tradecraft, finding new methods of\nevading detection and misleading attribution. SentinelLabs will continue tracking this activity\ncluster to provide insight into its evolution.\n\nIn-depth technical analysis, Indicators of Compromise and further technical references are\navailable in the full report.\n\n[Read the Full Report](https://s1.ai/PDF_EvilCorp)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-23 - Sanctions Be Damned - From Dridex to Macaw, The Evolution of Evil Corp.pdf"
    ],
    "report_names": [
        "2022-02-23 - Sanctions Be Damned - From Dridex to Macaw, The Evolution of Evil Corp.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535914,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653759544,
    "ts_modification_date": 1653759544,
    "files": {
        "pdf": "https://archive.orkl.eu/918062ac5b98532d9d8515afadbf084a0fa6158d.pdf",
        "text": "https://archive.orkl.eu/918062ac5b98532d9d8515afadbf084a0fa6158d.txt",
        "img": "https://archive.orkl.eu/918062ac5b98532d9d8515afadbf084a0fa6158d.jpg"
    }
}