{
    "id": "ed4e2cb5-7a04-48fe-8c26-6138ccc6cd21",
    "created_at": "2023-01-12T15:01:54.845196Z",
    "updated_at": "2025-03-27T02:05:46.960904Z",
    "deleted_at": null,
    "sha1_hash": "6219957b8abc0ed84df283ded4c32f23aacffc9a",
    "title": "2021-09-16 - No Longer Just Theory- Black Lotus Labs Uncovers Linux Executables Deployed as Stealth Windows Loaders",
    "authors": "",
    "file_creation_date": "2022-05-28T05:01:23Z",
    "file_modification_date": "2022-05-28T05:01:23Z",
    "file_size": 985735,
    "plain_text": "# No Longer Just Theory: Black Lotus Labs Uncovers Linux Executables Deployed as Stealth Windows Loaders\n\n**blog.lumen.com/no-longer-just-theory-black-lotus-labs-uncovers-linux-executables-deployed-as-stealth-windows-**\nloaders/\n\nSeptember 16, 2021\n\n[Black Lotus Labs Posted On September 16, 2021](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/no-longer-just-theory-black-lotus-labs-uncovers-linux-executables-deployed-as-stealth-windows-loaders/#respond)\n\n## Executive Summary\n\nIn April 2016, Microsoft shocked the PC world when it announced the Windows Subsystem\nfor Linux (WSL). WSL is a supplemental feature that runs a Linux image in a near-native\nenvironment on Windows, allowing for functionality like command line tools from Linux\nwithout the over-head of a virtual machine. While this new functionality was welcomed by\ndevelopers for the freedom it offers to leverage open-source software, it is also a new attack\nsurface threat actors can – and do – target.\n\n\n-----\n\nBlack Lotus Labs recently identified several malicious files that were written primarily in\nPython and compiled in the Linux binary format ELF (Executable and Linkable Format) for\nthe Debian operating system. These files acted as loaders running a payload that was either\nembedded within the sample or retrieved from a remote server and was then injected into a\nrunning process using Windows API calls. While this approach was not particularly\nsophisticated, the novelty of using an ELF loader designed for the WSL environment gave\nthe technique a detection rate of one or zero in Virus Total, depending on the sample, as of\nthe time of this writing.\n\nThus far, we have identified a limited number of samples with only one publicly routable IP\naddress, indicating that this activity is quite limited in scope or potentially still in development.\nTo our knowledge, this small set of samples denotes the first instance of an actor abusing\nWSL to install subsequent payloads. We hope that by illuminating this distinct tradecraft, we\ncan help drive better detection and alerting before its use becomes more rampant.\n\n## Introduction\n\nIn early August, as part of the team’s proactive threat hunting process, Black Lotus Labs\nresearchers discovered a series of suspicious ELF files compiled for Debian Linux. The files\nwere written in Python 3 and converted into an ELF executable with PyInstaller. The Python\ncode acted as a loader by utilizing various Windows APIs which enabled the retrieval of a\nremote file and then injection into a running process. This tradecraft could allow an actor to\ngain an undetected foothold on an infected machine. As the negligible detection rate on\nVirusTotal suggests, most endpoint agents designed for Windows systems don’t have\nsignatures built to analyze ELF files, though they frequently detect non-WSL agents with\nsimilar functionality. During our investigation, we discovered two variants of the ELF loader\napproach: the first was written purely in Python, while the second variant predominantly used\n[Python to call various Windows APIs using ctypes and invoke a PowerShell script. We](https://docs.python.org/3/library/ctypes.html)\nhypothesize that the PowerShell variant is still in development or perhaps crafted for a\nspecific environment, as it did not execute under its own volition in our test environment.\nHowever, our research indicates this is a viable approach, as we were able to successfully\ncreate a proof of concept that called Windows APIs from the WSL subsystem.\n\n## Technical Details\n\nOur team at Black Lotus Labs identified a series of samples uploaded every two to three\nweeks from as early as May 3, 2021, through August 22, 2021, that target the WSL\nenvironment. All samples share similar tradecraft and are compiled with Python 3.9 using\nPyInstaller for the Debian operating system version 8.3.0-6. Some of the samples contained\nlightweight payloads which could have been generated from open-source tools such as\nMSFVenom or Meterpreter. In other cases, the files attempted to download shellcode from a\nremote C2. Over the course of the summer, we observed an evolution of this tradecraft, with\n\n\n-----\n\nthe earliest samples written purely in Python 3 and the latest iteration using ctypes to call\nWindows APIs, in addition to employing PowerShell to perform subsequent actions on the\nhost machine.\n\n## Python Variant\n\nThe variant written in Python that does not utilize any Windows API appeared to be the\nearliest iteration of the loader file. One notable feature is that this loader used standard\nPython libraries, making it cross-compatible to run on both Linux and Windows machines.\nWe found one test sample where the script prints the words “Пивет Саня” which translates\nfrom Russian to the informal “Hello Sanya”, indicating that the author has some familiarity\nwith the language. All of the files associated with this tradecraft contained private, or nonroutable, IP addresses – except for one. That sample contained a public IP address of\n185.63.90[.]137 as well as a loader file written in Python and converted into an executable\nvia PyInstaller. The file first attempted to allocate memory from the machines, then created a\nnew process and injected a resource that was stored on a remote server located at\nhxxp://185.63.90[.]137:1338/stagers/l5l.py. When Black Lotus Labs researchers tried to grab\nthe resource from this remote server, the file was already taken offline, indicating that the\nthreat actor left this address in either from a test or a previous campaign.\n\nWe did identify a couple of other malicious files that all communicated with the same IP\naddress (185.63.90[.]137) around the same timeframe as the samples containing\n[Meterpreter payloads, some of which were obfuscated with the Shikata Ga Nai encoder.](https://en.wikipedia.org/wiki/Shikata_ga_nai)\nWhile the Meterpreter framework is very well known in the industry, that has not stopped\ncybercrime and ransomware groups from using it in the past. We also hypothesize that it\nwould be trivial for the operator to swap out the Meterpreter payload for some more\nadvanced tools such as either Cobalt Strike or even a custom agent.\n\n## WSL Variant Using PowerShell and Ctypes\n\nThe ELF to Windows binary file execution path was different in various files. In some\nsamples, PowerShell was used to inject and execute the shellcode; in others, Python ctypes\nwas used to resolve Windows APIs.\n\nIn one PowerShell sample, the compiled Python called three functions: kill_av(),\nreverseshell() and windowspersistance().\n\n\n-----\n\nFigure 1: Part of the decompiled kill_av and windowspersistence functions\n\nThe kill_av() function did as its name implies: it attempted to kill suspected AV products and\nanalysis tools using os.popen(). The reverseshell() function used a subprocess to execute a\nBase64-encoded PowerShell script every 20 seconds inside of an infinite while true loop,\nblocking any other function from being executed. The windowspersistence() function copied\nthe original ELF file to the appdata folder under the name payload.exe and used a\nsubprocess to add a registry run key for persistence. In the above image,\nwindowspersistance() is called with the string “TIME TO Presist” (note the misspelling of\n“persist”).\n\n\n-----\n\nFigure 2: The reverseshell and kill_av functions showing the PowerShell call and start of AV\nlist\n\nThe decoded PowerShell used GetDelegateForFunctionPointer to call VirtualAlloc, copy the\nMSFVenom payload to the allocated memory and again use GetDelegateForFuctionPointer\nto call CreateThread on the allocated memory containing the payload.\n\n\n-----\n\nFigure 3: Final PowerShell script that injects and calls the MSFVenom payload\n\nAnother sample used Python ctypes to resolve Windows APIs to inject and call the payload.\nDuring our analysis we discovered small inconsistencies, such as variable types, which\nrendered the sample inert. This led us to assess that the codebase is likely still in\ndevelopment, though close to being finished.\n\nFigure 4: Deobfuscated example using Python ctypes\n\nBased on Black Lotus Labs visibility on the one routable IP address, this activity appeared to\nbe narrow in scope with targets in Ecuador and France interacting with the malicious IP\n(185.63.90[.]137) on ephemeral ports between 39000 – 48000 in late June and early July.\nBased off of the limited number of connections, this could have been an actor testing this\nnew capability from a VPN or proxy node. With broader industry detection of this technique,\nwe suspect additional activity will be uncovered.\n\n## Conclusion\n\nAs the once distinct boundaries between operating systems continue to become more\nnebulous, threat actors will take advantage of new attack surfaces. We advise defenders\n[who’ve enabled WSL ensure proper logging in order to detect this type of tradecraft.](https://docs.microsoft.com/en-us/archive/blogs/wsl/wsl-antivirus-and-firewall-compatibility)\n\nTo combat this particular campaign, Black Lotus Labs null-routed the threat actor\ninfrastructure across the Lumen global IP network. Black Lotus Labs continues to follow this\nactivity to detect and disrupt similar compromises, and we encourage other organizations to\nalert on this and similar campaigns in their environments.\n\n**For additional IOCs such as file hashes associated with this campaign and this threat**\n**actor’s larger activity cluster, please visit** **[our GitHub page.](https://github.com/blacklotuslabs/IOCs/blob/main/WSL%20samples.txt)**\n\n**If you would like to collaborate on similar research, please contact us on**\n**Twitter** **[@BlackLotusLabs.](https://twitter.com/BlackLotusLabs)**\n\nThis information is provided “as is” without any warranty or condition of any kind, either\nexpress or implied. Use of this information is at the end user’s own risk.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-16 - No Longer Just Theory- Black Lotus Labs Uncovers Linux Executables Deployed as Stealth Windows Loaders.pdf"
    ],
    "report_names": [
        "2021-09-16 - No Longer Just Theory- Black Lotus Labs Uncovers Linux Executables Deployed as Stealth Windows Loaders.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535714,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653714083,
    "ts_modification_date": 1653714083,
    "files": {
        "pdf": "https://archive.orkl.eu/6219957b8abc0ed84df283ded4c32f23aacffc9a.pdf",
        "text": "https://archive.orkl.eu/6219957b8abc0ed84df283ded4c32f23aacffc9a.txt",
        "img": "https://archive.orkl.eu/6219957b8abc0ed84df283ded4c32f23aacffc9a.jpg"
    }
}