{
    "id": "ed667211-ae31-4836-b681-6b7af12a8517",
    "created_at": "2023-01-12T15:01:36.693737Z",
    "updated_at": "2025-03-27T02:05:25.192301Z",
    "deleted_at": null,
    "sha1_hash": "cf336db243eff3b88d8e2f2081f6d0916e66c3c2",
    "title": "2022-09-28 - Prilex- the pricey prickle credit card complex",
    "authors": "",
    "file_creation_date": "2022-10-02T12:25:38Z",
    "file_modification_date": "2022-10-02T12:25:38Z",
    "file_size": 2026820,
    "plain_text": "# Prilex: the pricey prickle credit card complex\n\n**securelist.com/prilex-atm-pos-malware-evolution/107551/**\n\nAuthors\n\nGReAT\n\nPrilex is a Brazilian threat actor that has evolved out of ATM-focused malware into modular point-of-sale malware. The group was behind one\nof the largest attacks on ATMs in the country, infecting and jackpotting more than 1,000 machines, while also cloning in excess of 28,000 credit\ncards that were used in these ATMs before the big heist. But the criminals’ greed had no limits: they wanted more, and so they achieved it.\n\nActive since 2014, in 2016, the group decided to give up ATM malware and focus all of their attacks on PoS systems, targeting the core of the\npayment industry. These are criminals with extensive knowledge of the payment market, and EFT software and protocols. They quickly\nadopted the malware-as-a-service model and expanded their reach abroad, creating a toolset that included backdoors, uploaders and stealers\nin a modular fashion. Since then, we have been tracking the threat actor’s every move, witnessing the damages and great financial losses they\nbrought upon the payments industry.\n\nThe Prilex PoS malware evolved out of a simple memory scraper into very advanced and complex malware, dealing directly with the PIN pad\nhardware protocol instead of using higher level APIs, doing real-time patching in target software, hooking operating system libraries, messing\nwith replies, communications and ports, and switching from a replay-based attack to generate cryptograms for its GHOST transactions even\nfrom credit cards protected with CHIP and PIN technology.\n\n## It all started with ATMs during a carnival celebration\n\nDuring the carnival of 2016, a Brazilian bank realized that their ATMs had been hacked, with all the cash contained in those machines stolen.\nAccording to reports from law enforcement agencies, the criminals behind the attack were able to infect more than 1,000 machines belonging\nto one bank in the same incident, which allowed them to clone 28,000 unique credit cards across Brazil.\n\nThe attackers did not have physical access to the machines, but they were able to access the bank’s network by using a DIY device containing\na 4G router and a Raspberry PI. By opening a backdoor, they were able to hijack the institution’s wireless connection and target ATMs at will.\nAfter obtaining initial network access, the attacker would run a network recognition process to find the IP address of each of the ATMs. With\nthat information in hand, the attackers would launch a lateral movement phase, using default Windows credentials and then installing customcrafted malware in the desired systems. The backdoor would allow the attacker to empty the ATM socket by launching the malware interface\nand typing a code supplied by the mastermind, the code being specific to each ATM being hacked.\n\n\n-----\n\n**_ATM infected with Prilex ready to dispense money_**\n\nThe malware used in the attack was named Prilex and had been developed from scratch by using privileged information and advanced\nknowledge of the ATM network. To control the ATMs, Prilex did patch in legitimate software for jackpotting purposes. Besides its capability to\nperform a jackpot, the malware was also capable of capturing information from magnetic strips on credit and debit cards inserted into the\ninfected ATMs. Afterwards, this valuable information could be used to clone cards and steal further funds from the bank’s clients.\n\n## Evolving into PoS malware\n\nPrilex has evolved out of ATM-focused malware into modular point-of-sale malware targeting payment systems developed by Brazilian\n[vendors, the so-called EFT/TEF software. As we](https://pt.wikipedia.org/wiki/Transfer%C3%AAncia_eletr%C3%B4nica_de_fundos) [noted in 2018, there are many similarities between their ATM and PoS versions. Their first](https://securelist.com/goodfellas-the-brazilian-carding-scene-is-after-you/84263/)\nPoS malware was spotted in the wild in October 2016. The first two samples had 2010/2011 as the compilation date, as shown on the graph\nbelow. However, we believe that invalid compilation dates were set due to incorrect system date and time settings. In later versions, the\ntimestamps corresponded to the times when the samples were discovered. We also noticed that in the 2022 branch, the developers started\nusing Subversion as the version control system.\n\n**_[Versions of the Prilex PoS malware: 3 new versions in 2022 (download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2022/09/28075115/01-en-prilex.png)_**\n\nAs we see on the graph, Prilex was highly active in 2020, but suddenly disappeared in 2021, resurfacing in 2022 with a release of three new\nvariants.\n\n[The PoS version of Prilex is coded in Visual Basic, but the stealer module, described in this article, is in p-code. In a nutshell, this is an](https://www.brainbell.com/tutors/Visual_Basic/A_Little_About_P_Code.htm)\nintermediate step between high-level instructions in a Visual Basic program and the low-level native code executed by a CPU. Visual Basic\ntranslates p-code statements into native code at runtime.\n\n## A link to the past\n\n[Prilex is not the only type of PoS malware to originate in Brazil. We saw a weak link with the old Trojan-Spy.Win32.SPSniffer, which we](https://securelist.com/the-chupa-cabra-malware-attacks-on-payment-devices/32248/)\n[described in 2010: both families are able to intercept signals from PIN pads, but use different approaches in doing so.](https://en.wikipedia.org/wiki/PIN_pad)\n\nPIN pads are equipped with hardware and security features to ensure that security keys are erased if someone tries to tamper with the device.\nIn fact, the PIN is encrypted in the device upon entry using a variety of encryption schemes and symmetric keys. Most often, this is a triple\nDES encoder, making it hard to crack the PIN.\n\nThere is a problem, though: these devices are always connected to a computer via a USB or serial port, which communicates with the EFT\nsoftware. Older and outdated PIN pad devices use obsolete and weak cryptography schemes, making it easy for malware to install a USB or\nserial port sniffer to capture and decrypt the traffic between the PIN pad and the infected system. This is how SPSniffer gets credit card data.\n\n\n-----\n\nSo et es t e t a c s ot e e e c ypted\n\n**_SPSniffer: serial port sniffer allowing capture of not-encrypted traffic_**\n\nThe main approach used by Prilex for capturing credit card data is to use a patch in the PoS system libraries, allowing the malware to collect\ndata transmitted by the software. The malware will look for the location of a particular set of executables and libraries in order to apply the\npatch, thus overwriting the original code. With the patch in place, the malware collects the data from TRACK2, such as the account number\nand expiration date, in addition to other cardholder information needed to perform fraudulent transactions.\n\n## Initial infection vector\n\nPrilex is not a widespread type of malware, as it is not distributed through email spam campaigns. It is highly targeted and is usually delivered\nthrough social engineering, e.g., a target business may receive a call from a “technician” who insists that the company needs to update its PoS\nsoftware. The fake technician may visit the target in person or request the victims to install AnyDesk and provide remote access for the\n“technician” to install the malware.\n\n**_Warning from a PoS vendor about Prilex social engineering attacks_**\n\n## Messing with the EMV standard\n\nBrazil began migrating to EMV in 1999, and today, nearly all cards issued in the country are chip enabled. A small Java-based application lives\ninside the chip and can be easily manipulated in order to create a “golden ticket” card that will be valid in most—if not all—point-of-sale\nsystems. This knowledge has enabled the criminals to upgrade their toolset, allowing them to create their own cards featuring this new\ntechnology and keeping them “in the business.”\n\n[The initial versions of Prilex were capable of performing the “replay attack,” where, rather than breaking the EMV protocol, they instead took](https://encyclopedia.kaspersky.com/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanationglossary/replay-attack/)\nadvantage of poor implementations. Since payment operators fail to perform some of the validations required by the EMV standard, criminals\ncan exploit this vulnerability within the process to their benefit.\n\nIn this kind of attack, fraudsters push regular magnetic stripe transactions through the card network as EMV purchases, as they are in control\nof a payment terminal and have the ability to manipulate data fields for transactions put through that terminal. Later they switched to capturing\ntraffic from real EMV-based chip card transactions. The thieves could insert stolen card data into the transaction stream, while modifying the\nmerchant and acquirer bank account on the fly.\n\n\n-----\n\na a cybe c a s a e success u y au c ed ep ay attac s s ce at east 0 s po ted out by a ebs, a s a a c a\n[institution in New England battled some $120,000 in fraudulent charges from Brazilian stores within less than two days. The bank managed to](https://krebsonsecurity.com/2014/10/replay-attacks-spoof-chip-card-charges/)\nblock $80,000, but the bank’s processor, which approves incoming transactions when the core systems are offline, let through the other\n$40,000. All of the fraudulent transactions were debit charges. All of them came across MasterCard’s network and appeared to be chip\ntransactions without a PIN to MasterCard’s systems.\n\n[Also worth mentioning is the attack against a German bank in 2019, which registered €1.5 million in losses and used the same technique. The](https://www.zdnet.com/article/german-bank-loses-eur1-5-million-in-mysterious-cashout-of-emv-cards/)\nPrilex gang claimed responsibility. Judging by the name fields and the functionality of the tool, they probably used the software they are selling\nin the black market.\n\nTo automate attacks using cloned credit cards, Prilex criminals used tools like Xiello, discovered by our telemetry in 2020. This tool allows the\ncybercriminals to use credit cards in a batch when making fraudulent purchases. It sends the purchase data to credit card acquirers, who then\napprove or deny the transactions.\n\n**_Xiello tool used by Prilex to automate transactions_**\n\nAs the payment industry and credit card issuers fixed EMV implementation errors, replay attacks became obsolete and ineffective, pushing the\nPrilex gang to innovate and adopt other ways of credit card fraud.\n\n## From “Replay” to “Ghost”\n\nThe latest versions of Prilex show certain differences to previous ones in the way the attack occurs: the group has switched from the replay\nattacks to fraudulent transactions using cryptograms generated by the victim card during the in-store payment process, referred to by the\nmalware authors as “GHOST transactions.”\n\nIn these attacks, the Prilex samples were installed in the system as RAR SFX executables that extracted all required files to the malware\ndirectory and executed the installation scripts (VBS files). From the installed files, we can highlight three modules used in the campaign: a\nbackdoor, which is unchanged in this version except for the C2 servers used for communication; a stealer module; and an uploader module.\n\n**_Prilex methods of maintaining persistence_**\n\n\n-----\n\ne stea e odu e s espo s b e o te cept g a co u cat o s bet ee t e po t o sa e so t a e a d t e pad used o ead g t e\ncard during the transaction. Once it identifies a running transaction, the malware will intercept and modify the content of the transaction in\norder to be able to capture the card information and to request new EMV cryptograms to the victim’s card. These cryptograms are then used in\nthe GHOST transactions.\n\n**_Method used to parse the PIN pad messages sent/received_**\n\nIn order to target a specific process, the criminals will perform an initial screening of the machine—to check if it is an interesting target with\nenough credit card transactions and to identify the process they will target.\n\nAfter the process is identified, the malware will move forward to install the hooks needed to intercept the transaction information. As the\ncommunication between the PoS software and the card reader happens through the COM port, the malware will install a hook to many\nWindows APIs inside the targeted process, aiming to monitor and change data as needed. Interestingly enough, instead of allocating memory\n[to the hook procedure, Prilex finds free space within the modules memory, a technique called code cave, making it hard for some security](https://en.wikipedia.org/wiki/Code_cave)\nsolutions to detect the threat in an infected system.\n\n**_Hook code added into CloseHandle process_**\n\nAll captured information from the transaction is saved to an encrypted file placed in a directory previously set by the malware configuration.\nThose files will later be sent to the malware C2 server, allowing the cybercriminals to make transactions through a fraudulent PoS device\nregistered in the name of a fake company.\n\n\n-----\n\n**_Captu ed c ed t ca d data t at_** **_be ate se t to t e ope ato se_** **_e_**\n\n[The previous version monitored the transaction in order to get the cryptogram, generated by the card for the original transaction, and then to](https://en.wikipedia.org/wiki/Cryptogram)\nperform a replay attack using the collected cryptogram. In this case, the cryptogram has the same ATC (Application Transaction Counter),\nallowing the fraudulent transaction to be identified by the reuse of the ATC as well as the fact that the date inside the cryptogram did not match\nthe date when it was submitted, as the fraudulent transactions were submitted at a later point in time.\n\nIn GHOST attacks performed by the newer versions of Prilex, it requests new EMV cryptograms after capturing the transaction. These\ncryptograms will then be used in a fraudulent transaction through one of the cybercrime tools whose output log can be seen below.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n\n\n[START GHOST]          _\n\n80CA9F17             |\n\n9F1701039000           |\n\n002000800826435643FFFFFFFF    | Check PIN\n\n9000               _|\n\n80AE80001D00000000010000000000000000760000008000098620060600B4E5C6EB -> Generate AC\n\n80128000AA5EA486052A8886DE06050A03A4B8009000 -> Generated ARQC\n\n[END GHOST]\n\n\nThe table above shows the data collected from the malware. It contains the Authorization Request Cryptogram (ARQC) that was generated by\nthe card and should now be approved by the card issuer. After dissecting the response\n(80128000AA5EA486052A8886DE06050A03A4B8009000), we have the following information.\n\n**Data** **Field details**\n\n80\n\n12 Size of the response: 18 bytes\n\n80 Cryptogram Information Data: ARQC (Authorization Request Cryptogram): go and ask the issuer\n\n00AA ATC: Application Transaction Counter\n\n5EA486052A8886DE Application Cryptogram\n\n06050A03A4B800 Issuer Application Data\n\n9000 Response OK\n\nMultiple application cryptograms are applied to the card, where the amount of the transaction (blue), ATC (green) and the generated\ncryptogram (red) change for each transaction.\n\n[START GHOST]\n80CA9F179F1701039000002000800826435643FFFFFFFF900080AE80001D00000000010000000000000000760000008000098620060600B4E\n\n[END GHOST]\n[START GHOST]\n80CA9F179F1701039000002000800826435643FFFFFFFF900080AE80001D00000000100000000000000000760000008000098620060600E22\n\n[END GHOST]\n[START GHOST]\n80CA9F179F1701039000002000800826435643FFFFFFFF900080AE80001D0000000020000000000000000076000000800009862006060007E\n\n[END GHOST]\n[START GHOST]\n80CA9F179F1701039000002000800826435643FFFFFFFF900080AE80001D00000000300000000000000000760000008000098620060600259\n\n[END GHOST]\n\nIn a nutshell, this is the entire Prilex scheme:\n\n\n-----\n\n**_Prilex: from infection to cashout_**\n\n## Backdoor module\n\nThe backdoor has many commands, and aside from memory scanning common to memory scrappers, older (ATM) Prilex versions also\nfeatured a command to debug a process and peek into its memory. It is highly likely that this was used to understand target software behavior\nand perform adjustments on the malware or environment to perform fraudulent transactions. Older versions of Prilex performed patching on\nspecific software libraries, whereas newer samples do not rely on specific software anymore and will instead hook Windows APIs to perform its\njob.\n\n**_The Prilex debugger_**\n\nHere’s a list of commands used in the ATM version of Prilex, which include debugging:\n\n\n-----\n\neboot, Se d eys, S o o, ject, U ject, de o, ecu sos, Get p, SetSta tup, ausa ocesso, be a ocesso, **ebug,**\nSendSnapShot, GetStartup, CapRegion, CapFerro, KillProcess, Shell, Process, GetModules, GetConfig, StartSendScreen, StopSendScreen,\nReLogin, StartScan, GetKey, SetConfig, RefreshScreen, Download, TakeRegions, Enviar Arquivo, ScanProcessStart, ScanProcessStop,\nStartRegiao, StopRegiao, StartDownload, StopDownload.\n\nEven though a new set of commands has been added to the PoS version, we could find some of those from the ATM attack still being used.\nNumerous available commands are for general use, allowing the criminals to collect information about the infected machine.\n\n**Command** **Description**\n\nDownload Download a file from the remote server\n\nShell Execute a specified command via CMD\n\nGetConfig Get the configuration file\n\nKillProcess Terminate a process\n\nSetStartup Add the process to a startup registry key\n\nStartSendScreen Start screen capture\n\nStopSendScreen Stop screen capture\n\n## Uploader Module\n\nThis module is responsible for checking the directory specified in the CABPATH parameter in the config file and sending all cab files generated\nfrom the stolen transactions to the server; the files are sent through an HTTP POST request. The endpoint used by the module is also\nmentioned in the uploader configuration file.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n\n\n[SNDCAB]\n\nCABHOST=C2\n\nCABPORT=80\n\nCABPAGE=/upload.php\n\nCABPATH=c:\\cab\n\n\nThe use of this module indicates a change in the group’s operation structure, since in the previous version, the collected information was sent\nto a server whose address was hardcoded into the stealer code, and the module used the same protocol as the backdoor. This uploader\nallows the operator to set the endpoint for the collected information as indicated in the configuration file; judging from the samples analyzed, it\nis possible to see a different infrastructure involved in the process.\n\n**_Captured data stored in the uploader C2_**\n\n## Malware-as-a-service\n\n\n-----\n\n0 9, a ebs te c a g to be a ated t e sta ted o e g at t sa d as a a a e pac age c eated by t e g oup e a e tt e\nconfidence in these claims: the site could be operated by copycats trying to impersonate the group and catch some money using the reputation\nPrilex has earned over the years.\n\nThis website was still up and running at the time of writing this.\n\nThe asking price for what is supposedly a Prilex PoS kit is $3,500.\n\nThe website says its owners have worked with Russian cybercriminals in the past, another claim we cannot confirm. Worth mentioning, too, is\nthat our [Digital Footprint Intelligence service found citations of a Prilex malware package sold through Telegram chats, in an underground](https://media.kaspersky.com/en/business-security/enterprise/kaspersky-digital-footprint-intelligence-datasheet.pdf)\nchannel, priced between €10,000 and $13,000. We have no way of confirming that what is being offered is the real Prilex malware.\n\nAt the same time, Prilex now using Subversion is a clear sign they are working with more than one developer.\n\n## Conclusions\n\nThe Prilex group has shown a high level of knowledge about credit and debit card transactions, and how software used for payment\nprocessing works. This enables the attackers to keep updating their tools in order to find a way to circumvent the authorization policies,\nallowing them to perform their attacks.\n\nOver years of activity, the group has changed its attack techniques a lot. However, it has always abused processes relating to PoS software to\nintercept and modify communications with the PIN pad. Considering that, we strongly suggest that PoS software developers implement self[protection techniques in their modules, such as the protection available through our Kaspersky SDK, aiming to prevent malicious code from](https://www.kaspersky.com/antivirus-sdk)\ntampering with the transactions managed by those modules. To credit card acquirers and issuers, we recommend avoiding “security by\nobscurity”: do not underestimate the fraudster. All EMV validations must be implemented!\n\nPrilex’s success is the greatest motivator for new families to emerge as fast-evolving and more complex malware with a major impact on the\npayment chain.\n\n[To financial institutions who fell victims to this kind of fraud, we recommend our Kaspersky Threat Attribution Engine to help IR teams with](https://www.kaspersky.com/enterprise-security/cyber-attack-attribution-tool)\nfinding and detecting Prilex files in attacked environments.\n\n\n-----\n\nThe Prilex family is detected by all Kaspersky products as HEUR:Trojan.Win32.Prilex and HEUR:Trojan.Win64.Prilex. More details about\n[the threat and a full analysis is available to customers of our Threat Intelligence Reports. With any requests about our private reports, please](https://www.kaspersky.com/enterprise-security/threat-intelligence)\ncontact [crimewareintel@kaspersky.com.](mailto:crimewareintel@kaspersky.com)\n\n[ATM attacks](https://securelist.com/tag/atm-attacks/)\n[Financial malware](https://securelist.com/tag/financial-malware/)\n[Malware](https://securelist.com/tag/malware/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[POS malware](https://securelist.com/tag/pos-malware/)\n[Prilex](https://securelist.com/tag/prilex/)\n\nAuthors\n\nGReAT\n\nPrilex: the pricey prickle credit card complex\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-28 - Prilex- the pricey prickle credit card complex.pdf"
    ],
    "report_names": [
        "2022-09-28 - Prilex- the pricey prickle credit card complex.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535696,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1664713538,
    "ts_modification_date": 1664713538,
    "files": {
        "pdf": "https://archive.orkl.eu/cf336db243eff3b88d8e2f2081f6d0916e66c3c2.pdf",
        "text": "https://archive.orkl.eu/cf336db243eff3b88d8e2f2081f6d0916e66c3c2.txt",
        "img": "https://archive.orkl.eu/cf336db243eff3b88d8e2f2081f6d0916e66c3c2.jpg"
    }
}