{
    "id": "ed84e7f8-9158-4324-8818-f71e794eabc3",
    "created_at": "2023-01-12T15:05:25.029322Z",
    "updated_at": "2025-03-27T02:13:31.356082Z",
    "deleted_at": null,
    "sha1_hash": "53fd648a009506d793ccda213ae7e8de002f9d05",
    "title": "2021-07-27 - Iran's Secret Cyber Files",
    "authors": "",
    "file_creation_date": "2022-05-28T02:34:26Z",
    "file_modification_date": "2022-05-28T02:34:26Z",
    "file_size": 4089660,
    "plain_text": "# Iran's secret cyber files on how cargo ships and petrol stations could be attacked | World News\n\n**[news.sky.com/story/irans-secret-cyber-files-on-how-cargo-ships-and-petrol-stations-could-be-attacked-12364871](https://news.sky.com/story/irans-secret-cyber-files-on-how-cargo-ships-and-petrol-stations-could-be-attacked-12364871)**\n\nSky\n\n\n-----\n\n**By Deborah Haynes, foreign affairs editor**\n\nClassified documents, allegedly from Iran, reveal secret research into how a cyber attack\ncould be used to sink a cargo ship or blow up a fuel pump at a petrol station.\n\nThe internal files, obtained by Sky News, also include information on satellite communication\ndevices used by the global shipping industry as well as a computer-based system that\ncontrols things like lights, heating and ventilation in smart buildings across the world.\n\nThe papers appear to reveal a particular interest in researching companies and activities in\nwestern countries, including the UK, France and the United States.\n\nA security source with knowledge of the 57-page bundle of five research reports said it was\ncompiled by a secret, offensive cyber unit called Shahid Kaveh, which is part of Iran's elite\nIslamic Revolutionary Guard Corps' (IRGC) cyber command.\n\nThe source said he believed the work is evidence of efforts by Iran to collect intelligence on\ncivilian infrastructure that could be used to identify targets for future cyber attacks.\n\n\"They are creating a target bank to be used whenever they see fit,\" said the source, who\nrequested anonymity to be able to talk about the documents.\n\nThe Iranian embassy in London did not respond to a request for comment on the allegations.\n\nA growing number of countries, including the UK, possess cyber weapons and are working to\ndevelop new offensive capabilities.\n\nThe work is typically top secret.\n\nSo it is highly unusual to see documented evidence allegedly of cyber research by a state.\n\n\n-----\n\n-----\n\n## INSIDE THE DOCUMENTS\n\nEach of the five reports are marked 'very confidential'.\n\nTowards the top of most of the files is a quote, which appears to be from Iran's Supreme\nLeader, Ali Khamenei. It reads: \"The Islamic Republic of Iran must become among the\nworld's most powerful in the area of cyber.\" The security source describes the quote as like a\n\"commander's statement of intent\".\n\nThe reports are compiled by a cell called Intelligence Team 13. The source with knowledge\nof the files refers to them as Intelligence Group 13 and said it is a sub-group within the IRGC\nShahid Kaveh unit, under an individual he named as Hamid Reza Lashgarian.\n\n\"They are supposed to be rather clandestine. They work on offensive cyber operations\nglobally,\" the source said.\n\nOnly two of the reports have a completion date on their front page.\n\nOne, which looks at what is known as a building management system – the computer\ntechnology that controls things like lights, heating and ventilation in smart buildings – is from\n19 November 2020.\n\nAnother, which looks at a German company called WAGO that manufactures electrical\ncomponents, is dated 19 April 2020.\n\nTwo of the other reports, one into fuel pumps at petrol stations and another into maritime\ncommunications, include screen shots of internet searches dated to last year.\n\n\n-----\n\n-----\n\n## BALLAST WATER\n\nOne of the reports was entitled \"Ballast Water\". Across six pages, it looked at the complex\nsystems on large cargo ships that control things remotely like filtration and ballast water. The\nauthors appeared to rely on open source research rather than any privileged information.\n\nA diagram illustrated a ship steady in the water, while another one showed a ship tilted to\none side. A caption underneath it said: \"Picture three off balance\".\n\nAnother diagram showed how commands could be sent remotely to a ship from a control\ncentre on land via a satellite link.\n\nThe report said: \"These pumps are used to bring water into the tanks through centrifuges\nand in order to operate correctly, the task must be completed with precision. Any problems\ncould result in the sinking of the ship.\"\n\nIn a concluding note, it observed: \"Any kind of disruptive influence can cause disorder within\nthese systems and can cause significant and irreparable damage to the vessel.\"\n\n\n-----\n\n-----\n\n## FUEL PUMPS\n\nAnother piece of research was into a system called an automatic tank gauge that tracked the\nflow of fuel at a petrol station. The report, which was also six pages long, name-checked\nfuelling equipment produced by Franklin Fueling Systems, a US company.\n\n\"They support many customers in Europe, Africa, America and the Middle East and they can\ncontrol and manage these systems,\" it said.\n\nIllustrated with a photograph of a petrol station and an image lifted from the website of\nFranklin Fueling Systems, the file spelt out what it believed would be the impact of a\n\"problem\" with the systems.\n\nThis includes the ability to cut off the fuel supply or change its temperature.\n\nThe report added: \"[An] explosion of these fueling pumps is possible if these systems are\nhacked and controlled remotely.\"\n\n\n-----\n\n-----\n\nA spokesman for Franklin Fueling Systems said the company takes \"seriously the need to\nprovide highly reliable and secure equipment to our customers\".\n\nHe said it could be possible for a third party to cause issues with one or more petrol stations.\nBut he said he did not think it would be possible to trigger an explosion.\n\n\"There are a number of redundant safety systems involved in a typical fueling station, and we\ndo not believe that an explosion could be caused through control of the automatic tank\ngauge or fuel management system, even if that were the user's intent,\" the spokesman said.\n\n\n-----\n\n-----\n\n## MARITIME COMMUNICATIONS\n\nThis report, 14 pages long, looked at two types of satellite communication used at sea.\n\nOne, called Seagull 5000i, provides phone, fax and other data services via a satellite link.\nThe report noted that it is a service offered via companies such as Wideye in Singapore and\nThuraya in the United Arab Emirates.\n\nThe other system of interest is called Sealink CIR.\n\nMost of this file was simply open source research repeating facts about two systems.\n\nBut there was also a chart towards the end of the file that showed the results of what is\nknown as a \"Google dork\" – conducting internet searches with certain key phrases enclosed\nin quotation marks to improve the accuracy of the search.\n\nThe authors of the report used the Chinese search engine Fofa.so as well as Binaryedge, a\nsearch engine for internet-exposed devices, which is owned by a US company to search for\nSeagull 5000i and Thuraya in the United States, the United Kingdom, France, Israel and a\nnumber of other countries.\n\nOne column listed a percentage figure, another listed the number of devices.\n\nSarah Jones from cyber security firm FireEye's Mandiant Threat Intelligence unit, who has\nanalysed the files, said it could refer to the percentage of devices whose log-in screens can\nbe seen from the internet search.\n\n\n-----\n\nThe document included a screen shot of a log-in screen. But there was no evidence that the\nresearchers went beyond conducting the search, such as attempting to access accounts.\n\n\n-----\n\n## SMART BUILDINGS\n\nThe other two reports were the only two that include a formal date on the front for when they\nwere compiled.\n\nThe most recent was one into building management systems – the computer-based systems\nthat control lighting, ventilation, heating, security alarms and other functions in a smart\nbuilding. Nine pages long, it was dated the Iranian calendar's equivalent of 19 November\n2020.\n\nThe documents listed companies that provide these services. They included Honeywell in\nthe United States; the French electrical equipment group Schneider Electric; the German\ngiant Siemens; and KMC Controls, another US manufacturer.\n\nThe longest report – 22 pages – was into electrical equipment made by the German\ncompany WAGO. It was dated the Iranian calendar’s equivalent of 19 April 2020.\n\nThe file examined vulnerabilities in what is called a programmable logic controller or PLC – a\ncomputer control system.\n\nBut the authors appeared to conclude that it would not be possible to exploit them.\n\n\"Continuing the investigation, in order to use these processes, we noticed the vulnerabilities\nwithin these systems are irreparable, if there is an attack, damage will not easy to fix,\" the\nreport said.\n\n\n-----\n\nTherefore, compared to other PLC brands, this brand is impenetrable once connected\nonline. When online, the infrastructure and intelligence on engineering cannot be reached\nand cannot be lost.\n\n\"For our benefit, the best situation is for the PLC not to work as intended, and for that to\nhappen, a project must be written in the language of ladder to have multiple exits, as many\nas possible. But the problem for this project is that we wouldn’t be able to assess the\ndamage caused. The other option is to assess the weak points and dangerous points of the\nPLCs and software in order to attack our target. This option needs separate investigation and\nresearch before we can find the weak points.\"\n\n\n-----\n\n## A THREAT TO 'OUR WAY OF LIFE'\n\nBen Wallace, Britain's defence secretary, said the Iranian documents – if authentic –\ndemonstrate how vulnerable the UK and its allies are to cyber attacks.\n\n\"Unless we do something about it, our critical national infrastructure, our way of life could be\nthreatened quite easily,\" he told Sky News.\n\n\n-----\n\n-----\n\nAsked how much of a threat Iran poses in cyber space, General Sir Patrick Sanders, the top\nmilitary officer overseeing UK cyber operations, said: \"They are among the most advanced\ncyber actors. We take their capabilities seriously. We don’t overstate it. They are a serious\nactor and they have behaved really irresponsibly in the past.\"\n\nThe source who shared the Iranian documents with Sky News said he was \"very confident\"\nthey were authentic.\n\nSky News shared the files with additional sources that would have the ability to tell if they\nseemed authentic.\n\nThese sources indicated that they thought the files looked credible and interesting.\n\nSky News also shared the cache with the US cyber security company FireEye, which\ninvestigates the Iranian cyber threat as well as those from other hostile states.\n\nMandiant Threat Intelligence, a part of FireEye, said: \"The documents seem to emphasise\nsimple, opportunistic attacks.\n\n\"They discuss the possible physical impacts of cyber operations targeting civilian critical\ninfrastructure and the feasibility of conducting such attacks, while examining the percentage\nof internet-accessible devices that could be potential targets.\"\n\nIt said that the five reports, which comprise the bundle, appear to be a response to a request\nfor information or research.\n\n\n-----\n\nEverything that was outlined in the documents really fits in with what we have seen from\nIranian capabilities and the way they plan their attacks, the way they structure and divide up\nthe work and go out and actually start the process of forming an operation,\" said Sarah\nJones, senior principle analyst at Mandiant.\n\nShe said these are the initial steps a state would take if they wanted to develop a specific\ncyber attack capability.\n\n\"You are seeing all of that set up but you are not seeing any of the other phases of that. You\nare seeing them saying – what would happen if we were to do this and how could someone\ngo about causing some sort of damage or destructive capabilities to really a lot of different\ntechnologies?\" she added.\n\n\n-----\n\n## WHY IT MATTERS\n\n\n-----\n\nIran is not the only country seeking to develop new methods of attack in cyber space.\n\nThe UK and its allies, as well as adversaries such as Russia, China and North Korea, are all\ninvesting heavily in building new offensive capabilities.\n\nThe difference, according to British officials, is the targets that hostile states are willing to go\nafter in peacetime - from attempting to manipulate elections to causing physical damage to\ncivilian infrastructure like water supplies and petrol pumps.\n\n\"I think it is perfectly legitimate for states to seek to enhance their capabilities to defend and\nprotect themselves in cyber space,\" General Sir Patrick Sanders, commander of the UK\nmilitary's Strategic Command, which overseas British cyber operations, told Sky News.\n\n\n-----\n\n\"There is nothing wrong with that. But if you are using them in ways that are malign and\nirresponsible you can cause harm or economic damage then that's not acceptable.\"\n\nCyber is an area where countries can covertly harm each other, steal secrets or manipulate\nminds without fear of triggering a more conventional war – though a sufficiently devastating\nattack from cyberspace could have that effect.\n\nThe UK does have the ability to cause harm in the same way as its opponents – but says it is\na power only used to counter a threat or respond to an attack.\n\n\n-----\n\nAny cyber operation must be responsible, targeted and proportionate, according to rules\ngoverning the UK's National Cyber Force, which is a partnership between the military and the\nspy agency GCHQ.\n\nBy contrast, Iranian-linked hackers are suspected of targeting the UK parliament in 2017,\nwith thousands of email accounts, including those of MPs, affected.\n\nWhile Iran is viewed as a cyber threat, the country has also been the victim of multiple cyber\nattacks – many of them targeted against its nuclear programme.\n\nOne of the first-known offensive cyber attacks was the Stuxnet virus, allegedly developed by\nIsraeli and US cyber spies, that was discovered at a uranium enrichment facility at Natanz in\n2010.\n\nMore recently, in May last year computers at Iran's Shahid Rajee port terminal crashed,\nbringing traffic to a halt, following a cyber attack that reportedly originated from Israel.\n\nIt was allegedly in retaliation to an Iranian attempt to hack Israel's water systems – an act\nthat prompted Yigal Unna, Israel's national cyber chief to warn that \"cyber winter is coming\".\n\n\n-----\n\nIt should come as little surprise that Iran appears to be gathering information to hone its\noffensive cyber capabilities.\n\n\n-----\n\nChina and Russia are viewed by the UK as the most potent, hostile cyber threats, followed\nby Iran and North Korea.\n\nBut Britain and some of its allies, in particular the United States and Israel, also have the\nability to launch attacks in cyberspace.\n\nThey just operate under different rules of engagement.\n\nWith so much of the world reliant on the internet, computers and access to information, cyber\nis a growing domain of conflict, where nations, criminals and lone hackers are able to inflict\ndamage or help in their side's defence.\n\nCyber attacks typically happen in a grey zone of harm that lies between war and peace.\n\n[Sky News produced a podcast series on this evolution in the nature of warfare.](https://news.sky.com/story/into-the-grey-zone-exploring-the-murky-evolution-of-warfare-12184358)\n\nIn the grey zone, anything can and is being weaponised, from spreading malware on a\ncomputer or publishing fake news to poisoning an opponent or bribing a politician.\n\nIt means the act of leaking information also plays a part in this contest.\n\nAnd no one is too unimportant to be a target.\n\n## Credits:\n\nReporting: Deborah Haynes, foreign affairs editor\n\nProduction: Leo Lord Jones, foreign affairs producer\n\nDesign: Brian Gillingham and Arianne Cantwell\n\n\n-----\n\n-----\n\n[TopBuilt with Shorthand](https://shorthand.com/?utm_source=__host__&utm_medium=referral&utm_campaign=footer&utm_term=built+with+shorthand&utm_content=UzOZp9K1u8)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-27 - Iran's Secret Cyber Files.pdf"
    ],
    "report_names": [
        "2021-07-27 - Iran's Secret Cyber Files.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535925,
    "ts_updated_at": 1743041611,
    "ts_creation_date": 1653705266,
    "ts_modification_date": 1653705266,
    "files": {
        "pdf": "https://archive.orkl.eu/53fd648a009506d793ccda213ae7e8de002f9d05.pdf",
        "text": "https://archive.orkl.eu/53fd648a009506d793ccda213ae7e8de002f9d05.txt",
        "img": "https://archive.orkl.eu/53fd648a009506d793ccda213ae7e8de002f9d05.jpg"
    }
}