{
    "id": "ed9bcf74-b7d0-43b8-aa42-65fe61190395",
    "created_at": "2023-01-12T14:59:00.516541Z",
    "updated_at": "2025-03-27T02:05:41.497768Z",
    "deleted_at": null,
    "sha1_hash": "99f9c91d424cb0759c8a5b5f867e27ee59de9a61",
    "title": "2021-01-26 - Ransomware- Analyzing the data from 2020",
    "authors": "",
    "file_creation_date": "2022-05-28T02:29:34Z",
    "file_modification_date": "2022-05-28T02:29:34Z",
    "file_size": 221524,
    "plain_text": "# Ransomware: Analyzing the data from 2020\n\n**[digitalshadows.com/blog-and-research/ransomware-analyzing-the-data-from-2020/](https://www.digitalshadows.com/blog-and-research/ransomware-analyzing-the-data-from-2020/)**\n\nJanuary 26, 2021\n\n_Note: This blog is a roundup of our quarterly ransomware series. You can also see our Q2_\n_Ransomware Trends,_ _[Q3 Ransomware Trends blogs or get our](https://www.digitalshadows.com/blog-and-research/ransomware-trends-in-q3/)_ _free weekly threat_\n_intelligence writeup delivered to your inbox here._\n\nDuring the final months of 2020, ransomware groups continued to wreak havoc. New\nvariants continued to create data leak sites with the addition of Pay2Key, RansomEXX, and\nEverest ransomware data leak sites. Ransomware groups continue to target and\nsuccessfully breach high profile organizations: — Barnes & Noble Booksellers, Inc., Ubisoft,\n[and Epicor Software targeted by Egregor group; Capcom Network targeted by Ragnar](https://www.digitalshadows.com/blog-and-research/egregor-the-new-ransomware-variant-to-watch/)\nLocker group. And, unfortunately, the list of victims continues. If you’re looking for the latest\ndetails on ransomware in 2020 and the ransomware threat landscape for 2021, read on.\n\n## What happened in ransomware for Q4 2020?\n\nThroughout 2020, we saw the “pay or get breached” trend take off like a rocket and it didn’t\nseem to slow down. To add to the already stressful situation of having their files exfiltrated\nand encrypted, victim organizations were pressured into paying ransom payments quickly by\nthe threat of public exposure on a data leak site.\n\nIn Q4 2020, we identified three additional data leak sites, which is less than Q3 2020 but\nindicates that this tactic is still viewed as effective and groups continued to use the method.\nHere’s what we identified in Q4 2020:\n\nIn Q3 2020, Maze, Conti, Sodinokibi, and NetWalker made up 76% of our alerts related\nto ransomware dump sites.\nRansomware operator activity shifted in Q4 2020, Sodinokibi activity decreased and\nMaze announced they were ceasing operations. Egregor, Conti, NetWalker, and\nDoppelPaymer accounted for 71% of our alerts in Q4 2020.\nPay2Key, RansomEXX, and Everest ransomware groups joined the plethora of data\nleak sites with their own versions.\nAs Maze group announced they were ceasing operations, Egregor entered the scene\nhitting the ground running with the highest number of alerts for the quarter.\nRansomware groups attempted new tactics, which included cold calling victims to\npressure them into paying the ransom demand; some attempts went as far as\nthreatening employee’s safety.\n\n## Who was the most active ransomware group of 2020?\n\n\n-----\n\nThere has been a lot of talk regarding ransomware activity and groups throughout 2020—\nwho was most active, big targets that were hit, and on and on. Of the ransomware data leak\n[sites we monitor, six groups made up 84% of our alerts—Maze, Egregor, Conti, Sodinokibi,](https://www.digitalshadows.com/blog-and-research/a-eulogy-for-maze-the-end-of-a-ransomware-era/)\nDoppelPaymer, and NetWalker.\n\n_Most popular ransomware blog locations in 2020, as reported in Digital Shadows Intelligence_\nWhile NetWalker and DoppelPaymer have remained consistent throughout the year in\nnumber of posts, Egregor entered the scene late in 2020 and hit the ground running, while\nMaze was about to exit the scene.\n\nThe “Other” ransomware data leak sites accounted for 16% of Digital Shadows’ alerts and\nconsisted of Ako/Ranzy Locker, Avaddon, Clop, DarkSide, Everest, LockBit, Mount Locker,\nNefilim, Pay2Key, PYSA, Ragnar Locker, RansomEXX, Sekhmet, and SunCrypt.\n\n\n-----\n\n_Distribution of ransomware blog sites across Q2, Q3, and Q4 2020, as reported in_\n\n_Digital Shadows Intelligence_\n\n## What was the most targeted industry by ransomware operators in 2020?\n\nRansomware operators targeted organizations in various sectors, and it didn’t appear any\nsector was off limits to these groups. Industrial Goods & Services was the most targeted\nindustry, accounting for 29% of our alerts, while the remaining were split among several\nsectors.\n\n**Industrial Goods & Services was the most targeted industry by ransomware operators**\n**in 2020. (Digital Shadows research)**\n\n\n-----\n\n_Breakdown of targeted sectors on ransomware data leak sites throughout 2020, as reported_\n_in Digital Shadows Intelligence_\n“Other” sectors accounted for 16% of Digital Shadows’ alerts and consisted of aerospace,\nbanks, basic resources, chemicals, conglomerates, consulting services, cyber security,\ndefence, education, energy, equity/non-equity investment instruments, hospitality, insurance,\nlaw enforcement, media, NGO, oil & gas, pharmaceuticals, religious, telecommunications,\nutilities, veterinary services, and waste management.\n\n**North America was the most targeted geographic region with 66% of our ransomware**\nalerts coming from organizations in NA. (Digital Shadows research)\n\nWhile ransomware groups did not appear to be biased when targeted sectors in 2020, the\ngroups did appear to have a geographic preference.\n\n\n-----\n\n_Breakdown of target locations throughout 2020, as reported in Digital Shadows Intelligence_\nThe other category made up 1% of our alerts reported in 2020 and consisted of countries\nlocated in Africa and The Carribean, which contained less than 10 incidents each.\n\n## Which ransomware operators started and stopped in 2020?\n\n**The “end” of Maze**\n\nOn 01 Nov 2020, Maze Group operators posted a press release on their data leak site\nannouncing an end to operations. Maze led our profile of high threat hacker groups in Q2\n2020 and is known as the innovator of data leak sites.\n\nIn mid-March 2020, the Maze operators stated they would halt activity against all medical\norganizations until the end of the COVID-19 pandemic. However, in April, the group released\ndata stolen from the drug testing firm Hammersmith Medicines Research Ltd (HMR).\nAlthough it appeared the group may have been faulting on their word, the group stated the\ndata was encrypted and stolen prior to their announcement.\n\nThe announcement claimed that the group’s intent had been to bring light to security\nweaknesses and warned that cybercriminal could exploit these weaknesses to cause\nsignificant damage, even risking human life. Additionally, the group pledged to return to show\n\n\n-----\n\nthe world it s errors and mistakes . While we don t know why the group officially ceased their\noperations, it is possible the oversaturation of the ransomware market motivated their exit.\n\n**The rise of Egregor**\n\nEgregor ransomware was identified in September 2020, and is believed to be closely related\nto the Sekhmet ransomware variant. Egregor’s name is derived from Western occult\ntraditions. Egregor is a term applied to the collective energy or force of a group of individuals\nunited toward a common purpose.\n\nEgregor ransomware’s operators achieved recognition in October 2020 when they targeted\nUS bookstore chain Barnes & Noble and video game producers Ubisoft and Crytek. Egregor\nentered the scene and made a name for itself— Egregor victims increased 240% from 25\nSeptember to October and another 43% from October to 17 November.\n\nReporting has suggested that operators of the Maze ransomware have shifted to using the\nEgregor ransomware variant; however, this has not been confirmed by either group. This\ntheory is supported by the level of sophistication demonstrated by Egregor in a short time\nframe and Egregor’s victimology is consistent with targeting conducted by the operators of\nthe Maze ransomware variant.\n\n## What is to come in the ransomware threat landscape for 2021?\n\n[As discussed in our 2021 forecasts blog, the threat of ransomware attacks is likely to](https://www.digitalshadows.com/blog-and-research/2021-forecasts/)\ncontinue through 2021. The pay or get breached trend has proven successful since\nDecember 2019 and is likely to continue to attract ransomware groups. This tactic is likely to\nallow new or less known variants an opportunity to compete with some of the more\nsuccessful variants, such as Egregor, DoppelPaymer, NetWalker, and Sodinokibi. Maze may\nhave exited the ransomware scene, but there are plenty of ransomware groups waiting to\ntake the number one spot (Egregor, we see you).\n\nIn 2020, we witnessed costly attacks reported every day that crippled companies in every\nindustry; in 2021 we encourage and hope to see private and public organizations better\nmitigating this threat.The best security teams will stay up to date with threat intelligence on\nthe ransomware threat landscape to be able to identify data exposure on data dump sites\nearly, research associated vulnerabilities, and identify early discussions and advertisements\nfor sensitive information and employee credentials on cybercriminal marketplaces and\nforums.\n\nDigital Shadows updates a threat intelligence library of over 400 threat actors, events, and\ncampaigns here. Tracking, identifying, and keeping teams updated on ransomware groups,\ntactics, and trends in their industry vertical and geographic region, including actionable\ninsights from ransomware trends, and assesses the risk certain actors post to your industry,\n[company, and assets. Look here for a trial of our product SearchLight.](https://www.digitalshadows.com/threat-intelligence/)\n\n\n-----\n\nIf you’re a Digital Shadows client, you’ll be able to use this search term to set up alerts on\n[new instances of data dumps on ransomware sites: ransomware dumps.](https://portal-digitalshadows.com/search?types=INTEL_INCIDENT&dateRange=2020-10-01%2F2020-12-31&sp=sortDate&sd=ASCENDING&q=(%22Happy%20Blog%22%20OR%20%22Dopple%20Leaks%22%20OR%20%22NetWalker%20Blog%22%20OR%20%22Corporate%20Leaks%22%20OR%20%22%3E_CLOP%5E_-LEAKS%22%20OR%20%22Ragnar_Locker%20Leaks%22%20OR%20%22Ranzy%20Leaks%22%20OR%20%22PYSA%22%20OR%20%22Avaddon%20Blog%22%20OR%20%22DarkSide%22%20OR%20%22Conti.News%22%20OR%20%22SunCrypt%22%20OR%20%22LockBit%20Blog%22%20OR%20%22Mount%20Locker%22%20OR%20%22Egregor%20News%22%20OR%20%22RansomEXX%22%20OR%20%22Pay2Key%22%20OR%20%22Everest%22%20OR%20%22Babuk%20Locker%20Leaks%22)%20AND%20type%3D%5BIntelligence%20incidents%5D&view=List)\n\nTags: [Ransomware](https://www.digitalshadows.com/blog-and-research/tag/ransomware/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-26 - Ransomware- Analyzing the data from 2020.pdf"
    ],
    "report_names": [
        "2021-01-26 - Ransomware- Analyzing the data from 2020.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535540,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653704974,
    "ts_modification_date": 1653704974,
    "files": {
        "pdf": "https://archive.orkl.eu/99f9c91d424cb0759c8a5b5f867e27ee59de9a61.pdf",
        "text": "https://archive.orkl.eu/99f9c91d424cb0759c8a5b5f867e27ee59de9a61.txt",
        "img": "https://archive.orkl.eu/99f9c91d424cb0759c8a5b5f867e27ee59de9a61.jpg"
    }
}