{
    "id": "ee149dad-bbd5-4d7b-89f4-73596b06c450",
    "created_at": "2024-08-28T02:04:17.687958Z",
    "updated_at": "2025-03-27T02:05:36.24045Z",
    "deleted_at": null,
    "sha1_hash": "bb7f469a02e408abc6ce40ec182f9f6568611cf3",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-07-19T15:22:10Z",
    "file_modification_date": "2024-07-22T15:57:33Z",
    "file_size": 1287190,
    "plain_text": "I N T E L L I G E N C E B R I E F\n\n\nMARK (MAGPIE) GRAHAM | INTEL CAPABILITY TECHNICAL DIRECTOR\n\nCAROLYN AHLERS | PRINCIPAL MALWARE ANALYST\n\nKYLE O’MEARA | PRINCIPAL ADVERSARY HUNTER\n\nDRAGOS, INC\n\nJULY 2024\n\n\n## Impact of FrostyGoop ICS Malware on Connected OT Systems\n\n\n-----\n\n###### Summary\n\n Key Findings\n\n Analyzing the FrostyGoop ICS Malware\n\n What Is the Modbus Protocol? FrostyGoop ICS Malware Capabilities Optional Command Line Execution Arguments Configuration File Modbus Network Traffic Logging Capabilities\n\n 2024 OT Cyber Attack Impacting Communities in Lviv, Ukraine\n\n Assessing the Broader Impact on OT Cybersecurity\n\n Guidance for Dragos Customers\n\n Recommendations – Implement 5 Critical Controls\n\n Conclusion\n\n\n#### 01\n\n 01\n\n 02\n\n 06\n\n 07\n\n 07\n\n 09\n\n 10\n\n\n#### 02\n\n\n#### 06\n\n\n#### 09\n\n\n#### 10\n\n\n-----\n\n#### Summary\n\n**FrostyGoop is the ninth industrial control systems (ICS) specific malware. It is the first ICS-specific malware**\n**that uses Modbus TCP communications to achieve an impact on Operational Technology (OT). PIPEDREAM,**\n**an ICS malware discovered in 2022, uses Modbus communications in one of its components for**\n**enumeration.**\n\nDragos discovered FrostyGoop in April 2024. It can interact directly with ICS using Modbus, a standard ICS protocol\nacross all industrial sectors and organizations worldwide. Additionally, the Cyber Security Situation Center (CSSC), a\npart of the Security Service of Ukraine (Служба безпеки України), shared details with Dragos about a disruptive cyber\nattack on a district energy company in Lviv, Ukraine, which resulted in a two-day loss of heating to customers.\nDragos assesses that FrostyGoop was used in this attack. An associated FrostyGoop configuration file contained the\nIP address of an ENCO control device, leading Dragos to assess with moderate confidence that FrostyGoop was used\nto target ENCO controllers with TCP port 502 open to the internet.\n\nGiven the widespread use of Modbus devices globally, the broad applicability of this threat underscores the urgent\nneed for ICS network visibility and monitoring of Modbus traffic. Detecting and flagging deviations from normal\nbehavior and identifying attack patterns and behaviors that exploit the Modbus protocol is crucial. This necessitates\nthe development of detections from the latest threat intelligence on vulnerabilities, attack vectors, and malware\ntargeting Modbus systems.\n\n#### Key Findings\n\n - FrostyGoop is the ninth industrial control system (ICS) specific malware. It is the first ICS-specific malware that\nuses Modbus communications to achieve an impact on operational technology (OT).\n\n - In April 2024, Dragos discovered multiple FrostyGoop binaries. FrostyGoop is ICS-specific malware written in\nGolang that directly interacts with industrial control systems (ICS) using Modbus TCP over port 502. It is\ncompiled for Windows systems, and at the time of the discovery, antivirus vendors did not detect it as\nmalicious.\n\n - FrostyGoop can read and write to an ICS device holding registers containing inputs, outputs, and configuration\ndata. It accepts optional command line execution arguments, uses separate configuration files to specify target\nIP addresses and Modbus commands, and logs output to a console and/or a JSON file.\n\n - The Cyber Security Situation Center (CSSC), a part of the Security Service of Ukraine (Служба безпеки України),\nshared details with Dragos relating to a cyber attack that targeted a municipal district energy company in Lviv,\nUkraine. During sub-zero temperatures, the attack disrupted the power supply to heating services to over 600\napartment buildings. The adversaries sent Modbus commands to ENCO controllers, causing inaccurate\nmeasurements and system malfunctions. Remediation took almost two days.\n\n - The investigation revealed that the adversaries possibly gained access to the victim network through an\nundetermined vulnerability in an externally facing Mikrotik router. The network assets, including the Mikrotik\nrouter, four management servers, and district heating system controllers, were not adequately segmented,\nfacilitating the attack.\n\n\n-----\n\n - FrostyGoop’s ability to communicate with ICS devices via Modbus TCP threatens critical infrastructure across\nmultiple sectors. Given the ubiquity of the Modbus protocol in industrial environments, this malware can\npotentially cause disruptions across all industrial sectors by interacting with legacy and modern systems.\n\n - The Lviv, Ukraine, incident highlights the need for adequate security controls, including OT-native monitoring.\nAntivirus vendors’ lack of detection underscores the urgency of implementing continuous OT network security\nmonitoring with ICS protocol-aware analytics to inform operations of potential risks.\n\n - Dragos recommends that organizations implement the SANS 5 Critical Controls for World-Class OT\nCybersecurity. These include ICS incident response, defensible architecture, ICS network visibility and\nmonitoring, secure remote access, and risk-based vulnerability management.\n\n#### Analyzing the FrostyGoop ICS Malware\n\nIn April 2024, Dragos discovered multiple FrostyGoop binaries during routine triage of suspicious files. FrostyGoop is\nan ICS-specific malware written in Golang that can interact directly with industrial control systems (ICS) using\nModbus TCP over port 502. According to VirusTotal, antivirus vendors do not detect the FrostyGoop files as\nmalicious. FrostyGoop binaries are compiled for Windows systems. The malware can read and write to the device\nholding registers. Holding registers are read/write registers containing inputs, outputs, and configuration data.[1]\n\nAt the time of discovery, Dragos assessed with low confidence that the FrostyGoop ICS malware discovered was\nused for testing purposes. However, this assessment changed when an attack was confirmed, as detailed later in this\nreport. Dragos discovered an associated configuration file containing multiple Modbus commands to read data from\na target ICS device and an IP address belonging to an ENCO control device. Dragos assessed with moderate\nconfidence that FrostyGoop can impact other devices communicating over Modbus TCP; the malware’s functionality\nis not specific to ENCO control devices. Analysis of FrostyGoop files is ongoing for Dragos WorldView Threat\nIntelligence subscribers.\n\n##### What Is the Modbus Protocol?\n\nModbus is a client/server communication protocol initially designed for Modicon programmable logic controllers in\n1979, but it is now widely used by other devices. It is an open protocol and is hardware agnostic, making it popular\nfor communications between PLCs, DCS, controllers, sensors, actuators, field devices, and interfaces.\n\nThe Modbus protocol defines a message structure that controllers recognize and use, regardless of the type of\nnetworks over which they communicate. It describes the process a controller uses to request access to another\ndevice, how it responds to requests from other devices, and how errors are detected and reported. This protocol\nestablishes a standard format for the layout and contents of message fields.\n\n1 [Modbus Protocol Reference – Control Solutions Minnesota](https://csimn.com/MHelp-VP3-TM/vp3-tm-appendix-C.html#:~:text=Holding%20registers%20are%20the%20most,requirement%20for%20%22holding%22%20data.&text=Modbus%20protocol%20defines%20several%20function%20codes%20for%20accessing%20Modbus%20registers.)\n\n\n-----\n\nThe protocol outlines how each controller will identify its device address, recognize a message meant for it, decide on\nthe necessary action, and extract any data or additional information from the message. The controller will create and\ntransmit the reply message if a response is needed using the Modbus protocol.[2]\n\n##### FrostyGoop ICS Malware Capabilities\n\n - Accepts optional command line execution arguments.\n\n - Uses separate configuration files to specify target IP addresses and Modbus commands.\n\n - Communicates with ICS devices via Modbus TCP protocol.\n\n - Sends Modbus commands to read or modify data on ICS devices.\n\n - Logs output to a console or JSON file.\n\n##### Optional Command Line Execution Arguments\n\nFrostyGoop checks if the executable is running with any required command line arguments. The binaries exit\nexecution if no command line arguments are provided. The specific arguments vary by sample, but functionality\nremains the same. Information required to initiate a TCP connection and send Modbus commands to a victim ICS\ndevice can be specified as command-line arguments or contained within a separate JSON configuration file.\nArguments accepted by FrostyGoop would include data such as:\n\n - IP addresses specifying the target device to communicate with\n\n - A “mode” option that correlates to a Modbus command to execute on the ICS device (Read Holding Registers,\nWrite to Single Holding Register, Write to Multiple Holding Registers)\n\n - A Modbus register address on the target ICS device to send Modbus commands to\n\n - A JSON configuration file name; there are two different configuration files accepted by FrostyGoop\n\n`o` A configuration file containing victim device information such as IP address, Modbus commands, and\nModbus register addresses\n\n`o` A configuration file containing a specific time to begin Modbus TCP communications with the victim device\nand various lengths to delay the execution of Modbus commands.\n\n - Specify a file name to save logging output\n\n##### Configuration File\n\nFrostyGoop accepts a JSON-formatted configuration file containing information used to execute Modbus commands\non a target device. The malware reads the file, parses the JSON data, connects to the IP address from the file, and\nsends Modbus TCP commands to holding register addresses specified in the configuration file.\n\nDragos discovered a sample of the configuration file named ‘task_test.json.’ The IP address in the sample\nconfiguration file belongs to an ENCO control device. ENCO control devices are typically used “for process control in\n\n2 [Modicon Mobus Protocol Reference Guide - Modbus](https://www.modbus.org/docs/PI_MBUS_300.pdf)\n\n\n-----\n\ndistrict heating, hot water, and ventilation systems” to monitor sensor parameters such as temperature, pressure,\nand insulation.[3 ]\n\nThe other fields in the configuration file are described below.\n\n**Field** **Description**\n\nModbus Command Code (i.e. ‘3’ for Read Holding Registers, ‘6’ for Write Single Holding Register,\n**Code**\nand ‘16’ for Write Multiple Holding Registers)\n\n**Address** Modbus register address\n\n**Count** Quantity of registers to read or write\n\n**Value** Integer used to modify the Holding Register (used for Modbus ‘write holding register’ commands)\n\nCONFIGURATION FIELDS\n\n##### Modbus Network Traffic \n\nFrostyGoop initiates communication with the target IP address over Modbus TCP port 502. The IP address can be\nspecified either by using an argument during malware execution or by including it in the configuration JSON file. Once\na connection is established, FrostyGoop sends Modbus commands to the device. After FrostyGoop sends commands\nand receives the target device's responses, the binaries close the connection and exit execution.\n\nFrostyGoop binaries use a Go Modbus library retrieved from a publicly available Github repository.[4]\n\n**FrostyGoop implements three Modbus commands:**\n\n - **Command Code 3 ‘Read Holding Registers’ which is used to read the value currently in a Modbus holding**\nregister (or contiguous block of holding registers)[ 5]\n\n - **Command Code 6 ‘Write Single Register’ which is used to write a value to a holding register[6]**\n\n - **Command Code 16 ‘Write Multiple Holding Registers’ which is used to write a value to a block of**\ncontiguous registers[7]\n\nThe figure below displays an example of Modbus TCP network traffic between FrostyGoop and a target device. In\nthe example, FrostyGoop sends four commands to the device: Modbus function code 3 ‘Read Holding Registers’\ntwice, function code 6 ‘Write Single Register’, and function code 16 ‘Write Multiple Registers.’\n\n3 ENCO Control Configuration Instruction – Axis Industries\n\n4 [Modbus Go Library – Github.com](https://github.com/rolfl/modbus)\n\n5 [Modbus Application Protocol Specification – modbus.com](https://modbus.org/docs/Modbus_Application_Protocol_V1_1b.pdf)\n\n6 [Modbus Application Protocol Specification – modbus.com](https://modbus.org/docs/Modbus_Application_Protocol_V1_1b.pdf)\n\n7 [Modbus Application Protocol Specification – modbus.com](https://modbus.org/docs/Modbus_Application_Protocol_V1_1b.pdf)\n\n|Field|Description|\n|---|---|\n|Code|Modbus Command Code (i.e. ‘3’ for Read Holding Registers, ‘6’ for Write Single Holding Register, and ‘16’ for Write Multiple Holding Registers)|\n|Address|Modbus register address|\n|Count|Quantity of registers to read or write|\n|Value|Integer used to modify the Holding Register (used for Modbus ‘write holding register’ commands)|\n\n\n-----\n\nEXAMPLE OF FROSTYGOOP NETWORK TRAFFIC\n\n##### Logging Capabilities\n\nThe FrostyGoop binaries log output from the Modbus TCP communications with the target IP address to a Windows\nconsole and a JSON file. FrostyGoop opens a console window upon execution. If the argument for logging is specified\nwhen executing the binary, then the output is logged to a JSON file. Below is an example of output to the console\nwindow during Modbus TCP communications with a device. Once the binaries are ready to begin communications\nwith the target device, they log the local time and date, the target IP address when starting communications, and the\nstring ‘start’ to the console window. Then, when FrostyGoop sends commands, it logs the holding register, the\nnumber of registers, a plus or minus depending on the response from the device for each command, and the time it\ntook for a response. FrostyGoop logs a minus sign if the response from the device contains an exception. An example\nof when a device would send an exception to the malware would be if the holding register does not exist.\n\nSAMPLE FROSTYGOOP CONSOLE LOG\n\n\n-----\n\n#### 2024 OT Cyber Attack Impacting Communities in Lviv, Ukraine\n\nThe Cyber Security Situation Center (CSSC), a part of the Security Service of Ukraine (Служба безпеки України),\nshared details with Dragos of a cyber attack that took place in January 2024. During the late evening on 22 January\n2024, through 23 January, adversaries conducted a disruption attack against a municipal district energy company in\nLviv, Ukraine. At the time of the attack, this facility fed over 600 apartment buildings in the Lviv metropolitan area,\nsupplying customers with central heating. Remediation of the incident took almost two days, during which time the\ncivilian population had to endure sub-zero temperatures.\n\nDuring the attack investigation, a discovery was made that adversaries possibly gained access to the victim network\non 17 April 2023 by exploiting an undetermined vulnerability in an externally facing Mikrotik router. On 20 April 2023\nand 26 April 2023, the adversaries deployed a webshell with tunnel capabilities similar to ReGeorg[8], which was\naccessed predominantly via Tor IP addresses. The investigation revealed that on 30 November 2023 and 14\nDecember 2023, the adversaries retrieved the contents of the Security Account Manager (SAM) registry hive,\nobtaining user credentials from the system. On 22 January 2024, adversaries initiated L2TP (Layer Two Tunnelling\nProtocol) connections to Moscow-based IP addresses.\n\nThe victim network assets, which consisted of a Mikrotik router, four management servers, and the district heating\nsystem controllers, were not adequately segmented within the network. A forensic examination during the\ninvestigation showed that the adversaries sent Modbus commands directly to the district heating system controllers\nfrom adversary hosts, facilitated by hardcoded network routes.\n\nThe affected heating system controllers were ENCO Controllers. The adversaries downgraded the firmware on the\ncontrollers from versions 51 and 52 to 50, which is a version that lacks monitoring capabilities employed at the victim\nfacility, resulting in the Loss of View. The adversaries did not attempt to destroy the controllers. Instead, the\nadversaries caused the controllers to report inaccurate measurements, resulting in the incorrect operation of the\nsystem and the loss of heating to customers.\n\nDragos assesses that FrostyGoop, an ICS-related malware recently reported by Dragos, was used to facilitate this\nattack. FrostyGoop functionality uses the MODBUS protocol generically, meaning it could affect many devices. The\nassociated FrostyGoop configuration file (“task_test.json”) contained an IP address belonging to an ENCO control\ndevice exposed on the Internet, which leads Dragos to assess with medium confidence that before this attack,\nFrostyGoop was used to target one or more ENCO controllers where TCP port 502 was Internet accessible.\n\n**We want to express our gratitude to the Cyber Security Situation Center (CSSC), a part of the Security**\n**Service of Ukraine** **(Служба** **безпеки** **України), for its continued commitment to collaborative intelligence**\n**sharing and for allowing us to report on the disruptive OT incident impacting communities in Lviv, Ukraine.**\n\n8 [sensepost/reGeorg - Github](https://github.com/sensepost/reGeorg)\n\n\n-----\n\n#### Assessing the Broader Impact on OT Cybersecurity\n\nThe discovery of the FrostyGoop ICS malware and its capabilities has raised significant concerns about the broader\nimpact on OT cybersecurity. The specific targeting of ICS using Modbus TCP over port 502 and the potential to\ninteract directly with various ICS devices pose a serious threat to critical infrastructure across multiple sectors.\n\nThe key findings suggest that FrostyGoop capabilities can be applied broadly. Modbus is embedded in legacy and\nmodern systems and nearly all industrial sectors, indicating a wide-ranging potential for disrupting and\ncompromising essential services and systems.\n\nOne of the major concerns is FrostyGoop's ability to communicate with ICS devices via the Modbus TCP protocol,\nenabling it to send commands to read or modify data on these devices. This represents a significant risk to the\nintegrity and functionality of ICS devices, with potentially far-reaching consequences for industrial operations and\npublic safety. The attack’s involvement of internet-exposed controllers and insufficient network segmentation\nhighlights the risks of not implementing basic cybersecurity controls and the importance of doing so. Currently, over\n46,000 internet-exposed ICS devices communicate over Modbus around the world.\n\nConsidering these developments, organizations, and defenders within critical infrastructure sectors must prioritize\nassessing and protecting their ICS networks. This includes restricting access to Modbus devices and conducting\nthorough network assessments to ensure they are not exposed to the Internet.\n\nDragos’s ongoing analysis of FrostyGoop files and commitment to actively monitor the situation highlights the need\nfor a coordinated response to a dynamic threat landscape. Vigilant network security monitoring, proactive defense\nmeasures, and collaborative information sharing will be crucial in mitigating the broad impact of ICS-specific\nmalware, among other threats.\n\n#### Guidance for Dragos Customers\n\nFrostyGoop was first reported to Dragos WorldView subscribers in late May 2024. Dragos Platform detections were\nassessed against the threat, and indicators of compromise (IOCs) were deployed. Using the Dragos Platform, OT\nWatch has been hunting for FrostyGoop IOCs as part of regular sweeps across the fleet of subscribers since initial\nWorldView reporting to ensure coverage. OT Watch has also deployed a dashboard specific to FrostyGoop-related\ndetections and IOCs for OT Watch customers, and an upcoming Knowledge Pack will deploy a FrostyGoop Playbook.\nDragos continues to analyze FrostyGoop for future Dragos Platform Knowledge Pack releases to ensure appropriate\ndetections are created and deployed.\n\nThe Dragos Platform detects FrostyGoop with threat detections already in place. Still, it is recommended that\ncustomers always deploy the latest Knowledge Pack (KP), including IOCs specific to this threat. For Dragos OT\nWatch customers, our team has conducted searches for signs of this activity on your behalf – consider a lack of\ncommunications on this subject as confirmation that there was no evidence of this activity found within your\nnetwork. Dragos analysts also continue to proactively hunt on behalf of those in the Neighborhood Keeper\nprogram, our collective defense platform. Any findings relating to this activity will be reported to you.\n\n\n-----\n\n|SID/Rule|Analytic Name|Description|Knowledge Pack|\n|---|---|---|---|\n|a0ddb920-0adc- 4d01-9b3d- 21414ef28607|Modbus Command Force Listen Only Mode|Modbus command to put device into Force Listen Only Mode, making the device unresponsive to commands. It will only respond after power up. This can be used maliciously to effectively disable devices.|KP_Plus-7.0.X|\n|f7a0af6b-fa88- 4382-9232- f56525befcde|Modbus Command Restart Communications Option|Modbus command to force a device to restart, making it unresponsive until it reboots. There is some chance this could be used maliciously to disable devices.|KP_Plus-7.0.X|\n|f41c99e6-cabf- 46b7-9576- d2ac4676baa9|Modbus Exception|Modbus servers send exception codes to Modbus clients when a requested operation cannot be carried out. This characterization summarizes exception codes sent from a Modbus server.|KP_Plus-6.0.X|\n|e8cbde89-aa3a- 4093-8064- 3a8ca08fbf4c|Modbus External Comms|External device communicating with an internal asset using the Modbus protocol. This is a major security concern, as ICS devices should not be controlled outside of the OT network.|KP-2020-11|\n|15c07ad4-5d03- 4c3b-8d2d- 613d5ec45217|Modbus External Write|External device writing to an internal asset using the Modbus protocol. This is a major security concern, as ICS devices should not be controlled outside of the OT network.|KP-2020-11|\n|3cc434cd-5086- 454c-bbd4- 6142b01a4623|Modbus Write Observed for First Time|Modbus traffic with a write function code seen for the first time to a specific host.|KP-2022-009|\n|d323014b-abee- 461b-a12f- 641b8796070f|New ModbusTCP Detection|Monitors for new devices using the ModbusTCP protocol and generates events when activity is seen|KP-2020-11|\n\n\n**Summary Guidance**\n\n**1.** **Identify impacted assets: Access your Asset Inventory and search for ENCO control servers and devices**\n\ncommunicating over Modbus.\n\n**2.** **Look for potential malicious behavior: Review the FrostyGoop-specific dashboard to determine if related**\ndetections and IOCs have been triggered.\n\n**3.** **Perform a retrospective search for potential malicious behavior across your SiteStore forensics for signs**\nof past activity involving this malware.\n\n\n-----\n\nThe Dragos Platform has advanced OT-native threat detection mechanisms to identify abnormal connections and\ncommunications over Modbus. It also incorporates threat-based behavioral analytics that are fine-tuned to recognize\nattack patterns and behaviors that exploit the Modbus protocol. By continuously analyzing network traffic and\nsystem interactions, the Dragos Platform can identify and enable a response to suspicious activities indicative of a\nModbus-related attack, ensuring robust protection against both known and emerging threats.\n\nDragos WorldView threat intelligence further enhances situational awareness by providing in-the-moment insights\ninto the threat landscape. This intelligence includes data on the latest vulnerabilities, attack vectors, and malware\ntargeting Modbus systems, empowering security teams to proactively hunt for malicious activities and potential\nmalware within the environment. This situational awareness allows organizations to stay ahead of threats, rapidly\nidentify indicators of compromise, and respond effectively to detected incidents. Dragos Platform customers can use\nthe information in Dragos Worldview reports to start manual hunts for potential malicious activity in their\nenvironments.\n\n#### Recommendations – Implement 5 Critical Controls\n\nThe cyber threat characterized by deploying the FrostyGoop underscores a significant vulnerability in operational\ntechnology infrastructure. The adversary exploited unsecured network points and inadequately protected systems,\ndisrupting municipal services that resulted in considerable discomfort and potential danger to the affected\npopulation. Applying the 5 Critical Controls for World-Class Cybersecurity, as recommended by SANS, can mitigate\nsuch threats. Each control addresses specific aspects of cybersecurity readiness and resilience, each tailored to\ndefend against the threats identified in this report. Here, we detail the necessity and application of these controls in\nthe context of this threat.\n\n**1.** **ICS INCIDENT RESPONSE**\nGiven the complexity and targeted nature of the FrostyGoop attack, a robust incident response plan is crucial.\nThis plan should incorporate specialized responses for OT environments, as these systems often have\noperational continuity requirements that supersede traditional IT systems. For FrostyGoop, which directly\ninteracts with ICS via Modbus commands, the response plan should include procedures for quickly isolating\naffected devices, analyzing network traffic for unauthorized Modbus commands, and restoring accurate system\noperations. Training and regular drills specific to Modbus and ICS-targeted attacks will also ensure\npreparedness and effective incident management.\n\n**2.** **DEFENSIBLE ARCHITECTURE**\nThis attack highlights the lack of adequate network segmentation and the presence of internet-exposed\ncontrollers. To combat threats like FrostyGoop, a defensible architecture must be implemented, prioritizing the\nsegmentation of network assets. This includes establishing industrial demilitarized zones (DMZs), enforcing\nstrict access controls between the corporate IT network and OT environments, and using physical or virtual\nbarriers to prevent direct access from the internet to critical systems. Such measures would limit the spread of\nmalware and restrict the blast radius of potential cyber attacks.\n\n**3.** **ICS NETWORK VISIBILITY & MONITORING**\nContinuous monitoring of the OT network traffic, like Modbus communications, is essential to detect and\nrespond to anomalies and threat behaviors. In the case of FrostyGoop, having a protocol-aware monitoring\n\n\n-----\n\ntoolset could have identified unauthorized access or unusual Modbus traffic patterns over port 502, enabling\nquicker detection and mitigation. Implementing a comprehensive monitoring solution, such as the Dragos\nPlatform, that includes anomaly and behavioral detection will significantly enhance visibility into network\noperations and potential threats.\n\n**4.** **SECURE REMOTE ACCESS**\n\nThe FrostyGoop incident exploited vulnerabilities associated with remote access points. Secure remote access\nprotections must be strictly enforced to safeguard against similar threats. This includes deploying multi-factor\nauthentication (MFA), ensuring all remote connections are logged and monitored, and using virtual private\nnetworks (VPNs) to encrypt data in transit. Furthermore, remote access should be granted on a need-to-use\nbasis with regular audits to review access rights and privileges.\n\n**5.** **RISK-BASED VULNERABILITY MANAGEMENT**\n\nEffective vulnerability management tailored to the risk profile of ICS components would involve regular\nassessments to identify and address vulnerabilities that adversaries could exploit. Mitigating network\nexploitable vulnerabilities is vital, especially when evidence of active exploitation exists. Where patches are not\nfeasible, compensating controls such as enhanced monitoring or restrictive access controls will mitigate the\npotential risks.\n\n#### Conclusion\n\nThe discovery and analysis of the FrostyGoop ICS malware underscore the significant risks posed to OT\nenvironments. FrostyGoop’s capabilities to interact with ICS devices via Modbus TCP and its undetected status by\nantivirus vendors highlight the critical need for robust OT cybersecurity measures. The cyber attack on the municipal\ndistrict energy company in Lviv, Ukraine, is a stark reminder of the potential real-world impacts of such\nvulnerabilities, emphasizing the necessity for adequate security controls and continuous OT network security\nmonitoring. Organizations must prioritize the implementation of comprehensive cybersecurity frameworks to\nsafeguard critical infrastructure from similar threats in the future.\n\n\n-----\n\n###### Request a Demo\n\n\n[info@dragos.com](mailto:info%40dragos.com?subject=) [@DragosInc](mailto:info%40dragos.com?subject=) @Dragos, Inc.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://hub.dragos.com/hubfs/Reports/Dragos-FrostyGoop-ICS-Malware-Intel-Brief-0724_.pdf"
    ],
    "report_names": [
        "Dragos-FrostyGoop-ICS-Malware-Intel-Brief-0724_.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1724810657,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1721402530,
    "ts_modification_date": 1721663853,
    "files": {
        "pdf": "https://archive.orkl.eu/bb7f469a02e408abc6ce40ec182f9f6568611cf3.pdf",
        "text": "https://archive.orkl.eu/bb7f469a02e408abc6ce40ec182f9f6568611cf3.txt",
        "img": "https://archive.orkl.eu/bb7f469a02e408abc6ce40ec182f9f6568611cf3.jpg"
    }
}