{
    "id": "eea465ff-e6c9-4ddd-b0b0-651db9725a3d",
    "created_at": "2023-01-12T15:07:59.702881Z",
    "updated_at": "2025-03-27T02:05:32.253539Z",
    "deleted_at": null,
    "sha1_hash": "ad27fd81c27ffa44eb751cf4f5695a605618809b",
    "title": "2022-04-18 - Unofficial Windows 11 upgrade installs info-stealing malware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:47:09Z",
    "file_modification_date": "2022-05-28T23:47:09Z",
    "file_size": 1799309,
    "plain_text": "# Unofficial Windows 11 upgrade installs info-stealing malware\n\n**[bleepingcomputer.com/news/security/unofficial-windows-11-upgrade-installs-info-stealing-malware/](https://www.bleepingcomputer.com/news/security/unofficial-windows-11-upgrade-installs-info-stealing-malware/)**\n\nBill Toulas\n\nBy\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nApril 18, 2022\n01:18 PM\n0\n\n\n-----\n\nHackers are luring unsuspecting users with a fake Windows 11 upgrade that comes with\nmalware that steals browser data and cryptocurrency wallets.\n\nThe campaign is currently active and relies on poisoning search results to push a website\nmimicking Microsoft's promotional page for Windows 11, to offer the information stealer.\n\nMicrosoft offers an upgrade tool for users to check if their machine supports the latest\noperating system (OS) from the company. One requirement is support for Trusted Platform\nModule (TPM) version 2.0, which is present on machines that not older than four years.\n\nThe hackers are preying on users that jump at installing Windows 11 without spending the\ntime to learn that the OS needs to meet certain specifications.\n\nThe malicious website offering the fake Windows 11 is still up at the time of writing. It\nfeatures the official Microsoft logos, favicons, and an inviting “Download Now” button.\n\n\n-----\n\n**Malicious website used in the campaign (windows11-upgrade11[.]com)**\nIf the visitor loads the malicious website via direct connection - download is unavailable\nover TOR or VPN, they will get an ISO file that shelters the executable for a novel infostealing malware.\n\nThreat researchers at [CloudSEK have analyzed the malware and shared a technical report](https://cloudsek.com/)\nexclusively with BleepingComputer.\n\n## Infection process\n\nAccording to CloudSEK, the threat actors behind this campaign are using a new malware\nthat researchers named “Inno Stealer” due to its use of the Inno Setup Windows installer.\n\nThe researchers say that Inno Stealer doesn’t have any code similarities to commodity\nother info-stealers currently in circulation and they have not found evidence of the malware\nbeing uploaded to the Virus Total scanning platform.\n\nThe loader file (Delphi-based) is the “Windows 11 setup” executable contained in the ISO,\nwhich, when launched, dumps a temporary file named is-PN131.tmp and creates another\n.TMP file where the loader writes 3,078KB of data.\n\nCloudSEK explains that the loader spawns a new process using the CreateProcess\nWindows API the helps spawn new processes, establish persistence, and plant four files.\n\nPersistence is achieved by adding an .LNK (shortcut) file in the Startup directory and using\n_icacls.exe to set its access permissions for stealthiness._\n\n\n-----\n\n**Creating a process to establish persistence** _(CloudSEK)_\nTwo of the four dropped files are Windows Command Scripts to disable Registry security,\nadd Defender exceptions, uninstall security products, and delete the shadow volume.\n\nAccording to the researchers, the malware also removes security solutions from Emsisoft\nand ESET, likely because these products detect it as malicious.\n\nThe third file is a command execution utility that runs with the highest system privileges;\nand the fourth is a VBA script required to run dfl.cmd.\n\nAt the second stage of the infection, a file with the .SCR extension is dropped into the\nC:\\Users\\\\AppData\\Roaming\\Windows11InstallationAssistant directory of the compromised\nsystem.\n\nThat file is the agent that unpacks the info-stealer payload and executes it by spawning a\nnew process called “Windows11InstallationAssistant.scr”, the same as itself.\n\n\n-----\n\n**The Inno Stealer's infection chain** _(CloudSEK)_\n\n## Inno Stealer capabilities\n\nThe capabilities of Inno Stealer are typical for this kind of malware, including collecting web\nbrowser cookies and stored credentials, data in cryptocurrency wallets, and data from the\nfilesystem.\n\nThe set of targeted browsers and crypto wallets is extensive, including Chrome, Edge,\nBrave, Opera, Vivaldi, 360 Browser, and Comodo.\n\n**Web browsers targeted by Inno Stealer** _(CloudSEK)_\n\n\n-----\n\n**Crypto wallets targeted by Inno Stealer** _(CloudSEK)_\nAn interesting characteristic of Inno Stealer is that the network management and the datastealing functions are multi-threaded.\n\nAll stolen data is copied via a PowerShell command to the user’s temporay directory,\nencrypted, and later sent to the operator’s command and control server (“windowsserver031.com”)\n\n**Malware communication with the C2** _(CloudSEK)_\nThe stealer can also fetch additional payloads, an action only performed at night time,\npossibly to take advantage of a period when the victim is not at the computer.\n\n\n-----\n\nThese additional Delphi payloads, which take the form of TXT files, employ the same Innobased loader that fiddles with the host’s security tools and use the same persistenceestablishment mechanism.\n\nTheir extra capabilities include stealing clipboard information and exfiltrating directory\nenumeration data.\n\n## Security advice\n\nThe whole Windows 11 upgrade situation has created a fertile ground for the proliferation of\n[these campaigns, and this is not the first time that something like that has been reported.](https://www.bleepingcomputer.com/news/security/fake-windows-11-upgrade-installers-infect-you-with-redline-malware/)\n\nIt is recommended to avoid downloading ISO files from obscure sources and only perform\nmajor OS upgrades from within your Windows 10 control panel or get the installation files\n[straight from the source.](https://www.microsoft.com/software-download/windows11)\n\nIf an upgrade to Windows 11 is unavailable to you, there’s no point attempting to bypass the\nrestrictions manually, as this will come with a set of downsides and severe security risks.\n\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nBill Toulas is a technology writer and infosec news reporter with over a decade of\nexperience working on various online publications. An open source advocate and Linux\nenthusiast, is currently finding pleasure in following hacks, malware campaigns, and data\nbreach incidents, as well as by exploring the intricate ways through which tech is swiftly\ntransforming our lives.\n\n[Previous Article](https://www.bleepingcomputer.com/news/microsoft/windows-10-21h2-now-in-broad-deployment-available-to-everyone/)\n[Next Article](https://www.bleepingcomputer.com/news/security/hackers-steal-655k-after-picking-metamask-seed-from-icloud-backup/)\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-18 - Unofficial Windows 11 upgrade installs info-stealing malware.pdf"
    ],
    "report_names": [
        "2022-04-18 - Unofficial Windows 11 upgrade installs info-stealing malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536079,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653781629,
    "ts_modification_date": 1653781629,
    "files": {
        "pdf": "https://archive.orkl.eu/ad27fd81c27ffa44eb751cf4f5695a605618809b.pdf",
        "text": "https://archive.orkl.eu/ad27fd81c27ffa44eb751cf4f5695a605618809b.txt",
        "img": "https://archive.orkl.eu/ad27fd81c27ffa44eb751cf4f5695a605618809b.jpg"
    }
}