{
    "id": "eebb95bb-e057-43bd-a625-e59dcd84b7e1",
    "created_at": "2022-10-25T16:48:13.696954Z",
    "updated_at": "2025-03-27T02:16:05.85176Z",
    "deleted_at": null,
    "sha1_hash": "e820638a0c4690636ebac596e0bbc040308aa040",
    "title": "RSA Research Terracotta VPN: Enabler Of Advanced Threat Anonymity",
    "authors": "RSA",
    "file_creation_date": "2015-08-03T17:47:58Z",
    "file_modification_date": "2015-08-03T17:47:58Z",
    "file_size": 2106821,
    "plain_text": "# RSA RESEARCH\n\n TERRACOTTA VPN\n\n## Enabler of Advanced Threat Anonymity\n\nAugust 4, 2015\n\n\n-----\n\nContent and liability disclaimer\n\nThis Research Paper is for general information purposes only, and should not be used as a\nsubstitute for consultation with professional advisors. EMC has exercised reasonable care in the\ncollecting, processing, and reporting of this information but has not independently verified,\nvalidated, or audited the data to verify the accuracy or completeness of the information. EMC\nshall not be responsible for any errors or omissions contained on this Research Paper, and\nreserves the right to make changes anytime without notice. Mention of non-EMC products or\nservices is provided for informational purposes only and constitutes neither an endorsement nor a\nrecommendation by EMC. All EMC and third-party information provided in this Research Paper is\nprovided on an \"as is\" basis.\n\nEMC DISCLAIMS ALL WARRANTIES, EXPRESSED OR IMPLIED, WITH REGARD TO ANY\nINFORMATION (INCLUDING ANY SOFTWARE, PRODUCTS, OR SERVICES) PROVIDED IN THIS\nRESEARCH PAPER, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\nFOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. Some jurisdictions do not allow the\nexclusion of implied warranties, so the above exclusion may not apply to you.\nIn no event shall EMC be liable for any damages whatsoever, and in particular EMC shall not be\nliable for direct, special, indirect, consequential, or incidental damages, or damages for lost\nprofits, loss of revenue or loss of use, cost of replacement goods, loss or damage to data arising\nout of the use or inability to use any EMC website, any EMC product or service. This includes\ndamages arising from use of or in reliance on the documents or information present on this\nResearch Paper, even if EMC has been advised of the possibility of such damages\n\nCopyright © 2015 EMC Corporation. All Rights Reserved.\nUse, copying, and distribution of any EMC software described in this publication requires an applicable software license.\nRSA and the RSA logo are registered trademarks or trademarks of EMC Corporation in the United States and other countries.\nAll other products and/or services referenced are trademarks of their respective companies.\nPublished in the USA. August 4, 2015\n\n\n###### 2\n\n\n-----\n\n#### EXECUTIVE SUMMARY .......................................................................... 5\n\n BACKGROUND ...................................................................................... 5\n\n WHAT IS TERRACOTTA VPN? ................................................................ 5\n\n TERRACOTTA VPN COMPONENTS .......................................................... 6\n\n BEHIND THE TERRACOTTA NODES ....................................................... 7\n\n BEHIND TERRACOTTA NODES: THE VICTIMS ........................................ 9\n\n TERRACOTTA WINDOWS SERVER ENLISTMENT MODUS OPERANDI ...... 9\n\n THE ECONOMICS OF HACKING FOR A PROFIT .................................... 10\n\n VPN NODES THAT DON’T “LOOK LIKE” VPN NODES ............................ 11\n\n WHO USES TERRACOTTA VPN? ........................................................... 12\n\n SUSPECTED NATION STATE SPONSORED CAMPAIGNS LEVERAGING TERRACOTTA VPN .............................................................................. 12\n\n TERRACOTTA VPN LEVERAGED FOR PHISHING AND ATTEMPTED EXPLOITATION OF A DEFENSE CONTRACTOR ..................................... 12\n\n SHELL_CREW ..................................................................................... 14\n\n TERRACOTTA VPN BREAKDOWN ......................................................... 15\n\n DETECTION ........................................................................................ 15\n\n DETECTING NODE ENLISTMENT ACTIVITY ......................................... 15\n\n DETECTING NODE USE IN ATTACKS .................................................... 15\n\n DETECTING USE OF TERRACOTTA VPN RESOURCES ............................ 16\n\n DETECTING TERRACOTTA ASSOCIATED MALWARE ............................. 16\n\n DETECTING TERRACOTTA ACTIVITY IN RSA SECURITY ANALYTICS AND RSA ECAT ........................................................................................... 23\n\n DETECTING TERRACOTTA MALWARE USING RSA SECURITY ANALYTICS AND ECAT ........................................................................................... 25\n\n PREVENTION ...................................................................................... 32\n\n ATTRIBUTION AND PATTERN OF LIFE ................................................ 32\n\n CONCLUSIONS ................................................................................... 33\n\n\n###### 3\n\n\n-----\n\n#### APPENDIX .......................................................................................... 33\n\n AVAILABLE TO INDUSTRY PARTNERS UPON REQUEST ....................... 33\n\n AUTHORS ........................................................................................... 33\n\n\n###### 4\n\n\n-----\n\n#### EXECUTIVE SUMMARY\n\nIn this report, RSA Research explores in depth a malware-supported VPN network, known internally to RSA as Terracotta.\n\nTerracotta is an active launch-platform for APT activities of Shell_Crew / DeepPanda and other APT actors, used to obscure the\norigins of the threat actors’ malicious activities. It is ensnaring a new class of victims (legitimate commercial and government\nentities, unknowinly serving VPN nodes and bandwith) into larger-scale APT cases. Fortunately, enlistment in the Terracotta\nnetwork is readily preventable by using well-established cybersecurity practices. Detection and mitigation for enlisted systems\nis also quite feasible.\n\nTerracotta is commercially marketed in the People’s Republic of China (PRC) under several different brand names. VPN services\nare quite marketable in China as a means to anonymously traverse government internet censorship. Terracotta’s malicious\nmethods for acquiring nodes and theft of bandwidth likely derives substantial cost-savings for its operators.\n\nHaving provided Terracotta VPN indicators to trusted partners, RSA has received multiple reports of (and since observed)\nsuspected nation-state sponsored campaign activity originating from Terracotta VPN IP addresses. Targets appear to have\nincluded Western governments and several commercial entities. By using Terracotta VPN, advanced threat actors appear to\noriginate from seemingly benign sources. Blocking, restricting, or detecting by IP address indicators is difficult because new\nnodes (hosted in legitimate organizations) are being continuously added.\n\nThis report by RSA Research may represent the first exposure of a PRC-based VPN operation that maliciously, efficiently and\nrapidly enlists vulnerable servers around the world.  It is the first time RSA Research has seen Shell_Crew / DeepPanda and\nother similar APT actors using such networks for anonymization and obfuscation.\n\n#### BACKGROUND\n\nVirtual Private Networks (VPN) are very popular. They are part and parcel for almost every enterprise network, especially those\nwith remote employees. Aside from VPNs for enterprises, there are many reputable commercial VPN services that offer low-cost,\nreliable service to individual users. These users employ VPNs for reasons that might include connection security, protection of\nprivate data, online gaming acceleration, and bypassing service provider restrictions. VPNs are also used by cyber criminals, as\nit allows them to obscure their true source location. When a commercial VPN service provider uses resources such as servers\nand copious bandwidth stolen or repurposed from unsuspecting victims for purposes of profit, analysis and reporting are in\norder. In this report, RSA Research exposes one such operator doing business with multiple VPN brand names marketed\nprimarily in the People’s Republic of China (PRC). Operating with more than 1500 end nodes around the world, RSA Research\nhas confirmed that at least thirty of the host systems are compromised Windows servers that were “harvested” without the\nvictims’ knowledge or permission. The operators behind Terracotta VPN continue their broad campaign to compromise multiple\nvictim organizations around the world. RSA Research is reporting on the associated VPN operator because:\n\n   - There is evidence of compromise of multiple victim organization systems around the world,\n\n   - There is evidence of illicit installation of software and malicious remote access tools on the victims’ servers, and\n\n   - There is evidence of theft of victims’ resources and bandwidth to serve clients (including advanced threat actors) with a\nhigh-performance anonymity service.\n\nNOTE: There are two classes of victims described and referred to in this report. Most of the references to victims are of those unknowingly enlisted into\nthe Terracotta VPN service, as outlined above. A second class of victims, APT targets, have been targeted by other actors who are using Terracotta for\nanonymization and obfuscation. Throughout this report, we specificly refer to APT-victims accordingly, while leaving the generic ‘victim’ designation for\nthe Terracotta nodes.\n\n#### WHAT IS TERRACOTTA VPN?\n\nTerracotta VPN is the name used by RSA Research to describe the dynamically-maintained conglomerate of multiple VPN “brand”\nnames marketed on Chinese-language websites. The websites are principally linked by common domain name registrant email\naddresses and are often hosted on the same infrastructure with the same basic web content.\n\n###### 5\n\n\n-----\n\n#### TERRACOTTA VPN COMPONENTS\n\nThere are several high-level components to the Terracotta VPN system.\n\n   - **WEBSITES: The most visible Terracotta VPN components are the websites that market the service and the specific brands**\nassociated with Terracotta VPN.  VPN users can download the software clients, obtain trial credentials, change credentials\nfor their paid accounts, and add credit to paid accounts from these websites.\n\n   - **CLIENT SOFTWARE: The client software is another common Terracotta VPN element. The client interfaces are skinned**\nwith images and logos consistent with their corresponding websites. The client software is principally developed by a\nlegitimate software vendor, according to the application’s file properties and indicative by the domains contacted by the\nclient when the user logs-in.\n\n   - **CLIENT SOFTWARE AUTHENTICATION: Closely-tied to the client software is the central client authentication system, by**\nwhich clients use credentials to authenticate into the client software. Upon successful login, the client software will check\nfor updates and download the latest set of global VPN nodes.\n\n   - **COMMON VPN NODES: The dynamic set of 1500+ VPN nodes is another component. These nodes are shared among most**\nof the Terracotta VPN brands and, most notably, link the different elements of the Terracotta VPN ecosystem. The roster of\nnodes is updated by the various software clients during each login sequence. Figure 1 illustrates the relationships between\nthe Terracotta VPN components and the client VPN-tunneling sequence.\n\n   - **USER AUTHENTICATION; The final component is the central Radius-compatible, Internet Authentication Service (IAS)**\ndirectory that authenticates the user account credentials with the VPN node.\n\nThe steps are:\n\n1. The Terracotta user establishes an account; obtains credentials and client software from one of the Terracotta brand\nwebsites.\n\n2. The user signs into the client UI, which authenticates the client credentials against the central client authentication system.\n\n3. The software client will then populate with an updated roster of VPN nodes.\n\n4. Once the user selects a VPN node, the node will authenticate the user credentials with the distributed IAS directory.\n\n5. Following successful authentication, the Point-to-Point Tunneling Protocol (PPTP) or Layer-Two Tunneling Protocol (L2TP)\nsession is established.\n\nAt this point the user has successfully tunneled to the Internet through the Terracotta VPN end point.\n\n###### 6\n\n Figure 1. How Terracotta VPN Works\n\n\n-----\n\n#### BEHIND THE TERRACOTTA NODES\n\nWhere do the various Terracotta VPN providers obtain the resources to build such a vast VPN network? Out of 1500+ common VPN\n\nnodes, it is possible that some servers or appliances were legitimately obtained and leased by the Terracotta VPN operators. We\n\nwill describe how others were clearly compromised. RSA Research proposes three possible candidates (three devices)\n\nencompassing 557 IP addresses. We believe these devices are the best possible candidates for legitimate lease by the Terracotta\n\nVPN perpetrators for the following reasons:\n\n1. Massive multi-homing: The minimum quantity of IP addresses per suspected-legitimately-leased-device is 51. Terracotta\n\nservices are marketed as very cost-effective, offering availability of a large VPN network for approximately $3/month.\n\nMassive multi-homing of a single device is apparently a method for inflating the appearance of the network. A Terracotta\n\nVPN client pings and displays all available nodes, noting both the date each node came online and its current response\ntime. However, while the network may appear to offer multiple new nodes on a given day, nodes with the same\n\nenlistment date and similar response-times actually indicate a multi-homed device. Further, network analysis shows the\n\nVPN clients usually connect to only a single IP address assigned to each massively multi-homed device. This may result in\n\nlower maintenance overhead, and indicates that the Terracotta VPN operator knows full-well that there is just one device\n\nbehind the large pool of available nodes. And while there is no performance benefit from having the VPN clients ping\n\nmultiple IP addresses from the same devices, doing so perpetuates the illusion of a larger network than what exists. When\n\nconnecting to each of the nodes depicted in the client UI below (several nodes reflecting one of three multi-homed devices\n\nRSA Research has identified) the exit IP addresses are randomly assigned from the large pool of available IP addresses.\n\n###### Figure 2. Screenshot of Terracotta client app, listing multi-homed nodes\n\n 7\n\n\n-----\n\norganization, the victim organizations used their Internet-facing servers for various use cases, none of which included VPN\n\nor Windows Remote Access services. If these were compromised devices, we would expect the devices to be used by their\n\nlegitimate owners for other purposes prior to being enlisted as Terracotta VPN nodes. If, on the other hand, a legitimate\n\nVPN provider was compromised, we expect the operators to have noticed that their authentication process and client-base\n\nhad been hijacked.\n\n###### Figure 3. RDP Login banner associated with possibly leased Terracotta VPN node\n\nA login splash screen (Figure 3) associated with the device with hostname 3819027EEA6E42F indicates the use of Windows Server\n\n2003 Enterprise x64 Server, with Simplified Chinese locale or Chinese language pack. The latter would be the Windows locale\n\nmost-commonly used by mainland PRC or Singapore residents.\n\n###### 8\n\n\n-----\n\n#### BEHIND TERRACOTTA NODES: THE VICTIMS\n\nAll of the compromised systems, confirmed through victim-communication by RSA Research, are Windows servers. RSA Research\n\nsuspects that Terracotta is targeting vulnerable Windows servers because this platform includes VPN services that can be\n\nconfigured quickly (in a matter of seconds). While most of the Terracotta victims are smaller organizations without dedicated\n\nsecurity staff, large organizations were not immune to exploitation by the Terracotta perpetrators. Organizations with confirmed\n\ncompromised Windows servers include:\n\n\n\n- Fortune 500 hotel chain\n\n- A department of transportation in a U.S. state\n\n- High tech manufacturer\n\n- Fortune 500 engineering firm\n\n- University in Taiwan\n\n- University in Japan\n\n- State university in the U.S.\n\n- County government of a U.S. state\n\n- Prize indemnity insurance company\n\n- Microsoft Windows enterprise management\n\napplication developer\n\n- Boutique IT service provider\n\n- Charter school\n\n\n\n- Educational service provider\n\n- Law firm\n\n- U.S. university-affiliated company\n\n- Web design and SEO consultant\n\n- Physician’s office\n\n- Unified Communications as a Service (UCaaS)\n\nprovider\n\n- Business-to-Consumer (B2C) applications developer\n\n- Public Convention center in a U.S. city\n\n- Wireless test and measurement solutions provider\n\n- IT Value Added Reseller (VAR) and services provider\n\n- IT solutions provider/contractor for federal and local\n\ngovernment organizations\n\n\nThe 23 organizations listed above represent at least 31 Windows server systems that were compromised and enlisted into\n\nTerracotta.\n\n#### TERRACOTTA WINDOWS SERVER ENLISTMENT MODUS OPERANDI\n\nA common trait shared with all confirmed victims is that they had Internet-exposed Windows servers without hardware firewalls.\n\nAdditionally, for at least one victim with multiple servers exposed to the Internet, only those servers with the built-in Windows\n\nsoftware firewall turned off were enlisted in the Terracotta VPN ecosystem. In one specific compromised system analyzed by RSA\n\nResearch, the following sequence of events, shown in Figure 4, was noted prior to the system becoming a node in the Terracotta\n\nVPN ecosystem:\n\n1 Brute force password attack on the “Administrator” user account, via DCOM Windows Management Interface (WMI)\n\nthrough TCP port 135. There are multiple security testing tools with this capability, including the popular CoreImpact\n\npython class wmiexe.py[1]. The brute force activity was done from an IP address we call the “reconnaissance host” which\n\nwas recently observed performing port 135 scanning on the Internet, according to DShield[2].\n\n2 Remote connection using Administrator credentials from the reconnaissance host several hours later to disable the\n\nWindows Firewall and install the Telnet Service. Windows logs for this event sequence are consistent with those that would\n\nbe recorded with use of standard remote administration tools available from Microsoft Management Console (MMC) via\n\nstandard Windows Management Interface (WMI) protocols.\n\n3 Login in via Remote Desktop (RDP) from a Windows system we call “base host”, with hostname WEI-270FBC26C38,\n\noriginating from IP ranges in the vicinity of Dongguan, a suburb of Guangzhou, China. This happens within minutes of\n\nevents in sequence number two. RSA Research has obtained forensic images indicating that this hostname was used for\n\ncompromises and enlistment from January 2014 to June 2015.\n\n1 https://github.com/CoreSecurity/impacket/blob/master/examples/wmiexec.py\n2 http://dshield.org/ipdetails.html?ip=58.162.xx.xx\n\n###### 9\n\n\n-----\n\n(dropper MD5: bccbba3ed45ead051f56fc62fef005a6) and/or custom Mitozhan RAT (MD5:\n\n7b18614df95e71032909beb25a7b1e87) and a Windows backdoor shell daemon listening on port 3422 (MD5:\n\n531d30c8ee27d62e6fbe855299d0e7de).\n\n5 Creation of new Windows account (actual examples include “mssql” and “krto”) and addition of account to administrators\n\ngroup, from base host.\n\n6 Days later, a login via RDP from base host in Dongguan, China using the account created in step five to install Network\n\nPolicy and Access Services and Routing and Remote Access Services with custom remote access policy pointing at\n\nTerracotta Internet Authentication Services (IAS) servers.\n\n7 Testing of Terracotta VPN centralized IAS authentication using “testwj” account from base host WEI-270FBC26C38.\n\n###### Figure 4. Terracotta VPN enlistment \n\n#### THE ECONOMICS OF HACKING FOR A PROFIT\n\nWhy would a business need to hack servers for use in a VPN ecosystem, when Virtual Private Servers (VPS) are so readily and\n\ninexpensively available? Currently, high-quality VPS’s with sufficient power for use as a VPN node can be leased for as little as\n\n$5.00 per month in the U.S. However, VPN traffic is more bandwidth-intensive than CPU-intensive. Since many VPS solutions\n\nprovide a base-level of bandwidth and charge for overage, the cost of bandwidth for a VPN service such as Terracotta would\n\nsignificantly affect operating expenses. Even if the monthly recurring bandwidth costs of using VPS servers were ignored, the\n\nlogistics of managing the contracts and payments with foreign and domestic providers would add significantly to the cost of\n\noperations. Conservatively, RSA Research counted more than 300 different organizations behind the 1500+ nodes in the Terracotta\n\nVPN ecosystem.\n\nHypothetical Discussion: If the servers were legitimate, at least 300 monthly international transactions would be required to maintain the network. A\nmore-profitable and simpler (if not legitimate) model may be to ensnare a seemingly endless supply of vulnerable servers on the Internet. RSA\nResearch proposes that the Terracotta VPN provider “hacks and harvests” VPN nodes because this process is not only cheaper, but logistically easier\nthan running a complex accounts payable operation required to maintain a global 1500+ node VPN ecosystem.\n\n###### 10\n\n\n-----\n\n#### VPN NODES THAT DON’T “LOOK LIKE” VPN NODES\n\nSeveral legitimate mainland PRC VPN providers were reviewed by RSA Research. These providers were consistent in that they\n\nostensibly provided a list of all VPN IP addresses on their websites (Figure 5). A security analyst (or a content service provider with\n\ncontractual restrictions on geographical distribution), would be able to enumerate hosts associated with the VPN provider and\n\nrestrict accordingly.\n\nIn contrast, if a portion of your exit IP addresses appear to be associated with legitimate businesses and can’t be easily classified\n\nas VPN nodes, then you may attract a customer interested in obscuring its origin. The Terracotta-branded providers do not publish\n\nsuch lists. Their exit nodes remain largely unrestricted, an apparent differentiator.\n\n###### Figure 5. U.S. Nodes as displayed on a legitimate VPN service website\n\n 11\n\n\n-----\n\n#### WHO USES TERRACOTTA VPN?\n\nTo help characterize the Terracotta user base, RSA Research analyzed the Microsoft Remote Access Service (MSRAS) logs for a\n\nsingle Terracotta victim server for one month (Table 1).\n\nUnique successfully authenticated connections 118,948\nUnique client IP addresses 9,053\nClient IP Addresses in mainland PRC 8,903 (98%)\nClient IP addresses not in mainland PRC 150 (2%)\nUnique client account names 723 (most connections used trial accounts)\nUnique client host names 3,640\n\n###### Table 1. Statistics from a month of logs on an enlisted Terracotta Node\n\nClearly, most users of Terracotta appear to originate within mainland PRC, as is consistent with where the service is marketed. In\n\naddition to the APT activity that has been observed, RSA Research believes that use cases include Great Firewall traversal,\n\nanonymity, peer to peer (P2P) file sharing and gaming acceleration; though this traffic analysis research is based on a limited\n\nnumber of network packet captures. Other (non-APT) criminal activity that may leverage Terracotta’s anonymity is possible, but\n\nhas not been observed to date. The clients of Terracotta may be entirely unaware of the organizations methods for obtaining\n\nservers and bandwidth.\n\n#### SUSPECTED NATION STATE SPONSORED CAMPAIGNS LEVERAGING TERRACOTTA VPN\n\nSince providing Terracotta VPN indicators to trusted partners, RSA Research has received several reports of suspected nation-state\n\nsponsored campaign activity originating from Terracotta VPN IP addresses. RSA Research can confirm that suspected nation-state\n\nactors have leveraged at least 52 Terracotta VPN nodes for exploitation of sensitive targets among Western government and\n\ncommercial organizations. Perhaps one of the benefits of using Terracotta for Advanced Threat Actors is that their espionage\nrelated network traffic can blend-in with ‘otherwise-legitimate’ VPN traffic.\n\n#### TERRACOTTA VPN LEVERAGED FOR PHISHING AND ATTEMPTED EXPLOITATION OF A DEFENSE CONTRACTOR\n\nRSA Research received a specific report from a large defense contractor concerning 27 different Terracotta VPN node IP addresses\n\nthat were used to send phishing emails (Figure 6) targeting users in their organization. The phishing emails were simple HTML\n\nformatted emails with content pasted from legitimate online news articles. The HTML formatted emails were loaded with an\n\nintelligence-gathering tool known as a “web bug[3]” that was specifically tailored to the recipient.\n\n3 https://en.wikipedia.org/wiki/Web_bug\n\n###### 12\n\n|Unique successfully authenticated connections|118,948|\n|---|---|\n|Unique client IP addresses|9,053|\n|Client IP Addresses in mainland PRC|8,903 (98%)|\n|Client IP addresses not in mainland PRC|150 (2%)|\n|Unique client account names|723 (most connections used trial accounts)|\n|Unique client host names|3,640|\n\n\n-----\n\n###### Figure 6. Redacted phishing email laden with web bug sent from Terracotta VPN node IP address\n\nAn image reference in the email pointed to a website controlled by the actors that spoofed a popular Webmail provider. The image\n\nreference appeared to have been crafted so as to entice the target into logging into the phishing website with their legitimate\n\ncredentials (Figure 7), thereby sending the targets’ webmail credentials directly to the malicious actors. Typically APT actors use\n\nthe information they gather from web bugs and phishing to later perform highly targeted exploitation or intelligence collection on\n\nspecific users who have met their criteria.\n\n###### Figure 7. Spoofed login page for major webmail provider, linked from phishing email\n\n 13\n\n\n-----\n\ndomains, as shown partially redacted in Table 2.\n\nThe partial- and un-redacted domains below are representative of brands that are commonly spoofed for phishing purposes. All of these domains have\nbeen reported and are obvious spoofs. The domains we have redacted involve specific government and defense sector targets. These have been\nreported and the targets have been notified.  Further details can be made available to industry partners.\n\n**Domains directly related to defense contractor phishing from Terracotta VPN nodes**\n\nweblogin-yahoo.com\n\nweblogin-vxxxxxx.net\n\nlinkedinmember.com\n\nauth-vxxxxxx.com\n\nweblogin-live.com\n\n**[10 related domains based on common hosting]**\n\n###### Table 2. Terracotta-originating phishing campaign related domains\n\n#### SHELL_CREW\n\nAs part of the investigation, RSA Research was able to track suspected Shell_Crew actors in their ongoing exploitation campaign of\n\na sensitive network over several months. These actors connected to a Derusbi server variant “beachhead” on this target network.\n\nOut of the thirteen different IP addresses used during this campaign against this one (APT) target, eleven (85%) were associated\n\nwith Terracotta VPN nodes. At least in this month’s long campaign, we see advanced threat actors using Terracotta VPN\n\ninfrastructure to obscure their origins and cover their tracks.\n\nFor more information on these advanced threat actors, refer to the Shell_Crew report from the RSA Incident Response Team here:\n\nhttp://www.emc.com/collateral/white-papers/h12756-wp-shell-crew.pdf\n\n###### 14\n\n\n-----\n\n#### TERRACOTTA VPN BREAKDOWN\n\nA recent network node location breakdown of the Terracotta network indicates that a high percentage of nodes are in China,\nwith secondary focus in the United States and South Korea. Additionally we see smaller quantities in other disparate locations.\n\n###### Figure 8. Geographic concentration of Terracotta VPN Nodes\n\n#### DETECTION\n\nDepending on what aspect of the attack you are looking for, detecting Terracotta VPN in your network will likely require a\nnumber of different detection methods and technologies.\n\n#### DETECTING NODE ENLISTMENT ACTIVITY\n\nIf a host has been enlisted as a VPN node in the Terracotta network, the compromised server will beacon to the following URLs\nas the servers authenticate users to the VPN service:\n\n   - 1.8800free.info (currently resolves to IP address in Zhengzhou, Henan Province, PRC)\n\n   - 2.8800free.info (currently resolves to IP address in Hangzhou, Zhejiang Province, PRC)\n\nServers exhibiting this behavior should be examined for compromise.\n\n#### DETECTING NODE USE IN ATTACKS\n\nTo detect the use of Terracotta VPN nodes in attacks, ingress/egress connections from the host nodes should be noted and\ninvestigated. Hits on these nodes would indicate anonymization activity from the Terracotta network.\n\n###### 15\n\n\n-----\n\n#### DETECTING USE OF TERRACOTTA VPN RESOURCES\n\nTo detect users of this service, connections to “Client Authentication Domains” (Appendix 1) should be monitored. Hits to these\ndomains would indicate an end-user using the downloadable VPN client to select VPN nodes for use. Additionally, hits to “Client\nMarketing Domains” (Appendix 1) may indicate an end-user “shopping” for access to the VPN service.\n\n#### DETECTING TERRACOTTA ASSOCIATED MALWARE\n\nRSA Research has associated several notable malware samples with the Terracotta eco-system. These binaries have been used\nto provide backdoor/RAT services on compromised servers. RSA Research has observed that this malware is commonly installed\nby the actors concurrently with other remote administration tools including Radmin, DameWare, and Windows telnet server.\nOther lateral reconnaissance and exploitation tools used by the Terracotta actors include various port scanners and password\ndumpers such as Mimikatz and a Chinese tool called DolphinQ.[4] Additionally, many Terracotta nodes had sometimes multiple\ninstances of CCProxy installed to provide additional anonymization services. These CCProxy instances used locally configured\ncredentials, and not central authentication like the VPN services.\n\nWhile this is not a thorough analysis of the malware encountered during this investigation, several samples were directly tied to\nthe initial enlistment of the servers as nodes into the Terracotta VPN ecosystem, as mentioned in the Modus Operandi section.\n\n**Gh0st RAT MM523**\nFile Size: 21.9 MB\nMD5: bccbba3ed45ead051f56fc62fef005a6\n\nC2: vpn.mm523.net:10000 (currently sinkholed by RSA Research[5])\n\nhttp://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/zegost\n\nhttp://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=TrojanDropper:Win32/Zegost.B#tab=2\n\nRSA Research refers to this variant, or build of Gh0st RAT as “MM523” based on the C2 domain. Gh0st is a full function Remote\nAdministration Tool (RAT) with keystroke logger, file manager, remote terminal shell, screen control and capture, and many\nother functions. Pertinent analysis on Gh0st RAT is available[6]. Since the majority of confirmed Terracotta-compromised\nsystems are running 64-bit Windows Server 2008 R2, this section will detail more findings that are pertinent to that platform,\nrarely covered by typical sandbox analysis.\n\nThis particular binary was found on only one system, but appears to be an installer or “dropper” for the Gh0st malware that was\nfound on multiple Terracotta compromised servers prior to February 2015. This malware is unusually large because it is padded\nwith zeros. The large file size may have been a rudimentary attempt to avoid antivirus or network security systems. To be\nsure, absent the padding, a binary comparison proves that the sample is identical to the sample submitted to VirusTotal in July\n2014 with MD5 of e421d07c316ab6e04fd0bfa122f1d953.[7]\n\nGh0st was coded originally for Windows XP. Though the dropper will successfully install on more modern Windows systems,\nthere are unresolved issues with its installation on Windows 7 and Windows Server 2008R2.\n\nThe dropper scans the Windows registry here:\n\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost\\Netsvcs\n\nIt finds the first unused (stopped and disabled) service that runs under service process svchost netsvcs. On typical Terracotta\nvictim servers, this has been the FastUserSwitchingCompatibility service, which is a deprecated service left-over from Windows\nXP for compatibility. Since FastUserSwitchingCompatibility it is not an actual service that can run on versions later than Windows\n\n4 https://www.virustotal.com/en/file/9b8257000b05116a3631630c44b9f6b18c13e5bc5635c1fa3f20a01f70380909/analysis/\n5 A sinkholed domain is one that was used by its owner specifically for malicious activity and thus subject to lawful seizure. Malware that is sinkholed is\nredirected to an analysis system controlled by researchers or law enforcement instead of the criminals. The sinkhole is then used for intelligence\nresearch and victim notification.\n6 http://www.mcafee.com/us/resources/white-papers/foundstone/wp-know-your-digital-enemy.pdf\n7 https://www.virustotal.com/en/file/3a2d5ce9f5f953f0499773a05f26317f9f6745352031bb8dafbb6aadf0e8e57b/analysis/\n\n###### 16\n\n\n-----\n\nfrom that issue include a misspelled and mismatched description for the hijacked FastUserSwitchingCompatibility which is\n“Windows Sxitcway Firewall/Internet Connection Sharing (ICS)”. A Google search for the word “Sxitcway” will reveal other\nmalware that encounters similar platform compatibility problems.\n\nThe dropper installs its service DLL named with five random letters with the following path in the normally hidden ProgramData\ndirectory. Example:\n\nC:\\ProgramData\\Application Data\\Storm\\update\\%SESSIONNAME%\\hbeya.cc3\n\nThe Gh0st service DLL binary in this location is approximately 22MB in size, and because the file is generated dynamically, has a\nunique file hash for each installation.\n\nUpon initial execution, the Gh0st RAT dropper is extremely busy, querying for some 75 URLs associated with legitimate antivirus\nvendors; however, no connections are made to these URL for C2. For control, the RAT connects to the IP found with a DNS\nquery to vps.mm523.net on port 10000 using the same connection string as the “cb1st” variant of Gh0st analyzed by Norman in\n“The Many Faces of Gh0st” paper here:\n\nhttp://download01.norman.no/documents/ThemanyfacesofGh0stRat.pdf\n\nRSA Research determined that some 240 systems around the world are infected with this Trojan, including approximately 100\nTerracotta VPN nodes.\n\nGh0st RAT GDS520\n\nFile Size: 204.5KB\n\nMD5: possibly 81c08ae40700d863f5dbd35599192962 and/or ef938cd1594b6b44507c6423cd39d5f5\n\nC2: gds520.com:8086 (Active)\n\nFollowing the neutralization of the MM523 Gh0st RAT communication with the RSA Research seizure of its C2 domain, RSA\nResearch observed malicious services installed by a dropper variant very similar to the MM523 Gh0st variant on newly\ncompromised Terracotta victims. While similar to the “Gh0st RAT MM523” build, this build we dub GDS520 has a different\nservice DLL location and C2 URL. The GDS520 sample had been in the wild before the RSA Research sinkholing of mm523.net,\nbased on the date two dropper variants were uploaded to VirusTotal. Similar to Gh0st RAT MM523, these variants are\ncharacterized by DNS lookups to multiple antivirus vendor update URLs, in addition to the C2 URL, gds520.com over port TCP\nport 8086. The Ghost RAT GDS520 service DLL is named with five random letters and is installed in the following location with\nthe example file name:\n\nC:\\ProgramData\\DRM\\%SESSIONNAME%\\vxujx.cc3\n\nNotably, the dropper deletes itself after successfully installing the RAT service. This is unlike the Gh0st RAT MM523 variant,\nwhich did not delete itself.  Finally, the two GDS520 Ghost RAT variants found on VirusTotal were built with file properties to\nresemble a legitimate Microsoft program (Figure 9), and included a digital certificate as one of the executable’s resources, which\ncan be displayed in the file properties digital signatures tab (Figure 10). RAT files were appended with a digital signature taken\nfrom a legitimate file signed by Kaspersky Lab. Since the signature corresponds to a different file, it appeared as invalid. Any\nmore than cursory review of the dropper executable properties would reveal the invalid signature. These dropper samples used\nthe exact same Kaspersky certificate described in the article “Certificate Snatching—ZeuS Copies Kaspersky’s Digital Signature”\nby TrendMicro.[8]\n\n8 http://blog.trendmicro.com/trendlabs-security-intelligence/certificate-snatching-zeus-copies-kasperskys-digital-signature/\n\n###### 17\n\n\n-----\n\n###### Figure 9. Gds520 Gh0st RAT installer file details\n\n Figure 10. Gds520 Gh0st RAT installer with invalid code signing using Kaspersky public certificate\n\nOn one compromised system investigated in May of 2015, forensic artifacts showed the source IP address of the GDS520\ninstaller (Figure 11).\n\n###### Figure 11. Forensic artifacts left behind on a victim server by the actor downloading the GDS520 Gh0st\n RAT installer from a Beijing IP address\n\n\n###### 18\n\n\n-----\n\nA cache of the page indicated it was from a type of ephemeral file server known as HTTPFileServer (HFS)[9]. The HFS server\ncached page showed that the HFS daemon had been up for 4 minutes (Figure 12). Fortunately for the investigation, the\nephemeral HFS daemon maintains usage statistics. Out of the 37 files available on the HFS page to the Terracotta actor, the\nGDS520 Gh0st RAT appeared to be the most commonly downloaded, with 1225 total downloads (Figure 12).\n\n9 http://www.rejetto.com/hfs/\n\n\n###### 19\n\n\n-----\n\n###### Figure 12. HFS-hosted tool repository from which Terracotta actor downloaded the GDS520 RAT\n installed on victim server. Note the yellow-highlighted information for “s.exe”.\n\n\n###### 20\n\n\n-----\n\nThe HFS daemon was running on an IP address from a range assigned to a middle school in Beijing according to Whois\ninformation[10]. Virus Total[11] [12] [13] [14] reveals that hosts in this IP range have been used, extensively in the first half of 2015, to host\nmalicious tools including the GDS520 Gh0st RAT variant and other exploitation tools found on at least three Terracotta victim\nsystems. Also notable in Figure 12 is the third most-often downloaded tool from the actor’s HFS page, named “Win64.exe[15].”\nRSA Research found this on one Terracotta victim server, and determined this to be a variant of the Windows privilege\nescalation exploit tool as described by Crowdstrike in a blog post on Hurricane Panda[16]. RSA Research does not know if the\nBeijing IP address range was leveraged exclusively by Terracotta operators.\n\n**Mitozhan Trojan**\nFile Size: 87 KB\nMD5: 7b18614df95e71032909beb25a7b1e87\n\nC2: vps.mm523.net:81 (sinkholed)\n\nThis malware copies itself to the Windows directory (C:\\Windows) and gives itself a new random name. Every time the malware\nruns, the executable name will vary but the file name length remains the same; 6 characters.\n\nExample:\n\nC:\\WINDOWS\\fatjse.exe\n\nThe Image Path of the newly-copied file is then used to add a new service to the ControlSet Registry Key. This will ensure\npersistence on the infected machine. The name of the new service (GHIJKL NOPQRSTU WXY) might be suspicious to\nadministrators.\n\nExample:\nRegKey Name: MACHINE\\SYSTEM\\CONTROLSET001\\SERVICES\\GHIJKL NOPQRSTU WXY\n\nRegKey Data: C:\\WINDOWS\\fatjse.exes\\\\0\n\nThe malware performs a DNS request to vps.xxxxx.net for resolution of its controller. The infected machine connects to the\ncontroller over TCP port 81 with the following initial connection string (Figure 13).\n\n###### Figure 13. Mitozhan C2 connection string\n\nTwo strings of interest are revealed upon examination of the process in memory.\n\n%c%c%c%c%c%c.exe\n\nGET %s HTTP/1.1Content-Type: text/htmlHost: %sAccept: text/html, */*User-Agent:Mozilla/4.0 (compatible; MSIE %d.00;\nWindows NT %d.0; MyIE 3.01)\n\nSearch engine results for the last part of the UA string MyIE 3.01 show the exact UA string mentioned in a blog post by FireEye\nin 2010[17]. The FireEye blog references another blog by researchers from Arbor Networks[18]. The latter blog describes in more\n\n10 https://whois.domaintools.com/211.153.xx.x\n11 https://www.virustotal.com/en/ip-address/211.153.xx.x/information/\n12 https://www.virustotal.com/en/ip-address/211.153.xx.x/information/\n13 https://www.virustotal.com/en/ip-address/211.153.xx.x/information/\n14 https://www.virustotal.com/en/ip-address/211.153.xx.2xx/information/\n15 https://www.virustotal.com/en/file/d7bd289e6cee228eb46a1be1fcdc3a2bd5251bc1eafb59f8111756777d8f373d/analysis/1429772817/\n16 http://blog.crowdstrike.com/crowdstrike-discovers-use-64-bit-zero-day-privilege-escalation-exploit-cve-2014-4113-hurricane-panda/\n17 https://www.fireeye.com/blog/threat-research/2010/10/avzhan-botnet-the-story-of-evolution.html\n18 http://www.arbornetworks.com/asert/2010/09/another-family-of-ddos-bots-avzhan\n\n###### 21\n\n\n-----\n\nconnection to the server, the UA string in memory, and the pattern to generate the executable name.\n\nThe legitimate properties and text depicted in the file appear to obscure the actual malicious intent.  The file is named after a\nvery popular photo markup program in China called 美�秀秀[19] or “Mito Xiu Xiu” (Figure 14).\n\n###### Figure 14. Mitozhan file properties shares name and description with popular benign program\n\nRSA Research determined that approximately 180 systems were infected with this Trojan, approximately one third of which were\nactive in the Terracotta VPN node ecosystem.\n\n**Backdoor Liudoor**\nFile Size: 87 KB\nMD5: 531d30c8ee27d62e6fbe855299d0e7de[20]\nC2: 0.0.0.0:3433\n\nThis is a simple backdoor similar to the common Portless Backdoor[21] found running as a service on at least five Terracotta VPN\nvictim servers, that RSA Research has dubbed Liudoor. It was installed as Windows\\SysWOW64\\rasauto.dll running as what\nwould be the unused “RasAuto” service on victim Windows Server 2008 R2 systems.\n\nWhile RSA Research did not find the dropper for this backdoor, it could have just as easily been installed with a batch script.\nThis sample binds to TCP port 3433 and waits for an incoming request, probably from a dedicated client used by its operator. It\nwill send the 4 bytes \"pass\", it expects to receive the binary string \"E10ADC3949BA59ABBE56E057F20F883E\" (shown here in\nASCII text). This is the MD5 hash of the ASCII string \"123456\". The backdoor process will compare what is passed from the\nclient to that hard coded value, and if successful it will send back \"succ\", if not it will sent back \"fail\".\n\nOnce the sample has successfully authenticated it will create a thread and pipe data back and forth to the Windows command\nshell process, cmd.exe. It takes the input and parses the string sent to the sample for 0x0D (the obfuscation XOR key) or\ncarriage return...and then passes everything before that to cmd.exe. The shell can be halted with the \"exit\" command. Other\nhard coded binary options include a certain value that will run the console program “nbstat.exe” for NetBIOS network\ninformation, which might be useful to its operator for lateral exploitation of other Windows computers on the victim network.\nRSA Research found similar Backdoor Liudoor files on VirusTotal with the following characteristics:\n\n78b56bc3edbee3a425c96738760ee40622 listens on port 3340\n5aa0510f6f1b0e48f0303b9a4bfc641e23 listens on port 3433\n2be2ac65fd97ccc97027184f0310f2f324 listens on port 1234\n\n\nOn more recently discovered Terracotta victims, Liudoor was observed to listen on TCP port 64111 or 33911.\n\n19 http://xiuxiu.web.meitu.com\n20 https://www.virustotal.com/en/file/ad1a507709c75fe93708ce9ca1227c5fefa812997ed9104ff9adfec62a3ec2bb/analysis/\n21 http://www.symantec.com/security_response/writeup.jsp?docid=2003-122516-0717-99&tabid=2\n22 https://www.virustotal.com/en/file/deed6e2a31349253143d4069613905e1dfc3ad4589f6987388de13e33ac187fc/analysis/\n23 https://www.virustotal.com/en/file/4575e7fc8f156d1d499aab5064a4832953cd43795574b4c7b9165cdc92993ce5/analysis/\n24 https://www.virustotal.com/en/file/e42b8385e1aecd89a94a740a2c7cd5ef157b091fabd52cd6f86e47534ca2863e/analysis/\n\n\n###### 22\n\n\n-----\n\n#### DETECTING TERRACOTTA ACTIVITY IN RSA SECURITY ANALYTICS AND RSA ECAT\n\nOrganizations with robust and consistently applied security controls on Internet-facing infrastructure should face little risk that\ntheir servers would be enlisted as VPN nodes by Terracotta actors. Two Fortune 500 companies that were identified as victims\nwere exceptions as the comprehensive application of security controls fell short. More threatening to otherwise well-defended\norganizations is the threat of advanced threat actors originating from legitimate, but compromised, organizations. Any network\nconnection with a Terracotta VPN node should be treated with great suspicion and investigated immediately. Built into RSA\nSecurity Analytics is the automatic threat intelligence aggregation and delivery system known as RSA Live. Updated Terracotta\nnode IP addresses are provided in RSA Live as part of the suspect VPN node feed, and available upon request. In Figure 15, RSA\nSecurity Analytics has alerted on the Derusbi server handshake parser from RSA Live. It also has alerted on the source of the\nmalicious Derusbi Command and Control (C2) which is a Terracotta node, described as a criminal VPN service exit node by\nSecurity Analytics.\n\n###### Figure 15. RSA Security Analytics detects advanced threat control of Derusbi server backdoor\n originating from Terracotta VPN Node\n\n 23\n\n\n-----\n\nIn Figure 16, a redacted screenshot from RSA Security Analytics shows an alert on a suspicious login to an otherwise secure\nwebsite from a Terracotta VPN node. Any authentication from Terracotta to an organization’s secure websites should be treated\nas hostile and investigated accordingly.\n\n###### Figure 16. RSA Security Analytics detection of secure website login (redacted) from Terracotta VPN\n\n 24\n\n\n-----\n\n#### DETECTING TERRACOTTA MALWARE USING RSA SECURITY ANALYTICS AND ECAT\n\n“An ounce of prevention is worth a pound of cure.” Certainly this idiom from Ben Franklin applies to efforts to defend against\nthis class of threats (not particularly sophisticated, opportunistic, but potentially very costly). RSA Research assesses that had\nthe Windows firewall been turned on, and the default “Administrator” account been renamed in each of the victim systems\nexamined, the systems would not have been compromised with the methods employed by Terracotta. Still, in both large and\nsmall organizations, a dichotomy may manifest between a “Security 101” policy and application of that policy, especially in\ndevelopment and cloud environments.\n\nNote: This is not intended to be a cyber-hunter’s cookbook for finding Terracotta activity with RSA Security Analytics and ECAT,\nbut rather to offer takeaways on the indicators quickly identified by these tools. The “out of the box” Gh0st protocol parser from\nRSA Live detects the “cb1st” Gh0st protocol string used by both the GDS520 and MM523Gh0st RAT variants, highlighted in red\nin Figure 17. Security Analytics shows an actual victim system in Iran that was infected with the now-neutralized MM523 Gh0st\nRAT variant calling-back to a RSA Research sinkhole.\n\n###### Figure 17. Gh0st protocol employed by MM523 Gh0st RAT detected by RSA Security Analytics\n\n 25\n\n\n-----\n\nThreat Level scores from low single-digit numbers to well above 100 when the GDS520 Gh0st RAT was installed.\n\n###### Figure 18. Raised threat level scores indicate malware infection on server and workstation\n\nDouble clicking on the workstation in the RSA ECAT console will bring up details about the system, where an analyst can drilldown into the network connections, and responsible processes. In Figure 19, a Security Operations Center (SOC) analyst would\nbe alerted by (illustrated in red boxes) the high score, the Suspicious Threads, and then hone in on the Gh0st C2 connections\nidentified by RSA ECAT.\n\n###### Figure 19. Suspicious network connections to the Gh0st C2 Domain as seen in RSA ECAT console\n\n 26\n\n\n-----\n\n###### Figure 20. RSA ECAT uses IIOCs to identify floating code employed by Gh0st RAT malware\n\nIn our Gh0st RAT malware scenario, the SOC analyst would be able to identify the infections of a server and workstation in RSA\nSecurity Analytics. The red boxes in Figure 20 illustrate Gh0st RAT protocol detection and botnet threat categorization by RSA\nSecurity Analytics. An analyst also might notice the unusual communications port.\n\n###### 27\n\n\n-----\n\n###### Figure 21. RSA Security Analytics alerts on system infected with Gh0st RAT as it calls back to C2 IP\n address on port 8086\n\n\n###### 28\n\n\n-----\n\nWhile the particular variant of the Mitozhan Trojan described in this paper’s malware analysis section has been neutralized by\nRSA Research with the seizure of its C2 domain; it is likely that other variants with different C2 domains persist. RSA developed\na Lua parser to detect Mitozhan Command and Control (C2) activity, now available through RSA Live and included as an\nappendix. Figure 22 is a redacted screenshot showing the Mitozhan Lua parser in action as it alerts on Mitozhan C2 activity on a\nRSA Research sinkhole.\n\n###### Figure 22. LUA Parser used to detect the Mitozhan C2 Activity in RSA Security Analytics\n\n 29\n\n\n-----\n\nMitozhan Trojan is also readily detected upon initial scan with RSA ECAT. Figure 23 shows the initial RSA ECAT console display\nfor the infected system, with initial indicators marked in red boxes.\n\n###### Figure 23. RSA ECAT console shows infection with Mitozhan. Note the high threat score, file name with\n random letters, and the unsigned executable with Chinese name\n\nWhile RSA ECAT can detect a never-before-seen malware infection out-of-the-box without signatures, a well-prepared SOC will\nhave signatures to help identify the threats behind the malware. That is where the built-in Yara features of RSA ECAT really\nshine. Yara is an open source tool that helps threat intelligence analysts and malware researchers classify and identify malware\nwith granularity that no antivirus product can match. Using the Yara signature included in the Appendix, our example SOC\nanalyst homes in on a suspicious rasauto.dll process identified by RSA ECAT as unsigned in Figure 24. By right-clicking on the\nsuspicious process, the analyst can initiate a Yara scan using pre-configured rules\n\n###### Figure 24. ECAT’s YARA integration allows the SOC analyst or incident responder to quickly identify\n malware that may be associated with a specific threat\n\n 30\n\n\n-----\n\nIn this scenario, the SOC analyst has used ECAT to scan the suspicious process. As illustrated with the red box on the right of\nFigure 25, the Yara result is a confirmed infection with Liudoor. The Liudoor YARA signature is included in the Appendix\n\n###### Figure 25. RSA ECAT indicates the YARA scan results. Backdoor Liudoor found!\n\nFor more technical details on how RSA ECAT can be used to proactively detect malware not discovered by traditional methods\nincluding antivirus, refer to the whitepaper RSA Incident Response: An APT Case Study.\n\nhttps://blogs.rsa.com/wp-content/uploads/2015/05/RSA-IR-Case-Study.pdf\n\n###### Terracotta Indicators for Security Analytics have been loaded into the following feeds in RSA Live:\n RSA \r Firstwatch \r APT \r Threat \r Domains \r  RSA \r Firstwatch \r Command \r and \r Control \r Domains \r  RSA \r Firstwatch \r Criminal \r VPN \r Exit \r IPs \r  RSA \r Firstwatch \r Insider \r Threat \r Domains \r \n\n 31\n\n\n-----\n\n#### PREVENTION\n\nTerracotta VPN operators are not using sophisticated methods to harvest their VPN nodes from vulnerable organizations around\nthe world. RSA Research assesses that any one of the following hardening steps would have prevented each of the confirmed\nvictim compromises:\n\n1 Block port 135 on external router and/or firewall\n\na. There is no known business-use for having port 135 exposed to the Internet\n\nb. Recommend: hardware firewall configured with “allow inbound by exception” policy\n\n2 Rename “Administrator” account on all Windows systems to a unique alphanumeric name\n\n3 Use a strong (bi-case letters, numbers plus multiple special characters) 15 character+ password that does not use keyboard\npatterns\n\na. Keyboard patterns are found in nearly all password cracking dictionaries\n\nb. Recommend: regularly change passwords\n\nIn contrast to the simple security controls that can prevent enlistment of an enterprise’s Windows servers into the Terracotta\nVPN node ecosystem, detecting advanced threat actors who are using Terracotta VPN nodes to hide their origin is more\ncomplicated. Infallible prevention may not be possible, and therefore detection is key. Use non-signature-based network\nanalysis and end-point analysis capabilities such as provided by RSA Security Analytics and RSA ECAT to proactively detect and\nthwart compromise of your organization’s network, before your most valuable asset---your information— is compromised.\n\n#### ATTRIBUTION AND PATTERN OF LIFE\n\nTerracotta is a PRC-based operation that uses opportunistic, large-scale exploitation methods to obtain and augment a global,\nhighly-marketable VPN service. RSA Research has no evidence suggesting that advanced threat actors such as Shell_Crew, or\nother suspected nation-state sponsored threat actor group is involved in any of the Terracotta exploitation activities. The\nattractiveness of the Terracotta ecosystem to advanced threat actors may be strictly utilitarian: a very low-cost platform for\nattacks that serves to ultimately reduce the probability of detection.\n\nAll compromised systems investigated by RSA Research were enlisted by actors originating primarily from IP ranges in\nDongguan and other areas of the Guangzhou megalopolis, or from the city of Wuhan. The Terracotta exploitation activity from\nDongguan took place primarily during weekends and hours outside of the normal mainland PRC workday using the following\nWindows hostname:\n\nWEI-270FBC26C38\n\nForensic images reveal this hostname was consistently used in initial victim compromise from late 2013 through June 2015.\n\nExploitation activity originating from Wuhan took place during normal PRC work week days and hours. The following hostname\nwas used:\n\nQT-201312081446\n\nIn Terracotta system compromises investigated in 2015, there appeared to be coordination between the actor(s) originating\nfrom Dongguan IP addresses, and the actor(s) originating from Wuhan IP addresses. In six out of seven systems examined, the\ninitial VPN test connection on a newly compromised server originated from Windows hostname WEI-270FBC26C38 with\nDongguan IP address, which was shortly followed by a VPN test connection using the Windows hostname QT-201312081446\nfrom a Wuhan IP address. Only after the successful connection from Wuhan was completed, did the node appear to be added to\nthe Terracotta node list displayed by Terracotta brand software clients.\n\n###### 32\n\n\n-----\n\n#### CONCLUSIONS\n\nThe Terracotta VPN system is marked by a grey-market anonymization ecosystem that is constructed, at least partially, of\nhacked servers. The Terracotta node ecosystem appears to enable better anonymity for advanced threat actors than would\notherwise be allowed by a more conventional VPN service with a legitimate and transparent node infrastructure.\n\n#### APPENDIX\n\nMalware Sample Hashes\n\nMalware Domains\n\nYara Signatures\n\nC2 Lua Parsers\n\nTerracotta User Account Authentication URLs\n\n#### AVAILABLE TO INDUSTRY PARTNERS UPON REQUEST\n\nTerracotta VPN Client Marketing Website Domains\n\nTerracotta Software Client Authentication Domains\n\nCurrent Terracotta Node List\n\nEmail conops@rsa.com for more information.\n\n#### AUTHORS\n\nKent Backman, Primary Research\n\nAlex Cox, Contributing\n\nSteven Sipes, Contributing\n\nAhmed Sonbol, Contributing\n\nRSA Incident Response Team, Contributing\n\nRSA Labs, Contributing\n\nThe authors would like to thank a number of colleagues from RSA and industry for their advice and assistance on this project.\n\n###### 33\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/cx1sjzb1q7slnjho5n1n0iuc7y9om2ll",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.08.04.Terracotta_VPN/Terracotta-VPN-Report-Final-8-3.pdf",
        "https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2015/Terracotta-VPN-Report-Final-8-3.pdf"
    ],
    "report_names": [
        "Terracotta-VPN-Report-Final-8-3",
        "Terracotta-VPN-Report-Final-8-3.pdf"
    ],
    "threat_actors": [
        {
            "id": "722b693d-cfdc-489e-a540-78c7d52ac5a8",
            "created_at": "2022-10-25T16:07:23.713768Z",
            "updated_at": "2025-03-27T02:02:09.940058Z",
            "deleted_at": null,
            "main_name": "Hurricane Panda",
            "aliases": [
                "Operation Poisoned Hurricane"
            ],
            "source_name": "ETDA:Hurricane Panda",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "Mimikatz",
                "SinoChopper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4636526b-b3f7-4e75-8ad9-fb7ef0261b76",
            "created_at": "2023-01-06T13:46:38.295889Z",
            "updated_at": "2025-03-27T02:00:02.797486Z",
            "deleted_at": null,
            "main_name": "HURRICANE PANDA",
            "aliases": [],
            "source_name": "MISPGALAXY:HURRICANE PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041765,
    "ts_creation_date": 1438624078,
    "ts_modification_date": 1438624078,
    "files": {
        "pdf": "https://archive.orkl.eu/e820638a0c4690636ebac596e0bbc040308aa040.pdf",
        "text": "https://archive.orkl.eu/e820638a0c4690636ebac596e0bbc040308aa040.txt",
        "img": "https://archive.orkl.eu/e820638a0c4690636ebac596e0bbc040308aa040.jpg"
    }
}