{
    "id": "eebe834e-d667-4652-82db-e4b7f321d5f8",
    "created_at": "2023-01-12T15:08:47.301708Z",
    "updated_at": "2025-03-27T02:05:32.848885Z",
    "deleted_at": null,
    "sha1_hash": "148be0d34dbb27bcd54cf6e912d0faac03c461eb",
    "title": "2020-09-22 - Grinju Downloader",
    "authors": "",
    "file_creation_date": "2022-05-28T23:35:57Z",
    "file_modification_date": "2022-05-28T23:35:57Z",
    "file_size": 699008,
    "plain_text": "# Grinju Downloader: Anti-analysis (on steroids) | Part 1\n\n**[medium.com/@vishal_thakur/grinju-malware-anti-analysis-on-steroids-part-1-535e72e650b8](https://medium.com/@vishal_thakur/grinju-malware-anti-analysis-on-steroids-part-1-535e72e650b8)**\n\nVishal Thakur October 3, 2020\n\n[Vishal Thakur](https://medium.com/?source=post_page-----535e72e650b8--------------------------------)\n\nSep 22, 2020\n\n\n7 min read\n\nThis malware takes anti-analysis and stealth techniques to a new level\n\nI’ve come across some great anti-analysis code in malware over the years. This one takes\nthe top spot. On that note, let’s get into it, this is a long one!\n\nSince this malware employs a very complex structure, I’ve decided to divide the analysis into\ndifferent sections. I’ll try to keep it as simple as possible but having said that, it really is a\nvery complicated project. Hence, publishing in parts.\n```\nThis is a very well-thought and equally well-written malware. There’s no VBA that you\ncan analyse. The values and formulas that are used are spread across the worksheets\nto thousands of rows. The functions, among other things, are used to close the file,\ncorrupt it and also delete the dropped scripts to make analysis extremely hard. In\nfact, you cannot analyse this malware without altering the code it self. Along the\nway, you’ll also see some great functions that can be used for anti-analysis\ntechniques.I've tried to include as much detail as possible but if you think\nsomething is not clear or has been left out (mostly its 'how did you get there in the\nfirst place?'), please don't hesitate to reach out, either in the comments or just\nemail me.\n\n## No Code\n\n```\nWell, that’s not an entirely true title… there is code, just not in the traditional sense when it\ncomes to macro-based malware (which is both exciting to see and also a stroke of genius on\nthe authors’ part — credit where its due). Also, I wanted to reference in the album title from\none of my favourite bands :)\n\n\n-----\n\nSo, more to that point, basically, if you were to go into the dev mode and look for the VBS\ncode in there, you won’t find much. In fact, you’ll find nothing at all at first.\n\n_So where is all the code…? Glad you asked ;)_\n\nAll the code is in the worksheet it self.\n\n_So how does it execute…?_\n\nHmm… gather around, grab a coffee.\n\nBack in the day when Excel wasn’t what it is today (think version 4.0), users were able to\nprogram stuff using macro functions. These functions could be placed in the workbook itself.\nThe way to do that is by creating a ‘macro’ sheet and then simply adding these functions in\nthe cells. Then you can autostart the first one and then follow the chain to completion (with\nenough ‘if’ statements to make sure you control the execution flow). That’s the short\nsummary of how you can have an Excel file run malicious code without having any VBAbased objects in the project.\n\n## Analysing the file\n\nNow that we have a basic understanding of how the malware operates, let’s get into the nittygritty.\n\nTo start with, it looks just like any other macro-based malware. There’s that excel file that\nopens up with a message asking the user to enable macros.\n\nThere are two sheets:\n\n\n-----\n\n**Sheet1 is the main one that the users see when they open the file, with the Enable**\nmacros..’ message at the top. It also has a lot of data that is used by the macro functions to\nexecute the programs for this malware.\n\n**‘ij3Lv’ is the macro sheet. It has the macro functions that are run in order to execute the**\nmalware.\n\n## The problem\n\nWell, the first problem is that if you enable macros and allow execution of the malware, it will\ncomplete the execution flow and then simply corrupt the file at which point you won’t be able\nto analyse the file any longer. Having said that, let’s look at the flow of execution here before\nwe move forward.\n\n1. The malware runs the first set of macro functions in succession which writes a new set\n\nof macro functions to the worksheet\n2. On successful execution of the second set of macro functions, the malware does two\n\nthings:\n3. It writes a VBS file to the disk\n4. It writes a text file to the disk\n5. It deletes the text file\n6. It corrupts the original excel file\n7. End of execution\n\nNow that we have laid out a simple, basic version of the flow of execution of this malware,\nlet’s get into the more detail.\n\n## Analysis Part 1\n\n_In this section, we’ll take a look at the start of the execution chain and how it is implemented._\n\nThe starting macro functions are embedded in the macro sheet ‘ij3Lv’.\n\nThey are well hidden, starting at ‘R3887C240’ — which means Row 3887 and Column 40.\nEven after you zoom out completely, you’ll need to scroll to the right to get to these cells.\nHaving said that this is not the way to find them, you need to grab the reference to the cell\nfrom code itself.\n\n\n-----\n\nZoomed out to 10% and then scrolled out to the right; look all the way to the right closely\nOnce you get to the functions, you can copy them into a code editor and start analysing them\none by one.\n\nZoomed back at 100%\nThis is what they look like in an editor:\n\nNow let’s get into the details. I’ll pick the most interesting parts, as there are way too many of\nthem to analyse individually.\n\n\n-----\n\nIn order to analyse it without losing touch with reality, we ll do that dynamically. We ll run\nthese individually and then capture the output to build a picture that gives an idea as to what\nis happening during the execution.\n\nLet’s start with this function:\n```\n=IF(AND(APP.MAXIMIZE(),GET.WORKSPACE(19),GET.WORKSPACE(13)>770,GET.WORKSPACE(14)>390,G\n\n```\n**These functions are very interesting as they can be used as anti-analysis techniques,**\n**not seen or published before.**\n\nLet’s have a look how:\n\n**APP.MAXIMISE() — this is a smart way of starting this function. It literally just maximises the**\ncurrent excel window that you’re working on (this malware).\n\n**GET.WORKSPACE(19) — If a mouse is present, it returns a value TRUE if not, it returns**\nFALSE. Can be easily used to check for sandbox presence.\n\n**GET.WORKSPACE(13) — usable workspace width, in points. In this case, the malware is**\nchecking if it’s greater than 770 or not. Again, can be used to check for sandboxes. Window\nsize wouldn’t matter at this point as it has already been maximised at the start of this\nfunction.\n\n**GET.WORKSPACE(14) — usable workspace height, in points. Being used exactly as the**\nfunction above, just for height in this case.\n\n**GET.WORKSPACE(31) — If running the macro in single-step mode, it returns TRUE. In this**\ncase, the author has already set it to FALSE, trying to hinder analysis.\n\n**GET.WORKSPACE(42) — If the computer is capable of playing sounds, this function returns**\nTRUE! Anti-sandbox check.\n\nOnce all these options have been checked, the function is stopped (HALT).\n\nLet’s move on to the next one:\n\n\n-----\n\nFrom this point on, the functions move on to extracting values from cells in Sheet1 and using\nthem to construct values for the next set of functions that will be written to the workbook to\nbe executed as the next step. Let’s see how that is done.\n\nFunctions use variables that are then assigned values from specific pre-populated cells.\nFunction ‘SET.NAME’ is used for this purpose.\n\nEg:\n```\ngsiGGMo=R3915C240gzDNqr=R3890C240PMXOKD=R3979C240esvmJMDoTkrH=R3910C240\n\n```\nWhen you go looking for these cells, you’ll find they have values in them, derived by using\nformulas (this is obfuscation on steroids, as you can’t just ctrl+F for these values as\n**text).**\n\nGoing through each call is out of scope for this publication so we’ll just look at the overall\nflow.\n\nThe entire program at this point runs in a loop, based on an ‘If’ statement. The values are\nincremented by one each time and if the condition returns ‘True’ the values are used to form\nthe next set of instructions.\n\nLet’s take a look.\n\nIn the above capture, note ‘CHAR(61.91)’ — this literally means: start building the value for\n“pdnPdPUK” with the character that corresponds to the code of ‘61’. 61 is the code for the\nEquals character ‘=’. Now look at the output below:\n\nThis loop ends up building the value all the way to “=CLOSE(FALSE)”, which will be used as\none of the functions to close the workbook without saving it (FALSE=don’t save).\n\n\n-----\n\nOnce ALL the functions have been run successfully, this is the resulting code:\n```\nIn the next part, we’ll dive into the code step-by-step and discover more antianalysis and stealth-exec techniques.\n\n```\nGo to [Part 2](https://medium.com/@vishal_thakur/grinju-downloader-anti-analysis-on-steroids-part-2-8d76f427c0ce)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-22 - Grinju Downloader.pdf"
    ],
    "report_names": [
        "2020-09-22 - Grinju Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536127,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653780957,
    "ts_modification_date": 1653780957,
    "files": {
        "pdf": "https://archive.orkl.eu/148be0d34dbb27bcd54cf6e912d0faac03c461eb.pdf",
        "text": "https://archive.orkl.eu/148be0d34dbb27bcd54cf6e912d0faac03c461eb.txt",
        "img": "https://archive.orkl.eu/148be0d34dbb27bcd54cf6e912d0faac03c461eb.jpg"
    }
}