{
    "id": "eecf4774-79c6-4ef9-ad06-8ac2856bf6ab",
    "created_at": "2023-01-12T15:04:48.450302Z",
    "updated_at": "2025-03-27T02:15:38.118741Z",
    "deleted_at": null,
    "sha1_hash": "f6e7cc3ea1e64ce8f3897969d657861480f58eeb",
    "title": "2020-10-06 - Eager Beaver- A Short Overview of the Restless Threat Actor TA505",
    "authors": "",
    "file_creation_date": "2022-05-27T21:13:02Z",
    "file_modification_date": "2022-05-27T21:13:02Z",
    "file_size": 494639,
    "plain_text": "# Eager Beaver: A Short Overview of the Restless Threat Actor TA505\n\n**[telekom.com/en/blog/group/article/eager-beaver-a-short-overview-of-the-restless-threat-actor-ta505-609546](https://www.telekom.com/en/blog/group/article/eager-beaver-a-short-overview-of-the-restless-threat-actor-ta505-609546)**\n\nTA505 is a very active – almost tireless - threat actor that prepares one campaign after\nanother from Monday to Friday. They target organizations across industries / government in\n[many countries around the world including Canada, Germany, South Korea, the UK, and the](https://www.cert.ssi.gouv.fr/uploads/CERTFR-2020-CTI-009.pdf)\nUSA. A severe threat to a great number of organizations: on one side, they conduct Big\nGame Hunting operations, that is encrypting large parts of a corporate network to extort high\n[ransom payouts. On the other side, they likely work on initial access development and hand](https://us-cert.cisa.gov/ncas/alerts/aa20-239a)\nover network access to associated threat actors.\n\nRestless? TA505 prepares one campaign after another from Monday to Friday.\n\nIn my previous blog posts, I wrote [about their tools and](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-s-box-of-chocolate-597672) [about their recent activity phase that](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-returns-with-a-new-bag-of-tricks-602104)\nstarted in June 2020. In this blog post, I will summarize what I know about TA505 as of\nSeptember 2020, leaving the past aside. I will answer questions that we are frequently asked\nby customers and by the cyber security community in general. Finally, I will give\nrecommendations to proactively fight them and share two generic ways to detect TA505\nintrusions in your network.\n\nOur Incident Response Service at Deutsche Telekom Security GmbH can quickly investigate\nand remediate ongoing TA505 intrusions. Please contact security-info@t-systems.com for\nmore information.\n\n\n-----\n\n## What is TA505?\n\n[TA505 is a very active threat actor whose history reaches back at least until 2014. It is](https://public.intel471.com/blog/a-brief-history-of-ta505/)\nbelieved that this threat actor resides in Eastern Europe (likely Russian-speaking country). It\nis natural that the objectives of threat actors change over time. In this blog post, I will give an\noverview of its recent history starting in late Summer 2019, leaving the past aside.\n\nTA505’s activity pattern follows a classic workweek from Monday until Friday. Like a\nclockwork, they prepare one daily campaign after another, hardly leaving one or two day\n[gaps. They are one of the busiest but also loudest – due to their high spam volume -](https://www.telekom.com/en/glossary#glossar381578)\ncybercrime gangs as of 2020. They primarily target enterprises across all industries. But\n[there are also reported cases of victims in Government agencies.](https://www.cert.ssi.gouv.fr/uploads/CERTFR-2020-CTI-009.pdf)\n\nAs of September 2020, I believe they primary engage in two different activities. First, TA505\nlikely works on initial access development for other threat actors. The current consensus\namong analysts is that they gain access to corporate networks, conduct the initial\nreconnaissance of these networks, likely including a first estimation of the target value.\nAfterwards, they sell the access to these networks on the underground. Finally, they hand\nover the network access to a second threat actor, which continues to operate in these\nnetworks. Second, TA505 likely engages in Big Game Hunting operations: they exfiltrate\ncorporate secrets, deploy the CL0P ransomware, demand ransom, and threaten to publish\nsaid corporate secrets, if the ransom is not paid. Even though it is likely that TA505 only\nworks in access development, there are several indications that TA505 (or a subset of it)\n[runs the CL0P ransomware operations, e.g. they share the same custom packer.](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-s-box-of-chocolate-597672)\n\n## Why are they so dangerous?\n\nTA505 seems to work on initial access development. They hand over the access to the\nnetworks that they compromise to further threat actors. Therefore, you never know who is\nreally compromising a network. Little is publicly known about TA505’s clients. We should\nkeep in mind that many organizations are rather tight-lipped about intrusions and we must\nexpect that there are more than the publicly documented threat actors that follow an initial\nTA505 intrusion.\n\nTwo intrusion sets have been repeatedly and publicly linked to TA505 over the last months.\n[First, the threat actor operating the CL0P ransomware. This threat actor engages in Big](https://malpedia.caad.fkie.fraunhofer.de/details/win.clop)\nGame Hunting operations. On the one side, they encrypt large parts of a corporate network\nin order to extort ransom. On the other side, they exfiltrate corporate secrets. Subsequently,\nthey threaten victims to publish these secrets to their leak portal, which they run on the\ndarknet.\n\nCL0P^-LEAKS website announcing the publication of files and customer data of several\nvictims.\n\n\n-----\n\n[Second, another threat actor that is said to cooperate with TA505 is Lazarus / APT38. This](https://us-cert.cisa.gov/ncas/alerts/aa20-239a)\n[nation-state backed threat actor conducts espionage as well as bank robbing.](https://www.nytimes.com/2017/03/22/business/dealbook/north-korea-said-to-be-target-of-inquiry-over-81-million-cyberheist.html?_r=0)\n\nWhile I tend to believe that CL0P is run by TA505 or a subgroup of it, there are opposing\nvoices suggesting the CL0P gang is just another customer of them. As of September 2020,\nthere are further hypotheses of possible clients like Silence that are still to be corroborated.\n\nFurthermore, TA505 is dangerous because their spamming volume is high. On heavy\ncampaign days, one organization alone may receive up to several thousand spam mails.\nWhile I do not have any global numbers, informal exchanges with other analysts seem to\nconfirm this. Given this sheer number of spam emails, it is likely that one employee\ndownloads the malicious document and executes the macro. And this is all this threat actor\nneeds: just one infection to get a foothold in an organization. Above all, this brings mediumsized enterprises into the focus that normally would not be in the focus of such targeted\ncybercrime: throw enough mud at the wall, some of it will stick.\n\n## How does TA505 operate?\n\nTA505 runs campaigns on almost all weekdays. They move very fast and setup the\ncampaign infrastructure just a couple of hours before the daily campaign starts. These\ncampaigns may target one or several specific countries (e.g. German-speaking countries). In\nthis case, they restrict access to their command and control servers by the geographical\nposition of the infected client (geofencing). But sometimes they target a broader set of\ncountries in one campaign. A campaign does normally not last longer than one afternoon. I\nget the feeling that the campaigns are timed to start after lunch time, when many employees\ntend to check their emails again. Furthermore, most campaign domains and artefacts like\nmalware are created or generated just in time for one campaign. This all ensures a tactical\nadvantage of this threat actor and it is a reason why, for instance, commercial feeds may lag\nbehind.\n\nTA505 utilizes spam as initial attack vector. Targets receive an email with subjects that are\nmoney-themed (e.g. “billing”, “payroll”, “sales forecast”) or human-resources-related (e.g.\n“sick note”). The emails often carry a link that redirects via a compromised blog website to a\nsharehoster-themed domain (e.g. onedrives-live[.]com). Sometimes they attach an HTML\nfile to the email instead of the redirection link. The HTML files mimic known services (e.g.\nCloudflare, Mozilla, …) and also redirect via a compromised blog website to a sharehosterthemed domain.\n\nExample HTML file mimicking a known service to distribute malicious documents.\n\nAt this sharehoster-themed domain, TA505 serves the target a Microsoft Office Excel\nWorksheet that contains a macro. Since TA505 does not utilize any zero day attacks, they\nrely on the user to enable the macro in order to continue the infection process. They lure the\n\n\n-----\n\nuser into enabling the macro by telling them, for instance, that the document is protected and\nrequires macro execution in order to be fully rendered.\n\nIf the user enables macro execution then the macro drops and executes TA505’s downloader\nGet2. This simple downloader exfiltrates information about the local machine to its command\nand control server such as computer name, user name, and the list of running processes.\nBased on this information as well as its geographic location, the command and control server\ndecides whether or not the third stage payload should be served to the target.\n\nThe Get2 command and control server distributes the third stage of the attack: TA505’s RAT\n(Remote Administration Tool) [SDBBot. They use this RAT to conduct an initial](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-s-box-of-chocolate-597672)\nreconnaissance of the target system. First, SDBBot automatically sends information to its\ncommand and control server including the computer name, Windows domain name, the\nWindows version, and whether the target system utilizes a proxy to connect to the Internet.\nPromising targets are then checked by manual operators, likely for a first estimation of the\n[target value. SDBBot offers many commands to manipulate the file system, download and](https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader)\nexecute payloads, enabling of RDP, and so on.\n\nIn addition to their RAT SDBBot, Get2 frequently downloads PuTTY SFTP client. Since\nmonths I observe the same and by now outdated version 0.73, which is vulnerable to a manin-the-middle-attack (CVE-2020-14002). It is likely that TA505 operators exfiltrate documents\nfrom the target system with the help of PuTTY SFTP client and not SDBBot. One reason\ncould be that this exfiltration process is more comfortable with PuTTY SFTP client than with\nSDBBot.\n\nThe current understanding of TA505 is that they also work on initial access development.\nHence, after the initial reconnaissance, they hand over the network access to another threat\nactor. Therefore, the modus operandi from this point in time may differ from intrusion to\nintrusion.\n\nIt is important to understand what is static and what is dynamic during a campaign. Note that\na campaign lasts just one day. There are typically four important domains during each\ncampaign. First, a sharehoster-themed domain that they utilize to serve malicious\ndocuments. Second, a domain for the Get2 command and control server. Third, two domains\nfor the SDBBot command and control server. The first two domains change between each\n(daily) campaign. The latter two SDBBot domains typically change every seven to ten days.\nFurthermore, there are dozens of domains of compromised Wordpress websites that they\nutilize for traffic redirection.\n\nMost other artefacts change from campaign to campaign. Some may even change during\none campaign. The theme of the spam mail and its subject line may change a couple of\ntimes during one campaign. The malicious documents that the sharehoster-themed server\nserves change their hash value as well as their file name periodically. I observed changes\nevery couple of seconds. Even though the maldocs and the spam mails may change during\n\n\n-----\n\none day, they still follow a certain pattern. For instance, the file name of the maldocs is just\nincremented during a campaign: Angebot_09082020_XXX.xls, where XXX stands for a\nthree-digit integer that is incremented continuously. The payloads Get2 and SDBBot are\nrepacked for each campaign. However, TA505 tends to serve the same PuTTY SFTP client\nsince months.\n\n## Is there innovation?\n\nWhile the TTPs of their current intrusion set are stable since late Summer 2019, they\nexperiment with new techniques every now and then. They rely mostly on the same modus\noperandi but they adapt slowly and steadily. Their experimentation likely shows them the way\nto go.\n\nFor instance, at the beginning of September 2020, TA505 modified their malicious\ndocuments in order to evade detection. Their documents still rely on human interaction; the\nuser must enable macros. But these documents used to have two PE files embedded (Get2\nx86 and x64 version), which should ring a bell in many heuristics. Then, at the beginning of\nSeptember 2020, they embedded these two files as two separate ZIP archives with obvious\nfilenames like str_join1.dll that the aforementioned macro unpacks and executes. Since midSeptember there are no obvious signs of PE files or zipped PE files in the malicious\ndocuments.\n\nFurthermore, TA505 continues to update their tools on which they rely for more than a year\nby now. While [SDBBot’s version was 2.0 in September 2019, it is version 3.11b as of](https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader)\nSeptember 2020. For instance, they continue to add new features like certificate pinning.\nThis [feature was added in version 3.9 in June 2020.](https://www.telekom.com/en/blog/group/article/cybersecurity-ta505-returns-with-a-new-bag-of-tricks-602104)\n\nAt this point in time, the (public) analysis and detection of their tools as well as infrastructure\ncontinues. I expect TA505 to continue their experiments and to consequently innovate while\nmaintaining the high velocity of their campaigns, which is the key to their success. I would\nsay that we are not yet ready to see a complete retooling within the next couple of months.\n\n## What can your organization do about them?\n\nThere are several proactive and reactive steps that you can take to prevent significant\ndamage to your organization.\n\nFirst, you have to keep the gateway closed and your best defense here are security-aware\nemployees. Explain the typical attack chains via email that other threat actors like the Emotet\ngang also follow. Especially, explain the problem with macros in documents coming from an\nexternal source. If possible then disable macros globally in your organization. Unfortunately,\nthere are groups of employees that have to deal with many documents from external sources\nevery day.\n\n\n-----\n\nSecond, block SDBBot domains at your perimeter network. As simple as it sounds, this\nensures that there will not be any manual reconnaissance and further downloads of payloads\n(e.g. CobaltStrike). This should prevent a full compromise of your network, though you will\nhave infected machines that require a cleanup.\n\nThird, act quickly on detected TA505 intrusions since it may be a matter of hours or days until\na full compromise of your infrastructure. Keep in mind that TA505 likely acts as a door\nopener and that you may have further threat actors in your network. Each of them may have\nfurther backdoors installed (e.g. CobaltStrike, TinyMet, etc.) that require a special treatment.\n\n## How can you detect an TA505 intrusion in your organization?\n\nThere are two ways to generically detect a possible TA505 intrusion. Generic detection\nmeans that it does not matter from which campaign the intrusion originated. The first way is\nhost-based and you have to check it on your network clients. The second way is networkbased and you can check it at your SIEM / in your proxy logs.\n\nFirst, you can check the presence of PuTTY SFTP client in version 0.73. TA505 distributes\nthis version in close to all daily campaigns. Get2 drops PuTTY SFTP client in the\n%APPDATA% directory. Hence, a recursive search on a supposedly infected network client\nfor the MD5 hash bc59fa5dbb11f5d286fc41e8f25c6cc0 could reveal a possible TA505\nintrusion. While this does not replace a full forensic investigation, it can help you to quickly\nnarrow down on clients where a possible TA505 intrusion may have started, if you get a\nmatch.\n\nSecond, SDBBot conducts a check of its geographic position on each start. It utilizes a thirdparty service for it: [IP Geolocation API. It sends a HTTP GET request to the URL http://ip-](https://www.telekom.com/en/glossary#glossar381622)\napi.com/json using the hard-coded user agent “Mozilla/5.0 (Windows NT 10.0; Win64; x64)\nAppleWebKit/537.36 (KHTML, like Gecko) Chrome/60.0.3112.113 Safari/537.36”. If you\ndetect such requests by a local network client, for instance, at your proxy, then this might be\na good sign of a live SDBBot infection. Consequently, you should start a forensic\ninvestigation on this client.\n\nHard-coded user agent string that SDBBot utilizes when contacting IP Geolocation API.\n\n### Appendix: IoCs\n\n**Ioc** **Description**\n\n98d01979e1020baa9a8e6af2c14da0da maldoc (embedded PE files, visible)\n\n\n-----\n\n077f697d9c6eb89baf98ecdd479e9c02 maldoc (embedded PE files in ZIP archives,\nvisible)\n\nbb0ae6a1edcdfe74efe5bf275deaf943 maldoc (invisible PE files)\n\n2a343a9c588ab2478d64457873b12d54 test maldoc (without macro)\n\nac43b411b9bd455a8cde89face9ea9b9 Get2 x86\n\n9cab3a1e56303949b7b54897d84c77fe Get2 x64\n\nb27b040dec41bb9cb1df456a7949ee5b SDBBot x86 installer (version 3.11b)\n\n7732577a4db34389a7cc93b08bdba714 SDBBot x86 installer (version 3.11b)\n\nbc59fa5dbb11f5d286fc41e8f25c6cc0 PuTTY SFTP client (version 0.73)\n\nnews-37876-mshome[.]com SDBBot domain (since 2020-09-11)\n\nnews-389767-mshome[.]com SDBBot domain (since 2020-09-11)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-06 - Eager Beaver- A Short Overview of the Restless Threat Actor TA505.pdf"
    ],
    "report_names": [
        "2020-10-06 - Eager Beaver- A Short Overview of the Restless Threat Actor TA505.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535888,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653685982,
    "ts_modification_date": 1653685982,
    "files": {
        "pdf": "https://archive.orkl.eu/f6e7cc3ea1e64ce8f3897969d657861480f58eeb.pdf",
        "text": "https://archive.orkl.eu/f6e7cc3ea1e64ce8f3897969d657861480f58eeb.txt",
        "img": "https://archive.orkl.eu/f6e7cc3ea1e64ce8f3897969d657861480f58eeb.jpg"
    }
}