{
    "id": "ef74fb7f-1e81-4fec-8bb5-e53b38561780",
    "created_at": "2023-01-12T15:00:20.32009Z",
    "updated_at": "2025-03-27T02:09:29.749662Z",
    "deleted_at": null,
    "sha1_hash": "80611a43a8a420b335176f810427be1535fbc557",
    "title": "2009-11-03 - Opachki, from (and to) Russia with love",
    "authors": "",
    "file_creation_date": "2022-05-29T10:39:10Z",
    "file_modification_date": "2022-05-29T10:39:10Z",
    "file_size": 4564573,
    "plain_text": "# SANS ISC: InfoSec Handlers Diary Blog - SANS Internet Storm Center SANS Site Network Current Site SANS Internet Storm Center Other SANS Sites Help Graduate Degree Programs Security Training Security Certification Security Awareness Training Penetration Testing Industrial Control Systems Cyber Defense Foundations DFIR Software Security Government OnSite Training InfoSec Handlers Diary Blog\n\n**[isc.sans.edu/diary/Opachki,+from+(and+to)+Russia+with+love/7519](https://isc.sans.edu/diary/Opachki%2C+from+%28and+to%29+Russia+with+love/7519)**\n\n\n-----\n\n## Opachki, from (and to) Russia with love\n\n**Published: 2009-11-03**\n\n**Last Updated: 2009-11-03 15:36:36 UTC**\n\n**by** [Bojan Zdrnja (Version: 1)](https://isc.sans.edu/handler_list.html#bojan-zdrnja)\n\n[13 comment(s)](https://isc.sans.edu/forums/diary/Opachki+from+and+to+Russia+with+love/7519/#comments)\nOpachki is a pretty interesting link hijacking trojan that has been spreading quite a bit in last\ncouple of weeks. I started analyzing it couple of days ago and noticed that in the mean time\n[Joe Stewart of SecureWorks posted his analysis as well (available here).](http://www.secureworks.com/research/threats/opachki/)\n\n\n-----\n\nThere are some very interesting things about Opachki so let me start at the beginning. The\nTrojan is distributed with a dropper which, when infecting the system, drops a DLL file. Both\nthe dropper and the DLL file are packed with a packer called \"Mystic Compressor\". Besides\nthis, the trojan never actually decrypts all strings in memory but calls a function to decrypt\nonly what it needs and immediately deletes the data after it is not needed. Finally, the packer\ndestroys PE header data from memory to make dumping more difficult.\n\nBesides dropping the DLL, the dropper also does one vary nasty action: it completely deletes\nthe SafeBoot registry key by calling reg.exe, as shown below:\n\nThis prevents the system from booting in Safe Mode – the attackers did this to make it more\ndifficult to remove the trojan. This goes well with what I've been always saying – do not try to\nclean an infected machine, always reimage it.\n\nAs Opachki's main goal is to hijack links, it hooks the send and recv API calls in the following\nprograms: FIREFOX.EXE, IEXPLORE.EXE, OPERA.EXE and QIP.EXE. While the first three\nare well known, I had to investigate the last one. It turned out that QIP.EXE is an ICQ client\nthat is very popular in Russia, so the trojan has a component that directly attacks Russian\nusers.\n\nThe trojan will monitor web traffic (requests and responses) that above mentioned\napplications make and will inject a malicious script tag into every response. The injected\nscript tag can be actually seen in the browser (by selecting the view source option) and can\nbe seen in the image below:\n\nThis will cause the browser to go to the shown site (google-analystisks.us), which is still live\nat the time of writing this diary. The site serves back a JavaScript file which modifies all links\nin the currently shown web page so they are redirected to a third site\n(http://thefeedwater.com/?do=rphp&sub=241&b= when I posted the diary). The PHP script at\nthe google-analystisk.us web site is interesting as well – if you try to retrieve it directly you'll\nget an error back so you have to supply a referrer field. It also checks if you came from a\nsearch engine (i.e. Google) and returns back a different JavaScript file so it steals search\nqueries as well\n\n\n-----\n\nFinally, Opachki performs another interesting action: it tries to see if the system is already\ninfected with ZEUS and will remove ZEUS' files (rename them to C:ntldrs). It will check for all\nfour ZEUS versions by verifying presence of the following files:\nC:WINDOWSsystem32ntos.exe, C:WINDOWSsystem32oembios.exe,\nC:WINDOWSsystem32twext.exe and C:WINDOWSsystem32sdra64.exe. I don't know why\nthey do this, it could be that they are hijacking ZEUS or simply competing for same machines\nor using same attack vectors as the ZEUS crew.\n\nThe whole story about Opachki shows how that the bad guys are prepared to invest a lot of\neffort into building malware. Removing such a trojan is not simple and I would recommend\nreimaging the machine as the trojan puts a lot of effort into making removing difficult. As the\nTrojan is specifically attacking Russian users (among the others), it is probably safe to\nassume that it originates from Russia as well.\n\nFinally, this shows that the bad guys are (probably) making good money by just hijacking\nlinks/clicking.\n\n-\nBojan\n[INFIGO IS](http://www.infigo.hr/en)\n\n[Keywords: analysis](https://isc.sans.edu/tag.html?tag=analysis) [hijack](https://isc.sans.edu/tag.html?tag=hijack) [opachki](https://isc.sans.edu/tag.html?tag=opachki) [trojan](https://isc.sans.edu/tag.html?tag=trojan)\n[13 comment(s)](https://isc.sans.edu/forums/diary/Opachki+from+and+to+Russia+with+love/7519/)\n\nJoin us at SANS! Attend Web App Penetration Testing and Ethical Hacking with Bojan Zdrnja in\nOnline | Central European Summer Time starting Jul 25 2022\n\nTop of page\n×\n\n[Diary Archives](https://isc.sans.edu/diaryarchive.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2003 - 2009/2009-11-03 - Opachki, from (and to) Russia with love.pdf"
    ],
    "report_names": [
        "2009-11-03 - Opachki, from (and to) Russia with love.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535620,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653820750,
    "ts_modification_date": 1653820750,
    "files": {
        "pdf": "https://archive.orkl.eu/80611a43a8a420b335176f810427be1535fbc557.pdf",
        "text": "https://archive.orkl.eu/80611a43a8a420b335176f810427be1535fbc557.txt",
        "img": "https://archive.orkl.eu/80611a43a8a420b335176f810427be1535fbc557.jpg"
    }
}