{
    "id": "ef8633fa-0a4d-4964-94a4-5bc970f2ea99",
    "created_at": "2023-01-12T15:06:47.750088Z",
    "updated_at": "2025-03-27T02:05:28.602343Z",
    "deleted_at": null,
    "sha1_hash": "41b6297c72d73e6976eb17cb3b11bef8de14a7fd",
    "title": "2018-06-26 - Files Cannot Be Decrypted- Challenge Accepted. Talos Releases ThanatosDecryptor",
    "authors": "",
    "file_creation_date": "2022-05-27T21:57:59Z",
    "file_modification_date": "2022-05-27T21:57:59Z",
    "file_size": 940586,
    "plain_text": "# Files Cannot Be Decrypted? Challenge Accepted. Talos Releases ThanatosDecryptor\n\n**blog.talosintelligence.com/2018/06/ThanatosDecryptor.html**\n\n## Executive summary\n\nCisco Talos has analyzed Thanatos, a ransomware variant that is being distributed via multiple malware\ncampaigns that have been conducted over the past few months. As a result of our research, we have\nreleased a new, free decryption tool to help victims recover from this malware. Multiple versions of\nThanatos have been leveraged by attackers, indicating that this is an evolving threat that continues to be\nactively developed by threat actors with multiple versions having been distributed in the wild. Unlike other\nransomware commonly being distributed, Thanatos does not demand ransom payments to be made\nusing a single cryptocurrency like bitcoin. Instead, it has been observed supporting ransom payments in\nthe form of Bitcoin Cash (BCH), Zcash (ZEC), Ethereum (ETH) and others.\n\nAdditionally, due to issues present within the encryption process leveraged by this ransomware, the\nmalware authors are unable to return the data to the victim, even if he or she pays the ransom. While\nprevious reports seem to indicate this is accidental, specific campaigns appear to demonstrate that in\nsome cases, this is intentional on the part of the distributor. In response to this threat, Talos is releasing\n[ThanatosDecryptor, a free decryption tool that exploits weaknesses in the design of the file encryption](https://github.com/Cisco-Talos/ThanatosDecryptor)\nmethodology used by Thanatos. This utility can be used by victims to regain access to their data if\ninfected by this ransomware.\n\n## Technical details\n\n\n-----\n\n### Ongoing evolution of Thanatos\n\nWhile tracking and analyzing the various campaigns being used to distribute the Thanatos ransomware,\nTalos identified multiple distinct versions of this malware, indicating that it is continuing to be actively\ndeveloped by the malware author. The main differences can be directly observed within the ransom note\nbeing used to inform victims that they have been infected and provide instructions for paying a ransom to\nthe attacker. Version 1 of Thanatos, which was being distributed in mid-February of this year, featured a\nvery primitive ransom note that is stored on the victim's desktop as README.txt.\n\nIn this version of Thanatos, the ransom note simply informs the user that their files have been encrypted\nand instructs them to pay a ransom amount of 0.01 bitcoin (BTC) to the specified bitcoin wallet. Rather\nthan using different wallet addresses across samples, the same hardcoded wallet address is present in\nall samples of this version of Thanatos that Talos analyzed. Payment processing appears to be manual\nand email-based, which is indicative of an attacker with limited resources and knowledge of ransomware\n[creation and distribution techniques used by other more well-known ransomware families such as Locky,](https://blog.talosintelligence.com/2017/06/necurs-locky-campaign.html)\n[Cerber, etc.](https://blog.talosintelligence.com/2016/11/cerber-spam-tor.html)\n\nShortly after Version 1 was observed being distributed, malware distribution campaigns began distributing\nThanatos Version 1.1 with the majority of the distribution of Version 1.1 occurring between February and\nApril 2018. This updated version of Thanatos featured several key differences related to the type of\ncryptocurrencies that victims could pay with.\n\n\n-----\n\nAs can be seen in the screenshot of the ransom note above, Thanatos Version 1.1 supports payment of\nthe ransom demand using BTC, ETH, and BCH. Additionally, the malware also now includes a unique\nMachineID that the victim is instructed to send to the attacker via email.\n\nInterestingly, the ransom notes changed several times across samples that Talos analyzed. Below is\nanother example of one of the ransom notes used by this malware. Note that the attacker had changed\nthe email address being used to communicate with victims. The attacker was also purporting to process\nransom payments in the form of Zcash versus the other cryptocurrencies listed in the other ransom notes.\n\n\n-----\n\nIn investigating the distribution mechanisms being used by the attacker to infect victims and remove their\nability to access data on their system, we identified an interesting campaign that indicated that at least in\nthis particular case, the attacker had no intention of providing any sort of data decryption to the victim.\nThe malware appears to have been delivered to the victim as an attachment to a chat message sent to\nthe victim using the Discord chat platform. Discord is a voice and text chatting platform that allows direct\ncommunications between two or more participants. The URL hosting the attached malware is below:\n\n_hxxps://cdn[.]discordapp[.]com/attachments/230687913581477889/424941165339475968/fastleafdecay.exe_\n\nThe filename used in this case was \"fastleafdecay.exe\" which may indicate that the victim was tricked into\n[executing the malware as it was posing as a mod of the same name in the video game Minecraft. When](https://minecraft.curseforge.com/projects/fast-leaf-decay)\nexecuted, this sample displayed the following ransom note to victims:\n\nAs can be seen in the above screenshot, the malware author did not include any instructions for paying a\nransom, instead stating that decryption was not available, indicating that this particular case was not\nfinancially motivated, and instead was used to destroy data on the victim's system. Interestingly, the PDB\npath that was intact on this sample differed from the other samples that Talos analyzed. In this case, the\nPDB path was:\n\n_C:\\Users\\Artur\\Desktop\\csharp - js\\косте пизда\\Release\\Thanatos.pdb_\n\nMost of the other samples contained the following PDB path:\n\n_D:\\Work\\Thanatos\\Release\\Thanatos.pdb_\n\nTalos also observed a sample that had been compiled in debug mode that contained the following PDB\npath:\n\n_D:\\Работа\\Локер шифровчик\\Thanatos-master\\Debug\\Thanatos.pdb_\n\n\n-----\n\n### Thanatos operations and encryption process\n\nWhen executed on victim systems, Thanatos copies itself into a subdirectory that it creates within\n%APPDATA%/Roaming. The subdirectory name and executable file name are randomly generated based\non system uptime and changes each time the malware executes.\n\nThanatos recursively scans the following directories within the current user's profile to identify files to\nencrypt:\n\nDesktop\n\nDocuments\n\nDownloads\n\nFavourites\n\nMusic\nOneDrive\n\nPictures\n\nVideos\n\nWhile many ransomware families have a specific list of file extensions that are supported for encryption,\nThanatos supports encryption of any file that has an extension. For each file that the malware locates, it\nderives an encryption key based on the number of milliseconds that the infected system has been\n[running via a call to GetTickCount. The malware then encrypts the file using Advanced Encryption](https://msdn.microsoft.com/en-us/library/windows/desktop/ms724408)\nStandard (AES)-256 and discards the encryption key. The process of discarding the encryption key\nprecludes the attacker from being able to provide access to the decrypted data, even if a ransom demand\nis paid. Encrypted files are then written to the filesystem with the .THANATOS file extension and the\noriginal files are deleted.\n\nThe malware also leverages an external website called iplogger. This website provides customized URLs\nthat can be used to track information about systems that access the URL. By making HTTP GET\nrequests using these hardcoded URLs, the attacker can obtain information about all of the different\nsystems that have been infected with Thanatos.\n\n\n-----\n\nThe HTTP GET request are all made using the following user agent:\n\n_Mozilla/5.0 (Windows NT 6.1) Thanatos/1.1_\n\nTalos has observed the following iplogger URLs hardcoded into various Thanatos samples that were\nanalyzed:\n\n\n-----\n\n_hxxp://iplogger[.]com:80/1CUTM6_\n\n_hxxp://iplogger[.]com:80/1t3i37_\n\nThe ransom note associated with Thanatos is saved to the infected user's desktop using the filename\nREADME.txt. A registry entry is created so that each time the system boots, the ransom note is displayed\nusing the Notepad application. This registry key is located in:\n\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run_\n\nAside from this, the malware does not obtain persistence for the executable itself.\n\n### ThanatosDecryptor\n\nAs previously described, the encryption keys used to encrypt files on victims' systems are derived based\nupon the number of milliseconds since the system last booted. This value is a 32-bit number, meaning\nthat the encryption key is effectively 32 bits as well. Additionally, the maximum number of milliseconds\nthat can be stored in a 32-bit value is roughly 49.7 days' worth, which is higher than the average amount\nof uptime on many systems due to patch installation, system reboots, and other factors. This makes\nbrute-forcing the key values significantly cheaper from a time perspective.\n\nAnother optimization can be made based on the fact that the system uptime is written to the Windows\nEvent Log roughly once per day. Since Thanatos does not modify the file creation dates on encrypted\nfiles, the key search space can be further reduced to approximately the number of milliseconds within the\n24-hour period leading up to the infection. At an average of 100,000 brute-force attempts per second\n(which was the baseline in a virtual machine used for testing), it would take roughly 14 minutes to\nsuccessfully recover the encryption key in these conditions.\n\n[Talos is releasing a decryption utility that can be leveraged by victims of Thanatos to attempt to regain](https://github.com/Cisco-Talos/ThanatosDecryptor)\naccess to data and files stored on the infected system. It has been tested on Versions 1 and 1.1 of the\nThanatos ransomware and on all currently known Thanatos samples Talos has observed.\n\n**_Note: In order to decrypt files as quickly as possible, ThanatosDecryptor should be executed on_**\n**_the original machine that was infected and against the original encrypted files that the malware_**\n**_created._**\n\nThis decryption utility currently supports decryption of the following types of files:\n\n**Image: .gif, .tif, .tiff, .jpg, .jpeg, .png**\n\n**Video: .mpg, .mpeg, .mp4, .avi**\n\n**Audio: .wav**\n\n**Document: .doc, .docx, .xls, .xlsx, .ppt, .pptx, .pdf, .odt, .ods, .odp, .rtf**\n\n**Other: .zip, .7z, .vmdk, .psd, .lnk**\n\n\n-----\n\nThe decryptor first searches the same directories as the ransomware to identify files that contain the\n.THANATOS file extension. For files that contain the .THANATOS file extension, the decryptor will then\nobtain the original file extension, which is left intact during infection, and compare it to the list of\nsupported file types. If the file type is supported, the decryptor will then queue that file for decryption.\n\nThanatosDecryptor also parses the Windows Event Log for uptime messages and uses the encrypted file\ncreation time metadata to determine a starting value for decryption. This value is used to derive an\nencryption key, and an AES decryption operation is performed against the file contents. The resulting\nbytes are then compared against values known to be valid file headers for the specific file type. If they do\nnot match, meaning the decryption process was unsuccessful, the seed value for the encryption key is\nthen incremented, and the process is repeated. Once successful, the original file is written to the file\nsystem, and the original filename is restored. Once one file has been successfully decrypted,\nThanatosDecryptor uses the seed value from that decryption attempt as the starting point for decryption\nattempts against additional files since they are likely to be very similar.\n\n[To execute ThanatosDecryptor, simply download the ThanatosDecryptor project here and execute](https://github.com/Cisco-Talos/ThanatosDecryptor)\nThanatosDecryptor.exe, which can be found in the release directory. Additional information and example\noutput can be obtained here.\n\n### Following the money … or lack thereof\n\nAs previously mentioned, throughout the various Thanatos campaigns and associated samples, the\nattacker behind this threat made changes to the types of cryptocurrencies that they claim are supported\nfor paying the ransom demand. Analysis of these various wallets and associated cryptocurrency\ntransactions revealed some interesting information about the size and success of these malware\ncampaigns over time. Across all of the samples, the following cryptocurrency wallets were listed along\nwith instructions for paying the ransom on the ransom note accompanying the malware.\n\n**Bitcoin ($BTC):**\n\n1HVEZ1jZ7BWgBYPxqCVWtKja3a9hsNa9Eh\n\n1DRAsxW4cKAD1BCS9m2dutduHi3FKqQnZF\n\n**Ethereum ($ETH):**\n\n0x92420e4D96E5A2EbC617f1225E92cA82E24B03ef\n\n**Bitcoin Cash ($BCH):**\n\nQzuexhcqmkzcdazq6jjk69hkhgnme25c35s9tamz6f\n\n**ZCash ($ZEC):**\n\nt1JBenujX2WsYEZnzxSJDsQBzDquMCf8kbZ\n\nIn analyzing the bitcoin wallets, we identified that the attacker had not received a single ransom payment\nfrom victims. In fact, the wallet listed most frequently across the samples analyzed\n(1HVEZ1jZ7BWgBYPxqCVWtKja3a9hsNa9Eh) was not even a valid bitcoin wallet. This means that even\nif a victim tried to pay using bitcoin, they would have been unable to. The second wallet\n(1DRAsxW4cKAD1BCS9m2dutduHi3FKqQnZF) did not have a single transaction to or from it.\n\n\n-----\n\nLikewise, the Bitcoin Cash wallet that was listed has also never seen a single transaction.\n\nWhen analyzing the Zcash wallet that was seen listed on one of the ransom notes associated with\nThanatos, we identified that while it had seen several transactions, the total amount of ZEC received by\nthis wallet was 2.24767084, which equals approximately $450 USD.\n\nFinally, the Ethereum wallet used by the attacker also saw several transactions. However, the total\namount was also low compared to some of the more successful ransomware campaigns we regularly\nobserve across the threat landscape. The total amount of ETH received in this wallet was 0.52087597,\nwhich equals approximately $270 USD.\n\nThis means that across all of the samples seen in the wild, the attacker's wallets had only received a total\nof $720 USD. If the incoming cryptocurrency was directly related to victims paying a ransom as a result of\nThanatos infections, this clearly did not generate significant revenue for the attacker when compared to\n[other financially motivated cybercrime operations.](https://www.talosintelligence.com/angler-exposed)\n\n\n-----\n\n## Conclusion\n\nWhether for monetary gains or to destroy data, attackers are continuously targeting end users. This\nmalware proves how easy it has become for anyone to target users. You do not have to be a\nsophisticated attacker to cause havoc. There are also an endless supply of attack vectors available. In\nthis case, for instance, the attacker took advantage of the Discord chat platform. Therefore, it is important\nto take security seriously and take steps to secure your systems, whether they are used for personal or\nbusiness purposes. Since many of these attacks take advantage of users, you also need to be careful\nwhen opening attachments from unknown sources or clicking on unknown links.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the malware used by](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nthese threat actors.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents access to](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nmalicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation Intrusion](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Prevention System (NGIPS), andMeraki MX can detect malicious activity associated with this threat.](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs,](https://umbrella.cisco.com/)\nand URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule\n[pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## YARA Signatures\n\n[Talos is also providing the following YARA signature that can be used to identify samples associated with](https://yara.readthedocs.io/en/v3.7.0/)\n\n\n-----\n\nthe Thanatos ransomware family.\n```\nrule Thanatos\n{\n    strings:\n    $s1 = \".THANATOS\\x00\" ascii\n    $s2 = \"\\\\Desktop\\\\README.txt\" ascii\n    $s3 = \"C:\\\\Windows\\\\System32\\\\notepad.exe C:\\\\Users\\\\\" ascii\n    $s4 = \"AppData\\\\Roaming\" ascii\n    $s5 = \"\\\\Desktop\\x00\" ascii\n    $s6 = \"\\\\Favourites\\x00\" ascii\n    $s7 = \"\\\\OneDrive\\x00\" ascii\n    $s8 = \"\\\\x00.exe\\x00\" ascii\n    $s9 = \"/c taskkill /im\" ascii\n    $s10 = \"Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" ascii\n    condition:\n    6 of ($s1, $s2, $s3, $s4, $s5, $s6, $s7, $s8, $s9, $s10)\n}\n\n## Indicators of Compromise (IOC)\n\n### File Hashes (SHA256)\n\n```\nbad7b8d2086ac934c01d3d59af4d70450b0c08a24bc384ec61f40e25b7fbfeb5\n\nfe1eafb8e31a84c14ad5638d5fd15ab18505efe4f1becaa36eb0c1d75cd1d5a9\n\n8df0cb230eeb16ffa70c984ece6b7445a5e2287a55d24e72796e63d96fc5d401\n\n97d4145285c80d757229228d13897820d0dc79ab7aa3624f40310098c167ae7e\n55aa55229ea26121048b8c5f63a8b6921f134d425fba1eabd754281ca6466b70\n02b9e3f24c84fdb8ab67985400056e436b18e5f946549ef534a364dff4a84085\n\n241f67ece26c9e6047bb1a9fc60bf7c45a23ea1a2bb08a1617a385c71d008d79\n\n0bea985f6c0876f1c3f9967d96abd2a6c739de910e7d7025ae271981e9493204\n\n42748e1504f668977c0a0b6ac285b9f2935334c0400d0a1df91673c8e3761312\n\n### URLs\n\nhXXps://cdn[.]discordapp[.]com/attachments/230687913581477889/424941165339475968/fastleafdecay.exe\nhXXp://iplogger[.]com:80/1CUTM6\n\nhXXp://iplogger[.]com:80/1t3i37\n\n### User Agents\n\nMozilla/5.0 (Windows NT 6.1) Thanatos/1.1\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-06-26 - Files Cannot Be Decrypted- Challenge Accepted. Talos Releases ThanatosDecryptor.pdf"
    ],
    "report_names": [
        "2018-06-26 - Files Cannot Be Decrypted- Challenge Accepted. Talos Releases ThanatosDecryptor.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536007,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1653688679,
    "ts_modification_date": 1653688679,
    "files": {
        "pdf": "https://archive.orkl.eu/41b6297c72d73e6976eb17cb3b11bef8de14a7fd.pdf",
        "text": "https://archive.orkl.eu/41b6297c72d73e6976eb17cb3b11bef8de14a7fd.txt",
        "img": "https://archive.orkl.eu/41b6297c72d73e6976eb17cb3b11bef8de14a7fd.jpg"
    }
}