{
    "id": "ef92a62d-33ce-42aa-9f90-3f2504480412",
    "created_at": "2023-01-12T15:08:31.841772Z",
    "updated_at": "2025-03-27T02:05:47.997974Z",
    "deleted_at": null,
    "sha1_hash": "74c492cf00b1ce6a4b6b8632eeee43f9fbf98e01",
    "title": "2019-06-03 - Report- No ‘Eternal Blue’ Exploit Found in Baltimore City Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:03Z",
    "file_modification_date": "2022-05-28T04:10:03Z",
    "file_size": 259406,
    "plain_text": "# Report: No ‘Eternal Blue’ Exploit Found in Baltimore City Ransomware\n\n**[krebsonsecurity.com/2019/06/report-no-eternal-blue-exploit-found-in-baltimore-city-ransomware/](https://krebsonsecurity.com/2019/06/report-no-eternal-blue-exploit-found-in-baltimore-city-ransomware/)**\n\nFor almost the past month, key computer systems serving the government of Baltimore, Md.\nhave been held hostage by a ransomware strain known as “Robbinhood.” Media\npublications have cited sources saying the Robbinhood version that hit Baltimore city\ncomputers was powered by “Eternal Blue,” a hacking tool developed by the U.S. National\n**Security Agency (NSA) and leaked online in 2017. But new analysis suggests that while**\nEternal Blue could have been used to spread the infection, the Robbinhood malware itself\ncontains no traces of it.\n\nOn May 25, The New York Times [cited unnamed security experts briefed on the attack who](https://www.nytimes.com/2019/05/25/us/nsa-hacking-tool-baltimore.html?module=inline)\nblamed the ransomware’s spread on the Eternal Blue exploit, which was linked to the global\n[WannaCry ransomware outbreak in May 2017.](https://en.wikipedia.org/wiki/WannaCry_ransomware_attack)\n\nThat story prompted [a denial from the NSA that Eternal Blue was somehow used in the](https://www.nytimes.com/2019/05/31/us/nsa-baltimore-ransomware.html)\nBaltimore attack. It also moved Baltimore City Council President Brandon Scott to write the\n[Maryland governor asking for federal disaster assistance and reimbursement as a result.](https://cdn.arstechnica.net/wp-content/uploads/2019/05/baltimore-disaster-640x844.jpeg)\n\nBut according to Joe Stewart, a seasoned malware analyst now consulting with security firm\n[Armor, the malicious software used in the Baltimore attack does not contain any Eternal Blue](https://www.armor.com/)\nexploit code. Stewart said he obtained a sample of the malware that he was able to confirm\nwas connected to the Baltimore incident.\n\n“We took a look at it and found a pretty vanilla ransomware binary,” Stewart said. “It doesn’t\neven have any means of spreading across networks on its own.”\n\nStewart said while it’s still possible that the Eternal Blue exploit was somehow used to\npropagate the Robbinhood ransomware, it’s not terribly likely. Stewart said in a typical breach\nthat leads to a ransomware outbreak, the intruders will attempt to leverage a single infection\nand use it as a jumping-off point to compromise critical systems on the breached network\nthat would allow the malware to be installed on a large number of systems simultaneously.\n\n“It certainly wouldn’t be the go-to exploit if your objective was to identify critical systems and\nthen only when you’re ready launch the attack so you can do it all at once,” Stewart said. “At\nthis point, Eternal Blue is probably going to be detected by internal [security] systems, or the\ntarget might already be patched for it.”\n\nIt is not known who is behind the Baltimore ransomware attack, but Armor said it was\nconfident that the bad actor(s) in this case were the same individual(s) using the nowsuspended twitter account @Robihkjn (Robbinhood). Until it was suspended at around 3:00\n\n\n-----\n\np.m. ET today (June 3), the @Robihkjn account had been taunting the mayor of Baltimore\n[and city council members, who have refused to pay the ransom demand of 13 bitcoin —](https://www.baltimoresun.com/news/maryland/politics/bs-md-ci-it-outage-20190507-story.html)\napproximately $100,000.\n\nIn several of those tweets, the Twitter account could be seen posting links to documents\nallegedly stolen from Baltimore city government systems, ostensibly to both prove that those\nbehind the Twitter account were responsible for the attack, and possibly to suggest what may\nhappen to more of those documents if the city refuses to pay up by the payment deadline set\nby the extortionists — currently June 7, 2019 (the attackers postponed that deadline once\nalready).\n\nSome of @robihkjn’s tweets taunting Baltimore city leaders over non-payment of the $100,000\nransomware demand. The tweets included links to images of documents allegedly stolen by the\n\nintruders.\n\nOver the past few days, however, the tweets from @Robinhkjn have grown more frequent\nand profanity-laced, directed at Baltimore’s leaders. The account also began tagging dozens\nof reporters and news organizations on Twitter.\n\n\n-----\n\nStewart said the @Robinhkjn Twitter account may be part of an ongoing campaign by the\nattackers to promote their own Robbinhood ransomware-as-a-service offering. According to\nArmor’s analysis, Robbinhood comes with multiple HTML templates that can be used to\nsubstitute different variables of the ransom demand, such as the ransom amount and the\n.onion address that victims can use to negotiate with the extortionists or pay a ransom\ndemand.\n\n“We’ve come to the conclusion Robbinhood was set up to be a multi-tenant ransomware-asa-service offering,” Stewart said. “And we’re wondering if maybe this is all an effort to raise\nthe name recognition of the malware so the authors can then go on the Dark Web and\nadvertise it.”\n\nThis redacted message is present on the Dark Web panel set up by the extortionists to accept\n\npayment for the Baltimore ransomware incident and to field inquiries or pleas from them. The\nmessage repeats the last tweet from the @robihkjn Twitter account and conclusively ties that account\n\nto the attackers. Image: Armor.\n\nThere was one other potential — albeit likely intentional — clue that Stewart said he found in\nhis analysis of the malware: Its code included the text string “Valery.” While this detail by\nitself is not particularly interesting, Stewart said an earlier version of the GandCrab\n[ransomware strain would place a photo of a Russian man named Valery Sinyaev in every](https://www.linkedin.com/in/val-valery-sinyaev-235b3919/)\nexisting folder where it would encrypt files. PCRisk.com, the company that blogged about\nthis connection to the GandCrab variant, asserts Mr. Sinyaev is a respectable finance\nprofessional who has nothing to do with GandCrab.\n\nThe timing of the GandCrab connection is notable because just last week, the creators of\n[GandCrab announced they were shutting down their ransomware-as-a-service product,](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/)\nallegedly after earning more than $2 billion in ransom payments.\n\n\n-----\n\nFinally, since we re on the subject of major ransomware attacks and scary exploits, it s a\ngood time to remind readers about the importance of applying the latest security updates\nfrom Microsoft, which last month took the unusual step of releasing security updates for\nunsupported but still widely-used Windows operating systems like XP and Windows\n**2003. Microsoft did this to head off another WannaCry-like outbreak from mass-exploitation**\n[of a newly discovered flaw that Redmond called imminently “wormable.”](https://krebsonsecurity.com/2019/05/microsoft-patches-wormable-flaw-in-windows-xp-7-and-windows-2003/)\n\nThat vulnerability exists in Windows XP, Windows 2003, Windows 7, Windows Server 2008\nR2, and Windows Server 2008. In a reminder about the urgency of patching this bug,\n[Microsoft on May 30 published a post saying while it hasn’t seen any widespread exploitation](https://blogs.technet.microsoft.com/msrc/2019/05/30/a-reminder-to-update-your-systems-to-prevent-a-worm/)\nof the flaw yet, it took about two months after Microsoft released a fix for the Eternal Blue\nexploit in March 2017 for WannaCry to surface.\n\n“Almost two months passed between the release of fixes for the EternalBlue vulnerability and\nwhen ransomware attacks began,” Microsoft warned. “Despite having nearly 60 days to\npatch their systems, many customers had not. A significant number of these customers were\ninfected by the ransomware.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-03 - Report- No ‘Eternal Blue’ Exploit Found in Baltimore City Ransomware.pdf"
    ],
    "report_names": [
        "2019-06-03 - Report- No ‘Eternal Blue’ Exploit Found in Baltimore City Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536111,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653711003,
    "ts_modification_date": 1653711003,
    "files": {
        "pdf": "https://archive.orkl.eu/74c492cf00b1ce6a4b6b8632eeee43f9fbf98e01.pdf",
        "text": "https://archive.orkl.eu/74c492cf00b1ce6a4b6b8632eeee43f9fbf98e01.txt",
        "img": "https://archive.orkl.eu/74c492cf00b1ce6a4b6b8632eeee43f9fbf98e01.jpg"
    }
}