{
    "id": "ef9a435a-d085-4cb5-b498-396d20417673",
    "created_at": "2023-01-12T15:01:41.857051Z",
    "updated_at": "2025-03-27T02:09:06.101008Z",
    "deleted_at": null,
    "sha1_hash": "bfea9a4904892ecc843af98286f0a1f7aee87436",
    "title": "2016-04-14 - Targeted Ransomware Activity",
    "authors": "",
    "file_creation_date": "2022-05-28T19:28:39Z",
    "file_modification_date": "2022-05-28T19:28:39Z",
    "file_size": 350128,
    "plain_text": "# Targeted Ransomware Activity\n\n**anomali.com/blog/targeted-ransomware-activity**\n\nResearch, Threat Intelligence Platform | April 14, 2016\n\nby Aaron Shelmire\n\n## Overview\n\nSince late 2013 there has been a growing trend of Ransomware activity. In these attacks\nactors encrypt files on hard drives, and request that a ransom be paid in order to decrypt\nthe files. Many of these attacks have focused on client side vulnerabilities using phishing\nmessages as a delivery vector. Since December 2015 there have been new ransomware\nintrusions that have been relying upon server side compromises. These compromises are\nused to deliver the SamSam ransomware family. As of the end of April 2016, the SamSam\nactivity has targeted a minimum of 58 organizations including those in the HealthCare\nindustry.\n\n## SamSam Activity\n\nThe samples related to the SamSam family are composed of 4 major samples. These are:\n\nSamSam - The name given to the original ransomware by the author\n\n\n-----\n\nMIKOPONI - A second major variation of SamSam. Much of the code base has\nevolved from SamSam, and the ransomware now directs users to a Tor site for\npayment.\nDelFileType - A tool used to delete files on the host. Original samples included the\nSysInternals sdel tool to delete the encrypted files from a host.\nSamDdec - The tool used to decrypt files after the ransom has been paid.\n\n\n-----\n\n```\nFigure 1: Timeline of SamSam Activity\nThe SamSam actors currently rely upon web pages on Tor hidden services for\ninteracting with the victim organization. The actors ask that the victim pay the\nransom using Bitcoin. The SamSam activity appears to have started around 9 December\n2015 as is displayed in the Timeline in Figure 1. This is based upon the compilation\ntime of a SamSam sample which includes a debug database path with “Test” in the\npath. The actor continued to label the PDB path for each sample with an incremental\nsample number until sample number 54, which has a compilation date of 18 February\n2016. Up until this point the victims were sent to Wordpress sites for ransom\ninstructions. The actor then began using Tor for the ransom sites, such as the one\nin Figure 2 below, as early as 23 February 2016. The actors began calling the\nransomware MIKOPONI as early as 01 March 2016.\n\n```\n\n-----\n\n```\n g g\nThe SamSam actors appear to be storing the source code on a removable drive. This conclusion is based\nupon the PDB strings found within the compiled malware. Some examples of the PDB strings found within\nSamSam executables include:\n\n```\n\n-----\n\n```\nf:SAMclients estencSAMobjReleasesamsam.pdb\ni:SAMServersSam-onion-no-check-lock-file-enc-all-extSAMobjReleaseMIKOPONI.pdb\nl:SAMServersSam-onion - CopySAMobjReleaseMIKOPONI.pdb\nu:SAMServersSam-onion-no-check-lock-file-enc-all-extSAMobjReleaseMIKOPONI.pdb\nx:SAMServersSam-onionSAMobjReleaseMIKOPONI.pdb\nThese drive letters are atypical of standard Windows drive letter assignments. Usually the Windows operating system will assign the\nnext available drive letter to a newly attached removable drive. If your computer only has a fixed drive with the C drive letter\nassigned, then the removable drive would be assigned the letter D. While the drive letter changes, the directory structure remains\nthe same, which may be evidence of a removable drive. The drive letters D and F are more typical, but the other drive letters found\nin the PDB strings are odd.\nThe use of atypical drive letters could be caused by mounting an encrypted TrueCrypt container. In the TrueCrypt client the user is\nable to select a drive letter for mounting.\nFigure 3: SamSam Day of Week Histogram\nBased upon sample compilation times the SamSam actors appear to operate most frequently between 1700 and 0100 UTC, with samples compiled as early as 1000 UTC. If\nthese compilation dates are accurate, this could mean that the actors are located in a Western nation, most likely within UTC+0200 to UTC-0400. The actors also\nappear to be most active within the work week on Fridays, with some activity on Saturdays.\nRecent C0d0s0 / Peace Activity\nThe C0d0s0 a/k/a Peace actors have a long history of intrusion activity that has been related to them. This activity stretches back at least to October 2010 when the\nNobel Peace Prize site was used to distribute their tools via a strategic web compromise leveraging a 0-day vulnerability in Firefox.\nSince at least November 2015 the group has been utilizing JBOSS server vulnerabilities in order to gain access to target networks. This activity was described by\nPalo Alto Networks. Additional C0d0s0 activity is described by Proofpoint.\nThe C0d0s0 actors install a wide range of backdoors including PlugX, new variants of Derusbi, and Bergard. In at least one case, the C0d0s0 actors were operating on\nthe same JBOSS server host where the SamSam tool was deployed. There have been some claims in the media that the SamSam activity is the work of the C0d0s0 group. At\nthis point Anomali Labs has not been able to directly connect this activity. While both the SamSam activity and C0d0s0 activity have recently used JBOSS\nvulnerabilities, the different sets of activity appear to leverage different operating times. These times are almost complementary.\nThe presence of the two sets of tools on one host and the shared targeting of JBOSS could be coincidence. Evidence that shows a direct instance of a shared session\nof activity where actors interact with the C0d0s0 related artifacts AND SamSam related artifacts would contradict this. No such evidence has been presented.\nCompeting Hypothesis\nThere are a handful of additional hypothesis to explain a relationship between the C0d0s0 and SamSam activity.\n\n```\n\n-----\n\nThe SamSam activity could be from a 2nd group that receives access to compromised\nhosts from the C0d0s0 actors after the C0d0s0 actors have gained a foothold.\n```\nFigure 4: SamSam Compile Time Wheel\n\n```\nThe SamSam activity could be activity from the C0d0s0 actors outside of their normal\nwork duties. This theory is possible. The two sets of activity are nearly complimentary.\nThe C0d0s0 activity mostly occurrs during 0300 - 1000 hours UTC, with less activity\nduring 1200-1600 hours, and a few off hour samples. This activity is more easily\naligned to time zones on the Asian continent, including China Standard Time (+0800).\n\n\n-----\n\n```\nFigure 5: C0d0s0 Compile Time Wheel\nThe SamSam activity mostly occurs from 1500-0100 hours. There are two samples (out\nof 49) tied to the C0d0s0 group which fit the SamSam time profile. There are also 3\nSamSam-related samples (out of 36) that fit the later portion of the C0d0s0\nactivity. If the SamSam activity is perpetrated by actors in China, they are\noperating in the middle of the night.\nKey Assumptions Check\nThere are two key assumptions underpinning this analysis that put the conclusion at\nrisk:\n\n```\nWe assume the compilation time of the samples has not been modified\nWe assume the hosts that the samples have been compiled on have accurate\nDate/Time settings.\n\nAnother key assumption is that the C0d0s0 samples have been correctly attributed to one\nactor group. Similarly that the SamSam samples are correctly attributed to one actor group.\nWe believe these two assumptions are less of a risk to the conclusions.\n\nFinally, the C0d0s0 activity used as part of this analysis is absolutely a minor subset of the\nactors activity. It is possible that this sampling of activity is biased, and a full set of activity\nwould result in different conclusions.\n\n[Free White Paper](https://cta-service-cms2.hubspot.com/ctas/v2/public/cs/c/?cta_guid=3f378abe-6680-4ed3-9173-e5958a1c8fad&placement_guid=ff5685c6-716a-440e-9035-fc0328826466&portal_id=458120&redirect_url=APefjpFDpmcZ92i64VMd6EHFur4Fq1LoBkjBWoj1Q8Moc_yY032T2HCJ9fmt_hDA0bENtTfJcL92pMhFgRWruGwVxQtPUQ4ynQ8qKJXwy2AqBmN6ZFsFKHVC7KGAPlpEN7B7jWvRNEmbYBES7RB2N_QhZzsGhtEvxu17-QrDBttZDGIU5vkTB6ETjj0g01Ibss9jP6UpmPSPG7rxR8JHcpqHbQlQnyaw4HlJClDXbEh-mEaz0N751ssWNjX9HA-NW-9qvQbqPirU5Bv9FudtWV_QXvKqcbjFSXZUX-Pd9iPy73OpY2DzXzUO0Yp2z7j77WfRQfiu6gjIghw6jQDOohJ78xiGT8GCKw&hsutk=2767d93d6471d657e0c9f660e4b58ef8&utm_referrer=https%3A%2F%2Fblog.anomali.com%2Ftargeted-ransomware-activity&canon=https%3A%2F%2Fblog.anomali.com%2Ftargeted-ransomware-activity&pageId=4087285338&__hstc=41179005.2767d93d6471d657e0c9f660e4b58ef8.1456736058655.1478831861868.1478887113345.180&__hssc=41179005.53.1478887113345&__hsfp=1335165674)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-04-14 - Targeted Ransomware Activity.pdf"
    ],
    "report_names": [
        "2016-04-14 - Targeted Ransomware Activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535701,
    "ts_updated_at": 1743041346,
    "ts_creation_date": 1653766119,
    "ts_modification_date": 1653766119,
    "files": {
        "pdf": "https://archive.orkl.eu/bfea9a4904892ecc843af98286f0a1f7aee87436.pdf",
        "text": "https://archive.orkl.eu/bfea9a4904892ecc843af98286f0a1f7aee87436.txt",
        "img": "https://archive.orkl.eu/bfea9a4904892ecc843af98286f0a1f7aee87436.jpg"
    }
}