{
    "id": "efd6a438-56d2-4905-897b-0eb541fc97a9",
    "created_at": "2023-01-12T15:04:37.691019Z",
    "updated_at": "2025-03-27T02:05:57.038372Z",
    "deleted_at": null,
    "sha1_hash": "c257f8240427976e094c08544642837935d09783",
    "title": "2021-01-28 - Emotet Botnet Takedown",
    "authors": "",
    "file_creation_date": "2022-05-28T04:52:51Z",
    "file_modification_date": "2022-05-28T04:52:51Z",
    "file_size": 277720,
    "plain_text": "# Emotet Botnet Takedown\n\n**[hornetsecurity.com/en/threat-research/emotet-botnet-takedown/](https://www.hornetsecurity.com/en/threat-research/emotet-botnet-takedown/)**\n\nSecurity Lab January 28, 2021\n\n## Summary\n\nOn 2021-01-27 it was announced by Europol that an international worldwide coordinated law\nenforcement and judicial action has disrupted the Emotet botnet and investigators have\ntaken control of Emotet’s infrastructure. If successful this could mean the end of Emotet, its\nbotnet, malspam, and malware loader operation. While the situation is still developing, we\ncan confirm that the Emotet botnet infrastructure is disrupted. Victims will be notified by\nresponsible country CERTs and should take appropriate actions to clean their Emotet\nmalware and secondary malware infections to prevent still active malware that was\ndownloaded by Emotet to deploy ransomware.\n\n## Background\n\nEmotet (also known as Heodo) was first observed in 2014. It was a banking trojan stealing\nbanking details and banking login credentials from victims. But it pivoted to a malware-as-aservice (MaaS) operation providing malware distribution services to other cybercriminals.\nToday, Emotet is probably the most prolific malware distribution operation. To this end, it\n\n\n-----\n\nsteals the emails of its victims and replies to the victim s previous conversations. This is\nknown as email conversation thread hijacking .5 Hornetsecurity has written numerous\nblogposts about Emotet2,3,4,5.\n\n## What happened?\n\nAn international worldwide law enforcement and judicial effort, coordinated by Europol and\nEurojust, has disrupted the Emotet botnet. The following authorities took part in this\noperation:\n\nNetherlands: National Police (Politie), National Public Prosecution Office (Landelijk\nParket)\nGermany: Federal Criminal Police (Bundeskriminalamt), General Public Prosecutor’s\nOffice Frankfurt/Main (Generalstaatsanwaltschaft)\nFrance: National Police (Police Nationale), Judicial Court of Paris (Tribunal Judiciaire\nde Paris)\nLithuania: Lithuanian Criminal Police Bureau (Lietuvos kriminalinės policijos biuras),\nProsecutor’s General’s Office of Lithuania\nCanada: Royal Canadian Mounted Police\nUnited States: Federal Bureau of Investigation, U.S. Department of Justice, US\nAttorney’s Office for the Middle District of North Carolina\nUnited Kingdom: National Crime Agency, Crown Prosecution Service\nUkraine: National Police of Ukraine (Національна поліція України), of the Prosecutor\nGeneral’s Office (Офіс Генерального прокурора).\n\nThe investigators obtained control over the infrastructure from one suspect located in\nUkraine. Emotet’s C2 communication has been sinkholed and information of connecting\nvictims has been given to the responsible country CERTs, which will notify the victims so they\ncan clean up the infection.\n\nThe Dutch National Police has also obtained a database containing e-mail addresses,\nusernames and passwords stolen by Emotet over the years. They provide a website to check\n[whether an email address has been compromised at http://www.politie.nl/emocheck.](http://www.politie.nl/emocheck)\n\n### Emotet “uninstaller”\n\nAdditionally, German Federal Criminal Police (Bundeskriminalamt (BKA)) is distributing a\nEmotet remover program from within the Emotet botnet that will uninstall Emotet on 202104-25 at 12:00.\n\nThe program will create a timestamp for 2021-04-25 12:00 (note `tm_month goes from 0 to`\n11, while `tm_day goes from 1 to 31).`\n\n\n-----\n\nThe program will spawn a thread that in a loop will sleep for 1000 minutes (16.6 hours) until\nthe time to uninstall Emotet is reached.\n\n\n-----\n\nOnce the time to uninstall Emotet is reached Emotet s registry key and its service are\nremoved. The Emotet binary is moved to a temporary file path presumably to quarantine it\nfor possible DFIR investigations on the infected system.\n\nThe likely reason why Emotet isn’t removed immediately is to allow affected parties to run\nDFIR investigations to discover potentially secondary malware that was deployed via Emotet.\n\nFrom our understanding the sinkholing and “uninstallation” actions are performed under the\nauspices of the German Federal Criminal Police (Bundeskriminalamt (BKA)), hence, the\nsinkhole IP addresses are owned by German ISP Deutsche Telekom.\n\n## What will happen next?\n\nWhile our mail filters are still detecting sporadic emails containing malicious Emotet\ndocuments, these are likely emails that had still been lurking in queues either of the Emotet\nspambots or email systems and are just now being delivered even though the Emotet botnet\n\n\n-----\n\ninfrastructure has been disrupted.\n\nWe expect that these last drips of Emotet malspam dripping out of the dying Emotet botnet to\ndry out over the next days and weeks and if the takedown is successful stop entirely.\n\nWhile there is always a chance that a botnet can regroup after a disruption (see TrickBot),\nthis, however, seems unlikely in this case as not just the Tier 1 C2 proxy servers have been\ndisrupted (as was the case with the disruption of the TrickBot botnet), but – from our\ninformation – also the Tier 2 C2 server, i.e., the real C2 server, to which the Tier 1 C2 proxy\nservers only relayed the traffic to, have been disruption as well.\n\n## Who will fill the void?\n\nEmotet constituted around 20% of the malicious email traffic processed by Hornetsecurity. It\ndistributed malware by other threat actors. While a successful takedown will mean no more\nEmotet malspam, it likely won’t mean a decrease in malspam, as other threat actors will try\nto fill the void and take over the existing customer base of Emotet’s malware-as-a-service\n(MaaS) operation.\n\n\n-----\n\nOne strong contender to fill the void generated by Emotet s disruption is QakBot . Last year\nQakBot added email conversation thread hijacking5 to its arsenal, i.e., like Emotet it steals\nemails from victims and crafts no tailored malspam by replying to existing email conversation\nthreads. QakBot has also been observed loading other malware, such as ZLoader. 8 In\naddition to that, QakBot’s XLM macro based malicious documents7 often have a lower\ndetection rate then Emotet’s VBA macro base malicious documents. Thus, fulfilling all\nrequirements a criminal would have towards an Emotet replacement.\n\n## Conclusion and Countermeasures\n\nWe congratulate all participating parties and hope for a successful longterm takedown of\nEmotet.\n\n\nWhile Emotet itself may be inoperable, other threats Emotet has previously loaded such as\nTrickBot,6 QakBot,7 or Zloader8 remain active and could still deploy ransomware such as\nRyuk and Egregor. If the authorities inform you of an Emotet infection you must also clean up\nthese possible secondary infects to mitigate the complete threat.\n\nIn case the Emotet botnet can recover, Hornetsecurity’s [Spam Filter Service and Malware](https://www.hornetsecurity.com/en/services/spam-filter/)\nProtection, with the highest detection rates on the market, will again, as before the\ndisruption, detect and quarantine malicious Emotet documents.\n\n## References\n\n1 https://www.hornetsecurity.com/en/security-information/email-conversation-thread\nhijacking/\n\n\n2 https://www.hornetsecurity.com/en/security-information/awaiting-the-inevitable-return\nof-emotet/\n\n3 [https://www.hornetsecurity.com/en/security-information/emotet-is-back/](https://www.hornetsecurity.com/en/security-information/emotet-is-back/)\n\n4 [https://www.hornetsecurity.com/en/security-information/webshells-powering-emotet/](https://www.hornetsecurity.com/en/security-information/webshells-powering-emotet/)\n\n5 https://www.hornetsecurity.com/en/security-information/emotet-update-increases\ndownloads/\n\n\n6 https://www.hornetsecurity.com/en/security-information/trickbot-malspam-leveraging\nblack-lives-matter-as-lure/\n\n7 https://www.hornetsecurity.com/en/security-information/qakbot-malspam-leading-to\nprolock/\n\n\n8 [https://malpedia.caad.fkie.fraunhofer.de/details/win.zloader](https://malpedia.caad.fkie.fraunhofer.de/details/win.zloader)\n\n9 [https://www.hornetsecurity.com/en/threat-research/qakbot-distributed-by-xlsb-files/](https://www.hornetsecurity.com/en/threat-research/qakbot-distributed-by-xlsb-files/)\n\n10 https://www.hornetsecurity.com/en/threat-research/qakbot-reducing-its-on-disk\nartifacts/\n\n\n11 https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most\ndangerous-malware-emotet-disrupted-through-global-action\n\n\n-----\n\n## Indicators of Compromise (IOCs)\n\n### IPs\n\n**These are the IPs used by the German Federal Criminal Police (Bundeskriminalamt**\n**(BKA)) to sinkhole Emotet.**\n```\n   80.158.3.161:443\n   80.158.51.209:8080\n   80.158.35.51:80\n   80.158.63.78:443\n   80.158.53.167:80\n   80.158.62.194:443\n   80.158.59.174.8080\n   80.158.43.136:80\n\n### Hashes\n\n```\n**This is the hash of the program distributed by the German Federal Criminal Police**\n**(Bundeskriminalamt (BKA)) to remove Emotet on 2021-04-25 at 12:00.**\n\n**MD5** **Description**\n\n`9a062ead5b2d55af0a5a4b39c5b5eadc` Emotet “uninstaller”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-28 - Emotet Botnet Takedown.pdf"
    ],
    "report_names": [
        "2021-01-28 - Emotet Botnet Takedown.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535877,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1653713571,
    "ts_modification_date": 1653713571,
    "files": {
        "pdf": "https://archive.orkl.eu/c257f8240427976e094c08544642837935d09783.pdf",
        "text": "https://archive.orkl.eu/c257f8240427976e094c08544642837935d09783.txt",
        "img": "https://archive.orkl.eu/c257f8240427976e094c08544642837935d09783.jpg"
    }
}