{
    "id": "efdeaa0e-606b-4736-a32b-c8f85c1bfef2",
    "created_at": "2023-01-12T15:05:50.309705Z",
    "updated_at": "2025-03-27T02:16:37.099688Z",
    "deleted_at": null,
    "sha1_hash": "82d24619b396f39a6fa44464c62ebc713813dd08",
    "title": "2022-03-10 - WEDNESDAY, MARCH 9, 2022 Threat advisory- Cybercriminals compromise users with malware disguised as pro-Ukraine cyber tools",
    "authors": "",
    "file_creation_date": "2022-05-28T16:53:16Z",
    "file_modification_date": "2022-05-28T16:53:16Z",
    "file_size": 1787606,
    "plain_text": "# Threat advisory: Cybercriminals compromise users with malware disguised as pro-Ukraine cyber tools\n\n**[blog.talosintelligence.com/2022/03/threat-advisory-cybercriminals.html](https://blog.talosintelligence.com/2022/03/threat-advisory-cybercriminals.html)**\n\n**This post is also available in:**\n\n[Українська (Ukrainian)](https://talosintelligence.com/resources/429)\n\nUpdate March 17, 2022: Cisco Talos has updated the IOC section with additional hashes and\nClamAV coverage.\n\n## Executive summary\n\nOpportunistic cybercriminals are attempting to exploit Ukrainian sympathizers by\noffering malware purporting to be offensive cyber tools to target Russian entities. Once\ndownloaded, these files infect unwitting users rather than delivering the tools originally\nadvertised.\nIn one such instance, we observed a threat actor offering a distributed denial-of-service\n(DDoS) tool on Telegram intended to be used against Russian websites. The\ndownloaded file is actually an information stealer that infects the unwitting victim with\nmalware designed to dump credentials and cryptocurrency-related information.\n\n\n-----\n\nThese observations serve as reminders that users must be on heightened alert to\nincreased cyber threat activity as threat actors look for new ways to incorporate the\nRussia-Ukraine conflict into their operations.\nSuch activity could take the form of themed email lures on news topics or donation\nsolicitations, malicious links purporting to host relief funds or refugee support sites,\nmalware masquerading as defensive or offensive security tools, and more. We remind\nusers to carefully inspect suspicious emails before opening them and validating\nsoftware or other files before downloading them.\n\n## Campaign details\n\nThe ongoing situation in Ukraine has quickly changed the cyber threat landscape,\nintroducing an influx of actors of varying skill and a variety of new threats to Cisco customers\nand users globally. Many of these changes have been brought about by the rise in attacks\n[being outsourced to sympathetic people on the internet, which brings about its own unique](https://twitter.com/FedorovMykhailo/status/1497642156076511233)\n[challenges and threats that Cisco Talos outlined in a recent blog.](https://blog.talosintelligence.com/2022/03/ukraine-update.html)\n\nIn one of these new developments, we are seeing cybercriminals take advantage of the\nconflict by exploiting unwitting users seeking tools to carry out their own cyber attacks\nagainst Russian entities. A variety of these tools are advertised as ways to target Russian or\npro-Russian websites and have quickly spread on various social media platforms over the\nlast few days as the interest in crowdsourced attacks grows. A simple search for \"Ukraine\" or\n\"Russia\" on some popular open-source platforms returns a wide array of results. Most of the\ntools that have been released thus far are meant to disrupt various state-affiliated targets\nthrough distributed denial-of-service (DDoS) attacks. However, downloading any of these\ntools can be risky. In addition to the obvious potential legal implications of conducting a selfdirected cyber attack, there is no way to know what other hidden features the tool may have\nor if it's going to operate in its advertised fashion.\n\nOne of the main ways we are seeing these types of offerings advertised and distributed is on\nthe Telegram encrypted messaging app, which is extremely popular in eastern Europe and is\nheavily used by both Ukrainians and Russians. We've seen lots of communications from both\nsides, including links to Telegram channels associated with various sympathetic groups, such\nas the [IT Army of Ukraine. During our ongoing monitoring of some of these spaces, we found](https://www.reuters.com/world/europe/ukraine-launches-it-army-takes-aim-russian-cyberspace-2022-02-26/)\nthe message shown below.\n\n\n-----\n\n_Infostealer disguised as a Russian attack tool on Telegram._\n\nThere is a tool called \"Liberator\" that is produced by a group called disBalancer that we\nfound relatively quickly. Liberator is advertised as a tool for performing DDoS attacks against\n\"Russian propaganda websites.\" A quick look at disBalancer's website shows that the actor\nuses similar language to the malicious message on Telegram above and promises to target\nRussian sites with the stated goal of helping to \"liberate\" Ukraine. A spelling error can be\nseen in the below graphic from the site, where the group's name is misspelled as\n\"disBalancher.\"\n\n\n-----\n\n_Screenshot from Disbalancer Liberator website._\n\nCisco Talos did some quick analysis of the legitimate Disbalancer Liberator tool shown above\nand didn't find anything overtly malicious. However, it is effectively a DDoS client that, when\nused, launches attacks against a list of targets downloaded from a server, something that is\npotentially illegal. The file offered on the Telegram page ended up being malware, specifically\nan infostealer designed to compromise unwitting users. The malware in this case dumps a\nvariety of credentials and a large amount of cryptocurrency-related information, including\nwallets and metamask information, which is commonly associated with non-fungible tokens\n(NFTs).\n\n\n-----\n\nThis is an example of one of the many ways opportunistic cybercriminals are attempting to\ntake advantage of the Russian invasion by exploiting sympathizers on both sides of the\nconflict. Such activity could take the form of themed email lures on news topics or donation\nsolicitations, malicious links purporting to host relief funds or refugee support sites, malware\nmasquerading as security defensive or offensive tools, and more. Users must carefully\ninspect suspicious emails before opening them and validate software or other files before\ndownloading them.\n\n## Infostealer details\n\nThe campaign is based on a dropper disguised as the Disbalancer.exe tool. This dropper is\nprotected with ASProtect, a known packer for Windows executables. If a researcher tries to\ndebug the malware execution, it will be confronted with a general error. The malware, after\nperforming the anti-debug checks, will launch Regsvcs.exe, which is included along with the\n.NET framework. In this case, the regsvcs.exe is not used as a living off the land binary\n(LoLBin). It is injected with the malicious code, which consists of the Phoenix information\nstealer.\n\nThe actors behind this activity have been distributing infostealers since at least November\n2021. This supports our belief that this is not the work of new actors, but existing actors\ntaking advantage of the war in Ukraine. The ZIP file provided in the Telegram channel\ncontains an executable, which is the infostealer. The infostealer gathers information from a\nvariety of sources, including web browsers like Firefox and Chrome and other locations on\nthe filesystem for key pieces of information. This information is then sent to a remote IP\naddress, in this case, a Russian IP — 95[.]142.46.35 — on port 6666. This particular IP/port\npair has been distributing infostealers since at least November 2021. As shown in the\ndeobfuscated screen capture below, the information, which is sent with a simple base64\nencoding, shows the breadth of information being pulled off of the systems, including a large\nnumber of crypto wallets and MetaMask (a cryptocurrency wallet software) information.\nFollowing the summary, a ZIP file of the stolen data is also uploaded to the server,\ncompleting the compromise.\n\n\n-----\n\n_Sample data exfiltrated by infostealer._\n\nThis is the behavior of modern infostealers. They place increased focus on obtaining\ncryptocurrency information, as this can be quickly stolen and immediately monetized with a\nmuch lower threshold than other types of data that is being stolen, namely credentials\nthemselves.\n\nPivoting on the sample itself has shown that it is being distributed through other means,\nusing other names including peview.exe and ddos-reaper.exe. We also found other malware\nsamples communicating with this command and control (C2) IP address.\n\n\n-----\n\n## Conclusion\n\nCisco Talos constantly observes actors using any and all means to get their malware\ninstalled on systems, and the war in Ukraine is no exception. In this case, we found some\ncybercriminals distributing an infostealer, but it could have just as easily been a more\nsophisticated state-sponsored actor or privateer group doing work on behalf of a nationstate. We remind users to be wary of installing software whose origins are unknown,\nespecially software that is being dropped into random chat rooms on the internet.\n\nCisco Talos expects this type of behavior to continue and diversify. The global interest in the\nconflict creates a massive potential victim pool for threat actors and also contributes to a\ngrowing number of people interested in carrying out their own offensive cyber operations.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\nthreat actors as part of their campaign. You can try Secure Email for free [here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Dcmd-free-trial-request%26utm_term%3Dpgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nsuch as [Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html) [Adaptive Security Appliance and](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html) [Meraki MX can detect](https://meraki.cisco.com/products/appliances)\nmalicious activity associated with this threat.\n\n\n-----\n\n[Cisco Secure Network/Cloud Analytics (Stealthwatch/Stealthwatch Cloud) analyzes network](https://www.cisco.com/c/en/us/products/security/stealthwatch/index.html)\ntraffic automatically and alerts users of potentially unwanted activity on every connected\ndevice.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a\n[free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Dumbrella-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Dautomated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are available\nfrom the [Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are](https://signup.duo.com/?utm_source%3Dtalos%26utm_medium%3Dreferral%26utm_campaign%3Dduo-free-trial)\naccessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n**ClamAV coverage**\n\nWin.Trojan.FakeDisbalancer-9941659-0\n\nWin.Trojan.FakeDisbalancer-9941660-1\n\nWin.Trojan.FakeDisbalancer-9941661-0\n\nWin.Malware.Zusy-9812688-0\n\n## IOCs\n\n**Hashes**\n\n33e5d605c1c13a995d4a2d7cb9dca9facda4c97c1c7b41dc349cc756bfc0bd67\nf297c69795af08fd930a3d181ac78df14d79e30ba8b802666605dbc66dffd994 (Added\n3/10/2022)\n\nAdded 3/12/2022:\n\neca6a8e08b30d190a4956e417f1089bde8987aa4377ca40300eea99794d298d6 (EXE)\n\n\n-----\n\n705380e21e1a27b7302637ae0e94ab37c906056ccbf06468e1d5ad63327123f9 (ZIP)\n\n**IP**\n\n95[.]142.46.35 - Port 6666\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-10 - WEDNESDAY, MARCH 9, 2022 Threat advisory- Cybercriminals compromise users with malware disguised as pro-Ukraine cyber tools.pdf"
    ],
    "report_names": [
        "2022-03-10 - WEDNESDAY, MARCH 9, 2022 Threat advisory- Cybercriminals compromise users with malware disguised as pro-Ukraine cyber tools.pdf"
    ],
    "threat_actors": [
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535950,
    "ts_updated_at": 1743041797,
    "ts_creation_date": 1653756796,
    "ts_modification_date": 1653756796,
    "files": {
        "pdf": "https://archive.orkl.eu/82d24619b396f39a6fa44464c62ebc713813dd08.pdf",
        "text": "https://archive.orkl.eu/82d24619b396f39a6fa44464c62ebc713813dd08.txt",
        "img": "https://archive.orkl.eu/82d24619b396f39a6fa44464c62ebc713813dd08.jpg"
    }
}