{
    "id": "f02d33c5-ea82-4c84-a0d1-a0b5b67ee932",
    "created_at": "2023-01-12T15:01:40.580125Z",
    "updated_at": "2025-03-27T02:14:48.717864Z",
    "deleted_at": null,
    "sha1_hash": "0cdc130b827c7c656e02630fcbdae21fc58e2de8",
    "title": "2014-03-07 - Uroburos – Deeper travel into kernel protection mitigation",
    "authors": "",
    "file_creation_date": "2022-05-27T23:12:54Z",
    "file_modification_date": "2022-05-27T23:12:54Z",
    "file_size": 140285,
    "plain_text": "# Uroburos – Deeper travel into kernel protection mitigation\n\n**[gdatasoftware.com/blog/2014/03/23966-uroburos-deeper-travel-into-kernel-protection-mitigation](https://www.gdatasoftware.com/blog/2014/03/23966-uroburos-deeper-travel-into-kernel-protection-mitigation)**\n\nUroburos was already described as a very sophisticated and highly complex malware in our\nG Data Red Paper, where we had a look at the malware’s behavior. This assumption is again\nsupported, looking at its installation process. Uroburos uses a technique not previously\nknown to the public to bypass Microsoft’s Driver Signature Enforcement, an essential part of\nWindows’ security.\n\nFirst of all, we would like to send regards and thanks to the people being active on the\n[kernelmode.info forum, in particular, R136a1 and EP_X0FF. They provided a proficient](http://www.kernelmode.info/forum/viewtopic.php?f=16&t=3193)\nanalysis of the Driver Signature Enforcement bypass which enriches the overall\nunderstanding of the case.\n\n## Introduction\n\nThe following analysis article is closely linked to G DATA’s Red Paper about Uroburos,\npublished on Friday, February 28th. The paper can be downloaded here: https://secure.gd/dlen-rp-Uroburos\n\nFor fellow researchers, we provide the hash of the sample used for this subsequent article:\n\nSHA256: 33460a8f849550267910b7893f0867afe55a5a24452d538f796d9674e629acc4\n\nThis file is a 64-bit driver, compiled in 2011.\n\n## Kernel Patch Protection\n\n Definition\n\nThe majority of rootkits mainly use kernel modification or kernel patching to hide their\nactivities and modify the behavior of the infected system. To protect the Windows operating\nsystem, Microsoft added a new technology to its 64-bit Windows editions. The Kernel Patch\nProtection technology (aka PatchGuard) checks the integrity of the Windows kernel to make\nsure that no critical parts are modified. In case a harmful modification of the kernel is\ndetected, the KeBugCheckEx() function is executed, called with an argument with the value\n0x109 (CRITICAL_STRUCTURE_CORRUPTION) as bug code. The result is a shutdown of\nthe system with a blue screen.\n\n[Microsoft describes that the Kernel Patch Protection technology prevents the following](http://technet.microsoft.com/en-us/library/cc759759(v=ws.10).aspx)\nmodifications:\n\n-  modify system services tables, for example, by hooking the KeServiceDescriptor table\n\n- modify the Interrupt Descriptor Table (IDT)\n\n\n-----\n\n-  modify the Global Descriptor Table (GDT)\n\n-  use kernel stacks that are not allocated by the kernel\n\n-  patch any part of the kernel\n\n## Uroburos mitigation\n\n[Uroburos’ developers used the same inline hooks, explained in our previous Red Paper, to](https://secure.gd/dl-en-rp-Uroburos)\nbypass Kernel Patch Protection. The attacker’s goal is to hook the KeBugCheckEx() function\nto avoid handling the bug code 0x109.\n\nThe screenshot below shows the code snippet in which the address of KeBugCheckEx() is\nstored in qword_787D8\n\nThe following screenshot shows that Uroburos checks if the bug code equals to 0x109\n\nIn case you wish to get more information concerning the technique used by the developers,\nwe suggest the following link: http://www.codeproject.com/Articles/28318/BypassingPatchGuard\n\n\n-----\n\n## Driver Signature Enforcement\n\n Definition\n\nRootkits are usually drivers which used to work in kernel space. To avoid this kind of\n[malware, Microsoft created a Driver Signing Policy for its 64-bit versions of Windows Vista](http://msdn.microsoft.com/en-us/library/windows/hardware/ff548231(v=vs.85).aspx)\nand later versions. To load a driver, the .sys file must be signed by a legitimate publisher.\n\nDevelopers may disable the Driver Signature Enforcement process during the development\nphase of a driver, which means a developer does not have to sign each compiled driver\nversion during development phase. In this case, the desktop of the machine is changed and\nthe following message appears in the bottom right corner: “Test Mode”. The flag with which\nthe current status of the policy is stored is called g_CiEnabled. The value of g_CiEnabled is\nset during the Windows boot phase, and considered “static\" during runtime. This means,\nWindows assumes the value is set correctly and does not change during runtime.\n\n## Uroburos mitigation\n\nUroburos’ developers used new techniques to disable the Driver Signature Enforcement. In\nour case, they used a vulnerability in a legitimately signed driver to disable the policy! During\nthe installation of Uroburos, the Oracle VirtualBox driver (version 1.6.2) is installed on the\ntargeted system. This driver (VBoxDrv.sys) is signed:\n\n\n-----\n\nUroburos’ developers used new techniques to disable the Driver Signature Enforcement. In\nour case, they used a vulnerability in a legitimately signed driver to disable the policy! During\nthe installation of Uroburos, the Oracle VirtualBox driver (version 1.6.2) is installed on the\ntargeted system. This driver (VBoxDrv.sys) is signed:\n\n## Conclusion\n\nPreviously, we have claimed that Uroburos is a highly complex and very sophisticated\nmalware, programmed by skilled people. This assumption is corroborated once more by the\naforementioned analysis of Uroburos’ installation technique.\n\nThe developers had to deal with Microsoft Windows security enforcement. They had to find\nways to bypass the Kernel Patch Protection technology and also the Driver Signature\nEnforcement. The technique used to bypass the Kernel Patch Protection has been\ndocumented on the Internet and therefore is not absolutely new.\n\nBut, concerning the Driver Signature Enforcement, this is the first time that we see a\nmalware using a vulnerability in a legitimately signed driver to disable the policy!\n\nThis example shows the limitation of the signature process. Generally, the signature\nexpiration date is set to happen several years after its creation date. In case any vulnerability\nis found, a patch is provided, but the old binary is still available and valid, except in case the\n[certificate is revoked by the author/signer and set onto the CRL, the certificate revocation list.](http://support.microsoft.com/kb/289749/en)\n\n\n-----\n\nBut, revoking a signature is only the first step in the protection process, because each and\nevery system that needs to check a signature needs to have access to an up to date CRL.\nAnd even in case the system has an updated CRL, the Uroburos authors are certainly\nthought to be skilled enough to manipulate the verification process the operation system is\nusing without alerting the user.\nSo, it is the first time that we see those two techniques to bypass Windows’ protection\nmechanisms in the wild. We expect that they will be used by more malware in the future, of\ncourse.\n\nIn case someone from the audience notices an infection caused by the Uroburos rootkit and\nneeds help, would like to receive further technical information or would like to contribute any\ninformation about this case, please feel free to contact us by email using the following\nmailbox: intelligence@remove-this.gdata.de\n\n------------------------\n**G Data's Uroburos analysis red paper:**\n[https://secure.gd/dl-en-rp-Uroburos](https://secure.gd/dl-en-rp-Uroburos)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-03-07 - Uroburos – Deeper travel into kernel protection mitigation.pdf"
    ],
    "report_names": [
        "2014-03-07 - Uroburos – Deeper travel into kernel protection mitigation.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535700,
    "ts_updated_at": 1743041688,
    "ts_creation_date": 1653693174,
    "ts_modification_date": 1653693174,
    "files": {
        "pdf": "https://archive.orkl.eu/0cdc130b827c7c656e02630fcbdae21fc58e2de8.pdf",
        "text": "https://archive.orkl.eu/0cdc130b827c7c656e02630fcbdae21fc58e2de8.txt",
        "img": "https://archive.orkl.eu/0cdc130b827c7c656e02630fcbdae21fc58e2de8.jpg"
    }
}