{
    "id": "f06d5e9c-35f5-4888-9a7f-6de5f334d82d",
    "created_at": "2023-01-12T15:05:45.781795Z",
    "updated_at": "2025-03-27T02:17:01.585937Z",
    "deleted_at": null,
    "sha1_hash": "857227a2460f177bce98baf6c9a9061b23a563ec",
    "title": "2021-06-22 - Suspected Pakistani Actor Compromises Indian Power Company with New ReverseRat",
    "authors": "",
    "file_creation_date": "2022-05-28T05:00:34Z",
    "file_modification_date": "2022-05-28T05:00:34Z",
    "file_size": 739051,
    "plain_text": "# Suspected Pakistani Actor Compromises Indian Power Company with New ReverseRat\n\n**[blog.lumen.com/suspected-pakistani-actor-compromises-indian-power-company-with-new-reverserat/](https://blog.lumen.com/suspected-pakistani-actor-compromises-indian-power-company-with-new-reverserat/)**\n\nJune 22, 2021\n\n[Black Lotus Labs Posted On June 22, 2021](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/suspected-pakistani-actor-compromises-indian-power-company-with-new-reverserat/#respond)\n\n## Executive Summary\n\nLumen’s Black Lotus Labs detected a new remote access trojan we’re calling ReverseRat.\nBased on our global telemetry and analysis, we identified that the actor is targeting\ngovernment and energy organizations in the South and Central Asia regions with operational\ninfrastructure hosted in Pakistan. ReverseRat was deployed in parallel with an open-source\nRAT called AllaKore to infect machines and achieve persistence. Given the critical nature of\nthe sectors the actor is targeting, we advise security practitioners to learn the actor’s current\ntactics, tools and procedures to better defend their organizations against potential attacks.\n\n## Introduction\n\n\n-----\n\nThe ReverseRat infection chain is noteworthy because of the steps it takes to avoid\ndetection and the critical nature of the targeted entities. The evasion techniques include:\n\nUse of compromised domains in the same country as the targeted entity to host their\nmalicious files\nHighly targeted victim selection after the initial compromise\nRepurposed open-source code\nIn-memory component used during initial access\nModification of registry keys to covertly maintain persistence on the target device\n\n[Based upon Black Lotus Labs and MalBeacon telemetry, we assess that threat actor is very](https://www.malbeacon.com/)\nlikely operating out of Pakistan. We observed a multi-step infection chain that resulted in the\nvictim downloading two agents; one resided in-memory, while the second was side-loaded,\ngranting threat actor persistence on the infected workstations. The technique documented in\nthe image below was active beginning at least in March 2021 and bi-directional\ncommunications with the C2 are, in some instances, still ongoing.\n\nFigure 1: Multi-step infection process observed in the campaign\n\n## Technical Details\n\n### Component 1: Retrieval of ZIP File from the Compromised Domains\n\nIn the first phase of the infection depicted in Figure 1, targeted URLs pointing to\ncompromised websites were delivered to the victim. Black Lotus Labs surmised that the\nthreat actor chose to use compromised domains in the same country as the targeted\norganization to evade detection and blend in with standard web browsing activity on the\ntarget network. While we cannot independently confirm how the URLs were delivered to the\nvictims, the actor likely sent targeted emails or messages.\n\n\n-----\n\nWhen clicked, these links downloaded a .zip file containing a Microsoft shortcut file (.lnk) and\na benign PDF file. If invoked by the user, the shortcut file would display a benign PDF file, as\ndepicted in Figures 2 and 3. The PDF file acted as a decoy to distract the user while the\nshortcut file also surreptitiously retrieved and executed an HTA file (HTML application) from\nthe same compromised website. In the observed campaigns, the actor-created HTA files\nwere hosted on the same site as the .zip file, but at different URL paths.\n\nThe decoy PDF documents associated with this larger cluster of activity referred to\norganizations and events relevant to India in spring 2021. Some of the decoy documents, or\nlures, were more generic, making references to obtain COVID-19 vaccines, while others\nwere more targeted toward, for example, the energy sector.\n\nFigure 2: Decoy vaccination PDF displayed to a victim\n\nFigure 3: Decoy energy corps PDF displayed to a victim\n\n### Component 2: Activating HTA files: CactusTorch and preBotHta\n\nIn the next phase of infection, the first HTA file retrieved contained JavaScript code based on\n[a GitHub project called CactusTorch. This project was designed to inject a 32-bit shellcode](https://github.com/mdsecactivebreach/CACTUSTORCH/blob/master/CACTUSTORCH.js)\n[into a running process to help launch a .NET program called preBotHta.pdb, which this actor](https://www.seqrite.com/documents/en/white-papers/Seqrite-WhitePaper-Operation-SideCopy.pdf)\nhas been using since 2019. There were two notable features for this 2021 variant of the\npreBotHta file: first it ran entirely in memory and second it contained logic to alter the\n\n\n-----\n\nplacement of the ReverseRat if the host machine ran a certain anti-virus product. If the\npreBotHta file detected a certain AV product, such as Kaspersky, it placed the ReverseRat in\nthe MyMusic path; otherwise, it placed the file in the Startup folder. When ReverseRat was\nsaved to the file system in January 2021, it displayed the name tasksmgr.exe; later in year\nthey renamed it officetool.exe. Both iterations used an internal file description name of\nSvchostt.exe.\n\n**The ReverseRat**\n\nThe last action that preBotHta took is to start execution of ReverseRat. The agent began by\nenumerating the infected device and obtaining the following components via Windows\nManagement Instrumentation (WMI):\n\nMAC address\nPhysical memory on the device converted to Mbs\nInformation about the processor\n\nMax clock speed converted to Ghz\nData width converted to bits\nName (e.g. Intel Core i7-8569U CPU @ 2.80GHz)® ™\nManufacturer (e.g. GenuineIntel)\n\nIt also used the .NET framework to obtain the following:\n\nComputer name\nOperating system\nPublic IP address (by checking http://checkip[.]dyndns[.]org/)\n\nThe agent then RC4-encrypted this data with a key and sent it to the C2 node. When we\ndecompiled the .NET code, we found the agent had prebuilt functions to run any of the\nfollowing commands based upon receiving the correct parameter.\n\n\n-----\n\nImage depicting the prebuilt function to obtain a screenshot of the victim machine\n\nBased upon other functions, like the one designed to download executables, and other\nincluded functions that covert strings to hex, we suspect that there are subsequent modules\nthat could provide added capabilities.\n\nWe assess ReverseRat was developed in-house, artifacts in the samples revealed PDB\npaths that showed the internal name for this project and that a developer for the project used\n[the screenname Zombie. PDB paths often reference the original path for the source code](https://www.fireeye.com/blog/threat-research/2019/08/definitive-dossier-of-devilish-debug-details-part-one-pdb-paths-malware.html)\nfiles on the actor machine. This file was likely imported and compiled by other members of\nthe organization, such as the user Neil as indicated in this metadata.\n\nc:\\Users\\Zombie\\Desktop\\ReverseRat\nclient\\ReverseRat\\ReverseRat\\obj\\Release\\svchostt.pdb\n\nc:\\Users\\Neil\\Desktop\\inform\\c\\ReverseRat\\ReverseRat\\obj\\Debug\\ReverseRat.pdb\n\n\n-----\n\nNotably, the CactusTorch HTA file which dropped ReverseRat included a modification to a\nJavaScript function that shut down the infected machine after up to 7.2 million seconds\n(2,000 hours). Previous iterations of this script only allowed the computer to sleep for\n900,000 seconds (~102 hours). It is unclear what caused the threat actors to change this\ntime setting.\n\n_shell = new ActiveXObject(‘WScript.Shell’);WScript.Sleep(7200000);var exec =_\n_shell.Exec(‘cmd.exe /k shutdown /r /t 0’);exec.StdIn.Close();_\n\n### Component 3: The AllaKore Component\n\nIn the third component, a second HTA file was retrieved from the same compromised domain\nthat hosted the ZIP and the first HTA file. The second HTA file contained an encoded\ncommand to modify a registry key, the loader and AllaKore. Once decoded, the HTA file\n[revealed a version of the AllaKore remote agent, potentially to provide an alternative avenue](https://github.com/OneideLuizSchneider/AllaKore_Remote)\nto maintain access to the compromised network. One rather odd trait of the campaign was\nthe parallel deployment of ReverseRat with AllaKore.\n\nThe actor maintained persistence on the target machine’s current user account after reboot\nthrough modifying the Run registry key to side-load the actor dropped file.\n\nCommand modifying the run registry key:REG ADD\n“HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run” /V “WinLogs” /t REG_SZ /F /D\n“C:\\ProgramData\\WinLogs\\credwiz.exe”\n\nThe threat actor side-loaded DUser.dll along with the legitimate Windows application\ncredwiz.exe, a file that is traditionally used for backing up and restoring credentials. DUser.dll\nacted as a loader to spawn the CreateProcess function on its file, winidr.exe [note the typo in\nthe filename], and ran a wait loop until the AllaKore sample was terminated.\n\n\n-----\n\nScreenshot of the DUser.dll loader creating a process and calling winidr.exe\n\nFortunately for defenders, this agent does not appear to come with any encryption, and it can\nbe detected through network-based monitoring. When we ran the sample in a sandbox, we\nobserved some of the strings in HTTP communications such as “MAINSOCKET”.\n\nStrings from AllaKore being transmitted in the clear via HTTP\n\n### Connections to Prior Reporting and Different Agents\n\n\n-----\n\nOnce we identified the infection chain detailed above, we correlated this campaign s TTPs to\n[a prior campaign from last year called Operation SideCopy. We observed the same infection](https://www.seqrite.com/documents/en/white-papers/Seqrite-WhitePaper-Operation-SideCopy.pdf)\nprocess — using shortcut files to retrieve a malicious HTA file on a compromised domain and\nthen spawn a .NET agent. In this case we also observed overlapping metadata between the\nnew and old samples. Notably, we even found overlap with TTPs described in a post dating\n[back to 2019 that described a threat actor side-loading an AllaKore agent with credwiz.exe.](https://sebdraven.medium.com/copy-cat-of-apt-sidewinder-1893059ca68d)\nBecause this actor has operated for years tailoring open-source frameworks, we observe\nnuances in their environments such as the PDB string that linked other customized open[source capabilities including the Bladabindi agent (based on the well-known trojan njRAT).](https://attack.mitre.org/software/S0385/)\nYou can see below the similarity in the two extracted PDB paths below. The top line is the\nReverseRat agent internally called Svchostt, and the second is the njRAT sample internally\ncalled server:\n\nC:\\Users\\be\\AppData\\Local\\Temporary Projects\\svchostt\\obj\\x86\\Release\\svchostt.pdb\n\nC:\\Users\\be\\AppData\\Local\\Temporary Projects\\server\\obj\\x86\\Release\\server.pdb\n\nWhile njRAT is a well-known and documented agent, it shows that this threat actor, like many\nothers, may prefer to use publicly available agents over custom builds.\n\n### Black Lotus Labs Telemetry and Analytics\n\n**Telemetry – Victim**\n\nOnce we curated a list of indicators associated with this threat actor, we ran those and other\nindictors from previous reporting through our internal databases. Black Lotus Labs’ global\nvisibility suggests that the campaigns associated with this threat actor were quite targeted. A\nsmall number of entities exhibited bi-directional communications with the identified nodes.\n\nMost of the organizations that exhibited signs of compromise were in India, and a small\nnumber were in Afghanistan. The potentially compromised victims aligned with the\ngovernment and power utility verticals. One point we would like to emphasize is that the\nagents we discovered were designed for Windows-based machines traditionally found on the\nIT network; thus far we have not been able to associate any malware samples with this\nactivity cluster that were specifically designed to target systems associated with OT systems.\n\nSome of the victims include:\n\nA foreign government organization\nA power transmission organization\nA power generation and transmission organization\n\nWe do not believe that this list entails the totality of their operations, as some potential\nvictims were associated with dynamic IP addresses, making it difficult to correlate those IP\naddresses to a single organization.\n\n\n-----\n\n**Telemetry – Threat Actor**\n\nBoth Black Lotus Labs and MalBeacon were able to independently conclude the actor’s C2\noperations are based out of Pakistan. MalBeacon identified the actor source IP,\n103.255.7[.]33, an IP assigned to Pakistani mobile data operator CMPak Limited.\n\nSeparately, based on Black Lotus Labs analytics and global visibility, we determined that the\nReverseRat C2 nodes are controlled by at least two Pakistani IPs: 203.175.72[.]105 and\n115.186.189[.]6 on port 8088. Notably, 182.188.181[.]224 briefly serves as a backend node\nfor this operation located at 167.86.97[.]221.\n\nBackends and source range IPs:\n\n203.175.72[.]105\n115.186.189[.]6\n103.255.7[.]33\n182.188.181[.]224\n\n**Analytics**\n\nBlack Lotus Labs identified the following network indicators from files pertaining to this\ninfection vector:\n\n161.97.142[.]96\n164.68.104[.]126\n167.86.75[.]119\n173.249.40[.]68\n144.91.65[.]100\n164.68.108[.]22\n\nBased on internal network telemetry analytics, passive DNS records and open-source\nmalware repositories for related samples, Black Lotus Labs discovered IPs and domains we\ncan also associate with moderately high confidence to this actor.\n\nAdditional C2s\n\n207.180.230[.]63\n164.68.108[.]153\n167.86.97[.]221\ncertindia.ignorelist[.]com\ndefencecyberorg.myddns[.]me\ncertindia.chickenkiller[.]com\ncoronavirusupdate.ddnsking[.]com\n\n## Conclusion\n\n\n-----\n\nWhile this threat actor s targets have thus far remained within the South and Central Asian\nregions, they have proven effective at gaining access to networks of interest. Despite\npreviously relying upon open source frameworks such as AllaKore, the actor was able to\nremain effective and expand its capabilities with the development of the Svchostt agent and\nother components of the ReverseRat project. We assess that as the actor continues to\ndevelop these capabilities, utilize compromised domains and refine these multi-step infection\nprocesses, it will pose a real threat to organizations in and beyond these regions. While this\nactor is not as sophisticated as the most-skilled state-sponsored actors, it should be\ncontinually monitored. Black Lotus Labs is committed to tracking adversary groups such as\nthis and documenting their tradecraft to proactively help defenders.\n\nIn order to combat this particular campaign, Black Lotus Labs null-routed the actor\ninfrastructure across the Lumen global IP network and notified the affected organizations.\nBlack Lotus Labs continues to follow this threat group to detect and disrupt similar\ncompromises, and we encourage other organizations to alert on this and similar campaigns\nin their environments.\n\nFor additional IOCs such as file hashes associated with this campaign and this threat actor’s\nlarger activity cluster, please visit our GitHub page:\n[https://github.com/blacklotuslabs/IOCs/blob/main/Reverserat_iocs.csv](https://github.com/blacklotuslabs/IOCs/blob/main/Reverserat_iocs.csv)\n\n**If you would like to collaborate on similar research, please contact us on**\n**Twitter** **[@BlackLotusLabs.](https://twitter.com/BlackLotusLabs)**\n\nThis information is provided “as is” without any warranty or condition of any kind, either\nexpress or implied. Use of this information is at the end user’s own risk.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-22 - Suspected Pakistani Actor Compromises Indian Power Company with New ReverseRat.pdf"
    ],
    "report_names": [
        "2021-06-22 - Suspected Pakistani Actor Compromises Indian Power Company with New ReverseRat.pdf"
    ],
    "threat_actors": [
        {
            "id": "b584b10a-7d54-4d05-9e21-b223563df7b8",
            "created_at": "2022-10-25T16:07:24.181589Z",
            "updated_at": "2025-03-27T02:02:10.134233Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "ETDA:SideCopy",
            "tools": [
                "ActionRAT",
                "AllaKore",
                "Allakore RAT",
                "AresRAT",
                "Bladabindi",
                "CetaRAT",
                "DetaRAT",
                "EpicenterRAT",
                "Jorik",
                "Lilith",
                "Lilith RAT",
                "MargulasRAT",
                "ReverseRAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "187a0668-a968-4cf0-8bfd-4bc97c02f6dc",
            "created_at": "2022-10-27T08:27:12.955905Z",
            "updated_at": "2025-03-27T02:00:55.41311Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [
                "SideCopy"
            ],
            "source_name": "MITRE:SideCopy",
            "tools": [
                "AuTo Stealer",
                "Action RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a4f0e383-f447-4cd6-80e3-ffc073ed4e00",
            "created_at": "2023-01-06T13:46:39.30167Z",
            "updated_at": "2025-03-27T02:00:03.045082Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "MISPGALAXY:SideCopy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535945,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653714034,
    "ts_modification_date": 1653714034,
    "files": {
        "pdf": "https://archive.orkl.eu/857227a2460f177bce98baf6c9a9061b23a563ec.pdf",
        "text": "https://archive.orkl.eu/857227a2460f177bce98baf6c9a9061b23a563ec.txt",
        "img": "https://archive.orkl.eu/857227a2460f177bce98baf6c9a9061b23a563ec.jpg"
    }
}