{
    "id": "f06d4f1f-858c-43a9-a0a4-49d9afe33b52",
    "created_at": "2022-10-25T16:48:12.504299Z",
    "updated_at": "2025-03-27T02:16:57.913693Z",
    "deleted_at": null,
    "sha1_hash": "b76a490ed0318d173fd53a7c87ea84606de26c3a",
    "title": "Cashing in on ATM Malware: A Comprehensive Look at Various Attack Types",
    "authors": "",
    "file_creation_date": "2018-03-30T09:47:49Z",
    "file_modification_date": "2018-03-30T09:47:57Z",
    "file_size": 3446397,
    "plain_text": "# Cashing in on ATM Malware\n\n##### A Comprehensive Look at Various Attack Types\n\n###### Trend Micro Forward-Looking Threat Research (FTR) Team and Europol’s European Cybercrime Centre (EC3)\n\n\n-----\n\nWritten by:\n\nDavid Sancho and Numaan Huq of Trend Micro\n\nForward-Looking Threat Research (FTR) Team, and\n\nMassimiliano Michenzi of Europol’s European Cybercrime\n\nCentre (EC3)\n\nEUROPOL DISCLAIMER\n\n© European Union’s law enforcement agency, 2017. All\n\nrights reserved\n\nReproduction in any forms or by any means is allowed only\n\nwith the prior permission of Europol.\n\nMore information on Europol is available on the Internet:\n\n[Website: www.europol.europa.eu](http://www.europol.europa.eu)\n\n[Facebook: www.facebook.com/Europol](http://www.facebook.com/Europol)\n\nTwitter: @Europol\n\n[YouTube: www.youtube/EUROPOLtube](http://www.youtube/EUROPOLtube)\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro\n\nreserves the right to modify the contents of this document\n\nat any time without prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy\n\nis not guaranteed nor implied. If any questions arise\n\nrelated to the accuracy of a translation, please refer to\n\nthe original language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\n\n## Contents\n\n### 6\n\n##### From Physical Access to Network-based Attacks: How ATM Malware Has Evolved\n\n### 8\n\n##### ATM Infrastructure – How to Move Around an ATM\n\n### 14\n\n##### Physical ATM Malware Attacks\n\n### 20\n\n##### Network-based ATM Malware Attacks\n\n### 27\n\n##### Other Noteworthy ATM Malware Attacks\n\n### 30\n\n##### The Perpetrators of ATM Malware Attacks\n\n### 36\n\n##### Conclusion\n\n\n-----\n\n#### Foreword\n\nApril 2016 saw the first joint industry – law enforcement report by\n\nTrend Micro and Europol highlighting the emerging threat of ATM\n\nmalware. That report gave a detailed analysis of the developing\n\nthreat as well as the actions required to tackle this type of crime.\n\nThe forecasts of that report have unfortunately proved to be\n\naccurate, with a significant growth in this crime phenomenon\n\nhaving been observed both in complexity and in geographical\n\ndistribution.\n\nThe 2017 updated report shows that the malware being used\n\nhas evolved significantly and the scope and scale of the attacks\n\nhave grown proportionately. While industry and law enforcement\n\ncooperation has developed strongly, with a significant number\n\nof major arrests being made, the crime continues to thrive due\n\nto the major financial rewards available to the organized crime\n\ngroups involved.\n\nThis report assesses the developing nature of the threat. I\n\nhope that it serves as a blueprint for future industry and law\n\nenforcement cooperation.\n\n\n###### Steven Wilson\n\nHead of Europol’s\nEuropean Cybercrime Centre (EC3)\n\n\n-----\n\n###### Martin Roesler\n\nSenior Director of Trend Micro\nForward-Looking Threat Research (FTR)\nTeam\n\n\nATM malware attacks in various parts of the world continue\n\nto make headlines and cause significant costs to the financial\n\nindustry. In the bigger scale of things, their persistence\n\ndemonstrates the concerns that are attached to digital ATM\n\nsecurity. We can gather that the use of ATM malware is becoming\n\nmore commonplace, with cybercriminals constantly improving\n\ntheir attack methods in hopes of remaining undetected and\n\nunapprehended. This poses a growing problem to financial\n\ninstitutions and law enforcement agencies. However, together\n\nwe can raise the bar on security.\n\nIn this joint report covering the different ATM malware families\n\nand attacks currently in existence, both Europol’s European\n\nCybercrime Centre (EC3) and Trend Micro’s Forward-Looking\n\nThreat Research (FTR) team aim to raise awareness across the\n\nfinancial industry and hopefully help authorities to dismantle\n\ncybercrime syndicates that cause hundreds of thousands of\n\ndollars in losses around the world.\n\nAs ATM malware attacks have progressed beyond mere physical\n\naccess, concerned organizations need to be more vigilant than\n\never and adopt necessary protections. To that end, our report\n\npresents details on ATM malware developments, attack types\n\nwe have seen over the years, and the techniques organized\n\ncrime groups use to orchestrate their activities.\n\nTogether with our security expert partners at Europol’s EC3,\n\nwe at Trend Micro believe that threat intelligence is a vital\n\ncomponent of the continued and overarching digital security\n\nand strategy. We hope that members of the financial industry\n\nand law enforcement find this comprehensive report informative\n\nand useful in implementing better cybersecurity efforts.\n\n\n-----\n\nATM malware is one of the digital threats that have been around for a\n\nwhile now, with the discovery of the first known variant dating back to\n\n2009. It should not be a surprise that it has become a mainstay in many\n\ncybercriminals’ arsenal because it can, plainly put, steal cold, hard cash.\n\nWe have seen time and again how cybercriminals plant skimming\n\ndevices on automated teller machines (ATMs), even those exposed in\n\npublic sight, and how they use other physical attacks for quick gains.\n\nHowever, as cybercriminals continue to aim at siphoning off considerable\n\nprofits, it only makes sense that they would progress to targeting ATMs\n\nvia networks. After all, finding a way to bypass security and infiltrate the\n\nfinancial institutions’ networks promises a bigger payout.\n\nCouple that motivation with the fact that many ATMs run on outdated\n\noperating systems, and you get a compelling reason for the sustained\n\ncybercriminal use of ATM malware. Such operating systems are\n\nvulnerable since they have already reached end of support, meaning\n\nthere will no longer be security updates and hotfixes provided for them.\n\nConsequently, machines that rely on obsolete operating systems are\n\nhighly susceptible to attacks.\n\nIn this paper, we explore in detail the different known ATM malware\n\nfamilies and attack types (physical and network-based) and how\n\nattackers operate their way to and around their target infrastructures.\n\n\n-----\n\n# From Physical Access to Network-based Attacks: How ATM Malware Has Evolved\n\nIn 2016, we published a non-public paper, in which we described in detail known malware families that\n\nwere specifically targeting ATMs. In that paper, we focused on the way those families were able to subvert\n\nthe ATM vendors’ application programming interfaces (APIs) and the common eXtensions for Financial\n\nServices (XFS) API in order to communicate with the ATM-specific hardware: mainly the card reader and\n\nthe money cassettes.\n\nBack then, we observed that the main infection vector was purely physical: The criminal had to physically\n\nopen the casing of the ATM and access the machine’s internals to boot up from an external USB or CD.\n\nWhile this strategy is certainly still in use today, we have recently started to see the use of a new access\n\npoint that we already alluded to in our previous paper: the network.\n\nAlthough we speculated that this could happen, we could not foresee how close we were from it becoming\n\na reality. As banks are starting to realize how much at risk they are from physical ATM attacks and\n\ntherefore take steps to protect their machines accordingly, the attackers are catching up with alternative\n\ninfection vectors. Enter network-based ATM attacks.\n\nNetwork infections require more work and planning on the side of the attacker, with the difficulty lying in\n\nthe challenge of accessing the ATM network from the main bank’s network. In a well-planned network\n\narchitecture, these two should be separated and accessing one from the other should involve bypassing\n\nfirewalls and possibly other security elements. Sadly, some banks do not have this network separation.\n\nEven if the two are segregated, in some known incidents, the criminals have managed to attain such a\n\ntight foothold on the bank’s network that they were able to install software on the ATMs from the main\n\nnetwork.\n\n\n-----\n\nFor the purpose of giving the reader an overview, we will be describing all known attacks in two broad\n\ncategories:\n\n1. Those attacks whose way of entry into the ATM is by physical means. In these incidents, criminals\n\nusually open the machine’s case with a generic key or by force; and\n\n2. Those attacks that manage to access the ATMs via the network. These attacks normally involve\n\nhacking into the bank’s corporate network first.\n\nAfter those two sections, in a third part, we will describe two more attack types that are more ad hoc\n\nand not quite as common. We believe these two, though rarer, are worth knowing about because if they\n\nhave happened in the past, chances are they might still pose some risk to ATM installations in the future.\n\nFor the sake of completeness, we also describe here a criminal tool that was discovered and seemed to\n\nhave been part of the testing elements while developing some of the attacks described above. Although\n\nit was never part of an incident, this illustrates how criminals test their capabilities before launching the\n\nreal attacks against their targets.\n\nIn the last part of the paper, we talk about the perpetrators of these attacks. Although attribution is a\n\nthorny issue, our discussion is more about the overall landscape and a brief analysis of the business\n\nmodels that lead criminal outfits to mount these kinds of attacks.\n\nAs a reminder with regard to the attacker’s objectives, all of the known ATM malware attacks provide the\n\nattackers a way to install arbitrary programs on the cash machines in order to empty their cash cassettes\n\n(i.e., jackpotting the machine), log all customer card transactions (i.e., virtual skimming), or both.\n\n\n-----\n\n# ATM Infrastructure – How to Move Around an ATM\n\nThe primary goal of ATM malware is to connect to and control peripheral devices inside the ATM in order\n\nto withdraw stored cash and/or collect information from bank customers. It is therefore important to\n\nunderstand the physical design of an ATM in order to understand how ATM malware attacks work.\n\nAn overly simplistic yet accurate description of an ATM is this: a computer system connected to a\n\nsecure vault encased inside a housing unit. ATMs are complex devices with interconnected peripherals\n\nthat provide bank customers with a range of banking services such as cash withdrawal and deposit,\n\nmoney transfers, and bill payments. ATMs come in all shapes and sizes, but their internals have a similar\n\narchitectural layout. The following diagram illustrates some of the basic elements of an ATM:\n\n6\n\n10\n\n5\n\n9\n7\n\n1\n\n2\n\n3 4\n\n8\n\n1. CPU 6. Function keys\n\n2. Card reader 7. Receipt printer\n\n3. PIN pad 8. Vault\n4. Secure cryptoprocessor 9. Housing\n\n5. Screen 10. Security camera\n\nFigure 1. Components of an ATM\n\n\n-----\n\nATMs have the following components:\n\n1. Central processing unit (CPU): Controls the user interface, handles communications, manages\n\nperipheral devices, and processes transactions.\n\n2. Card reader: A magnetic stripe card or chip card reader – accepts as input both debit and credit\n\ncards.\n\n3. PIN pad: An encrypting PIN pad (EPP) that encrypts identifiers such as the PIN entered on the keypad.\n\n4. Secure cryptoprocessor: Encrypts and decrypts secure communications. Transactions are\n\nencrypted using AES or 3DES encryption algorithms.\n\n5. Screen: Displays the graphical user interface (GUI) the customer uses to interact with the ATM. Some\n\nnewer ATMs have touchscreen displays with virtual function keys.\n\n6. Function keys: Mounted beside the display or touchscreen, they provide access to menu items,\n\nnavigation, and commonly used functionality.\n\n7. Receipt printer: Prints records of transactions. Some ATMs also support passbook printing.\n\n8. Vault: The most important component of an ATM, it is constructed from high-tensile strength steel.\n\nIt has a cash-dispensing mechanism, a deposit mechanism with check processor and bulk note\n\nacceptor, journaling system for tracking cash in/outflows, cash cartridges/cassettes for storing cash,\n\nand a locking mechanism that secures it.\n\n9. Inner housing: A customized machine steel case. The outer housing is made of very hard thermoformed\n\nacrylonitrile butadiene styrene (ABS) plastic and is decorated with the bank’s logo.\n\n10. Security equipment: The ATM might also have a surveillance camera, security sensors (magnetic,\n\nthermal, seismic, and gas), speakers, and indicator lights.\n\nATMs have moved from using custom hardware to off-the-shelf PC hardware, such as USB, Ethernet\n\nand IP communications, and Windows[®] operating system (OS). The decision to switch architectures is\n\nmost often motivated by a lower cost of ownership: from cheaper components to better support and\n\ninteroperability with commercial software.\n\nA majority of ATMs installed worldwide still run either Windows XP or Windows XP Embedded. Some\n\nof the older ATMs run Windows NT[®], Windows CE[®], or Windows 2000. Microsoft[®] support for Windows\n\nXP ended on April 8, 2014. Extended support for Windows XP Embedded ended on Jan. 12, 2016, and\n\nextended support for Windows Embedded Standard 2009 is scheduled to end on Jan. 8, 2019. This\n\nmeans that there are at least hundreds of thousands of ATMs running an OS that no longer receive\n\n\n-----\n\nsoftware patches for new vulnerabilities or will soon have security patch updates discontinued.\n\nApplication programs running on ATMs use XFS, middleware for communications with the peripheral\n\ndevices. XFS and the impact of middleware will be discussed in greater detail later.\n\nATMs are connected to the network via ADSL or dial-up modem over a telephone line or direct leased\n\nline. Low-level network communication protocols used by ATMs include SNA over SDLC, TC500 over\n\nAsync, X.25, and TCP/ IP over Ethernet.[1] ATMs are connected to the interbank networks (NYCE, PULSE,\n\nPLUS, Cirrus, AFFN, Interac, STAR, LINK, MegaLink, and BancNet) and communicate via ISO 8583:\n\nFinancial transaction card originated messages – Interchange message specifications.[2, 3] ISO 8583 has\n\nno routing information and is used together with a TPDU header.[4] Transactions are encrypted using either\n\nAES or 3DES encryption. All communications between the ATM and the interbank network may also be\n\nencrypted via SSL for additional security.\n\n#### Parallels Between a PC and an ATM\n\nIf we think of a modern ATM as a Microsoft Windows PC with a safe box full of money attached to it and\n\ncontrolled by software, we can see how it becomes a lucrative target for malware creators. Nevertheless,\n\nthere are important differences between a normal desktop PC and an ATM, with the two main ones being\n\nthe following:\n\n1. The first and most important divergence between a PC and an ATM is that the latter cannot be\n\naccessed by normal means. Other than a magnetic card reader and a keypad, there is no easy way to\n\ninteract with the machine’s internal hardware. This implies that any infection would need to use either\n\nthe card reader or a way to access the internal mainboard to connect an external device.\n\nEven though there have been successful attempts in using the magnetic card reader to infect ATMs,[5]\n\nthis is so unusual that it does not even bear further mentioning. The most common infection method\n\nrequires the criminal to open the physical metal casing and access internal hardware ports. The USB\n\nport is the most utilized, but older machines that have a CD/DVD reader have been abused in the\n\nsame way.\n\n2. The second major difference between ATMs and desktop machines is with respect to network\n\nconnectivity. ATMs are not usually connected directly to the bank’s network and certainly not to the\n\ninternet. The most common setup is to join the ATM’s network with the bank’s branch through a\n\nvirtual private network (VPN). Some standalone ATMs in remote locations are instead attached to the\n\nbank’s network by means of a satellite connection. This can be a problem if the criminals manage to\n\ntake over the network infrastructure or if it is not configured securely.\n\n\n-----\n\n#### Middleware – The Key to the Safe\n\nThe XFS middleware provides a client-server architecture for financial applications on the Microsoft\n\nWindows platform, especially peripheral devices such as ATMs, which are unique to the financial industry.[6 ]\n\nXFS is commonly installed in ATMs and widely supported by ATM vendors and financial service providers.\n\nThe XFS specification defines a software interface that consists of:\n\n- A set of application programming interfaces (APIs)\n\n- A corresponding set of service provider interfaces (SPIs)\n\n- Supporting services for the handling/processing of APIs and SPIs\n\nXFS provides user applications an access interface to the connected peripheral devices and financial\n\nservices running inside the ATM. Since these devices (PIN pads, magnetic card readers, receipt printers,\n\nand cash delivery mechanisms) are complex, proprietary, and difficult to manage, the use of XFS offers a\n\nnumber of benefits for financial institutions and their service providers.\n\nAn application that uses the XFS APIs to communicate with a particular service provider — interface\n\nfor peripherals (e.g., PIN pad, cash dispenser, receipt printer) or interface for services (e.g., interbank\n\nnetwork) — can work with a service provider of another XFS-conforming vendor without requiring code\n\nmodifications. This is the same principle that allows a programmer to use the Windows API to open a\n\nfile without worrying about what hard disk it uses. This is also the main reason ATM malware writers use\n\nthe XFS APIs to compromise ATMs: They can easily communicate with the connected peripheral devices,\n\nand the malware code becomes portable, i.e., it will run on ATMs manufactured by different vendors with\n\nminor code modifications.\n\nThe following diagram illustrates the XFS system architecture:\n\nXFS Manager\n\nFigure 2. XFS system architecture\n\n\n-----\n\nApplications communicate with service providers via the XFS Manager using a set of APIs. The XFS\n\nManager maps the specified API to its corresponding SPI. The SPI talks to the peripheral device, and then\n\nthe user indirectly invokes the SPIs using the vendor-neutral APIs via the XFS Manager. The vendor-neutral\n\nAPI abstracts the user application from device-specific implementations and calls. This is what enables\n\nthe user application to run on ATMs from different manufacturers with little or no code modification.\n\nThe XFS API has the following general set of functions:[7]\n\n - Basic functions – such as StartUp/CleanUp, Open/Close, Lock/Unlock, and Execute, that are\n\ncommon to all XFS device/service classes.\n\n- Administration functions – such as device initialization, reset, suspend, and resume. They are also\n\nused for managing devices and services.\n\n - Specific commands – used to request information about a service/device and to initiate service/\n\ndevice specific functions. These are sent to devices and services as parameters for the GetInfo and\n\nExecute basic functions.\n\nThe SPI is kept as similar as possible to the API. Some commands are processed exclusively by the XFS\n\nManager, and so are not in the SPI.\n\n#### The Master Plan – Infect and Conquer\n\nThere are two main objectives that a malware writer may try to achieve by infecting an ATM box:\n\n- The first objective is emptying the safe of cash. This is colloquially known as “jackpotting” the machine\n\nand is the most obvious goal of ATM malware.\n\n- The second objective is logging payment card data while the machine is being used by clients to\n\nwithdraw funds. To this end, the malware acts like a virtual skimming device.\n\nThese two objectives are compatible and there are pieces of malware that can do both. As mentioned\n\nabove, a successful attack would require either physical access to the ATM’s mainboard or a way to\n\naccess the bank’s internal network. In case of infection through the network, the attacker might need\n\nadditional network access, such as to the VPN or to the particular segment where the ATM network might\n\nbe located.\n\nEither way, there are two possibilities:\n\n- The attacker has insider knowledge or help (to find out how to access the network or to open the\n\nmachine’s hardware protection).\n\n - In the case of physical hardware access, the machine’s internals are accessible by means of commonly\n\navailable generic physical keys. This is not unheard of; there are plenty of hardware parts in public\n\n\n-----\n\nplaces that use generic protection locks merely to deter easy access by passersby. These kinds of\n\nlocks are usually found “protecting” those devices that are not critical enough to warrant the use of\n\nreal customized security. Obviously, in the ATM’s case, the deployment of generic security locks is\n\na gross underestimation of the risks of allowing easy access to the machine’s internal hardware to\n\ndetermined individuals.\n\nOnce the criminals have physical access to the USB port or CD/DVD drive, they can insert the device\n\ncarrying the malware, restart the computer, and boot from it. At that point, the attackers have full control\n\nof the machine. The next step usually involves mounting the ATM’s internal operating system file structure,\n\ncopying the malware into it, and modifying the OS so that it executes the malware on a regular boot.\n\nThe infection is effective after the machine reboots, giving the installed malware access to the special\n\nhardware, such as the keypad, the card reader, and the different cassettes that hold the banknotes of\n\neach of the denominations. The whole process should take no more than 10 minutes.\n\nThe malware attacks we describe in this paper are different from “black box” attacks. In black box attacks,\n\nthe crooks detach the physical cash dispenser from the ATM, connect it to an external computer, and\n\nissue dispensing commands. In both attacks, the criminal accesses the ATM’s hardware and physically\n\nmanipulates it. The big difference is that there is no malware involved in black box attacks and therefore\n\nthe defense strategies are also markedly different.\n\n\n-----\n\n# Physical ATM Malware Attacks\n\nThe first category includes the old-style ATM malware that is typically reported, although the criminals\n\nhave certainly improved these malicious programs over the years. Also included in this category is a new\n\nmalware family that has surfaced, which we shall be covering accordingly.\n\n\nA T M\n\n\nManually install\nmalware via USB\nor CD\n\n\nRun malware\nand access\nspecial menu\n\n\nSend commands\nto ATM via XFS\n\n\nDispense cash\n\n\nFigure 3. How a typical physical ATM malware attack is carried out\n\n#### Skimer: The First Known ATM Malware\n\nSkimer was the first known piece of malware to target ATMs. It was first discussed in a SophosLabs\n\nblog post in March 2009 and was initially thought to be a credit card skimming malware targeting ATMs.[8 ]\n\nSkimer might have existed as early as July 2007 and was originally found targeting ATMs in Russia\n\nand Ukraine.[9] It exclusively targets ATMs manufactured by Diebold[®], which confirmed that there was no\n\nnetwork-level security compromise in Skimer infection cases. This meant that the malware was manually\n\ninstalled on the ATMs.[10]\n\nRecent ATM malware families directly or indirectly use the XFS middleware to access ATM peripheral\n\ndevices such as the cash dispenser, PIN pad, and receipt printer. Skimer, on the other hand, uses a\n\nDiebold custom middleware, similar in functionality to XFS, to access the ATM’s peripherals. It is unclear\n\nwhether all Diebold ATMs or only older ones run the custom middleware. Also, it is unclear whether or not\n\nthe Diebold custom middleware interfaces with XFS at all.\n\n\n-----\n\nTwo variants of Skimer have been found in the wild. Skimer v2009 reads user input from the PIN pad,\n\ndispenses cash, and collects transaction data. Skimer v2011 is a scaled-down version of v2009 that only\n\ndoes data collection. Both Skimer variants are still actively being used by criminals today.\n\nKey Points:\n\n- Skimer is likely installed manually by accessing the ATM’s internal hardware via USB or bootable CD.\n\n- Two variants of Skimer have been discovered in the wild: v2009 and v2011.\n\n- Skimer v2009 reads user input from the PIN pad, dispenses cash, and collects transaction data. It\n\nalso requires an authorization code before dispensing cash. The operator has to obtain this code from\n\nthe criminal group controlling Skimer.\n\n- Skimer v2011 is a scaled-down version of Skimer v2009 that only collects data. It writes the collected\n\ndata to log files and encrypts the files using RC4 encryption. The operators use a “master” card to\n\nauthenticate the malware. They also use the same card to retrieve the stolen credit card information.\n\n- Both variants of Skimer are still being used by criminals.\n\n#### Ploutus: Exhibiting Expert Knowledge of ATMs\n\nPloutus exclusively targets ATMs manufactured by NCR[®]. The information security firm SafenSoft first\n\ndisclosed news about Ploutus’ existence back in September 2013, when the malware was discovered\n\nattacking ATMs in Mexico.[11]\n\nA month after the malware was discovered, a more advanced variant of Ploutus with a modularized\n\narchitecture[12] was found. The new variant, dubbed Ploutus.B, made it more difficult to discover the\n\ninfection, as there were now three modules to identify and detect as opposed to only one. This redesign\n\nalso extended the malware’s functionality. In more recent reported cases of infections, a mobile phone\n\nhad been physically installed inside the ATM’s housing. This device received cash withdrawal commands\n\nvia SMS and then forwarded them to Ploutus.B, thereby minimizing direct physical interaction between\n\nthe malware operator and the ATM.\n\nThe criminals who wrote Ploutus seemed to have expert knowledge and experience in developing\n\nsoftware for ATMs manufactured by NCR. However, in October 2016, a new variant, dubbed Ploutus.C,\n\nsurfaced, adding support for subverting and controlling a specific software framework that managed\n\nATMs regardless of vendor.\n\nAnother version of the malware, dubbed Ploutus.D, emerged in January 2017, adding a module to manage\n\nthe ATM remotely. This new feature might look great in a news header, but it does not seem to make a\n\nlot of sense in practical terms. Features such as this (and the SMS receiving feature from Ploutus.B) only\n\nmakes a second jackpotting operation easier for the criminals, but in reality, most of the banks we have\n\n\n-----\n\nspoken to disable an affected ATM as soon as the first attack is discovered. Once this happens, the\n\nmachine is taken offline and forensically analyzed. Unless the banks targeted by these criminals have\n\ndifferent policies in place, adding hardware to enable a second attack will only serve to provide more\n\nclues to the investigators.\n\nThe revealing fact is that Ploutus is being actively developed with new versions coming out fairly often.\n\nThe new features being implemented suggest that the criminals know the situation of the ATMs and the\n\nbank’s particular configurations well and that their attacks are targeted operations.\n\nKey Points:\n\n- The Spanish-language strings found in the original Ploutus malware were translated into English in\n\nthe second version. Some observers are suggesting that this is a strong indication that Ploutus.B is\n\nalso used in other countries.\n\n- The criminals who wrote Ploutus seemed to have expert knowledge and experience in developing\n\nsoftware for ATMs manufactured by NCR.\n\n- Ploutus’ initial infection was supposedly done using a bootable CD-ROM. It is highly probable that\n\nthe lock of the ATM housing was either picked or opened with a key to access the CPU and load a\n\nCD-ROM containing the Ploutus malware.\n\n- The original Ploutus malware accepts an eight-digit activation code. This activation code is required\n\nto start interacting with Ploutus to withdraw cash. This is a control feature: The low-level operator\n\nwithdrawing the cash from the ATM needs to call the criminal group to receive the activation ID and\n\nproceed with the cash withdrawal.\n\n- Ploutus.B accepts a 16-digit code and when an incorrect activation code is entered, the malware\n\nwill sleep for 500 minutes, rendering repeated attempts to activate the malware useless. This is yet\n\nanother built-in security control.\n\n- When the correct activation code is entered, Ploutus.B becomes active for 24 hours. The low-level\n\noperator can withdraw cash only during this 24-hour period before requiring a new activation code.\n\nPloutus prints an error message and will not dispense cash after that period.\n\n- Ploutus can read user input from both the ATM’s PIN pad and a connected external keyboard. On the\n\nother hand, Ploutus.B can read user input only from the ATM’s PIN pad.\n\n- Ploutus.B does not have the option to specify the number of bills to dispense. The malware checks\n\nthe number of bills in each cassette and dispenses all of the cash from the first cassette with 40 or\n\nmore bills and repeats the process every time it receives a new dispense request.\n\n\n-----\n\n- More recent Ploutus versions, named Ploutus.C and Ploutus.D, each add features that seem to be\n\naimed at very specific situations or at certain bank installations. This indicates that the malware is\n\nbeing actively developed and the criminals study the targeted banks very carefully.\n\n#### Padpin-Tyupkin: Stealth in the Dead of Night\n\nPadpin was first discovered in May 2014 by Symantec. This malware family is responsible for the theft of\n\nmillions of dollars from ATMs across parts of Europe and Southeast Asia.[13, 14] An updated version, dubbed\n\nTyupkin, was discovered in October 2014 by Kaspersky Labs.[15] Padpin and Tyupkin are based on the\n\nsame code base,[16] as confirmed through code analysis and also by the ATM manufacturer NCR.\n\nKey Points:\n\n- Padpin targets NCR-manufactured ATMs with McAfee[®] Solidcore installed on the machines.\n\n- Padpin is installed on the target ATM using a bootable CD-ROM. The most probable scenario involves\n\npicking the ATM housing’s lock and infecting the system through a bootable CD.\n\n- Padpin hooks the ATM’s PIN pad and allows control of the malware via the PIN pad.\n\n- By default, Padpin is set to be active between 1 a.m. and 5 a.m. every Sunday and Monday. This\n\nindicates that the criminal group behind it operates at night to avoid raising suspicion.\n\n- Padpin allows cash to be withdrawn from the ATMs. It uses session keys to ensure that low-level\n\noperators rely on the main criminal group to withdraw funds.\n\n#### GreenDispenser: A Self-Deleting Malware\n\nGreenDispenser is an ATM malware family discovered by Proofpoint in September 2015 and found to be\n\nvictimizing ATMs in Mexico.[17] GreenDispenser malware samples were first uploaded to VirusTotal back\n\nin June 2015 from India and Mexico. Based on available evidence, there is no connection between these\n\ntwo countries and GreenDispenser. One could theorize that the criminals have outsourced the malware’s\n\ndevelopment to Indian programmers but there is no further evidence pointing to it.\n\nKey Points:\n\n- GreenDispenser will run only if the date is between Jan. 1 and Aug. 31, 2015. The samples we\n\nanalyzed were created for a time-limited campaign period.\n\n- ATMs infected with GreenDispenser display an error screen with a message: “We regret this ATM is\n\ntemporary out of service.” The infection renders the ATM unusable to regular users.\n\n- GreenDispenser does not restrict itself to targeting ATMs from a single manufacturer only. Instead, the\n\nmalware is designed to be able to compromise any ATM that uses the XFS middleware.\n\n\n-----\n\n- GreenDispenser employs a two-stage authentication process before the operator can access the\n\ncash dispenser menu.\n\n- The first authentication key is used to disable the error screen. Once the error window is disabled,\n\nGreenDispenser displays a new screen with a QR code and menu options: “Enter second key. Press\n\n9 to pause, 8 to permanently delete.”\n\n- The second authentication key is dynamically generated using Windows’ built-in cryptographic\n\nfunctions. The QR code displays the encrypted second key.\n\n- The operator scans the QR code and either uses a custom app to decrypt the key or contacts the\n\nmain criminal group for help with decryption. The decrypted second key is entered on the PIN pad to\n\naccess the cash dispenser menu.\n\n- After each dispensing operation, an updated count shows how many bills remain inside the ATM.\n\nGreenDispenser assumes there is only a single type of currency stored in the ATM.\n\n- GreenDispenser has an elaborate uninstall procedure to remove all traces of an infection. After\n\nGreenDispenser has been successfully removed from the system, the ATM returns to its regular\n\noperation.\n\n- GreenDispenser is probably installed manually in the ATM either by an insider or by members of the\n\ncriminal group.\n\n#### Alice: Designed to Empty Safes\n\nTrend Micro first discovered the Alice ATM malware family in November 2016 as a result of our joint research\n\nproject on ATM malware with Europol’s EC3. We collected a list of hashes and the files corresponding to\n\nthose hashes were then retrieved from VirusTotal for further analysis.[18]\n\nOne of those binaries was initially thought to be a new variant of the Padpin ATM malware family. However,\n\nafter reverse engineering the sample, we found it to be part of a brand new family, which we called Alice.\n\nSeveral things stand out about Alice. It is extremely feature-lean and, unlike other ATM malware families\n\nwe have dissected, it includes only the basic functionality required to successfully empty the money safe\n\nof the target ATM. Alice only connects to the currency dispenser peripheral and it never attempts to use\n\nthe machine’s PIN pad. The logical conclusion is that the criminals behind Alice need to physically open\n\nthe ATM and infect the machine via USB or CD-ROM, and then connect a keyboard to the machine’s\n\nmainboard to operate the malware through it.\n\nAnother possibility would be to open a remote desktop and control the menu via the network, similar to\n\nthe hacking attacks in Thailand and other recent incidents. However, we have not seen Alice being used\n\nthis way. The existence of a PIN code prior to money dispensing suggests that Alice is used only for\n\n\n-----\n\nin-person attacks; nor does Alice have an elaborate install or uninstall mechanism — it works by merely\n\nrunning the executable in the appropriate environment.\n\nAlice’s user authentication is similar to that of other ATM malware families. The money mules that carry out\n\nthe attacks receive the needed PIN from the actual criminal gangs. The first command they enter drops\n\nthe cleanup script, while entering the machine-specific PIN code lets them access the operator panel for\n\nmoney dispensing. This access code changes between samples to prevent mules from sharing the code\n\nand bypassing the criminal gangs, to keep track of individual money mules, or both. In our samples, the\n\npasscode is only four digits long, but this can be easily changed. Attempts to brute-force the passcode\n\nwill eventually cause the malware to terminate itself once the PIN input limit is reached.\n\nGiven that Alice only looks for an XFS environment and does not perform any additional hardware\nspecific checks, we believe that it has been designed to run on any vendor’s hardware configured to use\n\nMicrosoft’s XFS middleware.\n\nKey Points:\n\n- Alice is a very feature-lean piece of malware focused on emptying the cash from the target ATM.\n\n- Alice does not need installation and can be simply run.\n\n- Alice needs a keyboard to properly accept commands.\n\n- Alice can run on ATMs from any manufacturer.\n\n\n-----\n\n# Network-based ATM Malware Attacks\n\nThe second category of ATM malware attacks encompasses those that use the network as their point\n\nof entry. In our observation of the different attacks that have been reported, the criminals hack into the\n\nbank’s corporate network through ways as simple as phishing emails directed at the bank’s employees.\n\nThis is by no means the only way to accomplish such a hack but it is the easiest and therefore the most\n\ncommon one.\n\nOnce the criminals have established a solid foothold into the bank’s network, they then go on to perform\n\nlateral movement to identify and access other sub-networks, including the ATMs. Normally, banks have\n\na clear separation between their corporate network and that of the ATMs, with separate routing and\n\nfirewalls or other defenses. Some banks do have a flat network, thus making the hackers’ lives much\n\neasier, but these tend to be a lot rarer.\n\nWe will cover five distinct attacks that have been publicized in media outlets:\n\n- The Taiwan attack from July 2016\n\n- Cobalt Strike\n\n- Anunak/Carbanak\n\n- Ripper\n\n- ATMitch\n\n\n-----\n\nSend malware\nvia phishing emails\n\n$\n\nLet mules\ncollect money\n\n\nSteal admin\ncredentials\n\n\nHack into\nnetwork\n\n\nPerform\nlateral movement\n\nA T M\n\nGet remote\naccess to ATMs\n\n\nDispense cash\n\n\nFigure 4. How a typical network-based ATM malware attack is carried out\n\n#### Taiwan Network Attack: An Elaborate Intrusion\n\nIn early July 2016, 41 Wincor Nixdorf[®] ATMs in Taiwan were attacked and the criminals stole NT$80 million\n\n(US$2.5 million) from 22 branches of First Commercial Bank without using cash cards or even touching\n\nthe PIN pads.[19] The ATM malware used was not initially disclosed, but the bank suspended withdrawals\n\nfrom 1,000 ATMs of the same kind until they could address the situation. Although the criminals were\n\neventually caught and most of the money retrieved, by mid-September the Taiwan police and the Ministry\n\nof Justice’s Investigation Bureau had revealed the results of their joint forensic investigation. The ATM\n\nthefts proved to have been a network attack that was quite sophisticated. The consultancy firm iThome\n\ndescribed the attack as follows:\n\n\n-----\n\n|A T M|A T|M|A T M|Col5|\n|---|---|---|---|---|\n\n\nFigure 5. Taiwan network attack\n\n1. Although the initial intrusion to the bank’s network started elsewhere, the actual attack to the bank’s\n\nATM network began from its London branch.\n\n2. Once inside the London branch network, the hackers accessed the bank’s voice recording system\n\nand stole the domain administrator’s account credentials.\n\n3. Using these credentials, they hacked the VPN over the leased line into the bank’s Taiwan branch,\n\nbypassing the router and firewall ports at headquarters and taking control of some servers in the\n\nTaiwanese network.\n\n4. From these servers, the attackers were able to learn about the intranet topology. They identified the\n\nATM update dispatcher and extracted its administrator credentials.\n\n5. The attackers logged into the ATM update server and set up a fake update package to the distribution\n\nmanagement system. They then uploaded it to the ATMs as if it were a real update. This package\n\nenabled the telnet service on the ATMs.\n\n6. With the telnet service now turned on, the attackers opened telnet sessions to remotely access and\n\ncontrol the ATMs.\n\n\n-----\n\n7. The attackers uploaded three programs to certain ATMs and ran some tests (using standby mules) to\n\nensure the cash dispenser doors would open. The mules in front of the machines reported the test\n\nresults back to the remote hackers by using the Wickr Me secure messenger app on their mobile\n\nphones.\n\n8. Once the hackers confirmed that the ATMs were ready for the attack, they uploaded and ran modified\n\nvendor test tools that dispensed 40 banknotes at a time. (This is the maximum number of notes that\n\nmay be dispensed at one time due to hardware limitations.) The mules that were standing in front of\n\nthe ATM took the money, drove to the next ATM, and repeated the process.\n\n9. In the meantime, the remote hackers wiped the malicious programs off the victimized ATM and logged\n\noff.\n\nThis attack demonstrates how attackers can victimize ATMs via the bank’s network. In this case, the\n\nnetwork hack was so thorough that the attackers could not only install arbitrary software onto each of\n\nthe machines (which in itself would have been enough to jackpot them) but also control them remotely\n\nvia telnet.\n\n#### Cobalt Strike: Leveraging Security Software\n\nThe next incident we are going to discuss has been dubbed Cobalt Strike by the security company\n\nwho first brought it to light, Group-IB.[20] According to the paper the firm published, the criminals behind\n\nthe attack first sent phishing emails to a certain Russian bank’s employees containing exploits and\n\npassword-protected archives with malicious executables. According to the same paper, the attackers\n\nused a security program called Cobalt Strike in order to penetrate the network, hence the name used\n\nto refer to the incident. This software is a legitimate penetration testing suite that white-hat hackers\n\nregularly use to evaluate a client’s network security. The attackers also used the software Mimikatz to\n\ncompromise domain and local accounts. Once the attackers had established a foothold in the network\n\nwith the right credentials, they looked for the employees who could administrate the ATMs via Remote\n\nDesktop Protocol (RDP). Once the hackers had taken control of the machines, they could remotely log\n\ninto any ATM and upload the software of their choice. The program they used to dispense cash seems\n\nto have been a custom-made executable that uses XFS to communicate with and empty the machine’s\n\ncassettes.\n\nBased on Group-IB’s report, two different modi operandi were in place for the triggering of the malicious\n\ncode and cash-out by remote hackers: on-demand while the mules were standing in front of the machines\n\nwaiting for it to deliver cash, or by the mules themselves, who on their mobile phones have messages\n\nwith six-digit codes to trigger the cash-outs described in the malware section of this paper (similar to\n\nSkimer, Ploutus, GreenDispenser, etc.). These two possible scenarios would imply very different criminal\n\n\n-----\n\nstructures (more or less hierarchical) and different malware features (activation by command line script\n\nor a session code), both available at the same time. Due to the public unavailability of the malware\n\nsamples found on those ATMs, no additional analysis could be performed in this regard.\n\nAgain, the attackers were able to access the ATM network by means of a hack into the bank’s main\n\ncorporate network. In this case, the ATMs were being remotely managed through RDP and that seemed\n\nto be the way in.\n\n#### Anunak/Carbanak: From Phishing to Lateral Movement\n\nThis incident was remarkably similar to the previous one and also seemed to have been carried out\n\nagainst Russian banks. Group-IB and Kaspersky published papers that described the attack from different\n\nperspectives. Since Group-IB was the company that dissected the attack and it considered Cobalt Strike\n\nand Anunak/Carbanak separately, we assume that the attacks were performed by different attackers.\n\nSince we do not have all the information the two firms might have had as incident responders, we are\n\nin no situation to contest their claim, although from reading both of their papers, one can see striking\n\nsimilarities between the attacks.\n\nAnunak/Carbanak started out via email phishing with infections enabled by web exploitation kits. Once\n\nthey had infected a computer with local admin access, the attackers used password-cracking software,\n\nlike Mimikatz, to increase their foothold in the network. The attackers were able to move laterally within\n\nthe bank’s corporate network and control other servers, which they used to find out domain admin\n\ncredentials and eventually hack into a domain controller. From there, the hackers could find different\n\nnetwork segments, and among those, the computers that could administrate the ATM network. According\n\nto Kaspersky’s paper, the attackers could then use that special network access to remotely log into ATMs,\n\nupload software, and run it.[21] The software they used for dispensing money was a modified version of an\n\nATM vendor’s test tool. The mules were also instructed to stand in front of the machine to pick up the cash\n\nbeing dispensed. Unlike with the previous incident, there is more information about this tool, with some\n\nscreenshots shared in Group-IB’s paper.[22] Instead of ATM malware, the software looks like a modified\n\nnon-legitimate version of a text-mode UI tool made by Wincor Nixdorf (now Diebold Nixdorf[®]) to test\n\ndispensing money on the machine.\n\nWhether or not the attackers were the same as those behind the Cobalt Strike incident is not very\n\nimportant. The fact is that the attackers were able to find their way to the ATM network by means of a hack\n\ninto the bank’s corporate network. By monitoring and examining the network, the attackers in both cases\n\ncould identify where the segregated ATM network was and they were able to steal the right credentials to\n\nremotely install and run software on the victimized machines.\n\n\n-----\n\n#### Ripper: Dispensing in Large Quantities\n\nIn July and August of 2016, NCR ATMs of Government Savings Bank (GSB), headquartered in Bangkok,\n\nThailand, were attacked with their cash deposits emptied out.[23] The attack used a new ATM malware\n\ndubbed Ripper.\n\nNCR determined that the attackers first hacked into the bank’s network, and once inside, they used a\n\nspoofed version of InfoMindz’s Software Distribution and Management System v2.3.0 to distribute the\n\nmalware to the ATMs.[24] In front of the victimized machines, the mules used modified payment cards to\n\nauthenticate the Ripper malware on them to retrieve all of the cash in the safes up to 40,000 baht ($1,160).\n\nRipper shares features with previous ATM malware types (including Padpin and GreenDispenser) in that\n\nit can disable the machine’s network interface, therefore preventing real-time anti-fraud detection on the\n\nbank’s side, as well as delete attack-related data from the ATM to defeat post-infection forensics. In the\n\nsamples we analyzed, this network-disabling functionality was not enabled but since the code is there, we\n\ncan only assume that the developers have the intention of using this feature in the future or perhaps they\n\nhave already used it in the past and they only enable it whenever it’s needed; we can only guess. Ripper\n\nis also capable of infecting the ATMs of Diebold and Wincor Nixdorf (now Diebold Nixdorf) because it\n\ncommunicates with the hardware through the XFS API, allowing it to talk to the cash dispensers of the\n\nthree vendors without modification. Another interesting fact is that the criminal in front of the infected ATM\n\nauthenticates Ripper by means of a custom-built card with an EMV chip (similar to the Skimer malware).\n\nWhat is peculiar about this attack is that it used the corporate network as the way of entry to the ATM\n\nnetwork in order to install ATM malware. This is the first of its kind to infect ATMs without the need to\n\nphysically open the machines. As banks and vendors start fortifying their ATMs against unauthorized\n\nphysical access to the machines’ innards, we believe this is the tendency that criminals will continue with\n\nregard to ATM malware.\n\nIt is also worth noting that in this new wave of ATM attacks, the weakest link is not the physical and offline\n\ndefense mechanisms in place. In cases like this, online mechanisms are more applicable to protect banks\n\nagainst ATM victimization. We are talking about firewalls, whitelisting solutions, and other monitoring\n\nsoftware installed on ATMs while the regular OS and applications are running.\n\nAnother observation is that the first way of entry into the network is again social engineering by way\n\nof phishing emails. The weakest link in the attack’s chain of events, therefore, is the bank’s personnel,\n\nparticularly those employees who are likely to click on malicious links and open malicious executable\n\nattachments.\n\n\n-----\n\n#### ATMitch: Reads Text File as Commands\n\nATMitch was first discovered by Kaspersky in April 2017 as part of an incident in a Russian bank. Only a\n\ndynamic-link library (DLL) could be recovered; therefore, we might not have the complete picture of the\n\nattack. There are a few facts that we have observed: On the one hand this malware seems to not have a\n\nuser interface for the criminal to control and only accepts keyword commands sent through the keyboard;\n\nOn the other hand we also received reports from trusted partners that it receives a text file and interprets\n\nthe contents as commands to be executed by the malware. However, we don't know how that file would\n\nhave gotten there. Therefore, we cannot make a final call regarding how the method exactly works.\n\nIf we assume that ATMitch is part of a physical attack, the attackers would need to have complete\n\nownership of the machine, either by opening it and attaching an external keyboard on-site or perhaps by\n\nstealing the whole thing and bringing it home. The latter is unlikely, given that Kaspersky reports that the\n\nmalware was retrieved from a real-world attack to a bank.\n\nThe likeliest scenario would be to have the malware installed from the bank’s network and then control it\n\nremotely to send the right commands to dispense cash[25], with a money mule standing at the ready in front\n\nof the ATM. This theory is reinforced by the fact that ATMitch does not seem to have an authentication\n\nmechanism to control the money mule’s ability to go rogue and victimize any number of ATMs.\n\nKey Points:\n\n- ATMitch is only a component of a larger attack. We could not gather other components, so we lack\n\nthe bigger picture.\n\n- ATMitch receives commands by means of a text file pushed into the system.\n\n- ATMitch does not have authentication mechanisms in place.\n\n- ATMitch supports XFS and therefore can affect ATMs from any vendor.\n\n- ATMitch does not have a menu or user interface. The attacker needs to know the commands to issue.\n\n- ATMitch is possibly part of a network attack against a bank.\n\n\n-----\n\n# Other Noteworthy ATM Malware Attacks\n\n#### NeoPocket: A Targeted Attack\n\nNeoPocket is an information-stealing malware that targets ATMs manufactured by Diebold. S21sec\n\ndiscovered NeoPocket in April 2014.[26] Unlike the majority of ATM malware, NeoPocket does not steal\n\ncash from the ATM as it focuses on data theft only. The malware steals ATM transaction data using a man\nin-the-middle (MitM) attack and keylogs user input from specific application windows. This stolen data\n\ncan be sold in deep web markets for use in creating counterfeit payment cards and carrying out fraudulent\n\nfund transfers out of victims’ accounts. Because no cash is stolen from the ATM, the compromise tends\n\nto remain undetected for prolonged periods and thus allows the criminal group behind NeoPocket to\n\ncollect large amounts of sensitive data.\n\nNeoPocket is a very specific kind of attack because of its very targeted nature. The attackers know exactly\n\nwhat kind of defenses the machines have in place, and the malware is also designed to run for a short\n\ntime frame, after which it erases all of its traces. Since its ultimate purpose is to log all card transactions\n\non the machine, its existence would normally go unnoticed by the bank’s security team, which makes it all\n\nthe more insidious. This kind of threat is extremely difficult to fight against and suggests that the criminals\n\nhave an informant from inside the bank.\n\nKey Points:\n\n- Expert knowledge of Diebold Agilis[®] is mandatory to understand how the system is set up to\n\nsuccessfully carry out the man-in-the-middle attack.\n\n- Because no cash is stolen from the ATM, the compromise tends to remain undetected for prolonged\n\nperiods and allow the criminals behind NeoPocket to collect large amounts of sensitive data.\n\n- NeoPocket will not execute past a certain date. After that date, the malware will terminate its process\n\nbut will not uninstall itself.\n\n\n-----\n\n- Similar to other pieces of ATM malware, NeoPocket requires an installation key. This feature enables\n\nthe attackers to track and control the infected ATMs and prevents a rogue low-level operator from\n\ninstalling the malware on random ATMs to steal the collected transaction data.\n\n- NeoPocket is manually installed on the ATM. The operator uses a keyboard to input the installation\n\nkey in the pop-up installation window. NeoPocket does not communicate with the ATM’s peripheral\n\ndevices and does not have access to the ATM’s PIN pad.\n\n- NeoPocket logs user input from windows with titles: “Enter the ‘A’ key,” “Escriba la clave ‘A’,” etc. No\n\ninformation is available about what data is input in these windows and how it is input (keyboard or\n\nPIN pad). It is interesting to note that NeoPocket looks for window titles in both English and Spanish.\n\n- NeoPocket has the functionality to terminate the SMC.exe process, which is the Symantec Endpoint\n\nProtection software. We believe that NeoPocket targets certain financial institutions in Latin America.\n\nThe use of a Spanish verb such as ingresar is a clear sign that the threat comes from Latin America as\n\nopposed to Spain, since the word is used in this context in Latin America but not in Spain. Additionally,\n\nS21sec confirmed privately to us that the country where they found their sample is located in that\n\nregion.\n\n- Once operational, NeoPocket receives commands from a connected USB device. The malware uses\n\nunconventional methods to receive user commands through this USB device.\n\n#### Suceful: The Attackers’ Test Tool\n\nSuceful is an ATM malware prototyping tool that was first blogged about in September 2015 by FireEye.[27]\n\nTwo Suceful samples were uploaded to VirusTotal on Aug. 28, 2015; one sample was uploaded from\n\nFrance and the other from Russia. The origin country for VirusTotal submissions can be manipulated using\n\na VPN service, and thus the actual origins of the tool remain inconclusive.\n\nBased on reports about ATM malware families like Ploutus and Padpin-Tyupkin, Suceful was assumed\n\nto be a new ATM malware family. After careful code analysis, we have concluded that Suceful is really a\n\nprototyping tool instead of an actual piece of malware that would be deployed in ATMs. The fact that there\n\nhaven't been any cases of Suceful infections discovered or reported in the wild supports our conclusion\n\nabove. It is highly plausible that Suceful is being actively used in the development of ATM malware\n\nsamples that are in the wild but are currently undetected.\n\nKey points:\n\n- The GUI shows Suceful is targeting ATMs manufactured by Diebold and NCR. The code reveals no\n\nevidence that NCR ATMs were being targeted.\n\n- NCR ATMs are possibly a future target for the Suceful group, which may be the reason button labels\n\nfor NCR were included in the GUI.\n\n\n-----\n\n- Suceful can read track data from inserted payment cards.\n\n- Suceful can read user input from the ATM’s PIN pad.\n\n- Suceful can control operations of the ATM’s door sensors, alarm sensors, generic sensors, key switch\n\nsensors, lamp/sign indicators, auxiliary indicators, and enhanced audio controls physically attached\n\nto the machine.\n\n- Modifying sensors and indicators unit (SIU) ports suggests that physical compromise of the ATM is\n\na likely option.\n\n- There is no user access control mechanism in Suceful. This is a common feature of ATM malware\n\nsamples.\n\n- Cash-dispensing functions were not tested in Suceful. The Suceful group may be targeting payment\n\ncard data only.\n\n- The Suceful group had access to leaked Diebold Agilis XFS manuals.\n\nAlthough announced with a lot of fuss when it was first found by researchers, Suceful is just a test tool that\n\nhas never played a direct part in an attack. It does have jackpotting capabilities as well as more advanced\n\nfeatures, like enabling or disabling alarms and other special ATM hardware, but it seems to be a private\n\nway of testing these features by some malware developer. The Russian-language strings within the tool\n\nsuggest that it originated from an Eastern European criminal outfit and only made it to the research\n\ncommunity at large because of a mistake in the criminal gang’s operation.\n\nThe only relevance this tool has in the overall ATM malware story is in showing how these criminal gangs\n\nunderstand the programming capabilities that XFS as a platform has to offer and how they can use these\n\ncapabilities to their advantage. Other than that, the tool is not — and probably never will be — part of a\n\nreal attack to ATM infrastructure.\n\n\n-----\n\n# The Perpetrators of ATM Malware Attacks\n\nWhen we look at the earlier malware families and where they originate from, a clear pattern emerges.\n\nThere are two older malware pieces stemming from South America with Spanish-language strings. These\n\nstrings are likely to have been written by the developers, so their South American origin is difficult to deny.\n\nFrom those two older threats — Skimer and Ploutus — one specifically targets NCR ATMs, while the other\n\ntargets Diebold ATMs.\n\nA theory starts shaping up: Those two threats might come from the same source, or else from similar\n\nsources, and could have been created to establish comprehensive coverage of the ATM market (the third\n\nlargest ATM vendor is missing here but apparently it is not so common in this region). Remember that\n\nthese threats surfaced before XFS made it easier for ATM developers to share software, so the criminals\n\nhad to write platform-specific code. The one variable that is missing is a version of Ploutus that can only\n\nskim, instead of dispensing cash only. If it exists, such a malware has never been seen in the wild. By\n\ndesign, software skimmers are not easy to spot — unlike purely cash-dispensing malware — and they can\n\nbe active for years before a live sample is found.\n\nThe only variable left hanging is the fact that Skimer v2009 was first found in Russia and Ukraine. There\n\nis a clear link between v2009 and v2011 in terms of coding style and the way they go about infecting the\n\nsystem and accessing ATM-specific hardware. It is most likely that the original code was developed in\n\nEastern Europe and was reused by the Latin American criminal group that evolved it into a skimming-only\n\nattack.\n\nGreenDispenser is a more recent piece of malware from the same region. This particular malware seems\n\nto be a dispense-only version of Skimer and Ploutus with multivendor support. Since Skimer and Ploutus\n\nare still active, we can theorize that GreenDispenser belongs to a rival group or — given the accumulated\n\nknowledge the program seems to have — an ex-member of the first criminal group, now competing\n\nagainst them.\n\n\n-----\n\nThen, we have NeoPocket, a virtual skimming malware from Latin America. We cannot rightfully associate\n\nNeoPocket with any of the previous malware (Skimer, Ploutus, GreenDispenser), since this seems to be\n\nmuch more targeted. NeoPocket looks more like a custom-made operation against a specific bank with\n\nthe help of an insider, or perhaps the whole attack is an inside job. In any case, it looks like it is completely\n\ndifferent from the others we have analyzed.\n\nOn the other side of the world, we have a second criminal group coming from Russia, or at least a Russian\nspeaking region. This Eastern European criminal outfit seems to be behind Padpin and is targeting Russia\n\nand surrounding countries first, and then moving on to other Western European countries. We have\n\nrecently seen how a Moldovan citizen was arrested after moving to the U.K. and victimizing more than 50\n\nATMs in and around the city of London.[28] This gives credence to the existence of such a group, whose\n\nmembers would be in charge of creating cells in different western countries. We have also heard from\n\nprivate sources about isolated victimization of separate ATMs in tourist towns in Turkey with high Russian\n\naffluence. This supports the belief that Eastern European criminal group members are behind Padpin.\n\nHow does Suceful fit into this model? It is possible that the same Eastern European criminal group\n\ncreated this tool to test and debug the routines that would make it into the production-level malware,\n\neither Padpin or some other undetected Trojan.\n\nThe next biggest incident we need to carefully analyze is the one that happened in Malaysia in 2014. There\n\nare different theories around it, with the two main ones being:\n\n1. Some sources describe the attacks as coming from South America. The malware involved was also\n\ndescribed as being able to dispense 40 bills per batch.[29] This is consistent with the characteristics of\n\nPloutus, which originates from South America. Also, some reports note that the suspects captured on\n\nthe bank’s camera systems were described to have South American looks.[30]\n\n2. A different take is based on the findings of most antivirus vendors that attribute it to Padpin, which\n\nwould link this incident to Eastern European criminals. There have also been media reports linking\n\nthe same person arrested in London with the attacks in Malaysia, since the same person was in\n\nthat country on the dates the attacks took place.[31] We do not have official police reports for this\n\nincident, but based on the technical facts we have, it seems most likely that the Malaysian attack was\n\nperformed by a criminal cell from Eastern Europe using Padpin. The theory of this Eastern European\n\ncriminal group victimizing foreign sites and holiday resorts is consistent with the picture we painted\n\nabove.\n\nOn Jan. 5, 2016, the Romanian law enforcement agency DIICOT arrested what seemed to be a whole\n\ncriminal organization[32] that used Padpin to victimize ATMs in the Romania-Moldova region. This is yet\n\nanother example of the activities of these groups and the way they operate. Whether these criminals\n\ncreated Padpin or they acquired it from other criminals remains unknown.\n\n\n-----\n\nAs things stand, it looks like different criminal groups have already graduated from physical to virtual\n\nskimming via malware, thanks to the lack of security measures implemented by commercial banks\n\nworldwide. This is common in Latin America and Eastern Europe, but these criminals are exporting the\n\ntechnique and have started to victimize other countries.\n\n2009\n\n**March 2009**\n\n**SKIMER** **September 2014**\n\nFirst ATM malware variant\nobserved Most likely attributed to PADPIN\n\n**Countries targeted: Russia and** Multiple ATM hacks\nUkraine **Country targeted: Malaysia**\n\n**Perpetrators: Linked to the**\n\n**October 2014** Eastern European crime scene\n\nCriminal group arrested in London\n\n**Reported loss: €2M** **January 2016**\n\n**Countries targeted: Malaysia,**\n\n**PADPIN**\n\nU.K., Germany, and Canada\n\nBank fraud arrest\n\n**Perpetrators: Most likely tied to** 2014 **Reported loss: €13.5M**\nthe group in Malaysia incident\n\n**Perpetrators: A criminal group in**\nRomania\n\n**April 2016**\n\n**ATMITCH**\n\n**July 2016**\n\nMultiple ATM attacks[33]\n\nMultiple ATM hacks[34]\n\n**Reported loss: $800,000**\n\n2015 **Reported loss: $2M**\n\n**Countries targeted: Russia and**\nKazakhstan **Country targeted: Taiwan**\n\n**Perpetrators: Most likely** **Perpetrators: Most likely**\nconnected with Eastern European connected with Eastern European\norganized crime group organized crime group\n\n**July 2016** **August 2016**\n\n2016\n\nThree foreign citizens arrested in **RIPPER**\nTaiwan for cash-out[35]\n\nMultiple ATM attacks[36]\n\n**Perpetrators: A 16-member**\n\n**Reported loss: $13M**\n\ninternational crime ring\n\n**Country targeted: Thailand**\n\n**Perpetrators: Most likely**\n\n**November 2016** connected with Eastern European\n\n**ALICE** 2017 organized crime group\n\nA brand new ATM malware family\nfound[37] **January 2017**\n\nATM hacking arrest[38]\n\n**Reported loss: €3M**\n\n**Countries targeted: Taiwan and**\nBelarus\n\n**Perpetrators: Five Romanian and**\nMoldovan individuals\n\nFigure 6. A timeline of noteworthy ATM malware incidents\n\n\n-----\n\nAs described, we have seen network-based ATM attacks take off with both malware payloads and\n\nmanufacturers’ test tools being used to jackpot the machines. Something that all the network attacks\n\nappear to have in common is that they all come from Eastern Europe.\n\nThe current criminal landscape affecting ATM installations worldwide looks very similar to the Latin\n\nAmerican side still busy developing and using their malware, with Ploutus being the most often updated.\n\nOn the other side, we still have the Eastern European gangs, with two different business models. One of\n\nthese business models is practiced by the Padpin developers, who seem to make money by reselling their\n\nmalware to smaller gangs, which then organize smaller physical attacks in different countries with very\n\nshort durations, often spanning only one weekend.\n\nThe second kind of Eastern European gang that has recently surfaced uses hackers to infiltrate the bank’s\n\nnetwork, locate and take over the ATM network, and victimize the machines. This is a very different\n\nbusiness model from that of the Padpin gang. The appearance of the Ripper gang in the malware scene\n\ncrosses this gap very nicely: Ripper is the first ATM malware that uses the network as an infection vector.\n\nThe fact that this newcomer does not use any authentication method suggests that the developers and\n\nthe criminals are the same group of people. We believe this is the first of others to come.\n\nIt is also worth mentioning that the criminals behind the Padpin malware is very active in trying to monetize\n\ntheir creation. These people are reselling in the underground both access to the malware and instructions\n\non how to access the insides of ATMs to enable the infection. They seem to be doing this mostly from the\n\nTor network in order to remain anonymous.\n\nIn the same way, the authors of Ploutus — or somebody, who claims to have the source code — are also\n\nreselling it. These criminals might not be the original developers, since they do not seem to provide full\n\ninstructions and they leave it up to the seller to figure out how the malware works. It might also be a fake\n\nclaim and these people could be trying to swindle other would-be criminals. In any case, the fact remains\n\nthat ATM malware is picking up notoriety in criminal circles.\n\n\n-----\n\nFigure 7. Product description for Ploutus in a listing posted by an alleged author of the malware on a\ndeep web marketplace\n\nFigure 8. Listing for Ploutus posted by another alleged author of the malware on a deep web\nmarketplace\n\n\n-----\n\nFigure 9. Ploutus is sold on a deep web marketplace by an alleged author of the malware for\nas little as $10\n\nDuring the course of this research, we have not seen any noteworthy or prevalent ATM malware attacks in\n\nthe United States and Canada. This is perhaps because of cybercriminals thinking that they are less likely\n\nto get caught by prominent law enforcement agencies if they stay away from attacking bigger countries.\n\nHowever, with amateur to highly skilled cybercriminals continuing to develop, sell, and use ATM malware\n\nin the underground, we believe it is only a matter of time before we see attacks in those regions.\n\n\n-----\n\n# Conclusion\n\nCybercriminals had already discovered that ATMs were vulnerable to software hacking and malware\n\ninfections at around 2009. Since then, more and more criminal groups have tried their hand at these types\n\nof attacks and succeeded. More malware families have been surfacing and this trend has been picking\n\nup speed since 2015. Through Trend Micro’s joint efforts with Europol, we have presented that 2016\n\nbrought us a new and unnerving development: The criminals have realized that not only can ATMs be\n\nphysically attacked, but it is also very possible for these machines to be accessed through the network.\n\nOnce cybercriminals manage to install malware and get hold of the network, they can go ahead and steal\n\ncash from the machines.\n\nCybercriminals who compromise networks have the same end goal as those who carry out attacks via\n\nphysical access: to dispense cash. However, instead of manually installing malware on ATMs through\n\nUSB or CD, the criminals would not need to go to the machines anymore. They have standby money\n\nmules that would pick up the cash and go.\n\nIt could be that these are regular criminal groups that already had access to the bank’s network and\n\neventually realized that they could hop onto the ATM network. In Ripper’s case, though, it shows that\n\nsome of these criminals are specifically looking for the ATM network as a target and not stumbling upon\n\nit by mere chance. These gangs have both the inclination and the technical knowledge to target these\n\nmachines over any other resources of the targeted bank. While network attacks have not been reported\n\nin bigger regions such as the United States and Canada, we believe this to be a new tendency that is\n\nprobably going to consolidate in 2017 and beyond.\n\nIn this respect, the cat is out of the bag. In the past, banks might have thought that network segregation\n\nwas enough to keep their ATM networks safe from cyber crooks. This is no longer the case. Law\n\nenforcement agencies should be well-informed that criminals have ATMs firmly in their crosshairs, and\n\nfinancial organizations need to take more steps to secure their ATM installations by deploying more\n\nsecurity layers.\n\nIt's also worth pointing out that there has been a considerable effort undertaken by banks, ATM vendors\n\nand security companies to create and deploy solutions that solve all of the security gaps outlined in every\n\nsingle attack vector covered in this paper. This does not mean that ATMs can be 100 percent secured\n\nbecause at the end of the day nothing can be. However, a well-designed security plan can go a long way\n\ntowards ensuring that an ATM installation can become very difficult to exploit and victimize.\n\n\n-----\n\n#### References\n\n1. International Organization for Standardization. (2003). “ISO 8583-1:2003 Financial transaction card originated messages –\nInterchange message specifications – Part 1: Messages, data elements and code values.” Last accessed on 29 May 2017 at\n[http://www.iso.org/iso/home/store/catalogue_tc/catalogue_detail.htm?csnumber=31628.](http://)\n\n2. International Organization for Standardization. (1998). “ISO 8583-1:2003 Financial transaction card originated messages –\nInterchange message specifications – Part 2: Application and registration procedures for Institution Identification Codes (IIC).”\n[Last accessed on 29 May 2017 at http://www.iso.org/iso/home/store/catalogue_tc/catalogue_detail.htm?csnumber=23632.](http://)\n\n3. International Organization for Standardization. (2003). “ISO 8583-1:2003 Financial transaction card originated messages –\nInterchange message specifications – Part 3: Maintenance procedures for messages, data elements and code values.” Last\n[accessed on 29 May 2017 at http://www.iso.org/iso/home/store/catalogue_tc/catalogue_detail.htm?csnumber=35363.](http://)\n\n4. [EFT Lab. (2015). “TPDU – The Transaction Protocol Data Unit.” Last accessed on 29 May 2017 at https://www.eftlab.co.uk/](http://)\n[index.php/site-map/our-articles/295-tpdu-the-transaction-protocol-data-unit.](http://)\n\n5. Brian Krebs. (2014). “Thieves Planted Malware to Hack ATMs”. Last accessed on 2 June 2017 at [https://krebsonsecurity.](http://)\n[com/2014/05/thieves-planted-malware-to-hack-atms/.](http://)\n\n6. [Wikimedia Foundation, Inc. (2015). “CEN/XFS.” Last accessed on 2 June 2017 at https://en.wikipedia.org/wiki/CEN/XFS.](http://)\n\n7. European Committee for Standardization. (2000). “Extensions for Financial Services (XFS) interface specification - Release 3.0\n– Part 1: Application Programming Interface (API) - Service Provider Interface (SPI); Programmer’s Reference.” Last accessed\n[on 1 August 2017 at http://read.pudn.com/downloads135/sourcecode/others/573815/01-Application%20Programming%20](http://read.pudn.com/downloads135/sourcecode/others/573815/01-Application%20Programming%20Interface.pdf)\n[Interface.pdf.](http://read.pudn.com/downloads135/sourcecode/others/573815/01-Application%20Programming%20Interface.pdf)\n\n8. [Vanja Svajcer. (2009). “Credit card skimming malware targeting ATMs.” Last accessed on 29 May 2017 at https://nakedsecurity.](http://)\n[sophos.com/2009/03/17/credit-card-skimming-malware-targeting-atms/.](http://)\n\n9. [Kim Zetter. (2009). “New ATM malware captures PINS and Cash – Updated.” Last accessed on 29 May 2017 at http://www.](http://www.wired.com/2009/06/new-atm-malware-captures-pins-and-cash/)\n[wired.com/2009/06/new-atm-malware-captures-pins-and-cash/.](http://www.wired.com/2009/06/new-atm-malware-captures-pins-and-cash/)\n\n10. Graham Cluley. (2009). “More details on the Diebold ATM Trojan horse case.” Last accessed on 29 May 2017 at [https://](https://nakedsecurity.sophos.com/2009/03/18/details-diebold-atm-trojan-horse-case/)\n[nakedsecurity.sophos.com/2009/03/18/details-diebold-atm-trojan-horse-case/.](https://nakedsecurity.sophos.com/2009/03/18/details-diebold-atm-trojan-horse-case/)\n\n[11. Daniel Regalado. (2013). “Backdoor.Ploutus Reloaded – Ploutus Leaves Mexico.” Last accessed on 29 May 2017 at http://](http://www.symantec.com/connect/blogs/backdoorploutus-reloaded-ploutus-leaves-mexico)\n[www.symantec.com/connect/blogs/backdoorploutus-reloaded-ploutus-leaves-mexico.](http://www.symantec.com/connect/blogs/backdoorploutus-reloaded-ploutus-leaves-mexico)\n\n12. Daniel Regalado. (2014). “Texting ATMs for Cash Shows Cybercriminals Increasing Sophistication.” Last accessed on 29 May\n[2017 at https://www.symantec.com/connect/blogs/texting-atms-cash-shows-cybercriminals-increasing-sophistication.](https://www.symantec.com/connect/blogs/texting-atms-cash-shows-cybercriminals-increasing-sophistication)\n\n[13. Daniel Regalado. (2014). “Backdoor.Padpin.” Last accessed on 29 May 2017 at https://www.symantec.com/security_response/](https://www.symantec.com/security_response/writeup.jsp%3Fdocid%3D2014-051213-0525-99)\n[writeup.jsp?docid=2014-051213-0525-99.](https://www.symantec.com/security_response/writeup.jsp%3Fdocid%3D2014-051213-0525-99)\n\n[14. FSLabs. (2014). “NCR ATM API Documentation Available on Baidu.” Last accessed on 29 May 2017 at https://www.f-secure.](https://www.f-secure.com/weblog/archives/00002751.html)\n[com/weblog/archives/00002751.html.](https://www.f-secure.com/weblog/archives/00002751.html)\n\n15. Kaspersky Lab’s Global Research & Analysis Team. (2014). “Tyupkin: manipulating ATM machines with malware.” Last\n[accessed on 29 May 2017 at https://securelist.com/tyupkin-manipulating-atm-machines-with-malware/66988/.](https://securelist.com/tyupkin-manipulating-atm-machines-with-malware/66988/)\n\n[16. Suzanne Cluckey. (2014). “Can the ATM industry stop Tyupkin in its tracks?” Last accessed on 29 May 2017 at http://www.](http://www.atmmarketplace.com/articles/can-the-atm-industry-stop-tyupkin-in-its-tracks/)\n[atmmarketplace.com/articles/can-the-atm-industry-stop-tyupkin-in-its-tracks/.](http://www.atmmarketplace.com/articles/can-the-atm-industry-stop-tyupkin-in-its-tracks/)\n\n[17. Thoufique Haq. (2015). “Meet GreenDispenser: A New Breed of ATM Malware.” Last accessed on 29 May 2017 at https://www.](https://www.proofpoint.com/us/threat-insight/post/Meet-GreenDispenser)\n[proofpoint.com/us/threat-insight/post/Meet-GreenDispenser.](https://www.proofpoint.com/us/threat-insight/post/Meet-GreenDispenser)\n\n\n-----\n\n18. David Sancho and Numaan Huq. (2016). “Alice: A Lightweight, Compact, No-Nonsense ATM Malware.” Last accessed on\n6 June 2017 at [http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-](http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-malware/)\n[malware/.](http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-malware/)\n\n[19. Huang Yan Fen. (2016). “【詳細圖解】駭客入侵一銀ATM流程追追.” Last accessed on 6 June 2017 at http://www.ithome.com.tw/](http://www.ithome.com.tw/news/107294)\n[news/107294.](http://www.ithome.com.tw/news/107294)\n\n[20. Group-IB. (2016). “Cobalt: logical attacks on ATMs.” Last accessed on 6 June 2017 at http://www.group-ib.com/cobalt.html.](http://www.group-ib.com/cobalt.html)\n\n[21. Kaspersky Labs. (2015). “Carbanak APT: The Great Bank Robbery.” Last accessed on 6 June 2017 at https://securelist.com/](https://securelist.com/files/2015/02/Carbanak_APT_eng.pdf)\n[files/2015/02/Carbanak_APT_eng.pdf.](https://securelist.com/files/2015/02/Carbanak_APT_eng.pdf)\n\n[22. Group-IB and Fox-It. (2014). “Anunak: APT against Financial Institutions.” Last accessed on 6 June 2017 at http://www.group-](http://www.group-ib.com/files/Anunak_APT_against_financial_institutions.pdf)\n[ib.com/files/Anunak_APT_against_financial_institutions.pdf.](http://www.group-ib.com/files/Anunak_APT_against_financial_institutions.pdf)\n\n23. Wichit Chantanusornsiri and online reporters. (2016). “10,000 ATMs nationwide hack-prone.” Last accessed on 6 June 2017\n[at http://www.bangkokpost.com/archive/10-000-atms-nationwide-hack-prone/1069237.](http://www.bangkokpost.com/archive/10-000-atms-nationwide-hack-prone/1069237)\n\n[24. NCR Corporation. (2016). “NCR Security Update: Malware Attacks in Thailand.” Last accessed on 6 June 2017 at https://](https://www.ncr.com/sites/default/files/ncr_security_alert_-_2016-12_network_malware_attack_in_thailand_-_sdms_160829_final_for_review.pdf)\n[www.ncr.com/sites/default/files/ncr_security_alert_-_2016-12_network_malware_attack_in_thailand_-_sdms_160829_final_](https://www.ncr.com/sites/default/files/ncr_security_alert_-_2016-12_network_malware_attack_in_thailand_-_sdms_160829_final_for_review.pdf)\n[for_review.pdf.](https://www.ncr.com/sites/default/files/ncr_security_alert_-_2016-12_network_malware_attack_in_thailand_-_sdms_160829_final_for_review.pdf)\n\n25. Sergey Golovanov. (2017). “ATMitch: remote administration of ATMs.” Last accessed on 6 June 2017 at [https://securelist.](https://securelist.com/77918/atmitch-remote-administration-of-atms/)\n[com/77918/atmitch-remote-administration-of-atms/.](https://securelist.com/77918/atmitch-remote-administration-of-atms/)\n\n26. Jozsef Gegeny and Santiago Vicente. (2014). “NeoPocket: A new ATM malware.” Last accessed on 31 May 2017 at https://\nwww.s21sec.com/en/blog/2014/04/neopocket-a-new-atm-malware/.\n\n[27. Daniel Regalado. (2015). “SUCEFUL: Next Generation ATM Malware.” Last accessed on 2 June 2017 at https://www.fireeye.](https://www.fireeye.com/blog/threat-research/2015/09/suceful_next_genera.html)\n[com/blog/threat-research/2015/09/suceful_next_genera.html.](https://www.fireeye.com/blog/threat-research/2015/09/suceful_next_genera.html)\n\n28. Sam Adams. (2015). “Grigore Paladi: Gang member jailed for helping steal £1.6m from cash machines in ONE weekend.” Last\n[accessed on 5 June 2017 at http://www.mirror.co.uk/news/uk-news/grigore-paladi-gang-member-jailed-5115228.](http://www.mirror.co.uk/news/uk-news/grigore-paladi-gang-member-jailed-5115228)\n\n29. Finance Twitter. (2014). “Here’s How Malaysian ATMs were Hacked of RM3 Million by Latin Americans.” Last accessed on\n5 June 2017 at [http://www.financetwitter.com/2014/09/here-is-how-malaysian-atms-were-hacked-of-rm3-million-by-latin-](http://www.financetwitter.com/2014/09/here-is-how-malaysian-atms-were-hacked-of-rm3-million-by-latin-americans.html)\n[americans.html.](http://www.financetwitter.com/2014/09/here-is-how-malaysian-atms-were-hacked-of-rm3-million-by-latin-americans.html)\n\n30. Opalyn Mok. (2014). “Bank in Bayan Baru latest target of ATM hacking.” Last accessed on 5 June 2017 at [http://www.](http://www.themalaymailonline.com/malaysia/article/bank-in-bayan-baru-latest-target-of-atm-hacking)\n[themalaymailonline.com/malaysia/article/bank-in-bayan-baru-latest-target-of-atm-hacking.](http://www.themalaymailonline.com/malaysia/article/bank-in-bayan-baru-latest-target-of-atm-hacking)\n\n[31. Atiqa Hazellah. (2014). “ATM theft suspect to be charged in UK.” Last accessed on 5 June 2017 at http://www.nst.com.my/](http://www.nst.com.my/news/2015/09/atm-theft-suspect-be-charged-uk)\n[news/2015/09/atm-theft-suspect-be-charged-uk.](http://www.nst.com.my/news/2015/09/atm-theft-suspect-be-charged-uk)\n\n32. DIICOT. (2016). “Comunicat de presa 05.01.2016.” Last accessed on 5 June 2017 at [http://www.diicot.ro/index.php/](http://www.diicot.ro/index.php/arhiva/1643-comunicat-de-presa-05-01-2016)\n[arhiva/1643-comunicat-de-presa-05-01-2016.](http://www.diicot.ro/index.php/arhiva/1643-comunicat-de-presa-05-01-2016)\n\n33. Bradley Barth. (2017). “Clues from Russian banking machine theft leads investigators to ATMitch malware.” Last accessed\non 1 June 2017 at [https://www.scmagazine.com/clues-from-russian-banking-machine-theft-leads-investigators-to-atmitch-](https://www.scmagazine.com/clues-from-russian-banking-machine-theft-leads-investigators-to-atmitch-malware/article/648423/)\n[malware/article/648423/.](https://www.scmagazine.com/clues-from-russian-banking-machine-theft-leads-investigators-to-atmitch-malware/article/648423/)\n\n[34. Ivana Kottsova. (2016). “Hackers steal millions from ATMs without using a card.” Last accessed on 1 June 2017 at http://](http://money.cnn.com/2016/07/14/news/bank-atm-heist-taiwan/)\n[money.cnn.com/2016/07/14/news/bank-atm-heist-taiwan/.](http://money.cnn.com/2016/07/14/news/bank-atm-heist-taiwan/)\n\n35. Faith Hung. (2016). “Taiwan says foreign suspects arrested over $2 million ATM cyber robbery.” Last accessed on 1 June 2017\n[at http://www.reuters.com/article/us-taiwan-banks-theft-idUSKCN0ZX0N7.](http://www.reuters.com/article/us-taiwan-banks-theft-idUSKCN0ZX0N7)\n\n\n-----\n\n[36. Daniel Regalado. (2016). “RIPPER ATM Malware and the 12 Million Baht Jackpot.” Last accessed on 1 June 2017 at https://](https://www.fireeye.com/blog/threat-research/2016/08/ripper_atm_malwarea.html)\n[www.fireeye.com/blog/threat-research/2016/08/ripper_atm_malwarea.html.](https://www.fireeye.com/blog/threat-research/2016/08/ripper_atm_malwarea.html)\n\n37. David Sancho and Numaan Huq. (2016). “Alice: A Lightweight, Compact, No-Nonsense ATM Malware.” Last accessed on\n1 June 2017 at [http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-](http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-malware/)\n[malware/.](http://blog.trendmicro.com/trendlabs-security-intelligence/alice-lightweight-compact-no-nonsense-atm-malware/)\n\n38. Mohit Kumar. (2017). “Police Arrest 5 Cyber Thieves Who Stole 3.2 Million From ATMs Using Malware.” Last accessed on 1\n[June 2017 at http://thehackernews.com/2017/01/atm-hack-malware.html.](http://thehackernews.com/2017/01/atm-hack-malware.html)\n\n\n-----\n\nCreated by:\n\nThe Global Technical Support and R&D Center of TREND MICRO\n\nTREND MICRO[TM]\n\nTrend Micro Incorporated, a global cloud security leader, creates a world safe for exchanging digital information with its Internet content security and\n\nthreat management solutions for businesses and consumers. A pioneer in server security with over 20 years experience, we deliver top-ranked client,\n\nserver, and cloud-based security that fits our customers’ and partners’ needs; stops new threats faster; and protects data in physical, virtualized, and\n\ncloud environments. Powered by the Trend Micro™ Smart Protection Network™ infrastructure, our industry-leading cloud-computing security technology,\n\nproducts and services stop threats where they emerge, on the Internet, and are supported by 1,000+ threat intelligence experts around the globe.\n\nFor additional information, visit www.trendmicro.com.\n\nwww.trendmicro.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/white_papers/wp-cashing-in-on-atm-malware.pdf"
    ],
    "report_names": [
        "wp-cashing-in-on-atm-malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1522403269,
    "ts_modification_date": 1522403277,
    "files": {
        "pdf": "https://archive.orkl.eu/b76a490ed0318d173fd53a7c87ea84606de26c3a.pdf",
        "text": "https://archive.orkl.eu/b76a490ed0318d173fd53a7c87ea84606de26c3a.txt",
        "img": "https://archive.orkl.eu/b76a490ed0318d173fd53a7c87ea84606de26c3a.jpg"
    }
}