{
    "id": "f0840d0f-89b1-49f1-87b8-1a0025c498b4",
    "created_at": "2023-01-12T15:09:10.927803Z",
    "updated_at": "2025-03-27T02:17:11.818694Z",
    "deleted_at": null,
    "sha1_hash": "c530150c13410bd73d2219e8bb3b134ed6a8e92b",
    "title": "2018-08-22 - The Untold Story of NotPetya, the Most Devastating Cyberattack in History",
    "authors": "",
    "file_creation_date": "2022-08-18T03:43:47Z",
    "file_modification_date": "2022-08-18T03:43:47Z",
    "file_size": 977214,
    "plain_text": "# The Untold Story of NotPetya, the Most Devastating Cyberattack in History\n\n**[wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)**\n\nAndy Greenberg, Excerpt August 21, 2018\n\nIt was a perfect sunny summer afternoon in Copenhagen when the world’s largest shipping\nconglomerate began to lose its mind.\n\nThe headquarters of A.P. Møller-Maersk sits beside the breezy, cobblestoned esplanade of\nCopenhagen’s harbor. A ship’s mast carrying the Danish flag is planted by the building’s\nnortheastern corner, and six stories of blue-tinted windows look out over the water, facing a\ndock where the Danish royal family parks its yacht. In the building’s basement, employees\ncan browse a corporate gift shop, stocked with Maersk-branded bags and ties, and even a\nrare [Lego model of the company’s gargantuan Triple-E container ship, a vessel roughly as](https://www.wired.com/tag/legos/)\nlarge as the Empire State Building laid on its side, capable of carrying another Empire State\nBuilding–sized load of cargo stacked on top of it.\n\nThat gift shop also houses a technology help center, a single desk manned by IT\ntroubleshooters next to the shop’s cashier. And on the afternoon of June 27, 2017, confused\nMaersk staffers began to gather at that help desk in twos and threes, almost all of them\ncarrying laptops. On the machines’ screens were messages in red and black lettering. Some\nread “repairing file system on C:” with a stark warning not to turn off the computer. Others,\nmore surreally, read “oops, your important files are encrypted” and demanded a payment of\n$300 worth of bitcoin to decrypt them.\n\n\n-----\n\n[September 2018. Subscribe to WIRED.](https://subscribe.wired.com/subscribe/wired/117132?source=COVER_INSET_CMUNIT)\n\nMike McQuade\nAcross the street, an IT administrator named Henrik Jensen was working in another part of\nthe Maersk compound, an ornate white-stone building that in previous centuries had served\nas the royal archive of maritime maps and charts. (Henrik Jensen is not his real name. Like\nalmost every Maersk employee, customer, or partner I interviewed, Jensen feared the\nconsequences of speaking publicly for this story.) Jensen was busy preparing a software\nupdate for Maersk’s nearly 80,000 employees when his computer spontaneously restarted.\n\nHe quietly swore under his breath. Jensen assumed the unplanned reboot was a typically\nbrusque move by Maersk’s central IT department, a little-loved entity in England that\noversaw most of the corporate empire, whose eight business units ranged from ports to\nlogistics to oil drilling, in 574 offices in 130 countries around the globe.\n\nJensen looked up to ask if anyone else in his open-plan office of IT staffers had been so\nrudely interrupted. And as he craned his head, he watched every other computer screen\naround the room blink out in rapid succession.\n\n“I saw a wave of screens turning black. Black, black, black. Black black black black black,”\nhe says. The PCs, Jensen and his neighbors quickly discovered, were irreversibly locked.\nRestarting only returned them to the same black screen.\n\nAll across Maersk headquarters, the full scale of the crisis was starting to become clear.\nWithin half an hour, Maersk employees were running down hallways, yelling to their\ncolleagues to turn off computers or disconnect them from Maersk’s network before the\nmalicious software could infect them, as it dawned on them that every minute could mean\ndozens or hundreds more corrupted PCs. Tech workers ran into conference rooms and\nunplugged machines in the middle of meetings. Soon staffers were hurdling over locked key[card gates, which had been paralyzed by the still-mysterious malware, to spread the warning](https://www.wired.com/tag/malware/)\nto other sections of the building.\n\nDisconnecting Maersk’s entire global network took the company’s IT staff more than two\npanicky hours. By the end of that process, every employee had been ordered to turn off their\ncomputer and leave it at their desk. The digital phones at every cubicle, too, had been\nrendered useless in the emergency network shutdown.\n\nMost Popular\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\n\n-----\n\nAround 3 pm, a Maersk executive walked into the room where Jensen and a dozen or so of\nhis colleagues were anxiously awaiting news and told them to go home. Maersk’s network\nwas so deeply corrupted that even IT staffers were helpless. A few of the company’s more\nold-school managers told their teams to remain at the office. But many employees—rendered\nentirely idle without computers, servers, routers, or desk phones—simply left.\n\nJensen walked out of the building and into the warm air of a late June afternoon. Like the\nvast majority of Maersk staffers, he had no idea when he might return to work. The maritime\ngiant that employed him, responsible for 76 ports on all sides of the earth and nearly 800\nseafaring vessels, including container ships carrying tens of millions of tons of cargo,\nrepresenting close to a fifth of the entire world’s shipping capacity, was dead in the water.\n\nMike Mcquade\n\nOn the edge of the trendy Podil neighborhood in the Ukrainian capital of Kiev, coffee shops\nand parks abruptly evaporate, replaced by a grim industrial landscape. Under a highway\noverpass, across some trash-strewn railroad tracks, and through a concrete gate stands the\nfour-story headquarters of Linkos Group, a small, family-run Ukrainian software business.\n\nUp three flights of stairs in that building is a server room, where a rack of ­pizza-box-sized\ncomputers is connected by a tangle of wires and marked with handwritten, numbered labels.\nOn a normal day, these servers push out routine updates—bug fixes, security patches, new\nfeatures—to a piece of accounting software called M.E.Doc, which is more or less Ukraine’s\nequivalent of TurboTax or Quicken. It’s used by nearly anyone who files taxes or does\nbusiness in the country.\n\nBut for a moment in 2017, those machines served as ground zero for the most devastating\ncyberattack since the invention of the internet—an attack that began, at least, as an assault\non one nation by another.\n\nFor the past four and a half years, Ukraine has been locked in a grinding, undeclared war\nwith Russia that has killed more than 10,000 Ukrainians and displaced millions more. The\n[conflict has also seen Ukraine become a scorched-earth testing ground for Russian](https://www.wired.com/story/russian-hackers-attack-ukraine/)\n[cyberwar tactics. In 2015 and 2016, while the Kremlin-linked hackers known as Fancy Bear](https://www.wired.com/story/mueller-indictment-dnc-hack-russia-fancy-bear/)\nwere busy breaking into the US Democratic National Committee’s servers, another group of\n[agents known as Sandworm was hacking into dozens of Ukrainian governmental](https://www.wired.com/story/russian-hacking-teams-infrastructure/)\norganizations and companies. They penetrated the networks of victims ranging from media\noutlets to railway firms, detonating logic bombs that destroyed terabytes of data. The attacks\nfollowed a sadistic seasonal cadence. In the winters of both years, the saboteurs capped off\ntheir destructive sprees by causing widespread power outages—the first confirmed blackouts\ninduced by hackers.\n\n\n-----\n\nBut those attacks still weren t Sandworm s grand finale. In the spring of 2017, unbeknownst\nto anyone at Linkos Group, Russian military hackers hijacked the company’s update servers\nto allow them a hidden back door into the thousands of PCs around the country and the\nworld that have M.E.Doc installed. Then, in June 2017, the saboteurs used that back door to\n[release a piece of malware called ­NotPetya, their most vicious cyberweapon yet.](https://www.wired.com/story/petya-ransomware-ukraine/)\n\nThe code that the hackers pushed out was honed to spread automatically, rapidly, and\nindiscriminately. “To date, it was simply the fastest-propagating piece of malware we’ve ever\n[seen,” says Craig Williams, director of outreach at Cisco’s Talos division, one of the first](https://www.wired.com/tag/cisco/)\nsecurity companies to reverse engineer and analyze Not­Petya. “By the second you saw it,\nyour data center was already gone.”\n\nNotPetya was propelled by two powerful hacker exploits working in tandem: One was a\n[penetration tool known as EternalBlue, created by the US National Security Agency but](https://www.wired.com/story/eternalblue-leaked-nsa-spy-tool-hacked-world/)\nleaked in a disastrous breach of the agency’s ultrasecret files earlier in 2017. EternalBlue\ntakes advantage of a vulnerability in a particular Windows protocol, allowing hackers free\nrein to remotely run their own code on any unpatched machine.\n\nMost Popular\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nNotPetya’s architects combined that digital skeleton key with an older invention known as\n[Mimikatz, created as a proof of concept by French security researcher Benjamin Delpy in](https://www.wired.com/story/how-mimikatz-became-go-to-hacker-tool/)\n2011. Delpy had originally released Mimikatz to demonstrate that Windows left users’\npasswords lingering in computers’ memory. Once hackers gained initial access to a\ncomputer, Mimikatz could pull those passwords out of RAM and use them to hack into other\nmachines accessible with the same credentials. On networks with multiuser computers, it\ncould even allow an automated attack to hopscotch from one machine to the next.\n\nBefore NotPetya’s launch, Microsoft had released a patch for its EternalBlue vulnerability.\nBut EternalBlue and Mimikatz together nonetheless made a virulent combination. “You can\ninfect computers that aren’t patched, and then you can grab the passwords from those\n\n\n-----\n\ncomputers to infect other computers that are patched, Delpy says.\n\n[NotPetya took its name from its resemblance to the ransomware Petya, a piece of criminal](https://www.wired.com/story/petya-ransomware-outbreak-eternal-blue/)\ncode that surfaced in early 2016 and extorted victims to pay for a key to unlock their files. But\nNotPetya’s ransom messages were only a ruse: The malware’s goal was purely destructive.\nIt irreversibly encrypted computers’ master boot records, the deep-seated part of a machine\nthat tells it where to find its own operating system. Any ransom payment that victims tried to\nmake was futile. No key even existed to reorder the scrambled noise of their computer’s\ncontents.\n\nThe weapon’s target was Ukraine. But its blast radius was the entire world. “It was the\nequivalent of using a nuclear bomb to achieve a small tactical victory,” Bossert says.\n\n[The release of NotPetya was an act of cyberwar by almost any definition—one that was](https://www.wired.com/tag/cyberwar/)\nlikely more explosive than even its creators intended. Within hours of its first appearance, the\nworm raced beyond Ukraine and out to countless machines around the world, from hospitals\nin Pennsylvania to a chocolate factory in Tasmania. It ­crippled multinational companies\nincluding Maersk, pharmaceutical giant Merck, FedEx’s European subsidiary TNT Express,\nFrench construction company Saint-Gobain, food producer Mondelēz, and manufacturer\nReckitt Benckiser. In each case, it inflicted nine-figure costs. It even spread back to Russia,\nstriking the state oil company Rosneft.\n\nThe result was more than $10 billion in total damages, according to a White House\n[assessment confirmed to WIRED by former Homeland Security adviser Tom Bossert, who at](https://www.wired.com/2017/02/tom-bossert-trump-cybersecurity/)\nthe time of the attack was President Trump’s most senior cybersecurity-­focused official.\n[Bossert and US intelligence agencies also confirmed in February that Russia’s military—the](https://www.wired.com/story/white-house-russia-notpetya-attribution/)\nprime suspect in any cyberwar attack targeting Ukraine—was responsible for launching the\nmalicious code. (The Russian foreign ministry declined to answer repeated requests for\ncomment.)\n\nTo get a sense of the scale of NotPetya’s damage, consider the nightmarish but more typical\nransomware attack that paralyzed the city government of Atlanta this past March: It cost up\n[to $10 million, a tenth of a percent of NotPetya’s price. Even WannaCry, the more notorious](https://www.wired.com/tag/wannacry/)\nworm that spread a month before NotPetya in May 2017, is estimated to have cost between\n$4 billion and $8 billion. Nothing since has come close. “While there was no loss of life, it\nwas the equivalent of using a nuclear bomb to achieve a small tactical victory,” Bossert says.\n“That’s a degree of recklessness we can’t tolerate on the world stage.”\n\nIn the year since NotPetya shook the world, WIRED has delved into the experience of one\ncorporate goliath brought to its knees by Russia’s worm: Maersk, whose malware fiasco\nuniquely demonstrates the danger that cyberwar now poses to the infrastructure of the\nmodern world. The executives of the shipping behemoth, like every other non-Ukrainian\n\n\n-----\n\nvictim WIRED approached to speak about NotPetya, declined to comment in any official\ncapacity for this story. WIRED’s account is instead assembled from current and former\nMaersk sources, many of whom chose to remain anonymous.\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nBut the story of NotPetya isn’t truly about Maersk, or even about Ukraine. It’s the story of a\nnation-state’s weapon of war released in a medium where national borders have no\nmeaning, and where collateral damage travels via a cruel and unexpected logic: Where an\nattack aimed at Ukraine strikes Maersk, and an attack on Maersk strikes everywhere at\nonce.\n\nOleksii Yasinsky expected a calm Tuesday at the office. It was the day before Ukraine’s\nConstitution Day, a national holiday, and most of his coworkers were either planning their\nvacations or already taking them. But not Yasinsky. For the past year he’d been the head of\nthe cyber lab at Information Systems Security Partners, a company that was quickly\nbecoming the go-to firm for victims of Ukraine’s cyberwar. That job description didn’t lend\nitself to downtime. Since the first blows of Russia’s cyberattacks hit in late 2015, in fact, he’d\nallowed himself a grand total of one week off.\n\n\n-----\n\nSo Yasinsky was unperturbed when he received a call that morning from ISSP s director\ntelling him that Oschadbank, the second-largest bank in Ukraine, was under attack. The\nbank had told ISSP that it was facing a ransomware infection, an increasingly common crisis\nfor companies around the world targeted by profit-focused cybercriminals. But when\nYasinsky walked into Oschadbank’s IT department at its central Kiev office half an hour later,\nhe could tell this was something new. “The staff were lost, confused, in a state of shock,”\nYasinsky says. Around 90 percent of the bank’s thousands of computers were locked,\nshowing NotPetya’s “repairing disk” messages and ransom screens.\n\nAfter a quick examination of the bank’s surviving logs, Yasinsky could see that the attack was\nan automated worm that had somehow obtained an administrator’s credentials. That had\nallowed it to rampage through the bank’s network like a prison inmate who has stolen the\nwarden’s keys.\n\nAs he analyzed the bank’s breach back in ISSP’s office, Yasinsky started receiving calls and\nmessages from people around Ukraine, telling him of similar instances in other companies\nand government agencies. One told him that another victim had attempted to pay the\nransom. As Yasinsky suspected, the payment had no effect. This was no ordinary\nransomware. “There was no silver bullet for this, no antidote,” he says.\n\nThe Cost of NotPetya\n\nIn 2017, the malware NotPetya spread from the servers of an unassuming Ukrainian\nsoftware firm to some of the largest businesses worldwide, paralyzing their operations.\nHere’s a list of the approximate damages reported by some of the worm’s biggest victims.\n\n$870,000,000\n\nPharmaceutical company Merck\n\n$400,000,000\n\nDelivery company FedEx (through European subsidiary TNT Express)\n\n$384,000,000\n\nFrench construction company Saint-Gobain\n\n$300,000,000\n\nDanish shipping company Maersk\n\n$188,000,000\n\nSnack company Mondelēz (parent company of Nabisco and Cadbury)\n\n\n-----\n\n$129,000,000\n\nBritish manufacturer Reckitt Benckiser (owner of Lysol and Durex condoms)\n\n$10 billion\n\nTotal damages from NotPetya, as estimated by the White House\n\nA thousand miles to the south, ISSP CEO Roman Sologub was attempting to take a\nConstitution Day vacation on the southern coast of Turkey, preparing to head to the beach\nwith his family. His phone, too, began to explode with calls from ISSP clients who were either\nwatching NotPetya tear across their networks or reading news of the attack and frantically\nseeking advice.\n\nSologub retreated to his hotel, where he’d spend the rest of the day fielding more than 50\ncalls from customers reporting, one after another after another, that their networks had been\ninfected. ISSP’s security operations center, which monitored the networks of clients in real\ntime, warned Sologub that NotPetya was saturating victims’ systems with terrifying speed: It\ntook 45 seconds to bring down the network of a large Ukrainian bank. A portion of one major\nUkrainian transit hub, where ISSP had installed its equipment as a demonstration, was fully\ninfected in 16 seconds. Ukrenergo, the energy company whose network ISSP had been\nhelping to rebuild after the 2016 blackout cyberattack, had also been struck yet again. “Do\nyou remember we were about to implement new security controls?” Sologub recalls a\nfrustrated Ukrenergo IT director asking him on the phone. “Well, too late.”\n\nBy noon, ISSP’s founder, a serial entrepreneur named Oleh Derevianko, had sidelined his\nvacation too. Derevianko was driving north to meet his family at his village house for the\nholiday when the NotPetya calls began. Soon he had pulled off the highway and was working\nfrom a roadside restaurant. By the early afternoon, he was warning every executive who\ncalled to unplug their networks without hesitation, even if it meant shutting down their entire\ncompany. In many cases, they’d already waited too long. “By the time you reached them, the\ninfrastructure was already lost,” Derevianko says.\n\nOn a national scale, NotPetya was eating Ukraine’s computers alive. It would hit at least four\nhospitals in Kiev alone, six power companies, two airports, more than 22 Ukrainian banks,\nATMs and card payment systems in retailers and transport, and practically every federal\nagency. “The government was dead,” summarizes Ukrainian minister of infrastructure\nVolodymyr Omelyan. According to ISSP, at least 300 companies were hit, and one senior\nUkrainian government official estimated that 10 percent of all computers in the country were\nwiped. The attack even shut down the computers used by scientists at the Chernobyl\ncleanup site, 60 miles north of Kiev. “It was a massive bombing of all our systems,” Omelyan\nsays.\n\n\n-----\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nWhen Derevianko emerged from the restaurant in the early evening, he stopped to refuel his\ncar and found that the gas station’s credit card payment system had been taken out by\nNotPetya too. With no cash in his pockets, he eyed his gas gauge, wondering if he had\nenough fuel to reach his village. Across the country, Ukrainians were asking themselves\nsimilar questions: whether they had enough money for groceries and gas to last through the\nblitz, whether they would receive their paychecks and pensions, whether their prescriptions\nwould be filled. By that night, as the outside world was still debating whether NotPetya was\ncriminal ransom­ware or a weapon of state-sponsored cyberwar, ISSP’s staff had already\nstarted referring to it as a new kind of phenomenon: a “massive, coordinated cyber invasion.”\n\nAmid that epidemic, one single infection would become particularly fateful for Maersk: In an\noffice in Odessa, a port city on Ukraine’s Black Sea coast, a finance executive for Maersk’s\nUkraine operation had asked IT administrators to install the accounting software M.E.Doc on\na single computer. That gave NotPetya the only foothold it needed.\n\nThe shipping terminal in Elizabeth, New Jersey—one of the 76 that make up the portoperations division of Maersk known as APM Terminals—sprawls out into Newark Bay on a\nman-made peninsula covering a full square mile. Tens of thousands of stacked, perfectly\n\n\n-----\n\nmodular shipping containers cover its vast asphalt landscape, and 200-foot-high blue cranes\nloom over the bay. From the top floors of lower Manhattan’s skyscrapers, five miles away,\nthey look like brachiosaurs gathered at a Jurassic-era watering hole.\n\nOn a good day, about 3,000 trucks arrive at the terminal, each assigned to pick up or drop off\ntens of thousands of pounds of everything from diapers to avocados to tractor parts. They\nstart that process, much like airline passengers, by checking in at the terminal’s gate, where\nscanners automatically read their container’s barcodes and a Maersk gate clerk talks to the\ntruck driver via a speaker system. The driver receives a printed pass that tells them where to\npark so that a massive yard crane can haul their container from the truck’s chassis to a stack\nin the cargo yard, where it’s loaded onto a container ship and floated across an ocean—or\nthat entire process in reverse order.\n\nOn the morning of June 27, Pablo Fernández was expecting dozens of trucks’ worth of cargo\nto be shipped out from Elizabeth to a port in the Middle East. Fernández is a so-called freight\nforwarder—a middleman whom cargo owners pay to make sure their property arrives safely\nat a destination halfway around the world. (Fernández is not his real name.)\n\nAt around 9 am New Jersey time, Fernández’s phone started buzzing with a succession of\nscreaming calls from angry cargo owners. All of them had just heard from truck drivers that\ntheir vehicles were stuck outside Maersk’s Elizabeth terminal. “People were jumping up and\ndown,” Fernández says. “They couldn’t get their containers in and out of the gate.”\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\n\n-----\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nThat gate, a choke point to Maersk’s entire New Jersey terminal operation, was dead. The\ngate clerks had gone silent.\n\nSoon, hundreds of 18-wheelers were backed up in a line that stretched for miles outside the\nterminal. One employee at another company’s nearby terminal at the same New Jersey port\nwatched the trucks collect, bumper to bumper, farther than he could see. He’d seen gate\nsystems go down for stretches of 15 minutes or half an hour before. But after a few hours,\nstill with no word from Maersk, the Port Authority put out an alert that the company’s\nElizabeth terminal would be closed for the rest of the day. “That’s when we started to realize,”\nthe nearby terminal’s staffer remembers, “this was an attack.” Police began to approach\ndrivers in their cabs, telling them to turn their massive loads around and clear out.\n\nFernández and countless other frantic Maersk customers faced a set of bleak options: They\ncould try to get their precious cargo onto other ships at premium, last-minute rates, often\ntraveling the equivalent of standby. Or, if their cargo was part of a tight supply chain, like\ncomponents for a factory, Maersk’s outage could mean shelling out for exorbitant air freight\ndelivery or risk stalling manufacturing processes, where a single day of downtime costs\nhundreds of thousands of dollars. Many of the containers, known as reefers, were electrified\nand full of perishable goods that required refrigeration. They’d have to be plugged in\nsomewhere or their contents would rot.\n\nFernández had to scramble to find a New Jersey warehouse where he could stash his\ncustomers’ cargo while he waited for word from Maersk. During the entire first day, he says,\nhe received only one official email, which read like “gibberish,” from a frazzled Maersk\nstaffer’s Gmail account, offering no real explanation of the mounting crisis. The company’s\ncentral booking website, Maerskline.com, was down, and no one at the company was picking\nup their phones. Some of the containers he’d sent on Maersk’s ships that day would remain\nlost in cargo yards and ports around the world for the next three months. “Maersk was like a\nblack hole,” Fernández remembers with a sigh. “It was just a clusterfuck.”\n\nIn fact, it was a clusterfuck of clusterfucks. The same scene was playing out at 17 of\nMaersk’s 76 terminals, from Los Angeles to Algeciras, Spain, to Rotterdam in the\nNetherlands, to Mumbai. Gates were down. Cranes were frozen. Tens of thousands of trucks\nwould be turned away from comatose terminals across the globe.\n\n\n-----\n\nNo new bookings could be made, essentially cutting off Maersk s core source of shipping\nrevenue. The computers on Maersk’s ships weren’t infected. But the terminals’ software,\ndesigned to receive the Electronic Data Interchange files from those ships, which tell terminal\noperators the exact contents of their massive cargo holds, had been entirely wiped away.\nThat left Maersk’s ports with no guide to perform the colossal Jenga game of loading and\nunloading their towering piles of containers.\n\nFor days to come, one of the world’s most complex and interconnected distributed machines,\nunderpinning the circulatory system of the global economy itself, would remain broken. “It\nwas clear this problem was of a magnitude never seen before in global transport,” one\nMaersk customer remembers. “In the history of shipping IT, no one has ever gone through\nsuch a monumental crisis.”\n\nMike McQuade\n\nSeveral days after his screen had gone dark in a corner of Maersk’s office, Henrik Jensen\nwas at home in his Copenhagen apartment, enjoying a brunch of poached eggs, toast, and\nmarmalade. Since he’d walked out of the office the Tuesday before, he hadn’t heard a word\nfrom any of his superiors. Then his phone rang.\n\nWhen he answered, he found himself on a conference call with three Maersk staffers. He\nwas needed, they said, at Maersk’s office in Maidenhead, England, a town west of London\nwhere the conglomerate’s IT overlords, Maersk Group Infrastructure Services, were based.\nThey told him to drop everything and go there. Immediately.\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\n\n-----\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nTwo hours later, Jensen was on a plane to London, then in a car to an eight-story glass-andbrick building in central Maidenhead. When he arrived, he found that the fourth and fifth\nfloors of the building had been converted into a 24/7 emergency operations center. Its\nsingular purpose: to rebuild Maersk’s global network in the wake of its NotPetya meltdown.\n\nSome Maersk staffers, Jensen learned, had been in the recovery center since Tuesday,\nwhen NotPetya first struck. Some had been sleeping in the office, under their desks or in\ncorners of conference rooms. Others seemed to be arriving every minute from other parts of\nthe world, luggage in hand. Maersk had booked practically every hotel room within tens of\nmiles, every bed-and-breakfast, every spare room above a pub. Staffers were subsisting on\nsnacks that someone had piled up in the office kitchen after a trip to a nearby Sainsbury’s\ngrocery store.\n\nThe Maidenhead recovery center was being managed by the consultancy Deloitte. Maersk\nhad essentially given the UK firm a blank check to make its NotPetya problem go away, and\nat any given time as many as 200 Deloitte staffers were stationed in the Maidenhead office,\nalongside up to 400 Maersk personnel. All computer equipment used by Maersk from before\nNotPetya’s outbreak had been confiscated, for fear that it might infect new systems, and\nsigns were posted threatening disciplinary action against anyone who used it. Instead,\nstaffers had gone into every available electronics store in Maidenhead and bought up piles of\nnew laptops and prepaid Wi-Fi hot spots. Jensen, like hundreds of other Maersk IT staffers,\nwas given one of those fresh laptops and told to do his job. “It was very much just ‘Find your\ncorner, get to work, do whatever needs to be done,’ ” he says.\n\nEarly in the operation, the IT staffers rebuilding Maersk’s network came to a sickening\nrealization. They had located backups of almost all of Maersk’s individual servers, dating\nfrom between three and seven days prior to NotPetya’s onset. But no one could find a\nbackup for one crucial layer of the company’s network: its domain controllers, the servers\nthat function as a detailed map of Maersk’s network and set the basic rules that determine\nwhich users are allowed access to which systems.\n\nMaersk’s 150 or so domain controllers were programmed to sync their data with one another,\nso that, in theory, any of them could function as a backup for all the others. But that\ndecentralized backup strategy hadn’t accounted for one scenario: where every domain\ncontroller is wiped simultaneously. “If we can’t recover our domain controllers,” a Maersk IT\nstaffer remembers thinking, “we can’t recover anything.”\n\n\n-----\n\nAfter a frantic global search, the admins finally found one lone surviving domain\ncontroller in a remote office—in Ghana.\n\nAfter a frantic search that entailed calling hundreds of IT admins in data centers around the\nworld, Maersk’s desperate administrators finally found one lone surviving domain controller in\na remote office—in Ghana. At some point before NotPetya struck, a blackout had knocked\nthe Ghanaian machine offline, and the computer remained disconnected from the network. It\nthus contained the singular known copy of the company’s domain controller data left\nuntouched by the malware—all thanks to a power outage. “There were a lot of joyous\nwhoops in the office when we found it,” a Maersk administrator says.\n\nWhen the tense engineers in Maidenhead set up a connection to the Ghana office, however,\nthey found its bandwidth was so thin that it would take days to transmit the several-hundredgigabyte domain controller backup to the UK. Their next idea: put a Ghanaian staffer on the\nnext plane to London. But none of the West African office’s employees had a British visa.\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nSo the Maidenhead operation arranged for a kind of relay race: One staffer from the Ghana\noffice flew to Nigeria to meet another Maersk employee in the airport to hand off the very\nprecious hard drive That staffer then boarded the six-and-a-half-hour flight to Heathrow\n\n\n-----\n\ncarrying the keystone of Maersk s entire recovery process.\n\nWith that rescue operation completed, the Maidenhead office could begin bringing Maersk’s\ncore services back online. After the first days, Maersk’s port operations had regained the\nability to read the ships’ inventory files, so operators were no longer blind to the contents of\nthe hulking, 18,000-container vessels arriving in their harbors. But several days would pass\nafter the initial outage before Maersk started taking orders through Maerskline.com for new\nshipments, and it would be more than a week before terminals around the world started\nfunctioning with any degree of normalcy.\n\nIn the meantime, Maersk staffers worked with whatever tools were still available to them.\nThey taped paper documents to shipping containers at APM ports and took orders via\npersonal Gmail accounts, WhatsApp, and Excel spreadsheets. “I can tell you it’s a fairly\nbizarre experience to find yourself booking 500 shipping containers via WhatsApp, but that’s\nwhat we did,” one Maersk customer says.\n\nAbout two weeks after the attack, Maersk’s network had finally reached a point where the\ncompany could begin reissuing personal computers to the majority of staff. Back at the\nCopenhagen headquarters, a cafeteria in the basement of the building was turned into a\nreinstallation assembly line. Computers were lined up 20 at a time on dining tables as help\ndesk staff walked down the rows, inserting USB drives they’d copied by the dozens, clicking\nthrough prompts for hours.\n\nA few days after his return from Maidenhead, Henrik Jensen found his laptop in an\nalphabetized pile of hundreds, its hard drive wiped, a clean image of Windows installed.\nEverything that he and every other Maersk employee had stored locally on their machines,\nfrom notes to contacts to family photos, was gone.\n\nFive months after Maersk had recovered from its NotPetya attack, Maersk chair Jim\nHagemann Snabe sat onstage at the World Economic Forum meeting in Davos, Switzerland,\nand lauded the “heroic effort” that went into the company’s IT rescue operation. From June\n27, when he was first awakened by a 4 am phone call in California, ahead of a planned\nappearance at a Stanford conference, he said, it took just 10 days for the company to rebuild\nits entire network of 4,000 servers and 45,000 PCs. (Full recovery had taken far longer:\nSome staffers at the Maidenhead operation continued to work day and night for close to two\nmonths to rebuild Maersk’s software setup.) “We overcame the problem with human\nresilience,” Snabe told the crowd.\n\nSince then, Snabe went on, Maersk has worked not only to improve its cybersecurity but also\nto make it a “competitive advantage.” Indeed, in the wake of NotPetya, IT staffers say that\npractically every security feature they’ve asked for has been almost immediately approved.\nMultifactor authentication has been rolled out across the company, along with a long-delayed\nupgrade to Windows 10.\n\n\n-----\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\nideas\n\n[Google Search Is Quietly Damaging Democracy](https://www.wired.com/story/google-search-quietly-damaging-democracy/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nFrancesca Tripodi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nSnabe, however, didn’t say much about the company’s security posture pre-NotPetya.\nMaersk security staffers tell WIRED that some of the corporation’s servers were, up until the\nattack, still running Windows 2000—an operating system so old Microsoft no longer\nsupported it. In 2016, one group of IT executives had pushed for a preemptive security\nredesign of Maersk’s entire global network. They called attention to Maersk’s less-thanperfect software patching, outdated operating systems, and above all insufficient network\nsegmentation. That last vulnerability in particular, they warned, could allow malware with\naccess to one part of the network to spread wildly beyond its initial foothold, exactly as\nNotPetya would the next year.\n\nThe security revamp was green-lit and budgeted. But its success was never made a socalled key performance indicator for Maersk’s most senior IT overseers, so implementing it\nwouldn’t contribute to their bonuses. They never carried the security makeover forward.\n\nFew firms have paid more dearly for dragging their feet on security. In his Davos talk, Snabe\nclaimed that the company suffered only a 20 percent reduction in total shipping volume\nduring its NotPetya outage, thanks to its quick efforts and manual workarounds. But aside\nfrom the company’s lost business and downtime, as well as the cost of rebuilding an entire\n\n\n-----\n\nnetwork, Maersk also reimbursed many of its customers for the expense of rerouting or\nstoring their marooned cargo. One Maersk customer described receiving a seven-figure\ncheck from the company to cover the cost of sending his cargo via last-minute chartered jet.\n“They paid me a cool million with no more than a two-minute discussion,” he says.\n\nOn top of the panic and disruption it caused, NotPetya may have wiped away evidence\nof espionage or even reconnaissance for future sabotage.\n\nAll told, Snabe estimated in his Davos comments, NotPetya cost Maersk between $250\nmillion and $300 million. Most of the staffers WIRED spoke with privately suspected the\ncompany’s accountants had low-balled the figure.\n\nRegardless, those numbers only start to describe the magnitude of the damage. Logistics\ncompanies whose livelihoods depend on Maersk-owned terminals weren’t all treated as well\nduring the outage as Maersk’s customers, for instance. Jeffrey Bader, president of a Port\nNewark–based trucking group, the Association of Bi-State Motor Carriers, estimates that the\nunreimbursed cost for trucking companies and truckers alone is in the tens of millions. “It\nwas a nightmare,” Bader says. “We lost a lot of money, and we’re angry.”\n\nThe wider cost of Maersk’s disruption to the global supply chain as a whole—which depends\non just-in-time delivery of products and manufacturing components—is far harder to\nmeasure. And, of course, Maersk was only one victim. Merck, whose ability to manufacture\nsome drugs was temporarily shut down by NotPetya, told shareholders it lost a staggering\n$870 million due to the malware. FedEx, whose European subsidiary TNT Express was\ncrippled in the attack and required months to recover some data, took a $400 million blow.\nFrench construction giant Saint-Gobain lost around the same amount. Reckitt Benckiser, the\nBritish manufacturer of Durex condoms, lost $129 million, and Mondelēz, the owner of\nchocolate-maker Cadbury, took a $188 million hit. Untold numbers of victims without public\nshareholders counted their losses in secret.\n\nOnly when you start to multiply Maersk’s story—imagining the same paralysis, the same\nserial crises, the same grueling recovery—playing out across dozens of other NotPetya\nvictims and countless other industries does the true scale of Russia’s cyberwar crime begin\nto come into focus.\n\nMost Popular\n\nculture\n\n[A Glimpse of a Future Without White People](https://www.wired.com/story/mohsin-hamid-the-last-white-man/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJason Parham\n\n\n-----\n\nideas\n\n[The Unintended Consequences of OTC Hearing Aids](https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nJaipreet Virdi\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\n“This was a very significant wake-up call,” Snabe said at his Davos panel. Then he added,\nwith a Scandinavian touch of understatement, “You could say, a very expensive one.”\n\nOne week after NotPetya’s outbreak, Ukrainian police dressed in full SWAT camo gear and\narmed with assault rifles poured out of vans and into the modest headquarters of Linkos\nGroup, running up the stairs like SEAL Team Six invading the bin Laden compound.\n\nThey pointed rifles at perplexed employees and lined them up in the hallway, according to\nthe company’s founder, Olesya Linnyk. On the second floor, next to her office, the armored\ncops even smashed open the door to one room with a metal baton, in spite of Linnyk’s offer\nof a key to unlock it. “It was an absurd situation,” Linnyk says after a deep breath of\nexasperation.\n\nThe militarized police squad finally found what it was looking for: the rack of servers that had\nplayed the role of patient zero in the NotPetya plague. They confiscated the offending\nmachines and put them in plastic bags.\n\nEven now, more than a year after the attack’s calamitous spread, cybersecurity experts still\nargue over the mysteries of NotPetya. What were the hackers’ true intentions? The Kiev staff\nof security firm ISSP, including Oleh Derevianko and Oleksii Yasinsky, maintain that the\nattack was intended not merely for destruction but as a cleanup effort. After all, the hackers\nwho launched it first had months of unfettered access to victims’ networks. On top of the\npanic and disruption it caused, NotPetya may have also wiped away evidence of espionage\nor even reconnaissance for future sabotage. Just in May, the US Justice Department and\nUkrainian security services announced that they’d disrupted a Russian operation that had\ninfected half a million internet routers—mostly in Ukraine—with a new form of destructive\nmalware.\n\nWhile many in the security community still see NotPetya’s international victims as collateral\ndamage, Cisco’s Craig Williams argues that Russia knew full well the extent of the pain the\nworm would inflict internationally. That fallout, he argues, was meant to explicitly punish\n\n\n-----\n\nanyone who would dare even to maintain an office inside the borders of Russia s enemy.\n“Anyone who thinks this was accidental is engaged in wishful thinking,” Williams says. “This\nwas a piece of malware designed to send a political message: If you do business in Ukraine,\nbad things are going to happen to you.”\n\nAlmost everyone who has studied NotPetya, however, agrees on one point: that it could\nhappen again or even reoccur on a larger scale. Global corporations are simply too\ninterconnected, information security too complex, attack surfaces too broad to protect\nagainst state-trained hackers bent on releasing the next world-shaking worm. Russia,\nmeanwhile, hardly seems to have been chastened by the US government’s sanctions for\nNotPetya, which arrived a full eight months after the worm hit and whose punishments were\nmuddled with other messages chastising Russia for everything from 2016 election\ndisinformation to hacker probes of the US power grid. “The lack of a proper response has\nbeen almost an invitation to escalate more,” says Thomas Rid, a political science professor\nat Johns Hopkins’ School of Advanced International Studies.\n\nMost Popular\n\ngear\n\n[The 12 Best Electric Bikes for Every Kind of Ride](https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_755c858e-ed38-41bf-8ecc-09717ab68a25_popular4-1-reranked-by-vidi)\n\nAdrienne So\n\nBut the most enduring object lesson of NotPetya may simply be the strange, extra­dimensional landscape of cyberwar’s battlefield. This is the confounding geography of\ncyberwarfare: In ways that still defy human intuition, phantoms inside M.E.Doc’s server room\nin a gritty corner of Kiev spread chaos into the gilded conference rooms of the capital’s\nfederal agencies, into ports dotting the globe, into the stately headquarters of Maersk on the\nCopenhagen harbor, and across the global economy. “Somehow the vulnerability of this\nUkrainian accounting software affects the US national security supply of vaccines and global\nshipping?” asks Joshua Corman, a cybersecurity fellow at the Atlantic Council, as if still\npuzzling out the shape of the wormhole that made that cause-and-effect possible. “The\nphysics of cyberspace are wholly different from every other war domain.”\n\nIn those physics, NotPetya reminds us, distance is no defense. Every barbarian is already at\nevery gate. And the network of entanglements in that ether, which have unified and elevated\nthe world for the past 25 years, can, over a few hours on a summer day, bring it to a crashing\nhalt.\n\n\n-----\n\n**Andy Greenberg** _[(@a_greenberg) is a WIRED senior writer. This story is excerpted from his](https://twitter.com/a_greenberg)_\n_book_ [Sandworm, forthcoming from Doubleday.](https://www.penguinrandomhouse.com/books/597684/sandworm-by-andy-greenberg/)\n\n_This article appears in the September issue._ _[Subscribe now.](https://subscribe.condenastdigital.com/subscribe/splits/wired/WIR_Edit_Hardcoded?source=Edit_Hardcoded)_\n\nMore Great WIRED Stories\n\nSaving lives with tech amid Syria’s [endless civil war](https://www.wired.com/story/syria-civil-war-hala-sentry/?mbid=BottomRelatedStories_Sections_5)\n[Meet the man with a radical plan for blockchain voting](https://www.wired.com/story/santiago-siri-radical-plan-for-blockchain-voting/?mbid=BottomRelatedStories_Sections_5)\n[Why these spiders are wearing face paint and fake lashes](https://www.wired.com/story/spiders-put-on-face-paint-and-fake-eyelashes/?mbid=BottomRelatedStories_Sections_5)\n[Everything about every hero in Avengers: Infinity War](https://www.wired.com/story/avengers-infinity-war-every-hero/?mbid=BottomRelatedStories_Sections_5)\n[How 3-D printing exposes the fallacy of federal gun laws](https://www.wired.com/story/defense-distributed-3d-printing-exposes-fallacy-of-federal-gun-laws/?mbid=BottomRelatedStories_Sections_5)\n[Looking for more? Sign up for our daily newsletter and never miss our latest and](https://www.wired.com/newsletter/?name=daily&sourceCode=BottomStories)\ngreatest stories\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-08-22 - The Untold Story of NotPetya, the Most Devastating Cyberattack in History.pdf"
    ],
    "report_names": [
        "2018-08-22 - The Untold Story of NotPetya, the Most Devastating Cyberattack in History.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536150,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1660794227,
    "ts_modification_date": 1660794227,
    "files": {
        "pdf": "https://archive.orkl.eu/c530150c13410bd73d2219e8bb3b134ed6a8e92b.pdf",
        "text": "https://archive.orkl.eu/c530150c13410bd73d2219e8bb3b134ed6a8e92b.txt",
        "img": "https://archive.orkl.eu/c530150c13410bd73d2219e8bb3b134ed6a8e92b.jpg"
    }
}